{
  "metadata": {
    "timestamp": 1736562997478,
    "page": 617,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "dieulot/instantclick",
      "stars": 5512,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.005859375,
          "content": "build\n"
        },
        {
          "name": "Contributing.md",
          "type": "blob",
          "size": 3.841796875,
          "content": "# Contributing\n\n## Getting support\n\nThere is no dedicated place for support at the moment. Use [Stack Overflow](http://stackoverflow.com/search?q=instantclick) for now. Having an official InstantClick forum is planned.\n\n## Bugs\n\n### Reporting a bug\n\nWhen reporting a bug, ideally you should provide a reduced test case: the minimal amount of code that makes the problem appear.\n\nIf you don’t feel like doing this, it’s okay. A vague bug report is better than no bug report at all.\n\n### Fixing a bug\n\nIf you went the extra mile and fixed a bug, open a pull request.\n\nIn doing so, please emulate the code’s conventions (no [unnecessary semicolons](http://mislav.uniqpath.com/2010/05/semicolons/), two spaces for tabs, etc.) and only commit the changes that are relevant to the fix (with [`git add -a <file>`](http://stackoverflow.com/a/1085191/921889)). If you’ve already committed a “dirty” commit, use `git reset --soft HEAD~1` to [undo](http://stackoverflow.com/q/927358/921889) and start again.\n\nIf you have trouble following those instructions, contribute your pull request anyway. A bugfix that can’t get easily merged is better than no bugfix.\n\n## New features/enhancements\n\nCheck out [already suggested enhancements](https://github.com/dieulot/instantclick/issues?q=label%3AEnhancement). If you have something else in mind open a new issue.\n\nPull requests for new features/enhancements won’t get merged because the code is the tiniest part of a new feature. There’s ease of use, documentation, marketing and maintainability to take into account *before* coding anything. Delegating the programming of new features to the community would make things slower.\n\nIf your idea is best represented by code than by words alone, you can still open a pull request (which will be closed) and link to it in an issue.\n\n## Documentation\n\nIf you’ve spotted a typo, a non-idiomatic sentence, an unclear sentence (or just anything that may hinder understanding) on the website, open an issue or a pull request in the [instantclick-website repo](https://github.com/dieulot/instantclick-website).\n\n30% of InstantClick users don’t have English as their first language, if you see a word (or even a sentence) that can be replaced with a simpler one without losing meaning, please contribute it!\n\nContributing to documentation for more substantial things is a pain (and will probably always be due to a lack of priority, I deem documentation critical enough that I plan to do all the big things (such as the onboarding process, for instance) by myself), so it’s totally okay if you don’t want to wrap your head around how to make a pull request. Just open an issue and dump all your texts there. Yes, it’s messy, but there’s no good alternative at the moment.\n\nOfficial translations of the documentation will be organized when InstantClick is close to being feature-complete, because the efforts to keep the documentation synchronized in multiple languages aren’t worth it for now.\n\n### The contributing experience\n\nIf something wasn’t clear for you (whether it is rationally justified or not) when you tried to contribute, please talk about it. Put it at the end of your issue, or open another issue for it. Removing friction in a process (here, contributing to the project) is useful; don’t be afraid to look like a dummy, you won’t.\n\nMore generally, anything that you feel would improve the project is welcome, even if it’s very small and/or there’s no formal process to contribute it.\n\n## About the pull requests and bugs languishing\n\nI have been slacking quite a bit this past year (as of February 2015) on this project. Sorry about that. I have an awful lot of things planned for InstantClick and all my todos/ideas (I have hundreds) were disseminated in multiple digital places, then I didn’t know where to start anymore. It’s all in my Trello now, I hope this will resolve the slacking problem.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0634765625,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2014-2017 Alexandre Dieulot\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\nthe Software, and to permit persons to whom the Software is furnished to do so,\nsubject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\nCOPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\nIN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
        },
        {
          "name": "ReadMe.md",
          "type": "blob",
          "size": 0.6513671875,
          "content": "# [InstantClick](http://instantclick.io/)\n\nAll the informations you need to use InstantClick are on the link above. This ReadMe’s purpose is about how to use and contribute to a development version of InstantClick.\n\n## Tests\n\nTests (in the `tests` folder) are PHP-generated HTML pages with which to check how InstantClick behaves on different browsers. That’s what I use before releasing a new version to make sure there are no obvious regressions.\n\nTo access the suite of tests, run `php -S 127.0.0.1:8000` from the `tests` folder and head to [http://127.0.0.1:8000/](http://127.0.0.1:8000/).\n\n## [Contributing](Contributing.md)\n\nSee the `Contributing.md` file.\n"
        },
        {
          "name": "bower.json",
          "type": "blob",
          "size": 0.2412109375,
          "content": "{\n  \"name\": \"instantclick\",\n  \"description\": \"InstantClick makes following links in your website instant.\",\n  \"main\": [\n    \"./src/instantclick.js\"\n  ],\n  \"license\": \"MIT\",\n  \"keywords\": [\n    \"pjax\"\n  ],\n  \"homepage\": \"http://instantclick.io/\"\n}\n"
        },
        {
          "name": "makefile",
          "type": "blob",
          "size": 0.537109375,
          "content": "all:\n\t@mkdir -p build\n\t@head -1 src/instantclick.js > build/min.head.js\n\t@cat src/instantclick.js src/loading-indicator.js > build/cat.js\n\t@curl --silent --data \"output_info=compiled_code\" --data-urlencode \"js_code@build/cat.js\" \"http://closure-compiler.appspot.com/compile\" -o build/min.code.js\n\t@cat build/min.head.js build/min.code.js > build/instantclick.min.js\n\t@rm build/cat.js build/min.head.js build/min.code.js\n\t@gzip build/instantclick.min.js\n\t@du -b build/instantclick.min.js.gz\n\t@gunzip build/instantclick.min.js.gz\n\nclean:\n\t@rm -r build\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}