{
  "metadata": {
    "timestamp": 1736562954810,
    "page": 560,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "jsdelivr/jsdelivr",
      "stars": 5725,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.033203125,
          "content": " *.* linguist-language=JavaScript\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0068359375,
          "content": ".idea/\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.060546875,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2014-2017 Dmitriy Akulov\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "Privacy Policy.md",
          "type": "blob",
          "size": 9.6826171875,
          "content": "# Privacy Policy\n\n*Effective date: November 23, 2023*\n\nVolentio JSD Limited (\"us\", \"we\", or \"our\"), a company registered in England and Wales, operates the cdn.jsdelivr.net service (\"jsDelivr CDN\")) and the *jsdelivr.com* website (\"Website\") (collectively, the Services).\n\nWhen we collect, use, and process personal data, we are subject to the provisions of the UK General Data Protection Regulation (UK GDPR) and the Data Protection Act 2018. We are also subject to the EU General Data Protection Regulation (EU GDPR) in relation to personal data we collect, use, and process in the European Economic Area (EEA).\n\nThis Privacy Policy informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Services and the choices you have associated with that data.\n\nThis Privacy Policy does not apply to personal data we process as a service provider or data processor on behalf of enterprise or business users of the Services. Our data processing activities as service provider or data processor is governed by our [Data Processing Agreement](https://www.jsdelivr.com/documents/data-processing-agreement.pdf). If you are an end-user of one of those organizations, such as an employee or student, you should read that organization's privacy statement and direct any privacy inquiries to that organization.\n\nBy using our Services, you agree to the collection and use of information in accordance with this policy.\n\nOur Service may contain links to other sites that are not operated by us. If you click on a third-party link, you will be directed to that third-party's site. We strongly advise you to review the Privacy Policy of every site you visit. We have no control over and assume no responsibility for the content, privacy policies, or practices of any third-party sites or services.\n\n## 1. In this policy:\n\n1. **personal data:** has the meaning given to it by the UK and/or EU GDPR and means any information relating to an identified or identifiable individual (known as a data subject);\n\n2. **processing:** means any operation or actions performed on personal data; for example, collection, recording, organization, structuring, storing, altering, deleting, or otherwise using personal data;\n\n3. **we, us and our:** refers to Volentio JSD Limited and its directors;\n\n4. **you and your:** refers to the person who is accessing the Website or jsDelivr CDN and whose data is processed.\n\n## 2. Information Collection\n\n1. We collect the following types of information depending on which one of our Services you use or access:\n\n   1. Usage Data jsDelivr CDN\n\n      1. We may collect information how the Service is accessed and used (\"Usage Data\").\n\n      2. This Usage Data may include information such as your computer's Internet Protocol address (e.g., IP address), browser type, browser version, referrer data (limited to domain), the URLs of our Service that you visit (limited to the cdn.jsdelivr.net domain), the time and date of your visit, unique device identifiers and other diagnostic data. We never associate any gathered data with specific users or try to track their usage at any point and in any way.\n\n   2. Usage Data Website\n\n      1. Registration information: We collect information such as your name and contact data, including username and email address, and credentials, such as your password, during account creation.\n\n      2. Contact data: we may collect your email address when you contact us in relation to your use of the Services.\n\n2. Location Data: We do not use or store information about your location.\n\n## 3. Use of Data\n\n1. In general terms, we may use the collected data to:\n\n   1. provide and maintain our Service,\n   2. build public download statistics per project, per file, and per version that you can find on our website and via our API,\n   3. allow you to participate in interactive features of our Services when you choose to do so,\n   4. gather analysis or valuable information so that we can improve our Services,\n   5. monitor the usage of our Services,\n   6. detect, prevent, and address technical issues.\n\n2. Please note that our Service is not intended for use by children, and we do not knowingly collect or use personal information relating to children. If you are a parent or guardian and you are aware that your children have provided us with personal data, please contact us. If we become aware that we have collected personal data from children without verification of parental consent, we take steps to remove that information from our servers.\n\n## 4. Retention of Data\n\n1. We will retain your personal data only for as long as is necessary for the purposes set out in this Privacy Policy.\n\n2. We will retain and use your personal data to the extent necessary to comply with our legal obligations (for example, if we are required to retain your data to comply with applicable laws), resolve disputes, and enforce our legal agreements and policies.\n\n3. We will also retain non-aggregated Usage Data for internal analysis purposes, for example, to detect abuse of our Services. Non-aggregated Usage Data is retained for a shorter period of time until it is analyzed and deleted, except when this data is used to strengthen the security or to improve the functionality of our Service, or we are legally obligated to retain this data for longer time periods.\n\n4. Aggregated Usage Data does not contain any information associated with any single request or user and is stored indefinitely. This data is publicly accessible via [our API](https://github.com/jsdelivr/data.jsdelivr.com#get-package-usage-stats).\n\n## 5. Transfer of Data\n\n1. Your information, including personal data, may be transferred to — and maintained on — computers located outside of your state, province, country, or other governmental jurisdiction where the data protection laws may differ than those from your jurisdiction.\n\n1. We may also need to transfer your personal data to countries that have not been assessed by the Secretary of State, or non-EEA countries that have not been assessed by the European Commission, as providing adequate protection. In such cases, we will always take steps to ensure that, wherever possible, the transfer complies with data protection law, and that your personal data will be secure.\n\n## 6. Security Of Data\n\n1. In order to ensure that your personal data is kept secure, and to prevent there being any breach of confidentiality, we have put in place security measures that are intended to prevent your personal data from being accidentally lost or used, or accessed unlawfully. Access to your personal data is restricted to those with a need to access it, and regard will be had to the need for confidentiality when that personal data is processed.\n\n2. The security of your data is important to us, but remember that no method of transmission over the Internet, or method of electronic storage is 100% secure. While we do our best to protect your personal data, we cannot guarantee its absolute security.\n\n## 7. Cookies\n\n1. Our Services do not use cookies or other similar technologies.\n\n2. \"Do Not Track\" Signals: We do not support Do Not Track (\"DNT\"). Do Not Track is a preference you can set in your web browser to inform websites that you do not want to be tracked.\n\n## 8. Your Rights in relation to your data\n\n1. We take reasonable steps to allow you to correct, amend, delete, or limit the use of your personal data. If you wish to be informed what personal data we hold about you and if you want it to be removed from our systems, please contact us.\n\n2. In certain circumstances, you have the right:\n\n   1. To access and receive a copy of the personal data we hold about you;\n   2. To rectify any personal data held about you that is inaccurate;\n   3. To request restriction of processing of your personal data which enables you to ask us to suspend the processing of your personal data in certain circumstances;\n   4. To object to processing of your personal data in certain circumstances;\n   5. To request the deletion of personal data held about you;\n   6. You have the right to data portability for the information you provide to us. You can request to obtain a copy of your personal data in a commonly used electronic format so that you can manage and move it.\n\n3. Please note that we may ask you to verify your identity before responding to such requests.\n\n## 9. Sharing your data with others\n\n1. We may employ third-party companies and individuals to facilitate our Service (\"Service Providers\"), to provide the Service on our behalf, to perform Service-related services, or to assist us in analyzing how our Service is used.\n\n1. These third parties have access to your personal data only to perform these tasks on our behalf and are obligated not to disclose or use it for any other purpose.\n\n1. Content Delivery: We use third-party Service Providers to serve all of our traffic under the domain cdn.jsdelivr.net. This means all of these providers have access to your IP address and other information sent by your web browser. This information is used for analytics and security purposes. Neither we nor our providers track any individual user.\n\n## 10. CCPA\n\n1. If you are a U.S. resident, we process your personal data in accordance with applicable U.S. state data privacy laws, including the California Consumer Privacy Act (CCPA). We do not sell your personal data. So, we do not offer an opt-out to the sale of personal data.\n\n## 11. Changes To This Privacy Policy\n\n1. We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.\n\n2. You are advised to review this Privacy Policy periodically for any changes. Changes to this Privacy Policy are effective when they are posted on this page.\n\n# 12. Contact Us\n\n1. If you have any questions about this Privacy Policy, please contact us:\n\n    By email: legal@jsdelivr.com\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 17.0810546875,
          "content": "<h1 align=\"center\">jsDelivr - Open Source CDN</h1>\n\n<p align=\"center\">\n  <img src=\"https://www.jsdelivr.com/icon_256x256.png\" alt=\"jsdelivr-logo\" width=\"128px\" height=\"128px\"/>\n  <br>\n  <i>A global super-fast and production-focused CDN, tightly integrated with NPM and GitHub\n    <br> with support for on-the-fly optimizations, ES modules, detailed download stats and more</i>\n  <br>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://www.jsdelivr.com\"><strong>www.jsdelivr.com</strong></a>\n  <br>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/jsdelivr/www.jsdelivr.com\">Website Repo</a>\n  ·\n  <a href=\"https://github.com/jsdelivr/data.jsdelivr.com\">Public API</a>\n  ·\n  <a href=\"https://www.jsdelivr.com/blog/\">Blog</a>\n  ·\n  <a href=\"https://twitter.com/jsdelivr\">@jsDelivr</a>\n  ·\n  <a href=\"https://www.jsdelivr.com/discord\">Discord</a>\n  <br>\n  <br>\n</p>\n<hr>\n\n**We are looking for contributors.** Please check open issues in the above repos if you think you could help, or open a new one if you have an idea you'd like to discuss.\n\njsDelivr is a free CDN for open-source files. We are tightly integrated with Github and npm, allowing us to automatically provide a reliable CDN service to almost every open-source project out there.\n\nWe offer a stable CDN that can be used in production on popular websites with huge amounts of traffic.\nThere are no bandwidth limits or premium features, and it's completely free to use.\n\n\n### [How does it work - A simple infographic](https://www.jsdelivr.com/network/infographic)\n\n\n# Why jsDelivr?\n\n\nReady for production\n--------------------\n\nOur public CDN is built to be used in production by even the largest websites. Everything is optimized and constantly improved to offer all users maximum speed and uptime. Performance is monitored at all times, and we are always looking into new technologies and providers that may further improve our CDN. Downtime, timeouts, or slow responses are simply unacceptable.\n\nWe do everything possible to ensure our CDN will NEVER break any websites, regardless of the use case. If a file is available via our CDN, we assume it's used in production and ensure it will continue to work no matter what.\n\nThis includes dynamic endpoints such as `/npm/`, `/gh/` and `/combine/`. When a file is first accessed, it gets permanently stored in a reliable file system. This means that even if a npm package gets deleted or an existing file gets removed by a developer, jsDelivr will  continue to serve the stored copy forever without breaking any websites or causing any issues.\n\nOn top of that, we also do version fallback. This means that if a file used in version 1.0.1 is no longer available in 1.0.2 and a user requests the non-existent file, we will fall back to the previous 1.0.1 version and serve it instead of failing with a 404 error.\n\n\nMulti-CDN\n---------\n\nUnlike the competition, jsDelivr uses multiple CDN providers, resulting in the best possible uptime and performance. We currently use [CloudFlare][8], and [Fastly][14].\n\nIf a CDN goes down, websites that use jsDelivr won't have any issues because all traffic will be instantly redirected to remaining operational providers.\n\n\nSmart Load Balancing\n--------------------\n\njsDelivr uses real user performance data (also known as RUM) to make its routing decisions. These metrics are gathered from hundreds of websites and are used in our load-balancing algorithm to make accurate decisions for serving content.\n\nAll providers (CDNs and custom servers) are tested millions of times per day by real users from all over the world. Based on this information, jsDelivr knows what provider is the fastest for each user. Each user gets a unique response based on his or her location, ISP, and the providers' uptime in real-time.\n\nThis system also responds immediately to performance degradation and downtime of providers. If a CDN is under a DDoS attack, and its performance drops in some locations, in a matter of seconds, the algorithm will pick up the change and start serving a different provider to all affected users.\n\n\nFailover\n--------\n\nWe have multiple layers of failover to protect our users from any downtime.\n\nWe use 2 DNS providers at the same time. For jsDelivr to go down, both of these companies would have to go down at the same time.\n\nBoth of our DNS providers monitor our load-balanced endpoint, and if they detect problems, they will automatically switch all traffic to a single CDN provider.\n\nOur load balancer monitors the uptime of all CDN providers using both RUM and synthetic data. If any of those detect downtime or performance degradation, that CDN provider will be removed immediately without any impact on our users.\n\nOur origin consists of multiple servers in different data centers. If a server goes down, the CDNs will automatically switch to using the remaining healthy servers.\n\nIn total, we have one of the most resilient systems out there, ready to be used in production by even the biggest companies.\n\nChina\n----------------\n\njsDelivr has multiple locations close to Chinese urban centers to ensure low latency and high performance for all Chinese users.\n\n# Usage Documentation\n\njsDelivr provides mirrors for npm, GitHub, WordPress plugins, and custom endpoints for several other projects with special requirements. If our regular endpoints don't work for your use case, [let us know](mailto:d@jsdelivr.com) and we'll figure something out!\n\nIf you are a package author, check our [tips for package authors](#Publishing-packages) to make using your package as easy as possible.\n\n#### Root endpoint is always `https://cdn.jsdelivr.net`\n\nnpm\n------\n\njsDelivr can instantly serve any file from any npm package in the public registry.\nNew versions pushed to npm are instantly available via our CDN as well. No maintenance is required.\n\nIf a package, version, or file gets removed from npm, then jsDelivr will continue to serve that file from our permanent storage without breaking any websites using it.\n\nWe use a permanent S3 storage to ensure all files remain available even if npm goes down or a package is deleted by its author. Files are fetched directly from npm only the first time or when S3 goes down.\n\n\n##### Load any project hosted on npm:\n\n```\n/npm/package@version/file\n```\n\n##### Load exact version:\n\n```\n/npm/jquery@3.1.0/dist/jquery.min.js\n```\n\n##### Use a version range instead of an exact version:\n\n```\n/npm/jquery@3/dist/jquery.min.js\n/npm/jquery@3.1/dist/jquery.min.js\n```\n---\n**NOTE**\n\nIf you use this feature and a file you requested is not available in the newest version of the package, the link will keep working thanks to our version-fallback feature. We'll continue to serve the file from the older version of the package instead of failing with a 404 error.\n\n---\n\n\n##### Load by tag (Not recommended for production usage):\n\n```\n/npm/jquery@beta/dist/jquery.min.js\n```\n\n##### Omit the version completely or use \"latest\" to load the latest one (not recommended for production usage):\n\n```\n/npm/jquery@latest/dist/jquery.min.js\n/npm/jquery/dist/jquery.min.js\n```\n---\n**NOTE**\nRequesting the latest version (as opposed to \"latest major\" or \"latest minor\") is dangerous because major versions usually come with breaking changes. Only do this if you really know what you are doing.\n\n---\n\n##### Add \".min\" to any JS/CSS/SVG file to get a minified version - if one doesn't exist, we'll generate it for you. All generated files come with source maps and can be easily used during development:\n\n```\n/npm/github-markdown-css@2.4.1/github-markdown.min.css\n```\n---\n**NOTE**\nMinifying a large file can take several seconds. However, we store all generated files in our permanent storage, so this delay only applies to the first few requests.\n\n---\n\n##### Omit the file path to get the [default file](#configuring-a-default-file-in-packagejson). This file is always minified:\n\n```\n/npm/jquery@3.1.0\n/npm/jquery@3\n/npm/jquery\n```\n\n##### Get a directory listing:\n\n```\n/npm/jquery@3.1.0/\n/npm/jquery@3.1.0/dist/\n```\n\nGitHub\n------\nWe recommend using npm for projects that support it for better UX - npm packages are searchable on our website, and package pages show additional useful information, such as descriptions and links to homepages.\n\nWe use a permanent S3 storage to ensure all files remain available even if GitHub goes down or a repository or a release is deleted by its author. Files are fetched directly from GitHub only the first time or when S3 goes down.\n\n##### Load any GitHub release, commit, or branch:\n\n```\n/gh/user/repo@version/file\n```\n\n##### Load exact version:\n\n```\n/gh/jquery/jquery@3.1.0/dist/jquery.min.js\n/gh/jquery/jquery@32b00373b3f42e5cdcb709df53f3b08b7184a944/dist/jquery.min.js\n```\n\n##### Use a version range instead of an exact version (only works with valid [semver versions][15]):\n\n```\n/gh/jquery/jquery@3/dist/jquery.min.js\n/gh/jquery/jquery@3.1/dist/jquery.min.js\n```\n---\n**NOTE**\nIf you use this feature and a file you requested is not available in the newest release, the link will keep working thanks to our version-fallback feature. We'll continue to serve the file from older release instead of failing with a 404 error.\n\n---\n\n##### Omit the version completely or use \"latest\" to load the latest one (only works with valid [semver versions][15]): (not recommended for production usage)\n\n*Falls back to the `master` branch if there are no tagged releases.*\n\n```\n/gh/jquery/jquery@latest/dist/jquery.min.js\n/gh/jquery/jquery/dist/jquery.min.js\n```\n---\n**NOTE**\nRequesting the latest version (as opposed to \"latest major\" or \"latest minor\") is dangerous because major versions usually come with breaking changes. Only do this if you really know what you are doing.\n\n---\n\n\n##### Add \".min\" to any JS/CSS/SVG file to get a minified version - if one doesn't exist, we'll generate it for you. All generated files come with source maps and can be easily used during development:\n\n```\n/gh/jquery/jquery@3.2.1/src/core.min.js\n```\n---\n**NOTE**\nMinifying a large file can take several seconds. However, we store all generated files in our permanent storage, so this delay only applies to the first few requests.\n\n---\n\n##### Get a directory listing:\n\n```\n/gh/jquery/jquery@3.1.0/\n/gh/jquery/jquery@3.1.0/dist/\n```\n\nCombine multiple files\n----------------------\n\nOur combine endpoint allows you to load several files from npm and GitHub endpoints in one request:\n\n```\n/combine/url1,url2,url3\n```\n\nAll features that work for individual files (version ranges, minification, main modules) work here as well. All combined files come with source maps and can be easily used during development.\n\nExamples:\n\n```\n/combine/gh/jquery/jquery@3.1/dist/jquery.min.js,gh/twbs/bootstrap@3.3/dist/js/bootstrap.min.js\n/combine/npm/bootstrap@3.3/dist/css/bootstrap.min.css,npm/bootstrap@3.3/dist/css/bootstrap-theme.min.css\n```\n---\n**NOTE**\nCombining large/many files can take several seconds. However, we store all generated files in our permanent storage, so this delay only applies to the first few requests.\n\n---\n\nPublishing packages\n-------------------\n\nAll packages hosted on npm and tagged releases on GitHub are automatically available on jsDelivr. If you are a package author, here are a few tips to make using your package as easy as possible:\n\n- Use semver for versioning (this is enforced by npm but not by GitHub)\n- If a file listed as `main` in `package.json` isn't meant to be used in a browser, set a [`browser` or `jsdelivr` field](#configuring-a-default-file-in-packagejson)\n- If you distribute minified JS/CSS files, also include source maps for those files\n- If you don't want to provide minified files, it's fine - we'll handle that for you\n\n### Configuring a default file in package.json\n\nFor packages hosted on npm, we support serving \"default\" files with shorter URLs. The default file can be configured by setting one of the following fields in `package.json`, with `jsdelivr` having the highest priority:\n\n1. `jsdelivr`\n2. `browser`\n3. `main`\n\nWe will first attempt to locate a minified version of the file provided here (by removing the extension and looking for the same file `.min.js`). If we can't find one, we will minify ourselves.\n\nBe advised that you must include the file extension in the values, for example:\n\n```\n\"main\": \"./index\" // this will NOT work\n\"main\": \"./index.js\" // this is the correct way\n```\n\nFor projects having both a JS and a CSS file, use one the above fields for JS and a `style` field for the CSS file ([example](https://cdn.jsdelivr.net/npm/bootstrap@5.3.2/package.json)).\n\nRestrictions\n-------------------\n- Packages larger than 150 MB or single files larger than 20 MB (in the case of GitHub) are not supported by default. We recommend removing files that are not needed from your package when possible. If you need to set a higher limit for your package, open an issue in this repo.\n- HTML files are served with `Content-Type: text/plain` for security reasons.\n\nWordPress\n---------\n\nOur WordPress endpoint works for plugins and themes hosted in the [WordPress.org plugin directory](https://WordPress.org/plugins) and [Wordpress.org theme directory](https://wordpress.org/themes/), and mirrors [the WordPress.org plugins SVN repo](https://plugins.svn.wordpress.org/).\n\n##### Load any plugin from the WordPress.org plugins SVN repo:\n```\n/wp/project/tags/version/file\n```\n\n##### Load exact version:\n\n```\n/wp/wp-slimstat/tags/4.6.5/wp-slimstat.js\n```\n\n##### Load the latest version (not recommended for production usage):\n\n```\n/wp/wp-slimstat/trunk/wp-slimstat.js\n```\n\n#####  Load any theme from the WordPress.org themes SVN repo:\n```\nhttps://cdn.jsdelivr.net/wp/themes/project/version/file\n```\n\n##### Load an exact version of a file:\n\n```\nhttps://cdn.jsdelivr.net/wp/themes/twenty-eightteen/1.7/assets/js/html5.js\n```\n\n##### Add \".min\" to any JS/CSS file to get a minified version - if one doesn't exist, we'll generate it for you. All generated files come with source maps and can be easily used during development:\n\n```\nhttps://cdn.jsdelivr.net/wp/themes/twenty-eightteen/1.7/assets/js/html5.min.js\n```\n\nCaching\n---\nOur caching logic and headers are optimized for production use and apply to all non-custom endpoints.\n\n* **Static Versions and commit hashes** - Effectively forever. The caching headers are set for 1 year but we also permanently cache the files in our S3 storage. So all future requests that bypass the CDN will hit our S3 storage with no option or way to update the contents of that file.\n* **Version aliasing** - 7 days. This also includes `latest` versions. They are cached on our CDN for 7 days with the option to purge the cache using our API to speed up the release of your project to your users.\n* **Branches** - 12 hours.\n\nIn certain cases, purgeable files can get updated faster due to low-cache hit ratio or forced CDN purge from our side for maintenance reasons.\n\nWe use permanent S3 caching even with dynamic URLs, such as version aliasing, meaning once we download your tagged files, there is no way for you to update them. If there is a critical issue in your latest release the best course of action is to tag a new semver valid release with the fix and purge the CDN URLs using our purge API.\n\n\nPurge cache\n---\n\njsDelivr has an easy-to-use API to purge files from the cache and force the files to update. This is useful when you release a new version and want to force the update of all version-aliased users.\n\nPlease note:\n* It will not work for static files as explained above.\n* Valid semver releases must be used for purge to work\n* Rate-limiting applies to all users\n\nTo avoid abuse, access to purge is given after an email request (for now - d@jsdelivr.com).\n\nCustom CDN Hosting\n---\n\nWe can work together and set up a custom configuration for your project. This way, you can have full control over your files and the ability to utilize the full power of jsDelivr.\n\nThis kind of custom hosting can be suitable for:\n\n* Binary hosting. Windows executable files and zips.\n* Frequently updated files.\n* Projects that can't follow jsDelivr file structure.\n* Some other use that will blow all of our minds.\n\nSimply send an email to d@jsdelivr.com with a request for more information.\n\nCurrent OSS projects using custom configs:\n\n* [webjars](http://www.webjars.org/)\n* webpack [webpackbin](https://www.webpackbin.com/) and [codesandbox](https://codesandbox.io/)\n* [emojione.com](https://www.emojione.com/)\n* [hex.pm](https://hex.pm/)\n\n\nPrivacy Policy\n---\n\n#### cdn.jsdelivr.net\n\njsDelivr might use information about downloaded files to build download stats per project and per file.\n\njsDelivr does not store any user data and does not track any users in any way.\n\nHere are the relevant policies of our CDN providers:\n* [Cloudflare](https://www.cloudflare.com/security-policy/)\n* [Fastly](https://www.fastly.com/privacy/)\n\n\n## [The bus factor](https://github.com/jsdelivr/jsdelivr/wiki/What-to-do-if-I-die-aka-The-bus-factor)\n\n[1]: http://www.jsdelivr.com\n[2]: https://github.com/jimaek/jsdelivr/blob/master/files/abaaso/info.ini\n[3]: http://refresh-sf.com/yui/\n[4]: http://blog.maxcdn.com/load-balancing-multiple-cdns-jsdelivr-works/\n[5]: http://www.cdnperf.com/\n[6]: http://en.wikipedia.org/wiki/Content_delivery_network\n[7]: https://www.stackpath.com/\n[8]: http://www.cloudflare.com/\n[9]: https://github.com/jsdelivr/jsdelivr/fork\n[11]: https://hacks.mozilla.org/2014/03/jsdelivr-the-advanced-open-source-public-cdn/\n[12]: https://gitter.im/jsdelivr/jsdelivr\n[14]: https://www.fastly.com/\n[15]: https://semver.org/\n"
        },
        {
          "name": "Sub-Processors.md",
          "type": "blob",
          "size": 0.9248046875,
          "content": "# Sub-Processors\n\nWe use third-party services to serve all of our jsDelivr CDN traffic. This means all of these providers have access to your IP address and other information sent by your web browser. This information is used for analytics and security purposes. Neither we nor our providers track any individual user.\n\n#### Cloudflare\nFor more information on the privacy practices of Cloudflare,\nplease visit the following web page:<br>\nhttps://www.cloudflare.com/security-policy/\n\n#### Fastly\nFor more information on the privacy practices of Fastly,\nplease visit the following web page:<br>\nhttps://www.fastly.com/privacy\n\n#### Gcore\nFor more information on the privacy practices of Gcore,\nplease visit the following web page:<br>\nhttps://gcore.com/legal\n\n#### Bunny (Limited to legacy bootstrapcdn.com CDN endpoints)\nFor more information on the privacy practices of Bunny CDN,\nplease visit the following web page:<br>\nhttps://bunny.net/privacy\n"
        },
        {
          "name": "Terms of Use.md",
          "type": "blob",
          "size": 8.072265625,
          "content": "# Terms of Use\n\n*Effective date: November 23, 2023*\n\nWe are Volentio JSD Limited (\"us\", \"we\", or \"our\") (trading as jsDelivr), a company registered in England and Wales under company registration number 14984373. Our registered office is at Suite 2a1, Northside House, Mount Pleasant, Barnet, England, EN4 9EB.\n\nWe operate the *jsdelivr.com* website (the \"Website\") and the CDN service (\"jsDelivr CDN\").\nFor the purposes of these Terms, (i) “Website” refers to *jsdelivr.com* and (ii) “jsDelivr CDN” refers to *cdn.jsdelivr.net*, our CDN service that is publicly available without a subscription (“the Services”).\n\nPlease read these Terms carefully, that together with our [Privacy Policy](https://www.jsdelivr.com/terms/privacy-policy), govern your use of the Website and jsDelivr CDN.\nBy using the Website or jsDelivr CDN, you confirm that you accept these Terms and that you agree to comply with them.\nIf you do not agree to these Terms, you must not use our Services.\n\n## 1. Permitted Use and Third-Party Websites\n\njsDelivr CDN works as a Content Delivery Network for content already stored on npm, GitHub, and other third-party services. These platforms are not operated by us, and each of them has its own terms of use. Any content accessed via jsDelivr CDN must conform to the terms of the service from which it was retrieved. For example, when you use jsDelivr CDN to access GitHub, the content must conform to all GitHub's policies. Additionally, any content accessed via the jsDelivr CDN must conform to our own policies as described in this document.\n\nAs long as you do not violate our rules:\n- using jsDelivr CDN is free for both personal and commercial use,\n- there are no limits on bandwidth or number of requests,\n- we will provide a reasonable level of support via GitHub issues and email for urgent and private matters.\n\n## 2. Data Processing\n\nWhere we are processing personal data as a service provider or on behalf of enterprise or business users of jsDelivr CDN, we will process, transmit, and store personal data present in our jsDelivr CDN in accordance with the [Data Processing Agreement](https://www.jsdelivr.com/documents/data-processing-agreement.pdf).\n\n## 3. Proprietary Rights\n\nVolentio JSD and our licensors, vendors, and agents retain ownership of all intellectual property rights of any kind related to the Website and jsDelivr CDN. We reserve all rights that are not expressly granted to you under these Terms or by law, including all rights in relation to the look and feel of the Website and jsDelivr CDN. You may not duplicate, copy, or reuse any portion of the Website, jsDelivr CDN, or visual design elements or concepts without express written permission from Volentio JSD.\n\n## 4. Hard Limits and Restrictions (jsDelivr CDN)\n\nTo maintain the performance and security of jsDelivr CDN, we have various limits and restrictions in place. These may include but are not limited to:\n- maximum size of a single file,\n- maximum number of files in a single package,\n- maximum size of a single package,\n- blocking of certain file extensions.\n\nWhen requesting a resource that does not meet these limits, you will get an error response indicating the reason. The limits are set considerably higher than needed for most projects and may be further increased or removed for legitimate projects on request.\n\n## 5. Soft Limits and Recommendations (jsDelivr CDN)\n\nThese limits are not automatically enforced by us, but you agree not to exceed them.\n\n1. For projects using our GitHub proxy:\n   - We recommend that the number of actively accessed files per repository does not exceed 10 000. If you have considerably more files, a custom proxy endpoint for your project may be a better fit.\n   - The soft limit for the number of files per repository is 100 000.\n\nThese recommendations are not automatically enforced by our Service but may indicate whether a project falls within the Permitted or the Prohibited use when it is not immediately clear. We recommend that each project:\n- has a meaningful name,\n- has public documentation and an appropriate license that allows use by other people,\n- in case of npm packages, links to a public source code repository,\n- does not contain intentionally obfuscated code.\n\n## 6. Prohibited Use (jsDelivr CDN)\n\nThe following behavior is prohibited in connection to your use or access of jsDelivr CDN:\n\n1. Hosting or accessing content that:\n   - contains malware or harmful code in any form,\n   - violates proprietary rights of others,\n   - is sexually explicit,\n   - is unlawful or prohibited by these Terms.\n\n2. Abusing the Service and its resources or using jsDelivr CDN as a general-purpose file or media hosting service. This includes, for example, in the case of jsDelivr CDN:\n   - running an image hosting website and using jsDelivr CDN as a storage for all uploaded images,\n   - hosting videos, file backups, or other files in large quantities.\n\n   We recognize that there are legitimate projects that consist of a large number of files, and these are not considered abuse. For example: icons packs, apps, or games with a large number of assets.\n\n3. Trying to bypass our limits or restrictions in any way. We will be happy to remove limits or provide custom solutions for legitimate projects.\n\n## 7. Indemnity\n\nYou agree that you will be responsible for your use of the Website and jsDelivr CDN, and you agree to defend, indemnify, and hold us and our officers, directors, employees, consultants, affiliates, subsidiaries and agents from and against any and all claims, liabilities, damages, losses, and expenses, including reasonable attorneys' fees and costs, arising out of or in any way connected with (i) your access to, use of, or alleged use of the Website or jsDelivr CDN; (ii) your violation of these Terms or any representation, warranty, or agreements referenced herein, or any applicable law or regulation; (iii) your violation of any third-party right, including without limitation any intellectual property right, publicity, confidentiality, property or privacy right; or (iv) any disputes or issues between you and any third party.\n\nWe reserve the right, at our own expense, to assume the exclusive defense and control of any matter otherwise subject to indemnification by you (and without limiting your indemnification obligations with respect to such matter), and in such case, you agree to cooperate with our defense of such claim.\n\n## 8. We may make changes to these terms\n\nWe amend these terms from time to time. Every time you wish to use our site, please check these terms to ensure you understand the terms that apply at that time.\n\n## 9. We may make changes to our Website\n\nWe may update and change our Website from time to time to reflect changes to our products, our users' needs, and our business priorities or for any other reason.\n\n## 10. We may suspend or withdraw our site\n\nWe may withdraw or restrict the availability of all or any part of jsDelivr CDN for business and operational reasons or where your use of jsDelivr CDN violates or breaches these Terms.\nYou are also responsible for ensuring that all persons who access jsDelivr CDN through your internet connection are aware of these Terms of Use and other applicable terms and conditions, and that they comply with them.\n\n## 11. No warranties\n\nWe do not guarantee that jsDelivr CDN, or any content on it, will always be available or uninterrupted.\n\n## 12. Limitation of Liability\n\nIn no event will the Volentio JSD be liable to you or any third party for any direct, indirect, incidental, special, consequential, or punitive damages arising out of or relating to your access to or use of, or your inability to access or use, the Website or jsDelivr CDN or any materials or content on the Website or jsDelivr CDN, whether based on warranty, contract, tort (including negligence), statute, or any other legal theory, whether or not Volentio JSD has been informed of the possibility of such damage.\n\n## 13. Governing Law and Jurisdiction\n\nThe laws of England and Wales apply to these Terms, and any disputes will be subject to the exclusive jurisdiction of the courts of England and Wales.\n\n## 14. Contact Us\n\nIf you have any questions about these Terms, please contact us:\n\nBy email: legal@jsdelivr.com\n"
        }
      ]
    }
  ]
}