{
  "metadata": {
    "timestamp": 1736708903548,
    "page": 142,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "kekingcn/kkFileView",
      "stars": 11068,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.140625,
          "content": "*.css linguist-language=java\n*.less linguist-language=java\n*.js linguist-language=java\n*.html linguist-language=java\n*.* linguist-language=java\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.32421875,
          "content": "target/\n!.mvn/wrapper/maven-wrapper.jar\n\n### STS ###\n.apt_generated\n.classpath\n.factorypath\n.project\n.settings\n.springBeans\n\n### IntelliJ IDEA ###\n.idea\n*.iws\n*.iml\n*.ipr\n\n### NetBeans ###\nnbproject/private/\nnbbuild/\ndist/\nnbdist/\n.nb-gradle/\n/*.iml\n\n### VS Code ###\n.vscode/\n.DS_Store\n\nserver/src/main/cache/\nserver/src/main/file/\n"
        },
        {
          "name": ".workflow",
          "type": "tree",
          "content": null
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.3212890625,
          "content": "FROM keking/kkfileview-base:4.4.0\nADD server/target/kkFileView-*.tar.gz /opt/\nENV KKFILEVIEW_BIN_FOLDER=/opt/kkFileView-4.4.0-beta/bin\nENTRYPOINT [\"java\",\"-Dfile.encoding=UTF-8\",\"-Dspring.config.location=/opt/kkFileView-4.4.0-beta/config/application.properties\",\"-jar\",\"/opt/kkFileView-4.4.0-beta/bin/kkFileView-4.4.0-beta.jar\"]\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.cn.md",
          "type": "blob",
          "size": 18.3759765625,
          "content": "# kkFileView\n文档在线预览项目解决方案，项目使用流行的spring boot搭建，易上手和部署。万能的文件预览开源项目，基本支持主流文档格式预览，如：\n1. 支持 doc, docx, xls, xlsx, xlsm, ppt, pptx, csv, tsv, dotm, xlt, xltm, dot, dotx,xlam, xla ,pages 等 Office 办公文档\n2. 支持 wps, dps, et, ett, wpt 等国产 WPS Office 办公文档\n3. 支持 odt, ods, ots, odp, otp, six, ott, fodt, fods 等OpenOffice、LibreOffice 办公文档\n4. 支持 vsd, vsdx 等 Visio 流程图文件\n5. 支持 wmf, emf 等 Windows 系统图像文件\n6. 支持 psd ,eps 等 Photoshop 软件模型文件\n7. 支持 pdf ,ofd, rtf 等文档\n8. 支持 xmind 软件模型文件\n9. 支持 bpmn 工作流文件\n10. 支持 eml 邮件文件\n11. 支持 epub 图书文档\n12. 支持 obj, 3ds, stl, ply, gltf, glb, off, 3dm, fbx, dae, wrl, 3mf, ifc, brep, step, iges, fcstd, bim 等 3D 模型文件\n13. 支持 dwg, dxf, dwf, iges , igs, dwt, dng, ifc, dwfx, stl, cf2, plt 等 CAD 模型文件\n14. 支持 txt, xml(渲染), xbrl(渲染), md(渲染), java, php, py, js, css 等所有纯文本\n15. 支持 zip, rar, jar, tar, gzip, 7z 等压缩包\n16. 支持 jpg, jpeg, png, gif, bmp, ico, jfif, webp 等图片预览（翻转，缩放，镜像）\n17. 支持 tif, tiff 图信息模型文件\n18. 支持 tga 图像格式文件\n19. 支持 svg 矢量图像格式文件\n20. 支持 mp3,wav,mp4,flv 等音视频格式文件\n21. 支持 avi,mov,rm,webm,ts,rm,mkv,mpeg,ogg,mpg,rmvb,wmv,3gp,ts,swf 等视频格式转码预览\n22. 支持 dcm 等医疗数位影像预览\n23. 支持 drawio 绘图预览\n\n> 基于当前良好的架构模式，支持的文件类型在进一步丰富中\n### 项目特性\n\n- 使用 spring-boot 开发，预览服务搭建部署非常简便\n- rest 接口提供服务，跨语言、跨平台特性(java,php,python,go,php，....)都支持，应用接入简单方便\n- 抽象预览服务接口，方便二次开发，非常方便添加其他类型文件预览支持\n- 最最重要 Apache 协议开源，代码 pull 下来想干嘛就干嘛\n\n### 官网及文档\n\n地址：[https://kkview.cn](https://kkview.cn/)\n\n### 在线体验\n> 请善待公共服务，会不定时停用\n\n地址：[https://file.kkview.cn](https://file.kkview.cn)\n\n### 项目文档（Project documentation）\n1. 详细使用文档：https://kkview.cn/zh-cn/docs/home.html\n\n### 联系我们，加入组织\n> 我们会用心回答解决大家在项目使用中的问题，也请大家在提问前至少 Google 或 baidu 过，珍爱生命远离无效的交流沟通\n\n<img src=\"./doc/gitee星球.png/\" width=\"60%\">\n\n### 文档预览效果\n#### 1. 文本预览\n支持所有类型的文本文档预览， 由于文本文档类型过多，无法全部枚举，默认开启的类型如下 txt,html,htm,asp,jsp,xml,xbrl,json,properties,md,gitignore,log,java,py,c,cpp,sql,sh,bat,m,bas,prg,cmd  \n文本预览效果如下  \n![文本预览效果如下](https://kkview.cn/img/preview/preview-text.png)      \n\n#### 2. 图片预览\n支持jpg，jpeg，png，gif等图片预览（翻转，缩放，镜像），预览效果如下  \n![图片预览](https://kkview.cn/img/preview/preview-image.png)  \n\n#### 3. word文档预览\n支持doc，docx文档预览，word预览有两种模式：一种是每页word转为图片预览，另一种是整个word文档转成pdf，再预览pdf。两种模式的适用场景如下  \n* 图片预览：word文件大，前台加载整个pdf过慢\n* pdf预览：内网访问，加载pdf快\n图片预览模式预览效果如下  \n![word文档预览1](https://kkview.cn/img/preview/preview-doc-image.png)  \npdf预览模式预览效果如下  \n![word文档预览2](https://kkview.cn/img/preview/preview-doc-pdf.png)  \n\n#### 4. ppt文档预览\n支持ppt，pptx文档预览，和word文档一样，有两种预览模式  \n图片预览模式预览效果如下  \n![ppt文档预览1](https://kkview.cn/img/preview/preview-ppt-image.png)  \npdf预览模式预览效果如下  \n![ppt文档预览2](https://kkview.cn/img/preview/preview-ppt-pdf.png)  \n\n#### 5. pdf文档预览\n支持pdf文档预览，和word文档一样，有两种预览模式   \n图片预览模式预览效果如下  \n![pdf文档预览1](https://kkview.cn/img/preview/preview-pdf-image.png)  \npdf预览模式预览效果如下   \n![pdf文档预览2](https://kkview.cn/img/preview/preview-pdf-pdf.png)    \n\n#### 6. excel文档预览\n支持xls，xlsx文档预览，预览效果如下  \n![excel文档预览](https://kkview.cn/img/preview/preview-xls.png)  \n\n#### 7. 压缩文件预览\n支持zip,rar,jar,tar,gzip等压缩包，预览效果如下  \n![压缩文件预览1](https://kkview.cn/img/preview/preview-zip.png)  \n可点击压缩包中的文件名，直接预览文件，预览效果如下  \n![压缩文件预览2](https://kkview.cn/img/preview/preview-zip-inner.png)  \n\n#### 8. 多媒体文件预览\n理论上支持所有的视频、音频文件，由于无法枚举所有文件格式，默认开启的类型如下  \nmp3,wav,mp4,flv  \n视频预览效果如下  \n![多媒体文件预览1](https://kkview.cn/img/preview/preview-video.png)  \n音频预览效果如下  \n![多媒体文件预览2](https://kkview.cn/img/preview/preview-audio.png)  \n\n#### 9. CAD文档预览\n支持CAD dwg文档预览，和word文档一样，有两种预览模式  \n图片预览模式预览效果如下  \n![cad文档预览1](https://kkview.cn/img/preview/preview-cad-image.png)  \npdf预览模式预览效果如下  \n![cad文档预览2](https://kkview.cn/img/preview/preview-cad-pdf.png)  \n考虑说明篇幅原因，就不贴其他格式文件的预览效果了，感兴趣的可以参考下面的实例搭建下\n\n#### 10. Excel文件纯前端渲染效果\n\n![Excel文件纯前端渲染效果](https://kkview.cn/img/preview/preview-xlsx-web.png)  \n\n#### 11. 流程图bpmn文件预览效果\n\n![流程图bpmn文件预览效果](https://kkview.cn/img/preview/preview-bpmn.png)  \n\n#### 12. 3D模型文件预览效果：\n\n![3D模型文件预览效果](https://kkview.cn/img/preview/preview-3ds.png)  \n\n#### 13. dcm医疗数位影像文件预览效果：\n\n![dcm医疗数位影像文件预览效果](https://kkview.cn/img/preview/preview-dcm.png) \n\n#### 14. drawio流程图预览效果：\n\n![dcdrawio流程图预览效果](https://kkview.cn/img/preview/preview-drawio.png) \n\n### 快速开始\n> 项目使用技术\n- spring boot： [spring boot开发参考指南](http://www.kailing.pub/PdfReader/web/viewer.html?file=springboot)\n- freemarker\n- redisson \n- jodconverter\n\n> 依赖外部环境\n- redis (可选，默认不用)\n- OpenOffice 或者 LibreOffice( Windows 下已内置，Linux 脚本启动模式会自动安装，Mac OS 下需要手动安装)\n\n1. 第一步：pull 项目 https://github.com/kekingcn/file-online-preview.git\n\n3. 第二步：运行 ServerMain 的 main 方法，服务启动后，访问 http://localhost:8012/\n会看到如下界面，代表服务启动成功\n   \n![输入图片说明](https://gitee.com/uploads/images/2017/1213/100221_ea15202e_492218.png \"屏幕截图.png\")\n\n### 历史更新记录\n\n#### > 2023年07月05日，v4.3 版本发布 ：\n\n#### 新增功能:\n1. 新增dcm等医疗数位影像预 \n2. 新增drawio绘图预览\n3. 新增开启缓存的情况下重新生成的命令 &forceUpdatedCache=true\n4. 新增dwg CAD文件预览\n5. 新增PDF文件支持密码功能\n6. 新增PDF文件生成图片的dpi自定义配置\n7. 新增删除转换后OFFICE、CAD、TIFF、压缩包源文件配置 默认开启 节约磁盘空间\n8. 新增前端解析xlsx方法\n9. 新增pages,eps, iges , igs, dwt, dng, ifc, dwfx, stl, cf2, plt等格式支持 \n\n#### 优化:\n1. 调整生成的PDF文件 文件名称添加文件后缀 防止生成同名文件\n2. 调整SQL文件预览方式\n3. 优化OFD预览兼容性\n4. 美化TXT文本 分页框的显示\n5. 升级Linux、Docker版内置office为LibreOffice-7.5.3版本\n6. 升级Windows版内置office为LibreOffice-7.5.3 Portable版本\n7. 其他功能优化\n\n#### 修复:\n1. 修复反代情况下压缩包获取路径错误\n2. 修复预览图片的url中如果包含&会导致.click报错\n3. 修复OFD预览部分已知问题\n4. 修复预览压缩包时，如果点击的是文件目录（树节点），页面会报错\n5. 其他已知问题修复\n\n#### > 2023年04月18日，v4.2.1 版本发布 ：\n\n#### 更新日志:\n\n1. 修复 dwg 文件预览报空指针的 bug  \n\n#### > 2023年04月13日，v4.2.0 版本发布 ：\n\n#### 新增功能:\n1. 新增 SVG 格式文件预览支持\n2. 新增加密的 Office 文件预览支持\n3. 新增加密的 zip、rar 等压缩包文件预览支持\n4. 新增 xmind 软件模型文件预览支持\n5. 新增 bpmn 工作流模型文件预览支持\n6. 新增 eml 邮件文件预览支持\n7. 新增 epub 电子书文件预览支持\n8. 新增 dotm,ett,xlt,xltm,wpt,dot,xlam,xla,dotx 等格式的办公文档预览支持\n9. 新增 obj, 3ds, stl, ply, gltf, glb, off, 3dm, fbx, dae, wrl, 3mf, ifc, brep, step, iges, fcstd, bim 等 3D 模型文件预览支持\n10. 新增可配置限制高风险文件上传的功能，比如 exe 文件\n11. 新增可配置站点的备案信息\n12. 新增演示站点删除文件需要密码的功能  \n\n#### 优化:\n1. 文本文档预览加入缓存\n2. 美化 404、500 报错页\n3. 优化发票等 ofd 文件预览的印证渲染兼容性\n4. 移除 office-plugin 模块, 使用新版 jodconverter组件\n5. 优化 Excel 文件的预览效果\n6. 优化 CAD 文件的预览效果\n7. 更新 xstream 、junrar、pdfbox 等依赖的版本\n8. 更新 TIF 文件转换 PDF 的插件，添加转换缓存\n9. 优化演示页 UI 部署\n10. 压缩包文件预览支持目录\n\n#### 修复:\n1. 修复部分接口 XSS 问题\n2. 修复控制台打印的演示地址不跟着 content-path 配置走的问题\n3. 修复 ofd 文件预览跨域问题\n4. 修复内部自签证书 https 协议 url 文件无法下载的问题\n5. 修复特殊符号的文件无法删除的问题\n6. 修复 PDF 转图片,内存无法回收导致的 OOM\n7. 修复 xlsx7.4 以上版本文件预览乱码的问题\n8. 修复 TrustHostFilter 未拦截跨域接口的问题，这是一个安全问题，有使用到 TrustHost 功能的务必升级\n9. 修复压缩包文件预览在 Linux 系统下文件名乱码的问题\n10. 修复 ofd 文件预览页码只能显示10页的问题\n\n#### > 2022年12月14日，v4.1.0 版本发布 ：\n\n1. 全新首页视觉 @wsd7747 \n2. tif图片预览兼容多页tif的pdf转换、jpg转换，以及jpg在线多页预览功能 @zhangzhen1979\n3. 优化docker构建方案，使用分层构建方式 @yl-yue\n4. 实现基于userToken缓存加密文件 @yl-yue\n5. 实现加密word、ppt、excel文件预览 @yl-yue\n6. Linux & Docker镜像升级LibreOffice 7.3\n7. 更新OFD预览组件、更新tif预览组件、更新PPT水印支持\n8. 大量其他升级优化 & 已知问题修复\n\n感谢 @yl-yue @wsd7747 @zhangzhen1979 @tomhusky @shenghuadun @kischn.sun 的代码贡献\n\n#### > 2021年7月6日，v4.0.0 版本发布 ：\n\n1. 底层集成OpenOffice替换为LibreOffice，Office文件兼容性增强，预览效果提升\n2. 修复压缩文件目录穿越漏洞\n3. 修复PPT预览使用PDF模式无效\n4. 修复PPT图片预览模式前端显示异常\n5. 新增功能：首页文件上传功能可通过配置实时开启或禁用\n6. 优化增加Office进程关闭日志\n7. 优化Windows环境下，查找Office组件逻辑(内置的LibreOffice优先)\n8. 优化启动Office进程改同步执行\n\n#### > 2021年6月17日，v3.6.0 版本发布 ：\n\nofd 类型文件支持版本，本次版本重要功能均由社区开发贡献，感谢 @gaoxingzaq、@zhangxiaoxiao9527 的代码贡献\n1. 新增 ofd 类型文件预览支持，ofd 是国产的类似 pdf 格式的文件\n2. 新增了 ffmpeg 视频文件转码预览支持，打开转码功能后，理论上支持所有主流视频的预览，如 rm、rmvb、flv 等\n3. 美化了 ppt、pptx 类型文件预览效果，比之前版本好看太多\n4. 更新了 pdfbox、xstream、common-io 等依赖的版本\n\n#### > 2021年1月28日 ：\n\n2020农历年最后一个版本发布，主要包含了部分 UI 改进，和解决了 QQ 群友、 Issue 里反馈的 Bug 修复，最最重要的是发个新版，过个好年\n\n1. 引入galimatias,解决不规范文件名导致文件下载异常\n2. 更新index接入演示界面UI风格\n3. 更新markdown文件预览UI风格\n4. 更新XML文件预览UI风格，调整类文本预览架构，更方便扩展\n5. 更新simTxT文件预览UI风格\n6. 调整多图连续预览上下翻图的UI\n7. 采用apache-common-io包简化所有的文件下载io操作\n8. XML文件预览支持切换纯文本模式\n9. 增强url base64解码失败时的提示信息\n10. 修复导包错误以及图片预览 bug\n11. 修复发行包运行时找不到日志目录的问题\n12. 修复压缩包内多图连续预览的bug\n13. 修复大小写文件类型后缀没通用匹配的问题\n14. 指定Base64转码采用Apache Commons-code中的实现，修复base64部分jdk版本下出现的异常\n15. 修复类文本类型HTML文件预览的bug\n16. 修复：dwg文件预览时无法在jpg和pdf两种类型之间切换\n17. escaping of dangerous characters to prevent reflected xss\n18. 修复重复编码导致文档转图片预览失败的问题&编码规范\n\n#### > 2020年12月27日 ：\n\n2020年年终大版本更新，架构全面设计，代码全面重构，代码质量全面提升，二次开发更便捷，欢迎拉源码品鉴，提issue、pr共同建设\n\n1. 架构模块调整,大量的代码重构，代码质量提升N个等级，欢迎品鉴\n2. 增强XML文件预览效果，新增XML文档数结构预览\n3. 新增markdown文件预览支持，预览支持md渲染和源文本切换支持\n4. 切换底层web server为jetty，解决这个issue：https://github.com/kekingcn/kkFileView/issues/168\n5. 引入cpdetector，解决文件编码识别问题\n6. url采用base64+urlencode双编码，彻底解决各种奇葩文件名预览问题\n7. 新增配置项office.preview.switch.disabled，控制offic文件预览切换开关\n8. 优化文本类型文件预览逻辑，采用Base64传输内容，避免预览时再次请求文件内容\n9. office预览图片模式禁用图片放大效果，达到图片和pdf预览效果一致的体验\n10. 直接代码静态设置pdfbox兼容低版本jdk，在IDEA中运行也不会有警告提示 \n11. 移除guava、hutool等非必须的工具包，减少代码体积\n12. Office组件加载异步化，提速应用启动速度最快到5秒内\n13. 合理设置预览消费队列的线程数\n14. 修复压缩包里文件再次预览失败的bug\n15. 修复图片预览的bug\n\n#### > 2020年05月20日 ：\n1. 新增支持全局水印，并支持通过参数动态改变水印内容\n2. 新增支持CAD文件预览\n3. 新增base.url配置，支持使用nginx反向代理和使用context-path\n4. 支持所有配置项支持从环境变量里读取，方便Docker镜像部署和集群中大规模使用\n5. 支持配置限信任站点（只能预览来自信任点的文件源），保护预览服务不被滥用\n6. 支持配置自定义缓存清理时间（cron表达式）\n7. 全部能识别的纯文本直接预览，不用再转跳下载，如.md .java .py等\n8. 支持配置限制转换后的PDF文件下载\n9. 优化maven打包配置，解决 .sh 脚本可能出现换行符问题\n10. 将前端所有CDN依赖放到本地，方便没有外网连接的用户使用\n11. 首页评论服务由搜狐畅言切换到Gitalk\n12. 修复url中包含特殊字符可能会引起的预览异常\n13. 修复转换文件队列addTask异常\n14. 修复其他已经问题\n15. 官网建设：[https://kkview.cn](https://kkview.cn/)\n16. 官方Docker镜像仓库建设：[https://hub.docker.com/r/keking/kkfileview](https://hub.docker.com/r/keking/kkfileview)\n\n#### > 2019年06月18日 ：\n1. 支持自动清理缓存及预览文件\n2. 支持http/https下载流url文件预览\n3. 支持FTP url文件预览\n4. 加入Docker构建\n\n#### > 2019年04月08日 ：\n1. 缓存及队列实现抽象，提供JDK和REDIS两种实现(REDIS成为可选依赖)\n2. 打包方式提供zip和tar.gz包，并提供一键启动脚本\n\n#### > 2018年01月19日 ：\n\n1. 大文件入队提前处理\n1. 新增addTask文件转换入队接口 \n1. 采用redis队列，支持kkFIleView接口和异构系统入队两种方式\n\n#### > 2018年01月17日 ：\n\n1. 优化项目结构，抽象文件预览接口，更方便的加入更多的文件类型预览支持，方便二次开发\n1. 新增英文文档说明（@幻幻Fate，@汝辉）贡献\n1. 新增图片预览文件支持类型\n1. 修复压缩包内轮播图片总是从第一张开始的问题\n\n#### > 2018年01月12日 ：\n\n1. 新增多图片同时预览 \n1. 支持压缩包内图片轮番预览\n\n#### > 2018年01月02日 ： \n\n1. 修复txt等文本编码问题导致预览乱码 \n1. 修复项目模块依赖引入不到的问题 \n1. 新增spring boot profile，支持多环境配置 \n1. 引入pdf.js预览doc等文件，支持doc标题生成pdf预览菜单，支持手机端预览\n\n\n### 关于引用\nofd    引用于 [ofdview ](https://gitee.com/cnofd/ofdview ) 开源协议 Apache-2.0  \nCAD    引用于 aspose-cad 测试版本 商用请自行购买  \nxmind  引用于 [ xmind-embed-viewer](https://github.com/xmindltd/xmind-embed-viewer) 开源协议 MIT  \nepub   引用于 [ epub.js](https://github.com/futurepress/epub.js) 开源协议 BSD许可证  \n压缩包 引用于 [sevenzipjbinding](https://github.com/borisbrodski/sevenzipjbinding )开源协议LGPL  \n3D     引用于 [Online3DViewer](https://github.com/kovacsv/Online3DViewer )开源协议MIT  \ndrawio 引用于 [drawio](https://github.com/jgraph/drawio )开源协议 Apache-2.0  \nbpmn流程图     引用于 [bpmn-js](https://github.com/bpmn-io/bpmn-js ) 自定义协议 保留水印 具体自行查看  \ndcm医疗数位影像  引用于 [dcmjs](https://github.com/dcmjs-org/dcmjs )开源协议MIT  \n\n### 使用登记\n如果这个项目解决了你的实际问题，可在 https://gitee.com/kekingcn/file-online-preview/issues/IGSBV\n登记下，如果节省了你的三方预览服务费用，也愿意支持下的话，可点击下方【捐助】请作者喝杯咖啡，也是非常感谢\n\n### Stars\n\n#### GitHub\n\n[![Stargazers over time](https://starchart.cc/kekingcn/kkFileView.svg)](https://starchart.cc/kekingcn/kkFileView)\n\n### 鸣谢\n- 本项目诞生于[凯京集团]，在取得公司高层同意后以 Apache 协议开源出来反哺社区，在此特别感谢凯京集团，以及集团领导[@唐老大](https://github.com/tangshd)的支持、@端木详笑的贡献。\n- 本项目已脱离公司由[KK开源社区]维护发展壮大，感谢所有给 kkFileView 提 Issue 、Pr 开发者\n- 本项目引入的第三方组件已在 '关于引用' 列表列出，感谢这些项目，让 kkFileView 更出色\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.9541015625,
          "content": "# kkFileView\n\n### Introduction\n\nDocument online preview project solution, built using the popular Spring Boot framework for easy setup and deployment. This versatile open source project provides basic support for a wide range of document formats, including:\n\n1. Supports Office documents such as `doc`, `docx`, `xls`, `xlsx`, `xlsm`, `ppt`, `pptx`, `csv`, `tsv`, , `dotm`, `xlt`, `xltm`, `dot`, `xlam`, `dotx`, `xla,` ,`pages` etc.\n2. Supports domestic WPS Office documents such as `wps`, `dps`, `et` , `ett`, ` wpt`.\n3. Supports OpenOffice, LibreOffice office documents such as `odt`, `ods`, `ots`, `odp`, `otp`, `six`, `ott`, `fodt` and `fods`.\n4. Supports Visio flowchart files such as `vsd`, `vsdx`.\n5. Supports Windows system image files such as `wmf`, `emf`.\n6. Supports Photoshop software model files such as `psd` ,`eps`.\n7. Supports document formats like `pdf`, `ofd`, and `rtf`.\n8. Supports software model files like `xmind`. \n9. Support for `bpmn` workflow files.\n10. Support for `eml` mail files\n11. Support for `epub` book documents\n12. Supports 3D model files like `obj`, `3ds`, `stl`, `ply`, `gltf`, `glb`, `off`, `3dm`, `fbx`, `dae`, `wrl`, `3mf`, `ifc`, `brep`, `step`, `iges`, `fcstd`, `bim`, etc.\n13. Supports CAD model files such as `dwg`, `dxf`, `dwf`  `iges` ,` igs`, `dwt` , `dng` , `ifc` , `dwfx` , `stl` , `cf2` , `plt`, etc.\n14. Supports all plain text files such as `txt`, `xml` (rendering), `md` (rendering), `java`, `php`, `py`, `js`, `css`, etc.\n15. Supports compressed packages such as `zip`, `rar`, `jar`, `tar`, `gzip`, `7z`, etc.\n16. Supports image previewing (flip, zoom, mirror) of `jpg`, `jpeg`, `png`, `gif`, `bmp`, `ico`, `jfif`, `webp`, etc.\n17. Supports image information model files such as `tif` and `tiff`.\n18. Supports image format files such as `tga`.\n19. Supports vector image format files such as `svg`.\n20. Supports `mp3`,`wav`,`mp4`,`flv` .\n21. Supports many audio and video format files such as `avi`, `mov`, `wmv`, `mkv`, `3gp`, and `rm`.\n22. Supports for `dcm` .\n23. Supports for `drawio` .\n\n### Features\n- Build with the popular frame spring boot\n- Easy to build and deploy\n- Basically support online preview of mainstream office documents, such as Doc, docx, Excel, PDF, TXT, zip, rar, pictures, etc\n- REST API\n- Abstract file preview interface so that it is easy to extend more file extensions and develop this project on your own\n\n### Official website and DOCS\n\nURL：[https://kkview.cn](https://kkview.cn/)\n\n### Live demo\n> Please treat public service kindly, or this would stop at any time.\n\nURL：[https://file.kkview.cn](https://file.kkview.cn)\n\n### Contact Us\n> We will answer your questions carefully and solve any problems you encounter while using the project. We also kindly ask that you at least Google or Baidu before asking questions in order to save time and avoid ineffective communication. Let's cherish our lives and stay away from ineffective communication.\n\n<img src=\"./doc/github星球.png/\" width=\"50%\">\n\n### Quick Start\n> Technology stack\n- Spring boot： [spring boot Development Reference Guide](http://www.kailing.pub/PdfReader/web/viewer.html?file=springboot)\n- Freemarker\n- Redisson \n- Jodconverter\n> Dependencies\n- Redis(Optional, Unnecessary by default)\n- OpenOffice or LibreOffice(Integrated on Windows, will be installed automatically on Linux, need to be manually installed on Mac OS)\n\n1. First step：`git pull https://github.com/kekingcn/kkFileView.git`\n\n2. second step：Run the main method of `/server/src/main/java/cn/keking/ServerMain.java`. After starting,visit `http://localhost:8012/`.\n\n### Changelog\n> December 14, 2022, version 4.1.0 released:\n\n1. Updated homepage design by @wsd7747.\n2. Compatible with multipage tif for pdf and jpg conversion and multiple page online preview for tif image preview by @zhangzhen1979.\n3. Optimized docker build, using layered build method by @yl-yue.\n4. Implemented file encryption based on userToken cache by @yl-yue.\n5. Implemented preview for encrypted Word, PPT, and Excel files by @yl-yue.\n6. Upgraded Linux & Docker images to LibreOffice 7.3.\n7. Updated OFD preview component, tif preview component, and added support for PPT watermarking.\n8. Numerous other upgrades, optimizations, and bug fixes.\nWe thank @yl-yue, @wsd7747, @zhangzhen1979, @tomhusky, @shenghuadun, and @kischn.sun for their code contributions.\n\n\n> July 6, 2021, version 4.0.0 released:\n\n1. The integration of OpenOffice in the underlying system has been replaced with LibreOffice, resulting in enhanced compatibility and improved preview effects for Office files.\n2. Fixed the directory traversal vulnerability in compressed files.\n3. Fixed the issue where previewing PPT files in PDF mode was ineffective.\n4. Fixed the issue where the front-end display of image preview mode for PPT files was abnormal.\n5. Added a new feature: the file upload function on the homepage can be enabled or disabled in real-time through configuration.\n6. Optimized the logging of Office process shutdown.\n7. Optimized the logic for finding Office components in Windows environment, with built-in LibreOffice taking priority.\n8. Optimized the synchronous execution of starting Office processes.\n\n> June 17, 2021, version 3.6.0 released:\n\nThis version includes support for OFD file type versions, and all the important features in this release were contributed by the community. We thank @gaoxingzaq and @zhangxiaoxiao9527 for their code contributions.\n\n1. Added support for previewing OFD type files. OFD is a domestically produced file format similar to PDF.\n2. Added support for transcoding and previewing video files through ffmpeg. With transcoding enabled, theoretically, all mainstream video file formats such as RM, RMVB, FLV, etc. are supported for preview.\n3. Beautified the preview effect of PPT and PPTX file types, much better looking than the previous version.\n4. Updated the versions of dependencies such as pdfbox, xstream, common-io.\n\n> January 28, 2021:\n\nThe final update of the Lunar New Year 2020 has been released, mainly including some UI improvements, bug fixes reported by QQ group users and issues, and most importantly, it is a new version for a good year.\n\n1. Introduced galimatias to solve the problem of abnormal file download caused by non-standard file names.\n2. Updated UI style of index access demonstration interface.\n3. Updated UI style of markdown file preview.\n4. Updated UI style of XML file preview, adjusted the architecture of text file preview to facilitate expansion.\n5. Updated UI style of simTxT file preview.\n6. Adjusted the UI of continuous preview of multiple images to flip up and down.\n7. Simplified all file download IO operations by adopting the apache-common-io package.\n8. XML file preview supports switching to pure text mode.\n9. Enhanced prompt information when url base64 decoding fails.\n10. Fixed import errors and image preview bug.\n11. Fixed the problem of missing log directory when running the release package.\n12. Fixed the bug of continuous preview of multiple images in the compressed package.\n13. Fixed the problem of no universal matching for file type suffixes in uppercase and lowercase.\n14. Specified the use of the Apache Commons-code implementation for Base64 encoding to fix exceptions occurring in some JDK versions.\n15. Fixed the bug of HTML file preview of text-like files.\n16. Fixed the problem of inability to switch between jpg and pdf when previewing dwg files.\n17. Escaped dangerous characters to prevent reflected xss.\n18. Fixed the problem of duplicate encoding causing the failure of document-to-image preview and standardized the encoding.\n\n> December 27, 2020:\n\nThe year-end major update of 2020 includes comprehensive architecture design, complete code refactoring, significant improvement in code quality, and more convenient secondary development. We welcome you to review the source code and contribute to building by raising issues and pull requests.\n\n1. Adjusted architecture modules, extensively refactored code, and improved code quality by several levels. Please feel free to review.\n2. Enhanced XML file preview effect and added preview of XML document structure.\n3. Added support for markdown file preview, including support for md rendering and switching between source text and preview.\n4. Switched the underlying web server to jetty, resolving the issue: https://github.com/kekingcn/kkFileView/issues/168\n5. Introduced cpdetector to solve the problem of file encoding recognition.\n6. Adopted double encoding with base64 and urlencode for URLs to completely solve preview problems with bizarre file names.\n7. Added configuration item office.preview.switch.disabled to control the switch of office file preview.\n8. Optimized text file preview logic, transmitting content through Base64 to avoid requesting file content again during preview.\n9. Disabled the image zoom effect in office preview mode to achieve consistent experience with image and pdf preview.\n10. Directly set pdfbox to be compatible with lower version JDK, and there will be no warning prompts even when run in IDEA.\n11. Removed non-essential toolkits like Guava and Hutool to reduce code volume.\n12. Asynchronous loading of Office components speeds up application launch to within 5 seconds.\n13. Reasonable settings of the number of threads in the preview consumption queue.\n14. Fixed the bug where files in compressed packages failed to preview again.\n15. Fixed the bug in image preview.\n\n> May 20th 2020 ：\n1. Support for global watermark and dynamic change of watermark content through parameters\n2. Support for CAD file Preview\n3. Add configuration item base.url, support using nginx reverse proxy and set context-path\n4. All configuration items can be read from environment variables, which is convenient for docker image deployment and large-scale use in cluster\n5. Support the configuration of TrustHost  (only the file source from the trust site can be previewed), and protect the preview service from abuse\n6. Support configuration of customize cache cleanup time (cron expression)\n7. All recognizable plain text can be previewed directly without downloading, such as .md .java .py, etc\n8. Support configuration to limit PDF file download after conversion\n9. Optimize Maven packaging configuration to solve the problem of line break in .sh script\n10. Place all CDN dependencies on the front end locally for users without external network connection\n11. Comment Service on home page switched from Sohu ChangYan to gitalk\n12. Fixed preview exceptions that may be caused by special characters in the URL\n13. Fixed the addtask exception of the transformation file queue\n14. Fixed other known issues\n15. Official website build: [https://kkview.cn](https://kkview.cn)\n16. Official docker image repository build: [https://hub.docker.com/r/keking/kkfileview](https://hub.docker.com/r/keking/kkfileview)\n\n> June 18th 2019 ：\n1. Support automatic cleaning of cache and preview files\n2. Support http/https stream url file preview\n3. Support FTP url file preview\n4. Add Docker build\n\n> April 8th 2019\n1. Cache and queue implementations abstract, providing JDK and REDIS implementations (REDIS becomes optional dependencies)\n2. Provides zip and tar.gz packages, and provides a one-click startup script\n\n> January 17th 2018\n\n1. Refined the project directory, abstract file preview interface, Easy to extend more file extensions and depoly this project on your own\n1. Added English documentation (@幻幻Fate，@汝辉) contribution\n1. Support for more image file extensions\n1. Fixed the issue that image carousel in zip file will always start from the first\n\n> January 12th 2018\n\n1. Support for multiple images preview \n1. Support for images rotation preview in rar/zip\n\n> January 2nd 2018\n\n1. Fixed gibberish issue when preview a txt document caused by the file encoding problem \n1. Fixed the issue that some module dependencies can not be found\n1. Add a spring boot profile, and support for Multi-environment configuration \n1. Add `pdf.js` to preview the documents such as doc,etc.,support for generating doc headlines as pdf menu，support for mobile preview\n\n### Sponsor Us\nIf this project has been helpful to you, we welcome your sponsorship. Your support is our greatest motivation.！\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 3.560546875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n         xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n    <packaging>pom</packaging>\n\n    <groupId>cn.keking</groupId>\n    <artifactId>kkFileView-parent</artifactId>\n    <version>4.4.0-beta</version>\n\n    <properties>\n        <java.version>1.8</java.version>\n        <jodconverter.version>4.4.6</jodconverter.version>\n        <spring.boot.version>2.4.2</spring.boot.version>\n        <poi.version>5.2.2</poi.version>\n        <xdocreport.version>1.0.6</xdocreport.version>\n        <xstream.version>1.4.20</xstream.version>\n        <junrar.version>7.5.5</junrar.version>\n        <redisson.version>3.2.0</redisson.version>\n        <sevenzipjbinding.version>16.02-2.01</sevenzipjbinding.version>\n        <jchardet.version>1.0</jchardet.version>\n        <antlr.version>2.7.7</antlr.version>\n        <concurrentlinkedhashmap.version>1.4.2</concurrentlinkedhashmap.version>\n        <rocksdb.version>5.17.2</rocksdb.version>\n        <pdfbox.version>3.0.2</pdfbox.version>\n        <jai-imageio.version>1.4.0</jai-imageio.version>\n        <jbig2-imageio.version>3.0.4</jbig2-imageio.version>\n        <galimatias.version>0.2.1</galimatias.version>\n        <bytedeco.version>1.5.2</bytedeco.version>\n        <opencv.version>4.1.2-1.5.2</opencv.version>\n        <openblas.version>0.3.6-1.5.1</openblas.version>\n        <ffmpeg.version>4.2.1-1.5.2</ffmpeg.version>\n        <itextpdf.version>5.5.13.3</itextpdf.version>\n        <httpclient.version>3.1</httpclient.version>\n        <aspose-cad.version>23.9</aspose-cad.version>\n        <bcprov-jdk15on.version>1.70</bcprov-jdk15on.version>\n        <juniversalchardet.version>1.0.3</juniversalchardet.version>\n        <httpcomponents.version>4.5.14</httpcomponents.version>\n\n        <commons-cli.version>1.5.0</commons-cli.version>\n        <commons-net.version>3.9.0</commons-net.version>\n        <commons-lang3.version>3.13.0</commons-lang3.version>\n\n\n        <maven.compiler.source>${java.version}</maven.compiler.source>\n        <maven.compiler.target>${java.version}</maven.compiler.target>\n\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <project.reporting.outputEncoding>UTF-8</project.reporting.outputEncoding>\n    </properties>\n\n    <modules>\n        <module>server</module>\n    </modules>\n\n    <name>kkFileView-parent</name>\n    <description>专注文件在线预览服务</description>\n    <url>https://github.com/kekingcn/kkFileView</url>\n\n    <licenses>\n        <license>\n            <name>Apache License, Version 2.0</name>\n            <url>https://www.apache.org/licenses/LICENSE-2.0</url>\n        </license>\n    </licenses>\n\n    <scm>\n        <url>https://github.com/kekingcn/kkFileView</url>\n        <connection>scm:git:git://github.com/kekingcn/kkFileView.git</connection>\n        <developerConnection>scm:git:ssh://git@github.com/kekingcn/kkFileView.git</developerConnection>\n    </scm>\n\n    <developers>\n        <developer>\n            <id>klboke</id>\n            <name>kl</name>\n            <email>g632104866@gmail.com</email>\n            <url>http://www.kailing.pub</url>\n        </developer>\n        <developer>\n            <id>gitchenjh</id>\n            <name>chenjinghua</name>\n            <email>842761733@qq.com</email>\n        </developer>\n    </developers>\n\n    <issueManagement>\n        <system>github</system>\n        <url>https://github.com/kekingcn/kkFileView/issues</url>\n    </issueManagement>\n\n</project>\n"
        },
        {
          "name": "server",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}