{
  "metadata": {
    "timestamp": 1736708896716,
    "page": 128,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Tencent/VasSonic",
      "stars": 11832,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.041015625,
          "content": "# MacOS\n.DS_Store\n\n# Windows\n*.txt\n.idea/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.341796875,
          "content": "# Contributing to VasSonic\nWelcome to [report Issues](https://github.com/Tencent/VasSonic/issues) or [pull requests](https://github.com/Tencent/VasSonic/pulls). It's recommended to read the following Contributing Guide first before contributing. \n\n## Issues\nWe use Github Issues to track public bugs and feature requests.\n\n### Search Known Issues First\nPlease search the existing issues to see if any similar issue or feature request has already been filed. You should make sure your issue isn't redundant.\n\n### Reporting New Issues\nIf you open an issue, the more information the better. Such as detailed description, screenshot or video of your problem, logcat or code blocks for your crash.\n\n## Pull Requests\nWe strongly welcome your pull request to make VasSonic better. \n\n### Branch Management\nThere are two main branches here:\n\n1. `master` branch.\n\t1. It is the latest (pre-)release branch. We use `master` for tags, with version number `1.1.0`, `1.2.0`, `1.3.0`...\n\t2. **Don't submit any PR on `master` branch.**\n2. `dev` branch. \n\t1. It is our stable developing branch. After full testing, `dev` will be merged to `master` branch for the next release.\n\t2. **You are recommended to submit bugfix or feature PR on `dev` branch.**\n\nNormal bugfix or feature request should be submitted to `dev` branch. After full testing, we will merge them to `master` branch for the next release. \n\n```\nmaster\n ↑\ndev   \n ↑ \nfeature/bugfix PR\n```  \n\n### Make Pull Requests\nThe code team will monitor all pull request, we run some code check and test on it. After all tests passed, we will accecpt this PR. But it won't merge to `master` branch at once, which have some delay.\n\nBefore submitting a pull request, please make sure the followings are done:\n\n1. Fork the repo and create your branch from `master`.\n2. Update code or documentation if you have changed APIs.\n3. Add the copyright notice to the top of any new files you've added.\n4. Check your code lints and checkstyles.\n5. Test and test again your code.\n6. Now, you can submit your pull request on `dev`.\n\n## Code Style Guide\nUse [Code Style](https://github.com/Tencent/VasSonic/blob/master/checkstyle.xml) for Java and Android.\n\n* 4 spaces for indentation rather than tabs\n\n## License\nBy contributing to VasSonic, you agree that your contributions will be licensed\nunder its [BSD LICENSE](https://github.com/Tencent/VasSonic/blob/master/LICENSE)\n"
        },
        {
          "name": "ISSUE_TEMPLATE",
          "type": "blob",
          "size": 0.4384765625,
          "content": "What steps will reproduce the problem? \n该问题的重现步骤是什么？\n1. \n2. \n3. \n\n\nWhat is the expected output? What do you see instead? \n你期待的结果是什么？实际看到的又是什么？\n\n\nWhat version of the product are you using? On what operating system? \n你正在使用产品的哪个版本？在什么操作系统上？\n\n\nPlease provide any additional information below.\n如果有的话，请在下面提供更多信息。\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 12.8251953125,
          "content": "Tencent is pleased to support the open source community by making VasSonic available.  \nCopyright (C) 2017 THL A29 Limited, a Tencent company.  All rights reserved.\nIf you have downloaded a copy of the VasSonic binary from Tencent, please note that the VasSonic binary is licensed under the \nBSD 3-Clause License.\nIf you have downloaded a copy of the VasSonic source code from Tencent, please note that VasSonic source code is licensed under\nthe BSD 3-Clause License, except for the third-party components listed below which are subject to different license terms.\nYour integration of VasSonic into your own projects may require compliance with the BSD 3-Clause License, as well as the other \nlicenses applicable to the third-party components included within VasSonic.\nA copy of the BSD 3-Clause License is included in this file.\n\nOther dependencies and licenses:\n\nOpen Source Software Licensed Under the Apache License, Version 2.0: \n----------------------------------------------------------------------------------------\n1. Android Source Code  4.4_r1\nCopyright (C) 2005-2015 The Android Open Source Project\n\n\nTerms of the Apache License, Version 2.0:\n--------------------------------------------------------------------\nApache License\n\nVersion 2.0, January 2004\n\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n“License” shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 \nof this document.\n\n“Licensor” shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.\n\n“Legal Entity” shall mean the union of the acting entity and all other entities that control, are controlled by, or are \nunder common control with that entity. For the purposes of this definition, “control” means (i) the power, direct or indirect,\nto cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) \nor more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n“You” (or “Your”) shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n“Source” form shall mean the preferred form for making modifications, including but not limited to software source code, \ndocumentation source, and configuration files.\n\n“Object” form shall mean any form resulting from mechanical transformation or translation of a Source form, including but \nnot limited to compiled object code, generated documentation, and conversions to other media types.\n\n“Work” shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by\na copyright notice that is included in or attached to the work (an example is provided in the Appendix below).\n\n“Derivative Works” shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for \nwhich the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. \nFor the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) \nto the interfaces of, the Work and Derivative Works thereof.\n\n“Contribution” shall mean any work of authorship, including the original version of the Work and any modifications or \nadditions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the \ncopyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this \ndefinition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, \nincluding but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems \nthat are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication \nthat is conspicuously marked or otherwise designated in writing by the copyright owner as “Not a Contribution.”\n\n“Contributor” shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor\nand subsequently incorporated within the Work.\n\n2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, \nworldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, \npublicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, \nworldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, \nuse, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims \nlicensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) \nwith the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including \na cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct \nor contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate\nas of the date such litigation is filed.\n\n4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without \nmodifications, and in Source or Object form, provided that You meet the following conditions:\n\na) \tYou must give any other recipients of the Work or Derivative Works a copy of this License; and\n\nb) \tYou must cause any modified files to carry prominent notices stating that You changed the files; and\n\nc) \tYou must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, \nand attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and\n\nd) \tIf the Work includes a “NOTICE” text file as part of its distribution, then any Derivative Works that You distribute must \ninclude a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain \nto any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the \nDerivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated \nby the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational \npurposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, \nalongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as \nmodifying the License. \n\nYou may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions \nfor use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, \nreproduction, and distribution of the Work otherwise complies with the conditions stated in this License. \n\n5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the \nWork by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. \nNotwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed \nwith Licensor regarding such Contributions.\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of \nthe Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of \nthe NOTICE file.\n\n7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor \nprovides its Contributions) on an “AS IS” BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, \nwithout limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. \nYou are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated \nwith Your exercise of permissions under this License.\n\n8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, \nunless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor \nbe liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as \na result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, \nwork stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been \nadvised of the possibility of such damages.\n9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, \nand charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with \nthis License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, \nnot on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for \nany liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or\nadditional liability.\n\nEND OF TERMS AND CONDITIONS\n\nAPPENDIX: How to apply the Apache License to your work\nTo apply the Apache License to your work, attach the following boilerplate notice, with the fields enclosed by \nbrackets \"[]\" replaced with your own identifying information. (Don't include the brackets!) The text should be enclosed in the \nappropriate comment syntax for the file format. We also recommend that a file or class name and description of purpose be included\non the same \"printed page\" as the copyright notice for easier identification within third-party archives.\n\nCopyright [yyyy] [name of copyright owner]\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\nhttp://www.apache.org/licenses/LICENSE-2.0\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\n\nTerms of the BSD 3-Clause License:\n--------------------------------------------------------------------\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the \nfollowing conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer \nin the documentation and/or other materials provided with the distribution.\n3. Neither the name of [copyright holder] nor the names of its contributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, \nBUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL \nTHE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES \n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) \nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) \nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.9296875,
          "content": "## VasSonic: A Lightweight And High-performance Hybrid Framework\n[![license](http://img.shields.io/badge/license-BSD3-brightgreen.svg?style=flat)](https://github.com/Tencent/VasSonic/blob/master/LICENSE)\n[![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg)](https://github.com/Tencent/VasSonic/pulls)\n[![wiki](https://img.shields.io/badge/Wiki-open-brightgreen.svg)](https://github.com/Tencent/VasSonic/wiki)\n---\n\n<p align=\"center\">\n  <img alt=\"logo\" src=\"https://github.com/Tencent/VasSonic/blob/master/assets/logo.png\"/>\n</p>\n\nVasSonic is a lightweight and high-performance Hybrid framework developed by tencent VAS team,  which is intended to speed up the first screen of websites working on Android and iOS platform.\n Not only does VasSonic supports the static or dynamic websites which are rendered by server, but it is also compatible with web offline resource perfectly. \n\n VasSonic uses custom url connection instead of original network connection to request the index html, so it can request resource in advance or parallel to avoid waiting for the view initialization.\n In this parallel case, VasSonic can read and render partial data by WebKit or Blink kernel without spending too much time waiting for the end of data stream.\n\n VasSonic can cache html cleverly according to VasSonic Specification obeyed by client and server.\n VasSonic Specification specify template and data by inserting different comment anchor, templates are bigger parts of html which stay the same or changed rarely , in contradiction data, which is the smaller and constantly change part of html.\n According to this, VasSonic request less data by incremental updating templates and data, the websites are faster and feel more like native application.\n In conclusion, VasSonic effectively enhance the user experience and increase click rate, retention rate and other indicators.\n\n Sonic is called for short in project.\n\n### Before VS After Using VasSonic\n\nPic 1: Before Using VasSonic |  Pic 2: After Using VasSonic\n:-------------------------:|:-------------------------:\n![default mode][1]  |  ![VasSonic mode][2]\n\n## Getting started\n\n[Getting started with Android](https://github.com/Tencent/VasSonic/blob/master/sonic-android/README.md)\n\n[Getting started with iOS](https://github.com/Tencent/VasSonic/blob/master/sonic-iOS/README.md)\n\n[Getting started with Java](https://github.com/Tencent/VasSonic/blob/dev/sonic-java/README.md)\n\n[Getting started with Node.js](https://github.com/Tencent/VasSonic/blob/master/sonic-nodejs/README.md)\n\n[Getting started with PHP](https://github.com/Tencent/VasSonic/blob/master/sonic-php/README.md)\n\n[Getting started with React](https://github.com/Tencent/VasSonic/blob/master/sonic-react/README.md)\n\n## Demo Downloads\n1. [Here](https://github.com/Tencent/VasSonic/releases) are the latest sample demo for Android and iOS.\n\n\n## Support\nAny problem?\n\n1. Learn more from the following sample. </br>\n[Android sample](https://github.com/Tencent/VasSonic/tree/master/sonic-android/sample)  </br>\n[iOS sample](https://github.com/Tencent/VasSonic/tree/master/sonic-iOS/SonicSample) </br>\n[Java sample](https://github.com/Tencent/VasSonic/tree/dev/sonic-java/sample/webapp) </br>\n[Node.js sample](https://github.com/Tencent/VasSonic/tree/master/sonic-nodejs) </br>\n[PHP sample](https://github.com/Tencent/VasSonic/tree/master/sonic-php/sample) </br>\n[React sample](https://github.com/Tencent/VasSonic/tree/master/sonic-react) </br>\n\n2. Read the following source code </br>\n[Android source code](https://github.com/Tencent/VasSonic/tree/master/sonic-android/sdk) </br>\n[iOS source code](https://github.com/Tencent/VasSonic/tree/master/sonic-iOS/Sonic)  </br>\n[Java source code](https://github.com/Tencent/VasSonic/tree/dev/sonic-java/src/main/java/com/github/tencent)\n[Node.js source code](https://github.com/Tencent/VasSonic/tree/master/sonic-nodejs) </br>\n[PHP source code](https://github.com/Tencent/VasSonic/tree/master/sonic-php/sdk) </br>\n[React source code](https://github.com/Tencent/VasSonic/tree/master/sonic-react) </br>\n\n3. Read the [wiki](https://github.com/Tencent/VasSonic/wiki) for help.\n\n4. Contact [us](https://jq.qq.com/?_wv=1027&k=4EaxB4K) or scan QR code for help.</br>\n![QR code][3]\n\n## Contributing\nFor more information about contributing issues or pull requests, see our [VasSonic Contributing Guide](https://github.com/Tencent/VasSonic/blob/master/CONTRIBUTING.md).\n\n## License\nVasSonic is under the BSD license. See the [LICENSE](https://github.com/Tencent/VasSonic/blob/master/LICENSE) file for details.\n\n## The End\nIf you are interested in VasSonic, don't forget to STAR [it](https://github.com/Tencent/VasSonic). \n\nVasSonic's mission is MAKING WEB MUCH BETTER!\n\nThank you for reading ~\n\n[1]: https://github.com/Tencent/VasSonic/blob/master/assets/20170705120005424.gif\n[2]: https://github.com/Tencent/VasSonic/blob/master/assets/20170705120029897.gif\n[3]: https://github.com/Tencent/VasSonic/blob/master/assets/QR.JPG\n[4]: https://github.com/Tencent/VasSonic/blob/master/assets/logo.png\n\n"
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "checkstyle.xml",
          "type": "blob",
          "size": 5.435546875,
          "content": "<?xml version=\"1.0\"?>\n<!--\n  Copyright (C) 2016 THL A29 Limited, a Tencent company.\n  Copyright (C) 2014 Square, Inc.\n\n  Licensed under the Apache License, Version 2.0 (the \"License\");\n  you may not use this file except in compliance with the License.\n  You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n  Unless required by applicable law or agreed to in writing, software\n  distributed under the License is distributed on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n  See the License for the specific language governing permissions and\n  limitations under the License.\n  -->\n<!DOCTYPE module PUBLIC\n    \"-//Puppy Crawl//DTD Check Configuration 1.2//EN\"\n    \"http://www.puppycrawl.com/dtds/configuration_1_2.dtd\">\n\n<module name=\"Checker\">\n  <!--module name=\"NewlineAtEndOfFile\"/-->\n  <module name=\"FileLength\"/>\n  <module name=\"FileTabCharacter\"/>\n  <module name=\"SuppressWarningsFilter\"/>\n\n  <!-- Trailing spaces -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"\\s+$\"/>\n    <property name=\"message\" value=\"Line has trailing spaces.\"/>\n  </module>\n\n  <!-- Space after 'for' and 'if' -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"^\\s*(for|if)[^ ]\\(\"/>\n    <property name=\"message\" value=\"Space needed before opening parenthesis.\"/>\n  </module>\n\n  <!-- For each spacing -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"^\\s*for \\(.*?([^ ]:|:[^ ])\"/>\n    <property name=\"message\" value=\"Space needed around ':' character.\"/>\n  </module>\n\n  <module name=\"TreeWalker\">\n    <!-- Checks for Javadoc comments.                     -->\n    <!-- See http://checkstyle.sf.net/config_javadoc.html -->\n    <!--module name=\"JavadocMethod\"/-->\n    <!--module name=\"JavadocType\"/-->\n    <!--module name=\"JavadocVariable\"/-->\n    <!--module name=\"JavadocStyle\"/-->\n\n\n    <!-- Checks for Naming Conventions.                  -->\n    <!-- See http://checkstyle.sf.net/config_naming.html -->\n    <!--<module name=\"ConstantName\"/>-->\n    <module name=\"LocalFinalVariableName\"/>\n    <module name=\"LocalVariableName\"/>\n    <module name=\"MemberName\"/>\n    <module name=\"MethodName\">\n      <property name=\"format\" value=\"^[a-z][a-zA-Z0-9_]*$\"/>\n    </module>\n    <module name=\"PackageName\"/>\n    <module name=\"ParameterName\"/>\n    <module name=\"StaticVariableName\"/>\n    <module name=\"TypeName\">\n      <property name=\"format\" value=\"^[A-Z][a-zA-Z0-9_]*$\"/>\n    </module>\n\n\n    <!-- Checks for imports                              -->\n    <!-- See http://checkstyle.sf.net/config_import.html -->\n    <module name=\"AvoidStarImport\"/>\n    <module name=\"IllegalImport\"/>\n    <module name=\"RedundantImport\"/>\n    <module name=\"UnusedImports\"/>\n\n\n    <!-- Checks for Size Violations.                    -->\n    <!-- See http://checkstyle.sf.net/config_sizes.html -->\n    <!--module name=\"LineLength\"-->\n      <!--property name=\"max\" value=\"100\"/-->\n    <!--/module-->\n    <!--module name=\"MethodLength\"/-->\n    <!--<module name=\"ParameterNumber\"/>-->\n\n    <!-- Checks for whitespace                               -->\n    <!-- See http://checkstyle.sf.net/config_whitespace.html -->\n    <module name=\"GenericWhitespace\"/>\n    <module name=\"EmptyForIteratorPad\"/>\n    <module name=\"MethodParamPad\"/>\n\n\n    <module name=\"NoWhitespaceAfter\"/>\n    <module name=\"NoWhitespaceBefore\"/>\n    <module name=\"OperatorWrap\"/>\n    <module name=\"ParenPad\"/>\n    <module name=\"TypecastParenPad\"/>\n    <module name=\"WhitespaceAfter\"/>\n    <module name=\"WhitespaceAround\"/>\n\n\n    <!-- Modifier Checks                                    -->\n    <!-- See http://checkstyle.sf.net/config_modifiers.html -->\n    <!--module name=\"ModifierOrder\"/-->\n    <module name=\"RedundantModifier\"/>\n\n\n    <!-- Checks for blocks. You know, those {}'s         -->\n    <!-- See http://checkstyle.sf.net/config_blocks.html -->\n    <!--module name=\"AvoidNestedBlocks\"/-->\n    <!--module name=\"EmptyBlock\"/-->\n    <module name=\"LeftCurly\"/>\n    <!--allow single line-->\n    <module name=\"NeedBraces\">\n      <property name=\"allowSingleLineStatement\" value=\"true\"/>\n    </module>\n\n    <module name=\"RightCurly\"/>\n\n\n    <!-- Checks for common coding problems               -->\n    <!-- See http://checkstyle.sf.net/config_coding.html -->\n    <!--module name=\"AvoidInlineConditionals\"/-->\n    <module name=\"CovariantEquals\"/>\n    <module name=\"EmptyStatement\"/>\n    <!--module name=\"EqualsAvoidNull\"/-->\n    <!--<module name=\"EqualsHashCode\"/>-->\n    <!--module name=\"HiddenField\"/-->\n    <module name=\"IllegalInstantiation\"/>\n    <!--<module name=\"InnerAssignment\"/>-->\n    <!--module name=\"MagicNumber\"/-->\n    <!--<module name=\"MissingSwitchDefault\"/>-->\n    <!--<module name=\"RedundantThrows\"/>-->\n    <module name=\"SimplifyBooleanExpression\"/>\n    <module name=\"SimplifyBooleanReturn\"/>\n\n    <!-- Checks for class design                         -->\n    <!-- See http://checkstyle.sf.net/config_design.html -->\n    <!--module name=\"DesignForExtension\"/-->\n    <!--module name=\"FinalClass\"/-->\n    <!--<module name=\"HideUtilityClassConstructor\"/>-->\n    <!--module name=\"InterfaceIsType\"/-->\n    <!--module name=\"VisibilityModifier\"/-->\n\n\n    <!-- Miscellaneous other checks.                   -->\n    <!-- See http://checkstyle.sf.net/config_misc.html -->\n    <module name=\"ArrayTypeStyle\"/>\n    <!--module name=\"FinalParameters\"/-->\n    <!--<module name=\"TodoComment\"/>-->\n    <module name=\"UpperEll\"/>\n    <module name=\"SuppressWarningsHolder\"/>\n  </module>\n</module>"
        },
        {
          "name": "sonic-android",
          "type": "tree",
          "content": null
        },
        {
          "name": "sonic-iOS",
          "type": "tree",
          "content": null
        },
        {
          "name": "sonic-java",
          "type": "tree",
          "content": null
        },
        {
          "name": "sonic-nodejs",
          "type": "tree",
          "content": null
        },
        {
          "name": "sonic-php",
          "type": "tree",
          "content": null
        },
        {
          "name": "sonic-react",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}