{
  "metadata": {
    "timestamp": 1736708824317,
    "page": 7,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "libgdx/libgdx",
      "stars": 23596,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".git-blame-ignore-revs",
          "type": "blob",
          "size": 0.1923828125,
          "content": "#Spotless\n79cf00af53b7f38667291fbacf544d3074a811bd\n#Source formatted.\nb97b34a82af276a09bec2885854dc391ec65023d\n#ERL YER SERC CERN HERS BERN RERFERCKTERERD!\n2c9030de2ddb983cfaeb5736089453b32c559cc1\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0458984375,
          "content": "/CHANGES merge=union\n/CONTRIBUTORS merge=union\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.466796875,
          "content": "# Temporary Files\n*~\n.*.swp\n.DS_STORE\ndesktop.ini\nrobovm-build/\nproject.xcworkspace/\nxcuserdata/\nxcode/native/\n.gradle/\nbuild/\nbin/\ntarget/\nobj/\nout/\nclasses/\n.gwt/\ngwt-unitCache/\nwar/\ngen/\ngen-external-apklibs/\narmeabi-v7a/\narm64-v8a/\nlinux32/\nlinux64/\nwindows32/\nwindows64/\nmacosx32/\nios32/\nDebug/\nRelease/\nx64/\nx86/\nx86_64/\nipch/\n/dist\n\n*.a\n*.a.tvos\n*.dll\n*.dll.mdb\n*.userprefs\n*.sdf\n*.class\nhs_err_pid*\nThumbs.db\n\nlibgdx-*.zip\nlibgdx-*.zip.MD5\n/android-ndk-*\n\n*.iml\n/.idea/\n\n#core & extension libs/ folders that have no 3rd party dependencies in them\n/gdx/libs\n/backends/gdx-backend-jglfw/libs/\n/backends/gdx-backend-robovm/libs/\n/extensions/gdx-audio/libs/\n/extensions/gdx-box2d/gdx-box2d/libs/\n/extensions/gdx-bullet/libs/\n/extensions/gdx-freetype/libs/\n/extensions/gdx-image/libs/\n/extensions/gdx-lwjgl3-angle/res\n/extensions/gdx-lwjgl3-glfw-awt-macos/res/\n/extensions/gdx-setup/gdx-setup.jar\n/extensions/gdx-setup/test/\n\n#the LWJGL3 libs are pulled via fetch.xml\n/backends/gdx-backend-lwjgl3/libs/lwjgl*.jar\n/backends/gdx-backend-robovm-metalangle/res/META-INF/robovm/ios/libs\n\n#ensure gdx-setup.jar works properly\n!/extensions/gdx-setup/src/com/badlogic/gdx/setup/resources/gwt/war\n\n#assets generated in tests\ntests/gdx-tests-android/assets/bitmapWrittenFont.fnt\ntests/gdx-tests-android/assets/bitmapWrittenFont.png\n\n#directories created by fetch.xml\n/tests/gdx-tests-android/libs\n/tmp/\n\n#gradle wrapper\n/local.properties\nnatives.zip\n\n#Eclipse metadata\n.metadata\n.classpath\n.project\n.settings\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.140625,
          "content": "[submodule \"extensions/gdx-freetype/jni/freetype\"]\n\tpath = extensions/gdx-freetype/jni/freetype\n\turl = https://github.com/freetype/freetype.git\n"
        },
        {
          "name": ".settings",
          "type": "tree",
          "content": null
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.3740234375,
          "content": "# This is the official list of the AUTHORS of libgdx\n# for copyright purposes.\n# This file is distinct from the CONTRIBUTORS files.\n# See the latter for an explanation.\n\n# Names should be added to this file as\n#\tName or Organization <email address>\n# The email address is not required for organizations.\nMario Zechner <badlogicgames@gmail.com>\nNathan Sweet <nathan.sweet@gmail.com> \n"
        },
        {
          "name": "CC-LICENSE",
          "type": "blob",
          "size": 19.138671875,
          "content": "License\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n1. Definitions\n\n   1. \"Adaptation\" means a work based upon the Work, or upon the Work and other pre-existing works, such as a translation, adaptation, derivative work, arrangement of music or other alterations of a literary or artistic work, or phonogram or performance and includes cinematographic adaptations or any other form in which the Work may be recast, transformed, or adapted including in any form recognizably derived from the original, except that a work that constitutes a Collection will not be considered an Adaptation for the purpose of this License. For the avoidance of doubt, where the Work is a musical work, performance or phonogram, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered an Adaptation for the purpose of this License.\n   2. \"Collection\" means a collection of literary or artistic works, such as encyclopedias and anthologies, or performances, phonograms or broadcasts, or other works or subject matter other than works listed in Section 1(f) below, which, by reason of the selection and arrangement of their contents, constitute intellectual creations, in which the Work is included in its entirety in unmodified form along with one or more other contributions, each constituting separate and independent works in themselves, which together are assembled into a collective whole. A work that constitutes a Collection will not be considered an Adaptation (as defined below) for the purposes of this License.\n   3. \"Creative Commons Compatible License\" means a license that is listed at http://creativecommons.org/compatiblelicenses that has been approved by Creative Commons as being essentially equivalent to this License, including, at a minimum, because that license: (i) contains terms that have the same purpose, meaning and effect as the License Elements of this License; and, (ii) explicitly permits the relicensing of adaptations of works made available under that license under this License or a Creative Commons jurisdiction license with the same License Elements as this License.\n   4. \"Distribute\" means to make available to the public the original and copies of the Work or Adaptation, as appropriate, through sale or other transfer of ownership.\n   5. \"License Elements\" means the following high-level license attributes as selected by Licensor and indicated in the title of this License: Attribution, ShareAlike.\n   6. \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this License.\n   7. \"Original Author\" means, in the case of a literary or artistic work, the individual, individuals, entity or entities who created the Work or if no individual or entity can be identified, the publisher; and in addition (i) in the case of a performance the actors, singers, musicians, dancers, and other persons who act, sing, deliver, declaim, play in, interpret or otherwise perform literary or artistic works or expressions of folklore; (ii) in the case of a phonogram the producer being the person or legal entity who first fixes the sounds of a performance or other sounds; and, (iii) in the case of broadcasts, the organization that transmits the broadcast.\n   8. \"Work\" means the literary and/or artistic work offered under the terms of this License including without limitation any production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression including digital form, such as a book, pamphlet and other writing; a lecture, address, sermon or other work of the same nature; a dramatic or dramatico-musical work; a choreographic work or entertainment in dumb show; a musical composition with or without words; a cinematographic work to which are assimilated works expressed by a process analogous to cinematography; a work of drawing, painting, architecture, sculpture, engraving or lithography; a photographic work to which are assimilated works expressed by a process analogous to photography; a work of applied art; an illustration, map, plan, sketch or three-dimensional work relative to geography, topography, architecture or science; a performance; a broadcast; a phonogram; a compilation of data to the extent it is protected as a copyrightable work; or a work performed by a variety or circus performer to the extent it is not otherwise considered a literary or artistic work.\n   9. \"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.\n  10. \"Publicly Perform\" means to perform public recitations of the Work and to communicate to the public those public recitations, by any means or process, including by wire or wireless means or public digital performances; to make available to the public Works in such a way that members of the public may access these Works from a place and at a place individually chosen by them; to perform the Work to the public by any means or process and the communication to the public of the performances of the Work, including by public digital performance; to broadcast and rebroadcast the Work by any means including signs, sounds or images.\n  11. \"Reproduce\" means to make copies of the Work by any means including without limitation by sound or visual recordings and the right of fixation and reproducing fixations of the Work, including storage of a protected performance or phonogram in digital form or other electronic medium.\n\n2. Fair Dealing Rights. Nothing in this License is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions that are provided for in connection with the copyright protection under copyright law or other applicable laws.\n\n3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:\n\n   1. to Reproduce the Work, to incorporate the Work into one or more Collections, and to Reproduce the Work as incorporated in the Collections;\n   2. to create and Reproduce Adaptations provided that any such Adaptation, including any translation in any medium, takes reasonable steps to clearly label, demarcate or otherwise identify that changes were made to the original Work. For example, a translation could be marked \"The original work was translated from English to Spanish,\" or a modification could indicate \"The original work has been modified.\";\n   3. to Distribute and Publicly Perform the Work including as incorporated in Collections; and,\n   4. to Distribute and Publicly Perform Adaptations.\n   5.\n\n      For the avoidance of doubt:\n         1. Non-waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme cannot be waived, the Licensor reserves the exclusive right to collect such royalties for any exercise by You of the rights granted under this License;\n         2. Waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme can be waived, the Licensor waives the exclusive right to collect such royalties for any exercise by You of the rights granted under this License; and,\n         3. Voluntary License Schemes. The Licensor waives the right to collect royalties, whether individually or, in the event that the Licensor is a member of a collecting society that administers voluntary licensing schemes, via that society, from any exercise by You of the rights granted under this License.\n\nThe above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. Subject to Section 8(f), all rights not expressly granted by Licensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:\n\n   1. You may Distribute or Publicly Perform the Work only under the terms of this License. You must include a copy of, or the Uniform Resource Identifier (URI) for, this License with every copy of the Work You Distribute or Publicly Perform. You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of the recipient of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties with every copy of the Work You Distribute or Publicly Perform. When You Distribute or Publicly Perform the Work, You may not impose any effective technological measures on the Work that restrict the ability of a recipient of the Work from You to exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as incorporated in a Collection, but this does not require the Collection apart from the Work itself to be made subject to the terms of this License. If You create a Collection, upon notice from any Licensor You must, to the extent practicable, remove from the Collection any credit as required by Section 4(c), as requested. If You create an Adaptation, upon notice from any Licensor You must, to the extent practicable, remove from the Adaptation any credit as required by Section 4(c), as requested.\n   2. You may Distribute or Publicly Perform an Adaptation only under the terms of: (i) this License; (ii) a later version of this License with the same License Elements as this License; (iii) a Creative Commons jurisdiction license (either this or a later license version) that contains the same License Elements as this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative Commons Compatible License. If you license the Adaptation under one of the licenses mentioned in (iv), you must comply with the terms of that license. If you license the Adaptation under the terms of any of the licenses mentioned in (i), (ii) or (iii) (the \"Applicable License\"), you must comply with the terms of the Applicable License generally and the following provisions: (I) You must include a copy of, or the URI for, the Applicable License with every copy of each Adaptation You Distribute or Publicly Perform; (II) You may not offer or impose any terms on the Adaptation that restrict the terms of the Applicable License or the ability of the recipient of the Adaptation to exercise the rights granted to that recipient under the terms of the Applicable License; (III) You must keep intact all notices that refer to the Applicable License and to the disclaimer of warranties with every copy of the Work as included in the Adaptation You Distribute or Publicly Perform; (IV) when You Distribute or Publicly Perform the Adaptation, You may not impose any effective technological measures on the Adaptation that restrict the ability of a recipient of the Adaptation from You to exercise the rights granted to that recipient under the terms of the Applicable License. This Section 4(b) applies to the Adaptation as incorporated in a Collection, but this does not require the Collection apart from the Adaptation itself to be made subject to the terms of the Applicable License.\n   3. If You Distribute, or Publicly Perform the Work or any Adaptations or Collections, You must, unless a request has been made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or if the Original Author and/or Licensor designate another party or parties (e.g., a sponsor institute, publishing entity, journal) for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the name of such party or parties; (ii) the title of the Work if supplied; (iii) to the extent reasonably practicable, the URI, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work; and (iv) , consistent with Ssection 3(b), in the case of an Adaptation, a credit identifying the use of the Work in the Adaptation (e.g., \"French translation of the Work by Original Author,\" or \"Screenplay based on original Work by Original Author\"). The credit required by this Section 4(c) may be implemented in any reasonable manner; provided, however, that in the case of a Adaptation or Collection, at a minimum such credit will appear, if a credit for all contributing authors of the Adaptation or Collection appears, then as part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original Author, Licensor and/or Attribution Parties.\n   4. Except as otherwise agreed in writing by the Licensor or as may be otherwise permitted by applicable law, if You Reproduce, Distribute or Publicly Perform the Work either by itself or as part of any Adaptations or Collections, You must not distort, mutilate, modify or take other derogatory action in relation to the Work which would be prejudicial to the Original Author's honor or reputation. Licensor agrees that in those jurisdictions (e.g. Japan), in which any exercise of the right granted in Section 3(b) of this License (the right to make Adaptations) would be deemed to be a distortion, mutilation, modification or other derogatory action prejudicial to the Original Author's honor and reputation, the Licensor will waive or not assert, as appropriate, this Section, to the fullest extent permitted by the applicable national law, to enable You to reasonably exercise Your right under Section 3(b) of this License (right to make Adaptations) but not otherwise.\n\n5. Representations, Warranties and Disclaimer\n\nUNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. Termination\n\n   1. This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Adaptations or Collections from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.\n   2. Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.\n\n8. Miscellaneous\n\n   1. Each time You Distribute or Publicly Perform the Work or a Collection, the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.\n   2. Each time You Distribute or Publicly Perform an Adaptation, Licensor offers to the recipient a license to the original Work on the same terms and conditions as the license granted to You under this License.\n   3. If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n   4. No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.\n   5. This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.\n   6. The rights granted under, and the subject matter referenced, in this License were drafted utilizing the terminology of the Berne Convention for the Protection of Literary and Artistic Works (as amended on September 28, 1979), the Rome Convention of 1961, the WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms Treaty of 1996 and the Universal Copyright Convention (as revised on July 24, 1971). These rights and subject matter take effect in the relevant jurisdiction in which the License terms are sought to be enforced according to the corresponding provisions of the implementation of those treaty provisions in the applicable national law. If the standard suite of rights granted under applicable copyright law includes additional rights not granted under this License, such additional rights are deemed to be included in the License; this License is not intended to restrict the license of any rights under applicable law.\n"
        },
        {
          "name": "CCLA.txt",
          "type": "blob",
          "size": 7.8095703125,
          "content": "        Corporate Contributor License Agreement (\"Agreement\") V2.0\n                   http://www.apache.org/licenses/\n\n\n   Thank you for your interest in libGDX (the \"Project\"). In order to clarify the \n   intellectual property license granted with Contributions from any person or entity, Mario  \n   Zechner and Nathan Sweet (\"Project Owners\") must have a Contributor License \n   Agreement (CLA) on file that has been signed by each Contributor, \n   indicating agreement to the license terms below. This license is for your \n   protection as a Contributor as well as the protection of Project Owners and \n   the Project's users; it does not change your rights to use your own Contributions \n   for any other purpose.\n\n   This version of the Agreement allows an entity (the \"Corporation\") to\n   submit Contributions to the Project, to authorize Contributions \n   submitted by its designated employees to the Project, and to grant \n   copyright and patent licenses thereto.\n\n   If you have not already done so, please complete and sign, then scan and\n   email a pdf file of this Agreement to contact@badlogicgames.com. If \n   necessary, send an original signed Agreement to Mario Zechner, Steyrergasse\n   23. 8010 Graz, Styria, Austria.\n   \n   Please read this document carefully before signing and keep a copy for\n   your records.\n\n   Corporation name:    ________________________________________________\n\n   Corporation address: ________________________________________________\n\n                        ________________________________________________\n\n                        ________________________________________________\n\n   Point of Contact:    ________________________________________________\n\n          E-Mail:       ________________________________________________\n\n          Telephone:    _____________________ Fax: _____________________\n\n\n   You accept and agree to the following terms and conditions for Your\n   present and future Contributions submitted to the Project. In\n   return, the Project Owners shall not use Your Contributions in a way that\n   is contrary to the public benefit or inconsistent with its nonprofit\n   status and bylaws in effect at the time of the Contribution. Except\n   for the license granted herein to the Project Owners and recipients of\n   software distributed by the Project Owners, You reserve all right, title,\n   and interest in and to Your Contributions.\n\n   1. Definitions.\n\n      \"You\" (or \"Your\") shall mean the copyright owner or legal entity\n      authorized by the copyright owner that is making this Agreement\n      with the Project Owners. For legal entities, the entity making a\n      Contribution and all other entities that control, are controlled by,\n      or are under common control with that entity are considered to be a\n      single Contributor. For the purposes of this definition, \"control\"\n      means (i) the power, direct or indirect, to cause the direction or\n      management of such entity, whether by contract or otherwise, or\n      (ii) ownership of fifty percent (50%) or more of the outstanding\n      shares, or (iii) beneficial ownership of such entity.\n\n      \"Contribution\" shall mean the code, documentation or other original\n      works of authorship expressly identified in Schedule B, as well as\n      any original work of authorship, including\n      any modifications or additions to an existing work, that is intentionally\n      submitted by You to the Project Owners for inclusion in, or\n      documentation of, any of the products owned or managed by the\n      Project Owners (the \"Work\"). For the purposes of this definition,\n      \"submitted\" means any form of electronic, verbal, or written\n      communication sent to the Project Owners or its representatives,\n      including but not limited to communication on electronic mailing\n      lists, source code control systems, and issue tracking systems\n      that are managed by, or on behalf of, the Project Owners for the\n      purpose of discussing and improving the Work, but excluding\n      communication that is conspicuously marked or otherwise designated\n      in writing by You as \"Not a Contribution.\"\n\n   2. Grant of Copyright License. Subject to the terms and conditions\n      of this Agreement, You hereby grant to the Project Owners and to\n      recipients of software distributed by the Project Owners a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare derivative works of,\n      publicly display, publicly perform, sublicense, and distribute\n      Your Contributions and such derivative works.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this Agreement, You hereby grant to the Project Owners and to recipients\n      of software distributed by the Project Owners a perpetual, worldwide,\n      non-exclusive, no-charge, royalty-free, irrevocable (except as\n      stated in this section) patent license to make, have made, use,\n      offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by You that are necessarily infringed by Your Contribution(s)\n      alone or by combination of Your Contribution(s) with the Work to\n      which such Contribution(s) were submitted. If any entity institutes\n      patent litigation against You or any other entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that your\n      Contribution, or the Work to which you have contributed, constitutes\n      direct or contributory patent infringement, then any patent licenses\n      granted to that entity under this Agreement for that Contribution or\n      Work shall terminate as of the date such litigation is filed.\n\n   4. You represent that You are legally entitled to grant the above\n      license. You represent further that each employee of the\n      Corporation designated on Schedule A below (or in a subsequent\n      written modification to that Schedule) is authorized to submit\n      Contributions on behalf of the Corporation.\n\n   5. You represent that each of Your Contributions is Your original\n      creation (see section 7 for submissions on behalf of others).\n\n   6. You are not expected to provide support for Your Contributions,\n      except to the extent You desire to provide support. You may provide\n      support for free, for a fee, or not at all. Unless required by\n      applicable law or agreed to in writing, You provide Your\n      Contributions on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS\n      OF ANY KIND, either express or implied, including, without\n      limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT,\n      MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE.\n\n   7. Should You wish to submit work that is not Your original creation,\n      You may submit it to the Project Owners separately from any\n      Contribution, identifying the complete details of its source and\n      of any license or other restriction (including, but not limited\n      to, related patents, trademarks, and license agreements) of which\n      you are personally aware, and conspicuously marking the work as\n      \"Submitted on behalf of a third-party: [named here]\".\n\n   8. It is your responsibility to notify the Project Owners when any change\n      is required to the list of designated employees authorized to submit\n      Contributions on behalf of the Corporation, or to the Corporation's\n      Point of Contact with the Project Owners.\n\n\n\n   Please sign: __________________________________ Date: _______________\n\n   Title:       __________________________________\n\n   Corporation: __________________________________\n\n\nSchedule A\n\n   [Initial list of designated employees.  NB: authorization is not\n    tied to particular Contributions.]\n\n\n\n\nSchedule B\n\n   [Identification of optional concurrent software grant.  Would be\n    left blank or omitted if there is no concurrent software grant.]\n"
        },
        {
          "name": "CHANGES",
          "type": "blob",
          "size": 88.7099609375,
          "content": "[1.13.1]\n- [BREAKING CHANGE] Android: Since 1.13.0 libGDX requires setting `android.useAndroidX=true` in your gradle.properties file. In 1.13.1 it is NO longer needed to define the `androidx.core:core` dependency in your Android module.\n- iOS: Update to MobiVM 2.3.22\n- iOS: Fixes Gdx.openURI() not working on iOS 18.1 Simulator.\n- Change visibility of PolygonSpriteBatch.switchTexture() to protected\n- Added XmlReader.getChildren() and XmlReader.replaceChild()\n- LWJGL3: Fix pauseWhenLostFocus not working as expected\n- LWJGL 3: Downgrade to 3.3.3 due to AV false positives on 3.3.4 and OpenAL log spamming issue on 3.3.5.\n- API Addition: Added FPSLogger#setBound\n- Android: Fix crash on startup if `setContentView` was manually called after `initializeForView`\n- API Addition: Added Array#replaceFirst and Array#replaceAll\n- Fixed ShortArray#lastIndexOf taking char instead of short.\n- Properly validate font name in Hiero\n- Fix depth shader recycling\n- Support 'class' Tiled/Tmx MapProperty\n- Support for Layer TintColor in TiledMap\n- Fix classpath files not being loaded on GWT\n- Fixed LongArray#lastIndexOf taking char instead of long.\n- LongArray#pop and #peek now throw expections if the array is empty\n- Reset existing transformations of provided overlap Polygon in Polygon::intersectPolygons\n- Added tiledmap loader for JSON files\n- Fix duplicate points returned in polygon intersection\n- Change defaults of SpriteBatch to use VBO instead of VertexArray on gl2/gles2.0\n- Fix: no longer inline the version string\n- GWT - Calculate MD5 hash while copying file to avoid errors on very large files\n- Fix: Wayland doesn't support setting window position and icon\n- Fix: Parsing imagelayer inside a group tag in TMX file\n- Improve Android input keyboard with autocorrection\n- Unproject and pick ray docs for Viewport/Camera\n- Support for Image Layer repeat x and y in TiledMap + Bugfix\n\n[1.13.0]\n- [BREAKING CHANGE] GWT: Updated to 2.11.0. `com.google.jsinterop:jsinterop-annotations:2.0.2:sources` must be added as a dependency to your html project dependencies.\n- [BREAKING CHANGE] Android: Minimum API level is now level 19 (Android 4.4)\n- [BREAKING CHANGE] iOS: Increased min supported iOS version to 12.0. Update your Info.plist file if necessary.\n- [BREAKING CHANGE] Android, iOS: Exceptions occurring in Runnable tasks scheduled through Gdx.app.postRunnable() are no longer swallowed and will crash the app (add a protection if required).\n- Updated: Update to jnigen 2.5.2\n- iOS: Update to MobiVM 2.3.21\n- iOS: The iOS backend now implements AudioDevice. It can be configured through IOSApplicationConfiguration with audioDeviceBufferSize/audioDeviceBufferCount\n- Fixed GlyphLayout for fixed width glyph offsets at the start and end of lines.\n- Fixed scene2d.ui layout for fractional positions and sizes.\n- LWJGL3: Added pauseWhenMinimized and pauseWhenLostFocus flags to Lwjgl3ApplicationConfiguration.\n- libGDX is now built using Java 17 due to Gradle 8 requirements.\n- New GDX Setup projects now use Gradle 8.4 and AGP Plugin 8.1.2 which require at least Java 17.\n- Fixed Timer#stop, remember time spent stopped and delay tasks when started again. #7281\n- Android: Add configuration option to render under the cutout if available on the device.\n- Fix: Keep SelectBox popup from extending past right edge of stage.\n- Added Framebuffer multisample support (see GL31FrameBufferMultisampleTest.java for basic usage)\n- Fix: Fonts generated with gdx-freetype no longer bleed when drawn with a shadow\n- Fixed Timer tasks being run after cancellation.\n- Optimization of SpriteBatch in GL30 default modes, as indices do not need to be updated\n- Desktop: Added support for 8/32/64-bit PCM and MP3 WAVs\n- Desktop: Improved support for surround sound audio files (#6792)\n- Android: Added support for predictive back gesture (requires android:enableOnBackInvokedCallback=\"true\" in manifest)\n- API Removal: Removed deprecated back and menu key methods. Use `setCatchKey` and `isCatchKey` instead.\n- Cache packed color on sprite to improve performance\n- Improve JsonReader, add JsonSkimmer, JsonString\n- Add proper glTexImage2D support on GWT\n- Expose the color variables of Box2DDebugRenderer\n- Add Color#set(Color rgb, float a)\n- Prevent loss of precision in OrthographicCamera#update\n- Fix offsets in ConvexHull while being unsorted\n- Small particle emitter improvements\n- Fix : RenderBuffer leak in GLFrameBuffer\n- LWJGL 3: Remove unnecessary window.makeCurrent() calls to improve performance (#7362)\n- Fix: DragListener only listens to the correct touch up events\n- Fix incorrect glyph page index in FreeTypeFontGenerator\n- Added TextureAtlas.TextureAtlasData.Page#name.\n- iOS: Improve preferred FPS setting logic and documentation on iOS backend\n- Fixed TextField breaking if the font has markup enabled.\n- Only allow scrolling of a scroll pane if it has scroll focus\n- iOS: Adding RoboVM AudioDevice implementation\n- Add new Color#CLEAR_WHITE\n- Fixed ScrollPane#scrollTo setting scrollX when there's a width\n- Screens now extend the Disposable interface\n- Added antialiasing flag to the ScreenUtils.\n- Fix Intersector.intersectPolygons() corner case\n- LWJGL 3: Fix the delta time not changing when resizing the window\n- GWT: Allow switching the audio device; this has to be enabled via GwtApplicationConfiguration#fetchAvailableOutputDevices\n- Add API to get user inout with native text fields (#7004)\n- Fix issue with the 'request still pending' check on NetJavaImpl\n- Added possibility to reset a particle effect without starting it\n- Android & iOS: Use empty Audio implementations on Android and iOS when audio is disabled\n- Adds status detection for an httpRequest\n- Fix ANGLE GLES renderer on dekstop (#7274)\n- Architecture support: Support for Linux RISC-V has been added. The gdx-xxx-natives-desktop.jar files now also contain native libraries for this architecture.\n\n[1.12.1]\n- LWJGL3 Improvement: Audio device is automatically switched if it was changed in the operating system.\n- Tiled Fix: TiledLayer parallax default values fix\n- API Addition: TiledDrawable: Align can be set to manipulate the alignment of the rendering (TiledDrawable#setAlign, TiledDrawable#getAlign)\n- API Addition: TiledDrawable#draw: Also available as a static function (with align) if you don't want to create an extra instance per texture region\n- Android: Removed mouse catching added on 1.12.0 due to unintended effects (see #7187).\n- Android: Fixed touch state inconsistency when touching screen with 3 fingers on some devices (see #7256)\n- iOS: Update to MobiVM 2.3.20\n- API Addition: Using \"object\" property in Tiled object now fetches MapObject being pointed to, and BaseTmxMapLoader includes method for fetching map where key is id and value is MapObject instance.\n- Update to LWJGL 3.3.3\n- API Addition: Vector4 is just like Vector2 or Vector3, but with x, y, z, and w float components; a Vector4 can be passed as a shader uniform.\n- Fix: Fix crash with ANGLE GLES renderer\n- API Change: Use STBVorbis to decode ogg data for Sound\n- API Change: Remove usage of deprecated tag on GL30\n- Lower GLIBC requirements to 2.17 in order to support older Linux systems\n- Fix: Fix setCursor releasing the caught cursor on the LWJGL 3 backend.\n- Fix crash in ParticleEditor and Flame \n- Fix bitwise precedence in ModelBatch#addMesh (float[] vertices, short[] indices)\n- Improve the default font's compatibility with GL30\n- Fix potential IndexOutOfBoundsException on AsynchronousAndroidSound\n- API Addition: GwtGL20 & GwtGL30#glGetFramebufferAttachmentParameteriv \n- Fix Tiled classes not being registered in the reflection cache\n- Fix: Change androidx.fragment dependency to compileOnly\n- Fix borderless fullscreen when taskbar is on the left/top\n\n[1.12.0]\n- [BREAKING CHANGE] Added #touchCancelled to InputProcessor interface, see #6871.\n- [BREAKING CHANGE] Android: Immersive mode is now true by default. Set `useImmersiveMode` config to `false` to disable it.\n- [BREAKING CHANGE] iOS: Increased min supported iOS version to 11.0. Update your Info.plist file if necessary.\n- [BREAKING CHANGE] iOS: `hideHomeIndicator` set to `false` by default (was `true`).\n- [BREAKING CHANGE] iOS: `screenEdgesDeferringSystemGestures` set to `UIRectEdge.All` by default (was `UIRectEdge.None`).\n- [BREAKING CHANGE] iOS: preferred FPS is now uncapped by default, see #6717\n- [BREAKING CHANGE] iOS: `ApplicationListener.create` and first `resize` are now called within `UIApplicationDelegate.didFinishLaunching`. Allows for earlier rendering and prevents black screen frames after launch screen. NOTE: App will get terminated if this method is blocked for more than 10-20 sec. \n- [BREAKING CHANGE] Actor#localToAscendantCoordinates throws an exception if the specified actor is not an ascendant.\n- [BREAKING CHANGE] WidgetGroup#hit first validates the layout.\n- [BREAKING CHANGE] Cell getters return object wrapper instead of primitives.\n- [BREAKING CHANGE] MeshPartBuilder#lastIndex now returns int instead of short.\n- [BREAKING CHANGE] 3D API - max bone weights is now configurable and limited to 4 by default. Change this value if you need less or more. See #6522.\n- [BREAKING CHANGE] Mesh#getVerticesBuffer, Mesh#getIndicesBuffer, VertexData#getBuffer, and IndexData#getBuffer are deprecated in favor to new methods with boolean parameter. If you subclassed some of these classes, you need to implement the new methods.\n- [BREAKING CHANGE] Desktop: The return value of AudioDevice#getLatency() is now in samples, and not milliseconds\n- [BREAKING CHANGE] iOS: 32 bit (armv7) builds are no longer supported. Builds must be 64 bit (arm64) only.\n- [BREAKING CHANGE] iOS: Use dynamic frameworks instead of static libs\n- [BREAKING CHANGE] optimized Mesh#bind and Mesh#unbind have a new parameter for instanced attribute locations. If you use these methods without instancing, you can pass a null value.\n- [BREAKING CHANGE] Dropped support for older libc versions since libGDX is now built on Ubuntu 20.04  (#7005)\n- [KNOWN ISSUE] Android drag behaviour. Gdx.input.getDeltaX() and Gdx.input.getDeltaY always return 0 for pointer 0. Fixed on next version.\n- Update to jnigen 2.4.1\n- LWJGL Fix: setPosision() for MP3 files.\n- iOS: Add new MobiVM MetalANGLE backend\n- iOS: Update to MobiVM 2.3.19\n- Update to LWJGL 3.3.2\n- API Addition: Added Audio#switchOutputDevice and Audio#getAvailableOutputDevices to specify output devices. Only works for LWJGL3\n- Fix LWJGL3: Audio doesn't die anymore, if a device gets disconnected\n- API Addition: Added Haptics API with 4 different Input#vibrate() methods with complete Android and iOS implementations.\n- API Addition: Vector2: Added static methods for angleDeg and angleRad\n- Fix: Fixed Android and iOS touch cancelled related issues, see #6871.\n- Javadoc: Add \"-use\" flag to javadoc generation\n- Android: gdx-setup now uses AGP 7.2.2 and SDK 32, requiring Android Studio Chipmunk or IntelliJ IDEA 2022.2 and JDK 11.\n- libGDX is now built using Java 11 due to new Android requirements. The rest of libGDX can still be built with JDK 8 and runtime compatibility of libGDX projects should be unaffected.\n- Fixed glViewport when using HdpiMode.Logical with the LWJGL3 backend.\n- Added Stage#actorRemoved to fire exit events just before an actor is removed.\n- ScrollPane#setScrollingDisabled avoids invalidate() if nothing changed.\n- Fixed incorrect ScrollPane#scrollTo.\n- API Addition: Added Texture3D support\n- Fix: Throw an exception when maximum Attribute count is reached to prevent silent failure.\n- API Fix: The cursor can now be catched on Android.\n- LWJGL3 Fix: Stereo audio can now be played on mono output devices. This may also improve downmixing to stereo and upmixing to surround.\n- API Addition: Added CheckBox#getImageDrawable.\n- FIX: HexagonalTiledMapRenderer now displays maps with the correct stagger index.\n- API Addition: Added I18NBundle#keys() method.\n- TOOLS Features: Save mode can be changed in Flame particle 3D editor.\n- API Addition: added WebGL 2.0 implementation to Gwt backend : you can enable it by GwtApplicationConfiguration#useGL30\n- Added GLES31 and GLES32 support with Lwjgl3 backend implementation\n- API Addition: JsonReader#stop() to stop parsing.\n- API Change: TextureAtlas now uses FileHandle#reader so outside code can control the charset\n- API Fix: Intersector#isPointInTriangle\n- API Addition: The Skin serializer now supports useIntegerPositions\n- API Change: The skin serializer now treats scaledSize as a float\n- API Change: DataInput throws an EOF-Exception\n- API Fix: RenderBuffer leak in GLFrameBuffer class\n- API Change: Pixmap#setPixels will now verify it has been given a direct ByteBuffer\n- API Addition: glTexImage2D and glTexSubImage2D with offset parameter\n- API Addition: OrientedBoundingBox\n- API Addition: Tiled parallax factor support\n- API Fix: LWJGL 3’s borderless fullscreen works with negative monitor coords\n- API Fix: Update mouse x and y values immediately after calling #setCursorPosition\n- API Change: Never stall with AssetManager on GWT\n- API Change: Allow packed depth stencil buffer creation when not using GL30\n- API Fix: Fixed DataInput#readString for non-ASCII\n- API Fix: LwjglGraphics.setupDisplay() is no longer choosing the wrong display mode\n- API Fix: MathUtils.lerpAngle() fixed for extreme inputs\n- MathUtils trigonometry improvements\n- Various Scene2D fixes and improvements\n- Fix: JsonValue#addChild now clears leftover list pointers, preventing inconsistent or looping JSON objects.\n\n[1.11.0]\n- [BREAKING CHANGE] iOS: Increased min supported iOS version to 9.0. Update your Info.plist file if necessary.\n- [BREAKING CHANGE] Removed Maven and Ant build systems. libGDX is now solely built with Gradle. See https://libgdx.com/dev/from-source/ for updated build instructions.\n- [BREAKING CHANGE] Android Moved natives loading out of static init block, see #5795\n- [BREAKING CHANGE] Linux: Shared libraries are now built on Ubuntu 18.04 (up from Ubuntu 16.04)\n- [BREAKING CHANGE] The built-in font files arial-15.fnt and arial-15.png have been replaced with lsans-15.fnt and lsans-15.png; this may change some text layout that uses the built-in font, and code that expects arial-15 assets to be present must change to lsans-15.\n- [BREAKING CHANGE] Legacy LWJGL3 projects must update the sourceCompatibility to 1.8 or higher.\n- [BREAKING CHANGE] Android Removed hideStatusBar configuration, see #6683\n- [BREAKING CHANGE] Lwjgl3ApplicationConfiguration#useOpenGL3 was replaced by #setOpenGLEmulation\n- Gradle build now takes -PjavaVersion=7|8|9... to specify the Java version against which to compile libGDX. Default is Java 7 for everything, except the LWJGL3 backend, which is compiled for Java 8.\n- LWJGL3 extension: Added gdx-lwjgl3-glfw-awt-macos extension. Fixes GLFW in such a way, that the LWJGL3/libGDX must no longer run on the main thread in macOS, which allows AWT to work in parallel, i.e. file dialogs, JFrames, ImageIO, etc. You no longer need to pass `-XstartOnFirstThread` when starting an LWJGL3 app on macOS. See `AwtTestLWJGL` in gdx-tests-lwjgl3. For more information, see https://github.com/libgdx/libgdx/pull/6772\n- API Addition: Added LWJGL3 ANGLE support for x86_64 Windows, Linux, and macOS. Emulates OpenGL ES 2.0 through DirectX (Windows), desktop OpenGL (Linux), and Metal (macOS). May become the preferred method of rendering on macOS if Apple removes OpenGL support entirely. May fix some OpenGL driver issues. More information here: https://github.com/libgdx/libgdx/pull/6672\n- iOS: Update to MobiVM 2.3.16\n- Update to LWJGL 3.3.1\n- API Addition: ObjLoader now supports ambientColor, ambientTexture, transparencyTexture, specularTexture and shininessTexture\n- API Addition: PointSpriteParticleBatch blending is now configurable.\n- TOOLS Features: Blending mode and sort mode can be changed in Flame particle 3D editor.\n- API Addition: Polygon methods setVertex, getVertex, getVertexCount, getCentroid.\n- API Addition: TMX built-in tile property \"type\" is now supported.\n- API Addition: Octree structure.\n- API Addition: Added StringBuilder#toStringAndClear() method.\n- FirstPersonCameraController keys mapping is now configurable\n- Fix: GlyphLayout: Several fixes for color markup runs with multi-line or wrapping texts\n- API change: GlyphLayout#GlyphRun is now one GlyphRun per line. \"color\" was removed from GlyphRun and is now handled by GlyphLayout.\n- Gdx Setup Tool: Target Android API 30 and update AGP plugin to 4.1.3\n- API Fix: Sound IDs are now properly removed; this prevents changes to music instances with the same ID\n- API Fix: LWJGL3Net#openURI does now work on macOS & JDK >= 16\n- API Fix: Fixed a possible deadlock with AssetManager#dispose() and #clear()\n- API Change: Enable the AL_DIRECT_CHANNELS_SOFT option for Sounds and AudioDevices as well to fix stereo sound\n- API Addition: CameraInputController#setInvertedControls(boolean)\n- API Removal: AnimatedTiledMapTile#frameCount\n- LWJGL 3 is now the default desktop backend. If you want to port your existing applications, take a look here: https://gist.github.com/crykn/eb37cb4f7a03d006b3a0ecad27292a2d\n- Brought the official and third-party extensions in gdx-setup up to date. Removed some unmaintained ones and added gdx-websockets & jbump.\n- API Fix: Escaped characters in XML attributes are now properly un-escaped\n- Bug Fix: AssetManager backslash conversion removed - fixes use of filenames containing backslashes\n- gdx-setup now places the assets directory in project root instead of android or core. See advanced settings (UI) or arguments (command line) if you don't want it in root.\n- API Fix: Resolved issues with LWJGL 3 and borderless fullscreen\n- API Addition: GeometryUtils,polygons isCCW, ensureClockwise, reverseVertices\n- API Addition: Added FreeTypeFontGenerator#hasCharGlyph method.\n- API Fix: Pool discard method now resets object by default. This fixes the known issue about Pool in libGDX 1.10.0.\n- API Addition: Split GWT reflection cache into two generated classes\n- API Fix: Fix Box2D memory leak with ropes on GWT\n- API Fix: Fix NPE in Type#getDeclaredAnnotation\n- API Addition: Add pause/resume methods to AudioDevice\n- API Fix: Protection against NullPointerException in World#destroyBody()\n- API Fix: Prevent repeated mipmap generation in FileTextureArrayData\n- API Fix: Fix issue with camera reference in CameraGroupStrategy’s default sorter\n- API Fix: Move vertex array index buffer limit to backends to fix issue with numIndices parameter\n- API Fix: TexturePacker: Fix wrong Y value when using padding\n- API Fix: Lwjgl3Net: Add fallback to xdg-open on Linux if Desktop.BROWSE is unavailable\n- API Addition: Add NWSEResize, NESWResize, AllResize, NotAllowed and None SystemCursors\n- API Addition: GWTApplication#getJavaHeap and getNativeHeap are now supported\n- API Addition: Box2D Shape now implements Disposable\n- API Addition: Added ChainShape#clear method\n- API Addition: Added Tooltip#setTouchIndependent; see #6758\n- API Addition: Emulate Timer#isEmpty on GWT\n- API Addition: Bits add copy constructor public Bits (Bits bitsToCpy)\n- API Addition: Added List#drawSelection().\n- API Addition: GwtApplicationConfiguration#xrCompatible \n- API Fix: setSystemCursor() now works on Android\n- API Fix: getDisplayMode() is now more accurate on Android and GWT.\n- API Addition: JsonValue#iterator(String) to more easily iterate a child that may not exist.\n- API Addition: Added ExtendViewport#setScaling, eg for use with Scaling.contain.\n- API Addition: Added application lifecycle methods to IOSAudio for custom audio implementations.\n- API Addition: Added getBoundingRectangle() to Polyline\n- API Addition: ShapeRenderer#check() has now protected visibility\n- API Addition: Add ability to host GWT module on a different domain than the site, see #6851\n- API Addition: Addes Tooltip#setTouchIndependent; see #6758\n- API ADDITION: Emulate Timer#isEmpty on GWT\n- API Addition: OrientedBoundingBox.\n\n[1.10.0]\n- [BREAKING CHANGE] Android armeabi support has been removed. To migrate your projects: remove any dependency with natives-armeabi qualifier from your gradle build file, this apply to gdx-platform, gdx-bullet-platform, gdx-freetype-platform and gdx-box2d-platform.\n- [BREAKING CHANGE] tvOS libraries have been removed. No migration steps required.\n- [BREAKING CHANGE] Linux x86 (32-bit) support has been removed. No migration steps required.\n- [BREAKING CHANGE] Requires Java 7 or above.\n- [BREAKING CHANGE] API Change: Scaling is now an object instead of an enum. This may change behavior when used with serialization.\n- [BREAKING CHANGE] Group#clear() and #clearChildren() now unfocus the children. Added clear(boolean) and clearChildren(boolean) for when this isn't wanted. Code that overrides clear()/clearChildren() probably should change to override the (boolean) method. #6423\n- [BREAKING CHANGE] Lwjgl3WindowConfiguration#autoIconify is enabled by default.\n- [KNOWN ISSUE] Pool no longer reset freed objects when pool size is above its retention limit. Pool will discard objects instead. If you want to keep the old behavior, you should override Pool#discard method to reset discarded objects.\n- Scene2d.ui: Added new ParticleEffectActor to use particle effects on Stage\n- API addition: iOS: Added HdpiMode option to IOSApplicationConfiguration to allow users to set whether they want to work in logical or raw pixels (default logical).\n- Fix for #6377 Gdx.net.openURI not working with targetSdk 30\n- Api Addition: Added a Pool#discard(T) method.\n- Architecture support: Linux ARM and AARCH64 support has been added. The gdx-xxx-natives.jar files now contain native libraries of these architectures as well.\n- API Addition: Desktop Sound now returns number of channels and sample rate.\n\n[1.9.14]\n- [BREAKING CHANGE] iOS: IOSUIViewController has been moved to its own separate class \n- [BREAKING CHANGE] API Change: G3D AnimationDesc#update now returns -1 (instead of 0) if animation not finished.\n- [BREAKING CHANGE] InputEventQueue no longer implements InputProcessor, pass InputProcessor to #drain.\n- [BREAKING CHANGE] HeadlessApplicationConfiguration#renderInterval was changed to #updatesPerSecond\n- API addition: Added Pixmap#setPixels(ByteBuffer).\n- API change: ScreenUtils#getFrameBufferPixmap is deprecated in favor to new method Pixmap#createFromFrameBuffer.\n- API Addition: Added overridable createFiles() methods to backend application classes to allow initializing custom module implementations.\n- API Addition: Add a Graphics#setForegroundFPS() method.\n\n[1.9.13]\n- [BREAKING CHANGE] Fixed keycode representations for ESCAPE, END, INSERT and F1 to F12. These keys are working on Android now, but if you hardcoded or saved the values you might need to migrate.\n- [BREAKING CHANGE] TextureAtlas.AtlasRegion and Region splits and pads fields have been removed and moved to name/value pairs, use #findValue(\"split\") and #findValue(\"pad\") instead.\n- iOS: Update to MobiVM 2.3.12\n- GWT: Key codes set with Gdx.input.setCatchKey prevent default browser behaviour\n- Added Scaling.contain mode: Scales the source to fit the target while keeping the same aspect ratio, but the source is not scaled at all if smaller in both directions.\n- API Addition: Added hasContents() to Clipboard interface, to reduce clipboard notifications on iOS 14\n- TOOLS Features: Blending mode can be changed in Flame particle 3D editor.\n- Input Keycodes added: CAPS_LOCK, PAUSE (aka Break), PRINT_SCREEN, SCROLL_LOCK, F13 to F24, NUMPAD_DIVIDE, NUMPAD_MULTIPLY, NUMPAD_SUBTRACT, NUMPAD_ADD, NUMPAD_DOT, NUMPAD_COMMA, NUMPAD_ENTER, NUMPAD_EQUALS, NUMPAD_LEFT_PAREN, NUMPAD_RIGHT_PAREN, NUM_LOCK.\n  Following changes might be done depending on platform: Keys.STAR to Keys.NUMPAD_MULTIPLY, Keys.SLASH to Keys.NUMPAD_DIVIDE, Keys.NUM to Keys.NUM_LOCK, Keys.COMMA to Keys.NUMPAD_COMMA, Keys.PERIOD to Keys.NUMPAD_DOT, Keys.COMMA to Keys.NUMPAD_COMMA, Keys.ENTER to Keys.NUMPAD_ENTER, Keys.PLUS to Keys.NUMPAD_ADD, Keys.MINUS to Keys.NUMPAD_SUBTRACT\n- Added a QuadFloatTree class.\n- Desktop: Cubemap Seamless feature is now enabled by default when supported, can be changed via backend specific methods, see supportsCubeMapSeamless and enableCubeMapSeamless in both LwjglGraphics and Lwjgl3Graphics.\n- API Addition: TextureAtlas reads arbitrary name/value pairs for each region. See #6316.\n- TexturePacker writes using a new format when legacyOutput is false (default is true). TextureAtlas can read both old and new formats. See #6316.\n\n[1.9.12]\n- [BREAKING CHANGE] iOS: Changed how Retina/hdpi handled on iOS. See #3709.\n- [BREAKING CHANGE] API Change: InputProcessor scrolled method now receives scroll amount for X and Y. Changed type to float to support devices which report fractional scroll amounts. Updated InputEvent in scene2d accordingly: added scrollAmountX, scrollAmountY attributes and corresponding setters and getters. See #6154.\n- [BREAKING CHANGE] API Change: Vector2 angleRad(Vector2) now correctly returns counter-clockwise angles. See #5428\n- [BREAKING CHANGE] Android: getDeltaTime() now returns the raw delta time instead of a smoothed one. See #6228.\n- Fixed vertices returned by Decal.getVertices() not being updated\n- Fixes Issue #5048. The function Intersector.overlapConvexPolygons now should return the right minimum translation vector values.\n- Update to MobiVM 2.3.11\n- API Change: Removed Pool constructor with preFill parameter in favor of using Pool#fill() method. See #6117\n- API Addition: Slider can now be configured to only trigger on certain mouse button clicks (Slider#setButton(int)).\n- Fixed GlyphLayout not laying out correctly with color markup.\n- Fixed TileDrawable not applying its scale correctly.\n- API Addition: Added epsilon methods to maps with float values.\n- API Addition: Added an insertRange method to array collections.\n- Fixed GestureDetector maxFlingDelay.\n- API Change: Changed default GestureDetector maxFlingDelay to Integer.MAX_VALUE (didn't work before, this matches that).\n- Gdx.files.external on Android now uses app external storage - see wiki article File handling for more information\n- Improved text, cursor and selection rendering in TextArea.\n- API Addition: Added setProgrammaticChangeEvents, updateVisualValue, round methods to ProgressBar/Slider.\n- iOS: Keyboard events working on RoboVM on iOS 13.5 and up, uses same API as on other platforms\n- API Addition: Added AndroidLiveWallpaper.notifyColorsChanged() to communicate visually significant colors back to the wallpaper engine.\n- API Change: AssetManager invokes the loaded callback when an asset is unloaded from the load queue if the asset is already loaded.\n- GWT: changed audio backend to WebAudio API. Now working on mobiles, pitch implemented. Configuration change: preferFlash removed. When updating existing projects, you can remove the soundmanager js files from your webapp folder and the references to it from index.html\n- GWT: added possibility to lazy load assets via AssetManager instead of preload them before game start. See GWT specifics wiki article for more information.\n- GWT: New configuration setting usePhysicalPixels to use native resolution on mobile / Retina / HDPI screens. When using this option, make sure to update your code in index.html and HTMLLauncher from setup template.\n- GWT: GwtApplicationConfiguration and GWT backend now support an application to be resizable or fixed size. You can remove your own resizing code from your HTMLLaunchers.\n- GWT: Assets in distribute build are renamed with md5 hash suffix to bypass browser cache on changes\n- GWT: Fixed GwtFileHandle that was only returning text assets when listing a directory, now returns all children\n- API Addition: Pixmap.downloadFromUrl() downloads an image from http(s) URLs and passes it back as a Pixmap on all platforms\n- Added support for Linux ARM builds.\n\t- 32-bit: ARMv7/armhf\n\t- 64-bit: ARMv8/AArch64\n- API Change: Removed arm abi from SharedLibraryLoader\n- API Addition: Added a Lwjgl3ApplicationConfiguration#foregroundFPS option.\n- API Change: Utility classes are now final and have a private constructor to prevent instantiation.\n- API Change: ScrollPane now supports all combinations of scrollBarsOnTop and fadeScrollBars.\n- API Addition: Added new methods with a \"deg\" suffix in the method's name for all Vector2 degrees-based methods and deprecated the old ones.\n- API Addition: Added Slider#setVisualPercent.\n- API Change: Enabling fullscreen mode on the lwjgl3 backend now automatically sets the vsync setting again.\n- API Addition: Added put(key, value, defaultValue) for maps with primitive keys, so the old value can be returned.\n- API Addition: Added ObjectLongMap.\n- Added Intersector#intersectRayOrientedBoundsFast to detect if a ray intersects an oriented bounding box, see https://github.com/libgdx/libgdx/pull/6139\n- API Addition: Added Table#clip() and Container#clip() methods.\n- API Addition: Added getBackgroundDrawable() to Button.\n- API Addition: Added imageCheckedDown and getImageDrawable() to ImageButton and ImageTextButton.\n- API Addition: Added focusedFontColor, checkedFocusedFontColor, and getFontColor() to TextButton and ImageTextButton.\n- API Addition: Added wrapReverse setting to HorizontalGroup.\n- API Addition: Added Slider style drawables for over and down: background, knobBefore, and knobAfter.\n- Fixed LwjglFrame not hiding the canvas in some situations.\n- API Change: Table#round uses ceil/floor and is applied during layout, rather than afterward.\n- Fixed blurry NinePatch rendering when using a single center region.\n- API Change: Upon changing the window size with the lwjgl3 backend, the window is centered on the monitor.\n- Fixed DepthShaderProvider no longer creates one DepthShader per bones count. Now it creates only one skinned variant and one non-skinned variant based on DepthShader/Config numBones.\n- API Addition: Added Intersector#intersectPlanes to calculate the point intersected by three planes, see https://github.com/libgdx/libgdx/pull/6217\n- API Addition: Added alternative Android Audio implementation for performant sound. See https://github.com/libgdx/libgdx/pull/6243.\n- API Addition: Expose SpriteBatch and PolygonSpriteBatch setupMatrices() as protected.\n- API Addition: New parameter OnscreenKeyboardType for Input.setOnscreenKeyboardVisible and Input.getTextInput \n\n[1.9.11]\n- Update to MobiVM 2.3.8\n- Update to LWJGL 3.2.3\n- Fixed AndroidInput crashes due to missing array resize (pressure array).\n- API Change: Ray#set methods and Ray#mul(Matrix4) normalize direction vector. Use public field to set and avoid nor()\n- API Change: New internal implementation of all Map and Set classes (except ArrayMap) to avoid OutOfMemoryErrors when too many keys collide. This also helps resistance against malicious users who can choose problematic names.\n- API Addition: OrderedMap#alter(Object,Object) and OrderedMap#alterIndex(int,Object) allow swapping out a key in-place without changing its value; OrderedSet also has this.\n- API Addition: Json can now read/write: ObjectIntMap, ObjectFloatMap, IntMap, LongMap.\n- API Addition: Added @Null annotation for IDE null analysis. All parameters and return values should be considered non-null unless annotated (or javadoc'ed if not yet annotated).\n- API Addition: Added ParticleEmitter#preAllocateParticles() and ParticleEffect#preAllocateParticles() to avoid particle allocations during updates.\n- Fixed changing looping state of already playing sounds on Android by first pausing the sound before setting the looping state (see #5822).\n- API Change: scene2d: Table#getRow now returns -1 when over the table but not over a row (used to return the last row).\n- API Change: scene2d: Tree#addToTree and #removeFromTree now have an \"int actorIndex\" parameter.\n- API Addition: scene2d: Convenience method Actions#targeting(Actor, Action) to set an action's target.\n- API Change: scene2d: In TextField, only revert the text if the change event was cancelled. This allows the text to be manipulated in the change listener.\n- API Change: scene2d: Tree.Node#removeAll renamed to clearChildren.\n- API Addition: scene2d: Added SelectBox#setSelectedPrefWidth to make the pref width based on the selected item and SelectBoxStyle#overFontColor.\n- API Change: DefaultTextureBinder WEIGHTED strategy replaced by LRU strategy.\n- API Change: ShaderProgram begin and end methods are deprecated in favor to bind method.\n- API Addition: Added a OpenALAudio#getSourceId(long) method.\n- API Addition: Added a ShaderProgram#getHandle() method.\n- API Change: Replaced deprecated android support libraries with androidx. AndroidFragmentApplication is only affected.\n- API Addition: Created interfaces AndroidAudio and AndroidInput and added AndroidApplication#createAudio and AndroidApplication#createInput to allow initializing custom module implementations.\n- Allows up to 64k (65536) vertices in a Mesh instead of 32k before. Indices can use unsigned short range, so index above 32767 should be converted to int using bitwise mask, eg. int unsigneShortIndex = (shortIndex & 0xFFFF).\n- API Change: DragAndDrop only removes actors that were not already in the stage. This is to better support using a source actor as the drag actor, see #5675 and #5403.\n- API Change: Changed TiledMapTileLayer#tileWidth & #tileHeight from float to int\n- API Addition: convenient Matrix4 rotate methods: rotateTowardDirection and rotateTowardTarget\n- API Addition: Convenience method Actions#targeting(Actor, Action) to set an action's target.\n- API Change: Correction of TextField#ENTER_ANDROID renamed to NEWLINE and TextField#ENTER_DESKTOP renamed to CARRIAGE_RETURN.\n- API Change: Changed the visibility of TextField#BULLET, TextField#DELETE, TextField#TAB and TextField#BACKSPACE to protected.\n- API Addition: TextField and TextArea are providing the protected method TextField#checkFocusTraverse(char) to handle the focus traversal.\n- API Addition: UIUtils provides the constants UIUtils#isAndroid and UIUtils#isIos now.\n- Fixed: The behaving of TextFields and TextAreas new line and focus traversal works like intended on all platforms now.\n- API Change: Changed Base64Coder#encodeString() to use UTF-8 instead of the platform default encoding. See #6061\n- Fixed: SphereShapeBuilder poles are now merged which removes lighting artifacts, see #6068 for more information.\n- API Change: Matrix3#setToRotation(Vector3, float float) now rotates counter-clockwise about the axis provided. This also changes Matrix3:setToRotation(Vector3, float) and the 3d particles will rotate counter-clockwise as well. \n- API Change: TexturePacker uses a dash when naming atlas page image files if the name ends with a digit or a digit + 'x'.\n- API Addition: Added Skin#setScale to control the size of drawables from the skin. This enables scaling a UI and using different sized images to match, without affecting layout.\n- API Change: Moved adding touch focus from Actor#notify to InputListener#handle (see #6082). Code that overrides InputListener#handle or otherwise handles InputEvent.Type.touchDown events must now call Stage#addTouchFocus to get touchDragged and touchUp events.\n- API Addition: Added AsynchronousAssetLoader#unloadAsync to fix memory leaks when an asset is unloaded during loading.\n- Fixed Label text wrapping when it shouldn't (#6098).\n- Fixed ShapeRenderer not being able to render alpha 0xff (was max 0xfe).\n- API Change: glGetActiveUniform and glGetActiveAttrib parameter changed from Buffer to IntBuffer.\n\n[1.9.10]\n- API Addition: Allow target display for maximization LWJGL3 backend\n- API Addition: Accelerometer support on GWT\n- API Change: Set default behaviour of iOS audio to allow use of iPod\n- API Change: IOSDevice is no longer an enum to allow users to add their own new devices when LibGDX is not up to date\n- API Addition: Add statusBarVisible configuration to IOSApplicationConfiguration\n- Update GWT Backend to GWT 2.8.2\n- Update Android backend to build against API 28 (Android 9.0)\n- API Addition: Input.isButtonJustPressed\n- Update to LWJGL 2 backend to 2.9.3\n- Update to MobiVM 2.3.6 release\n- Update to LWJGL 3.2.1\n- API Addition: Input allows getting the maximum number of pointers supported by the backend\n- API Addition: Configuration option added to allow setting a max number of threads to use for net requests\n- API Change: NetJavaImpl now uses a cached thread pool to allow concurrent requests (by default, the thread pool is unbounded - use maxNetThreads in backend configurations to set a limit - set to 1 for previous behavior)\n- API Addition: New MathUtils norm and map methods\n- API Change: Pixmap blending was incorrect. Generated fonts may change for the better, but may require adjusting font settings.\n- API Change: Particle effects obtained from a ParticleEffectPool are now automatically started\n- Removed OSX 32-bit support\n- API Change: By default LWJGL2 backend no longer does pause/resume when becoming background/foreground window. New app config setting was added to enable the old behavior.\n- API Change: By default LWJGL2 backend now does pause/resume when window is minimized/restored. New app config setting was added to disable this behavior.\n- LWJGL3: Fixed window creation ignoring refresh rate of fullscreen mode.\n- TmxMapLoader and AtlasTmxMapLoader refactoring: Shared functionality was moved to BaseTmxMapLoader, duplicate code was removed.\n- AtlasTmxMapLoader supports group layers now (a positive side effect of the BaseTmxMapLoader refactoring).\n- API Change: TmxMapLoader and AtlasTmxMapLoader: load/loadAsync methods work exactly as before, but many methods of these classes had to change. This makes it possible implement new Tiled features.\n- API Addition: TextField#drawMessageText.\n- Fixed TextField rendering text outside the widget at small sizes.\n- API Addition: Group#getChild(int)\n- API Addition: notEmpty() for collections.\n- API Change: scene2d.ui Tree methods renamed for node set/getObject to set/getValue.\n- API Change: scene2d.ui Tree and Tree.Node require generics for the type of node, values, and actors.\n- API Change: For Selection in scene2d.utils \"toggle\" is now respected when !required and selected.size == 1.\n- API Addition: new InstanceBufferObject and InstanceBufferObjectSubData classes to enable instanced rendering.\n- API Addition: Support for InstancedRendering via Mesh\n- API Change: Cell#setLayout renamed to setTable.\n- API Addition: Added Collections#allocateIterators. When true, iterators are allocated. When false (default), iterators cannot be used nested.\n- API Addition: Added Group#removeActorAt(int,boolean) to avoid looking up the actor index. Subclasses intending to take action when an actor is removed may need to override this new method.\n- API Change: If Group#addActorAfter is called with an afterActor not in the group, the actor is added as the last child (not the first).\n\n[1.9.9]\n- API Addition: Add support for stripping whitespace in PixmapPacker\n- API Addition: Add support for 9 patch packing in PixmapPacker\n- API Addition: Pressure support for ios/android. https://github.com/libgdx/libgdx/pull/5270\n- Update to Lwjgl 3.2.0\n- Update android level we build against to 7.1 (API 25)\n- API Change: gdx-tools no longer bundles dependencies to be compatible with java 9\n- Skin JSON files can now use the simple names of classes, i.e. \"BitmapFont\" rather than \"com.badlogic.gdx.graphics.g2d.BitmapFont\". Custom classes can be added by overriding Skin.getJsonLoader() and calling json.setClassTag().\n- Skin supports cascading styles in JSON. Use the \"parent\" property to tag another style by name to use its values as defaults. See https://github.com/libgdx/libgdx/blob/master/tests/gdx-tests-android/assets/data/uiskin.json for example.\n- SkinLoader can be used on subclasses of Skin by overriding generateSkin(). \n- API addition: Tree indentation can be customized.\n- Fixed GlyphLayout not respecting BitmapFontData#down.\n- API Addition: Added faceIndex paramter to #FreeTypeFontGenerator(FileHandle, int).\n- API Change: BitmapFont#getSpaceWidth changed to BitmapFont#getSpaceXadvance.\n- Many GlyphLayout fixes.\n- API Addition: Added FileHandle#map(), can be used to memory map a file\n- API Change: BitmapFontData#getGlyphs changed for better glyph layout. See https://github.com/libgdx/libgdx/commit/9a7dfdff3c6374a5ebd2f33a819982aceb287dfa\n- API Change: Actor#hit is now responsible for returning null if invisible. #5264\n- API Addition: Added [Collection]#isEmpty() method to all 22 custom LibGDX-collections (e.g. Array, ObjectMap, ObjectSet, Queue, ...)\n- API Addition: StringBuilder#clear()\n- API Addition: Color#WHITE_FLOAT_BITS\n- Table layout fixed when expand is used and the layout width is less than the table's min width.\n- InputMultiplexer#setProcessors(Array) now copies the items instead of using the specified array instance.\n- API Change: A wrapped HorizontalGroup or VerticalGroup will now size children down to their min size if the group is smaller than their pref size.\n- LWJGL3: useVSync() is now a per-window setting. Any additional windows should disable vsync to avoid frames dropping to (refresh rate / # of windows).\n- Batch and sprite implementations and SpriteCache store Color separately from the float packed color, since converting to/from float is lossy.\n- API Change: NumberUtils floatToIntColor expands the alpha from 0-254 to 0-255, so 255 doesn't become 254 from conversion from int to float to int.\n- API Change: Batch and Decal setColor(float) renamed to setPackedColor for differentiation, since the conversion from float to Color is lossy.\n- API Change: PolygonSprite getVertexColor renamed to getPackedColor to match other classes.\n- API Change: FreeTypeFontGenerator only generates a missing glyph if \\0 is in the characters.\n- API Change: DragScrollListener no longer requires the touch/mouse cursor to be directly above/below the scroll pane.\n- API Change: List#toString(Object) changed from protected to public. Subclasses overriding this need to change to public.\n- API Change: List now handles more key presses.\n- API Change: TexturePacker ImageProcessor#addImage(File, String) now returns the Rect.\n\n\n[1.9.8]\n- Add iPhoneX images\n- Fix MacOS issue with GL_ARB_texture_float extension check\n- Fix AtlasTmxMapLoader tileset tile id offset\n- Bullet: updated to 2.87, see: http://bulletphysics.org/wordpress/?p=485\n- API Addition: Possibility to specify TexturePacker settings for resampling when scaling.\n- API Addition: Support for customizing render buffer attachments in GLFrameBuffers\n- API Change: Revert to constructors for GLFrameBuffers for easier customization\n\n[1.9.7]\n- Update to MobiVM(RoboVM) 2.3.3\n- Add iOS 11 support\n- Update to Lwjgl 3.1.3\n- Update to MOE 1.4.0\n- API Change: GLFrameBuffer has been refactored https://github.com/libgdx/libgdx/pull/4882. Create standard FrameBuffers with static methods. Customized FBOS with FrameBufferBuilder\n- API addition: Tiled group layer support \n- Fix Tiled properties, offset parsing for image layers\n- API addition: Added utility methods for Vector equals with epsilon\n- Fix Animation backing array type\n- Fix Mesh copying with 0 indices \n- Fix restoration of pooled particle effects scale\n- Fix loss of controller listeners on reconnect\n- Added basic kotlin project generation support in the setup tool\n- API addition: Allow APK expansion to be used in fragments and activities\n- API addition: Added color properties support from tiled maps\n- API Change: Added rotation vector sensor support on Android\n- API Change: GLProfiler refactored for OOP and lwjgl3 multi windows\n- LWJGL3: The creation of additional windows via Lwjgl3Application.newWindow() is now deferred, with postRunnable(), until all existing windows have been updated. This fixes a potential native crash with NVidia GL drivers on Windows, presumably caused by a GL context conflict.\n- API addition: Lwjgl3WindowListener.created() is called after a new window has been created. It's unsafe to call Lwjgl3Window functions in between Lwjgl3Application.newWindow() and this callback.\n- Updated LWJGL3 backend to 3.1.3.\n- Lwjgl3Graphics.setUndecorated() and Lwjgl3Graphics.setResizable() now delegate their work to the respective GLFW functions.\n- API addition: ProgressBar.isVertical() - returns whether a progress bar is vertical or horizontal.\n- API Change: SplitPane now by default does not allow the split amount to shrink children below their minimum sizes (cropping them). This behavior can be reverted by overriding clampSplitAmount or wrapping the children in Containers set to minSize(0) and fill(). SplitPane also now correctly includes the handle min size in its own min size calculations.\n- API Change: SplitPane.getSplit() renamed to SplitPane.getSplitAmount() to match other getter and setter names.\n- Improved internal Timer synchronization.\n- API Change: List#drawItem, added float width parameter.\n- API Addition: Make it possible to disable sound on the GWT-Backend with disableSound=true.\n- API Change: ScrollPane setWidget deprecated in favor of setActor to match other APIs.\n- API Change: removed JGLFW backend\n- Fixed mixed up use of TexturePacker.Settings.stripWhitespaceX|Y.\n- Added joystick POV support to LWJGL3 controller backend.\n- Added support for 2d particles sprite animation.\n- API Change: ParticleEmitter getSprite, setSprite, getImagePath, setImagePath are now getSprites, setSprites, getImagePaths, setImagePaths.\n- Added support for 2d particles independant scale X and Y.\n- API Change: ParticleEmitter getScale, matchSize are now getScaleX/getScaleY, matchSizeX/matchSizeY. Added scaleSize(float scaleX, float scaleY)\n- API Change: Added iconDropped() callback to AndroidWallpaperListener.\n\n[1.9.6]\n- Fix performance regression in LWJGL3 backend, use java.nio instead of BufferUtils. Those are intrinsics and quite a bit faster than BufferUtils on HotSpot.\n- Updated to latest Sound Manager 2\n- Added mappings for Xbox 360 controller for Linux\n- Separated error log for vertex/fragment shaders for easier debugging\n- Minimum Android API level is now level 9 (Android 2.3)\n- API addition: Configurable TexturePacker bleed iterations\n- Updated IOS Multi-OS Engine backend to 1.3.6\n- API Change: Pixmap.setBlending, Pixmap.setFilter are now instance methods\n- VertexAttribute expert constructors exposed. Short types can now be used for attributes.\n\n[1.9.5]\n- Fix NPE swallowing \"video driver unsupported\" error on LWJGL 2 backend.\n- Allow window icons to be set in Lwjgl3ApplicationConfiguration or Lwjgl3WindowConfiguration.\n- Allow window icon and title to be changed in Lwjgl3Window\n- API Addition: ApplicationLogger interface, allowing easier access to custom logging\n- DefaultRenderableSorter accounts for center of Renderable mesh, see https://github.com/libgdx/libgdx/pull/4319\n- Bullet: added FilterableVehicleRaycaster, see https://github.com/libgdx/libgdx/pull/4361\n- Bullet: updated to 2.85, see: http://bulletphysics.org/wordpress/?p=456\n- Updated iOS native build scripts to iOS 10.1 and TVOS 10.0\n- API Addition: BitmapFont#blankLineScale.\n- Fixed rounding of Drawables in ProgressBar. Allow rounding to be disabled with setRound().\n- Updated LWJGL3 backend to LWJGL 3.1.0, see https://blog.lwjgl.org/lwjgl-3-1-0-released/\n- LWJGL3 backend now supports non-continuous rendering, see https://github.com/libgdx/libgdx/pull/3772\n- API Change: Lwjgl3WindowListener.refreshRequested() is called when the windowing system (GLFW) reports contents of a window are dirty and need to be redrawn.\n- API Change: Lwjgl3WindowListener.maximized() is called when a window enters or exits a maximized state.\n- API Change: Lwjgl3WindowListener.deiconified() removed, combined with .iconified().\n- API Change: Lwjgl3Window.deiconify() renamed to .restore() since it can also be used to de-maximize a window.\n- Lwjgl3Window now has a maximize() method, and windows can be started maximized using the window or app configuration's setMaximized() method.\n- NinePatch can now be drawn rotated or scaled.\n- NinepatchDrawable is now a TransformDrawable.\n- API Change: Group add* methods no longer remove and re-add the actor if it is already in the group, instead they do nothing.\n- API Change: g2d.Animation is now generic so it can support Drawables, PolygonRegions, NinePatches, etc. To fix existing code, specify the TextureRegion type in animation declarations (and instantiations in Java 6), i.e. Animation<TextureRegion> myAnimation = new Animation<TextureRegion>(...);\n- TiledDrawable throws unsupported operation if trying to draw rotated/scaled. #4005\n- API Change: DragAndDrop now puts default position of drag actor at pointer location. The original default offset from the pointer was (14, -20).\n- Added ShaderProgramLoader for AssetManager.\n- BoundingBox#isValid now returns also true when min==max, see: https://github.com/libgdx/libgdx/pull/4460\n\n[1.9.4]\n- Moved snapping from ProgressBar to Slider to prevent snapping when setting the value programmatically.\n- Bullet: added btSoftBody#getLinkCount() and btSoftBody#getLink(int), see https://github.com/libgdx/libgdx/issues/4152\n- API Change: Wrapping for scene2d's HorizontalGroup and VerticalGroup.\n- Fix hiero problem with certain unicode characters. See https://github.com/libgdx/libgdx/issues/4202\n- Switched to RoboVM fork 2.2.0, fixes incompatibility with Android Gradle plugin and iOS 9.3.4\n\n[1.9.3]\n- Switched to MobiDevelop's RoboVM fork (http://robovm.mobidevelop.com)\n- Addition of Intel Multi-OS Engine backend for deploying to iOS\n- Updated iOS native build scripts to iOS 9.3 and TVOS 9.2\n- API Addition: GestureDetector#pinchStop() called when no longer pinching\n- API Addition: Gdx.graphics.setUndecorated/setResizable API added to Graphics https://github.com/libgdx/libgdx/pull/3847\n- API Addition: Gdx.graphics.getGLVersion(), grab the GL version and implementation type. https://github.com/libgdx/libgdx/pull/3788\n- API Change: Lwjgl3WindowListener -> filesDropped(String[] files) adds drag'n drop support for the lwjgl3 backend\n- Added isComplete() to ParticleEffect to make it easier to know when all the emitters are done, behaves the same as in the 2D API.\n- API Change: renamed Lwjgl3WindowListener.windowIsClosing() to closeRequested() to better communicate its intent.\n- Add IndexData.updateIndices method to increase performance when used with IndexBufferObjectSubData. \n- Added FlushablePool\n- Added ShapeCache see https://github.com/libgdx/libgdx/pull/3953\n- API Change: moved shape builder logic out of MeshBuilder, see: https://github.com/libgdx/libgdx/pull/3996\n- API Change: changed copy constructor OrderedMap(ObjectMap) to OrderedMap(OrderedMap)\n- API Change: Table reset now calls clearChildren, not clear.\n- Fixed crashes in AndroidMusic.java when isPlaying is called. Errors are now logged only rather than crashing the app.\n- Added emulation of ScreenUtils for GWT\n- Improved performance of glReadPixels() on GWT. New method is 20-30 times faster\n- Fixed crash on Mac when using LWJGL2, custom cursors and embedding the game in an AWT window\n- Fixed getDisplayModes(Monitor monitor) returning wrong data on LWJGL2 backend\n- Fixed Gdx.input.getCurrentEventTime() not being set on LWJGL3, fixes GestureDetector and flick scroll not working\n- Fixed not being able to select non-latin characters in TextFields\n- Bullet: added CustomActionInterface, see https://github.com/libgdx/libgdx/pull/4025\n- Add window size limits option to LWJGL3 app and window configurations\n- Add handling of tag \"<objectgroup>\" within tags \"<tile>\" in TmxMap loaders.\n\n[1.9.2]\n- Added TextureArray wrapper see https://github.com/libgdx/libgdx/pull/3807\n- Fixed bug in AndroidGL20.cpp which cast a pointer to a 32-bit int. Crash on 64-bit ARM, but only for a specific code path and address...\n- Fixed multiple controllers registering on same index with LWJGL3, see https://github.com/libgdx/libgdx/issues/3774\n- Fixed the FreeTypeFontGenerator texture bleeding, see https://github.com/libgdx/libgdx/issues/3521\n\n[1.9.1]\n- API Change: Override GwtApplication#createApplicationListener() to create your ApplicationListener\n  on GWT, overriding GwtApplication#getApplicationListener() isn't needed anymore, see https://github.com/libgdx/libgdx/issues/3628\n- Fixed ARM64 and x86_64 binaries for Android\n\n[1.9.0]\n- API Change: Lwjgl3ApplicationConfiguration#setBackbufferConfig -> setBackBufferConfig\n- Fixed HexagonalTiledMapRenderer, see https://github.com/libgdx/libgdx/pull/3654\n- Added support for locking the screen orientation in GWT, see https://github.com/libgdx/libgdx/pull/3633\n- Added Gdx-Kiwi and gdx-lml to extensions, see https://github.com/libgdx/libgdx/pull/3597\n- Added Gyroscope support in Input, implemented for Android, see https://github.com/libgdx/libgdx/pull/3594\n- Fixed touch mapping on iOS, see https://github.com/libgdx/libgdx/pull/3590\n- Added orientation to Box2D Transform class, see https://github.com/libgdx/libgdx/pull/3308\n- Added system cursors to GWT, fix 'Ibeam' system cursor not working on LWJGL3.\n- Added experimental AndroidApplicationConfiguration#useGL30 and IOSApplicationConfiguration#useGL30 for testing OpenGL ES 3.0 support on mobile devices, do not use in production.\n- Fix broken kerning for FreeType fonts, see https://github.com/libgdx/libgdx/pull/3756\n- Added ARM64 and x86_64 binaries for Android\n- API Addition: FreeTypeFontParameter has an additional field for tweaking hinting, see https://github.com/libgdx/libgdx/pull/3757\n\n[1.8.0]\n- API Change: Rewrote FreeType shadow rendering (much better).\n- Added spaceX/Y to FreeType fonts.\n- Higher quality FreeType font rendering.\n- Hiero updated to v5, now with FreeType support and other new features!\n- GlyphLayout now allocates much, much less memory when processing long text that wraps.\n- Added LWJGL 3 backend, see https://github.com/libgdx/libgdx/issues/3673 for more info.\n- Added Graphics#getBackBufferWidth and Graphics#getBackBufferHeight for HDPI handling\n- API Change: Added HdpiUtils. Instead of calling GL20#glViewport and GL20#glScissor yourself\n  please use HdpiUtils instead. It will ensure that you handle HDPI monitors correctly when\n  using those OpenGL functions. On HDPI monitors, the size reported by Gdx.graphics \n  getWidth/getHeight is in logical coordinates as dictated by the operating system, usually half\n  the HDPI resolution. The OpenGL drawing surface works in backbuffer coordinates at the full\n  HDPI resolution. If you pass logical coordinates to glViewport and glScissor, you only \n  affect a quarter of the real backbuffer size. Use HdpiUtils instead, it will do the right thing, while letting you continue to work in logical (aka returned by Gdx.graphics.getWidth/getHeight) coordinates.\n- API Change: Graphis#getDesktopDisplayMode() has been renamed to Graphics#getDisplayMode() and\n  returns the current display mode of the monitor the window is shown on (primary monitor on\n  all backends except LWJGL3, which supports real multi-monitor setups).\n- API Change: Graphics#getDisplayModes() return the display modes of the monitor the monitor\n  the window is shown on (primary monitor on all backends except LWJGL3 which supports real\n  multi-monitor setups).\n- API Change: Graphics#setDisplayMode(DisplayMode) has been renamed to \n  Graphics#setFullscreenMode(). If the window is in windowed mode, it will be switched \n  to fullscreen mode on the monitor from which the DisplayMode stems from.\n- API Change: Graphics#setDisplayMode(int, int, boolean) has been renamed to \n  Graphics#setWindowedMode(int, int). This will NOT allow you to switch to fullscreen anymore, \n  use Graphics#setFullscreenMode() instead. If the window is in fullscreen mode, it will be\n  switched to windowed mode on the monitor the window was in fullscreen mode on.\n - API Addition: Graphics#Monitor, represents a monitor connected to the machine the app is\n  running on. A monitor is defined by a name and it's position relative to other connected\n  monitors. All backends except the LWJGL3 backend will report only the primary monitor\n - API Addition: Graphics#getPrimaryMonitor() returns the primary monitor you usually want\n  to work with.\n - API Addition: Graphics#getMonitor() returns the monitor your app's window is shown on,\n  which may not be the primary monitor in >= 2 monitor systems. All backends except the \n  LWJGL3 backend will report only the primary monitor.\n - API Addition: Graphics#getMonitors() returns all monitors connected to the system. All\n  backends except the LWJGL3 backend will only report the primary monitor.\n - API Addition: Graphics#getDisplayMode(Monitor) returns the display mode of the monitor\n  the app's window is shown on. All backends except the LWJGL3 backend will report the\n  primary monitor display mode instead of the actual monitor's display mode. Not a problem\n  as all other backends run on systems with only a single monitor so far (primary monitor).\n- Added option to include credentials on cross-origin http requests (used only for GWT backend).\n- Added option to specify crossorigin attribute when loading images with AssetDownloader (GWT), see #3216.\n- API Change: removed Sound#setPriority, this was only implemented for the Android backend. However, Android itself never honored priority settings.\n- API Change: cursor API has been cleaned up. To create a custom cursor, call Graphics#newCursor(), to set the custom cursor call Graphics#setCursor(), to set a system cursor call Graphics#setSystemCursor(). The Cursor#setSystemCursor method has been removed as that was not the\nright place. Note that cursors only work on the LWJGL, LWJGL3 and GWT backends. Note that system cursors only fully work on LWJGL3 as the other two backends lack a means to set a specific system cursor. These backends fall back to displaying an arrow cursor when setting any system cursor.\n- API Addition: Added Lwjgl3WindowListener, allows you to hook into per-window iconficiation, focus and close events. Also allows you to prevent closing the window when a close event arrives.\n\n[1.7.2]\n- Added AndroidAudio#newMusic(FileDescriptor) to allow loading music from a file descriptor, see #2970\n- Added GLOnlyTextureData, which is now the default for FrameBuffer and FrameBufferCubemap, see #3539\n- Added rotationChanged() for Actor class, called when rotation changes, see https://github.com/libgdx/libgdx/pull/3563\n- Fixed crash on MacOS when enumerating connected gamepads.\n- ParticleEmitter no longer says it's complete when it's set to continuous, see #3516\n- Improved JSON parsing and object mapping error messages.\n- Updated FreeType from version 2.5.5 to 2.6.2.\n- Fixed corrupt FreeType rendering for some font sizes.\n- API Change: FreeTypeFontParameter has new fields for rendering borders and shadows.\n- FreeTypeFontParameter can render much better fonts at small sizes using gamma settings.\n- BitmapFont can now render missing (tofu) glyph for glyphs not in the font.\n- FreeTypeFontGenerator depreacted methods removed.\n- Fixed BitmapFont color tags changing glyph spacing versus not using color tags. BitmapFont#getGlyphs has a new paramter. See #3455.\n- Skin's TintedDrawable now works with TiledDrawable. #3627\n- Updated jnigen to Java Parser 2.3.0 (http://javaparser.github.io/javaparser/).\n- FreeType fonts no longer look terrible at small size. This is a big deal!\n- Updated to RoboVM 1.12.0, includes tvOS support!\n\n[1.7.1]\n- Fixes AtlasTmxMapLoader region name loading to tileset name instead of filename\n- Changes TiledMapPacker output, region names are tileset names, adjusts gid, defaults to one atlas per map\n- API Change: members of Renderable and MeshPart are changed, see https://github.com/libgdx/libgdx/pull/3483\n- Added Vector#setToRandomDirection(), see #3222\n- Updated to stb_image v2.08\n- Added Node#copy(), used when creating a ModelInstance from a Model to allow using custom nodes\n- Add ModelCache, see https://github.com/libgdx/libgdx/wiki/ModelCache\n- Updated bullet to v2.83.6\n- Updated to RoboVM 1.9, for free life-time license read http://www.badlogicgames.com/wordpress/?p=3762\n\n[1.7.0]\n- Gdx.input.setCursorImage removed, replaced with Gdx.graphics.setCursor and Gdx.graphics.newCursor see https://github.com/libgdx/libgdx/pull/2841/\n- Fixed an issue with UTF8 decoding in GWT emulation of InputStreamReader\n- Updated to RoboVM 1.8 for iOS 9 support.\n\n[1.6.5]\n- Objects from animated tiles in TMX maps are now supported.\n- Made possible to use any actor for tooltips.\n- Improved cross-platform reflection api for annotations.\n- NinePatch#scale now also scales middle patch size.\n- GLFrameBuffer is now abstract, renamed setupTexture to createColorTexture, added disposeColorTexture\n- Added LwjglApplicationConfiguration#gles30Context*Version, see https://github.com/libgdx/libgdx/pull/2941\n- Added OpenGL error checking to GLProfiler, see https://github.com/libgdx/libgdx/pull/2889\n- Updated to RoboVM 1.6\n\n[1.6.4]\n- TextField cursor and selection size changed. https://github.com/libgdx/libgdx/commit/2a830dea348948d2a37bd8f6338af2023fec9b09\n- FreeTypeFontGenerator setting to improve shadows and borders.\n- ScrollPane scrolls smoothly when the scrolled area is much larger than the scrollbars.\n- TexturePacker sorts page regions by name.\n- GlyphLayout text wrapping changed to not trim whitespace. https://github.com/libgdx/libgdx/commit/ee42693da067da7c5ddd747f051c1423d262cb96\n- Fixed BitmapFont computing space width incorrectly when padding is used and no space glyph is in the font.\n- Fixed TextArea cursor and selection drawing positions.\n- Fixed ActorGestureListener pan and zoom when the actor is rotated or scaled.\n- Fixed TextField for non-pixel display.\n- Allow ellipsis string to be set on Label.\n- AssetManager gets hook for handling loading failure.\n- TextField now fires a ChangeEvent when the text change. Can be cancelled too!\n- Added tooltips to scene2d.ui.\n- Updated to RoboVM 1.5\n\n[1.6.3]\n- Updated to RoboVM 1.4\n\n[1.6.2]\n- API Change: TiledMapImageLayer now uses floats instead of ints for positioning\n- API Change: Added GLFrameBuffer and FrameBufferCubemap: Framebuffer now extends GLFramebuffer, see #2933\n\n[1.6.1]\n- Added optional hostname argument to Net.newServerSocket method to allow specific ip bindings for server applications made with gdx.\n- Changed the way iOS native libs are handled. Removed updateRoboVMXML and copyNatives task from ios/build.gradle. Instead natives are now packaged in jars, within the META-INF/robovm/ios folder. Additionally, a robovm.xml file is stored there that gets merged with the project's robovm.xml file by RoboVM.\n\n[1.6.0]\n- API Change: GlyphLayout xAdvances now have an additional entry at the beginning. This was required to implement tighter text bounds. #3034\n- API Change: Label#getTextBounds changed to getGlyphLayout. This exposes all the runs, not just the width and height.\n- In the 2D ParticleEditor, all chart points can be dragged at once by holding ctrl. They can be dragged proportionally by holding ctrl-shift.\n- Added Merge button to the 2D ParticleEditor, for merging a loaded particle effect file with the currently open particle effect.\n- Added ability to retrieve method annotations to reflection api\n- Added PixmapPacker.updateTextureRegions() method.\n- Added ability to pack \"anonymous\" pixmaps into PixmapPacker, which will appear in the generated texture but not a generated or updated TextureAtlas\n- Added PixmapPacker.packDirectToTexture() methods.\n- API Change: PixmapPacker.generateTextureAtlas(...) now returns an atlas which can be updated with subsequent calls to PixmapPacker.updateTextureAtlas(...)\n- API Change: FreeTypeFontGenerator.generateFont(...) now works with a user-provided PixmapPacker.\n- Added DirectionalLightsAttribute, PointLightsAttribute and SpotLightsAttribute, removed Environment#directionalLights/pointLights/spotLights, added Environment#remove, lights are now just like any other attribute. See also https://github.com/libgdx/libgdx/wiki/Material-and-environment#lights\n- API Change: BitmapFont metrics now respect padding. #3074\n- Update bullet wrapper to v2.83\n- Added AnimatedTiledMapTile.getFrameTiles() method\n\n[1.5.6]\n- API Change: Refactored Window. https://github.com/libgdx/libgdx/commit/7d372b3c67d4fcfe4e82546b0ad6891d14d03242\n- Added VertexBufferObjectWithVAO, see https://github.com/libgdx/libgdx/pull/2527\n- API Change: Removed Mesh.create(...), use MeshBuilder instead\n- API Change: BitmapFontData, BitmapFont, and BitmapFontCache have been refactored. http://www.badlogicgames.com/wordpress/?p=3658\n- FreeTypeFontGenerator can now render glyphs on the fly.\n- Attribute now implements Comparable, custom attributes might need to be updated, see: https://github.com/libgdx/libgdx/wiki/Material-and-environment#custom-attributes\n- API Change: Removed (previously deprecated) GLTexture#createTextureData/createGLHandle, Ray#getEndPoint(float), Color#tmp, Node#parent/children, VertexAttribute#Color(), Usage#Color, ModelBuilder#createFromMesh, BoundingBox#getCenter()/updateCorners()/getCorners(), Matrix4.tmp\n\n[1.5.5]\n- Added iOS ARM-64 bit support for Bullet physics\n- 3D Animation, NodeAnimation keyframes are separated into translation, rotation and scaling\n- Added capability to enable color markup from inside skin json file.\n- Exposed method ControllerManager#clearListeners on Controllers class\n- Net#openURI now returns a boolean to indicate whether the uri was actually opened.\n- DefaultShader now always combines material and environment attributes\n- Added ShapeRenderer constructor to pass a custom shader program to ImmediateModeRenderer20.\n- API Change: Group#toString now returns actor hierarchy. Group#print is gone.\n- Added SpotLight class, see https://github.com/libgdx/libgdx/pull/2907\n- Added support for resolving file handles using classpaths (ClasspathFileHandleResolver)\n\n[1.5.4]\n- Added support for image layers in Tiled maps (TiledMapImageLayer)\n- Added support for loading texture objects from TMX Maps (TextureMapObject)\n- Added support for border and shadow with FreeTypeFontGenerator - see https://github.com/libgdx/libgdx/pull/2774\n- Now unknown markup colors are silently ignored and considered as normal text.\n- Updated freetype from version 2.4.10 to 2.5.5\n- Added 3rd party extensions to setup application, see \n- Updated to RoboVM 1.0.0-beta-04\n- Updated to GWT 2.6.1, sadly GWT 2.7.0 isn't production ready yet.\n\n[1.5.3]\n- API Change: TextField#setRightAlign -> TextField#setAlignment\n- I18NBundle is now compatible with Android 2.2\n- Fixed GWT reflection includes for 3D particles\n- 3D ParticleEffectLoader registered by default\n- Added HttpRequestBuilder, see https://github.com/libgdx/libgdx/pull/2698\n- Added LwjglApplicationConfiguration.useHDPI for Mac OS X with retina displays. Allows you to get \"real\" pixel coordinates for mouse and display coordinates.\n- Updated RoboVM to 1.0.0-beta-03\n\n[1.5.2]\n- Fixed issue #2433 with color markup and alpha animation. \n- Fixed natives loading for LWJGL on Mac OS X\n\n[1.5.1]\n- Gradle updated to 2.2\n- Android Gradle tooling updated to 1.0.0\n- API Change: Switched from Timer to AnimationScheduler for driving main loop on GWT. Removed fps field from GwtApplicationConfiguration to instead let the browser choose the most optimal rate.\n- API Change: Added pause and resume handling on GWT backend. When the browser supports the page visibility api, pause and resume will be called when the tab or window loses and gains visibility.\n- API Change: Added concept of target actor, separate from the actor the action is added to. This allows an action to be added to one actor but affect another. This is useful to create a sequence of actions that affect many different actors. Previously this would require adding actions to each actor and using delays to get them to play in the correct order.\n- Added 64-bit support for iOS sim and device\n- Deprecated Node#children and Node#parent, added inheritTransform flag and methods to add/get/remove children\n- API Change: By default keyframes are no longer copied from Model to ModelInstance but shared instead, can be changed using the `ModelInstance.defaultShareKeyframes` flag or `shareKeyframes` constructor argument.\n- JSON minimal format now makes commas optional: newline can be used in place of any comma.\n- JSON minimal format is now more lenient with unquoted strings: spaces and more are allowed.\n- API Change: Added support for KTX/ZKTX file format, https://github.com/libgdx/libgdx/pull/2431\n- Update stb_image from v1.33 to v1.48, see https://github.com/libgdx/libgdx/pull/2668\n- Bullet Wrapper: added Gimpact, see https://github.com/libgdx/libgdx/issues/2619\n- API Addition: Added MeshPartBuilder#addMesh(...), can be used to more easily combine meshes/models\n- Update to LWJGL 2.9.2, fixes fullscreen mode on \"retina\" displays\n- Fixes to RoboVM backend which would crash if accelerometer is used.\n\n[1.5.0]\n- API Addition: IOSInput now uses CMCoreMotion for accelerometer and magnetometer\n- API Addition: Added getter for UITextField on IOS for keyboard customization \n- API Addition: Added ability to save PixmapPackers to atlas files. See PixmapPackerIO.\n- API Addition: Added HttpRequestHeader and HttpResponseHeader with constants for HTTP headers.\n- API Addition: HttpRequest is now poolable.\n- New PNG encoder that supports compression, more efficient vertical flipping, and minimal allocation when encoding multiple PNGs.\n- API Change: Label#setEllipse -> Label#setEllipsis.\n- API Change: BatchTiledMapRenderer *SpriteBatch fields and methods renamed to *Batch\n- API Change: ScrollPane#scrollToCenter -> ScrollPane#scrollTo; see optional boolean arguments centerHorizontal and centerVertical (scrollToCenter centered vertically only).\n- API Change: Changed Input#getTextInput to accept both text and hint, removed Input#getPlaceholderTextInput.\n- Bug Fix: Fixed potential NPE with immersive mode in the Android fragment backend. \n- iOS backend now supports sound ids, thanks Tomski!\n\n\n[1.4.1]\n- Update to the Gradle Integration plugin nightly build if you are on Eclipse 4.4.x!\n- Update Intellij IDEA to 13.1.5+, because Gradle!\n- Updated to Gradle 2.1 and Android build tools 20, default Android version to 20. You need to install the latest Android build tools via the SDK manager\n- API Change: deprecation of bounding box methods, see https://github.com/libgdx/libgdx/pull/2408\n- Added non-continuous rendering to iOS backend, thanks Dominik!\n- Setup now uses Gradle 2.1 with default Android API level 20, build tools 20.0.0\n- Non-continuous renderering implemented for iOS\n- Added color markup support for scene2d label and window title.\n- API Change: removed default constructor of DecalBatch, removed DefaultGroupStrategy\n- Updated to latests RoboVM release, 1.0.0-alpha-04, please update your RoboVM plugins/installations\n- Reduced I18NBundle loading times on Android and bypassed unclosed stream on iOS. \n- Removed the gdx-ai extension from the libGDX repository. Now it lives in its own repository under the libGDX umbrella, see https://github.com/libgdx/gdx-ai\n- API Addition: Added randomSign and randomTriangular methods to MathUtils.\n- API Addition: Decal has now a getter for the Color.\n- API Addition: now I18NBundle can be set so that no exception is thrown when the key can not be found.\n- API Addition: added annotation support in reflection layer, thanks code-disaster! https://github.com/libgdx/libgdx/pull/2215\n- API Addition: shapes like Rect, Circle etc. now implement Shape2D interface so you can put them all into a single collection https://github.com/libgdx/libgdx/pull/2178 \n- API Addition: bitmap fonts can now be loaded from an atlas via AssetManager/BitmapFontLoader, see https://github.com/libgdx/libgdx/pull/2110\n- API Change: updated to RoboVM 1.0.0-SNAPSHOT for now until the next alpha is released.\n- API Change: Table now uses padding from its background drawable by default. https://github.com/libgdx/libgdx/issues/2322\n- Drawables now know their names, making debugging easier.\n- API Change: Table fill now respects the widget's minimum size.\n- Texture packer, fixed image size written to atlas file.\n- API Change: Cell no longer uses primitive wrappers in public API and boxing is minimized.\n- API Addition: TextureAttribute now supports uv transform (texture regions).\n- API Change: Added parameters to Elastic Interpolation.\n- API Change: Removed Actor#setCenterPosition, added setPosition(x,y,align).\n- API Change: JsonReader, forward slash added to characters an unquoted strings cannot start with.\n- API Change: Stage#cancelTouchFocus(EventListener,Actor) changed to cancelTouchFocusExcept.\n- API Change: Json/JsonWriter.setQuoteLongValues() quotes Long, BigDecimal and BigInteger types to prevent truncation in languages like JavaScript and PHP.\n\n[1.3.1]\n- API change: Viewport refactoring. https://github.com/libgdx/libgdx/pull/2220\n- Fixed GWT issues\n\n[1.3.0]\n- Added Input.isKeyJustPressed.\n- API Addition: multiple recipients are now supported by MessageDispatcher, see https://github.com/libgdx/libgdx/wiki/Message-Handling#multiple-recipients\n- API Change: State#onMessage now takes the message receiver as argument.\n- API Addition: added StackStateMachine to the gdx-ai extension.\n- API change: ShapeRenderer: rect methods accept scale, more methods can work under both line and fill types, auto shape type changing.\n- API change: Built-in ShapeRenderer debugging for Stage, see https://github.com/libgdx/libgdx/pull/2011\n- Files#getLocalStoragePath now returns the actual path instead of the empty string synonym on desktop (LWJGL and JGLFW).\n- Fixed and improved xorshift128+ PRNG implementation.\n- Added support for Tiled's animated tiles, and varying frame duration tile animations.\n- Fixed an issue with time granularity in MessageDispatcher.\n- Updated to Android API level 19 and build tools 19.1.0 which will require the latest Eclipse ADT 23.02, see http://stackoverflow.com/questions/24437564/update-eclipse-with-android-development-tools-23 for how things are broken this time...\n- Updated to RoboVM 0.0.14 and RoboVM Gradle plugin version 0.0.10\n- API Addition: added FreeTypeFontLoader so you can transparently load BitmapFonts generated through gdx-freetype via AssetManager, see https://github.com/libgdx/libgdx/blob/master/tests/gdx-tests/src/com/badlogic/gdx/tests/FreeTypeFontLoaderTest.java\n- Preferences put methods now return \"this\" for chaining\n- Fixed issue 2048 where MessageDispatcher was dispatching delayed messages immediately.\n- API Addition: 3d particle system and accompanying editor, contributed by lordjone, see https://github.com/libgdx/libgdx/pull/2005\n- API Addition: extended shape classes like Circle, Ellipse etc. with hashcode/equals and other helper methods, see https://github.com/libgdx/libgdx/pull/2018\n- minor API change (will not increase minor revision number): fixed a bug in handling of atlasPrefixes, https://github.com/libgdx/libgdx/pull/2023\n- Bullet: btManifoldPoint member getters/setters changed from btVector3 to Vector3, also it is no longer pooled, instead static instances are used for callback methods\n- Added Intersector#intersectRayRay to detect if two 2D rays intersect, see https://github.com/libgdx/libgdx/pull/2132\n- Bullet: ClosestRayResultCallback, AllHitsRayResultCallback, LocalConvexResult, ClosestConvexResultCallback and subclasses now use getter/setters taking a Vector3 instead of btVector3, see https://github.com/libgdx/libgdx/pull/2176\n- 2d particle system supports pre-multiplied alpha.\n- Bullet: btIDebugDrawer/DebugDrawer now use pooled Vector3 instances instead of btVector3, see https://github.com/libgdx/libgdx/issues/2174\n\n[1.2.0]\n- API Addition: Some OpenGL profiling utilities have been added, see https://github.com/libgdx/libgdx/wiki/Profiling\n- API Addition: A FreeTypeFontGeneratorLoader has been added to the gdx-freetype extension\n- API change: Animation#frameDuration and #animationDuration are now hidden behind a getter/setter and dynamic\n- API Addition: Vector#setZero\n- API Addition: gdx-ai, extension for AI algorithms. Currently supports FSMs, see https://github.com/libgdx/libgdx/wiki/Artificial-Intelligence\n- API change: TableLayout has been forked and integrated into libgdx more tightly, see http://www.badlogicgames.com/wordpress/?p=3458\n- API Addition: added equals/hashCode methods to Rectangle, may break old code (very, very unlikely)\n- API Addition: scene2D Actors now have a setCenterPosition method, see https://github.com/libgdx/libgdx/pull/2000\n\n[1.1.0]\n- Updated to RoboVM 0.0.13 and RoboVM Gradle plugin 0.0.9\n- Big improvements to setup-ui and build times in Intellij IDEA https://github.com/libgdx/libgdx/pull/1865\n- Setup now uses android build tools version: 19.1.0\n- BitmapFontCache now supports in-string colored text through a simple markup language, see https://github.com/libgdx/libgdx/wiki/Color-Markup-Language\n- Added i18n localization/internationalization support, thanks davebaol, see https://github.com/libgdx/libgdx/wiki/Internationalization-and-Localization\n- Possibility to override density on desktop to simulate mobile devices, see https://github.com/libgdx/libgdx/pull/1825\n- Progressive JPEG support through JPGD (https://code.google.com/p/jpeg-compressor/).\n- Mavenized JGLFW backend\n- Box2D: Added MotorJoint and ghost vertices on EdgeShape\n- Updated GWT Box2D to latest version\n- Updated native Box2D to latest version 2.3.1, no API changes\n- API change: Matrix4.set(x,y,z, translation) changed, z axis is no more flipped\n- API addition: Matrix4.avg(Matrix4[],float[]) that lets weighted averaging multiple matrices, Quaternion.slerp(Quaternion[],float[]) that lets weighted slerping multiple Quaternions\n- fixed the long standing issue of the alpha=1 not actually being fully opaque, thanks kalle! https://github.com/libgdx/libgdx/issues/1815\n- down to 25 issues on the tracker, 8 bugs, 17 enhancement requests :)\n\n\n[1.0.1]\n- updated to RoboVM 0.12 (and so should you!)\n- fixed GC issues on iOS with regards to touch (thanks Niklas!), see https://github.com/libgdx/libgdx/pull/1758\n- updated gwt gradle plugin to 0.4, android build tools to 0.10, gradle version to 1.11\n- Tiled maps are now always y-up\n- Tiled maps now support drawing offsets for tiles\n- FileHandle#list is now supported in GWT!\n- FileHandle#list now supports FileFilters\n- Controllers now reinitialize on the desktop when switching between windowed/fullscreen\n- added a Texture unpacker that will extract all images from a texture atlas, see https://github.com/libgdx/libgdx/pull/1774\n- updates to gdx-setup\n- CustomCollisionDispatcher in bullet, see https://github.com/libgdx/libgdx/commit/916fc85cecf433c3461b458e00f8afc516ad21e3\n\n[1.0.0]\n- Box2D is no longer in the core, it has been moved to an extension. See http://www.badlogicgames.com/wordpress/?p=3404\n- Merged gdx-openal project into gdx-backend-lwjgl\n- Now LoadedCallback in AssetLoaderParameters is always called after loading an asset from AssetManager, even if the asset is already loaded\n- Added Payload as a new parameter to Source.dragStop, see https://github.com/libgdx/libgdx/pull/1666\n- You can now load PolygonRegions via AssetLoader,  see https://github.com/libgdx/libgdx/pull/1602\n- implemented software keyboard support in RoboVM iOS backend\n- Fixed an issue where key event timestamp is not set by the android backend.\n- scene2d.ui, added to TextArea the preferred number of rows used to calculate the preferred height.\n- scene2d.actions, fixed infinite recursion for event listener's handle(event).\n- Various Quaternion changes.\n- scene2d.ui, fixed a drawing issue with knobBefore when there's no knob (typical progress bar).\n- Various MeshBuilder fixes and additions.\n- Math package: added cumulative distribution.\n- Fixed Music isPlaying() on iOS when is paused.\n- Added support for C-style comments to JsonReader (mainly used for json skin files).\n- Support for resource removal from Skin objects.\n- Added fling gesture to generate fling in scrollpane.\n- Vector classes now have mulAdd method for adding pre-multiplied values\n- Vector implementations no longer use squared value for margin comparisons, see: isZero(float margin), isUnit(float margin).\n- Vector2 now has isUnit and isZero methods (copied from Vector3)\n- Removed deprecated methods from Vector classes.\n- Added new headless backend for server applications\n- Support 'scaledSize' as a json skin data value for BitmapFont\n- Added setAlpha(float a) method to Sprite class\n- Added Input.Keys.toString(int keycode) and Input.Keys.valueOf(String keyname) methods\n- Added Immersive Mode support to Android backend\n- Added userObject to Actor in scene2d, allowing for custom data storage\n- Altered Android's hide status bar behavior\n- Changed the way wakelocks are implemented. You no longer need any special permissions for the libgdx wakelock\n- BitmapFontCache setColor changes to match SpriteBatch and friends. http://www.badlogicgames.com/forum/viewtopic.php?f=23&t=12112\n- Changed ParticleEffect: the ParticleEffect.save method now takes a Writer instead of a File\n- TexturePacker2 renamed to TexturePacker, added grid and scaling settings.\n- Added support for custom prefrences on the desktop backends.\n- Fixed double resume calls on iOS.\n- Android Music no longer throws exceptions if MediaPlayer is null.\n- PolygonSpriteBatch implements Batch.\n- New scene2d actions: EventAction, CountdownEventAction.\n- Adds cancelHttpRequest() method to Net interface\n- Updated GWT/HTML5 Backend to GWT 2.6.0\n- Minimal Android version is 2.2, see http://www.badlogicgames.com/wordpress/?p=3297\n- Updated to LWJGL 2.9.1\n- Can now embed your libgdx app as a fragment, more info on the wiki\n- scene2d.ui, renamed Actor methods translate, rotate, scale, size to moveBy, rotateBy, scaleBy, sizeBy. May have conflicts with Actions static import, eg you'll need to use \"Actions.moveBy\"\n- scene2d.ui, Table background is now drawn usign the table's transform\n- scene2d.ui, added Container which is similar to a Table with one cell, but more lightweight\n- Added texture filters and mip map generation to BitMapFontLoader and FreeTypeFontGenerator\n- scene2d.ui, VerticalGroup and HorizontalGroup got pad, fill and an API similar to Table/Container\n- Removed OpenGL ES 1.0, 1.1 support; see http://www.badlogicgames.com/wordpress/?p=3311\n- Added OpenGL ES 3 support\n- Updated Android backend, demos, tests to 4.4\n- Added Viewport, changed Stage to have a Viewport instead of a Camera (API change, see http://www.badlogicgames.com/wordpress/?p=3322 ).\n- Changed play mode constants of Animation class to enumeration, see http://www.badlogicgames.com/wordpress/?p=3330\n- Updated to RoboVM 0.0.11 and RoboVM Gradle plugin 0.0.6, see http://www.badlogicgames.com/wordpress/?p=3351\n- Updated to Swig 3.0 for Bullet, disabled SIMD on Mac OS X as alignements are broken in Bullet, see https://github.com/libgdx/libgdx/pull/1595\n- TextureData can only be Custom or Pixmap; compressed image files are considered custom\n\n[0.9.9]\n- added setCursorImage method to Input interface to support custom mouse cursors on the desktop\n- removed Xamarin backend, see http://www.badlogicgames.com/wordpress/?p=3213\n- added Select class for selecting kth ordered statistic from arrays (see Array.selectRanked() method)\n- refactored Box2D to use badlogic Arrays instead of java.util.ArrayLists\n- MipMapGenerator methods now don't take disposePixmap argument anymore\n- added GLTexture, base class for all textures, encapsulates target (2d, cubemap, ...)\n- added CubeMap, 6 sided texture\n- changed TextureData#consumeCompressedData, takes target now\n- added RoboVM backend jar and native libs (libObjectAL, libgdx, in ios/ folder of distribution)\n- added RoboVM backend to build\n- changed Bullet wrapper API, see http://www.badlogicgames.com/wordpress/?p=3150\n- changed MusicLoader and SoundLoader to be asynchronous loaders\n- changed behaviour of Net#sendHttpRequest() so HttpResponseListener#handleHttpResponse() callback is executed in worker thread instead of main thread\n- added Bresenham2, for drawing lines on an integer 2D grid\n- added GridPoint2 and GridPoint3, representing integer points in a 2D or 3D grid\n- added attribute location caching for VertexData/Mesh. Hand vertex attribs to a ShaderProgram, get back int[], pass that to Mesh\n- added Android x86 builds, removed libandroidgl20.so, it's now build as part of gdx-core for Android\n- changed method signature on Box2D World#getBodies and World#getJoints, pass in an Array to fill\n- removed glGetShaderSource from GL20, use ShaderProgram#getVertexShaderSource/getFragmentShaderSource instead\n- added reflection api\n- added AsynchExecutor, execute tasks asynchronously. Used for GWT mainly.\n- removed FileHandle#file(), has no business in there.\n- removed box2deditor\n- removed custom typedarrays in gwt backend\n- added classpath files support for gwt backend (limited)\n- moved AndroidWallpaperListener to Android Backend\n- added new VertexAttribute Usage flags, bone weight, tangent, binormal. previously encoded as Usage.Generic. Also\n  added field \"unit\" to VertexAttribute, used by texture coordinates and bone weights to specify index/unit.\n- setup-ui template for iOS disables pngcrush, also updated wiki iOS article\n- add Pixmap#fillTriangle via jni gdx2d_fill_triangle() to fill a triangle based on its vertices.\n- add asynchronous download with continuous progress feedback to GWT asset preloader, see https://github.com/libgdx/libgdx/pull/409?w=1\n- add capability to add/exclude package/classes GWT Reflection system, see https://github.com/libgdx/libgdx/pull/409?w=1\n- add updated gdx-tiled-preprocessor, generate one single TextureAtlas for all the specified Tiled maps, see http://www.badlogicgames.com/forum/viewtopic.php?f=17&t=8911\n- maps API, add new AtlasTiledMapLoader for loading maps produced by the tiled preprocessor tool\n- ImageProcessor, TexturePacker2 now accepts BufferedImage objects as input\n- TexturePacker2 now avoids duplicated aliases\n- Updated to LWJGL 2.9.0\n- refactored JSON API, see http://www.badlogicgames.com/wordpress/?p=2993\n- Updated Box2D to the latest trunk. Body#applyXXX methods now take an additional boolean parameter.\n- TmxMapLoader has a flag in Parameters that lets you specify whether to generate mipmaps\n- Animation#isAnimationFinished was fixed to behave as per javadocs (ignores looping)\n- remove GLU interface and implementations. Use Matrix4 et al instead. see http://www.badlogicgames.com/wordpress/?p=2886\n- new maps API, see http://www.badlogicgames.com/wordpress/?p=2870\n- removed static public tmp Vector2 instances, manage such temporary vars yourself, see http://www.badlogicgames.com/wordpress/?p=2840\n- changed Scene2D Group#clear(), see http://www.badlogicgames.com/wordpress/?p=2837\n- changed the build system, natives are now fetched from the build server, see http://www.badlogicgames.com/wordpress/?p=2821\n- freetype extension supported on iOS, see http://www.badlogicgames.com/wordpress/?p=2819\n- changed ShapeRenderer API, see http://www.badlogicgames.com/wordpress/?p=2809\n- changed Actions.add to addAction, changed parameter order, and added removeAction, addListener, removeListener\n- Box2d joints now allow for user data\n- Changes to Intersector, Circle, Rectangle and BoundingBox for consistency in #overlap, #intersect and #contains methods, see https://github.com/libgdx/libgdx/pull/312\n- Removed LwjglApplicationConfiguration CPU sync. Added foreground and background target framerate.\n- scene2d, no longer use getters/setters internally for Actor x, y, width, height, scalex, scaley and rotation.\n- Array, detect nested iterator usage and throw exception.\n- Added getVolume to Music class and Android, IOS and GWT backends\n- 1381, fixed JSON parsing of longs. In addition to Float, it now parses Long if no decimal point is found.\n- Changed Array constructors that took an array to have offset and count\n- scene2d, Actor parentToLocalCoordinates and localToParentCoordinates refactoring, see http://www.badlogicgames.com/forum/viewtopic.php?p=40441#p40441\n- scene2d, Action#setActor no longer calls reset if the Action has no pool. This allows non-pooled actions to be add and removed from actors, restarted, and reused.\n- ScrollBar#setForceOverscroll renamed to setForceScroll, as it affects more than just overscroll.\n- ArrayMap#addAll renamed to putAll to match the other maps.\n- Added ObjectSet and IntSet.\n- Added completion listener to Music.\n- Added Music#setPan.\n- Sound#play and Sound#loop on Android now return -1 on failure, to match other backends.\n- DelegateAction subclasses need to implement delegate() instead of act(). http://www.badlogicgames.com/forum/viewtopic.php?p=43576#p43576\n- Added pause and resume methods to Sound.\n- Changed AssetErrorListener#error to have AssetDescriptor to enable access to parameters of failed asset.\n- Changed SelectBoxStyle to have ScrollPaneStyle and ListStyle for fully customizing the drop down list. http://www.badlogicgames.com/wordpress/?p=3110\n- AssetLoader now takes a FileHandle that is the resolved file name. The AssetLoader no longer has to resolve the file name, so we can prevent it from being resolved twice.\n- Rewrote EarClippingTriangulator to not allocate (no more Vector2s).\n- Added ParticleEffectLoader to make AssetManager load ParticleEffects\n- Added GeometryUtils, more Intersector functions, DelaunayTriangulator, ConvexHull.\n- Added getBoundingBox to ParticleEffect\n- EarClippingTriangulator changed to return triangle indices.\n- PolygonSpriteBatch and friends refactored to use triangle indices.\n- Added add(T, float), remove(int), remove(T) and clear() methods to BinaryHeap\n- Bitmap Font changes:\n\t- FreeTypeFontGenerator allows you to specify the PixmapPacker now, to create an atlas with many different fonts (see FreeTypePackTest)\n\t- BitmapFont, BitmapFontCache and FreeTypeFontGenerator now support fonts with multiple texture pages. (see BitmapFontTest and FreeTypePackTest)\n\t- BitmapFontData.imagePath and getImagePath() is depreacted, use imagePaths[] and getImagePath(int) instead\n\t- Added two BitmapFont constructors for convenience; no need to specify flip boolean\n\t- Added getCache() to BitmapFont, for expert users who wish to use the BitmapFontCache (see BitmapFontTest)\n\t- FreeTypeFontGenerator now includes setMaxTextureSize and getMaxTextureSize to cap the generated glyph atlas size (default 1024)\n- added render-hooks beginRender() and endRender() to BatchTiledMapRenderer\n- Added panStop to GestureListener interface.\n- ScissorStack#calculateScissors changed to take viewport, enabling it to work with glViewport.\n- Added Bits#getAndClear, Bits#getAndSet and Bits#containsAll\n- Added setX and setY to TextureAtlas.AtlasSprite so it matches expected behavior\n\n[0.9.8]\n- see http://www.badlogicgames.com/wordpress/?p=2791\n\n[0.9.7]\n- see http://www.badlogicgames.com/wordpress/?p=2664\n\n[0.9.6]\n- see http://www.badlogicgames.com/wordpress/?p=2513\n"
        },
        {
          "name": "CLA.txt",
          "type": "blob",
          "size": 7.2529296875,
          "content": "        Individual Contributor License Agreement (\"Agreement\") V2.0\r\n                   http://www.apache.org/licenses/\r\n\r\nThank you for your interest in libGDX. In order to clarify the intellectual \r\nproperty license granted with Contributions from any person or entity, Mario  \r\nZechner and Nathan Sweet (\"Project Owners\") must have a Contributor License Agreement (\"CLA\") \r\non file that has been signed by each Contributor, indicating agreement to the \r\nlicense terms below. This license is for your protection as a Contributor as\r\nwell as the protection of the Project Owners and the project's users; it does \r\nnot change your rights to use your own Contributions for any other purpose.\r\nIf you have not already done so, please complete and sign, then scan and \r\nemail a pdf file of this Agreement to contact@badlogicgames.com. If \r\nnecessary, send an original signed Agreement to\r\nMario Zechner, Steyrergasse 23. 8010 Graz, Styria, Austria.\r\nPlease read this document carefully before signing and keep a copy for your records.\r\n\r\n  Full name: ______________________________________________________\r\n\r\n  Mailing Address: ________________________________________________\r\n\r\n  _________________________________________________________________\r\n\r\n  Country:   ______________________________________________________\r\n\r\n  Telephone: ______________________________________________________\r\n\r\n  Facsimile: ______________________________________________________\r\n\r\n  E-Mail:    ______________________________________________________\r\n  \r\nYou accept and agree to the following terms and conditions for Your\r\npresent and future Contributions submitted to the Project Owners. In\r\nreturn, the Project Owners shall not use Your Contributions in a way that\r\nis contrary to the public benefit or inconsistent with its nonprofit\r\nstatus and bylaws in effect at the time of the Contribution. Except\r\nfor the license granted herein to the Project Owners and recipients of\r\nsoftware distributed by the Project Owners, You reserve all right, title,\r\nand interest in and to Your Contributions.\r\n\r\n1. Definitions.\r\n\r\n   \"You\" (or \"Your\") shall mean the copyright owner or legal entity\r\n   authorized by the copyright owner that is making this Agreement\r\n   with the Project Owners. For legal entities, the entity making a\r\n   Contribution and all other entities that control, are controlled\r\n   by, or are under common control with that entity are considered to\r\n   be a single Contributor. For the purposes of this definition,\r\n   \"control\" means (i) the power, direct or indirect, to cause the\r\n   direction or management of such entity, whether by contract or\r\n   otherwise, or (ii) ownership of fifty percent (50%) or more of the\r\n   outstanding shares, or (iii) beneficial ownership of such entity.\r\n\r\n   \"Contribution\" shall mean any original work of authorship,\r\n   including any modifications or additions to an existing work, that\r\n   is intentionally submitted by You to the Project Owners for inclusion\r\n   in, or documentation of, any of the products owned or managed by\r\n   the Project Owners (the \"Work\"). For the purposes of this definition,\r\n   \"submitted\" means any form of electronic, verbal, or written\r\n   communication sent to the Project Owners or its representatives,\r\n   including but not limited to communication on electronic mailing\r\n   lists, source code control systems, and issue tracking systems that\r\n   are managed by, or on behalf of, the Project Owners for the purpose of\r\n   discussing and improving the Work, but excluding communication that\r\n   is conspicuously marked or otherwise designated in writing by You\r\n   as \"Not a Contribution.\"\r\n\r\n2. Grant of Copyright License. Subject to the terms and conditions of\r\n   this Agreement, You hereby grant to the Project Owners and to\r\n   recipients of software distributed by the Project Owners a perpetual,\r\n   worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n   copyright license to reproduce, prepare derivative works of,\r\n   publicly display, publicly perform, sublicense, and distribute Your\r\n   Contributions and such derivative works.\r\n\r\n3. Grant of Patent License. Subject to the terms and conditions of\r\n   this Agreement, You hereby grant to the Project Owners and to\r\n   recipients of software distributed by the Project Owners a perpetual,\r\n   worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n   (except as stated in this section) patent license to make, have\r\n   made, use, offer to sell, sell, import, and otherwise transfer the\r\n   Work, where such license applies only to those patent claims\r\n   licensable by You that are necessarily infringed by Your\r\n   Contribution(s) alone or by combination of Your Contribution(s)\r\n   with the Work to which such Contribution(s) was submitted. If any\r\n   entity institutes patent litigation against You or any other entity\r\n   (including a cross-claim or counterclaim in a lawsuit) alleging\r\n   that your Contribution, or the Work to which you have contributed,\r\n   constitutes direct or contributory patent infringement, then any\r\n   patent licenses granted to that entity under this Agreement for\r\n   that Contribution or Work shall terminate as of the date such\r\n   litigation is filed.\r\n\r\n4. You represent that you are legally entitled to grant the above\r\n   license. If your employer(s) has rights to intellectual property\r\n   that you create that includes your Contributions, you represent\r\n   that you have received permission to make Contributions on behalf\r\n   of that employer, that your employer has waived such rights for\r\n   your Contributions to the Project Owners's project, or that your employer \r\n   has executed a separate Corporate CLA with the Project Owners.\r\n\r\n5. You represent that each of Your Contributions is Your original\r\n   creation (see section 7 for submissions on behalf of others).  You\r\n   represent that Your Contribution submissions include complete\r\n   details of any third-party license or other restriction (including,\r\n   but not limited to, related patents and trademarks) of which you\r\n   are personally aware and which are associated with any part of Your\r\n   Contributions.\r\n\r\n6. You are not expected to provide support for Your Contributions,\r\n   except to the extent You desire to provide support. You may provide\r\n   support for free, for a fee, or not at all. Unless required by\r\n   applicable law or agreed to in writing, You provide Your\r\n   Contributions on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS\r\n   OF ANY KIND, either express or implied, including, without\r\n   limitation, any warranties or conditions of TITLE, NON-\r\n   INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE.\r\n\r\n7. Should You wish to submit work that is not Your original creation,\r\n   You may submit it to the Project Owners separately from any\r\n   Contribution, identifying the complete details of its source and of\r\n   any license or other restriction (including, but not limited to,\r\n   related patents, trademarks, and license agreements) of which you\r\n   are personally aware, and conspicuously marking the work as\r\n   \"Submitted on behalf of a third-party: [named here]\".\r\n\r\n8. You agree to notify the Project Owners of any facts or circumstances of\r\n   which you become aware that would make these representations\r\n   inaccurate in any respect.\r\n\r\n\r\nPlease sign: __________________________________ Date: ________________\r\n"
        },
        {
          "name": "CONTRIBUTORS",
          "type": "blob",
          "size": 9.5048828125,
          "content": "# This is the official list of people who can contribute\n# (and who have contributed) code to the libGDX project\n# repository.\n# The AUTHORS file lists the copyright holders; this file\n# lists people. Contributors must sign the CLA to grant\n# the AUTHORS copyright within the terms of the Apache 2 license.\n#\nbadlogicgames https://code.google.com/p/libgdx/people/detail?u=badlogicgames\nnathan.sweet https://code.google.com/p/libgdx/people/detail?u=111140558169510542790\nxoppabv https://code.google.com/p/libgdx/people/detail?u=107213573289335234557\nmanifaust https://code.google.com/p/libgdx/people/detail?u=114927210377778482821\nchristoph.widulle https://code.google.com/p/libgdx/people/detail?u=112560729282493911045\ndavedx https://code.google.com/p/libgdx/people/detail?u=106646971767838320186\ndfraska https://code.google.com/p/libgdx/people/detail?u=113737144601926672257\nmoritzpost https://code.google.com/p/libgdx/people/detail?u=110380137820502036004\neric.spitz2000 https://code.google.com/p/libgdx/people/detail?u=107334948459480811307\nTamasJano https://code.google.com/p/libgdx/people/detail?u=117280969515240976789\nst.lebach https://code.google.com/p/libgdx/people/detail?u=116239215871821820986\naurilliance https://code.google.com/p/libgdx/people/detail?u=110107477114594635705\nRemmKK https://code.google.com/p/libgdx/people/detail?u=101588044340639571801\nSaurav42 https://code.google.com/p/libgdx/people/detail?u=109731715524566233572\nshiu at tophatinteractive.com https://code.google.com/p/libgdx/people/detail?u=114865231258541806856\nmobtekdev https://code.google.com/p/libgdx/people/detail?u=118002745180944697863\nemail.nex.software https://code.google.com/p/libgdx/people/detail?u=114241302906882346008\naurelien.ribon https://code.google.com/p/libgdx/people/detail?u=aurelien.ribon\nandgeno https://code.google.com/p/libgdx/people/detail?u=118328945245595192562\nzortness https://code.google.com/p/libgdx/people/detail?u=115738820947903142267\ndanieruru https://code.google.com/p/libgdx/people/detail?u=103207157198186254678\nrod at badlydrawngames.com https://code.google.com/p/libgdx/people/detail?u=117120607153289886212\nsterwill at tinfig.com https://code.google.com/p/libgdx/people/detail?u=116530601598342946624\nariel.coppes https://code.google.com/p/libgdx/people/detail?u=103999810929932499370\nkalle.hamalainen85 https://code.google.com/p/libgdx/people/detail?u=110470429494199495817\nseraphim6x7 https://code.google.com/p/libgdx/people/detail?u=106264993561565607660\nmail.Bompo https://code.google.com/p/libgdx/people/detail?u=mail.Bompo at gmail.com\nemeasure https://code.google.com/p/libgdx/people/detail?u=113054571032645626288\nruben01 https://code.google.com/p/libgdx/people/detail?u=ruben01\nkjetil861 https://code.google.com/p/libgdx/people/detail?u=117798908684920629301\nmanuel.bua https://code.google.com/p/libgdx/people/detail?u=117995045722999398216\nxtophenator https://code.google.com/p/libgdx/people/detail?u=106188873643963298482\nmcatominey08 https://code.google.com/p/libgdx/people/detail?u=mcatominey08\ngurenchan https://code.google.com/p/libgdx/people/detail?u=105724437870307880619\nJHumphriesUK https://code.google.com/p/libgdx/people/detail?u=104362843466103082381\njoshgooderham https://code.google.com/p/libgdx/people/detail?u=104478654042836897055\nmatsemann https://code.google.com/p/libgdx/people/detail?u=112032893690253243180\nanuj.middha https://code.google.com/p/libgdx/people/detail?u=104854747004111561100\nBKPleffner https://code.google.com/p/libgdx/people/detail?u=BKPleffner\nDevmas https://code.google.com/p/libgdx/people/detail?u=116226891524543476841\ntrollymus https://code.google.com/p/libgdx/people/detail?u=105709003746792261192\nrobertmassaioli https://code.google.com/p/libgdx/people/detail?u=113621751123750953408\nDisk1of5 https://code.google.com/p/libgdx/people/detail?u=Disk1of5\ntescott425 https://code.google.com/p/libgdx/people/detail?u=106204609292698713265\ncolin.juillard https://code.google.com/p/libgdx/people/detail?u=113914813724908666943\ndamosalmon https://code.google.com/p/libgdx/people/detail?u=112683454626064187079\njohnnyoneeyed https://code.google.com/p/libgdx/people/detail?u=102366257812339735174\nalexou.garcia https://code.google.com/p/libgdx/people/detail?u=113851938527815992887\nttencate https://code.google.com/p/libgdx/people/detail?u=103828512378244383437\nzomgsako https://code.google.com/p/libgdx/people/detail?u=101343703776052703389\nAngellus.Falsus https://code.google.com/p/libgdx/people/detail?u=118210898387305670207\nmail at balajeerc.info https://code.google.com/p/libgdx/people/detail?u=108245534461530760429\nkev.sully https://code.google.com/p/libgdx/people/detail?u=111086816695469913269\nnick.hutt https://code.google.com/p/libgdx/people/detail?u=112846002046049931716\ndave.des https://code.google.com/p/libgdx/people/detail?u=dave.des at gmail.com\narthur.t.a.gusmao https://code.google.com/p/libgdx/people/detail?u=101626638038792227362\nnushio https://code.google.com/p/libgdx/people/detail?u=nushio\npedro.n.veloso https://code.google.com/p/libgdx/people/detail?u=pedro.n.veloso\nBujiraso https://code.google.com/p/libgdx/people/detail?u=114841316821255815678\nserverkorken https://code.google.com/p/libgdx/people/detail?u=101930906522733910500\nNathanSweet https://github.com/NathanSweet\nbadlogic https://github.com/badlogic\nxoppa https://github.com/xoppa\nMobiDevelop https://github.com/MobiDevelop\nacoppes https://github.com/acoppes\nmanuelbua https://github.com/manuelbua\nSeraphim6x7 https://github.com/Seraphim6x7\nttencate https://github.com/ttencate\nsemtiko https://github.com/semtiko\nstbachmann https://github.com/stbachmann\nrobertmassaioli https://github.com/robertmassaioli\njwisniewski https://github.com/jwisniewski\nbitiotic https://github.com/bitiotic\nsiondream https://github.com/siondream\nblackbluegl https://github.com/blackbluegl\naspic https://github.com/aspic\nmoly https://github.com/moly\nTheInventionist https://github.com/TheInventionist\nSG57 https://github.com/SG57\ntmclif https://github.com/tmclif\nDanny02 https://github.com/Danny02\nanserran https://github.com/anserran\ntalklittle https://github.com/talklittle\nsluglit https://github.com/sluglit\ndieend https://github.com/dieend\nseroperson https://github.com/seroperson\nbroken-e https://github.com/broken-e\njamiltron https://github.com/jamiltron\ntescott https://github.com/tescott\nkreymerman https://github.com/kreymerman\ng-pechorin https://github.com/g-pechorin\nThotep https://github.com/Thotep\ndylanetaft https://github.com/dylanetaft\njericbryledy https://github.com/jericbryledy\nfrustaci https://github.com/frustaci\nvbousquet https://github.com/vbousquet\ntamdinh https://github.com/tamdinh\nnamrog84 https://github.com/namrog84\nveger https://github.com/veger\njjurach https://github.com/jjurach\nsamskivert https://github.com/samskivert\nAurelienRibon https://github.com/AurelienRibon\ntommycli https://github.com/tommycli\nandgeno https://github.com/andgeno\nkichik https://github.com/kichik\nRegiden https://github.com/Regiden\nfivevsthree https://github.com/fivevsthree\njohlo https://github.com/johlo\nxYaW https://github.com/xYaW\npedronveloso https://github.com/pedronveloso\ntjunnone https://github.com/tjunnone\ncwjenkins https://github.com/cwjenkins\nguoguo12 https://github.com/guoguo12\nGetterac7 https://github.com/Getterac7\nDarkIP992 https://github.com/DarkIP992\ndackerman https://github.com/dackerman\nsridharsundaram https://github.com/sridharsundaram\nindiumindeed https://github.com/indiumindeed\ndimsuz https://github.com/dimsuz\nhyvas https://github.com/hyvas\nYonsh https://github.com/Yonsh\nJadems https://github.com/Jadems\nviridia https://github.com/viridia\n0xg https://github.com/0xg\nMoopsLC https://github.com/MoopsLC\nOpotech https://github.com/Opotech\ndounan https://github.com/dounan\nnewtzgames https://github.com/newtzgames\nantionio https://github.com/antionio\nvanlim https://github.com/vanlim\npferreir https://github.com/pferreir\nrathboma https://github.com/rathboma\nbaptr https://github.com/baptr\nksclarke https://github.com/ksclarke\najhager https://github.com/ajhager\nhenu https://github.com/henu\nmikijov https://github.com/mikijov\nsslopek https://github.com/sslopek\nMaescool https://github.com/Maescool\nstickyd https://github.com/stickyd\npsiegel https://github.com/psiegel\nAdelier https://github.com/Adelier\nRicorei https://github.com/Ricorei\nratalaika https://github.com/ratalaika\njustinbowes https://github.com/justinbowes\nbornskilled200 https://github.com/bornskilled200\nMicrobius https://github.com/Microbius\nJohnLambe https://github.com/JohnLambe\nTimeToPlay https://github.com/TimeToPlay\nnbadal https://github.com/nbadal\nacr21 https://github.com/acr21\nzbarnett https://github.com/zbarnett\napautrot https://github.com/apautrot\nPsyfire https://github.com/Psyfire\nexidl https://github.com/exidl\nkevglass https://github.com/kevglass\ncaniep https://github.com/caniep\njrenner https://github.com/jrenner\nsinistersnare https://github.com/sinistersnare\nRanzdo https://github.com/Ranzdo\nmbforbes https://github.com/mbforbes\nUnkn0wn0ne https://github.com/Unkn0wn0ne\ndavebaol https://github.com/davebaol\nCodePoKE https://github.com/codepoke \nKonijnendijk https://github.com/Konijnendijk\nnooone https://github.com/nooone\nkotcrab https://github.com/kotcrab\nClaudiuBele https://github.com/ClaudiuBele\nrealitix https://github.com/realitix\nvmilea https://github.com/vmilea\nintrigus https://github.com/intrigus\ncode-disaster https://github.com/code-disaster\n3xp0n3nt https://github.com/3xp0n3nt\nZomby2D https://github.com/Zomby2D\ncypherdare https://github.com/cypherdare\ntommyettinger https://github.com/tommyettinger\nPilzschaf https://github.com/Pilzschaf\nPokeMMO https://github.com/PokeMMO\npayne911 https://github.com/payne911/\nthechubbypanda https://github.com/thechubbypanda\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 9.935546875,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.7216796875,
          "content": "![libGDX Logo](libgdx_logo.svg)\r\n\r\n[![GitHub Actions Build Status](https://img.shields.io/github/actions/workflow/status/libgdx/libgdx/build-publish.yml?branch=master&label=GitHub%20Actions)](https://github.com/libgdx/libgdx/actions?query=workflow%3A%22Build+and+Publish%22)\r\n\r\n[![Latest Version](https://img.shields.io/nexus/r/com.badlogicgames.gdx/gdx?nexusVersion=2&server=https%3A%2F%2Foss.sonatype.org&label=Version)](https://search.maven.org/artifact/com.badlogicgames.gdx/gdx)\r\n[![Snapshots](https://img.shields.io/nexus/s/com.badlogicgames.gdx/gdx?server=https%3A%2F%2Foss.sonatype.org&label=Snapshots)](https://oss.sonatype.org/#nexus-search;gav~com.badlogicgames.gdx~gdx~~~~kw,versionexpand)\r\n\r\n[![Discord Chat](https://img.shields.io/discord/348229412858101762?logo=discord)](https://libgdx.com/community/discord/)\r\n\r\n## Cross-platform Game Development Framework\r\n**[libGDX](https://libgdx.com) is a cross-platform Java game development framework based on OpenGL (ES), designed for Windows, Linux, macOS, Android, web browsers, and iOS.** It provides a robust and well-established environment for rapid prototyping and iterative development. Unlike other frameworks, libGDX does not impose a specific design or coding style, allowing you the freedom to create games according to your preferences.\r\n\r\n## Open Source, Feature Packed, and Fostering a Large Third-Party Ecosystem\r\nlibGDX is released under the [Apache 2.0 License](https://www.apache.org/licenses/LICENSE-2.0.html), offering unrestricted usage in both commercial and non-commercial projects. While not mandatory, we appreciate any credit given to libGDX when you release a game or app using it. Check out our [showcase](https://libgdx.com/showcase/) for a selection of popular libGDX-powered games. With libGDX, you gain access to a comprehensive set of tools and features to develop multi-platform 2D and 3D games using Java.\r\n\r\nMoreover, libGDX boasts a vibrant third-party ecosystem, with numerous [tools](https://libgdx.com/dev/tools/) and libraries that streamline development tasks. Explore the [awesome-libgdx](https://github.com/rafaskb/awesome-libgdx#readme) repository for a curated list of libGDX-centered libraries, serving as an excellent starting point for newcomers in the libGDX community.\r\n\r\n![](https://libgdx.com/assets/images/index_showcase/game0.png)\r\n###### An example game created with libGDX: [Pathway](https://store.steampowered.com/app/546430/Pathway/) by Robotality. Discover more captivating games in our [Showcase](https://libgdx.com/showcase/).\r\n\r\n## Getting Started with libGDX / Documentation\r\nThanks to Gradle, you can easily set up libGDX without the need to download the framework itself. Your favorite build tool can handle everything for you. Additionally, we offer a convenient [setup tool](https://libgdx.com/dev/#how-to-get-started-with-libgdx) that automates project creation and downloads all the necessary components. Check out our **[website](https://libgdx.com/wiki/start/setup)** for instructions on getting started or refer to our comprehensive **[wiki](https://libgdx.com/wiki/)**.\r\n\r\n- [Creating a libGDX Project](https://libgdx.com/wiki/start/setup)\r\n- [Building a Simple Game](https://libgdx.com/wiki/start/a-simple-game)\r\n- [Tutorials & Demos](https://libgdx.com/wiki/start/demos-and-tutorials)\r\n\r\nWe provide the libGDX [javadocs](https://javadoc.io/doc/com.badlogicgames.gdx) online for easy reference. Additionally, the javadocs are bundled with every libGDX distribution, ensuring smooth integration with your preferred IDE.\r\n\r\n## Community & Contribution\r\nStay up to date with the **latest libGDX news** by following our [blog](https://libgdx.com/news/). For engaging discussions and support, join our official [libGDX Discord](https://libgdx.com/community/discord/).\r\n\r\n### Reporting Issues\r\nUse the **[Issue Tracker](https://github.com/libgdx/libgdx/issues)** here on GitHub to report any issues you encounter. Before submitting, please read our [Getting Help](https://libgdx.com/wiki/articles/getting-help) guide, which walks you through the process of reporting an issue effectively.\r\n\r\n### Contributing to the Codebase\r\nlibGDX benefits greatly from contributions made by our dedicated developer community. We appreciate any assistance in making libGDX even better. Check out the [CONTRIBUTING.md](https://github.com/libgdx/libgdx/blob/master/.github/CONTRIBUTING.md) file for details on how to contribute. Note that contributing involves working directly with libGDX's source code, a process that regular users do not typically undertake. Refer to the [Working with the Source](https://libgdx.com/dev/from-source/) article for guidance.\r\n\r\nYou can also support our infrastructure (build server, web server, test devices) by contributing financially through our [Patreon](https://patreon.com/libgdx)!\r\n"
        },
        {
          "name": "THIRDPARTY",
          "type": "blob",
          "size": 1.74609375,
          "content": "ANGLE/MetalANGLE:\n    // Copyright 2018 The ANGLE Project Authors.\n    // All rights reserved.\n    //\n    // Redistribution and use in source and binary forms, with or without\n    // modification, are permitted provided that the following conditions\n    // are met:\n    //\n    //     Redistributions of source code must retain the above copyright\n    //     notice, this list of conditions and the following disclaimer.\n    //\n    //     Redistributions in binary form must reproduce the above\n    //     copyright notice, this list of conditions and the following\n    //     disclaimer in the documentation and/or other materials provided\n    //     with the distribution.\n    //\n    //     Neither the name of TransGaming Inc., Google Inc., 3DLabs Inc.\n    //     Ltd., nor the names of their contributors may be used to endorse\n    //     or promote products derived from this software without specific\n    //     prior written permission.\n    //\n    // THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    // \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    // LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n    // FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n    // COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n    // INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n    // BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n    // LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n    // CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n    // LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n    // ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n    // POSSIBILITY OF SUCH DAMAGE."
        },
        {
          "name": "backends",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 5.9130859375,
          "content": "/*******************************************************************************\n * Copyright 2011 See AUTHORS file.\n *\n * Licensed under the Apache License, Version 2.0 (the \"License\");\n * you may not use this file except in compliance with the License.\n * You may obtain a copy of the License at\n *\n *   http://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.\n ******************************************************************************/\nbuildscript {\n\tapply from: \"gradle/dependencies.gradle\"\n\n\trepositories {\n\t\tmavenCentral()\n\t\tgradlePluginPortal()\n\t}\n\tdependencies {\n\t\tclasspath \"com.diffplug.spotless:spotless-plugin-gradle:${versions.spotless}\"\n\t\tclasspath \"com.badlogicgames.gdx:gdx-jnigen-gradle:2.5.2\"\n\t}\n}\n\nplugins {\n\tid \"de.undercouch.download\" version \"5.0.1\"\n}\n\napply from: \"gradle/dependencies.gradle\"\n\next {\n\tisReleaseBuild = {\n\t\treturn project.hasProperty(\"RELEASE\")\n\t}\n\n\tgetReleaseRepositoryUrl = {\n\t\treturn project.hasProperty('RELEASE_REPOSITORY_URL') ? RELEASE_REPOSITORY_URL\n\t\t\t\t: \"https://oss.sonatype.org/service/local/staging/deploy/maven2/\"\n\t}\n\n\tgetSnapshotRepositoryUrl = {\n\t\treturn project.hasProperty('SNAPSHOT_REPOSITORY_URL') ? SNAPSHOT_REPOSITORY_URL\n\t\t\t\t: \"https://oss.sonatype.org/content/repositories/snapshots/\"\n\t}\n\n\tgetRepositoryUsername = {\n\t\treturn project.hasProperty('MAVEN_USERNAME') ? MAVEN_USERNAME : \"\"\n\t}\n\n\tgetRepositoryPassword = {\n\t\treturn project.hasProperty('MAVEN_PASSWORD') ? MAVEN_PASSWORD : \"\"\n\t}\n}\n\nallprojects {\n\tgroup = 'com.badlogicgames.gdx'\n\tversion = project.getProperty('version') + (isReleaseBuild() ? \"\" : \"-SNAPSHOT\")\n\n\tbuildscript {\n\t\trepositories {\n\t\t\tgoogle()\n\t\t\tmavenLocal()\n\t\t\tmavenCentral()\n\t\t\tgradlePluginPortal()\n\t\t\tmaven { url \"https://oss.sonatype.org/content/repositories/snapshots/\" }\n\t\t\tmaven { url \"https://oss.sonatype.org/content/repositories/releases/\" }\n\t\t}\n\t}\n\n\trepositories {\n\t\tgoogle()\n\t\tmavenLocal()\n\t\tmavenCentral()\n\t\tgradlePluginPortal()\n\t\tmaven { url \"https://oss.sonatype.org/content/repositories/snapshots/\" }\n\t\tmaven { url \"https://oss.sonatype.org/content/repositories/releases/\" }\n\t}\n\n\ttasks.withType(JavaCompile) {\n\t\toptions.encoding = 'UTF-8'\n\t}\n\ttasks.withType(Javadoc) {\n\t\toptions.encoding = 'UTF-8'\n\t\toptions.addBooleanOption('use', true);\n\t}\n\ttasks.withType(Test) {\n\t\tsystemProperty 'file.encoding', 'UTF-8'\n\t}\n\n\tif (JavaVersion.current().isJava8Compatible()) {\n\t\ttasks.withType(Javadoc) {\n\t\t\toptions.addStringOption('Xdoclint:none,-missing', '-quiet')\n\t\t}\n\t}\n\n\tif (JavaVersion.current().isJava9Compatible()) {\n\t\ttasks.withType(Javadoc) {\n\t\t\toptions.addStringOption(\"-release\", \"8\");\n\t\t}\n\t}\n\n\tapply plugin: \"com.diffplug.spotless\"\n\n\tspotless {\n\t\tlineEndings 'UNIX'\n\n\t\tjava {\n\t\t\ttarget 'src/**/*.java', 'test/**/*.java', 'generator/**/*.java'\n\t\t\tremoveUnusedImports()\n\t\t\teclipse().configFile new File(rootProject.projectDir.absolutePath, 'eclipse-formatter.xml')\n\t\t}\n\t\tgroovyGradle {\n\t\t\ttarget '*.gradle'\n\t\t\tgreclipse().configFile new File(rootProject.projectDir.absolutePath, 'eclipse-formatter.xml')\n\t\t}\n\t}\n}\n\nconfigure(subprojects - project(\":tests:gdx-tests-android\") - project(\":backends:gdx-backend-android\")) {\n\tapply plugin: \"java-library\"\n\n\tcompileJava {\n\t\toptions.fork = true\n\t\toptions.incremental = true\n\t}\n\n\tjava {\n\t\twithJavadocJar()\n\t\twithSourcesJar()\n\t}\n}\n\nconfigure(subprojects - project(\":backends\") - project(\":extensions\") - project(\":tests\") - project(\":extensions:gdx-box2d-parent\")) {\n\tapply plugin: \"idea\"\n\tapply plugin: \"eclipse\"\n\n\t//This has to be done in afterEvaluate due to java/android plugin dependency\n\tafterEvaluate {\n\t\teclipse {\n\t\t\tproject {\n\t\t\t\t//hide gradle build folders from eclipse\n\t\t\t\tresourceFilter {\n\t\t\t\t\tappliesTo = 'FOLDERS'\n\t\t\t\t\ttype = 'EXCLUDE_ALL'\n\t\t\t\t\tmatcher {\n\t\t\t\t\t\tid = 'org.eclipse.ui.ide.multiFilter'\n\t\t\t\t\t\targuments = '1.0-projectRelativePath-matches-true-false-build'\n\t\t\t\t\t}\n\t\t\t\t}\n\t\t\t}\n\t\t\tjdt {\n\t\t\t\tfile {\n\t\t\t\t\twithProperties { properties ->\n\t\t\t\t\t\tdef libgdxJdtProperties = new Properties()\n\t\t\t\t\t\tlibgdxJdtProperties.load(new FileInputStream(\".settings/org.eclipse.jdt.libgdx.prefs\"))\n\t\t\t\t\t\tproperties.putAll(libgdxJdtProperties)\n\t\t\t\t\t}\n\t\t\t\t}\n\t\t\t}\n\t\t\tclasspath.file {\n\t\t\t\twhenMerged { classpath ->\n\t\t\t\t\tclasspath.entries.findAll { entry -> entry.kind == 'lib' || entry.kind == 'src' }*.exported = true\n\t\t\t\t}\n\t\t\t}\n\t\t}\n\t\t//Set all projects to use UTF-8 file encoding for all files\n\t\teclipseJdt.doLast {\n\t\t\tFile f = new File(projectDir, '.settings/org.eclipse.core.resources.prefs')\n\t\t\tf.write('eclipse.preferences.version=1\\n')\n\t\t\tf.append('encoding/<project>=UTF-8')\n\t\t}\n\t}\n}\n\ntasks.register('setupExternalNativesDirs') {\n\tdoLast {\n\t\tfile(\"build\").mkdir();\n\t\tfile(\"extensions/gdx-lwjgl3-angle/res\").mkdirs();\n\t}\n\tdoNotTrackState(\"Don't track state\")\n}\n\ntasks.register('fetchAngleNativesZIP', Download) {\n\tdependsOn setupExternalNativesDirs\n\tsrc 'https://raw.githubusercontent.com/libgdx/gdx-angle-natives/master/gdx-angle-natives.zip'\n\tdest 'build/gdx-angle-natives.zip'\n\tonlyIfModified true\n\tuseETag \"all\"\n}\n\ntasks.register('fetchExternalNatives', Copy) {\n\tdependsOn fetchAngleNativesZIP\n\tfrom zipTree(\"build/gdx-angle-natives.zip\")\n\tinto \"./extensions/gdx-lwjgl3-angle/res\"\n\tdoNotTrackState(\"Don't track state\")\n}\n\ntasks.register('fetchGdxNativesZIP', Download) {\n\tdependsOn fetchExternalNatives\n\tsrc \"https://libgdx-nightlies.s3.eu-central-1.amazonaws.com/libgdx-nightlies/natives.zip\"\n\tdest \"build/natives.zip\"\n\tonlyIfModified true\n\tuseETag \"all\"\n}\n\ntasks.register('fetchNatives', Copy) {\n\tdependsOn fetchGdxNativesZIP\n\tfrom zipTree(\"build/natives.zip\")\n\tinto \".\"\n\tdoNotTrackState(\"Don't track state\")\n}\n\napply from: rootProject.file('publish.gradle')\n\nif(rootProject.file('override.gradle').exists())\n\tapply from: rootProject.file('override.gradle')\n\napply from: \"gradle/dist.gradle\"\n"
        },
        {
          "name": "eclipse-formatter.xml",
          "type": "blob",
          "size": 30.4248046875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\r\n<profiles version=\"12\">\r\n<profile kind=\"CodeFormatterProfile\" name=\"libgdx\" version=\"12\">\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.insert_new_line_before_root_tags\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.disabling_tag\" value=\"@off\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_annotation\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_type_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_type_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_type_arguments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_anonymous_type_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_case\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_brace_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.new_lines_at_block_boundaries\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_annotation_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_before_closing_brace_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_annotation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_field\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_while\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.use_on_off_tags\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_parens_in_annotation_type_member_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_before_else_in_if_statement\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_prefix_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.keep_else_statement_on_same_line\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_ellipsis\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.insert_new_line_for_parameter\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_annotation_type_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_breaks_compare_to_cases\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_at_in_annotation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_multiple_fields\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_expressions_in_array_initializer\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_conditional_expression\" value=\"80\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_for\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_binary_operator\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_question_in_wildcard\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_array_initializer\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_parens_in_enum_constant\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_before_finally_in_try_statement\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_local_variable\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_before_catch_in_try_statement\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_while\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_after_package\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_type_parameters\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.continuation_indentation\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_postfix_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_method_invocation\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_angle_bracket_in_type_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_superinterfaces\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_new_chunk\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_binary_operator\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_package\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.source\" value=\"1.7\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_enum_constant_arguments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_constructor_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_line_comments\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_closing_angle_bracket_in_type_arguments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_enum_declarations\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.join_wrapped_lines\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_block\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_explicit_constructor_call\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_method_invocation_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_member_type\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.align_type_members_on_columns\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_enum_constant\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_for\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_method_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_selector_in_method_invocation\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_switch\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_unary_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_colon_in_case\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.indent_parameter_description\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_method_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_switch\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_enum_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_angle_bracket_in_type_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.clear_blank_lines_in_block_comment\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_type_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.lineSplit\" value=\"130\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_if\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_brackets_in_array_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_parenthesized_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_explicitconstructorcall_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_constructor_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_first_class_body_declaration\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_method\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indentation.size\" value=\"4\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_parens_in_method_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.enabling_tag\" value=\"@on\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_enum_constant\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_superclass_in_type_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_assignment\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.problem.assertIdentifier\" value=\"error\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.tabulation.char\" value=\"tab\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_constructor_declaration_parameters\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_semicolon_in_try_resources\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_prefix_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_statements_compare_to_body\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_method\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.wrap_outer_expressions_when_nested\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.format_guardian_clause_on_one_line\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_for\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_cast\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_parameters_in_constructor_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_colon_in_labeled_statement\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_annotation_type_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_method_body\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_method_declaration\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_method_invocation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_try\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_bracket_in_array_allocation_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_enum_constant\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_annotation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_at_in_annotation_type_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_method_declaration_throws\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_if\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_switch\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_method_declaration_throws\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_parenthesized_expression_in_return\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_annotation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_question_in_conditional\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_question_in_wildcard\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_try\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_bracket_in_array_allocation_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.preserve_white_space_between_code_and_line_comments\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_parenthesized_expression_in_throw\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_type_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.problem.enumIdentifier\" value=\"error\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_switchstatements_compare_to_switch\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_ellipsis\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_block\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_for_inits\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_method_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.compact_else_if\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.wrap_before_or_operator_multicatch\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_for_increments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.format_line_comment_starting_on_first_column\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_bracket_in_array_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_field\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_enum_constant\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.indent_root_tags\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_enum_declarations\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_union_type_in_multicatch\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_explicitconstructorcall_arguments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_switch\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_method_declaration_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_superinterfaces\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_allocation_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.tabulation.size\" value=\"3\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_bracket_in_array_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_opening_brace_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_closing_brace_in_block\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_bracket_in_array_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_enum_constant\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_angle_bracket_in_type_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_constructor_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_constructor_declaration_throws\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_if\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.clear_blank_lines_in_javadoc_comment\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_throws_clause_in_constructor_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_assignment_operator\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_assignment_operator\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_empty_lines\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_synchronized\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_closing_paren_in_cast\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_method_declaration_parameters\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_block_in_case\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.number_of_empty_lines_to_preserve\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_method_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_catch\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_constructor_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_method_invocation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_bracket_in_array_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_qualified_allocation_expression\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_and_in_type_parameter\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.compliance\" value=\"1.7\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.continuation_indentation_for_array_initializer\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_brackets_in_array_allocation_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_at_in_annotation_type_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_allocation_expression\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_cast\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_unary_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_angle_bracket_in_parameterized_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_anonymous_type_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.keep_empty_array_initializer_on_one_line\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_enum_declaration\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.keep_imple_if_on_one_line\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_constructor_declaration_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_closing_angle_bracket_in_type_parameters\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_at_end_of_file_if_missing\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_colon_in_for\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_labeled_statement\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_parameterized_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_superinterfaces_in_type_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_binary_expression\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_enum_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_type\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_while\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.codegen.inlineJsrBytecode\" value=\"enabled\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_try\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.put_empty_statement_on_new_line\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_label\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_parameter\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_angle_bracket_in_type_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_parens_in_method_invocation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_before_while_in_do_statement\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_enum_constant\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_javadoc_comments\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.line_length\" value=\"130\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_after_annotation_on_package\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_between_import_groups\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_enum_constant_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_semicolon\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_constructor_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.number_of_blank_lines_at_beginning_of_method_body\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_conditional\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_body_declarations_compare_to_type_header\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_annotation_type_member_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.wrap_before_binary_operator\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_body_declarations_compare_to_enum_declaration_header\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_between_type_declarations\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_synchronized\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_statements_compare_to_block\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_superinterfaces_in_enum_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.join_lines_in_comments\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_question_in_conditional\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_multiple_field_declarations\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_compact_if\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_for_inits\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_switchstatements_compare_to_cases\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_array_initializer\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_default\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_and_in_type_parameter\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_parens_in_constructor_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_before_imports\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_colon_in_assert\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_html\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_throws_clause_in_method_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_angle_bracket_in_type_parameters\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_bracket_in_array_allocation_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_anonymous_type_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_colon_in_conditional\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_angle_bracket_in_parameterized_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_for\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_postfix_operator\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_source_code\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_synchronized\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_allocation_expression\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_constructor_declaration_throws\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_parameters_in_method_declaration\" value=\"16\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_brace_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.compiler.codegen.targetPlatform\" value=\"1.7\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_resources_in_try\" value=\"80\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.use_tabs_only_for_leading_indentations\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_arguments_in_annotation\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_header\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.format_block_comments\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_enum_constant\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.alignment_for_enum_constants\" value=\"0\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_new_line_in_empty_block\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_body_declarations_compare_to_annotation_declaration_header\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_parenthesized_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_parenthesized_expression\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_catch\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_multiple_local_declarations\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_switch\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_comma_in_for_increments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_method_invocation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_colon_in_assert\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.brace_position_for_type_declaration\" value=\"end_of_line\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_brace_in_array_initializer\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_between_empty_braces_in_array_initializer\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_opening_paren_in_method_declaration\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_semicolon_in_for\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_paren_in_catch\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_angle_bracket_in_parameterized_type_reference\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_multiple_field_declarations\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_closing_paren_in_annotation\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_parameterized_type_reference\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_method_invocation_arguments\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.comment.new_lines_at_javadoc_boundaries\" value=\"false\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.blank_lines_after_imports\" value=\"1\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_comma_in_multiple_local_declarations\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.indent_body_declarations_compare_to_enum_constant_header\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_after_semicolon_in_for\" value=\"insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.never_indent_line_comments_on_first_column\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_semicolon_in_try_resources\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.insert_space_before_opening_angle_bracket_in_type_arguments\" value=\"do not insert\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.never_indent_block_comments_on_first_column\" value=\"true\"/>\r\n<setting id=\"org.eclipse.jdt.core.formatter.keep_then_statement_on_same_line\" value=\"false\"/>\r\n</profile>\r\n</profiles>\r\n"
        },
        {
          "name": "extensions",
          "type": "tree",
          "content": null
        },
        {
          "name": "gdx",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 0.5810546875,
          "content": "org.gradle.daemon=true\norg.gradle.jvmargs=-Xms128m -Xmx2000m\norg.gradle.configureondemand=false\nandroid.useAndroidX=true\n\ngroup=com.badlogicgames.gdx\nversion=1.13.2\nPOM_NAME=libGDX\nPOM_DESCRIPTION=Android/Desktop/iOS/HTML5 game development framework\nPOM_URL=https://github.com/libgdx/libgdx\nPOM_SCM_URL=https://github.com/libgdx/libgdx\nPOM_SCM_CONNECTION=scm:git@github.com:libgdx/libgdx.git\nPOM_SCM_DEV_CONNECTION=scm:git@github.com:libgdx/libgdx.git\nPOM_LICENCE_NAME=The Apache Software License, Version 2.0\nPOM_LICENCE_URL=http://www.apache.org/licenses/LICENSE-2.0.txt\nPOM_LICENCE_DIST=repo\n"
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 8.48828125,
          "content": "#!/bin/sh\n\n#\n# Copyright © 2015-2021 the original authors.\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      https://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n#\n\n##############################################################################\n#\n#   Gradle start up script for POSIX generated by Gradle.\n#\n#   Important for running:\n#\n#   (1) You need a POSIX-compliant shell to run this script. If your /bin/sh is\n#       noncompliant, but you have some other compliant shell such as ksh or\n#       bash, then to run this script, type that shell name before the whole\n#       command line, like:\n#\n#           ksh Gradle\n#\n#       Busybox and similar reduced shells will NOT work, because this script\n#       requires all of these POSIX shell features:\n#         * functions;\n#         * expansions «$var», «${var}», «${var:-default}», «${var+SET}»,\n#           «${var#prefix}», «${var%suffix}», and «$( cmd )»;\n#         * compound commands having a testable exit status, especially «case»;\n#         * various built-in commands including «command», «set», and «ulimit».\n#\n#   Important for patching:\n#\n#   (2) This script targets any POSIX shell, so it avoids extensions provided\n#       by Bash, Ksh, etc; in particular arrays are avoided.\n#\n#       The \"traditional\" practice of packing multiple parameters into a\n#       space-separated string is a well documented source of bugs and security\n#       problems, so this is (mostly) avoided, by progressively accumulating\n#       options in \"$@\", and eventually passing that to Java.\n#\n#       Where the inherited environment variables (DEFAULT_JVM_OPTS, JAVA_OPTS,\n#       and GRADLE_OPTS) rely on word-splitting, this is performed explicitly;\n#       see the in-line comments for details.\n#\n#       There are tweaks for specific operating systems such as AIX, CygWin,\n#       Darwin, MinGW, and NonStop.\n#\n#   (3) This script is generated from the Groovy template\n#       https://github.com/gradle/gradle/blob/HEAD/subprojects/plugins/src/main/resources/org/gradle/api/internal/plugins/unixStartScript.txt\n#       within the Gradle project.\n#\n#       You can find Gradle at https://github.com/gradle/gradle/.\n#\n##############################################################################\n\n# Attempt to set APP_HOME\n\n# Resolve links: $0 may be a link\napp_path=$0\n\n# Need this for daisy-chained symlinks.\nwhile\n    APP_HOME=${app_path%\"${app_path##*/}\"}  # leaves a trailing /; empty if no leading path\n    [ -h \"$app_path\" ]\ndo\n    ls=$( ls -ld \"$app_path\" )\n    link=${ls#*' -> '}\n    case $link in             #(\n      /*)   app_path=$link ;; #(\n      *)    app_path=$APP_HOME$link ;;\n    esac\ndone\n\n# This is normally unused\n# shellcheck disable=SC2034\nAPP_BASE_NAME=${0##*/}\n# Discard cd standard output in case $CDPATH is set (https://github.com/gradle/gradle/issues/25036)\nAPP_HOME=$( cd \"${APP_HOME:-./}\" > /dev/null && pwd -P ) || exit\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=maximum\n\nwarn () {\n    echo \"$*\"\n} >&2\n\ndie () {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n} >&2\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\nnonstop=false\ncase \"$( uname )\" in                #(\n  CYGWIN* )         cygwin=true  ;; #(\n  Darwin* )         darwin=true  ;; #(\n  MSYS* | MINGW* )  msys=true    ;; #(\n  NONSTOP* )        nonstop=true ;;\nesac\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=$JAVA_HOME/jre/sh/java\n    else\n        JAVACMD=$JAVA_HOME/bin/java\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=java\n    if ! command -v java >/dev/null 2>&1\n    then\n        die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nfi\n\n# Increase the maximum file descriptors if we can.\nif ! \"$cygwin\" && ! \"$darwin\" && ! \"$nonstop\" ; then\n    case $MAX_FD in #(\n      max*)\n        # In POSIX sh, ulimit -H is undefined. That's why the result is checked to see if it worked.\n        # shellcheck disable=SC2039,SC3045\n        MAX_FD=$( ulimit -H -n ) ||\n            warn \"Could not query maximum file descriptor limit\"\n    esac\n    case $MAX_FD in  #(\n      '' | soft) :;; #(\n      *)\n        # In POSIX sh, ulimit -n is undefined. That's why the result is checked to see if it worked.\n        # shellcheck disable=SC2039,SC3045\n        ulimit -n \"$MAX_FD\" ||\n            warn \"Could not set maximum file descriptor limit to $MAX_FD\"\n    esac\nfi\n\n# Collect all arguments for the java command, stacking in reverse order:\n#   * args from the command line\n#   * the main class name\n#   * -classpath\n#   * -D...appname settings\n#   * --module-path (only if needed)\n#   * DEFAULT_JVM_OPTS, JAVA_OPTS, and GRADLE_OPTS environment variables.\n\n# For Cygwin or MSYS, switch paths to Windows format before running java\nif \"$cygwin\" || \"$msys\" ; then\n    APP_HOME=$( cygpath --path --mixed \"$APP_HOME\" )\n    CLASSPATH=$( cygpath --path --mixed \"$CLASSPATH\" )\n\n    JAVACMD=$( cygpath --unix \"$JAVACMD\" )\n\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    for arg do\n        if\n            case $arg in                                #(\n              -*)   false ;;                            # don't mess with options #(\n              /?*)  t=${arg#/} t=/${t%%/*}              # looks like a POSIX filepath\n                    [ -e \"$t\" ] ;;                      #(\n              *)    false ;;\n            esac\n        then\n            arg=$( cygpath --path --ignore --mixed \"$arg\" )\n        fi\n        # Roll the args list around exactly as many times as the number of\n        # args, so each arg winds up back in the position where it started, but\n        # possibly modified.\n        #\n        # NB: a `for` loop captures its iteration list before it begins, so\n        # changing the positional parameters here affects neither the number of\n        # iterations, nor the values presented in `arg`.\n        shift                   # remove old arg\n        set -- \"$@\" \"$arg\"      # push replacement arg\n    done\nfi\n\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS='\"-Xmx64m\" \"-Xms64m\"'\n\n# Collect all arguments for the java command:\n#   * DEFAULT_JVM_OPTS, JAVA_OPTS, JAVA_OPTS, and optsEnvironmentVar are not allowed to contain shell fragments,\n#     and any embedded shellness will be escaped.\n#   * For example: A user cannot expect ${Hostname} to be expanded, as it is an environment variable and will be\n#     treated as '${Hostname}' itself on the command line.\n\nset -- \\\n        \"-Dorg.gradle.appname=$APP_BASE_NAME\" \\\n        -classpath \"$CLASSPATH\" \\\n        org.gradle.wrapper.GradleWrapperMain \\\n        \"$@\"\n\n# Stop when \"xargs\" is not available.\nif ! command -v xargs >/dev/null 2>&1\nthen\n    die \"xargs is not available\"\nfi\n\n# Use \"xargs\" to parse quoted args.\n#\n# With -n1 it outputs one arg per line, with the quotes and backslashes removed.\n#\n# In Bash we could simply go:\n#\n#   readarray ARGS < <( xargs -n1 <<<\"$var\" ) &&\n#   set -- \"${ARGS[@]}\" \"$@\"\n#\n# but POSIX shell has neither arrays nor command substitution, so instead we\n# post-process each arg (as a line of input to sed) to backslash-escape any\n# character that might be a shell metacharacter, then use eval to reverse\n# that process (while maintaining the separation between arguments), and wrap\n# the whole thing up as a single \"set\" statement.\n#\n# This will of course break if any of these variables contains a newline or\n# an unmatched quote.\n#\n\neval \"set -- $(\n        printf '%s\\n' \"$DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS\" |\n        xargs -n1 |\n        sed ' s~[^-[:alnum:]+,./:=@_]~\\\\&~g; ' |\n        tr '\\n' ' '\n    )\" '\"$@\"'\n\nexec \"$JAVACMD\" \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.80078125,
          "content": "@rem\r\n@rem Copyright 2015 the original author or authors.\r\n@rem\r\n@rem Licensed under the Apache License, Version 2.0 (the \"License\");\r\n@rem you may not use this file except in compliance with the License.\r\n@rem You may obtain a copy of the License at\r\n@rem\r\n@rem      https://www.apache.org/licenses/LICENSE-2.0\r\n@rem\r\n@rem Unless required by applicable law or agreed to in writing, software\r\n@rem distributed under the License is distributed on an \"AS IS\" BASIS,\r\n@rem WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\r\n@rem See the License for the specific language governing permissions and\r\n@rem limitations under the License.\r\n@rem\r\n\r\n@if \"%DEBUG%\"==\"\" @echo off\r\n@rem ##########################################################################\r\n@rem\r\n@rem  Gradle startup script for Windows\r\n@rem\r\n@rem ##########################################################################\r\n\r\n@rem Set local scope for the variables with windows NT shell\r\nif \"%OS%\"==\"Windows_NT\" setlocal\r\n\r\nset DIRNAME=%~dp0\r\nif \"%DIRNAME%\"==\"\" set DIRNAME=.\r\n@rem This is normally unused\r\nset APP_BASE_NAME=%~n0\r\nset APP_HOME=%DIRNAME%\r\n\r\n@rem Resolve any \".\" and \"..\" in APP_HOME to make it shorter.\r\nfor %%i in (\"%APP_HOME%\") do set APP_HOME=%%~fi\r\n\r\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\r\nset DEFAULT_JVM_OPTS=\"-Xmx64m\" \"-Xms64m\"\r\n\r\n@rem Find java.exe\r\nif defined JAVA_HOME goto findJavaFromJavaHome\r\n\r\nset JAVA_EXE=java.exe\r\n%JAVA_EXE% -version >NUL 2>&1\r\nif %ERRORLEVEL% equ 0 goto execute\r\n\r\necho.\r\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:findJavaFromJavaHome\r\nset JAVA_HOME=%JAVA_HOME:\"=%\r\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\r\n\r\nif exist \"%JAVA_EXE%\" goto execute\r\n\r\necho.\r\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\r\necho.\r\necho Please set the JAVA_HOME variable in your environment to match the\r\necho location of your Java installation.\r\n\r\ngoto fail\r\n\r\n:execute\r\n@rem Setup the command line\r\n\r\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\r\n\r\n\r\n@rem Execute Gradle\r\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %*\r\n\r\n:end\r\n@rem End local scope for the variables with windows NT shell\r\nif %ERRORLEVEL% equ 0 goto mainEnd\r\n\r\n:fail\r\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\r\nrem the _cmd.exe /c_ return code!\r\nset EXIT_CODE=%ERRORLEVEL%\r\nif %EXIT_CODE% equ 0 set EXIT_CODE=1\r\nif not \"\"==\"%GRADLE_EXIT_CONSOLE%\" exit %EXIT_CODE%\r\nexit /b %EXIT_CODE%\r\n\r\n:mainEnd\r\nif \"%OS%\"==\"Windows_NT\" endlocal\r\n\r\n:omega\r\n"
        },
        {
          "name": "libgdx_logo.svg",
          "type": "blob",
          "size": 3.5478515625,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n<!-- Created with Inkscape (http://www.inkscape.org/) -->\n\n<svg\n   xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\n   xmlns:cc=\"http://creativecommons.org/ns#\"\n   xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n   xmlns:svg=\"http://www.w3.org/2000/svg\"\n   xmlns=\"http://www.w3.org/2000/svg\"\n   version=\"1.1\"\n   width=\"300\"\n   height=\"50\"\n   id=\"svg2991\">\n  <defs\n     id=\"defs2993\" />\n  <metadata\n     id=\"metadata2996\">\n    <rdf:RDF>\n      <cc:Work\n         rdf:about=\"\">\n        <dc:format>image/svg+xml</dc:format>\n        <dc:type\n           rdf:resource=\"http://purl.org/dc/dcmitype/StillImage\" />\n        <dc:title></dc:title>\n      </cc:Work>\n    </rdf:RDF>\n  </metadata>\n  <rect\n     width=\"14.000075\"\n     height=\"50\"\n     x=\"0\"\n     y=\"-7.0294254e-006\"\n     id=\"rect3018\"\n     style=\"fill:#000000;fill-opacity:1;stroke:none;display:inline\" />\n  <rect\n     width=\"14.000086\"\n     height=\"31\"\n     x=\"23.000025\"\n     y=\"18.999968\"\n     id=\"rect3026\"\n     style=\"fill:#000000;fill-opacity:1;stroke:none;display:inline\" />\n  <rect\n     width=\"14.000086\"\n     height=\"12\"\n     x=\"23.000025\"\n     y=\"-7.0294254e-006\"\n     id=\"rect3028\"\n     style=\"fill:#000000;fill-opacity:1;stroke:none;display:inline\" />\n  <path\n     d=\"m 46.000009,1.064e-5 0,18.99998936 0,11 0,7.9687 0,12.0313 14.02306,0 9.92257,0 c 7.7535,0 14.054374,-6.9404 14.054374,-15.5 0,-8.5597 -6.300874,-15.5 -14.054374,-15.5 l -9.92257,0 0,-18.99998936 -14.02306,0 z M 60.023069,30 l 5.94729,0 c 2.20031,0 3.97528,1.8012 3.97528,4 0,2.1988 -1.77497,3.9687 -3.97528,3.9687 l -5.94729,0 0,-7.9687 z\"\n     id=\"rect3030\"\n     style=\"fill:#000000;fill-opacity:1;stroke:none;display:inline\" />\n  <path\n     d=\"M 104.02523,1.064e-5 C 96.288603,1.064e-5 90.001343,6.9403116 90.001343,15.5 c 0,0.1068 -0.001,0.2081 0,0.3125 2.1e-4,0.021 -5e-4,0.041 0,0.062 l 0,18.25 c -0.003,0.1274 0,0.2468 0,0.375 0,8.5596 6.28726,15.5 14.023887,15.5 l 9.90113,0 1.15565,0 12.83711,0 1.15565,0 9.90113,0 c 7.73674,0 14.024,-6.9404 14.024,-15.5 0,-8.5597 -6.28726,-15.5 -14.024,-15.5 l -5.62209,0 -2.24884,0 -11.11925,0 0,11 11.11925,0 2.24884,0 1.65539,0 c 2.19557,0 3.9667,1.8012 3.9667,4 0,2.1988 -1.77113,3.9687 -3.9667,3.9687 l -3.90423,0 -2.0302,0 -1.15565,0 -12.83711,0 -1.15565,0 -2.0302,0 -3.90424,0 c -2.15389,0 -3.90122,-1.7031 -3.96669,-3.8437 l 0,-18.25 0,-0.062 c 0.0976,-2.1109 1.83403,-3.7813 3.96669,-3.7813 l 3.90424,0 2.0302,0 6.05936,0 0,0.031 30.98398,0 0,-12.06248936 -23.05058,0 -7.9334,0 -6.05936,0 -9.90113,0 z\"\n     id=\"rect3030-3\"\n     style=\"fill:#E74A45;fill-opacity:1;stroke:none;display:inline\" />\n  <path\n     d=\"m 159.9999,-8.936e-5 0,12.05498936 25.34216,0 8.71621,0 5.1801,0 2.0162,0 3.87732,0 c 2.11797,0 3.84248,1.6693 3.93936,3.7789 l 0,0.062 0,18.2386 c -0.065,2.1393 -1.80031,3.8413 -3.93936,3.8413 l -3.87732,0 -2.0162,0 -8.90233,0 -4.99398,0 -11.44585,0 0,-18.9569 -13.89631,0 0,18.9569 0,8.2137 0,3.8101 25.34216,0 4.99398,0 8.90233,0 9.83288,0 c 7.68341,0 13.92733,-6.936 13.92733,-15.4903 0,-0.1281 0.003,-0.2474 0,-0.3748 l 0,-18.2386 c 4.9e-4,-0.021 -2.1e-4,-0.042 0,-0.062 9.9e-4,-0.1043 0,-0.2055 0,-0.3123 0,-8.5542884 -6.24392,-15.49028939 -13.92733,-15.49028939 l -9.83288,0 -5.1801,0 0,-0.031 -34.05837,0 z\"\n     id=\"rect3030-3-4-2\"\n     style=\"fill:#E74A45;fill-opacity:1;stroke:none;display:inline\" />\n  <path\n     d=\"m 222.99599,1.064e-5 19.44141,0 L 261.4999,19.0625 280.5624,1.064e-5 l 19.4375,0 -25,24.99998936 25,25 -19.4375,0 L 261.4999,30.9375 242.4374,50 222.9999,50 247.99599,25 z\"\n     id=\"path4169\"\n     style=\"fill:#E74A45;stroke:none;display:inline\" />\n</svg>\n"
        },
        {
          "name": "publish.gradle",
          "type": "blob",
          "size": 3.662109375,
          "content": "configure([\n\tproject(\":gdx\"),\n\tproject(\":backends:gdx-backend-android\"),\n\tproject(\":backends:gdx-backend-headless\"),\n\tproject(\":backends:gdx-backend-lwjgl\"),\n\tproject(\":backends:gdx-backend-lwjgl3\"),\n\tproject(\":backends:gdx-backend-robovm\"),\n\tproject(\":backends:gdx-backend-robovm-metalangle\"),\n\tproject(\":backends:gdx-backend-gwt\"),\n\tproject(\":extensions:gdx-box2d-parent\"),\n\tproject(\":extensions:gdx-box2d-parent:gdx-box2d\"),\n\tproject(\":extensions:gdx-box2d-parent:gdx-box2d-gwt\"),\n\tproject(\":extensions:gdx-bullet\"),\n\tproject(\":extensions:gdx-freetype\"),\n\tproject(\":extensions:gdx-lwjgl3-angle\"),\n\tproject(\":extensions:gdx-tools\")\n]) {\n\tapply plugin: 'maven-publish'\n\tapply plugin: 'signing'\n\n\tafterEvaluate { project ->\n\t\t//Workaround android not having components populated yet.\n\t\tafterEvaluate {\n\t\t\tpublishing {\n\t\t\t\tpublications {\n\t\t\t\t\tmavenJava(MavenPublication) {\n\t\t\t\t\t\t//Most normal java projects\n\t\t\t\t\t\tif(components.findByName(\"java\") != null)\n\t\t\t\t\t\t\tfrom components.java\n\n\t\t\t\t\t\t//Android\n\t\t\t\t\t\tif(components.findByName(\"release\") != null) {\n\t\t\t\t\t\t\tfrom components.release\n\t\t\t\t\t\t}\n\n\n\t\t\t\t\t\tpom {\n\t\t\t\t\t\t\tname = POM_NAME\n\t\t\t\t\t\t\tif(!POM_DESCRIPTION.isEmpty())\n\t\t\t\t\t\t\t\tdescription = POM_DESCRIPTION\n\t\t\t\t\t\t\turl = POM_URL\n\t\t\t\t\t\t\tlicenses {\n\t\t\t\t\t\t\t\tlicense {\n\t\t\t\t\t\t\t\t\tname = POM_LICENCE_NAME\n\t\t\t\t\t\t\t\t\turl = POM_LICENCE_URL\n\t\t\t\t\t\t\t\t\tdistribution = POM_LICENCE_DIST\n\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\tdevelopers {\n\t\t\t\t\t\t\t\tdeveloper {\n\t\t\t\t\t\t\t\t\tid = \"libGDX Developers\"\n\t\t\t\t\t\t\t\t\turl = \"https://github.com/libgdx/libgdx/graphs/contributors\"\n\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\tscm {\n\t\t\t\t\t\t\t\tconnection = POM_SCM_CONNECTION\n\t\t\t\t\t\t\t\tdeveloperConnection = POM_SCM_DEV_CONNECTION\n\t\t\t\t\t\t\t\turl = POM_SCM_URL\n\t\t\t\t\t\t\t}\n\t\t\t\t\t\t}\n\t\t\t\t\t}\n\t\t\t\t\t//Libgdx natives all follow the \"$name-platform\" artifact structure.\n\t\t\t\t\tif(project.tasks.findByName('jnigen')) {\n\t\t\t\t\t\tmavenPlatform(MavenPublication) {\n\t\t\t\t\t\t\tartifactId = artifactId + \"-platform\"\n\t\t\t\t\t\t\tif(project.tasks.findByName('jnigenJarNativesDesktop'))\n\t\t\t\t\t\t\t\tartifact jnigenJarNativesDesktop { }\n\n\t\t\t\t\t\t\t[\n\t\t\t\t\t\t\t\t'arm64-v8a',\n\t\t\t\t\t\t\t\t'armeabi-v7a',\n\t\t\t\t\t\t\t\t'x86_64',\n\t\t\t\t\t\t\t\t'x86'\n\t\t\t\t\t\t\t].each { id ->\n\t\t\t\t\t\t\t\tif(project.tasks.findByName(\"jnigenJarNativesAndroid${id}\"))\n\t\t\t\t\t\t\t\t\tartifact \"jnigenJarNativesAndroid${id}\" { }\n\t\t\t\t\t\t\t}\n\n\t\t\t\t\t\t\tif(project.tasks.findByName('jnigenJarNativesIOS'))\n\t\t\t\t\t\t\t\tartifact jnigenJarNativesIOS { }\n\n\t\t\t\t\t\t\tpom {\n\t\t\t\t\t\t\t\tname = POM_NAME + \" Native Libraries\"\n\t\t\t\t\t\t\t\tif(!POM_DESCRIPTION.isEmpty())\n\t\t\t\t\t\t\t\t\tdescription = POM_DESCRIPTION\n\t\t\t\t\t\t\t\turl = POM_URL\n\t\t\t\t\t\t\t\tlicenses {\n\t\t\t\t\t\t\t\t\tlicense {\n\t\t\t\t\t\t\t\t\t\tname = POM_LICENCE_NAME\n\t\t\t\t\t\t\t\t\t\turl = POM_LICENCE_URL\n\t\t\t\t\t\t\t\t\t\tdistribution = POM_LICENCE_DIST\n\t\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t\tdevelopers {\n\t\t\t\t\t\t\t\t\tdeveloper {\n\t\t\t\t\t\t\t\t\t\tid = \"libGDX Developers\"\n\t\t\t\t\t\t\t\t\t\turl = \"https://github.com/libgdx/libgdx/graphs/contributors\"\n\t\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t\tscm {\n\t\t\t\t\t\t\t\t\tconnection = POM_SCM_CONNECTION\n\t\t\t\t\t\t\t\t\tdeveloperConnection = POM_SCM_DEV_CONNECTION\n\t\t\t\t\t\t\t\t\turl = POM_SCM_URL\n\t\t\t\t\t\t\t\t}\n\t\t\t\t\t\t\t}\n\t\t\t\t\t\t}\n\t\t\t\t\t}\n\t\t\t\t}\n\n\t\t\t\trepositories {\n\t\t\t\t\tmaven {\n\t\t\t\t\t\turl = version.endsWith('SNAPSHOT') ? getSnapshotRepositoryUrl() : getReleaseRepositoryUrl()\n\n\t\t\t\t\t\tif (getRepositoryUsername() || getRepositoryPassword())\n\t\t\t\t\t\t{\n\t\t\t\t\t\t\tcredentials {\n\t\t\t\t\t\t\t\tusername = getRepositoryUsername()\n\t\t\t\t\t\t\t\tpassword = getRepositoryPassword()\n\t\t\t\t\t\t\t}\n\t\t\t\t\t\t}\n\t\t\t\t\t}\n\t\t\t\t}\n\t\t\t}\n\n\t\t\tsigning {\n\t\t\t\tuseGpgCmd()\n\t\t\t\tsign publishing.publications.mavenJava\n\n\t\t\t\tif(project.tasks.findByName('jnigen'))\n\t\t\t\t\tsign publishing.publications.mavenPlatform\n\t\t\t}\n\n\t\t\t//Simply using \"required\" in signing block doesn't work because taskGraph isn't ready yet.\n\t\t\tgradle.taskGraph.whenReady {\n\t\t\t\ttasks.withType(Sign) {\n\t\t\t\t\tonlyIf { isReleaseBuild() }\n\t\t\t\t}\n\t\t\t}\n\t\t}\n\t}\n}\n"
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 1.7060546875,
          "content": "/*******************************************************************************\n * Copyright 2011 See AUTHORS file.\n *\n * Licensed under the Apache License, Version 2.0 (the \"License\");\n * you may not use this file except in compliance with the License.\n * You may obtain a copy of the License at\n *\n *   http://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.\n ******************************************************************************/\ninclude \":gdx\"\n\ninclude \":backends\"\ninclude \":backends:gdx-backend-android\"\ninclude \":backends:gdx-backend-headless\"\ninclude \":backends:gdx-backend-lwjgl\"\ninclude \":backends:gdx-backend-lwjgl3\"\ninclude \":backends:gdx-backend-robovm\"\ninclude \":backends:gdx-backend-robovm-metalangle\"\ninclude \":backends:gdx-backends-gwt\"\nproject(\":backends:gdx-backends-gwt\").name = \"gdx-backend-gwt\"\n\ninclude(\":extensions:gdx-box2d\")\nproject(\":extensions:gdx-box2d\").name = \"gdx-box2d-parent\"\ninclude \":extensions:gdx-box2d-parent:gdx-box2d\"\ninclude \":extensions:gdx-box2d-parent:gdx-box2d-gwt\"\ninclude \":extensions:gdx-bullet\"\ninclude \":extensions:gdx-freetype\"\ninclude \":extensions:gdx-setup\"\ninclude \":extensions:gdx-tools\"\ninclude \":extensions:gdx-lwjgl3-angle\"\n\ninclude \":tests\"\ninclude \":tests:gdx-tests\"\ninclude \":tests:gdx-tests-android\"\ninclude \":tests:gdx-tests-gwt\"\ninclude \":tests:gdx-tests-iosrobovm\"\ninclude \":tests:gdx-tests-lwjgl\"\ninclude \":tests:gdx-tests-lwjgl3\"\n\nrootProject.name = \"libgdx\"\n"
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}