{
  "metadata": {
    "timestamp": 1736708900635,
    "page": 135,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "code4craft/webmagic",
      "stars": 11471,
      "defaultBranch": "develop",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.2978515625,
          "content": "target/\npom.xml.tag\npom.xml.releaseBackup\npom.xml.versionsBackup\npom.xml.next\nrelease.properties\ndependency-reduced-pom.xml\nbuildNumber.properties\n.mvn/timing.properties\n# https://github.com/takari/maven-wrapper#usage-without-binary-jar\n.mvn/wrapper/maven-wrapper.jar\n\n# Eclipse m2e generated files\n# Eclipse Core\n.project\n# JDT-specific (Eclipse Java Development Tools)\n.classpath\n.metadata\nbin/\ntmp/\n*.tmp\n*.bak\n*.swp\n*~.nib\nlocal.properties\n.settings/\n.loadpath\n.recommenders\n\n# External tool builders\n.externalToolBuilders/\n\n# Locally stored \"Eclipse launch configurations\"\n*.launch\n\n# PyDev specific (Python IDE for Eclipse)\n*.pydevproject\n\n# CDT-specific (C/C++ Development Tooling)\n.cproject\n\n# CDT- autotools\n.autotools\n\n# Java annotation processor (APT)\n.factorypath\n\n# PDT-specific (PHP Development Tools)\n.buildpath\n\n# sbteclipse plugin\n.target\n\n# Tern plugin\n.tern-project\n\n# TeXlipse plugin\n.texlipse\n\n# STS (Spring Tool Suite)\n.springBeans\n\n# Code Recommenders\n.recommenders/\n\n# Annotation Processing\n.apt_generated/\n.apt_generated_test/\n\n# Scala IDE specific (Scala & Java development for Eclipse)\n.cache-main\n.scala_dependencies\n.worksheet\n\n# Uncomment this line if you wish to ignore the project description file.\n# Typically, this file would be tracked if it contains build/dependency configurations:\n#.project\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.033203125,
          "content": "language: java \njdk:\n  - openjdk9\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 10.0146484375,
          "content": "Apache License\nVersion 2.0, January 2004\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n\"License\" shall mean the terms and conditions for use, reproduction, and\ndistribution as defined by Sections 1 through 9 of this document.\n\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright\nowner that is granting the License.\n\n\"Legal Entity\" shall mean the union of the acting entity and all other entities\nthat control, are controlled by, or are under common control with that entity.\nFor the purposes of this definition, \"control\" means (i) the power, direct or\nindirect, to cause the direction or management of such entity, whether by\ncontract or otherwise, or (ii) ownership of fifty percent (50%) or more of the\noutstanding shares, or (iii) beneficial ownership of such entity.\n\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising\npermissions granted by this License.\n\n\"Source\" form shall mean the preferred form for making modifications, including\nbut not limited to software source code, documentation source, and configuration\nfiles.\n\n\"Object\" form shall mean any form resulting from mechanical transformation or\ntranslation of a Source form, including but not limited to compiled object code,\ngenerated documentation, and conversions to other media types.\n\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made\navailable under the License, as indicated by a copyright notice that is included\nin or attached to the work (an example is provided in the Appendix below).\n\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that\nis based on (or derived from) the Work and for which the editorial revisions,\nannotations, elaborations, or other modifications represent, as a whole, an\noriginal work of authorship. For the purposes of this License, Derivative Works\nshall not include works that remain separable from, or merely link (or bind by\nname) to the interfaces of, the Work and Derivative Works thereof.\n\n\"Contribution\" shall mean any work of authorship, including the original version\nof the Work and any modifications or additions to that Work or Derivative Works\nthereof, that is intentionally submitted to Licensor for inclusion in the Work\nby the copyright owner or by an individual or Legal Entity authorized to submit\non behalf of the copyright owner. For the purposes of this definition,\n\"submitted\" means any form of electronic, verbal, or written communication sent\nto the Licensor or its representatives, including but not limited to\ncommunication on electronic mailing lists, source code control systems, and\nissue tracking systems that are managed by, or on behalf of, the Licensor for\nthe purpose of discussing and improving the Work, but excluding communication\nthat is conspicuously marked or otherwise designated in writing by the copyright\nowner as \"Not a Contribution.\"\n\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf\nof whom a Contribution has been received by Licensor and subsequently\nincorporated within the Work.\n\n2. Grant of Copyright License.\n\nSubject to the terms and conditions of this License, each Contributor hereby\ngrants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable copyright license to reproduce, prepare Derivative Works of,\npublicly display, publicly perform, sublicense, and distribute the Work and such\nDerivative Works in Source or Object form.\n\n3. Grant of Patent License.\n\nSubject to the terms and conditions of this License, each Contributor hereby\ngrants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable (except as stated in this section) patent license to make, have\nmade, use, offer to sell, sell, import, and otherwise transfer the Work, where\nsuch license applies only to those patent claims licensable by such Contributor\nthat are necessarily infringed by their Contribution(s) alone or by combination\nof their Contribution(s) with the Work to which such Contribution(s) was\nsubmitted. If You institute patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Work or a\nContribution incorporated within the Work constitutes direct or contributory\npatent infringement, then any patent licenses granted to You under this License\nfor that Work shall terminate as of the date such litigation is filed.\n\n4. Redistribution.\n\nYou may reproduce and distribute copies of the Work or Derivative Works thereof\nin any medium, with or without modifications, and in Source or Object form,\nprovided that You meet the following conditions:\n\nYou must give any other recipients of the Work or Derivative Works a copy of\nthis License; and\nYou must cause any modified files to carry prominent notices stating that You\nchanged the files; and\nYou must retain, in the Source form of any Derivative Works that You distribute,\nall copyright, patent, trademark, and attribution notices from the Source form\nof the Work, excluding those notices that do not pertain to any part of the\nDerivative Works; and\nIf the Work includes a \"NOTICE\" text file as part of its distribution, then any\nDerivative Works that You distribute must include a readable copy of the\nattribution notices contained within such NOTICE file, excluding those notices\nthat do not pertain to any part of the Derivative Works, in at least one of the\nfollowing places: within a NOTICE text file distributed as part of the\nDerivative Works; within the Source form or documentation, if provided along\nwith the Derivative Works; or, within a display generated by the Derivative\nWorks, if and wherever such third-party notices normally appear. The contents of\nthe NOTICE file are for informational purposes only and do not modify the\nLicense. You may add Your own attribution notices within Derivative Works that\nYou distribute, alongside or as an addendum to the NOTICE text from the Work,\nprovided that such additional attribution notices cannot be construed as\nmodifying the License.\nYou may add Your own copyright statement to Your modifications and may provide\nadditional or different license terms and conditions for use, reproduction, or\ndistribution of Your modifications, or for any such Derivative Works as a whole,\nprovided Your use, reproduction, and distribution of the Work otherwise complies\nwith the conditions stated in this License.\n\n5. Submission of Contributions.\n\nUnless You explicitly state otherwise, any Contribution intentionally submitted\nfor inclusion in the Work by You to the Licensor shall be under the terms and\nconditions of this License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify the terms of\nany separate license agreement you may have executed with Licensor regarding\nsuch Contributions.\n\n6. Trademarks.\n\nThis License does not grant permission to use the trade names, trademarks,\nservice marks, or product names of the Licensor, except as required for\nreasonable and customary use in describing the origin of the Work and\nreproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty.\n\nUnless required by applicable law or agreed to in writing, Licensor provides the\nWork (and each Contributor provides its Contributions) on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied,\nincluding, without limitation, any warranties or conditions of TITLE,\nNON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are\nsolely responsible for determining the appropriateness of using or\nredistributing the Work and assume any risks associated with Your exercise of\npermissions under this License.\n\n8. Limitation of Liability.\n\nIn no event and under no legal theory, whether in tort (including negligence),\ncontract, or otherwise, unless required by applicable law (such as deliberate\nand grossly negligent acts) or agreed to in writing, shall any Contributor be\nliable to You for damages, including any direct, indirect, special, incidental,\nor consequential damages of any character arising as a result of this License or\nout of the use or inability to use the Work (including but not limited to\ndamages for loss of goodwill, work stoppage, computer failure or malfunction, or\nany and all other commercial damages or losses), even if such Contributor has\nbeen advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability.\n\nWhile redistributing the Work or Derivative Works thereof, You may choose to\noffer, and charge a fee for, acceptance of support, warranty, indemnity, or\nother liability obligations and/or rights consistent with this License. However,\nin accepting such obligations, You may act only on Your own behalf and on Your\nsole responsibility, not on behalf of any other Contributor, and only if You\nagree to indemnify, defend, and hold each Contributor harmless for any liability\nincurred by, or claims asserted against, such Contributor by reason of your\naccepting any such warranty or additional liability.\n\nEND OF TERMS AND CONDITIONS\n\nAPPENDIX: How to apply the Apache License to your work\n\nTo apply the Apache License to your work, attach the following boilerplate\nnotice, with the fields enclosed by brackets \"{}\" replaced with your own\nidentifying information. (Don't include the brackets!) The text should be\nenclosed in the appropriate comment syntax for the file format. We also\nrecommend that a file or class name and description of purpose be included on\nthe same \"printed page\" as the copyright notice for easier identification within\nthird-party archives.\n\n   Copyright 2025 code4craft\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n     http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "README-zh.md",
          "type": "blob",
          "size": 6.955078125,
          "content": "![logo](http://webmagic.io/images/logo.jpeg)\n\n\n[![Maven Central](https://maven-badges.herokuapp.com/maven-central/us.codecraft/webmagic-parent/badge.svg?subject=Maven%20Central)](https://maven-badges.herokuapp.com/maven-central/us.codecraft/webmagic-parent/)\n[![License](https://img.shields.io/badge/License-Apache%20License%202.0-blue.svg)](https://www.apache.org/licenses/LICENSE-2.0.html)\n[![Build Status](https://travis-ci.org/code4craft/webmagic.png?branch=master)](https://travis-ci.org/code4craft/webmagic)\n\n官方网站[http://webmagic.io/](http://webmagic.io/)\n\n>webmagic是一个开源的Java垂直爬虫框架，目标是简化爬虫的开发流程，让开发者专注于逻辑功能的开发。webmagic的核心非常简单，但是覆盖爬虫的整个流程，也是很好的学习爬虫开发的材料。\n\n\nwebmagic的主要特色：\n\n* 完全模块化的设计，强大的可扩展性。\n* 核心简单但是涵盖爬虫的全部流程，灵活而强大，也是学习爬虫入门的好材料。\n* 提供丰富的抽取页面API。\n* 无配置，但是可通过POJO+注解形式实现一个爬虫。\n* 支持多线程。\n* 支持分布式。\n* 支持爬取js动态渲染的页面。\n* 无框架依赖，可以灵活的嵌入到项目中去。\n\nwebmagic的架构和设计参考了以下两个项目，感谢以下两个项目的作者：\n\npython爬虫 **scrapy** [https://github.com/scrapy/scrapy](https://github.com/scrapy/scrapy)\n\nJava爬虫 **Spiderman** [http://git.oschina.net/l-weiwei/spiderman](http://git.oschina.net/l-weiwei/spiderman)\n\nwebmagic的github地址：[https://github.com/code4craft/webmagic](https://github.com/code4craft/webmagic)。\n\n## 快速开始\n\n### 使用maven\n\nwebmagic使用maven管理依赖，在项目中添加对应的依赖即可使用webmagic：\n\n```xml\n<dependency>\n    <groupId>us.codecraft</groupId>\n    <artifactId>webmagic-core</artifactId>\n    <version>${webmagic.version}</version>\n</dependency>\n<dependency>\n    <groupId>us.codecraft</groupId>\n    <artifactId>webmagic-extension</artifactId>\n    <version>${webmagic.version}</version>\n</dependency>\n```\n        \nWebMagic 使用slf4j-log4j12作为slf4j的实现.如果你自己定制了slf4j的实现，请在项目中去掉此依赖。\n\n```xml\n<exclusions>\n    <exclusion>\n        <groupId>org.slf4j</groupId>\n        <artifactId>slf4j-log4j12</artifactId>\n    </exclusion>\n</exclusions>\n```\n\n#### 项目结构\n\t\nwebmagic主要包括两个包：\n\n* **webmagic-core**\n\t\n\twebmagic核心部分，只包含爬虫基本模块和基本抽取器。webmagic-core的目标是成为网页爬虫的一个教科书般的实现。\n\t\n* **webmagic-extension**\n\t\n\twebmagic的扩展模块，提供一些更方便的编写爬虫的工具。包括注解格式定义爬虫、JSON、分布式等支持。\n\t\nwebmagic还包含两个可用的扩展包，因为这两个包都依赖了比较重量级的工具，所以从主要包中抽离出来，这些包需要下载源码后自己编译：：\n\n* **webmagic-saxon**\n\n\twebmagic与Saxon结合的模块。Saxon是一个XPath、XSLT的解析工具，webmagic依赖Saxon来进行XPath2.0语法解析支持。\n\n* **webmagic-selenium**\n\n\twebmagic与Selenium结合的模块。Selenium是一个模拟浏览器进行页面渲染的工具，webmagic依赖Selenium进行动态页面的抓取。\n\t\n在项目中，你可以根据需要依赖不同的包。\n\n### 不使用maven\n\n在项目的**lib**目录下，有依赖的所有jar包，直接在IDE里import即可。\n\n### 第一个爬虫\n\n#### 定制PageProcessor\n\nPageProcessor是webmagic-core的一部分，定制一个PageProcessor即可实现自己的爬虫逻辑。以下是抓取osc博客的一段代码：\n\n```java\npublic class OschinaBlogPageProcessor implements PageProcessor {\n\n    private Site site = Site.me().setDomain(\"my.oschina.net\");\n\n    @Override\n    public void process(Page page) {\n        List<String> links = page.getHtml().links().regex(\"http://my\\\\.oschina\\\\.net/flashsword/blog/\\\\d+\").all();\n        page.addTargetRequests(links);\n        page.putField(\"title\", page.getHtml().xpath(\"//div[@class='BlogEntity']/div[@class='BlogTitle']/h1\").toString());\n        page.putField(\"content\", page.getHtml().$(\"div.content\").toString());\n        page.putField(\"tags\",page.getHtml().xpath(\"//div[@class='BlogTags']/a/text()\").all());\n    }\n\n    @Override\n    public Site getSite() {\n        return site;\n\n    }\n\n    public static void main(String[] args) {\n        Spider.create(new OschinaBlogPageProcessor()).addUrl(\"http://my.oschina.net/flashsword/blog\")\n             .addPipeline(new ConsolePipeline()).run();\n    }\n}\n```\n\n\n这里通过page.addTargetRequests()方法来增加要抓取的URL，并通过page.putField()来保存抽取结果。page.getHtml().xpath()则是按照某个规则对结果进行抽取，这里抽取支持链式调用。调用结束后，toString()表示转化为单个String，all()则转化为一个String列表。\n\nSpider是爬虫的入口类。Pipeline是结果输出和持久化的接口，这里ConsolePipeline表示结果输出到控制台。\n\n执行这个main方法，即可在控制台看到抓取结果。webmagic默认有3秒抓取间隔，请耐心等待。\n\n#### 使用注解\n\nwebmagic-extension包括了注解方式编写爬虫的方法，只需基于一个POJO增加注解即可完成一个爬虫。以下仍然是抓取oschina博客的一段代码，功能与OschinaBlogPageProcesser完全相同：\n\n```java\n@TargetUrl(\"http://my.oschina.net/flashsword/blog/\\\\d+\")\npublic class OschinaBlog {\n\n    @ExtractBy(\"//title\")\n    private String title;\n\n    @ExtractBy(value = \"div.BlogContent\",type = ExtractBy.Type.Css)\n    private String content;\n\n    @ExtractBy(value = \"//div[@class='BlogTags']/a/text()\", multi = true)\n    private List<String> tags;\n\n    public static void main(String[] args) {\n        OOSpider.create(\n        \tSite.me(),\n\t\t\tnew ConsolePageModelPipeline(), OschinaBlog.class).addUrl(\"http://my.oschina.net/flashsword/blog\").run();\n    }\n}\n```\n\n这个例子定义了一个Model类，Model类的字段'title'、'content'、'tags'均为要抽取的属性。这个类在Pipeline里是可以复用的。\n\n### 详细文档\n\n见[http://webmagic.io/docs/](http://webmagic.io/docs/)。\n\n### 示例\n\nwebmagic-samples目录里有一些定制PageProcessor以抽取不同站点的例子。\n\nwebmagic的使用可以参考：[oschina openapi 应用：博客搬家](https://git.oschina.net/yashin/MoveBlog)\n\n\n### 协议\n\nwebmagic遵循[Apache 2.0协议](http://opensource.org/licenses/Apache-2.0)\n\n### 邮件组:\n\nGmail：\n[https://groups.google.com/forum/#!forum/webmagic-java](https://groups.google.com/forum/#!forum/webmagic-java)\n\nQQ:\n[http://list.qq.com/cgi-bin/qf_invite?id=023a01f505246785f77c5a5a9aff4e57ab20fcdde871e988](http://list.qq.com/cgi-bin/qf_invite?id=023a01f505246785f77c5a5a9aff4e57ab20fcdde871e988)\n\n### QQ群：\n\n373225642(已满) 542327088\n\n### 相关项目：\n\n[Gather Platform](https://github.com/gsh199449/spider)\n\nGather Platform 数据抓取平台是一套基于Webmagic内核的,具有Web任务配置和任务管理界面的数据采集与搜索平台。\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.599609375,
          "content": "![logo](http://webmagic.io/images/logo.jpeg)\n\n[Readme in Chinese](https://github.com/code4craft/webmagic/tree/master/README-zh.md)\n\n\n[![Maven Central](https://maven-badges.herokuapp.com/maven-central/us.codecraft/webmagic-parent/badge.svg?subject=Maven%20Central)](https://maven-badges.herokuapp.com/maven-central/us.codecraft/webmagic-parent/)\n[![License](https://img.shields.io/badge/License-Apache%20License%202.0-blue.svg)](https://www.apache.org/licenses/LICENSE-2.0.html)\n[![Build Status](https://travis-ci.org/code4craft/webmagic.png?branch=master)](https://travis-ci.org/code4craft/webmagic)\n\n>A scalable crawler framework. It covers the whole lifecycle of crawler: downloading, url management, content extraction and persistent. It can simplify the development of a  specific crawler.\n\n## Features:\n\n* Simple core with high flexibility.\n* Simple API for html extracting.\n* Annotation with POJO to customize a crawler, no configuration.\n* Multi-thread and Distribution support.\n* Easy to be integrated.\n\n## Install:\n  \nAdd dependencies to your pom.xml:\n\n```xml\n<dependency>\n    <groupId>us.codecraft</groupId>\n    <artifactId>webmagic-core</artifactId>\n    <version>${webmagic.version}</version>\n</dependency>\n<dependency>\n    <groupId>us.codecraft</groupId>\n    <artifactId>webmagic-extension</artifactId>\n    <version>${webmagic.version}</version>\n</dependency>\n```\n        \nWebMagic use slf4j with slf4j-log4j12 implementation. If you customized your slf4j implementation, please exclude slf4j-log4j12.\n\n```xml\n<exclusions>\n    <exclusion>\n        <groupId>org.slf4j</groupId>\n        <artifactId>slf4j-log4j12</artifactId>\n    </exclusion>\n</exclusions>\n```\n\n\n## Get Started:\n\n### First crawler:\n\nWrite a class implements PageProcessor. For example, I wrote a crawler of github repository information.\n\n```java\npublic class GithubRepoPageProcessor implements PageProcessor {\n\n    private Site site = Site.me().setRetryTimes(3).setSleepTime(1000);\n\n    @Override\n    public void process(Page page) {\n        page.addTargetRequests(page.getHtml().links().regex(\"(https://github\\\\.com/\\\\w+/\\\\w+)\").all());\n        page.putField(\"author\", page.getUrl().regex(\"https://github\\\\.com/(\\\\w+)/.*\").toString());\n        page.putField(\"name\", page.getHtml().xpath(\"//h1[@class='public']/strong/a/text()\").toString());\n        if (page.getResultItems().get(\"name\")==null){\n            //skip this page\n            page.setSkip(true);\n        }\n        page.putField(\"readme\", page.getHtml().xpath(\"//div[@id='readme']/tidyText()\"));\n    }\n\n    @Override\n    public Site getSite() {\n        return site;\n    }\n\n    public static void main(String[] args) {\n        Spider.create(new GithubRepoPageProcessor()).addUrl(\"https://github.com/code4craft\").thread(5).run();\n    }\n}\n```\n\n* `page.addTargetRequests(links)`\n\t\n\tAdd urls for crawling.\n    \nYou can also use annotation way:\n\n```java\n@TargetUrl(\"https://github.com/\\\\w+/\\\\w+\")\n@HelpUrl(\"https://github.com/\\\\w+\")\npublic class GithubRepo {\n\n    @ExtractBy(value = \"//h1[@class='public']/strong/a/text()\", notNull = true)\n    private String name;\n\n    @ExtractByUrl(\"https://github\\\\.com/(\\\\w+)/.*\")\n    private String author;\n\n    @ExtractBy(\"//div[@id='readme']/tidyText()\")\n    private String readme;\n\n    public static void main(String[] args) {\n        OOSpider.create(Site.me().setSleepTime(1000)\n                , new ConsolePageModelPipeline(), GithubRepo.class)\n                .addUrl(\"https://github.com/code4craft\").thread(5).run();\n    }\n}\n```\n\t\t\n### Docs and samples:\n\nDocuments: [http://webmagic.io/docs/](http://webmagic.io/docs/)\n\nThe architecture of webmagic (referred to [Scrapy](http://scrapy.org/))\n\n![image](http://code4craft.github.io/images/posts/webmagic.png)\n\nThere are more examples in `webmagic-samples` package.\n\n### License:\n\nLicensed under [Apache 2.0 license](http://opensource.org/licenses/Apache-2.0)\n\n### Thanks:\n\nTo write webmagic, I refered to the projects below :\n\n* **Scrapy**\n\n\tA crawler framework in Python.\n \n\t[http://scrapy.org/](http://scrapy.org/)\n\n* **Spiderman**\n\n\tAnother crawler framework in Java.\n\t\n\t[http://git.oschina.net/l-weiwei/spiderman](http://git.oschina.net/l-weiwei/spiderman)\n\n### Mail-list:\n\n[https://groups.google.com/forum/#!forum/webmagic-java](https://groups.google.com/forum/#!forum/webmagic-java)\n\n[http://list.qq.com/cgi-bin/qf_invite?id=023a01f505246785f77c5a5a9aff4e57ab20fcdde871e988](http://list.qq.com/cgi-bin/qf_invite?id=023a01f505246785f77c5a5a9aff4e57ab20fcdde871e988)\n\nQQ Group: 373225642 542327088\n\n### Related Project\n\n* <a href=\"https://github.com/gsh199449/spider\" target=\"_blank\">Gather Platform</a>\n\t\n\tA web console based on WebMagic for Spider configuration and management.\n\n"
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 13.1796875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project\n    xmlns=\"http://maven.apache.org/POM/4.0.0\"\n    xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n    xsi:schemaLocation=\"\n        http://maven.apache.org/POM/4.0.0\n        http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n    <parent>\n        <groupId>org.oxerr</groupId>\n        <artifactId>oxerr-parent</artifactId>\n        <version>2.2.1</version>\n    </parent>\n    <groupId>us.codecraft</groupId>\n    <version>1.0.3-SNAPSHOT</version>\n    <packaging>pom</packaging>\n    <properties>\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <project.reporting.outputEncoding>UTF-8</project.reporting.outputEncoding>\n        <maven.compiler.source>11</maven.compiler.source>\n        <maven.compiler.target>11</maven.compiler.target>\n        <assertj.version>3.23.1</assertj.version>\n        <commons-cli.version>1.5.0</commons-cli.version>\n        <commons-collections4.version>4.4</commons-collections4.version>\n        <commons-io.version>2.14.0</commons-io.version>\n        <commons-lang3.version>3.12.0</commons-lang3.version>\n        <fastjson.version>2.0.19.graal</fastjson.version>\n        <groovy-all.version>3.0.13</groovy-all.version>\n        <guava.version>32.0.0-jre</guava.version>\n        <htmlcleaner.version>2.29</htmlcleaner.version>\n        <httpclient.version>4.5.13</httpclient.version>\n        <httpcore.version>4.4.15</httpcore.version>\n        <jedis.version>3.7.1</jedis.version>\n        <jruby.version>9.3.9.0</jruby.version>\n        <json-path.version>2.9.0</json-path.version>\n        <junit.version>5.10.2</junit.version>\n        <junit.platform.version>1.10.2</junit.platform.version>\n        <jython.version>2.7.3</jython.version>\n        <log4j2.version>2.23.1</log4j2.version>\n        <mockito-all.version>2.0.2-beta</mockito-all.version>\n        <moco.version>1.3.0</moco.version>\n        <phantomjsdriver.version>1.2.0</phantomjsdriver.version>\n        <saxon-he.version>12.4</saxon-he.version>\n        <selenium-java.version>4.14.1</selenium-java.version>\n        <slf4j.version>2.0.4</slf4j.version>\n        <spring-version>4.0.0.RELEASE</spring-version>\n        <xsoup.version>0.3.5</xsoup.version>\n    </properties>\n    <artifactId>webmagic</artifactId>\n    <name>webmagic</name>\n    <description>\n        A crawler framework. It covers the whole lifecycle of crawler: downloading, url management, content\n        extraction and persistent. It can simply the development of a specific crawler.\n    </description>\n    <url>https://github.com/code4craft/webmagic/</url>\n    <developers>\n        <developer>\n            <id>code4craft</id>\n            <name>Yihua huang</name>\n            <email>code4crafer@gmail.com</email>\n        </developer>\n        <developer>\n            <id>yuany</id>\n            <name>Ligang Yao</name>\n            <email>ligang.yao@answers.com</email>\n        </developer>\n    </developers>\n    <scm>\n        <connection>scm:git:git@github.com:code4craft/webmagic.git</connection>\n        <developerConnection>scm:git:git@github.com:code4craft/webmagic.git</developerConnection>\n        <url>git@github.com:code4craft/webmagic.git</url>\n        <tag>WebMagic-${project.version}</tag>\n    </scm>\n    <licenses>\n        <license>\n            <name>Apache License, Version 2.0</name>\n            <url>http://www.apache.org/licenses/LICENSE-2.0</url>\n        </license>\n    </licenses>\n\n    <modules>\n        <module>webmagic-core</module>\n        <module>webmagic-extension/</module>\n        <module>webmagic-scripts/</module>\n        <module>webmagic-selenium</module>\n        <module>webmagic-saxon</module>\n        <module>webmagic-samples</module>\n        <module>webmagic-coverage</module>\n    </modules>\n\n    <dependencies>\n        <dependency>\n            <groupId>org.apache.logging.log4j</groupId>\n            <artifactId>log4j-core</artifactId>\n            <scope>test</scope>\n        </dependency>\n        <dependency>\n            <groupId>org.apache.logging.log4j</groupId>\n            <artifactId>log4j-slf4j2-impl</artifactId>\n            <scope>test</scope>\n        </dependency>\n        <dependency>\n            <groupId>org.junit.jupiter</groupId>\n            <artifactId>junit-jupiter-engine</artifactId>\n            <scope>test</scope>\n        </dependency>\n        <dependency>\n            <groupId>org.junit.vintage</groupId>\n            <artifactId>junit-vintage-engine</artifactId>\n            <scope>test</scope>\n        </dependency>\n        <dependency>\n            <groupId>org.junit.platform</groupId>\n            <artifactId>junit-platform-launcher</artifactId>\n            <scope>test</scope>\n        </dependency>\n        <dependency>\n            <groupId>org.junit.platform</groupId>\n            <artifactId>junit-platform-runner</artifactId>\n            <scope>test</scope>\n        </dependency>\n    </dependencies>\n\n    <dependencyManagement>\n        <dependencies>\n            <dependency>\n                <groupId>org.mockito</groupId>\n                <artifactId>mockito-all</artifactId>\n                <version>${mockito-all.version}</version>\n                <scope>test</scope>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.httpcomponents</groupId>\n                <artifactId>httpclient</artifactId>\n                <version>${httpclient.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.httpcomponents</groupId>\n                <artifactId>httpcore</artifactId>\n                <version>${httpcore.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-core</artifactId>\n                <version>${log4j2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-slf4j2-impl</artifactId>\n                <version>${log4j2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.guava</groupId>\n                <artifactId>guava</artifactId>\n                <version>${guava.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.jayway.jsonpath</groupId>\n                <artifactId>json-path</artifactId>\n                <version>${json-path.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.jupiter</groupId>\n                <artifactId>junit-jupiter-engine</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.vintage</groupId>\n                <artifactId>junit-vintage-engine</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.platform</groupId>\n                <artifactId>junit-platform-launcher</artifactId>\n                <version>${junit.platform.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.platform</groupId>\n                <artifactId>junit-platform-runner</artifactId>\n                <version>${junit.platform.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.slf4j</groupId>\n                <artifactId>slf4j-api</artifactId>\n                <version>${slf4j.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>us.codecraft</groupId>\n                <artifactId>xsoup</artifactId>\n                <version>0.3.7</version>\n            </dependency>\n            <dependency>\n                <groupId>com.alibaba</groupId>\n                <artifactId>fastjson</artifactId>\n                <version>${fastjson.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.github.dreamhead</groupId>\n                <artifactId>moco-core</artifactId>\n                <version>${moco.version}</version>\n                <scope>test</scope>\n                <exclusions>\n                    <exclusion>\n                        <groupId>org.slf4j</groupId>\n                        <artifactId>slf4j-simple</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.assertj</groupId>\n                <artifactId>assertj-core</artifactId>\n                <version>${assertj.version}</version>\n                <scope>test</scope>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-lang3</artifactId>\n                <version>${commons-lang3.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-collections4</artifactId>\n                <version>${commons-collections4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-io</groupId>\n                <artifactId>commons-io</artifactId>\n                <version>${commons-io.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.codehaus.groovy</groupId>\n                <artifactId>groovy-all</artifactId>\n                <version>${groovy-all.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.jruby</groupId>\n                <artifactId>jruby</artifactId>\n                <version>${jruby.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.python</groupId>\n                <artifactId>jython</artifactId>\n                <version>${jython.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.seleniumhq.selenium</groupId>\n                <artifactId>selenium-java</artifactId>\n                <version>${selenium-java.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>net.sf.saxon</groupId>\n                <artifactId>Saxon-HE</artifactId>\n                <version>${saxon-he.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>net.sourceforge.htmlcleaner</groupId>\n                <artifactId>htmlcleaner</artifactId>\n                <version>${htmlcleaner.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.github.detro</groupId>\n                <artifactId>phantomjsdriver</artifactId>\n                <version>${phantomjsdriver.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-cli</groupId>\n                <artifactId>commons-cli</artifactId>\n                <version>${commons-cli.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>redis.clients</groupId>\n                <artifactId>jedis</artifactId>\n                <version>${jedis.version}</version>\n            </dependency>\n        </dependencies>\n    </dependencyManagement>\n\n    <build>\n        <plugins>\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-javadoc-plugin</artifactId>\n                <configuration>\n                    <doctitle>WebMagic ${project.version}</doctitle>\n                    <locale>en_US</locale>\n\n                    <!-- avoid the issue: https://bugs.openjdk.java.net/browse/JDK-8212233 -->\n                    <detectJavaApiLink>false</detectJavaApiLink>\n\n                </configuration>\n                <executions>\n                    <execution>\n                        <id>aggregate</id>\n                        <goals>\n                            <goal>aggregate</goal>\n                        </goals>\n                        <phase>site</phase>\n                    </execution>\n                    <execution>\n                        <id>attach-javadocs</id>\n                        <goals>\n                            <goal>jar</goal>\n                        </goals>\n                    </execution>\n                </executions>\n            </plugin>\n            <plugin>\n                <groupId>org.jacoco</groupId>\n                <artifactId>jacoco-maven-plugin</artifactId>\n                <executions>\n                    <execution>\n                        <goals>\n                            <goal>prepare-agent</goal>\n                        </goals>\n                    </execution>\n                    <execution>\n                        <id>report</id>\n                        <phase>verify</phase>\n                        <goals>\n                            <goal>report</goal>\n                        </goals>\n                    </execution>\n                </executions>\n            </plugin>\n            <plugin>\n                <groupId>com.amashchenko.maven.plugin</groupId>\n                <artifactId>gitflow-maven-plugin</artifactId>\n                <configuration>\n                    <gitFlowConfig>\n                        <versionTagPrefix>WebMagic-</versionTagPrefix>\n                    </gitFlowConfig>\n                </configuration>\n            </plugin>\n        </plugins>\n    </build>\n\n</project>\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-coverage",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-extension",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-samples",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-saxon",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "webmagic-selenium",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}