{
  "metadata": {
    "timestamp": 1736709350842,
    "page": 37,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "FyroxEngine/Fyrox",
      "stars": 7876,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.1064453125,
          "content": "/target\n**/*.rs.bk\n/cloc\n*.lock\n*.log\n/*.png\n/examples/data/lightmaps\n/save.bin\n/examples/data/lightmap_scene.rgs\n/fyrox-core/test.bin\n/fyrox-core/test.txt\n/fyrox-resource/test.txt\n/fyrox-core-derive/test_output\n/fyrox-impl/test_output\nhistory.bin\nsettings.ron\n\n# from https://github.com/github/gitignore/blob/master/Global/VisualStudioCode.gitignore\n.vscode/*\n!.vscode/settings.json\n!.vscode/tasks.json\n!.vscode/launch.json\n!.vscode/extensions.json\n*.code-workspace\n\n# Local History for Visual Studio Code\n.history/\n\n\n# from https://github.com/github/gitignore/blob/master/Global/JetBrains.gitignore:\n# Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider\n# Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839\n\n# User-specific stuff\n.idea/**/workspace.xml\n.idea/**/tasks.xml\n.idea/**/usage.statistics.xml\n.idea/**/dictionaries\n.idea/**/shelf\n\n# AWS User-specific\n.idea/**/aws.xml\n\n# Generated files\n.idea/**/contentModel.xml\n\n# Sensitive or high-churn files\n.idea/**/dataSources/\n.idea/**/dataSources.ids\n.idea/**/dataSources.local.xml\n.idea/**/sqlDataSources.xml\n.idea/**/dynamic.xml\n.idea/**/uiDesigner.xml\n.idea/**/dbnavigator.xml\n\n# Gradle\n.idea/**/gradle.xml\n.idea/**/libraries\n\n# Gradle and Maven with auto-import\n# When using Gradle or Maven with auto-import, you should exclude module files,\n# since they will be recreated, and may cause churn.  Uncomment if using\n# auto-import.\n# .idea/artifacts\n# .idea/compiler.xml\n# .idea/jarRepositories.xml\n# .idea/modules.xml\n# .idea/*.iml\n# .idea/modules\n# *.iml\n# *.ipr\n\n# CMake\ncmake-build-*/\n\n# Mongo Explorer plugin\n.idea/**/mongoSettings.xml\n\n# File-based project format\n*.iws\n\n# IntelliJ\nout/\n\n# mpeltonen/sbt-idea plugin\n.idea_modules/\n\n# JIRA plugin\natlassian-ide-plugin.xml\n\n# Cursive Clojure plugin\n.idea/replstate.xml\n\n# Crashlytics plugin (for Android Studio and IntelliJ)\ncom_crashlytics_export_strings.xml\ncrashlytics.properties\ncrashlytics-build.properties\nfabric.properties\n\n# Editor-based Rest Client\n.idea/httpRequests\n\n# Android studio 3.1+ serialized cache file\n.idea/caches/build_file_checksums.ser\n"
        },
        {
          "name": ".idea",
          "type": "tree",
          "content": null
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "ARCHITECTURE.md",
          "type": "blob",
          "size": 11.2802734375,
          "content": "# Architecture\n\n** WORK IN PROGRESS **\n\nThis document describes high-level architecture and basic concepts of Fyrox. It should help you to understand\nbasics of the engine's architecture and find a right place for your modifications.\n\n## Overview\n\nFyrox is a monolithic game engine with very few replaceable parts. This means that Fyrox itself has relatively\nstrong coupling between modules. However, some of its parts can be used as standalone crates - core, UI and \nsound are independent of the engine. Internal coupling is one-way in most of the places, this means that, for\ninstance, a renderer **is** dependent on a scene, but scene does **not** know anything about the renderer.\nThis fact makes changes in the engine very easy even for beginners.\n\nFyrox consists of the four crates - fyrox-core, fyrox-sound, fyrox-ui, and Fyrox itself. fyrox-core, fyrox-sound and\nfyrox-ui are **standalone** crates and can be used separately, the only place where these three are meet is the\nFyrox. Previously each crate had a separate repository, but then I decided to put everything in single repository\nbecause it was too much of a pain to build any project that uses the engine.\n\nAnother important fact is that Fyrox **does not** use ECS, instead it uses generational arenas (pools in Fyrox's\nterminology) for efficient memory management (fast allocation/deallocation, CPU cache efficiency). This means\nthat you are working with good old structures which are placed in contiguous memory block (pool). Once an\nobject was placed in a pool, you get a handle to the object which can be used to access (borrow) the object\nwhen you need. Such approach allows you to make any relations between the objects - handle is just a pair of \nnumbers, it won't cause issues with borrow checker. For more info check \n[pool.rs](https://github.com/FyroxEngine/Fyrox/blob/master/fyrox-core/src/pool.rs).\n\n### Core\n\nCore contains some of very common algorithms and data structures that are used across other parts of the engine.\nIt contains linear algebra, accelerating structures, color-space functions, etc. In other words it contains \n\"building blocks\" that are very widely used across other parts of the engine. \n\n### Renderer\n\nFyrox uses a combination of deferred + forward renderers. The deferred renderer is used to render opaque objects,\nwhen the forward renderer is used to render transparent objects. The renderer provides lots of very common \ngraphical effects. The renderer is suitable for most of the needs, however it is not flexible enough yet and \nthere is no way of using custom shaders yet.\n\n### User Interface\n\nFyrox uses custom user interface library. It is node-based, has very powerful layout system, uses messages\nto communicate between widgets, supports styling. The library has 30+ widgets (including docking manager,\nwindows, file browsers, etc). Please keep in mind that the library does not render anything, instead it\njust prepares a set of drawing commands which can be used with any kind of renderer - a software (GDI for\ninstance) or a hardware (OpenGL, DirectX, Vulkan, Metal, etc.).\n\n### Sound\n\nFyrox uses software sound engine [fyrox-sound](https://github.com/FyroxEngine/Fyrox/tree/master/fyrox-sound).\nThe sound engine provides support for binaural sound rendering using HRTF, which gives excellent sound \nspatialization. \n\n## Code Map\n\nCode map should help you find a right place for your modifications. This is the most boring part of the \ndocument, here is the table of contents for your comfort:\n\n- [fyrox-core](#fyrox-core)\n    - [math](#mathmodrs)\n- [fyrox-ui](#fyrox-ui)\n    - [widgets](#borderrs)\n- [fyrox-sound](#fyrox-sound)\n    - [buffer](#buffermodrs)\n    - [decoder](#decodermodrs)\n    - [device](#devicemodrs)\n- [Fyrox](#fyrox)\n\n### fyrox-core\n\nAs it was already said up above, fyrox-core is just a set of useful algorithms. If you want to add a thing\nthat will be used in dependent crates then you're in the right place. Here is the very brief description\nof each module.\n\n#### math/mod.rs\n\nThe module contains some intersection check algorithms, vector projection methods (tri-planar mapping for \nexample), generic rectangle struct, and other stuff that cannot be easily classified.\n\n#### math/aabb.rs\n\nThe module contains Axis-Aligned Bounding Box (AABB) structure. It is used as a bounding volume to accelerate\nspatial checks (like ray casting, coarse intersection checks, etc).\n\n#### math/frustum.rs\n\nThe module contains Frustum structure. Its purpose (in the project) is to perform visibility checks - for\nexample camera is using frustum culling to determine which objects must be rendered on screen. \n\n#### math/plane.rs\n\nThe module contains Plane structure that basically represents just plane equation. Planes are used for \nintersection tests.\n\n#### math/ray.rs\n\nThe module contains Ray structure which is used for intersection tests. For example the engine uses rays\nin lightmapper to do ray tracing to calculate shadows.\n\n#### math/triangulator.rs\n\nThe module contains a set of triangulation algorithms for polygon triangulation. There are two algorithms:\nsimple one is for quadrilaterals, and generic one is the ear-clipping algorithm. The stuff from the module is\nused to triangulate polygons in 3d models to make them suitable to render on GPU.\n\n#### color.rs\n\nThe module contains structure and methods to work with colors in HSV and RGB color spaces, and to convert \ncolors HSV <-> RGB.\n\n#### color_gradient.rs\n\nThe module contains simple linear color gradient with multiple points. It is widely used in particle systems\nto change color of particles over time. For example a spark starts from white color and becomes more red over\ntime and finally becomes black.\n\n#### lib.rs\n\nThe module contains BiDirHashMap and very few other algorithms.\n\n#### numeric_range.rs\n\nThe module contains fool-proof numeric range - there is no way to create a range with incorrect bounds - bounds\nwill be determined at the sampling moment.\n\n#### octree.rs\n\nThe module contains Octree acceleration structure which is used to accelerate ray casting, point-probing, \nbox intersection tests and so on.\n\n#### pool.rs\n\nThe module contains the heart of the engine: pool is one of the most commonly used structure in the engine.\nIts purpose is to provide a storage for objects of a type in a contiguous block of memory. Any object\ncan be accessed later by a handle. Handles are some sort of indices, but with additional information that \nis used to check if handle is valid.\n\n#### profiles.rs\n\nThe module contains a simple intrusive profiler. It uses special macro (scope_profile!()) to time a scope.\n\n#### rectpack.rs\n\nThe module contains rectangle packing algorithm (most commonly known as \"bin-packing problem\"). It is used\nto create texture atlases.\n\n#### visitor.rs\n\nThe module contains node-based serializer/deserializer (visitor). Everything in the engine serialized by \nthis serializer. It supports serialization of basic types, many std types (including\nRc/Arc) and user-defined types.\n\n### fyrox-ui\n\nfyrox-ui is a standalone, graphics API-agnostic, node-based, general-purpose user interface library.\n\n#### lib.rs\n\nThe module contains UserInterface structure and Control trait. \n\n#### border.rs\n\nThe module contains Border widget which is basically just a rectangle with variable width of borders, and\nan ability to be a container for child widgets.\n\n#### brush.rs\n\nThe module contains Brush structure which describes a way of drawing graphics primitives. \n\n#### button.rs\n\nThe module contains Button widget and its builder.\n\n#### canvas.rs\n\nThe module contains Canvas widget and its builder. Canvas is a simple container for child widgets,\nit allows setting position of children widgets directly. \n\n#### check_box.rs\n\nThe module contains CheckBox widget and its builder. CheckBox is a three-state (checked, unchecked,\nundefined) switch.\n\n#### color.rs\n\nThe module contains widgets to work with colors and their builders. There are separate widgets to change\nhue, saturation, brightness and compound color selector widget.\n\n#### decorator.rs\n\nThe module contains Decorator widget and its builder. Decorator is a simple container for child widgets,\nit has built-in behaviour for most common actions: it changes appearance when mouse enters or leaves bounds,\nwhen user clicks on it, etc. \n\n#### dock.rs\n\nThe module contains DockingManager and Tile widgets and their builders. Docking manager is able to combine\nmultiple Window widgets in its tiles, each tile can be resized, docked or undocked. This is the must-have\nwidget for any kind of editor.\n\n#### draw.rs\n\nThe module is responsible for \"drawing\". It is in quotes, because it does not actually draw anything, it just \nemits drawing commands in a queue for later interpretation. \n\n#### dropdown_list.rs\n\nThe module contains DropdownList widget and its builder. DropdownList is a small field that shows selected\nitem and a \"popup\" that contains list of items.\n\n#### expander.rs\n\nThe module contains Expander widget and its builder. Expander is a collapsable container for child widgets\nwith a field that describes a content. \n\n#### file_browser.rs\n\nThe module contains a set of widgets that displays file system. FileBrowser widget is a simple file system\ntree, FileSelector is a window with FileBrowser and few buttons. \n\n#### formatted_text.rs\n\nThe module is responsible for text formatting and \"rendering\". The latter is in quotes, because the library \njust uses glyph info from a font to layout each glyph in a line of text with word wrapping and other \nuseful features (like text size calculation, etc).\n\n#### grid.rs\n\nThe module contains Grid widget and its builder. Grid is a powerful layout widget, it allows arranging child\nwidgets in a series of rows and columns.\n\n#### image.rs\n\nThe module contains Image widget and its builder. Image is a simple rectangle with a texture.\n\n#### list_view.rs\n\nThe module contains ListView widget and its builder. ListView is a container for items which arranged \nas a stack. ListView supports item selection.\n\n#### menu.rs\n\nThe module contains menu widgets. Menu here means a classic menu which is a strip with root items and a \nset of child sub-menus.\n\n#### message.rs\n\nThe module contains all supported messages for every widget in the library. \n\n#### messagebox.rs\n\n#### node.rs\n\n#### numeric.rs\n\n#### popup.rs\n\n#### progress_bar.rs\n\n#### scroll_bar.rs\n\n#### scroll_panel.rs\n\n#### scroll_viewer.rs\n\n#### stack_panel.rs\n\n#### tab_control.rs\n\n#### text.rs\n\n#### tree.rs\n\n#### ttf.rs\n\n#### utils.rs\n\n#### vec.rs\n\n#### vector_image.rs\n\n#### widget.rs\n\n#### window.rs\n\n#### wrap_panel.rs\n\n### fyrox-sound\n\nfyrox-sound is a standalone sound engine with multiple renderers and high-quality sound. The sound engine\nprovides support for binaural sound rendering using HRTF, which gives excellent sound spatialization.\n\n#### buffer/mod.rs\n\n#### buffer/generic.rs\n\n#### buffer/streaming.rs\n\n#### decoder/mod.rs\n\n#### decoder/vorbis.rs\n\n#### decoder/wav.rs\n\n#### device/mod.rs\n\n#### device/alsa.rs\n\n#### device/coreaudio.rs\n\n#### device/dsound.rs\n\n#### device/dummy.rs\n\n### Fyrox\n\nThe engine itself. It has: a renderer, resource manager, animations, scenes, and various utilities like \nlightmapper, uv-mapper, navigation mesh, logger, pathfinder.\n\n#### animation/mod.rs\n#### animation/machine/mod.rs\n#### animation/machine/blend_nodes.rs\n#### engine/mod.rs\n#### engine/error.rs\n#### engine/resource_manager.rs\n#### renderer/mod.rs\n#### renderer/framework/mod.rs\n#### renderer/framework/framebuffer.rs\n#### renderer/framework/geometry_buffer.rs"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 94.0556640625,
          "content": "# 0.34.1 Engine + 0.21.1 Editor\n\n- Fixed crash when trying to create parent for root in the editor\n- Dispatch script messages after everything is initialized and updated\n- Prevent selection type name from disappearing in the inspector\n- Fixed potential crash when undoing asset instantiation\n- Fixed rendering issues in 2d projection mode in the editor\n- Update visual transform of a widget when render transform changes\n\n# 0.34 Engine + 0.21.0 Editor\n\n## Added\n\n- Code hot reloading for plugins.\n- Ability to have multiple scripts on one scene node.\n- Static and dynamic batching for meshes.\n- Project exporter for automated deployment.\n- Configurable build profiles for the editor.\n- Ability to have multiple user interface instances.\n- GLTF support (available via `gltf` feature).\n- Keyboard navigation support in the UI.\n- Preview generation for assets in the asset browser.\n- Grid for the scene preview.\n- `fyrox-template` improvements to generate projects, that supports code hot reloading.\n- `AnimationPlayer` + `AnimationBlendingStateMachine` widgets.\n- UI prefabs with ability to instantiate them.\n- `Pool::try_get_component_of_type` + the same for `MultiBorrowContext`.\n- `NodeTrait::on_unlink` method.\n- Implemented `ComponentProvider` trait for `Node`.\n- `MultiBorrowContext::get/get_mut` methods.\n- Ability to remove objects from multiborrow context.\n- `newtype_reflect` delegating macro.\n- `SceneGraph::change_hierarchy_root` method.\n- Ability to change UI scene root.\n- Property inheritance for UI widgets.\n- Ability to instantiate UI prefabs by dropping prefab into world viewer/scene previewer.\n- Ability to open scripts from the editor's inspector.\n- `Control::post_draw` method.\n- Ability to reorder children of a scene node.\n- `SceneGraph::relative_position` + `SceneGraphNode::child_position` methods.\n- Ability to reorder nodes/widgets in the world viewer.\n- Added more icons for widgets.\n- Added support for UI animations in the animation editor.\n- Configurable UI update switches.\n- Ability to edit ui absm nodes in the absm editor.\n- `AbsmEventProvider` widget.\n- Ability to enable msaa when initializing graphics context.\n- Ability to change corner radius in `Border` widget.\n- Ability to draw rectangles with rounded corners in UI drawing context.\n- Added layout rounding for `fyrox-ui` which significantly reduced blurring.\n- Added support for embedded textures in FBX.\n- `Selector` widget.\n- Added project dir and scenes to open as cli args to editor.\n- `utils::make_cross_primitive` helper method.\n- Ability to draw wire circle in the UI drawing context.\n- Ability to draw WireCircle primitives in VectorImage widget.\n- More tests.\n- Vertex buffer API improvements.\n- Rendering statistics window for the editor.\n- Added shape casting in physics.\n- Ability to unassign textures in material editor.\n- Allow to set negative playback speed for animations in animation editor.\n- `Scene::clone_one_to_one` shortcut for easier scene cloning.\n- `fyrox-dylib` crate to be able to link the engine dynamically.\n- Ability to link the engine dynamically to the editor.\n- Added property editor for untyped textures.\n- Added `Plugin::on_loaded` method.\n- `NetListener::local_address` method.\n- `Model::new` method.\n- Ability to disable space optimization of `InheritableVariable` on serialization.\n- Added CI for project template for all supported platforms.\n- Added diagnostics for degenerated triangles when calculating tangents.\n- `Pool::first_ref/first_mut` methods.\n- Added release keystore for android project templates.\n- Collect rendering statistics on per-scene basis.\n- `transmute_slice` helper function.\n- Ability to read GPU texture data.\n- Experimental histogram-based auto-exposure for HDR (disabled by default).\n- Short-path angle interpolation mode for `Curve` - `Curve::angle_at`.\n- Property editor for `RcUiNodeHandle` type.\n- Adaptive scroll bar thumb.\n- Ability to fetch current task pool from resource manager.\n- Async icon generation for assets in the asset browser.\n- Case-insensitive string comparison helper method `fyrox::core::cmp_strings_case_insensitive`.\n- Major performance improvement for searching in the asset browser.\n- Configurable interpolation mode for animations.\n- Ability to close popups using `Esc` key.\n- Added diagnostics for docking manager layout, that warns if a window has empty name.\n- Keyboard navigation for tree widget.\n- Ability to close windows by `Esc` key.\n- Focus opened window automatically.\n- Keyboard navigation for `Menu` widget.\n- Added `ImmutableString` editor.\n- Docs for inspector module.\n- Ability to deactivate menus using `Esc` key.\n- `PopupMessage::RelayedMessage` to re-cast messages from a popup to a widget.\n- `NavigationLayer` widget that handles `Tab`/`Shift+Tab` navigation.\n- Ability to switch check box state using space key.\n- Ability to click button widget using `Space`/`Enter` keys.\n- `accepts_input` for widgets that can be used for keyboard interaction.\n- Added keyboard navigation for input fields in the inspector.\n- Highlight a widget with keyboard focus.\n- `Visitor` docs.\n- Ability to open/close drop down list using arrow keys.\n- Re-cast `Variant` message on enum property editor.\n- Focus popup content (if any) on opening.\n- Keyboard navigation for list view widget.\n- Focus window content (if any) on opening.\n- Optional ability to bring focused item into view in navigation layer.\n- Hotkey to run the game from the editor (default is `F5`).\n- Ability to increase/decrease `NumericUpDown` widget value by arrow keys.\n- Configurable command stack max capacity (prevents the command stack to grow uncontrollably, which could eat a lot of memory if the editor is running for a long time).\n- Auto-select text on focusing `TextBox` widget.\n- Ability to render scene manually.\n- Ability to set precision for `VecEditor` widget.\n- Ability to switch between shaded and wireframe mode in the scene preview.\n- Multi-curve support for the curve editor widget.\n- `Color::COLORS` array with pre-defined colors.\n- Ability to set different brushes for every curve in the curve editor.\n- Apply different colors to curves in the animation editor.\n- Show multiple curves at once when selecting tracks in the animation editor.\n- Dropdown menu widget.\n- Quick-access menu for grid snapping.\n- `Create Parent` context menu option for scene nodes.\n- Add background curves concept to the curve editor widget.\n- Smart placement for newly created objects.\n- Added mesh control panel - allows to create physics entities (colliders, rigid bodies, etc) in a few clicks.\n- `Reflect::assembly_name` to retrieve assembly name of a type.\n\n## Changed\n\n- Major style improvements for the editor UI.\n- Migrated to Rapier 0.18.\n- Refactored multiborrow context - removed static size constraint and made borrowing tracking dynamic and more efficient.\n- Use `Result` instead of `Option` for multiborrowing for better UX.\n- Added panic on `Ticket::drop` to prevent dangling pool records.\n- Moved generic graph handling code into `fyrox-graph` crate.\n- Do not call `Control::update` for every widget:\n  - in the editor on complex scenes it improves average performance by 13-20%.\n  - you have to set `need_update` flag when building the widget if you need `Control::update` to be called.\n- Mutable access to UI in `Control::update`.\n- Refactored `Selection` to use dynamic dispatch.\n- Refactored the entire editor command system to use dynamic dispatch.\n- Split `SceneGraph` trait into object-safe and object-non-safe parts.\n- Run most of `Engine::pre_update` logic even if there's no graphics context.\n- Moved color space transformation to vertex shader of particle system to increase performance.\n- Recalculate world space bounding box of a mesh on `sync_transform` instead of `update`.\n- Refactored rectpacker to use plain `Vec` instead of `Pool`.\n- Moved rectangle-related code to `rectutils` crate.\n- Automatically unregister faulty resources if registering ok one.\n- Prevent uvgen to modifying the actual surface data.\n- Extracted uvgen module to `uvgen` crate.\n- Use simple vec instead of pool in octree.\n- Moved `math` + `curve` + `octree` mods to `fyrox-math` crate.\n- Moved lightmapper into a `lightmap` crate.\n- Support for backwards movement (negative speed) for navmesh agent.\n- Moved the engine implementation into `fyrox-impl` crate, `fyrox` crate now is a proxy to it.\n- Moved interaction modes panel to the toolbar.\n- Made shader methods public to be able to create them manually.\n- Show unassigned handles in orange color to attract attention.\n- Major refactoring of `TextBox` widget that makes it much more pleasant to work with.\n- Major usability improvements for `DockingManager` tiles.\n- `Window` widget content is now linked to `NavigationLayer` widget instance.\n- Prevented `TextBox` and `NumericUpDown` widgets from sending change messages when they have not changed.\n- Reduced width and precision for worldspace position of current selection.\n- Use `ImmutableString` for scene nodes and widgets to reduce memory consumption on duplicated strings.\n- Do not flush the renderer when changing scenes, to prevent various graphical issues.\n- More informative names for curves in the animation editor.\n- Change cursor icon when picking/dragging keys in curve editor.\n- Major refactoring of coordinate system in the curve editor.\n- Keep the animation player selected in the animation editor.\n- Changed AABB validity to include zero-size dimensions to allow camera fitting to work with flat objects.\n- Prefer prefab roots when selecting nodes in scene.\n- `Reflect` trait bound for `Plugin` trait.\n\n## Fixed\n\n- Fixed cascade shadow maps (CSM) rendering.\n- Fixed crash when setting particle spawn rate too high.\n- Fixed UB when using MultiBorrowContext.\n- Fixed visibility of cloned widget.\n- Set unique id for widget copies.\n- Fixed crash when closing scenes.\n- Fixed `Default` impl for `Pool`.\n- Fixed rare crash in `TextBox` widget when typing in something\n- Fixing double pixel loop (it was looping over y twice) in terrain internals.\n- Fixed creating a MenuItem in editor.\n- Force ui widget to recalculate layout if it was animated\n- Registered property editors for all UI properties.\n- Fixed incorrect FBX cluster loading (fixes incorrect rendering of FBX models)\n- Fixed crash when selection range is incorrect in the `TextBox` widget.\n- Fixed crash in the animation editor when trying to rebind a track referencing deleted scene node.\n- Properly expand tree items when building path in file browser widget.\n- Fixed doubling of items under disks in file browser widget.\n- Fixed track deletion in the animation editor.\n- Fixed file browser behaviour on empty file path\n- Select current dir in the asset browser.\n- Automatically remove disconnected listeners from the log.\n- Fixed support of custom layout panel of `ListView` widget.\n- Fixed async tasks at WebAssembly target.\n- Fixed property inheritance for types with interior mutability.\n- Keep selected brush when hovering mouse over a `Decorator` widget.\n- Fixed `TabControl` widget headers style.\n- Improved SearchBar widget style.\n- Fixed incorrect script task handling (it was passing task result to all scripts, instead the one that launched the task).\n- Prevent particle systems from over-spawn particles when spawn rates are high.\n- Fixed incorrect vertex buffer data layout.\n- Fixed crash if a selected node was deleted during asset hot reloading.\n- Prevent moving a folder into its own subfolder in the asset browser.\n- Fixed lightmap saving when corresponding lightmap textures were deleted.\n- Sort rectangles back-to-front when rendering to prevent blending issues.\n- Back-to-front sorting when rendering nodes with transparency.\n- Fixed seams on skybox cubemap.\n- Hide `should_be_deleted` field.\n- Do not update scripts on disabled nodes.\n- Fixed sound context serialization (this bug caused all sound buses to disappear on load)\n- Fixed potential crash in audio bus editor.\n- Fixed crash when closing the editor.\n- Fixed crash `attempt to subtract with overflow` in particle systems.\n- Fixed incorrect `Selection::is_empty` implementation.\n- Fixed canvas background color leaking to the rendered image on WebAssembly.\n- Ignore `target` dir when doing search in the asset browser.\n- Fixed accidental enabling/disabling tracks when expanding them in the animation editor.\n- Fixed editor layout saving and loading. \n- Prevent `Inspector` properties from disappearing when expander is closed.\n- Use context menus instead of plain popups in color gradient editor.\n- Fixed incorrect extension proposal for in the resource creator.\n- Fixed incorrect resource creation in resource creator.\n- Fixed sluggish tiles resizing in the docking manager.\n- Keep the order of interaction modes the same.\n- Fixed bring-into-view for `ScrollPanel` widget - not it does not jump unpredictable.\n- Do not pass keyboard input to invisible widgets.\n- Handle edge cases properly when calculating curve bounds.\n- Fixed \"zoom to fit\" functionality in the curve editor widget.\n- Fixed sliding of the view in the curve editor widget on resizing.\n- Fixed frustum culling flag usage.\n- Fixed inspector syncing/context changing.\n- Fixed crash when trying to get selected entity from empty selection.\n- Fixed crash when closing scenes using `X` button on the tabs.\n\n## Removed\n\n- Removed `define_command_stack` macro\n- Removed redundant `old_selection` arg from change selection command\n\n# 0.33.1 Engine + 0.20.1 Editor \n\n## Fixed\n\n- Fixed deadlock when deep cloning a texture. Caused the editor to hang up on saving terrains (#598).\n- Fixed occasional crash when undoing node creation\n- Fixed highlighting for objects that were cloned\n\n# 0.33 Engine + 0.20 Editor\n\n## Added\n\n- UI editor.\n- Tasks system for scripts and plugins.\n- Implemented dynamic font atlas.\n- Batching for 2D graphics.\n- Ability to move resources and folders in the Asset Browser.\n- Edge highlighting for selection in the editor.\n- Added an ability to create resources from asset browser.\n- Added height parameter for `Text` and `TextBox` widgets.\n- Ability to specify IO abstraction when loading user interface.\n- `Utf32StringPropertyEditorDefinition` to edit `Vec<char>` UTF32 strings.\n- `RefCellPropertyEditorDefinition` for `RefCell<T>` types.\n- Enable reflection + serialization for formatted text and its instances.\n- Built in font resource.\n- Font resource property editor with font preview. \n- Ability to assign fonts from asset browser.\n- Reflection for resources.\n- UI graph manipulation methods.\n- `Screen` widget  automatically fits to the current screen size.\n- Show type name in world viewer for widgets.\n- Ability to specify ignored types for `Reflect::apply_recursively`.\n- Preview for curve and hrir resources.\n- Ability to open a window at desired position.\n- Ability to edit textures as UntypedResource in widgets.\n- Implemented `Serialize + Deserialize + Display` traits for `ErasedHandle`.\n- Smart positioning for contextual floating panels in the editor.\n- `WidgetMessage::Align` + `WindowMessage::OpenAndAlign` messages.\n- Ability to invalidate layout for all widgets at once.\n- Ability to mark all fields of a struct/enum optional when deserializing: `#[visit(optional)]` can now be \nadded to a struct/enum directly, thus overriding all other such attributes on fields.\n- Added access to user interface, task pool, graphics context, current scene handle for scripts.\n- `PluginsRefMut::get/get_mut/of_type_ref/of_type_mut` methods.\n- Added a bunch of `#[inline]` attributes for `Pool` for slight performance improvements. \n- Added `AtomicHandle` that can be modified using interrior mutability.\n- Ability to pass pixel kind to the `Renderer::render_ui_to_texture` method.\n- Show material resource state in the material field editor.\n- Ability to scroll to the end of the content for `ScrollViewer` and `ScrollPanel` widgets.\n- Ability to save and load light maps into/from a file.\n- Ability to repeat clicks of a button while it is hold pressed.\n- Ability to open materials for editing from the asset browser.\n- Ability to filter a list of types when using reflection for fields iteration.\n- Implemented `PartialOrd + Ord` traits for `Handle` type.\n- Added icon in the asset browser for material resources.\n- Ability to pass generics to `uuid_provider` macro.\n- Ability to share navigational mesh across multiple threads.\n- Implemented `Reflect` trait for `RwLock`.\n- `UserInterface::find_by_name_down_from_root` method to search widgets by name.\n- Implemented `Send` trait for UI entities.\n- Added user interface resource.\n- Collider control panel with ability to fit colliders to parent bounds.\n- Property editor for vector image's primitives.\n- Show warning in the log when there's script message with no subscribers.\n- Implemented `TypeUuidProvider` trait for standard types.\n- Ability to specify clear color in `Renderer::render_ui_to_texture`.\n- Added icon in the asset browser for shader resources.\n- Ability to copy widgets from UI to UI.\n- Ability to create ragdolls from `Create` menu.\n- Added an ability to rebind tracks in the animation editor.\n- Added a set of standard materials, exposed them in the editor.\n- Added placeholder texture.\n- Ability to fetch resource import options from their respective loaders.\n- Implemented `Visit` and `Reflect` traits for `char`.\n- Ability to specify icons for assets in respective preview generators.\n- `TypedResourceData` trait to be able to set correct default state of a resource.\n- Implemented `ResourceData::save` for built-in engine resource types.\n- Documentation for LODs.\n- Color constants for the colors with names.\n- Ability to save resources.\n- `ResourceLoader::supports_extension` method.\n- Implemented `Error` trait for `VisitError`.\n- `Material::set_texture` shortcut.\n- Implemented `From<&str>` trait for `ImmutableString`.\n- Added normalization option for vertex attribute descriptor.\n- Added experimental network abstraction layer.\n- Added frustum culling for rectangle node.\n- Added camera view pyramid visualization (kudos to [@dasimonde](https://github.com/dasimonde)).\n- Added IO abstraction for resource system (kudos to [@jacobtread](https://github.com/jacobtread)).\n- Added `Reflect`, `Debug`, `Visit` trait implementations for UI widgets.\n- Added `Visit` trait implementation for `usize/isize`.\n- Added `ResourceIo::move_file` method.\n- Added `ResourceManager::move_resource` method with filtering.\n- Added `Drop` message for `FileBrowser` with dropped path.\n- Added `ResourceIo::canonicalize_path`.\n- Added `Pool::generate_free_handles` methods.\n- Added `InteractionMode::make_button` method that creates appropriate button for the mode.\n\n## Changed\n\n- Major editor refactoring to support new UI scenes.\n- Moved low level animation modules into fyrox-animation crate.\n    - Type aliases for scene specific animation entities + preludes.\n    - Texture as generic parameter for sprite sheet animation.\n- Turn font into resource + added `TextMessage::Height`.\n- Make standard built-in shaders non-procedural by default.\n- Refactored internal structure of resources.\n    - All resource related data is now stored in `ResourceHeader` instead of being scattered all around in `ResourceState` \n  variants and even in resource data itself.\n    - Backward compatibility is preserved.\n    - `ResourceKind` instead of path+flag, refactored resource loader trait.\n- Refactored interaction modes in the editor.    \n- Switched to UntypedResource from SharedTexture in ui\n- Simplified usage of `ResourceManager::request/try_request`. No need to write `rm.request<Type, _>`, just `rm.request<Type>`.\n- Registered Light Panel in floating panels, so it can be docked.\n- Made searching in the asset browser smarter.\n- GPU resources cache refactoring.    \n- Speed up access to textures.\n- Automatic implementation of `ScriptTrait::id()` method. This implementation now should be removed from your\nscripts.\n- Scroll to the end of build log in the editor.\n- Prevented build window from closing when a build has failed.\n- Tweaked node handle property editor to also work with ui widgets.\n- Filter out texture bytes in the property selector to improve performance.\n- Enabled clicks repetition mode for scroll bar increase/decrease buttons.\n- Keep the editor active if there's any captured ui element.\n- Increased scroll bar step for scroll viewer.\n- Added filter argument for `aabb_of_descendants`.\n- Use abstract EntityId instead of ErasedHandle in animation entities.\n- Optimized internals of navigation mesh. \n- Prevented serialization of the data of external resources.\n- Pass screen size to `Control::update`.\n- Ability to clone user interface entirely.\n- Refactored scene saving dialogs in the editor to make them more stable.\n- Made `Limb::iterate_recursive` method public.\n- Switch character rigid body to kinematic when a ragdoll is active.\n- Keep menu items highlighted when opening a menu chain.\n- Gizmo improvements for navmesh interaction mode.\n- Open navmesh panel at the top right of the scene preview when selecting a navmesh scene node.\n- Improved visualization in the dependency viewer.\n- Made asset import options inspector generic.\n- Provide access to material context in the renderer.\n- Movement, scale, rotation gizmo improvements.\n- Mutable access for ui nodes.\n- Preload resources before generating preview for them.\n- Made world viewer to accept data provider instead of scene directly.\n- Replaced `Cow<Path>` with `&Path` in `ResourceData` trait\n- Allow to set materials by drag'n'drop on material editor field.\n- Made material fields in the inspector more clickable. \n- Improved navigation on navmesh using string pulling algorithm.\n- Improved performance of navigation mesh queries.\n- Improved text box widget performance.\n- `Plane` API improvements.\n- Made material editor wider a bit by default.\n- Extend resource data constructor with type name.\n- Turned material into resource, removed `SharedMaterial` struct.\n- Serialize vertex buffer data as a bytes slab.\n- Use `Window::pre_present_notify` as recommended in the `winit` docs.\n- Refactored sprites rendering to use materials.\n- Refactored particle system rendering to use forward renderer.\n- More built-in shader variables for lighting.\n- Triangle buffer API improvements.\n- Use debug message callback instead of message queue for OpenGL errors.\n- Enable OpenGL debugging in debug build profile.\n- Customizable time-to-live for geometry buffers (allows to create temporary buffers that lives one frame (ttl = 0)).\n- Allow to start multiple scenes at editor start up (kudos to [@dasimonde](https://github.com/dasimonde)).\n- `push_vertices` + `push_vertices_transform` method for vertex buffer.\n- Ability to connect a state with every other state in the ABSM editor (kudos to [@Riddhiman007](https://github.com/Riddhiman007))\n- Added UUIDs for scene nodes.\n- Ability to set navmesh agent path recalculation threshold.\n- Reset `modified` flags of inheritable variables when fixing node type.\n- Check for node type mismatch on graph resolve and auto-fix this.\n- Use type names instead of type ids when reporting inheritance errors.\n- Remove orphaned nodes when restoring graph's integrity.\n- Code example for `Inspector` widget.\n- Pass node handle to surface instance data.\n- Check for global `enabled` flag when filtering out cameras for rendering.\n- Serialize joints binding local frames.\n- Support for touch events in the UI (kudos to [@Bocksdin](https://github.com/Bocksdin)).\n- A* pathfinding optimization (kudos to [@TiltedTeapot](https://github.com/TiltedTeapot)).\n\n## Fixed \n\n- Fixed crash of the editor on Wayland.\n- Fixed font rendering API.\n- Fixed restoration of shallow resource handles of untyped resources.\n- Prevent double saving of settings after modification.\n- Keep aspect ratio when previewing a texture in the asset browser.\n- Filter out non-savable resources in resource creation dialog.\n- Fixed offscreen UI rendering in the UI editor.\n- Fixed deep cloning of materials: make them embedded after cloning.\n- Fixed path filters to correctly handle folders with \"extensions\".\n- Save material when changing its shader property in the material editor.\n- Fixed massive footgun with pointers to the graphics pipeline state scattered all around the renderer.\n- Prevent creating of multiple thread pool across the engine.\n- Fixed crash in the material editor if a material is failed to load.\n- Prevent the editor from closing after saving a scene via Ctrl+S.\n- Fixed position saving of maximized editor window.\n- Fixed crash when assigning non-material resource in a material property.\n- Fixed forward pass of standard shader for skinned meshes\n- Fixed uuid formatting in visitor.\n- Fixed resource extension comparison in the editor by making it case-insensitive.\n- Fixed crash when drag'n'dropping assets in scene previewer.\n- Fixed OpenGL error handling\n- Fixed performance issues when modifying vertex/triangle buffers.\n- Fixed crash when editing terrains (kudos to [@Riddhiman007](https://github.com/Riddhiman007))\n- Fixed a bug when vertex attribute divisor was ignored.\n- Fixed colors for log messages.\n- Fixed scene loading in derived mode.\n- Fixed text coloring when sending a `WidgetMessage::Foreground` to text.\n- Fixed memory leaks on Linux (kudos to [@LordCocoNut](https://github.com/LordCocoNut))\n- Fixed invalid GPU resource indexing bug, that caused crashes/quirks in graphics when switching scenes in the editor.\n\n## Removed\n\n- Removed implicit cloning when in `Reflect::into_any` impl for some types.\n- Removed redundant memory allocation when fetching fields using reflection.\n- Removed redundant memory allocation when iterating over fields.\n- Removed `Option` wrapper in typed resource to flatten the internal structure of resources.\n- Removed a bunch of redundant clones in the renderer.\n- Removed lazy calculations in the navigational mesh.\n- Removed unused `soft_boundary_sharpness_factor` param from particle systems (this property was moved to the \nstandard particle system material).\n- Removed `InteractionModeKind` and replaced it with uuids.\n\n# 0.32\n\n- Do not call `Script::on_os_event` if script is not started yet.\n- Borrow instead of move in `Visitor::load_from_memory`.\n- Ability to load scenes in two modes - derived and raw.\n- Fixed selection issues in the animation editor.\n- Fixed path fixer.\n- Ability to set resource path.\n- `ResourceManager::unregister` to unregister loaded resources.\n- Refactored scene loading + plugin interface improvements.\n- Bring currently selected node into view when clearing filter in the world viewer.\n- Fixed searching in the property selector.\n- Bring current selection into view in node selector when clearing filter text.\n- Fixed `zoom to fit` in the curve editor when there's no keys.\n- Fixed node name formatting in the animation editor's track list.\n- Fixed tooltips in the inspector.\n- `EditorPlugin::on_post_update` that invoked after any other update methods.\n- Fixed selection syncing in node selector.\n- `TreeRootMessage::ItemsChanged` to catch the moment when tree root items changes.\n- Improved visual style of node handle property editor.\n- Ability to set scene node handle via node selector.\n- `Sound::try_play` method that will only play the sound if it is not already playing.\n- `Flip green channel` option for texture import options: this adds an ability to flip green channels for \nnormal maps made in OpenGL Y+ format.\n- Resource manager improvements: added base trait with auto-implementation to reduce boilerplate code, mandatory \n`ResourceLoader::data_type_uuid` method to fetch actual data type produced by resource loader, \n`ResourceManager::try_request` - returns an optional resource handle, returns `None` if `T` does not match the\nactual data id (`request` just panics in this case).\n- Print an error message to the log when unable to load a resource.\n- Resource field property editor improvements: emit transparent geometry to improve mouse picking,\nadded margins for elements.\n- Exposed resource manager reference to plugin registration context to be able to register custom resource\nloaders that will be used in both the game and the editor.\n- `Material::sync_to_shader` method to sync material properties with its shader.\n- `parallaxCenter` + `parallaxScale` property for standard shaders.\n- Fixed TBN-basis visualization in mesh debug drawing.\n- Make all gizmo's X axis match the actual coordinate system's X axis.\n- Fixed tooltip in asset browser to show full path without clipping.\n- Fixed parallax mapping.\n- Fixed binormal vector calculation.\n- Added missing `tif` extension for texture loader.\n- Fixed build window output in the editor.\n- Added fade in/fade out for shadows, that prevents them from popping out of nowhere.\n- Added scene gizmo.\n- Keep frame alpha when applying lighting for transparent background rendering.\n- Rewind sound sources before stopping them.\n- Improved camera focusing on a scene object.\n- Changed orbital camera controls: drag camera was moved to `Shift+RMB`, added configurable zoom range.\n- Added orbital camera mode for editor camera (can be activated by middle mouse button).\n- Use `f32` instead of `Duration` for scene sound source's playback time.\n- Fixed terrain brush bounds visualization.\n- Hotkeys for terrain editor.\n- Use `workspace.dependencies` in the projects generated by `fyrox-template` to simplify dependency change.\n- Improved editor settings handling.\n- `Curve::bounds` + ability to `Zoom to fit` with delay for the curve editor.\n- Property editor for `Curve` fields.\n- New `fyrox-scripts` crate + flying camera controller script.\n- Ability to map ui key back to winit + change key binding property editor.\n- Fallback to root directory if `fyrox-template script` cant find `game/src`.\n- Added debug impls for gpu texture.\n- Fixed seams between terrain chunks.\n- Removed obsolete examples and replaced them with [new examples](https://github.com/FyroxEngine/Fyrox-demo-projects).\n- Fixed curve editor compatibility with scrolling regions.\n- Fixed clipping issues in curve editor.\n- Save expanded state of the scene items in the world viewer in the editor settings.\n- Fixed invalid keys positioning in the curve editor when selecting them.\n- Fixed box selection in the curve editor when mouse is outside.\n- Focus currently selected entity when clearing filter text in animation editor.\n- Fixed a bunch of potential crashes in the `CurveEditor` widget.\n- Fixed HiDPI issues on WebAssembly.\n- Removed hardcoded list of supported resource extensions from the editor and use ones from resource loaders.\n- `Hrir` resource + async HRTF loading for HRTF sound renderer.\n- Fixed texture compression.\n- Do not use `glCheckError` in release builds since it has bad performance.\n- Set nearest filtration for floating-point textures in the renderer (WebAssembly fix).\n- Switch a resource without a loader into error state to prevent infinite loading in some cases.\n- Fixed resource loading in WebAssembly.\n- Do not render anything if screen size is collapsed into a point.\n- Split light map generation in two steps + added async generation for the editor.\n- Do not allow to create game projects with a number in beginning of its name.\n- Optimized light map data serialization (breaking change, regenerate your lightmaps).\n- `BinaryBlob` wrapper to serialize arbitrary sets of data as bytes.\n- Print an error to the log instead crashing when unable to generate a lightmap.\n- Moved light map into `Graph` from `Scene`. \n- Fixed light map internal handles mapping when copying a graph.\n- `PathEditor` widget + property editor for `PathBuf` for Inspector.\n- Reduce default amount of texels per unit for lightmapper in the editor.\n- Ability to specify vcs for a new project in `fyrox-template`\n- Set `resolver = 2` for workspaces generated by `fyrox-template`\n- Improved joints computational stability.\n- `Make Unassigned` button for node handle property editor.\n- Do not save invalid window attributes of the main editor window.\n- Fixed joints binding.\n- Joint rebinding is now optional.\n- Fixed potential infinite loop when constructing quaternion from a matrix.\n- Ability to set custom name to group command in the editor.\n- `Ragdoll` scene node.\n- Improved mouse picking for node handle property editor.\n- Ragdoll wizard to create ragdolls with a few clicks.\n- Power-saving mode for the editor. Editor pauses its execution if its window is unfocused or there's no OS events\nfrom the main window. This change reduces CPU/GPU resources consumption down to zero when the editor is non-active.\n- Do not create a separate region for inheritable variables on serialization if non-modified. This saves quite a \nlot of disk space in derived assets (including saved games).\n- Property editors for inheritable vec collections of resources.\n- Clamp input time to the actual duration of the buffer when setting sound source's playback time.\n- Fixed inability to fetch stream length of ogg/vorbis.\n- `GenericBuffer::duration` is now using integer arithmetics which does not suffer from precision \nissues (unlike floating point numbers).\n- Decoders now returns channel duration in samples, not in seconds.\n- Send text box message on changes only if its commit mode is immediate.\n- Fixed severity for messages from inability to load editor settings.\n- Added vec property editors for collections of resources.\n- Property editor for `Vec<T>` will now use appropriate property editor for `T` instead of implicit usage\nof `InspectablePropertyEditor`.\n- Fixed incorrect focusing of an asset in the asset browser.\n- Fixed emitted message direction for `TextBox` widget.\n- `Show in Asset Browser` button for resource fields in the inspector.\n- Take sound source gain into account when using HRTF renderer.\n- Fixed visualization of bones list of a surface in the editor.\n- Reduced HRTF sound renderer latency.\n- Fixed animation events collection for blend-by-index ABSM nodes.\n- Improved ABSM events collection API.\n- Ability to fetch animation events from ABSM layers.\n- Fixed property reversion: now it reverts only modified ones.\n- Ability to revert all inheritable properties at once of a scene node.\n- `Reflect::enumerate_fields_recursively` allows you to iterate over descendant fields of an object\nwhile getting info about each field.\n- Update only currently active scene in the editor.\n- Navmesh path smoothing improvements and fixes. Prevent smoothing from cutting corners. \n- `A*` path finder API improvements.\n- Debug drawing for NavMesh scene node.\n- Light scattering now takes light intensity into account.\n- Prevent loading the same scene multiple times.\n- Clear UI in the editor when changing scenes to prevent potential visual desync.\n- Fixed potential panic when handling UI messages with invalid target widget handle. \n- Fixed doubling of the text when printing text in `TextBox` widget on some platforms.\n- Ability to duplicate animation tracks in the animation editor.\n- Ability to set an ID of animation tracks.\n- Fixed potential panic on invalid handles of `Rapier` entities when fetching contacts.\n- Ability to close tabs in `TabControl` widget using middle mouse button.\n- Visualize directional lights as arrows in the editor.\n- Ability to draw arrows in scene debug drawing context.\n- Migrated to `winit 0.29`.\n- Fixed `Rect::clip_by` method.\n- Removed `VecExtensions` trait, because its functionality was already added in the standard library.\n- `Popup` widget improvements: `Placement::target` method, ability to create popups without adding them\nto the UI.\n- Fixed potential infinite loop in the `Menu` widget.\n- Added context menu to the file browser to be able to create folders and remove files.\n- Significantly improved test coverage for `fyrox-core` and `fyrox-resource` crates (kudos to \n[@san-smith](https://github.com/san-smith))\n- Optional node deletion dialog to warn if a node is referenced somewhere in the graph.\n- Fixed potential double free issue in the vertex buffer.\n- Fixed unsoundness of type-erasure in the vertex buffer.\n- `Graph::find_references_to` to search for node references in the graph.\n- `Reflect::apply_recursively` for recursive iteration over the descendant fields of an object. \n- Added `try` reserved keyword for `fyrox-template`. \n- Built-in sky box for `Camera` scene node.\n- Improved search in the World Viewer.\n- Make `TriangleDefinition` trivially-copyable.\n- Major UI documentation improvements.\n- Docs for `VectorImage`, `ScrollPanel`, `RectEditor`, `RangeEditor`, `ProgressBar`, `ListView`, `Canvas`,\n`SearchBar`, `ScrollViewer`, `Expander`, `KeyBindingEditor`, `HotKeyEditor`, `Tree`, widgets.\n- Major book improvements.\n\n# 0.31 \n\n- Multi-scene editing\n- Docs for `Window` widget\n- Fixed opengl es usage when opengl is not supported\n- Docs for `Decorator` widget\n- Added `crv` extension for `CurveLoader`\n- Basic editor plugins support \n- Updated deps\n- Expose all editor fields so they can be accessible outside\n- Docs for `UuidEditor` widget\n- Use user_data field of physics entities to store handle to engine entity\n- Ability to encode/decode handles to/from u128\n- Ability to fetch all contact pairs from 2d/3d physics worlds\n- Docs for `MessageBox` widget\n- `Graph::aabb_of_descendants`\n- Aabb api improvements\n- Ability to open asset of a node from the world viewer\n- Improved `impl_component_provider` macro to accept `field.foo.ab` chains\n- Docs for navmesh node\n- Useful shortcuts for behaviour trees\n- Fixed standard materials for new serialization format\n- Inverter node for behaviour trees\n- Docs and examples for `VertexBuffer`\n- Added `VertexTrait` to prevent using a vertex type with different layout\n- Improved `surface` mod docs\n- Added `elapsed_time` in `PluginContext`\n- Use all texture channels in sprite fragment shader\n- Load editor's docking manager layout on reconfiguration\n- Open window of a tile when restoring docking manager layout\n- Ability to save/load editor's docking manager layout\n- Prevent panic in ui search methods\n- Ability to apply saved docking manager layout + improved layout saving\n- Ability to save docking manager layout\n- Changed error to warning when unable to load missing options file\n- Fixed crash when exiting the editor\n- Fixed opening arbitrary files from asset browser\n- Ability to open scenes from asset browser\n- User-defined data for tabs \n- Ability to add and remove tabs in the `TabControl` widget via messages\n- Added a nine patch widget\n- Fixed tab control's content alignment\n- `can_be_closed` flag for `TabControl` tabs\n- Ability to close tabs in `TabControl` widget\n- Docs for `TabControl` widget\n- Ability to catch the moment when the active tab of `TabControl` changed\n- Docs for `ScrollBar` widget\n- Docs for `Popup` widget\n- Docs for `NumericUpDown` widget\n- Ability to change `StackPanel`'s orientation via message\n- Ability to change `WrapPanel`'s orientation via message\n- Docs for `WrapPanel` widget\n- Docs for `CheckBox` widget\n- Docs for `Widget`\n- Docs for `TextBox` widget\n- Docs for `StackPanel` widget\n- Docs for `Grid` widget\n- Docs for `Image` widget\n- Docs for `Text` widget\n- Fyrox-ui docs\n- Docs for `Button` widget\n- Access to current transform of `TransformStack`\n- Docs for `Border`\n- Ability to pass doc comments in `define_constructor` macro\n- Docs for `BuildContext`\n- Docs for `UiNode`\n- Iterative font atlas packing.\n- Docs for `Thickness`\n- Docs for widget alignments\n- Docs for `BaseControl`\n- Update hierarchical data when instantiating a prefab\n- Docs for `trait Control`\n- Hotkey to focus editor's camera on a selected object\n- Helper methods for `Frustum`\n- Ability to focus editor's camera on an object\n- Helper methods for `TextureKind`\n- Camera fitting functionality\n- Aabb helper methods\n- Save editor settings only if they were modified by user\n- `Camera::frustum`\n- Fixed camera preview + added camera preview control panel\n- Automatically select newly created scene nodes in the editor\n\n# 0.30\n\n- Ability to change graph root to arbitrary graph node.\n- Ability to change graph root in the editor.\n- Optional checkerboard background for `Image` widget.\n- Simplified animation blending.\n- Mutable access to curve key's value.\n- Added property validation for the animation editor.\n- Track validation for the animation editor.\n- Ability to set widget's tooltip via message.\n- Correctly sync track names in the animation editor.\n- Ability to change target nodes on animation tracks.\n- Preserve parent when extracting a sub-graph from a graph.\n- Refactored editor scene structure to allow modifying the root node.\n- Play sound buffer resource when inspecting it in the asset browser.\n- Show textured quad in resources previewer when inspecting a texture.\n- Configurable scroll speed for `ScrollViewer` widget + speed up scrolling 2x.\n- Helper methods to quickly check a resource state.\n- Helper methods to access script components faster.\n- Improved range property editor.\n- `Enter State` for state menu in absm editor. Works the same as double click, removes confusion for ppl that does not \nget used to double-click on things.\n- Leave preview mode when closing or changing scenes in the editor.\n- Prevent panic when trying to generate random number from an empty range.\n- Serialize delay line samples as POD array.\n- Optional ability to save current scene in text form for debugging.\n- Do not render disabled sprite nodes.\n- Fixed property inheritance subtle bugs.\n- Do not allow revering a property value in the editor if there's no parent.\n- Do not save content of non-modified inheritable variables.\n- Fixed directional light docs.\n- Fixed `Node::is_x,as_x,as_x_mut` methods.\n- `Graph::try_get_script_of + try_get_script_of_mut` methods\n- `Base::root_resource` - allows you to find root resource in dependency graph.\n- Prevent deadlock on self-referencing model resources\n- UUID for widgets.\n- Save editor's window position and size into editor's settings.\n- Apply local scaling of terrain to heightfield collider.\n- `MachineLayer::is_all_animations_of_state_ended`\n- Ability to fetch all animations of a state in ABSM layer.\n- Added `IsAnimationEnded` condition for ABSM transitions.\n- ABSM state actions. Allows you to rewind/enable/disable specific animations when entering/leaving a state.\n- Fixed incorrect \"state enter\" event sent from source instead of dest.\n- Added a collection of built-in resources for resource manager. This collection is used on resource deserialization \nstep to restore references to built-in resources.\n- Pre-compile built-in shaders on engine startup.\n- Ability to change camera zoom speed in the editor.\n- `Plugin::before_rendering`\n- Matrix storage cache to prevent driver synchronization steps.\n- Persistent identifiers for render entities.\n- Improved deserialization performance.\n- Use `fast_image_resize` crate to generate mip maps (which gave 5x performance boost).\n- Configurable filter for mip-map generation for textures.\n- Fixed tooltip position - it now does not go outside of screen bounds.\n- \"Immutable collection\" reflection attribute for collection fields that prevent changing collection size. \n- Ability to get typed data of specific mip level of a texture.\n- Ability to fetch specific mip level data of textures.\n- Ability to set height map of terrain chunks directly from an image.\n- Dependency graph visualizer for asset browser.\n- Resource dependency graph.\n- Ability to flatten terrain slopes.\n- Return local height value at intersection point in ray-terrain test.\n- Cleaned editor's command API.\n- Removed visibility cache.\n- Ability to index graph with `Handle<T: NodeTrait>`\n- `Handle::transmute`\n- Doc comments support for reflection.\n- Show doc comments for selected entity in a separate window.\n- Moved logger to `fyrox_core`.\n- Resource system refactoring to support user-defined resources.\n- Blackboard for visitor to pass arbitrary data when serializing/deserializing.\n- Added missing recalculation of terrain bounding box.\n- `Texture::deep_clone`\n- `Log::verify_message`\n- `R32F` + `R16F` texture formats.\n- `data_of_type` methods to reinterpret inner texture data storage to a particular type.\n- Debug drawing for scene nodes.\n- Configurable polygon rasterization mode for scenes (gbuffer only).\n- Ability to set polygon rasterization mode to select between solid and wireframe rendering.\n- Force `Framebuffer::draw_x` methods to accept element range to draw.\n- Proper culling for terrains.\n- Refactored rendering: scene nodes can now supply renderer with data. `NodeTrait::collect_render_data` is now used to \nsupply renderer with data.\n- Batch generation is now done on per-camera (which includes light sources for shadows) basis.\n- Added a method to link nodes while keeping child's global position and rotation.\n- LODs for terrains.\n- Limits for collider shape values.\n- Added doc example for `Graph::begin_multi_borrow`.\n- Fixed samplers type collision when rendering with materials with different sampler types.\n- Unbind texture from other samplers when setting it to a new one.\n- Fixed half-float textures + fixed volume textures mip maps.\n- `RGB16F` texture format.\n- Use texture-based matrix storage for \"unlimited\" bone matrices. Raises matrix count per surface from 64\nto 255.\n- Fixed texture alignment issues.\n- Use correct sampler index when changing texture data.\n- Set new mip count for texture when changing its data.\n- Fixed texture binding bug.\n- Warning instead of panic when there's not enough space for bone matrices.\n- Rename `visitor::Node` to `visitor::VisitorNode` to prevent confusing import in IDEs.\n- `InheritableVariable::take`\n- Ability to change size of terrain height map and layer masks.\n- Ability to add chunks from any side of the terrain.\n- Fixed crash when deleting a navmesh edge.\n- Improved package description.\n- Make navmesh panel floating by default + open it when a navmesh is selected.\n- Navigational mesh refactoring.\n- Navigational mesh scene node.\n- Pass light intensity into lightmapper.\n- \"Headless\" mode for `Executor` - suitable for server-side of multiplayer games.\n- Added editor's window icon.\n- Blend shape support.\n- Changed sidebar to be inspector in the view dropdown menu.\n- Tweaked step values for transform properties.\n- Limits for vec editor.\n- Generic `Vector<T,N>` property editor.\n- Added support for min, max, step property attributes for vecN.\n- Ability to create/destroy audio output device on demand.\n- Migrate to `tinyaudio` as audio output backend\n- Use `RcUiNodeHandle` for context menus. This ensures that context menu will be destroyed when it is \nnot used anymore.\n- Fixed multiple lightmapping issues.\n- Fixed incorrect `sRGB` conversion for WASM.\n- Android support.\n- Ability to run the engine without graphics/window/sound by making these parts optional.\n- Update to latest `winit` + `glutin`.\n- Ability to change value in `NumericUpDown` widget by dragging\n- Removed \"Scene Graph\" item from world viewer + made breadcrumbs much more compact.\n- Put interaction mode panel on top of scene previewer.\n- Added ability to search assets in the asset browser.\n- `SearchBar` widget.\n- Ability to hide path text box in file browser widget.\n- Hide path field in the asset browser.\n- Tooltip for asset items in the asset browser that shows full asset path.\n- Improved simple tooltip style.\n- Optional ability to suppress closing menus by clicking on non-empty menu.\n- Added `No Scene` reminder in the editor and how to create/load a scene.\n- Editor UI style improvements.\n- `DrawingContext::push_arc+push_rounded_rect`\n- Ability to enable/disable debug geometry for camera/light sources.\n- Show indices of input sockets of ABSM nodes.\n- Keep animations enabled on import.\n- Blend space support.\n- Added help menu (with `Open Book` and `Open API Reference` items)\n- Ability to create special (much faster) bindings to position/scale/rotation of nodes in the animation\neditor.\n- Ability to reimport animations in the animation editor.\n- New example: render to texture.\n- Audio bus graph.\n- Root motion support.\n- Audio panel rework to support audio bus graphs.\n- Sound effect API improvements.\n- Keep recent files list sorted and up-to-date.\n- Fixed incorrect sound panning in HRTF mode.\n- Ability to get unique material instances when cloning a surface.\n- Validation for sound node\n- Audio preview panel\n- Do not play sounds in the editor automatically. Sounds can only be played from the audio preview panel\ninstead. fixes the issue when you have a scene with multiple sounds, but since they're playing, their playback position\nchanges and these changes sneak in the saved scene preventing from defining strict playback position\n- Ability to partially update global properties of a hierachy of nodes.\n- Do not crash if a root node in the previewer died.\n- Fixed deadlock when selecting object's property in animation editor.\n- Ability to set pre-generated particles in particle systems.\n- Provided access to standard shader names.\n- Print texture resource name when failed to create its GPU version.\n- Rebuild terrain's geometry on deserialization.\n- Automatic, reflection-based resource handle mapping.\n- Ability to ignore some type when doing property inheritance.\n- Support for hash maps in the property selector.\n- Expose material fields via reflection.\n- Keep flags of `ScrollBarMessage` when responding to value message.\n- Delegating implementation of `Debug` trait for `ImmutableString`.\n- Added reflection for hash maps.\n- Reflection system refactoring to support types with interior mutability (`Mutex`, `RefCell`, etc.)\n- Ability to rewind particle systems to a particular time.\n- Determinism for particle systems.\n- Fixed preview mode for particle systems.\n- Ability to \"rewind\" particle systems in particle system control panel.\n- Fixed `ParticleSystem::clear_particles` for emitters that does not resurrect their particles.\n- Fixed potential panic in formatted text on missing glyphs.\n- Supply `PluginContext` with performance statistics for the previous frame.\n- Property editor for `ColorGradient`s.\n- Simplified `color_over_lifetime` field in particle systems.\n- Improved color gradient API.\n- Fixed incorrect activation of transition/states during the preview mode in the ABSM editor.\n- Compound conditions for ABSM transitions\n- Fixed off-screen UI rendering compatibility with HDR pipeline.\n- Refactored scene node lifetime management - this mainly fixes the bug when a node with `Some(lifetime)` would crash \nthe editor. The same is applied to play-once sounds. `Node::update` now does not manage node's lifetime anymore, instead \nthere's `Node::is_alive`.\n- Fixed incorrect handling of user-defined forces of rigid bodies. A body was pushed continuously using\npreviously set force.\n- Configurable size for light pictograms in the editor\n- `ActiveStateChanged` event now contains both previous and new states.\n- Message passing for scripts with multiple routing strategies\n- `Graph::find_map/find_up_map/find_up_by_name`\n- Improved `Graph::find_x` methods - returns `Option<(Handle<Node>, &Node)>` now, that removes another \nborrow if there's a need to borrow it at a call site.\n\n\n# 0.29\n\n- Animation system rework.\n- Animation Editor.\n- Animation Blending State Machine Editor.\n- Fixed potential crash when joint was initialized earlier than connected rigid bodies.\n- Model instantiation scaling now used for prefab preview.\n- Fixed lots of potential sources of panic in perspective and ortho projections.\n- Fixed editor's camera movement speed setting for 3D mode.\n- Standard \"two-side\" shader - useful for foliage and grass.\n- Sprite sheet editor\n- Support for `Vector(2/3/4)<f32/f64/u8/i8/u16/i16/u32/i32/u64/i64>` types in serializer.\n- Sprite sheet animation now uses frames coordinates instead of explicit uv rectangles for each frame.\n- Sprite sheet animation now has a texture associated with it.\n- Fixed reflection fallback in case of missing field setter.\n- Ability to set uv rect for Image widget\n- Scene settings window for the editor - gives you an ability to edit scene settings: change \nphysics integration parameters, ambient lighting color, various flags, etc.\n- Prevent crash when adding a new surface to a Mesh node in the editor\n- Fixed directory/file duplicates in file browser widget when double-clicking on an item.\n- Show use count for materials in Inspector\n- Replace `Arc<Mutex<Material>>` with `SharedMaterial` new-type.\n- Ability to assign a unique copy of a material to an object.\n- Replace `Arc<Mutex<Material>>` with `SurfaceSharedData`\n- Clear collections before deserialization\n- Property inheritance for collections\n- Fixed incorrect material replacement when loading a scene with an FBX with custom materials.\n- Added Blender material slots names in FBX loader\n- Access to `procedural` flag for `SurfaceData`\n- Property editor for mesh's surface data.\n- Validation for scene nodes\n  - Helps to find invalid cases like:\n  - Missing joint bodies or invalid types of bodies (i.e. use 2d rigid body for 3d joint)\n  - Wrongly attached colliders (not being a child of a rigid body)\n  - Shows small exclamation mark if there's something wrong with a node\n- Share tooltip across widgets on clone\n- Fixed color picker: brightness-saturation grid wasn't visible\n- Added support for Collider intersection check (kudos to [@Thomas Hauth](https://github.com/ThomasHauth))\n- Animation system refactoring\n  - Use curves for numeric properties.\n  - Ability to animate arbitrary numeric properties via reflection.\n- Prevent crash in case of invalid node handle in animation\n- `Curve::value_at` optimization - 2x performance improvement of using binary search for spans.\n- `Curve::add_key` optimized insertion using binary search.\n- Node Selector widget - allows you to pick a node from a scene.\n- Merge `Inspect` trait functionality into `Reflect` trait - it is now possible to obtain fields metadata\nwhile iterating over them.\n- Property Selector widget - allows you to pick a property path from an object that supports `Reflect` trait.\n- `Reflect` implementation for `Uuid`\n- `fyrox::gui::utils::make_cross` - small helper to create a vector image of a cross\n- `FieldInfo::type_name` - allows to get type name of a field without using unstable \n`std::any::type_name_of_val`\n- `PathVertex::g_score` penalty for A* pathfinding (kudos to [@cordain](https://github.com/Cordain))\n- Added `Default`, `Debug`,`Clone` impls for `RawMesh`\n- Name and uuid for `Curve`\n- Send curve when adding new keys in the `CurveEditor` widget\n- Preserve curve and keys id in the curve editor widget\n- Correctly wrap `Audio Panel` in docking manager tile (kudos to [@iRaiko](https://github.com/iRaiko))\n- `AsyncSceneLoader` - cross-platform (wasm included) asynchronous scene loader\n- Added support for wasm in fyrox-template - now fyrox-template generates `executor-wasm` crate which is a special \nversion of executor for webassembly\n- Non-blocking resource waiting before processing scene scripts\n- Added missing property editor for sound status\n- Sync sound buffer first, then playback position\n- Property editor for `Machine` type.\n- Rectangle+RectangleFilled primitives for `VectorImage` widget\n- Draw x values in curve editor widget at the top of the view\n- Ability to show/hide axes values in the curve editor widget\n- Use messages to modify view position and zoom in the curve editor (helps to catch the moment when zoom or view \nposition changes)\n- Fixed UI messages not being passed to plugins based on when they happened during frame (kudos to \n[@bolshoytoster](https://github.com/bolshoytoster))\n- Ability to explicitly set animation time slice instead of length.\n- Cloning a node now produces exact clone.\n- Ability to set min, max values, step, precision for numericupdown widget\n- Prevent panic when trying to iterate over pool items using reflection\n- Split `Model::retarget_animations` in two separate methods\n- Smart movement move for move gizmo (kudos to [@Zoltan Haindrich](https://github.com/kgyrtkirk))\n- `Reflect::set_field_by_path`\n- Ability to add zones for highlighting in the `CurveEditor`\n- Ability to zoom non-uniformly via shift or ctrl pressed during zooming in the `CurveEditor` widget\n- Animation signals rework\n  - uuid instead of numeric identifier\n  - added name for signals\n  - removed getters/setters\n  - added more signal management methods\n- `Animation::pop_signal`\n- Refactored animation blending state machine to support animation layers\n- `Visit` impl for `HashSet`\n- Ability to set layer mask in the absm editor\n- Added animation system documentation.\n- `Graph::try_get_of_type+try_get_mut_of_type`\n- Rename `InheritableVariable` methods to remove ambiguity\n- `Model::retarget_animations_to_player`\n- Use correct property editor for `PoseWeight`\n- Show handles of absm entities in the editor\n- Show more info on absm nodes\n  - PlayAnimation nodes shows name of the animation\n  - blend nodes shows the amount of animations blended\n- `AnimationContainer::find_by_name_ref/mut`\n- Ability to search various animation entities by their names\n- Add more information to panic messages in `fyrox-template` (kudos to [@lenscas](https://github.com/lenscas))\n- Check for reserved names in `fyrox-template` (kudos to [@TheEggShark](https://github.com/TheEggShark))\n- Ability to enable/disable scene nodes\n- Basic support for headless mode for server part of games (kudos to [@martin-t](https://github.com/martin-t))\n- Removed `Scene::remove_node`\n- Rename `NodeTrait::clean_up` -> `NodeTrait::on_removed_from_graph`\n- Fixed colorization in the world viewer\n- Ability to disable steps of update pipeline of the graph\n- Preview mode for animation player, animation blending state machine, particle system nodes.\n- Rename colliding `ParticleSystem::set_enabled` method to `play`\n- Particle system preview control panel\n- Property editor for `Uuid` type.\n- Restrict `Reflect` trait on `Debug`.\n- Optional ability to `Copy Value as String` for properties in `Inspector` widget\n- Pass animation signal name to animation event - makes much easier to respond to multiple animation events with the \nsame name\n- Ability to maximize ui windows\n- `Animation::take_events`\n- `Reflect::type_name`\n- Show type name of selected object in the inspector\n- Fixed multiple nodes parenting in the world viewer\n- Apply grid snapping when instantiating a prefab\n- Added range selection for tree widget (Shift + Click)\n- Docking manager now collapses tiles when closing a docked window\n- Improved search bar style in the world viewer\n- Improved breadcrumbs in the world viewer\n- `HotKey` + `KeyBinding` + respective property editors\n- Ability to change editor controls.\n\n# 0.28\n\n- Preview for prefab instantiation.\n- Drag preview nodes are now input-transparent.\n- Expand/collapse trees by double click.\n- Fixed move/rotate/scale gizmo behaviour for mouse events.\n- Fixed fallback to defaults when editor's config is corrupted. \n- Save `Track Selection` option in the editor's config.\n- Clear breadcrumbs when changing scene in the editor.\n- Fixed 1-frame delay issues in the editor. \n- Emit MouseUp message before Drop message.\n- Fixed UI \"flashing\" in the editor in some cases.\n- Do not silently discard UI messages from nodes that were already be deleted.\n- Show node handle in breadcrumbs in the editor.\n- Provide direct read-only access to current dragging context in UI.\n- Fixed crash when trying to select a node by invalid handle in the editor.\n- Highlight invalid handles in the Inspector.\n- Discard \"leftover\" debug geometry when undoing actions in the editor.\n- Some menus in the editor now more intuitive now.\n- Fixed critical bug with incorrect unpack alignment for RGB textures - this causes hard crash in some\ncases.\n- Do not try to reload a resource if it is already loading.\n- Ability to set desired frame rate for `Executor` (default is 60 FPS).\n- Ability to paste editor's clipboard content to selected node (paste-as-child functionality).\n- Ability to render into transparent window while keeping the transparency of untouched pixels (see\n`transparent` example).\n- Ability to specify custom window builder in `Executor` + a way to disable vsync in `Executor`.\n- `MultiBorrowContext` for `Pool` and `Graph::begin_multi_borrow`, helps you to borrow multiple mutable\nreferences to different items.\n- Speed up code generation in proc-macros.\n- Correctly map handles in instances after property inheritance (fixed weird bugs when handles to nodes\nin your scripts mapped to incorrect ones)\n- Refactored script processing:\n  - Added `ScriptTrait::on_start` - it is guaranteed to be called after all scripts in scene are initialized, useful \n  when a script depends on some other script\n  - Script processing is now centralized, not scattered as before.\n  - More deterministic update path (`on_init` -> `on_start` -> `on_update` -> `on_destroy`)\n- Fixed crash when modifying text in a text box via message and then trying to type something.\n- `ButtonBuilder::with_text_and_font` \n- Show node names in for fields of `Handle<Node>` fields of structs in the editor.\n- Fixed crash in the editor when a script has resource field. \n- Ability to clone behaviour trees.\n- Automatic node handle mapping via reflection.\n- Removed `ScriptTrait::remap_handles` method.\n- Pass elapsed time to scripts.\n- Do not call `ScriptTrait::on_os_event` if scene is disabled.\n- Make world viewer filtering case-insensitive.\n- Correctly set self handle and sender for graph's root node.\n- `#[inline]` attributes for \"hot\" methods.\n- Fixed panic when rigid body is a root node of a scene.\n- `Base::has_script` + `Base::try_get_script` + `Base::try_get_script_mut` helper methods, it is now easier\nto fetch scripts on scene nodes.\n- Ability to change selected node type in the editor (useful to change scene root type).\n- Optimized script trait parameter passing, script context now passed by reference instead of value.\n- Script context now have access to all plugins, which makes possible create cross plugin interaction.\n- Removed requirement of scripts api to provide parent plugin's uuid.\n- There is no more need to define uuid for plugins.\n- Do not update scene scripts if it is disabled.\n- `Graph::find_first_by_script` - helps you find a node by its script type.\n- Added missing property editors for `Inspector` widget.\n- Save editor's scene camera settings (position, orientation, zoom, etc.) per scene.\n- Skip-chars list to be able to treat some chars like white space.\n- Optional text shadow effect.\n- Ctrl+Shift+Arrow to select text word-by-word in text box widget.\n- Added navmesh settings to editor's settings panel.\n- Make text box widget to accept text messages + special messages for text box widget.\n- Set 500 ms double click interval (previously it was 750 ms).\n- Fixed text selection in case of custom ui scaling.\n- Fixed `TextBox::screen_pos_to_text_pos` - incorrect usage of `char_code` as index was leading to incorrect screen \nposition to text position mapping.\n- Ability to scroll text in the text box widget.\n- `Rect::with_position` + `Rect::with_size` methods.\n- Fixed caret position when removing text from text box in specific cases.\n- Fixed crash when typing spaces at the end of text box with word wrap.\n- Fixed caret position when adding text to the multiline text box widget.\n- Fixed new line addition in the text box widget.\n- Ability to select words (or whitespace spans) in the text box by double click.\n- Emit double click after mouse down event (not before).\n- Fixed caret blinking in the text box widget for various scenarios.\n- Ctrl+LeftArrow and Ctrl+RightArrow to skip words in the text box widget.\n- Allow setting caret position in the text box widget by clicking outside of line bounds.\n- `raycast2d` example.\n- Fixed text deletion in text box by `Delete` key + selection fixes.\n- Fixed selection by Ctrl+Home, Ctrl+End in the text box widget.\n- Fixed selected text highlighting in the text box widget.\n- Fixed panic when Ctrl+C in a text box when selection is right-to-left.\n- Ability to focus/unfocus a widget by sending a message.\n- Added `TextBox` example.\n- Removed `is_modified` flag from `PropertyInfo`.\n- Ability to revert inherited property to parent's prefab value.\n- Replaced manual property inheritance with reflection.\n- Added `fields` and `fields_mut` for `Reflect` trait.\n- Property inheritance for scripts.\n- Ability to extract selection as a prefab.\n- Fixed tooltips for complex properties in `Inspector` widget.\n- Allow selecting build profile when running a game from the editor.\n- `NodeHandle` wrapper to bypass some limitations of `Inspector` widget.\n- Return result instead of unwrap and panic in `make_relative_path` - fixed some issues with symlinks in the\neditor.\n- Added missing `Reflect` implementation for scripts made in `fyrox-template`.\n- Added dependencies optimization for projects generated in `fyrox-template`.\n- Provided access to some sound engine methods to plugins (`set_sound_gain` and `sound_gain`)\n- Fixed style for ArrayPropertyEditor widget.\n- Do not emit events for disabled animation signals.\n- Sprite sheet animations with signals.\n- Fixed terrain rendering - there's no more seams between layers with skybox content.\n- Ability to set blending equation in draw parameters in the renderer.\n- Ability to set blend function separately for RGB and Alpha in the renderer.\n- Ignore invisible menus when closing menu chain by out-of-bounds click.\n- Make some buttons in the editor smaller and less bright, add more tooltips.\n- Use images for `Expand all`, `Collapse all`, `Locate Selection` buttons in world viewer.\n- Fixed potential infinite loops when performing some math operations.\n- Smoothing for cascaded shadow maps.\n- Fixed script property editor - no more weird bugs in the editor when setting/editing/removing scripts from\na node.\n- Fixed cascaded shadow maps for directional lights.\n- Added `Frustum::center` method.\n- Fixed list of panels in `View` menu in the editor.\n- Create tool tips for interaction modes hidden by default.\n- Reload settings when reconfiguring the editor.\n- Added list of recent scenes to `File` menu in the editor - makes easier to switch between most used scenes.\n- Ability to add, remove, set items for `MenuItem` widget\n- Correctly highlight selected interaction mode button\n- More hotkeys for the editor \n  - `[5]` - activate navmesh edit mode\n  - `[6]` - activate terrain edit mode\n- Ability to set `Selected` flag to `Decorator` widget on build stage\n- Added `Invert drag` option for camera settings in the editor.\n- Fixed incorrect rendering of `Luminance` and `LuminanceAlpha` textures.\n- Fixed closing menus by clicking outside them.\n- Direct access to all fields in all widgets.\n- Force `TextBox` widget to consume all input messages, this fixes hot keys triggering in the editor while\ntyping something in text fields.\n\n# 0.27.1\n\n- Fixed `Operation failed! Reason: Modify { value: dyn Reflect }` error.\n- Fixed inability to edit properties of 2d collider shape\n- Fixed inability to edit some properties of Joint2D.\n- Added property editor for `Color Grading Lut` property of the Camera node.\n- Fixed panic when editing cascades properties of directional light.\n- Prevent panic when there's invalid bone handle.\n- Hide `data` field from inspector for Surface, because it has no proper property editor.\n- Fixed terrain layer deletion from the Inspector.\n\n# 0.27\n\n- Added compile-time reflection (huge thanks to [@toyboot4e](https://github.com/toyboot4e))\n- Most editor commands were removed and replaced by universal command based on reflection. \n- Backward compatibility for native engine data formats was dropped - use FyroxEd 0.13 to convert your scenes to newer\nversion.\n- Fixed panic when loading an FBX model with malformed animation curves (when there is only 1 or 2 components animated\ninstead of 3, X and Y, but not Z for example).\n- ABSM editor now have smaller default size and fits on small screens.\n- Asset previewer now plays model animations\n- Fixed critical FBX importer bug, that caused malformed animations.\n- Ability to define \"playable\" time slice for animations.\n- Fixed editor update rate, previously it was very high and that caused some weird issues.\n- Proper support for all resource types in Inspector\n- Show ABSM resources in the asset browser\n- Ability to edit sound import options in the asset browser\n- Dynamic type casting for script instances\n- Provide access to parameters in ABSM\n- Fixed transition instantiation in ABSM - it incorrectly handled \"invert rule\" flag.\n- Prevent panic when deleting a node from script methods.\n- Dynamic type casting for plugin instances\n- Two-step ABSM instantiation - at first step you load all animations in parallel (async) and on second step you\ncreate actual ABSM instance.\n- Wait for all resources to load before initialize scripts - this prevents panicking when trying to access\nnot yet loaded resource in script methods.\n- Default instantiation scaling options for 3D models - allows you to scale 3D models automatically on instantiation.\n- Graph event broadcaster - allows you to receive `Added` and `Removed` events for nodes.\n- Correctly initialize scripts of nodes that created at runtime.\n- Component provider for scripts - allows you to provide access to inner script components via unified interface.\n- Disable automatic texture compression - having compression enabled for all kinds of textures is not good, because\nthere could be some textures with gradients, and they'll have significant distortion.\n- `Pool::drain` - allows you to remove all objects from a pool while processing every object via closure.\n- `Script::on_deinit` - allows you to execute any code for cleanup.\n- Added `NodeHandleMap` - a small wrapper over map that have some methods that makes node handle mapping much \nshorter.\n- Correctly handle missing properties in Inspector for various objects.\n- Provide access to main application window from plugins.\n- Allow chaining `ScriptConstructorContainer::add` calls\n- Removed `screen_size` parameter from `UserInterface::new`\n- Ability to remove render passes.\n- Run the game in a separate process from the editor.\n- Provide access to default engine's user interface instance for plugins.\n- `--override-scene` parameter for Executor\n- `ButtonContent` improvements - it is now possible to re-create button's text field using `ButtonMessage::Content`\n- Provide access to control flow switch for plugins.\n- `Plugin::on_ui_message`\n- Two-step plugins initialization:\n  - `PluginConstructor` trait defines a method that creates an instance of `Plugin` trait, instance of plugin\n    constructor is used to create plugins on demand. It is needed because engine has deferred plugin initialization.\n- `Framework` is removed, its functionality was merged with plugins.\n- Simplified `ScriptConstructorContainer::add` definition, there were redundant generic parameters that just add\nvisual clutter.\n- Implemented `Clone+Debug` traits for `NavmeshAgent`\n- Fixed spam in log in the editor when any file was changed.\n- High DPI screens support for the editor.\n- Newly created cameras in the editor are now enabled by default.\n- Added \"Preview\" option for cameras in world viewer.\n- Refactored joints:\n  - Joints binding now is fully automatic and it is based on world transform of the joint, no need to manually\n    set local frames.\n  - Rebinding happens when a joint changes its position\n  - Joints editing in the editor is now much more intuitive\n- Improved debug visualization for physics.\n- Read-only mode for NumericUpDown and Vec2/Vec3/Vec4 widgets\n- Show global coordinates of current selection in the scene previewer\n- BitField widget - it helps you to edit numbers as bit containers, allowing you to switch separate bits\n- More compact editors for properties in Inspector\n- NumericUpDown widget does not use word wrapping by default anymore\n- CheckBox widget can now be switched only by left mouse button\n- Ability to disable contacts between connected bodies of a joint\n- `style` parameter for project template generator - it defines which scene will be used by default - either `2d` \nor `3d`\n- Ability to select portion of the texture to render in `Rectangle` nodes.\n- Ability to generate script skeleton for template generator\n- HSL color model\n- Ability to copy log enties to the clipboard\n- `Log` API improvements\n- Visualize cameras in the editor\n- Context menu for asset items, it is now possible to open, delete, show-in-explorer items and also\nto copy file name and full file path to the clipboard.\n- Visualize point and spot lights in the editor.\n\n# 0.26\n\nThis release is mostly to fix critical bugs of 0.25 and add missing functionality that stops you from using scripting\nsystem.\n\n- Added project template generator\n- Fixed invisible selected item in drop-down list widget.\n- Correctly sync node names in `World Viewer`\n- Reset editor's camera projection mode switch when creating new scene\n- Fixed doubling scene entities in `World Viewer` when loading scene via `StartupData`\n- More logging for renderer\n- Fixed shader cache - now the engine won't re-compile shaders each 20 seconds.\n- Temporarily disable `Lifetime` property editing because it causes crashes\n- Do not show `dirty` flag of `Transform` in the `Inspector`\n- Provide access to property editors container for editor's `Inspector` - it is now possible\nto register your own property editors\n- Fixed panic when syncing `Inspector` for an entity with `Option<Texture>` field.\n- Added `handle_object_property_changed` and `handle_collection_property_changed` macros to reduce \nboilerplate code in script property handling.\n- Added ability to restore resource handles for scripts\n- Fixed selection visualization in `Asset Browser`\n- Validation for sky box cube map generator\n\n## Migration guide\n\nThere are no breaking changes in this release.\n\n# 0.25\n\n- Static plugin system\n- User-defined scripts\n- Play mode for the editor\n- Animation Blending State Machine (ABSM) editor.\n- Some of sound entities were integrated in the scene graph.\n- New `Sound` and `Listener` scene nodes.\n- Sound buffer import options.\n- `ResourceManager::request_sound_buffer` now accepts only path to sound buffer.\n- Prefab inheritance improvements - now most of the properties of scene nodes are inheritable.\n- Access to simulation properties of the physics.\n- Engine and Resource manager are nonserializable anymore, check migration guide to find how to create\nsave files in the correct way.\n- `Node` enumeration was removed and replaced with dynamic dispatch. This allows you to define your own \ntypes of scene nodes.\n- `Base` is not a scene node anymore, it was replaced with `Pivot` node (see migration guide for more info)\n- `Base` now has `cast_shadows` property, respective property setters/getters was removed from `Mesh` and \n`Terrain` nodes.\n- Ability to bring ListView item into view.\n- Logger improvements: event subscriptions + collecting timestamps\n- Log panel improvements in the editor: severity filtering, color differentiation.\n- Scene nodes now have more or less correct local bounds (a bounding box that can fit the node).\n- Improved picking in the editor: now it is using precise hit test against node's geometry.\n- \"Ignore back faces\" option for picking in the editor: allows you to pick through \"back\" of polygon\nfaces, especially useful for closed environment.\n- Rotation ribbons were replaced with torus, it is much easier to select desired rotation mode.\n- New material for gizmos in the editor, that prevent depth issues.\n- New expander for TreeView widget, `V` and `>` arrows instead of `+` and `-` signs.\n- ScrollBar widget is much thinner by default.\n- Editor settings window now based on Inspector widget, which provides uniform way of data visualization.\n- `DEFAULT_FONT` singleton was removed, it is replaced with `default_font`\n- Shortcuts improvements in the editor.\n- Overall UI performance improvements.\n- Ability to disable clipping of widget bounds to parent bounds.\n- Layout and render transform support for widgets - allows you to scale/rotate/translate widgets.\n- Ability to make widget lowermost in hierarchy.\n- Animation blending state machine refactoring, optimizations and stability improvements.\n- Animation blending state machines are now stored in special container which stored in the Scene.\n- Docking manager now shows anchors only for its windows.\n- Model previewer now has much more intuitive controls.\n- NumericUpDown don't panic anymore on edges of numeric bounds (i.e when trying to do `i32::MAX_VALUE + 1`)\n- DoubleClick support for UI.\n- Update rate fix for editor, it fixes annoying issue with flickering in text boxes.\n- `UserInterface::hit_test_unrestricted` which performs hit test that is not restricted to current \npicking restriction stack.\n- WASM renderer fixes.\n- `Pool::try_free` which returns `Option<T>` on invalid handles, instead of panicking.\n- Light source for model previewer\n- Default skybox for editor and model previewer cameras\n- `Color` API improvements.\n- `#[reflect(expand)]` and `#[reflect(expand_subtree)]` were removed from `Inspect` proc-macro\n- Correct field name generation for enum variants\n- Ability to draw Bzier curves in the UI.\n- Fix for navmesh agent navigation of multilayer navigational meshes.\n- Improvements for serializer, now it allows you correctly recover from serialization errors.\n\n## Migration guide\n\n**WARNING:** This release **does not** provide legacy sound system conversion to new one, which means if \nany of your scene had any sound, they will be lost!\n\nNow there is limited access to `fyrox_sound` entities, there is no way to create sound contexts, sounds, \neffects manually. You have to use respective scene nodes (`Sound`, `Listener`) and `Effect` from \n`fyrox::scene::sound` module (and children modules). \n\n### Nodes\n\nSince `Node` enumeration was removed, there is a new way of managing nodes:\n\n- `Node` now is just `Box<dyn NodeTrait>` wrapped in a new-type-struct.\n- Pattern matching was replaced with `cast` and `cast_mut` methods.\n- In addition to `cast/cast_mut` there are two more complex methods for polymorphism: `query_component_ref` and\n`query_component_mut` which are able to extract references to internal parts of the nodes. This now has only one\nusage - `Light` enumeration was removed and `PointLight`, `SpotLight`, `DirectionalLight` provides unified access\nto `BaseLight` component via `query_component_ref/query_component_mut`. `query_component` could be a bit slower,\nsince it might involve additional branching while attempting to query component. \n- `Base` node was replaced with `Pivot` node (and respective `PivotBuilder`), it happend due to problems with \n`Deref<Target = Base>/DerefMut` implementation, if `Base` is implementing `NodeTrait` then it must implement `Deref`\nbut implementing `Deref` for `Base` causes infinite deref coercion loop.\n- To be able to create custom scene nodes and having the ability to serialize/deserialize scene graph with such\nnodes, `NodeConstructorContainer` was added. It contains a simple map `UUID -> NodeConstructor` which allows to\npick the right node constructor based on type uuid at deserialization stage.\n\n#### Replacing `BaseBuilder` with `PivotBuilder`\n\nIt is very simply, just wrap `BaseBuilder` with a `PivotBuilder` and call `build` on `PivotBuilder` instance:\n\n```rust\n// Before\nfn create_pivot_node(graph: &mut Graph) -> Handle<Node> {\n    BaseBuilder::new().build(graph)    \n}\n\n// After\nfn create_pivot_node(graph: &mut Graph) -> Handle<Node> {\n    PivotBuilder::new(BaseBuilder::new()).build(graph)\n}\n```\n\n#### Pattern matching replacement\n\nPattern matching was replaced with 4 new methods `cast/cast_mut/query_component_ref/query_component_mut`:\n\n```rust\nfn set_sprite_color(node: &mut Node, color: Color) {\n    // Use `cast_mut` when you are sure about the real node type.\n    if let Some(sprite) = node.cast_mut::<Sprite>() {\n        sprite.set_color(color);\n    }\n}\n\nfn set_light_color(node: &mut Node, color: Color) {\n    // Use query_component_mut if you unsure what is the exact type of the node.\n    // In this example the `node` could be either PointLight, SpotLight, DirectionalLight,\n    // since they're all provide access to `BaseLight` via `query_component_x` the function\n    // will work with any of those types.\n    if let Some(base_light) = node.query_component_mut::<BaseLight>() {\n        base_light.set_color(color);\n    }\n}\n```\n\n### Listener\n\nNow there is no need to manually sync position and orientation of the sound listener, all you need to do\ninstead is to create `Listener` node and attach it to your primary camera (or other scene node). Keep\nin mind that the engine supports only one listener, which means that only one listener can be active \nat a time. The engine will not stop you from having multiple listeners active, however only first (the \norder is undefined) will be used to output sound.\n\n### Sound sources\n\nThere is no more 2D/3D separation between sounds, all sounds in 3D by default. Every sound source now is\na scene node and can be created like so:\n\n```rust\nlet sound = SoundBuilder::new(\n    BaseBuilder::new().with_local_transform(\n        TransformBuilder::new()\n            .with_local_position(position)\n            .build(),\n    ),\n)\n.with_buffer(buffer.into())\n.with_status(Status::Playing)\n.with_play_once(true)\n.with_gain(gain)\n.with_radius(radius)\n.with_rolloff_factor(rolloff_factor)\n.build(graph);\n```\n\nIts API mimics `fyrox_sound` API so there should be now troubles in migration.\n\n### Effects\n\nEffects got a thin wrapper around `fyrox_sound` to make them compatible with `Sound` scene nodes, a reverb\neffect instance can be created like so:\n\n```rust\nlet reverb = ReverbEffectBuilder::new(BaseEffectBuilder::new().with_gain(0.7))\n    .with_wet(0.5)\n    .with_dry(0.5)\n    .with_decay_time(3.0)\n    .build(&mut scene.graph.sound_context);\n```\n\nA sound source can be attached to an effect like so:\n\n```rust\ngraph\n    .sound_context\n    .effect_mut(self.reverb)\n    .inputs_mut()\n    .push(EffectInput {\n        sound,\n        filter: None,\n    });\n```\n\n### Filters\n\nEffect input filters API remain unchanged.\n\n### Engine initialization\n\n`Engine::new` signature has changed to accept `EngineInitParams`, all previous argument were moved to the \nstructure. However, there are some new engine initialization parameters, like `serialization_context` and\n`resource_manager`. Previously `resource_manager` was created implicitly, currently it has to be created\noutside and passed to `EngineInitParams`. This is because of new `SerializationContext` which contains\na set of constructors for various types that may be used in the engine and be added by external plugins.\nTypical engine initialization could look something like this:\n\n```rust\nuse fyrox::engine::{Engine, EngineInitParams};\nuse fyrox::window::WindowBuilder;\nuse fyrox::engine::resource_manager::ResourceManager;\nuse fyrox::event_loop::EventLoop;\nuse std::sync::Arc;\nuse fyrox::engine::SerializationContext;\n\nfn init_engine() {\n    let evt = EventLoop::new();\n    let window_builder = WindowBuilder::new()\n        .with_title(\"Test\")\n        .with_fullscreen(None);\n    let serialization_context = Arc::new(SerializationContext::new());\n    let mut engine = Engine::new(EngineInitParams {\n        window_builder,\n        resource_manager: ResourceManager::new(serialization_context.clone()),\n        serialization_context,\n        events_loop: &evt,\n        vsync: false,\n    })\n    .unwrap();\n}\n```\n\n## Serialization\n\nEngine and ResourceManager both are non-serializable anymore. It changes approach of creating save files in games.\nPreviously you used something like this (following code snippets are modified versions of `save_load` example):\n\n```rust\nconst SAVE_FILE: &str = \"save.bin\";\n\nfn save(game: &mut Game) {\n    let mut visitor = Visitor::new();\n\n    game.engine.visit(\"Engine\", visitor)?; // This no longer works\n    game.game_scene.visit(\"GameScene\", visitor)?;\n    \n    visitor.save_binary(Path::new(SAVE_FILE)).unwrap();\n}\n\nfn load(game: &mut Game) {\n    if Path::new(SAVE_FILE).exists() {\n        if let Some(game_scene) = game.game_scene.take() {\n            game.engine.scenes.remove(game_scene.scene);\n        }\n\n        let mut visitor = block_on(Visitor::load_binary(SAVE_FILE)).unwrap();\n\n        game.engine.visit(\"Engine\", visitor)?; // This no longer works\n        game.game_scene.visit(\"GameScene\", visitor)?;\n    }\n}\n```\n\nHowever, on practice this approach could lead to some undesirable side effects. The main problem with the old \napproach is that when you serialize the engine, it serializes all scenes you have. This fact is more or less\nok if you have only one scene, but if you have two and more scenes (for example one for menu and one for \ngame level) it writes/reads redundant data. The second problem is that you cannot load saved games asynchronously\nusing the old approach, because it takes mutable access of the engine and prevents you from off-threading work.\n\nThe new approach is much more flexible and do not have such issues, instead of saving the entire state of the\nengine, you just save and load only what you actually need:\n\n```rust\nconst SAVE_FILE: &str = \"save.bin\";\n\nfn save(game: &mut Game) {\n    if let Some(game_scene) = game.game_scene.as_mut() {\n        let mut visitor = Visitor::new();\n\n        // Serialize game scene first.\n        game.engine.scenes[game_scene.scene]\n            .save(\"Scene\", &mut visitor)\n            .unwrap();\n        // Then serialize the game scene.\n        game_scene.visit(\"GameScene\", &mut visitor).unwrap();\n\n        // And call save method to write everything to disk.\n        visitor.save_binary(Path::new(SAVE_FILE)).unwrap();\n    }\n}\n\n// Notice that load is now async.\nasync fn load(game: &mut Game) {\n    // Try to load saved game.\n    if Path::new(SAVE_FILE).exists() {\n        // Remove current scene first.\n        if let Some(game_scene) = game.game_scene.take() {\n            game.engine.scenes.remove(game_scene.scene);\n        }\n\n        let mut visitor = Visitor::load_binary(SAVE_FILE).await.unwrap();\n\n        let scene = SceneLoader::load(\"Scene\", &mut visitor)\n            .unwrap()\n            .finish(game.engine.resource_manager.clone())\n            .await;\n\n        let mut game_scene = GameScene::default();\n        game_scene.visit(\"GameScene\", &mut visitor).unwrap();\n\n        game_scene.scene = game.engine.scenes.add(scene);\n        game.game_scene = Some(game_scene);\n    }\n}\n```\n\nAs you can see in the new approach you save your scene and some level data, and on load - you load the scene, add\nit to the engine as usual and load level's data. The new approach is a bit more verbose, but it is much more \nflexible.\n\n# 0.24\n\n## Engine\n\n- 2D games support (with 2D physics as well)\n- Three new scene nodes was added: RigidBody, Collider, Joint. Since rigid body, collider and joint are graph nodes\nnow, it is possible to have complex hierarchies built with them.  \n- It is possible to attach rigid body to any node in scene graph, its position now will be correct in this case (\npreviously it was possible to have rigid bodies attached only on root scene nodes).\n- New `Inspector` widget + tons of built-in property editors (with the ability to add custom editors)\n- `Inspect` trait + proc macro for lightweight reflection\n- UI now using dynamic dispatch allowing you to add custom nodes and messages easily\n- fyrox-sound optimizations (30% faster)\n- Linear interpolation for sound samples when sampling rate != 1.0 (much better quality than before)\n- Color fields in material editor now editable\n- Window client area is now correctly filled by the renderer on every OS, not just Windows.\n- NumericRange removal (replaced with standard Range + extension trait)\n- Sort files and directories in FileBrowser/FileSelector widgets\n- RawStreaming data source for sound\n- Renderer performance improvements (2.5x times faster)\n- UI layout performance improvements\n- Prevent renderer from eating gigabytes of RAM\n- Use `#[inline]` attribute to enable cross-crate inlining\n- `ImmutableString` for faster hashing of static strings\n- `SparseBuffer` as a lightweight analog for `Pool` (non-generational version)\n- Support diffuse color in FBX materials\n- Frustum culling fixes for terrain\n- Shaders don't print empty lines when compiles successfully.\n- `Pool` improvements\n- Impl `IntoIterator` for references to `Pool`\n- Cascaded shadow maps for directional light sources\n- `spawn_at` + `spawn_at_handle` for `Pool`\n- Preview for drag'n'drop\n- `Grid` widget layout performance optimizations (**1000x** performance improvement - this is not a typo)\n- `query_component` for UI widgets\n- Curve resource\n- Remove all associated widgets of a widget when deleting the widget (do not leave dangling objects)\n- World bounding box calculation fix\n- Heavy usage of invalidation in UI routines (prevents checking tons of widgets every frame)\n- Migrate to `parking-lot` synchronization primitives\n- Migrate to `FxHash` (faster hashing)\n- `Log::verify` to log errors of `Result<(), Error`\n- Custom scene node properties support\n- `Alt+Click` prevents selection in `Tree` widget\n- Ability to change camera projection (Perspective or Orthographic) \n- Smart position selection for popups (prevents them from appearing outside screen bounds)\n- High-quality mip-map generation using Lanczos filter.\n\n## Editor\n\n- `Inspector` widget integration, which allowed to remove tons of boilerplate code\n- Middle mouse button camera dragging\n- Q/E + Space to move camera up/down\n- Working directory message is much less confusing now\n- Ability to edit sound sources in the editor\n- Checkerboard colorization fix in the world viewer\n- Search in the world viewer\n- Floating brush panel for terrain editor\n- Editor camera has manual exposure (not affected by auto-exposure)\n- Curve editor\n- Automatically select an newly created instance of a scene node\n- Grid snapping fix\n- Angle snapping\n- Edit properties of multiple selected objects at once.\n- Context menu for scene items in world viewer\n- `Create child` for scene item context menu\n- Import options editor for asset browser\n- Hot reload for textures.\n\n## Breaking changes and migration guide\n\nThere are lots of breaking changes in this version, however all of them mostly related to the code and scenes made in\nprevious version _should_ still be loadable.\n\n### Convert old scenes to new format\n\nAt first, install the rusty-editor from crates.io and run it:\n\n```shell\ncargo install rusty-editor\nrusty-editor\n```\n\nAnd then just re-save your scenes one-by-one. After this all your scenes will be converted to the newest version.\nKeep in mind that the editor from GitHub repo (0.25+) is not longer have backward compatibility/conversion code!\n\n### 2D scenes\n\n2D scene were completely removed and almost every 2D node were removed, there is only one \"2D\" node left - Rectangle.\n2D now implemented in 3D scenes, you have to use orthographic camera for that. There is no migration guide for 2D scenes\nbecause 2D had rudimentary support, and I highly doubt that there is any project that uses 2D of the engine.\n\n## Resource management\n\nResource manager has changed its API and gained some useful features that should save you some time. \n\n`request_texture` now accepts only one argument - path to texture, second argument was used to pass \n`TextureImportOptions`. Import options now should be located in a separate options file. For example, you have a \n`foo.jpg` texture and you want to change its import options (compression, wrapping modes, mip maps, etc.). To do this\nyou should create `foo.jpg.options` file in the same directory near your file with following content (each field is\noptional):\n\n```text\n(\n    minification_filter: LinearMipMapLinear,\n    magnification_filter: Linear,\n    s_wrap_mode: Repeat,\n    t_wrap_mode: Repeat,\n    anisotropy: 16,\n    compression: NoCompression,\n)\n```\n\nThe engine will read this file when you'll call `request_texture` and it will apply the options on the first load.\nThis file is not mandatory, you can always set global import defaults in resource manage by calling \n`set_texture_import_options`.\n\n`request_model` have the same changes, there is only one argument and import options were moved to options file:\n\n```text\n(\n    material_search_options: RecursiveUp\n)\n```\n\nAgain, all fields aren't mandatory and the entire file can be omitted, global import defaults can be set by calling\n`set_model_import_options`.\n\n### Physics\n\nOld physics was replaced with new scene nodes: RigidBody, Collider, Joint. Old scenes will be automatically converted\non load, you should convert your scenes as soon as possible using the editor (open your scene and save it, that will\ndo the conversion).\n\nNow there are two ways of adding a rigid body to a scene node:\n\n- If you want your object to have a rigid body (for example a crate with box rigid body), your object must be \n**child** object of a rigid body. Graphically it can be represented like this:\n\n```text\n- Rigid Body\n  - Crate3DModel\n  - Cuboid Collider     \n```\n\n- If you want your object to have a rigid body that should move together with your object (to simulate hit boxes for \nexample), then rigid body must be child object of your object. Additionally it should be marked as `Kinematic`, \notherwise it will be affected by simulation (simply speaking it will fall on ground). Graphically it can be \nrepresented like this:\n\n```text\n- Limb\n  - Rigid Body\n     - Capsule Collider\n```\n\n#### Migration\n\nThis section will help you to migrate to new physics.\n\n##### Rigid bodies\n\nRigid body and colliders now can be created like so:\n\n```rust\nuse fyrox_impl::{\n    core::{algebra::Vector3, pool::Handle},\n    scene::{\n        base::BaseBuilder,\n        collider::{ColliderBuilder, ColliderShape},\n        node::Node,\n        rigidbody::RigidBodyBuilder,\n        transform::TransformBuilder,\n        Scene,\n    },\n};\n\nfn create_capsule_rigid_body(scene: &mut Scene) -> Handle<Node> {\n    RigidBodyBuilder::new(\n        BaseBuilder::new()\n            .with_local_transform(\n                // To position, rotate rigid body you should use engine's transform.\n                TransformBuilder::new()\n                    .with_local_position(Vector3::new(1.0, 2.0, 3.0))\n                    .build(),\n            )\n            .with_children(&[\n                // It is very important to add at least one child collider node, otherwise rigid\n                // body will not do collision response.\n                ColliderBuilder::new(\n                    BaseBuilder::new().with_local_transform(\n                        // Colliders can have relative position to their parent rigid bodies.\n                        TransformBuilder::new()\n                            .with_local_position(Vector3::new(0.0, 0.5, 0.0))\n                            .build(),\n                    ),\n                )\n                // Rest of properties can be set almost as before.\n                .with_friction(0.2)\n                .with_restitution(0.1)\n                .with_shape(ColliderShape::capsule_y(0.5, 0.2))\n                .build(&mut scene.graph),\n            ]),\n    )\n    // Rest of properties can be set almost as before.\n    .with_mass(2.0)\n    .with_ang_damping(0.1)\n    .with_lin_vel(Vector3::new(2.0, 1.0, 3.0))\n    .with_ang_vel(Vector3::new(0.1, 0.1, 0.1))\n    .build(&mut scene.graph)\n}\n```\n\n##### Joints\n\nJoints can be created in a similar way:\n\n```rust\nfn create_ball_joint(scene: &mut Scene) -> Handle<Node> {\n    JointBuilder::new(BaseBuilder::new())\n        .with_params(JointParams::BallJoint(BallJoint {\n            local_anchor1: Vector3::new(1.0, 0.0, 0.0),\n            local_anchor2: Vector3::new(-1.0, 0.0, 0.0),\n            limits_local_axis1: Vector3::new(1.0, 0.0, 0.0),\n            limits_local_axis2: Vector3::new(1.0, 0.0, 0.0),\n            limits_enabled: true,\n            limits_angle: 45.0,\n        }))\n        .with_body1(create_capsule_rigid_body(scene))\n        .with_body2(create_capsule_rigid_body(scene))\n        .build(&mut scene.graph)\n}\n```\n\n##### Raycasting\n\nRaycasting located in `scene.graph.physics`, there were almost no changes to it, except now it returns handles to\nscene nodes instead of raw collider handles.\n\n##### Contact info\n\nContact info can now be queried from the collider node itself, via `contacts()` method.\n\n```rust\nfn query_contacts(collider: Handle<Node>, graph: &Graph) -> impl Iterator<Item = ContactPair> {\n    graph[collider].as_collider().contacts(&graph.physics)\n}\n```"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.0029296875,
          "content": "# Contributors guidelines\n\nThis document explains how to contribute to the engine. Keep in mind, that this not a \"must-obey\" list; use common sense\nwhen contributing something to the engine.\n\n## How to contribute\n\n- **Code** - writing code is the most obvious way of contribution. You can add missing features, fix bugs, improve\n  existing tools, etc. See the [code section](#contributing-code) for more info.\n- **Documentation** - documentation is the next place where you can contribute, this engine is already quite big and\n  there's a bunch of undocumented code. If you're familiar with some undocumented API, don't hesitate - write\n  documentation for it. You will save a lot of time for the next people who will be using this API and they will be\n  grateful that the docs exists.\n  See the [documentation section](#contributing-documentation) for more info.\n- **Make games** - the best way to understand what's missing or needs to be improved is by making games using the\n  engine. When you find something missing or can be improved, don't hesitate - create an issue in this repository and\n  may be somebody will spot this issue and fix it. Filing issues is always good, it clearly shows that there's something\n  wrong and people can track the progress.\n- **Report bugs** - if something does not work as it should, file an issue about it so the problem will be clear. Any\n  software has edge cases, that could be hidden for a long time, until you need to do something non-trivial.\n- **Donation** - if you don't have any time to write the code or docs, and you want to see the project alive, you should\n  consider donating any amount of money to the developers of the engine.\n- **Promote the engine** - write posts, make videos, share news about the engine on social media and so on.\n\n## Contributing code\n\nCommon rules for code contributions:\n\n- **Keep code clean** - name your variables and functions meaningfully. Try to not create god-like functions, that\n  handles everything at once. Always compile your code before making a pull request.\n- **Write documentation** - document your code. It should explain what the code does at high level. Do not include low\n  level details in your documentation (unless you need to explain something, that is very important).\n- **Format your code** - use `rustfmt` to format the code you're writing.\n- **Write unit tests** - if you're adding new functionality to the engine, make sure to write unit tests for it. It is\n  not always possible to write meaningful unit tests, for example, graphics can hardly be tested this way. In this case\n  make sure to thoroughly test your code manually.\n- **Describe your code** - it is important to explain why you wrote the code and what it does. Do not create pull\n  requests with description like: \"fixed bug\", \"added stuff\", etc. It does not help anyone, instead write a proper\n  description.\n- **License** - include the content of `LICENSE.md` file at the top of any new source code file. Every line must be\n  start from `\\\\ ` (two slashes with a space after them). You can add your own copyright line with dates, but you must\n  keep the license unchanged (MIT).\n\nWhen you're writing something for the editor, you can run its standalone version using `fyroxed` package like so\n`cargo run --packaged fyroxed`. This way the editor will run without any plugins, and you can test your changes quickly\nwithout a need to create a project and test there.\n\n## Contributing documentation\n\nCommon rules for documentation contributions:\n\n- **Write everything in English** - official API documentation and [the book](https://fyrox-book.github.io/) written in\n  English. If you want to create a translation for the book, you should create your own repository.\n- **Add code examples** - code snippets helps other developers to quickly understand how to use a function/method.\n- **Use spell checker** - keep the docs clean and readable.\n- **Expertise** - make sure that you understand the thing you're writing the docs for. Shallow docs are usually\n  misleading, and sometimes they're even worse, than no documentation at all. "
        },
        {
          "name": "Cargo.toml",
          "type": "blob",
          "size": 0.6943359375,
          "content": "[workspace]\nmembers = [\n    \"fyrox-core-derive\",\n    \"fyrox-core\",\n    \"fyrox-sound\",\n    \"fyrox-ui\",\n    \"fyrox-resource\",\n    \"fyrox-scripts\",\n    \"fyrox-animation\",\n    \"editor\",\n    \"editor-standalone\",\n    \"template-core\",\n    \"template\",\n    \"fyrox-graph\",\n    \"fyrox-math\",\n    \"fyrox-dylib\",\n    \"fyrox\",\n    \"fyrox-impl\",\n    \"project-manager\",\n    \"fyrox-graphics\",\n    \"fyrox-build-tools\"\n, \"fyrox-texture\"]\nresolver = \"2\"\n\n[profile.dev]\nopt-level = 0\n\n[profile.release]\nopt-level = 3\ndebug = true\n\n[profile.project-manager]\ninherits = \"release\"\nopt-level = \"z\"\ndebug = false\nstrip = true\npanic = \"abort\"\nlto = true\n\n[profile.github-ci]\ninherits = \"dev\"\nstrip = \"symbols\"\ndebug = false\nopt-level = 3\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.072265625,
          "content": "Copyright (c) 2019-present Dmitry Stepanov and Fyrox Engine contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0888671875,
          "content": "<div align=\"center\">\n  <a href=\"https://fyrox.rs/\">\n    <img src=\"pics/logo.png\" width=\"128\" height=\"128\" alt=\"Fyrox\" />\n  </a>\n  <h1>Fyrox - a modern Rust game engine</h1>\n</div>\n\n[![License (MIT)](https://img.shields.io/crates/l/fyrox)](https://github.com/FyroxEngine/Fyrox/blob/master/LICENSE.md)\n[![CI Status](https://github.com/FyroxEngine/Fyrox/actions/workflows/ci.yml/badge.svg)](https://github.com/FyroxEngine/Fyrox/actions/workflows/ci.yml)\n[![Dependency status](https://deps.rs/repo/github/FyroxEngine/Fyrox/status.svg)](https://deps.rs/repo/github/FyroxEngine/Fyrox)\n[![Crates.io](https://img.shields.io/crates/v/fyrox)](https://crates.io/crates/fyrox)\n[![docs.rs](https://img.shields.io/badge/docs-website-blue)](https://docs.rs/Fyrox/)\n[![Discord](https://img.shields.io/discord/756573453561102427)](https://discord.gg/xENF5Uh)\n[![Lines of code](https://tokei.rs/b1/github/FyroxEngine/Fyrox)](https://github.com/FyroxEngine/Fyrox)\n\nA feature-rich, production-ready, general purpose 2D/3D game engine written in Rust with a scene editor.\n_Formerly known as rg3d_\n\n## [Learning materials](https://fyrox-book.github.io/)\n\n[Read the official Fyrox book here.](https://fyrox-book.github.io/) It contains comprehensive information about many aspects of the engine, starting\nby \"how to build\" and ending by various tutorials.\n\n## Community\n\nYou can always ask your question in Discord server - [Join the Discord server](https://discord.gg/xENF5Uh), or directly in \n[Discussions](https://github.com/FyroxEngine/Fyrox/discussions).\n\n## Examples\n\nYou can run examples directly in your web browser, the full list of demo projects is [available here](https://fyrox.rs/examples.html).\nSource code for each demo project [can be found here](https://github.com/FyroxEngine/Fyrox-demo-projects).\n\n## Support\n\nIf you want to support the development of the project, click the link below. Preferrable way is to use [Boosty](https://boosty.to/fyrox) - this way the money\nwill be available for the development immediately. Alternatively you can can use [Patreon](https://www.patreon.com/mrdimas), but in this case the money will\nbe on-hold for unknown period of time ([details are here](https://github.com/FyroxEngine/Fyrox/issues/363)).\n\n## Contributing\n\nContributions are very welcome! See the [contributions guidelines](CONTRIBUTING.md) for more info. Check the [good first issue](https://github.com/FyroxEngine/Fyrox/issues?q=is%3Aissue+is%3Aopen+label%3A%22good+first+issue%22) label to \nsee where you can help.\n\n## Sponsors\n\nThe engine is supported by very generous people, their donations provides sustainable development of the engine:\n\n[Brandon Thomas](https://www.patreon.com/user?u=34951681) | [Taylor C. Richberger](https://www.patreon.com/user/creators?u=60141723) | [Avery Wagar](https://www.patreon.com/user?u=41863848) |\n[George Atkinson](https://www.patreon.com/user?u=61771027) | [Erlend Sogge Heggen](https://www.patreon.com/amethystengine/creators) | [Mitch Skinner](https://www.patreon.com/user/creators?u=60141723) | [ozkriff](https://www.patreon.com/ozkriff) | [Taylor Gerpheide](https://www.patreon.com/user/creators?u=32274918) |\n[zrkn](https://www.patreon.com/user/creators?u=23413376) | [Aleks Row](https://www.patreon.com/user/creators?u=51907853) | [Edward L](https://www.patreon.com/user/creators?u=53507198) | [L.apz](https://www.patreon.com/user/creators?u=5448832) | [Luke Jones](https://www.patreon.com/flukejones) | [toyboot4e](https://www.patreon.com/user/creators?u=53758973) | [Vish Vadlamani](https://www.patreon.com/user/creators?u=42768509) |\n[Alexey Kuznetsov](https://www.patreon.com/user?u=39375025) | [Daniel Simon](https://www.patreon.com/user/creators?u=43754885) | [Jesper Nordenberg](https://www.patreon.com/jesnor) | [Kornel](https://www.patreon.com/user?u=59867) | [Parham Gholami](https://www.patreon.com/user?u=33009238) | [Yuki Ishii](https://www.patreon.com/user/creators?u=9564103) |\n[Joseph Catrambone](https://www.patreon.com/user?u=4738580) | [MGlolenstine](https://github.com/MGlolenstine) | [zamar lomax](https://www.patreon.com/user?u=65928523) | [Gheorghe Ugrik](https://www.patreon.com/user?u=54846813) |\n[Anton Zelenin](https://www.patreon.com/user?u=62378966) | [Barugon](https://www.patreon.com/user?u=11344465) | [Tom Leys](https://www.patreon.com/user?u=222856) | [Jay Sistar](https://www.patreon.com/user?u=284041) | [tc](https://www.patreon.com/user?u=11268466) | [false](https://www.patreon.com/user?u=713537) | [BlueSkye](https://www.patreon.com/EmotionalSnow) |\n[Ben Anderson](https://www.patreon.com/user/creators?u=14436239) | [Thomas](https://www.patreon.com/user?u=317826) | [Iulian Radu](https://www.patreon.com/user?u=8698230) | [Vitaliy (ArcticNoise) Chernyshev](https://www.patreon.com/user?u=2601918)\n\n### JetBrains\n\nJetBrains provided an open-source all-products license for their products which drastically helps in development of the engine.\n\n<img src=\"https://resources.jetbrains.com/storage/products/company/brand/logos/jb_beam.png\" alt=\"JetBrains logo.\" width=\"200\" height=\"200\">\n\n_Copyright  2000-2021 [JetBrains](https://jb.gg/OpenSource) s.r.o. JetBrains and the JetBrains logo are registered trademarks of JetBrains s.r.o._\n"
        },
        {
          "name": "editor-standalone",
          "type": "tree",
          "content": null
        },
        {
          "name": "editor",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-animation",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-build-tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-core-derive",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-dylib",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-graph",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-graphics",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-impl",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-math",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-resource",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-sound",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-texture",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox-ui",
          "type": "tree",
          "content": null
        },
        {
          "name": "fyrox",
          "type": "tree",
          "content": null
        },
        {
          "name": "pics",
          "type": "tree",
          "content": null
        },
        {
          "name": "project-manager",
          "type": "tree",
          "content": null
        },
        {
          "name": "template-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "template",
          "type": "tree",
          "content": null
        },
        {
          "name": "test_output",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}