{
  "metadata": {
    "timestamp": 1736563519005,
    "page": 6,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "FortAwesome/Font-Awesome",
      "stars": 74519,
      "defaultBranch": "6.x",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 0.1298828125,
          "content": "# Change Log\n\nFont Awesome 6 is here! And with it a new location for the change log.\n\nVisit https://fontawesome.com/docs/changelog/.\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.158203125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, gender identity and expression, level of experience,\nnationality, personal appearance, race, religion, or sexual identity and\norientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\nadvances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at <hello@fontawesome.com>. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at [https://contributor-covenant.org/version/1/4][version]\n\n[homepage]: https://contributor-covenant.org\n[version]: https://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.716796875,
          "content": "# Contributing to Font Awesome\n\nLooking to contribute something to Font Awesome? **Here's how you can help.**\n\n## Quick start\n\nWe only accept issues that are icon requests, bug reports, or feature requests.\nBugs must be isolated and reproducible problems that we can fix within the Font\nAwesome core.\n\n* [Request a new icon](https://github.com/FortAwesome/Font-Awesome/issues/new?assignees=&labels=new+icon&projects=&template=000_icon_request.yml&title=Icon+request%3A+)\n* [Request a new brand icon](https://github.com/FortAwesome/Font-Awesome/issues/new?assignees=&labels=brand+icon&projects=&template=001_brand_request.yml&title=Brand+request%3A+)\n* [Submit a bug report for Web (Kit, CSS, JS)](https://github.com/FortAwesome/Font-Awesome/issues/new?assignees=&labels=bug%2Cneeds-triage&projects=&template=100_web_bug_report.yml&title=Bug%3A+)\n* [Submit a bug report for Desktop, Native, and other use cases](https://github.com/FortAwesome/Font-Awesome/issues/new?assignees=&labels=bug%2Cneeds-triage&projects=&template=101_other_bug_report.yml&title=Bug%3A+)\n* [Request a new feature](https://github.com/FortAwesome/Font-Awesome/issues/new?assignees=&labels=feature&projects=&template=200_feature_request.yml&title=Feature+request%3A+)\n\n## Pull requests\n\n- **At the moment we are not accepting pull requests containing icons**\n- Pull requests that do not solve an existing issue are essentially un-prioritized–don't expect these to be addressed quickly\n- Most of the files in this repository are generated by a build system, so we may not be able to merge PRs directly\n- Try not to pollute your pull request with unintended changes–keep them simple and small\n- Try to share which browsers your code has been tested in before submitting a pull request\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 7.2529296875,
          "content": "Fonticons, Inc. (https://fontawesome.com)\n\n--------------------------------------------------------------------------------\n\nFont Awesome Free License\n\nFont Awesome Free is free, open source, and GPL friendly. You can use it for\ncommercial projects, open source projects, or really almost whatever you want.\nFull Font Awesome Free license: https://fontawesome.com/license/free.\n\n--------------------------------------------------------------------------------\n\n# Icons: CC BY 4.0 License (https://creativecommons.org/licenses/by/4.0/)\n\nThe Font Awesome Free download is licensed under a Creative Commons\nAttribution 4.0 International License and applies to all icons packaged\nas SVG and JS file types.\n\n--------------------------------------------------------------------------------\n\n# Fonts: SIL OFL 1.1 License\n\nIn the Font Awesome Free download, the SIL OFL license applies to all icons\npackaged as web and desktop font files.\n\nCopyright (c) 2024 Fonticons, Inc. (https://fontawesome.com)\nwith Reserved Font Name: \"Font Awesome\".\n\nThis Font Software is licensed under the SIL Open Font License, Version 1.1.\nThis license is copied below, and is also available with a FAQ at:\nhttp://scripts.sil.org/OFL\n\nSIL OPEN FONT LICENSE\nVersion 1.1 - 26 February 2007\n\nPREAMBLE\nThe goals of the Open Font License (OFL) are to stimulate worldwide\ndevelopment of collaborative font projects, to support the font creation\nefforts of academic and linguistic communities, and to provide a free and\nopen framework in which fonts may be shared and improved in partnership\nwith others.\n\nThe OFL allows the licensed fonts to be used, studied, modified and\nredistributed freely as long as they are not sold by themselves. The\nfonts, including any derivative works, can be bundled, embedded,\nredistributed and/or sold with any software provided that any reserved\nnames are not used by derivative works. The fonts and derivatives,\nhowever, cannot be released under any other type of license. The\nrequirement for fonts to remain under this license does not apply\nto any document created using the fonts or their derivatives.\n\nDEFINITIONS\n\"Font Software\" refers to the set of files released by the Copyright\nHolder(s) under this license and clearly marked as such. This may\ninclude source files, build scripts and documentation.\n\n\"Reserved Font Name\" refers to any names specified as such after the\ncopyright statement(s).\n\n\"Original Version\" refers to the collection of Font Software components as\ndistributed by the Copyright Holder(s).\n\n\"Modified Version\" refers to any derivative made by adding to, deleting,\nor substituting — in part or in whole — any of the components of the\nOriginal Version, by changing formats or by porting the Font Software to a\nnew environment.\n\n\"Author\" refers to any designer, engineer, programmer, technical\nwriter or other person who contributed to the Font Software.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE.\n\n--------------------------------------------------------------------------------\n\n# Code: MIT License (https://opensource.org/licenses/MIT)\n\nIn the Font Awesome Free download, the MIT license applies to all non-font and\nnon-icon files.\n\nCopyright 2024 Fonticons, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in the\nSoftware without restriction, including without limitation the rights to use, copy,\nmodify, merge, publish, distribute, sublicense, and/or sell copies of the Software,\nand to permit persons to whom the Software is furnished to do so, subject to the\nfollowing conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,\nINCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT\nHOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n--------------------------------------------------------------------------------\n\n# Attribution\n\nAttribution is required by MIT, SIL OFL, and CC BY licenses. Downloaded Font\nAwesome Free files already contain embedded comments with sufficient\nattribution, so you shouldn't need to do anything additional when using these\nfiles normally.\n\nWe've kept attribution comments terse, so we ask that you do not actively work\nto remove them from files, especially code. They're a great way for folks to\nlearn about Font Awesome.\n\n--------------------------------------------------------------------------------\n\n# Brand Icons\n\nAll brand icons are trademarks of their respective owners. The use of these\ntrademarks does not indicate endorsement of the trademark holder by Font\nAwesome, nor vice versa. **Please do not use brand logos for any purpose except\nto represent the company, product, or service to which they refer.**\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.51171875,
          "content": "<h1><img src=\"https://img.fortawesome.com/349cfdf6/fa-free-logo.svg\" alt=\"Font Awesome Free\" width=\"50%\"></h1>\n\n> Version 6\n\nFont Awesome is the Internet's icon library and toolkit, used by millions of\ndesigners, developers, and content creators.\n\n## Documentation\n\nLearn how to get started with Font Awesome and then dive deeper into other advanced topics:\n\n[Docs for version 6](https://fontawesome.com/docs)\n\n### Where did Font Awesome 5, 4 (or 3) go?\n\nNow that Font Awesome 6 has been released we are marking version 5 as Long Term\nSupport (LTS). Version 5 will get critical bug fixes only. Version 3 and 4 are\nnow end-of-life and we don't plan on releasing any further versions of the 4.x\nor 3.x.\n\nYou can see a complete list of versions on [our Versions\npage](https://fontawesome.com/versions).\n\n## Change log\n\nThe change log for releases is now [available directly on our site](https://fontawesome.com/docs/changelog/).\n\nLooking for older versions of Font Awesome? Check the [releases](https://github.com/FortAwesome/Font-Awesome/releases).\n\n## Upgrading\n\nFrom time-to-time we'll have special upgrading instructions from one version to the next.\n\n- [Web upgrading guide](https://fontawesome.com/docs/web/setup/upgrade/)\n- [Desktop upgrading guide](https://fontawesome.com/docs/desktop/setup/upgrade/)\n\n## Code of conduct\n\nWe will behave ourselves if you behave yourselves. For more details see our\n[CODE_OF_CONDUCT.md](./CODE_OF_CONDUCT.md).\n\n## Contributing\n\nPlease read through our [contributing guidelines](./CONTRIBUTING.md).  Included\nare directions for opening issues.\n\n## Versioning\n\nFont Awesome will be maintained under the Semantic Versioning guidelines as much as possible. Releases will be numbered\nwith the following format:\n\n`<major>.<minor>.<patch>`\n\nFor more information on SemVer, please visit https://semver.org.\n\n**The major version \"6\" is part of an umbrella release.  It includes many different types of files and technologies. Therefore\nwe deviate from normal SemVer in the following ways:**\n\n* Any release may update the design, look-and-feel, or branding of an existing\n  icon\n* We will never intentionally release a `patch` version update that breaks\n  backward compatibility\n* A `minor` release **may include backward-incompatible changes** but we will\n  write clear upgrading instructions in UPGRADING.md\n* A `minor` or `patch` release will never remove icons\n* Bug fixes will be addressed as `patch` releases unless they include backward\n  incompatibility then they will be `minor` releases\n\n## License\n\nFont Awesome Free is free, open source, and GPL friendly. You can use it for\ncommercial projects, open source projects, or really almost whatever you want.\n\n- Icons — CC BY 4.0 License\n  - In the Font Awesome Free download, the CC BY 4.0 license applies to all icons packaged as .svg and .js files types.\n- Fonts — SIL OFL 1.1 License\n  - In the Font Awesome Free download, the SIL OLF license applies to all icons packaged as web and desktop font files.\n- Code — MIT License\n  - In the Font Awesome Free download, the MIT license applies to all non-font and non-icon files.\n\nAttribution is required by MIT, SIL OLF, and CC BY licenses. Downloaded Font\nAwesome Free files already contain embedded comments with sufficient\nattribution, so you shouldn't need to do anything additional when using these\nfiles normally.\n\nWe've kept attribution comments terse, so we ask that you do not actively work\nto remove them from files, especially code. They're a great way for folks to\nlearn about Font Awesome.\n\n## Team\n\nhttps://github.com/orgs/FortAwesome/people\n"
        },
        {
          "name": "UPGRADING.md",
          "type": "blob",
          "size": 0.43359375,
          "content": "# Upgrading Guide\n\nSee the [CHANGELOG.md](./CHANGELOG.md) for detailed information about what has changed between versions.\n\nOur upgrading guide has moved for version 6 to:\n\n- [Web](https://fontawesome.com/docs/web/setup/upgrade/)\n- [Desktop](https://fontawesome.com/docs/desktop/setup/upgrade/)\n\nAs always, [submit issues](https://github.com/FortAwesome/Font-Awesome/issues/new) that you run into with this guide or with these upgrades to us.\n"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 0.6376953125,
          "content": "{\n  \"name\": \"fortawesome/font-awesome\",\n  \"description\": \"The iconic font, CSS, and SVG framework\",\n  \"keywords\": [\"font\", \"awesome\", \"fontawesome\", \"icon\", \"svg\", \"font\", \"bootstrap\"],\n  \"homepage\": \"https://fontawesome.com\",\n  \"authors\": [\n    {\n      \"name\": \"The Font Awesome Team\",\n      \"homepage\": \"https://github.com/orgs/FortAwesome/people\"\n    }\n  ],\n  \"support\": {\n    \"email\": \"hello@fontawesome.com\",\n    \"issues\": \"https://github.com/FortAwesome/Font-Awesome/issues\",\n    \"source\": \"https://github.com/FortAwesome/Font-Awesome\",\n    \"docs\": \"http://fontawesome.com/docs\"\n  },\n  \"license\": [\n    \"CC-BY-4.0\",\n    \"OFL-1.1\",\n    \"MIT\"\n  ]\n}\n"
        },
        {
          "name": "css",
          "type": "tree",
          "content": null
        },
        {
          "name": "js-packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "js",
          "type": "tree",
          "content": null
        },
        {
          "name": "less",
          "type": "tree",
          "content": null
        },
        {
          "name": "metadata",
          "type": "tree",
          "content": null
        },
        {
          "name": "otfs",
          "type": "tree",
          "content": null
        },
        {
          "name": "scss",
          "type": "tree",
          "content": null
        },
        {
          "name": "sprites",
          "type": "tree",
          "content": null
        },
        {
          "name": "svgs",
          "type": "tree",
          "content": null
        },
        {
          "name": "webfonts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}