{
  "metadata": {
    "timestamp": 1736561893320,
    "page": 580,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "didi/mpx",
      "stars": 3659,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".eslintignore",
          "type": "blob",
          "size": 0.07421875,
          "content": "node_modules\nexamples/mpx-progressive\nbuild\ndist\npackages/size-report/public"
        },
        {
          "name": ".eslintrc.js",
          "type": "blob",
          "size": 1.6083984375,
          "content": "module.exports = {\n  root: true,\n  parser: '@babel/eslint-parser',\n  parserOptions: {\n    sourceType: 'module'\n  },\n  extends: 'standard',\n  plugins: ['html', 'jest'],\n  globals: {\n    wx: 'readonly',\n    my: 'readonly',\n    swan: 'readonly',\n    qq: 'readonly',\n    tt: 'readonly',\n    jd: 'readonly',\n    qa: 'readonly',\n    dd: 'readonly',\n    Component: 'readonly',\n    Page: 'readonly',\n    App: 'readonly',\n    Mixin: 'readonly',\n    __mpx_mode__: 'readonly',\n    __mpx_env__: 'readonly',\n    __mpx_dynamic_runtime__: 'readonly',\n    getRegExp: 'readonly',\n    getCurrentPages: 'readonly'\n  },\n  rules: {\n    'no-cond-assign': 0,\n    camelcase: 0,\n    indent: 0,\n    'symbol-description': 0\n  },\n  env: {\n    'jest/globals': true,\n    browser: true\n  },\n  overrides: [\n    {\n      files: ['**/*.tsx', '**/*.ts'],\n      parser: '@typescript-eslint/parser',\n      extends: [\n        'standard',\n        'plugin:@typescript-eslint/eslint-recommended',\n        'plugin:@typescript-eslint/recommended'\n      ],\n      plugins: ['@typescript-eslint'],\n      rules: {\n        '@typescript-eslint/no-explicit-any': 0,\n        'no-use-before-define': 0,\n        '@typescript-eslint/triple-slash-reference': 0,\n        '@typescript-eslint/ban-types': 0,\n        '@typescript-eslint/no-empty-interface': 0,\n        '@typescript-eslint/no-unused-vars': 0,\n        '@typescript-eslint/no-non-null-assertion': 0,\n        camelcase: 0\n      }\n    }, {\n      files: ['packages/webpack-plugin/lib/runtime/components/react/**/*.{js,jsx,ts,tsx}'],\n      plugins: ['react-hooks'],\n      rules: {\n        'react-hooks/rules-of-hooks': 'error'\n      }\n    }\n  ]\n}\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.19921875,
          "content": ".idea/\n.vscode/\n.cache/\n.gitconfig\nnode_modules/\n*.log\npackage-lock.json\npnpm-lock.yaml\nyarn.lock\n.DS_Store\ndocs-vuepress/.vuepress/dist\nelevate/\npackages/webpack-plugin/lib/runtime/components/react/dist/"
        },
        {
          "name": ".npmrc",
          "type": "blob",
          "size": 0.0244140625,
          "content": "install-strategy=shallow\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.279296875,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at opensource@didichuxing.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 10.8759765625,
          "content": "                              Apache License\n\n                        Version 2.0, January 2004\n\n                     http://www.apache.org/licenses/\n\n\n\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n\n\n\n1. Definitions.\n\n\n\n\n   \"License\" shall mean the terms and conditions for use, reproduction,\n\n   and distribution as defined by Sections 1 through 9 of this document.\n\n\n\n\n   \"Licensor\" shall mean the copyright owner or entity authorized by\n\n   the copyright owner that is granting the License.\n\n\n\n\n   \"Legal Entity\" shall mean the union of the acting entity and all\n\n   other entities that control, are controlled by, or are under common\n\n   control with that entity. For the purposes of this definition,\n\n   \"control\" means (i) the power, direct or indirect, to cause the\n\n   direction or management of such entity, whether by contract or\n\n   otherwise, or (ii) ownership of fifty percent (50%) or more of the\n\n   outstanding shares, or (iii) beneficial ownership of such entity.\n\n\n\n\n   \"You\" (or \"Your\") shall mean an individual or Legal Entity\n\n   exercising permissions granted by this License.\n\n\n\n\n   \"Source\" form shall mean the preferred form for making modifications,\n\n   including but not limited to software source code, documentation\n\n   source, and configuration files.\n\n\n\n\n   \"Object\" form shall mean any form resulting from mechanical\n\n   transformation or translation of a Source form, including but\n\n   not limited to compiled object code, generated documentation,\n\n   and conversions to other media types.\n\n\n\n\n   \"Work\" shall mean the work of authorship, whether in Source or\n\n   Object form, made available under the License, as indicated by a\n\n   copyright notice that is included in or attached to the work\n\n   (an example is provided in the Appendix below).\n\n\n\n\n   \"Derivative Works\" shall mean any work, whether in Source or Object\n\n   form, that is based on (or derived from) the Work and for which the\n\n   editorial revisions, annotations, elaborations, or other modifications\n\n   represent, as a whole, an original work of authorship. For the purposes\n\n   of this License, Derivative Works shall not include works that remain\n\n   separable from, or merely link (or bind by name) to the interfaces of,\n\n   the Work and Derivative Works thereof.\n\n\n\n\n   \"Contribution\" shall mean any work of authorship, including\n\n   the original version of the Work and any modifications or additions\n\n   to that Work or Derivative Works thereof, that is intentionally\n\n   submitted to Licensor for inclusion in the Work by the copyright owner\n\n   or by an individual or Legal Entity authorized to submit on behalf of\n\n   the copyright owner. For the purposes of this definition, \"submitted\"\n\n   means any form of electronic, verbal, or written communication sent\n\n   to the Licensor or its representatives, including but not limited to\n\n   communication on electronic mailing lists, source code control systems,\n\n   and issue tracking systems that are managed by, or on behalf of, the\n\n   Licensor for the purpose of discussing and improving the Work, but\n\n   excluding communication that is conspicuously marked or otherwise\n\n   designated in writing by the copyright owner as \"Not a Contribution.\"\n\n\n\n\n   \"Contributor\" shall mean Licensor and any individual or Legal Entity\n\n   on behalf of whom a Contribution has been received by Licensor and\n\n   subsequently incorporated within the Work.\n\n\n\n\n2. Grant of Copyright License. Subject to the terms and conditions of\n\n   this License, each Contributor hereby grants to You a perpetual,\n\n   worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n\n   copyright license to reproduce, prepare Derivative Works of,\n\n   publicly display, publicly perform, sublicense, and distribute the\n\n   Work and such Derivative Works in Source or Object form.\n\n\n\n\n3. Grant of Patent License. Subject to the terms and conditions of\n\n   this License, each Contributor hereby grants to You a perpetual,\n\n   worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n\n   (except as stated in this section) patent license to make, have made,\n\n   use, offer to sell, sell, import, and otherwise transfer the Work,\n\n   where such license applies only to those patent claims licensable\n\n   by such Contributor that are necessarily infringed by their\n\n   Contribution(s) alone or by combination of their Contribution(s)\n\n   with the Work to which such Contribution(s) was submitted. If You\n\n   institute patent litigation against any entity (including a\n\n   cross-claim or counterclaim in a lawsuit) alleging that the Work\n\n   or a Contribution incorporated within the Work constitutes direct\n\n   or contributory patent infringement, then any patent licenses\n\n   granted to You under this License for that Work shall terminate\n\n   as of the date such litigation is filed.\n\n\n\n\n4. Redistribution. You may reproduce and distribute copies of the\n\n   Work or Derivative Works thereof in any medium, with or without\n\n   modifications, and in Source or Object form, provided that You\n\n   meet the following conditions:\n\n\n\n\n   (a) You must give any other recipients of the Work or\n\n       Derivative Works a copy of this License; and\n\n\n\n\n   (b) You must cause any modified files to carry prominent notices\n\n       stating that You changed the files; and\n\n\n\n\n   (c) You must retain, in the Source form of any Derivative Works\n\n       that You distribute, all copyright, patent, trademark, and\n\n       attribution notices from the Source form of the Work,\n\n       excluding those notices that do not pertain to any part of\n\n       the Derivative Works; and\n\n\n\n\n   (d) If the Work includes a \"NOTICE\" text file as part of its\n\n       distribution, then any Derivative Works that You distribute must\n\n       include a readable copy of the attribution notices contained\n\n       within such NOTICE file, excluding those notices that do not\n\n       pertain to any part of the Derivative Works, in at least one\n\n       of the following places: within a NOTICE text file distributed\n\n       as part of the Derivative Works; within the Source form or\n\n       documentation, if provided along with the Derivative Works; or,\n\n       within a display generated by the Derivative Works, if and\n\n       wherever such third-party notices normally appear. The contents\n\n       of the NOTICE file are for informational purposes only and\n\n       do not modify the License. You may add Your own attribution\n\n       notices within Derivative Works that You distribute, alongside\n\n       or as an addendum to the NOTICE text from the Work, provided\n\n       that such additional attribution notices cannot be construed\n\n       as modifying the License.\n\n\n\n\n   You may add Your own copyright statement to Your modifications and\n\n   may provide additional or different license terms and conditions\n\n   for use, reproduction, or distribution of Your modifications, or\n\n   for any such Derivative Works as a whole, provided Your use,\n\n   reproduction, and distribution of the Work otherwise complies with\n\n   the conditions stated in this License.\n\n\n\n\n5. Submission of Contributions. Unless You explicitly state otherwise,\n\n   any Contribution intentionally submitted for inclusion in the Work\n\n   by You to the Licensor shall be under the terms and conditions of\n\n   this License, without any additional terms or conditions.\n\n   Notwithstanding the above, nothing herein shall supersede or modify\n\n   the terms of any separate license agreement you may have executed\n\n   with Licensor regarding such Contributions.\n\n\n\n\n6. Trademarks. This License does not grant permission to use the trade\n\n   names, trademarks, service marks, or product names of the Licensor,\n\n   except as required for reasonable and customary use in describing the\n\n   origin of the Work and reproducing the content of the NOTICE file.\n\n\n\n\n7. Disclaimer of Warranty. Unless required by applicable law or\n\n   agreed to in writing, Licensor provides the Work (and each\n\n   Contributor provides its Contributions) on an \"AS IS\" BASIS,\n\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n\n   implied, including, without limitation, any warranties or conditions\n\n   of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n\n   PARTICULAR PURPOSE. You are solely responsible for determining the\n\n   appropriateness of using or redistributing the Work and assume any\n\n   risks associated with Your exercise of permissions under this License.\n\n\n\n\n8. Limitation of Liability. In no event and under no legal theory,\n\n   whether in tort (including negligence), contract, or otherwise,\n\n   unless required by applicable law (such as deliberate and grossly\n\n   negligent acts) or agreed to in writing, shall any Contributor be\n\n   liable to You for damages, including any direct, indirect, special,\n\n   incidental, or consequential damages of any character arising as a\n\n   result of this License or out of the use or inability to use the\n\n   Work (including but not limited to damages for loss of goodwill,\n\n   work stoppage, computer failure or malfunction, or any and all\n\n   other commercial damages or losses), even if such Contributor\n\n   has been advised of the possibility of such damages.\n\n\n\n\n9. Accepting Warranty or Additional Liability. While redistributing\n\n   the Work or Derivative Works thereof, You may choose to offer,\n\n   and charge a fee for, acceptance of support, warranty, indemnity,\n\n   or other liability obligations and/or rights consistent with this\n\n   License. However, in accepting such obligations, You may act only\n\n   on Your own behalf and on Your sole responsibility, not on behalf\n\n   of any other Contributor, and only if You agree to indemnify,\n\n   defend, and hold each Contributor harmless for any liability\n\n   incurred by, or claims asserted against, such Contributor by reason\n\n   of your accepting any such warranty or additional liability.\n\n\n\n\nEND OF TERMS AND CONDITIONS\n\n\n\n\nAPPENDIX: How to apply the Apache License to your work.\n\n\n\n\n   To apply the Apache License to your work, attach the following\n\n   boilerplate notice, with the fields enclosed by brackets \"{}\"\n\n   replaced with your own identifying information. (Don't include\n\n   the brackets!)  The text should be enclosed in the appropriate\n\n   comment syntax for the file format. We also recommend that a\n\n   file or class name and description of purpose be included on the\n\n   same \"printed page\" as the copyright notice for easier\n\n   identification within third-party archives.\n\n\n\n\nCopyright (C) 2017 Beijing Didi Infinity Technology and Development Co.,Ltd. All rights reserved.\n\n\n\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\n\nyou may not use this file except in compliance with the License.\n\nYou may obtain a copy of the License at\n\n\n\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\n\n\n\nUnless required by applicable law or agreed to in writing, software\n\ndistributed under the License is distributed on an \"AS IS\" BASIS,\n\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n\nSee the License for the specific language governing permissions and\n\nlimitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 19.103515625,
          "content": "[![mpx-logo](https://dpubstatic.udache.com/static/dpubimg/41413d7a-8249-46e6-bf68-709dc511fce2.png)](https://mpxjs.cn)\n\n[Mpx](https://mpxjs.cn), 一款具有优秀开发体验和深度性能优化的增强型跨端小程序框架。\n\n![test-status](https://github.com/didi/mpx/workflows/test/badge.svg)\n![docs-status](https://github.com/didi/mpx/workflows/docs/badge.svg)\n\n## 官网及文档\n\n欢迎访问[https://mpxjs.cn](https://mpxjs.cn)，跟随我们提供的文档指南使用Mpx进行跨端小程序开发。\n\n## 近期更新\n基于 Mpx 的移动端基础组件库 [mpx-cube-ui](https://www.mpxjs.cn/mpx-cube-ui/guide/intro.html) 已经开源，更多详情查看[这里](https://mpxjs.cn/articles/mpx-cube-ui.html)。\n\nMpx 2.9 版本正式发布，支持原子类、SSR和构建产物体积优化，更多详情查看[这里](https://mpxjs.cn/articles/2.9-release.html)，迁移指南查看[这里](https://mpxjs.cn/guide/migrate/2.9.html)，相关指南及 API 参考文档已更新。\n\n## 简介\n\nMpx是一款致力于提升小程序开发体验和用户体验的增强型小程序跨端框架，通过Mpx，我们能够以类Vue的开发体验高效优雅地构筑出高性能跨端小程序应用，在所有开放的小程序平台及web平台中运行。\n\nMpx具有以下功能特性：\n* [数据响应](https://www.mpxjs.cn/guide/basic/reactive.html) (赋值响应 / [watch](https://www.mpxjs.cn/api/global-api.html#watch) / computed)\n* [组合式 API](https://mpxjs.cn/guide/composition-api/composition-api.html)\n* 增强模板语法 ([动态组件](https://www.mpxjs.cn/guide/basic/component.html#%E5%8A%A8%E6%80%81%E7%BB%84%E4%BB%B6) / [样式绑定 / 类名绑定 ](https://www.mpxjs.cn/guide/basic/class-style-binding.html#%E7%B1%BB%E5%90%8D%E7%BB%91%E5%AE%9A) / [内联事件函数](https://www.mpxjs.cn/guide/basic/event.html) / [双向绑定](https://www.mpxjs.cn/guide/basic/two-way-binding.html) / [refs](https://www.mpxjs.cn/guide/basic/refs.html))\n* 极致性能 ([运行时性能优化](https://www.mpxjs.cn/guide/understand/runtime.html) / [包体积优化](https://www.mpxjs.cn/guide/understand/compile.html#%E5%88%86%E5%8C%85%E5%A4%84%E7%90%86) / 框架运行时体积14KB)\n* [高效强大的编译构建](https://www.mpxjs.cn/guide/understand/compile.html#%E5%88%86%E5%8C%85%E5%A4%84%E7%90%86) (基于webpack5 / 支持持久化缓存 / 兼容webpack生态 / 兼容原生小程序 / 完善支持npm场景下的分包输出 / 高效调试)\n* [单文件组件开发](https://www.mpxjs.cn/guide/basic/single-file.html)\n* [渐进接入 / 原生组件支持](https://www.mpxjs.cn/guide/advance/progressive.html)\n* [状态管理](https://www.mpxjs.cn/guide/advance/store.html) (Vuex规范 / 支持多实例Store)\n* 跨团队开发 ([packages](https://www.mpxjs.cn/guide/advance/subpackage.html))\n* 逻辑复用 ([mixins](https://www.mpxjs.cn/guide/advance/mixin.html))\n* [周边能力](https://www.mpxjs.cn/guide/extend/) (fetch / api增强 / mock / webview-bridge)\n* 脚手架支持\n* 多平台增强 (支持在微信、支付宝、百度、qq、头条小程序平台中进行增强开发)\n* [跨平台编译](https://www.mpxjs.cn/guide/advance/platform.html) (一套代码跨端输出到微信、支付宝、百度、字节、QQ、京东、快应用(web) 和 [web平台](https://www.mpxjs.cn/guide/advance/platform.html#%E8%B7%A8%E5%B9%B3%E5%8F%B0%E8%BE%93%E5%87%BAweb) 中运行)\n* [TypeScript支持](https://www.mpxjs.cn/guide/tool/ts.html) (基于ThisType实现了完善的类型推导)\n* [I18n国际化](https://www.mpxjs.cn/guide/tool/i18n.html)\n* [单元测试](https://www.mpxjs.cn/guide/tool/unit-test.html)\n* [E2E测试](https://www.mpxjs.cn/guide/tool/e2e-test.html)\n* [原子类](https://mpxjs.cn/guide/advance/utility-first-css.html)\n* [SSR](https://mpxjs.cn/guide/advance/ssr.html)\n* 运行时渲染方案\n* 跨端输出RN（即将到来）\n\n## 快速开始\n\n```bash\n# 安装mpx脚手架工具\nnpm i -g @mpxjs/cli\n\n# 初始化项目\nmpx create mpx-project\n\n# 进入项目目录\ncd mpx-project\n\n# 安装依赖\nnpm i\n\n# development\nnpm run serve\n\n# production\nnpm run build\n```\n\n使用小程序开发者工具打开项目文件夹下dist中对应平台的文件夹即可预览效果。\n\n## 使用示例\n\n```html\n<template>\n  <!--动态样式-->\n  <view class=\"container\" wx:style=\"{{dynamicStyle}}\">\n    <!--数据绑定-->\n    <view class=\"title\">{{title}}</view>\n    <!--计算属性数据绑定-->\n    <view class=\"title\">{{reversedTitle}}</view>\n    <view class=\"list\">\n      <!--循环渲染，动态类名，事件处理内联传参-->\n      <view wx:for=\"{{list}}\" wx:key=\"id\" class=\"list-item\" wx:class=\"{{ {active:item.active} }}\"\n            bindtap=\"handleTap(index)\">\n        <view>{{item.content}}</view>\n        <!--循环内部双向数据绑定-->\n        <input type=\"text\" wx:model=\"{{list[index].content}}\"/>\n      </view>\n    </view>\n    <!--自定义组件获取实例，双向绑定，自定义双向绑定属性及事件-->\n    <custom-input wx:ref=\"ci\" wx:model=\"{{customInfo}}\" wx:model-prop=\"info\" wx:model-event=\"change\"/>\n    <!--动态组件，is传入组件名字符串，可使用的组件需要在json中注册，全局注册也生效-->\n    <component is=\"{{current}}\"></component>\n    <!--显示/隐藏dom-->\n    <view class=\"bottom\" wx:show=\"{{showBottom}}\">\n      <!--模板条件编译，__mpx_mode__为框架注入的环境变量，条件判断为false的模板不会生成到dist-->\n      <view wx:if=\"{{__mpx_mode__ === 'wx'}}\">wx env</view>\n      <view wx:if=\"{{__mpx_mode__ === 'ali'}}\">ali env</view>\n    </view>\n  </view>\n</template>\n\n<script>\n  import { createPage } from '@mpxjs/core'\n\n  createPage({\n    data: {\n      // 动态样式和类名也可以使用computed返回\n      dynamicStyle: {\n        fontSize: '16px',\n        color: 'red'\n      },\n      title: 'hello world',\n      list: [\n        {\n          content: '全军出击',\n          id: 0,\n          active: false\n        },\n        {\n          content: '猥琐发育，别浪',\n          id: 1,\n          active: false\n        }\n      ],\n      customInfo: {\n        title: 'test',\n        content: 'test content'\n      },\n      current: 'com-a',\n      showBottom: false\n    },\n    computed: {\n      reversedTitle () {\n        return this.title.split('').reverse().join('')\n      }\n    },\n    watch: {\n      title: {\n        handler (val, oldVal) {\n          console.log(val, oldVal)\n        },\n        immediate: true\n      }\n    },\n    handleTap (index) {\n      // 处理函数直接通过参数获取当前点击的index，清晰简洁.\n      this.list[index].active = !this.list[index].active\n    },\n    onReady () {\n      setTimeout(() => {\n        // 更新数据，同时关联的计算属性reversedTitle也会更新\n        this.title = '你好，世界'\n        // 此时动态组件会从com-a切换为com-b\n        this.current = 'com-b'\n      }, 1000)\n    }\n  })\n</script>\n\n<script type=\"application/json\">\n  {\n    \"usingComponents\": {\n      \"custom-input\": \"../components/custom-input\",\n      \"com-a\": \"../components/com-a\",\n      \"com-b\": \"../components/com-b\"\n    }\n  }\n</script>\n\n<style lang=\"stylus\">\n  .container\n    position absolute\n    width 100%\n</style>\n```\n\n更多示例请查看[官方示例项目](https://github.com/didi/mpx/tree/master/examples)\n\n## 设计思路\n\nMpx的核心设计思路为增强，不同于业内大部分小程序框架将web MVVM框架迁移到小程序中运行的做法，Mpx以小程序原生的语法和技术能力为基础，借鉴参考了主流的web技术设计对其进行了扩展与增强，并在此技术上实现了以微信增强语法为base的同构跨平台输出，该设计带来的好处如下：\n* 良好的开发体验：在方便使用框架提供的便捷特性的同时，也能享受到媲美原生开发的确定性和稳定性，完全没有`框架太多坑，不如用原生`的顾虑；不管是增强输出还是跨平台输出，最终的dist代码可读性极强，便于调试排查；\n* 极致的性能：得益于增强的设计思路，Mpx框架在运行时不需要做太多封装抹平转换的工作，框架的运行时部分极为轻量简洁，压缩+gzip后仅占用14KB；配合编译构建进行的包体积优化和基于模板渲染函数进行的数据依赖跟踪，Mpx框架在性能方面做到了业内最优([小程序框架运行时性能评测报告](https://github.com/hiyuki/mp-framework-benchmark/blob/master/README.md))；\n* 完整的原生兼容：同样得益于增强的设计思路，Mpx框架能够完整地兼容小程序原生技术规范，并且做到实时跟进。在Mpx项目中开发者可以方便地使用业内已有的小程序生态，如组件库、统计工具等；原生开发者们可以方便地进行渐进迁移；甚至可以将框架的跨平台编译能力应用在微信的原生小程序组件当中进行跨平台输出。\n\n\n## 生态周边\n\n|包名|版本|描述|\n|-----|----|----|\n|@mpxjs/core|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fcore.svg)](https://badge.fury.io/js/%40mpxjs%2Fcore)|mpx运行时核心|\n|@mpxjs/webpack-plugin|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fwebpack-plugin.svg)](https://badge.fury.io/js/%40mpxjs%2Fwebpack-plugin)|mpx编译核心|\n|@mpxjs/api-proxy|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fapi-proxy.svg)](https://badge.fury.io/js/%40mpxjs%2Fapi-proxy)|将各个平台的 api 进行转换，也可以将 api 转为 promise 格式|\n|@mpxjs/store|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fstore.svg)](https://badge.fury.io/js/%40mpxjs%2Fstore)|类vuex store|\n|@mpxjs/pinia|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fpinia.svg)](https://badge.fury.io/js/%40mpxjs%2Fpinia)|mpx pinia store|\n|@mpxjs/fetch|[![npm version](https://badge.fury.io/js/%40mpxjs%2Ffetch.svg)](https://badge.fury.io/js/%40mpxjs%2Ffetch)|mpx网络请求库，处理wx并发请求限制|\n|@mpxjs/unocss-plugin|[![npm version](https://badge.fury.io/js/@mpxjs%2Funocss-plugin.svg)](https://badge.fury.io/js/@mpxjs%2Funocss-plugin)|mpx unocss插件，支持使用unocss原子类|\n|@mpxjs/unocss-base|[![npm version](https://badge.fury.io/js/@mpxjs%2Funocss-base.svg)](https://badge.fury.io/js/@mpxjs%2Funocss-base)|mpx unocss预设|\n|@mpxjs/cli|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fcli.svg)](https://badge.fury.io/js/%40mpxjs%2Fcli)|mpx脚手架命令行工具|\n|@mpxjs/webview-bridge|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fwebview-bridge.svg)](https://badge.fury.io/js/%40mpxjs%2Fwebview-bridge)|为跨小程序平台的H5项目提供通用的webview-bridge|\n|@mpxjs/utils|[![npm version](https://badge.fury.io/js/%40mpxjs%2Futils.svg)](https://badge.fury.io/js/%40mpxjs%2Futils)|mpx运行时工具库|\n|@mpxjs/babel-plugin-inject-page-events|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fbabel-plugin-inject-page-events.svg)](https://badge.fury.io/js/%40mpxjs%2Fbabel-plugin-inject-page-events)|组合式API页面事件处理插件|\n|@mpxjs/mpx-cube-ui|[![npm version](https://badge.fury.io/js/%40mpxjs%2Fmpx-cube-ui.svg)](https://badge.fury.io/js/%40mpxjs%2Fmpx-cube-ui)|基于 Mpx 的移动端基础组件库|\n\n## 开发团队\n\n核心团队: [hiyuki](https://github.com/hiyuki), [Blackgan3](https://github.com/Blackgan3), [anotherso1a](https://github.com/anotherso1a), [CommanderXL](https://github.com/CommanderXL), [yandadaFreedom](https://github.com/yandadaFreedom), [wangxiaokou](https://github.com/wangxiaokou), [OnlyProbie](https://github.com/OnlyProbie), [pagnkelly](https://github.com/pagnkelly), [thuman](https://github.com/thuman), [theniceangel](https://github.com/theniceangel), [dolymood](https://github.com/dolymood)\n\n外部贡献者：[sky-admin](https://github.com/sky-admin), [pkingwa](https://github.com/pkingwa), [httpsxiao](https://github.com/httpsxiao), [lsycxyj](https://github.com/lsycxyj), [okxiaoliang4](https://github.com/okxiaoliang4), [tangminFE](https://github.com/tangminFE), [codepan](https://github.com/codepan), [zqjimlove](https://github.com/zqjimlove), [xuehebinglan](https://github.com/xuehebinglan), [zhaoyiming0803](https://github.com/zhaoyiming0803), [ctxrr](https://github.com/ctxrr), [JanssenZhang](https://github.com/JanssenZhang), [heiye9](https://github.com/heiye9), [lj0812](https://github.com/lj0812), [SuperHuangXu](https://github.com/SuperHuangXu), [twtylkmrh](https://github.com/twtylkmrh), [NineSwordsMonster](https://github.com/NineSwordsMonster)\n\n## 成功案例\n\n微信小程序\n\n![滴滴出行](https://dpubstatic.udache.com/static/dpubimg/bcca3d10-01b7-4c08-951a-22418b2443d6.jpg)|  ![出行广场](https://dpubstatic.udache.com/static/dpubimg/708d5579-81f0-480e-96b3-5f49e8022273.jpg)   |  ![滴滴公交](https://dpubstatic.udache.com/static/dpubimg/69a08787-d3a1-4c51-b182-0fcb96960b56.jpg)   |                                     ![滴滴金融](https://dpubstatic.udache.com/static/dpubimg/8c25bec8-938e-452d-96f9-5e524092a8ee.png)                                     |  ![滴滴外卖](https://dpubstatic.udache.com/static/dpubimg/8fdd04ed-a74b-4b87-be6e-652550fb843f.png)   |![司机招募](https://dpubstatic.udache.com/static/dpubimg/d3b62a33-7dbd-45ea-a4aa-f30ad61965f2.jpg)|![小桔加油](https://dpubstatic.udache.com/static/dpubimg/988099b3-9930-4c54-abd7-75e70134d649.png)|\n|:---:|:-------------------------------------------------------------------------------------------------:|:-------------------------------------------------------------------------------------------------:|:----------------------------------------------------------------------------------------------------------------------------------------------------------------------:|:-------------------------------------------------------------------------------------------------:|:---:|:---:|\n|滴滴出行|出行广场|滴滴公交|滴滴金融|滴滴外卖|司机招募|小桔加油|\n|![彗星英语](https://dpubstatic.udache.com/static/dpubimg/d8ff5697-17f2-4177-9d8b-269e1af6c04a.jpg)|  ![番薯借阅](https://dpubstatic.udache.com/static/dpubimg/79573ef6-2a66-462e-8cc7-63eb983168f8.jpg)   |  ![疫查查应用](https://dpubstatic.udache.com/static/dpubimg/8932c3c2-b6da-4da2-8661-5554fe2bd4a3.jpg)  |                                     ![小桔养车](https://dpubstatic.udache.com/static/dpubimg/b6507fca-1e1f-4922-9240-d0f172bea6de.jpg)                                     | ![学而思直播课](https://dpubstatic.udache.com/static/dpubimg/40fd646b-10d0-4383-a576-e1d425a8c05d.jpeg) |![小猴启蒙课](https://dpubstatic.udache.com/static/dpubimg/6833dbdb-1dc8-4929-bd41-6d71069b0714.jpeg)|![科创书店](https://dpubstatic.udache.com/static/dpubimg/8627f48d-cf64-4511-8b2f-ede8e54186a7.png)|\n|彗星英语|番薯借阅|疫查查应用|                                                                                  小桔养车                                                                                  |                                              学而思直播课                                               |小猴启蒙课|科创书店|\n|![在武院](https://dpubstatic.udache.com/static/dpubimg/421bf49b-a9cb-4d54-90d7-e21b80ab21b3.jpg)| ![三股绳Lite](https://dpubstatic.udache.com/static/dpubimg/46ee136b-0791-4069-98b0-35566d5ef394.jpg) | ![学而思优选课](https://dpubstatic.udache.com/static/dpubimg/eab48487-5ca2-4368-9080-a6b843097e67.jpeg) | ![食享会](https://dpubstatic.udache.com/static/dpubimg/lY7eYSppkW/68747470733a2f2f73686978682e636f6d2f73686571752f696d672f7172636f64655f322e37343664373562342e706e67.png) | ![青铜安全医生](https://dpubstatic.udache.com/static/dpubimg/58cdbcc5-1f00-4da9-89c6-e638b2f77b19.png)  |![青铜安全培训](https://dpubstatic.udache.com/static/dpubimg/a9d60600-40c0-4b66-934e-3bb176d3f07a.png)|![视穹云机械](https://dpubstatic.udache.com/static/dpubimg/0a816842-dda4-4e30-8c14-e951fb1a8131.jpeg)|\n|在武院|三股绳Lite|学而思优选课|                                                                                  食享会                                                                                   |                                              青铜安全医生                                               |青铜安全培训|视穹云机械|\n|![店有生意通](https://dpubstatic.udache.com/static/dpubimg/7f1b5f22-d765-4142-862a-999c1ed9d10f.png)|            ![花小猪打车](https://dpubstatic.udache.com/static/dpubimg/JzHnEyu8VT/aaa.jpeg)             |  ![橙心优选](https://dpubstatic.udache.com/static/dpubimg/37222642-c508-4a67-8cbc-036a66985bfc.jpeg)  |                                           ![小二押镖](https://dpubstatic.udache.com/static/dpubimg/nB6-p3WzIQ/xiaoeryabiao.png)                                            |          ![顺鑫官方微商城](https://dpubstatic.udache.com/static/dpubimg/nY2bg3A1L_/shunxin.jpg)          |![嘀嗒出行](https://dpubstatic.udache.com/static/dpubimg/DO3m0Iflq1/didachuxing.jpeg)|![汉行通Pro](https://dpubstatic.udache.com/static/dpubimg/86cd89be-de29-48ad-8cb0-72c432446e7b.jpg)|\n|店有生意通|花小猪打车|橙心优选|                                                                                  小二押镖                                                                                  |                                              顺鑫官方微商城                                              |嘀嗒出行|汉行通Pro|\n|![交圈](https://dpubstatic.udache.com/static/dpubimg/eaf24702-6d49-4853-9cab-cce7240dda85.png)|  ![青桔单车](https://dpubstatic.udache.com/static/dpubimg/pIM3h2vyj2/qingju.jpg)   |  ![滴滴顺风车](https://dpubstatic.udache.com/static/dpubimg/neOI_G6deQ/shunfengche.png)  |![滴滴代驾](https://dpubstatic.udache.com/static/dpubimg/cn2A4-zw30i8YB8lb75X5.jpg)|          ![新桔代驾](https://dpubstatic.udache.com/static/dpubimg/vVBnrKlgI4OGe3bdpTbbD.jpg)|![标贝知音](https://dpubstatic.udache.com/static/dpubimg/k2rTzT4frRgsHghUNgdtq_136727190-f481d792-fb9d-4198-b95d-a4e151c65dde.jpg)||\n|交圈|青桔单车|滴滴顺风车|滴滴代驾|新桔代驾|标贝知音||\n\n其他平台小程序：\n\n|![滴滴出行(支付宝)](https://dpubstatic.udache.com/static/dpubimg/47fe83e5-c41a-4245-b910-60ed6493d87e.png)|![小桔充电(支付宝)](https://dpubstatic.udache.com/static/dpubimg/fa1a524b-da97-4df3-9412-8c988f50b6ae.png)|![唯品会QQ](https://dpubstatic.udache.com/static/dpubimg/2a150b0a-e23d-4e91-98fe-e862410be911.jpeg)|![口袋证件照(百度)](https://dpubstatic.udache.com/static/dpubimg/a71aa963-0245-41a1-a008-f684e0bf24dc.png)|![唯品会(百度)](https://dpubstatic.udache.com/static/dpubimg/56273723-ba98-4ceb-9672-075a5ab9f2da.png)|![唯品会(字节)](https://dpubstatic.udache.com/static/dpubimg/88f898a0-2f3b-44c5-b7ce-c1a8aec25299.jpeg)|\n|:---:|:---:|:---:|:---:|:---:|:---:|\n|滴滴出行(支付宝)|小桔充电(支付宝)|唯品会(QQ)|口袋证件照(百度)|唯品会(百度)|唯品会(字节)|\n\n[更多案例](https://github.com/didi/mpx/issues/385)，若你也在使用Mpx框架开发小程序，并想分享给大家，请填在此issue中。\n\n## 交流\n\n提供 微信群 / QQ群 两种交流方式\n\n#### 添加MPX入群小助手等待受邀入群\n\n![微信](https://dpubstatic.udache.com/static/dpubimg/6DN0ebkbjgI2P9QjJr8jr_WechatIMG3.jpeg)\n\n\n#### 扫码进入QQ群\n\n![QQ](https://dpubstatic.udache.com/static/dpubimg/etX-gKWeUb/temp_qrcode_share_374632411.png)\n\n图片因github网络问题导致不可见的朋友可以点击该链接：https://s.didi.cn/rod\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.4482421875,
          "content": "# Security Policy\n\n## Supported Versions\n\n| Version | Supported          |\n| ------- | ------------------ |\n| 2.6.x   | :white_check_mark: |\n| < 2.6   | :x:                |\n\n## Reporting a Vulnerability\n\nTo report a vulnerability please send an email with the details to [674883329@qq.com](674883329@qq.com) or [17801031786@163.com](17801031786@163.com).\n\nWe will do our best to fix the problem as soon as possible.\n\nThank you for helping us to keep secure.\n"
        },
        {
          "name": "babel.config.json",
          "type": "blob",
          "size": 0.3212890625,
          "content": "{\n  \"presets\": [\n    [\n      \"@babel/env\",\n      {\n        \"modules\": false,\n        \"shippedProposals\": true\n      }\n    ]\n  ],\n  \"sourceType\": \"unambiguous\",\n  \"env\": {\n    \"test\": {\n      \"presets\": [\n        [\n          \"@babel/env\",\n          {\n            \"shippedProposals\": true\n          }\n        ]\n      ]\n    }\n  }\n}\n"
        },
        {
          "name": "docs-vuepress",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "jest.config.json",
          "type": "blob",
          "size": 0.345703125,
          "content": "{\n  \"transform\": {\n    \"^.+\\\\.(js|jsx)?$\": \"babel-jest\"\n  },\n  \"moduleNameMapper\": {\n    \"\\\\.(css|styl)$\": \"identity-obj-proxy\"\n  },\n  \"testEnvironment\": \"jsdom\",\n  \"testMatch\": [\n    \"**/packages/**/?(*.)+(spec|test).[jt]s?(x)\"\n  ],\n  \"testPathIgnorePatterns\": [\"dist\", \"node_modules\"],\n  \"projects\": [\n    \"<rootDir>/packages/*/jest.config.json\"\n  ]\n}\n"
        },
        {
          "name": "legacy",
          "type": "tree",
          "content": null
        },
        {
          "name": "lerna.json",
          "type": "blob",
          "size": 0.0244140625,
          "content": "{\n  \"version\": \"2.9.70\"\n}"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 1.4482421875,
          "content": "{\n  \"name\": \"mpx-monorepo\",\n  \"description\": \"mpx monorepo\",\n  \"private\": true,\n  \"scripts\": {\n    \"lerna:publish\": \"lerna publish from-package --yes\",\n    \"lint\": \"eslint --ext .js,.ts,.tsx packages/\",\n    \"fix\": \"eslint --fix --ext .js,.ts,.tsx packages/\",\n    \"lint:js\": \"eslint --ext .js packages/\",\n    \"test\": \"jest\",\n    \"release\": \"npm run lint && npm run test && npx lerna version\",\n    \"docs:dev\": \"vuepress dev docs-vuepress\",\n    \"docs:build\": \"vuepress build docs-vuepress\",\n    \"tsc:build\": \"npm --workspace=./packages/webpack-plugin run build\"\n  },\n  \"devDependencies\": {\n    \"@babel/core\": \"^7.25.2\",\n    \"@babel/eslint-parser\": \"^7.18.9\",\n    \"@babel/preset-env\": \"^7.25.3\",\n    \"@docsearch/css\": \"^3.0.0\",\n    \"@docsearch/js\": \"^3.0.0\",\n    \"@testing-library/jest-dom\": \"^4.2.4\",\n    \"@types/jest\": \"^27.0.1\",\n    \"@typescript-eslint/eslint-plugin\": \"^5.2.0\",\n    \"@typescript-eslint/parser\": \"^5.2.0\",\n    \"@vuepress/plugin-back-to-top\": \"^1.8.2\",\n    \"@vuepress/plugin-pwa\": \"^1.8.0\",\n    \"eslint\": \"^7.32.0\",\n    \"eslint-config-standard\": \"^16.0.3\",\n    \"eslint-plugin-html\": \"^6.2.0\",\n    \"eslint-plugin-import\": \"^2.25.2\",\n    \"eslint-plugin-jest\": \"^27.0.1\",\n    \"eslint-plugin-node\": \"^11.1.0\",\n    \"eslint-plugin-promise\": \"^5.1.1\",\n    \"eslint-plugin-react-hooks\": \"^5.1.0\",\n    \"identity-obj-proxy\": \"^3.0.0\",\n    \"jest\": \"^27.2.0\",\n    \"lerna\": \"^8.1.8\",\n    \"typescript\": \"^4.1.3\",\n    \"vuepress\": \"^1.9.7\"\n  },\n  \"workspaces\": [\n    \"packages/*\"\n  ]\n}\n"
        },
        {
          "name": "packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "tsconfig.json",
          "type": "blob",
          "size": 0.224609375,
          "content": "{\n  \"compilerOptions\": {\n    \"target\": \"esnext\",\n    \"module\": \"esnext\",\n    \"noImplicitThis\": true,\n    \"noImplicitAny\": true,\n    \"strictNullChecks\": true,\n    \"moduleResolution\": \"node\",\n    \"lib\": [\n      \"esnext\"\n    ]\n  }\n}\n"
        },
        {
          "name": "webpack.config.js",
          "type": "blob",
          "size": 0.26953125,
          "content": "const path = require('path')\n\nfunction resolvePackages (subPath) {\n  return path.resolve(__dirname, 'packages', subPath)\n}\n\nmodule.exports = {\n  resolve: {\n    alias: {\n      '@mpxjs/utils': resolvePackages('utils'),\n      '@mpxjs/store': resolvePackages('store')\n    }\n  }\n}\n"
        }
      ]
    }
  ]
}