{
  "metadata": {
    "timestamp": 1736561928976,
    "page": 629,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mdn/dom-examples",
      "stars": 3568,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.009765625,
          "content": ".DS_Store\n"
        },
        {
          "name": ".prettierignore",
          "type": "blob",
          "size": 0.0166015625,
          "content": "**/*.html\n**/*.md"
        },
        {
          "name": ".prettierrc.json",
          "type": "blob",
          "size": 0.029296875,
          "content": "{\n  \"bracketSameLine\": true\n}\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 0.6748046875,
          "content": "# Community Participation Guidelines\n\nThis repository is governed by Mozilla's code of conduct and etiquette guidelines. \nFor more details, please read the\n[Mozilla Community Participation Guidelines](https://www.mozilla.org/about/governance/policies/participation/). \n\n## How to Report\nFor more information on how to report violations of the Community Participation Guidelines, please read our '[How to Report](https://www.mozilla.org/about/governance/policies/participation/reporting/)' page.\n\n<!--\n## Project Specific Etiquette\n\nIn some cases, there will be additional project etiquette i.e.: (https://bugzilla.mozilla.org/page.cgi?id=etiquette.html).\nPlease update for your project.\n-->\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.974609375,
          "content": "# Contribution guide\n\nThe \"dom-examples\" repository accompany various MDN DOM and Web API documentation pages on [MDN Web Docs](https://developer.mozilla.org).\nThis document will help you get started with contributions!\n\n## Types of contribution\n\n> [!NOTE]\n> You can include an example directly in MDN pages using [`{{EmbedLiveSample()}}` macros](https://developer.mozilla.org/en-US/docs/MDN/Writing_guidelines/Page_structures/Macros/Commonly_used_macros#code_samples) or regular Markdown code blocks.\n> These methods are simpler to maintain as the code lives beside the rest of the content.\n> Only add examples to this repository if your example doesn't easily run on MDN pages for technical or security reasons.\n\nThere are many ways you can help improve this repository! For example:\n\n- **Write a new example.** If you would like to add a new example, make sure this feature is supported by a stable version of modern browsers.\n- **Improve an existing example.** You could make improvements or add some other changes which would make example more helpful to the users.\n- **Fix a bug:** we have a list of [issues](https://github.com/mdn/dom-examples/issues), or maybe you found your own.\n\n## Getting started\n\nYou will need to have Git and GitHub set up to be able to contribute.\n\n### Set up Git and GitHub\n\nFor more information on setting up Git on your machine, [read this article](https://help.github.com/articles/set-up-git/).\nWith the above dependencies satisfied, [create your new account on GitHub](https://github.com/join).\n\nNext up, you need to fork and clone the repo to be able to contribute to it.\nYou can [learn about forking on GitHub](https://help.github.com/articles/fork-a-repo).\nOnce you have your own fork, [clone it to your local machine](https://help.github.com/articles/cloning-a-repository/).\n\n### Serving\n\nYou should serve your example locally to see the results before submitting your changes.\nThere are a few different ways to do this depending on your preferred tooling methods.\nSee [Running a simple local HTTP server](https://developer.mozilla.org/en-US/docs/Learn/Common_questions/Tools_and_setup/set_up_a_local_testing_server#running_a_simple_local_http_server) for information on setting up a server.\n\n```bash\ncd my-cool-example\npython3 -m http.server\n```\n\n### Open a pull request\n\nOnce you're satisfied, the final step is to [submit your pull request](https://help.github.com/articles/creating-a-pull-request/).\nYou can find more information about submitting pull requests in our [Community guidelines](https://developer.mozilla.org/en-US/docs/MDN/Community/Pull_requests) docs.\n\n### Including your example on MDN\n\nAfter your pull request is reviewed and merged, you can publish your example on MDN Web Docs.\n\n## Thank you\n\nThanks a lot for your contribution!\nIf you'd like to ask questions or get in touch, feel free to drop by in [Discord](https://developer.mozilla.org/discord) or say hello in one of [our communication channels](https://developer.mozilla.org/en-US/docs/MDN/Community/Communication_channels).\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.4013671875,
          "content": "CC0 1.0 Universal\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator and\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for the\npurpose of contributing to a commons of creative, cultural and scientific\nworks (\"Commons\") that the public can reliably and without fear of later\nclaims of infringement build upon, modify, incorporate in other works, reuse\nand redistribute as freely as possible in any form whatsoever and for any\npurposes, including without limitation commercial purposes. These owners may\ncontribute to the Commons to promote the ideal of a free culture and the\nfurther production of creative, cultural and scientific works, or to gain\nreputation or greater distribution for their Work in part through the use and\nefforts of others.\n\nFor these and/or other purposes and motivations, and without any expectation\nof additional consideration or compensation, the person associating CC0 with a\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\nand publicly distribute the Work under its terms, with knowledge of his or her\nCopyright and Related Rights in the Work and the meaning and intended legal\neffect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not limited\nto, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\n  and translate a Work;\n\n  ii. moral rights retained by the original author(s) and/or performer(s);\n\n  iii. publicity and privacy rights pertaining to a person's image or likeness\n  depicted in a Work;\n\n  iv. rights protecting against unfair competition in regards to a Work,\n  subject to the limitations in paragraph 4(a), below;\n\n  v. rights protecting the extraction, dissemination, use and reuse of data in\n  a Work;\n\n  vi. database rights (such as those arising under Directive 96/9/EC of the\n  European Parliament and of the Council of 11 March 1996 on the legal\n  protection of databases, and under any national implementation thereof,\n  including any amended or successor version of such directive); and\n\n  vii. other similar, equivalent or corresponding rights throughout the world\n  based on applicable law or treaty, and any national implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\nand Related Rights and associated claims and causes of action, whether now\nknown or unknown (including existing as well as future claims and causes of\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\nduration provided by applicable law or treaty (including future time\nextensions), (iii) in any current or future medium and for any number of\ncopies, and (iv) for any purpose whatsoever, including without limitation\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\nthe Waiver for the benefit of each member of the public at large and to the\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\nshall not be subject to revocation, rescission, cancellation, termination, or\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\nby the public as contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason be\njudged legally invalid or ineffective under applicable law, then the Waiver\nshall be preserved to the maximum extent permitted taking into account\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\nis so judged Affirmer hereby grants to each affected person a royalty-free,\nnon transferable, non sublicensable, non exclusive, irrevocable and\nunconditional license to exercise Affirmer's Copyright and Related Rights in\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\nprovided by applicable law or treaty (including future time extensions), (iii)\nin any current or future medium and for any number of copies, and (iv) for any\npurpose whatsoever, including without limitation commercial, advertising or\npromotional purposes (the \"License\"). The License shall be deemed effective as\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\nLicense for any reason be judged legally invalid or ineffective under\napplicable law, such partial invalidity or ineffectiveness shall not\ninvalidate the remainder of the License, and in such case Affirmer hereby\naffirms that he or she will not (i) exercise any of his or her remaining\nCopyright and Related Rights in the Work or (ii) assert any associated claims\nand causes of action with respect to the Work, in either case contrary to\nAffirmer's express Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\n  surrendered, licensed or otherwise affected by this document.\n\n  b. Affirmer offers the Work as-is and makes no representations or warranties\n  of any kind concerning the Work, express, implied, statutory or otherwise,\n  including without limitation warranties of title, merchantability, fitness\n  for a particular purpose, non infringement, or the absence of latent or\n  other defects, accuracy, or the present or absence of errors, whether or not\n  discoverable, all to the greatest extent permissible under applicable law.\n\n  c. Affirmer disclaims responsibility for clearing rights of other persons\n  that may apply to the Work or any use thereof, including without limitation\n  any person's Copyright and Related Rights in the Work. Further, Affirmer\n  disclaims responsibility for obtaining any necessary consents, permissions\n  or other rights required for any use of the Work.\n\n  d. Affirmer understands and acknowledges that Creative Commons is not a\n  party to this document and has no duty or obligation with respect to this\n  CC0 or use of the Work.\n\nFor more information, please see\n<http://creativecommons.org/publicdomain/zero/1.0/>\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.1572265625,
          "content": "# dom-examples\n\nCode examples that accompany various MDN DOM and Web API documentation pages.\n\n> [!NOTE]\n> You can include an example directly in MDN pages using [`{{EmbedLiveSample()}}` macros](https://developer.mozilla.org/en-US/docs/MDN/Writing_guidelines/Page_structures/Macros/Commonly_used_macros#code_samples) or regular Markdown code blocks.\n> These methods are simpler to maintain as the code lives beside the rest of the content.\n> Only add examples to this repository if your example doesn't easily run on MDN pages for technical or security reasons.\n\n## Repository contents\n\n- The \"abort-api\" directory contains an example of how to use the \"Abort API\" (aka [AbortSignal](https://dom.spec.whatwg.org/#interface-AbortSignal) and [AbortController](https://dom.spec.whatwg.org/#interface-abortcontroller)). [Run the example live](https://mdn.github.io/dom-examples/abort-api/).\n\n- The \"audiocontext-setsinkid\" directory contains an example of how to use the [`AudioContext.setSinkId()`](https://developer.mozilla.org/docs/Web/API/AudioContext/setSinkId) method and related features. [Run the example live](https://mdn.github.io/dom-examples/audiocontext-setsinkid/).\n\n- The \"auxclick\" directory contains a basic example demonstrating the new <code>auxclick</code> event type. See [GlobalEventHandlers.auxclick](https://developer.mozilla.org/docs/Web/API/GlobalEventHandlers/onauxclick) for more details, or [run the example live](https://mdn.github.io/dom-examples/auxclick/).\n\n- The \"canvas\" directory contains an example \"chroma-keying\" demonstrating how to use the Canvas API to manipulate videos: see [Manipulating video using canvas](https://developer.mozilla.org/docs/Web/API/Canvas_API/Manipulating_video_using_canvas) or [run the example live](https://mdn.github.io/dom-examples/canvas/chroma-keying/).\n\n- The \"channel-messaging-basic\" directory contains a basic example demonstrating the basics of channel messaging; see [Channel Messaging API](https://developer.mozilla.org/docs/Web/API/Channel_Messaging_API) or [run the example live](https://mdn.github.io/dom-examples/channel-messaging-basic/).\n\n- The \"channel-messaging-multimessage\" directory contains another channel messaging demo, showing how multiple messages can be sent between browsing contexts. See [Channel Messaging API](https://developer.mozilla.org/docs/Web/API/Channel_Messaging_API) for more details. [Run the demo live](https://mdn.github.io/dom-examples/channel-messaging-multimessage/).\n\n- The \"css-painting\" directory contains examples demonstrating the [CSS Painting API](https://developer.mozilla.org/docs/Web/API/CSS_Painting_API). See the [examples live](https://mdn.github.io/dom-examples/css-painting).\n\n- The \"drag-and-drop\" directory is for examples and demos of the [HTML Drag and Drop](https://developer.mozilla.org/docs/Web/API/HTML_Drag_and_Drop_API) standard.\n\n- The \"document-picture-in-picture\" directory contains an example showing usage of the [Document Picture-in-Picture API](http://developer.mozilla.org/docs/Web/API/Document_Picture-in-Picture_API/). [See the example live](https://mdn.github.io/dom-examples/document-picture-in-picture/).\n\n- The \"edit-context\" directory contains examples demonstrating the [EditContext API](https://developer.mozilla.org/docs/Web/API/EditContext_API). See the [list of examples](https://github.com/mdn/dom-examples/tree/main/edit-context/).\n\n- The \"fullscreen-api\" directory is for examples and demos of the [Fullscreen API](https://wiki.developer.mozilla.org/docs/Web/API/Fullscreen_API). Run the [example live](https://mdn.github.io/dom-examples/fullscreen-api/).\n\n- The \"history-api\" directory contains an example that demonstrates the [History API](https://developer.mozilla.org/docs/Web/API/History_API). [View the demo live](https://mdn.github.io/dom-examples/history-api/).\n\n- The \"indexeddb-api\" directory contains a demo for the [IndexedDB API](https://mdn.github.io/dom-examples/indexeddb-api/index.html).\n\n- The \"insert-adjacent\" directory contains basic demos for [insertAdjacentElement](https://mdn.github.io/dom-examples/insert-adjacent/insertAdjacentElement.html) and [insertAdjacentText](https://mdn.github.io/dom-examples/insert-adjacent/insertAdjacentText.html).\n\n- The \"matchmedia\" directory contains a basic demo to test matchMedia functionality. See [Window.matchMedia](https://developer.mozilla.org/docs/Web/API/Window/matchMedia) for more details. [Run the demo live](https://mdn.github.io/dom-examples/matchmedia/).\n\n- The \"mediaquerylist\" directory contains a basic demo to test more advanced matchMedia/mediaquerylist functionality. See [MediaQueryList](https://developer.mozilla.org/docs/Web/API/MediaQueryList) for more details. [Run the demo live](https://mdn.github.io/dom-examples/mediaquerylist/index.html).\n\n- The \"media\" directory contains examples and demos showing how to use HTML and DOM [media elements and APIs](https://developer.mozilla.org/docs/Web/Media).\n\n- The \"payment-request\" directory contains examples of the [Payment Request API](https://developer.mozilla.org/docs/Web/API/Payment_Request_API).\n\n- The \"pointerevents\" directory is for examples and demos of the [Pointer Events](https://developer.mozilla.org/docs/Web/API/Pointer_events) standard.\n\n- The \"pointer-lock\" directory contains a basic demo to show usage of the Pointer Lock API. You can find more explanation of how the demo works at the main MDN [Pointer Lock API](https://developer.mozilla.org/docs/Web/API/Pointer_Lock_API) page. [Run the demo live](https://mdn.github.io/dom-examples/pointer-lock/).\n\n- The \"popover-api\" directory is for examples and demos of the [Popover API](https://developer.mozilla.org/docs/Web/API/Popover_API) standard. Go to the [Popover API demo index](popover-api/) to see what's available.\n\n- The \"reporting-api\" directory contains a couple of basic demos to show usage of the Reporting API. You can find more explanation of how the API works in the main MDN [Reporting API](https://developer.mozilla.org/docs/Web/API/Reporting_API) docs. [Run the deprecation report demo live](https://mdn.github.io/dom-examples/reporting-api/deprecation_report.html).\n\n- The \"resize-event\" directory contains a basic demo to show how you can use the [resize event](https://developer.mozilla.org/docs/Web/API/Window/resize_event). Resize the browser window either by height or width to see the size of your current window. [Run the demo live](https://mdn.github.io/dom-examples/resize-event).\n\n- The \"screen-capture-api\" directory contains demos to show typical usage of the [Screen Capture API](https://developer.mozilla.org/docs/Web/API/Screen_Capture_API) and [Screen Capture Extensions](https://developer.mozilla.org/docs/Web/API/Screen_Capture_extensions).\n\n- The \"screenleft-screentop\" directory contains a demo to show how you could use the [Window.screenLeft](https://developer.mozilla.org/docs/Web/API/Window/screenLeft) and [Window.screenTop](https://developer.mozilla.org/docs/Web/API/Window/screenTop) properties to draw a circle on a canvas that always stays in the same physical place on the screen when you move your browser window. [Run the demo live](https://mdn.github.io/dom-examples/screenleft-screentop/).\n\n- The \"scrolltooptions\" directory contains a demo to show how you could use the [ScrollToOptions](https://developer.mozilla.org/docs/Web/API/ScrollToOptions) dictionary along with the [Window.ScrollTo()](https://developer.mozilla.org/docs/Web/API/Window/scrollTo) method to programmatically scroll a web page. [Run the demo live](https://mdn.github.io/dom-examples/scrolltooptions/).\n\n- The \"server-sent-events\" directory contains a very basic SSE demo that uses PHP to create the server. You can find more information in our [Using server-sent events](https://developer.mozilla.org/docs/Web/API/Server-sent_events/Using_server-sent_events) article. To run the demo you'll need to serve the files from a server that supports PHP; [MAMP](https://www.mamp.info/en/) is a good PHP test server environment.\n\n- The \"service-worker/simple-service-worker\" directory contains a simple demo showing how to use the [`Service Worker API`](https://developer.mozilla.org/en-US/docs/Web/API/Service_Worker_API) to manage your page's cache. [Run the demo live](https://mdn.github.io/dom-examples/service-worker/simple-service-worker/).\n\n- The \"sourcebuffer\" directory contains a basic demo to show usage of the [`SourceBuffer`](https://developer.mozilla.org/docs/Web/API/SourceBuffer) interface. [Run the demo live](https://mdn.github.io/dom-examples/sourcebuffer/).\n\n- The \"streams\" directory contains demos of the Streams API for using low-level I/O processing.\n\n- The \"touchevents\" directory is for examples and demos of the [Touch Events](https://developer.mozilla.org/docs/Web/API/Touch_events) standard.\n\n- The \"visual-viewport-api\" directory contains a basic demo to show usage of the Visual Viewport API. For more details on how it works, read [Visual Viewport API](https://developer.mozilla.org/docs/Web/API/Visual_Viewport_API). [View the demo live](https://mdn.github.io/dom-examples/visual-viewport-api/).\n\n- The \"web-animations-api\" directory contains [Web Animation API](https://developer.mozilla.org/docs/Web/API/Web_Animations_API) demos. See the [web animations README](web-animations-api/README.md) for more information.\n\n- The \"web-storage\" directory contains a basic demo to show usage of the Web Storage API. For more detail on how it works, read [Using the Web Storage API](https://developer.mozilla.org/docs/Web/API/Web_Storage_API/Using_the_Web_Storage_API). [View the demo live](https://mdn.github.io/dom-examples/web-storage/).\n\n- The \"view-transitions\" directory contains demos to show usage of the [View Transitions API](https://developer.mozilla.org/docs/Web/API/View_Transitions_API), both for single-page app [View the SPA demo live](https://mdn.github.io/dom-examples/view-transitions/spa/) and multiple-page app [View the MPA demo live](https://mdn.github.io/dom-examples/view-transitions/mpa/) view transitions.\n\n- The \"web-share\" directory contains a basic demo to show usage of the [Web Share API](https://developer.mozilla.org/docs/Web/API/Navigator/share). [View the demo live](https://mdn.github.io/dom-examples/web-share/).\n\n- The \"web-workers\" directory contains a basic web worker to demonstrate how [Web Workers](https://developer.mozilla.org/docs/Web/API/Web_Workers_API) work. [View the demo live](https://mdn.github.io/dom-examples/web-workers/simple-web-worker/).\n\n- The [\"webgl-examples\"](webgl-examples/README.md) directory contains a number of WebGL examples that demonstrate the [WebGL API](https://developer.mozilla.org/docs/Web/API/WebGL_API), which is used for 2D and 3D graphics on the web.\n\n- The \"webgpu-compute-demo\" directory contains an example that demonstrates basic usage of the [WebGPU API](https://developer.mozilla.org/docs/Web/API/WebGPU_API) compute pipeline, which is used for performing general computation on the GPU. [View the demo live](https://mdn.github.io/dom-examples/webgpu-compute-demo/).\n\n- The \"webgpu-render-demo\" directory contains an example that demonstrates basic usage of the [WebGPU API](https://developer.mozilla.org/docs/Web/API/WebGPU_API) render pipeline, which is used for rendering high-performance graphics via the GPU. [View the demo live](https://mdn.github.io/dom-examples/webgpu-render-demo/).\n\n- The \"window-management-api\" directory contains a basic demo to show usage of the [Window Management API](https://developer.mozilla.org/docs/Web/API/Window_Management_API). [View the demo live](https://mdn.github.io/dom-examples/window-management-api/).\n\n## Contribute to MDN Web Docs\n\nYou can contribute to MDN Web Docs and be a part of our community through content contributions, engineering, or translation work.\nThe MDN Web Docs project welcomes contributions from everyone who shares our goals and wants to contribute constructively and respectfully within our community.\n\nTo find out how to get started, see the [CONTRIBUTING.md](CONTRIBUTING.md) document in this repository.\nBy participating in and contributing to our projects and discussions, you acknowledge that you have read and agree to our [Code of Conduct](CODE_OF_CONDUCT.md).\n\n## Get in touch\n\nYou can communicate with the MDN Web Docs team and community using the [communication channels][].\n\n[communication channels]: https://developer.mozilla.org/en-US/docs/MDN/Community/Communication_channels\n"
        },
        {
          "name": "abort-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "audiocontext-setsinkid",
          "type": "tree",
          "content": null
        },
        {
          "name": "auxclick",
          "type": "tree",
          "content": null
        },
        {
          "name": "canvas",
          "type": "tree",
          "content": null
        },
        {
          "name": "channel-messaging-basic",
          "type": "tree",
          "content": null
        },
        {
          "name": "channel-messaging-multimessage",
          "type": "tree",
          "content": null
        },
        {
          "name": "css-painting",
          "type": "tree",
          "content": null
        },
        {
          "name": "document-picture-in-picture",
          "type": "tree",
          "content": null
        },
        {
          "name": "drag-and-drop",
          "type": "tree",
          "content": null
        },
        {
          "name": "edit-context",
          "type": "tree",
          "content": null
        },
        {
          "name": "fetch",
          "type": "tree",
          "content": null
        },
        {
          "name": "fullscreen-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "history-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "htmldialogelement-basic",
          "type": "tree",
          "content": null
        },
        {
          "name": "indexeddb-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "indexeddb-examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "insert-adjacent",
          "type": "tree",
          "content": null
        },
        {
          "name": "matchmedia",
          "type": "tree",
          "content": null
        },
        {
          "name": "media-session",
          "type": "tree",
          "content": null
        },
        {
          "name": "media",
          "type": "tree",
          "content": null
        },
        {
          "name": "mediaquerylist",
          "type": "tree",
          "content": null
        },
        {
          "name": "payment-request",
          "type": "tree",
          "content": null
        },
        {
          "name": "picture-in-picture",
          "type": "tree",
          "content": null
        },
        {
          "name": "pointer-lock",
          "type": "tree",
          "content": null
        },
        {
          "name": "pointerevents",
          "type": "tree",
          "content": null
        },
        {
          "name": "popover-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "reporting-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "resize-event",
          "type": "tree",
          "content": null
        },
        {
          "name": "resize-observer",
          "type": "tree",
          "content": null
        },
        {
          "name": "screen-capture-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "screen-wake-lock-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "screenleft-screentop",
          "type": "tree",
          "content": null
        },
        {
          "name": "scrolltooptions",
          "type": "tree",
          "content": null
        },
        {
          "name": "server-sent-events",
          "type": "tree",
          "content": null
        },
        {
          "name": "service-worker",
          "type": "tree",
          "content": null
        },
        {
          "name": "shadow-dom",
          "type": "tree",
          "content": null
        },
        {
          "name": "sourcebuffer",
          "type": "tree",
          "content": null
        },
        {
          "name": "streams",
          "type": "tree",
          "content": null
        },
        {
          "name": "to-do-notifications",
          "type": "tree",
          "content": null
        },
        {
          "name": "touchevents",
          "type": "tree",
          "content": null
        },
        {
          "name": "view-transitions",
          "type": "tree",
          "content": null
        },
        {
          "name": "visual-viewport-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-animations-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-crypto",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-share",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-speech-api",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-storage",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-workers",
          "type": "tree",
          "content": null
        },
        {
          "name": "webgl-examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "webgpu-compute-demo",
          "type": "tree",
          "content": null
        },
        {
          "name": "webgpu-render-demo",
          "type": "tree",
          "content": null
        },
        {
          "name": "window-management-api",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}