{
  "metadata": {
    "timestamp": 1736561624477,
    "page": 181,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "CreateJS/SoundJS",
      "stars": 4463,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.3251953125,
          "content": ".DS_Store\nbuild/output/\nbuild/tmp/\n*TMP*\nnode_modules/\nspikes/\n.idea/\n*.sublime-project\n*.sublime-workspace\nconfig.local.json\ndocs/**/\n\n#-----------------------------\n# INVALID FILES\n# (for cross OS compatibility)\n#-----------------------------\n*[\\<\\>\\:\\\"\\/\\\\\\|\\?\\*]*\n**/.sass-cache/\nmain.css\n*.codekit\ntests/.grunt\n_SpecRunner.html\n"
        },
        {
          "name": ".npmignore",
          "type": "blob",
          "size": 0.1123046875,
          "content": "_assets\nbuild\nbower.json\ndev\ndocs\nexamples\nextras\nicon.png\nlib/**-NEXT**.js\nspikes\nsrc\ntests\ntutorials\nVERSIONS.txt"
        },
        {
          "name": "ISSUE_TEMPLATE.md",
          "type": "blob",
          "size": 1.2333984375,
          "content": "### TODO\n- [ ] Is this a question or bug? [Stack Overflow](https://stackoverflow.com/questions/tagged/createjs) is a much better place to ask any questions you may have.\n\n- [ ] Did you search the [issues](https://github.com/CreateJS/SoundJS/issues) to see if someone else has already reported your issue? If yes, please add more details if you have any!\n\n- [ ] If you're using an older [version](https://github.com/CreateJS/SoundJS/blob/master/VERSIONS.txt), have you tried the latest?\n\n- [ ] If you're requesting a new feature; provide as many details as you can. Why do you want this feature? Do you have ideas for how this feature should be implemented? Pseudocode is always welcome!\n\n\n### Issue Details\n* Version used (Ex; 1.0): \n\n\n* Describe whats happening (Include any relevant console errors, a [Gist](https://gist.github.com/) is preferred for longer errors):\n\n\n\n* OS & Browser version *(Please be specific)* (Ex; Windows 10 Home, Chrome 62.0.3202.94):\n\n\n\n* Do you know of any workarounds?\n\n\n\n* Provide any extra details that will help us fix your issue. Including a link to a [CodePen.io](https://codepen.io) or [JSFiddle.net](https://jsfiddle.net) example that shows the issue in isolation will greatly increase the chance of getting a quick response.\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 1.0595703125,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2014 gskinner.com, inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.5048828125,
          "content": "# SoundJS\r\n\r\nSoundJS is a library to make working with audio on the web easier. It provides a consistent API for playing audio in\r\ndifferent browsers, including using a target plugin model to provide an easy way to provide additional audio plugins\r\nlike a Flash fallback (included, but must be used separately from the combined/minified version).\r\n\r\nA mechanism has been provided for easily tying in audio preloading to [PreloadJS](http://createjs.com/preloadjs/).\r\n\r\n\r\n## Example\r\n\r\n```javascript\r\ncreatejs.Sound.on(\"fileload\", handleLoadComplete);\r\ncreatejs.Sound.alternateExtensions = [\"mp3\"];\r\ncreatejs.Sound.registerSound({src:\"path/to/sound.ogg\", id:\"sound\"});\r\nfunction handleLoadComplete(event) {\r\n\tcreatejs.Sound.play(\"sound\");\r\n}\r\n```\r\n\r\n## License\r\nBuilt by gskinner.com, and released for free under the MIT license, which means you can use it for almost any purpose\r\n(including commercial projects). We appreciate credit where possible, but it is not a requirement.\r\n\r\n\r\n## Support and Resources\r\n* Find examples and more information at the [SoundJS web site](http://soundjs.com/)\r\n* Read the [documentation](http://createjs.com/docs/soundjs/)\r\n* Discuss, share projects, and interact with other users on [reddit](http://www.reddit.com/r/createjs/).\r\n* Ask technical questions on [Stack Overflow](http://stackoverflow.com/questions/tagged/soundjs).\r\n* File verified bugs or formal feature requests using Issues on [GitHub](https://github.com/CreateJS/SoundJS/issues).\r\n* Have a look at the included [examples](https://github.com/CreateJS/SoundJS/tree/master/examples) and\r\n[API documentation](http://createjs.com/docs/soundjs/) for more in-depth information.\r\n\r\n\r\n## Classes\r\n\r\n### [Sound](http://createjs.com/Docs/SoundJS/classes/Sound.html)\r\nThe core API for playing sounds. Call createjs.Sound.play(sound, ...options), and a sound instance is created that can be\r\nused to control the audio, and dispatches events when it is complete, loops, or is interrupted.\r\n\r\n### [SoundInstance](http://createjs.com/Docs/SoundJS/classes/AbstractSoundInstance.html)\r\nA controllable sound object that wraps the actual plugin implementation, providing a consistent API for audio playback,\r\nno matter what happens in the background. Sound instances can be paused, muted, and stopped; and the volume, pan (where\r\navailable), and position changed using the simple API.\r\n\r\n### [WebAudioPlugin](http://createjs.com/Docs/SoundJS/classes/WebAudioPlugin.html)\r\nThe default, built-in plugin, which uses Web Audio APIs to playback sounds. Note that WebAudio will fail to load when\r\nrun locally, and the HTML audio plugin will be used instead.\r\n\r\n### [HTMLAudioPlugin](http://createjs.com/Docs/SoundJS/classes/HTMLAudioPlugin.html)\r\nThe fallback built-in plugin, which manages audio playback via the HTML5 <audio> tag. This will be used in instances\r\nwhere the WebAudio plugin is not available.\r\n\r\n### [CordovaAudioPlugin](http://createjs.com/docs/soundjs/classes/CordovaAudioPlugin.html)\r\nAn additional plugin which will playback audio in a Cordova app and tools that utilize Cordova such as PhoneGap or Ionic.\r\nYou must manually register this plugin. Currently available on github since SoundJS-0.6.1.\r\n\r\n### [FlashAudioPlugin](http://createjs.com/Docs/SoundJS/classes/FlashAudioPlugin.html)\r\nAn additional plugin which uses a flash shim (and SWFObject) to playback audio using Flash. You must manually set up and\r\nregister this plugin.\r\n\r\n## [Documentation and examples](http://createjs.com/docs/soundjs/)\r\nHave a look at the included examples and API documentation for more in-depth information.\r\n"
        },
        {
          "name": "README_CREATEJS_NAMESPACE.txt",
          "type": "blob",
          "size": 1.0146484375,
          "content": "In this version of SoundJS, class definitions reside in a \"createjs\" namespace by default.\n\nFor example, instead of playing a sound like this:\nvar foo = SoundJS.play(id);\n\nYou will need to reach into the createjs namespace:\nvar bar = createjs.SoundJS.play(id);\n\nThis functionality is configurable though. You can easily shortcut the namespace or get rid of it completely.\n\nTo shortcut the namespace, just point a different variable at createjs it is loaded:\n<script src=\"easeljs.js\"></script>\n<script>\nvar c = createjs; // creates a reference to the createjs namespace in \"c\"\nvar foo = new c.Shape();\n</script>\n\nTo remove the namespace, just point the createjs variable at the window before loading the libraries:\n<script>\nvar createjs = window; // sets window as the createjs namespace (the object the classes will be defined in)\n</script>\n<script src=\"easeljs.js\"></script>\n\nThis will also make CreateJS libraries compatible with old content that did not use a namespace, such as the output from the Flash Pro Toolkit for CreateJS v1.0.\n"
        },
        {
          "name": "VERSIONS.txt",
          "type": "blob",
          "size": 21.716796875,
          "content": "Version 1.0.0 (September 14, 2017)\n****************************************************************************************************\nCRITICAL\n- removed deprecated properties, particularly getValue/setValue properties, in favour of .value\n\tthis particularly affects instance and global properties like mute, volume, pan, etc.\n- removed deprecated TYPE duplicates, notably the loader types (LoadQueue.SOUND, AbstractLoader.SOUND)\n\tin place of the Types.SOUND, and request methods (LoadQueue.POST, AbstractLoader.POST) in place\n\tof Methods.POST.\n- Deprecated get/set methods are now protect with an underscore (eg _setEnabled)\n\tThe deprecated methods and properties will still work, but will display a console warning when used.\n- Sound.play is no longer overloaded, and only takes a source and an initialization object\n\t(or PlayPropsConfig) instead of a bunch of arguments. A console warning will be displayed if  the\n\told approach is used, and additional arguments will be ignored.\n- Changed version naming to use soundjs.js, instead of containing the version number\n\n*****\n- changed XHR error conditions to only include 400-599. Specifically removed status=0 as an error,\n  \twhich affects compiled applications.\n- fixed issue where values don't get appended to GET requests in XHRRequest\n- added \"touchstart\" as an audio unlocking event, which seems to be the best for iOS\n- checked if preload candidates are videos, since SoundJS mistakenly handles these when they are mp4.\n- added missing Methods and Types classes from recent PreloadJS changes\n- handled case where audio duration returned < 0, resulting in a DOM Error\n- fixed issue where new instances wouldn't get the global mute/volume (thanks @PythonFanboy)\n- added a shared createjs.deprecate() method, which wraps old methods and property getter/setters to display\n\ta console warning when used.\n- fixed an issue with the initial 1.0.0 build that used a deprecated property that was improperly removed\n\n\nVersion 0.6.2 [November 26, 2015]\n****************************************************************************************************\nCRITICAL\n- fixed pan issue introduced in Chrome 44, where undefined pan defaulted to left channel only\n\n*****\n- fixed an issue in HTMLAudioPlugin that prevented SoundInstances created before loading was\n\tcomplete from playing (github issue 167)\n- Additional cleanup when setting duration\n- documentation and README updates\n- added a reuseable scratch buffer, instead of recreating each time (thanks @konistehrad/@naranjamcanica)\n- added automatic \"playEmptySound\" support on iOS to unlock the WebAudio context\n- bower updates: Removed bower.json from exclusions\n\n\nVersion 0.6.1-HOTFIX [October 8, 2015]\n****************************************************************************************************\nCRITICAL\n- fixed issue with panning in Chrome, caused by an unset pan value in WebAudio. This minor fix is\n\tprovided to fix existing content online that was broken with a browser update, and has been\n\tpatched on the CDN\n\n\tIf you need to use 0.6.1, there is a 0.6.1-HOTFIX branch in GitHub. Otherwise use 0.6.2 or newer.\n\n\nVersion 0.6.1 [May 21,2015]\n****************************************************************************************************\nCRITICAL (may break existing content):\n- removed support for ie8 and deprecated related get/set methods\n\n*****\n- fixed typo in HTMLAudioSoundInstance for this._stalledHandler from this.playFailed to this._playFailed\n- fixed a reference in WebAudioLoader from this._handleError to this._sendError\n- updated HTMLAudio loading to properly dispatch error events\n- fixed issue with reloading canceled audio when used with PreloadJS (github issue 143)\n- fixed issue that would break loaded audio if you registered it a 2nd time (github issue 148)\n- added AudioSprite class to document audiosprite more clearly\n- added muted and volume properties to Sound, and deprecated get/setMute and get/setVolume\n- added capabilities property to Sound, and deprecated getCapabilities and getCapability\n- refactor HTMLAudioTagPool as Chrome no longer requires tags be pre-created\n- deprecate HTMLAudioPlugin defaultNumChannels and cleaned up associated code\n- fixed github issue 154, FlashAudioPlugin not properly setting volume and pan on play calls\n- fixed FlashAudioSoundInstance bug that did not change loop value properly on playing instances\n- fixed registerSounds to support an object file with a path and manifest property (mimics preloadjs option)\n- added support for alternate loading paths and for loading files without extensions\n  via loading objects where src is an object that contains extension properties along with paths\n  example: {id:\"music\", src:{mp3:\"myMP3Path/music.mp3\", ogg:\"myOggPath/musicWithoutExtension\"}}\n- fixed setting duration on an existing SoundInstance in HTMLAudioSoundInstance\n- fixed setting duration on an existing SoundInstance in WebAudioPlugin\n- added SoundInstance.startTime support\n- added PlayPropsConfig class which is now used in all play calls.  Deprecated passing individual properties\n- added startTime and duration handling to SoundInstance.play when passed in an Object or PlayPropsConfig\n- added applyPlayProps to AbstractSoundInstance, to apply multiple properties at once\n- added defaultPlayProps to registerSound and registerSounds, allowing the setting of default play properties that will be applied to each new instance of a given src\n  example: {id: \"Humm (mp3)\", src: \"Humm.mp3\", defaultPlayProps:{interrupt:createjs.Sound.INTERRUPT_ANY, loop:-1, offset: 2000}}\n- added get/setDefaultPlayProps to Sound, allowing the retrieval and setting of default play properties that will be applied to each new instance of a given src\n- fix HTMLAudioPlugin.capabilities.panning value to be false\n- fix HTMLAudioPlugin.updateStartTime to correct HTMLAudioPlugin._updateStartTime\n- added CordovaAudioPlugin, for use with Cordova based apps including PhoneGap and Ionic\n- fix Sound.loadComplete throwing errors for src that has not been loaded instead of expected false\n- fix missing ._volume property on AbstractPlugin\n\n\nVersion 0.6.0 [December 12, 2014]\n************************************************************************************************************************\n**   Please note SoundJS 0.6.0 is only compatible with PreloadJS 0.6.0 and later. Earlier versions are incompatible. ***\n************************************************************************************************************************\nCRITICAL (may break existing content):\n- removed preload property from Sound.registerSound and Sound.registerManifest, as it is only used by PreloadJS\n- changed WebAudioPlugin dynamicsCompressorNode and gainNode to be instance level rather than static class level\n  this is now accessed via createjs.Sound.activePlugin.dynamicsCompressorNode rather than\n  createjs.WebAudioPlugin.dynamicsCompressorNode\n- removed iOS disabling by default on HTMLAudioPlugin\n- SoundInstance stop, setVolume, setPan, setPosition now return a reference to the instance, instead of a Boolean,\n\twhich is useful for chaining calls.\n- deprecated SoundInstance pause/resume methods, please use SoundInstance.paused property instead.\n- renamed FlashPlugin to FlashAudioPlugin, deprecated FlashPlugin for next release, including the VERSION file.\n- removed deprecated code and cleaned up supporting code for deprecated \"|\" loading approach\n- re-architected the class and inheritance model\n\t- initialize methods removed, use MySuperClass_constructor instead\n\t- helper methods: extend & promote (see the \"Utility Methods\" docs)\n\t- property definitions are now instance level, and in the constructor (performance gains)\n\t- the .constructor is now set correctly on all classes (thanks kaesve)\n\n*****\n- Added constructors to all non-static classes (Thanks kaesve)\n- fixed an issue that caused interrupt early/late to pick a playing sound over an finished sound when all instances are used\n- added new event methods on and off to defaultSoundInstance to prevent errors\n- fixed issue with windows phone reporting as iPhone\n- fixed an issue with WebAudioPlugin that was not passing the correct parameter for disconnecting nodes\n- added audio sprite support and documentation\n- added AudioSprite.html to examples\n- fixed an issue with HTMLAudioPlugin that was not removing tags from DOM when removing src from SoundJS\n- altered HTMLAudioPlugin so that SoundInstance will have duration immediately on creation\n- updated removeAllSounds to check for activePlugin before calling to prevent errors\n- corrected error display wording in MusicVisualizer example\n- fixed HTMLAudioPlugin typo on SoundInstance.src declaration\n- fixed WebAudioPlugin bug, sourceNode was not being properly set to null on pause and setPosition\n- added readonly paused property to SoundInstance\n- Added Bower support, including Grunt task for automatically updating the bower.json\n- Added .gitignore to subfolders under /docs (thanks mcfarljw)\n- Improved EventDispatcher's handling of redispatched event objects\n- Changed behavior of SoundInstance.play to be consistent across all plugins.\n  The new behavior is the following:\n    if playing, keep playing (aka do nothing)\n    if paused, resume\n    if stopped, start\n  Note this will still accept and apply play call arguments, so you can change offset, volume, etc\n- Changed SoundInstance.play to handle all arguments on playing, paused, and stopped instances\n- added public loop property to SoundInstance\n- fixed an issue with FlashAudioPlugin that would set position to an incorrect value when pausing\n- changed FlashAudioPlugin to grab the duration of audio as soon as a SoundInstance is created\n- fixed progress event of WebAudioPlugin Loader, for use with PreloadJS\n- Implemented new base classes for Plugin, SoundInstance, and SoundLoader.\n- SoundInstance added properties duration, position, loop, mute, pause (with backup methods for browser that do not support getter/setters)\n- SoundInstance added method destroy\n- deprecated registerManifest and removeManifest in favor of registerSounds and removeSounds\n- moved BrowserDetect into a util and changed namespace to createjs.BrowserDetect\n- Updated documentation to include abstract classes and all plugin classes.\n- Added support for setting WebAudioPlugin.context.  Note that it needs to be set before plugins are instantiated.\n- Added fileerror event, dispatched when internal loading fails.\n- registerSounds & removeSounds now handles a path property in the passed in manifest of sounds.\n\n\nVersion 0.5.2 [December 12, 2013]\n************************************************************************************************************************\n- updated tutorials for changes in this build\n- updates and fixes to all docs\n- added {\"AllowScriptAccess\" : \"always\"} to swfObject for FlashPlugin\n- all Sound, WebAudioPlugin, HTMLAudioPlugin, FlashPlugin, and SoundInstance internal properties and methods renamed to\n\tstart with _ (underscore)\n- fixed a bug with default SoundInstance, it did not have playFailed function that is called by Sound\n- fixed a bug that prevented interrupt value from being read in play call if it was passed in an object\n- changed SoundInstance to extend createjs.EventDispatcher rather than mix in\n- alterations to basePath approach that require full src (basePath + src) in create and play calls\n- include basePath in removeSound and removeManifest, which is now required if it was included in loading\n- introduced createjs.Sound.alternateExtensions, which is replacing a delimited list as a means to load alternate\n\tfile types\n- deprecated \"|\" approach to alternate files, in favor of class level alternateExtensions approach\n- deprecated registerPlugin in favor of registerPlugins with a single argument\n- deprecated FlashPlugin BASE_PATH in favor swfPath\n- added console logs deprecated calls above are used\n- added willTrigger() method to EventDispatcher\n\n\nVersion 0.5.1 [November 15, 2013]\n************************************************************************************************************************\n- suppressing errors in WebAudioPlugin and HTMLAudioPlugin in old browsers that do not properly support\n\tobject.defineProperty\n- changes to WebAudioPlugin to allow it to work with latest working draft of Web Audio API\n- WebAudioPlugin changed SoundInstance node order to SourceNode -> PanNode -> GainNode --> context.destination to get\n  around firefox bug https://bugzilla.mozilla.org/show_bug.cgi?id=933304\n\n\nVersion 0.5.0 [September 25, 2013]\n************************************************************************************************************************\nCRITICAL (may break existing content):\n- removed all onEvent handlers (ex. onClick, onTick, onAnimationEnd, etc)\n- updated EventDispatcher with latest bubbling model, and the Event class\n\n*****\n- altered all libraries to use defined object properties instead of object literal notation.\n- namespaced all sub apis to related plugin, ie createjs.WebAudioPlugin.SoundInstance\n- implemented createjs Utils\n- implemented \"use strict\" mode\n- removed deprecated methods and properties, doc'd as removed.\n- updated WebAudioPlugin to handle new calls and deprecated calls (http://www.w3.org/TR/webaudio/#DeprecationNotes).\n- added enableIOS property to HTMLAudioPlugin,allowing advanced users to enable HTMLAudioPlugin on iOS (not recommended).\n- Overloaded play call in Sound and SoundInstance to allow options to be passed in as an object,\n\tie play(\"music\", {loop: -1, volume: 0.5})\n- Changed WebAudioPlugin to test if XHR is available for local files rather than assuming it is not.\n- implement basePath support for local loading and with PreloadJS\n- updated registerSound and registerManifest to return true if a source has already been loaded.\n- added getter/setter to volume and pan of SoundInstance, to allow tweening.\n- added polyfil for Array.indexOf to allow IE8 support\n- fixed an issue with Sound.removeSound not stopping audio with that src.\n- fixed an issue with pause and setPosition on audio files that are not looping, which would generate an error in\n\tWebAudioPlugin.\n- fixed a bug with WebAudioPlugin that stopped SoundInstances from being reusable.\n- fixed an issue with EventDispatcher when adding the same listener to an event twice\n- Updated the build process to use NodeJS & Grunt.js. Please refer to the readme in the build folder.\n\n\nVersion 0.4.1 [May 10, 2013]\n************************************************************************************************************************\n- Added removeSound, removeManifest, and removeAllSounds functions to Sound, to enable unloading of sounds.\n- Added MobileSafe demo to show launching an \"app\" inside a touch event, enabling audio playback on mobile devices\n- Added playEmptySound() method, which facilitates playback on mobile devices without user interaction\n- HTMLAudioPlugin now using tag loop property to provide more reliable looping\n- WebAudioPlugin added a look ahead approach to enable smooth looping\n- Updated WebAudioPlugin to use a specific panning model (equal power). Matches the sound quality of the other plugins\n- Fixed an issue that stopped WebAudioPlugin from loading sound files other than ogg, mp3, and wav with PreloadJS\n- Fixed playback for secondary sounds in HTMLAudio Plugin that affected Firefox\n- Fixed an issue with duration for secondary sounds in HTMLAudioPlugin in Firefox\n- Fixed issue where failed or interrupted sound channels could not be used, resulting in less instances available then\n\texpected.\n- Updated file validation RegExp. Supports double-byte characters, prevents partial matches, better\n\tsupport for relative paths, improved matching of domains, and modified the \"file name\" match to\n\tinclude the extension (file.mp3 instead of file). The match arguments have not changed otherwise.\n- Added support for PhoneGap in WebAudioPlugin that allows it to be used on mobile devices\n- Fixed naming of the fileload event (used to be \"loadComplete\"). The old event is still dispatched, but is deprecated\n- Renamed the internal \"sendLoadComplete\" method to \"sendFileLoadEvent\"\n- Fixed cleanup routine to happen before the Sound and instance events are dispatched, which caused issues if affecting\n\tthe sound immediately after receiving the event.\n- Corrected missing namespaces in SoundInstance overview\n- Fixed playing sounds by ID that are preloaded using the Sound.registerSound() method\n- Fixed path parsing in the createInstance method (thanks maljub01)\n- Moved embedded SWF into a container, and positioned it off-screen\n- Fixed documentation:\n\t* FlashPlugin: Main description caused FlashPlugin to not export correct documentation\n\t* SoundInstance/setMute was documented as a duplicate of mute\n\t* SoundInstance main example had incorrect event for \"failed\"\n\t* Added code samples throughout\n\t* Minor updates throughout documentation to formatting, wording, parameters, and private/protected\n- Updated browser limitations:\n\t* iOS6: include info on web audio distortion bug when video element is present\n\t* Android: issues with HTML audio in Android Chrome\n\t* Flash: Audio delays when using the FlashPlugin\n\t* IE9: Information on the audio tag limit.\n\t* Safari: added info about requiring Quicktime for audio playback.\n\n\nVersion 0.4.0 [Feb 12, 2013]\n************************************************************************************************************************\n**   Please note PreloadJS 0.3.0 requires SoundJS 0.4.0 to preload audio. Earlier versions are incompatible. ***********\n************************************************************************************************************************\n- Class name change to createjs.Sound from createjs.SoundJS\n- Added versions file that is automatically updated via the build process, which provides run-time\n\tversion information on the new SoundJS object\n- A few major performance updates\n- Added default support for M4A, MP4, aiff, wma, and mid audio formats\n- Changed how file extension support is determined so changes only need to be made to SoundJS\n- Revised path parsing to support a larger range of file path formats\n- Added sound registration and manifest registration allowing simple internal preloading, so Sounds can preload and play\n\twithout PreloadJS.  This includes callback and EventDispatch as files load.\n- Added default behavior to load src when play is called if src has not been registered or preloaded\n- Removed global pause/resume\n- Removed global setMasterVolume, in place of SoundJS.setVolume(), which is now global volume\n- Added global volume/mute methods on plugins, can be used in place of setting properties of all instances and exist\n\tindependent of those same properties on instances\n- Added proper global mute, which affects sounds globally, instead of just applying mute to sounds\n- Changed mute() to getMute() and setMute() on SoundJS and SoundInstances\n- Removed id-based lookup\n- Revised plugin approach, and simplified internal APIs\n- Added EventDispatcher functionality to SoundJS and SoundInstance\n- Added onSuccess callback and success event to SoundInstance to report successful play.\n- Official WebAudio support via the new WebAudioPlugin, which is now the default audio handler\n- Added create() method on SoundJS, which can be used to create a stopped sound\n- Changed setPosition() method on SoundInstance so it is available on stopped instances\n- Changed getDuration() method on SoundInstance so it returns the duration of stopped instances, instead of 0\n- Changed default values set when SoundJS.play is called so instances retain position, volume, and pan unless explicitly\n\tchanged\n- Replaced proxy on Sound with a proxy on createjs namespace, createjs.proxy(method, scope, args*);\n- Fixed issue to how delay was handled in SoundInstance so it will not fire if pause() or stop() is called before\n\tplayback begins\n- Fixed issues with indexOf that were sometimes preventing stop/mute, etc.\n- Fixed issue with initial mute state in FlashPlugin\n- Fixed an issue in FlashPlugin that caused getDuration to always return 0\n- Fixed an issue in FlashPlugin that would cause a looping sound to loop from the same point it was paused from or set\n\tposition to\n- Fixed loop callback in FlashPlugin SoundInstance (previously it would not be called).\n- Fixed an issue with FlashPlugin in IE that caused a race condition due to caching, which would stop it from working\n\tsometimes\n- Fixed an issue with FlashPlugin that would cause a paused instance, once resumed, to not fire onComplete callback.\n- Fixed an issue in HTMLAudioPlugin that caused it to incorrectly return isSupported as true when it should be false\n- Better documentation throughout\n- Improved examples in documentation\n- Added tutorials: Basics, Mobile-safe approach, and SoundJS & PreloadJS.\n\n\nVersion 0.3.0 [Aug 24, 2012]\n****************************************************************************************************\n- moved all classes into a configurable createjs namespace\n- Added better support for missing sounds. SoundJS returns a lightweight instance that won't fail\n\twhen calls are made on it.\n- Added static mute/unmute methods to independently control a global mute property.\n- Added support for preloading WAV files\n- Fixed flash preload support when in tag mode\n- Added lightweight flash instance, which is code only\n- Added a debug flag [showOutput] to FlashPlugin, which will log Flash Activity\n- Fixed issue with canPlayType throwing runtime in non-supported browsers.\n\n\nVersion 0.2.0\n****************************************************************************************************\nSecond release, corresponding with the release of the CreateJS suite of tools (createjs.com).\nThis version includes a target plugin model that abstracts audio playback to various plugins, which\ncan be prioritized. Other updates include controllable sound instances, which are returned when a\nsound is played, providing a much easier way to control audio once it has started playback.\n\n\nVersion 0.1.0\n****************************************************************************************************\nInitial release.******************************************************************\nInitial release.\n"
        },
        {
          "name": "_assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "bower.json",
          "type": "blob",
          "size": 0.748046875,
          "content": "{\n\t\"name\": \"SoundJS\",\n\t\"version\": \"1.0.0\",\n\t\"homepage\": \"https://github.com/CreateJS/SoundJS\",\n\t\"authors\": [\n\t\t\"lannymcnie\",\n\t\t\"gskinner\",\n\t\t\"wdamien\"\n\t],\n\t\"description\": \"A Javascript library for working with Audio. Features a simple interface as the front end to multiple audio APIs via a plugin model. Currently supports WebAudio, HTML5 Audio, and a Flash fallback. Part of the CreateJS suite of libraries.\",\n\t\"main\": \"lib/soundjs.js\",\n\t\"keywords\": [\n\t\t\"sound\",\n\t\t\"audio\",\n\t\t\"webaudio\",\n\t\t\"html5\",\n\t\t\"createjs\"\n\t],\n\t\"license\": \"MIT\",\n\t\"ignore\": [\n\t\t\"**/.*\",\n\t\t\"node_modules\",\n\t\t\"_assets\",\n\t\t\"bower_components\",\n\t\t\".bower.json\",\n\t\t\"build\",\n\t\t\"dev\",\n\t\t\"docs\",\n\t\t\"examples\",\n\t\t\"icon.png\",\n\t\t\"LICENSE.txt\",\n\t\t\"README.md\",\n\t\t\"src\",\n\t\t\"tutorials\",\n\t\t\"VERSIONS.txt\"\n\t]\n}"
        },
        {
          "name": "build",
          "type": "tree",
          "content": null
        },
        {
          "name": "dev",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "icon.png",
          "type": "blob",
          "size": 2.787109375,
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.9091796875,
          "content": "{\n  \"name\": \"soundjs\",\n  \"npmName\": \"soundjs\",\n  \"version\": \"1.0.2\",\n  \"description\": \"A JavaScript library that provides a simple API, and powerful features to make working with audio a breeze. Easily ties in audio file loading to PreloadJS.\",\n  \"main\": \"lib/soundjs.js\",\n  \"jsdelivr\": \"lib/soundjs.min.js\",\n  \"directories\": {\n    \"doc\": \"docs\",\n    \"example\": \"examples\",\n    \"lib\": \"lib\",\n    \"test\": \"tests\"\n  },\n  \"npmFileMap\": [\n    {\n      \"basePath\": \"lib\",\n      \"files\": [\n        \"**/*\"\n      ]\n    }\n  ],\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/CreateJS/SoundJS.git\"\n  },\n  \"keywords\": [\n    \"createjs\",\n    \"soundjs\",\n    \"gskinner\",\n    \"javascript\",\n    \"audio\",\n    \"webaudio\",\n    \"html5\",\n    \"flash\"\n  ],\n  \"author\": \"gskinner.com, inc.\",\n  \"license\": \"MIT\",\n  \"bugs\": {\n    \"url\": \"https://github.com/CreateJS/SoundJS/issues\"\n  },\n  \"homepage\": \"https://createjs.com/soundjs/\"\n}\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "tutorials",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}