{
  "metadata": {
    "timestamp": 1736561605797,
    "page": 154,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "patrickkunka/mixitup",
      "stars": 4538,
      "defaultBranch": "v3",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0634765625,
          "content": "node_modules\ncomponents\n.tmp\n.DS_Store\n.log\nnpm-debug.*\ncoverage/"
        },
        {
          "name": ".jscsrc",
          "type": "blob",
          "size": 2.61328125,
          "content": "{\n    \"requireCurlyBraces\": [\n        \"else\",\n        \"for\",\n        \"while\",\n        \"do\",\n        \"try\",\n        \"catch\"\n    ],\n    \"requireSpaceAfterKeywords\": [\n        \"if\",\n        \"else\",\n        \"for\",\n        \"while\",\n        \"do\",\n        \"case\",\n        \"return\",\n        \"try\",\n        \"typeof\"\n    ],\n    \"safeContextKeyword\": [\"self\"],\n    \"maximumLineLength\": {\n      \"value\": 140,\n      \"allowComments\": true,\n      \"allowRegex\": true\n    },\n    \"requireSpaceBeforeBlockStatements\": true,\n    \"requireParenthesesAroundIIFE\": true,\n    \"requireSpaceAfterLineComment\": {\n        \"allExcept\": [\"#\", \"=\"]\n    },\n    \"requireSpacesInConditionalExpression\": true,\n    \"disallowSpacesInNamedFunctionExpression\": {\n        \"beforeOpeningRoundBrace\": true\n    },\n    \"disallowSpacesInFunctionDeclaration\": {\n        \"beforeOpeningRoundBrace\": true\n    },\n    \"disallowFunctionDeclarations\": false,\n    \"requireSpaceBetweenArguments\": true,\n    \"requireMultipleVarDecl\": false,\n    \"requireBlocksOnNewline\": true,\n    \"requireSemicolons\": true,\n    \"disallowEmptyBlocks\": true,\n    \"disallowSpacesInsideArrayBrackets\": true,\n    \"disallowSpacesInsideParentheses\": true,\n    \"requireCommaBeforeLineBreak\": true,\n    \"requireLineBreakAfterVariableAssignment\": true,\n    \"requirePaddingNewlinesBeforeKeywords\": [\n        \"do\",\n        \"for\",\n        \"if\",\n        \"switch\",\n        \"try\",\n        \"void\",\n        \"while\",\n        \"return\"\n    ],\n    \"requirePaddingNewLinesInObjects\": true,\n    \"disallowSpaceAfterPrefixUnaryOperators\": true,\n    \"disallowSpaceBeforePostfixUnaryOperators\": true,\n    \"disallowSpaceBeforeBinaryOperators\": [\n        \",\"\n    ],\n    \"requireSpacesInForStatement\": true,\n    \"requireSpaceBeforeBinaryOperators\": true,\n    \"requireSpaceAfterBinaryOperators\": true,\n    \"disallowKeywords\": [\n        \"with\"\n    ],\n    \"validateIndentation\": 4,\n    \"disallowMixedSpacesAndTabs\": true,\n    \"disallowTrailingWhitespace\": true,\n    \"disallowTrailingComma\": true,\n    \"disallowKeywordsOnNewLine\": [\n        \"else\"\n    ],\n    \"requireCapitalizedConstructors\": true,\n    \"disallowNewlineBeforeBlockStatements\": true,\n    \"disallowMultipleLineStrings\": true,\n    \"disallowMultipleLineBreaks\": true,\n    \"requireSpaceBeforeObjectValues\": true,\n    \"validateQuoteMarks\": \"'\",\n    \"jsDoc\": {\n        \"checkAnnotations\": true,\n        \"requireParamTypes\": true,\n        \"checkParamNames\": true,\n        \"checkParamExistence\": true,\n        // \"checkRedundantParams\": true,\n        \"checkReturnTypes\": true,\n        \"requireNewlineAfterDescription\": true,\n        // \"requireParamDescription\": true,\n        \"requireDescriptionCompleteSentence\": true\n    }\n}"
        },
        {
          "name": ".jshintrc",
          "type": "blob",
          "size": 0.392578125,
          "content": "{\n    \"esnext\": true,\n    \"-W030\": true,\n    \"-W053\": true,\n    \"-W084\": true,\n    \"-W055\": true,\n    \"-W069\": true,\n    \"-W097\": true,\n    \"-W087\": true,\n    \"undef\": true,\n    \"unused\": true,\n    \"laxbreak\": true,\n    \"node\": true,\n    \"browser\": true,\n    \"predef\": [\n        \"window\",\n        \"Promise\",\n        \"define\",\n        \"console\",\n        \"describe\",\n        \"after\",\n        \"it\"\n    ]\n}"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.072265625,
          "content": "language: node_js\nnode_js:\n  - \"node\"\nafter_success:\n  - npm run coveralls"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 3.7275390625,
          "content": "Change Log\n==========\n\n## 3.3.2\n- Non run-time changes to licensing and distribution model\n\n## 3.3.1\n- Insures dataset uses polyfilled `Array.from` for old IE support.\n- Fixes support for sorting via element collection. This was not correctly implemented before although documented.\n- Fixes the \"filter-by-url\" demo to ensure that only leading `'.'` characters are stripped off rather than any character.\n\n## 3.3.0\n- Introduces new internal filter hook `testResultEvaluateHideShown` allowing plugins to manipulate the result of every filter test upon a target. Provides an convenient entry point for non-selector based filtering such as range slider inputs.\n- Adds range slider demo.\n\n## 3.2.2\n- Fixes issue where multiple toggle controls are not automatically activated when a compound selector is specified to `load.filter`.\n- Fixes issue where calling `.toggleOff()` and passing a non-existent selector will deactivate all other active toggles.\n- Fixes issue where padding whitespace around a DOM string when calling `.insert()` caused an exception.\n- Adds additional demos for non-standard UI.\n\n## 3.2.1\n- Additional edge-case work relating to Dataset API fix in v3.2.0.\n- Addition of `.forceRender()` mixer API method.\n- Removes `.multiMix()` legacy API alias method.\n\n## 3.2.0\n- Removes support for legacy `$().mixItUp()` jQuery API\n- Fixes issue with Dataset API causing DOM exception when dealing with certain combinations of simultaneous insertion and sorting.\n\n## 3.1.12\n- Fixes issue where `state.targets` does not reflect the updated sort order after a sort operation.\n- Addition of `behavior.liveSort` configuration option.\n\n## 3.1.11\n\n- Various geometry improvements related to scroll bar issues on desktop Windows and (non-inertial scroll) desktop Mac systems.\n- Addition of `animation.clampWidth` configuration option.\n\n## 3.1.10\n\n- Fixes an issue where the `activeContainerClass` did not persist between non-layout-change operations (e.g. sort, filter).\n\n## 3.1.9\n\n- Fixes an issue relating to `animation.clampHeight` where the height was not correctly applied causing scroll jumping in certain situations.\n\n## 3.1.8\n\n- Adds ability to bind live controls where multiple parents exist. Required for Pagination 3.2.0.\n\n## 3.1.7\n\n- Fixed duplicate hook `beforeCacheDom` in `Target#cacheDom`. Now renamed to `afterCacheDom`.\n\n## 3.1.6\n\n- Added composer.json\n\n## 3.1.5\n\n- Fixed several issues relating to the Dataset API and multimix-like operations (i.e. simultaneous insertion/removal/sorting/dirty-checking)\n\n## 3.1.4\n\n- Added ability to extend static factory methods (such as `mixitup.use`) with hooks.\n- Added ability to return a single DOM element from `render.target` instead of an HTML string\n- Moved target rendering functionality into `Target` class, so that targets can render themselves\n- Force disable controls if dataset API is in use (if `data.uidKey` is set)\n\n## 3.1.3\n\n- Exposed `.toggleOn()` and `.toggleOff()` API methods publicly via the mixer facade, as were accidently missed out previously.\n\n## 3.1.2\n\n- Improved `compareVersions` util function to handle semver notation correctly (e.g. `'^'`, `'~'`, `'-beta'`, etc).\n- Fixed issue with \"Filtering by URL\" demo that added a `#mix` segment to the URL for filter \"all\"\n\n## 3.1.1\n\n- Fixed issue where `transitionend` event handlers were not rebound to re-rendered targets during dirtyCheck updates.\n- Fixed issue where dataset operation objects where created on push to queue, resulting in corrupted target data.\n\n## 3.1.0\n\n- Added `selectors.controls` configuration option to allow for further specificity of control querying\nin addition to the mandatory data attributes.\n- Fixed package.json issues.\n\n## 3.0.1\n\n- Fixed issue where `layout.containerClassName` is not reflected in state object after instantiation.\n\n## 3.0.0\n\n- Release"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 11.08984375,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.5029296875,
          "content": "# 📣 November 2024 Update 📣\n\n### Changes to License Model\n\nAs MixItUp turns 10 years old (and having remained unchanged since ~2018) it will be moving to a **fully open source** and publicly available model. This means that from 1st November 2024, you no longer need to purchase a license for commercial use.\n\nAdditionally, the MixItUp project and its extensions will become **fully archived** meaning that no future changes will be made. MixItUp has been stable for many years and remains in use across tens of thousands of web sites and applications worldwide. If you wish to use it on a brand-new project and it meets your needs, then you should feel confident in doing so provided you do not require support.\n\n### Pagination and MultiFilter Extensions\n\nThe Pagination and MultiFilter extensions, which were previously closed source and only available via purchase, have also been been made publicly available on GitHub, and may now be used without purchase or a commercial license.\n\n- [www.github.com/patrickkunka/mixitup-pagination](https://www.github.com/patrickkunka/mixitup-pagination)\n- [www.github.com/patrickkunka/mixitup-multifilter](https://www.github.com/patrickkunka/mixitup-multifilter)\n\n### Documentation Website\n\nThe documentation website has been retired in favor of GitHub. All documentation and tutorials are available via this GitHub repository, or the repository of the relevant extension (see above).\n\n### Demos\n\nHosted interactive demos may be found at [patrickkunka.github.io/mixitup/demos](https://patrickkunka.github.io/mixitup/demos). The documented source code of each demo can be found in the [/demos](./demos/) directory if this repository.\n\nDemos for the Pagination and MultiFilter extensions can be found linked to in their respective repositories.\n\n---\n\n# MixItUp 3\n\n[![Latest Release](https://img.shields.io/npm/v/mixitup.svg?style=flat-square)](https://www.npmjs.com/package/mixitup)\n[![jsDelivr Hits](https://data.jsdelivr.com/v1/package/gh/patrickkunka/mixitup/badge?style=rounded)](https://www.jsdelivr.com/package/gh/patrickkunka/mixitup)\n\nMixItUp is a high-performance, dependency-free library for animated DOM manipulation, giving you the power to filter, sort, add and remove DOM elements with beautiful animations.\n\nMixItUp plays nice with your existing HTML and CSS, making it a great choice for responsive layouts and compatible with inline-flow, percentages, media queries, flexbox and more.\n\nMigrating from MixItUp 2? Check out the [MixItUp 3 Migration Guide](./docs/mixitup-3-migration-guide.md).\n\n#### Licensing\n\nMixItUp is open source and free to use for all use cases, under the Apache 2.0 license.\n\n#### Documentation\n\n- [Factory Function](./docs/mixitup.md)\n- [Configuration Object](./docs/mixitup.Config.md)\n- [Mixer API Methods](./docs/mixitup.Mixer.md)\n- [State Object](./docs/mixitup.State.md)\n- [Mixer Events](./docs/mixitup.Events.md)\n\n#### Tutorials\n\n##### [Integrating MixItUp into Your Project](./tutorials/integrating-mixitup-into-your-project.md)\n\nMixItUp can be used with static sites, CMSs, web apps and more. This tutorial will help you choose the right integration for your project.\n\n##### [Filtering with MixItUp](./tutorials/filtering-with-mixitup.md)\n\nA summary of the various filtering techniques available in MixItUp – filter/toggle controls, multidimensional filtering, and the filter API.\n\n##### [Sorting with MixItUp](./tutorials/sorting-with-mixitup.md)\n\nA summary of the various sorting techniques available in MixItUp – default sort, attribute sort, multi-attribute sort, and the sort API.\n\n##### [MixItUp Grid Layouts](./tutorials/mixitup-grid-layouts.md)\n\nA summary of the three most common approaches to responsive grids – inline-block, flex-box, and floats – in the context of MixItUp.\n\n##### [Marking Up MixItUp Containers](./tutorials/marking-up-mixitup-containers.md)\n\nThis tutorial explores various container markup structures, and explains what is and isn't possible with MixItUp.\n\n##### [Filtering and Sorting on Load](./tutorials/filtering-and-sorting-on-load.md)\n\nA look at how we can use the configuration object to load MixItUp in a state other than its default filtering and sorting behavior.\n\n##### [Using the Dataset API](./tutorials/using-the-dataset-api.md)\n\nNew to MixItUp 3, the Dataset API allows interaction with MixItUp purely via changes to a data model, avoiding the use of DOM selectors.\n\n#### Browser Support\n\nMixItUp 3 has been tested for compatibility with the following browsers.\n\n- Chrome 16+\n- Firefox 16+\n- Safari 6.2+\n- Yandex 14+\n- Edge 13+\n- IE 10+ (with animations), IE 8-9 (no animations)\n\n## Getting Started\n\n#### Contents\n\n- [Building the Container](#building-the-container)\n- [Building Controls](#building-controls)\n- [Styling the Container](#styling-the-container)\n- [Loading MixItUp](#loading-mixitup)\n- [Creating a Mixer](#creating-a-mixer)\n- [Configuration](#configuration)\n\nMost commonly, MixItUp is applied to a **\"container\"** of **\"target\"** elements, which could be a portfolio of projects, a list of blog posts, a selection of products, or any kind of UI where filtering and/or sorting would be advantageous.\n\nTo get started, follow these simple steps:\n\n### Building the Container\n\nBy default, MixItUp will query the container for targets matching the selector `'.mix'`.\n\n```html\n<div class=\"container\">\n    <div class=\"mix category-a\" data-order=\"1\"></div>\n    <div class=\"mix category-b\" data-order=\"2\"></div>\n    <div class=\"mix category-b category-c\" data-order=\"3\"></div>\n    <div class=\"mix category-a category-d\" data-order=\"4\"></div>\n</div>\n```\n\nTargets can be filtered using any valid selector e.g. `'.category-a'`, and are sorted via optional custom data attributes e.g. `'data-order'`.\n\nFurther reading: [Marking-up MixItUp Containers](./tutorials/marking-up-mixitup-containers.md)\n\n### Building Controls\n\nOne way that filtering and sorting happens is when controls are clicked. You may use any clickable element as a control, but `<button type=\"button\">` is recommended for accessibility.\n\n#### Filter Controls\n\nFilter controls are queried based on the presence of a `data-filter` attribute, whose value must be `'all'`, `'none'`, or a valid selector string e.g. `'.category-a'`.\n\n```html\n<button type=\"button\" data-filter=\"all\">All</button>\n<button type=\"button\" data-filter=\".category-a\">Category A</button>\n<button type=\"button\" data-filter=\".category-b\">Category B</button>\n<button type=\"button\" data-filter=\".category-c\">Category C</button>\n```\n\nFurther reading: [Filtering with MixItUp](./tutorials/filtering-with-mixitup.md)\n\n#### Sort Controls\n\nSort controls are queried based on the presence of a `data-sort` attribute, whose value takes the form of a \"sort string\" made up of the name of the attribute to sort by, followed by an optional colon-separated sorting order e.g. `'order'`, `'order:asc'`, `'order:desc'`.\n\n```html\n<button type=\"button\" data-sort=\"order:asc\">Ascending</button>\n<button type=\"button\" data-sort=\"order:descending\">Descending</button>\n<button type=\"button\" data-sort=\"random\">Random</button>\n```\n\nThe values `'default'` and `'random'` are also valid, with `'default'` referring to the original order of target elements in the DOM at the time of mixer instantiation.\n\nFurther reading: [Sorting with MixItUp](./tutorials/sorting-with-mixitup.md)\n\n### Styling the Container\n\nWhile MixItUp can be added on top of any existing CSS layout, we strongly recommend inline-block or flexbox-based styling over floats and legacy grid frameworks when dealing with grid-based designs for a number of reasons.\n\nFurther reading: [MixItUp Grid Layouts](./tutorials/mixitup-grid-layouts.md)\n\n### Loading MixItUp\n\nFirstly, load the MixItUp JavaScript library using the preferred method for your project.\n\n#### Script Tag\n\nThe most simple way to load MixItUp in your project is to include it via a `<script>` tag before the closing `</body>` tag on your page.\n\n```html\n        ...\n\n        <script src=\"/path/to/mixitup.min.js\"></script>\n    </body>\n</html>\n```\n\nWith this technique, the MixItUp factory function will be made available via the global variable `mixitup`.\n\n#### Module Import\n\nIf you are building a modular JavaScript project with Webpack, Browserify, or RequireJS, MixItUp can be installed using your package manager of choice (e.g. npm, jspm, yarn) and then imported into any of your project's modules.\n\n`npm install mixitup --save`\n\n```js\n// ES2015\n\nimport mixitup from 'mixitup';\n```\n\n```js\n// CommonJS\n\nvar mixitup = require('mixitup');\n```\n\n```js\n// AMD\n\nrequire(['mixitup'], function(mixitup) {\n\n});\n```\n\n### Creating a Mixer\n\nWith the `mixitup()` factory function available, you may now instantiate a \"mixer\" on your container to enable MixItUp functionality.\n\nCall the factory function passing a selector string or a reference to your container element as the first parameter, and a the newly instantiated mixer will be returned.\n\n###### Example: Instantiating a mixer with a selector string\n\n```js\nvar mixer = mixitup('.container');\n```\n\n###### Example: Instantiating a mixer with an element reference\n\n```js\nvar mixer = mixitup(containerEl);\n```\n\nYour mixer is now ready for you to interact with, either via its controls (see above), or its API (see [Mixer API Methods](./docs/mixitup.Mixer.md)). Click a control or call an API method to check that everything is working correctly.\n\n### Configuration\n\nIf you wish to customize the functionality of your mixer, an optional \"configuration object\" can be passed as the second parameter to the `mixitup` function. If no configuration object is passed, the default settings will be used.\n\nFurther reading: [Configuration Object](/docs/mixitup.Config.md)\n\n###### Example: Passing a configuration object\n\n```js\nvar mixer = mixitup(containerEl, {\n    selectors: {\n        target: '.blog-item'\n    },\n    animation: {\n        duration: 300\n    }\n});\n```\n\n#### Using the API\n\nIf you wish to interact with your mixer via its API, the mixer reference returned by the factory function can be used to call API methods.\n\n###### Example: Calling an API method\n\n```js\nvar mixer = mixitup(containerEl);\n\nmixer.filter('.category-a');\n```\n\nFurther reading: [Mixer API Methods](./docs/mixitup.Mixer.md)\n\n#### Building a modern JavaScript application?\n\nYou may wish to use MixItUp 3's new \"dataset\" API. Dataset is designed for use in API-driven JavaScript applications, and can be used instead of DOM-based methods such as `.filter()`, `.sort()`, `.insert()`, etc. When used, insertion, removal, sorting and pagination can be achieved purely via changes to your data model, without the uglyness of having to interact with or query the DOM directly.\n\nFurther reading: [Using the Dataset API](./tutorials/using-the-dataset-api.md)\n"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 0.3984375,
          "content": "{\n    \"name\": \"patrickkunka/mixitup\",\n    \"type\": \"library\",\n    \"homepage\": \"https://github.com/patrickkunka/mixitup/\",\n    \"license\": \"Apache-2.0\",\n    \"authors\": [\n        {\n            \"name\": \"KunkaLabs Limited\"\n        }\n    ],\n    \"description\": \"A high-performance, dependency-free library for animated filtering, sorting and more\",\n    \"keywords\": [\"javascript\", \"animate\", \"filtering\", \"sorting\"]\n}"
        },
        {
          "name": "demos",
          "type": "tree",
          "content": null
        },
        {
          "name": "dist",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "gulpfile.js",
          "type": "blob",
          "size": 2.07421875,
          "content": "'use strict';\n\nconst gulp            = require('gulp');\nconst jshint          = require('gulp-jshint');\nconst stylish         = require('jshint-stylish');\nconst rename          = require('gulp-rename');\nconst jscs            = require('gulp-jscs');\nconst uglify          = require('gulp-uglify');\nconst livereload      = require('gulp-livereload');\nconst exec            = require('child_process').exec;\n\ngulp.task('default', ['watch']);\n\ngulp.task('watch', () => {\n    livereload.listen(35730);\n\n    gulp.watch([\n        './src/*.js',\n        './src/*.hbs'\n    ], ['reload-js'])\n        .on('change', function(e) {\n            console.log(\n                '[gulp-watch] file ' +\n                e.path +\n                ' was ' +\n                e.type +\n                ', building'\n            );\n        });\n});\n\ngulp.task('reload-js', ['build-dist'], () => {\n    return livereload.changed();\n});\n\ngulp.task('prod', ['uglify']);\n\ngulp.task('uglify', ['build'], () => {\n    return gulp.src([\n        './dist/mixitup.js'\n    ])\n        .pipe(uglify({\n            preserveComments: 'license'\n        }))\n        .pipe(rename('mixitup.min.js'))\n        .on('error', e => console.error('[uglify] ' + e.message))\n        .pipe(gulp.dest('./dist/'))\n        .pipe(gulp.dest('./demos/'));\n});\n\ngulp.task('build', ['build-dist'], done => {\n    exec('node node_modules/mixitup-build/docs.js -s mixitup.js', (e, out) => {\n        if (out) {\n            console.log(out);\n        }\n\n        done(e);\n    });\n});\n\ngulp.task('build-dist', ['lint', 'code-style'], done => {\n    exec('node node_modules/mixitup-build/dist.js -o mixitup.js', (e, out) => {\n        if (out) {\n            console.log(out);\n        }\n\n        done(e);\n    });\n});\n\ngulp.task('lint', () => {\n    return gulp.src([\n        './src/*.js'\n    ], {\n        base: '/'\n    })\n        .pipe(jshint('./.jshintrc'))\n        .pipe(jshint.reporter(stylish))\n        .pipe(jshint.reporter('fail'));\n});\n\ngulp.task('code-style', () => {\n    return gulp.src([\n        './src/*.js'\n    ], {\n        base: '/'\n    })\n        .pipe(jscs())\n        .pipe(jscs.reporter());\n});"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 1.2060546875,
          "content": "{\n  \"name\": \"mixitup\",\n  \"title\": \"MixItUp\",\n  \"version\": \"3.3.2\",\n  \"description\": \"A high-performance, dependency-free library for animated filtering, sorting and more\",\n  \"author\": \"KunkaLabs Limited\",\n  \"license\": \"Apache-2.0\",\n  \"main\": \"./dist/mixitup.js\",\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"https://github.com/patrickkunka/mixitup/\"\n  },\n  \"scripts\": {\n    \"test\": \"mocha ./tests/unit/main.js\",\n    \"cover\": \"istanbul cover _mocha ./tests/unit/main.js\",\n    \"coveralls\": \"npm run cover -- --report lcovonly && cat ./coverage/lcov.info | coveralls\"\n  },\n  \"devDependencies\": {\n    \"chai\": \"^3.5.0\",\n    \"chai-as-promised\": \"^5.3.0\",\n    \"chai-shallow-deep-equal\": \"^1.4.0\",\n    \"coveralls\": \"^2.11.14\",\n    \"gulp\": \"^3.8.8\",\n    \"gulp-jscs\": \"^4.0.0\",\n    \"gulp-jshint\": \"^1.8.5\",\n    \"gulp-livereload\": \"~2.1.1\",\n    \"gulp-rename\": \"^1.2.2\",\n    \"gulp-uglify\": \"~1.5.1\",\n    \"istanbul\": \"^0.4.5\",\n    \"jsdom\": \"9.4.2\",\n    \"jsdom-global\": \"2.0.0\",\n    \"jshint-stylish\": \"~1.0.0\",\n    \"merge-stream\": \"^0.1.7\",\n    \"mixitup-build\": \"git://github.com/patrickkunka/mixitup-build.git\",\n    \"mocha\": \"^3.0.2\",\n    \"mocha-lcov-reporter\": \"^1.2.0\",\n    \"vinyl-buffer\": \"^1.0.0\",\n    \"vinyl-source-stream\": \"^1.1.0\"\n  }\n}\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "tutorials",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}