{
  "metadata": {
    "timestamp": 1736561784743,
    "page": 424,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "NirmalScaria/le-git-graph",
      "stars": 3915,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.009765625,
          "content": ".DS_Store\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.0966796875,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\nscaria@scaria.dev.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.6953125,
          "content": "# Welcome to Le Git Graph contributing guide <!-- omit in toc -->\n\nThank you for investing your time in contributing to our project! Any contribution you make will be reflected on Chrome Web Store and Firefox Addons Hub :sparkles:. \n\nRead our [Code of Conduct](./CODE_OF_CONDUCT.md) to keep our community approachable and respectable.\n\nIn this guide you will get an overview of the contribution workflow from opening an issue, creating a PR, reviewing, and merging the PR.\n\n## New contributor guide\n\nTo get an overview of the project, read the [README](README.md). Here are some resources to help you get started with extension development:\n\n- [Loading extension for development - Chrome](https://developer.chrome.com/docs/extensions/mv3/getstarted/development-basics/#load-unpacked)\n- [Loading extension for development - Firefox](https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/Your_first_WebExtension#installing)\n- [Manifest V3](https://developer.chrome.com/docs/extensions/mv3/intro/)\n- [GitHub OAuth](https://docs.github.com/en/developers/apps/building-oauth-apps/authorizing-oauth-apps)\n- [GitHub GraphQL API](https://docs.github.com/en/graphql)\n\n\n## Getting started\n\nExtension installed via Chrome Web Store or Firefox AddOns Hub are mostly meant for end user consumption. For development, the extension is to be loaded in a different way. To start with, go ahead with the following steps:\n1. Uninstall or disable Le Git Graph if already installed via Chrome Web Store or Firefox AddOns Hub.\n2. Fork this repository.\n3. Clone the forked repository. ([How?](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository))\n4. Load the extension from the cloned repository. Follow [these steps](https://developer.chrome.com/docs/extensions/mv3/getstarted/development-basics/#load-unpacked) for Chrome and [these steps](https://developer.mozilla.org/en-US/docs/Mozilla/Add-ons/WebExtensions/Your_first_WebExtension#installing) for Firefox.\n5. Make changes in the source code and refresh the extension inside the browser to see changes.\n\n### Issues\n\n#### Create a new issue\n\nIf you spot a problem with Le Git Graph, [search if an issue already exists](https://docs.github.com/en/github/searching-for-information-on-github/searching-on-github/searching-issues-and-pull-requests#search-by-the-title-body-or-comments). If a related issue doesn't exist, you can open a new issue using a relevant [issue form](https://github.com/NirmalScaria/le-git-graph/issues/new/choose). \n\n#### Solve an issue\n\nScan through our [existing issues](https://github.com/NirmalScaria/le-git-graph/issues) to find one that interests you. You can narrow down the search using `labels` as filters. As a general rule, issues are usually not assigned to anyone. If you find an issue to work on, you are welcome to open a PR with a fix.\n\n### Make Changes\n\n#### Developer documentation\n\nDeveloper documentation provides an idea on how the extension is working currently. It is strongly suggested to have a brief look at the documentation before proceeding to actively work on the source code as it will help your work be a lot smoother.\n\n#### Bug fixes\n\nThis project is not following unit tests (at least yet). Kindly make sure the fixes are stable by testing with relevant testcases depending on the change you worked on.\n\n### Commit your update\n\nCommit the changes once you are happy with them.\n\n### Pull Request\n\nWhen you're finished with the changes, commit it, push it, and create a pull request, also known as a PR.\n- Don't forget to [link PR to issue](https://docs.github.com/en/issues/tracking-your-work-with-issues/linking-a-pull-request-to-an-issue) if you are solving one.\n- Enable the checkbox to [allow maintainer edits](https://docs.github.com/en/github/collaborating-with-issues-and-pull-requests/allowing-changes-to-a-pull-request-branch-created-from-a-fork) so the branch can be updated for a merge.\nOnce you submit your PR, your proposal will be reviewed. There might be questions or requests for additional information.\n- You maybe asked for changes to be made before a PR can be merged, either using [suggested changes](https://docs.github.com/en/github/collaborating-with-issues-and-pull-requests/incorporating-feedback-in-your-pull-request) or pull request comments. You can apply suggested changes directly through the UI. You can make any other changes in your fork, then commit them to your branch.\n- If you run into any merge issues, checkout this [git tutorial](https://github.com/skills/resolve-merge-conflicts) to help you resolve merge conflicts and other issues.\n\n### Your PR is merged!\n\nCongratulations :tada::tada: Big Thanks to you :sparkles:. \n\nOnce your PR is merged, your contributions will be publicly visible with the next version release. \n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.044921875,
          "content": "MIT License\n\nCopyright (c) 2022 Nirmal Scaria\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "Privacy policy.md",
          "type": "blob",
          "size": 1.7109375,
          "content": "# Privacy policy for Le Git Graph\n\n## Last updated: 16 November 2023\n\nThis page informs you of our policies regarding the collection, use, and disclosure of personal data when you use our Extension and the choices you have associated with that data.\n\n## Information Collection and Use\n\nThe Extension collects and stores identifiable data from users, specifically public GitHub account details. This may include usernames and publicly available information on GitHub profiles.\n\n## Usage of GitHub Data\nThe collected GitHub data is used solely for the purpose of rendering the Git Graph inside GitHub and enhancing the user experience within the Extension. We do not sell or share this information with any third party.\n\n## Security Tokens\n\nThe Extension stores security tokens in the user's browser to facilitate secure communication with the GitHub platform. The security of these tokens depends on the security measures implemented by the user's browser.\n\n## Browser Security\nPlease note that the security of the stored tokens is contingent on the security features of the user's browser. Users are advised to keep their browsers updated and employ necessary security practices to protect their data.\n\n## Data Retention\n\nThe Extension retains user data, including GitHub account details, for the duration necessary to provide the services. Users can clear their data by uninstalling the Extension.\n\n## Changes to This Privacy Policy\n\nWe may update our Privacy Policy from time to time. Thus, we advise you to review this page periodically for any changes. We will notify you of any changes by posting the new Privacy Policy on this page.\n\n## Contact Us\n\nIf you have any questions or suggestions about our Privacy Policy, do not hesitate to contact us."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.7294921875,
          "content": "## Le Git Graph - Commits Graph for GitHub\n\n<img src = \"https://drive.google.com/uc?export=download&id=12bnQqy4cm2vQcZSKWo2INBv-69iqkF_p\" width = \"150\">\n\nA browser extension that displays the git graph for any GitHub repository.\n\n[![Version](https://img.shields.io/badge/License-MIT-yellow)]()\n[![Version](https://img.shields.io/badge/Version-1.2.8-yellowgreen)]()\n[![Version](https://img.shields.io/badge/Chrome_CI/CD-Success-green)]()\n[![Version](https://img.shields.io/badge/Firefox_CI/CD-Success-green)]()\n\n## Demo\n![Demo Image](https://user-images.githubusercontent.com/46727865/218700103-c26082db-a696-435c-934c-cc66e1c067bd.png)\n\n\n\n## Installation\n\nInstall the extension from the link -\n\nFor Google Chrome, Opera, Vivaldi, Brave, and Microsoft Edge:\n\n[https://chrome.google.com/webstore/detail/le-git-graph-commits-grap/joggkdfebigddmaagckekihhfncdobff](https://chrome.google.com/webstore/detail/le-git-graph-commits-grap/joggkdfebigddmaagckekihhfncdobff)\n\nFor Mozilla Firefox:\n\n[https://addons.mozilla.org/firefox/addon/le-git-graph-github-git-graph/](https://addons.mozilla.org/firefox/addon/le-git-graph-github-git-graph/)\n\n\nAfter installation, open any GitHub repository and a new 'Commits' tab will be visible.\n\nOpen the commits tab and follow the prompt to authenticate with your GitHub account.\n\n## Setup for Private Repos owned by an Organization\n\nAccess to private repositories owned by an organization is restricted by default. To access the commits graph for such repositories, you need to follow the following steps.\n\n1. Go to [https://github.com/settings/tokens](https://github.com/settings/tokens) \n2. Create a Personal Access Token (PAT)  with the following scopes -\n    - repo |  Full control of private repositories\n  > For a more secure option, use a Fine-Grained token (beta) with the following scopes - \n  > - repo |  Read access to code, commit statuses, and metadata\n3. Go back to the commits tab of a repo owned by the organization.\n4. From the dropdown for \"Authorize with GitHub\", select \"Custom Personal Access Token\".\n5. Enter the PAT and click on \"Add PAT\".\n\n(Full access to repo is required to fetch the commits graph, because there is no read only access level for GitHub OAuth scopes as of now.)\n\n## Tech Stack\n\n**Client:** JavaScript, Manifest V3\n\n**Server:** GitHub GraphQL, GitHub OAuth, FireBase Cloud Functions\n\n\n## Features\n\n- Authentication with GitHub OAuth  ✓\n- Connection to GitHub GraphQL ✓\n- Fetch the commits data from API ✓\n- Fetch further commits on demand ✓\n- Option to specify access level (public only or private too) ✓\n- Hover on the commit dot to see details ✓\n- Option to add custom PAT ✓\n- Filter the commits based on branch - Pending\n\n## Contact\n\nFeel free to drop a mail at scaria@scaria.dev or nirmalscaria1@gmail.com\n"
        },
        {
          "name": "css",
          "type": "tree",
          "content": null
        },
        {
          "name": "html",
          "type": "tree",
          "content": null
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "js",
          "type": "tree",
          "content": null
        },
        {
          "name": "licenses",
          "type": "tree",
          "content": null
        },
        {
          "name": "manifest.json",
          "type": "blob",
          "size": 2.2939453125,
          "content": "{\n  \"version\": \"1.2.8\",\n  \"name\": \"Le Git Graph - Commits Graph for GitHub\",\n  \"description\": \"A browser extension that displays the git graph for any GitHub repository.\",\n  \"manifest_version\": 3,\n  \"content_scripts\": [\n    {\n      \"matches\": [\n        \"*://*.github.com/*\"\n      ],\n      \"css\": [\n        \"css/background.css\"\n      ],\n      \"js\": [\n        \"js/showLegend.js\",\n        \"js/drawGraph.js\",\n        \"js/fetchFurther.js\",\n        \"js/showCommitsLoading.js\",\n        \"js/getLocalToken.js\",\n        \"js/addAuthorizationPrompt.js\",\n        \"js/authorisation/oauth2.js\",\n        \"js/fetchCommits.js\",\n        \"js/fetchFilteredCommits.js\",\n        \"js/showCommits.js\",\n        \"js/sortCommits.js\",\n        \"js/setBranchOptions.js\",\n        \"js/loadBranchesButton.js\",\n        \"js/addCommitsButton.js\",\n        \"js/openCommitsTab.js\",\n        \"js/main.js\",\n        \"js/fre/helper.js\",\n        \"js/fre/updateFre.js\",\n        \"js/fre/installFre.js\",\n        \"js/fre/handler.js\"\n      ],\n      \"run_at\": \"document_end\"\n    },\n    {\n      \"matches\": [\n        \"*://*.scaria.dev/github-tree-graph/authorize*\",\n        \"*://*.scaria.dev/github-tree-graph/authorize/*\"\n      ],\n      \"js\": [\n        \"js/authProcess.js\"\n      ],\n      \"run_at\": \"document_end\"\n    }\n  ],\n  \"action\": {\n    \"default_icon\": {\n      \"16\": \"/images/le_git_graph16.png\",\n      \"32\": \"/images/le_git_graph32.png\",\n      \"48\": \"/images/le_git_graph48.png\",\n      \"128\": \"/images/le_git_graph128.png\"\n    },\n    \"default_title\": \"Le Git Graph\",\n    \"default_popup\": \"/html/popup.html\"\n  },\n  \"browser_specific_settings\": {\n    \"gecko\": {\n      \"id\": \"{fd903445-e572-42dd-90be-ae63dd5840ea}\"\n    }\n  },\n  \"icons\": {\n    \"16\": \"/images/le_git_graph16.png\",\n    \"32\": \"/images/le_git_graph32.png\",\n    \"48\": \"/images/le_git_graph48.png\",\n    \"128\": \"/images/le_git_graph128.png\"\n  },\n  \"background\": {\n    \"service_worker\": \"js/serviceWorker.js\"\n  },\n  \"web_accessible_resources\": [\n    {\n      \"resources\": [\n        \"js/authInject.js\",\n        \"images/popup.png\",\n        \"html/branchSelection.html\",\n        \"html/authorizationPrompt.html\",\n        \"html/commitsLoading.html\",\n        \"html/commitsContainer.html\",\n        \"html/commitItem.html\",\n        \"html/hoverCard.html\",\n        \"html/tooltip.html\"\n      ],\n      \"matches\": [\n        \"<all_urls>\"\n      ]\n    }\n  ]\n}"
        }
      ]
    }
  ]
}