{
  "metadata": {
    "timestamp": 1736562042378,
    "page": 797,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "scottbez1/splitflap",
      "stars": 3299,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.20703125,
          "content": "*.swp\n*.pyc\nbuild/\n\n# KiCAD files\n*.000\n*.bak\n*.bck\n*.kicad_pcb-bak\n*.sch-bak\n*.net\n*.dsn\nfp-info-cache\n*-backups\n\\#auto_saved_files\\#\n\n# KiCAD bom\nsplitflap.xml\nsensor.xml\n\n# Arduino compiled output\n*.hex\n\n.pio\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.095703125,
          "content": "[submodule \"thirdparty/nanopb\"]\n\tpath = thirdparty/nanopb\n\turl = git@github.com:nanopb/nanopb.git\n"
        },
        {
          "name": "3d",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 11.712890625,
          "content": "   splitflap - Copyright 2015-2021 Scott Bezek and the splitflap contributors\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n----\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 48.46484375,
          "content": "# Split-Flap Display\n\nThis is a DIY ESP32-based [split-flap display](https://en.wikipedia.org/wiki/Split-flap_display), optimized for easy assembly at home in small quantities but able to be scaled up to large affordable displays.\n\n![animated rendering](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_animation.gif)\n\n[![Build Status](https://github.com/scottbez1/splitflap/actions/workflows/3d.yml/badge.svg?branch=master)](https://github.com/scottbez1/splitflap/actions/workflows/3d.yml?query=branch%3Amaster)\n[![Build Status](https://github.com/scottbez1/splitflap/actions/workflows/electronics.yml/badge.svg?branch=master)](https://github.com/scottbez1/splitflap/actions/workflows/electronics.yml?query=branch%3Amaster)\n[![Build Status](https://github.com/scottbez1/splitflap/actions/workflows/pio.yml/badge.svg?branch=master)](https://github.com/scottbez1/splitflap/actions/workflows/pio.yml?query=branch%3Amaster)\n\nThe [splitflap community Discord server](https://discord.com/invite/wgehm3PcrC) is the best place to keep up with the latest changes or ask questions about the project!\n\nWant to help support development or just say \"thanks\"? Consider a one-time or monthly sponsorship:\n\n| [:heart: Sponsor scottbez1 on GitHub](https://github.com/sponsors/scottbez1) |\n|---|\n\n<a href=\"https://www.youtube.com/watch?v=UAQJJAQSg_g\" target=\"_blank\">\n  <img src=\"renders/howItWorksThumbnail.jpg\" height=320 />\n</a>\n\n**Using this project in a commercial setting or for paid client work?** Go right ahead - it's open source (just make sure to follow the terms of the Apache License)! I would, however, ask that you consider [sponsoring the project](https://github.com/sponsors/scottbez1). I've been developing and maintaining this project in my free time for over 8 years, and I'd love to continue working on it. Sponsorships allow me to pay for prototypes and development tools that make this project possible. Unlike pure software projects, every iteration has real hardware costs; sponsorships allow me to keep iterating and improving the project faster. Thank you!\n\n\n# Current Status\n[You can download the **latest stable releases** of the hardware designs from the official 'releases' page.](https://github.com/scottbez1/splitflap/releases)\n\nReleases have been tested and used to produce working units, but as this is a continuously evolving open-source project, there may always be minor issues and/or incomplete documentation from time to time.\n\n## Stable release info\n\n| Component | Version | Notes |\n| --- | --- | --- |\n| Enclosure/Mechanics | v0.7 | https://github.com/scottbez1/splitflap/releases/tag/v0.7 |\n| Electronics - Sensor | v1.1 | https://github.com/scottbez1/splitflap/releases/tag/releases%2Fsensor%2Fv1.1 |\n| Electronics - Chainlink Driver | v1.1 | https://github.com/scottbez1/splitflap/releases/tag/releases%2FchainlinkDriver%2Fv1.1 |\n| Electronics - Chainlink Buddy [T-Display] | v1.0 | https://github.com/scottbez1/splitflap/releases/tag/releases%2FchainlinkBuddyTDisplay%2Fv1.0 |\n| Firmware | latest | Current firmware is backwards-compatible and not strictly versioned; use the latest from the `master` branch |\n| Control Software Examples | latest | Example Typescript and Python code for driving the display is in the [software](software) directory. The Typescript library and examples are more actively developed. |\n\nHere's a video of a large 108-module display powered by 18 Chainlink Driver boards and a Chainlink Base:\n\n[![Video: animations on 108-module display](https://raw.githubusercontent.com/wiki/scottbez1/splitflap/images/animationsThumb.gif)](https://youtu.be/g9EPabcxBsM)\n\n## v2 (coming soon!)\nA minor refresh of the mechanical and sensor design is currently in beta, and the stable release is expected in Summer 2024.\n\nThe beta designs (seen on this page) have been tested are nearly feature-complete, but documentation is still in progress.\n\n<img src=\"https://github.com/scottbez1/splitflap/assets/414890/9ffab4fa-a2db-4b5e-915a-915f81faa193\" height=\"200\" />\n<img src=\"https://github.com/scottbez1/splitflap/assets/414890/d89254a4-46de-4303-8402-8a4d7989d25e\" height=\"200\" />\n<img src=\"https://github.com/scottbez1/splitflap/assets/414890/9193a9e3-a4f5-4a54-868a-badd74168181\" height=\"200\" />\n\n**Here's what to expect in v2:**\n\n- **52 flaps per module** for more character/symbol options\n- **New printed flap design (\"Epilogue\")** with 52 flaps per set (see animation above), including several color-block flaps\n- **Updated enclosure** and mechanical parts (laser-cut) to accomodate 52 flaps\n  - Motor wires now exit downward for less awkward wiring!\n- **New sensor PCB** that's easier to assemble and includes an LED for checking the magnet status\n- **Software-configurable calibration** rather than mechanical sensor adjustment\n\n**But many things are staying the same for easy upgrades/compatibility:**\n- No change to flap dimensions!\n- No changes to Chainlink Driver, Chainlink Buddy boards, or system architecture!\n- 40-flap modules are still an officially supported option!\n- Open source, as always!\n- v0 parts (sensor kits) will continue to be stocked at Bezek Labs through 2024; don't worry if you haven't finished your build yet, the old sensor kits aren't going away!\n\nI'd love to hear your thoughts and questions about this project, and happy to incorporate any feedback you might have into these designs! Please feel free (and encouraged) to [open GitHub issues](https://github.com/scottbez1/splitflap/issues/new), email me directly, reach out [on Twitter](https://twitter.com/scottbez1), and [get involved](https://github.com/scottbez1/splitflap/pulls) in the open source development and let's keep chatting and building together!\n\n# Build Your Own\nIf you have any questions, please don't hesitate to ask in the [community Discord server](https://discord.gg/Hxnftc8PyW)!\n\nNote: the ordering and assembly guides have not yet been updated for the beta v2 designs. Ask in Discord if you have any questions about ordering or assembling a v2 display!\n\n* [**Ordering guide (the \"easy\" route) - updated for Chainlink**](https://paper.dropbox.com/doc/Splitflap-Ordering-the-easy-route--BsXzf8VyILR3nl1vUpOi28TWAg-0i6r3aqw6kZVXQOP2MyNr)\n* [**Chainlink Driver Electronics User Guide**](https://paper.dropbox.com/doc/Chainlink-Driver-v1.1-Electronics-User-Guide--BsVuP9OHVo952_ZdJDBomCCzAg-U0DAXrSxEoOhgSoRU39hq)\n* [**Latest stable release**](https://github.com/scottbez1/splitflap/releases)\n* [**Assembly instructions (v0.5/0.6/0.7)**](https://paper.dropbox.com/doc/Splitflap-Kit-v0.5v1.0-Instructions--ASQDu1uoa6n4_t1pva1bM1MgAg-bxXJlke5ROmamcx4OH44r)\n\n# Table of Contents\n- [Design Overview](#design-overview)\n  - [Mechanical](#mechanical)\n  - [Electronics](#electronics)\n    - [Sensor PCBs](#sensor-pcbs-1-per-module)\n    - [Chainlink Driver](#chainlink-driver-1-per-6-modules)\n    - [Chainlink Buddy \\[T-Display\\]](#chainlink-buddy-t-display-1-for-entire-display)\n    - [Advanced items](#advanced-items)\n      - [Chainlink Buddy \\[Breadboard\\]](#chainlink-buddy-breadboard-1-for-entire-display-alternative-to-t-display)\n      - [Chainlink Base](#chainlink-base-1-for-entire-display-large-displays)\n    - [Older designs](#older-designs)\n      - [Classic controller](#classic-controller-electronics-deprecated)\n    + [Miscellaneous Tools](#miscellaneous-tools)\n      - [Flaps and Fonts](#flaps-and-fonts)\n      - [Combined Front Panel Generator](#combined-front-panel-generator)\n      - [3D Printed Tools](#3d-printed-tools)\n      - [Chainlink Driver Tester](#chainlink-driver-tester)\n  * [Code](#code)\n    + [Firmware](#firmware)\n    + [Computer Control Software](#computer-control-software)\n- [Contributing/Modifying](#contributingmodifying)\n  * [3D Design](#3d-design)\n  * [Electronics Design](#electronics-design)\n\n# Design Overview\n\n## Mechanical\nThe mechanical/structural components are made from laser-cut 3mm MDF or acrylic, and held together with M4 bolts and nuts. The design is parametric and built using OpenSCAD. See below for more info on rendering/modifying the design.\n\nYou can view an interactive 3d model of the design [here](https://scottbez1.github.io/splitflap/embed.html?branch=master).\n\nThe beta v2 mechanical design officially supports variants with 52 flaps (perfect for use with the new [\"Epilogue\" printed flaps](https://bezeklabs.etsy.com/listing/1685633114/)) and 40 flaps. But you can always modify the design to customize it further.\n\n### Stable v0.7 (40-flap modules)\n![2d laser cut rendering](https://s3.amazonaws.com/splitflap-artifacts/refs/tags/v0.7/3d/3d_laser_raster.png)\n\nThe v0.7 stable release artifacts can be found at the [v0.7 tagged release](https://github.com/scottbez1/splitflap/releases/tag/v0.7).\n\n### Beta v2 (52-flap module option - recommended)\n![2d laser cut rendering](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_raster-52.png)\n\nInstructions: [v2 assembly guide](https://paper.dropbox.com/doc/Splitflap-v2-Assembly-Guide-vsT9BHwl9xhE9yZCMB3OC)\n\nModule dimensions: <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-module_dimensions.svg\" />\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n* For Ponoko 3mm MDF ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-ponoko-3mm-mdf_1x.svg)) <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-ponoko-3mm-mdf_1x_dimensions.svg\" />\n* For Ponoko 3mm acrylic ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-ponoko-3mm-acrylic_1x.svg)) <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-ponoko-3mm-acrylic_1x_dimensions.svg\" />\n* For generic material (0.18mm kerf correction) ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52.svg))\n* For Elecrow 3mm Wood ([zipped pdf](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-elecrow-3mm-wood_1x.zip))\n* For Elecrow 3mm Acrylic ([zipped pdf](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52-elecrow-3mm-acrylic_1x.zip))\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n### Beta v2 (40-flap module option)\n![2d laser cut rendering](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_raster-40.png)\n\nInstructions: [v2 assembly guide](https://paper.dropbox.com/doc/Splitflap-v2-Assembly-Guide-vsT9BHwl9xhE9yZCMB3OC)\n\nModule dimensions: <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-module_dimensions.svg\" />\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n* For Ponoko 3mm MDF ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-ponoko-3mm-mdf_1x.svg)) <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-ponoko-3mm-mdf_1x_dimensions.svg\" />\n* For Ponoko 3mm acrylic ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-ponoko-3mm-acrylic_1x.svg)) <img height=\"18\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-ponoko-3mm-acrylic_1x_dimensions.svg\" />\n* For generic material (0.18mm kerf correction) ([svg](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-52.svg))\n* For Elecrow 3mm Wood ([zipped pdf](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-elecrow-3mm-wood_1x.zip))\n* For Elecrow 3mm Acrylic ([zipped pdf](https://s3.amazonaws.com/splitflap-artifacts/master/3d/3d_laser_vector-40-elecrow-3mm-acrylic_1x.zip))\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n\n## Electronics\n> [!NOTE]\n> For small displays (up to 3 modules), you can skip the custom controller boards and use off-the-shelf ULN2003A driver\nmodules plugged into an Arduino Uno. This is [partially documented in the wiki](https://github.com/scottbez1/splitflap/wiki/Electronics#basic-prototyping-alternative-electronics-approach)\n> but may require some additional tinkering to get it to work. _Help wanted: if you'd like to help improve these instructions,\n> please reach out in the Discord server, thanks!_\n\nThe \"Chainlink\" electronics system is designed to support long chains of driver boards to control medium/large displays (up to 100+ split-flap modules).\nIt's also designed to be easy and cheap to order pre-assembled or build yourself, especially in higher\nquantities, due to its simple BOM and surface-mount components.\n\nTo build a display, you'll need 3 different electronics:\n* One **Sensor PCB** for every split-flap module\n* One **Chainlink Driver** board for every 6 split-flap modules. This is what interfaces with the motors and sensors of each module. Chainlink Driver boards can be chained together to construct a large display.\n* An ESP32 microcontroller board. There are a few options:\n    * For small/medium displays, one of the **Chainlink Buddy** boards are recommended\n        * **Chainlink Buddy [T-Display]**  holds a Lilygo T-Display ESP32 module which includes a built-in LCD and 2 buttons\n        * **Chainlink Buddy [Breadboard]** makes it easy to connect a Chainlink Driver to a breadboard for prototyping, though you can also easily connect a Chainlink Driver to a breadboard with a few dupont wires.\n    * For large displays, the **Chainlink Base** provides a number of advanced features: central\npower management/distribution and fault monitoring, UART and RS-485 connections, configuration switches, and status LEDs.\n\n### Sensor PCBs (1 per module)\nEach module needs a hall-effect sensor for start-up calibration and fault monitoring. \n\n#### Sensors for stable v0.7 hardware\nOlder sensors for the v0.7 and older laser-cut hardware can be found in the [tagged sensor release](https://github.com/scottbez1/splitflap/releases/tag/releases%2Fsensor%2Fv1.1).\n\nThese older sensors are not compatible with v2 laser-cut hardware.\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/refs/tags/releases/sensor/v1.1/electronics-classic/sensor-panelized-pcb-raster.png\">\n<img width=\"320\" src=\"https://s3.amazonaws.com/splitflap-artifacts/refs/tags/releases/sensor/v1.1/electronics-classic/sensor-panelized-pcb-raster.png\"/>\n</a>\n\n\n#### Beta Sensors v2\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/panelized_sensor_smd-front-3d.png\">\n<img width=\"320\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/panelized_sensor_smd-front-3d.png\"/>\n</a>\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/panelized_sensor_smd-back-3d.png\">\n<img width=\"320\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/panelized_sensor_smd-back-3d.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-schematic.pdf\">\n<img width=\"320\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-schematic.png\"/>\n</a>\n\nNew sensors for the v2 laser-cut hardware - these use surface mount components and are optimized for PCB assembly at JLCPCB. These new sensors are not compatible with v0.7 and older laser-cut hardware.\n\nPacks of 6 sensors are [available mostly-assembled in the Bezek Labs store](https://bezeklabs.etsy.com/listing/1696745674),\nand come with the right-angle pin headers and magnets you'll need. Purchases support continued development of this project.\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-schematic.pdf)\n* Interactive BOM (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-ibom.html)\n* Fabrication files (single)\n  * NOTE: PCBs must be 0.8mm! (rather than the more typical 1.6mm thickness)\n  * PCB gerbers [zip](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-jlc/gerbers.zip)\n  * PCB BOM (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-jlc/bom.csv)\n  * PCB CPL (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-jlc/pos.csv)\n* Fabrication files (panelized)\n  * NOTE: PCBs must be 0.8mm! (rather than the more typical 1.6mm thickness)\n  * PCB gerbers [zip](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-panelized-jlc/gerbers.zip)\n  * PCB BOM (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-panelized-jlc/bom.csv)\n  * PCB CPL (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-v2/sensor_smd-panelized-jlc/pos.csv)\n* Purchase sensor kits in the US: [Bezek Labs](https://bezeklabs.etsy.com/listing/1696745674)\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n### Chainlink Driver (1 per 6 modules)\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-3d.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-3d.png\"/>\n</a>\n\nKey features:\n* Controls 6 split-flap modules per board\n* Primarily SMD and all components (except the pin headers and motor connectors) are available in JLCPCB's parts library\nfor easy SMD/THT assembly\n* Clock and latch lines are buffered on each board with a 74HC125 to support longer chains\n* 2 bits of loopback error checking per board (connecting 2 spare output bits on output shift registers to 2 spare inputs) allows the controller\nto validate data integrity up and down the whole chain\n* Module order goes from right-to-left since this is intended to be installed and accessed from *behind* the modules\n\nChainlink Driver boards are [available mostly-assembled in the Bezek Labs store](https://bezeklabs.etsy.com/listing/1123280069/splitflap-chainlink-driver-v11),\nand come with the additional connectors and ribbon cables you'll need. Purchases support continued development of this project.\n\nMore information on building and using Chainlink Drivers is available in the [Chainlink Driver User Guide](https://paper.dropbox.com/doc/Chainlink-Driver-v1.1-Electronics-User-Guide--BW2lxdjVkAxva68kYw2doWQEAg-U0DAXrSxEoOhgSoRU39hq).\n\nOr if you'd like to order these directly from a fab, this design is optimized for assembly at JLCPCB, and files are automatically generated\nfor ordering *assembled* PCBs there. Or if you wish to assemble this board yourself instead of paying for assembly, \nyou can view the [interactive BOM/placement tool](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/bom/chainlinkDriver-ibom.html)\n\nDepending on available stock at JLCPCB, you may need to manually modify the BOM file to use alternative components, or regenerate the files\nyourself using `export_jlcpcb.py` and specifying one or more `LCSC_ALT_*` field names to use a pre-selected alternative part number. See\nthe schematic for available pre-selected alternatives (check the symbol's properties/fields).\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-schematic.pdf\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-schematic.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-pcb-raster.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-pcb-raster.png\"/>\n</a>\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-schematic.pdf)\n* PCB overview [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-pcb-packet.pdf)\n* PCB gerbers [zip](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-jlc/gerbers.zip)\n* PCB bom (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-jlc/bom.csv)\n* PCB CPL (for JLCPCB assembly) [csv](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/chainlinkDriver-jlc/pos.csv)\n* PCB bom (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink/bom/chainlinkDriver-ibom.html)\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n### Chainlink Buddy \\[T-Display\\] (1 for entire display)\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-3d.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-3d.png\"/>\n</a>\n\nThe Chainlink Buddy \\[T-Display\\] is a convenient way to connect a T-Display ESP32 board (recommended microcontroller) to a chain\nof Chainlink Drivers.\n\nKey features:\n* TTGO T-Display ESP32 module as the controller, which includes USB-C, color IPS LCD display and buttons\n* Extra terminals for every pin of the T-Display allow you to connect any other peripherals to the ESP32 (the connection to the Chainlink Driver requires _only 4_ of the GPIOs)\n* Optional barrel jack makes it easy to use a \"wall wart\" AC adapter/power-supply (since the Chainlink Driver only has screw terminals for power) -- plug in a 12V supply\nand then run a wire from the onboard screw terminals to the Chainlink Driver's motor power screw terminals.\n* Optional 5V regulator allows for powering the ESP32 without a USB connection, using the 12V motor power supply\n\n\nChainlink Buddy \\[T-Display\\] boards are [available in the Bezek Labs store](https://bezeklabs.etsy.com/listing/1109357786/splitflap-chainlink-buddy-t-display),\nand come with the additional connectors you'll need. Purchases support continued development of this project. \n\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-schematic.pdf\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-schematic.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-pcb-raster.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-pcb-raster.png\"/>\n</a>\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-schematic.pdf)\n* PCB ([gerbers](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-jlc/gerbers.zip) / [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-pcb-packet.pdf))\n* Panelized PCB ([gerbers](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-panelized-jlc/gerbers.zip) / [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/chainlinkBuddyTDisplay-panelized-pcb-packet.pdf))\n* PCB bom (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-t-display/bom/chainlinkBuddyTDisplay-ibom.html)\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n### Advanced items\n#### Chainlink Buddy \\[Breadboard\\] (1 for entire display; alternative to T-Display)\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-3d.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-3d.png\"/>\n</a>\n\nThe Chainlink Buddy \\[Breadboard\\] makes it easy to connect a Chainlink Driver to a breadboard for prototyping. You could use 5 dupont wires and have a\nmessy rats nest, or you could use a single ribbon cable and this slick breakout board.\n\nChainlink Buddy \\[Breadboard\\] boards are [available in the Bezek Labs store](https://bezeklabs.etsy.com/listing/1123863267/splitflap-chainlink-buddy-breadboard),\nand come with the additional connectors you'll need. Purchases support continued development of this project. \n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-schematic.pdf\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-schematic.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-pcb-raster.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-pcb-raster.png\"/>\n</a>\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-schematic.pdf)\n* PCB ([gerbers](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-jlc/gerbers.zip) / [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-pcb-packet.pdf))\n* Panelized PCB ([gerbers](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-panelized-jlc/gerbers.zip) / [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/chainlinkBuddyBreadboard-panelized-pcb-packet.pdf))\n* PCB bom (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-buddy-breadboard/bom/chainlinkBuddyBreadboard-ibom.html)\n\n<sup>:warning:</sup>For tested/stable/recommended artifacts, use the [latest release](https://github.com/scottbez1/splitflap/releases) instead\n\n#### Chainlink Base (1 for entire display; large displays)\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-3d.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-3d.png\"/>\n</a>\n\nFor larger displays, you should take additional care to make the hardware more robust to potential faults. The Chainlink Base is an experimental (but unsupported) controller design that adds some additional functionality. This has been tested and appears to work, but is not recommended for general use.\n\nThe Chainlink Base PCB is an optional alternative to a Chainlink Buddy, designed for particularly large displays.\nIt hosts the ESP32 and adds additional connectivity options (terminals for UART and RS485 serial) and\npower distribution (independently-monitored power channels for multiple \"zones\" of Driver boards).\n\nKey features:\n* TTGO T-Display ESP32 module as the controller, which includes USB-C, color IPS LCD display and buttons\n* Optional master relay output for 12V PSU control (5V relay, up to ~500mA coil current)\n  * Future firmware will power on the 12V PSU after a startup self-test, and power off PSU in case of any faults\n* 5 channels of independently monitored 12V switches for powering groups of Chainlink Driver boards (6-10A max per channel)\n  * Depending on the motors you use, each channel may be able to power about 6 Chainlink Driver boards which is 36 splitflap modules\n  * Each channel includes an automotive fuse holder for additional over-current protection\n  * INA219 and shunt resistor provide high fidelity voltage and current monitoring \n  * Firmware will power on each channel after a startup self-test, and power off the channel in case of any faults\n  * 3.3V output for powering many Chainlink Driver boards\n* Flexible controller input power\n  * USB power from the T-Display works by default, though external power is recommended for larger displays\n  * Regulated 5V can be connected directly to the screw terminals, or\n  * if you are using an always-on 12V PSU without a master relay, you can install a buck module and power the board from 12V using the 7-28V screw terminals\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-schematic.pdf\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-schematic.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-pcb-raster.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-pcb-raster.png\"/>\n</a>\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-schematic.pdf)\n* PCB overview [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-pcb-packet.pdf)\n* PCB gerbers [zip](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/chainlinkBase-jlc/gerbers.zip)\n* PCB bom (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-base/bom/chainlinkBase-ibom.html)\n\n<sup>:warning:</sup>There are currently no stable releases of this board, and none are planned. Some past variants of this board have been used, to some success, but it is not considered an\nofficially supported design\n\n## Older designs\n### Classic Controller Electronics (deprecated)\nThe Classic driver board is deprecated and unsupported.\n\nThe Classic controller board was designed to plug into an Arduino like a shield, and could control 4 stepper motors.\nUp to 3 driver boards could be chained together, for up to 12 modules controlled by a single Arduino.\n\nThe driver uses 2 MIC5842 low-side shift-register drivers, with built-in transient-suppression diodes, to control the motors, and a 74HC165 shift register to read from 4 hall-effect magnetic home position sensors.\nThere are optional WS2812B RGB LEDs which can be used to indicate the status of each of the 4 channels.\n\n\n### Miscellaneous Tools\n\n#### Flaps and Fonts\nIf you'd like to print your own flaps, or cut custom vinyl letter stickers, the project includes a script to generate vector design files\nthat is extremely configurable:\n\n* Font for text (this is further customizable in OpenSCAD)\n* Character-set - which letters/numbers/symbols/colors are included and in what order\n* Bleed - extends rendering past the borders of the flaps to compensate for slight misalignment of printing and cutting operations\n* Keepout areas - option to highlight keepout violations for manual review, automatically clip them, or ignore them\n* Rendering options:\n    * Single-sided - useful for previewing how all letters will look on flaps\n    * Front/back - for batch duplex printing, generate separate front-side and back-side files (e.g. sign shop printing on a flat sheet of PVC)\n    * Side-by-side - for individual flap printing, each flap's front design is laid out side-by-side with its back design\n\nTODO: finish documenting this and render some example images...\n\n#### Combined Front Panel Generator\nIf you'd like to share a single front face across multiple modules (rather than each module having its own front face), the repo\nincludes a script to generate a combined front panel for laser-cutting or CNC milling/routing.\n\nYou can modify:\n* Number of rows and columns\n* Horizontal and vertical spacing/separation of modules\n* Overall outer width and height of the panel\n\nFor CNC cutting, the script supports rendering a vector file optimized for thicker material (e.g. 6mm MDF) where only the bolt-holes will be through-cut. In this mode, the slots for the top/bottom enclosure pieces can be cut as ~4mm pockets so they aren't visible from the front face. The script automatically generates dog-bone shapes for these pocket cuts.\n\n\nTODO: finish documenting this and render some example images...\n\n#### 3D Printed Tools\nThe project also includes a number of optional 3D printed designs to make assembly easier. These include:\n\n* [a flap scoring jig](3d/tools/scoring_jig.scad) for precisely marking the cut point when splitting CR80 cards\n* [a flap punch jig](3d/tools/punch_jig.scad) for aligning the punch when making the pin cutouts on either side of a flap\n* [a flap container](3d/tools/flap_container.scad) for storing and organizing stacks of completed flaps\n\nAll of these designs are parametric and customizable within OpenSCAD. To print them, open up the relevant file in OpenSCAD and use `File -> Export -> Export as STL` to render the design as an STL file for your slicer.\n\n\n#### Chainlink Driver Tester\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-3d.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-3d.png\"/>\n</a>\n\nThis is not likely to be useful unless you're planning to manufacture dozens to hundreds of Chainlink Driver boards, but the Chainlink Driver Tester is a complete testbed\nfor Chainlink Driver boards as they come assembled by the PCBA fabricator.\n\nThis is currently under very active development.\n\nKey features:\n* TTGO T-Display (ESP32) controller, screen, and buttons for controlling tests and reporting results\n* Pogo-pins for all connectors on the Chainlink Driver board-under-test (screw terminals, sensor pin headers, and motor connectors)\n* 12V switch to supply motor power to the board-under-test, with automotive fuse and INA219 voltage/current monitoring (based on the Chainlink Base channel switch design)\n* Separate 3.3V supply for the board-under-test, protected with a polyfuse, should avoid browning out the Tester's MCU in case of 3.3V short-circuits\n* Motor and sensor connections are broken out from the pogo-pins for a full closed-loop hardware test\n* Screw terminals to chain another Chainlink Driver (not under test) to validate that chained outputs work on the board-under-test\n* MCP23017 GPIO expander with 8 GPIO pins exposed via headers for future expansion inputs\n* Large cutout allows a barcode scanner or camera to be aimed at the bottom of the board-under-test for tracking serial numbers.\n* Buzzer option for audible pass/fail feedback\n\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-schematic.pdf\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-schematic.png\"/>\n</a>\n\n<a href=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-pcb-raster.png\">\n<img width=\"640\" src=\"https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-pcb-raster.png\"/>\n</a>\n\n\nLatest auto-generated (untested!) artifacts<sup>:warning:</sup>:\n\n* Schematic [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-schematic.pdf)\n* PCB overview [pdf](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-pcb-packet.pdf)\n* PCB gerbers [zip](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/chainlinkDriverTester-jlc/gerbers.zip)\n* PCB bom (for manual assembly) [interactive](https://s3.amazonaws.com/splitflap-artifacts/master/electronics-chainlink-tester/bom/chainlinkDriverTester-ibom.html)\n\n<sup>:warning:</sup>There are currently no stable releases of this board, and there may never be as it is a niche production tool, not an end product. If you\nneed this tool, you are likely actively involved in development and should understand the revision history and current status of development enough to make\nan informed decision about which revision(s) to use.\n\n\n## Code\n### Firmware\nThe driver firmware is written using PlatformIO with the Arduino framework and is available at [`firmware/`](firmware/). \n\nThe firmware implements a closed-loop controller that accepts letters as input over USB serial and drives the stepper motors using a precomputed acceleration ramp for smooth control. The firmware automatically calibrates the spool position at startup, using the hall-effect magnetic sensor, and will automatically recalibrate itself if it ever detects that the spool position has gotten out of sync. If a commanded rotation is expected to bring the spool past the \"home\" position, it will confirm that the sensor is triggered neither too early nor too late; otherwise it will search for the \"home\" position to get in sync before continuing to the desired letter.\n\n### Serial protocol\nIn order for a computer to communicate with the splitflap, it appears as a USB serial device.\n\nHowever, usage of Arduinos `Serial` is strictly forbidden, and instead a `logger` abstraction is provided for sending basic text debug logs. Other data is transferred in a structured way, described below.\n\nThis allows flexibility in the format of data transferred over serial, and in fact the splitflap provides 2 different serial modes that serve different purposes.\n\n\n#### Plaintext mode\n\nBy default, it starts in plaintext mode, which is developer-friendly and youre probably familiar with if youve opened a serial monitor with the splitflap connected:\n```\n{\"type\":\"init\", \"num_modules\":6}\n```\n\nHowever, this isnt great for programmatically configuring or receiving updates from the splitflap, so instead the firmware offers a programmatic interface using a binary protocol based on Googles Protobuf standard.\n\n\n#### Protobuf (binary/programmatic) mode\n\nThe protobuf-based binary serial mode is a compact and flexible way to transfer structured data from the host computer to the splitflap and vice-versa.\n\n\n##### Benefits of protobuf\nprotobuf provides several benefits over other encoding mechanisms like JSON:\n\n1. Well-defined schema. If youre curious about the format of data to expect or send, you just need to check the protobuf file\n2. Code generation. Instead of hand-writing JSON parsers every time the data changes, protobuf provides code generation of the encoding and decoding logic, and data-structures. Splitflap uses nanopb to generate C structs based off the schema, and all the code for encoding/decoding that data from the binary format.\n3. Relatively compact/efficient wire encoding. Its not a primary goal in this project, but the binary wire encoding is generally fairly compact, due to omitting default/unspecified fields, using variable length encodings, etc. Its certainly much more compact than JSON which uses strings to describe every field in every message.\n4. Backwards/forwards compatibility. Not super relevant to this project, but many common schema changes are backwards and forwards compatible, meaning an older client or a newer client will be able to handle them gracefully.\n\n##### Disadvantages of protobuf\n\n1. Not human-readable. This makes it much harder to debug, as you need something that can interpret messages. Since theyre binary, viewing anything in a terminal directly will be fruitless.\n2. Not self-describing. If you come across a JSON document, you can generally tell what it means because fields have string names/labels describing their contents. Protobuf has no such thing (it uses integer field numbers, which does make renaming fields easier) so you need to have a copy of the schema (.proto file - and youd better hope it matches the data!) in order to understand an encoded message.\n\nThis is why the splitflap defaults to plaintext mode to make basic validation/debugging easier.\n\n##### How it works\nProtobuf messages are encoded to their binary wire format and a CRC32 checksum appended. Then that entire binary string is COBS encoded into a packet, and delimited/framed by 0 (NULL) bytes when sent over serial. This provides a basic packet-based interface with integrity checks (rather than the raw, stream-based interface of a serial connection).\n\nThe splitflap automatically switches to binary protobuf mode when it receives a 0 byte.\n\n\n### Computer Control Software\nThe display can be controlled by a computer connected to the ESP32 over USB serial. If you've built a display and want to test it out, check out the web-based demo [here](https://scottbez1.github.io/splitflap) which will connect to your display using USB - no applications/installation necessary!\n\nThe firmware supports a plaintext serial mode (enabled by default) for ease of testing, and a protobuf-based binary mode used by the software libraries for enhanced programmatic control and feedback.\n\nYou can find example Typescript and Python libraries in the [`software/chainlink`](software/chainlink) folder.\n\n# Contributing/Modifying\n\nLooking to make some modifications or play around with the design on your local machine? Jump right in! Note that all of the scripts and automation are developed for Ubuntu. Mac OS support is planned,\nbut not currently implemented (but feel free to open a PR if you want to help!).\n\n## 3D Design\n\nThe main design file is [`3d/splitflap.scad`](3d/splitflap.scad)\n\nYou'll need a recent version of OpenSCAD (e.g. 2015-03), which may need to be installed through the PPA:\n`sudo add-apt-repository ppa:openscad/releases`\n\nIn general, solid objects such as the enclosure sides or spool components are built from 2d primitives and then extruded to the appropriate thickness for 3d rendering, rather than using 3d primitives. This simplifies the design without losing expressiveness; the perpendicular laser cut beam doesn't allow for cuts that vary in the Z dimension anyway.\n\nNote that while the design is parameterized and many values may be tweaked, there is currently no error checking for invalid parameters or combinations of parameters. Please take care to validate the design if you change any parameters. For instance, while most of the design will adjust to a changed `num_modules` value, certain values may cause some elements to intersect with other elements or protrude beyond their expected dimensions.\n\n### Rendering\n#### Laser-cut vector files\nThe design can be rendered to 2d for laser cutting by running [`3d/scripts/generate_2d.py [--panelize <number>]`](3d/scripts/generate_2d.py), which outputs to `3d/build/laser_parts/combined.svg`. The optional `--panelize` argument allows for rendering a panel of modules in a single SVG, for bulk laser-cutting.\n\nInternally, the design uses a `projection_renderer` module ([`3d/projection_renderer.scad`](3d/projection_renderer.scad)), which takes a list of child elements to render, and depending on the `render_index` renders a single child at a time. It also _adds_ material to each shape to account for the kerf that will be cut away by the laser.\n\nThe [`generate_2d.py`](3d/scripts/generate_2d.py) script interacts with the `projection_renderer` module by first using it to determine the number of subcomponents to render, then runs OpenSCAD to export each component to an SVG file. It does some post-processing on the SVG output (notably adds \"mm\" to the document dimensions), and then combines all components into the single `combined.svg` output.\n\nOnce the `combined.svg` file is generated, you'll want to double-check there aren't any redundant cut lines that are shared by multiple adjacent pieces, to save time/cost when cutting. They should be detected automatically (and highlighted in red in the rendering above), but it doesn't hurt to double-check. In Inkscape, select the \"Edit paths by nodes\" tool and select an edge to delete - the endpoints should turn blue. Then click \"Delete segment between two non-endpoint nodes\", and repeat this for all other redundant cut lines.\n\n#### Animated gif\nThe design can be rendered to a rotating 3d animated gif (seen above) by running [`3d/scripts/generate_gif.py`](3d/scripts/generate_gif.py), which outputs to `3d/build/animation/animation.gif`\n\nThe `generate_gif.py` script runs multiple OpenSCAD instances in parallel to render the design from 360 degrees to individual png frames, which are then combined into the final gif animation. As part of building the animation, `generate_gif.py` renders the design with multiple configurations (opaque enclosure, see-through enclosure, no-enclosure and no flaps) by setting the `render_enclosure` and `render_flaps` variables.\n\n#### STL models/web viewer\nThe design can be rendered to a series of STL files (one per color used in the model) in order to be displayed in an [interactive web-based 3d viewer](https://scottbez1.github.io/splitflap/). Similar to the `projection_renderer` used to render individual components for laser-cutting, the [ColoredStlExporter](3d/scripts/colored_stl_exporter.py) detects all the colors used in the model and renders them one-by-one to separate STL files, along with a manifest that maps each STL file to its RGB color. The STL files and manifest are loaded using three.js to display an interactive model on a web site using WebGL. See this blog post for more details on how the export and three.js renderer work: [OpenSCAD Rendering Tricks, Part 3: Web viewer](http://scottbezek.blogspot.com/2016/08/openscad-rendering-tricks-part-3-web.html).\n\n\n## Electronics Design\nAll of the electronics are developed using KiCad 5. Panelization is provided by [KiKit](https://github.com/yaqwsx/KiKit) and gerber/BOM generation is provided by [KiBot](https://github.com/INTI-CMNB/KiBot).\n\n### Rendering\nThe mechanical and electrical design renderings and links above are automatically updated on every commit with the latest rendering. See this blog post for more details on how that works: [Automated KiCad, OpenSCAD rendering using Travis CI](http://scottbezek.blogspot.com/2016/04/automated-kicad-openscad-rendering.html).\n\nThe PCB layout can be rendered to an svg or png (seen above) by running [`electronics/scripts/generate_svg.py file.kicad_pcb`](electronics/scripts/generate_svg.py).\nThis uses KiCad's [Python scripting API](https://docs.kicad-pcb.org/doxygen/md_Documentation_development_pcbnew-plugins.html)\nto render several layers to individual svg files, manipulates them to apply color and opacity settings, and then merges them to a single svg.\nFor additional details, see this blog post: [Scripting KiCad Pcbnew exports](http://scottbezek.blogspot.com/2016/04/scripting-kicad-pcbnew-exports.html).\n\nFor reviewing the design, a pdf packet with copper, silkscreen, and drill info can be produced by running [`electronics/scripts/generate_pdf.py file.kicad_pcb`](electronics/scripts/generate_pdf.py).\n\nGerber files for fabrication can be exported by running [`electronics/scripts/generate_gerber.py file.kicad_pcb`](electronics/scripts/generate_gerber.py).\nThis generates gerber files and an Excellon drill file with Seeed Studio's [naming conventions](http://support.seeedstudio.com/knowledgebase/articles/1176532-how-to-generate-the-gerber-manufacturing-files) and produces a `.zip` which can be sent for fabrication.\n\nEESchema isn't easily scriptable, so to export the schematic [`electronics/scripts/export_schematic.py`](electronics/scripts/export_schematic.py) starts an X Virtual Frame Buffer (Xvfb) and open the `eeschema` GUI within that virtual display, and then send a series of hardcoded key presses via `xdotool` to interact with the GUI and click through the dialogs. This is very fragile but seems to work ok for now. For additional details, see this blog post: [Using UI automation to export KiCad schematics](http://scottbezek.blogspot.com/2016/04/automated-kicad-schematic-export.html).\n\n\n\n# License\nI'd love to hear your thoughts and questions about this project, and happy to incorporate any feedback you might have into these designs! Please feel free (and encouraged) to [open GitHub issues](https://github.com/scottbez1/splitflap/issues/new), email me directly, reach out [on Twitter](https://twitter.com/scottbez1), and [get involved](https://github.com/scottbez1/splitflap/pulls) in the open source development and let's keep chatting and building together!\n\nThis project is licensed under Apache v2 (see [LICENSE.txt](LICENSE.txt)).\n\n    Copyright 2015-2024 Scott Bezek and the splitflap contributors\n    \n    Licensed under the Apache License, Version 2.0 (the \"License\");\n    you may not use this file except in compliance with the License.\n    You may obtain a copy of the License at\n    \n        http://www.apache.org/licenses/LICENSE-2.0\n    \n    Unless required by applicable law or agreed to in writing, software\n    distributed under the License is distributed on an \"AS IS\" BASIS,\n    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n    See the License for the specific language governing permissions and\n    limitations under the License.\n"
        },
        {
          "name": "__init__.py",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "arduino",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "electronics",
          "type": "tree",
          "content": null
        },
        {
          "name": "firmware",
          "type": "tree",
          "content": null
        },
        {
          "name": "platformio.ini",
          "type": "blob",
          "size": 5.05078125,
          "content": "; PlatformIO Project Configuration File\n;\n;   Build options: build flags, source filter\n;   Upload options: custom upload port, speed and extra flags\n;   Library options: dependencies, extra library storages\n;   Advanced options: extra scripting\n;\n; Please visit documentation for the other options and examples\n; https://docs.platformio.org/page/projectconf.html\n\n[platformio]\nsrc_dir = firmware/src\nlib_dir = firmware/lib\ninclude_dir = firmware/include\ntest_dir = firmware/test\ndata_dir = firmware/data\n\n; Note: change this to the target environment to get VSCode to handle code\n; completion, etc, correctly.\ndefault_envs = chainlink\n\n[extra]\nlib_deps =\n    Adafruit NeoPixel@1.7.0\n\n; Note: the Arduino Uno builds are temporarily disabled (legacy .ino files are being cleaned up and only platformio will be supported going forward)\n;   Go back to 6c1e1913cbfc23ee90155410a65ac26e2389134f for the last stable version that supported them in the meantime.\n;\n; [env:uno-shift-register]\n; platform = atmelavr\n; board = uno\n; framework = arduino\n; monitor_speed = 38400\n; monitor_echo = yes\n; monitor_eol = LF\n; lib_deps = ${extra.lib_deps}\n; build_flags =\n;     -DSPI_IO=true\n;     -DREVERSE_MOTOR_DIRECTION=false\n;     -DNEOPIXEL_DEBUGGING_ENABLED=true\n;     -DINA219_POWER_SENSE=false\n;     -DSPLITFLAP_PIO_HARDWARE_CONFIG\n\n; [env:uno-direct]\n; platform = atmelavr\n; board = uno\n; framework = arduino\n; monitor_speed = 38400\n; monitor_echo = yes\n; monitor_eol = LF\n; lib_deps = ${extra.lib_deps}\n; build_flags =\n;     -DNUM_MODULES=3\n;     -DSPI_IO=false\n;     -DREVERSE_MOTOR_DIRECTION=false\n;     -DNEOPIXEL_DEBUGGING_ENABLED=true\n;     -DINA219_POWER_SENSE=false\n;     -DSPLITFLAP_PIO_HARDWARE_CONFIG\n\n[esp32base]\nplatform = espressif32@3.4\nframework = arduino\nboard = esp32dev\nupload_speed = 921600\nmonitor_speed = 230400\nmonitor_echo = yes\nmonitor_eol = LF\nmonitor_filters = esp32_exception_decoder\nboard_build.partitions = default_ffat.csv\n\nextra_scripts =\n    pre:firmware/buildscript_build_info_macros.py\n\n; This would be much cleaner if we didn't need to preserve Arduino IDE compatibility and the splitflap\n; module driver could be pulled out to its own library and shared properly... Instead, we remove the\n; .ino file (referred to as .ino.cpp during the build) and add additional source.\nbuild_src_filter = +<*> -<.git/> -<.svn/> -<example/> -<examples/> -<test/> -<tests/> -<Splitflap.ino.cpp> +<../esp32/core> +<../esp32/splitflap> +<../esp32/proto_gen>\nlib_deps =\n    bodmer/TFT_eSPI @ 2.4.25\n    knolleary/PubSubClient @ 2.8\n    bakercp/PacketSerial @ 1.4.0\n    nanopb/Nanopb @ 0.4.6   ; Ideally this would reference the nanopb submodule, but that would require\n                            ; everyone to check out submodules to just compile, so we use the library\n                            ; registry for the runtime. The submodule is available for manually updating\n                            ; the pre-compiled (checked in) .pb.h/c files when proto files change, but is\n                            ; otherwise not used during application firmware compilation.\n\nbuild_flags =\n    -DSPI_IO=true\n    -DSPLITFLAP_PIO_HARDWARE_CONFIG\n    -DREVERSE_MOTOR_DIRECTION=false\n    \n    ; Set to true to enable MQTT support (see secrets.h.example for configuration)\n    -DMQTT=false\n\n    ; Set to true to enable HTTP support (see secrets.h.example for configuration)\n    -DHTTP=false\n\n    ; Set to true to enable display support for T-Display (default)\n    -DENABLE_DISPLAY=true\n\n    -DUSER_SETUP_LOADED=1\n    -DST7789_DRIVER=1\n    -DCGRAM_OFFSET=1\n    -DTFT_WIDTH=135\n    -DTFT_HEIGHT=240\n    -DTFT_MISO=-1\n    -DTFT_MOSI=19\n    -DTFT_SCLK=18\n    -DTFT_CS=5\n    -DTFT_DC=16\n    -DTFT_RST=23\n    -DTFT_BL=4\n    -DLOAD_GLCD=1\n    -DLOAD_GFXFF=1\n    -DSPI_FREQUENCY=40000000\n\n[env:chainlink]\nextends=esp32base\nbuild_flags =\n    ${esp32base.build_flags}\n    -DCHAINLINK\n    -DNUM_MODULES=6\n\n[env:chainlinkBase]\nextends=esp32base\nbuild_src_filter = ${esp32base.build_src_filter} +<../esp32/base>\nbuild_flags =\n    ${esp32base.build_flags}\n    -DCHAINLINK\n    -DCHAINLINK_BASE\n    -DNUM_MODULES=108\n    -DINA219_POWER_SENSE=true\nlib_deps =\n    ${esp32base.lib_deps}\n    adafruit/Adafruit MCP23017 Arduino Library @ ^1.3.0\n    fastled/FastLED @ ^3.4.0\n    adafruit/Adafruit BusIO @ ^1.9.1\n\n[env:chainlinkDriverTester]\nextends=esp32base\nbuild_src_filter = +<*> -<.git/> -<.svn/> -<example/> -<examples/> -<test/> -<tests/> -<Splitflap.ino.cpp> +<../esp32/core> +<../esp32/tester>\nbuild_flags =\n    ${esp32base.build_flags}\n    -DCHAINLINK\n    -DCHAINLINK_DRIVER_TESTER\n    -DNUM_MODULES=12\n    -DINA219_POWER_SENSE=true\nlib_deps =\n    ${esp32base.lib_deps}\n    adafruit/Adafruit MCP23017 Arduino Library @ ^1.3.0\n    adafruit/Adafruit BusIO @ ^1.9.1\nbuild_type = debug\n\n[env:esp32CustomAdvanced]\n; For non-chainlink custom ESP32-based advanced builds that use shift registers but omit the Chainlink design elements like loopbacks and LEDs.\n; This is not the environment you want unless you have custom non-Chainlink hardware and really know the intricacies of the shift register arrangement.\nextends=esp32base\nbuild_flags =\n    ${esp32base.build_flags}\n    -DNUM_MODULES=6"
        },
        {
          "name": "proto",
          "type": "tree",
          "content": null
        },
        {
          "name": "renders",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "software",
          "type": "tree",
          "content": null
        },
        {
          "name": "thirdparty",
          "type": "tree",
          "content": null
        },
        {
          "name": "util",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}