{
  "metadata": {
    "timestamp": 1736562087528,
    "page": 867,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "miroslavpejic85/mirotalk",
      "stars": 3201,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.134765625,
          "content": "# git folder\n**/.git\n\n# npm\nnode_modules\nnpm-debug.log\n\n# package\npackage-lock.json\n\n# mac\n.DS_Store\n\n# cache\n.cache\n\n# personal env\n.env\n"
        },
        {
          "name": ".env.template",
          "type": "blob",
          "size": 6.6513671875,
          "content": "# Domain\n\nHOST=localhost\n\n# Signaling Server listen port\n\nPORT=3000\n\n# Enable self-signed certs (app/ssl)\n\nHTTPS=false # true or false\n\n# Time Zone corresponding to timezone identifiers from the IANA Time Zone Database es Europe/Rome default UTC\n\nTZ=UTC\n\n# Logs\n\nLOGS_DEBUG=true # true or false\nLOGS_COLORS=true # true or false\n\n# Cors\n# Origin: Allow specified origin es '[\"https://example.com\", \"https://subdomain.example.com\", \"http://localhost:3000\"]' or \n# all origins '*' if not specified as per default.\n# Methods: Allow only GET and POST methods\n\nCORS_ORIGIN='*'\nCORS_METHODS='[\"GET\", \"POST\"]'\n\n# IP whitelist\n# Access to the instance is restricted to only the specified IP addresses in the allowed list. This feature is disabled by default.\n\nIP_WHITELIST_ENABLED=false # true or false\nIP_WHITELIST_ALLOWED='[\"127.0.0.1\", \"::1\"]'\n\n# OIDC - OpenID Connect\n# 1. Sign up for an account at https://auth0.com.\n# 2. Navigate to https://manage.auth0.com/ to create a new application tailored to your specific requirements.\n# For those seeking an open-source solution, check out: https://github.com/panva/node-oidc-provider\n\nOIDC_ENABLED=false # true or false\nOIDC_ISSUER_BASE_URL='https://server.example.com'\nOIDC_BASE_URL='http://localhost:3000' # https://p2p.mirotalk.com\nOIDC_CLIENT_ID='ClientID'\nOIDC_CLIENT_SECRET='ClientSecret'\nOIDC_AUTH_REUIRED=false # set to true if authentication is required for all routes\nSESSION_SECRET='mirotalk-p2p-oidc-secret'\n\n# Host protection\n# HOST_PROTECTED: \n#\t\t- When set to true, it requires a valid username and password from the HOST_USERS list to initialize or join a room.\n#\t\t- When OIDC_ENABLED is utilized alongside host protection, the authenticated user will be recognized as valid.# HOST_USER_AUTH: When set to true, it also requires a valid username and password for joining the room.\n# HOST_USERS: This is the list of valid users along with their credentials.\n\nHOST_PROTECTED=false # true or false\nHOST_USER_AUTH=false # true or false\nHOST_USERS='[{\"username\": \"username\", \"password\": \"password\"},{\"username\": \"username2\", \"password\": \"password2\"}]'\n\n# JWT token config\n\nJWT_KEY=mirotalkp2p_jwt_secret\nJWT_EXP=1h\n\n# Presenters list\n# In our virtual room, the first participant to join will assume the role of the presenter. \n# Additionally, we have the option to include more presenters and co-presenters, each identified by their username.\n\nPRESENTERS='[\"Miroslav Pejic\", \"miroslav.pejic.85@gmail.com\"]'\n\n# Ngrok\n# 1. Goto https://ngrok.com\n# 2. Get started for free \n# 3. Copy YourNgrokAuthToken: https://dashboard.ngrok.com/get-started/your-authtoken\n\nNGROK_ENABLED=false # true or false\nNGROK_AUTH_TOKEN=YourNgrokAuthToken\n\n# Stun\n# About: https://bloggeek.me/webrtcglossary/stun/\n# Check: https://webrtc.github.io/samples/src/content/peerconnection/trickle-ice/\n\nSTUN_SERVER_ENABLED=true # true or false\nSTUN_SERVER_URL=stun:stun.l.google.com:19302\n\n# Turn \n# About: https://bloggeek.me/webrtcglossary/turn/\n# Recommended: https://github.com/coturn/coturn\n# Installation: https://github.com/miroslavpejic85/mirotalk/blob/master/docs/coturn.md\n# Free one: https://www.metered.ca/tools/openrelay/ (Please, create your own account)\n# Check: https://webrtc.github.io/samples/src/content/peerconnection/trickle-ice/\n\nTURN_SERVER_ENABLED=true # true or false\nTURN_SERVER_URL=turn:a.relay.metered.ca:443\nTURN_SERVER_USERNAME=e8dd65b92c62d3e36cafb807\nTURN_SERVER_CREDENTIAL=uWdWNmkhvyqTEswO\n\n# IP lookup\n# Using GeoJS to get more info about peer by IP\n# Doc: https://www.geojs.io/docs/v1/endpoints/geo/\n\nIP_LOOKUP_ENABLED=false # true or false\n\n# API\n# The response will give you a entrypoint / Room URL for your meeting.\n# curl -X POST \"http://localhost:3000/api/v1/meeting\" -H  \"authorization: mirotalkp2p_default_secret\" -H  \"Content-Type: application/json\"\n\nAPI_KEY_SECRET=mirotalkp2p_default_secret\nAPI_DISABLED='[\"token\", \"meetings\"]'\n\n# Survey URL \n# Using to redirect the client after close the call (feedbacks, website...)\n\nSURVEY_ENABLED=true # true or false\nSURVEY_URL=https://www.questionpro.com/t/AUs7VZq00L\n\n# Redirect URL on leave room\n# Upon leaving the room, users who either opt out of providing feedback or if the survey is disabled \n# will be redirected to a specified URL. If enabled false the default '/newrcall' URL will be used.\n\nREDIRECT_ENABLED=false # true or false\nREDIRECT_URL='https://p2p.mirotalk.com'\n\n# Sentry (optional)\n# 1. Goto https://sentry.io/\n# 2. Create account\n# 3. Goto Settings/Projects/YourProjectName/Client Keys (DSN)\n\nSENTRY_ENABLED=false # true or false\nSENTRY_DSN=YourClientKeyDSN\nSENTRY_TRACES_SAMPLE_RATE=1.0\n\n# Slack Integration (optional)\n# 1. Goto https://api.slack.com/apps/\n# 2. Create your app\n# 3. On Settings - Basic Information - App Credentials chose your Signing Secret\n# 4. Create a Slash Commands and put as Request URL: https://your.domain.name/slack\n\nSLACK_ENABLED=false # true or false\nSLACK_SIGNING_SECRET=YourSlackSigningSecret\n\n# Mattermost Integration (optional)\n# 1. Navigate to Main Menu > Integrations > Slash Commands in Mattermost.\n# 2. Click on Add Slash Command and configure the following settings:\n#    - Title: Enter a descriptive title (e.g., `P2P Command`).\n#    - Command Trigger Word: Set the trigger word to `p2p`.\n#    - Callback URLs: Enter the URL for your Express server (e.g., `https://yourserver.com/mattermost`).\n#    - Request Method: Select POST.\n#    - Enable Autocomplete: Check the box for Autocomplete.\n#    - Autocomplete Description: Provide a brief description (e.g., `Get MiroTalk P2P meeting room`).\n# 3. Save the slash command and copy the generated token here as MATTERMOST_TOKEN.\n\nMATTERMOST_ENABLED=false # true or false\nMATTERMOST_SERVER_URL=YourMattermostServerUrl\nMATTERMOST_USERNAME=YourMattermostUsername\nMATTERMOST_PASSWORD=YourMattermostPassword\nMATTERMOST_TOKEN=YourMettarmostToken\n\n# ChatGPT/OpenAI\n# 1. Goto https://platform.openai.com/\n# 2. Create your account\n# 3. Generate your APIKey https://platform.openai.com/account/api-keys\n\nCHATGPT_ENABLED=false # true or false\nCHATGPT_BASE_PATH=https://api.openai.com/v1/\nCHATGPT_APIKEY=YourOpenAiApiKey\nCHATGPT_MODEL=gpt-3.5-turbo\nCHATGPT_MAX_TOKENS=1000\nCHATGPT_TEMPERATURE=0\n\n# Configure email settings for notifications or alerts\n# Refer to the documentation for Gmail configuration: https://support.google.com/mail/answer/185833?hl=en\n\nEMAIL_ALERT=false # true or false\nEMAIL_HOST=smtp.gmail.com\nEMAIL_PORT=587\nEMAIL_USERNAME=your_username\nEMAIL_PASSWORD=your_password\nEMAIL_SEND_TO=p2p.mirotalk@gmail.com\n\n# Stats\n# Umami: https://github.com/umami-software/umami\n# We use our Self-hosted Umami to track aggregated usage statistics in order to improve our service.\n\nSTATS_ENABLED=true # true or false\nSTATS_SCR=https://stats.mirotalk.com/script.js\nSTATS_ID=c7615aa7-ceec-464a-baba-54cb605d7261"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2060546875,
          "content": "# git folder\n.git\n\n# npm\nnode_modules\nnpm-debug.log\n\n# package\npackage-lock.json\n\n# mac\n.DS_Store\n\n# cache\n.cache\n\n# personal env\n.env\nconfig.js\ndocker-push.sh\ndocker-compose.yml\nturnserver.conf\noutput\nenv.txt\n\n"
        },
        {
          "name": ".prettierignore",
          "type": "blob",
          "size": 0.0078125,
          "content": ".github\n"
        },
        {
          "name": ".prettierrc.js",
          "type": "blob",
          "size": 0.1220703125,
          "content": "module.exports = {\n    semi: true,\n    trailingComma: 'all',\n    singleQuote: true,\n    printWidth: 120,\n    tabWidth: 4,\n};\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.240234375,
          "content": "# MiroTalk Open Source Community Code of Conduct\n\n## About the Code of Conduct\n\nEquality is a core value at MiroTalk. We believe a diverse and inclusive\ncommunity fosters innovation and creativity, and are committed to building a\nculture where everyone feels included.\n\nMiroTalk open-source projects are committed to providing a friendly, safe, and\nwelcoming environment for all, regardless of gender identity and expression,\nsexual orientation, disability, physical appearance, body size, ethnicity, nationality,\nrace, age, religion, level of experience, education, socioeconomic status, or\nother similar personal characteristics.\n\nThe goal of this code of conduct is to specify a baseline standard of behavior so\nthat people with different social values and communication styles can work\ntogether effectively, productively, and respectfully in our open source community.\nIt also establishes a mechanism for reporting issues and resolving conflicts.\n\nAll questions and reports of abusive, harassing, or otherwise unacceptable behavior\nin a MiroTalk open-source project may be reported by contacting the MiroTalk\nOpen Source Conduct Committee at ossconduct.mirotalk@gmail.com.\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of gender\nidentity and expression, sexual orientation, disability, physical appearance,\nbody size, ethnicity, nationality, race, age, religion, level of experience, education,\nsocioeconomic status, or other similar personal characteristics.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n- Using welcoming and inclusive language\n- Being respectful of differing viewpoints and experiences\n- Gracefully accepting constructive criticism\n- Focusing on what is best for the community\n- Showing empathy toward other community members\n\nExamples of unacceptable behavior by participants include:\n\n- The use of sexualized language or imagery and unwelcome sexual attention or\n  advances\n- Personal attacks, insulting/derogatory comments, or trolling\n- Public or private harassment\n- Publishing, or threatening to publish, others' private information—such as\n  a physical or electronic address—without explicit permission\n- Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n- Advocating for or encouraging any of the above behaviors\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned with this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project email\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the MiroTalk Open Source Conduct Committee\nat ossconduct.mirotalk@gmail.com. All complaints will be reviewed and investigated\nand will result in a response that is deemed necessary and appropriate to the\ncircumstances. The committee is obligated to maintain confidentiality with\nregard to the reporter of an incident. Further details of specific enforcement\npolicies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership and the MiroTalk Open Source Conduct\nCommittee.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][contributor-covenant-home],\nversion 1.4, available at [https://www.contributor-covenant.org/version/1/4/code_of_conduct.html][v1.4].\nIt includes adaptions and additions from [Go Community Code of Conduct][golang-coc],\n[CNCF Code of Conduct][cncf-coc], and [Microsoft Open Source Code of Conduct][microsoft-coc].\n\nFor answers to common questions about this code of conduct, see the FAQ at\n[https://www.contributor-covenant.org/faq][FAQ]. Translations are available at\n[https://www.contributor-covenant.org/translations][translations].\n\n[contributor-covenant-home]: https://www.contributor-covenant.org\n[v1.4]: https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n[golang-coc]: https://golang.org/conduct\n[cncf-coc]: https://github.com/cncf/foundation/blob/master/code-of-conduct.md\n[microsoft-coc]: https://opensource.microsoft.com/codeofconduct/\n[FAQ]: https://www.contributor-covenant.org/faq\n[translations]: https://www.contributor-covenant.org/translations\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.501953125,
          "content": "# Use a lightweight Node.js image \nFROM node:20-alpine\n\n# Set working directory\nWORKDIR /src\n\n# Copy package.json and .env dependencies\nCOPY package.json .\nCOPY .env.template ./.env\n\n# Install necessary system packages and dependencies\nRUN apk add --no-cache \\\n    bash \\\n    vim \\\n    && npm install \\\n    && npm cache clean --force \\\n    && rm -rf /tmp/* /var/tmp/* /usr/share/doc/*\n\n# Copy the application code\nCOPY app app\nCOPY public public\n\n# Set default command to start the application\nCMD [\"npm\", \"start\"]"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 33.69921875,
          "content": "                GNU AFFERO GENERAL PUBLIC LICENSE\n                  Version 3, 19 November 2007\n\nCopyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\nEveryone is permitted to copy and distribute verbatim copies\nof this license document, but changing it is not allowed.\n\n                          Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                          TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\nA separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                    END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published\n    by the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<https://www.gnu.org/licenses/>."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 20.509765625,
          "content": "<h1 align=\"center\">MiroTalk P2P</h1>\n\n<br />\n\n<div align=\"center\">\n\n<a href=\"https://www.linkedin.com/in/miroslav-pejic-976a07101/\">![Author](https://img.shields.io/badge/Author-Miroslav_Pejic-brightgreen.svg)</a>\n<a href=\"https://choosealicense.com/licenses/agpl-3.0/\">![License: AGPLv3](https://img.shields.io/badge/License-AGPLv3_Open_Surce-blue.svg)</a>\n<a href=\"https://codecanyon.net/item/mirotalk-p2p-webrtc-realtime-video-conferences/38376661\">![License: Regular](https://img.shields.io/badge/License-Regular_Private_Use-lightblue.svg)</a>\n<a href=\"https://codecanyon.net/item/mirotalk-p2p-webrtc-realtime-video-conferences/38376661\">![License: Extended](https://img.shields.io/badge/License-Extended_Commercial_Use-darkgreen.svg)</a>\n<a href=\"https://discord.gg/rgGYfeYW3N\">![Community](https://img.shields.io/badge/Community-forum-pink.svg)</a>\n\n</div>\n\n<p align=\"center\">Free WebRTC - P2P - Simple, Secure, Fast Real-Time Video Conferences with support for up to 8k resolution and 60fps. It's compatible with all major browsers and platforms.</p>\n\n<hr />\n\n<p align=\"center\">\n    <a href=\"https://p2p.mirotalk.com\">Explore MiroTalk P2P</a>\n</p>\n\n<hr />\n\n<p align=\"center\">\n    <a href=\"https://p2p.mirotalk.com\"><img src=\"public/images/mirotalk-header.gif\"></a>\n</p>\n\n<hr />\n\n<p align=\"center\">\n    Join our community for questions, discussions, and support on <a href=\"https://discord.gg/rgGYfeYW3N\">Discord</a>\n</p>\n\n<hr />\n\n<details>\n<summary>Features</summary>\n\n<br/>\n\n- Is `100% Free` - `Open Source under (AGPLv3)` - `Self Hosted` and [PWA](https://en.wikipedia.org/wiki/Progressive_web_application)!\n- No downloads, plugins, or logins required – completely browser-based.\n- Unlimited conference rooms with no time limitations.\n- Translated into 133 languages.\n- Support for the OpenID Connect (OIDC) authentication layer.\n- Host protection to prevent unauthorized access.\n- User auth to prevent unauthorized access.\n- Room password protection.\n- JWT.io securely manages credentials for host configurations and user authentication, enhancing security and streamlining processes.\n- Compatible with desktop and mobile devices.\n- Optimized mobile room URL sharing.\n- Webcam streaming with front and rear camera support for mobile devices.\n- Crystal-clear audio streaming with speaking detection and volume indicators.\n- Screen sharing for presentations.\n- File sharing with drag-and-drop support.\n- Choose your audio input, output, and video source.\n- Supports video quality up to 8K and 60 FPS.\n- Supports advance Picture-in-Picture (PiP) offering a more streamlined and flexible viewing experience.\n- Record your screen, audio, and video.\n- Snapshot video frames and save them as PNG images.\n- Chat with an Emoji Picker for expressing feelings, private messages, Markdown support, and conversation saving.\n- ChatGPT (powered by OpenAI) for answering questions, providing information, and connecting users to relevant resources.\n- Speech recognition for sending spoken messages.\n- Push-to-talk functionality, similar to a walkie-talkie.\n- Advanced collaborative whiteboard for teachers.\n- Real-time sharing of YouTube embed videos, video files (MP4, WebM, OGG), and audio files (MP3).\n- Full-screen mode with one-click video element zooming and pin/unpin.\n- Customizable UI themes.\n- Right-click options on video elements for additional controls.\n- Direct peer-to-peer connections for low-latency communication through WebRTC.\n- Supports [REST API](app/api/README.md) (Application Programming Interface).\n- Integration with [Mattermost](https://mattermost.com/) for enhanced communication.\n- Integration with [Slack](https://api.slack.com/apps/) for enhanced communication.\n- Utilizes [Sentry](https://sentry.io/) for error reporting.\n- And much more...\n\n</details>\n\n<details>\n<summary>About</summary>\n\n<br>\n\n- [Presentation](https://www.canva.com/design/DAE693uLOIU/view)\n- [Video Overview](https://www.youtube.com/watch?v=_IVn2aINYww)\n\n</details>\n\n<details>\n<summary>Start videoconference</summary>\n\n<br/>\n\n1. `Open` [MiroTalk P2P](https://p2p.mirotalk.com/newcall) or [alternative link](https://mirotalk.up.railway.app/newcall).\n2. `Choose` a room name and click **Join Room**.\n3. `Grant` camera and microphone access.\n4. `Share` the room URL and wait for participants to join the video conference.\n\n</details>\n\n<details>\n<summary>Direct Join</summary>\n\n<br/>\n\n- You can `directly join a room` by using links like:\n- https://p2p.mirotalk.com/join?room=test&name=mirotalk&audio=0&video=0&screen=0&hide=0&notify=0\n- https://mirotalk.up.railway.app/join?room=test&name=mirotalk&audio=0&video=0&screen=0&hide=0&notify=0\n\n    | Params | Type    | Description     |\n    | ------ | ------- | --------------- |\n    | room   | string  | Room Id         |\n    | name   | string  | User name       |\n    | audio  | boolean | Audio stream    |\n    | video  | boolean | Video stream    |\n    | screen | boolean | Screen stream   |\n    | hide   | boolean | Hide myself     |\n    | notify | boolean | Welcome message |\n    | token  | string  | jwt token       |\n\n> **Note**\n>\n> The `token` parameter are optional when either `HOST_PROTECTED` or `HOST_USER_AUTH` is set to `true` in the `.env` file. The valid list of users is defined in the `HOST_USERS` configuration.\n\n</details>\n\n<details>\n<summary>Host Protection Configuration</summary>\n\n<br/>\n\nWhen [host protection](https://docs.mirotalk.com/mirotalk-p2p/host-protection/) or host user auth is enabled, the host/users must provide a valid username and password as specified in the `.env` file.\n\n| Params           | Value                                                                            | Description                                                                            |\n| ---------------- | -------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------- |\n| `HOST_PROTECTED` | `true` if protection is enabled, `false` if not (default false)                  | Requires the host to provide a valid username and password during room initialization. |\n| `HOST_USER_AUTH` | `true` if user authentication is required, `false` if not (default false).       | Determines whether host authentication is required.                                    |\n| `HOST_USERS`     | JSON array with user objects: `{\"username\": \"username\", \"password\": \"password\"}` | List of valid host users with their credentials.                                       |\n\n</details>\n\n<details open>\n<summary>Quick start</summary>\n\n![nodejs](public/images/nodejs.png)\n\n- Before running MiroTalk P2P, ensure you have `Node.js` installed. This project has been tested with Node versions [12.X](https://nodejs.org/en/blog/release/v12.22.1/), [14.X](https://nodejs.org/en/blog/release/v14.17.5/), [16.X](https://nodejs.org/en/blog/release/v16.15.1/) and [18.x](https://nodejs.org/en/download).\n\n```bash\n# clone this repo\n$ git clone https://github.com/miroslavpejic85/mirotalk.git\n# go to mirotalk dir\n$ cd mirotalk\n# copy .env.template to .env (edit it according to your needs)\n$ cp .env.template .env\n# Copy app/src/config.template.js in app/src/config.js (edit it according to your needs)\n$ cp app/src/config.template.js app/src/config.js\n# install dependencies\n$ npm install\n# start the server\n$ npm start\n```\n\n- Open [http://localhost:3000](http://localhost:3000) in your browser.\n\n</details>\n\n<details open>\n<summary>Docker</summary>\n\n<br/>\n\n![docker](public/images/docker.png)\n\n- Repository [docker hub](https://hub.docker.com/r/mirotalk/p2p)\n- Install [docker engine](https://docs.docker.com/engine/install/) and [docker compose](https://docs.docker.com/compose/install/)\n\n```bash\n# clone this repo\n$ git clone https://github.com/miroslavpejic85/mirotalk.git\n# go to mirotalk dir\n$ cd mirotalk\n# copy .env.template to .env (edit it according to your needs)\n$ cp .env.template .env\n# Copy app/src/config.template.js in app/src/config.js (edit it according to your needs)\n$ cp app/src/config.template.js app/src/config.js\n# Copy docker-compose.template.yml in docker-compose.yml (edit it according to your needs)\n$ cp docker-compose.template.yml docker-compose.yml\n# Get official image from Docker Hub\n$ docker pull mirotalk/p2p:latest\n# create and start containers\n$ docker-compose up # -d\n# to stop and remove resources\n$ docker-compose down\n```\n\n- Open [http://localhost:3000](http://localhost:3000) in your browser.\n\n</details>\n\n<details open>\n<summary>Embed a meeting</summary>\n\n<br/>\n\n![iframe](public/images/iframe.png)\n\nTo embed a meeting within `your service or app` using an iframe, you can use the following code:\n\n```html\n<iframe\n    allow=\"camera; microphone; display-capture; fullscreen; clipboard-read; clipboard-write; web-share; autoplay\"\n    src=\"https://p2p.mirotalk.com/newcall\"\n    style=\"height: 100vh; width: 100vw; border: 0px;\"\n></iframe>\n```\n\n</details>\n\n<details>\n<summary>Documentations</summary>\n\n<br>\n\n- `Ngrok/HTTPS:` You can start a video conference directly from your local PC and make it accessible from any device outside your network by following [these instructions](docs/ngrok.md), or expose it directly on [HTTPS](app/ssl/README.md).\n\n- `Stun/Turn:` Install your own [Stun & Turn](https://docs.mirotalk.com/coturn/stun-turn/) by following [this instructions](./docs/coturn.md).\n\n- `Self-hosting:` For `self-hosting MiroTalk P2P` on your own dedicated server, please refer to [this comprehensive guide](docs/self-hosting.md). It will provide you with all the necessary instructions to get your MiroTalk P2P instance up and running smoothly.\n\n- `Rest API:` The [API documentation](https://docs.mirotalk.com/mirotalk-p2p/api/) uses [swagger](https://swagger.io/) at http://localhost:3000/api/v1/docs. Or check it out on [live](https://p2p.mirotalk.com/api/v1/docs).\n\n```bash\n# The response will give you the total of rooms and peers.\n$ curl -X GET \"http://localhost:3000/api/v1/stats\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X GET \"https://p2p.mirotalk.com/api/v1/stats\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X GET \"https://mirotalk.up.railway.app/api/v1/stats\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n# The response will give you the active meetings (default disabled).\n$ curl -X GET \"http://localhost:3000/api/v1/meetings\" -H \"authorization: mirotalksfu_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X GET \"https://p2p.mirotalk.com/api/v1/meetings\" -H \"authorization: mirotalksfu_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X GET \"mirotalk.up.railway.app/api/v1/meetings\" -H \"authorization: mirotalksfu_default_secret\" -H \"Content-Type: application/json\"\n# The response will give you a entrypoint / Room URL for your meeting.\n$ curl -X POST \"http://localhost:3000/api/v1/meeting\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X POST \"https://p2p.mirotalk.com/api/v1/meeting\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n$ curl -X POST \"https://mirotalk.up.railway.app/api/v1/meeting\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\"\n# The response will give you a entrypoint / URL for the direct join to the meeting.\n$ curl -X POST \"http://localhost:3000/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\"}'\n$ curl -X POST \"https://p2p.mirotalk.com/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\"}'\n$ curl -X POST \"https://mirotalk.up.railway.app/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\"}'\n# The response will give you an entry point/URL for direct joining to the meeting with a token.\n$ curl -X POST \"http://localhost:3000/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\",\"token\":{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}}'\n$ curl -X POST \"https://p2p.mirotalk.com/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\",\"token\":{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}}'\n$ curl -X POST \"https://mirotalk.up.railway.app/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"room\":\"test\",\"name\":\"mirotalk\",\"audio\":\"true\",\"video\":\"true\",\"screen\":\"false\",\"hide\":\"false\",\"notify\":\"true\",\"token\":{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}}'\n# The response will give you a valid token for a meeting.\n$ curl -X POST \"http://localhost:3000/api/v1/token\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}'\n$ curl -X POST \"https://p2p.mirotalk.com/api/v1/token\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}'\n$ curl -X POST \"https://mirotalk.up.railway.app/api/v1/join\" -H \"authorization: mirotalkp2p_default_secret\" -H \"Content-Type: application/json\" --data '{\"username\":\"username\",\"password\":\"password\",\"presenter\":\"true\", \"expire\":\"1h\"}'\n```\n\n</details>\n\n<details open>\n<summary>Hetzner & Contabo</summary>\n\n<br/>\n\n[![Hetzner](public/sponsors/Hetzner.png)](https://hetzner.cloud/?ref=XdRifCzCK3bn)\n\nThis application is running for `demonstration purposes` on [Hetzner](https://www.hetzner.com/), one of `the best` [cloud providers](https://www.hetzner.com/cloud) and [dedicated root servers](https://www.hetzner.com/dedicated-rootserver).\n\n---\n\nUse [my personal link](https://hetzner.cloud/?ref=XdRifCzCK3bn) to receive `€⁠20 IN CLOUD CREDITS`.\n\n---\n\n[![Contabo](public/advertisers/ContaboLogo.png)](https://www.dpbolvw.net/click-101027391-14462707)\n\nExperience also top-tier German web hosting – dedicated servers, VPS, and web hosting at `unbeatable prices`. Reliable, secure, and backed by 24/7 support. [Explore now here](https://www.dpbolvw.net/click-101027391-14462707)\n\n---\n\nTo set up your own instance of `MiroTalk P2P` on a dedicated cloud server, please refer to our comprehensive [self-hosting documentation](https://docs.mirotalk.com/mirotalk-p2p/self-hosting/). This guide will walk you through the process step by step, ensuring a smooth and successful deployment.\n\n</details>\n\n<details>\n<summary>Live Demos</summary>\n\n<br/>\n\n<a target=\"_blank\" href=\"https://p2p.mirotalk.com\"><img src=\"public/sponsors/Hetzner.png\" style=\"width: 220px;\"></a>\n\nhttps://p2p.mirotalk.com\n\n[![hetzner-qr](public/images/mirotalk-hetzner-qr.png)](https://p2p.mirotalk.com)\n\n<br>\n\n<a target=\"_blank\" href=\"https://railway.app/new/template/mirotalk?referralCode=mirotalk\"><img src=\"https://railway.app/button.svg\" style=\"width: 220px;\"></a>\n\nhttps://mirotalk.up.railway.app\n\n[![railway-qr](public/images/mirotalk-railway-qr.png)](https://mirotalk.up.railway.app)\n\n</details>\n\n<details>\n<summary>Security</summary>\n\n<br/>\n\nFor `Security` concerning, please follow [this documentation](./SECURITY.md).\n\n</details>\n\n<details>\n<summary>Credits</summary>\n\n<br/>\n\n- ianramzy (html [template](https://cruip.com/demos/neon/))\n- vasanthv (webrtc-logic)\n- fabric.js (whiteboard)\n\n</details>\n\n<details>\n<summary>Contributing</summary>\n\n<br/>\n\n- Contributions are welcome and greatly appreciated!\n- Just run before `npm run lint`\n\n</details>\n\n<details>\n<summary>License</summary>\n\n<br/>\n\n[![AGPLv3](public/images/AGPLv3.png)](LICENSE)\n\nMiroTalk P2P is free and open-source under the terms of AGPLv3 (GNU Affero General Public License v3.0). Please `respect the license conditions`, In particular `modifications need to be free as well and made available to the public`. Get a quick overview of the license at [Choose an open source license](https://choosealicense.com/licenses/agpl-3.0/).\n\nTo obtain a [MiroTalk P2P license](https://docs.mirotalk.com/license/licensing-options/) with terms different from the AGPLv3, you can conveniently make your [purchase on CodeCanyon](https://codecanyon.net/item/mirotalk-p2p-webrtc-realtime-video-conferences/38376661). This allows you to tailor the licensing conditions to better suit your specific requirements.\n\n</details>\n\n<details open>\n<summary>Support the project</summary>\n\n<br/>\n\nDo you find MiroTalk P2P indispensable for your needs? Join us in supporting this transformative project by [becoming a backer or sponsor](https://github.com/sponsors/miroslavpejic85). By doing so, not only will your logo prominently feature here, but you'll also drive the growth and sustainability of MiroTalk P2P. Your support is vital in ensuring that this valuable platform continues to thrive and remain accessible for all. Make an impact – back MiroTalk P2P today and be part of this exciting journey!\n\n|                                                                                                                           |                                                                                        |\n| ------------------------------------------------------------------------------------------------------------------------- | -------------------------------------------------------------------------------------- |\n| [![BroadcastX](public/sponsors/BroadcastX.png)](https://broadcastx.de/)                                                   | [![Hetzner](public/sponsors/HetznerLogo.png)](https://hetzner.cloud/?ref=XdRifCzCK3bn) |\n| [![LuvLounge](public/sponsors/LuvLounge.png)](https://luvlounge.ca)                                                       | [![QuestionPro](public/sponsors/QuestionPro.png)](https://www.questionpro.com)         |\n| [![BrowserStack](public/sponsors/BrowserStack.png)](https://www.browserstack.com)                                         | [![CrystalSound](public/sponsors/CrystalSound.png)](https://crystalsound.ai)           |\n| [![Cloudron](public/sponsors/Cloudron.png)](https://cloudron.io)                                                          | [![Kiquix](public/sponsors/KiquixLogo.png)](https://kiquix.com)                        |\n| [![LambdaTest](public/sponsors/LambdaTest.png)](https://lambdatest.com/pricing?coupon=QURFODlQUk9NT1RFUg==&refid=1149848) |\n|                                                                                                                           |\n\n</details>\n\n<details open>\n<summary>Advertisers</summary>\n\n---\n\n[![Contabo](public/advertisers/ContaboLogo.png)](https://www.dpbolvw.net/click-101027391-14462707)\n\n---\n\n</details>\n\n## Diving into Additional MiroTalk Projects:\n\n<details>\n<summary>MiroTalk SFU</summary>\n\n<br>\n\nTry also [MiroTalk SFU](https://github.com/miroslavpejic85/mirotalksfu) `selective forwarding unit` real-time video conferences, optimized for large groups. `Unlimited time, unlimited concurrent rooms` each having 8+ participants, up to ~ 100 per single CPU.\n\n</details>\n\n<details>\n<summary>MiroTalk C2C</summary>\n\n<br>\n\nTry also [MiroTalk C2C](https://github.com/miroslavpejic85/mirotalkc2c) `peer to peer` real-time video conferences, optimized for cam 2 cam. `Unlimited time, unlimited concurrent rooms` each having 2 participants.\n\n</details>\n\n<details>\n<summary>MiroTalk BRO</summary>\n\n<br>\n\nTry also [MiroTalk BRO](https://github.com/miroslavpejic85/mirotalkbro) `Live broadcast` (peer to peer) live video, audio and screen stream to all connected users (viewers). `Unlimited time, unlimited concurrent rooms` each having a broadcast and many viewers.\n\n</details>\n\n<details>\n<summary>MiroTalk WEB</summary>\n\n<br>\n\nTry also [MiroTalk WEB](https://github.com/miroslavpejic85/mirotalkwebrtc) a platform that allows for the management of an `unlimited number of users`. Each user must register with their email, username, and password, after which they gain access to their `personal dashboard`. Within the dashboard, users can `manage their rooms and schedule meetings` using the desired version of MiroTalk on a specified date and time. Invitations to these meetings can be sent via email, shared through the web browser, or sent via SMS.\n\n</details>\n\n---\n\nThis project is tested with [BrowserStack](https://www.browserstack.com).\n\n---\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.947265625,
          "content": "# Security Policy\n\n## Reporting a Vulnerability\n\nSecurity is very important to us.\n\nIf you have discovered a security issue, please contact miroslav.pejic.85@gmail.com directly. Please refrain from directly creating a GitHub issue and publicly disclosing the vulnerability.\nWe prefer a Coordinated Vulnerability Disclosure (CVD) to properly understand and fix the root cause problem.\n\nYour report should include:\n\n- Product version ([GitHub](https://github.com/miroslavpejic85/mirotalk/commits/master) commit hash or [DockerHub](https://hub.docker.com/r/mirotalk/p2p) sha256 digest hash)\n- The affected component if possible (client.js, server.js, etc.)\n- A vulnerability description\n- Reproduction steps\n\nA member of the security team will confirm the vulnerability, determine its impact, and develop a fix.\nThe fix will be applied to the master branch, tested, and packaged in the next security release.\n\nThanks in advance for your support to make our products safer!\n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "coturn",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker-compose.template.yml",
          "type": "blob",
          "size": 0.9931640625,
          "content": "services:\n    mirotalk:\n        image: mirotalk/p2p:latest\n        container_name: mirotalk\n        hostname: mirotalk\n        volumes:\n            - .env:/src/.env:ro\n            # Rebranding:\n            # - ./app/src/config.js:/src/app/src/config.js:ro\n            # Optional volumes for real-time updates:\n            # - ./app/:/src/app/:ro\n            # - ./public/:/src/public/:ro\n        restart: unless-stopped\n        ports:\n            - '${PORT}:${PORT}'\n# Uncomment below, remove \"ports:\" section above and configure labels as\n# needed for LetsEncrypt TLS certificates with Traefik.\n# See https://doc.traefik.io/traefik/user-guides/docker-compose/basic-example/\n#   expose:\n#     - 3000\n#   labels:\n#     - \"traefik.enable=true\"\n#     - \"traefik.http.routers.mirotalk.rule=Host(`mirotalk.example.com`)\"\n#     - \"traefik.http.routers.mirotalk.entrypoints=websecure\"\n#     - \"traefik.http.routers.mirotalk.tls.certresolver=myresolver\"\n#     - \"traefik.http.services.mirotalk.loadbalancer.server.port=3000\"\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "install.sh",
          "type": "blob",
          "size": 2.7216796875,
          "content": "#!/bin/bash\n\n# ============================================\n# RUN sudo ./install.sh\n# ============================================\n\nset -e  # Exit immediately if a command exits with a non-zero status\n\n# -------------------------------------------------------\n# bash colors for log\n# -------------------------------------------------------\n\nblack=`tput setaf 0`\nred=`tput setaf 1`\ngreen=`tput setaf 2`\nyellow=`tput setaf 3`\nblue=`tput setaf 4`\nmagenta=`tput setaf 5`\ncyan=`tput setaf 6`\nwhite=`tput setaf 7`\nreset=`tput sgr0`\n\n# -------------------------------------------------------\n# print log level\n# -------------------------------------------------------\nfunction log() {\n    date_now=`date '+%Y-%m-%d %H:%M:%S'`\n    case $1 in\n        debug)   echo -e \"${date_now} :: ${2}\" ;;\n        warning) echo -e \"${date_now} :: ${yellow}${2}${reset}\" ;;\n        error)   echo -e \"${date_now} :: ${red}${2}${reset}\" ;;\n        *)       echo -e \"${date_now} :: ${magenta}${1}${reset}\" ;;\n    esac\n}\n\n# -------------------------------------------------------\n# Check if Linux OS\n# -------------------------------------------------------\nunamestr=$(uname)\nif [[ \"$unamestr\" != 'Linux' ]]; then\n    log warning \"This install script is supported only on Linux OS\"\n    exit\nfi\n\n# -------------------------------------------------------\n# Check if run as root\n# -------------------------------------------------------\nif [ \"$EUID\" -ne 0 ]; then \n    log warning \"Please run as root: sudo ./install.sh\"\n    exit\nfi\n\n# ============================================\n# Start the installation...\n# ============================================\n\nENV=.env\n\nif ! [ -f \"$ENV\" ]; then\n\n    log \"Copy .env.template to .env (edit it according to your needs)\"\n\n    cp .env.template $ENV\n\nfi\n\nprintf 'Use docker (y/n)? '\nread answer\n\nif [ \"$answer\" != \"${answer#[Yy]}\" ] ;then\n\n    log \"Install Docker and Docker Compose\"\n\n    sudo apt install -y docker.io\n\n    sudo apt install -y docker-compose \n\n\n    log \"Add the current user to the docker group\"\n\n    usermod -aG docker $USER\n\n\n    YAML=docker-compose.yml\n\n    if ! [ -f \"$YAML\" ]; then\n\n        log \"Copy Docker compose yaml file\"\n\n        cp docker-compose.template.yml $YAML\n    fi\n\n    printf 'Use official docker image (y/n)? '\n    read answer\n\n    if [ \"$answer\" != \"${answer#[Yy]}\" ] ;then\n\n        log \"Get latest official image from Docker Hub\"\n\n        docker pull mirotalk/p2p:latest\n    else\n        log \"Build image from source\"\n\n        docker-compose build\n\n\n        log \"Remove old and unused docker images\"\n\n        docker images |grep '<none>' |awk '{print $3}' |xargs docker rmi\n    fi\n\n    log \"Start containers\"\n\n    docker-compose up #-d\nelse\n    log \"Install dependencies\"\n\n    npm install\n\n\n    log \"Start the server\"\n\n    npm start\nfi"
        },
        {
          "name": "kubernetes",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 2.353515625,
          "content": "{\n    \"name\": \"mirotalk\",\n    \"version\": \"1.4.42\",\n    \"description\": \"A free WebRTC browser-based video call\",\n    \"main\": \"server.js\",\n    \"scripts\": {\n        \"start\": \"node app/src/server.js\",\n        \"start-dev\": \"nodemon app/src/server.js\",\n        \"test\": \"echo \\\"Error: no test specified\\\" && exit 1\",\n        \"lint\": \"npx prettier --write .\",\n        \"docker-build\": \"docker build --tag mirotalk/p2p:latest .\",\n        \"docker-rmi\": \"docker images |grep '<none>' |awk '{print $3}' |xargs docker rmi\",\n        \"docker-push\": \"docker push mirotalk/p2p:latest\",\n        \"docker-pull\": \"docker pull mirotalk/p2p:latest\",\n        \"docker-rmc\": \"docker container rm mirotalk --force\",\n        \"docker-run\": \"docker run -d -p 3000:3000 --name mirotalk mirotalk/p2p:latest\",\n        \"docker-rune\": \"docker run -d -p 3000:3000 -v .env:/src/.env:ro --name mirotalk mirotalk/p2p:latest\",\n        \"docker-run-vm\": \"docker run -d -p 3000:3000 -v .env:/src/.env:ro -v ./app/:/src/app/:ro -v ./public/:/src/public/:ro --name mirotalk mirotalk/p2p:latest\",\n        \"docker-start\": \"docker start mirotalk\",\n        \"docker-stop\": \"docker stop mirotalk\"\n    },\n    \"repository\": {\n        \"type\": \"git\",\n        \"url\": \"git+https://github.com/miroslavpejic85/mirotalk\"\n    },\n    \"keywords\": [\n        \"webrtc\",\n        \"socket.io\",\n        \"p2p\",\n        \"nodejs\",\n        \"video\",\n        \"audio\",\n        \"openai\",\n        \"oidc\",\n        \"chatgpt\",\n        \"client\",\n        \"server\",\n        \"streaming\"\n    ],\n    \"author\": \"Miroslav Pejic\",\n    \"license\": \"AGPL-3.0\",\n    \"homepage\": \"https://github.com/miroslavpejic85/mirotalk\",\n    \"dependencies\": {\n        \"@mattermost/client\": \"10.2.0\",\n        \"@sentry/node\": \"^8.48.0\",\n        \"axios\": \"^1.7.9\",\n        \"colors\": \"^1.4.0\",\n        \"compression\": \"^1.7.5\",\n        \"cors\": \"^2.8.5\",\n        \"crypto-js\": \"^4.2.0\",\n        \"dotenv\": \"^16.4.7\",\n        \"express\": \"^4.21.2\",\n        \"express-openid-connect\": \"^2.17.1\",\n        \"jsonwebtoken\": \"^9.0.2\",\n        \"js-yaml\": \"^4.1.0\",\n        \"ngrok\": \"^5.0.0-beta.2\",\n        \"nodemailer\": \"^6.9.16\",\n        \"openai\": \"^4.78.0\",\n        \"qs\": \"^6.13.1\",\n        \"socket.io\": \"^4.8.1\",\n        \"swagger-ui-express\": \"^5.0.1\",\n        \"uuid\": \"11.0.5\",\n        \"xss\": \"^1.0.15\"\n    },\n    \"devDependencies\": {\n        \"node-fetch\": \"^3.3.2\",\n        \"nodemon\": \"^3.1.9\",\n        \"prettier\": \"3.4.2\"\n    }\n}\n"
        },
        {
          "name": "public",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}