{
  "metadata": {
    "timestamp": 1736568919469,
    "page": 1,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "StreisandEffect/streisand",
      "stars": 23225,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.390625,
          "content": "generated-docs\n*.retry\n*.pyc\n*~\n*.swp\n*.tmp\n*.temp\n.DS_Store\n.vagrant/\nubuntu-xenial-16.04-cloudimg-console.log\n\n# Ignore changes to the existing server inventory to allow users to modify it\ninventories/inventory-existing\n\n# Ignore the Streisand diagnostics file we generate each run\nstreisand-diagnostics.md\n\n# We recommend people use a Python virtualenv, and document this as\n# the location.\nvenv/\n"
        },
        {
          "name": "Advanced installation.md",
          "type": "blob",
          "size": 2.873046875,
          "content": "# Advanced installation\n\n### Running Streisand to Provision Localhost ###\n\nIf you can't run Streisand in the normal manner (running from your client home machine/laptop to configure a remote server) Streisand supports a local provisioning mode for **machines running Ubuntu 16.04**. After following the basic instructions, choose \"Localhost (Advanced)\" from the menu after running `./streisand`.\n\n**Note:** Running Streisand against localhost can be a destructive action! You will be potentially overwriting configuration files and must be certain that you are affecting the correct machine.\n\n**Note:** The machine must be running Ubuntu 16.04.\n\n**Note:** If you have an external firewall available, see the `generated-docs` directory for a `-firewall-information.html` document with information on which ports need to be opened.\n\n### Running Streisand on Other Providers ###\n\nYou can also run Streisand on a new Ubuntu 16.04 server. Dedicated hardware? Great! Esoteric cloud provider? Awesome! To do so, simply choose \"Existing Server (Advanced)\" from the menu after running `./streisand` and provide the IP address of the existing server when prompted.\n\nThe server must be accessible using the `$HOME/.ssh/id_rsa` SSH Key, and **root** is used as the connecting user by default. If your provider requires you to SSH with a different user than root (e.g. `ubuntu`) specify the `ANSIBLE_SSH_USER` environmental variable (e.g. `ANSIBLE_SSH_USER=ubuntu`) when you run `./streisand`.\n\n**Note:** Running Streisand against an existing server can be a destructive action! You will be potentially overwriting configuration files and must be certain that you are affecting the correct machine.\n\n**Note:** The machine must be running Ubuntu 16.04.\n\n**Note:** If you have an external firewall available, see the `generated-docs` directory for a `-firewall-information.html` document with information on which ports need to be opened.\n\n### Noninteractive Deployment ###\n\nAlternative scripts and configuration file examples are provided for\nnoninteractive deployment, in which all of the required information is passed\non the command line or in a configuration file.\n\nExample configuration files are found under `global_vars/noninteractive`. Copy\nand edit the desired parameters, such as providing API tokens and other choices,\nand then run the appropriate script.\n\nTo deploy a new Streisand server:\n\n      deploy/streisand-new-cloud-server.sh \\\n        --provider digitalocean \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\nTo run the Streisand provisioning on the local machine:\n\n      deploy/streisand-local.sh \\\n        --site-config global_vars/noninteractive/local-site.yml\n\nTo run the Streisand provisioning against an existing server:\n\n      deploy/streisand-existing-cloud-server.sh \\\n        --ip-address 10.10.10.10 \\\n        --ssh-user root \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 6.5419921875,
          "content": "## Contributing Issues and Bug Reports\r\n\r\nThanks for your interest in helping improve Streisand! This documentation page\r\nhas some helpful tips and things to keep in mind to make your\r\ncontributions to Streisand as great as they can be.\r\n\r\n### Keep it Positive/Empathetic\r\n\r\nEncountering bugs is a frustrating experience! Missing features speak to\r\nunaddressed needs. We understand that and want to help.\r\n\r\nPlease also remember that Streisand is 100% a volunteer effort. Nobody is paid\r\nto work on Streisand, and nobody does it as their full time job.\r\n\r\nWhere possible try to keep discussion tone positive and remember that the folks\r\nworking on Streisand fit it into their spare time between other real life\r\ncommitments (family, vacation, jobs, hobbies, relaxation!).\r\n\r\n### Which Repository?\r\n\r\nIf your issue is a question or you need help with setting up / configuring Streisand, then please ask on the [streisand-discussions](https://github.com/StreisandEffect/streisand-discussions/) Github repository. \r\n\r\nSimilarly, if you are requesting a new feature we prefer it be done on the [streisand-discussions](https://github.com/StreisandEffect/streisand-discussions) Github repository.\r\n\r\n### Before Submitting an Issue\r\n\r\nBefore submitting new issues please do a search in [open issues](https://github.com/StreisandEffect/streisand/issues) to see if the issue or refinement you have in mind has already been suggested. For features/questions search [the streisand-discussions open issues](https://github.com/StreisandEffect/streisand-discussions/issues).\r\n\r\nIf you find your issue already exists, feel free to add constructive comments such as new information, additional insights on how to reproduce, etc. If you're only interested in sharing that the feature is important to you, or that the bug affects you then add a [reaction](https://github.com/blog/2119-add-reactions-to-pull-requests-issues-and-comments). Using reactions in place of a \"+1\" or \"me too!\" comments helps keeps the conversation clear and concise.\r\n\r\n👍 - upvote\r\n\r\n👎 - downvote\r\n\r\nIf you cannot find an existing issue that describes your bug or feature, submit a new issue using the guidelines below.\r\n\r\n## Writing Good Bug Reports and Feature Requests\r\n\r\nDescribe a single problem or feature request per issue. Do not include multiple bugs or feature requests in the same issue.\r\nThe more information you can provide, the more likely someone will be successful reproducing the issue and finding a fix. \r\n#Take advantage of Github Markdown styling to make your issue easier to read. For example, Wrap single line code statements or logs in single backticks: \\` code here \\`. Wrap multi-line in triple backticks: \\``` multi-line code here \\```. \r\n\r\n#### Streisand Diagnostics File\r\n\r\nStreisand automatically creates a markdown file in the project directory called\r\n`streisand-diagnostics.md`. Every time you run Streisand this file is populated\r\nwith some basic diagnostic information about your system & Streisand options\r\nthat are enabled.\r\n\r\nSharing the contents of this file in new issues is a great way to answer a lot\r\nof required questions without having to do any work besides copy & pasting!\r\n\r\n#### What Other Information to Include in Your Issue\r\n\r\nPlease try your best to answer all of the questions in [the Streisand Issue template](https://github.com/StreisandEffect/streisand/blob/master/.github/ISSUE_TEMPLATE.md). Answering these questions help us skip a lot of \"Github telephone tag\" that takes up time that could be used fixing the bug.\r\n\r\nWhen describing your issue focus on:\r\n\r\n* Reproducible steps (1... 2... 3...) and what you expected versus what you actually saw.\r\n* Log output from Ansible or other relevant services, ideally linking to a Gist for longer log output.\r\n* Information about your system (OS, version, etc)\r\n* Information about the target Streisand server (cloud provider, etc)\r\n\r\nDon't feel bad if we can't reproduce the issue and ask for more information.\r\nIt's impossible to know what questions will be most relevant for every potential\r\nbug!\r\n\r\n#### Why Was My Issue Closed???\r\n\r\nIssues are generally closed for one of three reasons:\r\n\r\n1. There wasn't enough information or nobody has been replying to questions\r\n   asked.\r\n2. The issue was created on the wrong repository and should have been created as\r\n   a [streisand-discussions](https://github.com/StreisandEffect/streisand-discussions)\r\n   issue or vice-versa.\r\n3. After discussion and evaluation it was determined the problem was fixed or\r\n   wasn't appropriate for Streisand\r\n\r\nWe try very hard to keep the issue list clean. Don't feel bad if your issue\r\nwas closed, it can always be reopened if there are disagreements to discuss\r\nor the situation has changed.\r\n\r\n## Contributing Fixes\r\n\r\nIf you are interested in fixing issues and contributing directly to the code\r\nbase please feel free to submit a PR. We're excited to help! If there is an\r\nexisting issue for the problem you are interested in fixing please leave a quick\r\ncomment indicating that you'd like to start working on a solution. That way we\r\ncan avoid duplicating work. Similarly, talking about how you plan to implement\r\na fix or a new feature ahead of starting gives folks a chance to give early\r\ndesign input which will save time later during code review!\r\n\r\n#### CI Testing\r\n\r\nStreisand uses [Travis CI](https://travis-ci.org/jlund/streisand) for continuous\r\nintegration testing. Make sure to read\r\n[testing.md](https://github.com/StreisandEffect/streisand/blob/master/documentation/testing.md)\r\nwhere we describe the tests that are run, how to work around breakages for\r\nfeatures unsupported by LXC, and tips for developing on localhost with Vagrant.\r\nAll PRs will have to pass CI to be merged. Feel free to submit a PR with broken\r\nCI if you need help getting the tests to pass.\r\n\r\n#### Code Reviews\r\n\r\nAll PRs need at least one approved code review from a maintainer in order to be\r\nmerged. Maintainers may not review their own pull requests.\r\n\r\nStreisand is a volunteer effort. Please allow at least 7 days to pass before\r\nfollowing up on missing reviews. If more than 7 days have elapsed and you are\r\nstill waiting on a review or a reply from a maintainer please leave a friendly\r\n\"bump\" message and \"@ mention\" their username.\r\n\r\n#### Modularity\r\n\r\nWe've recently begun working on modularizing Streisand so that installations can\r\nbe customized to include/not include certain VPN services. Additions to\r\nStreisand should endeavour to fit into this model. We describe the philosophy\r\nand design patterns used in this approach in\r\n[modular_roles.md](https://github.com/StreisandEffect/streisand/blob/master/documentation/modular_roles.md)\r\n\r\n"
        },
        {
          "name": "Features.md",
          "type": "blob",
          "size": 3.8974609375,
          "content": "# Features\n\n* A single command sets up a brand new Ubuntu 16.04 server running a [wide variety of anti-censorship software](#services-provided) that can completely mask and encrypt all of your Internet traffic.\n* Streisand natively supports the creation of new servers at [Amazon EC2](https://aws.amazon.com/ec2/), [Azure](https://azure.microsoft.com), [DigitalOcean](https://www.digitalocean.com/), [Google Compute Engine](https://cloud.google.com/compute/), [Linode](https://www.linode.com/), and [Rackspace](https://www.rackspace.com/)&mdash;with more providers coming soon! It also runs on any Ubuntu 16.04 server regardless of provider, and **hundreds** of instances can be configured simultaneously using this method.\n* The process is completely automated and only takes about ten minutes, which is pretty awesome when you consider that it would require the average system administrator several days of frustration to set up even a small subset of what Streisand offers in its out-of-the-box configuration.\n* Once your Streisand server is running, you can give the custom connection instructions to friends, family members, and fellow activists. The connection instructions contain an embedded copy of the server's unique SSL certificate, so you only have to send them a single file.\n* Each server is entirely self-contained and comes with absolutely everything that users need to get started, including cryptographically verified mirrors of all common clients. This renders any attempted censorship of default download locations completely ineffective.\n* But wait, there's more...\n\nMore Features\n-------------\n* Nginx powers a password-protected and encrypted Gateway that serves as the starting point for new users. The Gateway is accessible over SSL, or as a Tor [hidden service](https://www.torproject.org/docs/hidden-services.html.en).\n  * Beautiful, custom, step-by-step client configuration instructions are generated for each new server that Streisand creates. Users can quickly access these instructions through any web browser. The instructions are responsive and look fantastic on mobile phones.\n  * The integrity of mirrored software is ensured using SHA-256 checksums, or by verifying GPG signatures if the project provides them. This protects users from downloading corrupted files.\n  * All ancillary files, such as OpenVPN configuration profiles, are also available via the Gateway.\n  * Current Tor users can take advantage of the additional services Streisand sets up in order to transfer large files or to handle other traffic (e.g. BitTorrent) that isn't appropriate for the Tor network.\n  * A unique password, SSL certificate, and SSL private key are generated for each Streisand Gateway. The Gateway instructions and certificate are transferred via SSH at the conclusion of Streisand's execution.\n* Distinct services and multiple daemons provide an enormous amount of flexibility. If one connection method gets blocked there are numerous options available, most of which are resistant to Deep Packet Inspection.\n  * All of the connection methods (including direct OpenVPN connections) are effective against the type of blocking Turkey has been experimenting with.\n  * OpenConnect/AnyConnect, OpenSSH, OpenVPN (wrapped in stunnel), Shadowsocks, Tor (with obfsproxy and the obfs4 pluggable transport), and WireGuard are all currently effective against China's Great Firewall.\n* Every task has been thoroughly documented and given a detailed description. Streisand is simultaneously the most complete HOWTO in existence for the setup of all of the software it installs, and also the antidote for ever having to do any of this by hand again.\n* All software runs on ports that have been deliberately chosen to make simplistic port blocking unrealistic without causing massive collateral damage. OpenVPN, for example, does not run on its default port of 1194, but instead uses port 636, the standard port for LDAP/SSL connections that are beloved by companies worldwide.\n"
        },
        {
          "name": "Installation.md",
          "type": "blob",
          "size": 5.2685546875,
          "content": "# Installation\n\nPlease read all installation instructions **carefully** before proceeding.\n\nIf you're an expert, and installing on a cloud provider Streisand doesn't support, make sure to read [the advanced installation instructions](Advanced%20installation.md).\n\n## Important: definitions ##\nStreisand is based on [Ansible](https://www.ansible.com/), an automation tool that is typically used to provision and configure files and packages on remote servers. Streisand automatically sets up **another server** with the VPN packages and configuration. We call the machine that sets up the Streisand server the *builder*. Think of the builder as \"a place to stand.\"\n\n* If you don't have a suitable builder machine, you could set up another cloud server to use as your builder. That means you'd have two cloud servers at the end — the builder, and your fresh new Streisand *server*.  When you're done with the builder, make sure you download the *builder's* `streisand` directory — very important to keep the contents of that directory! — you could delete the *builder* cloud server.)\n\n* Although it's not recommended, sometimes you can use a fresh server as both the builder and the server. See the [the advanced installation instructions](Advanced%20installation.md).\n\n## Prerequisites ##\n\nThe Streisand builder requires a Linux, macOS, or BSD system.\n\n* Using native Windows as a builder is not supported, but Ubuntu on the [Windows Subsystem For Linux (WSL)](https://docs.microsoft.com/en-us/windows/wsl/faq) should work. ([Ubuntu install link on Microsoft Store](https://www.microsoft.com/en-us/p/ubuntu-1804-lts/9n9tngvndl3q))\n\nComplete all of these tasks on your local machine. All of the commands should be run inside a command-line session.\n\n### SSH key\n\nMake sure an SSH public key is present in `~/.ssh/id_rsa.pub`.\n\n  * SSH keys are a more secure alternative to passwords that allow you to prove your identity to a server or service built on public key cryptography. The public key is something that you can give to others, whereas the private key should be kept secret (like a password).\n\nTo check if you already have an SSH public key, enter the following command at a command prompt:\n\n```\nls ~/.ssh\n```\n\nIf you see an `id_rsa.pub` file, then you have an SSH public key. If you do not have an SSH key pair, you can generate one by using this command and following the defaults:\n\n```\nssh-keygen\n```\n\nIf you'd like to use an SSH key with a different name or from a non-standard location, please enter *yes* when asked if you'd like to customize your instance during installation.\n\n  * **Please note**: You will need these keys to access your Streisand instance over SSH. Please keep `~/.ssh/id_rsa` and `~/.ssh/id_rsa.pub` for the lifetime of the Streisand server.\n\n\n## Bootstrap ##\n\nInstall the bootstrap packages: Git, and Python 3.5 or later. Some environments need additional packages.\n\nHere's how to set up these packages:\n\n* On Debian and Ubuntu:\n\n```\nsudo apt-get install git python3 python3-venv\n```\n\n* On Fedora 30, some additional packages are needed later:\n\n```\ndnf install git python3 gcc python3-devel python3-crypto \\\n     python3-pycurl libcurl-devel\n\n```\n\n* On CentOS 7, `python36` is available from the EPEL repository; some additional packages are needed later:\n\n```\nsudo yum -y update && sudo yum install -y epel-release\nsudo yum -y update && sudo yum install -y \\\n    git gcc python36-devel python36-crypto python36-pycurl \\\n    libcurl-devel\n```\n\n* On macOS, `git` is part of the Developer Tools, and it will be installed the first time you run it. Python 3.5 or later is required. Either use [Homebrew](https://brew.sh/) and run `brew install python3`, or see [the Python.org Mac download site](https://www.python.org/downloads/mac-osx/); the package you want to download is the \"macOS 64-bit installer\".\n\n## Execution ##\n\n1. Clone the Streisand repository and enter the directory.\n\n        git clone https://github.com/StreisandEffect/streisand.git && cd streisand\n\n1. Run the installer for Ansible and its dependencies. The installer will detect missing packages, and print the commands needed to install them. (Ignore the Python 2.7 `DEPRECATION` warning; ignore the warning from python-novaclient that pbr 5.1.3 is incompatible.)\n\n       ./util/venv-dependencies.sh ./venv\n\n1. Activate the Ansible packages that were installed.\n\n        source ./venv/bin/activate\n\n1. Execute the Streisand script.\n\n        ./streisand\n\n1. Follow the prompts to choose your provider, the physical region for the server, and its name. You will also be asked to enter API information.\n1. Once login information and API keys are entered, Streisand will begin spinning up a new remote server.\n1. Wait for the setup to complete (this usually takes around ten minutes) and look for the corresponding files in the `generated-docs` folder in the Streisand repository directory. The HTML file will explain how to connect to the Gateway over SSL, or via the Tor hidden service. All instructions, files, mirrored clients, and keys for the new server can then be found on the Gateway. You are all done!\n\n## Keep the results!\n\nYou should keep a copy of the `generated-docs` directory for the life of the server.\n\nRemember to save your `~/.ssh/id_rsa` and `~/.ssh/id_rsa.pub` SSH keys too. You'll need them in case you want to troubleshoot or perform maintenance on your server later.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 35.509765625,
          "content": "Copyright 2014-2017 Joshua Lund\n\nOpenVPN role courtesy of Sovereign (https://github.com/al3x/sovereign)\nCopyright 2013-2014 Luke Cyca, Ben Ford, Greg Karékinian, Joshua Lund,\nand Alex Payne.\n\nL2TP/IPsec configuration files courtesy of Lin Song\n(https://github.com/hwdsl2/setup-ipsec-vpn).\nCopyright 2014-2017 Lin Song, and based on the work of\nThomas Sarlandie (Copyright 2012).\nModifications to the L2TP/IPsec configuration files are licensed\nunder CC Attribution-ShareAlike 3.0 Unported\n(http://creativecommons.org/licenses/by-sa/3.0/).\n\nCloudflared DNS-over-HTTPS role courtesy of Steven Foerster\n(https://github.com/sfoerster/ansible-cloudflared).\nCopyright 2019 Steven Foerster, and based on the work of\nBen Dews (Copyright 2018).\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\n\n                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "README-chs.md",
          "type": "blob",
          "size": 17.435546875,
          "content": "<p align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/jlund/streisand/master/logo.jpg\" alt=\"Automate the effect\"/>\n</p>\n\n- - -\n[English](README.md), [Français](README-fr.md), [简体中文](README-chs.md), [Русский](README-ru.md) | [Mirror](https://gitlab.com/alimakki/streisand)\n- - -\n\n[![Build Status](https://github.com/StreisandEffect/streisand/workflows/Streisand/badge.svg)](https://github.com/StreisandEffect/streisand/actions)\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/espadrine.svg?style=social&label=Follow%20%40StreisandVPN)](https://twitter.com/StreisandVPN)\n\nStreisand\n=========\n\n**欲盖弥彰的[Streisand效应](https://zh.wikipedia.org/wiki/%E5%8F%B2%E7%BF%A0%E7%8F%8A%E6%95%88%E5%BA%94).**\n\n互联网对我们并不公平。ISP、通信、政治家，他们串通一气封锁那些我们感兴趣和关注的网站和信息。或许是时候*打破枷锁*，来场正面较量了。\n\nStreisand介绍\n---------------------\n* 只需要一个简单的脚本，就能在全新的 Ubuntu 16.04 服务器上运行[多个不同的科学上网工具](#提供的服务)，它们能够让你匿名并且加密所有的网络流量。\n* Streisand 原生支持多个 VPS 供应商，其中包括[亚马逊EC2](https://aws.amazon.com/ec2/)，[微软云服务](https://azure.microsoft.com)，[DigitalOcean](https://www.digitalocean.com/)，[Google云计算](https://cloud.google.com/compute/)，[Linode](https://www.linode.com/)和[Rackspace](https://www.rackspace.com/)；随着软件的开发还将支持更多云和VPS——只要运行的是 Ubuntu 16.04 ，不论提供商是谁还是有**成百个**实例都能用这个方法部署。\n* 整个部署过程顺利的话大概在10分钟左右搞定。试想一个没有系统管理能力的人可能要花数天来完成其中一项工作，而我们用 Streisand 让你获得获得开箱既得的畅快体验。\n* 一旦部署完成，你可以将使用指南发送给你的朋友，家人和你觉得对你重要的人**（译者注：原文是社会活动家）**。在这个指南中包含唯一的一个 SSL 证书，这也意味着你发送给他们的只是一个简单的文件而已。\n* 部署好网关中包含了用户需要的一切内容，例如设置向导，所支持操作系统需要的客户端。即使无法下载到官方客户端的朋友都可以在网关中的镜像里下载到需要的最新版本客户端。\n* 这才是开始，来来来，看看后面更精彩...\n\n更多特性\n-------------\n* 新用户登录时，使用 Nginx 提供密码保护和网关加密。加密网关通过 SSL 证书，或者通过 [Tor](https://www.torproject.org/docs/hidden-services.html.en)隐藏服务进行加密。\n  * 网关将自动生成客户端配置说明，架设在轻量级的 http 服务器 Nginx 上。而您可以用电脑或是手机的浏览器轻松阅读，只需按部就班就能轻松配置客户端了。\n  * 所有科学上网需要的客户端软件都进行了 SHA-256 检查，并且通过 GPG 进行了签名认证。确保那些无法通过官方渠道下载客户端的用户同样能够从镜像放心下载。\n  * 所有客户端需要的额外文件，比如：OpenVPN 的配置文件，都可以通过网关下载到。\n  * 目前 Tor 用户可以借助 Streisand 所提供的优秀特性传输大文件或者控制 Tor 服务其他流量（比如BT，传统的 Tor 并不适合进行BT这样的数据传输）。\n  * 网关会自动生成一个唯一的密码、一个 SSL 证书和一个 SSL 私钥。在Streisand部署后，网关说明和证书都通过 SSH 进行传输。\n  * 不同的服务和多个守护进程带来了巨大的灵活性。如果其中一个连接方式遭到封锁，还有其他方式可以尝试使用。它们大多数都能够避免深度包检测。\n  * OpenConnect/AnyConnect, OpenSSH（没有测试）, OpenVPN (stunnel加持的), Shadowsocks, and Tor (obfs4进行混淆传输)都可以在中国使用\n* 每一个科学上网工具都提供了文档和详细的描述。 Streisand 或许是迄今为止最为全面的指南，帮助你安装和配置客户端。在必要的时候也能够再次通过手动完成任何相关操作。\n* 为了避免科学上网工具被大面积破坏，端口在设计上也是有讲究的。比方说 OpenVPN ，并没有运行在默认的1194端口，而是636端口，这个是很多跨国公司使用的标准 LDAP/SSL 连接端口。\n\n<a name=\"提供的服务\"></a>\n提供的服务\n-----------------\n\n* [OpenSSH](https://www.openssh.com/)\n  * 支持 Windows 和 Android 的 SSH 隧道， 并且需要使用 PuTTY 将默认的密钥对导出成 .ppk 的格式；\n  * [Tinyproxy](https://banu.com/tinyproxy/) 默认安装并绑定到主机，它作为一个 http(s) 代理提供给那些原生不支持 SOCKS 代理的软件通过 SSH 隧道访问网络，比如说 Android 上的鸟嘀咕。\n  * 针对 [sshuttle](https://github.com/sshuttle/sshuttle) 的一个无特权转发用户和产生的 SSH 密钥对，同样也兼容 SOCKS；\n* [OpenConnect](https://ocserv.gitlab.io/www/index.html) / [Cisco AnyConnect](https://www.cisco.com/c/en/us/products/security/anyconnect-secure-mobility-client/index.html)\n  * oepnConnect (ocserv) 是一个非常强劲、轻巧的 VPN 服务器，并且完全兼容思科的 AnyConnect 客户端；\n  * 其中包涵了很多顶级的标准[协议](https://ocserv.gitlab.io/www/technical.html)，比如：HTTP, TLS 和 DTLS， 当然还有很多被跨国公司广泛使用的且流行的技术；\n   * 这就意味着 OpenConnect 非常易用且高速，而且经得住审查的考验，几乎从未被封锁。\n* [OpenVPN](https://openvpn.net/index.php/open-source.html)\n  * 从自带的 .ovpn 配置文件生成一个简单的客户端配置文件；\n  * 同时支持 TCP 和 UDP 连接；\n  * 客户端的 DNS 解析由 [Dnsmasq](http://www.thekelleys.org.uk/dnsmasq/doc.html) 负责，避免 DNS 泄露；\n  * 启用 TLS 认证，有助于防止主动探测攻击。错误的 HMAC 流量并不会被轻易丢弃。\n* [Shadowsocks](https://shadowsocks.org/en/index.html)\n  * 安装的是高性能的 libev 版本，这个版本能够处理数以千计的并发连接；\n  * Android 和 iOS 只需要扫描一个二维码就能完成自动配置。DNS 可以设置为 8.8.8.8，或者将配置一一复制粘贴到客户端上；\n  * 采用 ChaCha20 和 Poly1305 对 [AEAD](https://shadowsocks.org/en/spec/AEAD-Ciphers.html) 进行加密，增强了安全性并提升了穿透性；\n  * 使用 [simple-obfs](https://github.com/shadowsocks/simple-obfs) 插件提供流量混淆以便于从审查的网络中脱逃（尤其是QOS节流中）。\n* [sslh](https://www.rutschle.net/tech/sslh/README.html)\n  * sslh 是一个协议解复用器（这个我不了解，如果有更好的翻译请request），在一个高度限制的网络环境下（只能访问 http 端口的网络为例），它作为一种备选方案，仍然可以通过 OpenSSH 和 OpenVPN 进行连接，因为通过 sslh 让二者共享了 443 端口。\n* [Stunnel](https://www.stunnel.org/index.html)\n  * 监听并且将 OpenVPN 的流量进行封装，让 OpenVPN 的流量伪装成标注的 SSL 流量，从而可以让 OpenVPN 客户端成功通过隧道进行连接，躲避深度包检测。\n  * 通过隧道连接的 OpenVPN 的配置文件和直接连接 OpenVPN 的配置文件是一起生成的，详细的说明也一同生成。\n  * stunnel 证书和密钥是 PKCS #12 格式，SSL 隧道程序能够很好的兼容，尤其 [OpenVPN Android](https://play.google.com/store/apps/details?id=de.blinkt.openvpn) 版本也能够通过 [SSLDroid](https://play.google.com/store/apps/details?id=hu.blint.ssldroid) 传输。在中国的移动设备上使用 OpenVPN 成为可能*（据译者所知，大陆 OpenVPN 以前完全阵亡）*。\n* [Tor](https://www.torproject.org/)\n  * 桥接的名字是随即生成的；\n  * [Obfsproxy](https://www.torproject.org/projects/obfsproxy.html.en) 默认安装并且配置支持 obfs4 传输；\n  * Android 手机使用 [Orbot](https://play.google.com/store/apps/details?id=org.torproject.android) 扫描二维码即可获取桥接信息并完成自动配置。\n* [UFW](https://wiki.ubuntu.com/UncomplicatedFirewall)\n  * 防火墙根据不同的服务完全配置好，任何未经授权的流量都将被阻止。\n* [系统无人值守安全更新](https://help.ubuntu.com/community/AutomaticSecurityUpdates)\n  * Streisand 所在的服务器自动配置成无人值守更新，自动更新级别为*安全更新*。\n* [WireGuard](https://www.wireguard.com/)\n  * Linux 用户可以使用下一代更加简化，基于内核的黑科技 VPN ，速度快，而且使用了很多之前 VPN 所没有加密类型。\n\n安装\n------------\n在你搞事情之前，认真阅读\n\n### 重要说明 ###\nStreisand 基于 [Ansible](https://www.ansible.com/) ，它可以在远程服务器完成自动配置、打包等工作，Streisand 是将远程服务器自动配置成为多个 VPN 服务及科学上网的工具。\n\nStreisand 运行在**你自己的计算机上时（或者你电脑的虚拟机上时）**，它将把网关部署到你 VPS 提供商的**另一个服务器**上（通过你自己的API自动生成）。另外，如果 Streisand 运行在 VPS 上，它将会把网关部署到**另一个 VPS 上**，所以说原先你运行 Streisand 的那个 VPS 就多余了，记得部署完成并获得文档后把它删掉，而部署出来的那个 VPS 你是无法使用 SSH 连接进去的，除非你有公钥（当然这是不可能的，因为整个配置过程都没有提供公钥给你下载或者你想办法把它搞出来）。\n\n在某些情况下，你可能需要运行 Streisand/Ansible 在 VPS 上并将其自身配置为 Streisand 服务器，这种模式适合当你无法在你自己的计算机上运行和安装 Streisand/Ansible 时，或本地与 VPS 之间的 SSH 连接不稳定时。\n\n### 准备工作 ###\n在本地计算机完成以下所有步骤（也可以在 VPS 上运行）。\n\n* Streisand 运行在 BSD，Linux，或者 macOS 上，Windows 上是无法运行的。所有的指令都需要在终端下运行。\n* 需要 Python 2.7 ，一般在 macOS 、Linux 及 BSD 系统上都是标配，如果你使用的发行版标配是 Python 3，你需要安装 Python 2.7 来运行 Streisand。\n* 确定你的 SSH key 储存在 ~/.ssh/id\\_rsa.pub 。\n  * 如果不曾有过 SSH key，你需要用下面的命令生成一个：\n\n        ssh-keygen\n* 安装 Git 。\n  * 基于 Debian 和 Ubuntu 的 Linux 发行版\n\n        sudo apt install git\n  * 在 Fedora\n\n        sudo dnf install git\n  * 在 macOS 上 （需要通过 [Homebrew](https://brew.sh/) 进行安装）\n\n        brew install git\n* 利用 Python 安装 [pip](https://pip.pypa.io/en/latest/) 包管理\n  * 基于 Debian 和 Ubuntu 的 Linux 发行版\n\n        sudo apt install python-paramiko python-pip python-pycurl python-dev build-essential\n  * 在 Fedora\n\n        sudo dnf install python-pip\n  * 在 macOS 上\n\n        sudo easy_install pip\n        sudo pip install pycurl\n\n* 安装 [Ansible](https://www.ansible.com/) 。\n  * 在 macOS 上\n\n        brew install ansible\n  * 在 Linux 和 其他 BSD 上\n\n        sudo pip install ansible markupsafe\n* 以下使用 pip 安装的 Python 库根据你所使用的 VPS 供应商不同而不同。如果你准备将目前使用的 VPS 变成网关，可以跳过此步。\n  * 亚马逊 EC2\n\n        sudo pip install boto boto3\n  * 微软云服务\n\n        sudo pip install ansible[azure]\n  * Google\n\n        sudo pip install \"apache-libcloud>=1.17.0\"\n  * Linode\n\n        sudo pip install linode-api4\n  * Rackspace 云\n\n        sudo pip install pyrax\n  * **特别需要注意的是如果你使用 Python** 是通过 Homebrew 安装的，还需要运行以下命令来确定找到必要的库文件\n\n        mkdir -p ~/Library/Python/2.7/lib/python/site-packages\n        echo '/usr/local/lib/python2.7/site-packages' > ~/Library/Python/2.7/lib/python/site-packages/homebrew.pth\n\n### 执行 ###\n1. 从 Streisand 抓取源码\n\n        git clone https://github.com/StreisandEffect/streisand.git && cd streisand\n2. 执行 Streisand 脚本。\n\n        ./streisand\n3. 根据实际情况从弹出的问题中填写或选择选项，比如服务器的物理位置，它的名字。还有最重要的是 API 信息（可以从问题提示中找到如何提供 API 信息）。\n4. 一旦登录信息和 API key 正确无误完成，Streisand 就开始安装到另一个 VPS 上了（或者把你目前的 VPS 变成网关）。\n5. 整个配置完成大概需要10分钟左右的样子，完成后，在 Streisand 目录下会生成一个 'generated-docs' 文件夹，里面储存了4个 html 文件，其中包含了网关的 SSL 证书和如何连接的详细说明。当你使用这些方法连接上网关以后，网关里详细描述了设置客户端的方法、需要额外下载的文件，客户端镜像，密钥，只要耐心配置客户端就一切搞定了。\n\n**译者注：到这里官方英文配置就告一段落了。译者在自己配置的过程中还遇到一些小麻烦，需要各位朋友注意。**\n* 从本地用 Streisand 安装到网关的模式，如果能用这种模式最好，就不要选择其他的模式了，因为这样他生成的 generated-docs 就在本地，你用浏览器打开就能直接下载到证书文件，不折腾。\n* 在 VPS 上用 Streisand 安装到新的 VPS 模式还有后面介绍的将正在运行的 VPS 转变为网关这种模式，你会发现你很难在 VPS 上阅读 generated-docs 文件夹中的4个 html 文档，这个时候有几种方法可选：\n  * 使用 sftp 下载文件；\n  * 在目前的 VPS 上安装一个 apache2 ，然后 cp -r generated-doc /var/www/html/ ，然后从浏览器输入 VPS 的地址直接浏览并下载密钥（严格地说，这不安全，因为不是 https 连接，如果截获了数据便可以知道如何登录你科学上网的那个网关了。**如果是使用转化那个模式，就不要用这种方法了**）。\n  * 在 VPS 上使用 scp 将 generated-docs 目录全部推送到你本地暴露在公网下的 Linux, Unix 或者 macOS 里，或者另一个 VPS 里也可以。命令大概是 scp -r generated-docs user@×××.×××.×××.×××:/home/user/\n\n### 将正在使用中的 VPS 变成 Streisand 服务器 （高级使用） ###\n\n如果你本地使用的计算机无法运行 Streisand ，你可以将正在运行的 VPS 转变为网关。只需要在 VPS 上运行 ./streisand 并在菜单中选择 \"Localhost (Advanced)\" 就可以了。\n\n**但是需要注意的是**这个操作是无法挽回的，它将把你正在使用的 VPS 完全转变为网关后，之前如果你在上面搭建博客或者用于测试某些软件，那完成这个操作后，它们将不复存在。\n\n### 在其他的 VPS 供应商上运行 （高级使用）###\n\n你同样可以将 Streisand 运行在其他 VPS 供应商（提供更好的硬件也没问题，奇葩的 VPS 供应商也行）的 16.04 Ubuntu 上，只需要你在运行 ./streisand 的时候选择菜单中的 \"Existing Server (Advanced)\" 就可以。你需要提供这个 VPS 的 IP 地址。\n\n这个 VPS 必须使用 `$HOME/.ssh/id_rsa` 来储存 SSH key，并且可以使用 **root** 作为默认用户登录 VPS，如果提供商没有给你 root 用户作为默认用户登录，而是别的用户名，比如：`ubuntu` ，那么在运行 `./streisand` 之前需要额外配置 `ANSIBLE_SSH_USER` 环境变量，比如修改为：`ANSIBLE_SSH_USER=ubuntu` 。\n\n### 非交互式部署 （高级使用）###\n\n如果你想做非交互式部署, 你可以在 `global_vars/noninteractive`找到配置文件和脚本文件。你需要在配置文件或命令行录入必要信息。\n\n将 Streisand 在 VPS 供应商上运行:\n\n      deploy/streisand-new-cloud-server.sh \\\n        --provider digitalocean \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\n将 Streisand 在正在使用中的服务器上运行:\n\n      deploy/streisand-local.sh \\\n        --site-config global_vars/noninteractive/local-site.yml\n\n将 Streisand 在已现有的服务器上运行 :\n\n      deploy/streisand-existing-cloud-server.sh \\\n        --ip-address 10.10.10.10 \\\n        --ssh-user root \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\n未来特性\n-----------------\n* 更简便的设置\n\n如果你对 Streisand 有任何期待和想法，或者你找到 BUG ，请联系我们并且发 [Issue Tracker](https://github.com/StreisandEffect/streisand/issues) 。\n\n核心的贡献者们\n----------------\n* Jay Carlson (@nopdotcom)\n* Nick Clarke (@nickolasclarke)\n* Joshua Lund (@jlund)\n* Ali Makki (@alimakki)\n* Daniel McCarney (@cpu)\n* Corban Raun (@CorbanR)\n\n相关知识\n----------------\n[Jason A. Donenfeld](https://www.zx2c4.com/) 凭借他的智慧和果敢重新设计一个现代的 VPN，就像我们看到的 [WireGuard](https://www.wireguard.com/) 。他非常耐心和认真的给予帮助并提供了优质的反馈，在此，向他表示我由衷的感谢。\n\n对 [Trevor Smith](https://github.com/trevorsmith) 在项目上的付出，简直无法形容，非常感谢他，正是他提出了网关的提案，提供了数不胜数反馈，在公布前灵机一动，创建了 html 模板，让现在的**一切看上去那么屌**。\n\n非常感谢 [Paul Wouters](https://nohats.ca/) 的 [The Libreswan Project](https://libreswan.org/) ，正是他的耐心调试和设置，才让 L2TP/IPsec 工作的那么好。\n\n另外，[Joshua Lund](https://github.com/jlund)开始这个项目工作的时候，他差不多把 [Starcadian's](https://www.starcadian.com/) 的 'Sunset Blood' 听了300遍（译者：这张专辑节奏感不错）。\n"
        },
        {
          "name": "README-fr.md",
          "type": "blob",
          "size": 20.541015625,
          "content": "<p align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/jlund/streisand/master/logo.jpg\" alt=\"Automate the effect\"/> \n</p>\n\n- - -\n[English](README.md), [Français](README-fr.md), [简体中文](README-chs.md), [Русский](README-ru.md) | [Miroir](https://gitlab.com/alimakki/streisand)\n- - -\n\n[![Build Status](https://github.com/StreisandEffect/streisand/workflows/Streisand/badge.svg)](https://github.com/StreisandEffect/streisand/actions)\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/espadrine.svg?style=social&label=Follow%20%40StreisandVPN)](https://twitter.com/StreisandVPN)\n\nStreisand\n=========\n\n**Silence la censure. Automatiser [l'effet](https://fr.wikipedia.org/wiki/Effet_Streisand).**\n\nL'Internet peut être un peu injuste. Il est trop facile pour les fournisseurs de services Internet, les télécoms, les politiciens et les entreprises de bloquer l'accès aux sites et aux informations qui vous intéressent. Mais briser ces restrictions est *difficile*. Ou est-ce?\n\nPrésentation de Streisand\n-------------------------\n* Une seule commande configure un tout nouveau serveur Ubuntu 16.04 exécutant une [grande variété de logiciels anti-censure](#services-provided) qui peuvent masquer et chiffrer totalement votre trafic Internet.\n* Streisand supporte nativement la création de nouveaux serveurs chez [Amazon EC2](https://aws.amazon.com/ec2/), [Azure](https://azure.microsoft.com/fr-fr/), [DigitalOcean](https://www.digitalocean.com/), [Google Compute Engine](Https://cloud.google.com/compute/), [Linode](https://www.linode.com/) et [Rackspace](https://www.rackspace.com/)&mdash; et plus de fournisseurs à venir! Il fonctionne également sur n'importe quel serveur Ubuntu 16.04 quel que soit le fournisseur, et des **centaines** d'instances peuvent être configurés simultanément en utilisant cette méthode.\n* Le processus est entièrement automatisé et ne prend que quelques dizaines de minutes, ce qui est assez remarquable si vous considérez qu'il faudrait un administrateur système au moins plusieurs jours de contrainte pour mettre en place un petit sous-ensemble de ce que Streisand offre dans sa configuration.\n* Une fois que votre serveur Streisand est en cours d'exécution, vous pouvez donner les instructions de connexion personnalisée à vos amis, membres de la famille et activistes. Les instructions de connexion contiennent une copie intégrée du certificat SSL unique du serveur, il vous suffit de leur envoyer un seul fichier.\n* Chaque serveur est entièrement autonome et comprend tout ce dont les utilisateurs ont besoin pour démarrer, y compris les miroirs cryptographiquement vérifiés de tous les clients communs. Cela rend toute tentative de censure des emplacements de téléchargement par défaut complètement inefficace.\n* Mais attendez, il y a plus..\n\nPlus de fonctionnalités\n-----------------------\n* Nginx alimente la passerelle protégée par mot de passe et chiffrée qui sert de point de départ pour les nouveaux utilisateurs. La passerelle est accessible via SSL, ou comme [service caché](https://www.torproject.org/docs/hidden-services.html.en) Tor.\n  * Instructions belles, personnalisées, et étape par étape, les configurations du client sont générées pour chaque nouveau serveur que Streisand crée. Les utilisateurs peuvent accéder rapidement à ces instructions via n'importe quel navigateur Web. Les instructions sont réactives et fantastiques sur les téléphones mobiles.\n  * L'intégrité du logiciel mis en miroir est assurée en utilisant les sommes de contrôle SHA-256 ou en vérifiant les signatures GPG si le projet les fournit. Cela protège les utilisateurs contre le téléchargement de fichiers corrompus.\n  * Tous les fichiers auxiliaires, tels que les profils de configuration OpenVPN, sont également disponibles via la passerelle.\n  * Les utilisateurs actuels de Tor peuvent profiter des services supplémentaires que Streisand met en place pour transférer des fichiers volumineux ou pour traiter d'autres types de trafic (par exemple BitTorrent) qui ne sont pas appropriés pour le réseau Tor.\n  * Un mot de passe unique, un certificat SSL et une clé privée SSL sont générés pour chaque passerelle Streisand. Les instructions de la passerelle et le certificat sont transférés via SSH à la fin de l'exécution de Streisand.\n* Des services distincts et des daemons multiples offrent une énorme flexibilité. Si une méthode de connexion est bloquée, il existe de nombreuses options disponibles, dont la plupart sont résistantes à l'inspection des paquets en profondeur.\n  * Toutes les méthodes de connexion (y compris les connexions directes OpenVPN) sont efficaces contre le type de blocage avec lequel la Turquie a expérimenté.\n  * OpenConnect/AnyConnect, OpenSSH, OpenVPN (enveloppé dans stunnel), Shadowsocks, Tor (avec obfsproxy et obfs4 transports enfichables), et WireGuard sont tous actuellement efficace contre le grand pare-feu de la Chine.\n* Chaque tâche a été bien documentée et a donné une description détaillée. Streisand est simultanément le HOWTO le plus complet en existance pour l'installation de tous les logiciels qu'il installe, et aussi l'antidote pour avoir à faire jamais tout cela à la main de nouveau.\n* Tous les logiciels fonctionnent sur des ports qui ont été délibérément choisis pour rendre le blocage de ports simpliste irréaliste sans causer de dommages collatéraux massifs. OpenVPN, par exemple, ne fonctionne pas sur le port défaut de 1194, mais utilise le port standard 636 pour les connexions LDAP/SSL qui sont aimés par des entreprises du monde entier.\n\n<a name=\"services-provided\"></a>\nServices fournis\n----------------\n\n* [OpenSSH](https://www.openssh.com/)\n  * Les tunnels Windows et Android SSH sont également pris en charge et une copie des clés sont exportée dans le format .ppk que PuTTY requiert.\n  * [Tinyproxy](https://banu.com/tinyproxy/) est installé et lié à localhost. Il peut être accédé sur un tunnel SSH par des programmes qui ne prennent pas en charge nativement SOCKS et qui nécessitent un proxy HTTP, comme Twitter pour Android.\n  * Un utilisateur de transfert non privilégié et une paire paire de clés asymétriques SSH sont générés pour les fonctionnalités [sshuttle](https://github.com/sshuttle/sshuttle) et SOCKS.\n* [OpenConnect](https://ocserv.gitlab.io/www/index.html)/[Cisco AnyConnect](https://www.cisco.com/c/en/us/products/security/anyconnect-secure-mobility-client/index.html)\n  * OpenConnect (ocserv) est un serveur VPN extrêmement performant et léger qui offre également une compatibilité totale avec les clients officiels Cisco AnyConnect.\n  * Le [protocole](https://ocserv.gitlab.io/www/technical.html) est bâti sur des standards comme HTTP, TLS et DTLS, et c'est l'une des technologies VPN les plus populaires et largement utilisées parmi des grands entreprises multi-nationales.\n    * Cela signifie qu'en plus de sa facilité d'utilisation et de sa rapidité, OpenConnect est également très résistant à la censure et presque jamais bloqué.\n* [OpenVPN](https://openvpn.net/index.php/open-source.html)\n  * Des profils autonome \"unifiés\" .ovpn sont générés pour une configuration de client facile en utilisant un seul fichier.\n  * Les connexions TCP et UDP sont prises en charge.\n  * La résolution DNS du client est gérée via [Dnsmasq](http://www.thekelleys.org.uk/dnsmasq/doc.html) pour empêcher les fuites DNS.\n  * L'authentification TLS est activée, ce qui permet de vous protéger contre les attaques actives. Le trafic qui n'a pas de HMAC approprié est simplement abandonné.\n* [Shadowsocks](https://shadowsocks.org/en/index.html)\n  * La [variante libev](https://github.com/shadowsocks/shadowsocks-libev) haute performance est installée. Cette version est capable de gérer des milliers de connexions simultanées.\n  * Un code QR est généré qui peut être utilisé pour configurer automatiquement les clients Android et iOS en prenant simplement une photo. Vous pouvez étiqueter \"8.8.8.8\" sur ce mur de béton, ou vous pouvez coller les instructions de Shadowsocks et quelques codes QR à la place!\n  * [AEAD](https://shadowsocks.org/fr/spec/AEAD-Ciphers.html) est activé avec ChaCha20 et Poly1305 pour un contournement plus efficace du GFW.\n  * Le plugin [simple-obfs](https://github.com/shadowsocks/simple-obfs) est installé afin de fournir une techique d'évasion du votre trafic sur des réseaux hostiles (en particulier ceux qui appliquent la limitation de la qualité de service (QOS)).\n* [sslh](https://www.rutschle.net/tech/sslh/README.html)\n  * Sslh est un démultiplexeur de protocole qui permet à Nginx, OpenSSH et OpenVPN de partager le port 443. Cela fournit une autre option de connexion et signifie que vous pouvez toujours acheminer le trafic via OpenSSH et OpenVPN même si vous êtes sur un réseau restrictif qui bloque tout accès à des ports non HTTP.\n* [Stunnel](https://www.stunnel.org/index.html)\n  * Écoute et enveloppe les connexions OpenVPN. Cela les fait ressembler au trafic SSL standard et permet aux clients OpenVPN d'établir avec succès des tunnels même en présence d'une inspection approfondie des paquets.\n  * Des profils unifiés pour les connexions OpenVPN enveloppées de stunnel sont générés à côté des profils de connexion directe. Des instructions détaillées sont également générées.\n  * Le certificat stunnel et la clé sont exportés au format PKCS # 12 afin qu'ils soient compatibles avec d'autres applications de tunneling SSL. Notamment, cela permet à [OpenVPN pour Android](https://play.google.com/store/apps/details?id=de.blinkt.openvpn&hl=fr) de tunneliser son trafic via [SSLDroid](https://play.google .com / store / apps / details? Id = hu.blint.ssldroid). OpenVPN en Chine sur un appareil mobile? Oui!\n* [Tor](https://www.torproject.org/)\n  * Un [pont relais](https://www.torproject.org/docs/bridges) est mis en place avec un surnom aléatoire.\n  * [Obfsproxy](https://www.torproject.org/projects/obfsproxy.html.en) est installé et configuré avec le support pour le transport enfichable obfs4.\n  * Un code BridgeQR est généré et peut être utilisé pour configurer automatiquement [Orbot](https://play.google.com/store/apps/details?id=org.torproject.android&hl=fr) pour Android.\n* [UFW](https://wiki.ubuntu.com/UncomplicatedFirewall)\n  * Les règles de pare-feu sont configurées pour chaque service et tout trafic qui est envoyé vers un port non autorisé sera bloqué.\n* [unattended-upgrades](https://help.ubuntu.com/community/AutomaticSecurityUpdates)\n  * Votre serveur Streisand est configuré pour installer automatiquement de nouvelles mises à jour de sécurité.\n* [WireGuard](https://www.wireguard.com/)\n  * Les utilisateurs Linux peuvent profiter d'un VPN de nouvelle génération qui est simple mais à la même fois moderne, basé dans le noyau, et utilise des principes cryptographiques modernes que toutes les autres solutions VPN ne fournissent pas.\n\nInstallation\n------------\nVeuillez lire *attentivement* toutes les instructions d'installation avant de poursuivre.\n\n### Clarification importante ###\nStreisand est basé sur [Ansible](https://www.ansible.com/), un outil d'automatisation qui est généralement utilisé pour fournir et configurer des fichiers et des paquets sur des serveurs distants. Cela signifie que lorsque vous exécutez Streisand, il configure automatiquement **un autre serveur distant** avec les paquets VPN et ses configurations.\n\nStreisand va déployer **un autre serveur** sur votre fournisseur d'hébergement choisi lorsque vous exécutez **sur votre ordinateur local** (par exemple, votre ordinateur portable). Habituellement, vous **n'utilisez pas Streisand sur le serveur distant** car, par défaut, cela entraînerait le déploiement d'un autre serveur à partir de votre serveur et rendrait le premier serveur redondant (Ouf!).\n\nDans certains cas, les utilisateurs avancés peuvent opter pour le mode de provisionnement local pour que le système fonctionne avec Streisand/Ansible se configure comme un serveur Streisand. Il s'agit d'un mode de configuration mieux réservé quand ce n'est pas possible d'installer Ansible sur votre ordinateur local ou lorsque votre connexion à un fournisseur de cloud est peu fiable pour les connexions SSH requis par Ansible.\n\n### Prérequis ###\nEffectuez toutes ces tâches sur votre machine locale.\n\n* Streisand nécessite un système BSD, Linux ou macOS. À partir de maintenant, Windows n'est pas soutenu. Toutes les commandes suivantes doivent être exécutées à l'intérieur d'une session Terminal.\n* Python 2.7 est nécessaire. Cela est standard sur macOS, et est la valeur par défaut sur presque toutes les distributions Linux et BSD. Si votre distribution emploie Python 3 à la place, vous devrez installer la version 2.7 pour que Streisand fonctionne correctement.\n* Assurez-vous qu'une clé publique SSH est présente dans ~/.ssh/id\\_rsa.pub.\n  * Les clés SSH constituent une alternative plus sécurisé aux mots de passe qui vous permettent de prouver votre identité à un serveur ou à un service basé sur la cryptographie à clé publique. Fondamentalement, la clé publique est quelque chose que vous pouvez partager aux autres, alors que la clé privée doit être gardée secrète (comme un mot de passe).\n  * Pour vérifier si vous avez déjà une clé publique SSH, entrez la commande suivante à l'invite de commande.\n\n        ls ~/.ssh\n  * Si vous voyez un fichier id_rsa.pub, vous avez une clé publique SSH.\n  * Si vous n'avez pas de paire de clés SSH, vous pouvez en générer une en utilisant cette commande et en suivant les valeurs par défaut:\n\n        ssh-keygen\n  * Si vous souhaitez utiliser une clé SSH avec un nom différent ou dans un emplacement non standard, veuillez entrer 'oui' lorsqu'on vous demande si vous souhaitez personnaliser votre instance lors de l'installation.\n  * **Notez**: Vous aurez besoin de ces clés pour accéder à votre instance Streisand via SSH. Conservez-les pour la durée de vie de votre serveur Streisand.\n* Installez Git.\n  * Sur Debian et Ubuntu\n\n            sudo apt-get install git\n  * Sur Fedora 27, certains progiciels sont nécessaires plus tard\n\n          sudo dnf install git python2-pip gcc python2-devel python2-crypto python2-pycurl libcurl-devel\n  * Sur CentOS 7, `pip` est disponible dans le dépôt EPEL; certains progiciels supplémentaires sont nécessaires plus tard.\n\n          sudo yum -y update && sudo yum install -y epel-release\n          sudo yum -y update && sudo yum install -y git gcc python-devel python-crypto python-pycurl python-pip libcurl-devel\n  * Sur macOS, `git` fait partie des outils de développement et sera installé la première fois que vous l'exécuterez. S'il n'y a pas déjà une commande `pip` installée, installez-la avec:\n\n         sudo python2.7 -m ensurepip\n\n### Exécution ###\n1. Clonez le répertoire Streisand et entrez dans le répertoire.\n\n        git clone https://github.com/StreisandEffect/streisand.git && cd streisand\n\n2. Exécutez le programme d'installation pour Ansible et ses dépendances.\n\n        ./util/venv-dependencies.sh ./venv\n    * Le programme d'installation détectera les progiciels manquants et imprimera les commandes nécessaires pour les installer.\n\n3. Activez les progciels Ansible installés.\n\n        source ./venv/bin/activate\n      \n4. Exécutez le script Streisand.\n\n        ./streisand\n5. Suivez les instructions pour choisir votre fournisseur, la région physique du serveur, et son nom. Vous serez également invité à entrer les informations de l'API.\n6. Une fois les informations de connexion et les clés d'API saisies, Streisand commencera à faire tourner un nouveau serveur distant.\n5. Attendez que l'installation soit terminée (cela prend habituellement environ dix minutes) et recherchez les fichiers correspondants dans le dossier 'generated-docs' dans le répertoire du dépôt Streisand. Le fichier HTML expliquera comment se connecter à la passerelle via SSL ou via le service caché Tor. Toutes les instructions, les fichiers, les clients en miroir et les clés du nouveau serveur se trouvent alors sur la passerelle. Vous avez fini!\n\n### Installation de Streisand sur localhost (Avancé) ###\n\nSi vous ne pouvez pas exécuter Streisand de la manière normale (à partir de votre ordinateur client/ordinateur portable pour configurer un serveur distant), Streisand prend en charge un mode de provisionnement local. Choisissez simplement \"Localhost (Advanced)\" dans le menu après avoir exécuté `./streisand`.\n\n**Note:** L'installation de Streisand sur localhost peut être une action destructive! Vous pourriez potentiellement écraser des fichiers de configuration; vous devez être certain que vous affectez la machine correcte.\n\n### Exécution de Streisand sur d'autres fournisseurs (Avancé) ###\n\nVous pouvez également exécuter Streisand sur un nouveau serveur Ubuntu 16.04. Serveur dédié? Génial! Fournisseur de cloud ésotérique? Fantastique! Pour ce faire, choisissez simplement `Existing server (Advanced)` dans le menu après avoir exécuté `./streisand` et fournissez l'adresse IP du serveur existant lorsque vous y êtes invité.\n\nLe serveur doit être accessible en utilisant la clé SSH `$HOME/.ssh/id_rsa`, avec **root** comme utilisateur de connexion par défaut. Si votre fournisseur vous demande un utilisateur SSH au lieu de `root` (par exemple, `ubuntu`), spécifiez la variable environnementale `ANSIBLE_SSH_USER` (par exemple `ANSIBLE_SSH_USER=ubuntu`) lorsque vous exécutez `./streisand`.\n\n**Note:** L'installation de Streisand sur localhost peut être une action destructive! Vous pourriez potentiellement écraser des fichiers de configuration; vous devez être certain que vous affectez la machine correcte.\n\n### Déploiement non interactif (Avancé) ###\n\nDes scripts alternatifs et des exemples de fichiers de configuration sont fournis pour les déploiements non interactifs, dans lequel toutes les informations requises sont transmises sur la ligne de commande ou dans un fichier de configuration.\n\nDes exemples de fichiers de configuration se trouvent sous `global_vars/noninteractive`. Copiez et modifiez les paramètres souhaités, tels que la fourniture de jetons d'API et d'autres choix, puis exécutez le script.\n\nPour déployer un nouveau serveur Streisand:\n\n      deploy/streisand-new-cloud-server.sh \\\n        --provider digitalocean \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\nPour exécuter l'approvisionnement Streisand sur la machine locale:\n\n      deploy/streisand-local.sh \\\n        --site-config global_vars/noninteractive/local-site.yml\n\nPour exécuter l'approvisionnement Streisand contre un serveur existant:\n\n      deploy/streisand-existing-cloud-server.sh \\\n        --ip-address 10.10.10.10 \\\n        --ssh-user root \\\n        --site-config global_vars/noninteractive/digitalocean-site.yml\n\nNouvelles fonctionnalités à venir\n---------------------------------\n* Configuration simplifiée.\n\nS'il ya quelque chose que vous pensez que Streisand devrait faire, ou si vous trouviez un bug dans sa documentation ou son exécution, s'il vous plaît déposer un rapport sur le [Issue Tracker](https://github.com/StreisandEffect/streisand/issues).\n\nContributeurs principaux\n------------------------\n* Jay Carlson (@nopdotcom)\n* Nick Clarke (@nickolasclarke)\n* Joshua Lund (@jlund)\n* Ali Makki (@alimakki)\n* Daniel McCarney (@cpu)\n* Corban Raun (@CorbanR)\n\nRemerciements\n-------------\n[Jason A. Donenfeld](https://www.zx2c4.com/) mérite beaucoup de crédit pour être assez courageux à réimaginer ce qu'est un VPN moderne devrait ressembler et pour mettre au monde quelque chose aussi épatant que [WireGuard](https://www.wireguard.com/). Il a nos sincères remerciements pour toute son aide, patience et ses commentaires.\n\n[Corban Raun](https://github.com/CorbanR) à eu la gentillesse de me prêter un ordinateur portable Windows qui m'a permi de tester et d'affiner les instructions pour cette plate-forme, aussi bien qu'il était un grand partisan du projet dès le début.\n\nNous sommes reconnaissants à [Trevor Smith](https://github.com/trevorsmith) pour ses contributions massives au projet. Il a suggéré l'approche passerelle, fourni des tonnes de commentaires inestimable, a fait *tout* pour apparaître mieux, et développé le modèle HTML qui a servi d'inspiration pour faire passer les choses au niveau suivant avant la diffusion publique de Streisand. J'ai également apprécié l'utilisation fréquente de son iPhone tout en testant des clients divers.\n\nUn grand merci à [Paul Wouters](https://nohats.ca/) de [The Libreswan Projet](https://libreswan.org/) à son aide généreuse pour le débogage des configurations d'L2TP/IPsec.\n\nL'album 'Sunset Blood' de [Starcadian](https://starcadian.com/) a été répété environ 300 fois au cours des premiers mois de travail sur le projet au début de 2014.\n"
        },
        {
          "name": "README-ru.md",
          "type": "blob",
          "size": 27.5419921875,
          "content": "<p align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/jlund/streisand/master/logo.jpg\" alt=\"Automate the effect\"/>\n</p>\n\n- - -\n[English](README.md), [Français](README-fr.md), [简体中文](README-chs.md), [Русский](README-ru.md) | [Зеркало](https://gitlab.com/alimakki/streisand)\n- - -\n\n[![Build Status](https://github.com/StreisandEffect/streisand/workflows/Streisand/badge.svg)](https://github.com/StreisandEffect/streisand/actions)\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/espadrine.svg?style=social&label=Follow%20%40StreisandVPN)](https://twitter.com/StreisandVPN)\n\nСтрейзанд\n=========\n\n**Заставьте цензуру замолчать. Автоматизируйте [эффект Стрейзанд](https://ru.wikipedia.org/wiki/Эффект_Стрейзанд).**\n\nИнтернет может быть немножечко несправедливым. Провайдерам, телекоммуникационным гигантам, политикам и корпорациям слишком просто блокировать доступ к сайтам и информации, которая важна для вас. Но преодолеть эти ограничения сложно. Или нет?\n\nПредставляем Стрейзанд\n---------------------\n* Одна-единственная команда настраивает с нуля сервер под операционной системой Ubuntu 16.04 с большим набором [ПО для противодействия цензуре](#services-provided), который может полностью скрыть и зашифровать весь ваш трафик.\n* Стрейзанд поддерживает создание новых серверов в [Amazon EC2](https://aws.amazon.com/ec2/), [Azure](https://azure.microsoft.com), [DigitalOcean](https://www.digitalocean.com/), [Google Compute Engine](https://cloud.google.com/compute/), [Linode](https://www.linode.com/), и [Rackspace](https://www.rackspace.com/). В скором времени ожидается поддержка также и других облачных хостеров. Стрейзанд также можно запускать на любом сервере с операционной системой Ubuntu 16.04 вне зависимости от хостера, и **сотни** серверов могут быть одновременно сконфигурированы с применением этого метода.\n* Процесс полностью автоматизирован и занимает примерно десять минут, что довольно круто, учитывая что среднему системному администратору требуется несколько дней возни, для того, чтобы настроить малую часть того, что Стрейзанд предлагает \"из коробки\".\n* После того, как ваш сервер Стрейзанд запущен, вы можете раздать инструкции по подключению друзьям, членам семьи и соратникам. Инструкции по подключению содержат в себе копию SSL-сертификата, уникального для каждого сервера, так что вам нужно послать им всего один файл.\n* Каждый сервер полностью самодостаточен и содержит абсолютно всё, что нужно для того, чтобы начать использовать Стрейзанд, включая криптографически верифицированные копии основного клиентского ПО. Это позволяет обойти попытки подвергнуть цензуре соответствующее ПО.\n* Но это еще не всё...\n\nДополнительные особенности\n-------------\n* Nginx поддерживает защищённый паролем и зашифрованный Портал, который служит отправной точкой для новых пользователей. Портал доступен с ипользованием SSL или через [скрытые сервисы](https://www.torproject.org/docs/hidden-services.html.en) Tor.\n  * Стрейзанд генерирует замечательные, персонализированные пошаговые инструкции по подключению для пользователей. Пользователи могут легко получить доступ к этим инструкциям через любой веб браузер. Инструкции также отлично выглядят на мобильных телефонах.\n  * Неизменность копий программного обеспечения подтверждена с помощью контрольных сумм SHA-256 или с использованием криптографических подписей GPG, если конкретный проект их предоставляет. Это предотвращает загрузку испорченных файлов.\n  * Все дополнительные файлы, такие как конфигурационные профили OpenVPN также доступны через Портал.\n  * Пользователи Tor могут также пользоваться дополнительными сервисами, устанавливаемыми Стрейзанд, для передачи больших файлов или для использования видов трафика (например BitTorrent), для которых Tor изначально не предназначен.\n  * Для каждого шлюза Стрейзанд создается уникальный пароль, SSL-сертификат и приватный ключ SSL. Инструкции и сертификат передаются через SSH в конце выполнения Стрейзанд.\n* Отдельные сервисы и множество демонов предоставляют впечатляющую гибкость. Если один из методов будет заблокирован, множество других остается доступными и большая часть из них устойчива к Deep Packet Inspection (DPI).\n  * Все методы подключения (включая прямые соединения OpenVPN) эффективны против методов блокировки, с которыми экспериментирует Турция.\n  * OpenConnect/AnyConnect, OpenSSH, OpenVPN (завернутый в stunnel), Shadowsocks, Tor (с obfsproxy и подключаемым транспортом obfs4 ) и WireGuard эффективны против Великого Китайского Файрволла.\n* Каждая задача тщательно документирована и снабжена детальным описанием. Стрейзанд одновременно является самым полным HOWTO об установке всего ПО, которое он включается и является страховкой от установки всего этого руками.\n* Всё ПО сознательно использует порты так, чтобы сделать простое блокирование портов невозможным без нанесения блокирующей стороной значительного сопутствующего ущерба. К примеру, OpenVPN использует не порт по умолчанию 1194, а 636, стандартный порт для LDAP/SSL соединений, часто используемый компаниями во всем мире.\n\n<a name=\"services-provided\"></a>\nПредоставляемые сервисы\n-----------------\n\n* [OpenSSH](https://www.openssh.com/)\n  * Создается непривилегированный пользователь и пара ключей для [sshuttle](https://github.com/sshuttle/sshuttle) и SOCKS.\n  * Поддерживаются также SSH-туннели Windows и Android, создается копия пары ключей в .ppk формате для PuTTY\n  * Установлен [Tinyproxy](https://banu.com/tinyproxy/) и подключен к localhost. Программы, которые не поддерживают SOCKS и требуют наличия HTTP proxy, такие как Twitter для Android, могу подключиться к нему через SSH-туннель.\n* [OpenConnect](https://ocserv.gitlab.io/www/index.html) / [Cisco AnyConnect](https://www.cisco.com/c/en/us/products/security/anyconnect-secure-mobility-client/index.html)\n  * OpenConnect (ocserv) - высокопроизводительный и легковесный VPN-сервер полностью совместимый с официальными клиентами Cisco AnyConnect.\n  * Его [протокол](https://ocserv.gitlab.io/www/technical.html) построен на классических стандартах, таких как HTTP, TLS и  DTLS и является одним из самых популярных и широко используемых мультинациональными корпорациями VPN технологий.\n    * Это означает, что кроме своей простоты и скорости, OpenConnect также устойчив к цензуре и практически никогда не блокируется.\n* [OpenVPN](https://openvpn.net/index.php/open-source.html)\n  * Для каждого клиента создаются унифицированные .ovpn профили для простой настройки клиента с использованием только одного файла.\n  * Поддерживаются соединения TCP и UDP.\n  * Определение адресов для клиента исползует [Dnsmasq](http://www.thekelleys.org.uk/dnsmasq/doc.html) для предотвращения утечек DNS-запросов.\n   *  Включена TLS Authentication для защиты от зондирующих атак. Трафик не имеющий корректного HMAC будет попросту проигнорирован.\n* [Shadowsocks](https://shadowsocks.org/en/index.html)\n  * Установлен высокопроизводительный [вариант libev](https://github.com/shadowsocks/shadowsocks-libev). Эта версия обрабатывает тысячи одновременных соединений.\n  * Создается QR код который можно использовать для автоматической настройки Android и iOS клиентов. Вы можете написать '8.8.8.8' на бетонной стене, или вы можете наклеить инструкции для Shadowsocks и QR коды на ту же стену.\n  * Включена поддержка [AEAD](https://shadowsocks.org/en/spec/AEAD-Ciphers.html) с ChaCha20 и Poly1305 для усиленной безопасности и уклонения от GFW.\n* [sslh](https://www.rutschle.net/tech/sslh/README.html)\n  * Sslh - демультиплексор протоколов, позволяющий Nginx, OpenSSH и  OpenVPN совместно использовать порт 443. Это предоставляет альтернативный метод подключения и означает, что вы можете перенаправлять трафик через OpenSSH и OpenVPN даже если вы находитесь в сети с очень строгими правилами, которая блокирует все соединения не с HTTP.\n* [Stunnel](https://www.stunnel.org/index.html)\n  * Слушает и упаковывает соединения OpenVPN. Это заставляет их выглядеть как стандартный SSL трафик и позволяет OpenVPN клиентам устанавливать туннели даже в случае использования Deep Packet Inspection.\n  * Создаются как профили для прямых соединений, так и унифицированные профили для соединений OpenVPN через stunnel. И подробные инструкции тоже.\n  * Сертификат stunnel и ключ экспортируются в формате PKCS #12 для совместимости с другими приложениями для туннелирования SSL. В частности , это позволяет [OpenVPN for Android](https://play.google.com/store/apps/details?id=de.blinkt.openvpn) туннелировать свой трафик через [SSLDroid](https://play.google.com/store/apps/details?id=hu.blint.ssldroid). OpenVPN в Китае на мобильном устройстве? Да!\n* [Tor](https://www.torproject.org/)\n  * Настроен  [bridge relay](https://www.torproject.org/docs/bridges) со случайно сгенерированным именем.\n  * Установлен [Obfsproxy](https://www.torproject.org/projects/obfsproxy.html.en) и настроен с поддержкой подключаемого транспорта obfs4.\n  * Сгенерирован код BridgeQR для автоматического конфигурирования [Orbot](https://play.google.com/store/apps/details?id=org.torproject.android) для Android.\n* [UFW](https://wiki.ubuntu.com/UncomplicatedFirewall)\n  * Для каждого сервиса настроены правила файрвола, так что любой трафик отправленный на запрещенный порт будет заблокирован.\n* [unattended-upgrades](https://help.ubuntu.com/community/AutomaticSecurityUpdates)\n  * Ваш Стрейзанд сервер настроен для автоматической установки обновлений, связанных с безопасностью.\n* [WireGuard](https://www.wireguard.io/)\n  * Пользователи Linux могут насладиться простым и прекрасным VPN, который также является сказочно быстрым и использует современные криптографические принципы, отсутствующие в других высокоскоростных VPN решениях\n\nУстановка\n------------\nПожалуйста, **внимательно** прочитайте инструкции по установке перед тем, как продолжать.\n\n### Важное разъяснение ###\nСтрейзанд основан на [Ansible](https://www.ansible.com/), инструменте автоматизации, который обычно используется для установки и настройки файлов и пакетов на удалённых серверах. Стрейзанд автоматически создает **новый удалённый сервер** с пакетами и конфигурационными файлами VPN.\n\nКогда вы запустите Стрейзанд **на вашей домашней машине** (например на вашем лэптопе), он создаст и запустит **новый отдельный сервер** у хостера по вашему выбору. Обычно, вам **не надо запускать Стрейзанд на удалённом сервере** , так как по умолчанию это приведет к созданию нового сервера с вашего текущего сервера и первый сервер будет излишним.  (фух!).\n\nПри некоторых обстоятельствах продвинутые пользователи могут воспользоваться локальным методом настройки чтобы настроить сервер Стрейзанд на той же машине, где запущен Стрейзанд/Ansible. Этот способ конфигурации стоит использовать для ситуаций когда вы не можете установить Ansible на вашем домашнем компьютере или когда ваше соединение с облачным хостером слишком ненадежно для работы Ansible.\n\n### Необходимые условия ###\nВыполните все указанные ниже шаги на вашем домашнем компьютере.\n\n* Стрейзанд требует BSD, Linux или macOS. На текущий момент Windows не поддерживается. Все указанные ниже команды должны выполняться в терминале.\n* Требуется наличие Python 2.7. Он присутствует в стандартной поставке macOS и практически во всех Linux и BSD дистрибутивах. Если в вашем дистрибутиве установлен Python 3, вам потребуется также установить Python 2.7 , чтобы  Стрейзанд работал нормально.\n* Убедитесь, что открытый SSH ключ присутствует в файле ~/.ssh/id\\_rsa.pub.\n  * SSH ключи - это более защищенная альтернатива паролям, позволяющая подтвердить вашу личность на сервере или службе, построенной на криптографии с открытым ключом. Открытый ключ вы можете передавать другим, в то время как закрытый ключ должен храниться в тайне (так же как пароль).\n  * Для того, чтобы проверить, есть ли у вас открытый SSH ключ, введите следущую комманду:\n\n        ls ~/.ssh\n  * Если вы видите файл id\\_rsa.pub, значит у вас есть открытый SSH ключ.\n  * Если у вас нет пары SSH ключей, вы можете ее сгенерировать с использованием следующей команды и выбирая значения по умолчанию:\n\n        ssh-keygen\n  * Если вы хотите использовать SSH ключи с другим именем или в другом местоположении, введите 'yes' когда установщик спросит хотите ли вы настроить сервер.\n  * **Обратите внимание**: Эти ключи будут вам нужны для доступа к серверу Стрейзанд по SSH. Пожалуйста, сохраняйте их на протяжении всей жизни сервера.\n* Установите Git.\n  * На Debian и Ubuntu\n\n        sudo apt-get install git\n  * На Fedora\n\n        sudo dnf install git\n  * На macOS (с использованием [Homebrew](https://brew.sh/))\n\n        brew install git\n* Установите  [pip](https://pip.pypa.io/en/latest/) - систему управления пакетами для Python.\n  * На Debian и Ubuntu (также устанавливает зависимости. необходимые для сборки Ansible и работы некоторых других модулей)\n\n        sudo apt-get install python-paramiko python-pip python-pycurl python-dev build-essential\n  * На Fedora\n\n        sudo dnf install python-pip\n  * На macOS\n\n        sudo easy_install pip\n        sudo pip install pycurl\n\n* Установите [Ansible](https://www.ansible.com/).\n  * На macOS (с использованием [Homebrew](http://brew.sh/))\n\n        brew install ansible\n  * На BSD или Linux (с использованием pip)\n\n        sudo pip install ansible markupsafe\n* Установите необходимые библиотеки Python для вашего облачного хостера. Если вы настраиваете локальный или существующий сервер, вы можете пропустить этот шаг.\n  * Amazon EC2\n\n        sudo pip install boto boto3\n  * Azure\n\n        sudo pip install ansible[azure]\n  * Google\n\n        sudo pip install \"apache-libcloud>=1.17.0\"\n\n  * Linode\n\n        sudo pip install linode-api4\n  * Rackspace Cloud\n\n        sudo pip install pyrax\n  * **Важное замечание: если вы используете Python , установленный через  Homebrew** то вы должны также выполнить следующие команды чтобы быть уверенным, что Python сможет найти необходимые библиотеки:\n\n        mkdir -p ~/Library/Python/2.7/lib/python/site-packages\n        echo '/usr/local/lib/python2.7/site-packages' > ~/Library/Python/2.7/lib/python/site-packages/homebrew.pth\n\n### Выполнение ###\n1. Склонируйте репозиторий Стрейзанд и перейдите в директорию\n\n       git clone https://github.com/StreisandEffect/streisand.git && cd streisand\n2. Запустите скрипт Стрейзанд.\n\n       ./streisand\n3. Следуйте инструкциям для выбора вашего хостера, региона, где будет запущен сервер и его имени. Вам также потребуется ввести информацию об API.\n4. После того, как логины и API ключи предоставлены, Стрейзанд начинает создавать новый удалённый сервер.\n5. Подождите, пока установка будет завершена (это обычно занимает примерно десять минут) и вы найдете файл в папке 'generated-docs' в директории репозитория Стрейзанд. HTML файл содержит инструкции как подключиться к шлюзу через SSL или через Tor. Все инструкции, файлы, копии клиентского ПО и ключ для нового сервера расположены на портале. Всё готово!\n\n### Использование Стрейзанд для настройки локального сервера (Для продвинутых) ###\n\nДля случаев, когда вы не можете запустить Стрейзанд как обычно (с вашего домашнего компьютера или лэптопа), с тем, чтобы сконфигурировать удалённый сервер, Стрейзанд поддерживает локальный метод настройки. Просто выберите  \"Localhost (Advanced)\" из меню, после того, как запустили `./streisand`.\n\n**Замечание:** Запуск Стрейзанд для настройки локального сервера может что-нибудь испортить. Возможно, вы перезапишете конфигурационные файлы, поэтому будьте уверены, что вы настраиваете правильный сервер.\n\n### Использование Стрейзанд для других хостеров (Для продвинутых) ###\n\nВы также можете запустить Стрейзанд на любом сервере Ubuntu 16.04. Выделенный сервер? Отлично! Странный облачный хостер? Замечательно! Чтобы это сделать, просто выберите\n\"Existing Server (Advanced)\" из меню после запуска `./streisand` и введите IP адрес существующего сервера , когда скрипт запросит эти данные.\n\nЭтот сервер должен разрешать подключение с SSH-ключом `$HOME/.ssh/id_rsa` и по умолчанию для подключения будет использоваться пользователь **root**. Если ваш хостер требует, чтобы для подключения использовался какой-то другой пользователь (например `ubuntu`), установите переменную среды `ANSIBLE_SSH_USER` (например `ANSIBLE_SSH_USER=ubuntu` ) перед запуском `./streisand`.\n\n**Замечание:** Запуск Стрейзанд для настройки существующего сервера может что-нибудь испортить. Возможно, вы перезапишете конфигурационные файлы, поэтому будьте уверены, что вы настраиваете правильный сервер.\n\nБудущие возможности\n-------------------\n* Более простая установка.\n\nЕсли у вас есть идея, что ещё может делать Стрейзанд или вы нашли баг в документации или коде, пожалуйста, оставьте сообщение в [Issue Tracker](https://github.com/StreisandEffect/streisand/issues).\n\nКлючевые разработчики\n---------------------\n* Jay Carlson (@nopdotcom)\n* Nick Clarke (@nickolasclarke)\n* Joshua Lund (@jlund)\n* Ali Makki (@alimakki)\n* Daniel McCarney (@cpu)\n* Corban Raun (@CorbanR)\n\nБлагодарности\n-------------\n[Jason A. Donenfeld](https://www.zx2c4.com/) заслуживает множество благодарностей за смелое представление о том, как может выглядеть современный VPN и за то, что он создал такую отличную штуку как  [WireGuard](https://www.wireguard.io/). Искреннее спасибо за его терпеливую помощь и отличную обратную связь.\n\nМы благодарны [Trevor Smith](https://github.com/trevorsmith) за его огромный вклад в проект. Он предложил подход с использованием портала, дал множество бесценных комментариев. С его помощью *всё* стало выглядеть лучше, он создал шаблон HTML, который вдохновил меня поднять всё на новый уровень перед официальным запуском.\n\nОгромное спасибо  [Paul Wouters](https://nohats.ca/) из [The Libreswan Project](https://libreswan.org/) за его великодушную помощь в отладке инсталляции  L2TP/IPsec.\n\nАльбом 'Sunset Blood' группы [Starcadian's](https://www.starcadian.com/) был прослушан примерно 300 раз в цикле в течение первых месяцев работы над этим проектом в начале 2014 года.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.41015625,
          "content": "# Streisand\n\n<p align=\"center\">\n<img src=\"https://raw.githubusercontent.com/jlund/streisand/master/logo.jpg\" alt=\"Automate the effect\"/> \n</p>\n\n- - -\n[English](README.md), [Français](README-fr.md), [简体中文](README-chs.md), [Русский](README-ru.md) | [Mirror](https://gitlab.com/alimakki/streisand)\n- - -\n\n[![Build Status](https://github.com/StreisandEffect/streisand/workflows/Streisand/badge.svg)](https://github.com/StreisandEffect/streisand/actions)\n[![Twitter](https://img.shields.io/twitter/url/https/twitter.com/espadrine.svg?style=social&label=Follow%20%40StreisandVPN)](https://twitter.com/StreisandVPN)\n\nStreisand\n=========\n\n**Silence censorship. Automate the [effect](https://en.wikipedia.org/wiki/Streisand_effect).**\n\nThe Internet can be a little unfair. It's way too easy for ISPs, telecoms, politicians, and corporations to block access to the sites and information that you care about. But breaking through these restrictions is *tough*. Or is it?\n\nIf you have an account with a cloud computing provider, Streisand can set up a new node with many censorship-resistant VPN services nearly automatically. You'll need a little experience with a Unix command-line. (But without Streisand, it could take days for a skilled Unix administrator to configure these services securely!) At the end, you'll have a private website with software and instructions.\n\nHere's what **[a sample Streisand server](http://streisandeffect-demo.s3-website.us-east-2.amazonaws.com/)** looks like.\n\n\nThere's a [list of supported cloud providers](#cloud-providers); experts may be able to use Streisand to install on many other cloud providers.\n\n## VPN services\n\nOne type of tool that people use to avoid network censorship is a Virtual Private Network (VPN). There are many kinds of VPNs.\n\nNot all network censorship is alike; in some places, it changes from day to day. Streisand provides many different VPN services to try. (You don't have to install them all, though.)\n\nSome Streisand services include add-ons for further censorship and throttling resistance:\n\n* [OpenSSH](https://www.openssh.com/)\n    * [Tinyproxy](https://banu.com/tinyproxy/) may be used as an HTTP proxy.\n* [OpenConnect](https://ocserv.gitlab.io/www/index.html) / [Cisco AnyConnect](https://www.cisco.com/c/en/us/products/security/anyconnect-secure-mobility-client/index.html)\n    * This protocol is widely used by multi-national corporations, and might not be blocked.\n* [OpenVPN](https://openvpn.net/index.php/open-source.html)\n    * [Stunnel](https://www.stunnel.org/index.html) add-on available.\n* [Shadowsocks](https://shadowsocks.org/en/index.html), \n    * The [V2ray-plugin](https://github.com/shadowsocks/v2ray-plugin) is installed to provide robust traffic evasion on hostile networks (especially those implementing quality of service (QOS) throttling).\n* A private [Tor](https://www.torproject.org/) bridge relay\n    * [Obfsproxy](https://www.torproject.org/projects/obfsproxy.html.en) with obfs4 available as an add-on.\n* [WireGuard](https://www.wireguard.com/), a modern high-performance protocol.\n\nSee also:\n* A [more technical list of features](Features.md) \n* A [more technical list of services](Services.md)\n\n<a id=\"cloud-providers\"></a>\n## Cloud providers\n* Amazon Web Services (AWS)\n* Microsoft Azure\n* Digital Ocean\n* Google Compute Engine (GCE)\n* Linode\n* Rackspace\n\n\n#### Other providers\nWe recommend using one of the above providers. If you are an expert and can set up a *fresh Ubuntu 16.04 server* elsewhere, there are \"localhost\" and \"existing remote server\" installation methods. For more information, see [the advanced installation instructions](Advanced%20installation.md).\n\n## Installation\n\nYou need command-line access to a Unix system. You can use Linux, BSD, or macOS; on Windows 10, the Windows Subsystem for Linux (WSL) counts as Linux. \n\nOnce you're ready, see the [full installation instructions](Installation.md).\n\n\n## Things we want to do better\n\nAside from a good deal of cleanup, we could really use:\n\n* Easier setup.\n* Faster adoption of new censorship-avoidance tools\n\nWe're looking for help with both.\n\nIf there is something that you think Streisand should do, or if you find a bug in its documentation or execution, please file a report on the [Issue Tracker](https://github.com/StreisandEffect/streisand/issues).\n\nCore Contributors\n----------------\n* Jay Carlson (@nopdotcom)\n* Nick Clarke (@nickolasclarke)\n* Joshua Lund (@jlund)\n* Ali Makki (@alimakki)\n* Daniel McCarney (@cpu)\n* Corban Raun (@CorbanR)\n\nAcknowledgements\n----------------\n[Jason A. Donenfeld](https://www.zx2c4.com/) deserves a lot of credit for being brave enough to reimagine what a modern VPN should look like and for coming up with something as good as [WireGuard](https://www.wireguard.com/). He has our sincere thanks for all of his patient help and high-quality feedback.\n\nWe are grateful to [Trevor Smith](https://github.com/trevorsmith) for his massive contributions. He suggested the Gateway approach, provided tons of invaluable feedback, made *everything* look better, and developed the HTML template that served as the inspiration to take things to the next level before Streisand's public release.\n\nHuge thanks to [Paul Wouters](https://nohats.ca/) of [The Libreswan Project](https://libreswan.org/) for his generous help troubleshooting the L2TP/IPsec setup.\n\n[Starcadian's](https://www.starcadian.com/) 'Sunset Blood' album was played on repeat approximately 300 times during the first few months of work on the project in early 2014.\n"
        },
        {
          "name": "Services.md",
          "type": "blob",
          "size": 5.822265625,
          "content": "# Services\n\nServices Provided\n-----------------\n\n* [OpenSSH](https://www.openssh.com/)\n  * Windows and Android SSH tunnels are also supported, and a copy of the keypair is exported in the `.ppk` format that PuTTY requires.\n  * [Tinyproxy](https://tinyproxy.github.io/) can be installed and bound to localhost. It can be accessed over an SSH tunnel by programs that do not natively support SOCKS and that require an HTTP proxy, such as Twitter for Android.\n  * An unprivileged forwarding user and SSH keypair can be generated for [sshuttle](https://github.com/sshuttle/sshuttle) and SOCKS capabilities.\n* [OpenConnect](https://ocserv.gitlab.io/www/index.html) / [Cisco AnyConnect](https://www.cisco.com/c/en/us/products/security/anyconnect-secure-mobility-client/index.html)\n  * OpenConnect (ocserv) is an extremely high-performance and lightweight VPN server that also features full compatibility with the official Cisco AnyConnect clients.\n  * The [protocol](https://ocserv.gitlab.io/www/technical.html) is built on top of standards like HTTP, TLS, and DTLS, and it's one of the most popular and widely used VPN technologies among large multi-national corporations.\n    * This means that in addition to its ease-of-use and speed, OpenConnect is also highly resistant to censorship and is almost never blocked.\n* [OpenVPN](https://openvpn.net/index.php/open-source.html)\n  * When enabled, self-contained \"unified\" .ovpn profiles are generated for easy client configuration using only a single file.\n  * Both TCP and UDP connections are supported.\n  * Client DNS resolution is handled via [Dnsmasq](http://www.thekelleys.org.uk/dnsmasq/doc.html) to prevent DNS leaks.\n  * TLS Authentication is enabled which helps protect against active probing attacks. Traffic that does not have the proper HMAC is simply dropped.\n* [Shadowsocks](https://shadowsocks.org/en/index.html)\n  * When enabled, the high-performance [libev variant](https://github.com/shadowsocks/shadowsocks-libev) is installed. This version is capable of handling thousands of simultaneous connections.\n  * A QR code is generated that can be used to automatically configure the Android and iOS clients by simply taking a picture. You can tag '8.8.8.8' on that concrete wall, or you can glue the Shadowsocks instructions and some QR codes to it instead!\n  * [AEAD](https://shadowsocks.org/en/spec/AEAD-Ciphers.html) support is enabled using ChaCha20 and Poly1305 for enhanced security and improved GFW evasion.\n  * The [v2ray-plugin](https://github.com/shadowsocks/v2ray-plugin) plugin is installed to provide robust traffic evasion on hostile networks (especially those implementing quality of service (QOS) throttling).\n* [sslh](https://www.rutschle.net/tech/sslh/README.html)\n  * Sslh is a protocol demultiplexer that allows Nginx, OpenSSH, and OpenVPN to share port 443. This provides an alternative connection option and means that you can still route traffic via OpenSSH and OpenVPN even if you are on a restrictive network that blocks all access to non-HTTP ports.\n* [Stunnel](https://www.stunnel.org/index.html)\n  * When enabled, listens for and wraps OpenVPN connections. This makes them look like standard SSL traffic and allows OpenVPN clients to successfully establish tunnels even in the presence of Deep Packet Inspection.\n  * Unified profiles for stunnel-wrapped OpenVPN connections are generated alongside the direct connection profiles. Detailed instructions are also generated.\n  * The stunnel certificate and key are exported in PKCS #12 format so they are compatible with other SSL tunneling applications. Notably, this enables [OpenVPN for Android](https://play.google.com/store/apps/details?id=de.blinkt.openvpn) to tunnel its traffic through [SSLDroid](https://play.google.com/store/apps/details?id=hu.blint.ssldroid). OpenVPN in China on a mobile device? Yes!\n* [Tor](https://www.torproject.org/)\n  * If chosen by the user a [bridge relay](https://www.torproject.org/docs/bridges) is set up with a random nickname.\n  * [Obfsproxy](https://www.torproject.org/projects/obfsproxy.html.en) is installed and configured with support for the obfs4 pluggable transport.\n  * A BridgeQR code is generated that can be used to automatically configure [Orbot](https://play.google.com/store/apps/details?id=org.torproject.android) for Android.\n* [UFW](https://wiki.ubuntu.com/UncomplicatedFirewall)\n  * Firewall rules are configured for every service, and any traffic that is sent to an unauthorized port will be blocked.\n* [unattended-upgrades](https://help.ubuntu.com/community/AutomaticSecurityUpdates)\n  * Your Streisand server is configured to automatically install new security updates.\n* [WireGuard](https://www.wireguard.com/)\n  * Users can take advantage of this next-gen, simple, kernel-based or user-space-based, state-of-the-art VPN that also happens to be ridiculously fast and uses modern cryptographic principles that all other highspeed VPN solutions lack. It is noticeably more performant and enery-saving, and is highly advantageous in roaming network-to-network environments, like mobile phones. A connection can be made as simply as scanning a QR code, which makes it perfect for sharing with friends and family members. It currently offers an official client for macOS, iOS, Android, Windows, a variety of Linux distibutions, OpenBSD and FreeBSD.\n* [Cloudflared DNS-over-HTTPS](https://developers.cloudflare.com/1.1.1.1/dns-over-https/)\n  * Even when you are visiting a site using HTTPS, by default your DNS query is sent over an unencrypted connection (between the Streisand server and upstream DNS servers). With Streisand's DNS-over-HTTPS service provided by the cloudflared client enabled, your DNS queries are blocked from view by the cloud provider hosting your Streisand server and everyone in between them and the upstream DNS server. The DNS reply from the upstream server is also protected from both view and tampering on its way back to your Streisand server.\n"
        },
        {
          "name": "Vagrantfile",
          "type": "blob",
          "size": 1.34765625,
          "content": "# See documentation/testing.md for instructions on using this Vagrantfile\n#\nVagrant.require_version \">= 1.9.0\"\n\nVagrant.configure(2) do |config|\n\n  config.vm.box = \"ubuntu/xenial64\"\n\n  config.vm.define \"streisand-host\", primary: true do |streisand|\n    streisand.vm.hostname = \"streisand-host\"\n    streisand.vm.network :private_network, ip: \"10.0.0.10\"\n\n    streisand.vm.provision \"ansible\" do |ansible|\n      # NOTE: Uncomment the below line for verbose Ansible output\n      # ansible.verbose = \"v\"\n      ansible.playbook = \"playbooks/vagrant.yml\"\n      ansible.host_vars = {\n        \"streisand-host\" => {\n          \"streisand_ipv4_address\" => \"10.0.0.10\"\n        }\n      }\n      ansible.raw_arguments  = [\n        \"--extra-vars=@global_vars/globals.yml\",\n        \"--extra-vars=@global_vars/default-site.yml\",\n        \"--extra-vars=@global_vars/integration/test-site.yml\"\n      ]\n    end\n  end\n\n  config.vm.define \"streisand-client\" do |client|\n    client.vm.hostname = \"streisand-client\"\n    client.vm.network :private_network, ip: \"10.0.0.11\"\n\n    client.vm.provision \"ansible\" do |ansible|\n      # NOTE: Uncomment the below line for verbose Ansible output\n      # ansible.verbose = \"v\"\n      ansible.playbook = \"playbooks/test-client.yml\"\n      ansible.host_vars = {\n        \"streisand-client\" => {\n          \"streisand_ip\" => \"10.0.0.10\",\n        }\n      }\n    end\n  end\nend\n"
        },
        {
          "name": "Vagrantfile.remotetest",
          "type": "blob",
          "size": 0.7978515625,
          "content": "# See documentation/testing.md for instructions on using this Vagrantfile\n#\n# NOTE: You *MUST* replace the \"REMOTE_IP_HERE\" value in the `host_vars` section\n# with the IP address of the Streisand server you wish to test\n#\nVagrant.require_version \">= 1.9.0\"\n\nVagrant.configure(2) do |config|\n\n  config.vm.box = \"ubuntu/xenial64\"\n\n  config.vm.define \"streisand-client\" do |client|\n    client.vm.hostname = \"streisand-client\"\n    client.vm.network :private_network, ip: \"10.0.0.11\"\n\n    client.vm.provision \"ansible\" do |ansible|\n      # NOTE: Uncomment the below line for verbose Ansible output\n      #ansible.verbose = \"v\"\n      ansible.playbook = \"playbooks/test-client.yml\"\n      ansible.host_vars = {\n        \"streisand-client\" => {\n          \"streisand_ip\" => \"REMOTE_IP_HERE\",\n        }\n      }\n    end\n  end\nend\n"
        },
        {
          "name": "ansible.cfg",
          "type": "blob",
          "size": 0.8486328125,
          "content": "[defaults]\ninventory = inventories/inventory\nnocows = 1\n\n# This is a convenient setting for a brand-new Streisand server that\n# you are connecting to for the first time. However, this line should be\n# commented out if you are connecting to an existing server where a\n# known_hosts entry has already been created. Host key checking happens\n# by default in Ansible.\nhost_key_checking = False\n\n# Workaround for an Ansible issue with temporary paths:\n# https://github.com/ansible/ansible/issues/21562\nremote_tmp = $HOME/.ansible/tmp\nlocal_tmp = $HOME/.ansible/tmp\n\n# Some providers take a long time to actually begin accepting\n# connections even after the OpenSSH daemon has started.\ntimeout = 100\n\nlibrary=library\n\n[ssh_connection]\n# Enables multiplexing (lets ansible reuse opened SSH connections)\nssh_args = -o ControlMaster=auto -o ControlPersist=60s\npipelining = True\n"
        },
        {
          "name": "deploy",
          "type": "tree",
          "content": null
        },
        {
          "name": "documentation",
          "type": "tree",
          "content": null
        },
        {
          "name": "global_vars",
          "type": "tree",
          "content": null
        },
        {
          "name": "inventories",
          "type": "tree",
          "content": null
        },
        {
          "name": "library",
          "type": "tree",
          "content": null
        },
        {
          "name": "logo.jpg",
          "type": "blob",
          "size": 137.8544921875,
          "content": null
        },
        {
          "name": "playbooks",
          "type": "tree",
          "content": null
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 0.3388671875,
          "content": "# Install Streisand requirements with:\n#\n#   pip install -r ./requirements.txt\n#\n# If you have problems running this, try the util/venv-builder.sh script.\n\n# Core with Azure dependencies\n#\nansible[azure]==2.8.4\n\nSecretStorage\n\n# AWS\nboto\nboto3\n\n# Google Compute Engine\nrequests\ngoogle-auth\napache-libcloud\n\n# Linode\nlinode-api4\n\n# Rackspace\npyrax\n"
        },
        {
          "name": "streisand",
          "type": "blob",
          "size": 7.0478515625,
          "content": "#!/usr/bin/env bash\n# Streisand provisioning script\n\n# Set errexit option to exit immediately on any non-zero status return\nset -e\n\necho -e \"\\n\\033[38;5;255m\\033[48;5;234m\\033[1m  S T R E I S A N D  \\033[0m\\n\"\n\n# This is where Ansible looks for local modules. Disable it, in the\n# interests of consistency between installs.\nexport ANSIBLE_LIBRARY=\n\nSCRIPT_DIR=\"$(cd \"$(dirname \"$0\")\" && pwd -P)\"\n\nDEFAULT_SITE_VARS=\"$SCRIPT_DIR/global_vars/default-site.yml\"\nGLOBAL_VARS=\"$SCRIPT_DIR/global_vars/globals.yml\"\nHOME_DIR=\"$HOME/.streisand\"\nSITE_VARS=\"$HOME_DIR/site.yml\"\n\n# Include the check_ansible function from ansible_check.sh\nsource util/ansible_check.sh\n\nfunction init_homedir() {\n  if [ ! -d \"$HOME_DIR\" ]; then\n    mkdir \"$HOME_DIR\"\n    echo \"Created new Streisand home directory: $HOME_DIR\"\n  fi\n  if [ ! -f \"$SITE_VARS\" ]; then\n    cp \"$DEFAULT_SITE_VARS\" \"$SITE_VARS\"\n    echo \"Created new Streisand site vars file: $SITE_VARS\"\n  fi\n}\n\n# check_python checks whether the 'python' interpreter is Python 2 or Python 3.\n# If it is Python 2 then the inventory file is updated to set the\n# ansible_interpretter host var explicitly\n# function check_python() {\n#     return 0\n#   local PYTHON_VERSION\n#   PYTHON_VERSION=\"$(python --version 2>/dev/null)\"\n#\n#   if [[ -n $PYTHON_VERSION && ! $PYTHON_VERSION =~ ^Python\\ 3\\..* ]]; then\n#     local INVENTORY_DIR=\"$SCRIPT_DIR/inventories/\"\n#     for INV_FILE in \"$INVENTORY_DIR\"/*; do\n#       sed \"s|=python\\$|=$(type python)|\" \"$INV_FILE\" > \"$INV_FILE.new\"\n#       mv \"$INV_FILE.new\" \"$INV_FILE\"\n#       git -C \"$INVENTORY_DIR\" update-index --assume-unchanged \"$INV_FILE\" 2>/dev/null || true\n#     done\n#   fi\n# }\n\n# validate runs the validation role to check the consistency of the Streisand\n# service vars (e.g. that at least one service is enabled after customization of\n# $SITE_VARS).\nfunction validate() {\n  local NEW_SERVER_PROVISIONING=$1\n  if [ -z \"${NEW_SERVER_PROVISIONING}\" ]; then\n    NEW_SERVER_PROVISIONING=true\n  fi\n  \n  echo; echo; ansible-playbook \\\n    --extra-vars=\"@$GLOBAL_VARS\" \\\n    --extra-vars=\"@$DEFAULT_SITE_VARS\" \\\n    --extra-vars=\"@$SITE_VARS\" \\\n    --extra-vars=\"streisand_new_server_provisioning=$NEW_SERVER_PROVISIONING\" \\\n    playbooks/validate.yml\n}\n\n# customize prompts the user to decide if they want to customize the Streisand\n# installation. If the user wishes, the playbooks/customize.yml role is used to\n# change the base installation by rewriting the $SITE_VARS file.\nfunction customize() {\n  read -r -p \"\nDo you wish to customize which services Streisand will install?\nBy saying 'no' Streisand will use the settings configured in $SITE_VARS\n\nPress enter to customize your installation: \" confirm\n  case \"$confirm\" in\n    no) echo; echo \"Installing Streisand services specified in $SITE_VARS\";;\n     *) echo; echo \"Confirmed. Customizing Streisand services.\";\n         # NOTE(@cpu): We don't pass the other `--extra-vars` here because the\n         # customize `vars_prompt` will only happen if the vars aren't already\n         # set. If you pass the site/defaults in no prompting will happen.\n         echo; echo; ansible-playbook \\\n           --extra-vars=\"@$GLOBAL_VARS\" \\\n           playbooks/customize.yml;;\n  esac\n}\n\n# run_genesis invokes the genesis playbook file specified by the first argument\n# to the function, or `streisand.yml` if none is provided. It uses the second\n# argument to the function as the inventory or `inventories/inventory` if none\n# is provided.\nfunction run_genesis() {\n  local GENESIS_PLAYBOOK=$1\n  local ASK_BECOME=\"\"\n  if [ -z \"${GENESIS_PLAYBOOK}\" ]; then\n    GENESIS_PLAYBOOK=streisand.yml\n  fi\n  local GENESIS_INVENTORY=$2\n  if [ -z \"${GENESIS_INVENTORY}\" ]; then\n    GENESIS_INVENTORY=inventories/inventory\n  fi\n  # Customize the Streisand services that will be installed\n  customize\n  # Ensure that the customization hasn't resulted in something inconsistent\n  # NEW_SERVER_PROVISIONING can be False or True (0 or 1), tests if we need \n  # to check existence of SSH public key\n  if [ \"$GENESIS_PLAYBOOK\" != \"existing-server.yml\" ] && [ \"$GENESIS_PLAYBOOK\" != \"localhost.yml\" ]; then\n    validate true\n  else\n    validate false\n  fi\n  \n  if [ -n \"${SSH_USER}\" ] && [ \"$SSH_USER\" != \"root\" ]; then\n    ASK_BECOME=\"--ask-become-pass\"\n  fi\n  \n  # Run the specified genesis playbook with the specified Ansible inventory\n  echo; echo; ansible-playbook \\\n    -i $GENESIS_INVENTORY \\\n    --extra-vars=\"@$GLOBAL_VARS\" \\\n    --extra-vars=\"@$DEFAULT_SITE_VARS\" \\\n    --extra-vars=\"@$SITE_VARS\" \\\n    $ASK_BECOME \\\n    \"playbooks/$GENESIS_PLAYBOOK\"\n}\n\n# be_careful_friend asks you to pay attention because you're about to do\n# something that might be impossible to undo!\nfunction be_careful_friend() {\n  read -r -p \"$1\" confirm\n  case \"$confirm\" in\n    streisand) echo; echo \"Confirmed. Continuing\";;\n    *) echo; echo \"Cancelling & exiting.\"; exit 1;;\n  esac\n}\n\n# local_provision handles provisioning the same machine as is running the\n# Streisand script/Ansible. It performs an additional \"ARE YOU SURE\" step before\n# invoking ansible-playbook. It uses the `inventory-local-provision` inventory\n# file from the inventories directory as the Ansible inventory.\nfunction local_provision() {\n  be_careful_friend \"\nLOCAL PROVISIONING WILL OVERWRITE CONFIGURATION ON **THIS** MACHINE.\nTHE MACHINE YOU ARE CURRENTLY EXECUTING THIS SHELL SCRIPT ON.\nARE YOU 100% SURE THAT YOU WISH TO CONTINUE?\n\nPlease enter the word 'streisand' to continue: \"\n\n  run_genesis localhost.yml inventories/inventory-local-provision\n}\n\nfunction existing_server() {\n  read -r -p \"What is the IP of the existing server: \" SERVER_IP\n\n  be_careful_friend \"\nTHIS WILL OVERWRITE CONFIGURATION ON THE EXISTING SERVER.\nSTREISAND ASSUMES $SERVER_IP IS A BRAND NEW UBUNTU INSTANCE AND WILL\nNOT PRESERVE EXISTING CONFIGURATION OR DATA.\n\nARE YOU 100% SURE THAT YOU WISH TO CONTINUE?\n\nPlease enter the word 'streisand' to continue: \"\n\n  # If ANSIBLE_SSH_USER is empty, default to root\n  if [ -z \"${ANSIBLE_SSH_USER}\" ]; then\n    SSH_USER='root'\n  # Otherwise, use whatever ANSIBLE_SSH_USER is set to as the SSH_USER\n  else\n    SSH_USER=${ANSIBLE_SSH_USER}\n  fi\n\n  # Create an inventory file string on the fly\n  read -r -d '' TEMPL << EOF || true\n[localhost]\nlocalhost ansible_connection=local ansible_python_interpreter=python3\n[streisand-host]\n$SERVER_IP ansible_user=$SSH_USER\nEOF\n\n  # Create the inventory file\n  echo \"$TEMPL\" > inventories/inventory-existing\n  # Invoke the Streisand playbook on the existing server inventory\n  run_genesis existing-server.yml inventories/inventory-existing\n}\n\n# Make sure the system is ready for the Streisand playbooks\ninit_homedir\n# check_python\ncheck_ansible\n\n# Figure out which genesis role to invoke\nread -r -p \"Which provider are you using?\n  1. Amazon\n  2. Azure\n  3. DigitalOcean\n  4. Google\n  5. Linode\n  6. Rackspace\n  7. localhost (Advanced)\n  8. Existing Server (Advanced)\n: \" reply\n\ncase \"$reply\" in\n  1) run_genesis amazon.yml;;\n  2) run_genesis azure.yml;;\n  3) run_genesis digitalocean.yml;;\n  4) run_genesis google.yml;;\n  5) run_genesis linode.yml;;\n  6) run_genesis rackspace.yml;;\n  7) local_provision;;\n  8) existing_server;;\n  *) echo; echo \"Invalid provider selected.\"; exit 1;;\nesac\n"
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "util",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}