{
  "metadata": {
    "timestamp": 1736711698718,
    "page": 402,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "emmatyping/WSL-Programs",
      "stars": 1103,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0361328125,
          "content": "_site\n.sass-cache\nGemfile.lock\n*.gem\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.0986328125,
          "content": "language: ruby\ncache: bundler\nsudo: false\nrvm: 2.2\n\ninstall: script/bootstrap\nscript: script/cibuild\n"
        },
        {
          "name": "Gemfile",
          "type": "blob",
          "size": 0.0380859375,
          "content": "source 'https://rubygems.org'\n\ngemspec\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.4013671875,
          "content": "CC0 1.0 Universal\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator and\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for the\npurpose of contributing to a commons of creative, cultural and scientific\nworks (\"Commons\") that the public can reliably and without fear of later\nclaims of infringement build upon, modify, incorporate in other works, reuse\nand redistribute as freely as possible in any form whatsoever and for any\npurposes, including without limitation commercial purposes. These owners may\ncontribute to the Commons to promote the ideal of a free culture and the\nfurther production of creative, cultural and scientific works, or to gain\nreputation or greater distribution for their Work in part through the use and\nefforts of others.\n\nFor these and/or other purposes and motivations, and without any expectation\nof additional consideration or compensation, the person associating CC0 with a\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\nand publicly distribute the Work under its terms, with knowledge of his or her\nCopyright and Related Rights in the Work and the meaning and intended legal\neffect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not limited\nto, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\n  and translate a Work;\n\n  ii. moral rights retained by the original author(s) and/or performer(s);\n\n  iii. publicity and privacy rights pertaining to a person's image or likeness\n  depicted in a Work;\n\n  iv. rights protecting against unfair competition in regards to a Work,\n  subject to the limitations in paragraph 4(a), below;\n\n  v. rights protecting the extraction, dissemination, use and reuse of data in\n  a Work;\n\n  vi. database rights (such as those arising under Directive 96/9/EC of the\n  European Parliament and of the Council of 11 March 1996 on the legal\n  protection of databases, and under any national implementation thereof,\n  including any amended or successor version of such directive); and\n\n  vii. other similar, equivalent or corresponding rights throughout the world\n  based on applicable law or treaty, and any national implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\nand Related Rights and associated claims and causes of action, whether now\nknown or unknown (including existing as well as future claims and causes of\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\nduration provided by applicable law or treaty (including future time\nextensions), (iii) in any current or future medium and for any number of\ncopies, and (iv) for any purpose whatsoever, including without limitation\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\nthe Waiver for the benefit of each member of the public at large and to the\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\nshall not be subject to revocation, rescission, cancellation, termination, or\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\nby the public as contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason be\njudged legally invalid or ineffective under applicable law, then the Waiver\nshall be preserved to the maximum extent permitted taking into account\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\nis so judged Affirmer hereby grants to each affected person a royalty-free,\nnon transferable, non sublicensable, non exclusive, irrevocable and\nunconditional license to exercise Affirmer's Copyright and Related Rights in\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\nprovided by applicable law or treaty (including future time extensions), (iii)\nin any current or future medium and for any number of copies, and (iv) for any\npurpose whatsoever, including without limitation commercial, advertising or\npromotional purposes (the \"License\"). The License shall be deemed effective as\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\nLicense for any reason be judged legally invalid or ineffective under\napplicable law, such partial invalidity or ineffectiveness shall not\ninvalidate the remainder of the License, and in such case Affirmer hereby\naffirms that he or she will not (i) exercise any of his or her remaining\nCopyright and Related Rights in the Work or (ii) assert any associated claims\nand causes of action with respect to the Work, in either case contrary to\nAffirmer's express Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\n  surrendered, licensed or otherwise affected by this document.\n\n  b. Affirmer offers the Work as-is and makes no representations or warranties\n  of any kind concerning the Work, express, implied, statutory or otherwise,\n  including without limitation warranties of title, merchantability, fitness\n  for a particular purpose, non infringement, or the absence of latent or\n  other defects, accuracy, or the present or absence of errors, whether or not\n  discoverable, all to the greatest extent permissible under applicable law.\n\n  c. Affirmer disclaims responsibility for clearing rights of other persons\n  that may apply to the Work or any use thereof, including without limitation\n  any person's Copyright and Related Rights in the Work. Further, Affirmer\n  disclaims responsibility for obtaining any necessary consents, permissions\n  or other rights required for any use of the Work.\n\n  d. Affirmer understands and acknowledges that Creative Commons is not a\n  party to this document and has no duty or obligation with respect to this\n  CC0 or use of the Work.\n\nFor more information, please see\n<http://creativecommons.org/publicdomain/zero/1.0/>\n"
        },
        {
          "name": "Observations.md",
          "type": "blob",
          "size": 0.8466796875,
          "content": "# List of interesting things found while testing.\n---------------------------------------------------\nPlease sort issues into the three categories. Major issues are ones that break the system. Moderate are issues that\nare a problem and more than an inconvenience. Minor issues are more quirks that dont appear to have serious \nrepercussions.\n\n## Major Issues\n---------------\n\n## Moderate Issues\n------------------\n- Window resizing: (changing the side of the window that contains bash)\n  - Moves focus far from cursor line\n  - Text scrolling breaks if done\n\n## Minor Issues\n---------------\n- Common keyboard shortcuts like `Ctrl+C` and `Ctrl+V` do not work\n  directly on bash window. You can access command like copy & paste by\n  right-clicking on the title bar > edit > choose command. It is also\n  possible to use `Enter` for copy and right mouse button for paste.\n"
        },
        {
          "name": "Program_Details.md",
          "type": "blob",
          "size": 2.41796875,
          "content": "# Program Details\n------------------\nThis file is to document behaviour of programs. The main README will serve as a quick note and give key points\nwhereas this file will contain more in-depth details.\nPlease place a `+` in the program name if there are more details than the notes\n\nProgram | What works | What doesnt\n--------|------------|------------\nbash | Normal shell works fine | Scripting has problems. When hitting backspace during a `read` command the key comes up as a ^(box with questionmark inside). This seems to be the response for any unknown unicode character. Scripting gives unusual in that running `sh script` treats echo differently than `chmod +x script; ./script`. Escape characters and variables do not properly work in the latter.\nemacs | Emacs 24 as distributed with Ubuntu will hang when connecting to an X11 server, as previously noted.  However, Emacs can be built from the FSF Git repo under WSL, and will work with X11.  Tested was the \"emacs-25\" branch, built with the following configure arguments: \"./configure --prefix=/usr/local --program-suffix=-25 --enable-locallisppath=/usr/share/emacs:/usr/share/emacs24 --with-sound=yes --with-gnutls --with-x -with-cairo=no --with-x-toolkit=gtk2 --with-wide-int --with-m17n-flt --with-file-notification=yes\".  Note that many development libraries need to be installed.  Try \"apt-get build-dep emacs24\" to get most of them. |  A build with the Gtk3 toolkit built and connected to X11, however the window failed to resize properly.  With Gtk2, everything seems to work so far with the exception of clipboard sharing with Windows 10.  This may be an issue with the X server.\nnginx | everything but IPv6 binding | IPv6: you need to remove it from your config. Default configuration: you need to add `master_process off;` to `/etc/nginx/nginx.conf`\npip | nothing | Does not fully install **DO NOT** install with `--fix-missing`. This will create errors when upgrading through apt. The apt error reports back problems with `udev`, `systemd-services`, `libpam-systemd:amd64`, and `initramfs-tools`\n+sshuttle | normal ssh works fine | It won't pass traffic properly and [there is a problem](https://github.com/Microsoft/WSL/issues/767) with accessing `iptables`. This is tested on Windows 10 Home, ver 1607, Build 14393\nvim | Most functionality exists. Registers, panes, and buffers work as expected under current testing. Can create new linux files. Plugins are working | Problems with colorshemes and fonts\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 22.8115234375,
          "content": "# WSL-Programs\n\n[![Join the chat at https://gitter.im/ethanhs/WSL-Programs](https://img.shields.io/gitter/room/ethanhs/WSL-Programs.svg?style=flat-square)](https://gitter.im/ethanhs/WSL-Programs?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge) &#124; [![GitHub contributors](https://img.shields.io/github/contributors/ethanhs/WSL-Programs.svg?style=flat-square)](https://github.com/ethanhs/WSL-Programs/graphs/contributors) &#124; [![CC0 license](https://img.shields.io/badge/license-CC0-blue.svg?style=flat-square)](https://github.com/ethanhs/WSL-Programs/blob/master/LICENSE)\n\nIf you'd like to chat about the Windows Subsystem for Linux (or have a question) please use the gitter chat linked above. If you are looking for guidance on getting started with Bash on Ubuntu on Windows, check [the Ubuntu Repo](https://github.com/abergs/ubuntuonwindows).\n\n## About\n\nA community powered list of programs that work (and those that don't) on the Windows subsystem for Linux. The official Microsoft repository for filing bugs, etc., is located at [Microsoft's BashOnWindows repo](https://github.com/Microsoft/BashOnWindows). This repo complements the offical one by providing a quick reference for how well programs run.\n\nPlease feel free to contribute programs you have tested to the table below. If you need help with the markdown, please review [this markdown primer from gamejolt](https://help.gamejolt.com/markdown).\n\nTo contribute, please make a Pull Request; I will merge if it looks good! If you have never made a pull request, it is fast and easy. Please check out the [Github documentation](https://help.github.com/articles/using-pull-requests/).\n\nThen add your program below!\n\nIf you need to add more details about a program, add a `+` symbol to its name and add it to the [Program_Details.md](Program_Details.md) file.\n\n## Important Note\nBecause this list is community powered, the maintainer does not hold any responsibility for the accuracy of the contents of this repository. Your mileage _may_ vary.\n\n\n# The list:\n\nProgram Name  | apt name | Functionality rating (0-5) | website | Notes  | Windows Build #\n------------- | --------------------------------------- | -------------------------- | --------------------- | -------|----------\nADB | | 2 | [developer.android.com](https://developer.android.com/studio/command-line/adb.html) | Installs; see [this image](https://cloud.githubusercontent.com/assets/7135398/17540401/6b94e568-5ee8-11e6-8523-b3efa1e4edd8.png) for example, requires adb on Windows too.\nAnaconda || 4 | [Continuum.io](https://www.continuum.io/downloads) | Simple commands work after getting listed WSL build, symlinks issue has been fixed | 14393\nApache server | apache2 | 2 | [httpd.apache.org](https://httpd.apache.org/) | Must use a loopback for networking, buggy\nApache SINGA |  | 4 | [singa.apache.org](https://singa.apache.org/) | Only CPU version is supported.\napt | | 5 | [wiki.debian.org/Apt](https://wiki.debian.org/Apt) | Works fine | 16299.19\napt-fast | | 3 | [ilikenwf/apt-fast](https://github.com/ilikenwf/apt-fast) | Simple commands work. Needs more testing | 15063.138\narchey | | 3 | [djmelik/archey](https://github.com/djmelik/archey)| Works for the most part, but displays disk usage incorrectly | 15063.138\naria2c | aria2 | 3 | [aria2.github.com](https://aria2.github.io/) | Does not resolve domains, must use IP addresses. Possibly c-ares related | 14901.1000\narp | arp | 0 | | /proc/net/arp: No such file or directory\narp-scan | arp-scan | 0 | https://github.com/royhills/arp-scan | link_open: Address family not supported by protocol\nAWeather | aweather | 0 | http://pileus.org/aweather/ | Crashes on launch due to OpenGL error. | 17764.55\nbash+ | | 3 | [gnu.org/software/bash](https://www.gnu.org/software/bash/) | Most functionality exists but there are problems with scripts\nblackfire | blackfire-agent | 5 | [blackfire.io](https://blackfire.io/) | | 16299.15\nboost | | 5 | [boost](https://http://www.boost.org) | | 16299.125\nbyobu | | 3 | [byobu.co](http://byobu.co/) | Need to toggle the byobu charmap (run `/usr/lib/byobu/include/toggle-utf8` or `export BYOBU_CHARMAP=x ; . ~/.bashrc`). Status bar occasionally disappears. | 14901.1000\nc-ares | libc-ares2 | 0 | [c-ares/c-ares](https://github.com/c-ares/c-ares) | Does not resolve domains to ip addresses. | 14901.1000\ncargo | | 4 | [rust-lang/cargo](https://github.com/rust-lang/cargo) | Correctly recognizes and downloads dependencies on basic projects. Needs testing with larger projects. | 14393.67\ncurl | | 4 | [curl/curl](https://github.com/curl/curl) | curl -sS tested\nchromium-bsu | | 0 | [chromium-bsu.sourceforge.net](http://chromium-bsu.sourceforge.net/) | Completely Fails to Launch\ncomposer | | 5 | [getcomposer.org](https://getcomposer.org/) | doesn't seem to have issues, but could use more test.\ncmake | | 4 | [cmake.org](https://cmake.org/) | Seems to work perfectly, though more testing needed.\nCoq | | 4 | [coq.inria.fr](https://coq.inria.fr/) | Installed without issue, needs more testing. | 14393\ndocker | | 3 | [docker.com](https://www.docker.com/) | Using Docker for Windows it's possible to get the client working in WSL using the instructions [here](https://raesene.github.io/blog/2018/03/29/WSL-And-Docker/)\nElectron (and any apps based on it) | | 3 | [electron.atom.io](https://electron.atom.io/) | Some apps will install, but not run. Some will not install at all. Any app that uses Chrome 53 or later as it's backend **should** in theory work, no promises | 16275\neclipse | | 4 | http://eclipse.org | occasional crashes handled internally | 17134.68\nemacs | | 5 | [gnu.org/software/emacs](https://www.gnu.org/software/emacs/) | with latest WSL and Ubuntu Xenial works great in terminal mode and over X. | 16251\nfakeroot | fakeroot | 3 | | works if configured to communicate over TCP | 15063\nfirefox |firefox| 5 |  [mozilla.org/firefox](http://mozilla.com/firefox) | Runs, without reporting any errors whatsoever, unless you bump into the negative monotonic clock problem that causes all gthread-based applications to crash. | 15063\nfish | | 5 | [fish.sh](https://fish.sh/) | works fine\nfortune | | 5 | [wikipedia - Fortune](https://en.wikipedia.org/wiki/Fortune_(Unix)) | works fine\nfsharp | | 4 | [fsharp.org](http://fsharp.org/) | Installed without issue, needs more testing. To use fsi (F# Interactive) `fsharpi` | 14393\ngazebo | | 3 | [gazebosim.org](http://gazebosim.org/) | Very laggy tested. Requries X11 server like VcXsrv and setting a few environment variables\ngcc | build-essential | 4 | [gcc.gnu.org](https://gcc.gnu.org/) | Runs as expected, more testing needed | 16299.19\ngedit | gedit | 5 | [wiki.gnome.org/Apps/Gedit](https://wiki.gnome.org/Apps/Gedit) | Works just fine after X Server configuration. Will throw some Dbus errors, but doesn't seem to affect performance. Can read and write files to Linux and Windows | 16275\nghc | ghc | 4 | [Haskell on Bash](https://blogs.msdn.microsoft.com/commandline/2017/02/09/haskell-on-bashwsl/) [haskell.org/ghc](https://www.haskell.org/ghc/) | Needs more tests | 15031\ngimp | gimp | 5 | [gimp](https//gimp.org) | Seems to work just fine. Can read and write files to both Linux and Windows. Xming freezes, VcXsrv works fine | 16275\ngit | | 4 | [git-scm.com](https://git-scm.com/) | requires more testing, Basics work (clone, pull, push, fetch commit). Diff has some errors | 16299.19\ngnokii | gnokii | 0 | | useless without USB | 17134.68\nGNOME Web | epiphany-browser | 4 | [How-to](http://browsingthenet.blogspot.com/2016/11/how-to-run-epiphany-web-browser-in.html) | Works fine but the video is choppy | 14393\nGNUStep Terminal | gnustep-terminal | 3 | | displays bold as tiny | 17134.68\ngphoto2 | gphoto2 | 0 | | useless without USB | 17134.68\ngnuplot | gnuplot | 5 | [gnuplot](http://www.gnuplot.info/) | Fitting data and plotting/displaying graphs of functions working fine. The qt terminal throws the following error the first time it plots: `QStandardPaths: XDG_RUNTIME_DIR not set, defaulting to '/tmp/runtime-<username>' Warning: slow font initializationgnuplot> qt_processTermEvent received a GE_fontprops event. This should not have happened`, but works fine. Requires a x11 server to display plots. | 17134.228\ngolang | golang-go | 3 | [Golang](https://golang.org/dl/) | golang-go gets 1.6 which is not the latest version. Needs more testing | 15031 (Xenial)\ngparted | | 4 | [gparted.org](https://gparted.org/) | Window opens and can be interacted with, but it can't find any devices.\nThe GNU Privacy Guard | gpg | 4 | [gnupg.org](https://gnupg.org/) | See [#130](https://github.com/ethanhs/WSL-Programs/issues/130) | 17763.503\ngrep | | 4 | [wikipedia - grep](https://en.wikipedia.org/wiki/Grep) | __WARNING: PASSWORD MAY BE SHOWN IN PLAINTEXT__;requires more testing see [this issue](https://github.com/Microsoft/BashOnWindows/issues/450) for more.\nGSpdf | gnustep-gspdf | 5 | | | 17134.68\nGWorkspace | gnustep-gworkspace | 3 | | problems with fonts and icons, manageable | 17134.68\nhaxe | | 5 | [Haxe Foundation PPA](http://haxe.org/download/linux) | Compiles programs correctly, haxelib works fine too\nheroku | | 5 | [Heroku CLI](https://devcenter.heroku.com/articles/heroku-cli) | Installs and works as expected, tested app listing, logs, setting config\nhpx | | 5 | [ste||ar-hpx](https://stellar-group.org) | Installs and works as expected | 16299.125\nhtop | | 5 | [hisham.hm/htop](http://hisham.hm/htop/) |  Works as expected, though only lists processes running under WSL, not under Windows. CPU and Memory usage stats are accurate. | 16299.19\ni3 | | 4 | [i3wm.org](http://i3wm.org/) | Works fine under VcXsrv Server 1.19.2.0 without `-multiwindow` command line option. Added `export DISPLAY=:0` to `.bashrc` | 15063.138\nifconfig | | 4 | [wikipedia - ifconfig](https://en.wikipedia.org/wiki/Ifconfig) | Seems to work fine | 15063.138\nip | | 4 | [man ip](http://man7.org/linux/man-pages/man8/ip.8.html) | Seems to work fine | 15063.138\nircii | | 5 | [eterna.com.au/ircii](http://www.eterna.com.au/ircii/) | Seems to work Flawlessly\nirssi | | 5 | [irssi.org](https://irssi.org/) | Seems to work flawlessly\niwconfig | | 0 | [wiki.debian.org/iwconfig](https://wiki.debian.org/iwconfig) | Unable to Access Network Interfaces (Should be localhost for all connections)\njava 8 | | 2 | [oracle.com/java](http://oracle.com/java/) | Runs at minimum, seems to have some functionality at least\njava 7 | | 2 | [oracle.com/java](http://oracle.com/java/) | Seems to work well, if laggy.\nJupyter Notebook | | 5 | [jupyter.org](http://jupyter.org/) | Seems to work well. Requires a browser such as FireFox.\nk3b | k3b | 1 | | limited use without hardware access | 17134.68\nkakoune | | 5 | [kakoune.org](http://kakoune.org) | Works great, needs to be built from source\nkio_camera | kio-extras5 | 0 | | useless without USB | 17134.68\nkrita | krita | 0 | [krita.org](https://krita.org/en/) | Cannot connect to X server (tested with Xming). Further testing required.\nltrace | ltrace | 5 | | Seems to work Flawlessly\nlua | lua5.2 | 3 | [Lua](http://www.lua.org/start.html) | Just tested with interpreter. Needs more tests | 15031 (Xenial)\nlynx | | 5 | [lynx.invisible-island.net](http://lynx.invisible-island.net/) | seems to work entirely\nmount | | 2 | [man mount](http://man7.org/linux/man-pages/man8/mount.8.html) | unable to mount iso/cd-rom files\nMaude | | 4 | [maude.cs.uiuc.edu](http://maude.cs.uiuc.edu/) | Installed without issue, needs more testing\nmake | | 3 | [gnu.org/software/make](https://www.gnu.org/software/make/) | basic scripts working, needs more extensive testing. Tabbing for commands gets broken pipe\nMeteor | | 5 | [meteor.com](https://meteor.com) | Seems to work just fine. Can build and serve apps, create apps, and reads and writes to Windows and Linux | 16275\nMetasploit | | 4 | [metasploit.com](https://metasploit.com) | Seems to work as expected.\nMLton | | 0 | [mlton.org](http://mlton.org/) | BSOD | 14393\nMongo Client | | 4 | [docs.mongodb.com](https://docs.mongodb.com/getting-started/shell/client/) | Works well connecting to mongod windows service\nMono | mono-complete | 4 | [mono-project.com](http://www.mono-project.com/) | Supported ([more info](https://github.com/mono/website/issues/199)). Instructions added to official documentation. Use 4.2 for now or 4.6 when released (4.4 [has issues](https://bugzilla.xamarin.com/show_bug.cgi?id=42169))|\nMinecraft | | 0 | [mincraft.net](https://minecraft.net) | Crashes during boot with an error from OpenAL - [Known Issue](https://github.com/Microsoft/BashOnWindows/issues/1006)\nMinecraft Launcher | | 3 | [minecraft.net](https://minecraft.net) | Seems to work correctly, but is incredibly laggy.\nmysql | | 4 | [mysql.com](https://www.mysql.com/) | Seems to work flawlessly | 15063.138\nmtr | | 0 | [wikipedia - mtr](https://en.wikipedia.org/wiki/MTR_(software)) | doesn't run\nnano | | 4 | [nano-editor.org](https://www.nano-editor.org/) | Functions and displays correctly | 16299.19\nnasm | | 4 | [nasm.us](http://www.nasm.us/) | more testing needed\nnetcat | netcat-openbsd | 5 | | works as expected | 17134.68\nnethack | | 4 | [nethack.org](https://www.nethack.org/) | Need to run it from the /usr/games directory with \"./nethack\" and the default config it runs has numpad turned off so you have to use the unintuitive: y k u h l b j n\nnginx+ | | 4 | [ngix.com](https://www.nginx.com/) | Can't bind to IPv6 | 15063.138\nnmap | | 0 | [nmap.org](https://nmap.org/) | AF_Netsock options not implemented [#1349](https://github.com/Microsoft/BashOnWindows/issues/1349)\n[node.js](https://nodejs.org/en/) | nodejs | 4 | [nodejs.org](https://nodejs.org/en/) | Seems to work fine. Runs the React VR hello world project perfectly. | 15063.138\nnuget | | 3 | [nuget.org](https://www.nuget.org/) | requires more testing\nnpm | | 4 | [npmjs.com](https://www.npmjs.com/) | some packages fail due to permissions - Default version is VERY old.\nnvm | | 5 | [nvm](https://github.com/creationix/nvm) | Script to install newer versions of NPM and NodeJS.\nOCaml | | 4 | [ocaml.org](https://ocaml.org/) | Works fine with Core, needs more testing. | 15063.540\noctave | | 3 | [GNU Octave](https://www.gnu.org/software/octave/) | GUI opens with X11, command line calculations are fine, plotting has libgl errors\n[OpenCoarrays] | | 4 | [opencoarrays.org] | Installed from source but needs more testing. See [the OpenCoarrays install instructions] for more details |\nOpenFOAM | openfoam5 | 5 | [openfoam.org](https://openfoam.org/download/windows-10/) | Works well and comes with Paraview, which has working X11 GUI |\nOpenRCT2 | | 0 | [openrtc2.org](https://openrct2.org/) | Fails with errors to do with Sharing Memory with X, Possibly due to VcXsrv.\nosc | osc | 5 | | no problems | 17134.68\nping | | 5 | [man ping](http://man7.org/linux/man-pages/man8/ping.8.html) | Works fine\npip+ | | 0 | [pip.pypa.io](https://pip.pypa.io/en/stable/) | **DO NOT INSTALL** with `--fix-missing`. Breaks `apt`. See documentation\nphp5-cli | | 4 | [php.net/manual](http://php.net/manual/en/features.commandline.php) | Working, needs more testing\nphp7.0| | 4 | [php.net](http://php.net/) | Installed without issue, needs more testing\npostgresql | | 0 | | crashes on start-up after trying to read something from /proc | 14366\npython | | 5 | [python.org](https://www.python.org/) | Works even for very difficult and memory intensive workloads such as compiling PyPy | 14366\npypy | | 5 | [pypy.org](https://pypy.org/) | Works even when translating itself | 14366\nqpidd | | 0 | [man qpidd](https://linux.die.net/man/1/qpidd) | Starting the daemon fails with a socket error: \"critical Unexpected error: Can't bind to port 0.0.0.0:5672: Invalid argument (qpid/sys/posix/Socket.cpp:206)\"\nqtorrent | qtorrent | 0 | | unable to configure UPnP, may work if not behind NAT | 14366\nR | r-base  | 4 |  [r-project.org](https://www.r-project.org/) | devtools, doParallel and foreach works. May be numerically a little different from other system. More tests needed.  | 14393\nrbenv | | 4 | [rbenv/rbenv](https://github.com/rbenv/rbenv) | works for the most part, but permissions of folders are wrong after installing (world writable), spawning warnings when running e.g. Rubygems | 14366\nreboot | | 0 | [man reboot](http://man7.org/linux/man-pages/man2/reboot.2.html) | Unable to shutdown system.\nredis | | 4 | [Redis](https://redis.io/download) | Able to start server and interact with built-client. Did part of tutorial and worked great. | 15031 (Xenial)\nrmw | | 5 | [rmw](https://remove-to-waste.info/) | Remove to waste. Safely remove files to a trash folder from the cli.\nrsync | | 4 | [rsync.samba.org](https://rsync.samba.org/) | works with ssh tunneling and with same file system. Needs more testing\nruby | | 4 | [ruby-lang.org](https://www.ruby-lang.org/) | works for Sinatra and Rails development using C extension gems for the most part, but `rails new testapp` works with `WeBrick` (the default), but hangs with `thin` | 14986\nrustc | | 4 | [rust-lang.org](https://www.rust-lang.org/downloads.html) | Can compile basic programs. Needs testing with more complex programs | 14393.67\nSage Math | | 4 | [http://www.sagemath.org/](http://www.sagemath.org/) | Able to do a good portion of the Sage Math tutorial. There is a RunTime warning but does not stop Sage from working | 15031\nscp | | 5 | [man scp](http://man7.org/linux/man-pages/man1/scp.1.html) | works for both remote to local and local to remote transfers.\nscreen | | 4 | [gnu.org/software/screen](https://www.gnu.org/software/screen/) | Already installed. [Simple fix needed.](https://www.systutorials.com/qa/1639/screen-reporting-cannot-directory-screen-permission-denied?show=1640#a1640) | 15063 (Xenial)\nseamonkey | | 4 | | see firefox | 17134.68\nsed | | 4 | [gnu.org/software/sed](https://www.gnu.org/software/sed/) | didn't test all options, but everything I tested worked fine.\nsingularity | | 0 | [singularity](https://singularity.lbl.gov) | doesn't run / can not make mountspace\nSMLNJ | | 0 | [smlnj.org](http://www.smlnj.org/) | Installed. Will not start correctly. | 14393\nSNMP Tools | snmp | 5 | [www.net-snmp.org](http://www.net-snmp.org) | Seems to work fine | 15063.138\nsqlite | | 4 | [sqlite.org](https://www.sqlite.org/) | [File locking is broken](https://github.com/Microsoft/BashOnWindows/issues/2395), which can lead to database corruption\nssh | | 5 | [wikipedia - ssh](https://en.wikipedia.org/wiki/Secure_Shell) | ssh works as expected\nssh-keygen | ssh | 4 | [man ssh-keygen](http://man7.org/linux/man-pages/man1/ssh-keygen.1.html) | -t rsa working\nstrace | strace | 5 | | Seems to work Flawlessly\nsudo | | 5 | [wikipedia - sudo](https://en.wikipedia.org/wiki/Sudo) | appears to be working as expected | 16299.19\nSWI-Prolog | | 4 | [swi-prolog.org](http://www.swi-prolog.org/) | Installed without issue, needs more testing. See: [(Installing from PPA (Ubuntu Personal Package Archive))](http://www.swi-prolog.org/build/PPA.txt) | 14393\nswift | | 3 | [developer.apple.com/swift](https://developer.apple.com/swift/) | Everything except interactive shell works\nsystemd | | 0 | useless, invoke rc scripts instead | | 17134.68\ntail | | 3 | [man tail](http://man7.org/linux/man-pages/man1/tail.1.html) | Will tail files, but 'follow' (-f) reports \"tail: unrecognized file system type 0x53464846\"\ntea | | 4 | http://semiletov.org | desktop icon missing | 17134.68\ntcc | | 3 | [bellard.org/tcc](https://bellard.org/tcc/) | tcc run and scripted \"#!/usr/bin/tcc -run\" files work correctly\ntelnet | | 4 | [wikipedia - telnet](https://en.wikipedia.org/wiki/Telnet) | Further testing required\ntensorflow | | 4 | [tensorflow/tensorflow](https://github.com/tensorflow/tensorflow) | See [Scott Hanselman's post](http://www.hanselman.com/blog/PlayingWithTensorFlowOnWindows.aspx)\nterminator | | 4 | | Multi-terminal emulator. Tested using VcXsvr. | 16299.551\ntesseract-ocr | | 4 | [tesseract-ocr/tesseract](https://github.com/tesseract-ocr/tesseract) | No problems with command line usage\ntexlive | | 5 | [tug.org/texlive](https://www.tug.org/texlive/) | No problems so far | 14366\ntmux | | 4 | [tmux/tmux](https://github.com/tmux/tmux) | Works well for the most part, mouse mode doesn't seem to work  | 14366\ntorproject | tor | 5 | [torproject.org](https://www.torproject.org/) | Tor is a free software that prevents people from learning your location or browsing habits by letting you communicate anonymously on the Internet. | 14393\nufw | | 0 | [help.ubuntu.com/community/UFW](https://help.ubuntu.com/community/UFW) | Fails with an error about iptables | 15063.138\nupx | | 1 | [https://upx.github.io/](https://upx.github.io/) | Can't run upx within WSL, but can run ELF binaries compressed with upx, see https://github.com/upx/upx/issues/201 | 18362.113\nuseradd | | 4 | [man useradd](http://man7.org/linux/man-pages/man8/useradd.8.html) | Users can be added but /etc/skel profile logout and bashrc files but no default directories\nusermod | | 5 | [man usermod](http://man7.org/linux/man-pages/man8/usermod.8.html) | Seems to work correctly\nvim+ | | 3 | [vim/vim](https://github.com/vim/vim) | Will open and edit Window files it cannot create new files. Can create new linux files. Issues with colorschemes. Plugins don't work. Panes, buffers, and registers appear to be working correctly.\nVisual Studio Code | code && code-insider | 5 | [Visual Studio Code](https://code.visualstudio.com) | Will install, but does not launch due to issues relating to Google Chrome with WSL. See: [#758](https://github.com/Microsoft/BashOnWindows/issues/758) Update: [#2760](https://github.com/microsoft/WSL/issues/2760). Redundant, due to the release of VSCode Remote Development (https://code.visualstudio.com/docs/remote/remote-overview) | 16275\nvncserver | | 4 | | no sound (did not try too hard) | 17134.68\nvsftpd | | 3 | ? | Not installed with apt\nwget | | 3 | | Simple commands work. Have only run basic commands\nwireshark | | 5 | [wireshark](https://www.wireshark.org) | Works just as expected\nWindowMaker | | 5 | | default window manager for Xrdp | 17134.68\nxfce4-terminal | | 5 | | Seems to work Perfectly | 15063\nstartxfce4 (and all subsequent programs) | | 5 | | Everything seems to work, I didn't find anything wrong with it. | 15063\nxorg | | 4 | | As Xrdp or Xvnc | 17134.68\nxrdp | xrdp | 3 | | due to failing systemd, sesman must be started by hand; the default init script does not work | | 17134.68\nxterm | xterm | 4 | | insufficiently tested | | 17134.68\nyarn | | 3 | [yarnpkg.com](https://yarnpkg.com/lang/en/) | Works mostly fine. Sometimes really slow due to Windows Defender (whitelisting helps). Global package installations are not always working properly. [wsl performance problems](https://github.com/Microsoft/WSL/issues/1932) [yarn issue](https://github.com/yarnpkg/yarn/issues/990)\nYaST | yast2 | 4 | | No icons, otherwise OK | 17134.68\nyum | | 0 | | doesn't work at all. will segfault on `yum`, hangs indefinitely with `yum install`\nyoutube-dl | | 5 | | Works Perfectly\nZipper | gnustep-zipper | 5 | | | 17134.68\nzsh | | 4 | | Simple commands work after getting listed WSL build, also checked oh-my-zsh | 14393\n\n[the OpenCoarrays install instructions]: https://github.com/sourceryinstitute/opencoarrays/blob/master/INSTALL.md#windows\n[OpenCoarrays]: https://github.com/sourceryinstitute/opencoarrays\n[opencoarrays.org]: http://opencoarrays.org\n"
        },
        {
          "name": "_config.yml",
          "type": "blob",
          "size": 0.181640625,
          "content": "title: WSL Programs\ndescription: A community powered list of programs that work (and those that don't) on the Windows subsystem for Linux\nshow_downloads: false\ngoogle_analytics:\ntheme: \n"
        },
        {
          "name": "_layouts",
          "type": "tree",
          "content": null
        },
        {
          "name": "_sass",
          "type": "tree",
          "content": null
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "jekyll-theme-slate.gemspec",
          "type": "blob",
          "size": 0.63671875,
          "content": "# encoding: utf-8\n\nGem::Specification.new do |s|\n  s.name          = \"jekyll-theme-slate\"\n  s.version       = \"0.0.3\"\n  s.license       = \"CC0-1.0\"\n  s.authors       = [\"Jason Costello\", \"GitHub, Inc.\"]\n  s.email         = [\"opensource+jekyll-theme-slate@github.com\"]\n  s.homepage      = \"https://github.com/pages-themes/slate\"\n  s.summary       = \"Slate is a Jekyll theme for GitHub Pages\"\n\n  s.files         = `git ls-files -z`.split(\"\\x0\").select do |f|\n    f.match(%r{^((_includes|_layouts|_sass|assets)/|(LICENSE|README)((\\.(txt|md|markdown)|$)))}i)\n  end\n\n  s.platform      = Gem::Platform::RUBY\n  s.add_runtime_dependency \"jekyll\", \"~> 3.3\"\nend\n"
        },
        {
          "name": "script",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}