{
  "metadata": {
    "timestamp": 1736711691855,
    "page": 384,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "guari/eclipse-ui-theme",
      "stars": 1155,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.4716796875,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n\n# Custom for Visual Studio\n*.cs     diff=csharp\n*.sln    merge=union\n*.csproj merge=union\n*.vbproj merge=union\n*.fsproj merge=union\n*.dbproj merge=union\n\n# Standard to msysgit\n*.doc\t diff=astextplain\n*.DOC\t diff=astextplain\n*.docx diff=astextplain\n*.DOCX diff=astextplain\n*.dot  diff=astextplain\n*.DOT  diff=astextplain\n*.pdf  diff=astextplain\n*.PDF\t diff=astextplain\n*.rtf\t diff=astextplain\n*.RTF\t diff=astextplain\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.015625,
          "content": ".DS_Store\ntarget"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.0439453125,
          "content": "language: java\n\nnotifications:\n  email: false"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 10.9853515625,
          "content": "Eclipse Public License - v 1.0\n\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and documentation distributed under this Agreement, and\nb) in the case of each subsequent Contributor:\n\ni) changes to the Program, and\n\nii) additions to the Program;\n\nwhere such changes and/or additions to the Program originate from and are distributed by that particular Contributor. A Contribution 'originates' from a Contributor if it was added to the Program by such Contributor itself or anyone acting on such Contributor's behalf. Contributions do not include additions to the Program which: (i) are separate modules of software distributed in conjunction with the Program under their own license agreement, and (ii) are not derivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents \" mean patent claims licensable by a Contributor which are necessarily infringed by the use or sale of its Contribution alone or when combined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement, including all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, distribute and sublicense the Contribution of such Contributor, if any, and such derivative works, in source code and object code form.\n\nb) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use, sell, offer to sell, import and otherwise transfer the Contribution of such Contributor, if any, in source code and object code form. This patent license shall apply to the combination of the Contribution and the Program if, at the time the Contribution is added by the Contributor, such addition of the Contribution causes such combination to be covered by the Licensed Patents. The patent license shall not apply to any other combinations which include the Contribution. No hardware per se is licensed hereunder.\n\nc) Recipient understands that although each Contributor grants the licenses to its Contributions set forth herein, no assurances are provided by any Contributor that the Program does not infringe the patent or other intellectual property rights of any other entity. Each Contributor disclaims any liability to Recipient for claims brought by any other entity based on infringement of intellectual property rights or otherwise. As a condition to exercising the rights and licenses granted hereunder, each Recipient hereby assumes sole responsibility to secure any other intellectual property rights needed, if any. For example, if a third party patent license is required to allow Recipient to distribute the Program, it is Recipient's responsibility to acquire that license before distributing the Program.\n\nd) Each Contributor represents that to its knowledge it has sufficient copyright rights in its Contribution, if any, to grant the copyright license set forth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under its own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\n\nb) its license agreement:\n\ni) effectively disclaims on behalf of all Contributors all warranties and conditions, express and implied, including warranties or conditions of title and non-infringement, and implied warranties or conditions of merchantability and fitness for a particular purpose;\n\nii) effectively excludes on behalf of all Contributors all liability for damages, including direct, indirect, special, incidental and consequential damages, such as lost profits;\n\niii) states that any provisions which differ from this Agreement are offered by that Contributor alone and not by any other party; and\n\niv) states that source code for the Program is available from such Contributor, and informs licensees how to obtain it in a reasonable manner on or through a medium customarily used for software exchange.\n\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\n\nb) a copy of this Agreement must be included with each copy of the Program.\n\nContributors may not remove or alter any copyright notices contained within the Program.\n\nEach Contributor must identify itself as the originator of its Contribution, if any, in a manner that reasonably allows subsequent Recipients to identify the originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with respect to end users, business partners and the like. While this license is intended to facilitate the commercial use of the Program, the Contributor who includes the Program in a commercial product offering should do so in a manner which does not create potential liability for other Contributors. Therefore, if a Contributor includes the Program in a commercial product offering, such Contributor (\"Commercial Contributor\") hereby agrees to defend and indemnify every other Contributor (\"Indemnified Contributor\") against any losses, damages and costs (collectively \"Losses\") arising from claims, lawsuits and other legal actions brought by a third party against the Indemnified Contributor to the extent caused by the acts or omissions of such Commercial Contributor in connection with its distribution of the Program in a commercial product offering. The obligations in this section do not apply to any claims or Losses relating to any actual or alleged intellectual property infringement. In order to qualify, an Indemnified Contributor must: a) promptly notify the Commercial Contributor in writing of such claim, and b) allow the Commercial Contributor to control, and cooperate with the Commercial Contributor in, the defense and any related settlement negotiations. The Indemnified Contributor may participate in any such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial product offering, Product X. That Contributor is then a Commercial Contributor. If that Commercial Contributor then makes performance claims, or offers warranties related to Product X, those performance claims and warranties are such Commercial Contributor's responsibility alone. Under this section, the Commercial Contributor would have to defend claims against the other Contributors related to those performance claims and warranties, and if a court requires any other Contributor to pay any damages as a result, the Commercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible for determining the appropriateness of using and distributing the Program and assumes all risks associated with its exercise of rights under this Agreement , including but not limited to the risks and costs of program errors, compliance with applicable laws, damage to or loss of data, programs or equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement, and without further action by the parties hereto, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Program itself (excluding combinations of the Program with other software or hardware) infringes such Recipient's patent(s), then such Recipient's rights granted under Section 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to comply with any of the material terms or conditions of this Agreement and does not cure such failure in a reasonable period of time after becoming aware of such noncompliance. If all Recipient's rights under this Agreement terminate, Recipient agrees to cease use and distribution of the Program as soon as reasonably practicable. However, Recipient's obligations under this Agreement and any licenses granted by Recipient relating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in order to avoid inconsistency the Agreement is copyrighted and may only be modified in the following manner. The Agreement Steward reserves the right to publish new versions (including revisions) of this Agreement from time to time. No one other than the Agreement Steward has the right to modify this Agreement. The Eclipse Foundation is the initial Agreement Steward. The Eclipse Foundation may assign the responsibility to serve as the Agreement Steward to a suitable separate entity. Each new version of the Agreement will be given a distinguishing version number. The Program (including Contributions) may always be distributed subject to the version of the Agreement under which it was received. In addition, after a new version of the Agreement is published, Contributor may elect to distribute the Program (including its Contributions) under the new version. Except as expressly stated in Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to the intellectual property of any Contributor under this Agreement, whether expressly, by implication, estoppel or otherwise. All rights in the Program not expressly granted under this Agreement are reserved.\n\nThis Agreement is governed by the laws of the State of New York and the intellectual property laws of the United States of America. No party to this Agreement will bring a legal action under this Agreement more than one year after the cause of action arose. Each party waives its rights to a jury trial in any resulting litigation.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.3095703125,
          "content": "MoonRise UI Theme\n=================\n\n[![Flattr this git repo](http://api.flattr.com/button/flattr-badge-large.png)](https://flattr.com/submit/auto?user_id=guari&url=http://github.com/guari/eclipse-ui-theme&title=EclipseUITheme&language=&tags=github&category=software)\n[![Build Status](https://secure.travis-ci.org/guari/eclipse-ui-theme.png)](http://travis-ci.org/guari/eclipse-ui-theme)\n\nAn early version of a dark UI theme for Eclipse 4+.\n\n![screenshot](https://raw.github.com/guari/eclipse-ui-theme/master/com.github.eclipseuitheme.themes.plugin/screenshot/screenshot-ubuntu_v0.8.2.png)\n![screenshot](https://raw.github.com/guari/eclipse-ui-theme/master/com.github.eclipseuitheme.themes.plugin/screenshot/screenshot-windows_v0.8.2.png)\n\nRequirements\n------------\n\n* Eclipse 4.2+\n\nInstallation\n------------\n\n* #### Eclipse Marketplace:\n<table style=\"border: none;\">\n  <tbody>\n    <tr style=\"border:none;\">\n      <td style=\"vertical-align: middle; padding-top: 10px; border: none;\">\n        <a href=\"http://marketplace.eclipse.org/marketplace-client-intro?mpc_install=1403812\" title=\"Drag and drop into a running Eclipse Indigo workspace to install Eclipse Moonrise UI Theme\">\n          <img src=\"http://marketplace.eclipse.org/sites/all/modules/custom/marketplace/images/installbutton.png\"/>\n        </a>\n      </td>\n      <td style=\"vertical-align: middle; text-align: left; border: none;\">\n        ← Drag this button to your Eclipse workbench to install;\n      </td>\n    </tr>\n  </tbody>\n</table>\n\n* #### Update site:\nOr download this plugin by using ```Help > Install New Software...``` and add the update site:\n<pre>https://raw.github.com/guari/eclipse-ui-theme/master/com.github.eclipseuitheme.themes.updatesite</pre>\n\n* #### Manual:\nOr download [moonrise_0.8.9.jar](https://github.com/guari/eclipse-ui-theme/blob/master/com.github.eclipseuitheme.themes.plugin/bin/com.github.eclipseuitheme.moonrise_0.8.9.jar?raw=true) package and put it into your Eclipse ```\\dropins\\plugins\\``` folder;\n\n* Restart Eclipse and go to ```Window > Preferences > General > Appearance```;\n\n* Select *MoonRise (standalone)* or, for a little better tabs decoration, install *Eclipse 4 Chrome Theme* from marketplace or from [here](https://github.com/jeeeyul/eclipse-themes) and select *MoonRise*;\n\n* Rest your eyes ;)\n\n- - -\n### Syntax highlighting scheme (optional):\n\n![screenshot](https://raw.github.com/guari/eclipse-ui-theme/master/com.github.eclipseuitheme.themes.plugin/screenshot/sources_syntax_colors.png)\n\nYou can find the one used in the screenshot below:\n\n**WARNING:** Take a backup of your preferences before importing so you can safely restore them if you need (```File > Export...``` then select ```General > Preferences```);\n\n* [RainbowDrops.epf](https://github.com/guari/eclipse-ui-theme/blob/master/com.github.eclipseuitheme.themes.plugin/bin/color-scheme/RainbowDrops.epf?raw=true) (most accurate and recommended, download by right-clicking the link and selecting ```Save link as...``` then import it with Eclipse built-in Preferences import: ```File > Import...``` then select ```General > Preferences```);\n\n* or [RainbowDrops.xml](https://github.com/guari/eclipse-ui-theme/blob/master/com.github.eclipseuitheme.themes.plugin/bin/color-scheme/RainbowDrops.xml?raw=true) (download by right-clicking the link and selecting ```Save link as...``` then import it with [Eclipse Color Theme Plugin](http://eclipsecolorthemes.org/?view=plugin));\n\n* or [here](http://eclipsecolorthemes.org/?view=theme&id=24587);\n\n**NOTE:** Syntax highlighting settings and UI theme are separated, you can import your own scheme or customize it in Eclipse Preferences if you like.\n\n**EditBox support:** Use newer [Nodeclipse EditBox](https://github.com/Nodeclipse/EditBox) with RainbowDrops.eb included \nor download [RainbowDrops.eb](https://github.com/guari/eclipse-ui-theme/blob/master/com.github.eclipseuitheme.themes.plugin/bin/color-scheme/RainbowDrops.eb?raw=true) (by right-clicking the link and selecting ```Save link as...```), then import it with [Eclipse EditBox Plugin](http://editbox.sourceforge.net/).\n\n- - -\n### Fine-tuning:\n\nThere are some settings that can be changed only from the Eclipse Preferences window and that override the theme's settings by default:\n\n* ##### Change the colors for Content Assist:\nGo to ```Window > Preferences > General > Appearance > Colors and Fonts``` then change the colors for ```Basic > Content Assist background color``` and ```Basic > Content Assist foreground color```\n(eg. *foreground color: #DDD*, *background color: #333*);\n\n* ##### Change the colors for Console:\nGo to ```Window > Preferences > Run/Debug > Console``` and modify the colors as you like\n(eg. *Standard Out text color: #DDD*, *Background color: #333*);\n\n* ##### Change the colors for Javadoc:\nGo to ```Window > Preferences > General > Appearance > Colors and Fonts``` then change the colors for ```Java > Javadoc view background```.\nNote that the foreground color cannot be changed and depends on system font color.\n\n- - -\n### Trouble-shooting:\n\n| Problem | Solution |\n| ------- | -------- |\n| The font of the title of the tabs is different | Ensure that on your machine is installed ```Segoe Print``` font then open the downloaded jar package with an archive explorer, open ```/themes/css/moonrise-ui-standalone.css```, search for any occurrencies of ```font-family``` property and change its value to ```Segoe Print``` (or what ever you prefer), then save/update the jar archive. |\n| The size of the title of the tabs is different | Eclipse does not scale it with a DPI-Aware policy. Open the downloaded jar package with an archive explorer, open ```/themes/css/moonrise-ui-standalone.css```, search for ```font-size``` property and modify its value according to your needs then save the file. |\n| The label of the checkboxes has a color difficult to read (WIN) | It's related to a SWT bug, use a system theme that has lighter font color for buttons. |\n| The text of the buttons and other widgets have a color difficult to read (GTK) | It's due to the state of SWT porting on GTK3. Start Eclipse with this flag: ```export SWT_GTK3=0``` |\n| The text of the buttons has a color difficult to read (OSX) | It's related to a SWT bug, try [this](https://github.com/guari/eclipse-ui-theme/blob/master/com.github.eclipseuitheme.themes/bin/com.github.eclipseuitheme.moonrise_0.8.3_OSX.jar?raw=true) 'patched' version if you have this issue (no more needed for v0.8.4+). |\n| After updating the plugin, it isn't loaded as expected | Eclipse seems to use some sorts of internal resources caching that don't work always very well. To ensure that it's not an issue related to the new plugin version, create a new workspace and import your projects here, or try with a freshly downloaded Eclipse release |\n\n- - -\n### Notes:\n\nCurrently this theme uses the CSS-SWT engine introduced in the 4.2 version of the Eclipse Platform and should provide a dark style for each GUI widget that can be handled with the last version of the Eclipse SDK.\nThis plugin has been tested with the main Eclipse Development Tool packages on Linux distributions, Windows and OSX and with the following Eclipse releases:\n\n* Luna (4.4)\n* Kepler (4.3)\n* Juno (4.2.x)\n\nIt works best with a dark system theme since currently the look of some GUI widgets cannot be overriden directly in Eclipse. The more noticeable issues related to SWT are the `ScrollBar` widgets, the `Table` headers/lines and the arrows to fold/unfold contents that cannot be styled. As minor issues there are `Button` background color on Windows and OSX that cannot be customized (on Windows checkboxes/radio controls do not inherit font color) and some other little bugs related to the CSS engine that makes the customizations harder and unwieldy.\nAside from that, the theme currently might not look perfect on each platform, but should be fully useable on all of them. The Eclipse CSS engine is still under improvement.\n\nDebugging and improvements\n--------------------------\n\nA fork of this plugin has been merged with the main Eclipse platform, you should find it pre-installed in the future Eclipse builds. If you want to contribute to its development you can send me a pull request on this repository or commits a patch to the main Eclipse [repository](http://git.eclipse.org/c/platform/eclipse.platform.ui.git/tree/bundles/org.eclipse.ui.themes).\nIf you found an issue linked to this plugin but that is related to the Eclipse/SWT engine you can report it to [Bugzilla](https://bugs.eclipse.org/bugs/buglist.cgi?component=UI&product=Platform&resolution=---) then add a link of it to this README by sending a pull request. The following Eclipse bugs are affecting this plugin, you can vote for it to gain more visibility from Eclipse platform developers:\n* *Solved* [Bug 423744 - Importing a local resource throws a MalformedURLException](https://bugs.eclipse.org/bugs/show_bug.cgi?id=423744);\n* *Solved* [Bug 419016 - Provide some reasonable bridge interactions between CSS and our older Colors and Fonts properties](https://bugs.eclipse.org/bugs/show_bug.cgi?id=419016);\n* [Bug 425646 - Support for black and inverted color UI themes](https://bugs.eclipse.org/bugs/show_bug.cgi?id=425646);\n* [Bug 419482 - Cascading policy used to apply rules is broken](https://bugs.eclipse.org/bugs/show_bug.cgi?id=419482);\n* [Bug 396780 - CTabRendering doesn't draw bottom tabs correctly](https://bugs.eclipse.org/bugs/show_bug.cgi?id=396780);\n* [Bug 384906 - Allow styling of table headers via CSS](https://bugs.eclipse.org/bugs/show_bug.cgi?id=384906);\n* [Bug 264531 - Provide css styling for SWT menu bar](https://bugs.eclipse.org/bugs/show_bug.cgi?id=264531);\n* [Bug 401015 - Add support for styling hyperlinks in Links](https://bugs.eclipse.org/bugs/show_bug.cgi?id=401015);\n* [Bug 419377 - Setting a property to 'inherit' fires an IllegalStateException](https://bugs.eclipse.org/bugs/show_bug.cgi?id=419377);\n\nUse *CSS Spy* to inspect widgets properties and *CSS Scratchpad* or *Lightweight CSS Editor* to apply a quick customization. To test what elements can be modified or not with CSS, drop a line like this one: `* { background-color:red; color:white; }` into *CSS Scratchpad* (restart Eclipse to reset the theme).\n\n## Build and Release\n\n* #### Manually:\n  * Go to ```File > Export...``` then select ```Plug-in Development > Deployable plug-ins and fragments``` and set the output directory to get your plugin .jar;\n  * Open ```site.xml``` with Eclipse Editor (Site Map Tab) then press *Build All* button to refresh the update-site packages;\n\n* #### Build with Maven/Tycho:\n\n        mvn package\n\n  resulted p2 repository arrives in `com.github.eclipseuitheme.themes.updatesite\\target`.\n\n  Before release:\n\n        mvn -Dtycho.mode=maven org.eclipse.tycho:tycho-versions-plugin:set-version -DnewVersion=0.10.0-SNAPSHOT\n\n  then update versions in `category.xml` (keep `site.xml` and `categories.xml` the same).\n\n#### Old plugin releases:\nThe packages previously uploaded can be found into ```/com.github.eclipseuitheme.themes.plugin/bin/``` folder.\n\nReferences\n----------\n\n* http://wiki.eclipse.org/E4\n* http://wiki.eclipse.org/Eclipse4/RCP/CSS\n* http://wiki.eclipse.org/E4/CSS/SWT_Mapping\n* http://www.vogella.com/articles/Eclipse4CSS/article.html\n\nLicense\n-------\n\nCopyright (c) 2012-2014\n\nThis is open source software, licensed under the Eclipse Public License. See the file COPYING for details.\n\n\n\n\n<a href=\"http://with-eclipse.github.io/\" target=\"_blank\"><img alt=\"with-Eclipse logo\" src=\"http://with-eclipse.github.io/with-eclipse-1.jpg\" /></a>\n"
        },
        {
          "name": "com.github.eclipseuitheme.themes.feature",
          "type": "tree",
          "content": null
        },
        {
          "name": "com.github.eclipseuitheme.themes.plugin",
          "type": "tree",
          "content": null
        },
        {
          "name": "com.github.eclipseuitheme.themes.updatesite",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 2.818359375,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project>\n    <modelVersion>4.0.0</modelVersion>\n    <groupId>com.github.eclipseuitheme.themes</groupId>\n    <artifactId>com.github.eclipseuitheme.themes.parent</artifactId>\n    <version>0.8.9-SNAPSHOT</version>\n    <packaging>pom</packaging>\n    <name>Eclipse Moonrise UI Theme</name>\n\n\t<developers>\n\t\t<developer>\n\t\t\t<id>guari</id>\n\t\t\t<name>Andrea Guarinoni</name>\n\t\t\t<email></email>\n\t\t\t<organization></organization>\n\t\t\t<roles>\n\t\t\t\t<role>Lead Developer</role>\n\t\t\t</roles>\n\t\t\t<timezone>+1</timezone>\n\t\t</developer>\n\t</developers>\n\t<contributors>\n\t\t<contributor>\n\t\t\t<name>Paul Verest</name>\n\t\t\t<organization>Nodeclipse organization</organization>\n\t\t\t<organizationUrl>http://www.nodeclipse.org/</organizationUrl>\n\t\t\t<timezone>+8</timezone>\n\t\t</contributor>\n\t</contributors>\n\n\t<prerequisites>\n\t\t<maven>3.0</maven>\n\t</prerequisites>\n\n\t<properties>\n\t\t<tycho-version>0.19.0</tycho-version>\n\n\t\t<!-- PROJECT SETTINGS -->\n\t\t<project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n\t\t<project.reporting.outputEncoding>UTF-8</project.reporting.outputEncoding>\n\t</properties>\n\n    <modules>\n            <module>com.github.eclipseuitheme.themes.plugin</module>\n            <module>com.github.eclipseuitheme.themes.feature</module>\n            <module>com.github.eclipseuitheme.themes.updatesite</module>\n    </modules>\n\n    <repositories>\n            <repository>\n                    <id>juno</id>\n                    <url>http://download.eclipse.org/releases/juno/</url>\n                    <layout>p2</layout>\n            </repository>\n    </repositories>\n\n\t<build>\n\t\t<plugins>\n\t\t\t<plugin>\n\t\t\t\t<groupId>org.eclipse.tycho</groupId>\n\t\t\t\t<artifactId>tycho-maven-plugin</artifactId>\n\t\t\t\t<version>${tycho-version}</version>\n\t\t\t\t<extensions>true</extensions>\n\t\t\t</plugin>\n\t\t\t<plugin>\n\t\t\t\t<groupId>org.eclipse.tycho</groupId>\n\t\t\t\t<artifactId>tycho-compiler-plugin</artifactId>\n\t\t\t\t<version>${tycho-version}</version>\n\t\t\t\t<configuration>\n\t\t\t\t\t<source>1.6</source>\n\t\t\t\t\t<target>1.6</target>\n\t\t\t\t</configuration>\n\t\t\t</plugin>\n\t\t\t<plugin>\n\t\t\t\t<groupId>org.eclipse.tycho</groupId>\n\t\t\t\t<artifactId>target-platform-configuration</artifactId>\n\t\t\t\t<version>${tycho-version}</version>\n\t\t\t\t<configuration>\n\t\t\t\t\t<environments>\n\t\t\t\t\t\t<environment>\n\t\t\t\t\t\t\t<os>linux</os>\n\t\t\t\t\t\t\t<ws>gtk</ws>\n\t\t\t\t\t\t\t<arch>x86</arch>\n\t\t\t\t\t\t</environment>\n\t\t\t\t\t\t<environment>\n\t\t\t\t\t\t\t<os>linux</os>\n\t\t\t\t\t\t\t<ws>gtk</ws>\n\t\t\t\t\t\t\t<arch>x86_64</arch>\n\t\t\t\t\t\t</environment>\n\t\t\t\t\t\t<environment>\n\t\t\t\t\t\t\t<os>win32</os>\n\t\t\t\t\t\t\t<ws>win32</ws>\n\t\t\t\t\t\t\t<arch>x86</arch>\n\t\t\t\t\t\t</environment>\n\t\t\t\t\t\t<environment>\n\t\t\t\t\t\t\t<os>win32</os>\n\t\t\t\t\t\t\t<ws>win32</ws>\n\t\t\t\t\t\t\t<arch>x86_64</arch>\n\t\t\t\t\t\t</environment>\n\t\t\t\t\t\t<environment>\n\t\t\t\t\t\t\t<os>macosx</os>\n\t\t\t\t\t\t\t<ws>cocoa</ws>\n\t\t\t\t\t\t\t<arch>x86_64</arch>\n\t\t\t\t\t\t</environment>\n\t\t\t\t\t</environments>\n\t\t\t\t</configuration>\n\t\t\t</plugin>\n\t\t</plugins>\n\t</build>\n\n</project>"
        }
      ]
    }
  ]
}