{
  "metadata": {
    "timestamp": 1736711580079,
    "page": 142,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "LukeSmithxyz/based.cooking",
      "stars": 2221,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.15234375,
          "content": "/themes/\n\n# Generated files by hugo\n/public/\n/resources/_gen/\n/assets/jsconfig.json\nhugo_stats.json\n\n# Temporary lock file while building\n/.hugo_build.lock\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.1826171875,
          "content": "This is free and unencumbered software released into the public domain.\n\nAnyone is free to copy, modify, publish, use, compile, sell, or\ndistribute this software, either in source code form or as a compiled\nbinary, for any purpose, commercial or non-commercial, and by any\nmeans.\n\nIn jurisdictions that recognize copyright laws, the author or authors\nof this software dedicate any and all copyright interest in the\nsoftware to the public domain. We make this dedication for the benefit\nof the public at large and to the detriment of our heirs and\nsuccessors. We intend this dedication to be an overt act of\nrelinquishment in perpetuity of all present and future rights to this\nsoftware under copyright law.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR\nOTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\nOTHER DEALINGS IN THE SOFTWARE.\n\nFor more information, please refer to <https://unlicense.org>\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.3515625,
          "content": "# Based Cooking Website\n\n[https://based.cooking](https://based.cooking)\n\nThis is a simple cooking website where users can submit recipes here for credit.\nThere are no ads, trackers or cookies (unless recipes thereof).\n\nThis site is compiled and organized with Hugo, using [this very simple theme](https://github.com/lukesmithxyz/lugo).\n\n## Ways to contribute\n\n- By adding a recipe.\n- Make a recipe and take a nice picture of it if no nice picture already\n  exists. Submitted images should be small `.webp` files ideally less than 100K\n  or so.\n- Fix errors in recipes or add minor improvements.\n\n## Rules for submission\n\n- Model submission files after [example.md](example.md). Put them in `content/`.\n- File names should be the name of the dish with words separated by hyphens\n  (`-`). Not underscores, and definitely not spaces.\n- Recipe must be \"based,\" i.e. good traditional and substantial food. Nothing\n  ironic, meme-tier hyper-sugary, meat-substitute, etc.\n- Don't include salt and pepper and other ubiquitous things in the ingredients\n  list.\n- Don't include an image unless (1) you took it yourself, and more importantly\n  (2), **it actually looks good**! Most existing images on this site IMO look\n  like unappetizing NEET photos, so you are welcome to take one a better one\n  yourself and submit it if you make a dish. If you don't know if your image is\n  good, please have a real-live woman in real life approve your photo before\n  you submit it. I'm serious about this, it's a waste for me to wade through\n  disgusting photos in PRs.\n- The file needs to be `\\n` terminated in unix-fashion (if you're on Linux you\n  don't need to care, it should be automatic).\n\n**If you fail to do these things, I will close your submission and you will have to resubmit. I am tired of having to fix more than 50% of submissions.**\n\nYou may include a json file with your personal links/donation addresses in\n`data/authors/your-name.json`. See mine (`data/authors/luke-smith.json`) for a\nmodel. You can include: `website`, `donate` (general donation link), `email` or\ncrypto addresses as `btc`, `xmr` and `eth`.\n\n### Tags\n\nRemember to add tags to your recipe, but try to use tags already used by other recipes.\n\nIf your recipe contains no meat or dairy, include the `fasting` tag.\nIf it includes dairy but no milk, include the `cheesefare` tag.\n\n### Images\n\nImages are stored in `/pix`.\n\nEach recipe can have a title image at the top and perhaps several instructional\nimages as absolutely necessary.\n\nDo not add stock images you found on the internet. Take a good picture yourself\nof the actual dish created. If you see a bad or substandard image, you may\nsubmit a better one.\n\nImages should be in `.webp` format and with as small file size as possible. If\nyou submit an image for say, `chicken-parmesan.md`, it should be added as\n`pix/chicken-parmesan.webp`.\n\nIf you would like to add additional directional images,\nthey should be numbered with two digits like: `pix/chicken-parmesan-01.webp`, etc.\n\nNote also that images should have links beginning with a slash in this use\ncase, i.e. `/pix/...`.\n\n## License\n\nThis website and all its content is in the public domain.\nBy submitting text or images or anything else to this repository,\nyou waive any pretense of ownership to it,\nalthough you are welcome and recommended to give yourself credit\nat the bottom of a submitted page for you adding it\n(including personal or donation links).\n"
        },
        {
          "name": "archetypes",
          "type": "tree",
          "content": null
        },
        {
          "name": "config.toml",
          "type": "blob",
          "size": 0.2744140625,
          "content": "baseURL = 'https://based.cooking/'\nlanguageCode = 'en-us'\ntitle = 'Based Cooking'\ntheme = 'lugo'\n\n[params]\n  favicon = \"/favicon.svg\"\n  stylesheet = \"/style.css\"\n  indexarticles = 50\n  taglist = true\n\n[markup]\n  [markup.goldmark]\n    [markup.goldmark.renderer]\n      unsafe = true\n"
        },
        {
          "name": "content",
          "type": "tree",
          "content": null
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "example.md",
          "type": "blob",
          "size": 1.3115234375,
          "content": "---\ntitle: Dish Title\ntags: ['beef', 'soup', 'german']\ndate: 2022-02-20\nauthor: \"Your Name\"\n---\n\nIf necessary, provide a very brief description of the dish in one or two sentences.\nFor most dishes, this will be unnecessary.\nIf there is a title image of this dish, it should be above this paragraph.\nYou may also include prep/cook time and the number of servings as below:\n\n- ⏲️ Prep time: 10 min\n- 🍳 Cook time: 30 min\n- 🍽️ Servings: 4\n\n## Ingredients\n\n- There must be a blank line above all lists.\n- List the ingredients\n- in an unordered list\n- similar to this.\n- List amounts if necessary.\n- Put (optional) at the end of optional ingredients\n\n## Directions\n\n1. Now using an ordered list,\n2. give the directions to prepare the dish.\n3. Do **not** add unnecessary blank lines between items.\n4. If necessary,\n5. an image can be included between some directions if needed to explain something particular.\n6. But that should be kept to a minimum to reduce bandwidth and aid in simplicity.\n\nNote that you can create a `your-name.json` file in `data/authors` to add\npersonal links and donation addresses if you want more specific credit. If you\ndo this, for the `author:` line the in the metadata, include the bare file name\nof the json file. For example, my file is `data/authors/luke-smith.json`, so I\nwould put `author: luke-smith`.\n"
        },
        {
          "name": "layouts",
          "type": "tree",
          "content": null
        },
        {
          "name": "static",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}