{
  "metadata": {
    "timestamp": 1736711678820,
    "page": 355,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "filamentgroup/select-css",
      "stars": 1235,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0556640625,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2014 Filament Group\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.4482421875,
          "content": ":warning: This project is archived and the repository is no longer maintained. \n\nselect-css\n==========\n\n\nCross-browser select element CSS for consistent select element styling.\n\nArticle: https://www.filamentgroup.com/lab/select-css.html\n\n\n\n---\n\nDemo page: [http://filamentgroup.github.io/select-css/demo/](http://filamentgroup.github.io/select-css/demo/)\n\nDownload: [select-css.css](https://github.com/filamentgroup/select-css/blob/master/src/select-css.css)\n\nAvailable [on npm](https://www.npmjs.com/package/fg-select-css): `npm install fg-select-css`\n\n---\n\n## Usage\n\nInclude the following file:\n\n* [`src/select-css.css`](src/select-css.css): main component code\n\nIts CSS will style any select with a class of `select-css`\n\n### Notes on the CSS\n\nThe CSS for this is fine to use as-is, but if you're editing it at all, you might want to be aware of a few numbers and values that help it look right.\n\n- The `select` is set to `display: block` by default but you can style it `display: inline-block; width: auto;` if you'd like it to sit alongside a `label`.\n- The background of the `select` is created using two background images: the first is an svg arrow icon (expressed inline as a data URI) and the second is a repeating linear gradient. Either URL could be an external image if you'd like. If you change the icon image, be aware that its size is set in the first section of the later `background-size: .65em auto, 100%;` property. And its position is set via `background-position: right .7em top 50%, 0 0;` (which is `.7em` from the right side, respectively). Also, if the size changes, you might want to make more right padding on the button so that it doesn't overlap the `select`'s text, but be aware that in IE9 and older, the custom arrow will not appear, and the browser's default arrow will show to the left of the padding, so don't add too much there or IE9's arrow will be inset really far.\n- The linear gradient background is important to keep, because its presence actually prevents IE9 and older from recognizing the background property, and as a result it won't show the custom icon alongside its unhideable native one. **If you want a flat color, use a linear gradient between two of the same color values.**\n- The `appearance` rule and its and prefixed versions are important to unset some default browser `select` styling.\n- The `font-size: 16px;` rule is important because iOS Safari will zoom-in the site layout if the `select`'s text is less than 16px. Generally, this behavior is annoying so we try to avoid it with a 16px font size on `select`s.\n- The `.select-css option` keeps `option` elements from inheriting the bold font weight of the `select` button itself.\n- As noted in [Scott O'Hara's article](https://scottaohara.github.io/a11y_styled_form_controls/src/select/), setting background color on the `select` (though not background *image* as I've used here, can cause `option` elements to inherit background colors as well, which can cause problems. So avoid doing that. ) \n- The `.select-css::-ms-expand` rule instructs IE11 and IE10 to hide the menu icon pseudo element, so the custom icon behind it can appear. Thanks for the tip, Jelmer de Maat.\n\n\n#### For Posterity:\n* [v1](https://github.com/filamentgroup/select-css/tree/v1)\n* [v9: February 26, 2016](http://output.jsbin.com/wurazow)\n* [v8: September 18, 2015](http://output.jsbin.com/yaruh)\n\nIf you’re looking for a custom select that uses JavaScript for additional features, check out [`select`](https://github.com/filamentgroup/select).\n"
        },
        {
          "name": "artifacts",
          "type": "tree",
          "content": null
        },
        {
          "name": "demo",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.5,
          "content": "{\n  \"name\": \"fg-select-css\",\n  \"version\": \"3.2.0\",\n  \"description\": \"Cross-browser CSS for consistent select element styling.\",\n  \"scripts\": {\n  },\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/filamentgroup/select-css.git\"\n  },\n  \"authors\": \"zachleat <zachleatherman@gmail.com> (http://zachleat.com/), @scottjehl\",\n  \"license\": \"MIT\",\n  \"bugs\": {\n    \"url\": \"https://github.com/filamentgroup/select-css/issues\"\n  },\n  \"homepage\": \"https://github.com/filamentgroup/select-css#readme\"\n}\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}