{
  "metadata": {
    "timestamp": 1736711565208,
    "page": 105,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjExMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "TIBCOSoftware/flogo",
      "stars": 2439,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1259765625,
          "content": "\n# OS generated files #\n######################\n.DS_Store\n.DS_Store?\n._*\n.Spotlight-V100\n.Trashes\nehthumbs.db\nThumbs.db\n.vscode/\n\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.421875,
          "content": "sudo: false\n\nlanguage: go\n\narch:\n    - amd64\n    - arm64\ngo:\n  - master\n\nos:\n  - linux\n\nbranches:\n  only:\n  - master\n\ninstall:\n  - chmod +x build-docs.sh\n\nscript:\n  - ./build-docs.sh prerequisites\n  - ./build-docs.sh ext-docs\n  - ./build-docs.sh update-page all\n  - ./build-docs.sh build\n\ndeploy:\n  provider: pages\n  skip_cleanup: true\n  local-dir: docs/public\n  github_token: $GITHUB_TOKEN\n  email: $EMAIL\n  on:\n    branch: master\n"
        },
        {
          "name": ".whitesource",
          "type": "blob",
          "size": 0.1337890625,
          "content": "{\n  \"generalSettings\": {\n    \"shouldScanRepo\": true\n  },\n  \"checkRunSettings\": {\n    \"vulnerableCheckRunConclusionLevel\": \"failure\"\n  }\n}"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.849609375,
          "content": "# Contributing to Project Flogo\n\nAre you interested in contributing to Project Flogo? If so, this doc was created specifically for you! If you’re not ready to start contributing code, no problem, feel free to check out the [documentation issues](https://github.com/TIBCOSoftware/flogo/labels/kind%2Fdocs) and begin by helping enhance the documentation!\n\nDetailed instructions on contributing to the documentation and sharing your projects via the showcase can be found in our documentation, here:\n\nhttps://tibcosoftware.github.io/flogo/contributing/\n\nIf you’re ready and interested to make code contributions, we’ve tried to make the process as easy as possible. First, an automated contributor license agreement (CLA) has been put in place, after your first pull request, you’ll be prompted to sign the agreement, no hassles, easy and integrated right into GitHub. Also, before you begin, take a look at the general guidelines below for contributing.\n\n## How do I make a contribution?\n\nNever made an open source contribution before? Wondering how contributions work in our project? Here's a quick rundown!\n\nIf you have any questions, feel free to post an issue and tag it as a question, email flogo-oss@tibco.com or chat with the team and community:\n\n* The [project-flogo/Lobby](https://gitter.im/project-flogo/Lobby?utm_source=share-link&utm_medium=link&utm_campaign=share-link) Gitter channel should be used for general discussions, start here for all things Flogo!\n* The [project-flogo/developers](https://gitter.im/project-flogo/developers?utm_source=share-link&utm_medium=link&utm_campaign=share-link) Gitter channel should be used for developer/contributor focused conversations. \n\n* Find an issue that you are interested in addressing or a feature that you would like to add. Look for issues labeled `good first issue`, `kind/help-wanted` if you’re unsure where to begin. Don’t forget to checkout all of the Flogo repositories: [flogo-contrib](https://github.com/TIBCOSoftware/flogo-contrib), [flogo-lib](https://github.com/TIBCOSoftware/flogo-lib), [flogo-cli](https://github.com/TIBCOSoftware/flogo-cli) & [flogo-services](https://github.com/TIBCOSoftware/flogo-services).\n* Fork the repository associated with the issue to your local GitHub account. This means that you will have a copy of the repository under github-username/repository-name.\n* Clone the repository to your local machine using `git clone https://github.com/github-username/repository-name.git`.\n* Create a new branch for your fix using `git checkout -b branch-name-here`.\n* Make the appropriate changes for the issue you are trying to address or the feature that you want to add.\n* Use `git add insert-paths-of-changed-files-here` to add the file contents of the changed files to the \"snapshot\" git uses to manage the state of the project, also known as the index.\n* Use `git commit -m \"Insert a short message of the changes made here\"` to store the contents of the index with a descriptive message.\n* Push the changes to the remote repository using `git push origin branch-name-here`.\n* Submit a pull request to the upstream repository.\n* Title the pull request with a short description of the changes made and the issue or bug number associated with your change. For example, you can title an issue like: \"Registering mapper functions as outlined in #4352\".\n* In the description of the pull request, explain the changes that you made, any issues you think exist with the pull request you made, and any questions you have for the maintainers.\n* Sign the CLA if you have not yet done so in the past.\n* Wait for the pull request to be reviewed by a maintainers.\n* Make changes to the pull request if the reviewing maintainer recommends them.\n* Congratulations, you’ve contributed to Project Flogo, a celebration is in order!\n\n## Best Practices for Code Contributions\n\nIf you're adding a new feature, such as an activity or trigger, please follow the best practices below:\n\n* Provide test cases for your feature\n* Package name should match your activity dir. For example, if a new activity is placed in activity/awesomeActivity then the go package name should match.\n    * Follow Go best practices for package names: https://blog.golang.org/package-names\n* Run gofmt to format your code\n* Leverage activity trigger metadata (activity/trigger.json)\n    * Use metadata ‘required’ attribute when the attribute is required\n    * Supply a default value in metadata not code (use the value attribute)\n* Activity Eval() should return `true` only when completed successfully & err should be returned when an error occurs\n\nRefer to the [Flogo Documentation](https://tibcosoftware.github.io/flogo/) for more guidence and help.\n\nDon't forget, if you build an awesome Activity or Trigger you can [share your work via the Flogo Showcase](https://tibcosoftware.github.io/flogo/contributing/) rather than contributing to [flogo-contrib](https://github.com/TIBCOSoftware/flogo-contrib).\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.482421875,
          "content": "BSD 3-Clause License\n\nCopyright (c) 2022, TIBCO Software Inc.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of TIBCO Software Inc. nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 16.4755859375,
          "content": "<p align=\"center\">\n  <img src =\"images/projectflogo.png\" />\n</p>\n\n<p align=\"center\" >\n  <b>Project Flogo is an Open Source ecosystem for event-driven apps</b>\n</p>\n\n<p align=\"center\">\n  <img src=\"https://travis-ci.org/TIBCOSoftware/flogo.svg\"/>\n  <img src=\"https://img.shields.io/badge/dependencies-up%20to%20date-green.svg\"/>\n  <img src=\"https://img.shields.io/badge/license-BSD%20style-blue.svg\"/>\n  <a href=\"https://gitter.im/project-flogo/Lobby?utm_source=share-link&utm_medium=link&utm_campaign=share-link\"><img src=\"https://badges.gitter.im/Join%20Chat.svg\"/></a>\n</p>\n\n<p align=\"center\">\n  <a href=\"#project-flogo-ecosystem\">Ecosystem</a> | <a href=\"#flogo-repos\">Repos</a> | <a href=\"#flogo-core\">Core</a> | <a href=\"#flogo-flows\">Flows</a> | <a href=\"#flogo-streams\">Streams</a> | <a href=\"#flogo-rules\">Flogo Rules</a> | <a href=\"#golang-api\">Go Developers</a> | <a href=\"#when-to-use-flogo\">When to use Flogo</a> | <a href=\"#contributing\">Contributing</a> | <a href=\"#license\">License</a>\n</p>\n\n<br/>\n\nProject Flogo is an ultra-light, Go-based open source ecosystem for building event-driven apps. Event-driven, you say? Yup, the notion of *triggers* and *actions* are leveraged to process incoming events. An action, a common interface, exposes key capabilities such as application integration, stream processing, etc.\n<br/>\n\n<p align=\"center\">\n  <img src =\"images/eventhandlers.png\" />\n</p>\n<br/>\n\n- **App = Trigger(s) + Actions[&Activities]**\n- **Triggers**\n  - receive data from external sources.\n  - are managed by a configurable threading model\n  - have a common interface enabling anyone to build a Flogo trigger.\n- **Handlers**\n  - dispatch events to actions\n- **Actions**\n  - process events in a manner suitable with the implementation\n  - have a common interface enabling opinionated event processing capabilities\n\n# Project Flogo Ecosystem\n\nAll capabilities within the Flogo Ecosystem have a few things in common, they all process events (in a manner suitable for the specific purpose) and they all implement the *action* interface exposed by Flogo Core.\n\nSome of the key highlights include:\n\n🎈 **Ultra-light** 20x-50x lighter than Java or Node.js <br/>\n⚡️ **Event-driven** Powerful event-driven programming model based on *triggers* and *actions*<br/>\n⚙️ **Common core** a single, common core enables reuse and flexibility across all eventing constructs<br/>\n✏️ **Golang based** Written entirely in Golang for efficiency<br/>\n💪 **Deployment flexibility** Deploy as ultra-lightweight serverless functions, containers or static binaries on IoT edge devices<br/>\n🧠 **Native machine learning** Purpose built activity for TensorFlow SavedModel inferencing<br/>\n😍 **100% Open Source** for your dev & hacking pleasure<br/>\n\n<p align=\"center\">\n  <img src =\"images/flogostack.png\" />\n</p>\n\n* **Integration Flows** Application Integration process engine with conditional branching and a visual development environment<br/>\n* **Stream Processing** a simple pipeline-based stream processing action with event joining capabilities across multiple triggers & aggregation over time windows<br/>\n* **Contextual Decisioning**  Declarative Rules for Real-time Contextual Decisions<br/>\n* **Microgateway** Microgateway pattern for conditional, content-based routing, JWT validation, rate limiting, circuit breaking and other common patterns<br/>\n\nThe concept is simple, an event is just that, an event, how it’s processed is what differs. Flogo Core eases the burden by enabling a common set of functionality, such as:\n\n- threading\n- logging\n- data type coercion\n- data mapping\n- tracing & monitoring hooks\n\nWhile also exposing a common set of contributions via activities and triggers. For example, all available triggers can be leveraged to dispatch events to any action implementation, that is, flows for application integration, streams for stream processing, rules for contextual rule processing, etc.\n\n# Flogo Repos\n\nProject Flogo consists of the following sub-projects available as separate repos under a seperated GitHub Org:\n\n* [project-flogo/flogo-cli](https://github.com/project-flogo/cli):  Command line tools for building Flogo apps & extensions\n* [project-flogo/flogo-core](https://github.com/project-flogo/core): The core Flogo library \n* [project-flogo/flogo-contrib](https://github.com/project-flogo/contrib): Flogo contributions/extensions\n* [project-flogo/stream](https://github.com/project-flogo/stream): Flogo Streams Action\n* [project-flogo/rules](https://github.com/project-flogo/rules): Contextual, deterministic rules action\n* [project-flogo/microgateway](https://github.com/project-flogo/microgateway): Flogo Microgateway Action\n* [project-flogo/flogo-web](https://github.com/project-flogo/flogo-web): Flogo Web UI\n\n# Flogo Core\n\nFlogo Core is an event-driven app framework used to develop apps for the cloud & IoT edge. It can also be thought of as a lightweight *app kernel* used by open source & commercial solutions.\n\nFlogo Core provides the following key benefits:\n\n⛓ **Action chaining** enables communication between one or more capabilities in a single, sub 10MB binary!<br/>\n🏗 **Common contribution model** build activities and triggers that can be leveraged by all capabilities<br/>\n🔨 **Extensible** easily extend the capabilities available by building your own action using the common interfaces<br/>\n\n## Flogo Core Contribution Model\n\nFlogo Core exposes three principal contribution interfaces that enable developers to build common capabilities and functionality. These contribution interfaces include:\n\n* **Trigger Interface** a common interface for building event-consumers that dispatch events to one or more actions. The Kafka subscriber is an example of a trigger.\n* **Activity Interface** a common interface for exposing common application logic in a reusable manner. Think of this as a function, such as write to database, publish to Kafka, etc that can be used by all Flogo apps.\n* **Action Interface** a common interface for processing events. Actions contain the specific capability logic, such as integration, stream processing, rule processing, etc. Actions have a great deal of flexibility in how they’re developed and how developers leverage actions within their overall applications. For example, flows and streams expose JSON-based DSLs & Go APIs for maximum developer flexibility.\n\n# Flogo Flows\n\nFlogo Flows provides application integration capabilities and includes the following key highlights.\n\n🌈 **Painless development** Visual modeler with step-back debugging capabilities & elegant DSL<br/>\n⚙️ **Ultra-light process engine** for conditional flow control\n\n## Getting Started\n\nWe've made getting started with Flogo Flows as easy as possible. The current set of tooling is designed for:\n\n- Serverless function developers\n- Cloud-native microservices developers\n- IoT Solutions developers\n- <a href=\"#golang-api\">Go Developers</a>\n\n### Zero-code Developers\n\nIf your background is in or you prefer to develop your apps using zero-coding environments, then read on, because we’ve got something special for you.\n\nFlows Web UI is available via [Docker Hub](https://hub.docker.com/r/flogo/flogo-docker) or [Flogo.io](http://flogo.io). The Docker image contains the Flows Web UI along with all required components to begin developing, testing and building deployable artifacts right from your web browser.\n\nTo report any issues with the Issue tracker on this project.\n\n![Flogo Web In Action](images/flogo-web2.gif)\n\n# Flogo Streams\n\nEdge devices have the potential for producing millions or even billions of events at rapid intervals, often times the events on their own are meaningless, hence the need to provide basic streaming operations against the slew of events.\n\nA native streaming action as part of the Project Flogo Ecosystem accomplishes the following primary objectives:\n\n- Enables apps to implement basic streaming constructs in a simple pipeline fashion\n- Provides non-persistent state for streaming operations\n  - Streams are persisted in memory until the end of the pipeline\n- Serves as a pre-process pipeline for raw data to perform basic mathematical and logical operations. Ideal for feeding ML models\n\nSome of the key highlights include:\n\n😀 **Simple pipeline** construct enables a clean, easy way of dealing with streams of data<br/>\n⏳ **Stream aggregation** across streams using time or event tumbling & sliding windows<br/>\n🙌 **Join streams** from multiple event sources<br/>\n🌪 **Filter** out the noise with stream filtering capabilities<br/>\n\n## Getting Started\n\nWe’ve made building powerful streaming pipelines as easy as possible. Develop your pipelines using:\n\n- A simple, clean JSON-based DSL\n- Golang API\n\nSee the sample below of an aggregation pipeline (for brevity, the triggers and metadata of the resource has been omitted). Also don’t forget to check out the examples in the [project-flogo/stream](https://github.com/project-flogo/stream/tree/master/examples) repo.\n\n```json\n  \"stages\": [\n    {\n      \"ref\": \"github.com/project-flogo/stream/activity/aggregate\",\n      \"settings\": {\n        \"function\": \"sum\",\n        \"windowType\": \"timeTumbling\",\n        \"windowSize\": \"5000\"\n      },\n      \"input\": {\n        \"value\": \"=$.input\"\n      }\n    },\n    {\n      \"ref\": \"github.com/project-flogo/contrib/activity/log\",\n      \"input\": {\n        \"message\": \"=$.result\"\n      }\n    }\n  ]\n```\n\n# Flogo Rules\n\nProcessing Events in real-time to determine next best action is an important function of Event driven applications. With the vast amount of events that are generated from different sources, making sense of the information in a given context can be immensely valuable. \n\nFlogo Rules simplifies the complexity involved with real-time contextual decisions.\n\nFlogo Rules supports\n\n- Declarative Rules to define conditional logic and trigger result rules\n- Joins/Correlations across multiple Event sources\n- Ability to define Rule Priorities\n- Timer Events; Configurable TTL (time to live) -1 - no expiry, 0 - event expiry set to end of run to completion cycle. \n- Forward chaining for Inferencing\n\n# The CLI\n\nThe CLI is used to build all applications that leverage the JSON-based DSL. If you’re using the Go API to build your apps, feel free to just `go build` your stuff without the flogo CLI.\n\nGetting started with the CLI couldn't be any easier (refer to [Flogo CLI](https://github.com/project-flogo/cli) repo for detail instructions and dependencies):\n\n* Install the CLI\n```bash\ngo install github.com/project-flogo/cli/...@latest\n```\n\n* Create & build your app\n<img src=\"images/flogo-cli.gif\" width=\"70%\"/>\n\n* **flogo** the core CLI for creating and building your applications\n* **flogogen** a scaffolding tool to begin building your Flogo contributions (activities, triggers & actions)\n\nIf you're interested in building your own contribution(s), refer to the [Flogo Documentation](https://tibcosoftware.github.io/flogo/) or join us on the [project-flogo/Lobby Gitter Channel](https://gitter.im/project-flogo/Lobby?utm_source=share-link&utm_medium=link&utm_campaign=share-link).\n\n# Golang API\n\nAre you the kind of person who would rather code, but would love to leverage the capabilities of the Flogo Ecosystem? Makes total sense, we just ❤️ to code also! We’ve exposed a number of Go APIs for leveraging the various action types, activities and triggers. Getting started is pretty easy, just follow the steps below.\n\n* Create your new project dir and init your module\n```base\nmkdir test\ncd test\ngo mod init example.com/m\n```\n\n* Go get the latest [flogo core](https://github.com/project-flogo/core)\n```bash\ngo get github.com/project-flogo/core\n```\n\n* Optionally, if you're using any of the Flogo contributions, don't forget to get that repo, as well\n```bash\ngo get github.com/project-flogo/contrib\n```\n\n* Open up your favorite IDE or txt editor and start coding!\n\n```go\npackage main\n\nimport (\n\t\"context\"\n\t\"fmt\"\n\n\t\"github.com/project-flogo/contrib/activity/log\"\n\t\"github.com/project-flogo/contrib/trigger/rest\"\n\t\"github.com/project-flogo/core/activity\"\n\t\"github.com/project-flogo/core/api\"\n\t\"github.com/project-flogo/core/data/coerce\"\n\t\"github.com/project-flogo/core/engine\"\n)\n\nfunc main() {\n\n\tapp := myApp()\n\n\te, err := api.NewEngine(app)\n\n\tif err != nil {\n\t\tfmt.Println(\"Error:\", err)\n\t\treturn\n\t}\n\n\tengine.RunEngine(e)\n}\n\nfunc myApp() *api.App {\n\tapp := api.NewApp()\n\n\ttrg := app.NewTrigger(&rest.Trigger{}, &rest.Settings{Port: 8080})\n\th, _ := trg.NewHandler(&rest.HandlerSettings{Method: \"GET\", Path: \"/blah/:num\"})\n\th.NewAction(RunActivities)\n\n\t//store in map to avoid activity instance recreation\n\tlogAct, _ := api.NewActivity(&log.Activity{})\n\tactivities = map[string]activity.Activity{\"log\": logAct}\n\n\treturn app\n}\n\nvar activities map[string]activity.Activity\n\nfunc RunActivities(ctx context.Context, inputs map[string]interface{}) (map[string]interface{}, error) {\n\n\ttrgOut := &rest.Output{}\n\ttrgOut.FromMap(inputs)\n\n\tmsg, _ := coerce.ToString(trgOut.PathParams)\n\t_, err := api.EvalActivity(activities[\"log\"], &log.Input{Message: msg})\n\tif err != nil {\n\t\treturn nil, err\n\t}\n\n\tresponse := make(map[string]interface{})\n\n\tresponse[\"id\"] = \"123\"\n\tresponse[\"amount\"] = \"1\"\n\tresponse[\"balance\"] = \"500\"\n\tresponse[\"currency\"] = \"USD\"\n\n\treply := &rest.Reply{Code: 200, Data: response}\n\treturn reply.ToMap(), nil\n}\n```\n\n* Don't forget to tidy your dependencies\n```bash\ngo mod tidy\n```\n\n* Before we can build the app, let's generate the metadata for the triggers\n```bash\ngo generate\n```\n\n* Build the app\n```bash\ngo build\n```\n\n# When to use Flogo\n\nYou’ll look to leverage Flogo if you’re a dev & sick of building all the messy stuff that comes along with coding production apps. Such as connectivity to event-driven messaging platforms, datastores, SaaS apps, etc & want to deploy to a wide range of targets, such as\n\n- serverless compute\n- IoT edge devices\n- containers\n\nThe broader Flogo ecosystem exposes an opinionated perspective on building event-driven apps. If you’re looking to process events in any of the following ways, then read on because the Project Flogo Ecosystem is for you!\n\n- long running processes with flow-control support geared toward application integration\n- consuming and manipulating large streams of events via a pipeline to act as a pre-processor for time-series data to serve things like machine learning models or to derive simple conclustions via data aggregation\n- contextual, declarative rules for real-time decisioning\n\nIn short...\n\n| Flogo is...  | Flogo is not... |\n| :--- | :--- |\n| an ecosystem of opinionated, event-driven capabilities | a front-end web app or analytics framework |\n| a Go lib to increase dev productivity  | an IoT platform  |\n\n# Contributing\nWant to contribute to Project Flogo? We've made it easy, all you need to do is fork the repository you intend to contribute to, make your changes and create a Pull Request! Once the pull request has been created, you'll be prompted to sign the CLA (Contributor License Agreement) online.\n\nNot sure where to start? No problem, here are a few suggestions:\n\n* [flogo-contrib](https://github.com/project-flogo/contrib): This repository contains all of the standard contributions, such as activities, triggers, etc. Perhaps there is something missing? Create a new activity or trigger or fix a bug in an existing activity or trigger. Don't forget to check all of the other repositores in the [project-flogo org](https://github.com/project-flogo) on GitHub, as some contributions are large enough to have their own repo.\n* Browse all of the [Project Flogo repositories] and look for issues tagged `kind/help-wanted` or `good first issue`\n\nIf you have any questions, feel free to post an issue and tag it as a question, email flogo-oss@tibco.com or chat with the team and community:\n\n* The [project-flogo/Lobby](https://gitter.im/project-flogo/Lobby) Gitter channel should be used for general discussions, start here for all things Flogo!\n* The [project-flogo/developers](https://gitter.im/project-flogo/developers) Gitter channel should be used for developer/contributor focused conversations. \n\nFor additional details, refer to the [Contribution Guidelines](https://github.com/TIBCOSoftware/flogo/blob/master/CONTRIBUTING.md).\n\n# License \nProject Flogo is licensed under a BSD-style license. Refer to [LICENSE](https://github.com/TIBCOSoftware/flogo/blob/master/LICENSE) for license text.\n\n## Usage Guidelines\n\nWe’re excited that you’re using Project Flogo to power your project(s). Please adhere to the [usage guidelines](http://flogo.io/brand-guidelines) when referencing the use of Project Flogo within your project(s) and don't forget to let others know you're using Project Flogo by proudly displaying one of the following badges or the Flynn logo, found in the [branding](branding) folder of this project.\n"
        },
        {
          "name": "branding",
          "type": "tree",
          "content": null
        },
        {
          "name": "build-docs.sh",
          "type": "blob",
          "size": 4.716796875,
          "content": "#!/usr/bin/env bash\n\n# Description: Build script for Project Flogo documentation\n# Author: retgits <https://github.com/retgits>\n# Last Updated: 2018-10-01\n\n#--- Variables ---\nHUGO_VERSION=0.74.3\nHUGO_ARCH=64bit\n#--- Download and install prerequisites ---\nprerequisites() {\n    if [ `uname -m` = 'aarch64' ]; then\n            HUGO_ARCH=ARM64\n            mkdir $HOME/gopath/bin\n    fi\n    wget -O hugo.tar.gz https://github.com/gohugoio/hugo/releases/download/v${HUGO_VERSION}/hugo_${HUGO_VERSION}_Linux-${HUGO_ARCH}.tar.gz\n    mkdir -p hugobin\n    tar -xzvf hugo.tar.gz -C ./hugobin\n    mv ./hugobin/hugo $HOME/gopath/bin\n    rm hugo.tar.gz && rm -rf ./hugobin\n}\n\n#--- Get external docs ---\next_docs() {\n    echo \"Getting the docs for the activities and triggers\"\n    git clone https://github.com/project-flogo/contrib\n    for i in `find contrib/activity -name \\*.md` ; do filename=$(basename $(dirname $i)); cp $i docs/content/development/webui/activities/$filename.md; sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/development/webui/activities/$filename.md; done;\n    for i in `find contrib/trigger -name \\*.md` ; do filename=$(basename $(dirname $i)); cp $i docs/content/development/webui/triggers/$filename.md; sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/development/webui/triggers/$filename.md; done;\n    for i in `find contrib/function -name \\*.md` ; do filename=$(basename $(dirname $i)); cp $i docs/content/development/webui/functions/$filename.md; sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/development/webui/functions/$filename.md; done;\n    rm -rf flogo-contrib\n\n    echo \"Getting the docs for the commandline tools\"\n    curl -o docs/content/flogo-cli/flogo-cli.md https://raw.githubusercontent.com/project-flogo/cli/master/docs/commands.md\n    sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/flogo-cli/flogo-cli.md\n    curl -o docs/content/flogo-cli/plugins.md https://raw.githubusercontent.com/project-flogo/cli/master/docs/plugins.md\n    sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/flogo-cli/plugins.md\n    curl -o docs/content/flogo-cli/dev-plugin.md https://raw.githubusercontent.com/project-flogo/cli-plugins/master/devtool/README.md\n    sed -i -e 's/<!--/---/g' -e 's/-->/---/g' docs/content/flogo-cli/dev-plugin.md\n}\n\n#--- Update contributions page ---\nupdate_page_contrib() {\n    echo \"Update contributing page\"\n    cp CONTRIBUTING.md docs/content/contributing/contributing.md\n    sed -i '1d' docs/content/contributing/contributing.md\n    sed -i '1i ---' docs/content/contributing/contributing.md\n    sed -i '1i weight: 9010' docs/content/contributing/contributing.md\n    sed -i '1i title: Contributing to Project Flogo' docs/content/contributing/contributing.md\n    sed -i '1i ---' docs/content/contributing/contributing.md\n}\n\n#--- Update introduction page ---\nupdate_page_introduction() {\n    cp README.md docs/content/introduction/_index.md\n    sed -i '1,4d' docs/content/introduction/_index.md\n    sed -i '5,17d' docs/content/introduction/_index.md\n    sed -i '1i ---' docs/content/introduction/_index.md\n    sed -i '1i pre: \"<i class=\\\\\"fas fa-home\\\\\" aria-hidden=\\\\\"true\\\\\"></i> \"' docs/content/introduction/_index.md\n    sed -i '1i weight: 1000' docs/content/introduction/_index.md\n    sed -i '1i title: Introduction' docs/content/introduction/_index.md\n    sed -i '1i ---' docs/content/introduction/_index.md\n    sed -i 's#images/eventhandlers.png#https://raw.githubusercontent.com/TIBCOSoftware/flogo/master/images/eventhandlers.png#g' docs/content/introduction/_index.md\n    sed -i 's#images/flogostack.png#https://raw.githubusercontent.com/TIBCOSoftware/flogo/master/images/flogostack.png#g' docs/content/introduction/_index.md\n    sed -i 's#images/flogo-web2.gif#https://raw.githubusercontent.com/TIBCOSoftware/flogo/master/images/flogo-web2.gif#g' docs/content/introduction/_index.md\n    sed -i 's#images/flogo-cli.gif#https://raw.githubusercontent.com/TIBCOSoftware/flogo/master/images/flogo-cli.gif#g' docs/content/introduction/_index.md\n}\n\n#--- Update page ---\nupdate_page() {\n    case \"$1\" in\n        \"contributing\")\n            update_page_contrib\n            ;;\n        \"introduction\")\n            update_page_introduction\n            ;;\n        *)\n            echo \"Updating all pages\"\n            update_page_contrib\n            update_page_introduction\n    esac\n}\n\n#--- Execute build ---\nbuild() {\n    echo \"Build docs site...\"\n    cd docs && hugo\n    cd ../showcases && hugo\n    mv public ../docs/public/showcases\n    cd ../docs\n    cd public && ls -alh\n}\n\n\ncase \"$1\" in \n    \"prerequisites\")\n        prerequisites\n        ;;\n    \"ext-docs\")\n        ext_docs\n        ;;\n    \"update-page\")\n        update_page $2\n        ;;\n    \"build\")\n        build\n        ;;\n    *)\n        echo \"The target {$1} you want to execute doesn't exist\"\nesac\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "happyhour",
          "type": "tree",
          "content": null
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "samples",
          "type": "tree",
          "content": null
        },
        {
          "name": "serverless",
          "type": "tree",
          "content": null
        },
        {
          "name": "showcases",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}