{
  "metadata": {
    "timestamp": 1736711641382,
    "page": 269,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "data-engineering-community/data-engineering-wiki",
      "stars": 1497,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2177734375,
          "content": "# https://code.visualstudio.com/docs/remote/troubleshooting#_resolving-git-line-ending-issues-in-wsl-resulting-in-many-modified-files\n* text=auto eol=lf\n*.{cmd,[cC][mM][dD]} text eol=crlf\n*.{bat,[bB][aA][tT]} text eol=crlf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.044921875,
          "content": ".obsidian/*.json\n.obsidian/workspace\n.DS_Store"
        },
        {
          "name": ".lycheeignore",
          "type": "blob",
          "size": 0.029296875,
          "content": "http://docs.basho.com/riak/kv/"
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "Assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "BACKERS.md",
          "type": "blob",
          "size": 1.111328125,
          "content": "# Sponsors & Backers\n\nThe Data Engineering Wiki is an CC0-1.0-licensed open source project with its ongoing development made possible entirely by the support of the awesome sponsors and backers listed in this file. If you'd like to join them, please consider [sponsoring the Data Engineering Wiki's development](https://github.com/data-engineering-community/data-engineering-wiki).\n\n---\n\n<div align=\"center\">\n\n## Gold Sponsors\n\n<a href=\"https://dataengjobs.com/\">\n    <img src=\"https://avatars.githubusercontent.com/u/109050594?v=4\" width=250>\n</a>\n<a href=\"https://greatexpectations.io/cloud/?utm_source=reddit&utm_medium=sponsored&utm_campaign=r-dataengineering&utm_content=cloud-signup\">\n    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/41d72633bf4c6fea9f1d073f590dfc7d331359b4/Assets/great-expectations-logo.svg\" width=250>\n</a>\n\n## Silver Sponsors\n\n<a href=\"https://bit.ly/dataengwiki\">\n    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/main/Assets/starburst-logo.svg\" width=200>\n</a>\n\n</div>\n\n## Backers\n\n- digitalghost-dev\n- davidkhala\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.5087890625,
          "content": "# Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, caste, color, religion, or sexual identity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our community include:\n\n- Using welcoming and inclusive language\n- Demonstrating empathy and kindness toward other people\n- Being respectful of differing opinions, viewpoints, and experiences\n- Giving and gracefully accepting constructive feedback\n- Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience\n- Focusing on what is best not just for us as individuals, but for the overall community\n\nExamples of unacceptable behavior include:\n\n- The use of sexualized language or imagery, and unwelcome sexual attention or advances\n- Trolling, insulting or derogatory comments, and personal or political attacks\n- Public or private harassment\n- Publishing others’ private information, such as a physical or email address, without their explicit permission\n- Other conduct which could reasonably be considered inappropriate in a professional setting\n\n## Our Responsibilities\n\nCommunity leaders and project maintainers are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject comments, commits, code, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement at [community@dataengineering.wiki](mailto:community@dataengineering.wiki). All complaints will be reviewed and investigated promptly and fairly.\n\nProject maintainers and community leaders are obligated to respect the privacy and security of the reporter of any incident.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant](https://www.contributor-covenant.org/), version 2.1, available at [https://www.contributor-covenant.org/version/2/1/code_of_conduct.html](https://www.contributor-covenant.org/version/2/1/code_of_conduct.html).\n\nFor answers to common questions about this code of conduct, see the FAQ at [https://www.contributor-covenant.org/faq](https://www.contributor-covenant.org/faq). Translations are available at [https://www.contributor-covenant.org/translations](https://www.contributor-covenant.org/translations).\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.8984375,
          "content": "# Contributing Rules\n\n1. Contributions are more than welcome but we ask that you avoid making minor changes unless you are fixing a grammatical issue. If you are editing an existing note then the changes should be significantly different.\n2. Limit self-promotion. If you make money from a certain website, app, etc. please refrain from linking it as a source in your note.\n3. We're happy for any contribution in any form, but if you're making more than one major change it would be super cool of you to make a separate pull request for each one so that someone can review them more effectively and/or individually.\n\n## Style Guidelines\n\n- **Add [YAML frontmatter](https://help.obsidian.md/Advanced+topics/YAML+front+matter) to each note**\n  - Every note should contain this at the top of the note.\n  - You can use this to specify aliases as well as tags.\n  - We currently aren't using any tags but that may change in the future.\n- **Use templates when starting notes**\n  - You can find templates for the most common types of notes under the templates folder.\n  - If you are using Obisdian, you can use the [Templates plugin](https://help.obsidian.md/Plugins/Templates) for easy note creation.\n- **Note naming conventions**\n  - All note files should use the markdown format and end in the `.md` file extension.\n  - File names should be title case and use spaces instead of hyphens or plus symbols.\n- **Other guidelines**\n\t- Use https://mermaid.live/ to create mermaid.js diagrams\n\n## Contribution Workflow\n\n1.  [**Download the free obsidian desktop app**](https://obsidian.md/) and learn [how to format your notes](https://help.obsidian.md/How+to/Format+your+notes).\n2.  [**Fork the repository**](https://guides.github.com/activities/forking/) and clone it locally. Connect your local to the original “upstream” repository by adding it as a remote. Pull in changes from “upstream” often so that you stay up to date so that when you submit your pull request, merge conflicts will be less likely. (See more detailed instructions [here](https://help.github.com/articles/syncing-a-fork/).)\n3.  [**Create a branch**](https://guides.github.com/introduction/flow/) for your edits.\n4.  **Open the repo** in Obsidian.\n5.  **Make any changes** and save.\n6.  **Push the changes** via git.\n7.  **Make a pull request** on GitHub.\n8.  **Reference any relevant issues** or supporting documentation in your PR (for example, “Closes #37.”)\n9.  **Contribute in the style of the project** to the best of your abilities. This may mean using indents, semi-colons or comments differently than you would in your own repository, but makes it easier for the maintainer to merge, others to understand and maintain in the future.\n\n## What is the policy for using generative AI?\n\nWe will not accept entries that were exclusively generated through an AI tool. We have this policy because:\n\nAI-generated content is often confidently incorrect, leading to the spread of inaccurate or misleading information.\nWe provide authorship credit for submissions, and to submit AI-generated work under one's own name would be a violation of our plagiarism policy.\nThe Data Engineering Wiki is an educational space for people to learn how to write effective technical documentation. Using generative AI, at this point, negatively impacts that desired learning goal.\n\n## Tag glossary\n\nWe use tags mostly to indicate the status of a note:\n\n-   #seedling - All new notes get this tag. If you want to contribute, notes with this tag are usually a great place to start! Might need a template applied to it or if it already has it, no placeholders have been filled out.\n-   #incubating - Some preliminary work was done, it has a template with placeholders but it was only partially filled out. These notes still have incomplete information and need their placeholders filled out!\n-   #evergreen - Notes that have been updated and no longer have placeholders in them. Usually these notes need corrections, updates or additions to existing knowledge. Before adding new content to these notes, please make sure you have read [[#Contributing Rules|how to contribute]].\n\nWe also have a #placeholder tag we use to signal the type of information that is missing on a note. Most of them are self-explanatory:\n\n-   #placeholder/title\n-   #placeholder/author - Information about the author is missing (can include their name, Discord handle, GitHub username, GitHub sponsors page or buy me a coffee links)\n-   #placeholder/description\n-   #placeholder/link\n-   #placeholder/screenshot\n-   #placeholder/tool - Similar to the author tag, any information about a tool\n\nIf this is your first pull request, check out [Make a Pull Request](http://makeapullrequest.com/), which [@kentcdodds](https://github.com/kentcdodds) created as a walkthrough video tutorial. You can also practice making a pull request in the [First Contributions](https://github.com/Roshanjossey/first-contributions) repository, created by [@Roshanjossey](https://github.com/Roshanjossey).\n"
        },
        {
          "name": "Community",
          "type": "tree",
          "content": null
        },
        {
          "name": "Concepts",
          "type": "tree",
          "content": null
        },
        {
          "name": "FAQ",
          "type": "tree",
          "content": null
        },
        {
          "name": "Guides",
          "type": "tree",
          "content": null
        },
        {
          "name": "Index.md",
          "type": "blob",
          "size": 2.7333984375,
          "content": "---\ncssclasses:\n  - list-cards\n---\n\n## What is the Data Engineering Wiki?\n\nWelcome! This is the official wiki built and maintained by the [[Community|data engineering community]]. The data engineering wiki is an open-source living document that contains a constantly evolving collection of topics related to data engineering.\n\n⭐ Star our [GitHub](https://github.com/data-engineering-community/data-engineering-wiki) repo and 🗣️ [Share the wiki](https://www.linkedin.com/shareArticle?mini=true&url=https://dataengineering.wiki/Index)\n\n## Start Here: [[Getting Started With Data Engineering]]\n\n- [[Concepts|💭 Concepts]]\n\t- Concepts related to Data Engineering.\n- [[FAQ|❓ FAQ]]\n\t- Frequently asked questions about Data Engineering.\n- [[Guides|🧭 Guides]]\n\t- Understand how to make Data Engineering decisions.\n- [[Tools|🛠️ Tools]]\n\t- Commonly used tools for Data Engineering.\n- [[Tutorials|🔢 Tutorials]]\n\t- Step-by-step instructions for Data Engineering tasks.\n- [[Learning Resources|📚 Learning Resources]]\n\t- Learn Data Engineering with resources recommended by other Data Engineers.\n\n> [!success]- [[Get Involved|Want to get involved? Click here!]]\n\n## Gold Sponsors\n\n<div class=\"sponsors-gold\" style=\"display: flex; flex-wrap: wrap;\">\n\t<a href=\"https://dataengjobs.com/\">\n\t    <img src=\"https://avatars.githubusercontent.com/u/109050594?v=4\" width=250>\n\t</a>\n\t<a href=\"https://greatexpectations.io/cloud/?utm_source=reddit&utm_medium=sponsored&utm_campaign=r-dataengineering&utm_content=cloud-signup\">\n\t    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/41d72633bf4c6fea9f1d073f590dfc7d331359b4/Assets/great-expectations-logo.svg\" width=250>\n\t</a>\n</div>\n\n## Silver Sponsors\n\n<div class=\"sponsors-silver\" style=\"display: flex; flex-wrap: wrap;\">\n<a href=\"https://bit.ly/dataengwiki\">\n    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/main/Assets/starburst-logo.svg\" width=200>\n</a>\n</div>\n\n\n<iframe src=\"https://dataengineeringcommunity.substack.com/embed\" width=\"100%\" height=\"320\" style=\"border:1px solid #EEE; background:white;\" frameborder=\"0\" scrolling=\"no\"></iframe>\n\n\n%% wiki footer: Please don't edit anything below this line %%\n\n## This note in GitHub\n\n<span class=\"git-footer\">[Edit In GitHub](https://github.dev/data-engineering-community/data-engineering-wiki/blob/main/Index.md \"git-hub-edit-note\") | [Copy this note](https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/main/Index.md \"git-hub-copy-note\")</span>\n\n<span class=\"git-footer\">Was this page helpful?\n[👍](https://tally.so/r/mOaxjk?rating=Yes&url=https://dataengineering.wiki/Index) or [👎](https://tally.so/r/mOaxjk?rating=No&url=https://dataengineering.wiki/Index)</span>\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.8828125,
          "content": "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n"
        },
        {
          "name": "Learning Resources.md",
          "type": "blob",
          "size": 2.423828125,
          "content": "---\nAliases: []\nTags: []\n---\n\n## All Resources\nA collection of recommended resources by other Data Engineers. [Submit your own](https://airtable.com/shrU3rPnmrjx33ZmQ)!\n<iframe class=\"airtable-embed\" src=\"https://airtable.com/embed/shrvWUqOPg9x6x8IM?backgroundColor=blue&viewControls=on\" frameborder=\"0\" onmousewheel=\"\" width=\"100%\" height=\"533\" style=\"background: transparent; border: 1px solid #ccc;\"></iframe>\n\n<iframe src=\"https://dataengineeringcommunity.substack.com/embed\" width=\"100%\" height=\"320\" style=\"border:1px solid #EEE; background:white;\" frameborder=\"0\" scrolling=\"no\"></iframe>\n\n## Data Modeling Learning Resources\n> [!info]- View Resources\n><iframe class=\"airtable-embed\" src=\"https://airtable.com/embed/shrJLMduWxPqrQ8lX?backgroundColor=blue&viewControls=on\" frameborder=\"0\" onmousewheel=\"\" width=\"100%\" height=\"533\" style=\"background: transparent; border: 1px solid #ccc;\"></iframe>\n\n## Data Warehousing Learning Resources\n> [!info]- View Resources\n><iframe class=\"airtable-embed\" src=\"https://airtable.com/embed/shroh8Woul8OuHFFo?backgroundColor=blue&viewControls=on\" frameborder=\"0\" onmousewheel=\"\" width=\"100%\" height=\"533\" style=\"background: transparent; border: 1px solid #ccc;\"></iframe>\n\n## Python Learning Resources\n> [!info]- View Resources\n><iframe class=\"airtable-embed\" src=\"https://airtable.com/embed/shrgk7avCXvVF49xM?backgroundColor=blue&viewControls=on\" frameborder=\"0\" onmousewheel=\"\" width=\"100%\" height=\"533\" style=\"background: transparent; border: 1px solid #ccc;\"></iframe>\n\n## SQL Learning Resources\n> [!info]- View Resources\n><iframe class=\"airtable-embed\" src=\"https://airtable.com/embed/shrmFJN87yaSS7wVR?backgroundColor=blue&viewControls=on\" frameborder=\"0\" onmousewheel=\"\" width=\"100%\" height=\"533\" style=\"background: transparent; border: 1px solid #ccc;\"></iframe>\n\n%% wiki footer: Please don't edit anything below this line %%\n\n## This note in GitHub\n\n<span class=\"git-footer\">[Edit In GitHub](https://github.dev/data-engineering-community/data-engineering-wiki/blob/main/Learning%20Resources.md \"git-hub-edit-note\") | [Copy this note](https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/main/Learning%20Resources.md \"git-hub-copy-note\")</span>\n\n<span class=\"git-footer\">Was this page helpful?\n[👍](https://tally.so/r/mOaxjk?rating=Yes&url=https://dataengineering.wiki/Learning%20Resources) or [👎](https://tally.so/r/mOaxjk?rating=No&url=https://dataengineering.wiki/Learning%20Resources)</span>\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.0400390625,
          "content": "<div align=\"center\">\n  <a href=\"https://github.com/data-engineering-community/data-engineering-wiki\">\n    <img width=\"200\" height=\"200\" src=\"Assets/logo.svg\">\n  </a>\n  <br>\n  <img alt=\"GitHub repo size\" src=\"https://img.shields.io/github/repo-size/data-engineering-community/data-engineering-wiki\">\n  <a href=\"https://dataengineering.wiki\">\n  <img alt=\"Website\" src=\"https://img.shields.io/website?url=https%3A%2F%2Fdataengineering.wiki\">\n  </a>\n\n# Data Engineering Wiki\n\nThe best place to learn data engineering. Built and maintained by the [data engineering community](https://dataengineering.wiki/Community/Community).\n\n[![Subreddit subscribers](https://img.shields.io/reddit/subreddit-subscribers/dataengineering?style=social)](https://www.reddit.com/r/dataengineering/)\n</div>\n\n## What's inside?\n\nA collection of notes that are connected organically but loosely organized into the following categories:\n\n1. **[Concepts](https://dataengineering.wiki/Concepts/Concepts):** Concepts related to Data Engineering.\n2. **[FAQ](https://dataengineering.wiki/FAQ/FAQ):** Frequently asked questions about Data Engineering.\n3. **[Guides](https://dataengineering.wiki/Guides/Guides):** Understand how to make Data Engineering decisions.\n4. **[Tools](https://dataengineering.wiki/Tools/Tools):** Commonly used tools for Data Engineering.\n5. **[Tutorials](https://dataengineering.wiki/Tutorials/Tutorials):** Step-by-step instructions for Data Engineering tasks.\n6. **[Learning Resources](https://dataengineering.wiki/Learning+Resources):** Learn Data Engineering with resources recommended by the Data Engineering community.\n\n## Sponsors\n\nThe Data Engineering Wiki is an CC0-1.0-licensed open source project with its ongoing development made possible entirely by the support of these awesome [backers](https://github.com/data-engineering-community/data-engineering-wiki/blob/main/BACKERS.md). If you'd like to join them, please consider [sponsoring the Data Engineering Wiki's development](https://github.com/sponsors/data-engineering-community).\n\n<div align=\"center\">\n\n## Gold Sponsors\n\n<a href=\"https://dataengjobs.com/\">\n    <img src=\"https://avatars.githubusercontent.com/u/109050594?v=4\" width=250>\n</a>\n<a href=\"https://greatexpectations.io/cloud/?utm_source=reddit&utm_medium=sponsored&utm_campaign=r-dataengineering&utm_content=cloud-signup\">\n    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/41d72633bf4c6fea9f1d073f590dfc7d331359b4/Assets/great-expectations-logo.svg\" width=250>\n</a>\n\n## Silver Sponsors\n\n<a href=\"https://bit.ly/dataengwiki\">\n    <img src=\"https://raw.githubusercontent.com/data-engineering-community/data-engineering-wiki/main/Assets/starburst-logo.svg\" width=200>\n</a>\n\n</div>\n\n## How to run it locally\n\nThe wiki can be used offline and can be used as-is or incorporated into your own personal knowledge management system. It is built to be used with [Obsidian](https://obsidian.md/) (free, no affiliation) but is compatible with other tools as well such as [Foam](https://github.com/foambubble/foam) or [Roam Research](https://roamresearch.com/).\n\n1. Download this GitHub repository.\n2. Download the free [Obsidian desktop app](https://obsidian.md/).\n3. Run the Obsidian app and choose **Open folder as vault**, click **Open**.\n4. In the file browser, choose the folder where you downloaded the GitHub repository, click **Open**.\n\nSee [Obsidian help](https://help.obsidian.md/) for questions on using Obsidian.\n\n## Contributing\n\nThere are many different ways to contribute to the wiki's development. If you're interested, check out our [contributing guidelines](https://github.com/data-engineering-community/data-engineering-wiki/blob/main/CONTRIBUTING.md) to learn how you can get involved.\n\nThank you to all of our [contributors](https://github.com/data-engineering-community/data-engineering-wiki/graphs/contributors) who shared their data engineering knowledge!\n\n<a href=\"https://github.com/data-engineering-community/data-engineering-wiki/graphs/contributors\">\n  <img src=\"https://contrib.rocks/image?repo=data-engineering-community/data-engineering-wiki\" />\n</a>\n"
        },
        {
          "name": "Templates",
          "type": "tree",
          "content": null
        },
        {
          "name": "Tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "Tutorials",
          "type": "tree",
          "content": null
        },
        {
          "name": "publish.css",
          "type": "blob",
          "size": 4.267578125,
          "content": ".graph-view.color-fill {\n  /* Supports all CSS color directives, like #HEX, rgb and rgba */\n  color: #7f6df2;\n}\n\n.site-footer {\n  display: none;\n}\n\n.site-body-left-column-site-name {\n  text-align: center;\n  margin: 0 auto;\n}\n\n.tree-item-self[data-path^='Concepts/Concepts'] {\n  display: none;\n}\n\n.tree-item-self[data-path^='FAQ/FAQ'] {\n  display: none;\n}\n\n.tree-item-self[data-path^='Guides/Guides'] {\n  display: none;\n}\n\n.tree-item-self[data-path^='Tools/Tools'] {\n  display: none;\n}\n\n.tree-item-self[data-path^='Tutorials/Tutorials'] {\n  display: none;\n}\n\n/* Footer Heading */\nh2[data-heading=\"This note on GitHub\"],\nh2[data-heading=\"This note in GitHub\"] {\n    font-size: var(--editor-font-size);\n    text-align: center;\n}\nh2[data-heading=\"This note on GitHub\"]::before,\nh2[data-heading=\"This note in GitHub\"]::before {\n    content: '';\n    display: block;\n    height: 2px;\n    background: var(--background-modifier-border);\n    margin-bottom: 10px;\n}\n\n/* Style GitHub footer links */\nspan.git-footer {\n  display: block;\n  text-align: center;\n  bottom: 0;\n}\n.git-footer .external-link {\n  background-image: url();\n  padding-right: 0;\n  padding: 6px 15px;\n  background: var(--interactive-normal);\n  border-radius: 4px;\n  text-decoration: none;\n}\n.git-footer .external-link:hover {\n  background: var(--interactive-accent-hover);\n  color: var(--text-on-accent);\n}\n/* Footer Link Icons */\n.git-footer .external-link::before {\n  vertical-align: -3px;\n  padding-right: 4px;\n}\n.git-footer .external-link[title=\"git-hub-edit-note\"]::before {\n  content: url('data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20xmlns%3Axlink%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxlink%22%20width%3D%221em%22%20height%3D%221em%22%20preserveAspectRatio%3D%22xMidYMid%20meet%22%20viewBox%3D%220%200%2024%2024%22%3E%3Cpath%20d%3D%22M3%2017.25V21h3.75L17.81%209.94l-3.75-3.75L3%2017.25zM20.71%207.04a.996.996%200%200%200%200-1.41l-2.34-2.34a.996.996%200%200%200-1.41%200l-1.83%201.83l3.75%203.75l1.83-1.83z%22%20fill%3D%22currentColor%22%2F%3E%3C%2Fsvg%3E');\n}\n.git-footer .external-link[title=\"git-hub-copy-note\"]::before {\n  content: url('data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20xmlns%3Axlink%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxlink%22%20width%3D%221em%22%20height%3D%221em%22%20preserveAspectRatio%3D%22xMidYMid%20meet%22%20viewBox%3D%220%200%20256%20256%22%3E%3Cpath%20d%3D%22M216%2032H88a8%208%200%200%200-8%208v40H40a8%208%200%200%200-8%208v128a8%208%200%200%200%208%208h128a8%208%200%200%200%208-8v-40h40a8%208%200%200%200%208-8V40a8%208%200%200%200-8-8zm-8%20128h-32V88a8%208%200%200%200-8-8H96V48h112z%22%20fill%3D%22currentColor%22%2F%3E%3C%2Fsvg%3E');\n}\n.git-footer .external-link[title=\"git-hub-download-vault\"]::before {\n  content: url('data:image/svg+xml,%3Csvg%20xmlns%3D%22http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%22%20xmlns%3Axlink%3D%22http%3A%2F%2Fwww.w3.org%2F1999%2Fxlink%22%20width%3D%221em%22%20height%3D%221em%22%20preserveAspectRatio%3D%22xMidYMid%20meet%22%20viewBox%3D%220%200%2024%2024%22%3E%3Cpath%20d%3D%22M19%209h-4V3H9v6H5l7%207l7-7zM5%2018v2h14v-2H5z%22%20fill%3D%22currentColor%22%2F%3E%3C%2Fsvg%3E')\n}\n\n/* List Cards */\n.list-cards div > ul {\n    --link-color: var(--text-normal);\n    --link-unresolved-color: var(--text-muted);\n    --link-decoration: none;\n    --link-decoration-hover: none;\n    --link-external-color: var(--text-normal);\n    --link-external-decoration: none;\n    --link-external-decoration-hover: none;\n    display: grid;\n    gap: 8px;\n    grid-template-columns: repeat(2, minmax(0, 1fr));\n    padding:0;\n}\n.list-cards div > ul > li {\n    display: flex;\n    border-radius: var(--radius-s);\n    border: 1px solid var(--color-base-25);\n}\n.list-cards div > ul > li:has(ul) {\n\tflex-direction: column;\n}\n.list-cards div > ul > li:has(ul) a {\n\tflex-grow: 0;\n}\n.list-cards div ul > li a {\n\tflex-grow: 1;\n    padding: 16px;\n    font-weight: var(--font-semibold);\n    background: none;\n}\n.list-cards div ul > li:hover {\n    border-color: var(--color-base-35);\n}\n\n.theme-dark .list-cards div ul > li {\n    background-color: var(--background-secondary);\n}\n.list-cards div ul ul {\n    display: block;\n    width: 100%;\n    color: var(--text-muted);\n    font-size: var(--font-smaller);\n    margin-top: -8px;\n    padding: 0 16px 16px;\n}\n.list-cards div ul ul > li {\n    display: block;\n}\n"
        },
        {
          "name": "publish.js",
          "type": "blob",
          "size": 1.626953125,
          "content": "/*\nSince this site is made with Obsidian, we use this publish.js file to customize the site.\nhttps://help.obsidian.md/Obsidian+Publish/Customize+your+site\n*/\n\nconst site = \"https://dataengineering.wiki\";\n\n// Customize navigation order\n\nlet navOrderAsc = [\"Index\", \"Learning Resources\"]; // These go on top\nlet navOrderDsc = []; // These go at the bottom\n\n// Items not mentioned go in between in alphabetical order\n\nvar siteLeft = document.querySelector('.site-body-left-column');\nvar siteNav = siteLeft.querySelector('.nav-view-outer');\nvar navContainer = siteNav.querySelector('.tree-item').querySelector('.tree-item-children');\n\nfor (const item of navOrderAsc.reverse()) {\n    navItem = navContainer.querySelector(`[data-path=\"${item}.md\"]`);\n    if (navItem == null) continue;\n    moveItem = navItem.parentElement;\n    navContainer.prepend(moveItem);\n};\n\nfor (const item of navOrderDsc.reverse()) {\n    navItem = navContainer.querySelector(`[data-path=\"${item}.md\"]`);\n    if (navItem == null) continue;\n    moveItem = navItem.parentElement;\n    navContainer.append(moveItem);\n};\n\n\n// Each folder contains a note with the same name as the folder, add a redirect to the note when the folder is clicked.\n// Expand arrow should not be affected.\nlet folders = [\"Community\", \"Concepts\", \"FAQ\", \"Guides\", \"Tools\", \"Tutorials\"];\nfor (const item of folders) {\n\n    var element = navContainer.querySelector(`[data-path=\"${item}\"] div.tree-item-inner`);\n    element.setAttribute('data-link', `${site}/${item}/${item}`);\n    element.addEventListener('click', function (e) {\n        window.location.href = e.target.getAttribute('data-link');\n        return false;\n    });\n};\n"
        }
      ]
    }
  ]
}