{
  "metadata": {
    "timestamp": 1736565578150,
    "page": 452,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQ2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ashima/webgl-noise",
      "stars": 2828,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.1181640625,
          "content": "Copyright (C) 2011 by Ashima Arts (Simplex noise)\nCopyright (C) 2011-2016 by Stefan Gustavson (Classic noise and others)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n"
        },
        {
          "name": "README",
          "type": "blob",
          "size": 1.5224609375,
          "content": "The wiki for this repository contains more information.\n\nSimplex noise functions are (C) Ashima Arts and Stefan Gustavson\nClassic noise functions are (C) Stefan Gustavson\nCellular noise functions are (C) Stefan Gustavson\nThe \"psrdnoise\" functions are (C) Stefan Gustavson\n\nSource code for the noise functions is released under the\nconditions of the MIT license. See the file LICENSE for details.\n\nThe simplex noise functions follow Ken Perlin's original idea,\nmore clearly explained in Stefan Gustavson's paper\n\"Simplex noise demystified\"\nhttp://www.itn.liu.se/~stegu/simplexnoise/simplexnoise.pdf\nbut without using any uniform arrays or texture engines.\n\nMany other noise implementations make heavy use of a\ntexture lookup table and are texture bandwidth limited.\nThe noise functions in this library, however, are completely\nself contained with no dependency on external data.\nWhile not quite as fast as texture-based implementations\non typical current desktop GPUs, they are more scalable to\nmassive parallelism and much more convenient to use, and\nthey can make good use of unused ALU resources when run\nconcurrently with a typical texture-intensive rendering.\n\n2016-05-13: Ashima Arts now seems to be defunct as a company\n(their website and email addresses have ceased to function)\nso I cloned the \"ashima-arts\" repository here:\n\nhttps://github.com/stegu/webgl-noise\n\nThis site is still heavily linked from all over the place on the\nInternet, so I'm still (2024) maintaining it. However, I can't\npromise that I will keep doing that. Use my clone instead.\n"
        },
        {
          "name": "benchmark",
          "type": "tree",
          "content": null
        },
        {
          "name": "demo",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}