{
  "metadata": {
    "timestamp": 1736565452625,
    "page": 304,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "solvespace/solvespace",
      "stars": 3289,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".clang-format",
          "type": "blob",
          "size": 1.2119140625,
          "content": "---\n# Things explicitly enumerated in CONTRIBUTING.md\nIndentWidth: 4\nUseTab: Never\nSpaceBeforeParens: Never\nBreakBeforeBraces: Attach\nColumnLimit: 100\n# Docs say 100, but some places look more like 80.\n#ColumnLimit: 80\n\n# Based on minimizing diff when applying clang-format\nAccessModifierOffset: -4\nAlignConsecutiveAssignments: true\nAlignEscapedNewlines: DontAlign\nAllowShortBlocksOnASingleLine: false\nAllowShortCaseLabelsOnASingleLine: true\nAllowShortLoopsOnASingleLine: false\nAlwaysBreakTemplateDeclarations: Yes # MultiLine\nBreakConstructorInitializers: BeforeColon\nDerivePointerAlignment: true\nFixNamespaceComments: true\nIndentPPDirectives: AfterHash\nMaxEmptyLinesToKeep: 2\nNamespaceIndentation: Inner\nSpaceAfterTemplateKeyword: false\n\n# No way to remove all space around operators as seen in much of the code I looked at.\n#SpaceBeforeAssignmentOperators: false\n\n# Only seen some of the time (mostly just variables, not functions)\n# but clang-format only has a true/false\n#AlignConsecutiveDeclarations: true\n\n\n# Would be nice to turn on eventually, maybe?\nSortIncludes: false\nSortUsingDeclarations: false\n\n# Hard to tell what the desired config here was.\n# AllowShortFunctionsOnASingleLine: Inline\nAllowShortFunctionsOnASingleLine: None\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.12890625,
          "content": "* text=auto\n*.cpp  text\n*.h    text\n*.txt  text\n*.gz   binary\n*.ico  binary\n*.jpg  binary\n*.lib  binary\n*.png  binary\n*.slvs binary\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.322265625,
          "content": "/CMakeCache.txt\n/build*/\n/test/**/*.diff.*\n/test/**/*.curr.*\n*.trace\n/debian/tmp/\n/debian/*.log\n/debian/*.substvars\n/debian/*.debhelper\n/debian/files\n/debian/solvespace/\n/debian/libslvs1/\n/debian/libslvs1-dev/\n/obj-*/\n/*.slvs\n.vscode/\n\n# Visual Studio\nout/\n.vs/\nCMakeSettings.json\n__pycache__/\nsolvespace.egg-info/\ndist/\n.DS_Store"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.861328125,
          "content": "[submodule \"extlib/zlib\"]\n\tpath = extlib/zlib\n\turl = https://github.com/madler/zlib\n\tignore = dirty\n[submodule \"extlib/libpng\"]\n\tpath = extlib/libpng\n\turl = https://github.com/glennrp/libpng\n[submodule \"extlib/freetype\"]\n\tpath = extlib/freetype\n\turl = https://git.savannah.nongnu.org/r/freetype/freetype2.git/\n[submodule \"extlib/libdxfrw\"]\n\tpath = extlib/libdxfrw\n\turl = https://github.com/solvespace/libdxfrw.git\n[submodule \"extlib/pixman\"]\n\tpath = extlib/pixman\n\turl = https://github.com/solvespace/pixman\n[submodule \"extlib/cairo\"]\n\tpath = extlib/cairo\n\turl = https://github.com/solvespace/cairo\n[submodule \"extlib/angle\"]\n\tpath = extlib/angle\n\turl = https://github.com/solvespace/angle\n[submodule \"extlib/mimalloc\"]\n\tpath = extlib/mimalloc\n\turl = https://github.com/microsoft/mimalloc\n[submodule \"extlib/eigen\"]\n\tpath = extlib/eigen\n\turl = https://gitlab.com/libeigen/eigen.git\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 18.2275390625,
          "content": "Changelog\n=========\n\n3.x - development\n---\n\nGeometric Modelling Kernel (NURBS)\n\n* Improve the difference boolean operations.\n* Extrude groups have a checkbox to allow skewing - 3 DoF for the extrude direction.\n\nConstraints (new and improved):\n\n* Add Parallel and Perpendicular constraints for 2 faces.\n* The equal angle constraint is moved to the `N` shortcut and menu item to allow equal length (`Q`) to be applied to three or four lines.\n\nAllow these constraints to be applied to more entities at once:\n\n* More than two line Segments - equal length.\n* More than two Arcs and/or circles - equal diameter/radius.\n* Any number of Lines - horizontal or vertical.\n* More than two points - horizontal or vertical.\n* Point on face can be applied to a point and 1-3 faces at once.\n* More than two points coincident.\n\nSketching\n\n* `Image` sketch elements are not copied in 3d groups (extrude, lathe, revolve, helix) by default. `Toggle Construction` for an image to get the old behavior.\n* New option to use radius instead of diameter for circle and arc dimensions.\n* Dimensions on arcs default to radius instead of diameter. Uncheck `use radius` in the Property Browser to get diameters.\n* `Text in True Type Font` elements now support basic kerning. Enable it with `apply kerning` in the Property Browser.\n\nTranslations (now in 10 languages!)\n\n* Added Czech  cs_CZ.\n* Added Japanese ja_JP.\n* Update translation for French fr_FR, Russian ru_RU, Chinese zh_CN and Ukrainian uk_UA.\n\nOther User interface changes:\n\n* `CTRL+Tab` hides/shows the toolbar.\n* Marquee selection of line segments is now precise.\n* Speed up the animation when moving the view, for example when pressing `F2` or `F3`.\n* Pressing ESC while drawing a sketch entity now deletes the entity rather than completing it.\n* `CTRL+Shift+S` shortcut for \"Save As...\"\n* New option \"use camera mouse navigation\" for camera (instead of the default model) rotation navigation.\n* Sketches can be displayed with only dimensions visible (the button controlling visibility of constraints in the Property Browser has a new state).\n* More entity types described in the text screens.\n* A new option to `display the full path in the title bar`; or not.\n* Handle smooth scrolling (mouse wheel zoom) on GTK/Linux.\n* The embedded vector font (used for the UI and labels):\n\t* now has many new and improved Chinese characters\n\t* includes the Greek alphabet\n\t* improved \"є\"\n\t* added superscript 5 \"⁵\"\n\t* fiexd crash when typing \"£\"\n\nOther\n\n* Merged and improved the experimental Web version (Emscripten port).\n* Better Flatpack support.\n* Several bug fixes and usability improvements.\n* Allow 32 bit SolveSpace to access up to 4GB of RAM to allow working on larger projects.\n\nBug fixes:\n\n* `Paste Transformed` on elements that contain a point-line distance does not flip any more.\n* Fix saving assemblies when opened with a relative path on the command line.\n\n3.1\n---\n\nConstraints:\n\n* Arcs length ratio and difference.\n* Arc & Line length ratio and difference.\n* Allow comments to be associated with point entities.\n\nSketching:\n\n* Support for pan, zoom and rotate trackpad gestures on macOS\n* Add \"exploded view\" to sketches via \"\\\\\" key. Shows sketch elements separated\n  by a configurable distance perpendicular to the sketch plane.\n* Added Feet-Inches as a unit of measure. Inputs are still in inches.\n  But the display shows feet, inches, and fraction of an inch.\n* Added an optional \"pitch\" parameter to helix extrusions (in the text window)\n* Allow use of Point & Normal to define \"sketch-in-new-workplane\".\n* Update \"Property Browser\" live while dragging the sketch.\n\nMISC:\n\n* Add a link to the GitHub commit from which SolveSpace was built in the Help\n  menu.\n* Make all points, vectors and normals shown in the Property Browser into\n  active links. This makes them explorable and selectable.\n* Load 16bit PNG images correctly by re-scaling to 8bit.\n* Fixed hang when trying to display characters missing from the embedded font.\n* The main window vertical size can be as small as the toolbar.\n* Configurable \"SafeHeight\" parameter instead of the fixed 5mm for G-code export.\n* Add Spanish / Argentina translation.\n* Move \"perspective factor\", \"lighting direction\" and \"explode distance\" from\n  the \"configuration\" screen to the \"view\" screen.\n* Add a \"∆\" suffix to groups which have \"force to triangle mesh\" ticked\n* Gray the group name in the text window for groups with suppressed solid model.\n* Added the ability to Link STL files.\n* When linking circuit boards (IDF .emn files) show keepout regions as construction entities.\n\nPerformance:\n\n* Speed up sketches with many constraints by roughly 8x by using the Eigen\n  library in the solver. The maximum unknowns increased from 1024 to 2048.\n* Add a \"suppress dof calculation\" setting to groups - increases performance for\n  complex sketches.\n* More changes to the ID list implementation.\n\n3.0\n---\n\nNew sketch features:\n\n* New intersection boolean operation for solid models.\n* New groups, revolution and helical extrusion.\n* Extrude, lathe, translate and rotate groups can use the \"assembly\"\n  boolean operation, to increase performance.\n* The solid model of extrude and lathe groups can be suppressed,\n  for splitting a single model in multiple parts to export,\n  or if only the generated entities are desired, without the mesh.\n* Translate and rotate groups can create n-dimensional arrays using\n  the \"difference\" and \"assembly\" boolean operations.\n* A new sketch in workplane group can be created based on existing workplane.\n* TTF text request has two additional points on the right side, which allow\n  constraining the width of text.\n* Image requests can now be created, similar to TTF text requests.\n  This replaces the \"style → background image\" feature.\n* Irrelevant points (e.g. arc center point) are not counted when estimating\n  the bounding box used to compute chord tolerance.\n* When adding a constraint which has a label and is redundant with another\n  constraint, the constraint is added as a reference, avoiding an error.\n* Datum points can be copied and pasted.\n* \"Split Curves at Intersection\" can now split curves at point lying on curve,\n  not just at intersection of two curves.\n* Property browser now shows amount of degrees of freedom in group list.\n  It also shows a yellow \"err\" if the sketch has problems (e.g. self\n  intersecting) that would propagate in subsequent groups.\n* It is now possible to press \"g\" to toggle construction on new objects while\n  they are still being drawn.\n* Allow right click to end sketching of all entities.\n\nNew constraint features:\n\n* When dragging an arc or rectangle point, it will be automatically\n  constrained to other points with a click.\n* When selecting a constraint, the requests it constraints can be selected\n  in the text window.\n* When selecting an entity, the constraints applied to it can be selected\n  in the text window.\n* Distance constraint labels can now be formatted to use SI prefixes.\n  Values are edited in the configured unit regardless of label format.\n* When creating a constraint, if an exactly identical constraint already\n  exists, it is now selected instead of adding a redundant constraint.\n* It is now possible to turn off automatic creation of horizontal/vertical\n  constraints on line segments.\n* Automatic creation of constraints no longer happens if the constraint\n  would have been redundant with other ones.\n* New option to open the constraint editor for newly created constraints\n  with a value.\n* New \"redundant constraint timeout (in ms)\" option to prevent UI freeze\n  when looking for redundant constraints.\n* Swap vertical and horizontal constraints when pasting rotated by 90/270\n  degrees.\n\nNew export/import features:\n\n* Link IDF circuit boards in an assembly (.emn files)\n* Three.js: allow configuring projection for exported model, and initially\n  use the current viewport projection.\n* Wavefront OBJ: a material file is exported alongside the model, containing\n  mesh color information.\n* DXF/DWG: 3D DXF files are imported as construction entities, in 3d.\n* VRML (WRL) triangle meshes can now be exported, useful for e.g. [KiCAD](http://kicad.org).\n* Export 2d section: custom styled entities that lie in the same\n  plane as the exported section are included.\n* Added ExportBackgroundColor in configuration for EPS, PDF, and SVG files.\n* STEP export includes object colors and transparency.\n* Default \"line styles\" have a new \"export these objects\" option.\n\nNew rendering features:\n\n* The \"Show/hide hidden lines\" button is now a tri-state button that allows\n  showing all lines (on top of shaded mesh), stippling occluded lines\n  or not drawing them at all.\n* The \"Show/hide outlines\" button is now independent from \"Show/hide edges\".\n* \"View | Darken Inactive Solids\" added. When turned off and a \"sketch in plane\"\n  group is active solids form previous groups will not be \"darkened\" (have the\n  s000d-#def-dim-solid style applied to them).\n\nNew measurement/analysis features:\n\n* New choice for base unit, meters.\n* New command for measuring total length of selected entities,\n  \"Analyze → Measure Perimeter\".\n* New command for measuring center of mass, with live updates as the sketch\n  changes, \"Analyze → Center of Mass\".\n* New option for displaying areas of closed contours.\n* When calculating volume of the mesh, volume of the solid from the current\n  group is now shown alongside total volume of all solids.\n* When calculating area, and faces are selected, calculate area of those faces\n  instead of the closed contour in the sketch.\n* When selecting a point and a line, projected distance to current\n  workplane is displayed.\n\nOther new features:\n\n* Improvements to the text window for selected entities and constraints.\n* Ambient light source added in text window to allow flat shaded renderings.\n* New command-line interface, for batch exporting and more.\n* The graphical interface now supports HiDPI screens on every OS.\n* New option to lock Z axis to be always vertical when rotating the view,\n  a.k.a. \"turntable navigation\".\n* New button to hide all construction entities.\n* New link to match the on-screen size of the sketch with its actual size,\n  \"view → set to full scale\".\n* When zooming to fit, constraints are also considered.\n* Ctrl-clicking entities now deselects them, as the inverse of clicking.\n* When clicking on an entity that shares a place with other entities,\n  the entity from the current group is selected.\n* When dragging an entity that shares a place with other entities,\n  the entity from a request is selected. For example, dragging a point on\n  a face of an extrusion coincident with the source sketch plane will\n  drag the point from the source sketch.\n* The default font for TTF text is now Bitstream Vera Sans, which is\n  included in the resources such that it is available on any OS.\n* In expressions, numbers can contain the digit group separator, \"_\".\n* The \"=\" key is bound to \"Zoom In\", like \"+\" key.\n* The numpad decimal separator key is bound to \".\" regardless of locale.\n* On Windows, full-screen mode is implemented.\n* On Linux, native file chooser dialog can be used.\n* New edit menu items \"Line Styles\", \"View Projection\" and \"Configuration\"\n  that are shortcuts to the respective configuration screens.\n* New cmake build options using -DENABLE_OPENMP=yes and -DENABLE_LTO=yes\n  to enable support for multi-threading and link-time optimization.\n* \"Shift+Scroll\" for ten times finer zoom.\n* Translations: Chinese, French, German, Russian, Turkish, Ukrainian.\n\nBugs fixed:\n\n* Fixed broken --view options for command line thumbnail image creation.\n* Some errors in Triangulation of surfaces.\n* Some NURNS boolean operations that failed particularly on surfaces\n  created with Lathe, Revolve, or Helix.\n* Segfault in Remove Spline Point context menu.\n* A point in 3d constrained to any line whose length is free no longer\n  causes the line length to collapse.\n* Curve-line constraints (in 3d), parallel constraints (in 3d), and\n  same orientation constraints are more robust.\n* Adding some constraints (vertical, midpoint, etc) twice errors out\n  immediately, instead of later and in a confusing way.\n* Constraining a newly placed point to a hovered entity does not cause\n  spurious changes in the sketch.\n* Points highlighted with \"Analyze → Show Degrees of Freedom\" are drawn\n  on top of all other geometry.\n* A step rotate/translate group using a group forced to triangle mesh\n  as a source group also gets forced to triangle mesh.\n* Paste Transformed with a negative scale does not invert arcs.\n* The tangent arc now modifies the original entities instead of deleting\n  them, such that their constraints are retained.\n* When linking a sketch file, missing custom styles are now imported from\n  the linked file.\n* 3Dconnexion SpaceMouse should now work (on Windows and macOS X).\n* Improved NURBS boolean operations on curved surfaces in some cases.\n* Show only usable fonts in the font selector.\n\n2.x\n---\n\nBug fixes:\n\n* Do not crash when changing an unconstrained lathe group between\n  union and difference modes.\n\n2.3\n---\n\nBug fixes:\n\n* Do not crash when applying a symmetry constraint to two points.\n* Fix TTF font metrics again (properly this time).\n* Fix the \"draw back faces in red\" option.\n* Fix export of wireframe as 3D DXF.\n* Various minor crashes.\n\n2.2\n---\n\nOther new features:\n\n* OS X: support 3Dconnexion devices (SpaceMouse, SpaceNavigator, etc).\n* GTK: files with uppercase extensions can be opened.\n\nBug fixes:\n\n* Do not remove autosaves after successfully opening a file, preventing\n  data loss in case of two abnormal terminations in a row.\n* Do not crash when changing autosave interval.\n* Unbreak the \"Show degrees of freedom\" command.\n* Three.js: correctly respond to controls when browser zoom is used.\n* OS X: do not completely hide main window when defocused.\n* GTK: unbreak 3Dconnexion support.\n* When pasting transformed entities, multiply constraint values by scale.\n* Fix TTF font metrics (restore the behavior from version 2.0).\n* Forcibly show the current group once we start a drawing operation.\n* DXF export: always declare layers before using them.\n* Do not truncate operations on selections to first 32 selected entities.\n* Translate and rotate groups inherit the \"suppress solid model\" setting.\n* DXF: files with paths containing non-ASCII or spaces can be exported\n  or imported.\n* Significantly improved performance when dragging an entity.\n* Various crashes and minor glitches.\n\n2.1\n---\n\nNew sketch features:\n\n* Lathe groups create circle and face entities.\n* New toolbar button for creating lathe groups.\n* Chord tolerance is separated into two: display chord tolerance (specified\n  in percents, relative to model bounding box), and export chord tolerance\n  (specified in millimeters as absolute value).\n* Bezier spline points can be added and removed after the spline is created.\n* When an unconstrained extrusion is switched between \"union\" and\n  \"difference\", its normal is flipped.\n* Groups can be added in the middle of the stack. Note that this results\n  in files incompatible with version 2.0.\n* Active group can be removed.\n* Removing an imported group does not cause all subsequent groups to also\n  be removed.\n* When a new group with a solid is created, the color is taken from\n  a previous group with a solid, if any.\n* Entities in a newly active group do not become visible.\n* When entities are selected, \"Zoom to fit\" zooms to fit only these\n  entities and not the entire sketch.\n* Zero-length edges are reported with a \"zero-length error\", not\n  \"points not all coplanar\".\n\nNew constraint features:\n\n* Height of the font used for drawing constraint labels can be changed.\n* New constraint, length difference, placed with J.\n  (Patch by Peter Ruevski)\n* Horizontal/vertical constraints are automatically added if a line segment\n  is close enough to being horizontal/vertical. This can be disabled by\n  holding Ctrl.\n* Reference dimensions and angles can be placed with Shift+D and Shift+N.\n* Copying and pasting entities duplicates any constraints that only involve\n  entities in the clipboard, as well as selected comments.\n* Diameter constraints can be shown as radius.\n* The \"pi\" identifier can be used in expressions.\n* Constraint labels can be snapped to grid.\n* Integer angles are displayed without trailing zeroes.\n* Angle constraints have proper reference lines and arrowheads.\n* Extension lines are drawn for point-line distance constraints.\n\nNew solver features:\n\n* Sketches with redundant and unsolvable constraints are distinguished.\n* New group setting, \"allow redundant constraints\". Note that it makes\n  the solver less stable.\n\nNew rendering and styling features:\n\n* New line style parameter: stippling, based on ISO 128.\n* Outlines of solids can be drawn in a particular style (by default, thick\n  lines) controlled by the \"Show outline of solid model\" button.\n* Occluded edges can be drawn in a particular style (by default, stippled\n  with short dashes) controlled by the \"Show hidden lines\" button.\n* Solids can be made transparent.\n\nNew export/import features:\n\n* The old \"import\" command (for .slvs files) is renamed to \"link\".\n* If a linked .slvs file is not found, first the relative path recorded\n  in the .slvs file is checked and then the absolute path; this is\n  an inversion of the previously used order. If it is still not found,\n  a dialog appears offering to locate it.\n* DXF and DWG files can be imported, with point-coincident, horizontal and\n  vertical constraints automatically inferred from geometry, and distance\n  and angle constraints created when a dimension placed against geometry\n  exists.\n* Triangle mesh can be exported for viewing in the browser through WebGL.\n* Export dialogs remember the last file format used, and preselect it.\n* Exported DXF files have exact circles, arcs and splines instead of\n  a piecewise linear approximation (unless hidden line removal was needed).\n* Exported DXF files preserve color and line thickness.\n* In exported DXF files, constraints are represented as DXF dimensions,\n  instead of piecewise linear geometry.\n* When exporting 2d views, overlapping lines are removed.\n\nOther new features:\n\n* Native Linux (GTK 2 and GTK 3) and Mac OS X ports.\n* Automatically save and then restore sketches if SolveSpace crashes.\n  (Patch by Marc Britten)\n* Unicode is supported everywhere (filenames, group names, TTF text,\n  comments), although RTL scripts and scripts making heavy use of ligatures\n  are not rendered correctly.\n* The vector font is grid-fitted when rendered on screen to make it easier\n  to read regardless of its size.\n\n2.0\n---\n\nInitial public release.\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 16.0859375,
          "content": "# cmake configuration\ncmake_minimum_required(VERSION 3.18...3.25)\n\ncmake_policy(SET CMP0094 NEW) # for Python*_FIND_STRATEGY=LOCATION\n\nif(CMAKE_SOURCE_DIR STREQUAL CMAKE_BINARY_DIR)\n    message(FATAL_ERROR\n            \"In-tree builds are not supported; please perform an out-of-tree build:\\n\"\n            \"    rm -rf CMakeCache.txt CMakeFiles/\\n\"\n            \"    mkdir build && cd build && cmake ..\")\nendif()\n\nlist(APPEND CMAKE_MODULE_PATH\n    \"${CMAKE_SOURCE_DIR}/cmake/\")\n\nset(CMAKE_CXX_STANDARD 11)\nset(CMAKE_CXX_STANDARD_REQUIRED YES)\n\n# for /MT on MSVC\nset(CMAKE_USER_MAKE_RULES_OVERRIDE\n   \"${CMAKE_SOURCE_DIR}/cmake/c_flag_overrides.cmake\")\nset(CMAKE_USER_MAKE_RULES_OVERRIDE_CXX\n   \"${CMAKE_SOURCE_DIR}/cmake/cxx_flag_overrides.cmake\")\n\nif(CMAKE_SYSTEM_NAME STREQUAL \"FreeBSD\")\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -stdlib=libc++\")\nendif()\n\nif (APPLE)\n    # Docs say this must be set before the first project() call\n    set(CMAKE_OSX_DEPLOYMENT_TARGET \"10.12\" CACHE STRING \"macOS minimum supported version\")\nendif()\n\n# project\n\n# NOTE TO PACKAGERS: The embedded git commit hash is critical for rapid bug triage when the builds\n# can come from a variety of sources. If you are mirroring the sources or otherwise build when\n# the .git directory is not present, please comment the following line:\ninclude(GetGitCommitHash)\n# and instead uncomment the following, adding the complete git hash of the checkout you are using:\n# set(GIT_COMMIT_HASH 0000000000000000000000000000000000000000)\n\nstring(SUBSTRING \"${GIT_COMMIT_HASH}\" 0 8 solvespace_GIT_HASH)\nproject(solvespace\n    VERSION 3.1\n    LANGUAGES C CXX ASM)\n\nset(ENABLE_GUI        ON CACHE BOOL\n    \"Whether the graphical interface is enabled\")\nset(ENABLE_CLI        ON CACHE BOOL\n    \"Whether the command line interface is enabled\")\nset(ENABLE_TESTS      ON  CACHE BOOL\n    \"Whether the test suite will be built and run\")\nset(ENABLE_COVERAGE   OFF CACHE BOOL\n    \"Whether code coverage information will be collected\")\nset(ENABLE_SANITIZERS OFF CACHE BOOL\n    \"Whether to enable Clang's AddressSanitizer and UndefinedBehaviorSanitizer\")\nset(ENABLE_OPENMP     OFF CACHE BOOL\n    \"Whether geometric operations will be parallelized using OpenMP\")\nset(ENABLE_LTO        OFF CACHE BOOL\n    \"Whether interprocedural (global) optimizations are enabled\")\noption(FORCE_VENDORED_Eigen3\n    \"Whether we should use our bundled Eigen even in the presence of a system copy\"\n    OFF)\n\nset(OPENGL 3 CACHE STRING \"OpenGL version to use (one of: 1 3)\")\n\nset(EXECUTABLE_OUTPUT_PATH ${CMAKE_BINARY_DIR}/bin)\nset(LIBRARY_OUTPUT_PATH    ${CMAKE_BINARY_DIR}/bin)\nif(\"${CMAKE_GENERATOR}\" STREQUAL \"Xcode\")\n    set(CMAKE_RUNTIME_OUTPUT_DIRECTORY $<1:${CMAKE_BINARY_DIR}/bin>)\nendif()\n\nif(CMAKE_CXX_COMPILER_ID STREQUAL \"GNU\")\n    if(CMAKE_CXX_COMPILER_VERSION VERSION_LESS 5.0)\n        # GCC 4.8/4.9 ship with broken but present <regex>. meh.\n        message(FATAL_ERROR \"GCC 5.0+ is required\")\n    endif()\nendif()\n\n# common compiler flags\ninclude(CheckCXXCompilerFlag)\n\nif (NOT APPLE)\n    set(FILE_PREFIX_MAP \"-ffile-prefix-map=${CMAKE_CURRENT_SOURCE_DIR}=.\")\n    check_cxx_compiler_flag(\"${FILE_PREFIX_MAP}\" HAS_FILE_PREFIX_MAP)\n    if(HAS_FILE_PREFIX_MAP)\n        set(CMAKE_C_FLAGS \"${CMAKE_C_FLAGS} ${FILE_PREFIX_MAP}\")\n        set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} ${FILE_PREFIX_MAP}\")\n    endif()\nendif()\n\nif(MINGW)\n    set(CMAKE_C_FLAGS   \"${CMAKE_C_FLAGS} -static-libgcc\")\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -static-libgcc -static-libstdc++\")\n    # Link 32 bit SolveSpace with --large-address-aware which allows it to access\n    # up to 3GB on a properly configured 32 bit Windows and up to 4GB on 64 bit.\n    # See https://msdn.microsoft.com/en-us/library/aa366778\n    set(CMAKE_EXE_LINKER_FLAGS \"-Wl,--large-address-aware\")\nendif()\n\n# Ensure that all platforms use 64-bit IEEE floating point operations for consistency;\n# this is most important for the testsuite, which compares savefiles directly\n# and depends on consistent rounding of intermediate results.\nif(CMAKE_SYSTEM_PROCESSOR STREQUAL \"i686\" OR CMAKE_SYSTEM_PROCESSOR STREQUAL \"X86\")\n    if(CMAKE_CXX_COMPILER_ID MATCHES \"GNU\")\n        set(FLOAT_FLAGS \"-mfpmath=sse -msse2\")\n    elseif(CMAKE_CXX_COMPILER_ID MATCHES \"Clang\")\n        set(FLOAT_FLAGS \"-msse2\")\n    endif()\n\n    set(CMAKE_C_FLAGS   \"${CMAKE_C_FLAGS} ${FLOAT_FLAGS}\")\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} ${FLOAT_FLAGS}\")\nendif()\n\nif(ENABLE_LTO)\n    include(CheckIPOSupported)\n    check_ipo_supported()\n    set(CMAKE_INTERPROCEDURAL_OPTIMIZATION TRUE)\nendif()\n\nif(ENABLE_OPENMP)\n    find_package( OpenMP REQUIRED )\n    if(OPENMP_FOUND)\n        add_library(slvs_openmp INTERFACE)\n        target_compile_options(slvs_openmp INTERFACE ${OpenMP_CXX_FLAGS})\n        target_link_libraries(slvs_openmp INTERFACE\n            ${OpenMP_CXX_LIBRARIES})\n        target_include_directories(slvs_openmp INTERFACE SYSTEM\n            ${OpenMP_CXX_INCLUDE_DIRS})\n        message(STATUS \"found OpenMP, compiling with flags: \" ${OpenMP_CXX_FLAGS} )\n    endif()\nendif()\n\nif(CMAKE_SYSTEM_NAME STREQUAL \"Linux\" OR CMAKE_SYSTEM_NAME STREQUAL \"FreeBSD\")\n    set(CMAKE_EXE_LINKER_FLAGS \"-Wl,--as-needed ${CMAKE_EXE_LINKER_FLAGS}\")\nendif()\n\nif(ENABLE_SANITIZERS)\n    if(NOT SANITIZERS)\n        set(SANITIZERS \"address;undefined\")\n    endif()\n\n    if(\"thread\" IN_LIST SANITIZERS)\n        list(REMOVE_ITEM SANITIZERS \"thread\")\n        list(APPEND SANITIZE_OPTIONS thread)\n    endif()\n    if(\"address\" IN_LIST SANITIZERS)\n        list(REMOVE_ITEM SANITIZERS \"address\")\n        list(APPEND SANITIZE_OPTIONS address)\n    endif()\n    if(\"undefined\" IN_LIST SANITIZERS)\n        list(REMOVE_ITEM SANITIZERS \"undefined\")\n        list(APPEND SANITIZE_OPTIONS alignment bounds)\n        list(APPEND SANITIZE_OPTIONS shift signed-integer-overflow integer-divide-by-zero)\n        list(APPEND SANITIZE_OPTIONS null bool enum)\n        list(APPEND SANITIZE_OPTIONS return)\n    endif()\n    if(SANITIZERS)\n        message(FATAL_ERROR \"Unknown sanitizer(s) ${SANITIZERS}\")\n    else()\n        message(STATUS \"Using sanitizer options ${SANITIZE_OPTIONS}\")\n    endif()\n\n    string(REPLACE \";\" \",\" SANITIZE_OPTIONS \"${SANITIZE_OPTIONS}\")\n\n    if (NOT APPLE)\n        set(SANITIZE_FLAGS \"-O1 -fsanitize=${SANITIZE_OPTIONS} -fno-sanitize-recover=address,undefined\")\n    else()\n        set(SANITIZE_FLAGS \"-O1 -fsanitize=${SANITIZE_OPTIONS}\")\n    endif()\n\n    if(CMAKE_CXX_COMPILER_ID MATCHES \"Clang\")\n        set(SANITIZE_FLAGS \"${SANITIZE_FLAGS} -fno-omit-frame-pointer -fno-optimize-sibling-calls\")\n    elseif(CMAKE_CXX_COMPILER_ID MATCHES \"GNU\")\n        set(SANITIZE_FLAGS \"${SANITIZE_FLAGS} -fuse-ld=gold\")\n    else()\n        message(FATAL_ERROR \"Sanitizers are only available when using GCC or Clang\")\n    endif()\n\n    set(CMAKE_C_FLAGS   \"${CMAKE_C_FLAGS} ${SANITIZE_FLAGS}\")\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} ${SANITIZE_FLAGS}\")\nendif()\n\n# common dependencies\n\nif(APPLE)\n    set(CMAKE_FIND_FRAMEWORK FIRST)\nendif()\n\nif(EMSCRIPTEN)\n    set(M_LIBRARY \"\" CACHE STRING \"libm (not necessary)\" FORCE)\nendif()\n\nif(ENABLE_GUI OR ENABLE_CLI)\n    message(STATUS \"Using in-tree libdxfrw\")\n    add_subdirectory(extlib/libdxfrw)\nendif()\n\nmessage(STATUS \"Using in-tree mimalloc\")\nset(MI_OVERRIDE OFF CACHE BOOL \"\")\nset(MI_BUILD_SHARED OFF CACHE BOOL \"\")\nset(MI_BUILD_OBJECT OFF CACHE BOOL \"\")\nset(MI_BUILD_TESTS OFF CACHE BOOL \"\")\nadd_subdirectory(extlib/mimalloc EXCLUDE_FROM_ALL)\nset(MIMALLOC_INCLUDE_DIR ${CMAKE_SOURCE_DIR}/extlib/mimalloc/include)\n\nif(NOT FORCE_VENDORED_Eigen3)\n    find_package(Eigen3 CONFIG)\nendif()\nif(FORCE_VENDORED_Eigen3 OR NOT EIGEN3_INCLUDE_DIRS)\n    message(STATUS \"Using in-tree Eigen\")\n    set(EIGEN3_FOUND             YES)\n    set(EIGEN3_INCLUDE_DIRS      ${CMAKE_SOURCE_DIR}/extlib/eigen)\nelse()\n    message(STATUS \"Using system Eigen: ${EIGEN3_INCLUDE_DIRS}\")\nendif()\nif(NOT EXISTS \"${EIGEN3_INCLUDE_DIRS}\")\n    message(FATAL_ERROR \"Eigen 3 not found on system or in-tree\")\nendif()\n\n\nif(ENABLE_GUI OR ENABLE_CLI)\n    if(WIN32 OR APPLE OR EMSCRIPTEN)\n        # On Win32 and macOS we use vendored packages, since there is little to no benefit\n        # to trying to find system versions. In particular, trying to link to libraries from\n        # Homebrew or macOS system libraries into the .app file is highly likely to result\n        # in incompatibilities after upgrades.\n\n        include(FindVendoredPackage)\n        include(AddVendoredSubdirectory)\n\n        set(FORCE_VENDORED_ZLIB     ON)\n        set(FORCE_VENDORED_PNG      ON)\n        set(FORCE_VENDORED_Freetype ON)\n\n        find_vendored_package(ZLIB zlib\n            ZLIB_LIBRARY            zlibstatic\n            ZLIB_INCLUDE_DIR        ${CMAKE_SOURCE_DIR}/extlib/zlib)\n        list(APPEND ZLIB_INCLUDE_DIR ${CMAKE_BINARY_DIR}/extlib/zlib)\n\n        find_vendored_package(PNG libpng\n            SKIP_INSTALL_ALL        ON\n            PNG_LIBRARY             png_static\n            PNG_ARM_NEON            \"off\"\n            PNG_SHARED              OFF\n            PNG_STATIC              ON\n            PNG_EXECUTABLES         OFF\n            PNG_TESTS               OFF\n            PNG_FRAMEWORK           OFF\n            PNG_PNG_INCLUDE_DIR     ${CMAKE_SOURCE_DIR}/extlib/libpng)\n        list(APPEND PNG_PNG_INCLUDE_DIR ${CMAKE_BINARY_DIR}/extlib/libpng)\n\n        find_vendored_package(Freetype freetype\n            WITH_ZLIB               OFF\n            WITH_BZip2              OFF\n            WITH_PNG                OFF\n            WITH_HarfBuzz           OFF\n            FREETYPE_LIBRARY        freetype\n            FREETYPE_INCLUDE_DIRS   ${CMAKE_SOURCE_DIR}/extlib/freetype/include)\n\n        message(STATUS \"Using in-tree pixman\")\n        set(PIXMAN_FOUND            YES)\n        set(PIXMAN_LIBRARY          pixman)\n        set(PIXMAN_BUILD_TESTS      OFF CACHE BOOL \"\")\n        set(PIXMAN_BUILD_DEMOS      OFF CACHE BOOL \"\")\n\n        set(PIXMAN_INCLUDE_DIRS     ${CMAKE_SOURCE_DIR}/extlib/pixman/pixman)\n        list(APPEND PIXMAN_INCLUDE_DIRS ${CMAKE_BINARY_DIR}/extlib/pixman/pixman)\n        add_vendored_subdirectory(extlib/pixman)\n\n        message(STATUS \"Using in-tree cairo\")\n        add_vendored_subdirectory(extlib/cairo)\n        set(CAIRO_FOUND             YES)\n        set(CAIRO_LIBRARIES         cairo)\n        set(CAIRO_INCLUDE_DIRS      ${CMAKE_SOURCE_DIR}/extlib/cairo/src)\n        list(APPEND CAIRO_INCLUDE_DIRS ${CMAKE_BINARY_DIR}/extlib/cairo/src)\n    else()\n        # On Linux and BSDs we're a good citizen and link to system libraries.\n        find_package(Backtrace)\n        find_package(PkgConfig REQUIRED)\n        find_package(ZLIB REQUIRED)\n        find_package(PNG REQUIRED)\n        find_package(Freetype REQUIRED)\n        find_package(Cairo REQUIRED)\n    endif()\nendif()\n\n# GUI dependencies\n\nif(ENABLE_GUI)\n    if(WIN32)\n        if(OPENGL STREQUAL \"3\")\n            message(STATUS \"Using in-tree ANGLE\")\n            set(ANGLE_STATIC            ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_D3D9       ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_D3D11      ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_OPENGL     ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_ESSL       ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_GLSL       ON  CACHE INTERNAL \"\")\n            set(ANGLE_ENABLE_HLSL       ON  CACHE INTERNAL \"\")\n            add_vendored_subdirectory(extlib/angle)\n            set(OPENGL_LIBRARIES        EGL GLESv2)\n            set(OPENGL_INCLUDE_DIR      ${CMAKE_SOURCE_DIR}/extlib/angle/include)\n        else()\n            find_package(OpenGL REQUIRED)\n        endif()\n\n        if(MSVC AND ${CMAKE_SIZEOF_VOID_P} EQUAL 4)\n            message(STATUS \"Using prebuilt SpaceWare\")\n            set(SPACEWARE_FOUND TRUE)\n            set(SPACEWARE_INCLUDE_DIR\n                \"${CMAKE_SOURCE_DIR}/extlib/si\")\n            set(SPACEWARE_LIBRARIES\n                \"${CMAKE_SOURCE_DIR}/extlib/si/siapp.lib\")\n        endif()\n    elseif(APPLE)\n        find_package(OpenGL REQUIRED)\n        find_library(APPKIT_LIBRARY AppKit REQUIRED)\n    elseif(EMSCRIPTEN)\n        # Everything is built in\n    else()\n        find_package(OpenGL REQUIRED)\n        find_package(SpaceWare)\n        pkg_check_modules(FONTCONFIG REQUIRED fontconfig)\n        pkg_check_modules(JSONC REQUIRED json-c)\n        pkg_check_modules(GTKMM REQUIRED gtkmm-3.0>=3.18 pangomm-1.4 x11)\n    endif()\nendif()\n\n# code coverage\n\nif(ENABLE_COVERAGE)\n    if(CMAKE_CXX_COMPILER_ID STREQUAL GNU)\n        find_program(GCOV gcov)\n    elseif(CMAKE_CXX_COMPILER_ID MATCHES Clang)\n        find_program(LLVM_COV llvm-cov)\n\n        if(LLVM_COV)\n            set(GCOV ${CMAKE_CURRENT_BINARY_DIR}/llvm-gcov.sh)\n            file(WRITE ${GCOV} \"#!/bin/sh -e\\n${LLVM_COV} gcov $*\")\n            execute_process(COMMAND chmod +x ${GCOV})\n        endif()\n    endif()\n\n    find_program(LCOV lcov)\n    find_program(GENHTML genhtml)\n    if(NOT GCOV OR NOT LCOV OR NOT GENHTML)\n        message(FATAL_ERROR \"gcov/llvm-cov and lcov are required for producing coverage reports\")\n    endif()\nendif()\n\n# translations\n\nfind_program(XGETTEXT xgettext)\nfind_program(MSGINIT  msginit)\nfind_program(MSGMERGE msgmerge)\nif(XGETTEXT AND MSGINIT AND MSGMERGE)\n    set(HAVE_GETTEXT TRUE)\nelse()\n    message(WARNING \"Gettext not found, translations will not be updated\")\n    set(HAVE_GETTEXT FALSE)\nendif()\n\n# solvespace-only compiler flags\n\nif(WIN32)\n    add_definitions(\n        -D_CRT_SECURE_NO_DEPRECATE\n        -D_CRT_SECURE_NO_WARNINGS\n        -D_SCL_SECURE_NO_WARNINGS\n        -DWINVER=0x0501\n        -D_WIN32_WINNT=0x0501\n        -D_WIN32_IE=_WIN32_WINNT\n        -DISOLATION_AWARE_ENABLED\n        -DWIN32\n        -DWIN32_LEAN_AND_MEAN\n        -DUNICODE\n        -D_UNICODE\n        -DNOMINMAX\n        -D_USE_MATH_DEFINES)\nendif()\n\nif(MSVC)\n    # Many versions of MSVC do not have the (C99) inline keyword, instead\n    # they have their own __inline; this breaks `static inline` functions.\n    # We do not want to care and so we fix this with a definition.\n    set(CMAKE_C_FLAGS \"${CMAKE_C_FLAGS} /Dinline=__inline\")\n    # Same for the (C99) __func__ special variable; we use it only in C++ code.\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} /D__func__=__FUNCTION__\")\n\n    # Multi-processor Compilation\n    set(CMAKE_C_FLAGS \"${CMAKE_C_FLAGS} /MP\")\n    set(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} /MP\")\n\n    # We rely on these /we flags. They correspond to the GNU-style flags below as\n    # follows: /w4062=-Wswitch\n    set(WARNING_FLAGS   \"${WARNING_FLAGS} /we4062\")\n\n    # Link 32 bit SolveSpace with /LARGEADDRESSAWARE which allows it to access\n    # up to 3GB on a properly configured 32 bit Windows and up to 4GB on 64 bit.\n    # See https://msdn.microsoft.com/en-us/library/aa366778\n    set(CMAKE_EXE_LINKER_FLAGS \"${CMAKE_EXE_LINKER_FLAGS} /LARGEADDRESSAWARE\")\n    set(CMAKE_SHARED_LINKER_FLAGS \"${CMAKE_SHARED_LINKER_FLAGS} /LARGEADDRESSAWARE\")\nendif()\n\nif(CMAKE_CXX_COMPILER_ID STREQUAL \"GNU\" OR CMAKE_CXX_COMPILER_ID MATCHES \"Clang\")\n    set(WARNING_FLAGS   \"-Wall -Wextra -Wno-unused-parameter -Wno-missing-field-initializers\")\n    if(CMAKE_CXX_COMPILER_ID MATCHES \"Clang\")\n        set(WARNING_FLAGS \"${WARNING_FLAGS} -Wfloat-conversion\")\n    endif()\n    # We rely on these -Werror flags.\n    set(WARNING_FLAGS   \"${WARNING_FLAGS} -Werror=switch\")\nendif()\n\nset(CMAKE_C_FLAGS   \"${CMAKE_C_FLAGS} ${WARNING_FLAGS}\")\nset(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} ${WARNING_FLAGS}\")\n\nif(WIN32)\n    set(CMAKE_RC_FLAGS  \"${CMAKE_RC_FLAGS} -l0\")\nendif()\n\nif(ENABLE_COVERAGE)\n    if(NOT (CMAKE_CXX_COMPILER_ID STREQUAL \"GNU\" OR\n            CMAKE_CXX_COMPILER_ID MATCHES \"Clang\"))\n        message(FATAL_ERROR \"Code coverage is only available on GCC and Clang\")\n    endif()\n\n    if(NOT CMAKE_BUILD_TYPE STREQUAL \"Debug\")\n        message(FATAL_ERROR \"Code coverage produces reliable results only on Debug builds\")\n    endif()\n\n    # With -fexceptions, every call becomes a branch. While technically accurate,\n    # this is not useful for us.\n    set(COVERAGE_FLAGS -fno-exceptions --coverage)\n    set(COVERAGE_LIBRARY --coverage)\nendif()\n\n# application components\nif(ENABLE_GUI OR ENABLE_CLI)\n    add_subdirectory(res)\n    add_subdirectory(exposed)\nendif()\nadd_subdirectory(src)\nif(ENABLE_TESTS)\n    add_subdirectory(test)\nendif()\nif((ENABLE_CLI OR ENABLE_GUI) AND (CMAKE_BUILD_TYPE STREQUAL \"Release\" OR CMAKE_BUILD_TYPE STREQUAL \"RelWithDebInfo\"))\n    add_subdirectory(bench)\nelse()\n    message(STATUS \"Benchmarking disabled in debug and library builds.\")\nendif()\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 10.94140625,
          "content": "Contributing to SolveSpace\n==========================\n\nContributing bug reports\n------------------------\n\nBug reports are always welcome! When reporting a bug, please include the following:\n\n  * The version of SolveSpace (use Help → About...);\n  * The operating system;\n  * The save file that reproduces the incorrect behavior, or, if trivial or impossible,\n    instructions for reproducing it.\n\nGitHub does not allow attaching `*.slvs` files, but it does allow attaching `*.zip` files,\nso any savefiles should first be archived.\n\nLicensing\n---------------\n\nSolveSpace is licensed under the GPLv3 or later and any contributions\nmust be made available under the terms of that license.\n\nContributing translations\n-------------------------\n\nTo contribute a translation, not a lot is necessary—at a minimum, you need to be able\nto edit .po files with a tool such as [poedit](https://poedit.net/). Once you have\nsuch a tool installed, take `res/messages.pot` and start translating!\n\nHowever, if you want to see your translation in action, a little more work is necessary.\nFirst, you need to be able to build SolveSpace; see [README](README.md). After that:\n\n  * Copy `res/messages.pot` to `res/locales/xx_YY.po`, where `xx` is an ISO 639-1\n    country code, and `YY` is an ISO 3166-1 language code.\n  * Add a line `xx-YY,LCID,Name` to `res/locales.txt`, where `xx-YY` have the same\n    meaning as above, `LCID` is a Windows Language Code Identifier ([MS-LCID][]\n    has a complete list), and `Name` is the full name of your locale in your language.\n  * Add `locales/xx_YY.po` in `res/CMakeLists.txt`—search for `locales/en_US.po`\n    to see where it should be added.\n\nYou're done! Recompile SolveSpace and you should be able to select your translation\nvia Help → Language.\n\n[MS-LCID]: https://msdn.microsoft.com/en-us/library/cc233965.aspx\n\nContributing code\n-----------------\n\nSolveSpace is written in C++, and currently targets all compilers compliant with C++11.\nThis includes GCC 5 and later, Clang 3.3 and later, and Visual Studio 12 (2013) and later.\n\n### High-level conventions\n\n#### Portability\n\nSolveSpace aims to consist of two general parts: a fully portable core, and platform-specific\nUI and support code. Anything outside of `src/platform/` should only use standard C++11,\nand rely on `src/platform/unixutil.cpp` and `src/platform/w32util.cpp` to interact with\nthe OS where this cannot be done through the C++11 standard library.\n\n#### Libraries\n\nSolveSpace primarily relies on the C++11 STL. STL has well-known drawbacks, but is also\nwidely supported, used, and understood. SolveSpace also includes a fair amount of use of\nbespoke containers List and IdList; these provide STL iterators, and can be used when\nconvenient, such as when reusing other code.\n\nOne notable departure here is the STL I/O threads. SolveSpace does not use STL I/O threads\nfor two reasons: (i) the interface is borderline unusable, and (ii) on Windows it is not\npossible to open files with Unicode paths through STL.\n\nWhen using external libraries (other than to access platform features), the libraries\nshould satisfy the following conditions:\n\n  * Portable, and preferably not interacting with the platform at all;\n  * Can be included as a CMake subproject, to facilitate Windows, Android, etc. builds;\n  * Use a license less restrictive than GPL (BSD/MIT, Apache2, MPL, etc.)\n\n#### String encoding\n\nInternally, SolveSpace exclusively stores and uses UTF-8 for all purposes; any `std::string`\nmay be assumed to be encoded in UTF-8. On Windows, UTF-8 strings are converted to and from\nwide strings at the boundary; see [UTF-8 Everywhere][utf8] for details.\n\n[utf8]: http://utf8everywhere.org/\n\n#### String formatting\n\nFor string formatting, a wrapper around `sprintf`, `ssprintf`, is used. A notable\npitfall when using it is trying to pass an `std::string` argument without first converting\nit to a C string with `.c_str()`.\n\n#### Filesystem access\n\nFor filesystem access, the C standard library is used. The `ssfopen` and `ssremove`\nwrappers are provided that accept UTF-8 encoded paths.\n\n#### Assertions\n\nTo ensure that internal invariants hold, the `ssassert` function is used, e.g.\n`ssassert(!isFoo, \"Unexpected foo condition\");`. Unlike the standard `assert` function,\nthe `ssassert` function is always enabled, even in release builds. It is more valuable\nto discover a bug through a crash than to silently generate incorrect results, and crashes\ndo not result in losing more than a few minutes of work thanks to the autosave feature.\n\n### Use of C++ features\n\nThe conventions described in this section should be used for all new code, but there is a lot\nof existing code in SolveSpace that does not use them. This is fine; don't touch it if it works,\nbut if you need to modify it anyway, might as well modernize it.\n\n#### Exceptions\n\nExceptions are not used primarily because SolveSpace's testsuite uses measurement\nof branch coverage, important for the critical parts such as the geometric kernel.\nEvery function call with exceptions enabled introduces a branch, making branch coverage\nmeasurement useless.\n\n#### Operator overloading\n\nOperator overloading is not used primarily for historical reasons. Instead, method such\nas `Plus` are used.\n\n#### Member visibility\n\nMember visibility is not used for implementation hiding. Every member field and function\nis `public`.\n\n#### Constructors\n\nConstructors are not used for initialization, chiefly because indicating an error\nin a constructor would require throwing an exception, nor does it use constructors for\nblanket zero-initialization because of the performance impact of doing this for common\nPOD classes like `Vector`.\n\nInstances can be zero-initialized using the aggregate-initialization syntax, e.g. `Foo foo = {};`.\nThis zero-initializes the POD members and default-initializes the non-POD members, generally\nbeing an equivalent of `memset(&foo, 0, sizeof(foo));` but compatible with STL containers.\n\n#### Input- and output-arguments\n\nFunctions accepting an input argument take it either by-value (`Vector v`) or\nby-const-reference (`const Vector &v`). Generally, passing by-value is safer as the value\ncannot be aliased by something else, but passing by-const-reference is faster, as a copy is\neliminated. Small values should always be passed by-value, and otherwise functions that do not\ncapture pointers into their arguments should take them by-const-reference. Use your judgement.\n\nFunctions accepting an output argument always take it by-pointer (`Vector *v`). This makes\nit immediately visible at the call site as it is seen that the address is taken. Arguments\nare never passed by-reference, except when needed for interoperability with STL, etc.\n\n#### Iteration\n\n`foreach`-style iteration is preferred for both STL and `List`/`IdList` containers as it indicates\nintent clearly, as opposed to `for`-style.\n\n#### Const correctness\n\nFunctions that do not mutate `this` should be marked as `const`; when iterating a collection\nwithout mutating any of its elements, `for(const Foo &elem : collection)` is preferred to indicate\nthe intent.\n\n### Coding style\n\nCode is formatted by the following rules:\n\n  * Code is indented using 4 spaces, with no trailing spaces, and lines are wrapped\n    at 100 columns;\n  * Braces are placed at the end of the line with the declaration or control flow statement;\n  * Braces are used with every control flow statement, even if there is only one statement\n    in the body;\n  * There is no space after control flow keywords (`if`, `while`, etc.);\n  * Identifiers are formatted in camel case; variables start with a lowercase letter\n    (`exampleVariable`) and functions start with an uppercase letter (`ExampleFunction`).\n\nFor example:\n\n```c++\nstd::string SolveSpace::Dirname(std::string filename) {\n    int slash = filename.rfind(PATH_SEP);\n    if(slash >= 0) {\n        return filename.substr(0, slash);\n    }\n\n    return \"\";\n}\n```\n\nIf you install [clang-format][], this style can be automatically applied by staging your changes\nwith `git add -u`, running `git clang-format`, and staging any changes it made again.\n\n[clang-format]: https://clang.llvm.org/docs/ClangFormat.html\n\nDebugging code\n--------------\n\nSolveSpace releases are thoroughly tested but sometimes they contain crash\nbugs anyway. The reason for such crashes can be determined only if the executable\nwas built with debug information.\n\n### Debugging a released version\n\nThe Linux distributions usually include separate debug information packages.\nOn a Debian derivative (e.g. Ubuntu), these can be installed with:\n\n    apt-get install solvespace-dbg\n\nThe macOS releases include the debug information, and no further action\nis needed.\n\nThe Windows releases include the debug information on the GitHub\n[release downloads page](https://github.com/solvespace/solvespace/releases).\n\n### Debugging a custom build\n\nIf you are building SolveSpace yourself on macOS, use the XCode\nCMake generator, then open the project in XCode as usual, select\nthe Debug build scheme, and build the project:\n\n    cd build\n    cmake .. -G Xcode [other cmake args...]\n\nIf you are building SolveSpace yourself on any Unix-like platform,\nconfigure or re-configure SolveSpace to produce a debug build, and\nthen build it:\n\n    cd build\n    cmake .. -DCMAKE_BUILD_TYPE=Debug [other cmake args...]\n    make\n\nIf you are building SolveSpace yourself using the Visual Studio IDE,\nselect Debug from the Solution Configurations list box on the toolbar,\nand build the solution.\n\n### Debugging with gdb\n\ngdb is a debugger that is mostly used on Linux. First, run SolveSpace\nunder debugging:\n\n    gdb [path to solvespace executable]\n    (gdb) run\n\nThen, reproduce the crash. After the crash, attach the output in\nthe console, as well as output of the following gdb commands to\na bug report:\n\n    (gdb) backtrace\n    (gdb) info locals\n\nIf the crash is not easy to reproduce, please generate a core file,\nwhich you can use to resume the debugging session later, and provide\nany other information that is requested:\n\n    (gdb) generate-core-file\n\nThis will generate a large file called like `core.1234` in the current\ndirectory; it can be later re-loaded using `gdb --core core.1234`.\n\n### Debugging with lldb\n\nlldb is a debugger that is mostly used on macOS. First, run SolveSpace\nunder debugging:\n\n    lldb [path to solvespace executable]\n    (lldb) run\n\nThen, reproduce the crash. After the crash, attach the output in\nthe console, as well as output of the following gdb commands to\na bug report:\n\n    (lldb) backtrace all\n    (lldb) frame variable\n\nIf the crash is not easy to reproduce, please generate a core file,\nwhich you can use to resume the debugging session later, and provide\nany other information that is requested:\n\n    (lldb) process save-core \"core\"\n\nThis will generate a large file called `core` in the current\ndirectory; it can be later re-loaded using `lldb -c core`.\n\n### Debugging GUI-related bugs on Linux\n\nThere are several environment variables available that make crashes\nearlier and errors more informative. Before running SolveSpace, run\nthe following commands in your shell:\n\n    export G_DEBUG=fatal_warnings\n    export LIBGL_DEBUG=1\n    export MESA_DEBUG=1\n"
        },
        {
          "name": "COPYING.txt",
          "type": "blob",
          "size": 34.32421875,
          "content": "\n                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.962890625,
          "content": "# SolveSpace\n\n<img src=\"res/freedesktop/solvespace-scalable.svg\" width=\"70\" height=\"70\" alt=\"SolveSpace Logo\" align=\"left\">\n\n[![Build Status](https://github.com/solvespace/solvespace/workflows/CD/badge.svg)](https://github.com/solvespace/solvespace/actions)\n[![solvespace](https://snapcraft.io/solvespace/badge.svg)](https://snapcraft.io/solvespace)\n[![solvespace](https://snapcraft.io/solvespace/trending.svg?name=0)](https://snapcraft.io/solvespace)\n\nThis repository contains the source code of [SolveSpace][], a parametric\n2d/3d CAD tool.\n\n[solvespace]: https://solvespace.com\n\n## Community\n\nThe official SolveSpace [website][sswebsite] has [tutorials][sstutorial],\n[reference manual][ssref] and a [forum][ssforum]; there is also an official\nIRC channel [#solvespace at web.libera.chat][ssirc].\n\n[sswebsite]: http://solvespace.com/\n[ssref]: http://solvespace.com/ref.pl\n[sstutorial]: http://solvespace.com/tutorial.pl\n[ssforum]: http://solvespace.com/forum.pl\n[ssirc]: https://web.libera.chat/#solvespace\n\n## Installation\n\n### Via Official Packages\n\n_Official_ release packages for macOS (>=10.6 64-bit) and Windows\n(>=Vista 32-bit) are available via [GitHub releases][rel]. These packages are\nautomatically built by the SolveSpace maintainers for each stable release.\n\n[rel]: https://github.com/solvespace/solvespace/releases\n\n### Via Flathub\n\nOfficial releases can be installed as a Flatpak from Flathub.\n\n[Get SolveSpace from Flathub](https://flathub.org/apps/details/com.solvespace.SolveSpace)\n\nThese should work on any Linux distribution that supports Flatpak.\n\n### Via Snap Store\n\nOfficial releases can be installed from the `stable` channel.\n\nBuilds from master are automatically released to the `edge` channel in the Snap\nStore. Those packages contain the latest improvements, but receive less testing\nthan release builds.\n\n[![Get it from the Snap Store](https://snapcraft.io/static/images/badges/en/snap-store-black.svg)](https://snapcraft.io/solvespace)\n\nOr install from a terminal:\n\n```sh\n# for the latest stable release:\nsnap install solvespace\n\n# for the bleeding edge builds from master:\nsnap install solvespace --edge\n```\n\n### Via automated edge builds\n\n> :warning: **Edge builds might be unstable or contain severe bugs!**\n> They are intended for experienced users to test new features or verify bugfixes.\n\nCutting edge builds from the latest master commit are available as zip archives\nfrom the following links:\n\n- [macOS](https://nightly.link/solvespace/solvespace/workflows/cd/master/macos.zip)\n- [Windows](https://nightly.link/solvespace/solvespace/workflows/cd/master/windows.zip)\n- [Windows with OpenMP enabled](https://nightly.link/solvespace/solvespace/workflows/cd/master/windows-openmp.zip)\n\nExtract the downloaded archive and install or execute the contained file as is\nappropriate for your platform.\n\n### Via source code\n\nIrrespective of the OS used, before building, check out the project and the\nnecessary submodules:\n\n```sh\ngit clone https://github.com/solvespace/solvespace\ncd solvespace\ngit submodule update --init\n```\n\nYou will need `git`. See the platform specific instructions below to install it.\n\n## Building on Linux\n\n### Building for Linux\n\nYou will need the usual build tools, CMake, zlib, libpng, cairo, freetype. To\nbuild the GUI, you will need fontconfig, gtkmm 3.0 (version 3.16 or later),\npangomm 1.4, OpenGL and OpenGL GLU, and optionally, the Space Navigator client\nlibrary. On a Debian derivative (e.g. Ubuntu) these can be installed with:\n\n```sh\nsudo apt install git build-essential cmake zlib1g-dev libpng-dev \\\n            libcairo2-dev libfreetype6-dev libjson-c-dev \\\n            libfontconfig1-dev libgtkmm-3.0-dev libpangomm-1.4-dev \\\n            libgl-dev libglu-dev libspnav-dev\n```\n\nOn a RedHat derivative (e.g. Fedora) the dependencies can be installed with:\n\n```sh\nsudo dnf install git gcc-c++ cmake zlib-devel libpng-devel \\\n            cairo-devel freetype-devel json-c-devel \\\n            fontconfig-devel gtkmm30-devel pangomm-devel \\\n            mesa-libGL-devel mesa-libGLU-devel libspnav-devel\n```\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\nAfter that, build SolveSpace as following:\n\n```sh\nmkdir build\ncd build\ncmake .. -DCMAKE_BUILD_TYPE=Release -DENABLE_OPENMP=ON\nmake\n\n# Optionally\nsudo make install\n```\n\nLink Time Optimization is supported by adding `-DENABLE_LTO=ON` to cmake at the\nexpense of longer build time.\n\nThe graphical interface is built as `build/bin/solvespace`, and the command-line\ninterface is built as `build/bin/solvespace-cli`. It is possible to build only\nthe command-line interface by passing the `-DENABLE_GUI=OFF` flag to the cmake\ninvocation.\n\n### Building for Windows\n\nUbuntu will require 20.04 or above. Cross-compiling with WSL is also confirmed\nto work.\n\nYou will need the usual build tools, CMake, and a Windows cross-compiler. On a\nDebian derivative (e.g. Ubuntu) these can be installed with:\n\n```sh\napt-get install git build-essential cmake mingw-w64\n```\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\nBuild 64-bit SolveSpace with the following:\n\n```sh\nmkdir build\ncd build\ncmake .. -DCMAKE_TOOLCHAIN_FILE=../cmake/Toolchain-mingw64.cmake \\\n            -DCMAKE_BUILD_TYPE=Release\nmake\n```\n\nThe graphical interface is built as `build/bin/solvespace.exe`, and the\ncommand-line interface is built as `build/bin/solvespace-cli.exe`.\n\nSpace Navigator support will not be available.\n\n### Building for web (very experimental)\n\n**Please note that this port contains many critical bugs and unimplemented core functions.**\n\nYou will need the usual build tools, cmake and [Emscripten][]. On a Debian derivative (e.g. Ubuntu) dependencies other than Emscripten can be installed with:\n\n```sh\napt-get install git build-essential cmake\n```\n\nFirst, install and prepare `emsdk`:\n\n```sh\ngit clone https://github.com/emscripten-core/emsdk\ncd emsdk\n./emsdk install latest\n./emsdk activate latest\nsource ./emsdk_env.sh\ncd ..\n```\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\nAfter that, build SolveSpace as following:\n\n```sh\nmkdir build\ncd build\nemcmake cmake .. -DCMAKE_BUILD_TYPE=Release -DENABLE_LTO=\"ON\" -DENABLE_TESTS=\"OFF\" -DENABLE_CLI=\"OFF\" -DENABLE_COVERAGE=\"OFF\"\nmake\n```\n\nThe graphical interface is built as multiple files in the `build/bin` directory with names\nstarting with `solvespace`. It can be run locally with `emrun build/bin/solvespace.html`.\n\nThe command-line interface is not available.\n\n[emscripten]: https://emscripten.org/\n\n## Building on macOS\n\nYou will need git, XCode tools, CMake and libomp. Git, CMake and libomp can be installed\nvia [Homebrew][]:\n\n```sh\nbrew install git cmake libomp\n```\n\nXCode has to be installed via AppStore or [the Apple website][appledeveloper];\nit requires a free Apple ID.\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\nAfter that, build SolveSpace as following:\n\n```sh\nmkdir build\ncd build\ncmake .. -DCMAKE_BUILD_TYPE=Release -DENABLE_OPENMP=ON\nmake\n```\n\nLink Time Optimization is supported by adding `-DENABLE_LTO=ON` to cmake at the\nexpense of longer build time.\n\nAlternatively, generate an XCode project, open it, and build the \"Release\" scheme:\n\n```sh\nmkdir build\ncd build\ncmake .. -G Xcode\n```\n\nThe application is built in `build/bin/SolveSpace.app`, the graphical interface executable\nis `build/bin/SolveSpace.app/Contents/MacOS/SolveSpace`, and the command-line interface executable\nis `build/bin/SolveSpace.app/Contents/MacOS/solvespace-cli`.\n\n[homebrew]: https://brew.sh/\n[appledeveloper]: https://developer.apple.com/download/\n\n## Building on OpenBSD\n\nYou will need git, cmake, libexecinfo, libpng, gtk3mm and pangomm.\nThese can be installed from the ports tree:\n\n```sh\npkg_add -U git cmake libexecinfo png json-c gtk3mm pangomm\n```\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\nAfter that, build SolveSpace as following:\n\n```sh\nmkdir build\ncd build\ncmake .. -DCMAKE_BUILD_TYPE=Release\nmake\nsudo make install\n```\n\nUnfortunately, on OpenBSD, the produced executables are not filesystem location independent\nand must be installed before use. By default, the graphical interface is installed to\n`/usr/local/bin/solvespace`, and the command-line interface is built as\n`/usr/local/bin/solvespace-cli`. It is possible to build only the command-line interface\nby passing the `-DENABLE_GUI=OFF` flag to the cmake invocation.\n\n## Building on Windows\n\nYou will need [git][gitwin], [cmake][cmakewin] and a C++ compiler\n(either Visual C++ or MinGW). If using Visual C++, Visual Studio 2015\nor later is required.\nIf gawk is in your path be sure it is a proper Windows port that can handle CL LF line endings.\nIf not CMake may fail in libpng due to some awk scripts - issue #1228.\n\nBefore building, [check out the project and the necessary submodules](#via-source-code).\n\n### Building with Visual Studio IDE\n\nCreate a directory `build` in\nthe source tree and point cmake-gui to the source tree and that directory.\nPress \"Configure\" and \"Generate\", then open `build\\solvespace.sln` with\nVisual C++ and build it.\n\n### Building with Visual Studio in a command prompt\n\nFirst, ensure that `git` and `cl` (the Visual C++ compiler driver) are in your\n`%PATH%`; the latter is usually done by invoking `vcvarsall.bat` from your\nVisual Studio install. Then, run the following in cmd or PowerShell:\n\n```bat\nmkdir build\ncd build\ncmake .. -G \"NMake Makefiles\" -DCMAKE_BUILD_TYPE=Release\nnmake\n```\n\n### Building with MinGW\n\nIt is also possible to build SolveSpace using [MinGW][mingw], though\nSpace Navigator support will be disabled.\n\nFirst, ensure that git and gcc are in your `$PATH`. Then, run the following\nin bash:\n\n```sh\nmkdir build\ncd build\ncmake .. -DCMAKE_BUILD_TYPE=Release\nmake\n```\n\n[gitwin]: https://git-scm.com/download/win\n[cmakewin]: http://www.cmake.org/download/#latest\n[mingw]: http://www.mingw.org/\n\n## Contributing\n\nSee the [guide for contributors](CONTRIBUTING.md) for the best way to file issues, contribute code,\nand debug SolveSpace.\n\n## License\n\nSolveSpace is distributed under the terms of the [GPL v3](COPYING.txt) or later.\n"
        },
        {
          "name": "THIRD_PARTIES.txt",
          "type": "blob",
          "size": 2.8056640625,
          "content": "This file outlines third party licenses that apply to the files and resources\nlisted with them. All file paths are relative to the SolveSpace project root.\n\nWhen redistributing SolveSpace, make sure to also reproduce this file such that\nthe paths indicating the scope of each license remain intact.\n================================================================================\n\n        Bitstream Vera, ./res/fonts/BitstreamVeraSans-Roman-builtin.ttf\n                                       ~\nCopyright (c) 2003 by Bitstream, Inc. All Rights Reserved. Bitstream Vera is a\ntrademark of Bitstream, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthe fonts accompanying this license (“Fonts”) and associated documentation files\n(the “Font Software”), to reproduce and distribute the Font Software, including\nwithout limitation the rights to use, copy, merge, publish, distribute, and/or\nsell copies of the Font Software, and to permit persons to whom the Font\nSoftware is furnished to do so, subject to the following conditions:\n\nThe above copyright and trademark notices and this permission notice shall be\nincluded in all copies of one or more of the Font Software typefaces.\n\nThe Font Software may be modified, altered, or added to, and in particular the\ndesigns of glyphs or characters in the Fonts may be modified and additional\nglyphs or characters may be added to the Fonts, only if the fonts are renamed to\nnames not containing either the words “Bitstream” or the word “Vera”.\n\nThis License becomes null and void to the extent applicable to Fonts or Font\nSoftware that has been modified and is distributed under the “Bitstream Vera”\nnames.\n\nThe Font Software may be sold as part of a larger software package but no copy\nof one or more of the Font Software typefaces may be sold by itself.\n\nTHE FONT SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF COPYRIGHT, PATENT, TRADEMARK, OR\nOTHER RIGHT. IN NO EVENT SHALL BITSTREAM OR THE GNOME FOUNDATION BE LIABLE FOR\nANY CLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING ANY GENERAL, SPECIAL, INDIRECT,\nINCIDENTAL, OR CONSEQUENTIAL DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR\nFROM OTHER DEALINGS IN THE FONT SOFTWARE.\n\nExcept as contained in this notice, the names of GNOME, the GNOME Foundation,\nand Bitstream Inc., shall not be used in advertising or otherwise to promote the\nsale, use or other dealings in this Font Software without prior written\nauthorization from the GNOME Foundation or Bitstream Inc., respectively. For\nfurther information, contact: fonts at gnome dot org.\n\n                                  -----------\n"
        },
        {
          "name": "bench",
          "type": "tree",
          "content": null
        },
        {
          "name": "cmake",
          "type": "tree",
          "content": null
        },
        {
          "name": "developer_docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "exposed",
          "type": "tree",
          "content": null
        },
        {
          "name": "extlib",
          "type": "tree",
          "content": null
        },
        {
          "name": "include",
          "type": "tree",
          "content": null
        },
        {
          "name": "js",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.57421875,
          "content": "{\n  \"name\": \"slvs\",\n  \"version\": \"0.0.0\",\n  \"description\": \"<img src=\\\"res/freedesktop/solvespace-scalable.svg\\\" width=\\\"70\\\" height=\\\"70\\\" alt=\\\"SolveSpace Logo\\\" align=\\\"left\\\">\",\n  \"main\": \"slvs.js\",\n  \"types\": \"slvs.d.ts\",\n  \"scripts\": {\n    \"test\": \"echo \\\"Error: no test specified\\\" && exit 1\"\n  },\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/solvespace/solvespace.git\"\n  },\n  \"keywords\": [],\n  \"author\": \"\",\n  \"license\": \"GNU GPL V3\",\n  \"bugs\": {\n    \"url\": \"https://github.com/solvespace/solvespace/issues\"\n  },\n  \"homepage\": \"http://solvespace.com\"\n}\n"
        },
        {
          "name": "pkg",
          "type": "tree",
          "content": null
        },
        {
          "name": "pyproject.toml",
          "type": "blob",
          "size": 1.1328125,
          "content": "[build-system]\nrequires = [\"scikit-build-core\", \"Cython\", \"cmake\", \"ninja\"]\nbuild-backend = \"scikit_build_core.build\"\n\n[project]\nname = \"solvespace\"\nversion = \"0.0.0\"\ndescription=\"SolveSpace solver wrapped with Cython\"\nreadme = \"README.md\"\nauthors = [\n  { name = \"Koen Schmeets\", email = \"koen@schmeets.de\" },\n]\nrequires-python = \">=3.7\"\nclassifiers = [\n  \"Development Status :: 4 - Beta\",\n  \"License :: OSI Approved :: MIT License\",\n  \"Programming Language :: Python :: 3 :: Only\",\n  \"Programming Language :: Python :: 3.7\",\n  \"Programming Language :: Python :: 3.8\",\n  \"Programming Language :: Python :: 3.9\",\n  \"Programming Language :: Python :: 3.10\",\n  \"Programming Language :: Python :: 3.11\",\n]\n\n[tool.scikit-build]\nwheel.expand-macos-universal-tags = true\ncmake.verbose = true\ncmake.build-type = \"RelWithDebInfo\"\nsdist.include = [\n  \".git/HEAD\",\n  \".git/refs\"\n]\nwheel.packages = [\"python/solvespace\"]\n\n[tool.scikit-build.cmake.define]\nENABLE_GUI = \"OFF\"\nENABLE_CLI = \"OFF\"\nENABLE_TESTS = \"OFF\"\nENABLE_COVERAGE = \"OFF\"\nENABLE_OPENMP = \"OFF\"\nFORCE_VENDORED_Eigen3 = \"ON\"\nENABLE_LTO = \"ON\"\nENABLE_PYTHON_LIB = \"ON\"\n\n[tool.cibuildwheel]\nbuild-verbosity = 1"
        },
        {
          "name": "python",
          "type": "tree",
          "content": null
        },
        {
          "name": "res",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "wishlist.txt",
          "type": "blob",
          "size": 0.498046875,
          "content": "O(n*log(n)) assembly of edges into contours\nfix anti-aliased edge bug with filled contours\ncrude DXF, HPGL import\na request to import a plane thing\nmake export assemble only contours in same group\nrotation of model view works about z of first point under cursor\na way to kill a slow operation\n\n-----\nrounding, as a special group\nassociative entities from solid model, as a special group\nbetter level of detail\nsome kind of import\nfaster triangulation\nloop detection\nIGES export\nincremental regen of entities\n\n\n"
        }
      ]
    }
  ]
}