{
  "metadata": {
    "timestamp": 1736565273020,
    "page": 83,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjkw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "KDE/ghostwriter",
      "stars": 4393,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2412109375,
          "content": "# SPDX-FileCopyrightText: 2022 Megan Conkle <megan.conkle@kdemail.net>\n#\n# SPDX-License-Identifier: GPL-3.0-or-later\n\n# Use UNIX line endings to pass pre-receive git hook audit on KDE Invent GitLab\n* text=auto eol=lf\n*.bat eol=crlf\n*.xsl eol=crlf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.7744140625,
          "content": "# SPDX-FileCopyrightText: 2014-2024 Megan Conkle <megan.conkle@kdemail.net>\n#\n# SPDX-License-Identifier: GPL-3.0-or-later\n\n# RC py files\nicons_rc.py\nresources_rc.py\n\n# general\nbuild/\n/build*/\n*.rej\n*.orig\n*.out\nCMakeLists.txt.user*\n/.clang-format\n/.idea\n\n# kate\n*~\n*-swp\n\n# kdevelop\n*.kdev4\n\n# from kdiff3\n*.BACKUP.*\n*.BASE.*\n*.LOCAL.*\n*.REMOTE.*\n\n# from dolphin\n.directory\n\n# LSP Server data\n/.clangd\n/.cmake/\n/.cache/\n/compile_commands.json\n/cmake-build*\n.vscode/\n.flatpak/\n.flatpak-builder/\n/_build/\n\n# Qt-es\n/.qmake.cache\n/.qmake.stash\n*.pro.user\n*.pro.user.*\n*.qbs.user\n*.qbs.user.*\n*.moc\nmoc_*.cpp\nqrc_*.cpp\nui_*.h\nMakefile*\n*-build-*\n/.qtc_clangd/\n/.qtc_clangd/*\n*.idx\n\n# QtCreator\n*.autosave\n\n# QtCtreator Qml\n*.qmlproject.user\n*.qmlproject.user.*\n\n*.qm\n\n# Mac finder stub\n.DS_Store\n\n\n"
        },
        {
          "name": ".gitlab-ci.yml",
          "type": "blob",
          "size": 0.2392578125,
          "content": "# SPDX-FileCopyrightText: None\n# SPDX-License-Identifier: CC0-1.0\n\ninclude:\n  - project: sysadmin/ci-utilities\n    file:\n      - /gitlab-templates/linux-qt6.yml\n      - /gitlab-templates/freebsd-qt6.yml\n      - /gitlab-templates/windows-qt6.yml\n"
        },
        {
          "name": ".kde-ci.yml",
          "type": "blob",
          "size": 0.4296875,
          "content": "# SPDX-FileCopyrightText: None\n# SPDX-License-Identifier: CC0-1.0\n\nDependencies:\n- 'on': ['Linux/Qt6', 'FreeBSD/Qt6', 'Windows/Qt6']\n  'require':\n    'frameworks/extra-cmake-modules': '@latest-kf6'\n    'frameworks/sonnet': '@latest-kf6'\n    'frameworks/kcoreaddons': '@latest-kf6'\n    'frameworks/kxmlgui': '@latest-kf6'\n    'frameworks/kconfigwidgets': '@latest-kf6'\n\nOptions:\n  require-passing-tests-on: [ 'Linux', 'FreeBSD', 'Windows' ]\n"
        },
        {
          "name": ".release-it.json",
          "type": "blob",
          "size": 2.947265625,
          "content": "{\n    \"hooks\": {},\n    \"git\": {\n        \"changelog\": null,\n        \"requireCleanWorkingDir\": false,\n        \"requireUpstream\": true,\n        \"requireCommits\": true,\n        \"addUntrackedFiles\": true,\n        \"commit\": true,\n        \"commitMessage\": \"Version bump to ${version}\",\n        \"commitArgs\": [],\n        \"tag\": true,\n        \"tagName\": null,\n        \"tagAnnotation\": \"Release ${version}\",\n        \"tagArgs\": [],\n        \"push\": true,\n        \"pushArgs\": [\"--follow-tags\"],\n        \"pushRepo\": \"\",\n        \"requireBranch\": \"master\"\n    },\n    \"github\": {\n        \"release\": true,\n        \"releaseName\": \"ghostwriter ${version}\",\n        \"releaseNotes\": \"./releaseNotes.py ${version}\",\n        \"preRelease\": false,\n        \"draft\": true,\n        \"tokenRef\": \"GITHUB_TOKEN\",\n        \"assets\": [\"COPYING\"],\n        \"host\": null,\n        \"timeout\": 0,\n        \"proxy\": null,\n        \"skipChecks\": false,\n        \"web\": false\n    },\n    \"plugins\": {\n        \"@j-ulrich/release-it-regex-bumper\": {\n            \"out\": [\n                {\n                    \"file\": \"ghostwriter.pro\",\n                    \"search\": \"VERSION = .*\",\n                    \"replace\": \"VERSION = {{version}}\"\n                },\n                {\n                    \"file\": \"./resources/linux/ghostwriter.appdata.xml\",\n                    \"search\": \"<release .*/>\",\n                    \"replace\": \"<release version=\\\"{{version}}\\\" date=\\\"{{now:YYYY-MM-DD}}\\\" type=\\\"stable\\\"/>\"\n                },\n                \"./resources/linux/ghostwriter.1\",\n                {\n                    \"file\": \"./resources/linux/ghostwriter.1\",\n                    \"search\": \"(\\\\.TH man \\\\d+) \\\".*?\\\" (.*)\",\n                    \"replace\": \"$1 \\\"{{now:D MMM YYYY}}\\\" $2\"\n                },\n                {\n                    \"file\": \"ghostwriter.spec\",\n                    \"search\": \"%global changelog_date .*\",\n                    \"replace\": \"%global changelog_date {{now:ddd MMM DD YYYY}}\"\n                },\n                {\n                    \"file\": \"ghostwriter.spec\",\n                    \"search\": \"%global appver .*\",\n                    \"replace\": \"%global appver {{version}}\"\n                },\n                \"./debian/changelog\",\n                {\n                    \"file\": \"./debian/changelog\",\n                    \"search\": \"(\\\\s+--\\\\s+.*?>).*\",\n                    \"replace\": \"$1  {{now:ddd, DD MMM YYYY HH:mm:ss ZZ}}\"\n                },\n                {\n                    \"file\": \"appveyor.yml\",\n                    \"search\": \"version:.*\",\n                    \"replace\": \"version: {{version}}+{build}\"\n                },\n                {\n                    \"file\": \"appveyor.yml\",\n                    \"search\": \"appver:.*\",\n                    \"replace\": \"appver: {{version}}\"\n                },\n                {\n                    \"file\": \"CHANGELOG.md\",\n                    \"search\": \"\\\\[Unreleased\\\\].*\",\n                    \"replace\": \"[{{version}}] - {{now:YYYY-MM-DD}}\"\n                }\n            ]\n        }\n    }\n}\n"
        },
        {
          "name": ".reuse",
          "type": "tree",
          "content": null
        },
        {
          "name": "3rdparty",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 24.380859375,
          "content": "# Changelog\n\nAll notable changes to this project will be documented in this file.\n\nThe format is based on [Keep a Changelog](https://keepachangelog.com/en/1.0.0/),\nand this project adheres to [Semantic Versioning](https://semver.org/spec/v2.0.0.html).\n\n## [Unreleased]\n\n### Fixed\n\n* Issue #465799: Segmentation fault no longer occurs when .conf file is missing on first launch.\n\n## [24.08.0]\n\n### Added\n\n* Added more icons to menu actions.\n* Ported to Qt6.\n\n### Fixed\n\n* Issue #487636: Unicode characters at the start or end of formatted text are now correctly highlighted.\n* Issue #482078: First character on a new line within a list is no longer highlighted as markup text.\n* Issue #475234: ghostwriter now remembers its font settings between sessions.\n* Issue #485691: ghostwriter not longer crashes on launch after the port to Qt6.\n\n### Removed\n\n* Replaced QtFontAwesome usage with SVG icons due to corner case where Qt could\n  not find the Font Awesome fonts when Qt was built from scratch.\n\n## [23.08.5]\n\n### Fixed\n\n* Added syntax highlighting and live spell check performance improvements.\n* Fixed corner cases for toggling of bold, italic, and strikethrough formatting.\n\n## [23.04]\n\n### Added\n\n* Updated file licenses to be compliant with REUSE.\n* Transitioned to KDE Frameworks' Sonnet spell checking library, which provides language detection as a new feature.\n* Transitioned to building with CMake.\n* Images can now be pasted from the clipboard with a prompt to save the image.\n* KDE about dialogs (for both *ghostwriter* and KDE) have been added to the help menu.\n* KDE bug report dialog and donate dialog have been added to the help menu.\n* Users can now specify custom Markdown processor command line options for previewing and exporting.\n\n### Fixed\n\n* Fixed line break symbol not being painted correctly under Windows.\n* The line break symbol will now only be painted at the end of a hard line break if the text cursor is not at the end of the line.\n* Saving an untitled draft file will prompt the user to \"Save As\".\n* Upon the user saving an untitled draft to a named file, the original untitled file is deleted to reduce clutter.\n* Fixed crash on link creation under Linux.\n* Fixed several memory leaks related to spell checking and cmark-gfm calls.\n* Width of the drop down combo box in the export dialog is now stretched to 100% to fit all options.\n* Issue #460158: Fixed IME window displacement.\n* Fixed syntax highlighting on line breaks, including for Unicode.\n* Issue #463362: Fixed theme preview thumbnail sizes on HiDPI screens.\n\n## [2.2.0] - 2022-09-17\n\n### Fixed\n\n* Issue #813: Opening the app after a fresh install no longer complains of a file backup error when text is entered.\n* Issue #815: Invoking the app from the command line with a non-existent file path specified will now create an empty file for the path.\n* Spaces are now properly underlined in emphasized text when emphasis style option is set to underline.\n\n### Added\n\n* A line break symbol is now drawn at the end of lines having two trailing spaces to designate a line break.\n\n## [2.1.6] - 2022-09-13\n\n### Fixed\n\n* Changed Classic theme's dark mode selection color from the light mode's color to the appropriate dark color.\n* Changed live preview's code block styling to scroll on overflow.\n* Fixed regression in translations failing to load.\n\n## [2.1.5] - 2022-09-09\n\n### Fixed\n\n* When renaming a file, file will now be saved even if the new file name already exists, provided the user chooses to proceed from the warning dialog.\n* Spell check dialog no longer eats HTML angle brackets when showing the context around a misspelled word.\n* Application now supports Qt 6 while maintaining backward compatibility with Qt 5.\n* Various under-the-hood refactoring/improvements have been added.\n* CSS and QSS style sheets now support SASS-style variables.\n* Hover and pressed button effects have been added to improve visibility.\n* User interface component icons and text have had their coloring adjusted to better meet WCAG accessibility standards.\n* Issues #790, 803, and 809: To prevent the equation and typing duplication in math equations, math rendering has been restricted to the Pandoc processor.  All other Markdown processors will no longer render math, since special preprocessing is required that only Pandoc does.\n* Added a command line option `--disable-gpu` to disable GPU acceleration to allow users to bypass a Windows bug in Qt 6 where full screen windows having an OpenGL component (in this case, QWebEngineView) cannot display menus (popups, menus from the menu bar).\n\n## [2.1.4] - 2022-06-18\n\n### Fixed\n\n* Replaced whole word icon in find/replace due to Windows 10 not rendering Unicode characters used for old icon.\n* Changed selection color for Plainstraction Dark theme to be brighter.\n* Issues #772, 773, and 777: Added workaround for segmentation fault on GTK/Gnome 42 at startup.\n\n## [2.1.3] - 2022-05-28\n\n### Fixed\n\n* Issue #751: Fixed various sidebar and HTML preview size issues.\n* Issue #724: App waits longer for Pandoc to finish reporting version on Windows before timing out.\n* Issue #762: Fixed typo in Brazilian Portuguese translation.\n* Fixed editor margins on resize and on sidebar hide/show.\n* Updated Russian translation.\n\n## [2.1.2] - 2022-03-12\n\n### Fixed\n\n* Issue #624: Text on line breaks is now correctly highlighted.\n* Issue #708: Removing large portions of text no longer freezes the app.\n* Issue #732: User-defined width of sidebar is now restored on load.\n* Issue #738: App waits longer for Pandoc to start up on Windows before timing out.\n\n## [2.1.1] - 2021-12-24\n\n### Fixed\n\n* Untitled documents are no longer created upon opening or closing a new, empty document.\n* Updated Chinese translation.\n* Fix compilation issue with Ubuntu 18.04.\n\n## [2.1.0] - 2021-11-20\n\n#### Added\n\n* Untitled documents are now autosaved to a draft folder when autosave is enabled.\n* Added preferences button to open the draft folder location where untitled documents are autosaved.\n* Added check box option to load last opened file on startup.  If left unchecked, a new file will be opened on startup\n* Added ability to word count indicator in status bar to display a different statistic. (The indicator is now a combo box.)\n* Updated Brazilian Portuguese translation.\n\n## [2.0.2] - 2021-06-27\n\n### Fixed\n\n* Issue #615: Unicode characters are properly displayed in the sidebar's Outline.\n* Issue #619: Chinese and other languages with unicode characters now display properly in the HTML preview.\n\n## [2.0.1] - 2021-05-16\n\n### Fixed\n\n* Issue #598: Unicode characters no longer shifts syntax highlighting.\n* Sidebar now properly hides itself after the `Ctrl+J` Outline command if it was\n  previously hidden on initial launch.\n* New Norwegian translation added.\n* Spanish and Italian translations updated.\n\n## [2.0.0] - 2021-05-08\n\n### Added\n\n* cmark-gfm now replaces Sundown as the default Markdown processor for live previews an export.\n* Syntax highlighting now utilizes cmark-gfm for better accuracy, especially with nested blocks.\n* HUDs have been replaced with a side bar.\n* Theming has been revamped to include more color options, but to exclude background images.\n* CSS for HTML Preview now adaptively changes colors based on the current theme.\n* Fonts can be customized for the HTML preview in the Preview Options dialog.\n* Themes are now composed of two color schemes: a light mode and a dark mode.\n* A new dark mode button in the status bar allows users to switch to the current theme's dark mode.\n* Find and replace dialog has been revamped into a panel at the bottom of the application.\n* Find and replace now supports highlighting all matches.\n* Export dialog now uses native file selector dialog.\n* Any two spaces at the end of a line are marked with dots by default.\n* Selected text now reveals tabs and spaces.\n* Source code has been refactored to follow KDE Frameworks and Qt coding style guides.\n* ghostwriter now uses React to update only what changed in the live preview since the last keystroke, significantly reducing the live preview rendering time for large documents.\n\n### Fixed\n\n* Issue #281: Removal of HUD windows will facilitate Alt+Tab switching.\n* Issue #382, #539: IME selection window/IBUS candidate window should no longer be displaced.\n* Issue #401: Single column tables are now highlighted.\n* Issue #439: README file was updated to remove the installation of qt5-default on Debian-based systems.\n* Issue #480: Menu bar is now accessible on relaunching ghostwriter in full screen mode.\n* Issue #494: MathJax JavaScript syntax error that was being printed to the terminal and which prevented inline math from being displayed with the `$` sign has been fixed.\n* Issue #500: Preview Options dialog will now only open once.\n* Issue #507: Multilevel lists are highlighted correctly in the editor with the switch to cmark-gfm handling the syntax highlighting.\n* Issue #508: HUD windows have been replaced with a side bar for compatibility with Wayland.\n* Issue #517: README.md has been updated with correct instructions location for building on MacOS.\n* Issue #503: MathJax has now been included inside the application rather than fetching it externally.\n* Issue #532: Insert spaces for tabs now works on startup.\n* Issue #536: Added missing Markdown file extensions to file dialog filter when opening and saving files.\n\n### Removed\n\n* Discount support was removed due to its conflicting executable name with MultiMarkdown.\n\n## [1.8.1] - 2020-02-22\n\n### Fixed\n\n* Issue #443: MathJax 3.0 is now built into the HTML preview.  Note that this feature works best with Pandoc and requires an Internet connection.  Other Markdown processors are not currently supported.\n* Issue #447: Cursor is no longer shown when editor is not in focus.\n* Issue #461: Fixed Cheat Sheet to have correct image example.\n* Issue #471: HUD window styling is fixed for Qt 5.13.\n* Issue #472: Fixed typing paused timers for session statistics and for hiding HUD windows.\n* Discount is not listed as an available Markdown processor if MultiMarkdown is installed.\n* New application translations are available for the following languages:\n    - Arabic\n    - Dutch\n\n## [1.8.0] - 2019-04-28\n\n### Added\n\n* HTML preview has been ported from QtWebKit to QtWebEngine (Chromium).\n\n### Fixed\n\n* Issue #206: ghostwriter now has right-to-left language support.\n* Issue #391: mathml option for pandoc is now used to render math equations for preview and export.\n* Issue #411: Fixed crash when adding a new theme with no theme selected.\n* Issue #412: Fixed export to PDF (wkhtmltopdf) failure with Pandoc.\n* Issue #430: Fixed issue extra spaces appearing between `<br/>` tags in the HTML preview.\n* Removed print support, since it has some odd bugs on some platforms, and most users would want to print their exported content anyway.\n* Removed graphics fade effect for the bottom of the editor, as it is a risky feature that has caused bugs in the past and does not work on HiDPI screens.\n\n## [1.7.4] - 2018-11-11\n\n### Fixed\n\n* Issue #178: Only use --quiet option for Pandoc version 2 or greater.\n* Fixed words-per-minute calculations to not be jumpy or overly high.\n* Fixed issue where creating a new theme resulted in inconsistent selection and display of themes in the Theme Selection dialog.\n* Fixed broken icon when running under Wayland.\n* Fixed screenshots in appdata.\n* Issue #385: Updated resource files license to CC BY-SA 4.0.\n\n## [1.7.3] - 2018-08-11\n\n### Fixed\n\n* Issue #369: Fixed segfault that occurred when changing the theme or interface style after opening the Preview Options dialog.\n\n## [1.7.2] - 2018-07-28\n\n### Fixed\n\n* Fixed issue where the `--quiet` option was mistakenly used with older Pandoc versions that did not support its use.\n* Worked around Qt 5.11 qinstall bug where running qmake and make would fail when installing the translation files\n\n## [1.7.1] - 2018-07-21\n\n### Fixed\n\n* Fixed regression in full screen mode where menu bar was not showing on mouse-over.\n* Fixed regression where wrong theme was shown as selected on opening the Theme Selection dialog.\n* Fixed issue #366 where warnings from Pandoc that were resulting in error dialogs on successful export.\n* Fixed issue #292 where saving a document under Windows resulted in end-of-line characters being written as `\\n` instead of `\\r\\n`.\n* Fixed issue #360 where a graphical glitch under MacOS disabled the Theme Selection dialog's remove theme button.\n\n## [1.7.0] - 2018-07-08\n\n### Added\n\n* Added light and dark built-in themes based on the community Ulysses III theme Plainstraction.\n* Live preview has been optimized to show the preview for typed characters immediately on smaller documents.\n* Added ODT and EPUB 3 as export options for MultiMarkdown 6.\n* Theme selection dialog now displays a grid instead of a list.\n\n### Fixed\n\n* The menu bar is now hidden again in full screen mode when the user presses `Alt+Tab` to switch to a different application.\n* Fixed issue #354 to disable hard line breaks for Pandoc's Github-flavored Markdown.\n* Worked around issue in Qt 5.11 where changing the theme causes the app to crash.\n* Worked around issue in Qt 5.10 where opening a new document with a document already loaded can cause the app to crash.\n\n## [1.6.2] - 2018-04-15\n\n### Fixed\n\n* Issue #315: Worked around slow load of QPrinter constructor in Fedora 27 by lazy loading the printer settings only when needed for printing or print preview rather than during application startup.\n* Fixed line break tokenizing to not include paragraph breaks.\n\n## [1.6.1] - 2018-04-08\n\n### Fixed\n\n* Worked around an issue with Qt version 5.10 that causes the application to occasionally crash when reloading the currently opened document or when opening a new document due to the text cursor not being set to the beginning of the document before clearing the editor and loading the new document.\n\n## [1.6.0] - 2018-04-07\n\n### Added\n\n* HTML live preview is now in a split pane view rather than in a separate window.\n* New options were added to hide HUD windows while typing, in full screen mode, or in live preview mode.\n* A new button was added to the status bar and a new shortcut was added to the View menu in the menu bar to toggle hiding/showing the open HUDs.\n* Github's cmark-gfm can now be detected and used as a Markdown processor.\n* Block quotes and code blocks now have an inobtrusive background color to differentiate them.\n* Buttons have been added to the status for existing features.\n* HUD windows and scrollbars can be stylized to have square or rounded corners in the Settings, and are no longer theme dependent.\n* New \"Typewriter\" focus mode was added by @hirschenberger.\n* The style sheet and Markdown processor to use with the HTML live preview can now be selected in their own dialog box accessible both from the status bar at the bottom of the window and from the menu bar in the Settings menu.\n* The \"Copy HTML\" button has been moved to the \"status bar\" at the bottom of the main window.\n* The \"Copy HTML\" button / menu bar option can copy just the selected Markdown text as HTML (using the currently selected Markdown processor). It will still copy the entire Markdown text document and convert it to HTML in the system clipboard if no text is selected.\n* Themes now support options for emphasis color and block text color. Note that emphasis color will also affect the color of headings, and block text color will affect the color of block quotes and code blocks.\n\n### Fixed\n\n* Issue #302: ghostwriter will now look for default Qt translations on the standard Qt translations path (for standard buttons/text). These default Qt translations have been included in the Windows installer translations folder and portable Windows Zip, and will be loaded automatically based on the currently selected application language.\n* Some tweaks have been made to the parsing/highlighting of emphasized text to handle nested emphasis cases better. As part of this effort, ghostwriter uses a Qt 5-specific regular expression class that is not available in Qt 4. As such, ghostwriter can no longer be built with Qt and must be built with Qt 5.\n* Issue #272: Fixed issue with Focus mode where inserting matching characters around a selection was causing the application to crash.\n* Issue #260: Added compatibility with Pandoc version 2 and MultiMarkdown version 6.\n* Fixed issue where HTML preview scrolls to the top if the new HTML from a modified document matches the old HTML, even if the markup used in the source document did change.\n* Fixed issue where current word is not live spell checked if the user switches the text cursor to a different line.\n* Fixed issue where prompt to reload a file that has been modified externally was being displayed multiple times per file change. This seems to have been triggered by some editors like Sublime Text that perform multiple file saves for a single file modification.\n* Issue #228: Selected text can now be dragged and dropped to a different location within the editor.\n* Fixed issue where if setext heading markup line is selected and deleted with the cursor position beginning at the end of the previous line, the heading is not removed from the Outline HUD.\n* Fixed issue where Preview HTML menu item and button were not in sync to appear checked or unchecked.\n* ghostwriter now clears the Outline HUD when loading or reloading a document to prevent a crash in case bad data is in the HUD.\n* Fixed copy HTML issue to ensure Markdown text has proper formatting (i.e., greater than signs aren't converted to `&gt;`).\n* ghostwriter will now search in the mozilla-dicts installation location for dictionaries on OpenBSD.\n\n## [1.5.0] - 2017-05-13\n\n### Added\n\n* HUD windows can now be closed using the Esc key when they have focus.\n* A new option has been added to highlight double spaces at the end of a line.\n* Github-style task lists can now be made using the `*` and `+` bullet point characters, in addition to the `-` character.\n* Support for ConTeXt and wkhtmltopdf when exporting to PDF with Pandoc has been added.\n* Auto-matching characters for selected text now respects the existing preferences for the matching done while typing without text selected.\n* Typing a single quote (`'`) will no longer result in a second quote being automatically inserted after the cursor if the cursor is positioned in the middle of a word.\n* Most settings have been moved into a new Preferences dialog to accommodate the ever increasing number of application options.\n* Font size can now be increased by pressing `Ctrl+=` or decreased by pressing `Ctrl+-`. It can also be changed by using `Ctrl` and the mouse wheel.\n* When exporting to other file formats, the output file will be opened after export with its default application.\n* E-books created using Pandoc will now also be generated with a table of contents.\n* When passing in a file path via the command line, a new file will be created with that path if it does not already exist.\n* When typing a `*` character, ghostwriter would auto-insert a second `*` character in anticipation of emphasized text. The auto-inserted second `*` will now be removed if a space is typed to accommodate a bullet list instead.\n* Rudimentary support for HiDPI has been added. See notes below.\n* Various performance enhancements and tweaks have been made under the hood.\n\n### Fixed\n\n* Issue #128: Hyphenated words are now considered one word for spell checking.\n* Issue #131: ghostwriter can now be built from its source tarball without needing git to be installed.\n* Issue #132: Linux desktop file now specifies that ghostwriter can open only one file from the command line rather than multiple files.\n* Issue #170: `Ctrl+M` now opens the HTML Preview instead of `Ctrl+W`. This is to avoid a conflict with closing windows in Linux.\n* Issue #219: Copy and paste no longer makes the word count jump.\n* Sundry minor fixes have been added.\n\n## [1.4.2] - 2016-08-24\n\n### Fixed\n\n* Issue #113: Full screen clock now displays time based on locale.\n* Issue #119: Null characters, which had been breaking the HTML preview, are no longer inserted when typing over selecting text.\n* Issue #121: Code fences are now correctly highlighted when they contain blank lines.\n* Issue #123: Statistics HUDs now have proper padding when alternating row colors is enabled.\n* Issue #125: The translations folder has been moved up one folder for the portable distribution of ghostwriter.\n* Sundry minor fixes have been added.\n\n## [1.4.1] - 2016-08-14\n\n### Fixed\n\n* Issue #115: Pressing backspace at the end of a line no longer deletes adjacent line breaks.\n* Issue #116: Renaming a theme no longer removes its background image.\n* Issue #107: Main window is now rendered correctly when transitioning between full screen mode and maximized. Main window also remembers its normal size upon being restored from maximized after having been in full screen mode previously.\n\n## [1.4.0] - 2016-07-23\n\n### Added\n\n* The time of day optionally displays in full screen mode.\n* The recent file history size has been increased to 10.\n* The menu bar will optionally auto-hide in full screen mode when the mouse is not hovering over it.\n* All new Hemingway mode button will disable backspace and delete keys.\n* Two new HUDs display statistical information on the current writing session and document.\n* Auto-matched characters can be customized.\n* High DPI scaling has been enabled for Qt 5.6 and above.\n* Classic Light and Classic Dark themes have new color palettes.\n* Various aesthetics have been added to the main window.\n* New application translations are available for the following languages:\n    - German\n    - Italian\n    - Japanese\n    - Portuguese (Brazil)\n    - Russian\n\n### Fixed\n\n* Pandoc PDF export now has better defaults for margins and hyperlinks.\n* Shortcut keys using `Alt` now use `Ctrl` to avoid conflicts with OS shortcut keys and to better accommodate non-USA keyboards.\n* Dragging and dropping an image into the editor will now insert the image link at the mouse location.\n* Sundry other fixes have been added.\n\n## [1.3.1] - 2016-02-27\n\n### Added\n\n* Added a new Markdown cheat sheet HUD window.\n* Added proper English translation ts and qm files to support plurals.\n* Updated ghostwriter to select application translation to use based on OS locale.\n\n### Fixed\n\n* Fixed DPI scaling for HTML Preview and Quick Reference Guide.\n* Fixed Qt 5 API call that was causing ghostwriter to fail compilation under Qt 4.\n\n## [1.2.5] - 2015-12-13\n\n### Fixed\n\n* Fixed an issue where export of Markdown document using Pandoc or other command line tools failed when spaces were in the output file path.\n* Fixed an issue where numbered lists that were sublists to a bullet point list were not highlighted properly.\n\n## [1.2.4] - 2015-11-28\n\n### Fixed\n\n* Fixed an issue where anchor tags for headings inserted for HTML Preview were conflicting with Pandoc's heading anchor tags.\n\n## [1.2.3] - 2015-10-31\n\n### Fixed\n\n* Fixed an issue on Windows where UTF-8 encoding was not being detected on opening a file unless there was a BOM present. The application now defaults to UTF-8 when opening a file.\n\n## [1.2.2] - 2015-10-10\n\n### Fixed\n\n* Fixed an issue where spelling suggestions were not always displayed in the context menu if the menu key was pressed on the keyboard.\n\n## [1.2.1] - 2015-10-02\n\n### Fixed\n\n* Corrected a regression where the application stopped going to the last known cursor position upon opening a file.\n* Fixed an issue where the context menu was showing up in the wrong position on the screen when the user pressed the keyboard's menu key for a misspelled word.\n* Fixed an issue where spelling suggestions were not always being displayed in the context menu depending on which line in the text block the mouse was clicked.\n\n## [1.2.0] - 2015-09-27\n\n### Added\n\n* More intelligent list handling\n* New Format menu\n* Pipe table highlighting\n* GitHub mentions highlighting\n\n### Fixed\n\n* Sundry fixes have been added\n\n## [1.1.0] - 2015-09-06\n\n### Added\n\n* Export dialog now categorizes export options by Markdown processor.\n* Export dialog displays a checkbox option for smart typography.\n* Support for the latest Pandoc version's CommonMark input format option has been added both to the export dialog and to the HTML preview window.\n* Support for cmark has been added to the export dialog and HTML preview window. ghostwriter will automatically detect if cmark is installed (i.e., if its location is in the system's PATH environment variable).\n* Font dialog's combo box now shows fonts WYSIWYG-style.\n\n### Fixed\n\n* Word counting is more accurate and does not regard markup text as separate words.\n\n## [1.0.1] - 2015-08-29\n\n### Fixed\n\n* Internal enhancements to Markdown parsing class names, with comments added to the code.\n* Updated the .pro file to be able to get the software version number through git even if there are only unannotated tags.\n\n## [1.0.0] - 2015-08-22\n\nInitial release.  Happy birthday, ghostwriter!\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 4.5439453125,
          "content": "﻿# SPDX-FileCopyrightText: 2022-2024 Megan Conkle <megan.conkle@kdemail.net>\n#\n# SPDX-License-Identifier: GPL-3.0-or-later\n\ncmake_minimum_required(VERSION 3.16)\nif (POLICY CMP0063)\n    cmake_policy(SET CMP0063 NEW)\nendif()\n\nif(NOT CMAKE_BUILD_TYPE)\n    set(CMAKE_BUILD_TYPE \"Release\" CACHE STRING\n            \"Default build type: Release\" FORCE)\nendif()\n\nif (NOT BUILD_TESTING)\n    set (BUILD_TESTING OFF)\nendif()\n\nmessage(\"Generating makefile for ${CMAKE_BUILD_TYPE} build...\")\n\n# KF6 only\nset(QT_MAJOR_VERSION 6)\nset(QT_MIN_VERSION \"6.5.0\")\nset(KF_MAJOR_VERSION 6)\nset(KF_DEP_VERSION \"6.0.0\")\nset(KF_MIN_VERSION \"6.0.0\")\n\n# use C++20 like KF6 itself\nset(CMAKE_CXX_STANDARD 20)\nset(CMAKE_CXX_EXTENSIONS OFF)\nset(CMAKE_CXX_STANDARD_REQUIRED TRUE)\n\n# KDE Application Version, managed by release script\nset(RELEASE_SERVICE_VERSION_MAJOR \"25\")\nset(RELEASE_SERVICE_VERSION_MINOR \"03\")\nset(RELEASE_SERVICE_VERSION_MICRO \"70\")\nset(RELEASE_SERVICE_VERSION \"${RELEASE_SERVICE_VERSION_MAJOR}.${RELEASE_SERVICE_VERSION_MINOR}.${RELEASE_SERVICE_VERSION_MICRO}\")\n\nproject(ghostwriter VERSION ${RELEASE_SERVICE_VERSION} LANGUAGES CXX)\n\nfind_package(ECM ${KF_MIN_VERSION} REQUIRED NO_MODULE)\n\n\n# Append to the module path so modules can be overridden from the command line.\nlist(APPEND CMAKE_MODULE_PATH ${ECM_MODULE_PATH})\n\nset(CMAKE_MODULE_PATH ${ECM_MODULE_PATH})\ninclude(KDEInstallDirs)\ninclude(KDECompilerSettings NO_POLICY_SCOPE)\nremove_definitions(-DQT_NO_KEYWORDS)\nremove_definitions(-DQT_NO_CAST_TO_ASCII)\nremove_definitions(-DQT_NO_CAST_FROM_ASCII)\ninclude(KDECMakeSettings)\ninclude(ECMInstallIcons)\ninclude(ECMAddAppIcon)\ninclude(ECMAddTests)\ninclude(ECMPoQmTools)\ninclude(KDEClangFormat)\ninclude(KDEGitCommitHooks)\ninclude(FeatureSummary)\n\nset(CMAKE_AUTOMOC ON)\nset(CMAKE_AUTORCC ON)\nset(CMAKE_AUTOUIC ON)\n\nif (IS_DIRECTORY \"${CMAKE_CURRENT_SOURCE_DIR}/poqm\")\n    ecm_install_po_files_as_qm(poqm)\nendif()\n\nfind_package(KF${KF_MAJOR_VERSION}DocTools ${KF_MIN_VERSION})\nset_package_properties(KF${KF_MAJOR_VERSION}DocTools PROPERTIES DESCRIPTION\n    \"Tools to generate documentation\"\n    TYPE OPTIONAL\n)\n\nset(CMARK_TESTS OFF)\nadd_subdirectory(3rdparty/cmark-gfm EXCLUDE_FROM_ALL)\nadd_subdirectory(src)\n\nif(KF${QT_MAJOR_VERSION}DocTools_FOUND)\n    kdoctools_install(po)\n    add_subdirectory(doc)\nendif()\n\n# Add icon files to the application's source files to have CMake bundle them in the executable.\nset(ICONS_FOLDER ${CMAKE_CURRENT_SOURCE_DIR}/resources/icons)\n\nset(ICON_FILES\n    ${ICONS_FOLDER}/sc-apps-ghostwriter.svg\n    ${ICONS_FOLDER}/16-apps-ghostwriter.png\n    ${ICONS_FOLDER}/22-apps-ghostwriter.png\n    ${ICONS_FOLDER}/32-apps-ghostwriter.png\n    ${ICONS_FOLDER}/64-apps-ghostwriter.png\n    ${ICONS_FOLDER}/128-apps-ghostwriter.png\n    ${ICONS_FOLDER}/256-apps-ghostwriter.png\n)\n\necm_add_app_icon(ICONS_SOURCES ICONS ${ICON_FILES})\ntarget_sources(ghostwriter PRIVATE ${ICONS_SOURCES})\n\nif(BUILD_TESTING)\n   add_subdirectory(autotest)\nendif()\n\n\n# See https://cmake.org/cmake/help/v3.15/prop_tgt/MACOSX_BUNDLE_INFO_PLIST.html\nif(APPLE)\n    string(TIMESTAMP CURRENT_YEAR \"%Y\")\n\n    set_property(\n        TARGET ghostwriter\n        PROPERTY MACOSX_BUNDLE_INFO_PLIST ${CMAKE_CURRENT_SOURCE_DIR}/resources/mac/MacOSBundleInfo.plist.in\n    )\n\n    # These are substituted by CMake into MacOSBundleInfo.plist.in.\n    set(MACOSX_BUNDLE_DISPLAY_NAME \"ghostwriter\")\n    set(MACOSX_BUNDLE_GUI_IDENTIFIER \"org.kde.ghostwriter\")\n    set(MACOSX_BUNDLE_BUNDLE_NAME \"ghostwriter\")\n    set(MACOSX_BUNDLE_DISPLAY_NAME \"ghostwriter\")\n    set(MACOSX_BUNDLE_INFO_STRING \"ghostwriter - A Markdown Editor\")\n    set(MACOSX_BUNDLE_LONG_VERSION_STRING \"ghostwriter ${RELEASE_SERVICE_VERSION}\")\n    set(MACOSX_BUNDLE_SHORT_VERSION_STRING \"${RELEASE_SERVICE_VERSION_MAJOR}.${RELEASE_SERVICE_VERSION_MINOR}\")\n    set(MACOSX_BUNDLE_BUNDLE_VERSION \"${RELEASE_SERVICE_VERSION}\")\n    set(MACOSX_BUNDLE_COPYRIGHT \"2014-${CURRENT_YEAR} the ghostwriter authors\")\nendif()\n\ninstall(TARGETS ghostwriter ${KDE_INSTALL_TARGETS_DEFAULT_ARGS})\n\necm_install_icons(\n    ICONS ${ICON_FILES}\n    DESTINATION ${KDE_INSTALL_ICONDIR}\n    THEME hicolor\n)\n\ninstall(\n    PROGRAMS ${CMAKE_CURRENT_SOURCE_DIR}/resources/linux/org.kde.ghostwriter.desktop\n    DESTINATION ${KDE_INSTALL_APPDIR}\n)\n\ninstall(\n    FILES ${CMAKE_CURRENT_SOURCE_DIR}/resources/linux/org.kde.ghostwriter.metainfo.xml\n    DESTINATION ${KDE_INSTALL_METAINFODIR}\n)\n\nfeature_summary(WHAT ALL INCLUDE_QUIET_PACKAGES FATAL_ON_MISSING_REQUIRED_PACKAGES)\n\nfile(GLOB_RECURSE ALL_CLANG_FORMAT_SOURCE_FILES src/**/*.cpp src/**/*.h)\nkde_clang_format(${ALL_CLANG_FORMAT_SOURCE_FILES})\nkde_configure_git_pre_commit_hook(CHECKS CLANG_FORMAT)\n"
        },
        {
          "name": "CMakePresets.json",
          "type": "blob",
          "size": 3.9287109375,
          "content": "{\n    \"version\": 2,\n    \"configurePresets\": [\n        {\n            \"name\": \"dev\",\n            \"displayName\": \"Build as debug\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Debug\",\n                \"CMAKE_EXPORT_COMPILE_COMMANDS\": \"ON\"\n            }\n        },\n        {\n            \"name\": \"dev-disable-deprecated\",\n            \"displayName\": \"Build as without deprecated methods\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-disable-deprecated\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Debug\",\n                \"CMAKE_EXPORT_COMPILE_COMMANDS\": \"ON\",\n                \"CMAKE_CXX_FLAGS_INIT\": \"-DQT_DISABLE_DEPRECATED_BEFORE=0x060000 -DKF_DISABLE_DEPRECATED_BEFORE_AND_AT=0x060000\"\n            }\n        },\n        {\n            \"name\": \"asan\",\n            \"displayName\": \"Build with Asan support.\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-asan\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Debug\",\n                \"ECM_ENABLE_SANITIZERS\" : \"'address;undefined'\",\n                \"CMAKE_EXPORT_COMPILE_COMMANDS\": \"ON\"\n            }\n        },\n        {\n            \"name\": \"unity\",\n            \"displayName\": \"Build with CMake unity support.\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-unity\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Debug\",\n                \"CMAKE_UNITY_BUILD\": \"ON\",\n                \"CMAKE_EXPORT_COMPILE_COMMANDS\": \"ON\"\n            }\n        },\n        {\n            \"name\": \"release\",\n            \"displayName\": \"Build as release mode.\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-release\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Release\"\n            }\n        },\n        {\n            \"name\": \"profile\",\n            \"displayName\": \"profile\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-profile\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"RelWithDebInfo\",\n                \"CMAKE_EXPORT_COMPILE_COMMANDS\": \"ON\"\n            }\n        },\n        {\n            \"name\": \"clazy\",\n            \"displayName\": \"clazy\",\n            \"generator\": \"Ninja\",\n            \"binaryDir\": \"${sourceDir}/build-clazy\",\n            \"cacheVariables\": {\n                \"CMAKE_BUILD_TYPE\": \"Debug\"\n            },\n            \"environment\": {\n                \"CXX\": \"clazy\",\n                \"CCACHE_DISABLE\": \"ON\"\n            }\n        }\n    ],\n    \"buildPresets\": [\n        {\n            \"name\": \"dev\",\n            \"configurePreset\": \"dev\"\n        },\n        {\n            \"name\": \"asan\",\n            \"configurePreset\": \"asan\"\n        },\n        {\n            \"name\": \"dev-disable-deprecated\",\n            \"configurePreset\": \"dev-disable-deprecated\"\n        },\n        {\n            \"name\": \"unity\",\n            \"configurePreset\": \"unity\"\n        },\n        {\n            \"name\": \"clazy\",\n            \"configurePreset\": \"clazy\",\n            \"environment\": {\n                \"CLAZY_CHECKS\" : \"level0,level1,detaching-member,ifndef-define-typo,isempty-vs-count,qrequiredresult-candidates,reserve-candidates,signal-with-return-value,unneeded-cast,function-args-by-ref,function-args-by-value,returning-void-expression,no-ctor-missing-parent-argument,isempty-vs-count,qhash-with-char-pointer-key,raw-environment-function,qproperty-type-mismatch,old-style-connect,qstring-allocations,container-inside-loop,heap-allocated-small-trivial-type,inefficient-qlist,qstring-varargs,level2,detaching-member,heap-allocated-small-trivial-type,isempty-vs-count,qstring-varargs,qvariant-template-instantiation,raw-environment-function,reserve-candidates,signal-with-return-value,thread-with-slots,no-ctor-missing-parent-argument,no-missing-typeinfo\",\n                \"CCACHE_DISABLE\" : \"ON\"\n            }\n        }\n    ]\n}\n"
        },
        {
          "name": "CMakePresets.json.license",
          "type": "blob",
          "size": 0.1005859375,
          "content": "# SPDX-FileCopyrightText: 2021 Laurent Montel <montel@kde.org>\n# SPDX-License-Identifier: BSD-3-Clause\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 5.2373046875,
          "content": "# Contributing\n\nInterested in making *ghostwriter* even better? Please read the sections below to see how you can contribute.\n\n## Bugs Reports\n\nFound a bug? Please report it on the GitHub issue tracker [here](https://github.com/wereturtle/ghostwriter/issues). Please be sure to fill out all answers to the questions in the bug report template.\n\n**Warning:** Failing to provide the information required in the bug report template will result in the bug report being automatically closed.\n\n## New Features and Bug Fixes\n\nDo you know how to code? Follow these steps:\n\n1. Submit an issue for your feature or bug on the GitHub issue tracker [here](https://github.com/wereturtle/ghostwriter/issues).  \n   **Note:** This step is necessary to ensure that the new feature meets the project goals or that the bug isn't really a feature. You will also want to coordinate what areas of code you will be updating to avoid merge conflicts in case someone else is working on that same area of code as well.\n2. After discussion for your new issue, code your feature or bug fix. Please follow the [KDE Frameworks coding style guide](https://community.kde.org/Policies/Frameworks_Coding_Style).\n3. Submit a pull request against the master branch with your code updates.  \n   **Important:** Please squash your commits in git before submitting the pull request!\n4. Wait for a brief code review and at least two other volunteers to test your feature or bug fix.\n5. Make updates to your pull request as you receive feedback.\n6. Once your pull request is approved by at least two other volunteer testers, your pull request will be merged.\n\n## Code Reviews\n\nDo you know how to code and have an eye for detail? Volunteer to peer review new pull requests!\n\n1. Look for a [new pull request](https://github.com/wereturtle/ghostwriter/pulls), and add a comment that you are volunteering to code review it.\n2. Submit code review comments.\n3. Wait for updates to the pull request (if needed).\n4. Continue providing feedback until you are confident the code is sound.\n5. Leave a comment with your approval of the pull request.\n6. Once at least two volunteer testers submit their approval, the pull request will be merged.\n\nHere are some tips of what to look for in code reviews:\n\n* Does the submitted code follow the [KDE Frameworks coding style guide](https://community.kde.org/Policies/Frameworks_Coding_Style)?\n* Is the code readable, with comments explaining any non-obvious lines?\n* Is the code \"pessimistic\"? In other words, does it check for invalid values before using them and handle possible error conditions?\n* Are multiple comparisons or statements wrapped in parentheses within `if` statements to prevent accidents with order of operations?  Examples:\n\n    ```cpp\n    // Wrong\n    if (a == b || c > d);\n\n    // Correct\n    if ((a == b) || (c > d));\n    ```\n* Are literals on the left side of the `==` operator to prevent a typo with the `=` operator from escaping the compiler's notice? Examples:\n\n    ```cpp\n    // Wrong\n    if (variable == 1);\n\n    // Reason: What if there's a typo?\n    //         The compiler will not catch it!\n    if (variable = 1); // Oops!\n\n    // Correct\n    if (1 == variable);\n\n    // Reason: This time the compiler will catch\n    //         the typo.\n    if (1 = variable); // Oops! \n    ```\n\n## Testing\n\nVolunteer to review code and test new features and bug fixes! Follow these steps:\n\n1. Look for a [new pull request](https://github.com/wereturtle/ghostwriter/pulls), and add a comment that you are volunteering to test it.\n2. Build the pull request on your platform.\n3. Test the feature/bug fix and try to break it!\n4. Provide feedback on test results in the pull request.\n5. Wait for updates to the pull request (if needed).\n6. Continue testing and providing feedback until you are confident the code is working.\n7. Leave a comment with your approval of the pull request.\n8. Once at least on other volunteer tester submits their approval, the pull request will be merged.\n\n## Translations\n\nWith [Qt Linguist](https://doc.qt.io/qt-5/qtlinguist-index.html), you can translate ghostwriter into other languages, or update an existing translation file. The `translations/` directory within the [source code repository](https://github.com/wereturtle/ghostwriter) contains all the `.ts` files you need to get started.\n\n## Wiki Documentation\n\nFound a workaround for a common issue? Have any useful tips? Please document your insights on the project's [wiki](https://github.com/wereturtle/ghostwriter/wiki).\n\n## Tech Support\n\nKnowledgeable about Linux or building for MacOS? Know how to fix that one issue others keep running into? Your answering user questions and troubleshooting in the [GitHub issue tracker](https://github.com/wereturtle/ghostwriter/issues) would be much appreciated!\n\n## Automated Builds\n\nThe ghostwriter project uses continuous integration for its Windows and Linux builds to provide regular releases. Sadly, this capability has not been implemented for MacOS.\n\nIf you are familiar with MacOS, please consider creating automated builds. These builds will ideally provide an installer for the application.\n\nAlso, the current Windows build does not provide an installer (`setup.exe` or `.msi`). If you are familiar with making Windows installers for Qt apps in AppVeyor, please consider contributing to the project's appveyor.yml file.\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 34.3251953125,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<https://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<https://www.gnu.org/licenses/why-not-lgpl.html>.\n"
        },
        {
          "name": "LICENSES",
          "type": "tree",
          "content": null
        },
        {
          "name": "Messages.sh",
          "type": "blob",
          "size": 0.2626953125,
          "content": "#! /usr/bin/env bash\n\n# SPDX-FileCopyrightText: 2022 Megan Conkle <megan.conkle@kdemail.net>\n#\n# SPDX-License-Identifier: GPL-3.0-or-later\n\n# Extract for Qt Linguist\n$EXTRACT_TR_STRINGS `find src/ -name \\*.cpp -o -name \\*.h -o -name \\*.ui` -o $podir/ghostwriter_qt.pot\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.982421875,
          "content": "# <img src=\"./resources/icons/sc-apps-ghostwriter.svg\" align=\"left\" width=\"32\" style=\"padding-right:5px\"> ghostwriter\n\n*ghostwriter* is a Windows and Linux text editor for Markdown, which is a plain text markup format created by John Gruber. For more information about Markdown, please visit John Gruber’s website at <http://www.daringfireball.net>.  *ghostwriter* provides a relaxing, distraction-free writing environment, whether your masterpiece be that next blog post, your school paper, or your NaNoWriMo novel.  For a tour of its features, please visit the [*ghostwriter* project site](https://ghostwriter.kde.org).\n\n## Screenshots\n\nYou can view screenshots of the application at [*ghostwriter's* project site](https://ghostwriter.kde.org).\n\n## Documentation\n\nA quick reference guide is available [here](https://ghostwriter.kde.org/documentation/).\n\n## Installation\n\n### Windows\n\nAn installer will be forthcoming at the [KDE binary factory](https://binary-factory.kde.org/), along with a nightly build.\n\n### Linux\n\nVersions of *ghostwriter* 2.2.0 and above are provided with KDE Gears releases and should be available with your Linux distribution.  For example, on Ubuntu, you can enter the following commands from your terminal:\n\n    $ sudo apt update\n    $ sudo apt install ghostwriter\n\nOn Fedora, enter the following commands instead:\n\n    $ sudo dnf install ghostwriter\n\nYou may also find packages on the author's personal repository locations version 2.1.6 in case your GNU/Linux distribution is behind.  If you are running Ubuntu or one of its derivatives (Linux Mint, Xubuntu, etc.), open a terminal, and enter the following commands:\n\n    $ sudo add-apt-repository ppa:wereturtle/ppa\n    $ sudo apt update\n    $ sudo apt install ghostwriter\n\nFedora users can install older version of *ghostwriter* from [Copr](https://copr.fedorainfracloud.org/) by opening a terminal and entering the following commands:\n\n    $ sudo dnf copr enable wereturtle/stable\n    $ sudo dnf install ghostwriter\n\nFinally, you may follow the build instructions below to install on Linux with the latest source code.\n\n### MacOS\n\nAn installer is planned in the future and will be hosted at the [KDE binary factory](https://binary-factory.kde.org/), along with a nightly build.  If you have any expertise to offer, please consider helping with a [Craft configuration](https://community.kde.org/Craft).\n\n## Build\n\nIf you wish to build from the source code, you will need Qt 5, available from <http://www.qt.io/> if you are on Windows, or in your Linux distribution's repository. If you are on MacOS you will need the latest Qt 5 from brew.\n\nThis documentation assumes you already have the source code unzipped in a folder.\n\n### Windows\n\nBuilding on Windows requires Visual Studio.  General instructions for building KDE applications in Windows are available [here](https://community.kde.org/Get_Involved/development/Windows).\n\n**IMPORTANT**: If compiling against Qt 6, note that having OpenGL components (in this case, QWebEngineView) will force the entire window to be rendered in OpenGL.  This triggers a bug in Windows in full screen mode where menus can no longer be displayed, such as the menu bar menus or popup menus.\n\nThis issue was not present in Qt 5, since ANGLE was available to bypass the default OpenGL implementation and use DirectX.  With ANGLE having been removed from Qt 6 and the documented solutions not entirely working, you will have to use software rendering instead if you wish to work in full screen mode.  Please see the section below for command line arguments that will disable GPU acceleration.\n\nObviously, the best option is to continue using Qt 5 on Windows for as long as possible.\n\n### Linux\n\nBefore proceeding, ensure that you have the necessary packages installed for Qt 5 and KDE Frameworks.\n\nFor Debian or Ubuntu distributions:\n\n    $ sudo apt install g++ qtbase5-dev libqt5svg5-dev qtmultimedia5-dev qtwebengine5-dev pkg-config libqt5concurrent5 qttools5-dev-tools qttools5-dev libkf5coreaddons-dev libkf5xmlgui-dev libkf5configwidgets-dev libkf5sonnet-dev libkf5doctools5 libkf5doctools-dev cmake extra-cmake-modules libhunspell-dev\n\nFor Fedora:\n\n    $ sudo dnf install qt-devel qt5-qtbase-devel qt5-qtsvg-devel qt5-qtmultimedia-devel qt5-qtwebengine-devel qt5-linguist kf5-kcoreaddons-devel kf5-kwidgetsaddons-devel kf5-kconfigwidgets-devel kf5-kxmlgui-devel kf5-sonnet-devel kf5-kdoctools kf5-kdoctools-devel cmake extra-cmake-modules\n\nFor other Linux flavors, the list will be similar; `cmake` will tell you if you are missing anything.\n\nNext, open a terminal window, and enter the following commands:\n\n    $ cd <your_ghostwriter_folder_location>\n    $ mkdir build\n    $ cd build\n    $ cmake ..\n    $ make\n    # make install\n\n### MacOS\n\nPlease consult the [KDE development guide](https://community.kde.org/Get_Involved/development/Mac) on how to build KDE applications for MacOS in general.\n\n### FreeBSD\n\nPrerequisites\n\n* Git (`git` or `git-lite`)\n\nInstall the dependencies\n\n    sudo pkg inst hunspell en-hunspell pkgconf qt5-svg qt5-multimedia \\\n    qt5-webengine qt5-concurrent qt5-buildtools qt5-qmake qt5-linguist\n\nYou will also need to install QtWebEngine\n\nGet the sources\n\n    git clone https://invent.kde.org/office/ghostwriter\n\nBuild\n\n    $ cd ghostwriter\n    $ mkdir build\n    $ cd build\n    $ cmake ..\n    $ make\n    $ sudo make install\n\n## Command Line Usage\n\nFor terminal users, *ghostwriter* can be run from the command line.  In your terminal window, simply type the following:\n\n    $ ghostwriter myfile.md\n\nwhere `myfile.md` is the path to your Markdown text file.\n\nAn option to disable GPU acceleration `--disable-gpu` is also available.  Simply type the following:\n\n    $ ghostwriter --disable-gpu\n\nA scenario where you may consider using software rendering would be if compiling against Qt 6 on Windows, and running the application in full screen mode.  See the documented bug under the Windows build instructions above for further details.  Note that the application may inconsistently launch on Windows with GPU acceleration disabled, and it may take several attempts before you can start it successfully.\n\n## Additional Markdown Processors\n\n*ghostwriter* has built-in support for the cmark-gfm processor.  However, it also can auto-detect Pandoc, MultiMarkdown, or cmark processors.  To use any or all of the latter three, simply install them and ensure that their installation locations are added to your system's `PATH` environment variable.  *ghostwriter* will auto-detect their installation on startup, and give you live HTML preview and export options accordingly.\n\n## Contribute\n\nPlease read the [contributing guide](https://ghostwriter.kde.org/contribute/) on how to contribute.  Your help would be greatly appreciated!\n\n## Licensing\n\nThe source code for *ghostwriter* is licensed under the [GNU General Public License Version 3](http://www.gnu.org/licenses/gpl.html).  However, various icons and third-party FOSS code (i.e., cmark-gfm, MathJax, etc.) have different licenses compatible with GPLv3.  Please read the COPYING or LICENSE files in the respective folders for the different licenses.\n"
        },
        {
          "name": "autotest",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "icons.qrc",
          "type": "blob",
          "size": 2.8125,
          "content": "<RCC>\n    <qresource prefix=\"/\">\n        <file>resources/icons/kdeapp.svg</file>\n        <file>resources/icons/sc-apps-ghostwriter.svg</file>\n        <file>icons/block-quote.svg</file>\n        <file>icons/bug-report.svg</file>\n        <file>icons/cheat-sheet.svg</file>\n        <file>icons/checkbox-checked.svg</file>\n        <file>icons/checkbox-unchecked.svg</file>\n        <file>icons/clear.svg</file>\n        <file>icons/close.svg</file>\n        <file>icons/code-block.svg</file>\n        <file>icons/comment.svg</file>\n        <file>icons/copy.svg</file>\n        <file>icons/cut.svg</file>\n        <file>icons/dark-mode.svg</file>\n        <file>icons/deselect.svg</file>\n        <file>icons/documentation.svg</file>\n        <file>icons/donate.svg</file>\n        <file>icons/distraction-free-mode.svg</file>\n        <file>icons/document-statistics.svg</file>\n        <file>icons/documentation.svg</file>\n        <file>icons/donate.svg</file>\n        <file>icons/emphasis.svg</file>\n        <file>icons/export.svg</file>\n        <file>icons/find.svg</file>\n        <file>icons/find-replace.svg</file>\n        <file>icons/find-next.svg</file>\n        <file>icons/find-previous.svg</file>\n        <file>icons/font.svg</file>\n        <file>icons/full-screen.svg</file>\n        <file>icons/hemingway-mode.svg</file>\n        <file>icons/highlight-matches.svg</file>\n        <file>icons/indent.svg</file>\n        <file>icons/insert-image.svg</file>\n        <file>icons/language.svg</file>\n        <file>icons/live-preview.svg</file>\n        <file>icons/match-case.svg</file>\n        <file>icons/new-file.svg</file>\n        <file>icons/open-file.svg</file>\n        <file>icons/open-recent.svg</file>\n        <file>icons/ordered-list.svg</file>\n        <file>icons/outline.svg</file>\n        <file>icons/paste.svg</file>\n        <file>icons/preferences.svg</file>\n        <file>icons/redo.svg</file>\n        <file>icons/regex-search.svg</file>\n        <file>icons/reload.svg</file>\n        <file>icons/rename-file.svg</file>\n        <file>icons/save.svg</file>\n        <file>icons/save-as.svg</file>\n        <file>icons/select-all.svg</file>\n        <file>icons/session-statistics.svg</file>\n        <file>icons/settings.svg</file>\n        <file>icons/show-sidebar.svg</file>\n        <file>icons/spell-check.svg</file>\n        <file>icons/status-bar-menu-arrow.svg</file>\n        <file>icons/strikethrough.svg</file>\n        <file>icons/strong.svg</file>\n        <file>icons/task-complete.svg</file>\n        <file>icons/task-list.svg</file>\n        <file>icons/theme.svg</file>\n        <file>icons/undo.svg</file>\n        <file>icons/unindent.svg</file>\n        <file>icons/unordered-list.svg</file>\n        <file>icons/whats-this.svg</file>\n        <file>icons/whole-word.svg</file>\n        <file>icons/zoom-in.svg</file>\n        <file>icons/zoom-out.svg</file>\n    </qresource>\n</RCC>"
        },
        {
          "name": "icons",
          "type": "tree",
          "content": null
        },
        {
          "name": "po",
          "type": "tree",
          "content": null
        },
        {
          "name": "poqm",
          "type": "tree",
          "content": null
        },
        {
          "name": "resources.qrc",
          "type": "blob",
          "size": 4.12109375,
          "content": "<RCC>\n    <qresource prefix=\"/\">\n        <file>resources/preview.css</file>\n        <file>resources/preview.html</file>\n        <file>resources/widgets.qss</file>\n        <file>resources/banner.png</file>\n        <file>3rdparty/react/react-dom.production.min.js</file>\n        <file>3rdparty/react/react.production.min.js</file>\n        <file>3rdparty/react/html-react-parser.js</file>\n        <file>3rdparty/MathJax/bin/mml-svg.js</file>\n        <file>3rdparty/MathJax/bin/tex-mml-svg.js</file>\n        <file>3rdparty/MathJax/bin/output/svg.js</file>\n        <file>3rdparty/MathJax/bin/output/svg/fonts/tex.js</file>\n        <file>3rdparty/MathJax/bin/tex-svg-full.js</file>\n        <file>3rdparty/MathJax/bin/adaptors/liteDOM.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/en.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/es.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/de.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/mathmaps_ie.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/fr.js</file>\n        <file>3rdparty/MathJax/bin/sre/mathmaps/nemeth.js</file>\n        <file>3rdparty/MathJax/bin/sre/sre-node.js</file>\n        <file>3rdparty/MathJax/bin/sre/sre_browser.js</file>\n        <file>3rdparty/MathJax/bin/ui/menu.js</file>\n        <file>3rdparty/MathJax/bin/ui/safe.js</file>\n        <file>3rdparty/MathJax/bin/a11y/complexity.js</file>\n        <file>3rdparty/MathJax/bin/a11y/assistive-mml.js</file>\n        <file>3rdparty/MathJax/bin/a11y/semantic-enrich.js</file>\n        <file>3rdparty/MathJax/bin/a11y/explorer.js</file>\n        <file>3rdparty/MathJax/bin/input/mml/entities.js</file>\n        <file>3rdparty/MathJax/bin/input/tex-base.js</file>\n        <file>3rdparty/MathJax/bin/input/tex.js</file>\n        <file>3rdparty/MathJax/bin/input/tex-full.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/tagformat.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/configmacros.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/noundefined.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/verb.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/textmacros.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/unicode.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/require.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/amscd.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/newcommand.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/autoload.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/enclose.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/color.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/noerrors.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/ams.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/physics.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/mhchem.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/colorv2.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/cancel.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/html.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/bbox.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/boldsymbol.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/all-packages.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/extpfeil.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/action.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/braket.js</file>\n        <file>3rdparty/MathJax/bin/input/tex/extensions/bussproofs.js</file>\n        <file>3rdparty/MathJax/bin/input/asciimath.js</file>\n        <file>3rdparty/MathJax/bin/input/mml.js</file>\n        <file>3rdparty/MathJax/bin/latest.js</file>\n        <file>3rdparty/MathJax/bin/node-main.js</file>\n        <file>3rdparty/MathJax/bin/tex-svg.js</file>\n        <file>3rdparty/MathJax/bin/startup.js</file>\n        <file>3rdparty/MathJax/bin/loader.js</file>\n        <file>3rdparty/MathJax/bin/core.js</file>\n    </qresource>\n</RCC>\n"
        },
        {
          "name": "resources",
          "type": "tree",
          "content": null
        },
        {
          "name": "snapcraft.yaml",
          "type": "blob",
          "size": 2.638671875,
          "content": "# SPDX-FileCopyrightText: 2023 Scarlett Moore <sgmoore@kde.org>\n#\n# SPDX-License-Identifier: CC0-1.0\n---\nname: ghostwriter\nconfinement: strict\ngrade: stable\nbase: core22\nadopt-info: ghostwriter\nicon: $CRAFT_PROJECT_DIR/resources/icons/128-apps-ghostwriter.png\napps:\n  ghostwriter:\n    extensions:\n      - kde-neon-6\n    common-id: org.kde.ghostwriter.desktop\n    desktop: usr/share/applications/org.kde.ghostwriter.desktop\n    command: usr/bin/ghostwriter\n    plugs:\n      - home\n      - cups\n      - browser-support\n    environment:\n      DICPATH: \"$SNAP/usr/share/hunspell\"\n      QT_LIBRARY_DATA: $SNAP/kf6/usr/share/qt6/resources\nplugs:\n  hunspell-dictionaries:\n    content: hunspell-dictionaries\n    interface: content\n    target: \"$SNAP/usr/share/hunspell\"\n    default-provider: hunspell-dictionaries:hunspell-dictionaries\nslots:\n  session-dbus-interface:\n    interface: dbus\n    name: org.kde.ghostwriter\n    bus: session\npackage-repositories:\n  - type: apt\n    components:\n      - main\n    suites:\n      - jammy\n    key-id: 444DABCF3667D0283F894EDDE6D4736255751E5D\n    url: http://origin.archive.neon.kde.org/user\n    key-server: keyserver.ubuntu.com\nparts:\n  ghostwriter:\n    parse-info:\n      - usr/share/metainfo/org.kde.ghostwriter.metainfo.xml\n    plugin: cmake\n    source: .\n    source-type: local\n    build-packages:\n      - libhunspell-dev\n    stage-packages:\n      - pandoc\n      - cmark\n      - libtext-multimarkdown-perl\n    cmake-parameters:\n      - -DCMAKE_INSTALL_PREFIX=/usr\n      - -DCMAKE_BUILD_TYPE=Release\n      - -DQT_MAJOR_VERSION=6\n      - -DBUILD_WITH_QT6=ON\n      - -DBUILD_TESTING=OFF\n      - -DCMAKE_INSTALL_SYSCONFDIR=/etc\n      - -DCMAKE_INSTALL_LOCALSTATEDIR=/var\n      - -DCMAKE_EXPORT_NO_PACKAGE_REGISTRY=ON\n      - -DCMAKE_FIND_USE_PACKAGE_REGISTRY=OFF\n      - -DCMAKE_FIND_PACKAGE_NO_PACKAGE_REGISTRY=ON\n      - -DCMAKE_INSTALL_RUNSTATEDIR=/run\n      - -DCMAKE_SKIP_INSTALL_ALL_DEPENDENCY=ON\n      - -DCMAKE_VERBOSE_MAKEFILE=ON\n      - -DCMAKE_INSTALL_LIBDIR=lib/$CRAFT_ARCH_TRIPLET_BUILD_FOR\n      - --log-level=STATUS\n      - -DCMAKE_LIBRARY_PATH=lib/$CRAFT_ARCH_TRIPLET_BUILD_FOR\n    prime:\n      - -usr/lib/*/cmake/*\n      - -usr/include/*\n      - -usr/share/ECM/*\n      - -usr/share/man/*\n      - -usr/bin/X11\n      - -usr/lib/gcc/$CRAFT_ARCH_TRIPLET_BUILD_FOR/6.0.0\n      - -usr/lib/aspell/*\n      - -usr/share/lintian\n  cleanup:\n    after:\n      - ghostwriter\n    plugin: nil\n    build-snaps:\n      - core22\n      - kf6-core22\n      - qt-common-themes\n    override-prime: |\n      set -eux\n      for snap in \"core22\" \"kf6-core22\" \"qt-common-themes\"; do\n          cd \"/snap/$snap/current\" && find . -type f,l -exec rm -rf \"${CRAFT_PRIME}/{}\" \\;\n      done\n\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "widgets.qss",
          "type": "blob",
          "size": 14.107421875,
          "content": "/*\n * SPDX-FileCopyrightText: 2022-2024 Megan Conkle <megan.conkle@kdemail.net>\n *\n * SPDX-License-Identifier: GPL-3.0-or-later\n */\n\n/******************************************************************************/\n/*  Scrollbars                                                                */\n/******************************************************************************/\n\nghostwriter--MarkdownEditor QAbstractScrollArea::corner,\nghostwriter--HtmlPreview QAbstractScrollArea::corner,\nghostwriter--Sidebar QAbstractScrollArea::corner {\n    background: transparent;\n}\n\nghostwriter--MarkdownEditor QAbstractScrollArea,\nghostwriter--HtmlPreview QAbstractScrollArea,\nghostwriter--Sidebar QAbstractScrollArea {\n    padding: 3px 3px 0px 3px;\n    margin: 0\n}\n\nghostwriter--Sidebar MarkdownEditor::horizontal,\nghostwriter--Sidebar HtmlPreview::horizontal,\nghostwriter--Sidebar QScrollBar::horizontal {\n    height: 16px;\n    margin: 5px;\n    border: 0;\n    background: transparent;\n}\n\nghostwriter--MarkdownEditor QScrollBar::vertical,\nghostwriter--HtmlPreview QScrollBar::vertical,\nghostwriter--Sidebar QScrollBar::vertical {\n    width: 16px;\n    margin: 5px;\n    border: 0;\n    background: transparent;\n}\n\n\nghostwriter--MarkdownEditor QScrollBar::horizontal:hover,\nghostwriter--HtmlPreview QScrollBar::horizontal:hover,\nghostwriter--Sidebar QScrollBar::horizontal:hover {\n    background-color: #f1e8dd;\n    border-radius: 3px;\n}\n\nghostwriter--MarkdownEditor QScrollBar::vertical:hover,\nghostwriter--HtmlPreview QScrollBar::vertical:hover,\nghostwriter--Sidebar QScrollBar::vertical:hover {\n    background-color: #f1e8dd;\n    border-radius: 3px;\n}\n\nghostwriter--MarkdownEditor QScrollBar::handle:horizontal,\nghostwriter--HtmlPreview QScrollBar::handle:horizontal,\nghostwriter--Sidebar QScrollBar::handle:horizontal {\n    min-width: 50px;\n    border: 0;\n    background: #cabfb8;\n    border-radius: 3px;\n\n}\n\nghostwriter--MarkdownEditor QScrollBar::handle:horizontal,\nghostwriter--HtmlPreview QScrollBar::handle:horizontal,\nghostwriter--Sidebar QScrollBar::handle:horizontal {\n    min-width: 50px;\n    border: 0;\n    background: #cabfb8;\n    border-radius: 3px;\n}\n\nghostwriter--MarkdownEditor QScrollBar::handle:vertical,\nghostwriter--HtmlPreview QScrollBar::handle:vertical,\nghostwriter--Sidebar QScrollBar::handle:vertical {\n    min-height: 50px;\n    border: 0;\n    background: #cabfb8;\n    border-radius: 3px;\n}\n\nghostwriter--MarkdownEditor QScrollBar::handle:horizontal:hover,\nghostwriter--HtmlPreview QScrollBar::handle:horizontal:hover,\nghostwriter--Sidebar QScrollBar::handle:horizontal:hover {\n    background: #2b99a7;\n}\n\nghostwriter--MarkdownEditor QScrollBar::handle:vertical:hover,\nghostwriter--HtmlPreview QScrollBar::handle:vertical:hover,\nghostwriter--Sidebar QScrollBar::handle:vertical:hover {\n    background: #2b99a7;\n}\n\nghostwriter--MarkdownEditor QScrollBar::add-line,\nghostwriter--HtmlPreview QScrollBar::add-line,\nghostwriter--Sidebar QScrollBar::add-line,\nghostwriter--MarkdownEditor QScrollBar::sub-line,\nghostwriter--HtmlPreview QScrollBar::sub-line,\nghostwriter--Sidebar QScrollBar::sub-line,\nghostwriter--MarkdownEditor QScrollBar::add-page,\nghostwriter--HtmlPreview QScrollBar::add-page,\nghostwriter--Sidebar QScrollBar::add-page,\nghostwriter--MarkdownEditor QScrollBar::sub-page,\nghostwriter--HtmlPreview QScrollBar::sub-page,\nghostwriter--Sidebar QScrollBar::sub-page,\nghostwriter--MarkdownEditor QScrollBar::down-arrow,\nghostwriter--HtmlPreview QScrollBar::down-arrow,\nghostwriter--Sidebar QScrollBar::down-arrow,\nghostwriter--MarkdownEditor QScrollBar::right-arrow,\nghostwriter--HtmlPreview QScrollBar::right-arrow,\nghostwriter--Sidebar QScrollBar::right-arrow {\n    background: transparent;\n    border: 0\n}\n\n/******************************************************************************/\n/*  Menu Bar                                                                  */\n/******************************************************************************/\n\nQMainWindow QMenuBar {\n    color: #3a3434;\n    background-color: #fff6ea;\n    font-size: 10pt;\n    spacing: 2px;\n    border: 0px;\n    border-bottom: 1px;\n    border-color: #e4dad1;\n    border-style: solid;\n    padding: 1px 0px 1px 0px;\n}\n\nQMainWindow QMenuBar::item {\n    padding: 2px 7px 2px 7px;\n    border: 0px;\n    margin: 2px;\n    border-radius: 5px;\n}\n\nQMainWindow QMenuBar::item:selected {\n    background-color: #d2cbc1;\n}\n\nQMainWindow QMenuBar::item:hover {\n    background-color: #d8d1c6;\n}\n\nQMainWindow QMenuBar::item:pressed {\n    background-color: #c4bdb4;\n}\n\n/******************************************************************************/\n/*  Popup menus                                                               */\n/******************************************************************************/\n\nQMainWindow QMenu,\nQMenuBar QMenu {\n    color: #3a3434;\n    background-color: #f8efe3;\n    border: 0px;\n    padding: 7px 0px 7px 0px;\n}\n\nQMainWindow QMenu::item,\nQMenuBar QMenu::item {\n    background-color: transparent;\n    padding: 5px 10px 5px 10px;\n    margin: 0px 0px 0px 0px;\n}\n\nQMainWindow QMenu::indicator,\nQMenuBar QMenu::indicator {\n    width: 16px;\n    height: 16px;\n    background-color: #d2cbc1;\n    padding: 0px 5px 0px 5px;\n    margin: 0px 5px 0px 5px;\n}\n\nQMainWindow QMenu::indicator::unchecked,\nQMenuBar QMenu::indicator::unchecked {\n    width: 16px;\n    height: 16px;\n    background-color: #d2cbc1;\n    border-radius: 2px;\n    border-style: solid;\n    border-width: 1px;\n    border-color: #3a3434;\n    margin: 0px 5px 0px 5px;\n}\n\nQMainWindow QMenu::indicator::checked,\nQMenuBar QMenu::indicator::checked {\n    width: 16px;\n    height: 16px;\n    background-color: #86a4a7;\n    border-radius: 2px;\n    border-style: solid;\n    border-width: 1px;\n    border-color: #fff6ea;\n    margin: 0px 5px 0px 5px;\n}\n\nQMainWindow QMenu::item:selected,\nQMenuBar QMenu::item::selected {\n    background-color: #86a4a7;\n    color: #fff6ea;\n}\n\nQMainWindow QMenu::icon,\nQMenuBar QMenu::icon {\n    border-radius: 2px;\n    border-width: 0px;\n    padding: 1px 3px 1px 3px;\n    margin: 0px 3px 0px 3px;\n}\n\nQMainWindow QMenu::icon::checked,\nQMenuBar QMenu::icon::checked {\n    background-color: #d8d1c6;\n}\n\n/******************************************************************************/\n/*  Editor                                                                    */\n/******************************************************************************/\n\nQMainWindow QPlainTextEdit {\n    border: 0;\n    margin: 0;\n    padding: 5px;\n    background-color: #fff6ea;\n    color: #3a3434;\n    selection-color: #fff6ea;\n    selection-background-color: #86a4a7;\n    font-family: Noto Sans;\n    font-size: 10pt;\n}\n\nQMainWindow QSplitter::handle {\n    border: 0;\n    padding: 0;\n    margin: 0;\n    background-color: #e4dad1;\n}\n\nQMainWindow QSplitter::handle:vertical {\n    height: 1px;\n}\n\nQMainWindow QSplitter::handle:horizontal {\n    width: 1px;\n}\n\n/******************************************************************************/\n/*  Sidebar and Activity Bar                                                  */\n/******************************************************************************/\n\n/* Sidebar */\nQMainWindow ghostwriter--Sidebar,\nQSplitter ghostwriter--Sidebar {\n    border: 0;\n    margin: 0;\n    padding: 0;\n    background-color: #fff6ea;\n}\n\nghostwriter--Sidebar QStackedWidget {\n    border: 0;\n    padding: 1;\n    margin: 0;\n    background-color: #fff6ea;\n    border-width: 0px;\n}\n\n/* Activity bar tabs */\nghostwriter--Sidebar QPushButton[checkable=\"true\"] {\n    icon-size: 22px;\n    min-width: 40px;\n    max-width: 40px;\n    height: 40px;\n    outline: none;\n    margin: 0;\n    padding: 0;\n    border: 0;\n    background-color: transparent;\n    color: #7b6e6e;\n    border-width: 0px;\n    border-left-width: 3px;\n    border-style: solid;\n    border-color: transparent;\n    border-radius: 0px;\n}\n\nghostwriter--Sidebar QPushButton:checked {\n    border-color: #2b99a7;\n    color: #3a3434;\n    background-color: #f1e8dd;\n}\n\nghostwriter--Sidebar QPushButton:hover {\n    background-color: #f1e8dd;\n}\n\nghostwriter--Sidebar QPushButton:checked:hover {\n    border-color: #2b99a7;\n    color: #3a3434;\n    background-color: #f1e8dd;\n}\n\n/* Activity bar buttons */\nghostwriter--Sidebar QPushButton[checkable=\"false\"] {\n    icon-size: 22px;\n    padding: 0;\n    margin: 0;\n    border: 0;\n    border-radius: 5px;\n    background-color: transparent;\n    color: #7b6e6e;\n    width: 40px;\n    height: 40px;\n}\n\nghostwriter--Sidebar QPushButton[checkable=\"false\"]:hover {\n    color: #3a3434;\n    background-color: #f1e8dd;\n}\n\nghostwriter--Sidebar QPushButton[checkable=\"false\"]:pressed {\n    color: #3a3434;\n    background-color: transparent;\n}\n\n/* Stacked widgets inside sidebar pane */\n\nghostwriter--Sidebar QListWidget {\n    outline: none;\n    border: 0;\n    padding: 1;\n    background-color: #fff6ea;\n    color: #3a3434;\n    font-size: 11pt;\n    font-weight: normal\n}\n\nghostwriter--Sidebar QListWidget::item {\n    border: 0;\n    padding: 1 0 1 0;\n    margin: 0;\n    background-color: #fff6ea;\n    color: #3a3434;\n    font-weight: normal\n}\n\nghostwriter--Sidebar QListWidget::item:selected {\n    border-radius: 0px;\n    color: #fff6ea;\n    background-color: #86a4a7;\n}\n\nghostwriter--Sidebar QLabel {\n    border: 0;\n    padding: 0;\n    margin: 0;\n    background-color: transparent;\n    font-size: 11pt;\n    color: #3a3434;\n}\n\n/******************************************************************************/\n/* Status bar                                                                 */\n/******************************************************************************/\n\nQStatusBar {\n    margin: 0;\n    padding: 0;\n    border-top: 1px solid #e4dad1;\n    border-left: 0;\n    border-right: 0;\n    border-bottom: 0;\n    background: #fff6ea;\n    color: #7b6e6e;\n}\n\nQStatusBar QLabel {\n    font-size: 11pt;\n    margin: 0px;\n    padding: 5px;\n    border: 0;\n    background: transparent;\n    color: #7b6e6e;\n}\n\nQStatusBar QToolButton {\n    padding: 5 5 5 5;\n    margin: 0;\n    border: 0;\n    border-radius: 5px;\n    color: #7b6e6e;\n    background-color: transparent;\n    font-size: 16px;\n    width: 32px;\n    height: 16px;\n}\n\nQStatusBar QToolButton:hover,\nQStatusBar QToolButton:checked:hover {\n    background-color: #d8d1c6;\n}\n\nQStatusBar QToolButton:pressed,\nQStatusBar QToolButton:checked:pressed {\n    color: #736767;\n    background-color: #c4bdb4;\n}\n\nQStatusBar QToolButton:flat,\nQStatusBar QToolButton:checked {\n    background-color: #d2cbc1;\n}\n\nQStatusBar QComboBox {\n    height: 22px;\n    border: 0px;\n    margin: 0;\n    padding: 0;\n    color: #7b6e6e;\n    background-color: #fff6ea;\n    font-size: 11pt;\n}\n\nQStatusBar QComboBox:hover {\n    border-bottom: 2px solid #2b99a7;\n}\n\nQStatusBar QListView {\n    padding: 7px 0px 7px 0px;\n    margin: 0px;\n    color: #3a3434;\n    background-color: #fff6ea;\n}\n\nQStatusBar QListView::item {\n    background-color: transparent;\n    padding: 5px 10px 5px 10px;\n    margin: 0px;\n}\n\nQStatusBar QListView::item:selected {\n    background-color: #86a4a7;\n    color: #fff6ea;\n}\n\nQStatusBar QComboBox::drop-down {\n    border: 0;\n    margin: 0;\n    padding: 0;\n    height: 20px;\n    width: 20px;\n}\n\nQStatusBar QComboBox::down-arrow {\n    border: 0;\n    margin: 0;\n    padding: 0;\n    height: 14px;\n    width: 14px;\n    image: url(/tmp/dgCYgP.png)\n}\n\nQStatusBar QComboBox::drop-down:hover {\n    border-radius: 10px;\n    background-color: #d8d1c6;\n}\n\nQStatusBar #leftStatusBarWidget,\nQStatusBar #midStatusBarWidget,\nQStatusBar #rightStatusBarWidget {\n    border: 0;\n    margin: 0;\n    padding: 0;\n}\n\n/******************************************************************************/\n/* Find and Replace Pane                                                      */\n/******************************************************************************/\n\nghostwriter--FindReplace QLabel {\n    font-size: 11pt;\n    margin: 0px;\n    padding: 5px;\n    border: 0;\n    background: transparent;\n    color: #7b6e6e;\n}\n\nghostwriter--FindReplace QPushButton {\n    font-size: 16px;\n    padding: 5 5 5 5;\n    margin: 0;\n    border: 0;\n    border-radius: 5px;\n    color: #7b6e6e;\n    background-color: transparent;\n    min-width: 16px;\n}\n\nghostwriter--FindReplace QPushButton:pressed {\n    color: #363131;\n    background-color: transparent;\n}\n\nghostwriter--FindReplace QPushButton:hover {\n    color: #3c3636;\n    background-color: transparent;\n}\n\nghostwriter--FindReplace QPushButton:disabled {\n    color: #9a8a8a;\n    background-color: transparent;\n}\n\nghostwriter--FindReplace QPushButton[checkable=\"true\"] {\n    color: #7b6e6e;\n    background-color: transparent;\n    min-width: 32px;\n    height: 16px;\n}\n\nghostwriter--FindReplace QPushButton[checkable=\"true\"]:disabled,\nghostwriter--FindReplace QPushButton:flat:disabled {\n    color: #9a8a8a;\n    background-color: #dcd5ca;\n}\n\nghostwriter--FindReplace QPushButton[checkable=\"true\"]:hover,\nghostwriter--FindReplace QPushButton:checked:hover {\n    background-color: #7f7272;\n    background-color: #d8d1c6;\n}\n\nghostwriter--FindReplace QPushButton[checkable=\"true\"]:pressed,\nghostwriter--FindReplace QPushButton:checked:pressed {\n    color: #736767;\n    background-color: #c4bdb4;\n}\n\nghostwriter--FindReplace QPushButton:checked {\n    background-color: #d2cbc1;\n}\n\nghostwriter--FindReplace QPushButton:flat {\n    color: #7b6e6e;\n    background-color: #d2cbc1;\n    font-weight: bold;\n}\n\nghostwriter--FindReplace QPushButton:flat:hover {\n    color: #7f7272;\n    background-color: #d8d1c6;\n}\n\nghostwriter--FindReplace QPushButton:flat:pressed {\n    color: #736767;\n    background-color: #c4bdb4;\n}\n\nghostwriter--FindReplace QPushButton:flat:disabled {\n    color: #9a8a8a;\n    background-color: #dcd5ca;\n}\n\nghostwriter--FindReplace QPushButton#matchCaseButton,\nghostwriter--FindReplace QPushButton#regexButton {\n    font-size: 16px;\n    font-family: default;\n    font-weight: bold;\n} \n\nghostwriter--FindReplace QPushButton#replaceButton,\nghostwriter--FindReplace QPushButton#replaceAllButton {\n    font-size: 11pt;\n    font-family: default;\n}\n\nghostwriter--FindReplace QPushButton#findReplaceCloseButton {\n    padding: 0;\n    margin: 0;\n    icon-size: 16px;\n}\n\nghostwriter--FindReplace QLineEdit {\n    color: #3a3434;\n    background-color: #f1e8dd;\n    border: 0px;\n    border-radius: 3px;\n    selection-color: #fff6ea;\n    selection-background-color: #86a4a7;\n}\n\nghostwriter--FindReplace QLineEdit:focus {\n    border: 1px solid #eae1d7;\n}\n"
        }
      ]
    }
  ]
}