{
  "metadata": {
    "timestamp": 1736565868989,
    "page": 823,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "OpenKinect/libfreenect2",
      "stars": 2090,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 2.458984375,
          "content": "###############################################################################\n# Set default behavior to automatically normalize line endings.\n###############################################################################\n* text=auto\n\n###############################################################################\n# Set default behavior for command prompt diff.\n#\n# This is need for earlier builds of msysgit that does not have it on by\n# default for csharp files.\n# Note: This is only used by command line\n###############################################################################\n#*.cs     diff=csharp\n\n###############################################################################\n# Set the merge driver for project and solution files\n#\n# Merging from the command prompt will add diff markers to the files if there\n# are conflicts (Merging from VS is not affected by the settings below, in VS\n# the diff markers are never inserted). Diff markers may cause the following \n# file extensions to fail to load in VS. An alternative would be to treat\n# these files as binary and thus will always conflict and require user\n# intervention with every merge. To do so, just uncomment the entries below\n###############################################################################\n#*.sln       merge=binary\n#*.csproj    merge=binary\n#*.vbproj    merge=binary\n#*.vcxproj   merge=binary\n#*.vcproj    merge=binary\n#*.dbproj    merge=binary\n#*.fsproj    merge=binary\n#*.lsproj    merge=binary\n#*.wixproj   merge=binary\n#*.modelproj merge=binary\n#*.sqlproj   merge=binary\n#*.wwaproj   merge=binary\n\n###############################################################################\n# behavior for image files\n#\n# image files are treated as binary by default.\n###############################################################################\n#*.jpg   binary\n#*.png   binary\n#*.gif   binary\n\n###############################################################################\n# diff behavior for common document formats\n# \n# Convert binary document formats to text before diffing them. This feature\n# is only available from the command line. Turn it on by uncommenting the \n# entries below.\n###############################################################################\n#*.doc   diff=astextplain\n#*.DOC   diff=astextplain\n#*.docx  diff=astextplain\n#*.DOCX  diff=astextplain\n#*.dot   diff=astextplain\n#*.DOT   diff=astextplain\n#*.pdf   diff=astextplain\n#*.PDF   diff=astextplain\n#*.rtf   diff=astextplain\n#*.RTF   diff=astextplain\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.2265625,
          "content": "build\n\n# Dependency folders\ndepends/*/\ndepends/*.deb\n\n## Ignore Visual Studio temporary files, build results, and\n## files generated by popular Visual Studio add-ons.\n\n# User-specific files\n*.suo\n*.user\n*.sln.docstates\n\n# Build results\n\n[Dd]ebug/\n[Rr]elease/\nx64/\n[Bb]in/\n[Oo]bj/\n\n# Enable \"build/\" folder in the NuGet Packages folder since NuGet packages use it for MSBuild targets\n!packages/*/build/\n\n# MSTest test Results\n[Tt]est[Rr]esult*/\n[Bb]uild[Ll]og.*\n\n*_i.c\n*_p.c\n*.ilk\n*.meta\n*.obj\n*.pch\n*.pdb\n*.pgc\n*.pgd\n*.rsp\n*.sbr\n*.tlb\n*.tli\n*.tlh\n*.tmp\n*.tmp_proj\n*.log\n*.vspscc\n*.vssscc\n.builds\n*.pidb\n*.log\n*.scc\n\n# Visual C++ cache files\nipch/\n*.aps\n*.ncb\n*.opensdf\n*.sdf\n*.cachefile\n\n# Visual Studio profiler\n*.psess\n*.vsp\n*.vspx\n\n# Guidance Automation Toolkit\n*.gpState\n\n# ReSharper is a .NET coding add-in\n_ReSharper*/\n*.[Rr]e[Ss]harper\n\n# TeamCity is a build add-in\n_TeamCity*\n\n# DotCover is a Code Coverage Tool\n*.dotCover\n\n# NCrunch\n*.ncrunch*\n.*crunch*.local.xml\n\n# Installshield output folder\n[Ee]xpress/\n\n# DocProject is a documentation generator add-in\nDocProject/buildhelp/\nDocProject/Help/*.HxT\nDocProject/Help/*.HxC\nDocProject/Help/*.hhc\nDocProject/Help/*.hhk\nDocProject/Help/*.hhp\nDocProject/Help/Html2\nDocProject/Help/html\n\n# Click-Once directory\npublish/\n\n# Publish Web Output\n*.Publish.xml\n\n# NuGet Packages Directory\n## TODO: If you have NuGet Package Restore enabled, uncomment the next line\n#packages/\n\n# Windows Azure Build Output\ncsx\n*.build.csdef\n\n# Windows Store app package directory\nAppPackages/\n\n# Others\nsql/\n*.Cache\nClientBin/\n[Ss]tyle[Cc]op.*\n~$*\n*~\n*.dbmdl\n*.[Pp]ublish.xml\n*.pfx\n*.publishsettings\n\n# RIA/Silverlight projects\nGenerated_Code/\n\n# Backup & report files from converting an old project file to a newer\n# Visual Studio version. Backup files are not needed, because we have git ;-)\n_UpgradeReport_Files/\nBackup*/\nUpgradeLog*.XML\nUpgradeLog*.htm\n\n# SQL Server files\nApp_Data/*.mdf\nApp_Data/*.ldf\n\n\n#LightSwitch generated files\nGeneratedArtifacts/\n_Pvt_Extensions/\nModelManifest.xml\n\n# =========================\n# Windows detritus\n# =========================\n\n# Windows image file caches\nThumbs.db\nehthumbs.db\n\n# Folder config file\nDesktop.ini\n\n# Recycle Bin used on file shares\n$RECYCLE.BIN/\n\n# Mac desktop service store files\n.DS_Store\n"
        },
        {
          "name": "APACHE20",
          "type": "blob",
          "size": 11.091796875,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 15.31640625,
          "content": "CMAKE_MINIMUM_REQUIRED(VERSION 2.8.12.1)\n\nSET(PROJECT_VER_MAJOR 0)\nSET(PROJECT_VER_MINOR 2)\nSET(PROJECT_VER_PATCH 0)\nSET(PROJECT_VER \"${PROJECT_VER_MAJOR}.${PROJECT_VER_MINOR}.${PROJECT_VER_PATCH}\")\nSET(PROJECT_APIVER \"${PROJECT_VER_MAJOR}.${PROJECT_VER_MINOR}\")\n\nif(WIN32 AND NOT MINGW)\n  if(NOT DEFINED CMAKE_DEBUG_POSTFIX)\n    set(CMAKE_DEBUG_POSTFIX \"d\")\n  endif()\nendif()\n\nIF(WIN32)\n  # no permission for the default install prefix %ProgramFiles%\n  SET(CMAKE_INSTALL_PREFIX \"${CMAKE_BINARY_DIR}/install\" CACHE STRING \"installation path\")\nENDIF()\n\nIF(NOT DEFINED CMAKE_BUILD_TYPE)\n  # No effect for multi-configuration generators (e.g. for Visual Studio)\n  SET(CMAKE_BUILD_TYPE RelWithDebInfo CACHE STRING \"Choose: RelWithDebInfo Release Debug MinSizeRel None\")\nENDIF()\n\nPROJECT(libfreenect2)\n\nIF(POLICY CMP0042)\n  cmake_policy(SET CMP0042 NEW)\nENDIF()\n\nSET(MY_DIR ${libfreenect2_SOURCE_DIR})\nSET(DEPENDS_DIR \"${MY_DIR}/depends\" CACHE STRING \"dependency directory must be set to 'false' if external deps are used\")\n\nOPTION(BUILD_SHARED_LIBS \"Build shared (ON) or static (OFF) libraries\" ON)\nOPTION(BUILD_EXAMPLES \"Build examples\" ON)\nOPTION(BUILD_OPENNI2_DRIVER \"Build OpenNI2 driver\" ON)\nOPTION(ENABLE_CXX11 \"Enable C++11 support\" OFF)\nOPTION(ENABLE_OPENCL \"Enable OpenCL support\" ON)\nOPTION(ENABLE_CUDA \"Enable CUDA support\" ON)\nOPTION(ENABLE_OPENGL \"Enable OpenGL support\" ON)\nOPTION(ENABLE_VAAPI \"Enable VA-API support\" ON)\nOPTION(ENABLE_TEGRAJPEG \"Enable Tegra HW JPEG support\" ON)\nOPTION(ENABLE_PROFILING \"Collect profiling stats (memory consuming)\" OFF)\n\nIF(ENABLE_PROFILING)\n  SET(LIBFREENECT2_WITH_PROFILING 1)\nENDIF()\n\nIF(MSVC)\n  # suppress several \"possible loss of data\" warnings, and\n  # \"zero-length array in struct\" from libusb.h\n  SET(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} /wd4267 /wd4244 /wd4200 /wd4305 /wd4146\")\n  ADD_DEFINITIONS(-D_CRT_SECURE_NO_WARNINGS) # no warning for getenv()\nELSE()\n  # Heed warnings from non-MSVC compilers\n  SET(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -Wall\")\nENDIF()\n\nSET(HAVE_CXX11 disabled)\nIF(ENABLE_CXX11)\n  INCLUDE(CheckCXXCompilerFlag)\n  CHECK_CXX_COMPILER_FLAG(\"-std=c++11\" COMPILER_SUPPORTS_CXX11)\n  CHECK_CXX_COMPILER_FLAG(\"-std=c++0x\" COMPILER_SUPPORTS_CXX0X)\n  IF(COMPILER_SUPPORTS_CXX11)\n    SET(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -std=c++11\")\n    SET(LIBFREENECT2_WITH_CXX11_SUPPORT 1)\n    SET(HAVE_CXX11 yes)\n  ELSEIF(COMPILER_SUPPORTS_CXX0X)\n    SET(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -std=c++0x\")\n    SET(HAVE_CXX11 c++0x)\n  ELSE()\n    SET(HAVE_CXX11 no)\n    MESSAGE(STATUS \"The compiler ${CMAKE_CXX_COMPILER} has no C++11 support. Please use a different C++ compiler.\")\n  ENDIF()\nENDIF(ENABLE_CXX11)\n\n# additional cmake modules\nLIST(APPEND CMAKE_MODULE_PATH ${MY_DIR}/cmake_modules)\n\n# setup threading\nINCLUDE(SetupLibfreenect2Threading)\n\nINCLUDE(GenerateResources)\n\n#set the default path for built executables to the \"bin\" directory\nSET(CMAKE_RUNTIME_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/bin)\n\n#set the default path for built libraries to the \"lib\" directory\nSET(CMAKE_LIBRARY_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/lib)\nSET(CMAKE_ARCHIVE_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/lib)\n\n# dependencies\nFIND_PACKAGE(PkgConfig)    # try find PKGConfig as it will be used if found\nFIND_PACKAGE(LibUSB REQUIRED)\n\n# Add includes\nINCLUDE_DIRECTORIES(\n  \"${MY_DIR}/include\"\n  \"${MY_DIR}/include/internal\"\n  ${PROJECT_BINARY_DIR} # for generated headers\n  ${LIBFREENECT2_THREADING_INCLUDE_DIR}\n  ${LibUSB_INCLUDE_DIRS}\n)\n\nSET(RESOURCES_INC_FILE \"${PROJECT_BINARY_DIR}/resources.inc.h\")\n\nSET(SOURCES\n  include/internal/libfreenect2/protocol/command.h\n  include/internal/libfreenect2/protocol/command_transaction.h\n  include/internal/libfreenect2/protocol/response.h\n  include/internal/libfreenect2/protocol/usb_control.h\n\n  include/internal/libfreenect2/usb/event_loop.h\n  include/internal/libfreenect2/usb/transfer_pool.h\n\n  include/libfreenect2/logger.h\n  include/internal/libfreenect2/logging.h\n\n  include/internal/libfreenect2/async_packet_processor.h\n  include/internal/libfreenect2/depth_packet_processor.h\n  include/internal/libfreenect2/depth_packet_stream_parser.h\n  include/internal/libfreenect2/allocator.h\n  include/libfreenect2/frame_listener.hpp\n  include/libfreenect2/frame_listener_impl.h\n  include/libfreenect2/libfreenect2.hpp\n  include/libfreenect2/color_settings.h\n  include/libfreenect2/led_settings.h\n  include/libfreenect2/packet_pipeline.h\n  include/internal/libfreenect2/packet_processor.h\n  include/libfreenect2/registration.h\n  include/internal/libfreenect2/resource.h\n  include/internal/libfreenect2/rgb_packet_processor.h\n  include/internal/libfreenect2/rgb_packet_stream_parser.h\n  include/internal/libfreenect2/threading.h\n\n  src/transfer_pool.cpp\n  src/event_loop.cpp\n  src/usb_control.cpp\n  src/allocator.cpp\n  src/frame_listener_impl.cpp\n  src/packet_pipeline.cpp\n  src/rgb_packet_stream_parser.cpp\n  src/rgb_packet_processor.cpp\n  src/depth_packet_stream_parser.cpp\n  src/depth_packet_processor.cpp\n  src/cpu_depth_packet_processor.cpp\n  src/resource.cpp\n  src/command_transaction.cpp\n  src/registration.cpp\n  src/logging.cpp\n  src/libfreenect2.cpp\n\n  ${LIBFREENECT2_THREADING_SOURCE}\n  ${RESOURCES_INC_FILE}\n  \"${PROJECT_BINARY_DIR}/libfreenect2/config.h\"\n  \"${PROJECT_BINARY_DIR}/libfreenect2/export.h\"\n)\n\nSET(LIBRARIES\n  ${LibUSB_LIBRARIES}\n  ${LIBFREENECT2_THREADING_LIBRARIES}\n)\n\nSET(LIBFREENECT2_DLLS\n  ${LibUSB_DLL}\n)\n\nSET(HAVE_VideoToolbox \"no (Apple only)\")\nIF(APPLE)\n  FIND_LIBRARY(VIDEOTOOLBOX_LIBRARY VideoToolbox)\n\n  SET(HAVE_VideoToolbox no)\n  IF(VIDEOTOOLBOX_LIBRARY)\n    SET(LIBFREENECT2_WITH_VT_SUPPORT 1)\n    SET(HAVE_VideoToolbox yes)\n\n    FIND_LIBRARY(COREFOUNDATION_LIBRARY CoreFoundation REQUIRED)\n    FIND_LIBRARY(COREMEDIA_LIBRARY CoreMedia REQUIRED)\n    FIND_LIBRARY(COREVIDEO_LIBRARY CoreVideo REQUIRED)\n\n    LIST(APPEND SOURCES\n      src/vt_rgb_packet_processor.cpp\n    )\n\n    LIST(APPEND LIBRARIES\n      ${VIDEOTOOLBOX_LIBRARY}\n      ${COREFOUNDATION_LIBRARY}\n      ${COREMEDIA_LIBRARY}\n      ${COREVIDEO_LIBRARY}\n    )\n  ENDIF(VIDEOTOOLBOX_LIBRARY)\nENDIF(APPLE)\n\nSET(HAVE_VAAPI disabled)\nIF(ENABLE_VAAPI)\n  IF(PKG_CONFIG_FOUND)\n    PKG_CHECK_MODULES(VAAPI libva libva-drm)\n  ENDIF()\n  FIND_PACKAGE(JPEG)\n\n  SET(HAVE_VAAPI no)\n  IF(VAAPI_FOUND AND JPEG_FOUND)\n    SET(LIBFREENECT2_WITH_VAAPI_SUPPORT 1)\n    SET(HAVE_VAAPI yes)\n\n    INCLUDE_DIRECTORIES(${VAAPI_INCLUDE_DIRS})\n\n    LIST(APPEND SOURCES\n      src/vaapi_rgb_packet_processor.cpp\n    )\n    LIST(APPEND LIBRARIES\n      ${VAAPI_LIBRARIES}\n      ${JPEG_LIBRARY}\n    )\n  ENDIF()\nENDIF(ENABLE_VAAPI)\n\nSET(HAVE_TegraJPEG disabled)\nIF(ENABLE_TEGRAJPEG)\n  FIND_PACKAGE(TegraJPEG)\n\n  SET(HAVE_TegraJPEG no)\n  IF(TegraJPEG_FOUND)\n    SET(LIBFREENECT2_WITH_TEGRAJPEG_SUPPORT 1)\n    SET(HAVE_TegraJPEG yes)\n\n    INCLUDE_DIRECTORIES(${TegraJPEG_INCLUDE_DIRS})\n\n    LIST(APPEND SOURCES\n      src/tegra_jpeg_rgb_packet_processor.cpp\n    )\n\n    LIST(APPEND LIBRARIES\n      ${CMAKE_DL_LIBS}\n    )\n  ENDIF()\nENDIF()\n\nIF(LIBFREENECT2_WITH_VT_SUPPORT)\n  FIND_PACKAGE(TurboJPEG)\nELSE()\n  # VAAPI can fail to start at runtime. It must have a fallback.\n  FIND_PACKAGE(TurboJPEG REQUIRED)\nENDIF()\n\nSET(HAVE_TurboJPEG no)\nIF(TurboJPEG_FOUND)\n  SET(LIBFREENECT2_WITH_TURBOJPEG_SUPPORT 1)\n  SET(HAVE_TurboJPEG yes)\n\n  INCLUDE_DIRECTORIES(${TurboJPEG_INCLUDE_DIRS})\n\n  LIST(APPEND SOURCES\n    src/turbo_jpeg_rgb_packet_processor.cpp\n  )\n\n  LIST(APPEND LIBRARIES\n    ${TurboJPEG_LIBRARIES}\n  )\n\n  LIST(APPEND LIBFREENECT2_DLLS\n   ${TurboJPEG_DLL}\n  )\nENDIF()\n\nSET(HAVE_OpenGL disabled)\nIF(ENABLE_OPENGL)\n  FIND_PACKAGE(GLFW3)\n  FIND_PACKAGE(OpenGL)\n  SET(HAVE_OpenGL no)\n  IF(GLFW3_FOUND AND OPENGL_FOUND)\n    SET(LIBFREENECT2_WITH_OPENGL_SUPPORT 1)\n    SET(HAVE_OpenGL yes)\n\n    INCLUDE_DIRECTORIES(${GLFW3_INCLUDE_DIRS})\n\n    LIST(APPEND LIBFREENECT2_DLLS ${GLFW3_DLL})\n    LIST(APPEND LIBRARIES\n      ${GLFW3_LIBRARIES}\n      ${OPENGL_gl_LIBRARY}\n    )\n    LIST(APPEND SOURCES\n      src/flextGL.cpp\n      src/opengl_depth_packet_processor.cpp\n    )\n\n    LIST(APPEND RESOURCES\n      src/shader/debug.fs\n      src/shader/default.vs\n      src/shader/filter1.fs\n      src/shader/filter2.fs\n      src/shader/stage1.fs\n      src/shader/stage2.fs\n    )\n  ENDIF()\nENDIF(ENABLE_OPENGL)\n\nSET(HAVE_OpenCL disabled)\nIF(ENABLE_OPENCL)\n  FIND_PACKAGE(OpenCL)\n\n  SET(HAVE_OpenCL no)\n  IF(OpenCL_FOUND)\n    SET(LIBFREENECT2_WITH_OPENCL_SUPPORT 1)\n    SET(HAVE_OpenCL yes)\n\n    IF(UNIX AND NOT APPLE)\n      INCLUDE(CheckOpenCLICDLoader)\n      IF(OpenCL_C_WORKS AND NOT OpenCL_CXX_WORKS)\n        SET(LIBFREENECT2_OPENCL_ICD_LOADER_IS_OLD 1)\n        SET(HAVE_OpenCL \"yes but buggy\")\n        MESSAGE(WARNING \"Your libOpenCL.so is incompatible with CL/cl.h. Install ocl-icd-opencl-dev to update libOpenCL.so?\")\n      ENDIF()\n    ENDIF()\n    INCLUDE_DIRECTORIES(${OpenCL_INCLUDE_DIRS})\n\n    LIST(APPEND SOURCES\n      src/opencl_depth_packet_processor.cpp\n      src/opencl_kde_depth_packet_processor.cpp\n    )\n\n    LIST(APPEND LIBRARIES\n      ${OpenCL_LIBRARIES}\n    )\n\n    LIST(APPEND RESOURCES\n      src/opencl_depth_packet_processor.cl\n      src/opencl_kde_depth_packet_processor.cl\n    )\n\n    # Major Linux distro stable releases have buggy OpenCL ICD loader.\n    # The workaround of disabling exceptions can only be set up during compile time.\n    # Diabling it for all should be harmless. The flag is the same for GCC/Clang/ICC.\n    IF(UNIX AND NOT APPLE)\n      SET(CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS} -fno-exceptions\")\n    ENDIF()\n  ENDIF(OpenCL_FOUND)\nENDIF(ENABLE_OPENCL)\n\nSET(HAVE_CUDA disabled)\nIF(ENABLE_CUDA)\n  FIND_PACKAGE(CUDA)\n  SET(HAVE_CUDA no)\n  IF(CUDA_FOUND AND MSVC14 AND CUDA_VERSION VERSION_LESS 8.0)\n    SET(HAVE_CUDA \"no (VS2015 not supported)\")\n  ELSEIF(CUDA_FOUND)\n    SET(LIBFREENECT2_WITH_CUDA_SUPPORT 1)\n    SET(HAVE_CUDA yes)\n\n    STRING(REPLACE \"\\\\\" \"/\" NVCUDASAMPLES_ROOT \"$ENV{NVCUDASAMPLES_ROOT}\")\n    STRING(REPLACE \"\\\\\" \"/\" NVCUDASAMPLES8_0_ROOT \"$ENV{NVCUDASAMPLES8_0_ROOT}\")\n    CUDA_INCLUDE_DIRECTORIES(\n      \"${MY_DIR}/include/\"\n      \"${CUDA_TOOLKIT_ROOT_DIR}/samples/common/inc\"\n      \"${NVCUDASAMPLES_ROOT}/common/inc\"\n      \"${NVCUDASAMPLES8_0_ROOT}/common/inc\"\n    )\n    SET(CUDA_FLAGS -use_fast_math)\n    IF(NOT MSVC)\n      SET(CUDA_FLAGS \"${CUDA_FLAGS} -Xcompiler -fPIC\")\n    ENDIF()\n    IF(HAVE_CXX11 STREQUAL yes AND CUDA_VERSION VERSION_GREATER 7.0)\n      SET(CUDA_FLAGS \"${CUDA_FLAGS} -std=c++11\")\n    ENDIF()\n\n    SET(OLD_CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS}\")\n    STRING(REGEX REPLACE \"-std=c\\\\+\\\\+..\" \"\" CMAKE_CXX_FLAGS \"${CMAKE_CXX_FLAGS}\")\n    CUDA_COMPILE(CUDA_OBJECTS\n      src/cuda_depth_packet_processor.cu\n      src/cuda_kde_depth_packet_processor.cu\n      OPTIONS ${CUDA_FLAGS}\n    )\n    SET(CMAKE_CXX_FLAGS \"${OLD_CMAKE_CXX_FLAGS}\")\n\n    INCLUDE_DIRECTORIES(${CUDA_INCLUDE_DIRS})\n\n    LIST(APPEND SOURCES\n      ${CUDA_OBJECTS}\n    )\n\n    LIST(APPEND LIBRARIES\n      ${CUDA_LIBRARIES}\n    )\n  ENDIF()\nENDIF(ENABLE_CUDA)\n\n# RPATH handling for CUDA 8.0 libOpenCL.so conflict. See #804.\nIF(HAVE_OpenCL STREQUAL yes AND UNIX AND NOT APPLE)\n  FILE(GLOB CUDA_ld_so_conf /etc/ld.so.conf.d/cuda*.conf)\n  IF(CUDA_ld_so_conf)\n    MESSAGE(WARNING \"Your CUDA installation overrides OpenCL system library path.\")\n    GET_FILENAME_COMPONENT(OpenCL_LIB_PATH ${OpenCL_LIBRARY} DIRECTORY)\n    SET(CMAKE_INSTALL_RPATH ${OpenCL_LIB_PATH} CACHE STRING \"Set RPATH for system OpenCL\")\n  ENDIF()\nENDIF()\n\n# RPATH handling for private libusb copies\n# Users have two options:\n# 1. Build libusb in depends/ and leave it there:\n#      Do NOT set CMAKE_INSTALL_RPATH. It works by default.\n# 2. Build libusb and install it somewhere:\n#      Set CMAKE_INSTALL_RPATH to the libusb.so installation directory before compiling.\n# Both command line -DCMAKE_INSTALL_RPATH=... and CMake GUI settings are accepted.\n#\n# Anyway if wrong versions of libusb is used, errors will be reported explicitly.\nIF(NOT DEFINED CMAKE_INSTALL_RPATH AND NOT ${LibUSB_LIBDIR} MATCHES \"^/usr/lib\")\n  SET(CMAKE_INSTALL_RPATH ${LibUSB_LIBDIR} CACHE STRING \"Set RPATH for a private libusb\")\nELSEIF(DEFINED CMAKE_INSTALL_RPATH)\n  SET(CMAKE_INSTALL_RPATH ${CMAKE_INSTALL_RPATH} CACHE STRING \"Set RPATH for a private libusb\")\nENDIF()\nIF(DEFINED CMAKE_INSTALL_RPATH)\n  MESSAGE(STATUS \"RPATH set to ${CMAKE_INSTALL_RPATH}\")\nENDIF()\n\nCONFIGURE_FILE(\"${MY_DIR}/include/libfreenect2/config.h.in\" \"${PROJECT_BINARY_DIR}/libfreenect2/config.h\" @ONLY)\nGENERATE_RESOURCES(${RESOURCES_INC_FILE} ${MY_DIR} ${RESOURCES})\n\nADD_DEFINITIONS(-DRESOURCES_INC)\nADD_LIBRARY(freenect2 ${SOURCES})\nSET_TARGET_PROPERTIES(freenect2 PROPERTIES\n  CXX_VISIBILITY_PRESET hidden\n  VISIBILITY_INLINES_HIDDEN 1\n  VERSION ${PROJECT_VER}\n  SOVERSION ${PROJECT_APIVER}\n)\nINCLUDE(GenerateExportHeader)\nGENERATE_EXPORT_HEADER(freenect2\n  BASE_NAME libfreenect2\n  EXPORT_FILE_NAME libfreenect2/export.h\n)\n\nIF(MSVC AND NOT BUILD_SHARED_LIBS)\n  # MSVC creates freenect2.lib for both dynamic and static by default\n  set_target_properties(freenect2 PROPERTIES SUFFIX \"static.lib\")\nENDIF()\nSTRING(REPLACE \";\" \"\\n \" LIBRARIES_STRING \"${LIBRARIES}\")\nMESSAGE(STATUS \"Linking with these libraries: \\n ${LIBRARIES_STRING}\")\nTARGET_LINK_LIBRARIES(freenect2 ${LIBRARIES})\n\nCONFIGURE_FILE(freenect2.cmake.in \"${PROJECT_BINARY_DIR}/freenect2Config.cmake\" @ONLY)\nCONFIGURE_FILE(freenect2Version.cmake.in \"${PROJECT_BINARY_DIR}/freenect2ConfigVersion.cmake\" @ONLY)\nCONFIGURE_FILE(freenect2.pc.in \"${PROJECT_BINARY_DIR}/freenect2.pc\" @ONLY)\n\nINSTALL(TARGETS freenect2 DESTINATION lib RUNTIME DESTINATION bin)\nINSTALL(DIRECTORY \"${MY_DIR}/include/${PROJECT_NAME}\" DESTINATION include PATTERN \"*.in\" EXCLUDE)\nINSTALL(DIRECTORY \"${PROJECT_BINARY_DIR}/${PROJECT_NAME}\" DESTINATION include)\nINSTALL(FILES \"${PROJECT_BINARY_DIR}/freenect2Config.cmake\" DESTINATION lib/cmake/freenect2/)\nINSTALL(FILES \"${PROJECT_BINARY_DIR}/freenect2ConfigVersion.cmake\" DESTINATION lib/cmake/freenect2/)\nINSTALL(FILES \"${PROJECT_BINARY_DIR}/freenect2.pc\" DESTINATION lib/pkgconfig/)\n\nADD_SUBDIRECTORY(${MY_DIR}/doc)\n\nSET(HAVE_Examples disabled)\nIF(BUILD_EXAMPLES)\n  SET(HAVE_Examples yes)\n  MESSAGE(STATUS \"Configurating examples\")\n  ADD_SUBDIRECTORY(${MY_DIR}/examples)\nENDIF()\n\nSET(HAVE_OpenNI2 disabled)\nIF(BUILD_OPENNI2_DRIVER)\n  FIND_PACKAGE(OpenNI2)\n  SET(HAVE_OpenNI2 no)\n  IF(OpenNI2_FOUND)\n    SET(HAVE_OpenNI2 yes)\n    FILE(GLOB OPENNI2_DRIVER_SOURCES src/openni2/*.cpp)\n    ADD_LIBRARY(freenect2-openni2 ${OPENNI2_DRIVER_SOURCES} ${LIBFREENECT2_THREADING_SOURCE})\n    TARGET_INCLUDE_DIRECTORIES(freenect2-openni2 PRIVATE ${OpenNI2_INCLUDE_DIRS})\n    TARGET_LINK_LIBRARIES(freenect2-openni2 freenect2 ${LIBFREENECT2_THREADING_LIBRARIES})\n    SET_TARGET_PROPERTIES(freenect2-openni2 PROPERTIES SOVERSION 0)\n    IF(NOT ${CMAKE_INSTALL_PREFIX} MATCHES \"^/usr\")\n      SET_TARGET_PROPERTIES(freenect2-openni2 PROPERTIES INSTALL_RPATH \"${CMAKE_INSTALL_PREFIX}/lib\")\n    ENDIF()\n    INSTALL(TARGETS freenect2-openni2 DESTINATION lib/OpenNI2/Drivers RUNTIME DESTINATION bin)\n    ADD_CUSTOM_TARGET(install-openni2\n      DEPENDS freenect2-openni2\n      COMMAND ${CMAKE_COMMAND} -E copy_directory \"${CMAKE_INSTALL_PREFIX}/lib/OpenNI2/Drivers/\" \"${OpenNI2_LIBRARY_DIR}/OpenNI2/Drivers/\"\n      VERBATIM\n    )\n  ENDIF()\nENDIF()\n\nOPTION(BUILD_STREAMER_RECORDER \"Build streamer_recorder\" OFF)\nSET(HAVE_streamer_recorder disabled)\nIF(BUILD_STREAMER_RECORDER)\n  SET(HAVE_streamer_recorder yes)\n  MESSAGE(STATUS \"Configurating streamer_recorder\")\n  ADD_SUBDIRECTORY(${MY_DIR}/tools/streamer_recorder)\nENDIF()\n\nGET_CMAKE_PROPERTY(vars VARIABLES)\nMESSAGE(STATUS \"Feature list:\")\nFOREACH(var ${vars})\n  IF(var MATCHES ^HAVE_)\n    STRING(REPLACE HAVE_ \"\" feature ${var})\n    MESSAGE(STATUS \"  ${feature}    ${${var}}\")\n  ENDIF()\nENDFOREACH()\n"
        },
        {
          "name": "CONTRIB",
          "type": "blob",
          "size": 1.212890625,
          "content": "Albert Hofkamp <a.t.hofkamp@tue.nl>\nAlistair <alistair.wk@gmail.com>\naugmenta <augmenta@augmenta.home>\nBrendan Burns <bburns@google.com>\nChristian Kerl <christian.kerl@in.tum.de>\nDave Coleman <davetcoleman@gmail.com>\nDorian Galvez-Lopez <dorian@email.gwu.edu>\nFederico Spinelli <fspinelli@gmail.com>\nFlorian Echtler <floe@butterbrot.org>\nFrancisco Facioni <fran6co@gmail.com>\nGabor Papp <gabor.papp@gmail.com>\nGiacomo Dabisias <g.dabisias@sssup.it>\nHenning Jungkurth <henning.jungkurth@gmail.com>\nJames Billingham <james@jamesbillingham.com>\nJoshua Blake <joshblake@gmail.com>\nLars Glud <larshg@gmail.com>\nLingzhu Xiang <lingzhu@lingzhuxiang.com>\nLudique <contacto@ludique.cl>\nMario Wündsch <dev@wuendsch.net>\nMatthias Goldhoorn <matthias.goldhoorn@dfki.de>\nMatthieu FT <matthieu.ft@gmx.fr>\nMrTatsch <tatsch@gmail.com>\nPaul Reynolds <paul@blastoffgames.net>\nP.E. Viau <viau.pe@gmail.com>\nrahulraw <rahulrawat.can@gmail.com>\nRich Wareham <rjw57@cam.ac.uk>\nRyan Gordon <ryan@quizlet.com>\nSergey Gusarov <laborer2008@gmail.com>\nSerguei Mokhov <mokhov@cse.concordia.ca>\nSteffen Fuchs <st.fuchs.tr@gmail.com>\nThiemo Wiedemeyer <wiedemeyer@cs.uni-bremen.de>\nvinouz <vinouz@yahoo.fr>\nyuanmingze <3054502461@sina.com>\nZou Hanya <hanyazou@gmail.com>\n"
        },
        {
          "name": "GPL2",
          "type": "blob",
          "size": 17.58984375,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.\n                       51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Library General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\f\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\f\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\f\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\f\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\f\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\n\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Library General\nPublic License instead of this License.\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 13.228515625,
          "content": "# libfreenect2\n\n## Table of Contents\n\n* [Description](README.md#description)\n* [Requirements](README.md#requirements)\n* [Troubleshooting](README.md#troubleshooting-and-reporting-bugs)\n* [Maintainers](README.md#maintainers)\n* [Installation](README.md#installation)\n  * [Windows / Visual Studio](README.md#windows--visual-studio)\n  * [MacOS](README.md#macos)\n  * [Linux](README.md#linux)\n* [API Documentation (external)](https://openkinect.github.io/libfreenect2/)\n\n## Description\n\nDriver for Kinect for Windows v2 (K4W2) devices (release and developer preview).\n\nNote: libfreenect2 does not do anything for either Kinect for Windows v1 or Kinect for Xbox 360 sensors. Use libfreenect1 for those sensors.\n\nIf you are using libfreenect2 in an academic context, please cite our work using the following DOI: [![DOI](https://zenodo.org/badge/DOI/10.5281/zenodo.50641.svg)](https://doi.org/10.5281/zenodo.50641)\n\n\n\nIf you use the KDE depth unwrapping algorithm implemented in the library, please also cite this ECCV 2016 [paper](http://users.isy.liu.se/cvl/perfo/abstracts/jaremo16.html).\n\nThis driver supports:\n* RGB image transfer\n* IR and depth image transfer\n* registration of RGB and depth images\n\nMissing features:\n* firmware updates (see [issue #460](https://github.com/OpenKinect/libfreenect2/issues/460) for WiP)\n\nWatch the OpenKinect wiki at www.openkinect.org and the mailing list at https://groups.google.com/forum/#!forum/openkinect for the latest developments and more information about the K4W2 USB protocol.\n\nThe API reference documentation is provided here https://openkinect.github.io/libfreenect2/.\n\n## Requirements\n\n### Hardware requirements\n\n* USB 3.0 controller. USB 2 is not supported.\n\nIntel and NEC USB 3.0 host controllers are known to work. ASMedia controllers are known to not work.\n\nVirtual machines likely do not work, because USB 3.0 isochronous transfer is quite delicate.\n\n##### Requirements for multiple Kinects\n\nIt has been reported to work for up to 5 devices on a high-end PC using multiple separate PCI Express USB3 expansion cards (with NEC controller chip). If you're using Linux, you may have to [increase USBFS memory buffers](https://github.com/OpenKinect/libfreenect2/wiki/Troubleshooting#multiple-kinects-try-increasing-usbfs-buffer-size). Depending on the number of Kinects, you may need to use an even larger buffer size. If you're using an expansion card, make sure it's not plugged into an PCI-E x1 slot. A single lane doesn't have enough bandwidth. x8 or x16 slots usually work.\n\n### Operating system requirements\n\n* Windows 7 (buggy), Windows 8, Windows 8.1, and probably Windows 10\n* Debian, Ubuntu 14.04 or newer, probably other Linux distros. Recommend kernel 3.16+ or as new as possible.\n* Mac OS X\n\n### Requirements for optional features\n\n* OpenGL depth processing: OpenGL 3.1 (Windows, Linux, Mac OS X). OpenGL ES is not supported at the moment.\n* OpenCL depth processing: OpenCL 1.1\n* CUDA depth processing: CUDA (6.5 and 7.5 are tested; The minimum version is not clear.)\n* VAAPI JPEG decoding: Intel (minimum Ivy Bridge or newer) and Linux only\n* VideoToolbox JPEG decoding: Mac OS X only\n* OpenNI2 integration: OpenNI2 2.2.0.33\n* Jetson TK1: Linux4Tegra 21.3 or later. Check [Jetson TK1 issues](https://github.com/OpenKinect/libfreenect2/wiki/Troubleshooting#jetson-tk1-issues) before installation. Jetson TX1 is not yet supported as the developers don't have one, but it may be easy to add the support.\n\n## Troubleshooting and reporting bugs\n\nFirst, check https://github.com/OpenKinect/libfreenect2/wiki/Troubleshooting for known issues.\n\nWhen you report USB issues, please attach relevant debug log from running the program with environment variable `LIBUSB_DEBUG=3`, and relevant log from `dmesg`. Also include relevant hardware information `lspci` and `lsusb -t`.\n\n## Maintainers\n\n* Joshua Blake <joshblake@gmail.com>\n* Florian Echtler\n* Christian Kerl\n* Lingzhu Xiang (development/master branch)\n\n## Installation\n\n### Windows / Visual Studio\n\n* Install UsbDk driver\n\n    1. (Windows 7) You must first install Microsoft Security Advisory 3033929 otherwise your USB keyboards and mice will stop working!\n    2. Download the latest x64 installer from https://github.com/daynix/UsbDk/releases, install it.\n    3. If UsbDk somehow does not work, uninstall UsbDk and follow the libusbK instructions.\n\n    This doesn't interfere with the Microsoft SDK. Do not install both UsbDK and libusbK drivers\n* (Alternatively) Install libusbK driver\n\n    You don't need the Kinect for Windows v2 SDK to build and install libfreenect2, though it doesn't hurt to have it too. You don't need to uninstall the SDK or the driver before doing this procedure.\n\n    Install the libusbK backend driver for libusb. Please follow the steps exactly:\n\n    1. Download Zadig from http://zadig.akeo.ie/.\n    2. Run Zadig and in options, check \"List All Devices\" and uncheck \"Ignore Hubs or Composite Parents\"\n    3. Select the \"Xbox NUI Sensor (composite parent)\" from the drop-down box. (Important: Ignore the \"NuiSensor Adaptor\" varieties, which are the adapter, NOT the Kinect) The current driver will list usbccgp. USB ID is VID 045E, PID 02C4 or 02D8.\n    4. Select libusbK (v3.0.7.0 or newer) from the replacement driver list.\n    5. Click the \"Replace Driver\" button. Click yes on the warning about replacing a system driver. (This is because it is a composite parent.)\n\n    To uninstall the libusbK driver (and get back the official SDK driver, if installed):\n\n    1. Open \"Device Manager\"\n    2. Under \"libusbK USB Devices\" tree, right click the \"Xbox NUI Sensor (Composite Parent)\" device and select uninstall.\n    3. Important: Check the \"Delete the driver software for this device.\" checkbox, then click OK.\n\n    If you already had the official SDK driver installed and you want to use it:\n\n    4. In Device Manager, in the Action menu, click \"Scan for hardware changes.\"\n\n    This will enumerate the Kinect sensor again and it will pick up the K4W2 SDK driver, and you should be ready to run KinectService.exe again immediately.\n\n    You can go back and forth between the SDK driver and the libusbK driver very quickly and easily with these steps.\n\n* Install libusb\n\n    Download the latest build (.7z file) from https://github.com/libusb/libusb/releases, and extract as `depends/libusb` (rename folder `libusb-1.x.y` to `libusb` if any).\n* Install TurboJPEG\n\n    Download the `-vc64.exe` installer from http://sourceforge.net/projects/libjpeg-turbo/files, extract it to `c:\\libjpeg-turbo64` (the installer's default) or `depends/libjpeg-turbo64`, or anywhere as specified by the environment variable `TurboJPEG_ROOT`.\n* Install GLFW\n\n    Download from http://www.glfw.org/download.html (64-bit), extract as `depends/glfw` (rename `glfw-3.x.x.bin.WIN64` to `glfw`), or anywhere as specified by the environment variable `GLFW_ROOT`.\n* Install OpenCL (optional)\n    1. Intel GPU: Download \"Intel® SDK for OpenCL™ Applications 2016\" from https://software.intel.com/en-us/intel-opencl (requires free registration) and install it.\n* Install CUDA (optional, Nvidia only)\n    1. Download CUDA Toolkit and install it. You MUST install the samples too.\n* Install OpenNI2 (optional)\n\n    Download OpenNI 2.2.0.33 (x64) from http://structure.io/openni, install it to default locations (`C:\\Program Files...`).\n* Build\n\n    The default installation path is `install`, you may change it by editing `CMAKE_INSTALL_PREFIX`.\n    ```\n    mkdir build && cd build\n    cmake .. -G \"Visual Studio 12 2013 Win64\"\n    cmake --build . --config RelWithDebInfo --target install\n    ```\n    Or `-G \"Visual Studio 14 2015 Win64\"`.\n    Or `-G \"Visual Studio 16 2019\"`.\n* Run the test program: `.\\install\\bin\\Protonect.exe`, or start debugging in Visual Studio.\n* Test OpenNI2 (optional)\n\n    Copy freenect2-openni2.dll, and other dll files (libusb-1.0.dll, glfw.dll, etc.) in `install\\bin` to `C:\\Program Files\\OpenNI2\\Tools\\OpenNI2\\Drivers`. Then run `C:\\Program Files\\OpenNI\\Tools\\NiViewer.exe`. Environment variable `LIBFREENECT2_PIPELINE` can be set to `cl`, `cuda`, etc to specify the pipeline.\n\n### Windows / vcpkg\n\nYou can download and install libfreenect2 using the [vcpkg](https://github.com/Microsoft/vcpkg) dependency manager:\n```\ngit clone https://github.com/Microsoft/vcpkg.git\ncd vcpkg\n./vcpkg integrate install\nvcpkg install libfreenect2\n```\nThe libfreenect2 port in vcpkg is kept up to date by Microsoft team members and community contributors. If the version is out of date, please [create an issue or pull request](https://github.com/Microsoft/vcpkg) on the vcpkg repository.\n\n### MacOS\n\nUse your favorite package managers (brew, ports, etc.) to install most if not all dependencies:\n\n* Make sure these build tools are available: wget, git, cmake, pkg-config. Xcode may provide some of them. Install the rest via package managers.\n* Download libfreenect2 source\n    ```\n    git clone https://github.com/OpenKinect/libfreenect2.git\n    cd libfreenect2\n    ```\n* Install dependencies: libusb, GLFW\n    ```\n    brew update\n    brew install libusb\n    brew install glfw3\n    ```\n* Install TurboJPEG (optional)\n    ```\n    brew install jpeg-turbo\n    ```\n* Install CUDA (optional): TODO\n* Install OpenNI2 (optional)\n    ```\n    brew tap brewsci/science\n    brew install openni2\n    export OPENNI2_REDIST=/usr/local/lib/ni2\n    export OPENNI2_INCLUDE=/usr/local/include/ni2\n    ```\n* Build\n    ```\n    mkdir build && cd build\n    cmake ..\n    make\n    make install\n    ```\n* Run the test program: `./bin/Protonect`\n* Test OpenNI2. `make install-openni2` (may need sudo), then run `NiViewer`. Environment variable `LIBFREENECT2_PIPELINE` can be set to `cl`, `cuda`, etc to specify the pipeline.\n\n### Linux\n\nNote: Ubuntu 12.04 is too old to support. Debian jessie may also be too old, and Debian stretch is implied in the following.\n\n* Download libfreenect2 source\n    ```\n    git clone https://github.com/OpenKinect/libfreenect2.git\n    cd libfreenect2\n    ```\n* (Ubuntu 14.04 only) Download upgrade deb files\n    ```\n    cd depends; ./download_debs_trusty.sh\n    ```\n* Install build tools\n    ```\n    sudo apt-get install build-essential cmake pkg-config\n    ```\n* Install libusb. The version must be >= 1.0.20.\n    1. (Ubuntu 14.04 only) `sudo dpkg -i debs/libusb*deb`\n    2. (Other) `sudo apt-get install libusb-1.0-0-dev`\n* Install TurboJPEG\n    1. (Ubuntu 14.04 to 16.04) `sudo apt-get install libturbojpeg libjpeg-turbo8-dev`\n    2. (Debian/Ubuntu 17.10 and newer) `sudo apt-get install libturbojpeg0-dev`\n* Install OpenGL\n    1. (Ubuntu 14.04 only) `sudo dpkg -i debs/libglfw3*deb; sudo apt-get install -f`\n    2. (Odroid XU4) OpenGL 3.1 is not supported on this platform. Use `cmake -DENABLE_OPENGL=OFF` later.\n    3. (Other) `sudo apt-get install libglfw3-dev`\n* Install OpenCL (optional)\n    - Intel GPU\n        1. (Ubuntu 14.04 only) `sudo apt-add-repository ppa:floe/beignet; sudo apt-get update; sudo apt-get install beignet-dev; sudo dpkg -i debs/ocl-icd*deb`\n        2. (Other) `sudo apt-get install beignet-dev`\n        3. For older kernels, `# echo 0 >/sys/module/i915/parameters/enable_cmd_parser` is needed. See more known issues at https://www.freedesktop.org/wiki/Software/Beignet/.\n    - AMD GPU: Install the latest version of the AMD Catalyst drivers from https://support.amd.com and `apt-get install opencl-headers`.\n    - Mali GPU (e.g. Odroid XU4): (with root) `mkdir -p /etc/OpenCL/vendors; echo /usr/lib/arm-linux-gnueabihf/mali-egl/libmali.so >/etc/OpenCL/vendors/mali.icd; apt-get install opencl-headers`.\n    - Verify: You can install `clinfo` to verify if you have correctly set up the OpenCL stack.\n* Install CUDA (optional, Nvidia only):\n    - (Ubuntu 14.04 only) Download `cuda-repo-ubuntu1404...*.deb` (\"deb (network)\") from Nvidia website, follow their installation instructions, including `apt-get install cuda` which installs Nvidia graphics driver.\n    - (Jetson TK1) It is preloaded.\n    - (Nvidia/Intel dual GPUs) After `apt-get install cuda`, use `sudo prime-select intel` to use Intel GPU for desktop.\n    - (Other) Follow Nvidia website's instructions. You must install the samples package.\n* Install VAAPI (optional, Intel only)\n    1. (Ubuntu 14.04 only) `sudo dpkg -i debs/{libva,i965}*deb; sudo apt-get install -f`\n    2. (Other) `sudo apt-get install libva-dev libjpeg-dev`\n    3. Linux kernels 4.1 to 4.3 have performance regression. Use 4.0 and earlier or 4.4 and later (Though Ubuntu kernel 4.2.0-28.33~14.04.1 has backported the fix).\n* Install OpenNI2 (optional)\n    1. (Ubuntu 14.04 only) `sudo apt-add-repository ppa:deb-rob/ros-trusty && sudo apt-get update` (You don't need this if you have ROS repos), then `sudo apt-get install libopenni2-dev`\n    2. (Other) `sudo apt-get install libopenni2-dev`\n* Build (if you have run `cd depends` previously, `cd ..` back to the libfreenect2 root directory first.)\n    ```\n    mkdir build && cd build\n    cmake .. -DCMAKE_INSTALL_PREFIX=$HOME/freenect2\n    make\n    make install\n    ```\n    You need to specify `cmake -Dfreenect2_DIR=$HOME/freenect2/lib/cmake/freenect2` for CMake based third-party application to find libfreenect2.\n* Set up udev rules for device access: `sudo cp ../platform/linux/udev/90-kinect2.rules /etc/udev/rules.d/`, then replug the Kinect.\n* Run the test program: `./bin/Protonect`\n* Run OpenNI2 test (optional): `sudo apt-get install openni2-utils && sudo make install-openni2 && NiViewer2`. Environment variable `LIBFREENECT2_PIPELINE` can be set to `cl`, `cuda`, etc to specify the pipeline.\n"
        },
        {
          "name": "cmake_modules",
          "type": "tree",
          "content": null
        },
        {
          "name": "depends",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "freenect2.cmake.in",
          "type": "blob",
          "size": 0.3525390625,
          "content": "FIND_LIBRARY(freenect2_LIBRARY freenect2\n    PATHS @CMAKE_INSTALL_PREFIX@/lib\n    NO_DEFAULT_PATH\n)\nSET(freenect2_LIBRARIES ${freenect2_LIBRARY} @LIBFREENECT2_THREADING_LIBRARIES@)\nFIND_PATH(freenect2_INCLUDE_DIR @PROJECT_NAME@/libfreenect2.hpp\n    PATHS @CMAKE_INSTALL_PREFIX@/include\n    NO_DEFAULT_PATH\n)\nSET(freenect2_INCLUDE_DIRS ${freenect2_INCLUDE_DIR})\n"
        },
        {
          "name": "freenect2.pc.in",
          "type": "blob",
          "size": 0.25390625,
          "content": "prefix=@CMAKE_INSTALL_PREFIX@\nexec_prefix=@CMAKE_INSTALL_PREFIX@\nlibdir=${prefix}/lib\nincludedir=${prefix}/include\n\nName: freenect2 \nDescription: Driver for the Kinect v2 (aka K4W) \nVersion: @PROJECT_VER@\nLibs: -L${libdir} -lfreenect2\nCflags: -I${includedir}\n\n"
        },
        {
          "name": "freenect2Version.cmake.in",
          "type": "blob",
          "size": 0.3662109375,
          "content": "set(PACKAGE_VERSION \"@PROJECT_VER@\")\n\n# Check whether the requested PACKAGE_FIND_VERSION is compatible\nif(\"${PACKAGE_VERSION}\" VERSION_LESS \"${PACKAGE_FIND_VERSION}\")\n  set(PACKAGE_VERSION_COMPATIBLE FALSE)\nelse()\n  set(PACKAGE_VERSION_COMPATIBLE TRUE)\n  if (\"${PACKAGE_VERSION}\" VERSION_EQUAL \"${PACKAGE_FIND_VERSION}\")\n    set(PACKAGE_VERSION_EXACT TRUE)\n  endif()\nendif()\n"
        },
        {
          "name": "include",
          "type": "tree",
          "content": null
        },
        {
          "name": "platform",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}