{
  "metadata": {
    "timestamp": 1736565442614,
    "page": 293,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ckb-next/ckb-next",
      "stars": 3323,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.25,
          "content": "CMakeLists.txt.user\nbin/\nbuild/\n!.github/actions/cmake/build\n*.app/\ncmake-build*/\n*.pkg\n.DS_Store\n.*\n!.gitignore\n!.github\n*.o\n*.pro.*\nMakefile\nMakefile.*\nmoc_*\nui_*\nqrc_*\n.firmware\nckb-dev-detect-report.gz\nckb-next-dev-detect-report.gz\nmacos/pkgproj/build\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 16.28515625,
          "content": "# Change Log\n\n## [v0.6.0](https://github.com/ckb-next/ckb-next/tree/v0.6.0) (2023-06-23)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.5.0...v0.6.0)\n\nSupport for new devices:\n- K55 RGB PRO\n- K55 RGB PRO XT\n- K60 PRO (Monochrome)\n- K60 PRO TKL RGB\n- Dark Core RGB Pro (experimental)\n- Dark Core RGB Pro SE (experimental)\n- Slipstream wireless dongle (when paired with a single supported device)\n\nImportant bugfixes:\n- The <kbd>Fn</kbd> key now behaves as expected on the K65\n- The GUI now accepts macros containing the ISO backslash key\n- A workaround is now implemented to prevent the media keys on the Strafe from getting stuck pressed\n- The daemon no longer crashes with a `buffer overflow detected` message on start under certain conditions\n- The WinLock LED now functions on the K55 RGB and K55 RGB Pro XT\n- The GUI no longer crashes under certain conditions when the sound server is being restarted\n- The battery states are now reported correctly in the GUI\n- The brightness is now correctly set for newer devices (and the lights now turn off instantly)\n\nNew features:\n- The device previews are now rendered using the GPU\n- Horizontal scrolling is now available for binding\n- The mute indicator can now indicate either the default output or input audio device\n- The music visualizer now supports automatic gain control, automatically adapting to volume changes\n- It is now possible to pair wireless devices with dongles (not in GUI yet)\n\nNotes for packagers:\n- There is a new binary `ckb-next-sinfo`. It is not optional and must be bundled with the GUI. It is not meant to be ran by the end user.\n- The explicit dependency to Xlib has been dropped. Only XCB is required\n- pulse-simple is no longer used. There is still a dependency on libpulse\n- Quazip (for Qt5) is no longer bundled and is required\n\n## [v0.5.0](https://github.com/ckb-next/ckb-next/tree/v0.5.0) (2022-05-27)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.4.4...v0.5.0)\n\nSupport for new devices:\n- K95 Platinum XT\n- Katar Pro\n- Katar Pro XT\n- Glaive Pro\n- M55\n- K60 Pro RGB\n- K60 Pro RGB Low Profile\n- K60 Pro RGB SE\n\nImportant bugfixes:\n- Scroll wheels are now treated as axes (Responsiveness should be improved for specific mice)\n- The lights on the K95 RGB Platinum top bar are now updated correctly\n- An infinite loop is prevented if certain USB information can not be read\n- GUI no longer crashes on exit under certain conditions\n- Mouse scrolling works again when combined with specific libinput versions\n- The daemon no longer hangs when quitting due to LED keyboard indicators\n- The lighting programming key can now be rebound on K95 Legacy\n- Animations won't break due to daylight savings / system time changes\n- GUI doesn't crash when switching to a hardware mode on a fresh installation\n- Daemon no longer causes a kernel Oops on resume under certain conditions (Devices now resume correctly from sleep)\n- Window detection is more reliable and works correctly on system boot\n- Settings tab now stretches correctly\n- Profile switch button can now be bound correctly on mice\n- ISO Enter key is now aligned correctly\n- Bindings are now consistent between demo and new modes\n- Firmware update dialog is no longer cut off and can be resized\n- RGB data won't be sent to the daemon when brightness is set to 0%\n\nNew features:\n- German translation\n- 66 service (not installed automatically)\n- Device previews are now resizable\n\n## [v0.4.4](https://github.com/ckb-next/ckb-next/tree/v0.4.4) (2021-03-18)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.4.3...v0.4.4)\n\nImportant bugfixes:\n- Fixed a crash when creating a new profile\n- Fixed lights turning off unexpectedly or not being restored correctly\n- Macros can now be repeated quickly by repeatedly pressing the keys\n- Fixed various deadlocks when resuming from suspend or during device initialisation\n- Fixed devices not functioning during system boot requiring a daemon restart\n\n## [v0.4.3](https://github.com/ckb-next/ckb-next/tree/v0.4.3) (2020-12-18)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.4.2...v0.4.3)\n\nPLEASE NOTE: This is the last version of ckb-next to officially support macOS.\nIt has been reported to work with Big Sur after disabling SIP.\nhttps://github.com/ckb-next/ckb-next/issues/660\nARM Macs are NOT supported.\n\nSupport for new devices:\n- Scimitar RGB Elite\n- Nightsword RGB\n\nImportant bugfixes:\n- Fixed delay when shutting down with K95 RGB\n- Fixed freezing when updating indicator LEDs\n- Indicator LEDs are now more responsive when an animation is playing\n- GUI now starts hidden in tray on KDE\n- The pipe animation now works consistently between mode changes\n- The pipe animation now handles input commands sent in rapid succession before the device is updated\n- Input works on wayland again after recent updates\n- libgdx based games no longer crash on mouse input\n- Mouse settings are now correctly restored when resuming from suspend\n- Fixed a bug where some devices would not be initialised on daemon start and would require a replug\n- Fixed layouts for K68, K65, K63, M95\n\nNew features:\n- Under X11 only, lights can now automatically turn off after a user-set time\n- Macros now loop when the key is held down\n- Macro UI has been redesigned and supports recording from non ckb-next managed keyboards\n- Modes can now be changed automatically based on the current focused application (X11/XWayland Only)\n- Translations are now supported\n\nNotes for packagers:\n- The systemd unit directory can be overriden with -DSYSTEMD_UNIT_INSTALL_DIR\n- libappindicator is no longer used\n- Minimum Qt version has been bumped up to 5.5.1 (xenial)\n- cmake now checks for quazip 1.0\n- The following new dependencies have been introduced: Qt5 X11Extras, xcb, xcb-screensaver, xcb-ewmh, Qt5 translation tools, dbusmenu-qt5\n\n## [v0.4.2](https://github.com/ckb-next/ckb-next/tree/v0.4.2) (2019-10-08)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.4.1...v0.4.2)\n\nThis update fixes ckb-next for macOS Catalina\n\nNote for Ubuntu PPA users: Please cancel this update.\nAn update will be released shortly through the PPA that also disables this prompt in the future.\n\nSupport for new devices:\n- Harpoon RGB Pro\n- Ironclaw RGB\n\nImportant bugfixes:\n\n- ckb-next-daemon now correctly requests permission on macOS Catalina\n- Music visualiser is now included again in macOS packages\n- GUI no longer crashes if an animation has no keys set\n\nNotes:\n\n- Included quazip was updated to fix deprecation warnings\n\n## [v0.4.1](https://github.com/ckb-next/ckb-next/tree/v0.4.1) (2019-08-27)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.4.0...v0.4.1)\n\nImportant bugfixes:\n\n- Specified keyboard layout is no longer being reverted on restart\n- Pipe animation no longer quits if it can't read data\n- Media keys work again on the legacy K65\n- Daemon no longer crashes on quit on macOS\n- Devices are now re-activated after resume on Linux\n- Gradient animation no longer flickers with dithering enabled\n- HiDPI has been disabled by default due to screen resolution misdetection\n- Max DPI is now per-device\n- Extra words are now filtered from the device name\n- gpg2 is preferred over gpg for signature verification\n\nNew features:\n\n- An uninstall button has been added for macOS users that allows complete uninstallation, including older versions\n- Life animation has a new transparent preset\n- Confirmation dialog boxes have been added when deleting profiles, modes, and animations\n- Animation preview now gets temporarily disabled while ckb-next is out of focus\n- Support for multiple animation paths has been added\n- Pollrate can now be changed through the GUI\n\nNotes for packagers:\n\n- Udev rules are now installed by default in /lib/udev/rules.d.\n- Udev rule installation path can be changed with UDEV_RULE_DIRECTORY in cmake\n- Init systems can manually be force-enabled with FORCE_INIT_SYSTEM in cmake\n\n## [v0.4.0](https://github.com/ckb-next/ckb-next/tree/v0.4.0) (2019-03-09)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.3.2...v0.4.0)\n\nNOTICE FOR MAC USERS: ckb-next 0.4.0 stores its data using a different backend. If you upgrade, your settings and profiles will be migrated. In case of a downgrade, any changes will not propagate to newer versions of the software.\n\nSupport for new devices:\n- K70 RGB MK.2 LP\n- M65 RGB Elite\n- M95 Legacy\n\nImportant bugfixes:\n- ST100 now works on macOS properly\n- Strafe RGB MK.2 logo is mapped to the right LEDs, and media buttons are positioned correctly\n- A buffer overflow causing the daemon to crash or hang has been fixed\n- quickinstall can now run correctly with multibyte characters in the path\n- Rename now works correctly in the Profile Manager context menu\n- Animations with no presets no longer get loaded to prevent crashes\n- K70 Lux is now marked correctly as monochrome\n- ckb-next can be built again with Qt 5.2\n- Save to hardware now gets disabled in the context menu for unsupported devices\n- Settings backend has been changed to ini for macOS, preventing silent configuration data corruption\n- The K55, the ST100 and the Polaris now have working default profiles\n- A few cases that may cause the GUI to crash have been found and fixed\n- Blank animation names are no longer allowed\n\nNew features:\n- GUI has gained a monochrome tray icon option (QSystemTrayIcon only)\n- Device brightness can be controlled by scrolling on the tray icon on Linux systems that support it (AppIndicator or KDE)\n- Profiles and modes can now be changed with the --profile and --mode arguments passed to the GUI binary\n- New Conway's Game of Life animation\n- New 'snake' animation\n- New 'pipe' animation, allowing the user to send rgb data from external applications\n- Music Visualizer (mviz) is now supported on macOS, and has been reworked to function correctly\n- A --version argument has been added to the daemon\n\nNotes:\n- On Linux, the udev rule has been renamed and moved\n- On Linux, for builds with libappindicator, it can be force enabled/disabled by setting the CKB_NEXT_USE_APPINDICATOR environment variable\n- On Linux, libappindicator support is also enabled if the Qt platform theme is gtk2 (Useful for Unity on Ubuntu 19.04)\n- The restart command has been removed from the daemon\n- Threads are now named for easier debugging\n- Signal handler has been rewritten\n- A few unneeded packets are no longer being sent to M65 mice\n- Only Red channel data is being sent to monochrome devices\n\n## [v0.3.2](https://github.com/ckb-next/ckb-next/tree/v0.3.2) (2018-10-07)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.3.1...v0.3.2)\n\nImportant news:\n\n- This version fixes a major bug for the Scimitar Pro, causing the daemon to not properly interface with the mouse. This could require manually reflashing the mouse firmware if a firmware update was performed with 0.3.1 or earlier.\n- An updater has been created to more quickly push bugfixes to users, especially for those on macOS.\n- There is a new Space Invaders-like minigame that can be played as an animation, thanks to @mvladimirovich.\n\nSupport for new devices:\n\n- Strafe RGB MK.2; by accidental omission from the previous release.\n- K66\n\nImportant bugfixes:\n\n- The Scimitar Pro now defaults to v2.xx endpoints\n- The DPI LED on mice now changes in sniper mode\n- The GUI will warn if uinput cannot be loaded on Linux\n- The \"Save to Hardware\" button on the Scimitar and Glaive has been greyed out due to a current lack of support\n- Thanks to the efforts of @Kedstar99, the codebase compiles with much fewer warnings\n- The daemon will retry talking to the Karabiner kext in case it runs before the kext is ready\n- Binding commands to wheels will now repeat properly\n- QuaZip is no longer required for daemon-only builds\n- KissFFT is now built as a static library\n- Symbolic links are now created in /dev/input/by-id for evdev users\n- Fixed a regression for devices using the legacy protocol\n- The forwards and backwards keys are now bound by default on Mac\n- Workaround for using the Polaris on macOS\n\nNote for packagers:\n\n- If ckb-next is updated through a package management system, `-DDISABLE_UPDATER=1` should be passed to CMake\n\n## [v0.3.1](https://github.com/ckb-next/ckb-next/tree/v0.3.1) (2018-07-31)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.3.0...v0.3.1)\n\nImportant news:\n\n- macOS now uses Karabiner Elements as a backend. You will need to enable the kext for ckb-next to function.\n\nSupport for new devices:\n\n- K70 RGB MK.2\n- K70 RGB MK.2 SE\n\nNew major features:\n\n- macOS 10.14 Mojave support\n- Karabiner Elements is used as an input backend\n- The GUI now has a generate ckb-next-dev-detect report button\n\nImportant bugfixes:\n\n- Rapidfire keyboards have a workaround on shutdown\n- Bugfix for independent X/Y DPI\n- The new Strafe NRGB has firmware updates now\n- The GUI pops up a warning when trying to bind the Windows key with Winlock enabled\n- The GUI now has a DPI indicator\n- The K68 NRGB winlock light now lights up\n- The GUI handles SIGINT/SIGTERM cleanly, avoiding stalled devices\n- Strafe sidelights now save state on GUI start\n- Original Strafe NRGB's sidelights now toggle correctly\n- ckb-next-dev-detect is now installed to the system and added to PATH\n\n## [v0.3.0](https://github.com/ckb-next/ckb-next/tree/v0.3.0) (2018-04-30)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.2.9...v0.3.0)\n\nImportant news:\n\n- Binaries have been renamed from ckb to ckb-next and qmake has been replaced with CMake\n\nSupport for new devices:\n\n- K55 RGB\n- K68 RGB\n- K90 Legacy\n- Katar RGB\n- Polaris RGB\n- ST100 RGB\n\nNew major features:\n\n- Use URB Interrupts to read data from devices\n- Profile Import/Export\n- Keyboard Layout autodetection\n- CMake build system\n- Relocation of binaries\n- No single global layout for all devices in the GUI\n\nImportant bugfixes:\n\n- Deadlock on daemon exit\n- Support for K95 Platinum profile switch key\n- Keymap corruption on the GUI\n- Pulseaudio GUI deadlock\n- macOS Sierra and higher mouse fixes\n- Use udev to detect the appropriate endpoint max packet size\n- Ignore devices in BIOS mode\n- Disable save to hardware for unsupported devices\n- Keymap patches for K68\n- Devices not being enabled on resume on macOS\n- Workaround for linux kernel out-of-bounds write\n- Memory leaks on firmware update\n\n## [v0.2.9](https://github.com/ckb-next/ckb-next/tree/v0.2.9) (2018-01-21)\n[Full Changelog](https://github.com/ckb-next/ckb-next/compare/v0.2.8...v0.2.9)\n\nImportant news:\n* Project was moved to the organization since mattanger has disappeared\n* Binaries will be renamed in `v0.3.0`\n\nImportant changes:\n* Significantly lower CPU usage on idle\n* Add support for K95 Platinum\n* Add support for K68\n* Add support for (new) Strafe non-RGB\n* Add support for Glaive\n* Add support for Harpoon\n* Add support for Corsair firmware v3\n* Add support for pt\\_br layout\n* Add support for Japanese layout\n* Add macro delays to the GUI\n* New FIRMWARE file structure\n* GUI warning when daemon is not running\n* udev rule to remove joystick tag\n* Dynamic keymap patching\n* Require Qt >=5.2\n* Numerous small fixes and improvements\n\n## [v0.2.8](https://github.com/mattanger/ckb-next/tree/v0.2.8) (2017-05-06)\n[Full Changelog](https://github.com/mattanger/ckb-next/compare/v0.2.7...v0.2.8)\n\n- `ckb` is now `ckb-next`, __but the binaries will be renamed in `v0.2.9`__\n- Releases and release notes are provided from now on [\\#10](https://github.com/mattanger/ckb-next/issues/10) [\\#66](https://github.com/mattanger/ckb-next/issues/66)\n- Numerous PRs from `ckb` merged [\\#4](https://github.com/mattanger/ckb-next/issues/4)\n- SIGSEGV when deleting copied profile is fixed [\\#38](https://github.com/mattanger/ckb-next/issues/38)\n- Modifier keys not working on macOS Sierra are temporarily fixed [\\#29](https://github.com/mattanger/ckb-next/issues/29)\n- Compilation errors on macOS Sierra are fixed [\\#134](https://github.com/mattanger/ckb-next/issues/134)\n- `make debug` target on Linux is fixed [\\#79](https://github.com/mattanger/ckb-next/issues/79)\n- Heat map animation issues fixed [\\#30](https://github.com/mattanger/ckb-next/issues/30)\n- Compilation of the music visualizer fixed [\\#21](https://github.com/mattanger/ckb-next/issues/21)\n- Hardware profile loading error on firmware 2.05 fixed [\\#24](https://github.com/mattanger/ckb-next/pull/24)\n- Project's own firmware table created, signed and populated with new devices [\\#60](https://github.com/mattanger/ckb-next/pull/60)\n- Arch Linux and Fedora/CentOS packages added [\\#80](https://github.com/mattanger/ckb-next/pull/80) [\\#5](https://github.com/mattanger/ckb-next/issues/5) [\\#41](https://github.com/mattanger/ckb-next/pull/41)\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 10.642578125,
          "content": "#   Copyright 2017-2018 ckb-next Development Team <ckb-next@googlegroups.com>\n#   All rights reserved.\n#\n#   Redistribution and use in source and binary forms, with or without\n#   modification, are permitted provided that the following conditions are met:\n#   \n#   1. Redistributions of source code must retain the above copyright notice,\n#   this list of conditions and the following disclaimer.\n#   2. Redistributions in binary form must reproduce the above copyright\n#   notice, this list of conditions and the following disclaimer in the\n#   documentation and/or other materials provided with the distribution.\n#   3. Neither the name of the copyright holder nor the names of its\n#   contributors may be used to endorse or promote products derived from this\n#   software without specific prior written permission. \n#   \n#   THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n#   AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n#   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n#   ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\n#   LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n#   CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n#   SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n#   INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n#   CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n#   ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n#   POSSIBILITY OF SUCH DAMAGE.\n\n# Lower it _only_ if tested to work correctly with that version!\n# Might be as low as 3.3, but again, use at your own risk\ncmake_minimum_required(VERSION 3.13.4 FATAL_ERROR)\n\nproject(ckb-next LANGUAGES C CXX)\ninclude(VERSION.cmake)\n# Because cmakedefine does not like dashes...\nset(ckb_next_VERSION_IS_RELEASE ${ckb-next_VERSION_IS_RELEASE})\n\n# Let CMake find custom modules\nlist(APPEND CMAKE_MODULE_PATH \"${CMAKE_CURRENT_LIST_DIR}/cmake/modules\")\nlist(APPEND CMAKE_MODULE_PATH \"${CMAKE_CURRENT_LIST_DIR}/cmake/modules/sanitizers\")\n\ninclude(MacroEnsureOutOfSourceBuild)\nmacro_ensure_out_of_source_build(\"ckb-next requires an out of source build. \\\nPlease create a separate build directory and run 'cmake /path/to/ckb-next [options]' there.\")\n# Make sure we don't install in anaconda\nif(\"$ENV{PATH}\" MATCHES \"anaconda\")\n    string(REPLACE \":\" \";\" ENVLIST \"$ENV{PATH}\")\n\n    foreach(item ${ENVLIST})\n        if(\"${item}\" MATCHES \"anaconda\")\n            list(REMOVE_ITEM ENVLIST \"${item}\")\n        endif()\n    endforeach()\n\n    string(REPLACE \";\" \":\" ENVSTR \"${ENVLIST}\")\n    set(ENV{PATH} ${ENVSTR})\n    message(STATUS \"Temporarily removing anaconda from PATH:\\n   $ENV{PATH}\")\nendif()\n\n# Set platform-specific booleans\ninclude(CkbNextPlatform)\n\n# Set a default build type if none was specified\ninclude(CkbNextBuildType)\n\n# Get more precise version from git, fallback on release\ninclude(CkbNextDetermineVersion)\nfind_package(Git)\ndetermine_version(\"${ckb-next_SOURCE_DIR}\" \"${GIT_EXECUTABLE}\" \"ckb-next\")\n\nfind_package(Sanitizers)\n\n# Options for the whole project follow\n\ninclude(CMakeDependentOption)\n\nset(CMAKE_RUNTIME_OUTPUT_DIRECTORY \"${CMAKE_BINARY_DIR}/bin\" CACHE STRING \"Where to put binaries after compilation.\")\nset(CMAKE_LIBRARY_OUTPUT_DIRECTORY \"${CMAKE_BINARY_DIR}/lib\" CACHE STRING \"Where to put libraries after compilation.\")\nset(UDEV_RULE_DIRECTORY \"/lib/udev/rules.d\" CACHE STRING \"Where to install the udev rule.\")\n\nif (MACOS)\n    option(USE_BREW_QT5 \"Use Homebrew package for Qt5.\" ON)\n    option(USE_BREW_QUAZIP \"Use Homebrew package for QuaZip.\" ON)\n    option(MAC_LEGACY \"Build a legacy version without the karabiner kext.\" OFF)\n    if (MAC_LEGACY)\n        set(ckb-next_VERSION \"${ckb-next_VERSION}-l\")\n    endif ()    \nendif ()\n\n# Options: GUI\noption(WITH_GUI \"Build with Qt GUI to manipulate animations.\" ON)\n\n# Options: GUI animations\noption(WITH_ANIMATIONS \"Build with animations.\" ON)\ncmake_dependent_option(WITH_GRADIENT \"Build with 'Gradient' animation.\" ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_HEAT     \"Build with 'Heat map' animation.\" ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_RAIN     \"Build with 'Rain' animation.\"     ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_RANDOM   \"Build with 'Random' animation.\"   ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_PINWHEEL \"Build with 'Pinwheel' animation.\" ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_RIPPLE   \"Build with 'Ripple' animation.\"   ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_WAVE     \"Build with 'Wave' animation.\"     ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_INVADERS \"Build with 'Invaders' animation.\" ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_LIFE     \"Build with 'Life' animation.\"     ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_SNAKE    \"Build with 'Snake' animation.\"    ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\ncmake_dependent_option(WITH_PIPE     \"Build with 'Pipe' animation.\"     ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\n\nif (LINUX)\n    cmake_dependent_option(WITH_MVIZ  \"Build with music visualizer.\"           ON \"WITH_ANIMATIONS;WITH_GUI\" OFF)\n    cmake_dependent_option(USE_XCB    \"Build with features that require XCB.\"  ON  \"WITH_GUI\" OFF)\n    cmake_dependent_option(USE_DBUS_MENU \"Build with DBus support for the tray.\"  ON  \"WITH_GUI\" OFF)\n    option(USE_PORTAUDIO              \"Use portaudio for music visualizer.\"    OFF)\nelse ()\n    cmake_dependent_option(WITH_MVIZ   \"Build with music visualizer.\"          OFF \"WITH_ANIMATIONS;WITH_GUI\" OFF)\n    set(USE_PORTAUDIO ON)\nendif ()\n# Options: daemon\noption(DISABLE_UPDATER \"Disable the ckb-next updater. This option should only be enabled during packaging.\"    OFF)\noption(DEBUG_USB_SEND  \"Show the contents of USB packets being sent to device.\"                                OFF)\noption(DEBUG_USB_RECV  \"Show the contents of USB packets being received from device through usbrecv().\"        OFF)\noption(DEBUG_USB_INPUT \"Show the contents of USB packets being received from device through the input thread.\" OFF)\noption(DEBUG_MUTEX     \"Show debugging information regarding thread synchronisation.\" OFF)\noption(NO_FAIR_MUTEX_QUEUEING \"Disable fair mutex queueing. Debugging only.\" OFF)\noption(DEBUG_INPUT_SYNC \"Print a debug message every time an event bundle is delivered to the OS.\" OFF)\noption(FPS_COUNTER     \"Enable FPS counters.\" OFF)\noption(WERROR     \"Enable Werror (for CI)\" OFF)\n\n# Make sure NO_FAIR_MUTEX_QUEUEING is set if TSAN is enabled\n# Otherwise you end up with threading issues that are not detected\nif (SANITIZE_THREAD AND NOT NO_FAIR_MUTEX_QUEUEING)\n    message(FATAL_ERROR \"Thread Sanitizer was enabled but NO_FAIR_MUTEX_QUEUEING is set to FALSE. Please re-run cmake with -DNO_FAIR_MUTEX_QUEUEING=1 or disable SANITIZE_THREAD.\")\nelseif (NO_FAIR_MUTEX_QUEUEING AND NOT SANITIZE_THREAD)\n    message(WARNING \"NO_FAIR_MUTEX_QUEUEING is enabled. Make sure to disable it afterwards.\")\nendif()\n\n# Options: install\nif (MACOS)\n    set(CMAKE_INSTALL_PREFIX \"/Applications\")\nendif ()\n\ninclude(GNUInstallDirs)\nset(ANIMATIONS_DIR_NAME \"ckb-next-animations\")\nif (MACOS)\n    set(INSTALL_DIR_ANIMATIONS \"ckb-next.app/Contents/Resources/${ANIMATIONS_DIR_NAME}\"\n        CACHE STRING \"Where to install animations.\")\nelseif (LINUX)\n    set(INSTALL_DIR_ANIMATIONS \"${CMAKE_INSTALL_LIBEXECDIR}/${ANIMATIONS_DIR_NAME}\"\n        CACHE STRING \"Where to install animations.\")\n    set(INSTALL_DIR_UTILITIES \"${CMAKE_INSTALL_LIBEXECDIR}\"\n        CACHE STRING \"Where to install miscellaneous utilities.\")\nendif ()\n\n# Options: other\noption(SAFE_INSTALL \"Execute pre-install tasks to ensure correct installation.\n    Intended to be used with direct installations without package manager.\" OFF)\noption(SAFE_UNINSTALL \"Execute pre-uninstall tasks to ensure correct removal.\n    Intended to be used with direct removals without package manager.\" OFF)\noption(PREFER_QT6 \"Build with Qt 6 if available.\" OFF)\n\nset(CMAKE_FIND_PACKAGE_SORT_ORDER NATURAL)\nset(CMAKE_FIND_PACKAGE_SORT_DIRECTION DEC)\n\nset(QT_LIST Qt5)\nif (PREFER_QT6)\n    list(INSERT QT_LIST 0 Qt6)\nendif ()\n\nif (NOT WITH_GUI)\n    message(WARNING \"Building without GUI. Proceed only if you know what you are doing.\")\nendif ()\n\n# Project-specific compiler settings\ninclude(CkbNextCompileFlags)\n\nadd_subdirectory(src)\n\n# Uninstall target\nconfigure_file(\n    \"${CMAKE_CURRENT_SOURCE_DIR}/cmake/cmake_uninstall.cmake.in\"\n    \"${CMAKE_CURRENT_BINARY_DIR}/cmake_uninstall.cmake\"\n    @ONLY)\n\nadd_custom_target(\n    uninstall\n    COMMAND ${CMAKE_COMMAND} -P ${CMAKE_CURRENT_BINARY_DIR}/cmake_uninstall.cmake\n    USES_TERMINAL)\n\n# macOS packaging\nif (MACOS AND WITH_GUI)\n    include(ProcessorCount)\n    ProcessorCount(cores)\n    if (\"${cores}\" EQUAL 0)\n        message(FATAL_ERROR \"Counted 0 cores\")\n    else ()\n        message(STATUS \"Number of cores: ${cores}\")\n    endif ()\n\n    if (MAC_LEGACY)\n        set(PKGPROJ_FILE \"ckb-next-legacy.pkgproj\")\n    else ()\n        set(PKGPROJ_FILE \"ckb-next.pkgproj\")\n    endif ()\n\n    add_custom_target(\n        macos-package\n        COMMAND\n          ${CMAKE_MAKE_PROGRAM} -j${cores}\n        COMMAND\n          sudo ${CMAKE_MAKE_PROGRAM} install\n        COMMAND\n          packagesbuild ${ckb-next_SOURCE_DIR}/macos/pkgproj/${PKGPROJ_FILE}\n        COMMAND\n          appdmg ${ckb-next_SOURCE_DIR}/macos/pkgproj/appdmg.json ckb-next_v${ckb-next_VERSION}_${CMAKE_OSX_DEPLOYMENT_TARGET}-SDK.dmg\n        WORKING_DIRECTORY\n          \"${ckb-next_BINARY_DIR}\"\n        COMMENT\n          \"Generating macOS package\"\n        USES_TERMINAL\n        VERBATIM)\nendif ()\n\nif (CMAKE_SIZEOF_VOID_P EQUAL 8)\n    message(STATUS \"*** Have SIZEOF void * = 8, so 64-bit\")\n    set(IS_64_BIT 1)\nelse ()\n    message(STATUS \"*** SIZEOF void * != 8, so not 64-bit\")\nendif ()\n\nset(CPACK_GENERATOR \"DEB\")\nset(CPACK_PACKAGE_NAME \"ckb-next\")\nset(CPACK_PACKAGE_VENDOR \"K DeSouza\")\nset(CPACK_PACKAGE_CONTACT \"ckb-next@googlegroups.com\")\nset(CPACK_PACKAGE_DESCRIPTION_SUMMARY \"ckb-next is an open-source driver for Corsair keyboards and mice. \\\nIt aims to bring the features of Corsair's proprietary CUE software to the Linux and Mac operating systems.\")\nset(CPACK_PACKAGE_FILE_NAME \"ckb-next\")\nset(CPACK_PACKAGE_VERSION_MAJOR \"${ckb-next_VERSION_MAJOR}\")\nset(CPACK_PACKAGE_VERSION_MINOR \"${ckb-next_VERSION_MINOR}\")\nset(CPACK_PACKAGE_VERSION_PATCH \"${ckb-next_VERSION_PATCH}-${ckb-next_VERSION_PATCH_EXTRA}\")\nset(CPACK_SOURCE_IGNORE_FILES \"*.cmake\")\nset(CPACK_DEBIAN_PACKAGE_SHLIBDEPS ON)\nset(CPACK_DEBIAN_PACKAGE_CONTROL_EXTRA \"${CMAKE_SOURCE_DIR}/linux/debian/postinst;\")\nif(IS_64_BIT)\n\tset(CPACK_DEBIAN_PACKAGE_ARCHITECTURE amd64)\nelse()\n\tset(CPACK_DEBIAN_PACKAGE_ARCHITECTURE i386)\nendif()\ninclude(CPack)\n"
        },
        {
          "name": "FIRMWARE",
          "type": "blob",
          "size": 9.8271484375,
          "content": "-----BEGIN PGP SIGNED MESSAGE-----\nHash: SHA512\n\n# Do not manually modify this file.\n# Edit FIRMWARE.unsigned instead, and call ./scripts/sign_firmware.sh from the root directory of the repo\n#\n# The GPG key: DCEF2F5F - A full copy of it can also be found in src/ckb/ckb-next-key.gpg\n# This document is signed to prevent tampering. Signature verification is enabled only when GnuPG is available.\n# Firmware versions listed may not necessarily reflect the latest on Corsair's site; new versions will not be added until ckb-next has been tested with them.\n# ckb-next does NOT read this file when flashing firmware manually. It will allow you to load any valid FW blob (at your own risk).\n# NOTE: K63WL IS A STUB\n#\n\n!BEGIN FW ENTRIES\n\n# Vendor  Model            FW    URL                                                                Min.ckb File Name                            SHA256                                                              ProductID\n  Corsair K55RGB           30.08 https://www3.corsair.com/software/CUE_V3/K55RGB.zip                0.2.9   K55_App_v3008.bin                    c45f9a1eba0795c35a2c2164588eec268bd3f4dda6c40a2a085371c28e89198a    0x1b3d\n  Corsair K63               3.08 https://www3.corsair.com/software/CUE_V3/K63.zip                   0.3.2   K63_App_v308.bin                     1b28b50d7338b9e2cf44ebf6130adb973c6aa5770ba7afa255a61ff096850e61    0x1b40\n  Corsair K63WL             0.00 https://www3.corsair.com/software/CUE_V3/K63WIRELESS.zip           0.2.9   00000000000000000.bin                0000000000000000000000000000000000000000000000000000000000000000    0x1b45\n  Corsair K65RGB            3.08 https://www3.corsair.com/software/CUE_V3/CGK65RGB.zip              0.3.2   K65%20RGB_App_v308.bin               5173de835e2614981a43184f4cca72f96361160a343d17e016f41372ba2ba1bd    0x1b17\n  Corsair K65LUXRGB         3.08 https://www3.corsair.com/software/CUE_V3/K65LUXRGB.zip             0.3.2   K65%20LUX%20RGB_App_v308.bin         779bbfdc9152168ea1fd0ac6e35c93f691ffb3affafedf88e1f8b4c2682ec822    0x1b37\n  Corsair K65RFIRERGB       3.08 https://www3.corsair.com/software/CUE_V3/K65RGBRAPIDFIRE.zip       0.3.2   K65%20RGB%20Rapidfire_App_v308.bin   56428d5b330a81649b2cc6ebb685d17e53120033db5803a3dbee9120eca8d75b    0x1b39\n  Corsair K66               3.08 https://www3.corsair.com/software/CUE_V3/K66.zip                   0.3.2   K66_App_v308.bin                     832c917ff850bcad2a7a0a79c8e603cdce8732d463a567481ce60d6b8468123c    0x1b41\n  Corsair K68               3.08 https://www3.corsair.com/software/CUE_V3/K68.zip                   0.3.2   K68_App_v308.bin                     387f02230945df7a73b51e56ba490a39b2172aad7f99d6ac65bc7ed17bc6b78b    0x1b3f\n  Corsair K68RGB            3.24 https://www3.corsair.com/software/CUE_V3/K68RGB.zip                0.3.2   Vlad_App_v3.24.2.bin                 64ee24ef1e769e5237fa116935bd55036f6ab925e79d527d0e847eaf41b602d9    0x1b4f\n  Corsair K70RGB            3.08 https://www3.corsair.com/software/CUE_V3/K70RGB.zip                0.3.2   K70%20RGB_App_v308.bin               055822b90c5599a5cbceab9019c717a36eedad1bc849d05a28806cf940f7cd2e    0x1b13\n  Corsair K70LUX            3.08 https://www3.corsair.com/software/CUE_V3/K70LUX.zip                0.3.2   K70%20LUX_App_v308.bin               89323b060448c2b787a538cf41ca272cdb3b10fec75eda53a3b1c630566ecec8    0x1b36\n  Corsair K70LUXRGB         3.08 https://www3.corsair.com/software/CUE_V3/K70LUXRGB.zip             0.3.2   K70%20LUX%20RGB_App_v308.bin         fba209ecf67735dd1eac6f0cc04432f423677ccf6518a0fcf6dae65efb6816aa    0x1b33\n  Corsair K70RFIRE          3.08 https://www3.corsair.com/software/CUE_V3/K70RAPIDFIRE.zip          0.3.2   K70%20Rapidfire_App_v308.bin         c40ef86ff561777295bca1743c16afc787d22832f052d4687be58b1bfa559108    0x1b3a\n  Corsair K70RFIRERGB       3.08 https://www3.corsair.com/software/CUE_V3/K70RGBRAPIDFIRE.zip       0.3.2   K70%20RGB%20Rapidfire_App_v308.bin   415aaeaf49f2d28cb28459fd7828e49440846ae762245214c2b7b0efffab9f3a    0x1b38\n  Corsair K70SERFIRERGB     2.06 https://www3.corsair.com/software/CUE_V3/K70RGBSERAPIDFIRE.zip     0.2.9   K70RGBSERAPIDFIRE_APP_V206.bin       7e1b81b9356075331fa25d2bd1fc5fbb68b92ef81bede1c35887521a2fdbba75    0x1b59\n  Corsair K70RGBMK2         3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2.zip            0.3.2   Julius_App_v3.24.26.bin              1324fbf740948fa42e4e5edd48248c94cd02d3d0af123ed5832f9f9e3732330d    0x1b49\n  Corsair K70RGBMK2SE       3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2SE.zip          0.3.2   Julius_Alba_App_v3.24.13.bin         1942d60a9e63649583dd5609ba8aaffaf1cd242555639a8bb5e506bd996a0ed1    0x1b6b\n  Corsair K70RGBMK2LP       3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2LP.zip          0.3.2   Nero_App_v3.24.22.bin                257f5d3d8164e6deb8eab8f2ce0070b9030f586159e362b7f0d339ad71e20402    0x1b55\n  Corsair K95RGB            3.08 https://www3.corsair.com/software/CUE_V3/K95RGB.zip                0.3.2   K95%20RGB_App_v308.bin               15ff062f7d70c32f08c3d3211fd47a20a7c416d1d89e94a3ee5f36ec8eb790ff    0x1b11\n  Corsair K95PLATINUMRGB    3.29 https://www3.corsair.com/software/CUE_V4/K95RGBPLATINUM_3.29.32.zip 0.4.4   Freya_App_v3.29.32.bin              de5c6139d058a10052bf917f6a0a00822e565023f9cbdaa1ace947881c02d478    0x1b2d\n  Corsair STRAFE            3.08 https://www3.corsair.com/software/CUE_V3/STRAFE.zip                0.3.2   Strafe_App_v308.bin                  f33840c3d3687d846efa8b8bc11896ebedad44a5a9a9693755d294ae457fa49a    0x1b15\n  Corsair STRAFERGB         3.08 https://www3.corsair.com/software/CUE_V3/STRAFERGB.zip             0.3.2   Strafe%20RGB_App_v308.bin            aeed03739338e58b06431dd006e0f5461132c12af66994b296d26df5aca905cb    0x1b20\n  Corsair STRAFERGBMK2      3.24 https://www3.corsair.com/software/CUE_V3/STRAFERGBMK.2.zip         0.3.2   Leonidas_App_v3.24.5.bin             be8f91edfd657bdb2ddcdf8058e54d74e9d8633f7c21c26334f756c2fad043e3    0x1b48\n  Corsair STRAFE1B44        3.08 https://www3.corsair.com/software/CUE_V3/STRAFE_v1b1c-p1b44.zip    0.3.2   Strafe%20ISSI_App_v308.bin           e6fc6e5bbd9bb54e1a53d9fd35fe6b17133ed43ccaaa7bc4c7df2dad48c6fe84    0x1b44\n  Corsair M65RGB            3.02 https://www3.corsair.com/software/CUE_V3/M65RGB.zip                0.3.2   M65RGB_APP_v302RC.bin                a99cca31dfc801be73a5ff540d9edf291f242bc187c8c624c04b25d903b13098    0x1b12\n  Corsair M65PRORGB         3.06 https://www3.corsair.com/software/CUE_V3/M65PRORGB.zip             0.3.2   M65Pro_App_v3.06.2.bin               9f78ef423dc2165ea8db2404f5d38e1215f633c4e554f08216526676153f1d01    0x1b2e\n  Corsair M65RGBELITE       3.24 https://www3.corsair.com/software/CUE_V3/M65RGBELITE.zip           0.3.2   BlackHeart_App_v3.24.4.bin           3181c9162bd4ff01d2637028144a319041104fc0c8ba4ebba36460103b92e067    0x1b5a\n  Corsair SCIMITARRGB       3.04 https://www3.corsair.com/software/CUE_V3/Scimitar.zip              0.3.2   Scimitar_APP_v304RC.bin              4d8d17b969ebddffc54ffc50adf1d39231f77a89aafb85e5264832bb93cd42d3    0x1b1e\n  Corsair SCIMITARPRO       3.14 https://www3.corsair.com/software/CUE_V3/ScimitarPRORGB.zip        0.3.2   ScimitarPro_App_v3.14.3.bin          34a9583517e3fd3a099782adbc91aceeffc0af63ac70cc14ca7c24eb74bf1515    0x1b3e\n  Corsair SABRE2ND          3.04 https://www3.corsair.com/software/CUE_V3/SABRE.zip                 0.3.2   Sabre2nd_APP_v304RC.bin              62bbaa804ab9cba6452f715b9d1298c9d3a6dfd05dbebefb9162cd6f5367fb04    0x1b32\n  Corsair HARPOONRGB        3.08 https://www3.corsair.com/software/CUE_V3/HARPOONRGB.zip            0.3.2   Harpoon_App_v3.08.3.bin              08c1e1ec7c30a4bdf32c37a50a25fa6f81104043434750e724898a148f8dd652    0x1b3c\n  Corsair GLAIVERGB         3.14 https://www3.corsair.com/software/CUE_V3/GLAIVERGB.zip             0.3.2   Glaive_App_v3.14.3.bin               83af8567748153504157a062c802d304e4612819319c4674e904ff0d83ba1486    0x1b34\n  Corsair KATAR             3.04 https://www3.corsair.com/software/CUE_V3/KATAR.zip                 0.3.2   Katar_APP_v304RC.bin                 da09d2aebfcac471a0aa076a84a5d0e999c0217b479b95822ed43f59cb818ff0    0x1b22\n  Corsair SABRE1            3.02 https://www3.corsair.com/software/CUE_V3/Sabre1.zip                0.3.2   Sabre1_APP_v302RC.bin                51c087dbfc7575a6b70cbcee44d6bd320fdded67c4b9c6f09f6589a80fb6535b    0x1b14\n  Corsair SABRE2            3.02 https://www3.corsair.com/software/CUE_V3/Sabre2.zip                0.3.2   Sabre2_APP_v302RC.bin                2e76fc909ef1c829e57d8ae0b0f538c2102a72471348156a09af3af344954bb1    0x1b19\n  Corsair SABREPRORGB       3.04 https://www3.corsair.com/software/CUE_V3/SABRERGB.zip              0.3.2   SabrePro_APP_v304RC.bin              5854a79cab22f2c8717a2e1866dab55628783468a0e069e9a43ecc004b71da8c    0x1b2f\n  Corsair POLARIS           1.02 https://www3.corsair.com/software/CUE_V3/MM800RGB.zip              0.2.9   SageApp_v1.02.50.bin                 5917b0de570296ba2a80cf5aa67f5bf0ef3026685453eb070364f450c3ab65fa    0x1b3b\n  Corsair ST100RGB          0.02 https://www3.corsair.com/software/CUE_V3/ST100RGB.zip              0.2.9   ST100RGB%200.2.91.bin                baa64949b8ec21133789783d9687f9d20e0cb7d912df2f3ab7d7120280bdcd56    0x0a34\n  Corsair NIGHTSWORDRGB     3.35 https://www3.corsair.com/software/CUE_V3/NIGHTSWORDRGB.zip         0.4.2   Dormammu_App_v3.35.19.bin            18a23e13e6aed887da1193dbbe1af031bb497f0225b82ccac2d2190c4aafecac    0x1b5c\n\n!END FW ENTRIES\n-----BEGIN PGP SIGNATURE-----\n\niQFFBAEBCgAvFiEE2efsyk0ijiZmMKgW3+JI69zvL18FAmGrfcURHGRldkBja2It\nbmV4dC5vcmcACgkQ3+JI69zvL18VMAf9Gqhah+PFy5JPWdQk0IZlI+XYkp/gdgjv\n1KtyNy1bPDV2hxU/j2Iju60P3My5xwhzR39ztwDCVVILGFo5ZCvMQkKAvMB+Rdet\nSPba0/jc76M1WVqze3qIAYu53L03xiy7ObJOQkq2JThuAKFqbJBFLD1udNw8IQiE\n2sdk1SrZGP0Zseoy/XBQpl4dlB3RLDfmN4ru2Q3XplCLT7asuLPUD8MMC6+WdmfP\nUOiLt4M64kPwydWh7gTeOoHCiugZLAPJENjSWb8Y7mMrW0xRD1YZi23pTWTJFzji\ntazeblWmBV3pd/z2PsSwv75hubT7W2Qg5o7Tlv6waKkrJImytLh+7Q==\n=t0rv\n-----END PGP SIGNATURE-----\n"
        },
        {
          "name": "FIRMWARE.unsigned",
          "type": "blob",
          "size": 9.138671875,
          "content": "# The GPG key: DCEF2F5F - A full copy of it can also be found in src/ckb/ckb-next-key.gpg\n# This document is signed to prevent tampering. Signature verification is enabled only when GnuPG is available.\n# Firmware versions listed may not necessarily reflect the latest on Corsair's site; new versions will not be added until ckb-next has been tested with them.\n# ckb-next does NOT read this file when flashing firmware manually. It will allow you to load any valid FW blob (at your own risk).\n# NOTE: K63WL IS A STUB\n#\n\n!BEGIN FW ENTRIES\n\n# Vendor  Model            FW    URL                                                                Min.ckb File Name                            SHA256                                                              ProductID\n  Corsair K55RGB           30.08 https://www3.corsair.com/software/CUE_V3/K55RGB.zip                0.2.9   K55_App_v3008.bin                    c45f9a1eba0795c35a2c2164588eec268bd3f4dda6c40a2a085371c28e89198a    0x1b3d\n  Corsair K63               3.08 https://www3.corsair.com/software/CUE_V3/K63.zip                   0.3.2   K63_App_v308.bin                     1b28b50d7338b9e2cf44ebf6130adb973c6aa5770ba7afa255a61ff096850e61    0x1b40\n  Corsair K63WL             0.00 https://www3.corsair.com/software/CUE_V3/K63WIRELESS.zip           0.2.9   00000000000000000.bin                0000000000000000000000000000000000000000000000000000000000000000    0x1b45\n  Corsair K65RGB            3.08 https://www3.corsair.com/software/CUE_V3/CGK65RGB.zip              0.3.2   K65%20RGB_App_v308.bin               5173de835e2614981a43184f4cca72f96361160a343d17e016f41372ba2ba1bd    0x1b17\n  Corsair K65LUXRGB         3.08 https://www3.corsair.com/software/CUE_V3/K65LUXRGB.zip             0.3.2   K65%20LUX%20RGB_App_v308.bin         779bbfdc9152168ea1fd0ac6e35c93f691ffb3affafedf88e1f8b4c2682ec822    0x1b37\n  Corsair K65RFIRERGB       3.08 https://www3.corsair.com/software/CUE_V3/K65RGBRAPIDFIRE.zip       0.3.2   K65%20RGB%20Rapidfire_App_v308.bin   56428d5b330a81649b2cc6ebb685d17e53120033db5803a3dbee9120eca8d75b    0x1b39\n  Corsair K66               3.08 https://www3.corsair.com/software/CUE_V3/K66.zip                   0.3.2   K66_App_v308.bin                     832c917ff850bcad2a7a0a79c8e603cdce8732d463a567481ce60d6b8468123c    0x1b41\n  Corsair K68               3.08 https://www3.corsair.com/software/CUE_V3/K68.zip                   0.3.2   K68_App_v308.bin                     387f02230945df7a73b51e56ba490a39b2172aad7f99d6ac65bc7ed17bc6b78b    0x1b3f\n  Corsair K68RGB            3.24 https://www3.corsair.com/software/CUE_V3/K68RGB.zip                0.3.2   Vlad_App_v3.24.2.bin                 64ee24ef1e769e5237fa116935bd55036f6ab925e79d527d0e847eaf41b602d9    0x1b4f\n  Corsair K70RGB            3.08 https://www3.corsair.com/software/CUE_V3/K70RGB.zip                0.3.2   K70%20RGB_App_v308.bin               055822b90c5599a5cbceab9019c717a36eedad1bc849d05a28806cf940f7cd2e    0x1b13\n  Corsair K70LUX            3.08 https://www3.corsair.com/software/CUE_V3/K70LUX.zip                0.3.2   K70%20LUX_App_v308.bin               89323b060448c2b787a538cf41ca272cdb3b10fec75eda53a3b1c630566ecec8    0x1b36\n  Corsair K70LUXRGB         3.08 https://www3.corsair.com/software/CUE_V3/K70LUXRGB.zip             0.3.2   K70%20LUX%20RGB_App_v308.bin         fba209ecf67735dd1eac6f0cc04432f423677ccf6518a0fcf6dae65efb6816aa    0x1b33\n  Corsair K70RFIRE          3.08 https://www3.corsair.com/software/CUE_V3/K70RAPIDFIRE.zip          0.3.2   K70%20Rapidfire_App_v308.bin         c40ef86ff561777295bca1743c16afc787d22832f052d4687be58b1bfa559108    0x1b3a\n  Corsair K70RFIRERGB       3.08 https://www3.corsair.com/software/CUE_V3/K70RGBRAPIDFIRE.zip       0.3.2   K70%20RGB%20Rapidfire_App_v308.bin   415aaeaf49f2d28cb28459fd7828e49440846ae762245214c2b7b0efffab9f3a    0x1b38\n  Corsair K70SERFIRERGB     2.06 https://www3.corsair.com/software/CUE_V3/K70RGBSERAPIDFIRE.zip     0.2.9   K70RGBSERAPIDFIRE_APP_V206.bin       7e1b81b9356075331fa25d2bd1fc5fbb68b92ef81bede1c35887521a2fdbba75    0x1b59\n  Corsair K70RGBMK2         3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2.zip            0.3.2   Julius_App_v3.24.26.bin              1324fbf740948fa42e4e5edd48248c94cd02d3d0af123ed5832f9f9e3732330d    0x1b49\n  Corsair K70RGBMK2SE       3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2SE.zip          0.3.2   Julius_Alba_App_v3.24.13.bin         1942d60a9e63649583dd5609ba8aaffaf1cd242555639a8bb5e506bd996a0ed1    0x1b6b\n  Corsair K70RGBMK2LP       3.24 https://www3.corsair.com/software/CUE_V3/K70RGBMK.2LP.zip          0.3.2   Nero_App_v3.24.22.bin                257f5d3d8164e6deb8eab8f2ce0070b9030f586159e362b7f0d339ad71e20402    0x1b55\n  Corsair K95RGB            3.08 https://www3.corsair.com/software/CUE_V3/K95RGB.zip                0.3.2   K95%20RGB_App_v308.bin               15ff062f7d70c32f08c3d3211fd47a20a7c416d1d89e94a3ee5f36ec8eb790ff    0x1b11\n  Corsair K95PLATINUMRGB    3.29 https://www3.corsair.com/software/CUE_V4/K95RGBPLATINUM_3.29.32.zip 0.4.4   Freya_App_v3.29.32.bin              de5c6139d058a10052bf917f6a0a00822e565023f9cbdaa1ace947881c02d478    0x1b2d\n  Corsair STRAFE            3.08 https://www3.corsair.com/software/CUE_V3/STRAFE.zip                0.3.2   Strafe_App_v308.bin                  f33840c3d3687d846efa8b8bc11896ebedad44a5a9a9693755d294ae457fa49a    0x1b15\n  Corsair STRAFERGB         3.08 https://www3.corsair.com/software/CUE_V3/STRAFERGB.zip             0.3.2   Strafe%20RGB_App_v308.bin            aeed03739338e58b06431dd006e0f5461132c12af66994b296d26df5aca905cb    0x1b20\n  Corsair STRAFERGBMK2      3.24 https://www3.corsair.com/software/CUE_V3/STRAFERGBMK.2.zip         0.3.2   Leonidas_App_v3.24.5.bin             be8f91edfd657bdb2ddcdf8058e54d74e9d8633f7c21c26334f756c2fad043e3    0x1b48\n  Corsair STRAFE1B44        3.08 https://www3.corsair.com/software/CUE_V3/STRAFE_v1b1c-p1b44.zip    0.3.2   Strafe%20ISSI_App_v308.bin           e6fc6e5bbd9bb54e1a53d9fd35fe6b17133ed43ccaaa7bc4c7df2dad48c6fe84    0x1b44\n  Corsair M65RGB            3.02 https://www3.corsair.com/software/CUE_V3/M65RGB.zip                0.3.2   M65RGB_APP_v302RC.bin                a99cca31dfc801be73a5ff540d9edf291f242bc187c8c624c04b25d903b13098    0x1b12\n  Corsair M65PRORGB         3.06 https://www3.corsair.com/software/CUE_V3/M65PRORGB.zip             0.3.2   M65Pro_App_v3.06.2.bin               9f78ef423dc2165ea8db2404f5d38e1215f633c4e554f08216526676153f1d01    0x1b2e\n  Corsair M65RGBELITE       3.24 https://www3.corsair.com/software/CUE_V3/M65RGBELITE.zip           0.3.2   BlackHeart_App_v3.24.4.bin           3181c9162bd4ff01d2637028144a319041104fc0c8ba4ebba36460103b92e067    0x1b5a\n  Corsair SCIMITARRGB       3.04 https://www3.corsair.com/software/CUE_V3/Scimitar.zip              0.3.2   Scimitar_APP_v304RC.bin              4d8d17b969ebddffc54ffc50adf1d39231f77a89aafb85e5264832bb93cd42d3    0x1b1e\n  Corsair SCIMITARPRO       3.14 https://www3.corsair.com/software/CUE_V3/ScimitarPRORGB.zip        0.3.2   ScimitarPro_App_v3.14.3.bin          34a9583517e3fd3a099782adbc91aceeffc0af63ac70cc14ca7c24eb74bf1515    0x1b3e\n  Corsair SABRE2ND          3.04 https://www3.corsair.com/software/CUE_V3/SABRE.zip                 0.3.2   Sabre2nd_APP_v304RC.bin              62bbaa804ab9cba6452f715b9d1298c9d3a6dfd05dbebefb9162cd6f5367fb04    0x1b32\n  Corsair HARPOONRGB        3.08 https://www3.corsair.com/software/CUE_V3/HARPOONRGB.zip            0.3.2   Harpoon_App_v3.08.3.bin              08c1e1ec7c30a4bdf32c37a50a25fa6f81104043434750e724898a148f8dd652    0x1b3c\n  Corsair GLAIVERGB         3.14 https://www3.corsair.com/software/CUE_V3/GLAIVERGB.zip             0.3.2   Glaive_App_v3.14.3.bin               83af8567748153504157a062c802d304e4612819319c4674e904ff0d83ba1486    0x1b34\n  Corsair KATAR             3.04 https://www3.corsair.com/software/CUE_V3/KATAR.zip                 0.3.2   Katar_APP_v304RC.bin                 da09d2aebfcac471a0aa076a84a5d0e999c0217b479b95822ed43f59cb818ff0    0x1b22\n  Corsair SABRE1            3.02 https://www3.corsair.com/software/CUE_V3/Sabre1.zip                0.3.2   Sabre1_APP_v302RC.bin                51c087dbfc7575a6b70cbcee44d6bd320fdded67c4b9c6f09f6589a80fb6535b    0x1b14\n  Corsair SABRE2            3.02 https://www3.corsair.com/software/CUE_V3/Sabre2.zip                0.3.2   Sabre2_APP_v302RC.bin                2e76fc909ef1c829e57d8ae0b0f538c2102a72471348156a09af3af344954bb1    0x1b19\n  Corsair SABREPRORGB       3.04 https://www3.corsair.com/software/CUE_V3/SABRERGB.zip              0.3.2   SabrePro_APP_v304RC.bin              5854a79cab22f2c8717a2e1866dab55628783468a0e069e9a43ecc004b71da8c    0x1b2f\n  Corsair POLARIS           1.02 https://www3.corsair.com/software/CUE_V3/MM800RGB.zip              0.2.9   SageApp_v1.02.50.bin                 5917b0de570296ba2a80cf5aa67f5bf0ef3026685453eb070364f450c3ab65fa    0x1b3b\n  Corsair ST100RGB          0.02 https://www3.corsair.com/software/CUE_V3/ST100RGB.zip              0.2.9   ST100RGB%200.2.91.bin                baa64949b8ec21133789783d9687f9d20e0cb7d912df2f3ab7d7120280bdcd56    0x0a34\n  Corsair NIGHTSWORDRGB     3.35 https://www3.corsair.com/software/CUE_V3/NIGHTSWORDRGB.zip         0.4.2   Dormammu_App_v3.35.19.bin            18a23e13e6aed887da1193dbbe1af031bb497f0225b82ccac2d2190c4aafecac    0x1b5c\n\n!END FW ENTRIES\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.6044921875,
          "content": "GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc., <http://fsf.org/>\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    {description}\n    Copyright (C) {year}  {fullname}\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  {signature of Ty Coon}, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.40234375,
          "content": "# ckb-next: RGB Driver for Linux\n\n<a target=\"_blank\" href=\"https://web.libera.chat/?channels=#ckb-next\"><img src=\"https://img.shields.io/badge/%23irc-libera.chat-blue.svg\" height=\"20\" alt=\"irc.libera.chat #ckb-next\" /></a>\n\n**ckb-next** is an open-source driver for Corsair keyboards and mice. It aims to bring the features of Corsair's proprietary CUE software to Linux operating systems. This project is currently a work in progress, but it already supports much of the same functionality, including full RGB animations. More features are coming soon. Testing and bug reports are appreciated!\n\n> __DISCLAIMER__: ckb-next is not an official Corsair product. It is licensed under the GNU General Public License (version 2) in the hope that it will be useful, but with NO WARRANTY of any kind.\n\n![Screenshot](https://i.imgur.com/zMK9jOP.png)\n\nMajor features:\n\n- Control multiple devices independently\n- United States and European keyboard layouts\n- Customizable key bindings\n- Per-key lighting and animation\n- Reactive lighting\n- Multiple profiles/modes with hardware save function\n- Adjustable mouse DPI with ability to change DPI on button press\n\n### Important information regarding macOS\nmacOS is no longer officially supported. For more information, please refer to [issue #660](https://github.com/ckb-next/ckb-next/issues/660).\n\n### General information\n\nMost of the information can be found on [ckb-next wiki pages](https://github.com/ckb-next/ckb-next/wiki).\n\n[Supported devices](https://github.com/ckb-next/ckb-next/wiki/Supported-Hardware).\n\n[Linux Installation](https://github.com/ckb-next/ckb-next/wiki/Linux-Installation).\n\n[Troubleshooting](https://github.com/ckb-next/ckb-next/wiki/Troubleshooting).\n\n[Known Issues](https://github.com/ckb-next/ckb-next/wiki/Known-issues).\n\n[Contributing](https://github.com/ckb-next/ckb-next/wiki/Contributing).\n\n[Community Pipe Animation Scripts](https://github.com/ckb-next/ckb-next/wiki/Community-Pipe-Scripts).\n\n### Contact\n\nMaintainers reserve the rights to modify and remove issues, pull requests and comments therein, that are denunciating, off-topic, harmful, hateful and overall inappropriate.\nPlease be appreciative, humble and kind to each other.\n\n* IRC chat: `#ckb-next` channel at [irc.libera.chat](https://web.libera.chat/?channels=#ckb-next)\n* Mailing list: [ckb-next@googlegroups.com](https://groups.google.com/forum/#!forum/ckb-next)\n* [GitHub Issues](https://github.com/ckb-next/ckb-next/issues)\n"
        },
        {
          "name": "VERSION.cmake",
          "type": "blob",
          "size": 0.3779296875,
          "content": "set(ckb-next_VERSION \"0.6.0\")\nset(ckb-next_VERSION_MAJOR 0)\nset(ckb-next_VERSION_MINOR 6)\nset(ckb-next_VERSION_PATCH 0)\n# This should be set to TRUE _only_ in archive/tarball releases\nset(ckb-next_VERSION_IS_RELEASE FALSE)\n\n# Profile format version\nset(ckb-next_PROFILE_VER 3)\n\n# Settings version\nset(ckb-next_SETTINGS_VER 1)\n\n# Copyright year string\nset(ckb-next_COPYRIGHT_YEAR \"2023\")\n"
        },
        {
          "name": "ckb-next-dev-detect",
          "type": "blob",
          "size": 3.353515625,
          "content": "#!/usr/bin/env bash\n\n# Newline\nN=$'\\n'\n\nif [[ \"$1\" != \"--elevate\" ]]; then\n    if [[ \"$1\" != \"--nouserinput\" ]]; then\n        OUTPATH=\"${PWD}/\"\n        echo \"This script will collect information about the Corsair devices in your system.\"\n        read -p \"Please make sure they are plugged in and press Enter.${N}\"\n        echo \"Generating report. Please wait...\"\n    else\n        OUTPATH=\"/tmp/\"\n    fi\n\n    #Check if user can write to the PWD\n    touch \"${OUTPATH}ckb-next-dev-detect-report.gz\"\n    TOUCHRET=$?\n    if [ $TOUCHRET -ne 0 ]; then\n        echo \"Could not write the report to disk, make sure this user can write to ${OUTPATH}\"\n        echo \"Retval: $TOUCHRET\"\n        exit $TOUCHRET\n    fi\n\n    # If pkexec exists, run the script through it\n    ABSPATH=`readlink -f \"$0\"`\n    if command -v pkexec &> /dev/null; then\n        OUT=\"`pkexec \\\"$ABSPATH\\\" --elevate`\"\n        RET=$?\n        if [[ $RET -ne 0 ]]; then\n            echo \"pkexec failed\"\n            exit $RET\n        fi\n    else\n        OUT=\"pkexec not found${N}${N}`bash \\\"$ABSPATH\\\" --elevate`\"\n    fi\n    OUT=\"${OUT}${N}${N}Environment:${N}`printenv | grep \"QT\\|XDG.*DESKTOP\\|DISPLAY\\|WAYLAND_DESKTOP\\|XDG_SESSION_TYPE\" 2>&1`\"\n    OUT=\"${OUT}${N}\\`\\`\\`${N}\"\n    echo \"$OUT\" | gzip > \"${OUTPATH}ckb-next-dev-detect-report.gz\"\n    echo \"Done! Please send the following report to the developers.\"\n    echo \"Location: ${OUTPATH}ckb-next-dev-detect-report.gz\"\nelse\n    # Force English\n    export LC_ALL=C\n\n    OUT=\"ckb-next-dev-detect - $(date)\"\n    OUT=\"${OUT}${N}${N}\\`\\`\\`\"\n\n    # Applies to both\n    OUT=\"${OUT}${N}Kernel: `uname -a`\"\n\n    if [[ \"$OSTYPE\" == \"darwin\"* ]]; then\n        OUT=\"${OUT}${N}${N}OS Version:${N}`sw_vers`\"\n        OUT=\"${OUT}${N}${N}USB Devices:${N}`system_profiler SPUSBDataType -detailLevel mini | grep -i -B3 -A9 1b1c`\"\n        OUT=\"${OUT}${N}${N}IOReg:${N}`ioreg -lxrc IOUSBDevice | sed -n '/Corsair/,/^$/p'`\"\n        OUT=\"${OUT}${N}${N}Daemon log:${N}`tail -n 100 /var/log/ckb-next-daemon.log`\"\n        OUT=\"${OUT}${N}${N}GUI log:${N}`cat /tmp/ckb-next.log`\"\n    else\n        OUT=\"${OUT}${N}${N}OS Version:${N}`lsb_release -a 2>/dev/null`\"\n        OUT=\"${OUT}${N}${N}USB Devices:${N}`lsusb -vd '1b1c:' 2>&1`\"\n\n        # Check if kernel ring buffer is reachable through systemd journal, fall back to dmesg\n        if [ -z \"$(journalctl -k 2>/dev/null)\" ]; then\n            OUT=\"${OUT}${N}${N}Systemctl error, falling back to dmesg:${N}`dmesg | grep -i \\\"ckb-next\\|corsair\\|1b1c\\\"`\"\n        else\n            # Pipe stderr to /dev/null, as grep would filter errors out anyway\n            OUT=\"${OUT}${N}${N}Dmesg on current boot:${N}`journalctl -o short-precise -k -b 0 2>/dev/null | grep -i \\\"ckb-next\\|corsair\\|1b1c\\\"`\"\n            OUT=\"${OUT}${N}${N}Dmesg on last boot:${N}`journalctl -o short-precise -k -b -1 2>/dev/null | grep -i \\\"ckb-next\\|corsair\\|1b1c\\\"`\"\n            OUT=\"${OUT}${N}${N}Daemon on current boot:${N}`journalctl -o short-precise -b 0 --unit=ckb-next-daemon 2>&1`\"\n            OUT=\"${OUT}${N}${N}Daemon on last boot:${N}`journalctl -o short-precise -b -1 --unit=ckb-next-daemon 2>&1`\"\n        fi\n        OUT=\"${OUT}${N}${N}Dev nodes:${N}`find /dev/input/ckb* -print -type f -exec cat {} \\; 2>&1`\"\n        OUT=\"${OUT}${N}${N}Kernel command line:${N}`cat /proc/cmdline`\"\n        GUIPATH=\"$(which ckb-next)\"\n        OUT=\"${OUT}${N}${N}GUI ldd:${N}`ldd ${GUIPATH}`\"\n    fi\n\n    # Print to stdout\n    echo \"$OUT\"\nfi\n\n"
        },
        {
          "name": "cmake",
          "type": "tree",
          "content": null
        },
        {
          "name": "libera.svg",
          "type": "blob",
          "size": 1.1259765625,
          "content": "<svg xmlns=\"http://www.w3.org/2000/svg\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" width=\"102\" height=\"20\" role=\"img\" aria-label=\"#irc: libera.chat\"><title>#irc: libera.chat</title><linearGradient id=\"s\" x2=\"0\" y2=\"100%\"><stop offset=\"0\" stop-color=\"#bbb\" stop-opacity=\".1\"/><stop offset=\"1\" stop-opacity=\".1\"/></linearGradient><clipPath id=\"r\"><rect width=\"102\" height=\"20\" rx=\"3\" fill=\"#fff\"/></clipPath><g clip-path=\"url(#r)\"><rect width=\"33\" height=\"20\" fill=\"#555\"/><rect x=\"33\" width=\"69\" height=\"20\" fill=\"#007ec6\"/><rect width=\"102\" height=\"20\" fill=\"url(#s)\"/></g><g fill=\"#fff\" text-anchor=\"middle\" font-family=\"Verdana,Geneva,DejaVu Sans,sans-serif\" text-rendering=\"geometricPrecision\" font-size=\"110\"><text aria-hidden=\"true\" x=\"175\" y=\"150\" fill=\"#010101\" fill-opacity=\".3\" transform=\"scale(.1)\" textLength=\"230\">#irc</text><text x=\"175\" y=\"140\" transform=\"scale(.1)\" fill=\"#fff\" textLength=\"230\">#irc</text><text aria-hidden=\"true\" x=\"665\" y=\"150\" fill=\"#010101\" fill-opacity=\".3\" transform=\"scale(.1)\" textLength=\"590\">libera.chat</text><text x=\"665\" y=\"140\" transform=\"scale(.1)\" fill=\"#fff\" textLength=\"590\">libera.chat</text></g></svg>"
        },
        {
          "name": "linux",
          "type": "tree",
          "content": null
        },
        {
          "name": "macos",
          "type": "tree",
          "content": null
        },
        {
          "name": "quickinstall",
          "type": "blob",
          "size": 1.4384765625,
          "content": "#!/usr/bin/env bash\n\n# We want to see the logs in English\nif [[ -z \"$LC_ALL\" && -z \"$LANG\" ]]; then\n\techo \"* Weird, neither LC_ALL nor LANG is set:\"\n\tlocale\n\techo \"* Trying LANG=en_US.UTF-8 anyway\"\n\texport LANG=\"en_US.UTF-8\"\nelse\n\t# don't let LC_ALL to be set because it always overrides all LC_*,\n\t# while LANG only sets LC_* once\n\tif [[ -n \"$LC_ALL\" ]]; then\n\t\texport LC_ALL=\n\tfi\nfi\n\nexport LC_NUMERIC=C\nexport LC_TIME=C\nexport LC_MONETARY=C\nexport LC_MESSAGES=C\nexport LC_PAPER=C\nexport LC_NAME=C\nexport LC_ADDRESS=C\nexport LC_TELEPHONE=C\nexport LC_MEASUREMENT=C\nexport LC_IDENTIFICATION=C\n\nfunction checkfail {\n    if [[ $1 -ne 0 ]]; then\n        echo \"An error occurred,\"\n        echo \"press enter to exit.\"\n        read -rs\n        exit \"$1\"\n    fi\n}\n\nfunction finish {\n    echo \"Done.\"\n    echo \"Thank you for installing ckb-next!\"\n    exit 0\n}\n\n# Check if we're in the right directory\nif [[ ! -f \"src/daemon/usb.c\" ]]; then\n    echo \"Please run this script inside the ckb-next source directory.\"\n    exit\nfi\n\nrm -rf build\n\ncmake -H. -Bbuild -DCMAKE_BUILD_TYPE=Release -DSAFE_INSTALL=ON -DSAFE_UNINSTALL=ON\ncheckfail $?\n\n# Find out how many cores the system has, for make\nif [[ -z \"$JOBS\" ]]; then\n\tJOBS=$(getconf _NPROCESSORS_ONLN 2>/dev/null)\nfi\n\n# Default to 2 jobs if something went wrong earlier\nif [[ -z \"$JOBS\" ]]; then\n    JOBS=2\nfi\n\ncmake --build build --target all -- -j \"$JOBS\"\ncheckfail $?\n\nsudo cmake --build build --target install\ncheckfail $?\n\nfinish\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "zMK9jOP.png",
          "type": "blob",
          "size": 86.103515625,
          "content": null
        }
      ]
    }
  ]
}