{
  "metadata": {
    "timestamp": 1736565745488,
    "page": 666,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "NVIDIAGameWorks/PhysX-3.4",
      "stars": 2360,
      "defaultBranch": "master",
      "files": [
        {
          "name": "APEX_1.4",
          "type": "tree",
          "content": null
        },
        {
          "name": "Externals",
          "type": "tree",
          "content": null
        },
        {
          "name": "KaplaDemo",
          "type": "tree",
          "content": null
        },
        {
          "name": "PhysX_3.4",
          "type": "tree",
          "content": null
        },
        {
          "name": "PxShared",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.173828125,
          "content": "# NVIDIA PhysX SDK 3.4\n\nCopyright (c) 2018 NVIDIA Corporation. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n * Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n * Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n * Neither the name of NVIDIA CORPORATION nor the names of its\n   contributors may be used to endorse or promote products derived\n   from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS ``AS IS'' AND ANY\nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n## Introduction\n\nWelcome to NVIDIA's PhysX and APEX SDK source code repository. This depot includes the PhysX SDK, the APEX SDK, and the Kapla Demo application.\n\nNOTE: The APEX SDK is not needed to build either the PhysX SDK nor the demo and has been deprecated. It is provided for continued support of existing applications only. We recommend the following libraries as replacements:\n\nFor APEX Clothing: NvCloth - https://github.com/NVIDIAGameWorks/NvCloth\n\nFor APEX Destruction: Blast - https://github.com/NVIDIAGameWorks/Blast\n\nFor APEX Particles: Flex - https://github.com/NVIDIAGameWorks/FleX\n\nFor APEX Turbulence: Flow - https://github.com/NVIDIAGameWorks/Flow\n\n## Documentation\n\nOnline Documentation:\n\nhttp://gameworksdocs.nvidia.com/simulation.html\n\nThe documentation can also be found in the repository under \n* \\PhysX_3.4\\Documentation\n* \\APEX_1.4\\docs \n\nPlease also see the following readme files: \n* \\PhysX_3.4\\readme_*.html, \n* \\APEX_1.4\\readme.txt. \n\n## Instructions\n\nTo begin, clone this repository onto your local drive.\n\nTo build PhysX and APEX SDKs: \n\n(1) Build PhysX SDK by opening one of the solutions found under PhysX_3.4\\Source\\compiler. \nSupported platforms: Windows, Linux, OSX, Android, iOS.\n\n(2) The APEX SDK distribution contains pre-built binaries supporting GPU acceleration.\nRe-building the APEX SDK removes support for GPU acceleration. The solutions can be found under APEX_1.4\\compiler. \nSupported platforms: Windows, Linux, Android.\n______________________________________________________________\nTo build PhysX Snippets: open one of the solutions found under \\PhysX_3.4\\Snippets\\compiler.\n\nTo build PhysX Samples (windows only): open one of the solutions found under \\PhysX_3.4\\Samples\\compiler.\n\nTo build APEX Snippets: open one of the solutions found under \\APEX_1.4\\snippets\\compiler.\n\nTo build APEX Samples: open one of the solutions found under \\APEX_1.4\\samples_v2\\compiler.\n\nTo build and run the Kapla Demo (KaplaDemo\\samples\\compiler) please make sure to build the PhysX SDK with the same Visual Studio version and with the same build configuration **before** compiling the Kapla Demo. This will make sure the appropriate DLLs are copied to the KaplaDemo bin directory.\n\n## Acknowledgements\n\nThis depot contains external third party open source software copyright their respective owners:\n\nAlexander Chemeris,\nThe Android Open Source Project,\nBrian Paul,\nBrodie Thiesfield,\nElectronic Arts,\nEmil Mikulic,\nFreeImage,\nHewlett-Packard Company,\nIndependent JPEG Group,\nJohn W. Ratcliff,\nJulio Jerez,\nKevin Bray,\nThe Khronos Group Inc.,\nKitware, Inc.,\nMark J. Kilgard,\nMicrosoft Corporation,\nOpen Dynamics Framework Group,\nPython Software Foundation,\nUniv. of Western Ontario,\nand the ASSIMP, clang and glew development teams.\n"
        }
      ]
    }
  ]
}