{
  "metadata": {
    "timestamp": 1736565888388,
    "page": 849,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ValveSoftware/ToGL",
      "stars": 2049,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.1318359375,
          "content": "                       TOGL CODE LICENSE\n\n  Copyright 2011-2014 Valve Corporation\n  All Rights Reserved.\n\n  Permission is hereby granted, free of charge, to any person obtaining a copy\n  of this software and associated documentation files (the \"Software\"), to deal\n  in the Software without restriction, including without limitation the rights\n  to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n  copies of the Software, and to permit persons to whom the Software is\n  furnished to do so, subject to the following conditions:\n\n  The above copyright notice and this permission notice shall be included in\n  all copies or substantial portions of the Software.\n\n  THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n  FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n  AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n  LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n  OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n  THE SOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 0.64453125,
          "content": "TOGL\n=============\n\nDirect3D -> OpenGL translation layer.\n\nTaken directly from the DOTA2 source tree; supports:\n - Limited subset of Direct3D 9.0c\n - Bytecode-level HLSL -> GLSL translator\n - Some SM3 support: Multiple Render Targets, no Vertex Texture Fetch\n\nThis most likely won't build by itself and is provided as-is and completely\nunsupported. Feel free to use it for your reference, incorporate it into your\nprojects or send us modifications.\n\nBe wary that some parts are hardcoded to match Source Engine behavior; see\nCentroidMaskFromName() and ShadowDepthSamplerMaskFromName() in dxabstract.cpp.\n\nPlease refer to the LICENSE file for more information.\n"
        },
        {
          "name": "public",
          "type": "tree",
          "content": null
        },
        {
          "name": "togl",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}