{
  "metadata": {
    "timestamp": 1736565730007,
    "page": 643,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "dannagle/PacketSender",
      "stars": 2400,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.451171875,
          "content": "\n\n#ci/cd\n*.dmgCanvas\n*.key\n*.pem\n*.backup\n*.bz2\n\n#Astyle temp\n*.orig\n\n#Mac Stuff\n*.dmg\n*.app\n\n# C++ objects and libs\n.DS_Store\nbuild-*\n*.slo\n*.lo\n*.o\n*.a\n*.la\n*.lai\n*.so\n*.dll\n*.dylib\n\n# Qt-es\n\n/.qmake.cache\n/.qmake.stash\n*.pro.user\n*.pro.user.*\n*.moc\nmoc_*.cpp\nqrc_*.cpp\nui_*.h\nMakefile*\n*-build-*\n\n# QtCreator\n\n*.autosave\n\n#QtCtreator Qml\n*.qmlproject.user\n*.qmlproject.user.*\nbuild/\n\n.idea\n.vscode\n\n# Do not accidently commit credentials...\naccess-token*.txt\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.111328125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\nhttps://packetsender.com/contact.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.6044921875,
          "content": "GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc., <http://fsf.org/>\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    {description}\n    Copyright (C) {year}  {fullname}\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  {signature of Ty Coon}, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n\n"
        },
        {
          "name": "README.de.md",
          "type": "blob",
          "size": 33.791015625,
          "content": "# Einführung\n\n![Paket Sender Logo](screenshots/packetsender_banner.png)\n\n\n*Lesen Sie dies in anderen Sprachen: [English](README.md), [Español](README.es.md), [Deutsch](README.de.md), [Français](README.fr.md).*\n\n\n[![herunterladen](https://img.shields.io/github/downloads/dannagle/PacketSender/total.svg)](https://packetsender.com/download)\n\nPaket Sender ist ein Open-Source-Dienstprogramm, das das Senden und Empfangen von TCP-, UDP- und SSL-Paketen (verschlüsseltes TCP) sowie HTTP/HTTPS-Anfragen und die Erstellung von Panels ermöglicht. Der Mainline-Zweig unterstützt offiziell Windows, Mac und Desktop-Linux (mit Qt). Andere Stellen können Paket Sender neu kompilieren und weiterverteilen. Paket Sender ist kostenlos und steht unter der GPL v2 oder höher. Es kann sowohl für kommerzielle als auch für private Zwecke verwendet werden. Wenn Sie die App nützlich finden, ziehen Sie bitte eine Spende/Sponsoring in Betracht, damit die Entwicklung fortgesetzt werden kann.\n\n\n\n# Inhaltsverzeichnis\n* [Sponsoren](#sponsors)\n  * Besuchen Sie [IWL.com](https://www.iwl.com/)\n  *  Besuchen Sie  [NagleCode.com](https://dannagle.com/)\n\n* [GUI](#gui)\n* [Intensiver Verkehrsgenerator (GUI)](#udptraffic)\n* [Netzwerk](#network)\n* [Herunterladen](#downloads)\n* [Unterstützung](#support)\n* [IPv4-Subnetz-Rechner](#subnetcalculator)\n* [Paket Sender Cloud](#cloud)\n* [Tragbarer Modus](#portable)\n* [Makros und intelligente Antworten](#smartresponses)\n* [Persistentes TCP und SSL](#persistent)\n* [HTTP/HTTPS-Anfragen](#http)\n* [Panel Generator](#panelgen)\n* [Befehlszeilenschnittstelle](#cli)\n* [Intensiver Verkehrsgenerator (CLI)](#cliintensetraffic)\n* [Gebäude-Paket-Sender](#building)\n\n\n\n\n<a id=\"Sponsoren\"></a>\n## Sponsors\n\nPaket Sender möchte sich bei den folgenden Sponsoren bedanken.\n\n[![IWL](screenshots/iwl_logo.png)](https://www.iwl.com/)\n<br>IWL ist ein kalifornisches Unternehmen, das Computer-Netzwerkprodukte herstellt.\n<br><br><br>\n\n[![NagleCode](screenshots/naglecode-logo400.png)](https://dannagle.com)\n<br>NagleCode ist ein Softwarehersteller und Entwicklungsstudio. \n<br><br><br>\n\n\n[Möchten Sie, dass Ihr Name/Logo hier aufgeführt wird?](https://github.com/sponsors/dannagle)\n\n\n\n<a id=\"support\"></a>\n## Unterstützung\n\n* Twitter: [@NagleCode](http://twitter.com/NagleCode)\n* Die Foren befinden sich unter: [GitHub-Diskussionen](https://github.com/dannagle/PacketSender/discussions).\n* E-Mail: [Paketabsender-Kontakt](https://packetsender.com/contact)\n* Verbinden Sie sich mit mir auf [LinkedIn](https://www.linkedin.com/in/dannagle/)\n\n*HINWEIS:* Versuchen Sie, Ihre Firewall (vorübergehend) zu deaktivieren, wenn Sie Probleme unter Windows haben.\n\n<a id=\"Downloads\"></a>\n# Herunterladen\n\n## Desktop herunterladen\nOffizielle Versionen von Paket Sender können unter [PacketSender.com](http://packetsender.com/download) heruntergeladen werden. Mancherorts wird das Paket Sender weiterverteilt.\n\n![Windows Logo](screenshots/winlogo150.png) ![Mac Logo](screenshots/maclogo150.png) ![Linux Logo](screenshots/Tux150.png)\n\n\n<!--\nIch bin mir nicht sicher, wann sie wieder verfügbar sein wird.\n\n## Mobile Apps\nDie mobilen Editionen von Paket Sender sind vollständig nativ, enthalten nur ein Minimum an Berechtigungen und sammeln keine Daten. Dies ist eine Software, die Sie überwacht. Vielen Dank, dass Sie diese Bemühungen unterstützen.\n\n\n### Android Mobile App\n![Android-Logo](screenshots/android_logo.png)\n\nDie Android-Version finden Sie [auf Google Play](https://play.google.com/store/apps/details?id=com.packetsender.compose) oder [im Amazon Appstore](https://www.amazon.com/dp/B08RXM6KM2/)\n\n[![Paket Sender Android](screenshots/packetsender_android_screenshot.png)](https://play.google.com/store/apps/details?id=com.packetsender.compose\n\n-->\n\n\n<!--\nIch bin mir nicht sicher, wann sie wieder verfügbar sein wird.\n\n## iOS Mobile App\n\n![Paket Sender Logo](screenshots/ios_logo.png)\n\nDie iOS-Version befindet sich [im Apple App Store](https://apps.apple.com/app/id1558236648#?platform=iphone)\n\n[![Paket Sender iOS](screenshots/packetsender-ios-traffic-log-ascii.png)](https://apps.apple.com/app/id1558236648#?platform=iphone)\n\n-->\n<a id=\"gui\"></a>\n# GUI \n\nPaket Sender ist für alle Desktop-Versionen identisch. Der einzige Unterschied besteht darin, dass das Design an das Betriebssystem angepasst ist.\n\nBildschirmfoto des Paketsenders](screenshots/ps_GUI.png)\n\n1. Einem Paket sind ein Name, eine Zieladresse (Domänennamen werden standardmäßig kurz vor dem Senden aufgelöst), ein Anschluss und Daten zugeordnet.\n2. In der Tabelle finden Sie eine Liste der gespeicherten Pakete. Sie können auf Felder in dieser Tabelle doppelklicken, um sie direkt zu bearbeiten.\n3. Unten rechts werden UDP-, TCP- und SSL-Serverstatus und Port(s) angezeigt. Wenn Sie darauf klicken, wird das Protokoll aktiviert oder deaktiviert. Der Paketsender unterstützt die Bindung an eine beliebige Anzahl von Ports.\n4. Außerdem gibt es eine IP Umschalttaste. Wenn Sie darauf klicken, ändert sich der Wert in IPv4 (Standard), IPv6 oder benutzerdefinierte IP\n\n### Allgemeine Hinweise\n* Ein Resend-Wert von \"0\" bedeutet, dass es sich um ein einmalig gesendetes Paket handelt.\n* Während des erneuten Sendens von Paketen gibt es eine Schaltfläche zum Abbrechen aller erneuten Sendungen.\n* Bitte überprüfen Sie Ihre Firewall. Windows blockiert aggressiv TCP-basierte Server. Packet Sender funktioniert auch, wenn die Firewall ihn blockiert, kann aber keine unaufgeforderten TCP-basierten Pakete empfangen.\n* Eine optionale Antwort kann gesendet werden. Die gleiche Antwort wird für TCP, UDP und SSL verwendet.\n* Für den IPv6-Versand benötigen Sie auch die Scope-ID.\n* Paket Sender unterstützt gemischte ASCII- und HEX-Schreibweisen:\n  * Doppelklicken Sie auf eines der Felder, um den mehrzeiligen Editor aufzurufen.\n  * \\XX wird in XX in hex übersetzt\n  * \\n, \\r, \\t werden in 0A, 0D und 09 übersetzt\n  * HEX-Zahlen sind durch Leerzeichen getrennt.\n    * Das HEX-Feld versucht, andere gebräuchliche Begrenzungszeichen (wie Kommas, Doppelpunkte (Wireshark), Semikolons, \"0x\" usw.) zu interpretieren und automatisch zu korrigieren. Sie ist sehr fehlertolerant.\n    * Ein einzelner HEX-Stream wird ebenfalls unterstützt. Wenn die Anzahl der Bytes ungerade ist, geht Packet Sender davon aus, dass das erste Byte eine Null sein muss und korrigiert dann automatisch.\n  * Beispiel ASCII: hallo welt\\r\n  * Beispiel HEX: 68 65 6c 6c 6f 20 77 6f 72 6c 64 0d\n  * Sie können ein Paket direkt aus dem Verkehrslog speichern. Sie werden aufgefordert, einen Namen einzugeben, und die Quelladresse und der Port werden zu Ihrer Bequemlichkeit umgeschaltet.\n  * Sie können eine Datei auch direkt in das HEX-Feld laden. Im HEX-Feld können bis zu 10.922 Bytes gesendet werden. Die theoretische Grenze für das Senden über die Befehlszeile liegt bei 200 MB.\n\n\n## Hotkeys/Tastaturkürzel\n\nDie Felder im oberen Bereich können mit STRG+1, STRG+2 usw. bis hin zu STRG+8 (Schaltfläche Senden) durchlaufen werden. Auf dem Mac lautet die Tastenkombination Befehl.\n\nDie Hotkeys und Felder sind:\n* STRG + 1 = Name\n* STRG + 2 = ASCII\n* STRG + 3 = HEX\n* STRG + 4 = Adresse\n* STRG + 5 = Anschluss\n* STRG + 6 = Verzögerung beim erneuten Senden\n* STRG + 7 = Protokollauswahl\n* STRG + 8 = Senden (wird ausgeführt)\n\n\nEinige Anmerkungen:\n* Die Felder sind unabhängig von der Auswahl des Protokolls mit dem entsprechenden Hotkey verknüpft.\n* Wenn Sie zur Option TCP/UDP/SSL navigieren, können Sie die Zeichen nach oben/unten oder t/u/s/h verwenden, um eine Auswahl zu treffen.\n* Wenn Sie die Arbeit mit Hotkeys automatisieren wollen (z. B. mit [AutoHotKey] (https://www.autohotkey.com/)), sollten Sie die Option \"Vorherige Sitzung wiederherstellen\" deaktivieren.\n\n\n\n<a id=\"network\"></a>\n# Netzwerkfunktionen\n\n## IPv4, IPv6, Custom IP\n\nDie integrierten Server von Paket Sender sind so konfiguriert, dass sie entweder IPv4 oder IPv6 unterstützen, aber nicht beide gleichzeitig. Für Clients schalten Paket Sender GUI und CLI beim Senden nahtlos zwischen den beiden Modi um (für IPv6 wird möglicherweise eine Scope-ID benötigt). Klicken Sie unten rechts auf die Umschalttaste IPv4 / IPv6, um zwischen den beiden Optionen zu wechseln.\n\nIn den Einstellungen können Sie auch festlegen, dass sich die Server von Packet Sender an eine benutzerdefinierte IP-Adresse binden. Dies kann für Systeme mit mehreren NICs oder komplizierten IP-Konfigurationen sehr nützlich sein. Paket Sender löst einen Fehler aus, wenn er sich an eine Adresse binden soll, die nicht existiert.\n\n![IP-spezifische Bindung](screenshots/ip-spezifische-bindung.png)\n\n\n<a id=\"subnetcalculator\"></a>\n## IPv4-Subnetz-Rechner\n\nPaket Sender hat einen eingebauten Subnetz-Rechner. Es befindet sich unter dem Menü Extras.\n![Paket Sender Subnetz Calc](screenshots/packetsender_subnetcalc.PNG)\n\n* Das Log-Fenster (unterer Bereich) zeigt die auf Ihrem Computer gefundenen IPv4- und IPv6-Adressen an, die nicht als Loopback-Adresse fungieren.\n* Auf der linken Seite geben Sie die IPv4-Adresse in das Feld IP ein. \n* Auf der linken Seite geben Sie das Subnetz entweder in X.X.X. oder /XX-Notation ein.\n* Die Ergebnisse der Berechnung finden Sie auf der rechten Seite.\n* Das unten stehende Feld dient der schnellen Überprüfung, ob eine IPv4 in einem Ihrer Subnetze liegt.\n\n## SSL-Klient und -Server\n\nPaket Sender unterstützt den Aufbau verschlüsselter Verbindungen über SSL.\nDies wird sowohl in der grafischen Benutzeroberfläche als auch in der Befehlszeile unterstützt.\n\nPaket Sender bündelt OpenSSL für die Verwendung unter Windows. Auf Mac und Linux verwendet Packet Sender die nativen SSL-Bibliotheken.\n\nDieses Produkt enthält Software, die vom OpenSSL-Projekt zur Verwendung im OpenSSL-Toolkit entwickelt wurde. (http://www.openssl.org/)_\n\n![Paket Sender Direkt TCP](screenshots/packetsender_ssl.PNG)\n\nSSL-Notizen:\n* Die Zertifikatsaushandlung wird sofort während der Verbindung durchgeführt.\n* Standardmäßig ignoriert Paket Sender alle SSL-Fehler (abgelaufenes Zertifikat, falscher Hostname, selbstsigniert usw.).\n* Paket Sender gibt den Fortschritt der Zertifikatsaushandlung im Verkehrslog aus.\n* Paket Sender gibt den im Verkehrslog verwendeten Verschlüsselungsalgorithmus aus (z. B. AES 128).\n\nPaket Sender bündelt ein internes \"Snake Oil\"-Zertifikat für die Verwendung als Server für Windows. Das Zertifikat und der Schlüssel befinden sich an der gleichen Stelle wie das Paket und die Einstellungen.\n\n_Anmerkung: Das Überschreiben der Zertifizierungsstellen in den Einstellungen überschreibt auch das Schlangenöl-Zertifikat._\n\nWenn ein SSL-Fehler auftritt, wird dieser von Paketsender in des Verkehrs log, eingetragen. Wenn die Einstellung so ist, dass die Verschlüsselung trotzdem fortgesetzt wird (Standardeinstellung), wird die Verschlüsselung weiter ausgehandelt. Andernfalls wird die Verbindung mit einem Verbindungsabbruch beendet.\n\n![Paket Sender Direkt TCP Abgelaufen](screenshots/packetsender_expired_ssl.png)\n\n## Multicast (experimentell)\n\nDie Multicast-Unterstützung von PaketSender wird durch den Versuch ausgelöst, an eine IPv4-Multicast-Adresse zu senden, oder über das Untermenü Mulitcast. Die Funktion ist derzeit experimentell und hat diese bekannten Probleme.\n\n* Der Paketsender gibt die IPv6-Unterstützung auf, wenn er dem Multicast beitritt.\n* Und bleibt verwaist, bis Sie die Einstellungen erneut überprüfen oder versuchen, an IPv6 zu senden.\n* Bei WLAN dauert es manchmal 20 Sekunden, bis die Multicast-Verbindung tatsächlich zustande kommt.\n* Der Paket-Sender hat keine Logik, um einer Mulitcast-Gruppe wieder beizutreten, wenn der Switch neu gestartet wird oder ein anderer üblicher Fehler auftritt.\n\nEs gibt keine IPv6-Multicast-Unterstützung, obwohl sie auf der Roadmap steht. Sponsoren, die IPv6-Multicast-Unterstützung wünschen, können sich gerne an mich wenden.\n\n<a id=\"udptraffic\"></a>\n\n## UDP-Verkehrsgenerator (experimentell)\n\nWenn das normale Sendesystem nicht ausreicht, können Sie eine Ziel-IP mit Paketen beschießen, um zu sehen, ob Ihr Gerät damit umgehen kann. Diese finden Sie in der GUI-Symbolleiste unter _Werkzeuge -> Intensiver Verkehrsgenerator_.\n\nBitte beachten Sie, dass diese Funktion experimentell ist und die angezeigten Metriken noch nicht vollständig getestet wurden. Für einen genaueren Test sollten Sie sich die CLI-Version dieses Werkzeugs ansehen.\n\n![IP-spezifische Bindung](screenshots/udp-traffic-sending.PNG)\n\n# Paket-Sender Merkmale\n\n\n<a id=\"cloud\"></a>\n## Paket-Sender-cloud\n\nPaketsätze können mit dem kostenlosen Dienst [Packet Sender Cloud] (https://cloud.packetsender.com/) schnell gespeichert/abgerufen/geteilt werden. Die Cloud kann auch verwendet werden, um Ihre Pakete öffentlich anzuzeigen und zu verteilen (über eine URL), für die Zusammenarbeit, für Tutorials, für Endbenutzer usw. Paketabsender können öffentliche Paketsätze mit öffentlicher URL importieren.\n\nHierfür gibt es verschiedene Gründe:\n\n* Halten Sie alle Ihre Pakete bereit, damit Sie sie bei der Installation eines neuen Paketsenders schnell abrufen können.\n* Schnelles Wechseln zwischen Paketsätzen bei der Arbeit an verschiedenen Projekten.\n* Gemeinsame Nutzung eines Logins (ist erlaubt) für die gemeinschaftliche Erstellung von Paketen\n* Eine öffentliche Seite mit Ihren Paketen, die andere schnell finden und importieren können\n\n![Paketsender Cloud importieren](screenshots/cloud-import.png)\n\nWenn Sie eine Netzwerk-API veröffentlichen, ist es wesentlich einfacher, eine öffentliche Cloud-Seite zu pflegen, als Ihren Nutzern die Pakete mühsam im Detail (IP, Port, Typ usw.) zu beschreiben. Außerdem ist es einfach, diese Seite zu aktualisieren.\n\nWeitere Informationen dazu finden Sie unter\nhttps://cloud.packetsender.com/help\n\n\n<a id=\"portable\"></a>\n## Tragbarer Modus\n\nPaket Sender hat einen \"tragbaren\" Modus. Beim Programmstart sucht es nach der Datei `portablemode.txt` und füllt alle fehlenden Einstellungsdateien in diesem Laufzeitverzeichnis auf. Diese Dateien sind `packets.ini`, `ps_settings.ini`, `ps.key`, und `ps.pem`.\nSie können auch einige Dateien portabel und die anderen an ihrem Standardspeicherort belassen, indem Sie portablemode.txt entfernen.\n\n### DDLs, die im portablen Modus (nur Konsole) entfernt werden können\nWenn Sie die grafische Benutzeroberfläche nicht benötigen, können Sie diese DDLs entfernen\n- Qt5Svg.dll\n- libEGL.dll\n- libGLESv2.dll\n- Qt5Widgets.dll\n- Qt5Gui.dll\n- opengl32sw.dll\n- D3Dcompiler_47.dll\n- iconengines-Verzeichnis\n- Verzeichnis der imageformats\n- Stilverzeichnis\n\n### DDLs, die entfernt werden können, wenn Sie keine sicheren Verbindungen benötigen\nWenn Sie kein SSL benötigen, können Sie diese DDLs entfernen\n- libcrypto-1_1-x64.dll\n- libssl-1_1-x64.dll\n\n\nDas Laufzeitverzeichnis für Windows-Benutzer ist derselbe Ort wie die .exe-Datei.\n\nFür MAC-Benutzer befindet sich dieses Laufzeitverzeichnis unter `PacketSender.app/Contents/MacOS`.\nWenn INI-Dateien gefunden werden, werden sie anstelle von `%APPDATEN%` oder `Bibliothek/Anwendungsunterstützung` verwendet.\n\n\n<a id=\"smartresponses\"></a>\n## Intelligente Antworten\n\nPaket Sender unterstützt bis zu 5 intelligente Antworten. \n\nUm diese Funktion zu aktivieren, wählen Sie _Datei -> Einstellungen_ in der GUI-Symbolleiste. Gehen Sie zur Registerkarte _Smart Responses_ und aktivieren Sie das Kontrollkästchen, **Senden Sie eine intelligente Antwort**.  \n\n![Paket Sender Direkt TCP](screenshots/packetsender_smartreply.PNG)\n\n* Paket Sender vergleicht das Paket mit der von Ihnen gewählten Kodierung.\n* Der Paketsender übersetzt die Kodierung, bevor er die Antwort sendet.\n* Die verfügbaren Kodierungen sind:\n  * Gemischtes ASCII - Die Standardmethode von Packet Sender, ASCII zusammen mit nicht druckbaren Zeichen zu kodieren\n  * HEX - normale HEX-Kodierung des Paketsenders\n\n\n## Makros\n\nPcket Sender unterstützt diese Makros beim Senden von Antworten:\n\n* {{DATE}} -- Sendet das aktuelle Datum im Format \"jjj-mm-tt\".\n* {{TIME}} -- Sendet die aktuelle Zeit im Format \"hh:mm:ss ap\".\n* {{UNIXTIME}} -- Sendet den aktuellen Epochenzeitstempel.\n* {{RANDOM}} -- Sendet eine Zufallszahl, die entweder von 0 bis 32767 oder 2147483647 reicht, je nach 32-Bit oder 64-Bit (das Standard-Installationsprogramm für Windows ist 32-Bit. Mac ist 64-bit).\n* {{UNIQUE}} -- Sendet eine zufällige Zeichenkette. Verwendet eine interne UUID, um sie zu erzeugen.\nDer Paketsender tauscht das Makro vor dem Senden mit echten Werten aus.\n\n\n<a id=\"persistent\"></a>\n## Persistentes TCP und SSL\n\nPaket Sender unterstützt dauerhafte TCP- und SSL-Verbindungen über ein separates GUI-Fenster. Sie wird über ein Kontrollkästchen im Hauptfenster oder über das Fenster Einstellungen aktiviert.\n\n![Paketsender Direkt TCP und SSL](screenshots/packetsender_direct_tcp.PNG)\n\n### Anmerkungen zu Persistente TCP und SSL:\n* Es können beliebig viele dauerhafte Verbindungen hergestellt werden.\n* Zuvor gespeicherte Pakete können in der Dropdown-Liste geladen werden.\n* Es gibt eine \"Raw\"-Ansicht und eine \"ASCII\"-Ansicht. Die ASCII-Ansicht ist nützlich für die Fehlersuche bei Daten, die von der Rohansicht nicht ausgegeben werden.\n* Der Verkehr wird auch im Verkehrs log des Hauptfensters gespeichert.\n* Eine Datei kann auf die dauerhafte Verbindung hochgeladen werden. Möglicherweise möchten Sie die Logging-Funktion deaktivieren, wenn Sie diese Funktion verwenden.\n* Der Timer unten links startet, sobald ein gültiges Datenpaket gesendet/empfangen wird. Sie endet, wenn die Verbindung beendet wird.\n* Sie können optional einen Wagenrücklauf anhängen, wenn Sie eine Schnellübertragung durchführen, indem Sie die Return-Taste drücken. Dies ist nützlich für Eingabeaufforderungsmenüs über TCP/SSL-Verbindungen. Paket Sender merkt sich den vorherigen Zustand des Kontrollkästchens \\r.\n* Bei eingehenden dauerhaften Verbindungen zum Server wird das separate GUI-Fenster geöffnet.\n* Beim erneuten Senden wird das dauerhafte Verbindungspaket in das neue GUI-Fenster übertragen. Wenn Sie auf \"Erneut senden(1)\" klicken, wird der Vorgang abgebrochen.\n\nDauerhafte Verbindungen werden nicht über die Befehlszeile unterstützt.\n\n\n<a id=\"http\"></a>\n# HTTP/HTTPS POST & GET\nPaket Sender unterstützt das Senden von POST/GET-Anfragen über HTTP und HTTPS. \nDas Dropdown-Menü Protokoll enthält die folgenden Optionen: HTTP GET, HTTP POST, HTTPS GET, HTTPS POST. Wenn Sie HTTP(S) auswählen, werden die Eingabefelder auf aktualisiert: Name, Anfrage, Adresse, Daten (wenn POST ausgewählt ist), Schaltfläche Daten generieren (wenn POST ausgewählt ist), Datei laden (wenn POST ausgewählt ist). \n\n## Senden von HTTP/HTTPS GET/POST-Anfragen\n![](/screenshots/ps_http_getfields.PNG)\n* Wählen Sie HTTP(S) GET oder POST aus dem Dropdown-Menü für das Protokoll\n* Geben Sie in das Feld *Adresse* die Domäne oder IP ein.\n* Im Feld *Anfrage* fügen Sie den URL-Pfad hinzu, falls erforderlich\n* Im Feld *Port* ist der Standardwert für HTTP 80 und für HTTPS 443.\n* Aktivieren Sie *Persistent TCP*, um die Serverdaten deutlicher zu sehen (HTTP-Header werden automatisch entfernt). \n\n**Sie können auch eine vollständige URL in das Anforderungsfeld einfügen, und Packet Sender analysiert und füllt die anderen Felder automatisch aus.**\n\n### Für POST-Anfragen:\n* Sie können die Daten manuell in das Feld *Daten* eintragen.\n\t* Das Format würde lauten: Schlüssel=Wert\n\t* Bei mehreren Parametern: key=value&key=value&key=value\n* Oder Sie können auf die Schaltfläche *Daten generieren* klicken.\n\n<img src=\"/screenshots/ps_http_datagenerator.PNG\" width=\"400\" height=\"284\">\n\n* Um Daten hinzuzufügen, geben Sie die Parameter Schlüssel und Wert ein. Klicken Sie auf die Schaltfläche **+**. \n* Mit der Schaltfläche \"+\" können Sie mehrere Parameter hinzufügen. \n* Parameter entfernen, indem Sie auf die Schaltfläche X neben dem Parameter klicken\n* Sobald Sie die Parameter hinzugefügt haben, klicken Sie auf Ok und die Daten werden im Feld Daten generiert. \n\n### Um Authentifizierungsdaten hinzuzufügen:\n\n<img src=\"/screenshots/ps_http_authgenerator.PNG\" width=\"800\" height=\"339\">\n\n* Gehen Sie zu Datei -> Einstellungen -> HTTP\n* Markieren Sie *Auth Header generieren*.\n* Eingabe von *Host*, *UN/Client ID* und *PW/Access*.\n* Klicken Sie auf *HTTP Auth Header*, um den Authentifizierungs-Header zu generieren\n\n<a id=\"panelgen\"></a>\n# Panel Generator\nPaket Sender unterstützt die Erstellung von Bedienfeldern. Felder bestehen aus Schaltflächen, denen Skripte (Pakete) zugewiesen sind. Wenn Sie auf die Schaltfläche klicken, werden die Pakete, auf die die Schaltfläche verweist, ausgeführt. \n\n<img src=\"/screenshots/ps_panel_1.PNG\" width=\"400\" height=\"358\">\n\n## Laden eines Panels\nPanels können auf zwei Arten erstellt werden:\n* Klicken Sie auf **Panels** in der Symbolleiste und wählen Sie entweder Starterpanel laden oder Leeres Panel-Projekt\n\t* Starter-Panel laden lädt das als Starter zugewiesene Panel. Wenn kein Panel als Startpunkt festgelegt ist, wird ein leeres Panel-Projekt geöffnet. \n* Markieren von 2 oder mehr gespeicherten Paketen und Klicken auf die Schaltfläche **Panel generieren** (Die Schaltfläche \"Panel generieren\" erscheint nur, wenn mehrere Pakete markiert sind) \n\nPacket Sender unterstützt das Starten im Nur-Panel-Modus mit dem Starter-Panel unter Verwendung der Befehlszeilenoption `--starterpanel`.\n\n\n![](/screenshots/ps_panel_generate.PNG)\n\n\n## Skripting eines Panels\nUm mit der Skripterstellung für die Schaltflächen auf Ihrem Bedienfeld zu beginnen, müssen Sie ein Bedienfeld öffnen und zum Bearbeitungsbildschirm wechseln. Sobald ein Panel-Projekt geöffnet ist, prüfen Sie die Schaltfläche in der unteren rechten Ecke. Wenn auf dieser Schaltfläche \"Betrachten\" steht, befinden Sie sich auf dem Bildschirm \"Betrachten\". Klicken Sie auf die Schaltfläche, um das Panel in den Bearbeitungsbildschirm zu verschieben. \n\nAuf dem Bearbeitungsbildschirm können Schaltflächen und Skripte zum Bedienfeld hinzugefügt werden. \n\n### Schaltfläche Scripting\nDie Schaltflächenskripte enthalten den Namen des zu sendenden Pakets. \n\n<img src=\"/screenshots/ps_panel_2.PNG\" width=\"400\" height=\"360\">\n\nMehrere Pakete können auf eine Schaltfläche gelegt werden, indem jeder Name in eine neue Zeile eingefügt wird.\n\n<img src=\"/screenshots/ps_panel_5.PNG\" width=\"400\" height=\"358\">\n\nDer Panel Generator unterstützt das Hinzufügen einer Verzögerung zwischen mehreren Paketen durch das Hinzufügen von \"delay:_# of seconds_\" zwischen den Paketen.\n\n<img src=\"/screenshots/ps_panel_4.PNG\" width=\"400\" height=\"359\">\n\nPanel Generator unterstützt das Hinzufügen eines Skripts zum Laden eines neuen Panels durch Hinzufügen von \"panel:_panel id #_\". Sobald alle vorherigen Skripte auf der Schaltfläche ausgeführt wurden, wechselt das Panel zum nächsten Panel. \n\n<img src=\"/screenshots/ps_panel_8.PNG\" width=\"400\" height=\"358\">\n\n\n### Hinzufügen von Dateien/URLs\nPanel Generator unterstützt das Hinzufügen von Schaltflächen, die auf lokal gespeicherte Dateien oder URLs verweisen. \nDatei-/URL-Schaltflächen können im Bearbeitungsbildschirm durch Klicken auf das *+* in der unteren rechten Ecke hinzugefügt werden. \n* Für Dateien: Gehen Sie zu der Datei auf dem PC, klicken Sie mit der rechten Maustaste auf die Datei und wählen Sie Kopieren. Fügen Sie dies in das Textfeld _URL oder Datei_ in Packet Sender ein\n* Für URLs: Kopieren Sie die URL in das Textfeld _URL oder Datei_ in Packet Sender\n\t* URLs müssen mit http:// oder https:// beginnen.\n\n\n![](/screenshots/ps_panel_7.PNG) \n\nSobald die Datei oder URL kopiert ist, werden Sie aufgefordert, einen Namen für die Schaltfläche einzugeben. Die Schaltflächen werden am unteren Rand des Fensters eingeblendet. \n\nWenn Sie auf dem Bearbeitungsbildschirm auf diese Schaltflächen klicken, können Sie den Datei-/URL-Link und den Namen der Schaltfläche bearbeiten. Sie können die Schaltfläche auch löschen, indem Sie auf das **X** im Popup-Fenster klicken. \n\n![](/screenshots/ps_http_changeURL.PNG)\n\nWenn Sie auf dem Ansichtsbildschirm auf diese Schaltflächen klicken, wird die URL im Standardbrowser aufgerufen oder die Datei geöffnet (mit dem Standardprogramm für den Dateityp). \n\n\n![](/screenshots/ps_panel_6.PNG) \n\n### Panel Bearbeiten/Speichern\nWenn Sie sich im Bearbeitungsbildschirm eines Panels befinden, gibt es eine Symbolleiste mit den Menüs Datei, exportieren, Einstellungen und Hilfe. Von dieser Symbolleiste aus können Sie Panel-Projekte speichern, exportieren, importieren, laden und das aktuelle Panel-Projekt bearbeiten. \n\nIn den Einstellungen können Sie Folgendes tun:\n* Panel-Name festlegen - wählen Sie diese Option, um das aktuelle Panel-Projekt umzubenennen.\n* Panel-ID festlegen - wählen Sie diese Option, um die mit dem aktuellen Panel-Projekt verbundene ID zu ändern.\n_Anmerkung: Das Einstellen einer verwendeten ID ersetzt dieses Panel_\n* Starterpanel - wählen Sie diese Option, um das aktuelle Panelprojekt als Starterpanel festzulegen. \n* Panel löschen - Damit wird ein Menü mit den aktuellen Panel-Projekten angezeigt. Wählen Sie ein Panel-Projekt aus, um es zu löschen. Hinweis: Die Schaltflächen und Skripte bleiben auf dem Bearbeitungsbildschirm erhalten, bis das Panel geschlossen wird.\n\n\n\n<a id=\"cli\"></a>\n# Kommandozeile\nPaket Sender kann über die Befehlszeile auf Ihrem Computer verwendet werden. \n\nFür Windows verwenden Sie die Erweiterung .com (`packetsender.com`), um die Befehlszeilenschnittstelle zu verwenden. Optional können Sie auch `Paketsender` ohne Erweiterung verwenden. Mit der Endung .exe wird die GUI gestartet. \n\n\n![Paket Sender CLI Bildschirmfoto](screenshots/packetsender_command_line.png)\n\nFür Linux folgt das Kommandozeilensystem in Packet Sender demselben Muster wie andere Linux-Dienstprogramme. Sie hat einen langen Namen (z. B. --version) und einen kurzen Namen (z. B. -v). Diese Optionen können in beliebiger Reihenfolge angeordnet werden und werden von Packet Sender korrekt ausgewertet. Die letzten 3 Optionen sind positionsabhängig und müssen als letztes erscheinen. Diese sind IP, Port und Daten. Diese letzten Optionen sind optional, wenn ein gespeichertes Paket verwendet wird.\n\n```text\npaket sender --help\nPaket Sender ist ein Netzwerk-UDP/TCP/SSL/HTTP-Testdienstprogramm von NagleCode\nSiehe https://PacketSender.com/ für weitere Informationen.\n\nOptionen:\n  -?, -h, --help Zeigt die Hilfe zu den Befehlszeilenoptionen an.\n  --help-all Zeigt die Hilfe einschließlich Qt-spezifischer Optionen an.\n  -v, --version Zeigt Versionsinformationen an.\n  -q, --quiet Leiser Modus. Nur empfangene Daten ausgeben.\n  -x, --hex Zu sendende Daten als Hexadezimalwert parsen (Standard für\n                            TCP/UDP/SSL).\n  -a, --ascii Parsen der zu sendenden Daten als gemischtes ASCII (Standard für http\n                            und GUI).\n  -A, --ASCII Parsen der zu sendenden Daten als reine ASCII-Daten (keine \\xx)\n                            Übersetzung).\n  -w, --wait <ms> Warten Sie bis zu <Millisekunden> auf eine Antwort nach\n                            senden. Null bedeutet, dass nicht gewartet werden soll (Standard).\n  -f, --file <Pfad> Den Inhalt des angegebenen Pfades senden. Maximal 10 MiB für\n                            UDP, 100 MiB für TCP/SSL.\n  -b, --bind <Port> Port binden. Standardwert ist 0 (dynamisch).\n  -6, --ipv6 Erzwingt IPv6. Dasselbe wie -B \"::\". Standard ist IP:Any.\n  -4, --ipv4 Erzwingt IPv4.  Dasselbe wie -B \"0.0.0.0\". Standard ist\n                            IP:Beliebig.\n  -B, --bindip <IP> Benutzerdefinierte IP binden. Standard ist IP:Any.\n  -t, --tcp TCP senden (Standard).\n  -s, --ssl SSL senden und Fehler ignorieren.\n  -S, --SSL SSL senden und bei Fehlern anhalten.\n  -u, --udp UDP senden.\n  --http <http> HTTP senden. Erlaubte Werte sind GET (Standard) und\n                            POST\n  -n, --name <name> Ein zuvor gespeichertes Paket mit dem Namen <name> senden. Andere\n                            setzt gespeicherte Paketparameter außer Kraft.\n  --bps <bps> Intensiver Verkehr. Berechnen Sie den Satz auf der Grundlage des Wertes von\n                            Bits pro Sekunde.\n  --num <Nummer> Intensiver Verkehr. Anzahl der zu sendenden Pakete. Standard\n                            unbegrenzt.\n  --rate <Hertz> Intensiver Verkehr. Bewerten. Die Option in bps wird ignoriert.\n  --usdelay <microseconds> Intensiver Verkehr. Verzögerung beim erneuten Senden. Wird verwendet, wenn die Rate 0 ist.\n                            Die Option in bps wird ignoriert.\n\nArgumente:\n  Adresse Zieladresse/URL. Fakultativ für gespeicherte Pakete.\n  port Zielhafen/POST-Daten. Fakultativ für gespeicherte\n                            Päckchen.\n  daten Zu sendende Daten. Fakultativ für gespeicherte Pakete.\n```\n## Beispiel CLI\nDie Befehlszeilenschnittstelle hat unter Windows, Linux und MAC das gleiche Format. \n\nDas Format ist: `Paketsender [Optionen] Adresse Port Daten`\n\n```text\npacketsender -taw 500 mirrors.xmission.com 21 \"USER anonymous\\r\\nPASS chrome@example.com\\r\\n\"\nTCP (65505)://mirrors.xmission.com:21 55 53 45 52 20 61 6e 6f 6e 79 6d 6f 75 73 0d 0a 50 41 53 53 20 63 68 72 6f 6d 65 40 65 78 61 6d 70 6c 65 2e 63 6f 6d 0d 0a\nAntwortzeit:5:51:37.042 pm\nAntwort HEX:32 32 30 2D 57 65 6C 63 6F 6D 65 20...\nAntwort ASCII:220-Willkommen bei XMission Internet...\n```\n\n## Beispiele für die Bindung an Port und benutzerdefinierte IP, IPv4 oder IPv6\n\nDie Kommandozeile von Packet Sender kann an benutzerdefinierte Ports gebunden werden, um IPv4/6-Modi oder mehrere NICs mit der Option -B zu erzwingen.\n```text\npacketsender -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\npacketsender -taw 3000 192.168.0.201 5005 \"Hello\\r\"\npacketsender -B 192.168.0.200 -taw 3000 192.168.0.201 5005 \"Hello\\r\"\npacketsender -B fe80::a437:399a:3091:266a%ethernet_32769 -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\npacketsender -B fe80::a437:399a:3091:266a -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\n```\n\n## Beispiel CLI mit SSL und Ignorieren von Fehlern\n\nDie Befehlszeile bietet die Möglichkeit, SSL-Fehler zu ignorieren oder abzubrechen. Die Standardeinstellung ist \"ignorieren\".\n\n* Verwenden Sie die Option -s, um SSL zu senden und Fehler zu ignorieren.\n* Option -S verwenden, um SSL zu senden und bei Fehlern anzuhalten\n\n```text\npacketsender -saw 500 expired.packetsender.com 443 \"GET / HTTP/1.0\\r\\n\\r\\n\"\nSSL-Fehler: Das Zertifikat ist abgelaufen\nSSL (54202)://expired.packetsender.com:443 47 45 54 20 2f 20 48 54 54 50 2f 31 2e 30 0d 0a 0d 0a\nChiffre: Verschlüsselt mit AES(128)\n\nAntwortzeit:3:24:55.695 pm\nAntwort HEX:48 54 54 50 2f 31 2e 31 20 34 32 31 20 0d 0a 53 65 72 76 65 72 3a 20 6e 67 69 6e 78 2f 31 2e 31 30 2e 30 20 28 55 62 75 6e 74 75 29 0d\nAntwort ASCII:HTTP/1.1 421 \\r\\nServer: nginx/1.10.0 (Ubuntu)\\r\n```\n\n## Beispiel CLI mit HTTP\nBeachten Sie, dass dabei die eingebauten Standardpakete verwendet werden.\n```text\npacketsender --name \"HTTPS POST Params\"\npacketsender --http GET \"https://httpbin.org/get\"\npacketsender --http POST \"https://httpbin.org/post\" \"{}\"\n```\n\n\n\n<a id=\"cliintensetraffic\"></a>\n\n## Beispiel mit CLI Intensiver Verkehrsgenerator\nDer befehlsintensive Verkehrsgenerator funktioniert ähnlich wie die GUI-Version, ist aber etwas genauer und bietet mehr Steuerungsmöglichkeiten (und mehr Intensität!).\n\nIm Folgenden finden Sie Beispiele für die Verwendung dieser Funktion. Beachten Sie, dass diese Berechnungen nach bestem Wissen und Gewissen erfolgen. Das funktioniert ganz gut, aber Prozessorspitzen oder verschiedene Netzwerkprobleme können das System stören. Die Einfädelung erfolgt nicht in Echtzeit und ist auch nicht besonders intelligent in ihren Kompensationsversuchen.\n\n* erneut senden \"Mein Wahnsinns-Paket\" mit einer Rate von 20 Hz \n* erneut senden \"Mein Wahnsinns-Paket\" erneut mit 2000 Baud pro Sekunde\n* erneut senden \"Mein Wahnsinns-Paket\" so schnell wie möglich zurück\n* erneut senden \"Mein Wahnsinns-Paket\" mit 2000000 Mikrosekunden Verzögerung zwischen den einzelnen Paketen erneut senden\n\n**Anmerkung: Für Windows verwenden Sie die \".com\"-Erstellung, d. h. jedes Beispiel wäre packetsender.com**\n\n```text\npacketsender --rate 20 --name \"Mein Wahnsinns-Paket\"\npacketsender --bps 2000 --name \"Mein Wahnsinns-Paket\"\npacketsender --rate 0 --name \"Mein Wahnsinns-Paket\"\npacketsender --usdelay 2000000 --name \"Mein Wahnsinns-Paket\"\n```\n\n\n<a id=\"building\"></a>\n# Gebäude Paket Sender\nDie einzige Abhängigkeit ist Qt SDK\n\n## Paketsender für Windows/MAC erstellen\n1. Laden Sie das Qt-Installationsprogramm von http://www.qt.io/download-open-source/ herunter.\n1. Lassen Sie MingGW installieren, wenn Sie keinen Compiler haben.\n1. Öffnen Sie das Projekt PacketSender.pro\n1. Bauen! \n\nDie Windows- und Mac-Versionen wurden mit Qt 5.12 erstellt. Paket Sender unterstützt zwar Qt 6, aber nicht\ncmake unterstützen.\n\n## Paket Sender für Linux erstellen\nHier ist die Reihenfolge der Befehle für Ubuntu 16.04. Bitte passen Sie es an Ihre Linux-Plattform an. Paket Sender benötigt keine zusätzlichen Bibliotheken neben dem Qt SDK. Mir wurde gesagt, dass es Probleme bei der Erstellung der Fedora-Version gibt. Wenn ein Fedora-Experte einen Einblick hat, lassen Sie es mich bitte wissen, und ich werde Ihre Anweisungen hinzufügen.\n\nWenn Sie abenteuerlustig sind, können Sie auch aus dem Master-Zweig bauen. Sie enthält die neueste stabile Version. Der Entwicklungszweig sollte wahrscheinlich vermieden werden.\n\n```bash\nsudo apt-get update\nsudo apt-get install qt5-default build-essential\nwget https://github.com/dannagle/PacketSender/archive/(Version).tar.gz\ntar -xzvf (Version).tar.gz\ncd PacketSender-(Version)/src\nqmake PacketSender.pro\nmake\n```\n\nZum Ausführen verwenden:\n```text\n./PacketSender\n```\n\nWenn es nicht ausgeführt wird, müssen Sie es möglicherweise als ausführbar festlegen\n```text\nchmod a+x PacketSender\n```\n\n\n# Verbesserungen/Forderungen\n\nVermissen Sie eine Funktion? Sie können [mich beauftragen, es zu Paket Sender hinzuzufügen] (https://packetsender.com/enhancements).\n\n# Rechtliches / Compliance\n\nDie Lizenz ist GPL v2 oder später. [Kontaktieren Sie mich](https://packetsender.com/contact), wenn Sie eine andere Lizenz benötigen.\nEinige Distributionen von Paket Sender verwenden möglicherweise [OpenSSL](https://www.openssl.org/).\nDie aktuellste VPAT [finden Sie](vpat_2.4_packetsender.pdf) in diesem Repo.\n\n\n# Urheberrecht\n\nPaket Sender wurde von [Dan Nagle](https://dannagle.com/) geschrieben und wird veröffentlicht von &copy; NagleCode, LLC - [@NagleCode](https://twitter.com/NagleCode) - [PacketSender.com](https://packetsender.com)\n"
        },
        {
          "name": "README.es.md",
          "type": "blob",
          "size": 33.2578125,
          "content": "# Introducción\r\n\r\n![Logotipo de Packet Sender](screenshots/packetsender_banner.png)\r\n\r\n*Lea esto en otros idiomas: [English](README.md), [Español](README.es.md), [Deutsch](README.de.md), [Français](README.fr.md).*\r\n\r\n\r\n[![Descargas](https://img.shields.io/github/downloads/dannagle/PacketSender/total.svg)](https://packetsender.com/download)\r\n\r\nPacket Sender es una utilidad de código abierto que permite enviar y recibir paquetes TCP, UDP y SSL (TCP encriptado), así como peticiones HTTP/HTTPS y generación de paneles. La rama mainline soporta oficialmente Windows, Mac y Linux de escritorio (con Qt). Otros lugares pueden recompilar y redistribuir Packet Sender. Packet Sender es gratuito y tiene licencia GPL v2 o posterior. Puede utilizarse tanto para uso comercial como personal. Si encuentra útil la aplicación, por favor considere donar/patrocinar para que el desarrollo pueda continuar.\r\n\r\n\r\n\r\n# Índice\r\n* [Patrocinadores](#sponsors)\r\n  * Visite [IWL.com](https://www.iwl.com/)\r\n  * Visite [NagleCode.com](https://dannagle.com/)\r\n\r\n* [Interfaz de Usuario](#gui)\r\n* [Generador de tráfico intenso (GUI)](#udptraffic)\r\n* [Red](#network)\r\n* [Descargas](#downloads)\r\n* [Soporte](#support)\r\n* [Calculadora de Subredes IPv4](#subnetcalculator)\r\n* [Packet Sender en la Nube](#cloud)\r\n* [Modo portátil](#portable)\r\n* [Macros y respuestas inteligentes](#smartresponses)\r\n* [TCP y SSL persistentes](#persistent)\r\n* [Solicitudes HTTP/HTTPS](#http)\r\n* [Generador de paneles](#panelgen)\r\n* [Interfaz de línea de comandos](#cli)\r\n* [Generador de tráfico intenso (CLI)](#cliintensetraffic)\r\n* [Generador de paquetes](#building)\r\n\r\n\r\n\r\n\r\n<a id=\"sponsors\"></a>\r\n## Patrocinadores\r\n\r\nPacket Sender quiere dar las gracias a los siguientes patrocinadores.\r\n\r\n[![IWL](screenshots/iwl_logo.png)](https://www.iwl.com/)\r\n<br>IWL es una empresa californiana que crea productos para redes informáticas.\r\n<br><br><br>\r\n\r\n[![NagleCode](screenshots/naglecode-logo400.png)](https://dannagle.com)\r\n<br>NagleCode es un editor de software y estudio de desarrollo. \r\n<br><br><br>\r\n\r\n\r\n[¿Desea que su nombre/logo aparezca aquí?](https://github.com/sponsors/dannagle)\r\n\r\n\r\n\r\n<a id=\"support\"></a>\r\n## Soporte\r\n\r\n* Twitter: [@NagleCode](http://twitter.com/NagleCode)\r\n* Los foros están en: [Discusiones en GitHub](https://github.com/dannagle/PacketSender/discussions).\r\n* Correo electrónico: [Contacto de Packet Sender](https://packetsender.com/contact)\r\n* Contácteme en [LinkedIn](https://www.linkedin.com/in/dannagle/)\r\n\r\n*NOTA:* Pruebe a desactivar (temporalmente) su cortafuegos si tiene problemas en Windows.\r\n\r\n<a id=\"downloads\"></a>\r\n# Descargas\r\n\r\n## Descarga de Escritorio\r\nLas versiones oficiales de Packet Sender pueden descargarse en [PacketSender.com](http://packetsender.com/download). Algunos sitios redistribuyen Packet Sender.\r\n\r\n![Logo de Windows](screenshots/winlogo150.png) ![Logo de Mac](screenshots/maclogo150.png) ![Logo de Linux](screenshots/Tux150.png)\r\n\r\n\r\n<!--\r\nNo estoy seguro de cuándo volverá esto.\r\n\r\n## Aplicaciones móviles\r\nLas ediciones móviles de Packet Sender son totalmente nativas, contienen los permisos mínimos y no recopilan datos. Este es un software que le respeta. Gracias por apoyar este esfuerzo.\r\n\r\n\r\n### Aplicación Móvil para Android\r\n![Logotipo de Android](screenshots/android_logo.png)\r\n\r\nLa versión para Android se encuentra [en Google Play](https://play.google.com/store/apps/details?id=com.packetsender.compose) o [en Amazon Appstore](https://www.amazon.com/dp/B08RXM6KM2/)\r\n\r\n[![Packet Sender para Android](screenshots/packetsender_android_screenshot.png)](https://play.google.com/store/apps/details?id=com.packetsender.compose\r\n\r\n-->\r\n\r\n\r\n<!--\r\nNo estoy seguro de cuándo estará de vuelta.\r\n\r\n## Aplicación móvil para iOS\r\n\r\nLogotipo de Packet Sender](screenshots/ios_logo.png)\r\n\r\nLa versión iOS se encuentra [en la Apple App Store](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n[![Packet Sender para iOS](screenshots/packetsender-ios-traffic-log-ascii.png)](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n-->\r\n<a id=\"gui\"></a>\r\n# INTERFAZ DE USUARIO \r\n\r\nPacket Sender es idéntico para todas las versiones de escritorio. La única diferencia es su diseño para que coincida con el sistema operativo.\r\n\r\n![Captura de pantalla de Packet Sender](screenshots/ps_GUI.png)\r\n\r\n1. Un paquete tiene asociado un nombre, una dirección de destino (los nombres de dominio se resuelven por defecto justo antes del envío), un puerto y datos.\r\n2. En la tabla, hay una lista de los paquetes guardados. Puede hacer doble clic para editar directamente los campos de esta tabla.\r\n3. En la parte inferior derecha, aparecen los estados y puertos de los servidores UDP, TCP y SSL. Haciendo clic sobre ellos activará o desactivará el protocolo. Packet Sender admite la vinculación a cualquier número de puertos.\r\n4. También hay un botón de alternancia IP. Al hacer clic en él se cambia a IPv4 (por defecto), IPv6 o IP personalizada.\r\n\r\n### Notas generales\r\n* Un valor de reenvío de \"0\" significa que es un paquete de un solo envío.\r\n* Durante el reenvío de paquetes, habrá un botón para cancelar todos los reenvíos.\r\n* Por favor, compruebe su cortafuegos. Windows bloquea agresivamente los servidores basados en TCP. Packet Sender seguirá funcionando si el cortafuegos lo bloquea, pero no podrá recibir paquetes no solicitados basados en TCP.\r\n* Se puede enviar una respuesta opcional. Se utiliza la misma respuesta para TCP, UDP y SSL.\r\n* Para el envío IPv6, también necesitará el ID de ámbito.\r\n* Packet Sender admite notación mixta ASCII y HEX:\r\n  * Haga doble clic en cualquiera de los campos para que aparezca el editor multilínea.\r\n  * \\XX se traduce a XX en hexadecimal\r\n  * \\n, \\r, \\t se traducirán a 0A, 0D y 09\r\n  * Los números HEX están delimitados por espacios\r\n    * El campo HEX intentará interpretar otros delimitadores comunes (como comas, dos puntos (Wireshark), punto y coma, \" 0x\", etc) y autocorregirse. Es muy tolerante a fallos.\r\n    * También admite un único flujo HEX. Si el número de bytes es impar, Packet Sender asumirá que el byte frontal necesita un cero y entonces auto-corregirá.\r\n  * Ejemplo ASCII: hola mundo\\r\r\n  * Ejemplo HEX: 68 65 6c 6c 6f 20 77 6f 72 6c 64 0d\r\n  * Puede guardar un paquete directamente desde el registro de tráfico. Se le pedirá un nombre, y la dirección de origen y el puerto se cambiarán para su comodidad.\r\n  * También puede cargar un archivo directamente en el campo HEX. El campo HEX admite el envío de hasta 10.922 bytes. El límite teórico para el envío a través de la línea de comandos es de 200 MB.\r\n\r\n\r\n## Teclas de acceso rápido/accesos directos del teclado\r\n\r\nPuede navegar por los campos de la parte superior utilizando CTRL+1, CTRL+2, etc, hasta CTRL+8 (botón de envío). En Mac, la tecla de acceso directo es Comando.\r\n\r\nLas teclas de acceso directo y los campos son:\r\n* CTRL + 1 = Nombre\r\n* CTRL + 2 = ASCII\r\n* CTRL + 3 = HEXADECIMAL\r\n* CTRL + 4 = Dirección\r\n* CTRL + 5 = Puerto\r\n* CTRL + 6 = Retardo de reenvío\r\n* CTRL + 7 = Selección de protocolo\r\n* CTRL + 8 = Enviar (ejecuta)\r\n\r\n\r\nAlgunas notas:\r\n* Los campos están vinculados a la tecla de acceso directo correspondiente independientemente de la selección de protocolo.\r\n* Cuando navegue a la opción TCP/UDP/SSL, puede utilizar los caracteres arriba/abajo o t/u/s/h para realizar una selección.\r\n* Si va a automatizar con teclas de acceso rápido (utilizando herramientas como [AutoHotKey](https://www.autohotkey.com/)), puede que desee desactivar \"Restaurar sesión anterior\".\r\n\r\n\r\n\r\n<a id=\"network\"></a>\r\n# Funciones de red\r\n\r\n## IPv4, IPv6, IP personalizada\r\n\r\nLos servidores incorporados de Packet Sender están configurados para soportar IPv4 o IPv6 pero no ambos al mismo tiempo. Para los clientes, la GUI y CLI de Packet Sender cambiarán sin problemas entre los dos modos en el momento del envío (el scope ID puede ser necesario para IPv6). Pulse el switch IPv4 / IPv6 en la parte inferior derecha para cambiar entre los dos.\r\n\r\nDentro de la configuración, también puede forzar a los servidores de Packet Sender a enlazarse a una dirección IP personalizada. Esto puede ser muy útil para sistemas con múltiples NICs o configuraciones IP complicadas. Packet Sender provocará un error si se le indica que se vincule a una dirección que no existe.\r\n\r\n![Enlace específico de IP](screenshots/ip-specific-binding.png)\r\n\r\n\r\n<a id=\"subnetcalculator\"></a>\r\n## Calculadora de subredes IPv4\r\n\r\nPacket Sender tiene una calculadora de subredes incorporada. Se encuentra en el menú Herramientas.\r\n![Calculadora de Subredes de Packet Sender](screenshots/packetsender_subnetcalc.PNG)\r\n\r\n* La ventana de registro (sección inferior) mostrará las direcciones IPv4 e IPv6 sin loopback encontradas en su ordenador.\r\n* En el lado izquierdo, introduzca la dirección IPv4 en el campo IP. \r\n* En el lado izquierdo, introduzca la subred en notación X.X.X. o /XX.\r\n* Los resultados del cálculo aparecen a la derecha.\r\n* El campo de abajo es una comprobación rápida para ver si una IPv4 está dentro de una de sus subredes.\r\n\r\n## Cliente y servidor SSL\r\n\r\nPacket Sender soporta el establecimiento de conexiones encriptadas sobre SSL.\r\nEsto es soportado en la GUI y en la línea de comandos.\r\n\r\nPacket Sender incluye OpenSSL para su uso en Windows. En Mac y Linux, Packet Sender utilizará las librerías SSL nativas.\r\n\r\n_Este producto incluye software desarrollado por el Proyecto OpenSSL para su uso en el OpenSSL Toolkit. (http://www.openssl.org/)_\r\n\r\n![Direct TCL de Packet Sender](screenshots/packetsender_ssl.PNG)\r\n\r\nNotas sobre SSL:\r\n* La negociación del certificado se gestiona inmediatamente durante la conexión.\r\n* Por defecto, Packet Sender ignora todos los errores SSL (cert caducado, nombre de host incorrecto, autofirmado, etc).\r\n* Packet Sender muestra el progreso de la negociación del certificado en el registro de tráfico.\r\n* Packet Sender emite el algoritmo de encriptación utilizado en el registro de tráfico (como AES 128).\r\n\r\nPacket Sender incluye un certificado interno \"Snake Oil\" para su uso como servidor para Windows. El certificado y la clave se encuentran en el mismo lugar que el paquete y la configuración.\r\n\r\n_Nota: Anular las ubicaciones del certitifcado en Ajustes también anula el certificado Snake-Oil._\r\n\r\nSi se produce un error SSL, Packet Sender lo mostrará en el registro de tráfico. Si la configuración es continuar de todas formas (por defecto), continuará negociando la encriptación. En caso contrario, la conexión finalizará con un fallo de conexión.\r\n\r\n![Packet Sender Direct TCP Expired](screenshots/packetsender_expired_ssl.png)\r\n\r\n## Multidifusión (Experimental)\r\n\r\nEl soporte multidifusión de Packet Sender se activa al intentar enviar a una dirección multidifusión IPv4 o desde el submenú multidifusión. La característica es actualmente experimental y tiene estos problemas conocidos.\r\n\r\n* Packet Sender abandona el soporte IPv6 cuando se une a una multidifusión.\r\n* Y permanece abandonado hasta que se revisa la configuración o intenta rrealizar un envío a IPv6\r\n* En wifi, a veces tarda 20 segundos para que la unión a multidifusión surta efecto.\r\n* Paclket Sender no tiene lógica para volver a unirse a un grupo multidifusión si el router se reinicia o se produce algún otro error común.\r\n\r\nNo hay soporte para multidifusión IPv6, aunque está en la hoja de ruta. Los patrocinadores que deseen soporte para multidifusión IPv6 pueden contactarme.\r\n\r\n<a id=\"udptraffic\"></a>\r\n\r\n## Generador de tráfico UDP (Experimental)\r\n\r\nPara cuando el sistema de envío normal no es suficiente, puede martillear una IP objetivo con paquetes para ver si su dispositivo puede manejarlo. Puede encontrarlo en la barra de herramientas de la GUI en _Herramientas -> Generador de tráfico intenso_.\r\n\r\nTenga en cuenta que esta función es experimental y que las métricas mostradas no se han probado completamente. Para una prueba más precisa, puede que desee consultar la versión CLI de esta herramienta.\r\n\r\n![Enlace específico IP](screenshots/udp-traffic-sending.PNG)\r\n\r\n# Características del Packet Sender\r\n\r\n\r\n<a id=\"cloud\"></a>\r\n## Nube del Packet Sender\r\n\r\nLos conjuntos de paquetes pueden guardarse/recuperarse/compartirse rápidamente utilizando el servicio gratuito [Packet Sender Cloud](https://cloud.packetsender.com/). La nube también puede utilizarse para mostrar y distribuir públicamente sus paquetes (a través de una URL) para colaboración, tutoriales, usuarios finales, etc. Packet Sender puede importar conjuntos de paquetes públicos con una URL pública.\r\n\r\nHay varias razones para hacer esto:\r\n\r\n* Mantener todos sus paquetes listos para poder recuperarlos rápidamente al instalar un Packet Sender nuevo.\r\n* Intercambiar rápidamente entre conjuntos de paquetes cuando trabaje en diferentes proyectos.\r\n* Compartir un inicio de sesión (está permitido) para la generación colaborativa de conjuntos de paquetes.\r\n* Tener una página pública de sus conjuntos de paquetes para que otros puedan encontrarlos e importarlos rápidamente\r\n\r\n![Importación en la nube de Packet Sender](screenshots/cloud-import.png)\r\n\r\nSi está publicando una API de red, mantener una página pública de la nube es significativamente más fácil que detallar penosamente (IP, puerto, tipo, etc.) los paquetes a sus usuarios. Además, actualizar esa página es fácil.\r\n\r\nEncontrará más información al respecto en\r\nhttps://cloud.packetsender.com/help\r\n\r\n\r\n<a id=\"portable\"></a>\r\n## Modo portátil\r\n\r\nPacket Sender tiene un modo \"portable\". Al iniciarse, buscará `portablemode.txt` y rellenará los archivos de configuración que falten en ese directorio de ejecución. Estos archivos son `packets.ini`, `ps_settings.ini`, `ps.key`, y `ps.pem`.\r\nTambién puede tener algunos archivos portables y los demás en su ubicación estándar eliminando portablemode.txt.\r\n\r\n### DDLs que pueden eliminarse en Modo portable sólo por consola\r\nSi no necesita la GUI, puede eliminar estos DDLs\r\n- Qt5Svg.dll\r\n- libEGL.dll\r\n- libGLESv2.dll\r\n- Qt5Widgets.dll\r\n- Qt5Gui.dll\r\n- opengl32sw.dll\r\n- D3Dcompiler_47.dll\r\n- directorio iconengines\r\n- directorio imageformats\r\n- directorio styles\r\n\r\n### DDLs que pueden eliminarse si no necesita conexiones seguras\r\nSi no necesita SSL, puede eliminar estas DDL\r\n- libcrypto-1_1-x64.dll\r\n- libssl-1_1-x64.dll\r\n\r\n\r\nEl directorio de tiempo de ejecución usuarios de Windows es el mismo lugar que el .exe.\r\n\r\nPara los usuarios de MAC, este directorio de tiempo de ejecución está en `PacketSender.app/Contents/MacOS`.\r\nSi se encuentran archivos INI, los utilizará en lugar de `%APPDATA%` o `Library/Application Support`.\r\n\r\n\r\n<a id=\"smartresponses\"></a>\r\n## Respuestas inteligentes\r\n\r\nPacket Sender soporta hasta 5 respuestas inteligentes. \r\n\r\nPara activar esta función, vaya a _Archivo -> Configuración_ en la barra de herramientas de la GUI. Vaya a la pestaña _Respuestas inteligentes_ y active la casilla **Enviar una respuesta inteligente**.  \r\n\r\n![Packet Sender - TCP Directo](screenshots/packetsender_smartreply.PNG)\r\n\r\n* Packet Sender comparará el paquete dentro de la codificación que usted elija.\r\n* Packet Sender traduce la codificación antes de enviar la respuesta.\r\n* Las codificaciones disponibles son:\r\n  * ASCII mixto -- La forma estándar de Packet Sender de codificar ASCII junto con caracteres no imprimibles.\r\n  * HEX -- La codificación HEX normal de Packet Sender\r\n\r\n\r\n## Macros\r\n\r\nPacket Sender soporta estas macros cuando envía respuestas:\r\n\r\n* {{DATE}} -- Envía la fecha actual en formato \"aaa-mm-dd\".\r\n* {{TIME}} -- ENVÍA LA HORA ACTUAL EN FORMATO \"AAAA-MM-DD\". -- Envía la hora actual en formato \"hh:mm:ss ap\".\r\n* {{UNIXTIME}} -- Envía la marca de tiempo del momento actual.\r\n* {{RANDOM}} -- Envía un número aleatorio que oscila entre 0 y 32767 o 2147483647, según sea de 32 o 64 bits (el instalador por defecto para Windows es de 32 bits. Mac es de 64 bits).\r\n* {{UNIQUE}} -- Envía una cadena aleatoria. Utiliza un UUID interno para generarla.\r\nEl Packet Sender intercambiará la macro con valores reales antes de enviarla.\r\n\r\n\r\n<a id=\"persistent\"></a>\r\n## TCP y SSL persistentes\r\n\r\nPacket Sender soporta conexiones TCP y SSL persistentes a través de una ventana GUI separada. Se activa mediante una casilla de verificación en la ventana principal o a través de la ventana de Configuración.\r\n\r\n![Packet Sender TCP directo y SSL](screenshots/packetsender_direct_tcp.PNG)\r\n\r\n### Notas sobre TCP y SSL persistentes:\r\n* Se puede crear cualquier número de conexiones persistentes.\r\n* Se pueden cargar paquetes previamente guardados en el desplegable.\r\n* Hay una vista \"Raw\" y una vista \"ASCII\". La vista ASCII es útil para solucionar problemas con los datos que no imprime la vista en Raw.\r\n* El tráfico también se guarda en el registro de tráfico de la ventana principal.\r\n* Se puede cargar un archivo en la conexión persistente. Es posible que desee desactivar el registro si utiliza esta opción.\r\n* El temporizador de la parte inferior izquierda se inicia en cuanto se envía/recibe un paquete de datos válido. Se detiene cuando se cierra la conexión.\r\n* Puede añadir opcionalmente un retorno de carro cuando realice un envío rápido pulsando la tecla de retorno. Esto es útil para los menús de solicitud de comandos a través de conexiones TCP / SSL. El Packet Sender recuerda el estado anterior de la casilla \\r.\r\n* Las conexiones persistentes entrantes al servidor lanzarán la ventana GUI separada.\r\n* Durante el reenvío, el paquete de conexión persistente se traslada a la nueva ventana GUI. Al hacer clic en \"Reenviar(1)\" se cancelará.\r\n\r\nLas conexiones persistentes no son compatibles a través de la línea de comandos.\r\n\r\n\r\n<a id=\"http\"></a>\r\n# HTTP/HTTPS POST y GET\r\nPacket Sender admite el envío de solicitudes POST/GET a través de HTTP y HTTPS. \r\nEl desplegable de protocolo incluye las siguientes opciones: HTTP GET, HTTP POST, HTTPS GET, HTTPS POST. Al seleccionar HTTP(S), los campos de entrada udpatearán a: Nombre, Solicitud, Dirección, Datos (cuando se selecciona POST), Botón Generar Datos (cuando se selecciona POST), Cargar Fichero (cuando se selecciona POST). \r\n\r\n## Envío de solicitudes HTTP/HTTPS GET/POST\r\n![](/screenshots/ps_http_getfields.PNG)\r\n* Seleccione HTTP(S) GET o POST en el desplegable de protocolo\r\n* En el campo *Address* introduzca el dominio o la IP\r\n* En el campo *Request* añada la ruta URL, si es necesario\r\n* En el campo *Port*, el valor por defecto para HTTP es 80 y HTTPS es 443\r\n* Marque *Persistent TCP* para ver los datos del servidor con mayor claridad (las cabeceras HTTP se eliminan automáticamente). \r\n\r\n**También puede pegar una URL completa en el campo Solicitud y Packet Sender analizará y rellenará automáticamente los demás campos.**\r\n\r\n### Para solicitudes POST:\r\n* Puede añadir manualmente los datos en el campo *Data*.\r\n\t* El formato sería: clave=valor\r\n\t* Para múltiples parametros: clave=valor&clave=valor&clave=valor\r\n* O puede hacer clic en el botón *Generar datos\r\n\r\n<img src=\"/screenshots/ps_http_datagenerator.PNG\" width=\"400\" height=\"284\">\r\n\r\n* Para añadir datos, introduzca los parámetros Clave y Valor. Haga clic en el botón **+**. \r\n* Puede añadir múltiples parámetros con el botón +. \r\n* Elimine parámetros haciendo clic en el botón X situado junto al parámetro.\r\n* Una vez añadidos los parámetros, pulse Ok y los datos se generarán en el campo Datos. \r\n\r\n### Para añadir credenciales de autenticación:\r\n\r\n<img src=\"/screenshots/ps_http_authgenerator.PNG\" width=\"800\" height=\"339\">\r\n\r\n* Vaya a Archivo -> Configuración -> HTTP\r\n* Marque *Generar cabecera de autenticación*\r\n*Introduzca el *Host*, *UN/ID de Cliente*, y *PW/Acceso*.\r\n* Pulse en *Cabecera de Autenticación HTTP* para generar la cabecera de autenticación\r\n\r\n<a id=\"panelgen\"></a>\r\n# Generador de paneles\r\nPacket Sender soporta la generación de paneles de control. Los paneles consisten en botones con scripts (paquetes) asignados a ellos. Al hacer clic en el botón se ejecutará el paquete o paquetes referenciados en ese botón. \r\n\r\n<img src=\"/screenshots/ps_panel_1.PNG\" width=\"400\" height=\"358\">\r\n\r\n## Cargar un panel\r\nLos paneles pueden crearse de dos maneras:\r\n* Haciendo clic en **Paneles** en la barra de herramientas y seleccionando Cargar Panel de Inicio o Proyecto de Panel Vacío\r\n\t* Cargar panel de inicio cargará el panel asignado como inicio. Si no hay ningún panel asignado como iniciador, se abrirá un proyecto de panel vacío. \r\n* Resaltar 2 o más paquetes guardados y hacer clic en el botón **Generar Panel** (el botón Generar Panel sólo aparece cuando se seleccionan varios paquetes) \r\n\r\nPacket Sender admite el inicio en modo solo panel con el panel de inicio usando la opción de línea de comando `--starterpanel`\r\n\r\n![](/screenshots/ps_panel_generate.PNG)\r\n\r\n\r\n## Creando un Script para un Panel\r\nPara empezar a scriptear los botones de su panel, necesitará abrir un panel e ir a la pantalla de Edición. Una vez abierto el proyecto de un panel, compruebe el botón de la esquina inferior derecha. Si este botón dice \"Visualización\", se encuentra en la pantalla Visualización. Pulse el botón para pasar el panel a la pantalla de Edición. \r\n\r\nUna vez en la pantalla de Edición, se pueden añadir botones y scripts al panel. \r\n\r\n### Scripts de botones\r\nLos scripts de los botones contendrán el nombre del paquete a enviar. \r\n\r\n<img src=\"/screenshots/ps_panel_2.PNG\" width=\"400\" height=\"360\">\r\n\r\nSe pueden asignar varios paquetes a un botón añadiendo cada nombre en una nueva línea.\r\n\r\n<img src=\"/screenshots/ps_panel_5.PNG\" width=\"400\" height=\"358\">\r\n\r\nEl generador de paneles permite añadir un retardo entre varios paquetes añadiendo \"retardo:_# de segundos_\" entre paquete y paquete.\r\n\r\n<img src=\"/screenshots/ps_panel_4.PNG\" width=\"400\" height=\"359\">\r\n\r\nEl generador de paneles admite la adición de un script para cargar un nuevo panel añadiendo \"panel:_panel id #_\". Una vez ejecutados todos los scripts anteriores del botón, el Panel pasará al siguiente panel. \r\n\r\n<img src=\"/screenshots/ps_panel_8.PNG\" width=\"400\" height=\"358\">\r\n\r\n\r\n### Añadir archivos/URLs\r\nEl Generador de paneles admite la adición de botones que enlazan con archivos o URL almacenados localmente. \r\nLos botones de archivo/URL pueden añadirse mientras se está en la pantalla de edición haciendo clic en el *+* de la esquina inferior derecha. \r\n* Para archivos: Vaya al archivo en el PC, haga clic con el botón derecho en el archivo y seleccione Copiar. Péguelo en el cuadro de texto _URL o Archivo_ en Packet Sender\r\n* Para URLs: Copie la URL en el cuadro de texto _URL o Archivo_ en Packet Sender\r\n\t* Las URL deben empezar por http:// o https://\r\n\r\n\r\n![](/screenshots/ps_panel_7.PNG) \r\n\r\nUna vez copiado el archivo o la URL, se le pedirá que introduzca un nombre para el botón. Los botones aparecerán en la parte inferior del panel. \r\n\r\nMientras se encuentre en la pantalla de edición, al hacer clic en estos botones podrá editar el enlace del archivo/URL y el nombre del botón. También puede eliminar el botón haciendo clic en la **X** de la ventana emergente. \r\n\r\n![](/screenshots/ps_http_changeURL.PNG)\r\n\r\nEn la pantalla de visualización, al hacer clic en estos botones se iniciará la URL en el navegador predeterminado o se abrirá el archivo (con el programa predeterminado para el tipo de archivo). \r\n\r\n\r\n![](/screenshots/ps_panel_6.PNG) \r\n\r\n### Edición/Guardado de Paneles\r\nMientras esté en la pantalla de edición de un Panel, habrá una barra de herramientas con los menús Archivo, Exportar, Configuración, Ayuda. Desde esta barra de herramientas puede guardar, exportar, importar, cargar proyectos de paneles y editar el proyecto del panel actual. \r\n\r\nDesde Ajustes, puede hacer lo siguiente:\r\n* Establecer nombre de panel - seleccione esto para renombrar el proyecto de panel actual.\r\n* Establecer ID del panel - seleccione esto para cambiar el ID asociado con el proyecto de panel actual\r\n_Nota: Ajustar un ID en uso reemplazará ese panel_.\r\n* Panel de inicio - seleccione esto para establecer el proyecto de panel actual como panel de inicio. \r\n* Borrar Panel - Esto mostrará un menú de los proyectos de panel actuales. Seleccione un proyecto de panel para eliminarlo. _Nota: Los botones y scripts se mantendrán en la pantalla de edición hasta que se cierre el panel_.\r\n\r\n\r\n\r\n<a id=\"cli\"></a>\r\n# Línea de comandos\r\nPacket Sender puede utilizarse desde la línea de comandos de su ordenador. \r\n\r\nPara Windows, utilice la extensión .com (`packetsender.com`) para utilizar la interfaz de la línea de comandos. Opcionalmente, también puede utilizar `packetsender` sin extensión. Si utiliza la extensión .exe iniciará la interfaz gráfica de usuario. \r\n\r\n\r\n![Captura de pantalla de CLI de Packet Sender](screenshots/packetsender_command_line.png)\r\n\r\nPara Linux, el sistema de línea de comandos de Packet Sender sigue el mismo patrón que otras utilidades de Linux. Tiene un nombre largo (como --version) y un nombre corto (como -v). Estas opciones pueden disponerse en cualquier orden y Packet Sender las analizará correctamente. Las 3 últimas opciones son posicionales y deben aparecer en último lugar. Son IP, puerto y datos. Estas últimas opciones son opcionales si se utiliza un paquete almacenado.\r\n\r\n```text\r\npacketsender --help\r\nPacket Sender es una utilidad de prueba de red UDP/TCP/SSL/HTTP de NagleCode.\r\nConsulte https://PacketSender.com/ para más información.\r\n\r\nOpciones:\r\n  -?, -h, --help            Muestra ayuda sobre las opciones de la línea de comandos.\r\n  --help-all                Muestra la ayuda incluyendo opciones específicas de Qt.\r\n  -v, --version             Muestra información sobre la versión.\r\n  -q, --quiet               Modo silencioso. Sólo muestra los datos recibidos.\r\n  -x, --hex                 Analiza los datos a enviar como hexadecimales (por defecto para\r\n                            TCP/UDP/SSL).\r\n  -a, --ascii               Analiza los datos a enviar en formato mixto-ascii (por defecto para http\r\n                            y GUI).\r\n  -A, --ASCII               Analiza los datos a enviar como ascii puro (sin\r\n                            traducción \\xx).\r\n  -w, --wait <ms>           Se esperará hasta <millisegundos> para una respuesta después del\r\n                            envío. Un valor de cero significa sn espera (Por defecto).\r\n  -f, --file <path>         Enviar el contenido de la ruta especificada. Máximo 10 MiB para\r\n                            UDP, 100 MiB para TCP/SSL.\r\n  -b, --bind <port>         Vincular puerto. Por defecto es 0 (dinámico).\r\n  -6, --ipv6                Forzar IPv6. Igual que -B \"::\". Por defecto es IP:Any.\r\n  -4, --ipv4                Forzar IPv4.  Igual que -B \"0.0.0.0\". Por defecto es IP:Any.                  \r\n  -B, --bindip <IP>         Enlazar IP personalizada. Por defecto es IP:Any.\r\n  -t, --tcp                 Enviar TCP (por defecto).\r\n  -s, --ssl                 Enviar SSL e ignorar errores.\r\n  -S, --SSL                 Enviar SSL y parar por errores.\r\n  -u, --udp                 Enviar UDP.\r\n  --http <http>             Enviar HTTP. Los valores permitidos son GET (por defecto) y\r\n                            POST\r\n  -n, --name <name>         Enviar el paquete previamente guardado llamado <name>. Otras\r\n                            opciones anulan los parámetros del paquete guardado.\r\n  --bps <bps>               Tráfico intenso. Calcula la tasa basándose en el valor de\r\n                            bits por segundo.\r\n  --num <number>            Tráfico intenso. Número de paquetes a enviar. Por defecto\r\n                            ilimitado.\r\n  --rate <Hertz>            Tráfico intenso. Tasa. Se ignora en la opción bps.\r\n  --usdelay <microseconds>  Tráfico intenso. Retardo de reenvío. Utilizado si la tasa es 0.\r\n                            Ignorado en la opción bps.\r\n\r\nArgumentos:\r\n  address                   Dirección/URL de destino. Opcional para paquete guardado.\r\n  port                      Puerto de destino/datos POST. Opcional para el paquete\r\n                            guardado\r\n  data                      Datos a enviar. Opcional para el paquete guardado.\r\n```\r\n## Ejemplo de CLI\r\nEl CLI sigue el mismo formato entre Windows, Linux y MAC. \r\n\r\nEl formato es `packetsender [options] puerto de dirección de datos`\r\n\r\n```text\r\npacketsender -taw 500 mirrors.xmission.com 21 \"USER anonimo\\nPASS chrome@example.com\\r\\n\"\r\nTCP (65505)://mirrors.xmission.com:21 55 53 45 52 20 61 6e 6f 6e 79 6d 6f 75 73 0d 0a 50 41 53 53 20 63 68 72 6f 6d 65 40 65 78 61 6d 70 6c 65 2e 63 6f 6d 0d 0a\r\nTiempo de respuesta:5:51:37.042 pm\r\nRespuesta HEX:32 32 30 2D 57 65 6C 63 6F 6D 65 20...\r\nRespuesta ASCII:220-Bienvenido a XMission Internet...\r\n```\r\n\r\n## Ejemplos de vinculación a puerto e IP personalizada, IPv4 o IPv6\r\n\r\nLa línea de comandos de Packet Sender puede vincularse a puertos personalizados para forzar modos IPv4/6 o múltiples NIC utilizando la opción -B.\r\n```text\r\npacketsender -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hola\\r\"\r\npacketsender -taw 3000 192.168.0.201 5005 \"Hello\\r\"\r\npacketsender -B 192.168.0.200 -taw 3000 192.168.0.201 5005 \"Hola\\r\"\r\npacketsender -B fe80::a437:399a:3091:266a%ethernet_32769 -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hola\\r\"\r\npacketsender -B fe80::a437:399a:3091:266a -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hola\\r\"\r\n```\r\n\r\n## Ejemplo de CLI utilizando SSL e ignorando errores\r\n\r\nLa línea de comandos tiene la opción de ignorar o abandonar en los errores SSL. El valor por defecto es ignorar.\r\n\r\n* Utilice la opción -s para enviar SSL e ignorar errores.\r\n* Utilice la opción -S para enviar SSL y abandonar en caso de errores\r\n\r\n```text\r\npacketsender -saw 500 expired.packetsender.com 443 \"GET / HTTP/1.0\\r\\n\\r\\n\"\r\nError SSL: El certificado ha caducado\r\nSSL (54202)://expired.packetsender.com:443 47 45 54 20 2f 20 48 54 54 50 2f 31 2e 30 0d 0a 0d 0a\r\nCifrado: Cifrado con AES(128)\r\n\r\nTiempo de respuesta:3:24:55.695 pm\r\nRespuesta HEX:48 54 54 50 2f 31 2e 31 20 34 32 31 20 0d 0a 53 65 72 76 65 72 3a 20 6e 67 69 6e 78 2f 31 2e 31 30 2e 30 20 28 55 62 75 6e 74 75 29 0d\r\nRespuesta ASCII:HTTP/1.1 421 \\r\\nServidor: nginx/1.10.0 (Ubuntu)\\r\r\n```\r\n\r\n## Ejemplo CLI usando HTTP\r\nTenga en cuenta que esto utiliza los paquetes incorporados por defecto.\r\n```text\r\npacketsender --name \"Parámetros POST HTTPS\"\r\npacketsender --http GET \"https://httpbin.org/get\"\r\npacketsender --http POST \"https://httpbin.org/post\" \"{}\"\r\n```\r\n\r\n\r\n\r\n<a id=\"cliintensetraffic\"></a>\r\n\r\n## Ejemplo utilizando el Generador de Tráfico Intenso CLI\r\nEl generador de tráfico intenso por comandos funciona de forma muy parecida a la versión GUI, pero es un poco más preciso, con más opciones de control, (¡y más intensidad!).\r\n\r\nVea a continuación ejemplos de cómo utilizarlo. Tenga en cuenta que estos cálculos son \"Best Effort\". Lo hace bien, pero los picos del procesador o diversos contratiempos de la red pueden echarlo a perder. El threading  no es en tiempo real, y no es superinteligente con sus intentos de compensar.\r\n\r\n* Reenviar \"Mi Impresionante Paquete\" a una velocidad de 20 Hz\r\n* Reenviar \"Mi Impresionante Paquete\" a una velocidad de 2000 baudios\r\n* Reenviar \"Mi Impresionante Paquete\" lo más rápido posible\r\n* Reenviar \"Mi Impresionante Paquete\" con un retardo de 2000000 microsegundos entre cada paquete\r\n\r\n**Nota: Para Windows, use la construcción \".com\", así que cada ejemplo sería packetsender.com**\r\n\r\n```text\r\npacketsender --rate 20 --name \"Mi impresionante paquete\"\r\npacketsender --bps 2000 --name \"Mi impresionante paquete\"\r\npacketsender --rate 0 --name \"Mi impresionante paquete\"\r\npacketsender --usdelay 2000000 --name \"Mi impresionante paquete\"\r\n```\r\n\r\n\r\n<a id=\"building\"></a>\r\n# Activando Packet Sender\r\nLa única dependencia es Qt SDK\r\n\r\n## Activando Packet Sender para Windows/MAC\r\n1. Descargue el instalador de Qt desde http://www.qt.io/download-open-source/\r\n1. Deje que instale MingGW si no tiene un compilador.\r\n1. Abra el proyecto PacketSender.pro\r\n1. Active. \r\n\r\nLas versiones para Windows y Mac fueron creadas usando Qt 5.12. Packet Sender soporta Qt 6, sin embargo no soporta cmake.\r\n\r\n## Activando Packet Sender para Linux\r\nEsta es la secuencia de comandos para Ubuntu 16.04. Por favor, adáptela a su plataforma Linux. Packet Sender no requiere librerías adicionales más allá del Qt SDK de stock. Me han dicho que hay problemas de compilación con Fedora stock. Si un asistente de Fedora tiene alguna idea, por favor hágamelo saber y añadiré sus instrucciones.\r\n\r\nSi se siente aventurero, siéntase libre de realizar la instalación de la Ramificación Maestra. Contiene la última compilación estable. Probablemente debería evitar la rama de desarrollo.\r\n\r\n```bash\r\nsudo apt-get update\r\nsudo apt-get install qt5-default build-essential\r\nwget https://github.com/dannagle/PacketSender/archive/(Versión).tar.gz\r\ntar -xzvf (Versión).tar.gz\r\ncd PacketSender-(Versión)/src\r\nqmake PacketSender.pro\r\nmake\r\n```\r\n\r\nPara ejecutarlo utilice\r\n```text\r\n./PacketSender\r\n```\r\n\r\nSi no se ejecuta, puede que tenga que configurarlo como ejecutable\r\n```text\r\nchmod a+x PacketSender\r\n```\r\n\r\n\r\n# Mejoras/Solicitudes\r\n\r\n¿Echa en falta alguna característica? Puede [contratarme para que la añada a Packet Sender](https://packetsender.com/enhancements).\r\n\r\n# Legal / Cumplimiento\r\n\r\nLa licencia es GPL v2 o posterior. [Póngase en contacto conmigo](https://packetsender.com/contact) si necesita una licencia diferente.\r\nAlgunas distribuciones de Packet Sender pueden utilizar [OpenSSL](https://www.openssl.org/).\r\nEl VPAT más actual [puede encontrarse](vpat_2.4_packetsender.pdf) en este repo.\r\n\r\n\r\n# Derechos de autor\r\n\r\nPacket Sender fue escrito por [Dan Nagle](https://dannagle.com/) y es publicado por &copy; NagleCode, LLC - [@NagleCode](https://twitter.com/NagleCode) - [PacketSender.com](https://packetsender.com)\r\n\r\n"
        },
        {
          "name": "README.fr.md",
          "type": "blob",
          "size": 35.0615234375,
          "content": "# Introduction\r\n\r\n![Logo Packet Sender ](screenshots/packetsender_banner.png)\r\n\r\n\r\n*Lire ceci dans d’autres langues : [English](README.md), [Español](README.es.md), [Deutsch](README.de.md), [Français](README.fr.md).*\r\n\r\n\r\n[![Téléchargements](https://img.shields.io/github/downloads/dannagle/PacketSender/total.svg)](https://packetsender.com/download)\r\n\r\n\r\nPacket Sender est un utilitaire open source permettant d’envoyer et de recevoir des paquets TCP, UDP et SSL (TCP cryptés) ainsi que des requêtes HTTP / HTTPS et la génération de panneaux. La branche principale supporte officiellement Windows, Mac et Desktop Linux (avec Qt). D’autres endroits peuvent recompiler et redistribuer Packet Sender. Packet Sender est gratuit et sous licence GPL v2 ou ultérieure. Il peut être utilisé à des fins commerciales et personnelles. Si vous trouvez l’application utile, veuillez envisager de faire un don / parrainer afin que le développement puisse continuer.\r\n\r\n\r\n\r\n# Table des matières\r\n* [Auteurs](#sponsors)\r\n  * Visitez [IWL.com](https://www.iwl.com/)v\r\n  * Visite [NagleCode.com](https://dannagle.com/)\r\n\r\n* [GUI](#gui)\r\n* [Générateur de trafic intense (GUI)](#udptraffic)\r\n* [Réseau](#network)\r\n* [Téléchargements](#downloads)\r\n* [Soutien](#support)\r\n* [Calculateur de sous-réseau IPv4](#subnetcalculator)\r\n* [Packet Sender Cloud](#cloud)\r\n* [Mode portable](#portable)\r\n* [Macros et réponses intelligentes](#smartresponses)\r\n* [TCP et SSL persistants](#persistent)\r\n* [Requêtes HTTP/HTTPS](#http)\r\n* [Générateur de panneaux](#panelgen)\r\n* [Interface de ligne de commande](#cli)\r\n* [Générateur de trafic intense (CLI)](#cliintensetraffic)\r\n* [Création de Packet sender](#building)\r\n\r\n\r\n\r\n\r\n<a id=\"sponsors\"></a>\r\n## Auteurs\r\n\r\nPacket Sender tient à remercier les sponsors suivants.\r\n\r\n[![IWL](screenshots/iwl_logo.png)](https://www.iwl.com/)\r\n<br>IWL est une société californienne qui crée des produits de réseaux informatiques.\r\n<br><br><br>\r\n\r\n[![NagleCode](screenshots/naglecode-logo400.png)](https://dannagle.com)\r\n<br>NagleCode est un éditeur de logiciels et un studio de développement.\r\n<br><br><br>\r\n\r\n\r\n[Voulez-vous que votre nom / logo figure ici?](https://github.com/sponsors/dannagle)\r\n\r\n\r\n\r\n<a id=\"support\"></a>\r\n## Soutien\r\n\r\n* Twitter: [@NagleCode](http://twitter.com/NagleCode)\r\n* Les forums sont à : [GitHub Discussions](https://github.com/dannagle/PacketSender/discussions).\r\n* Email:[Contact expéditeur du paquet](https://packetsender.com/contact)\r\n* Connectez-vous avec moi sur [LinkedIn](https://www.linkedin.com/in/dannagle/)\r\n\r\n*REMARQUE:* Essayez (temporairement) de désactiver votre pare-feu si vous rencontrez des problèmes dans Windows.\r\n\r\n<a id=\"downloads\"></a>\r\n# Téléchargements\r\n\r\n## Téléchargement du Version Bureau\r\nLes versions officielles de Packet Sender peuvent être téléchargées à l’adresse [PacketSender.com](http://packetsender.com/download). Certains endroits redistribuent Packet Sender.\r\n\r\n![Logo Windows](screenshots/winlogo150.png) ![Logo Mac](screenshots/maclogo150.png) ![Logo Linux](screenshots/Tux150.png)\r\n\r\n\r\n<!--\r\nJe ne sais pas quand cela reviendra.\r\n\r\n## Applications mobiles\r\nLes éditions mobiles de Packet Sender sont entièrement natives, contiennent des autorisations minimales et ne collectent aucune donnée. C’est un logiciel qui vous respsecte. Merci de soutenir cet effort.\r\n\r\n\r\n### Application mobile Androïde\r\n![Logo Androïde](screenshots/android_logo.png)\r\n\r\nLa version Androïde se trouve [sur Google Play](https://play.google.com/store/apps/details?id=com.packetsender.compose) ou [sur Amazon Appstore](https://www.amazon.com/dp/B08RXM6KM2/)\r\n\r\n[![Packet Sender Androïde](screenshots/packetsender_android_screenshot.png)](https://play.google.com/store/apps/details?id=com.packetsender.compose\r\n\r\n-->\r\n\r\n\r\n<!--\r\nJe ne sais pas quand cela reviendra.\r\n\r\n## Application mobile iOS\r\n\r\n![logo Packet Sender ](screenshots/ios_logo.png)\r\n\r\nLa version iOS se trouve [sur l’App Store d’Apple](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n[![Packet Sender iOS](screenshots/packetsender-ios-traffic-log-ascii.png)](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n-->\r\n<a id=\"gui\"></a>\r\n# GUI\r\n\r\nPacket Sender est identique pour toutes les versions de bureau. La seule différence est son thème pour correspondre au système d’exploitation.\r\n\r\n![capture d'écran Packet Sender](screenshots/ps_GUI.png)\r\n\r\n1. Un paquet a un nom, une adresse de destination (les noms de domaine sont résolus par défaut juste avant l’envoi), un port et des données qui lui sont associées.\r\n2. Dans le tableau, il y a une liste de paquets enregistrés. Vous pouvez double-cliquer pour modifier directement les domaine de ce tableau.\r\n3. En bas à droite, il y a l’état et le(s) port(s) du serveur UDP, TCP et SSL. Cliquez dessus pour activer ou désactiver le protocole. Packet Sender prend en charge la liaison à n’importe quel nombre de ports.\r\n4. Il y a aussi un bouton bascule IP. En cliquant dessus, vous le changez en IPv4 (par défaut), IPv6 ou IP personnalisée\r\n\r\n### Notes générales\r\n* Une valeur de renvoi de \"0\" signifie qu'il s'agit d'un paquet unique.\r\n* Pendant le renvoi des paquets, il y aura un bouton pour annuler tous les renvois.\r\n* Veuillez vérifier votre pare-feu. Windows bloque agressivement les serveurs TCP. Packet Sender fonctionnera toujours si le pare-feu le bloque, mais il ne peut pas recevoir de paquets TCP non sollicités.\r\n* Une réponse facultative peut être envoyée. La même réponse est utilisée pour TCP, UDP et SSL.\r\n* Pour l’envoi IPv6, vous aurez également besoin de l’ID d’étendue.\r\n* Packet Sender prend en charge la notation mixte ASCII et HEX:\r\n  * Double-cliquez sur l’un des champs pour afficher l’éditeur multiligne\r\n  * \\XX est traduit en XX en hexadécimal\r\n  * \\n, \\r, \\t seront traduits en 0A, 0D et 09\r\n  * Les numéros HEX sont délimités par des espaces\r\n    * Le champ HEX tentera d’interpréter d’autres délimiteurs courants (tels que les virgules, les deux-points (Wireshark), les points-virgules, \" 0x « , etc.) et de corriger automatiquement. Il est très tolérant aux fautes.\r\n    * Un seul flux HEX est également pris en charge. Si le nombre d’octets est impair, Packet Sender supposera que l’octet avant a besoin d’un zéro, puis corrigera automatiquement.\r\n  * Exemple ASCII: salut tout le mondes\\r\r\n  * Exemple HEX: 68 65 6c 6c 6f 20 77 6f 72 6c 64 0d\r\n  * Vous pouvez enregistrer un paquet directement à partir du journal de trafic. Vous serez invité à entrer un nom, et l’adresse source et le port seront commutés pour votre commodité.\r\n  * Vous pouvez également charger un fichier directement dans le champ HEX. Le domaine HEX prend en charge l’envoi de 10 922 octets. La limite théorique pour l’envoi via la ligne de commande est de 200 Mo.\r\n\r\n\r\n## Raccourcis clavier/raccourcis clavier\r\n\r\nLes domaines situés en haut de l'écran peuvent être parcourus en utilisant CTRL+1, CTRL+2, etc., jusqu'à CTRL+8 (bouton d'envoi). Sur Mac, la touche de raccourci est Commande.\r\n\r\nLes raccourcis clavier et les champs sont les suivants :\r\n* CTRL + 1 = Nom\r\n* CTRL + 2 = ASCII\r\n* CTRL + 3 = HEX\r\n* CTRL + 4 = Adresse\r\n* CTRL + 5 = Port\r\n* CTRL + 6 = Délai de renvoi\r\n* CTRL + 7 = Sélection du protocole\r\n* CTRL + 8 = Envoyer (s’exécute)\r\n\r\n\r\nQuelques remarques :\r\n* Les domaines sont liés à la touche de raccourci correspondante, indépendamment de la sélection du protocole.\r\n* Lorsque vous accédez à l’option TCP/UDP/SSL, vous pouvez utiliser des caractères haut/bas ou t/u/s/h pour effectuer une sélection.\r\n* Si vous envisagez d’automatiser avec des raccourcis clavier (à l’aide d’outils tels que [AutoHotKey](https://www.autohotkey.com/)), vous pouvez désactiver « Restaurer la session précédente ».\r\n\r\n\r\n\r\n<a id=\"network\"></a>\r\n# Fonctionnalités réseau\r\n\r\n## IPv4, IPv6, IP personnalisée\r\n\r\nLes serveurs intégrés de Packet Sender sont configurés pour prendre en charge IPv4 ou IPv6, mais pas les deux en même temps. Pour les clients, l’interface graphique de l’expéditeur de paquets et l’interface de ligne de commande basculeront de manière transparente entre les deux modes lors de l’envoi (l’ID de portée peut être nécessaire pour IPv6). Cliquez sur la bascule IPv4 / IPv6 en bas à droite pour basculer entre les deux.\r\n\r\nDans les paramètres, vous pouvez également forcer les serveurs de Packet Sender à se lier à une adresse IP personnalisée. Cela peut être très utile pour les systèmes avec plusieurs cartes réseau ou des configurations IP compliquées. Packet Sender déclenchera une erreur s’il lui est demandé de se lier à une adresse qui n’existe pas.\r\n\r\n![Liaison spécifique à l’IP](screenshots/ip-specific-binding.png)\r\n\r\n\r\n<a id=\"subnetcalculator\"></a>\r\n## Calculateur de sous-réseau IPv4\r\n\r\nPacket Sender dispose d’un calculateur de sous-réseau intégré. C’est sous le menu Outils.\r\n![Calculateur du sous-réseau de Packet Sender](screenshots/packetsender_subnetcalc.PNG)\r\n\r\n* La fenêtre de journal (section inférieure) affichera les adresses IPv4 et IPv6 sans bouclage trouvées sur votre ordinateur.\r\n* Sur le côté gauche, entrez l’adresse IPv4 dans le domaine IP.\r\n* Sur le côté gauche, entrez le sous-réseau en notation X.X.X. ou /XX\r\n* Les résultats du calcul sont à droite.\r\n* Le champ ci-dessous est une vérification rapide pour voir si un IPv4 se trouve dans l’un de vos sous-réseaux.\r\n\r\n## Client et serveur SSL\r\n\r\nPacket Sender prend en charge l’établissement de connexions chiffrées via SSL.\r\nCeci est pris en charge dans l’interface graphique et sur la ligne de commande.\r\n\r\nPacket Sender regroupe OpenSSL pour une utilisation dans Windows. Sur Mac et Linux, Packet Sender utilisera les bibliothèques SSL natives.\r\n\r\n_Ce produit contient un logiciel développé par le projet OpenSSL pour être utilisé dans la boîte à outils OpenSSL. (http://www.openssl.org/)_\r\n\r\n![TCP direct de Packet Sender](screenshots/packetsender_ssl.PNG)\r\n\r\nNotes SSL :\r\n* La négociation du certificat est traitée immédiatement lors de la connexion.\r\n* Par défaut, Packet Sender ignore toutes les erreurs SSL (certificat expiré, nom d’hôte incorrect, auto-signé, etc.).\r\n* Packet Sender affiche la progression de la négociation du certificat dans le journal de trafic.\r\n* Packet Sender génère l’algorithme de chiffrement utilisé dans le journal de trafic (tel que AES 128).\r\n\r\nPacket Sender propose un certificat interne \"Snake Oil\" pour une utilisation en tant que serveur pour Windows. Le certificat et la clé se trouvent au même endroit que le paquet et les paramètres.\r\n\r\n_Note: Le remplacement des emplacements de certificat dans Paramètres remplace également le certificate de snake oil._\r\n\r\nS’il y a une erreur SSL, Packet Sender la transmettra dans le journal de trafic. Si le paramètre est de continuer de toute façon (par défaut), il continuera à négocier le cryptage. Sinon, la connexion se termine par l’échec de la connexion.\r\n\r\n![TCP direct de Packet Sender a expiré](screenshots/packetsender_expired_ssl.png)\r\n\r\n## Multicast(expérimentale)\r\n\r\nLa prise en charge de la multicast de Packet Sender est déclenchée en tentant d’envoyer vers une adresse de multidiffusion IPv4 ou à partir du sous-menu multidiffusion. La fonctionnalité est actuellement expérimentale et présente ces problèmes connus.\r\n\r\n* Packet Sender abandonne la prise en charge d’IPv6 lors de la multicast.\r\n* Et reste abandonné jusqu’à ce que vous reveniez sur les paramètres ou tentiez d’envoyer vers IPv6\r\n* Sur le wifi, il faut parfois 20 secondes pour que la jointure multicast prenne réellement effet.\r\n* Packet Sender n’a aucune logique pour rejoindre un groupe multicast si le commutateur redémarre ou une autre erreur courante.\r\n\r\nIl n’y a pas de support de multicast IPv6, bien qu’il soit sur la feuille de route. Les sponsors souhaitant un support multicast IPv6 sont invités à me contacter.\r\n\r\n<a id=\"udptraffic\"></a>\r\n\r\n## Générateur de trafic UDP (expérimental)\r\n\r\nPour quand le système d’envoi normal ne suffit pas, vous pouvez marteler une adresse IP cible avec des paquets pour voir si votre appareil peut le gérer. Vous pouvez le trouver dans la barre d’outils de l’interface graphique à l'_outils -> Générateur de trafic intense_\r\n\r\nVeuillez noter que cette fonctionnalité est expérimentale et que les métriques affichées n’ont pas été entièrement testées. Pour un test plus précis, vous pouvez consulter la version CLI de cet outil.\r\n\r\n![Liaison spécifique à l’IP](screenshots/udp-traffic-sending.PNG)\r\n\r\n# Fonctionnalités de l’expéditeur de paquets\r\n\r\n\r\n<a id=\"cloud\"></a>\r\n## Cloud Packet Sender\r\n\r\nLes ensembles de paquets peuvent être rapidement enregistrés/récupérés/partagés à l’aide du service gratuit [Cloud Packet Sender ](https://cloud.packetsender.com/). Le cloud peut également être utilisé pour afficher et distribuer publiquement vos paquets (via une URL) pour la collaboration, les tutoriels, les utilisateurs finaux, etc. Packet Sender peut importer des ensembles de paquets publics avec une URL publique.\r\n\r\nIl y a plusieurs raisons de le faire:\r\n\r\n* Garder tous vos paquets prêts afin que vous puissiez les récupérer rapidement lors de l’installation d’un nouvel version de Packet Sender\r\n* Basculer rapidement entre les ensembles de paquets lorsque vous travaillez sur différents projets.\r\n* Partage d’un login (c’est autorisé) pour la génération collaborative de paquets\r\n* Avoir une page publique de vos ensembles de paquets afin que les autres puissent rapidement trouver et importer\r\n\r\n![Importation du cloud de Packet Sender](screenshots/cloud-import.png)\r\n\r\nSi vous publiez une API réseau, la maintenance d’une page de cloud public est beaucoup plus facile que de détailler péniblement (IP, port, type, etc.) les paquets à vos utilisateurs. De plus, la mise à jour de cette page est facile.\r\n\r\nPlus d’informations à ce sujet peuvent être trouvées à l’adresse\r\nhttps://cloud.packetsender.com/help\r\n\r\n\r\n<a id=\"portable\"></a>\r\n## Mode portable\r\n\r\nPacket Sender a un mode « portable ». Au lancement, il recherchera 'portablemode.txt' et remplira tous les fichiers de paramètres manquants dans ce répertoire d’exécution. Ces fichiers sont 'packets.ini', 'ps_settings.ini', 'ps.key' et 'ps.pem'.\r\nVous pouvez également avoir certains fichiers portables et l’autre dans leur emplacement standard en supprimant portablemode.txt.\r\n\r\n### DDL pouvant être supprimés en mode portable de la console uniquement\r\nSi vous n’avez pas besoin de l’interface graphique, vous pouvez supprimer ces DDL\r\n- Qt5Svg.dll\r\n- libEGL.dll\r\n- libGLESv2.dll\r\n- Qt5Widgets.dll\r\n- Qt5Gui.dll\r\n- opengl32sw.dll\r\n- D3Dcompiler_47.dll\r\n- Répertoire des moteurs d'icônes\r\n- répertoire des formats d'image\r\n- répertoire des styles\r\n\r\n### DDL qui peuvent être supprimés si vous n’avez pas besoin de connexions sécurisées\r\nSi vous n’avez pas besoin de SSL, vous pouvez supprimer ces DDL\r\n- libcrypto-1_1-x64.dll\r\n- libssl-1_1-x64.dll\r\n\r\n\r\nLe répertoire d’exécution des utilisateurs Windows est le même emplacement que le .exe.\r\n\r\nPour les utilisateurs MAC, ce répertoire d’exécution est à 'PacketSender.app/Contents/MacOS'.\r\nSi des fichiers INI sont trouvés, il les utilisera à la place de '%APPDATA%' ou 'Library/Application Support'.\r\n\r\n\r\n<a id=\"smartresponses\"></a>\r\n## Réponses intelligentes\r\n\r\nPacket Sender prend en charge jusqu’à 5 réponses intelligentes.\r\n\r\nPour activer cette fonctionnalité, accédez à _File -> Settings_ dans la barre d’outils de l’interface graphique. Accédez à l’onglet _Smart Responses_ et activez la case à cocher **Envoyer une réponse intelligente**.\r\n\r\n![TCP direct de Packet Sender](screenshots/packetsender_smartreply.PNG)\r\n\r\n* Packet Sender comparera le paquet dans l’encodage que vous choisissez.\r\n* Packet Sender traduit l’encodage avant d’envoyer la réponse.\r\n* Les encodages disponibles sont :\r\n  * ASCII mixte - La méthode standard de codage de l’ASCII par l’expéditeur de paquets avec des caractères non imprimables\r\n  * HEX -- Encodage HEX normal de Packet Sender\r\n\r\n\r\n## Macros\r\n\r\nPacket Sender prend en charge les macros suivantes lors de l’envoi de réponses :\r\n\r\n* {{DATE}} -- Envoie la date actuelle au format « aaaa-mm-jj ».\r\n* {{TIME}} -- Envoie l’heure actuelle au format « hh:mm:ss ap ».\r\n* {{UNIXTIME}} -- Envoie l’horodatage de l’époque actuelle.\r\n* {{RANDOM}} -- Envoie un nombre au hasard compris entre 0 et 32767 ou 2147483647, selon qu'il s'agit de 32 ou 64 bits (le programme d'installation par défaut pour Windows est de 32 bits. Mac est 64 bits).\r\n* {{UNIQUE}} -- Envoie une chaîne aléatoire. Utilise un UUID interne pour le générer.\r\nPacket Sender échangera la macro avec des valeurs réelles avant l’envoi.\r\n\r\n\r\n<a id=\"persistent\"></a>\r\n## TCP et SSL persistants\r\n\r\nPacket Sender prend en charge les connexions TCP et SSL persistantes via une fenêtre GUI distincte. Il est activé par une case à cocher dans la fenêtre principale ou via la fenêtre Paramètres.\r\n\r\n![TCP direct de Packet Sender et SSL](screenshots/packetsender_direct_tcp.PNG)\r\n\r\n### Remarques sur TCP et SSL persistants :\r\n* N’importe quel nombre de connexions persistantes peut être créé.\r\n* Les paquets précédemment enregistrés peuvent être chargés dans la liste déroulante.\r\n* Il y a une vue « Brut » et une vue « ASCII ». La vue ASCII est utile pour dépanner les données qui ne sont pas imprimées par la vue brute.\r\n* Le trafic est également enregistré dans le journal de trafic de la fenêtre principale.\r\n* Un fichier peut être téléchargé sur la connexion permanente. Vous pouvez désactiver la journalisation si vous utilisez cette option.\r\n* La minuterie en bas à gauche démarre dès qu’un paquet de données valide est envoyé/reçu. Il s’arrête lorsque la connexion est fermée.\r\n* Vous pouvez éventuellement ajouter un retour chariot lorsque vous envoyez rapidement en appuyant sur la touche de retour. Ceci est utile pour les menus d’invite de commandes sur les connexions TCP / SSL. Packet Sender se souvient de l’état précédent de la case à cocher \\r.\r\n* Les connexions persistantes entrantes au serveur lanceront la fenêtre GUI séparée.\r\n* Lors du renvoi, le paquet de connexion persistant est transféré dans la nouvelle fenêtre de l’interface graphique. Cliquez sur « Renvoyer(1) » pour l’annuler.\r\n\r\nLes connexions permanentes ne sont pas prises en charge via la ligne de commande.\r\n\r\n\r\n<a id=\"http\"></a>\r\n# HTTP / HTTPS POST & GET\r\nPacket Sender prend en charge l’envoi de requêtes POST/GET via HTTP et HTTPS.\r\nLa liste déroulante Protocole inclut les options suivantes : HTTP GET, HTTP POST, HTTPS GET, HTTPS POST. Lors de la sélection de HTTP(S), les champs de saisie seront orientés vers : Nom, Demande, Adresse, Données (lorsque l’option POST est sélectionnée), bouton Générer des données (lorsque l’option POST est sélectionnée), Charger le fichier (lorsque l’option POST est sélectionnée).\r\n\r\n## Envoi de requêtes HTTP/HTTPS GET/POST\r\n![](/screenshots/ps_http_getfields.PNG)\r\n* Sélectionnez HTTP(S) GET ou POST dans la liste déroulante du protocole\r\n* Dans le champ *Adresse*, entrez le domaine ou l’adresse IP\r\n* Dans le champ *Demande*, ajoutez le chemin de l’URL, si nécessaire\r\n* Dans le champ *Port*, la valeur par défaut pour HTTP est 80 et HTTPS est 443\r\n* Cochez *TCP persistant* pour voir plus clairement les données du serveur (les en-têtes HTTP sont supprimés automatiquement).\r\n\r\n**Vous pouvez également coller une URL complète dans le champ Demande et Packet Sender analysera et remplira automatiquement les autres champs.**\r\n\r\n### Pour les demandes POST :\r\n* Vous pouvez ajouter manuellement les données dans le champ *Données*.\r\n\t* Le format irait: clé = valeur\r\n\t* Pour plusieurs paramètres : clé=valeur&clé=valeur&clé=valeur\r\n* Ou vous pouvez cliquer sur le bouton * Générer des données *\r\n\r\n<img src=\"/screenshots/ps_http_datagenerator.PNG\" width=\"400\" height=\"284\">\r\n\r\n* * Pour ajouter des données, saisissez les paramètres Clé et Valeur. Cliquez sur le bouton **+**.\r\n* Peut ajouter plusieurs paramètres avec le bouton +.\r\n* Supprimez les paramètres en cliquant sur le bouton X à côté du paramètre\r\n* Une fois les paramètres ajoutés, cliquez sur OK et les données seront générées dans le champ Données.\r\n\r\n### Pour ajouter des informations d’authentification :\r\n\r\n<img src=\"/screenshots/ps_http_authgenerator.PNG\" width=\"800\" height=\"339\">\r\n\r\n* Allez dans Fichier -> Paramètres -> HTTP\r\n* Cochez * Générer l’en-tête d’authentification *\r\n* Entrez *Hôte*, *UN/Client ID* et *MP/Accès*\r\n* Cliquez sur *HTTP Auth Header* pour générer l’en-tête d’authentification\r\n\r\n<a id=\"panelgen\"></a>\r\n# Générateur de panneaux\r\nPacket Sender prend en charge la génération de panneaux de contrôle. Les panneaux sont constitués de boutons auxquels sont affectés des scripts (paquets). Cliquez sur le bouton pour exécuter le(s) paquet(s) référencé(s) sur ce bouton.\r\n\r\n<img src=\"/screenshots/ps_panel_1.PNG\" width=\"400\" height=\"358\">\r\n\r\n## Chargement d’un panneau\r\nLes panneaux peuvent être créés de deux manières :\r\n* Cliquez sur **Panneaux** dans la barre d’outils et sélectionnez Charger le panneau de démarrage ou Vider le projet de panneau\r\n\t* Le panneau de démarrage chargera le panneau assigné comme démarreur. Si aucun panneau n'est défini comme point de départ, un projet de panneau vide est alors ouvert.\r\n* Mettez en surbrillance 2 paquets enregistrés ou plus et cliquez sur le bouton **Générer le panneau** (le bouton Générer le panneau n’apparaît que lorsque plusieurs paquets sont sélectionnés)\r\n\r\nPacket Sender prend en charge le lancement en mode panneau uniquement avec le panneau de démarrage à l'aide de l'option de ligne de commande `--starterpanel`\r\n\r\n![](/screenshots/ps_panel_generate.PNG)\r\n\r\n\r\n## Création de scripts pour un panneau\r\nPour commencer à écrire des scripts sur les boutons de votre panneau, vous devrez ouvrir un panneau et accéder à l’écran Édition. Une fois qu’un projet de panneau est ouvert, cochez le bouton dans le coin inférieur droit. Si ce bouton indique « Affichage », vous êtes sur l’écran Affichage. Cliquez sur le bouton pour déplacer le panneau vers l’écran Édition.\r\n\r\nUne fois sur l’écran d’édition, des boutons et des scripts peuvent être ajoutés au panneau.\r\n\r\n### Bouton de scripting\r\nLes scripts de bouton contiendront le nom du paquet à envoyer.\r\n\r\n<img src=\"/screenshots/ps_panel_2.PNG\" width=\"400\" height=\"360\">\r\n\r\nPlusieurs paquets peuvent être définis sur un bouton en ajoutant chaque nom sur une nouvelle ligne.\r\n\r\n<img src=\"/screenshots/ps_panel_5.PNG\" width=\"400\" height=\"358\">\r\n\r\nLe Générateur de panneau supporte l'ajout d'un délai entre plusieurs paquets en ajoutant \" délai:_# de secondes_ \" entre les paquets.\r\n\r\n<img src=\"/screenshots/ps_panel_4.PNG\" width=\"400\" height=\"359\">\r\n\r\nLe générateur de panneau prend en charge l'ajout d'un script pour charger un nouveau panneau en ajoutant \" panneau:_ id du panneau #_ \". Une fois que tous les scripts précédents sur le bouton sont exécutés, le panneau passe au panneau suivant.\r\n\r\n<img src=\"/screenshots/ps_panel_8.PNG\" width=\"400\" height=\"358\">\r\n\r\n\r\n### Ajout de fichiers/URL\r\nLe générateur de panneau prend en charge l’ajout de boutons liés à des fichiers ou des URL stockés localement.\r\nLes boutons Fichier/URL peuvent être ajoutés dans l’écran Édition en cliquant sur le bouton *+* dans le coin inférieur droit.\r\n* Pour les fichiers : Accédez au fichier sur le PC, faites un clic droit sur le fichier et sélectionnez Copier. Collez-le dans la zone de texte _URL ou Ficher_ de Packet Sender\r\n* Pour les URL : Copiez l’URL dans la zone de texte _URL ou Ficher_ de Packet Sender\r\n\t* Les URL doivent commencer par http:// ou https://\r\n\r\n\r\n![](/screenshots/ps_panel_7.PNG)\r\n\r\nUne fois le fichier ou l’URL copié, vous serez invité à entrer un nom pour le bouton. Les boutons seront remplis au bas du panneau.\r\n\r\nSur l’écran Édition, cliquer sur ces boutons vous permettra de modifier le lien fichier/URL et le nom du bouton. Vous pouvez également supprimer le bouton en cliquant sur **X** dans la fenêtre contextuelle.\r\n\r\n![](/screenshots/ps_http_changeURL.PNG)\r\n\r\nLorsque vous êtes sur l’écran d’affichage, cliquez sur ces boutons pour lancer l’URL dans le navigateur par défaut ou ouvrir le fichier (avec le programme par défaut pour le type de fichier).\r\n\r\n\r\n![](/screenshots/ps_panel_6.PNG)\r\n\r\n### Édition/Enregistrement du panneau\r\nAlors que dans l’écran d’édition d’un panneau, il y aura une barre d’outils avec les menus Fichier, Exporter, Paramètres, Aide. Vous pouvez enregistrer, exporter, importer, charger des projets de panneau et modifier le projet de panneau actuel à partir de cette barre d’outils.\r\n\r\nDans Paramètres, vous pouvez effectuer les opérations suivantes :\r\n* Définir le nom du panneau - sélectionnez cette option pour renommer le projet de panneau actuel\r\n* Définir l’ID du panneau - sélectionnez cette option pour modifier l’ID associé au projet de panneau en cours\r\n_Note: La définition d’un ID en cours d’utilisation remplacera cette panneau_\r\n* Panneau de démarrage - sélectionnez cette option pour définir le projet de panneau actuel comme panneau de démarrage.\r\n* Supprimer le panneau - Cela fera apparaître un menu des projets de panneau en cours. Sélectionnez un projet de panneau pour le supprimer. _Note: Les boutons et les scripts seront conservés sur l’écran Modification jusqu’à ce que le panneau soit closed_\r\n\r\n\r\n\r\n<a id=\"cli\"></a>\r\n# Ligne de commande\r\nPacket Sender peut être utilisé à partir de la ligne de commande sur votre ordinateur.\r\n\r\nPour Windows, utilisez l’extension .com ('packetsender.com') pour utiliser l’interface de ligne de commande. En option, vous pouvez également utiliser 'packetsender' sans extension. En utilisant l’extension, .exe lancerez l’interface graphique.\r\n\r\n\r\n![Capture d’écran de l’interface de ligne de commande de Packet Sender](screenshots/packetsender_command_line.png)\r\n\r\nPour Linux, le système de ligne de commande dans Packet Sender suit le même modèle que les autres utilitaires Linux. Il a un nom long (tel que --version) et un nom court (tel que -v). Ces options peuvent être organisées dans n’importe quel ordre et Packet Sender les analysera correctement. Les 3 dernières options sont positionnelles et doivent apparaître en dernier. Il s’agit de l’adresse IP, du port et des données. Ces dernières options sont facultatives si vous utilisez un paquet stocké.\r\n\r\n```texte\r\npacketsender --AIde\r\nPacket Sender est un utilitaire de test réseau UDP / TCP / SSL / HTTP par NagleCode\r\nVoir https://PacketSender.com/ pour plus d’informations.\r\n\r\nOptions:\r\n  -?, -h, --help Affiche l’aide sur les options de ligne de commande.\r\n  --help-all Affiche l’aide, y compris les options spécifiques à Qt.\r\n  -v, --version Affiche les informations de version.\r\n  -q, --mode silencieux. Seules les données de sortie ont été reçues.\r\n  -x, --hex Analyser les données à envoyer en hexadécimal (par défaut pour\r\n                            TCP/UDP/SSL).\r\n  -a, --ascii Analyse les données à envoyer en ascii mixte (par défaut pour http\r\n                            et GUI).\r\n  -A, --ASCII Analyse les données à envoyer en ascii pur (pas de \\xx).\r\n                            traduction).\r\n  -w, --wait <ms> Attendez jusqu’à <millisecondes> pour une réponse après\r\n                            envoi. Zéro signifie ne pas attendre (par défaut).\r\n  -f, --file <chemin> Envoie le contenu du chemin spécifié. Max 10 MiB pour\r\n                            UDP, 100 Mio pour TCP/SSL.\r\n  -b, --bind <port> port de liaison. La valeur par défaut est 0 (dynamique).\r\n  -6, --ipv6                Force IPv6. Identique à -B « :: ». La valeur par défaut est IP:Any.\r\n  -4, --ipv4                Force IPv4.  Identique à -B « 0.0.0.0 ». La valeur par défaut est\r\n                            IP: N’importe lequel.\r\n  -B, --bindip <IP> Lier l’adresse IP personnalisée. La valeur par défaut est IP:Any.\r\n  -t, --tcp Send TCP (par défaut).\r\n  -s, --ssl Envoyez SSL et ignorez les erreurs.\r\n  -S, --SSL Envoyez SSL et arrêtez en cas d’erreur.\r\n  -u, --udp Envoyer UDP.\r\n  --http <http> Envoyer HTTP. Les valeurs autorisées sont GET (par défaut) et\r\n                            POST\r\n  -n, --name <nom> envoie le paquet précédemment enregistré nommé <nom>. Autre\r\n                            Les options remplacent les paramètres de paquets enregistrés.\r\n  --bps <bps> Trafic intense. Calculer le taux en fonction de la valeur de\r\n                            bits par seconde.\r\n  --num <nombre> Trafic intense. Nombre de paquets à envoyer. Faire défaut\r\n                            illimité.\r\n  --rate <Hertz> Trafic intense. Taux. Ignoré dans l’option bps.\r\n  --usdelay <microsecondes> Trafic intense. Renvoyer le délai. Utilisé si le taux est égal à 0.\r\n                            Ignoré dans l’option bps.\r\n\r\nArguments:\r\n  adresse Adresse/URL de destination. Facultatif pour le paquet enregistré.\r\n  port Port de destination/Données POST. Facultatif pour enregistré\r\n                            paquet.\r\n  données Données à envoyer. Facultatif pour le paquet enregistré.\r\n```\r\n## Exemple d’interface de ligne de commande\r\nL’interface de ligne de commande suit le même format entre Windows, Linux et MAC.\r\n\r\nLe format est : 'packetsender [options]adresse données port'\r\n\r\n```texte\r\npacketsender -taw 500 mirrors.xmission.com 21 « UTILISATEUR anonyme\\r\\nPASS chrome@example.com\\r\\n »\r\nTCP (65505)://mirrors.xmission.com:21 55 53 45 52 20 61 6e 6f 6e 79 6d 6f 75 73 0d 0a 50 41 53 53 20 63 68 72 6f 6d 65 40 65 78 61 6d 70 6c 65 2e 63 6f 6d 0d 0a\r\nTemps de réponse:5:51:37.042 pm\r\nRéponse HEX:32 32 30 2D 57 65 6C 63 6F 6D 65 20...\r\nRéponse ASCII:220-Bienvenue sur XMission Internet...\r\n```\r\n\r\n## Exemples de liaison à un port et à une adresse IP personnalisée, IPv4 ou IPv6\r\n\r\nLa ligne de commande de l’expéditeur de paquets peut se lier à des ports personnalisés pour forcer les modes IPv4/6 ou plusieurs cartes réseau à l’aide de l’option -B.\r\n```texte\r\npacketsender -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\r\npacketsender -taw 3000 192.168.0.201 5005 « Bonjour\\r »\r\npacketsender -B 192.168.0.200 -taw 3000 192.168.0.201 5005 « Bonjour\\r »\r\npacketsender -B fe80::a437:399a:3091:266a%ethernet_32769 -taw 3000 fe80::c07b:d517:e339:5a08 5005 « Bonjour\\r »\r\npacketsender -B fe80::a437:399a:3091:266a -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\r\n```\r\n\r\n## Exemple d’interface de ligne de commande utilisant SSL et ignorant les erreurs\r\n\r\nLa ligne de commande a la possibilité d’ignorer ou d’abandonner les erreurs SSL. La valeur par défaut est d’ignorer.\r\n\r\n* Utilisez l’option -s pour envoyer SSL et ignorer les erreurs.\r\n* Utilisez l’option -S pour envoyer SSL et arrêter les erreurs\r\n\r\n```texte\r\npacketsender -saw 500 expired.packetsender.com 443 « GET / HTTP/1.0\\r\\n\\r\\n »\r\nErreur SSL : Le certificat a expiré\r\nSSL (54202)://expired.packetsender.com:443 47 45 54 20 2f 20 48 54 54 50 2f 31 2e 30 0d 0a 0d 0a\r\nChiffrer: Chiffré avec AES(128)\r\n\r\nTemps de réponse:3:24:55.695 pm\r\nRéponse HEX:48 54 54 50 2f 31 2e 31 20 34 32 31 20 0d 0a 53 65 72 76 65 72 3a 20 6e 67 69 6e 78 2f 31 2e 31 30 2e 30 20 28 55 62 75 6e 74 75 29 0d\r\nRéponse ASCII:HTTP/1.1 421 \\r\\nServeur: nginx/1.10.0 (Ubuntu)\\r\r\n```\r\n\r\n## Exemple d’interface de ligne de commande utilisant HTTP\r\nNotez que cela utilise les paquets par défaut intégrés.\r\n```texte\r\npacketsender --name « HTTPS POST Params »\r\npacketsender --http GET « https://httpbin.org/get »\r\npacketsender --http POST « https://httpbin.org/post » « {} »\r\n```\r\n\r\n\r\n\r\n<a id=\"cliintensetraffic\"></a>\r\n\r\n## Exemple d’utilisation de CLI Intense Traffic Generator\r\nLe générateur de trafic intense de commande fonctionne à peu près de la même manière que la version GUI, mais il est un peu plus précis, avec plus d’options de contrôle (et plus d’intensité!).\r\n\r\nVoir ci-dessous pour des exemples de son utilisation. Notez que ces calculs sont « Meilleur effort ». Il fonctionne bien, mais les pics de processeur ou divers hoquets réseau peuvent le décourager. Le filetage n’est pas en temps réel, et n’est pas super intelligent avec ses tentatives de compensation.\r\n\r\n* Renvoyer « Mon paquet génial» à un taux de 20 Hz\r\n* Renvoyez « Mon paquet génial » à un bps de 2000 bauds\r\n* Renvoyez « Mon paquet génial » aussi vite que possible\r\n* Renvoyez « Mon paquet génial » avec un délai de 2000000 microsecondes entre chaque paquet\r\n\r\n**Note: Pour Windows, utilisez la version « .com », de sorte que chaque exemple soit packetsender.com**\r\n\r\n```texte\r\npacketsender --rate 20 --Nom « Mon paquet génial »\r\npacketsender --bps 2000 --nom «Mon paquet génial »\r\npacketsender --rate 0 --nom « Mon paquet génial »\r\npacketsender --usdelay 2000000 --nom « Mon paquet génial »\r\n```\r\n\r\n\r\n<a id=\"building\"></a>\r\n# Création de packet sender\r\nLa seule dépendance est Qt SDK\r\n\r\n## Création de packet sender pour Windows / MAC\r\n1. Téléchargez le programme d’installation de Qt depuis http://www.qt.io/download-open-source/\r\n1. Laissez-le installer MingGW si vous n’avez pas de compilateur.\r\n1. Ouvrir le projet PacketSender.pro\r\n1. créer!\r\n\r\nLes versions Windows et Mac ont été créer en utilisant Qt 5.12. Packet Sender prend en charge Qt 6, mais il ne le fait pas\r\nSoutenez CMAKE.\r\n\r\n## Création de Packet Sender Pour Linux\r\nVoici la séquence de commandes pour Ubuntu 16.04. Veuillez vous adapter à votre plate-forme Linux. Packet Sender ne nécessite aucune bibliothèque supplémentaire au-delà du SDK Qt stock. On m’a dit qu’il y avait des problèmes de construction avec Fedora stock. Si un assistant Fedora a des idées, faites-le moi savoir, et j’ajouterai vos instructions.\r\n\r\nSi vous vous sentez aventureux, n’hésitez pas à construire à partir de la branche principale. Il contient la dernière version stable. La branche du développement devrait probablement être évitée.\r\n\r\n```bash\r\nsudo apt-get mise à jour\r\nsudo apt-get install qt5-default build-essential\r\nwget https://github.com/dannagle/PacketSender/archive/(Version).tar.gz\r\ntar -xzvf (Version).tar.gz\r\ncd PacketSender-(Version)/src\r\nqmake PacketSender.pro\r\nfaire\r\n```\r\n\r\nPour exécuter l’utilisation :\r\n```texte\r\n./PacketSender\r\n```\r\n\r\nS’il ne s’exécute pas, vous devrez peut-être le définir exécutable\r\n```texte\r\nchmod a+x PacketSender\r\n```\r\n\r\n\r\n# Améliorations/Demandes\r\n\r\nIl vous manque une fonctionnalité ? Vous pouvez [m’engager pour l’ajouter à Packet Sender](https://packetsender.com/enhancements).\r\n\r\n# Droit / Conformité\r\n\r\nLa licence est GPL v2 ou ultérieure. [Contactez-moi](https://packetsender.com/contact) si vous avez besoin d’une licence différente.\r\nCertaines distributions de Packet Sender peuvent utiliser [OpenSSL](https://www.openssl.org/).\r\nLe VPAT le plus récent [peut être trouvé](vpat_2.4_packetsender.pdf) dans ce référentiel.\r\n\r\n\r\n# Droit d’auteur\r\n\r\nPacket Sender a été écrit par [Dan Nagle](https://dannagle.com/) et est publié par &copy; NagleCode, LLC - [@NagleCode](https://twitter.com/NagleCode) - [PacketSender.com](https://packetsender.com)\r\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 37.14453125,
          "content": "# Introduction\r\n\r\n![Packet Sender Logo](screenshots/packetsender_banner.png)\r\n\r\n\r\n*Read this in other languages: [English](README.md), [Español](README.es.md), [Deutsch](README.de.md), [Français](README.fr.md).*\r\n\r\n\r\n[![Downloads](https://img.shields.io/github/downloads/dannagle/PacketSender/total.svg)](https://packetsender.com/download)\r\n\r\nPacket Sender is an open source utility to allow sending and receiving TCP, UDP, and SSL (encrypted TCP) packets as well as HTTP/HTTPS requests and panel generation. The mainline branch officially supports Windows, Mac, and Desktop Linux (with Qt). Other places may recompile and redistribute Packet Sender. Packet Sender is free and licensed GPL v2 or later. It can be used for both commercial and personal use. If you find the app useful, please consider donating/sponsoring so development may continue.\r\n\r\n\r\n\r\n# Table Of Contents\r\n* [Sponsors](#sponsors)\r\n  * Visit [IWL.com](https://www.iwl.com/)\r\n  * Visit [NagleCode.com](https://dannagle.com/)\r\n  * Visit [Eletiope.com](http://eletiope.com/)\r\n\r\n* [GUI](#gui)\r\n* [Intense Traffic Generator (GUI)](#udptraffic)\r\n* [Network](#network)\r\n* [Downloads](#downloads)\r\n* [Support](#support)\r\n* [IPv4 Subnet Calculator](#subnetcalculator)\r\n* [Wake-On-LAN / Magic Packet](#wakeonlan)\r\n* [Packet Sender Cloud](#cloud)\r\n* [Portable Mode](#portable)\r\n* [Macros and Smart Responses](#smartresponses)\r\n* [Persistent TCP and SSL](#persistent)\r\n* [HTTP/HTTPS Requests](#http)\r\n* [Panel Generator](#panelgen)\r\n* [Command Line Interface](#cli)\r\n* [Intense Traffic Generator (CLI)](#cliintensetraffic)\r\n* [Building Packet Sender](#building)\r\n\r\n\r\n\r\n\r\n<a id=\"sponsors\"></a>\r\n## Sponsors\r\n\r\nPacket Sender would like to thank the following sponsors.\r\n\r\n[![IWL](screenshots/iwl_logo.png)](https://www.iwl.com/)\r\n<br>IWL is a California company creating computer networking products.\r\n<br><br><br>\r\n\r\n[![NagleCode](screenshots/naglecode-logo400.png)](https://dannagle.com)\r\n<br>NagleCode is a software publisher and development studio. \r\n<br><br><br>\r\n\r\n[![Eletiope](screenshots/eletiope_logo400.png)](http://eletiope.com)\r\n<br>Eletiope installs lighting, audiovisuals and immersive rooms for exhibitions and museums, and for corporate showrooms. \r\n<br><br><br>\r\n\r\n\r\n[Would you like your name/logo listed here?](https://github.com/sponsors/dannagle)\r\n\r\n\r\n\r\n<a id=\"support\"></a>\r\n## Support\r\n\r\n* Twitter/X: [@NagleCode](https://x.com/NagleCode)\r\n* Forums are at: [GitHub Discussions](https://github.com/dannagle/PacketSender/discussions).\r\n* Email: [Packet Sender Contact](https://packetsender.com/contact)\r\n* Connect with me on [LinkedIn](https://www.linkedin.com/in/dannagle/)\r\n\r\n*NOTE:* Try (temporarily) disabling your firewall if having problems in Windows.\r\n\r\n<a id=\"downloads\"></a>\r\n# Downloads\r\n\r\n## Desktop Download\r\nOfficial releases of Packet Sender can be downloaded at  [PacketSender.com](https://packetsender.com/download). Some places redistribute Packet Sender.\r\n\r\n![Windows Logo](screenshots/winlogo150.png) ![Mac Logo](screenshots/maclogo150.png) ![Linux Logo](screenshots/Tux150.png)\r\n\r\n\r\n<!--\r\nNot sure when this will be back.\r\n\r\n## Mobile Apps\r\nThe Packet Sender mobile editions are fully native, contain bare minimum permissions, and collects no data. This is software that respsects you. Thank you for supporting this effort.\r\n\r\n\r\n### Android Mobile App\r\n![Android Logo](screenshots/android_logo.png)\r\n\r\nThe Android version is located [on Google Play](https://play.google.com/store/apps/details?id=com.packetsender.compose) or [on Amazon Appstore](https://www.amazon.com/dp/B08RXM6KM2/)\r\n\r\n[![Packet Sender Android](screenshots/packetsender_android_screenshot.png)](https://play.google.com/store/apps/details?id=com.packetsender.compose\r\n\r\n-->\r\n\r\n\r\n<!--\r\nNot sure when this will be back.\r\n\r\n## iOS Mobile App\r\n\r\n![Packet Sender logo](screenshots/ios_logo.png)\r\n\r\nThe iOS version is located [on the Apple App Store](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n[![Packet Sender iOS](screenshots/packetsender-ios-traffic-log-ascii.png)](https://apps.apple.com/app/id1558236648#?platform=iphone)\r\n\r\n-->\r\n<a id=\"gui\"></a>\r\n# GUI \r\n\r\nPacket Sender is identical for all the desktop versions. The only difference is its theme to match the operating system.\r\n\r\n![Packet Sender screenshot](screenshots/ps_GUI.png)\r\n\r\n1. A packet has a name, destination address (domain names are default resolved just before sending), port, and data associated with it.\r\n2. In the table, there is a list of saved packets. You can double-click to directly edit fields in this table.\r\n3. In the bottom right, there are UDP, TCP, and SSL server status and port(s). Clicking on these will activate or deactivate the protocol. Packet Sender supports binding to any number of ports.\r\n4. There is also a IP toggle button. Clicking this changes it to IPv4 (default), IPv6, or custom IP\r\n\r\n### General Notes\r\n* A resend value of \"0\" means it is a single-shot packet.\r\n* During packet resending, there will be a button to cancel all resends.\r\n* Please check your firewall. Windows aggressively blocks TCP-based servers. Packet Sender will still work if the firewall blocks it, but it can't receive unsolicited TCP-based packets.\r\n* An optional response can be sent. The same response is used for TCP,  UDP, and SSL.\r\n* For IPv6 sending, you will also need the scope ID.\r\n* Packet Sender supports mixed ASCII and HEX notation:\r\n  * Double-click either field to bring up the multi-line editor\r\n  * \\XX gets translated to XX in hex\r\n  * \\n, \\r, \\t will get translated to 0A, 0D, and 09\r\n  * HEX numbers are space delimited\r\n    * The HEX field will attempt to interpret other common delimiters (such as commas, colons (Wireshark), semicolons, \" 0x\", etc) and auto-correct. It is very fault-tolerent.\r\n    * A single stream of HEX is also supported. If the number of bytes is odd, Packet Sender will assume the front byte needs a zero and then auto-correct.\r\n  * Example ASCII: hello world\\r\r\n  * Example HEX: 68 65 6c 6c 6f 20 77 6f 72 6c 64 0d\r\n  * You may save a packet directly from the traffic log. You will be prompted for a name, and the source address and port will be switched for your convenience.\r\n  * You may also load a file directly in to the HEX field. The HEX field supports sending up to 10,922 bytes. The theoretical limit for sending via the command line is 200 MB.\r\n\r\n\r\n## Hotkeys/Keyboard Shortcuts\r\n\r\nThe fields at the top can be navigated using CTRL+1, CTRL+2, etc, up to CTRL+8 (send button). On Mac, the shortcut key is Command.\r\n\r\nThe hotkeys and fields are:\r\n* CTRL + 1 = Name\r\n* CTRL + 2 = ASCII\r\n* CTRL + 3 = HEX\r\n* CTRL + 4 = Address\r\n* CTRL + 5 = Port\r\n* CTRL + 6 = Resend Delay\r\n* CTRL + 7 = Protocol Selection\r\n* CTRL + 8 = Send (executes)\r\n\r\n\r\nSome notes:\r\n* The fields are linked to the corresponding hotkey regardless of protocol selection.\r\n* When you navigate to the TCP/UDP/SSL option, you may use up/down or t/u/s/h characters to make a selection.\r\n* If you are going to automate with hotkeys (using tools such at [AutoHotKey](https://www.autohotkey.com/)), you may want to turn off \"Restore previous session\".\r\n\r\n\r\n\r\n<a id=\"network\"></a>\r\n# Network Features\r\n\r\n## Basic Settings\r\nBy default, Packet Sender launches with UDP, TCP, and SSL servers enabled on random ports (shown as buttons on the bottom right). You may bind to any number of ports (if the OS allows it), using comma-separated port numbers. For example, `0, 1000, 2000` will bind to \"random\" and ports 1000, 2000.\r\n\r\n![Basic Network Settings](screenshots/basic_network_settings.png)\r\n\r\nThe UDP button now shows 3 ports bound. 1 of them is random.\r\n\r\n![Bound UDP Example](screenshots/bound_udp_example.png)\r\n\r\nThe other setting is to respond to all requests with a reply. You may also have this request be a macro. There is a field to type the reply (or load a saved packet).\r\n\r\n\r\n## Additional UDP/TCP/SSL Settings\r\nBy default, Packet Sender binds to any IPv4 address. In this area of the settings, you may have it bind to any IPv6 instead, or to a specific IP address. \r\n\r\nBinding to a specific address is very helpful when there are multiple NICs and you want to force communication (like broadcast packets) out a specific one.\r\n\r\n![Bound UDP Example](screenshots/additional_network_settings.png)\r\n\r\nSome protocols expect the server to send data before the client sends (such as many telnet services). This workflow can be enabled with the \"Receive Before Send\".\r\n\r\nIf you have a slow device (such an embedded server with a weak processor), you may wish to enable \"500 ms delay after connect\". This will allow the slow server time to launch its handler.\r\n\r\n## IPv4, IPv6, Custom IP\r\n\r\nPacket Sender's built-in servers are configured to support either IPv4 or IPv6 but not both at the same time. For clients, Packet Sender GUI and CLI will seamlessly switch between the two modes upon sending (scope ID may be needed for IPv6). Click the IPv4 / IPv6 toggle on the bottom right to switch between the two.\r\n\r\nInside the settings, you may also force Packet Sender's servers to bind to a custom IP address. This can be very useful for systems with multiple NICs or complicated IP setups. Packet Sender will trigger an error if told to bind to an address that does not exist.\r\n\r\n![IP Specific binding](screenshots/ip-specific-binding.png)\r\n\r\n\r\n<a id=\"subnetcalculator\"></a>\r\n## IPv4 Subnet Calculator\r\n\r\nPacket Sender has a built-in subnet calculator. It is under the Tools menu.\r\n![Packet Sender Subnet Calc](screenshots/packetsender_subnetcalc.PNG)\r\n\r\n* The log window (bottom section) will display non-loopback IPv4 and IPv6 addresses found on your computer.\r\n* On the left side, input the IPv4 address in the IP field. \r\n* On the left side, input the subnet in either X.X.X. or /XX notation\r\n* The results of the calculation are on the right.\r\n* The field below is a quick check to see if an IPv4 is within one of your subnets.\r\n\r\n\r\n<a id=\"wakeonlan\"></a>\r\n## Wake-On-LAN / Magic Packet\r\n\r\nWake-On-LAN (or WOL) is a protocol that tells computers to wake up from sleep. It is triggered by a broadcast packet with special data based on the target's MAC address. For more information, [take a look at Wikipedia](https://en.wikipedia.org/wiki/Wake-on-LAN).\r\n\r\nPacket Sender has a built-in WOL generator. It is under the Tools menu.\r\n\r\n![WOL Tool](screenshots/wake_on_lan_screenshot.png)\r\n\r\nFill out the options, and the main GUI will be filled with the correct data for the WOL format. \r\n\r\n![WOL results](screenshots/wake_on_lan_results_screenshot.png)\r\n\r\nThere are also CLI options to help generate and send WOL packets\r\n\r\n```text\r\npacketsender --wol f8:23:66:30:e5:30\r\nSending broadcast Wake-On-LAN to target: F8:23:66:30:E5:30 on port 7\r\nUDP (60360)://255.255.255.255:7 ff ff ff ff ff ff f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30 f8 23 66 30 e5 30\r\n```\r\n\r\n## SSL Client and Server\r\n\r\nPacket Sender supports establishing encrypted connections over SSL.\r\nThis is supported in the GUI and on the command line.\r\n\r\nPacket Sender bundles OpenSSL for use in Windows. On Mac and Linux, Packet Sender will use the native SSL libraries.\r\n\r\n![Packet Sender Direct TCP](screenshots/packetsender_ssl.PNG)\r\n\r\nSSL Notes:\r\n* The certificate negotiation is handled immediately during connection.\r\n* By default, Packet Sender ignores all SSL errors (expired cert, wrong host name, self-signed, etc).\r\n* Packet Sender outputs the cert negotiation progress in to the traffic log.\r\n* Packet Sender outputs the encryption algorithm used in the traffic log (such as AES 128).\r\n\r\nPacket Sender bundles an internal \"Snake Oil\" certificate for use as a server for Windows. The certificate and key is in the same place as packet and settings.\r\n\r\n_Note: Overriding the cert locations in Settings also overrides the snake-oil certificate._\r\n\r\nIf there is an SSL error, Packet Sender will output it to the traffic log. If the setting is to continue anyway (default), it will continue to negotiate encryption. Otherwise, the connection ends with failure to connect.\r\n\r\n![Packet Sender Direct TCP Expired](screenshots/packetsender_expired_ssl.png)\r\n\r\n## Multicast (Experimental)\r\n\r\nPacket Sender's multicast support is triggered by attempting to send to a IPv4 multicast address or from the mulitcast submenu. The feature is currently experimental and has these known problems.\r\n\r\n* Packet Sender abandons IPv6 support when joining multicast.\r\n* And stays abandoned until you revisit settings or attempt to send to IPv6\r\n* On wifi, it sometimes takes 20 seconds for multicast join to actually take effect.\r\n* Packet Sender has no logic to rejoin a mulitcast group if the switch reboots or some other common error.\r\n\r\nThere is no IPv6 multicast support, though it is on the roadmap. Sponsors wanting IPv6 multicast support are welcome to contact me.\r\n\r\n<a id=\"udptraffic\"></a>\r\n\r\n## UDP Traffic Generator (Experimental)\r\n\r\nFor when the normal send system is not enough, you can hammer a target IP with packets to see if your device can handle it. This can be found in the GUI toolbar at _Tools -> Intense Traffic Generator_\r\n\r\nPlease note that this feature is experimental and the metrics displayed have not been fully tested. For a more accurate test, you may want to look at the CLI version of this tool.\r\n\r\n![IP Specific binding](screenshots/udp-traffic-sending.PNG)\r\n\r\n# Packet Sender Features\r\n\r\n\r\n<a id=\"cloud\"></a>\r\n## Packet Sender Cloud\r\n\r\nPacket sets can be quickly saved/retrieved/shared using the free [Packet Sender Cloud](https://cloud.packetsender.com/) service. The cloud may also be used to publicly display and distribute your packets (via an URL) for collaboration, tutorials, end users, etc. Packet Sender may import public packet sets with public URL.\r\n\r\nThere are various reasons to do this:\r\n\r\n* Keeping all your packets ready so you can quickly retrieve them when installing a fresh Packet Sender\r\n* Quickly swapping between packet sets when working on different projects.\r\n* Sharing a login (it is allowed) for collaborative packet set generation\r\n* Having a public page of your packet sets so others can quickly find and import\r\n\r\n![Packet Sender Cloud Import](screenshots/cloud-import.png)\r\n\r\nIf you are publishing a network API, maintaining a public cloud page is significantly easier than painfully detailing (IP, port, type, etc) the packets to your users. Plus, updating that page is easy.\r\n\r\nMore information about it can be found at\r\nhttps://cloud.packetsender.com/help\r\n\r\n\r\n<a id=\"portable\"></a>\r\n## Portable Mode\r\n\r\nPacket Sender has a \"portable\" mode. At launch, it will look for `portablemode.txt` and populate any missing settings files in that run-time directory. These files are  `packets.ini`, `ps_settings.ini`, `ps.key`, and `ps.pem`.\r\nYou may also have some files portable and the other in their standard location by removing portablemode.txt.\r\n\r\n### DDLs that can be removed in Console-only portable Mode\r\nIf you do not require the GUI, you may remove these DDLs\r\n- Qt6Svg.dll\r\n- Qt6Widgets.dll\r\n- Qt6Gui.dll\r\n- opengl32sw.dll\r\n- D3Dcompiler_47.dll\r\n- iconengines directory\r\n- imageformats directory\r\n- styles directory\r\n\r\nNote that DLLs with `+` characters in their names that can cause problems with Windows command-line copy if you do not surround them with `\"` .\r\n\r\n### DDLs that can be removed if you do not need secure connections\r\nIf you do not require SSL, you may remove these DDLs\r\n- libcrypto-1_1-x64.dll\r\n- libssl-1_1-x64.dll\r\n\r\n\r\nThe run-time directory Windows users is the same place as the .exe.\r\n\r\nFor MAC users, this run-time directory is at `PacketSender.app/Contents/MacOS`.\r\nIf INI files are found, it will use them instead of `%APPDATA%` or `Library/Application Support`.\r\n\r\n\r\n<a id=\"smartresponses\"></a>\r\n## Smart Responses\r\n\r\nPacket Sender supports up to 5 smart responses. \r\n\r\nTo enable this feature, go to _File -> Settings_ at the GUI toolbar. Go to the _Smart Responses_ tab and enable the **Send a Smart Response** checkbox.  \r\n\r\n![Packet Sender Direct TCP](screenshots/packetsender_smartreply.PNG)\r\n\r\n* Packet Sender will compare the packet within the encoding you choose.\r\n* Packet Sender translates the encoding before sending out the reply.\r\n* The available encodings are:\r\n  * Mixed ASCII -- The standard Packet Sender way of encoding ASCII along with non-printable characters\r\n  * HEX -- Packet Sender's normal HEX encoding\r\n\r\n\r\n## Macros\r\n\r\nPacket Sender supports these macros when sending responses:\r\n\r\n* {{DATE}} -- Sends the current date in \"yyy-mm-dd\" format.\r\n* {{TIME}} -- Sends the current time in \"hh:mm:ss ap\" format.\r\n* {{UNIXTIME}} -- Sends the current epoch time stamp.\r\n* {{COUNTER}} -- Sends an incrementing counter for each packet that uses it. Starts at 1 at launch.\r\n* {{RANDOM}} -- Sends a random number ranging from either 0 to 32767 or 2147483647, depending on 32-bit or 64-bit (default installer for Windows is 32-bit. Mac is 64-bit).\r\n* {{UNIQUE}} -- Sends a random string. Uses an internal UUID to generate it.\r\nPacket Sender will swap the macro with real values before sending.\r\n\r\n\r\n<a id=\"persistent\"></a>\r\n## Persistent TCP and SSL\r\n\r\nPacket Sender supports persistent TCP and SSL connections via a separate GUI window. It is enabled by a checkbox on the main window or through the Settings window.\r\n\r\n![Packet Sender Direct TCP and SSL](screenshots/packetsender_direct_tcp.PNG)\r\n\r\n### Notes on Persistent TCP and SSL:\r\n* Any number of persistent connections can be created.\r\n* Previously saved packets can be loaded in the drop-down.\r\n* There is a \"Raw\" view and \"ASCII\" view. The ASCII view is useful to troubleshoot data that is not printed by the raw view.\r\n* Traffic is also saved in the main window traffic log.\r\n* A file may be uploaded to the persistent connection. You may wish to turn off logging if you use this.\r\n* The timer in the bottom left starts as soon as a valid data packet is sent/received. It stops when the connection is closed.\r\n* You may optionally append a carriage return when you quick-send by hitting the return key. This is useful for command-prompt menus over TCP  / SSL connections. Packet Sender remembers previous state of \\r checkbox.\r\n* Incoming persistent connections to the server will launch the separate GUI window.\r\n* During resend, the persistent connection packet is carried over to the new GUI window. Clicking \"Resending(1)\" will cancel it.\r\n\r\nPersistent connections are not supported via the command line.\r\n\r\n\r\n<a id=\"http\"></a>\r\n# HTTP/HTTPS POST & GET\r\nPacket Sender supports sending POST/GET requests via HTTP and HTTPS. \r\nProtocol dropdown includes the following options: HTTP GET, HTTP POST, HTTPS GET, HTTPS POST. When selecting HTTP(S), input fields will udpate to: Name, Request, Address, Data (when POST is selected), Generate Data button (when POST is selected), Load FIle (when POST is selected). \r\n\r\n## Sending HTTP/HTTPS GET/POST Requests\r\n![](/screenshots/ps_http_getfields.PNG)\r\n* Select HTTP(S) GET or POST from the protocol dropdown\r\n* In *Address* field input the domain or IP\r\n* In *Request* field add the URL path, if needed\r\n* In *Port* field, the default for HTTP is 80 and HTTPS is 443\r\n* Check *Persistent TCP* to see the server data more clearly (HTTP headers are removed automatically). \r\n\r\n**You may also paste a complete URL in the Request field and Packet Sender will parse and auto-populate the other fields.**\r\n\r\n### For POST Requests:\r\n* You can manually add in the data into the *Data* field.\r\n\t* Format would go: key=value\r\n\t* For multiple paramaters: key=value&key=value&key=value\r\n* Or you can click on the *Generate Data* button\r\n\r\n<img src=\"/screenshots/ps_http_datagenerator.PNG\" width=\"400\" height=\"284\">\r\n\r\n* To add data, input the Key and Value parameters. Click the **+** button. \r\n* Can add multiple parameters with the + button. \r\n* Remove parameters by clicking the X button next to the parameter\r\n* Once parameters are added, click Ok and data will be generated in the Data field. \r\n\r\n### To add Authentication credentials:\r\n\r\n<img src=\"/screenshots/ps_http_authgenerator.PNG\" width=\"800\" height=\"339\">\r\n\r\n* Go to File -> Settings -> HTTP\r\n* Check *Generate Auth Header*\r\n* Input the *Host*, *UN/Client ID*, and *PW/Access*\r\n* Click on *HTTP Auth Header* to generate the authentication header\r\n\r\n<a id=\"panelgen\"></a>\r\n# Panel Generator\r\nPacket Sender supports generating control panels. Panels consist of buttons with scripts (packets) assigned to them. Clicking the button will execute the packet(s) referenced on that button. \r\n\r\n<img src=\"/screenshots/ps_panel_1.PNG\" width=\"400\" height=\"358\">\r\n\r\n## Loading a Panel\r\nPanels can be created one of two ways:\r\n* Clicking **Panels** on the toolbar and selecting either Load Starter Panel or Empty Panel Project\r\n\t* Load Starter Panel will load the Panel assigned as starter. If no panel is set as the starter, an empty panel project will open. \r\n* Highlighting 2 or more saved packets and clicking on the **Generate Panel** button (Generate Panel button only appears when multiple packets are selected) \r\n\r\nPacket Sender supports launching in panel-only mode with the starter panel using the command line option `--starterpanel`\r\n\r\n![](/screenshots/ps_panel_generate.PNG)\r\n\r\n\r\n## Scripting a Panel\r\nTo begin scripting the buttons on your panel, you will need to open a panel and go to the Editing screen. Once a panel project is opened, check the button in the bottom right corner. If this button says \"Viewing\", you are on the Viewing screen. Click the button to move the panel to the Editing screen. \r\n\r\nOnce at the Editing screen, buttons and scripts can be added to the panel. \r\n\r\n### Button Scripting\r\nButton scripts will contain the name of the packet to be sent. \r\n\r\n<img src=\"/screenshots/ps_panel_2.PNG\" width=\"400\" height=\"360\">\r\n\r\nMultiple packets can be set to a button by adding each name on a new line.\r\n\r\n<img src=\"/screenshots/ps_panel_5.PNG\" width=\"400\" height=\"358\">\r\n\r\nPanel Generator supports adding a delay between multiple packets by adding \"delay:_# of seconds_\" in between packets.\r\n\r\n<img src=\"/screenshots/ps_panel_4.PNG\" width=\"400\" height=\"359\">\r\n\r\nPanel Generator supports adding a script to load a new panel by adding \"panel:_panel id #_\". Once all previous scripts on the button are executed, the Panel will transition to the next panel. \r\n\r\n<img src=\"/screenshots/ps_panel_8.PNG\" width=\"400\" height=\"358\">\r\n\r\n\r\n### Adding Files/URLs\r\nPanel Generator supports adding buttons that link to locally-stored files or URLs. \r\nFile/URL buttons can be added while in the Editing screen by clicking the *+* in the bottom right corner. \r\n* For files: Go to the file on the PC, right click on the file and select Copy. Paste this into the _URL or File_ textbox in Packet Sender\r\n* For URLs: Copy the URL into the _URL or File_ textbox in Packet Sender\r\n\t* URLs must begin with http:// or https://\r\n\r\n\r\n![](/screenshots/ps_panel_7.PNG) \r\n\r\nOnce the file or URL is copied, you will be prompted to input a name for the button. Buttons will populate at the bottom of the panel. \r\n\r\nWhile on the Editing screen, clicking these buttons will allow you to edit the file/URL link and the name of the button. You can also delete the button by clicking the **X** on the popup. \r\n\r\n![](/screenshots/ps_http_changeURL.PNG)\r\n\r\nWhen on the Viewing screen, clicking these buttons will launch the URL in the default browser or open the file (with the default program for the file type). \r\n\r\n\r\n![](/screenshots/ps_panel_6.PNG) \r\n\r\n### Panel Editing/Saving\r\nWhile in the Editing screen of a Panel, there will be a toolbar with menus File, Export, Settings, Help. You can save, export, import, load panel projects, and edit the current panel project from this toolbar. \r\n\r\nFrom Settings, you can do the following:\r\n* Set Panel Name - select this to rename the current panel project\r\n* Set Panel ID - select this to change the ID associated with the current panel project\r\n_Note: Setting an ID in use will replace that panel_\r\n* Starter Panel - select this to set the current panel project as the starter panel. \r\n* Delete Panel - This will bring up a menu of current panel projects. Select a panel project to delete it. _Note: Buttons and scripts will be retained on the Editing screen until the Panel is closed_\r\n\r\n# DTLS\r\nFor now, DTLS is only supported in the GUI with Windows. Other operating systems may enable DTLS by compiling from source using Qt6.\r\n\r\n## Overview\r\nThis repository contains a DTLS (Datagram Transport Layer Security) protocol feature. This feature have added a graphical interface to configure and manage DTLS connections, including server verification and session persistence options.\r\n\r\n## Features\r\n\r\n### Main Window\r\n![Main Window](screenshots/main_window.png)\r\n- **Cipher Suites**: Dropdown to select the desired cipher suite for DTLS communication.\r\n- **Server Common Name**: Field to input the server’s common name for client-side verification.\r\n- **Persistent Session**: Option to save the session key after the first handshake by enabling the persistent checkbox.\r\n- **Optional Server Verification**: An option for enabling two-sided verification during the handshake.\r\n- **DTLS Server Port**: Button to define the DTLS server port for the connection.\r\n\r\n#### Additional Images:\r\n![Cipher Suites Dropdown](screenshots/cipher_suites.png)\r\n- A detailed view of the cipher suite selection dropdown.\r\n\r\n![Persistent Connection](screenshots/persistant_dtls.jpg)\r\n- Persistent connection window while DTLS.\r\n\r\n![Server Port](screenshots/server_ports.png)\r\n- On click button for DTLS server Enabling or disabling.\r\n\r\n### Settings Window\r\n\r\n#### Network Tab\r\n![Network Tab](screenshots/settings.png)\r\n- **Send Simple Acknowledge**: Checkbox to enable the sending of a simple acknowledgment.\r\n- **Enable DTLS Server**: Option to enable the DTLS server and select a port.\r\n- **Certificates and Keys**: Certificates and keys can be loaded similarly to SSL configuration.\r\n\r\n#### Smart Responses Tab\r\n![Smart Responses Tab](screenshots/settings_2.png)\r\n- **Smart Responses**: Smart responses feature works over the DTLS protocol.\r\n\r\n## Wireshark Integration\r\nSniffing by Wireshark:\r\n\r\n### Regular Connection\r\n![Regular Connection](screenshots/wireshark_simple_session.png)\r\n- Example of a regular DTLS connection captured sniffed by Wireshark.\r\n\r\n### Persistent Connection\r\n![Persistent Connection](screenshots/wireshark_persistent_connection.png)\r\n- Example of a persistent DTLS connection sniffed by Wireshark.\r\n\r\n<a id=\"cli\"></a>\r\n# Command Line\r\nPacket Sender can be used from the command line on your computer. \r\n\r\nFor Windows, use the extension .com (`packetsender.com`) to use the command line interface. Optionally, you can also use `packetsender` without an extension. Using the extension .exe will launch the GUI. \r\n\r\n\r\n![Packet Sender CLI screenshot](screenshots/packetsender_command_line.png)\r\n\r\nFor Linux, the command line system in Packet Sender follows the same pattern as other Linux utilities. It has a long name (such as --version) and a short name (such as -v). These options can be arranged in any order and Packet Sender will parse them correctly. The last 3 options are positional and must appear last. They are IP, port, and data. These last options are optional if using a stored packet.\r\n\r\n```text\r\npacketsender --help\r\nUsage: C:\\Program Files\\PacketSender\\packetsender.com [options] address port data\r\nPacket Sender is a Network UDP/TCP/SSL/HTTP Test Utility by NagleCode\r\nSee https://PacketSender.com/ for more information.\r\n\r\nOptions:\r\n  -h, --help                Displays help on commandline options.\r\n  --help-all                Displays help including Qt specific options.\r\n  -v, --version             Displays version information.\r\n  -q, --quiet               Quiet mode. Only output received data.\r\n  -x, --hex                 Parse data-to-send as hex (default for\r\n                            TCP/UDP/SSL).\r\n  -a, --ascii               Parse data-to-send as mixed-ascii (default for http\r\n                            and GUI).\r\n  -A, --ASCII               Parse data-to-send as pure ascii (no \\xx\r\n                            translation).\r\n  -l, --listen              Listen instead of send. Use bind options to specify\r\n                            port/IP. Otherwise, dynamic/All.\r\n  -r, --response <ascii>    Server mode response data in mixed-ascii. Macro\r\n                            supported.\r\n  -w, --wait <ms>           Wait up to <milliseconds> for a response after\r\n                            sending. Zero means do not wait (Default).\r\n  -f, --file <path>         Send contents of specified path. Max 10 MiB for\r\n                            UDP, 100 MiB for TCP/SSL.\r\n  -b, --bind <port>         Bind port. Default is 0 (dynamic).\r\n  -6, --ipv6                Force IPv6. Same as -B \"::\". Default is IP:Any.\r\n  -4, --ipv4                Force IPv4.  Same as -B \"0.0.0.0\". Default is\r\n                            IP:Any.\r\n  -B, --bindip <IP>         Bind custom IP. Default is IP:Any.\r\n  -t, --tcp                 Send TCP (default).\r\n  -s, --ssl                 Send SSL and ignore errors.\r\n  -S, --SSL                 Send SSL and stop for errors.\r\n  -u, --udp                 Send UDP.\r\n  --http <http>             Send HTTP. Allowed values are GET (default) and\r\n                            POST\r\n  -n, --name <name>         Send previously saved packet named <name>. Other\r\n                            options overrides saved packet parameters.\r\n  --wol <mac>               Send Wake-On-LAN / Magic Packet to <mac> and\r\n                            (optional) <port>.\r\n  --bps <bps>               Intense traffic. Calculate rate based on value of\r\n                            bits per second.\r\n  --num <number>            Intense traffic. Number of packets to send. Default\r\n                            unlimited.\r\n  --rate <Hertz>            Intense traffic. Rate. Ignored in bps option.\r\n  --usdelay <microseconds>  Intense traffic. Resend delay. Used if rate is 0.\r\n                            Ignored in bps option.\r\n  --max                     Intense traffic. Run as fast as possible.\r\n\r\nArguments:\r\n  address                   Destination address/URL. Optional for saved packet.\r\n  port                      Destination port/POST data. Optional for saved\r\n                            packet.\r\n  data                      Data to send. Optional for saved packet.\r\n```\r\n## Example CLI\r\nThe CLI follows the same format between Windows, Linux, and MAC. \r\n\r\nThe format is: `packetsender [options] address port data`\r\n\r\n```text\r\npacketsender -taw 500 mirrors.xmission.com 21 \"USER anonymous\\r\\nPASS chrome@example.com\\r\\n\"\r\nTCP (65505)://mirrors.xmission.com:21 55 53 45 52 20 61 6e 6f 6e 79 6d 6f 75 73 0d 0a 50 41 53 53 20 63 68 72 6f 6d 65 40 65 78 61 6d 70 6c 65 2e 63 6f 6d 0d 0a\r\nResponse Time:5:51:37.042 pm\r\nResponse HEX:32 32 30 2D 57 65 6C 63 6F 6D 65 20...\r\nResponse ASCII:220-Welcome to XMission Internet...\r\n```\r\n\r\n## Example CLI to listen for packets (Server Mode)\r\nUse the existing bind options to configure the server. \r\n- -b for port\r\n- -B for iP\r\n- -t/-u/-s for TCP, UDP, or SSL\r\n- -r to send an response (macro supported ASCII)\r\n\r\nBinding to dynamic port using TCP\r\n```text\r\npacketsender -l\r\nTCP Server started on 0.0.0.0:52567\r\nUse ctrl+c to exit server.\r\n\r\nFrom: 127.0.0.1, Port:52568\r\nResponse Time:2024-06-04 19:01:53.198\r\nResponse HEX:48 65 6C 6C 6F \r\nResponse ASCII:Hello\r\n\r\nFrom: 127.0.0.1, Port:52569\r\nResponse Time:2024-06-04 19:02:24.063\r\nResponse HEX:57 6F 72 6C 64 \r\nResponse ASCII:World\r\n```\r\n\r\nBinding to port 8080 using UDP\r\n```text\r\npacketsender -l -u -b 8080\r\nUDP Server started on 0.0.0.0:8080\r\nUse ctrl+c to exit server.\r\n\r\nFrom: ::ffff:127.0.0.1, Port:49500\r\nResponse Time:2024-06-04 19:04:28.890\r\nResponse HEX:48 65 6C 6C 6F 20 55 44 50 20 50 61 63 6B 65 74 \r\nResponse ASCII:Hello UDP Packet\r\n```\r\n\r\nBinding to port 8080 using UDP with current time response\r\n```text\r\npacketsender -l -u -b 8080 -r \"{{TIME}}\"\r\nLoading response packet.\r\nUDP Server started on 0.0.0.0:8080\r\nUse ctrl+c to exit.\r\n\r\nFrom: ::ffff:127.0.0.1, Port:59594\r\nResponse Time:2024-06-05 20:48:18.180\r\nResponse HEX:68 65 6C 6C 6F 20 70 61 63 6B 65 74 20 73 65 6E 64 65 72 \r\nResponse ASCII:hello packet sender\r\n\r\nFrom: You (Response), Port:59594\r\nResponse Time:2024-06-05 20:48:18.182\r\nResponse HEX:30 38 3a 34 38 3a 31 38 20 70 6d \r\nResponse ASCII:08:48:18 pm\r\n```\r\n\r\n\r\nBinding to IP 192.168.86.26, port 54321 using SSL\r\n```text\r\npacketsender -l -s -B 192.168.86.26 -b 54321 \r\nBinding to custom IP 192.168.86.26\r\nListening for SSL packets in server mode. \r\nSSL Server started on 192.168.86.26:54321\r\nUse ctrl+c to exit server.\r\n\r\nFrom: 192.168.86.26, Port:52588\r\nResponse Time:2024-06-04 19:11:30.726\r\nError/Info:Encrypted with AESGCM(256)\r\n\r\nFrom: 192.168.86.26, Port:52588\r\nResponse Time:2024-06-04 19:11:30.726\r\nError/Info:Authenticated with RSA\r\n\r\nFrom: 192.168.86.26, Port:52588\r\nResponse Time:2024-06-04 19:11:30.726\r\nError/Info:Peer cert issued by \r\n\r\nFrom: 192.168.86.26, Port:52588\r\nResponse Time:2024-06-04 19:11:30.726\r\nError/Info:Our Cert issued by SnakeOil\r\n\r\nFrom: 192.168.86.26, Port:52588\r\nResponse Time:2024-06-04 19:11:30.747\r\nResponse HEX:43 6F 6F 6C 20 53 53 4C \r\nResponse ASCII:Cool SSL\r\n```\r\n\r\n\r\n## Examples binding to port and custom IP, IPv4, or IPv6\r\n\r\nPacket Sender command line can bind to custom ports to force IPv4/6 modes or multiple NIC using the -B option.\r\n```text\r\npacketsender -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\r\npacketsender -taw 3000 192.168.0.201 5005 \"Hello\\r\"\r\npacketsender -B 192.168.0.200 -taw 3000 192.168.0.201 5005 \"Hello\\r\"\r\npacketsender -B fe80::a437:399a:3091:266a%ethernet_32769 -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\r\npacketsender -B fe80::a437:399a:3091:266a -taw 3000 fe80::c07b:d517:e339:5a08 5005 \"Hello\\r\"\r\n```\r\n\r\n## Example CLI using SSL and ignoring errors\r\n\r\nThe command line has the option to ignore or abandon on SSL errors. The default is to ignore.\r\n\r\n* Use -s option to send SSL and ignore errors.\r\n* Use -S option to send SSL and stop for errors\r\n\r\n```text\r\npacketsender -saw 500 expired.packetsender.com 443 \"GET / HTTP/1.0\\r\\n\\r\\n\"\r\nSSL Error: The certificate has expired\r\nSSL (54202)://expired.packetsender.com:443 47 45 54 20 2f 20 48 54 54 50 2f 31 2e 30 0d 0a 0d 0a\r\nCipher: Encrypted with AES(128)\r\n\r\nResponse Time:3:24:55.695 pm\r\nResponse HEX:48 54 54 50 2f 31 2e 31 20 34 32 31 20 0d 0a 53 65 72 76 65 72 3a 20 6e 67 69 6e 78 2f 31 2e 31 30 2e 30 20 28 55 62 75 6e 74 75 29 0d\r\nResponse ASCII:HTTP/1.1 421 \\r\\nServer: nginx/1.10.0 (Ubuntu)\\r\r\n```\r\n\r\n## Example CLI using HTTP\r\nNote this uses the built-in default packets.\r\n```text\r\npacketsender --name \"HTTPS POST Params\"\r\npacketsender --http GET \"https://httpbin.org/get\"\r\npacketsender --http POST \"https://httpbin.org/post\" \"{}\"\r\n```\r\n\r\n\r\n\r\n<a id=\"cliintensetraffic\"></a>\r\n\r\n## Example using CLI Intense Traffic Generator\r\nThe command intense traffic generator works much the same way as the GUI version but it is a bit more accurate, with more control options, (and more intensity!).\r\n\r\nSee below for examples how to use it. Note that these calculations are \"Best Effort\". It does OK, but processor spikes or various network hiccups can throw it off. The threading is not real-time, and is not super-smart with its attempts to compensate.\r\n\r\n* Resend \"My Awesome Packet\" at a rate of 20 Hz\r\n* Resend \"My Awesome Packet\" at a bps of 2000 baud\r\n* Resend \"My Awesome Packet\" as fast as possible\r\n* Resend \"My Awesome Packet\" with 2000000 microsecond delay between each packet\r\n\r\n**Note: For Windows, use the \".com\" build, so each example would be packetsender.com**\r\n\r\n```text\r\npacketsender --rate 20 --name \"My Awesome Packet\"\r\npacketsender --bps 2000 --name \"My Awesome Packet\"\r\npacketsender --rate 0 --name \"My Awesome Packet\"\r\npacketsender --usdelay 2000000 --name \"My Awesome Packet\"\r\n```\r\n\r\n\r\n<a id=\"building\"></a>\r\n# Building Packet Sender\r\nThe only dependency is Qt SDK\r\n\r\n## Building Packet Sender for Windows/MAC\r\n1. Download the Qt installer from https://www.qt.io/download-open-source/\r\n1. Let it install MingGW if you don't have a compiler.\r\n1. Open the project PacketSender.pro\r\n1. Build! \r\n\r\nThe Windows and Mac versions were built using Qt 5.12. Packet Sender does support Qt 6, however it does not\r\nsupport cmake.\r\n\r\n## Building Packet Sender for Linux\r\nHere is the sequence of commands for Ubuntu 16.04. Please adapt to your Linux platform. Packet Sender requires no additional libraries beyond the stock Qt SDK. I have been told there are build issues with stock Fedora. If a Fedora wizard has insight, please let me know, and I'll add your instructions.\r\n\r\nIf you are feeling adventurous, feel free to build from the master branch. It contains the latest stable build. The development branch should probably be avoided.\r\n\r\n```bash\r\nsudo apt-get update\r\nsudo apt-get install qt5-default build-essential\r\nwget https://github.com/dannagle/PacketSender/archive/(Version).tar.gz\r\ntar -xzvf (Version).tar.gz\r\ncd PacketSender-(Version)/src\r\nqmake PacketSender.pro\r\nmake\r\n```\r\n\r\nTo run use:\r\n```text\r\n./PacketSender\r\n```\r\n\r\nIf it doesn't run, you may need to set it executable\r\n```text\r\nchmod a+x PacketSender\r\n```\r\n\r\n\r\n# Enhancements/Requests\r\n\r\nMissing a feature? You can [hire me to add it to Packet Sender](https://packetsender.com/enhancements).\r\n\r\n# Legal / Compliance\r\n\r\nLicense is GPL v2 or Later. [Contact me](https://packetsender.com/contact) if you require a different license.\r\nSome distributions of Packet Sender may use [OpenSSL](https://www.openssl.org/).\r\nThe most current VPAT [may be found](vpat_2.4_packetsender.pdf) in this repo.\r\n\r\n\r\n# Copyright\r\n\r\nPacket Sender was written by [Dan Nagle](https://dannagle.com/) and is published by &copy; NagleCode, LLC   -  [@NagleCode](https://x.com/NagleCode) - [PacketSender.com](https://packetsender.com)\r\n\r\n"
        },
        {
          "name": "ci_cd",
          "type": "tree",
          "content": null
        },
        {
          "name": "packetsender.png",
          "type": "blob",
          "size": 5.07421875,
          "content": null
        },
        {
          "name": "screenshots",
          "type": "tree",
          "content": null
        },
        {
          "name": "snapcraft.yaml",
          "type": "blob",
          "size": 1.5673828125,
          "content": "name: packetsender\nversion: 8.8.2\nsummary: Packet Sender - Free TCP/UDP/SSL/HTTP Utility\nicon: src/pslogo128.png\ndescription: |\n  Packet Sender - Free utility to for sending / receiving of network\n  packets. TCP, UDP, SSL, and HTTP. https://packetsender.com/\n\nplatforms:\n  amd64:\n    build-on: [amd64]\n    build-for: [amd64]\n\n# sudo snap install packetsender*.snap --dangerous\n\ngrade: stable\nbase: core24\nconfinement: strict\nenvironment:\n  QT_PLUGIN_PATH: \"$SNAP/usr/lib/$CRAFT_ARCH_TRIPLET/qt6/plugins\"\n\napps:\n  packetsender:\n    command: usr/local/bin/packetsender\n    desktop: usr/share/applications/packetsender.desktop\n    plugs:\n      - desktop\n      - desktop-legacy\n      - wayland\n      - x11\n      - home\n      - removable-media\n      - network\n      - cups\n      \nparts:\n  packetsender:\n    plugin: qmake\n    source: src/\n    qmake-project-file: PacketSenderSnap.pro\n    build-environment:\n      - QT_SELECT: qt6\n    build-packages:\n      - build-essential\n      - qt6-base-dev\n      - libqt6gui6\n      - libqt6core6\n      - qtchooser\n      - libxkbcommon-dev\n      - qt6-declarative-dev\n      - libgl1-mesa-dev\n      - libglvnd-dev\n      - libssl-dev\n      - libqt6core6\n      - libqt6gui6\n      - libqt6network6t64\n      - libqt6widgets6\n      - qt6-translations-l10n\n\n    stage-packages:\n      - qt6-base-dev\n      - qt6-declarative-dev\n      - libqt6core6\n      - libqt6gui6\n      - libqt6widgets6\n      - libqt6network6\n      - libqt6printsupport6\n      - libcurl4\n      - qt6-translations-l10n\n      - qt6-gtk-platformtheme\n      - qt6-qpa-plugins\n      - qt6-wayland\n      - cups-client\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "vpat_2.4_packetsender.doc",
          "type": "blob",
          "size": 239,
          "content": null
        },
        {
          "name": "vpat_2.4_packetsender.pdf",
          "type": "blob",
          "size": 509.2607421875,
          "content": null
        }
      ]
    }
  ]
}