{
  "metadata": {
    "timestamp": 1736565816465,
    "page": 746,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjc1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "MusicPlayerDaemon/MPD",
      "stars": 2218,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".clang-format",
          "type": "blob",
          "size": 0.41796875,
          "content": "BasedOnStyle: LLVM\nAccessModifierOffset: -8\nAllowAllConstructorInitializersOnNextLine: false\nAlwaysBreakTemplateDeclarations: Yes\nBraceWrapping:\n  AfterFunction: true\n  SplitEmptyFunction: true\nBreakConstructorInitializers: BeforeColon\nColumnLimit: 90\nConstructorInitializerIndentWidth: 0\nContinuationIndentWidth: 8\nIndentCaseLabels: false\nIndentPPDirectives: AfterHash\nIndentWidth: 8\nStandard: c++17\nTabWidth: 8\nUseTab: Always\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.072265625,
          "content": "*~\n\n.#*\n.stgit*\n\n/output/\n\n__pycache__/\n\n/.clangd/\n/compile_commands.json\n"
        },
        {
          "name": ".readthedocs.yaml",
          "type": "blob",
          "size": 0.4189453125,
          "content": "# Read the Docs configuration file for Sphinx projects\n# See https://docs.readthedocs.io/en/stable/config-file/v2.html for details\n\n# Required\nversion: 2\n\n# Set the OS, Python version and other tools you might need\nbuild:\n  os: ubuntu-22.04\n  tools:\n    python: \"3.12\"\n\npython:\n  install:\n    - requirements: \"doc/requirements.txt\"\n\n# Build documentation in the \"docs/\" directory with Sphinx\nsphinx:\n  configuration: doc/conf.py\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 1.7158203125,
          "content": "Music Player Daemon - http://www.musicpd.org\nCopyright 2003-2022 The Music Player Daemon Project\n\nThe following people have contributed code to MPD:\n\n Warren Dukes <warren.dukes@gmail.com>\n Avuton Olrich <avuton@gmail.com>\n Max Kellermann <max.kellermann@gmail.com>\n Laszlo Ashin <kodest@gmail.com>\n Viliam Mateicka <viliam.mateicka@gmail.com>\n Eric Wollesen <encoded@xmtp.net>\n Thomas Jansen <mithi@mithi.net>\n Romain Bignon <romain@peerfuse.org>\n David Guibert <david.guibert@gmail.com>\n Jochen Keil <jochen.keil@gmail.com>\n Jeffrey Middleton <jefromi@gmail.com>\n Sean McNamara <smcnam@gmail.com>\n Niklas Hofer\n Jim Ramsay <i.am@jimramsay.com>\n Guus Sliepen <guus@sliepen.eu.org>\n J. Alexander Treuman <jat@spatialrift.net>\n Eric Wong\n José Anarch <anarchsss@gmail.com>\n Patrik Weiskircher <pat@icore.at>\n Nick Welch <mack@incise.org>\n Jonathan Neuschäfer <j.neuschaefer@gmx.net>\n Anton Khirnov <anton@khirnov.net>\n Simon Kagstrom <simon.kagstrom@gmail.com>\n Denis Krjuchkov <denis@crazydev.net>\n Jurgen Kramer <gtmkramer@xs4all.nl>\n Jean-Francois Dockes <jf@dockes.org>\n Yue Wang <yuleopen@gmail.com>\n Matthew Leon Grinshpun <ml@matthewleon.com>\n Dimitris Papastamos <sin@2f30.org>\n Florian Schlichting <fsfs@debian.org>\n François Revol <revol@free.fr>\n Jacob Vosmaer <contact@jacobvosmaer.nl>\n Thomas Guillem <thomas@gllm.fr>\n Andrew Basterfield <abasterfield@gmail.com>\n Bart Nagel <bart@tremby.net>\n Christian Kröner <ckroener@gmx.net>\n Christopher Zimmermann <madroach@gmerlin.de>\n John Regan <john@jrjrtech.com>\n Joshua Wise <joshua@joshuawise.com>\n Ryan Walklin\n Stefan Roellin <stefan@roellin-baumann.ch>\n Stefano Miccoli <stefano.miccoli@polimi.it>\n Steven O'Brien <steven_obrien1@yahoo.co.uk>\n Thomas Zander <thomas.e.zander@googlemail.com>\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.5654296875,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "LICENSES",
          "type": "tree",
          "content": null
        },
        {
          "name": "NEWS",
          "type": "blob",
          "size": 93.1630859375,
          "content": "ver 0.24 (not yet released)\n* protocol\n  - new command \"searchcount\" (case-insensitive \"count\")\n  - \"playlistfind\"/\"playlistsearch\" have \"sort\" and \"window\" parameters\n  - allow range in \"playlistmove\"\n  - \"save\" can append to or replace an existing playlist\n  - filter \"prio\" (for \"playlistfind\"/\"playlistsearch\")\n  - limit \"player\" idle events to the current partition\n  - operator \"starts_with\"\n  - show PCRE support in \"config\" response\n  - apply Unicode normalization to case-insensitive filter expressions\n  - stickers on playlists and some tag types\n  - new commands \"stickernames\", \"stickertypes\", \"stickernamestypes\", \"playlistlength\", \"searchplaylist\", \"protocol\"\n  - new \"search\"/\"find\" filter \"added-since\"\n  - allow range in listplaylist and listplaylistinfo\n  - \"sticker find\" supports sort and window parameter and new sticker compare operators \"eq\", \"lt\", \"gt\", \"contains\" and \"starts_with\"\n  - consume only idle flags that were subscribed to\n  - volume command is no longer deprecated\n  - new \"available\" and \"reset\" subcommands for tagtypes\n  - searching stored playlists respond now with song position\n  - new sticker subcommand \"inc\" and \"dec\"\n* database\n  - attribute \"added\" shows when each song was added to the database\n  - proxy: require MPD 0.21 or later\n  - proxy: require libmpdclient 2.15 or later\n* archive\n  - add option to disable archive plugins in mpd.conf\n* storage\n  - curl: optimize database update\n  - nfs: require libnfs 4.0 or later\n  - nfs: support libnfs 6 (API version 2)\n  - nfs: support libnfs URL arguments\n* input\n  - alsa: limit ALSA buffer time to 2 seconds\n  - alsa: set up a channel map\n  - alsa: support the alsa-lib 1.2.11 API\n  - alsa: add option \"close_on_pause\"\n  - curl: add \"connect_timeout\" configuration\n* decoder\n  - ffmpeg: require FFmpeg 4.0 or later\n  - ffmpeg: query supported demuxers at runtime\n  - hybrid_dsd: remove\n  - mpg123: prefer over \"mad\"\n  - mpg123: support streaming\n  - opus: implement bitrate calculation\n  - sidplay: require libsidplayfp (drop support for the original sidplay)\n  - wavpack: require libwavpack version 5\n  - fix MixRamp bug\n* resampler\n  - soxr: require libsoxr 0.1.2 or later\n* player\n  - add option \"mixramp_analyzer\" to scan MixRamp tags on-the-fly\n  - \"one-shot\" consume mode\n* tags\n  - new tags \"TitleSort\", \"Mood\", \"ShowMovement\"\n* output\n  - add option \"always_off\"\n  - alsa: require alsa-lib 1.1 or later\n  - pipewire: map tags \"Date\" and \"Comment\"\n* switch to C++20\n  - GCC 10 or clang 11 (or newer) recommended\n* static partition configuration\n* Windows\n  - build with libsamplerate\n  - remove JACK DLL support\n* remove Haiku support\n* remove macOS support\n* remove Boost dependency\n* require libfmt 9 or later\n* documentation: switch to sphinx-rtd-theme\n* require Meson 1.0\n\nver 0.23.16 (2024/12/03)\n* database\n  - fix integer overflows with 64-bit inode numbers\n* filter\n  - ffmpeg: fix for filters producing no output\n* support libfmt 11\n* support ICU 76\n\nver 0.23.15 (2023/12/20)\n* decoder\n  - ffmpeg: fix build failure with FFmpeg 6.1\n* output\n  - alsa: limit buffer time to 2 seconds\n\nver 0.23.14 (2023/10/08)\n* decoder\n  - flac: fix scanning files with non-ASCII names on Windows\n  - mad: fix calculation of LAME peak values\n* mixer\n  - wasapi: fix problem setting volume\n* more libfmt 10 fixes\n* fix auto-detected systemd unit directory\n* Android\n  - require Android 7 or newer\n\nver 0.23.13 (2023/05/22)\n* input\n  - curl: fix busy loop after connection failed\n  - curl: hide \"404\" log messages for non-existent \".mpdignore\" files\n* archive\n  - zzip: fix crash bug\n* database\n  - simple: reveal hidden songs after deleting containing CUE\n* decoder\n  - ffmpeg: reorder to a lower priority than \"gme\"\n  - gme: require GME 0.6 or later\n* output\n  - pipewire: fix corruption bug due to missing lock\n* Linux\n  - shut down if parent process dies in --no-daemon mode\n  - determine systemd unit directories via pkg-config\n* support libfmt 10\n\nver 0.23.12 (2023/01/17)\n* input\n  - curl: require CURL 7.55.0 or later\n* decoder\n  - mad: fix integer underflow with very small files\n* tags\n  - fix crash bug due to race condition\n* output\n  - pipewire: adjust to PipeWire 0.3.64 API change\n* fix build failures with GCC 13\n\nver 0.23.11 (2022/11/28)\n* database\n  - simple: move default database to ~/.cache/mpd/db from ~/.cache/mpd.db\n  - simple: default \"cache_directory\" to ~/.cache/mpd/mounts\n* macOS: fix build failure \"no archive members specified\"\n* Windows\n  - fix crash bug (stack buffer overflow) after I/O errors\n  - fix path traversal bug because backslash was allowed in playlist names\n* Android/Windows\n  - update OpenSSL to 3.0.7\n  - re-enable CURL's verbose error strings\n\nver 0.23.10 (2022/10/14)\n* storage\n  - curl: fix file time stamps\n* decoder\n  - ffmpeg: fix libfmt 9 compiler warning\n* encoder\n  - flac: fix failure when libFLAC is built without Ogg support\n* output\n  - alsa: fix crash bug\n* Windows\n  - log to stdout by default, don't require \"log_file\" setting\n\nver 0.23.9 (2022/08/18)\n* input\n  - cdio_paranoia: add options \"mode\" and \"skip\"\n* decoder\n  - ffmpeg: support FFmpeg 5.1\n* filter\n  - replay gain: fix delayed volume display with handler=mixer\n* output\n  - pipewire: set app icon\n* fix bogus volume levels with multiple partitions\n* improve iconv detection\n* macOS: fix macOS 10 build problem (0.23.8 regression)\n* Android\n  - load mpd.conf from app data directory\n\nver 0.23.8 (2022/07/09)\n* storage\n  - curl: fix crash if web server does not understand WebDAV\n* input\n  - cdio_paranoia: fix crash if no drive was found\n  - cdio_paranoia: faster cancellation\n  - cdio_paranoia: don't scan for replay gain tags\n  - pipewire: fix playback of very short tracks\n  - pipewire: drop all buffers before manual song change\n  - pipewire: fix stuttering after manual song change\n  - snapcast: fix busy loop while paused\n  - snapcast: fix stuttering after resuming playback\n* mixer\n  - better error messages\n  - alsa: fix setting volume before playback starts\n  - pipewire: fix crash bug\n  - pipewire: fix volume change events with PipeWire 0.3.53\n  - pipewire: don't force initial volume=100%\n* support libfmt 9\n\nver 0.23.7 (2022/05/09)\n* database\n  - upnp: support pupnp 1.14\n* decoder\n  - ffmpeg: fix HLS seeking\n  - opus: fix missing song length on high-latency files\n* output\n  - shout: require at least libshout 2.4.0\n* mixer\n  - pipewire: fix volume restore\n  - software: update volume of disabled outputs\n* support libiconv\n\nver 0.23.6 (2022/03/14)\n* protocol\n  - support filename \"cover.webp\" for \"albumart\" command\n  - support \"readcomments\" and \"readpicture\" on CUE tracks\n* decoder\n  - ffmpeg: fix end-of-file check (update stuck at empty files)\n  - opus: fix \"readpicture\" on Opus files\n* output\n  - pipewire: fix crash bug if setting volume before playback starts\n  - wasapi: fix resume after pause\n\nver 0.23.5 (2021/12/01)\n* protocol\n  - support relative offsets for \"searchadd\"\n  - fix \"searchaddpl\" bug (bogus error \"Bad position\")\n* database\n  - upnp: fix crash bug\n* tags\n  - fix MixRamp support\n* migrate to PCRE2\n* GCC 12 build fixes\n\nver 0.23.4 (2021/11/11)\n* protocol\n  - add optional position parameter to \"searchaddpl\"\n* decoder\n  - ffmpeg: support libavcodec 59\n* output\n  - alsa: add option \"thesycon_dsd_workaround\" to work around device bug\n* fix crash on debug builds if startup fails\n* systemd\n  - remove \"RuntimeDirectory\" directive because it caused problems\n  - ignore the \"pid_file\" setting if started as systemd service\n* Windows\n  - enable the \"openmpt\" decoder plugin\n\nver 0.23.3 (2021/10/31)\n* protocol\n  - add optional position parameter to \"add\" and \"playlistadd\"\n  - allow range in \"playlistdelete\"\n* database\n  - fix scanning files with question mark in the name\n  - inotify: fix use-after-free bug\n* output\n  - alsa: add option \"stop_dsd_silence\" to work around DSD DAC noise\n* macOS: fix libfmt related build failure\n* systemd: add \"RuntimeDirectory\" directive\n\nver 0.23.2 (2021/10/22)\n* protocol\n  - fix \"albumart\" timeout bug\n* input\n  - nfs: fix playback bug\n* output\n  - pipewire: send artist and title to PipeWire\n  - pipewire: DSD support\n* neighbor\n  - mention failed plugin name in error message\n* player\n  - fix cross-fade regression\n* fix crash with libfmt versions older than 7\n\nver 0.23.1 (2021/10/19)\n* protocol\n  - use decimal notation instead of scientific notation\n  - \"load\" supports relative positions\n* output\n  - emit \"mixer\" idle event when replay gain changes volume\n  - pipewire: emit \"mixer\" idle events on external volume change\n  - pipewire: attempt to change the graph sample rate\n  - snapcast: fix time stamp bug which caused \"Failed to get chunk\"\n* fix libfmt linker problems\n* fix broken password authentication\n\nver 0.23 (2021/10/14)\n* protocol\n  - new command \"getvol\"\n  - show the audio format in \"playlistinfo\"\n  - support \"listfiles\" with arbitrary storage plugins\n  - support relative positions in \"addid\"\n  - fix relative positions in \"move\" and \"moveid\"\n  - add \"position\" parameter to \"findadd\" and \"searchadd\"\n  - add position parameter to \"load\"\n* database\n  - proxy: require MPD 0.20 or later\n  - proxy: require libmpdclient 2.11 or later\n  - proxy: split search into chunks to avoid exceeding the output buffer\n  - simple: add option to hide CUE target songs\n  - upnp: support libnpupnp instead of libupnp\n* archive\n  - zzip, iso9660: ignore file names which are invalid UTF-8\n* decoder\n  - openmpt: new plugin\n  - wavpack: fix WVC file support\n* player\n  - do not cross-fade songs shorter than 20 seconds\n* output\n  - oss: support DSD over PCM\n  - pipewire: new plugin\n  - snapcast: new plugin\n* tags\n  - new tags \"ComposerSort\", \"Ensemble\", \"Movement\", \"MovementNumber\", and \"Location\"\n* split permission \"player\" from \"control\"\n* add option \"host_permissions\"\n* new build-time dependency: libfmt\n\nver 0.22.11 (2021/08/24)\n* protocol\n  - fix \"albumart\" crash\n* filter\n  - ffmpeg: pass \"channel_layout\" instead of \"channels\" to buffersrc\n  - ffmpeg: fix \"av_buffersink_get_frame() failed: Resource temporarily unavailable\"\n  - ffmpeg: support double-precision samples (by converting to single precision)\n* Android\n  - build with NDK r23\n  - playlist_directory defaults to \"/sdcard/Android/data/org.musicpd/files/playlists\"\n\nver 0.22.10 (2021/08/06)\n* protocol\n  - support \"albumart\" for virtual tracks in CUE sheets\n* database\n  - simple: fix crash bug\n  - simple: fix absolute paths in CUE \"as_directory\" entries\n  - simple: prune CUE entries from database for non-existent songs\n* input\n  - curl: fix crash bug after stream with Icy metadata was closed by peer\n  - tidal: remove defunct unmaintained plugin\n* tags\n  - fix crash caused by bug in TagBuilder and a few potential reference leaks\n* output\n  - httpd: fix missing tag after seeking into a new song\n  - oss: fix channel order of multi-channel files\n* mixer\n  - alsa: fix yet more rounding errors\n\nver 0.22.9 (2021/06/23)\n* database\n  - simple: load all .mpdignore files of all parent directories\n* tags\n  - fix \"readcomments\" and \"readpicture\" on remote files with ID3 tags\n* decoder\n  - ffmpeg: support the tags \"sort_album\", \"album-sort\", \"artist-sort\"\n  - ffmpeg: fix build failure with FFmpeg 3.4\n* Android\n  - fix auto-start on boot in Android 8 or later\n* Windows\n  - fix build failure with SQLite\n\nver 0.22.8 (2021/05/22)\n* fix crash bug in \"albumart\" command (0.22.7 regression)\n\nver 0.22.7 (2021/05/19)\n* protocol\n  - don't use glibc extension to parse time stamps\n  - optimize the \"albumart\" command\n* input\n  - curl: send user/password in the first request, save one roundtrip\n* decoder\n  - ffmpeg: fix build problem with FFmpeg 3.4\n  - gme: support RSN files\n* storage\n  - curl: don't use glibc extension\n* database\n  - simple: fix database corruption bug\n* output\n  - fix crash when pausing with multiple partitions\n  - jack: enable on Windows\n  - httpd: send header \"Access-Control-Allow-Origin: *\"\n  - wasapi: add algorithm for finding usable audio format\n  - wasapi: use default device only if none was configured\n  - wasapi: add DoP support\n\nver 0.22.6 (2021/02/16)\n* fix missing tags on songs in queue\n\nver 0.22.5 (2021/02/15)\n* protocol\n  - error for malformed ranges instead of ignoring silently\n  - better error message for open-ended range with \"move\"\n* database\n  - simple: fix missing CUE sheet metadata in \"addid\" command\n* tags\n  - id: translate TPE3 to Conductor, not Performer\n* archive\n  - iso9660: another fix for unaligned reads\n* output\n  - httpd: error handling on Windows improved\n  - pulse: fix deadlock with \"always_on\"\n* Windows:\n  - enable https:// support (via Schannel)\n* Android\n  - work around \"Permission denied\" on mpd.conf\n\nver 0.22.4 (2021/01/21)\n* protocol\n  - add command \"binarylimit\" to allow larger chunk sizes\n  - fix \"readpicture\" on 32 bit machines\n  - show duration and tags of songs in virtual playlist (CUE) folders\n* storage\n  - curl: fix several WebDAV protocol bugs\n* decoder\n  - dsdiff: apply padding to odd-sized chunks\n* filter\n  - ffmpeg: detect the output sample format\n* output\n  - moveoutput: fix always_on and tag lost on move\n* Android\n  - enable https:// support (via OpenSSL)\n\nver 0.22.3 (2020/11/06)\n* playlist\n  - add option \"as_directory\", making CUE file expansion optional\n* storage\n  - curl: fix crash bug\n* filter\n  - fix garbage after \"Audio format not supported by filter\" message\n  - ffmpeg: support planar output\n  - ffmpeg: support sample formats other than 16 bit\n\nver 0.22.2 (2020/10/28)\n* database\n  - simple: purge songs and virtual directories for unavailable plugins\n    on update\n* input\n  - qobuz/tidal: fix protocol errors due to newlines in error messages\n  - smbclient: disable by default due to libsmbclient crash bug\n* playlist\n  - soundcloud: fix protocol errors due to newlines in error messages\n* state_file: save on shutdown\n\nver 0.22.1 (2020/10/17)\n* decoder\n  - opus: apply the OpusHead output gain even if there is no EBU R128 tag\n  - opus: fix track/album ReplayGain fallback\n* output\n  - alsa: don't deadlock when the ALSA driver is buggy\n  - jack, pulse: reduce the delay when stopping or pausing playback\n* playlist\n  - cue: fix two crash bugs\n* state_file: fix the state_file_interval setting\n\nver 0.22 (2020/09/23)\n* protocol\n  - \"findadd\"/\"searchadd\"/\"searchaddpl\" support the \"sort\" and\n    \"window\" parameters\n  - add command \"readpicture\" to download embedded pictures\n  - command \"moveoutput\" moves an output between partitions\n  - command \"delpartition\" deletes a partition\n  - show partition name in \"status\" response\n* tags\n  - new tags \"Grouping\" (for ID3 \"TIT1\"), \"Work\" and \"Conductor\"\n* input\n  - curl: support \"charset\" parameter in URI fragment\n  - ffmpeg: allow partial reads\n  - io_uring: new plugin for local files on Linux (using liburing)\n  - smbclient: close unused SMB/CIFS connections\n* database\n  - upnp: drop support for libupnp versions older than 1.8\n* playlist\n  - cue: integrate contents in database\n* decoder\n  - ffmpeg: support RTSP\n  - mad: remove option \"gapless\", always do gapless\n  - sidplay: add option \"default_genre\"\n  - sidplay: map SID name field to \"Album\" tag\n  - sidplay: add support for new song length format with libsidplayfp 2.0\n  - vorbis, opus: improve seeking accuracy\n* playlist\n  - flac: support reading CUE sheets from remote FLAC files\n* filter\n  - ffmpeg: new plugin based on FFmpeg's libavfilter library\n  - hdcd: new plugin based on FFmpeg's \"af_hdcd\" for HDCD playback\n  - volume: convert S16 to S24 to preserve quality and reduce dithering noise\n  - dsd: add integer-only DSD to PCM converter\n* output\n  - jack: add option \"auto_destination_ports\"\n  - jack: report error details\n  - pulse: add option \"media_role\"\n  - solaris: support S8 and S32\n* lower the real-time priority from 50 to 40\n* switch to C++17\n  - GCC 8 or clang 5 (or newer) recommended\n\nver 0.21.26 (2020/09/21)\n* database\n  - inotify: obey \".mpdignore\" files\n* output\n  - osx: fix crash bug\n  - sles: support floating point samples\n* archive\n  - bzip2: fix crash on corrupt bzip2 file\n  - bzip2: flush output at end of input file\n  - iso9660: fix unaligned reads\n  - iso9660: support seeking\n  - zzip: fix crash on corrupt ZIP file\n* decoder\n  - ffmpeg: remove \"rtsp://\" from the list of supported protocols\n  - ffmpeg: add \"hls+http://\" to the list of supported protocols\n  - opus: support the gain value from the Opus header\n  - sndfile: fix lost samples at end of file\n* fix \"single\" mode bug after resuming playback\n* the default log_level is \"default\", not \"info\"\n\nver 0.21.25 (2020/07/06)\n* protocol:\n  - fix crash when using \"rangeid\" while playing\n* database\n  - simple: automatically scan new mounts\n  - upnp: fix compatibility with Plex DLNA\n* storage\n  - fix disappearing mounts after mounting twice\n  - udisks: fix reading \".mpdignore\"\n* input\n  - file: detect premature end of file\n  - smbclient: don't send credentials to MPD clients\n* decoder\n  - opus: apply pre-skip and end trimming\n  - opus: fix memory leak\n  - opus: fix crash bug\n  - vorbis: fix crash bug\n* output\n  - osx: improve sample rate selection\n  - osx: fix noise while stopping\n* neighbor\n  - upnp: fix crash during shutdown\n* Windows/Android:\n  - fix Boost detection after breaking change in Meson 0.54\n\nver 0.21.24 (2020/06/10)\n* protocol\n  - \"tagtypes\" requires no permissions\n* database\n  - simple: fix crash when mounting twice\n* decoder\n  - modplug: fix Windows build failure\n  - wildmidi: attempt to detect WildMidi using pkg-config\n  - wildmidi: fix Windows build failure\n* player\n  - don't restart current song if seeking beyond end\n* Android\n  - enable the decoder plugins GME, ModPlug and WildMidi\n  - fix build failure with Android NDK r21\n* Windows\n  - fix stream playback\n  - enable the decoder plugins GME, ModPlug and WildMidi\n  - work around Meson bug breaking the Windows build with GCC 10\n* fix unit test failure\n\nver 0.21.23 (2020/04/23)\n* protocol\n  - add tag fallback for AlbumSort\n* storage\n  - curl: fix corrupt \"href\" values in the presence of XML entities\n  - curl: unescape \"href\" values\n* input\n  - nfs: fix crash bug\n  - nfs: fix freeze bug on reconnect\n* decoder\n  - gme: adapt to API change in the upcoming version 0.7.0\n* output\n  - alsa: implement channel mapping for 5.0 and 7.0\n* player\n  - drain outputs at end of song in \"single\" mode\n* Windows\n  - fix case insensitive search\n\nver 0.21.22 (2020/04/02)\n* database\n  - simple: optimize startup\n* input\n  - curl: fix streaming errors on Android\n* playlist\n  - rss: support MIME type application/xml\n* mixer\n  - android: new mixer plugin for \"sles\" output\n* Android\n  - TV support\n* Windows\n  - fix time zone offset check\n* fix build failures with uClibc-ng\n\nver 0.21.21 (2020/03/19)\n* configuration\n  - fix bug in \"metadata_to_use\" setting\n* playlist\n  - asx, xspf: fix corrupt tags in the presence of XML entities\n* archive\n  - iso9660: skip empty file names to work around libcdio bug\n* decoder\n  - gme: ignore empty tags\n* output\n  - solaris: port to NetBSD\n* raise default \"max_connections\" value to 100\n\nver 0.21.20 (2020/02/16)\n* decoder\n  - audiofile, ffmpeg, sndfile: handle MIME type \"audio/wav\"\n  - ffmpeg: fix playback of AIFF and TTA\n  - vorbis, opus: fix seeking in small files\n* fix backwards seeking on ARM (and other non-x86 CPUs)\n\nver 0.21.19 (2020/01/17)\n* configuration\n  - allow overriding top-level settings in includes\n* output\n  - pulse: obey Pulse's maximum sample rate (fixes DSD128 playback)\n* fix build failure with clang 10\n* fix build failure with Android NDK r20\n\nver 0.21.18 (2019/12/24)\n* protocol\n  - work around Mac OS X bug in the ISO 8601 parser\n* output\n  - alsa: fix hang bug with ALSA \"null\" outputs\n* storage\n  - curl: fix crash bug\n* drop support for CURL versions older than 7.32.0\n* reduce unnecessary CPU wakeups\n\nver 0.21.17 (2019/12/16)\n* protocol\n  - relax the ISO 8601 parser: allow omitting field separators, the\n    time of day and the \"Z\" suffix\n* archive\n  - zzip: improve error reporting\n* outputs\n  - jack: mark ports as terminal\n  - shout: declare metadata as UTF-8\n* fix build failure with -Ddatabase=false\n\nver 0.21.16 (2019/10/16)\n* queue\n  - fix relative destination offset when moving a range\n* storage\n  - curl: request the \"resourcetype\" property to fix database update\n  - curl: URL-encode more paths\n  - curl: follow redirects for collections without trailing slash\n* update\n  - fix crash when music_directory is not a directory\n* fix build with iconv() instead of ICU\n\nver 0.21.15 (2019/09/25)\n* decoder\n  - dsdiff, dsf: fix displayed bit rate\n  - mpcdec: fix bogus ReplayGain values\n* output\n  - solaris: fix build with glibc 2.30\n\nver 0.21.14 (2019/08/21)\n* decoder\n  - sidplay: show track durations in database\n  - sidplay: convert tag values from Windows-1252 charset\n  - sidplay: strip text from \"Date\" tag\n* player\n  - fix crash after song change\n  - fix seek position after restarting the decoder\n* protocol\n  - include command name in error responses\n\nver 0.21.13 (2019/08/06)\n* input\n  - cdio_paranoia: require libcdio-paranoia 10.2+0.93+1\n* decoder\n  - mad: fix crackling sound (0.21.12 regression)\n* output\n  - jack: improved Windows compatibility\n\nver 0.21.12 (2019/08/03)\n* decoder\n  - mad: update bit rate after seeking\n  - mad: fix several bugs preventing the plugin from decoding the last frame\n  - opus: ignore case in replay gain tag names\n  - opus, vorbis: decode the \"end of stream\" packet\n* output\n  - jack: fix mono-to-stereo conversion\n* player\n  - don't restart unseekable song after failed seek attempt\n* Windows\n  - support backslash in relative URIs loaded from playlists\n\nver 0.21.11 (2019/07/03)\n* input\n  - tidal: deprecated because Tidal has changed the protocol\n* decoder\n  - wildmidi: log error if library initialization fails\n* output\n  - alsa: fix busy loop while draining\n  - alsa: fix missing drain call\n  - alsa: improve xrun-avoiding silence generator\n  - alsa: log when generating silence due to slow decoder\n  - alsa, osx: fix distortions with DSD_U32 and DoP on 32 bit CPUs\n* protocol\n  - fix \"list\" with multiple \"group\" levels\n\nver 0.21.10 (2019/06/05)\n* decoder\n  - opus: fix duplicate tags\n* output\n  - httpd: reject some well-known URIs\n* fix crash bug (0.21.9 regression)\n\nver 0.21.9 (2019/05/20)\n* input\n  - buffer: fix deadlock bug\n* Android\n  - fix crash on ARMv7\n  - request storage permission on Android 6+\n* fix spurious \"single\" mode bug\n\nver 0.21.8 (2019/04/23)\n* input\n  - smbclient: download to buffer instead of throttling transfer\n* output\n  - httpd: add missing mutex lock\n  - httpd: fix use-after-free bug\n* playlist\n  - soundcloud: fix \"Unsupported URI scheme\" (0.21.6 regression)\n* fix Bonjour bug\n* fix build failure with GCC 9\n* fix build failure with -Ddatabase=false\n* systemd: add user socket unit\n* doc: \"list file\" is deprecated\n\nver 0.21.7 (2019/04/03)\n* input\n  - qobuz/tidal: scan tags when loading a playlist\n* require Meson 0.49.0 for native libgcrypt-config support\n* fix build failure with -Dlocal_socket=false\n* Haiku\n  - fix build\n  - add version info\n\nver 0.21.6 (2019/03/17)\n* protocol\n  - allow loading playlists specified as absolute filesystem paths\n  - fix negated filter expressions with multiple tag values\n  - fix \"list\" with filter expression\n  - omit empty playlist names in \"listplaylists\"\n* input\n  - cdio_paranoia: fix build failure due to missing #include\n* decoder\n  - opus: fix replay gain when there are no other tags\n  - opus: fix seeking to beginning of song\n  - vorbis: fix Tremor conflict resulting in crash\n* output\n  - pulse: work around error with unusual channel count\n  - osx: fix build failure\n* playlist\n  - flac: fix use-after-free bug\n* support abstract sockets on Linux\n* Windows\n  - remove the unused libwinpthread-1.dll dependency\n* Android\n  - enable SLES power saving mode\n\nver 0.21.5 (2019/02/22)\n* protocol\n  - fix deadlock in \"albumart\" command\n  - fix \"tagtypes disable\" command\n* database\n  - simple: fix assertion failure\n  - fix assertion failures with mount points\n* storage\n  - udisks: fix \"AlreadyMounted\" error\n  - udisks: use relative path from mount URI\n  - fix memory leak\n* input\n  - buffer: fix crash bug when playing remote WAV file\n* tags\n  - ape: map \"Album Artist\"\n* output\n  - shout: add support for TLS\n* mixer\n  - pulse: add \"scale_volume\" setting\n\nver 0.21.4 (2019/01/04)\n* database\n  - inotify: fix crash bug \"terminate called after throwing ...\"\n  - upnp: implement \"list ... group\"\n* output\n  - httpd: declare protocol \"HTTP/1.1\" instead of \"ICY\"\n* remove libwrap support\n* Windows\n  - fix \"Failed to accept connection: unknown error\"\n* fix Haiku build\n\nver 0.21.3 (2018/11/16)\n* output\n  - alsa: fix crash bug\n  - alsa: fix stuttering at start of playback\n  - alsa: fix discarded samples at end of song\n  - alsa: clear error after reopening device\n* log: default to journal if MPD was started as systemd service\n\nver 0.21.2 (2018/11/12)\n* protocol\n  - operator \"=~\" matches a regular expression\n  - operator \"contains\" matches substrings\n* decoder\n  - ffmpeg: require FFmpeg 3.1 or later\n  - ffmpeg: fix broken sound with certain codecs\n* output\n  - alsa: fix high CPU usage with dmix\n  - httpd: fix three crash bugs\n* mixer\n  - alsa: fix more rounding errors\n* fix zlib support\n\nver 0.21.1 (2018/11/04)\n* protocol\n  - allow escaping quotes in filter expressions\n  - operator \"==\" never searches substrings in filter expressions\n* decoder\n  - ffmpeg: fix build failure with non-standard FFmpeg installation path\n  - flac: fix linker failure when building without FLAC support\n* encoder\n  - vorbis: fix linker failure when building without Vorbis decoder\n* fix build failure on Linux-PowerPC\n* fix build failure on FreeBSD\n* eliminate DLL dependencies on Windows\n* add warning about buggy Boost version 1.67\n* require Meson 0.47.2 because a Meson 0.47.1 bug breaks our build\n\nver 0.21 (2018/10/31)\n* configuration\n  - add \"include\" directive, allows including config files\n  - incremental \"metadata_to_use\" setting\n* protocol\n  - \"tagtypes\" can be used to hide tags\n  - \"find\" and \"search\" can sort\n  - \"outputs\" prints the plugin name\n  - \"outputset\" sets runtime attributes\n  - close connection when client sends HTTP request\n  - new filter syntax for \"find\"/\"search\" etc. with negation\n* database\n  - simple: scan audio formats\n  - proxy: require libmpdclient 2.9\n  - proxy: forward `sort` and `window` to server\n* player\n  - hard-code \"buffer_before_play\" to 1 second, independent of audio format\n  - \"one-shot\" single mode\n* input\n  - curl: download to buffer instead of throttling transfer\n  - qobuz: new plugin to play Qobuz streams\n  - tidal: new plugin to play Tidal streams\n* tags\n  - new tags \"OriginalDate\", \"MUSICBRAINZ_WORKID\"\n* decoder\n  - ffmpeg: require at least version 11.12\n  - gme: try loading m3u sidecar files\n  - hybrid_dsd: new decoder plugin\n  - mad: move \"gapless_mp3_playback\" setting to \"decoder\" block\n  - mikmod: require at least version 3.2\n  - pcm: support audio/L24 (RFC 3190)\n  - sidplay: support basic and kernal rom (libsidplayfp)\n* resampler\n  - soxr: flush resampler at end of song\n* output\n  - alsa: non-blocking mode\n  - alsa: change \"dop\" and \"allowed_formats\" settings at runtime\n  - ao: fix crash bug due to partial frames\n  - shout: support the Shine encoder plugin\n  - sndio: remove support for the broken RoarAudio sndio emulation\n  - osx: initial support for DSD over PCM\n  - roar: removed\n  - httpd_output: support for unix sockets\n* mixer\n  - sndio: new mixer plugin\n* encoder\n  - opus: support for sending metadata using ogg stream chaining\n* listen on $XDG_RUNTIME_DIR/mpd/socket by default\n* append hostname to Zeroconf service name\n* systemd watchdog support\n* require GCC 6\n* build with Meson instead of autotools\n* use GTest instead of cppunit\n\nver 0.20.23 (2018/10/29)\n* protocol\n  - emit \"player\" idle event when restarting the current song\n* fix broken float to s32 conversion\n* new clang crash bug workaround\n\nver 0.20.22 (2018/10/23)\n* protocol\n  - add tag fallbacks for AlbumArtistSort, ArtistSort\n  - fix empty string filter on fallback tags\n  - \"count group ...\" can print an empty group\n  - fix broken command \"list ... group\"\n* storage\n  - curl: URL-encode paths\n* decoder\n  - fluidsynth: adapt to API change in version 2.0\n* Android\n  - now runs as a service\n  - add button to start/stop MPD\n  - add option to auto-start on boot\n* work around clang bug leading to crash\n* install the SVG icon\n\nver 0.20.21 (2018/08/17)\n* database\n  - proxy: add \"password\" setting\n  - proxy: support tags \"ArtistSort\", \"AlbumArtistSort\", \"AlbumSort\"\n  - simple: allow .mpdignore comments only at start of line\n* output\n  - httpd: remove broken DLNA support code\n* playlist\n  - cue: support file type declaration \"FLAC\" (non-standard)\n* URI schemes are case insensitive\n* Android, Windows\n  - enable the \"curl\" storage plugin\n\nver 0.20.20 (2018/05/22)\n* protocol\n  - fix \"modified-since\" filter regression\n* output\n  - pulse: cork stream when paused due to \"single\" mode\n* decoder\n  - dsdiff, dsf: support more MIME types\n  - dsdiff, dsf: allow 4 MB ID3 tags\n  - opus: support R128_ALBUM_GAIN tag\n* Android, Windows\n  - enable the \"proxy\" database plugin\n\nver 0.20.19 (2018/04/26)\n* protocol\n  - validate absolute seek time, reject negative values\n* database\n  - proxy: fix \"search already in progress\" errors\n  - proxy: implement \"list ... group\"\n* input\n  - mms: fix lockup bug and a crash bug\n* decoder\n  - ffmpeg: fix av_register_all() deprecation warning (FFmpeg 4.0)\n* player\n  - fix spurious \"Not seekable\" error when switching radio streams\n* macOS: fix crash bug\n\nver 0.20.18 (2018/02/24)\n* input\n  - curl: allow authentication methods other than \"Basic\"\n* decoder\n  - flac: improve seeking precision\n* fix gapless CUE song transitions\n* Android, Windows\n  - enable the NFS storage plugin\n\nver 0.20.17 (2018/02/11)\n* output\n  - alsa: fix crash bug with 8 channels\n* mixer\n  - alsa: fix rounding error at volume 0\n* fix real-time and idle scheduling with Musl\n* Android\n  - fix compatibility with Android 4.0\n\nver 0.20.16 (2018/02/03)\n* output\n  - pulse: fix crash during auto-detection\n* database\n  - simple: fix search within mount points\n  - upnp: enable IPv6\n* archive\n  - iso9660: libcdio 2.0 compatibility\n* fix crash in debug build on Haiku and other operating systems\n\nver 0.20.15 (2018/01/05)\n* queue: fix crash after seek failure\n* resampler\n  - soxr: clear internal state after manual song change\n* state file\n  - make mount point restore errors non-fatal\n  - fix crash when restoring mounts with incompatible database plugin\n* Android\n  - build without Ant\n  - fix for SIGSYS crash\n\nver 0.20.14 (2018/01/01)\n* database\n  - simple: fix file corruption in the presence of mount points\n* archive\n  - bz2: fix deadlock\n  - reduce lock contention, fixing lots of xrun problems\n* fix Solaris build failure\n\nver 0.20.13 (2017/12/18)\n* output\n  - osx: set up ring buffer to hold at least 100ms\n* mixer\n  - alsa: fix rounding errors\n* database\n  - simple: don't purge mount points on update/rescan\n  - simple: fix \"mount\" bug caused by bad compiler optimization\n  - simple: fix \"lsinfo\" into mount points\n  - upnp: work around libupnp 1.6.24 API breakage\n* queue: fix spuriously misplaced prioritized songs\n* save and restore mountpoints within the state file\n* include Windows cross-build script in source tarball\n* fix Windows build failures\n\nver 0.20.12 (2017/11/25)\n* database\n  - upnp: adapt to libupnp 1.8 API changes\n* input\n  - cdio_paranoia, ffmpeg, file, smbclient: reduce lock contention,\n    fixing lots of xrun problems\n  - curl: fix seeking\n* decoder\n  - ffmpeg: fix GCC 8 warning\n  - vorbis: fix Tremor support\n* player\n  - log message when decoder is too slow\n* encoder\n  - vorbis: default to quality 3\n* output\n  - fix hanging playback with soxr resampler\n  - httpd: flush encoder after tag; fixes corrupt Vorbis stream\n\nver 0.20.11 (2017/10/18)\n* storage\n  - curl: support Content-Type application/xml\n* decoder\n  - ffmpeg: more reliable song duration\n  - gme: fix track numbering\n* improve random song order when switching songs manually\n* fix case insensitive search without libicu\n* fix Unicode file names in playlists on Windows\n* fix endless loop when accessing malformed file names in ZIP files\n\nver 0.20.10 (2017/08/24)\n* decoder\n  - ffmpeg: support MusicBrainz ID3v2 tags\n* tags\n  - aiff: fix FORM chunk size endianness (is big-endian)\n* mixer\n  - osx: add a mixer for OSX.\n* fix crash when resuming playback before decoder is ready\n* fix crash on Windows\n\nver 0.20.9 (2017/06/04)\n* decoder\n  - ffmpeg: support *.adx\n* fix byte order detection on FreeBSD/aarch64\n* fix more random crashes when compiled with clang\n\nver 0.20.8 (2017/05/19)\n* output\n  - osx: fix build failure due to missing \"noexcept\"\n* playlist\n  - m3u: support MIME type `audio/mpegurl`\n* fix build failure with GCC 4.x\n\nver 0.20.7 (2017/05/15)\n* database\n  - simple: fix false positive directory loop detection with NFS\n* enforce a reasonable minimum audio_buffer_size setting\n* cap buffer_before_play at 80% to prevent deadlock\n* fix random crashes when compiled with clang\n\nver 0.20.6 (2017/03/10)\n* input\n  - curl: fix headers after HTTP redirect to Shoutcast server\n* decoder\n  - ffmpeg: re-enable as fallback\n  - mpcdec: fix crash (division by zero) after seeking\n  - sidplay: make compatible with libsidplayfp < 1.8\n* fix stream tags after automatic song change\n* workaround for GCC 4.9.4 / libstdc++ bug (build failure)\n\nver 0.20.5 (2017/02/20)\n* tags\n  - id3: fix memory leak on corrupt ID3 tags\n* decoder\n  - sidplay: don't require libsidutils when building with libsidplayfp\n* output\n  - httpd: fix two buffer overflows in IcyMetaData length calculation\n* mixer\n  - alsa: fix crash bug\n\nver 0.20.4 (2017/02/01)\n* input\n  - nfs: fix freeze after reconnect\n* output\n  - sndio: work around a libroar C++ incompatibility\n* workaround for GCC 4.9 \"constexpr\" bug\n* fix FreeBSD build failure\n\nver 0.20.3 (2017/01/25)\n* protocol\n  - \"playlistadd\" creates new playlist if it does not exist, as documented\n* database\n  - proxy: fix error \"terminate called after throwing ...\"\n  - proxy: make connect errors during startup non-fatal\n* neighbor\n  - upnp: fix premature expiry\n* replay gain: don't reset ReplayGain levels when unpausing playback\n* silence surround channels when converting from stereo\n* use shortcuts such as \"dsd64\" in log messages\n\nver 0.20.2 (2017/01/15)\n* input\n  - alsa: fix crash bug\n  - alsa: fix buffer overruns\n* decoder\n  - flac: add options \"probesize\" and \"analyzeduration\"\n* resampler\n  - libsamplerate: reset state after seeking\n* output\n  - fix static noise after changing to a different audio format\n  - alsa: fix the DSD_U32 sample rate\n  - alsa: fix the DSD_U32 byte order\n  - alsa: support DSD_U16\n  - recorder: fix error \"Failed to create : No such file or directory\"\n* playlist\n  - cue: fix skipping songs\n\nver 0.20.1 (2017/01/09)\n* input\n  - curl: fix crash bug\n  - curl: fix freeze bug\n* decoder\n  - wavpack: fix crash bug\n* storage\n  - curl: new storage plugin for WebDAV (work in progress)\n* mixer\n  - alsa: normalize displayed volume according to human perception\n* fix crash with volume_normalization enabled\n\nver 0.20 (2017/01/04)\n* protocol\n  - \"commands\" returns playlist commands only if playlist_directory configured\n  - \"search\"/\"find\" have a \"window\" parameter\n  - report song duration with milliseconds precision\n  - \"sticker find\" can match sticker values\n  - drop the \"file:///\" prefix for absolute file paths\n  - add range parameter to command \"plchanges\" and \"plchangesposid\"\n  - send verbose error message to client\n* input\n  - curl: fix memory leak\n* tags\n  - ape, ogg: drop support for non-standard tag \"album artist\"\n    affected filetypes: vorbis, flac, opus & all files with ape2 tags\n    (most importantly some mp3s)\n  - id3: remove the \"id3v1_encoding\" setting; by definition, all ID3v1 tags\n    are ISO-Latin-1\n  - ape: support APE replay gain on remote files\n  - read ID3 tags from NFS/SMB\n* decoder\n  - improved error logging\n  - report I/O errors to clients\n  - ffmpeg: support ReplayGain and MixRamp\n  - ffmpeg: support stream tags\n  - gme: add option \"accuracy\"\n  - gme: provide the TRACK tag\n  - gme: faster scanning\n  - mad: reduce memory usage while scanning tags\n  - mpcdec: read the bit rate\n  - pcm: support audio/L16 (RFC 2586) and audio/x-mpd-float\n  - sidplay: faster scanning\n  - wavpack: large file support\n  - wavpack: support DSD (WavPack 5)\n  - wavpack: archive support\n* playlist\n  - cue: don't skip pregap\n  - embcue: fix last track\n  - flac: new plugin which reads the \"CUESHEET\" metadata block\n* output\n  - alsa: fix multi-channel order\n  - alsa: remove option \"use_mmap\"\n  - alsa: support DSD_U32\n  - alsa: disable DoP if it fails\n  - jack: reduce CPU usage\n  - pulse: set channel map to WAVE-EX\n  - recorder: record tags\n  - recorder: allow dynamic file names\n  - sndio: new output plugin\n* mixer\n  - null: new plugin\n* resampler\n  - new block \"resampler\" in configuration file\n    replacing the old \"samplerate_converter\" setting\n  - soxr: allow multi-threaded resampling\n* player\n  - reset song priority on playback\n  - reduce xruns\n* write database and state file atomically\n* always write UTF-8 to the log file.\n* remove dependency on GLib\n* support libsystemd (instead of the older libsystemd-daemon)\n* database\n  - proxy: add TCP keepalive option\n* update\n  - apply .mpdignore matches to subdirectories\n* switch the code base to C++14\n  - GCC 4.9 or clang 3.4 (or newer) recommended\n\nver 0.19.21 (2016/12/13)\n* decoder\n  - ffmpeg: fix crash bug\n* fix unit test failure after recent \"setprio\" change\n* systemd: add user unit\n\nver 0.19.20 (2016/12/09)\n* protocol\n  - \"setprio\" re-enqueues old song if priority has been raised\n* decoder\n  - ffmpeg: ignore empty packets\n  - pcm: fix corruption bug with partial frames (after short read)\n  - sidplay: fix playback speed with libsidplayfp\n* output\n  - winmm: fix 8 bit playback\n* fix gcc 7.0 -Wimplicit-fallthrough\n* systemd: paranoid security settings\n\nver 0.19.19 (2016/08/23)\n* decoder\n  - ffmpeg: bug fix for FFmpeg 3.1 support\n  - wildmidi: support libWildMidi 0.4\n* output\n  - pulse: support 32 bit, 24 bit and floating point playback\n* support non-x86 NetBSD\n* fix clang 3.9 warnings\n\nver 0.19.18 (2016/08/05)\n* decoder\n  - ffmpeg: fix crash with older FFmpeg versions (< 3.0)\n  - ffmpeg: log detailed error message\n  - ffmpeg: support FFmpeg 3.1\n  - sidplay: detect libsidplay2 with pkg-config\n  - sidplay: log detailed error message\n  - sidplay: read the \"date\" tag\n  - sidplay: allow building with libsidplayfp instead of libsidplay2\n* output\n  - shout: recognize setting \"encoder\" instead of \"encoding\"\n* fix memory leak after stream failure\n* fix build failure with Boost 1.61\n* require gcc 4.7 or newer\n\nver 0.19.17 (2016/07/09)\n* decoder\n  - flac: fix assertion failure while seeking\n  - flac: fix stream duration indicator\n  - fix seek problems in several plugins\n* fix spurious seek error \"Failed to allocate silence buffer\"\n* replay gain: fix \"replay_gain_handler mixer\" setting\n* DSD: use 0x69 as silence pattern\n* fix use-after-free bug on \"close\" and \"kill\"\n\nver 0.19.16 (2016/06/13)\n* faster seeking\n* fix system include path order\n* add missing DocBook file to tarball\n\nver 0.19.15 (2016/04/30)\n* decoder\n  - ffmpeg: support FFmpeg 3.0\n  - ffmpeg: use as fallback instead of \"mad\" if no plugin matches\n  - opus: support bigger OpusTags packets\n* fix more build failures on non-glibc builds due to constexpr Mutex\n* fix build failure due to missing include\n* fix unit test on Alpha\n\nver 0.19.14 (2016/03/18)\n* decoder\n  - dsdiff: fix off-by-one buffer overflow\n  - opus: limit tag size to 64 kB\n* archive\n  - iso9660: fix buffer overflow\n* fix quadratic runtime bug in the tag pool\n* fix build failures on non-glibc builds due to constexpr Mutex\n\nver 0.19.13 (2016/02/23)\n* tags\n  - aiff, riff: fix ID3 chunk padding\n* decoder\n  - ffmpeg: support the TAK codec\n* fix disappearing duration of remote songs during playback\n* initialize supplementary groups with glibc 2.19+\n\nver 0.19.12 (2015/12/15)\n* fix assertion failure on malformed UTF-8 tag\n* fix build failure on non-Linux systems\n* fix LimitRTTIME in systemd unit file\n\nver 0.19.11 (2015/10/27)\n* tags\n  - ape: fix buffer overflow\n* decoder\n  - ffmpeg: fix crash due to wrong avio_alloc_context() call\n  - gme: don't loop forever, fall back to GME's default play length\n* encoder\n  - flac: fix crash with 32 bit playback\n* mixer\n  - fix mixer lag after enabling/disabling output\n\nver 0.19.10 (2015/06/21)\n* input\n  - curl: fix deadlock on small responses\n  - smbclient: fix DFF playback\n* decoder\n  - ffmpeg: improve seeking accuracy\n  - fix stuck stream tags\n* encoder\n  - opus: fix bogus granulepos\n* output\n  - fix failure to open device right after booting\n* neighbor\n  - nfs: fix deadlock when connecting\n* fix \"single\" mode breakage due to queue edits\n\nver 0.19.9 (2015/02/06)\n* decoder\n  - dsdiff, dsf: raise ID3 tag limit to 1 MB\n* playlist: fix loading duplicate tag types from state file\n* despotify: remove defunct plugin\n* fix clock integer overflow on OS X\n* fix gcc 5.0 warnings\n* fix build failure with uClibc\n* fix build failure on non-POSIX operating systems\n* fix dependency issue on parallel Android build\n* fix database/state file saving on Windows\n\nver 0.19.8 (2015/01/14)\n* input\n  - curl: fix bug after rewinding from end-of-file\n  - mms: reduce delay at the beginning of playback\n* decoder\n  - dsdiff, dsf: allow ID3 tags larger than 4 kB\n  - ffmpeg: support interleaved floating point\n* fix clang 3.6 warnings\n* fix build failure on NetBSD\n\nver 0.19.7 (2014/12/17)\n* input\n  - nfs: fix crash while canceling a failing file open operation\n  - nfs: fix memory leak on connection failure\n  - nfs: fix reconnect after mount failure\n  - nfs: implement mount timeout (60 seconds)\n* storage\n  - nfs: implement I/O timeout (60 seconds)\n* playlist\n  - embcue: fix filename suffix detection\n  - don't skip non-existent songs in \"listplaylist\"\n* decoder\n  - ffmpeg: fix time stamp underflow\n* fix memory allocator bug on Windows\n\nver 0.19.6 (2014/12/08)\n* decoder\n  - ffmpeg: support FFmpeg 2.5\n* fix build failure with musl\n* android\n  - update libFLAC to 1.3.1\n  - update FFmpeg to 2.5\n\nver 0.19.5 (2014/11/26)\n* input\n  - nfs: fix crash on connection failure\n* archive\n  - zzip: fix crash after seeking\n* decoder\n  - dsdiff, dsf, opus: fix deadlock while seeking\n  - mp4v2: remove because of incompatible license\n\nver 0.19.4 (2014/11/18)\n* protocol\n  - workaround for buggy clients that send \"add /\"\n* decoder\n  - ffmpeg: support opus\n  - opus: add MIME types audio/ogg and application/ogg\n* fix crash on failed filename charset conversion\n* fix local socket detection from uid=0 (root)\n\nver 0.19.3 (2014/11/11)\n* protocol\n  - fix \"(null)\" result string to \"list\" when AlbumArtist is disabled\n* database\n  - upnp: fix breakage due to malformed URIs\n* input\n  - curl: another fix for redirected streams\n* decoder\n  - audiofile: fix crash while playing streams\n  - audiofile: fix bit rate calculation\n  - ffmpeg: support opus\n  - opus: fix bogus duration on streams\n  - opus: support chained streams\n  - opus: improved error logging\n* fix distorted audio with soxr resampler\n* fix build failure on Mac OS X with non-Apple compilers\n\nver 0.19.2 (2014/11/02)\n* input\n  - curl: fix redirected streams\n* playlist\n  - don't allow empty playlist name\n  - m3u: don't ignore unterminated last line\n  - m3u: recognize the file suffix \".m3u8\"\n* decoder\n  - ignore URI query string for plugin detection\n  - faad: remove workaround for ancient libfaad2 ABI bug\n  - ffmpeg: recognize MIME type audio/aacp\n  - mad: fix negative replay gain values\n* output\n  - fix memory leak after filter initialization error\n  - fall back to PCM if given DSD sample rate is not supported\n* fix assertion failure on unsupported PCM conversion\n* auto-disable plugins that require GLib when --disable-glib is used\n\nver 0.19.1 (2014/10/19)\n* input\n  - mms: fix deadlock bug\n* playlist\n  - extm3u: fix Extended M3U detection\n  - m3u, extm3u, cue: fix truncated lines\n* fix build failure on Mac OS X\n* add missing file systemd/mpd.socket to tarball\n\nver 0.19 (2014/10/10)\n* protocol\n  - new commands \"addtagid\", \"cleartagid\", \"listfiles\", \"listmounts\",\n    \"listneighbors\", \"mount\", \"rangeid\", \"unmount\"\n  - \"lsinfo\" and \"readcomments\" allowed for remote files\n  - \"listneighbors\" lists file servers on the local network\n  - \"playlistadd\" supports file:///\n  - \"idle\" with unrecognized event name fails\n  - \"list\" on album artist falls back to the artist tag\n  - \"list\" and \"count\" allow grouping\n  - new \"search\"/\"find\" filter \"modified-since\"\n  - \"seek*\" allows fractional position\n  - close connection after syntax error\n* database\n  - proxy: forward \"idle\" events\n  - proxy: forward the \"update\" command\n  - proxy: copy \"Last-Modified\" from remote directories\n  - simple: compress the database file using gzip\n  - upnp: new plugin\n  - cancel the update on shutdown\n* storage\n  - music_directory can point to a remote file server\n  - nfs: new plugin\n  - smbclient: new plugin\n* playlist\n  - cue: fix bogus duration of the last track\n  - cue: restore CUE tracks from state file\n  - soundcloud: use https instead of http\n  - soundcloud: add default API key\n* archive\n  - read tags from songs in an archive\n* input\n  - alsa: new input plugin\n  - curl: options \"verify_peer\" and \"verify_host\"\n  - ffmpeg: update offset after seeking\n  - ffmpeg: improved error messages\n  - mms: non-blocking I/O\n  - nfs: new input plugin\n  - smbclient: new input plugin\n* filter\n  - volume: improved software volume dithering\n* decoder:\n  - vorbis, flac, opus: honor DESCRIPTION= tag in Xiph-based files as a comment to the song\n  - audiofile: support scanning remote files\n  - audiofile: log libaudiofile errors\n  - dsdiff, dsf: report bit rate\n  - dsdiff, dsf: implement seeking\n  - dsf: support DSD512\n  - dsf: support multi-channel files\n  - dsf: fix big-endian bugs\n  - dsf: fix noise at end of malformed file\n  - mpg123: support ID3v2, ReplayGain and MixRamp\n  - sndfile: support scanning remote files\n  - sndfile: support tags \"comment\", \"album\", \"track\", \"genre\"\n  - sndfile: native floating point playback\n  - sndfile: optimized 16 bit playback\n  - mp4v2: support playback of MP4 files.\n* encoder:\n  - shine: new encoder plugin\n* output\n  - alsa: support native DSD playback\n  - alsa: rename \"DSD over USB\" to \"DoP\"\n  - osx: fix hang after (un)plugging headphones\n* threads:\n  - the update thread runs at \"idle\" priority\n  - the output thread runs at \"real-time\" priority\n  - increase kernel timer slack on Linux\n  - name each thread (for debugging)\n* configuration\n  - allow playlist directory without music directory\n  - use XDG to auto-detect \"music_directory\" and \"db_file\"\n* add tags \"AlbumSort\", \"MUSICBRAINZ_RELEASETRACKID\"\n* disable global Latin-1 fallback for tag values\n* new resampler option using libsoxr\n* ARM NEON optimizations\n* install systemd unit for socket activation\n* Android port\n\nver 0.18.23 (2015/02/06)\n* despotify: remove defunct plugin\n* fix clock integer overflow on OS X\n* fix gcc 5.0 warnings\n\nver 0.18.22 (2015/01/14)\n* fix clang 3.6 warnings\n\nver 0.18.21 (2014/12/17)\n* playlist\n  - embcue: fix filename suffix detection\n* decoder\n  - ffmpeg: fix time stamp underflow\n\nver 0.18.20 (2014/12/08)\n* decoder\n  - ffmpeg: support FFmpeg 2.5\n* fix build failure with musl\n\nver 0.18.19 (2014/11/26)\n* archive\n  - zzip: fix crash after seeking\n\nver 0.18.18 (2014/11/18)\n* decoder\n  - ffmpeg: support opus\n* fix crash on failed filename charset conversion\n* fix local socket detection from uid=0 (root)\n\nver 0.18.17 (2014/11/02)\n* playlist\n  - don't allow empty playlist name\n  - m3u: recognize the file suffix \".m3u8\"\n* decoder\n  - ignore URI query string for plugin detection\n  - faad: remove workaround for ancient libfaad2 ABI bug\n  - ffmpeg: recognize MIME type audio/aacp\n\nver 0.18.16 (2014/09/26)\n* fix DSD breakage due to typo in configure.ac\n\nver 0.18.15 (2014/09/26)\n* command\n  - list: reset used size after the list has been processed\n* fix MixRamp\n* work around build failure on NetBSD\n\nver 0.18.14 (2014/09/11)\n* protocol\n  - fix range parser bug on certain 32 bit architectures\n* decoder\n  - audiofile: fix crash after seeking\n  - ffmpeg: fix crash with ffmpeg/libav version 11\n  - fix assertion failure after seeking\n\nver 0.18.13 (2014/08/31)\n* protocol\n  - don't change song on \"seekcur\" in random mode\n\n* decoder\n  - dsdiff, dsf: fix endless loop on malformed file\n  - ffmpeg: support ffmpeg/libav version 11\n  - gme: fix song duration\n* output\n  - alsa: fix endless loop at end of file in dsd_usb mode\n* fix state file saver\n* fix build failure on Darwin\n\nver 0.18.12 (2014/07/30)\n* database\n  - proxy: fix build failure with libmpdclient 2.2\n  - proxy: fix add/search and other commands with libmpdclient < 2.9\n* decoder\n  - audiofile: improve responsiveness\n  - audiofile: fix WAV stream playback\n  - dsdiff, dsf: fix stream playback\n  - dsdiff: fix metadata parser bug (uninitialized variables)\n  - faad: estimate song duration for remote files\n  - sndfile: improve responsiveness\n* randomize next song when enabling \"random\" mode while not playing\n* randomize next song when adding to single-song queue\n\nver 0.18.11 (2014/05/12)\n* decoder\n  - opus: fix missing song length on high-latency files\n* fix race condition when using GLib event loop (non-Linux)\n\nver 0.18.10 (2014/04/10)\n* decoder\n  - ffmpeg: fix seeking bug\n  - ffmpeg: handle unknown stream start time\n  - gme: fix memory leak\n  - sndfile: work around libsndfile bug on partial read\n* don't interrupt playback when current song gets deleted\n\nver 0.18.9 (2014/03/02)\n* protocol\n  - \"findadd\" requires the \"add\" permission\n* output\n  - alsa: improved workaround for noise after manual song change\n* decoder\n  - vorbis: fix linker failure when libvorbis/libogg are static\n* encoder\n  - vorbis: fix another linker failure\n* output\n  - pipe: fix hanging child process due to blocked signals\n* fix build failure due to missing signal.h include\n\nver 0.18.8 (2014/02/07)\n* decoder\n  - ffmpeg: support libav v10_alpha1\n* encoder\n  - vorbis: fix linker failure\n* output\n  - roar: documentation\n* more robust Icy-Metadata parser\n* fix Solaris build failure\n\nver 0.18.7 (2014/01/13)\n* playlist\n  - pls: fix crash after parser error\n  - soundcloud: fix build failure with libyajl 2.0.1\n* decoder\n  - faad: fix memory leak\n  - mpcdec: reject libmpcdec SV7 in configure script\n* daemon: don't initialize supplementary groups when already running\n  as the configured user\n\nver 0.18.6 (2013/12/24)\n* input\n  - cdio_paranoia: support libcdio-paranoia 0.90\n* tags\n  - riff: recognize upper-case \"ID3\" chunk name\n* decoder\n  - ffmpeg: use relative timestamps\n* output\n  - openal: fix build failure on Mac OS X\n  - osx: fix build failure\n* mixer\n  - alsa: fix build failure with uClibc\n* fix replay gain during cross-fade\n* accept files without metadata\n\nver 0.18.5 (2013/11/23)\n* configuration\n  - fix crash when db_file is configured without music_directory\n  - fix crash on \"stats\" without db_file/music_directory\n* database\n  - proxy: auto-reload statistics\n  - proxy: provide \"db_update\" in \"stats\" response\n* input\n  - curl: work around stream resume bug (fixed in libcurl 7.32.0)\n* decoder\n  - fluidsynth: auto-detect by default\n* clip 24 bit data from libsamplerate\n* fix ia64, mipsel and other little-endian architectures\n* fix build failures due to missing includes\n* fix build failure with static libmpdclient\n\nver 0.18.4 (2013/11/13)\n* decoder\n  - dsdiff: fix byte order bug\n* fix build failures due to missing includes\n* libc++ compatibility\n\nver 0.18.3 (2013/11/08)\n* fix stuck MPD after song change (0.18.2 regression)\n\nver 0.18.2 (2013/11/07)\n* protocol:\n  - \"close\" flushes the output buffer\n* input:\n  - cdio_paranoia: add setting \"default_byte_order\"\n  - curl: fix bug with redirected streams\n* playlist:\n  - pls: fix reversed song order\n* decoder:\n  - audiofile: require libaudiofile 0.3 due to API breakage\n  - dsf: enable DSD128\n* enable buffering when starting playback (regression fix)\n* fix build failures due to missing includes\n* fix big-endian support\n\nver 0.18.1 (2013/11/04)\n* protocol:\n  - always ignore whitespace at the end of the line\n* networking:\n  - log UNIX domain path names instead of \"localhost\"\n  - open listener sockets in the order they were configured\n  - don't abort if IPv6 is not available\n* output:\n  - alsa: avoid endless loop in Raspberry Pi workaround\n* filter:\n  - autoconvert: fix \"volume_normalization\" with mp3 files\n* add missing files to source tarball\n\nver 0.18 (2013/10/31)\n* configuration:\n  - allow tilde paths for socket\n  - default filesystem charset is UTF-8 instead of ISO-8859-1\n  - increase default buffer size to 4 MB\n* protocol:\n  - new command \"readcomments\" lists arbitrary file tags\n  - new command \"toggleoutput\"\n  - \"find\"/\"search\" with \"any\" does not match file name\n  - \"search\" and \"find\" with base URI (keyword \"base\")\n  - search for album artist falls back to the artist tag\n  - re-add the \"volume\" command\n* input:\n  - curl: enable https\n  - soup: plugin removed\n* playlist:\n  - lastfm: remove defunct Last.fm support\n* decoder:\n  - adplug: new decoder plugin using libadplug\n  - dsf: don't play junk at the end of the \"data\" chunk\n  - ffmpeg: drop support for pre-0.8 ffmpeg\n  - flac: require libFLAC 1.2 or newer\n  - flac: support FLAC files inside archives\n  - opus: new decoder plugin for the Opus codec\n  - vorbis: skip 16 bit quantisation, provide float samples\n  - mikmod: add \"loop\" configuration parameter\n  - modplug: add \"loop_count\" configuration parameter\n  - mp4ff: obsolete plugin removed\n* encoder:\n  - opus: new encoder plugin for the Opus codec\n  - vorbis: accept floating point input samples\n* output:\n  - new option \"tags\" may be used to disable sending tags to output\n  - alsa: workaround for noise after manual song change\n  - ffado: remove broken plugin\n  - httpd: support HEAD requests\n  - mvp: remove obsolete plugin\n  - osx: disabled by default because it's unmaintained and unsupported\n* improved decoder/output error reporting\n* eliminate timer wakeup on idle MPD\n* fix unresponsive MPD while waiting for stream\n* port of the source code to C++11\n\nver 0.17.6 (2013/10/14)\n* mixer:\n  - alsa: fix busy loop when USB sound device gets unplugged\n* decoder:\n  - modplug: fix build with Debian package 1:0.8.8.4-4\n* stored playlists:\n  - fix loading playlists with references to local files\n  - obey filesystem_charset for URLs\n\nver 0.17.5 (2013/08/04)\n* protocol:\n  - fix \"playlistadd\" with URI\n  - fix \"move\" relative to current when there is no current song\n* decoder:\n  - ffmpeg: support \"application/flv\"\n  - mikmod: adapt to libmikmod 3.2\n* configure.ac:\n  - detect system \"ar\"\n\nver 0.17.4 (2013/04/08)\n* protocol:\n  - allow to omit END in ranges (START:END)\n  - don't emit IDLE_PLAYER before audio format is known\n* decoder:\n  - ffmpeg: support float planar audio (ffmpeg 1.1)\n  - ffmpeg: fix AVFrame allocation\n* player:\n  - implement missing \"idle\" events on output errors\n* clock: fix build failure\n\nver 0.17.3 (2013/01/06)\n* output:\n  - osx: fix pops during playback\n  - recorder: fix I/O error check\n  - shout: fix memory leak in error handler\n  - recorder, shout: support Ogg packets that span more than one page\n* decoder:\n  - ffmpeg: ignore negative time stamps\n  - ffmpeg: support planar audio\n* playlist:\n  - cue: fix memory leak\n  - cue: fix CUE files with only one track\n\nver 0.17.2 (2012/09/30)\n* protocol:\n  - fix crash in local file check\n* decoder:\n  - fluidsynth: remove throttle (requires libfluidsynth 1.1)\n  - fluidsynth: stop playback at end of file\n  - fluidsynth: check MIDI file format while scanning\n  - fluidsynth: add sample rate setting\n  - wavpack: support all APEv2 tags\n* output:\n  - httpd: use monotonic clock, avoid hiccups after system clock adjustment\n  - httpd: fix throttling bug after resuming playback\n* playlist:\n  - cue: map \"PERFORMER\" to \"artist\" or \"album artist\"\n* mapper: fix non-UTF8 music directory name\n* mapper: fix potential crash in file permission check\n* playlist: fix use-after-free bug\n* playlist: fix memory leak\n* state_file: save song priorities\n* player: disable cross-fading in \"single\" mode\n* update: fix unsafe readlink() usage\n* configure.ac:\n  - don't auto-detect the vorbis encoder when Tremor is enabled\n\nver 0.17.1 (2012/07/31)\n* protocol:\n  - require appropriate permissions for searchadd{,pl}\n* tags:\n  - aiff: support the AIFC format\n  - ape: check for ID3 if no usable APE tag was found\n* playlist:\n  - cue: support file types \"MP3\", \"AIFF\"\n* output:\n  - fix noisy playback with conversion and software volume\n\nver 0.17 (2012/06/27)\n* protocol:\n  - support client-to-client communication\n  - \"update\" and \"rescan\" need only \"CONTROL\" permission\n  - new command \"seekcur\" for simpler seeking within current song\n  - new command \"config\" dumps location of music directory\n  - add range parameter to command \"load\"\n  - print extra \"playlist\" object for embedded CUE sheets\n  - new commands \"searchadd\", \"searchaddpl\"\n* input:\n  - cdio_paranoia: new input plugin to play audio CDs\n  - curl: enable CURLOPT_NETRC\n  - curl: non-blocking I/O\n  - soup: new input plugin based on libsoup\n* tags:\n  - RVA2: support separate album/track replay gain\n* decoder:\n  - mpg123: implement seeking\n  - ffmpeg: drop support for pre-0.5 ffmpeg\n  - ffmpeg: support WebM\n  - oggflac: delete this obsolete plugin\n  - dsdiff: new decoder plugin\n* output:\n  - alsa: support DSD-over-USB (dCS suggested standard)\n  - httpd: support for streaming to a DLNA client\n  - openal: improve buffer cancellation\n  - osx: allow user to specify other audio devices\n  - osx: implement 32 bit playback\n  - shout: add possibility to set url\n  - roar: new output plugin for RoarAudio\n  - winmm: fail if wrong device specified instead of using default device\n* mixer:\n  - alsa: listen for external volume changes\n* playlist:\n  - allow references to songs outside the music directory\n  - new CUE parser, without libcue\n  - soundcloud: new plugin for accessing soundcloud.com\n* state_file: add option \"restore_paused\"\n* cue: show CUE track numbers\n* allow port specification in \"bind_to_address\" settings\n* support floating point samples\n* systemd socket activation\n* improve --version output\n* WIN32: fix renaming of stored playlists with non-ASCII names\n\n\nver 0.16.8 (2012/04/04)\n* fix for libsamplerate assertion failure\n* decoder:\n  - vorbis (and others): fix seeking at startup\n  - ffmpeg: read the \"year\" tag\n* encoder:\n  - vorbis: generate end-of-stream packet before tag\n  - vorbis: generate end-of-stream packet when playback ends\n* output:\n  - jack: check for connection failure before starting playback\n  - jack: workaround for libjack1 crash bug\n  - osx: fix stuttering due to buffering bug\n* fix endless loop in text file reader\n* update: skip symlinks in path that is to be updated\n\n\nver 0.16.7 (2012/02/04)\n* input:\n  - ffmpeg: support libavformat 0.7\n* decoder:\n  - ffmpeg: support libavformat 0.8, libavcodec 0.9\n  - ffmpeg: support all MPD tags\n* output:\n  - httpd: fix excessive buffering\n  - openal: force 16 bit playback, as 8 bit doesn't work\n  - osx: remove sleep call from render callback\n  - osx: clear render buffer when there's not enough data\n* fix moving after current song\n\n\nver 0.16.6 (2011/12/01)\n* decoder:\n  - fix assertion failure when resuming streams\n  - ffmpeg: work around bogus channel count\n* encoder:\n  - flac, null, wave: fix buffer corruption bug\n  - wave: support packed 24 bit samples\n* mapper: fix the bogus \"not a directory\" error message\n* mapper: check \"x\" and \"r\" permissions on music directory\n* log: print reason for failure\n* event_pipe: fix WIN32 regression\n* define WINVER in ./configure\n* WIN32: autodetect filesystem encoding\n\n\nver 0.16.5 (2011/10/09)\n* configure.ac\n  - disable assertions in the non-debugging build\n  - show solaris plugin result correctly\n  - add option --enable-solaris-output\n* pcm_format: fix 32-to-24 bit conversion (the \"silence\" bug)\n* input:\n  - rewind: reduce heap usage\n* decoder:\n  - ffmpeg: higher precision timestamps\n  - ffmpeg: don't require key frame for seeking\n  - fix CUE track seeking\n* output:\n  - openal: auto-fallback to mono if channel count is unsupported\n* player:\n  - make seeking to CUE track more reliable\n  - the \"seek\" command works when MPD is stopped\n  - restore song position from state file (bug fix)\n  - fix crash that sometimes occurred when audio device fails on startup\n  - fix absolute path support in playlists\n* WIN32: close sockets properly\n* install systemd service file if systemd is available\n\n\nver 0.16.4 (2011/09/01)\n* don't abort configure when avahi is not found\n* auto-detect libmad without pkg-config\n* fix memory leaks\n* don't resume playback when seeking to another song while paused\n* apply follow_inside_symlinks to absolute symlinks\n* fix playback discontinuation after seeking\n* input:\n  - curl: limit the receive buffer size\n  - curl: implement a hard-coded timeout of 10 seconds\n* decoder:\n  - ffmpeg: workaround for semantic API change in recent ffmpeg versions\n  - flac: validate the sample rate when scanning the tag\n  - wavpack: obey all decoder commands, stop at CUE track border\n* encoder:\n  - vorbis: don't send end-of-stream on flush\n* output:\n  - alsa: fix SIGFPE when alsa announces a period size of 0\n  - httpd: don't warn on client disconnect\n  - osx: don't drain the buffer when closing\n  - pulse: fix deadlock when resuming the stream\n  - pulse: fix deadlock when the stream was suspended\n\n\nver 0.16.3 (2011/06/04)\n* fix assertion failure in audio format mask parser\n* fix NULL pointer dereference in playlist parser\n* fix playlist files in base music directory\n* database: allow directories with just playlists\n* decoder:\n  - ffmpeg: support libavcodec 0.7\n\n\nver 0.16.2 (2011/03/18)\n* configure.ac:\n  - fix bashism in tremor test\n* decoder:\n  - tremor: fix configure test\n  - gme: detect end of song\n* encoder:\n  - vorbis: reset the Ogg stream after flush\n* output:\n  - httpd: fix uninitialized variable\n  - httpd: include sys/socket.h\n  - oss: AFMT_S24_PACKED is little-endian\n  - oss: disable 24 bit playback on FreeBSD\n\n\nver 0.16.1 (2011/01/09)\n* audio_check: fix parameter in prototype\n* add void casts to suppress \"result unused\" warnings (clang)\n* input:\n  - ffado: disable by default\n* decoder:\n  - mad: work around build failure on Solaris\n  - resolve modplug vs. libsndfile cflags/headers conflict\n* output:\n  - solaris: add missing parameter to open_cloexec() cal\n  - osx: fix up audio format first, then apply it to device\n* player_thread: discard empty chunks while cross-fading\n* player_thread: fix assertion failure due to early seek\n* output_thread: fix double lock\n\n\nver 0.16 (2010/12/11)\n* protocol:\n  - send song modification time to client\n  - added \"update\" idle event\n  - removed the deprecated \"volume\" command\n  - added the \"findadd\" command\n  - range support for \"delete\"\n  - \"previous\" really plays the previous song\n  - \"addid\" with negative position is deprecated\n  - \"load\" supports remote playlists (extm3u, pls, asx, xspf, lastfm://)\n  - allow changing replay gain mode on-the-fly\n  - omitting the range end is possible\n  - \"update\" checks if the path is malformed\n* archive:\n  - iso: renamed plugin to \"iso9660\"\n  - zip: renamed plugin to \"zzip\"\n* input:\n  - lastfm: obsolete plugin removed\n  - ffmpeg: new input plugin using libavformat's \"avio\" library\n* tags:\n  - added tags \"ArtistSort\", \"AlbumArtistSort\"\n  - id3: revised \"performer\" tag support\n  - id3: support multiple values\n  - ape: MusicBrainz tags\n  - ape: support multiple values\n* decoders:\n  - don't try a plugin twice (MIME type & suffix)\n  - don't fall back to \"mad\" unless no plugin matches\n  - ffmpeg: support multiple tags\n  - ffmpeg: convert metadata to generic format\n  - ffmpeg: implement the libavutil log callback\n  - sndfile: new decoder plugin based on libsndfile\n  - flac: moved CUE sheet support to a playlist plugin\n  - flac: support streams without STREAMINFO block\n  - mikmod: sample rate is configurable\n  - mpg123: new decoder plugin based on libmpg123\n  - sidplay: support sub-tunes\n  - sidplay: implemented songlength database\n  - sidplay: support seeking\n  - sidplay: play monaural SID tunes in mono\n  - sidplay: play mus, str, prg, x00 files\n  - wavpack: activate 32 bit support\n  - wavpack: allow more than 2 channels\n  - mp4ff: rename plugin \"mp4\" to \"mp4ff\"\n* encoders:\n  - twolame: new encoder plugin based on libtwolame\n  - flac: new encoder plugin based on libFLAC\n  - wave: new encoder plugin for PCM WAV format\n* output:\n  - recorder: new output plugin for recording radio streams\n  - alsa: don't recover on CANCEL\n  - alsa: fill period buffer with silence before draining\n  - openal: new output plugin\n  - pulse: announce \"media.role=music\"\n  - pulse: renamed context to \"Music Player Daemon\"\n  - pulse: connect to server on MPD startup, implement pause\n  - jack: require libjack 0.100\n  - jack: don't disconnect during pause\n  - jack: connect to server on MPD startup\n  - jack: added options \"client_name\", \"server_name\"\n  - jack: clear ring buffers before activating\n  - jack: renamed option \"ports\" to \"destination_ports\"\n  - jack: support more than two audio channels\n  - httpd: bind port when output is enabled\n  - httpd: added name/genre/website configuration\n  - httpd: implement \"pause\"\n  - httpd: bind_to_address support (including IPv6)\n  - oss: 24 bit support via OSS4\n  - win32: new output plugin for Windows Wave\n  - shout, httpd: more responsive to control commands\n  - wildcards allowed in audio_format configuration\n  - consistently lock audio output objects\n* player:\n  - drain audio outputs at the end of the playlist\n* mixers:\n  - removed support for legacy mixer configuration\n  - reimplemented software volume as mixer+filter plugin\n  - per-device software/hardware mixer setting\n* commands:\n  - added new \"status\" line with more precise \"elapsed time\"\n* update:\n  - automatically update the database with Linux inotify\n  - support .mpdignore files in the music directory\n  - sort songs by album name first, then disc/track number\n  - rescan after metadata_to_use change\n* normalize: upgraded to AudioCompress 2.0\n  - automatically convert to 16 bit samples\n* replay gain:\n  - reimplemented as a filter plugin\n  - fall back to track gain if album gain is unavailable\n  - optionally use hardware mixer to apply replay gain\n  - added mode \"auto\"\n  - parse replay gain from APE tags\n* log unused/unknown block parameters\n* removed the deprecated \"error_file\" option\n* save state when stopped\n* renamed option \"--stdout\" to \"--stderr\"\n* removed options --create-db and --no-create-db\n* state_file: save only if something has changed\n* database: eliminated maximum line length\n* log: redirect stdout/stderr to /dev/null if syslog is used\n* set the close-on-exec flag on all file descriptors\n* pcm_volume, pcm_mix: implemented 32 bit support\n* support packed 24 bit samples\n* CUE sheet support\n* support for MixRamp tags\n* obey $(sysconfdir) for default mpd.conf location\n* build with large file support by default\n* added test suite (\"make check\")\n* require GLib 2.12\n* added libwrap support\n* make single mode 'sticky'\n\n\nver 0.15.17 (2011/??/??)\n* encoder:\n  - vorbis: reset the Ogg stream after flush\n* decoders:\n  - vorbis: fix tremor support\n\n\nver 0.15.16 (2011/03/13)\n* output:\n  - ao: initialize the ao_sample_format struct\n  - jack: fix crash with mono playback\n* encoders:\n  - lame: explicitly configure the output sample rate\n* update: log all file permission problems\n\n\nver 0.15.15 (2010/11/08)\n* input:\n  - rewind: fix assertion failure\n* output:\n  - shout: artist comes first in stream title\n\n\nver 0.15.14 (2010/11/06)\n* player_thread: fix assertion failure due to wrong music pipe on seek\n* output_thread: fix assertion failure due to race condition in OPEN\n* input:\n  - rewind: fix double free bug\n* decoders:\n  - mp4ff, ffmpeg: add extension \".m4b\" (audio book)\n\n\nver 0.15.13 (2010/10/10)\n* output_thread: fix race condition after CANCEL command\n* output:\n  - httpd: fix random data in stream title\n  - httpd: MIME type audio/ogg for Ogg Vorbis\n* input:\n  - rewind: update MIME not only once\n  - rewind: enable for MMS\n\n\nver 0.15.12 (2010/07/20)\n* input:\n  - curl: remove assertion after curl_multi_fdset()\n* tags:\n  - rva2: set \"gain\", not \"peak\"\n* decoders:\n  - wildmidi: support version 0.2.3\n\n\nver 0.15.11 (2010/06/14)\n* tags:\n  - ape: support album artist\n* decoders:\n  - mp4ff: support tags \"album artist\", \"albumartist\", \"band\"\n  - mikmod: fix memory leak\n  - vorbis: handle uri==NULL\n  - ffmpeg: fix memory leak\n  - ffmpeg: free AVFormatContext on error\n  - ffmpeg: read more metadata\n  - ffmpeg: fix libavformat 0.6 by using av_open_input_stream()\n* playlist: emit IDLE_OPTIONS when resetting single mode\n* listen: make get_remote_uid() work on BSD\n\n\nver 0.15.10 (2010/05/30)\n* input:\n  - mms: fix memory leak in error handler\n  - mms: initialize the \"eof\" attribute\n* decoders:\n  - mad: properly calculate ID3 size without libid3tag\n\n\nver 0.15.9 (2010/03/21)\n* decoders:\n  - mad: fix crash when seeking at end of song\n  - mpcdec: fix negative shift on fixed-point samples\n  - mpcdec: fix replay gain formula with v8\n* playlist: fix single+repeat in random mode\n* player: postpone song tags during cross-fade\n\n\nver 0.15.8 (2010/01/17)\n* input:\n  - curl: allow rewinding with Icy-Metadata\n* decoders:\n  - ffmpeg, flac, vorbis: added more flac/vorbis MIME types\n  - ffmpeg: enabled libavformat's file name extension detection\n* dbUtils: return empty tag value only if no value was found\n* decoder_thread: fix CUE track playback\n* queue: don't repeat current song in consume mode\n\n\nver 0.15.7 (2009/12/27)\n* archive:\n  - close archive when stream is closed\n  - iso, zip: fixed memory leak in destructor\n* input:\n  - file: don't fall back to parent directory\n  - archive: fixed memory leak in error handler\n* tags:\n  - id3: fix ID3v1 charset conversion\n* decoders:\n  - eliminate jitter after seek failure\n  - ffmpeg: don't try to force stereo\n  - wavpack: allow fine-grained seeking\n* mixer: explicitly close all mixers on shutdown\n* mapper: fix memory leak when playlist_directory is not set\n* mapper: apply filesystem_charset to playlists\n* command: verify playlist name in the \"rm\" command\n* database: return multiple tag values per song\n\n\nver 0.15.6 (2009/11/18)\n* input:\n  - lastfm: fixed variable name in GLib<2.16 code path\n  - input/mms: require libmms 0.4\n* archive:\n  - zzip: require libzzip 0.13\n* tags:\n  - id3: allow 4 MB RIFF/AIFF tags\n* decoders:\n  - ffmpeg: convert metadata\n  - ffmpeg: align the output buffer\n  - oggflac: rewind stream after FLAC detection\n  - flac: fixed CUE seeking range check\n  - flac: fixed NULL pointer dereference in CUE code\n* output_thread: check again if output is open on PAUSE\n* update: delete ignored symlinks from database\n* database: increased maximum line length to 32 kB\n* sticker: added fallback for sqlite3_prepare_v2()\n\n\nver 0.15.5 (2009/10/18)\n* input:\n  - curl: don't abort if a packet has only metadata\n  - curl: fixed endless loop during buffering\n* tags:\n  - riff, aiff: fixed \"limited range\" gcc warning\n* decoders:\n  - flac: fixed two memory leaks in the CUE tag loader\n* decoder_thread: change the fallback decoder name to \"mad\"\n* output_thread: check again if output is open on CANCEL\n* update: fixed memory leak during container scan\n\n\nver 0.15.4 (2009/10/03)\n* decoders:\n  - vorbis: revert \"faster tag scanning with ov_test_callback()\"\n  - faad: skip assertion failure on large ID3 tags\n  - ffmpeg: use the \"artist\" tag if \"author\" is not present\n* output:\n  - osx: fix the OS X 10.6 build\n\n\nver 0.15.3 (2009/08/29)\n* decoders:\n  - vorbis: faster tag scanning with ov_test_callback()\n* output:\n  - fix stuttering due to uninitialized variable\n* update: don't re-read unchanged container files\n\n\nver 0.15.2 (2009/08/15)\n* tags:\n  - ape: check the tag size (fixes integer underflow)\n  - ape: added protection against large memory allocations\n* decoders:\n  - mad: skip ID3 frames when libid3tag is disabled\n  - flac: parse all replaygain tags\n  - flac: don't allocate cuesheet twice (memleak)\n* output:\n  - shout: fixed stuck pause bug\n  - shout: minimize the unpause latency\n* update: free empty path string (memleak)\n* update: free temporary string in container scan (memleak)\n* directory: free empty directories after removing them (memleak)\n\n\nver 0.15.1 (2009/07/15)\n* decoders:\n  - flac: fix assertion failure in tag_free() call\n* output:\n  - httpd: include sys/types.h (fixes Mac OS X)\n* commands:\n  - don't resume playback when stopping during pause\n* database: fixed NULL pointer dereference after charset change\n* log: fix double free() bug during shutdown\n\n\nver 0.15 (2009/06/23)\n* input:\n  - parse Icy-Metadata\n  - added support for the MMS protocol\n  - hide HTTP password in playlist\n  - lastfm: new input plugin for last.fm radio (experimental and incomplete!)\n  - curl: moved proxy settings to \"input\" block\n* tags:\n  - support the \"album artist\" tag\n  - support MusicBrainz tags\n  - parse RVA2 tags in mp3 files\n  - parse ID3 tags in AIFF/RIFF/WAV files\n  - ffmpeg: support new metadata API\n  - ffmpeg: added support for the tags comment, genre, year\n* decoders:\n  - audiofile: streaming support added\n  - audiofile: added 24 bit support\n  - modplug: another MOD plugin, based on libmodplug\n  - mikmod disabled by default, due to severe security issues in libmikmod\n  - sidplay: new decoder plugin for C64 SID (using libsidplay2)\n  - fluidsynth: new decoder plugin for MIDI files (using libfluidsynth,\n    experimental due to shortcomings in libfluidsynth)\n  - wildmidi: another decoder plugin for MIDI files (using libwildmidi)\n  - flac: parse stream tags\n  - mpcdec: support the new libmpcdec SV8 API\n  - added configuration option to disable decoder plugins\n  - flac: support embedded cuesheets\n  - ffmpeg: updated list of supported formats\n* audio outputs:\n  - added option to disable audio outputs by default\n  - wait 10 seconds before reopening after play failure\n  - shout: enlarged buffer size to 32 kB\n  - null: allow disabling synchronization\n  - mvp: fall back to stereo\n  - mvp: fall back to 16 bit audio samples\n  - mvp: check for reopen errors\n  - mvp: fixed default device detection\n  - pipe: new audio output plugin which runs a command\n  - alsa: better period_time default value for high sample rates\n  - solaris: new audio output plugin for Solaris /dev/audio\n  - httpd: new audio output plugin for web based streaming, similar to icecast\n     but built in.\n* commands:\n  - \"playlistinfo\" and \"move\" supports a range now\n  - added \"sticker database\", command \"sticker\", which allows clients\n     to implement features like \"song rating\"\n  - added \"consume\" command which removes a song after play\n  - added \"single\" command, if activated, stops playback after current song or\n     repeats the song if \"repeat\" is active.\n* mixers:\n  - rewritten mixer code to support multiple mixers\n  - new pulseaudio mixer\n  - alsa: new mixer_index option supports choosing between multiple\n    identically-named controls on a device.\n* Add audio archive extraction support:\n  - bzip2\n  - iso9660\n  - zip\n* the option \"error_file\" was removed, all messages are logged into\n   \"log_file\"\n* support logging to syslog\n* fall back to XDG music directory if no music_directory is configured\n* failure to read the state file is non-fatal\n* --create-db starts the MPD daemon instead of exiting\n* playlist_directory and music_directory are optional\n* playlist: recalculate the queued song after random is toggled\n* playlist: don't unpause on delete\n* pause when all audio outputs fail to play\n* daemon: ignore \"user\" setting if already running as that user\n* listen: fix broken client IP addresses in log\n* listen: bind failure on secondary address is non-fatal\n* 24/32 bit audio support\n* print available protocols in --version\n* fill buffer after seeking\n* choose the fallback resampler at runtime\n* steps taken towards win32 compatibility\n* require glib 2.6 or greater\n* built-in documentation using doxygen and docbook\n\n\nver 0.14.2 (2009/02/13)\n* configure.ac:\n  - define HAVE_FFMPEG after all checks\n* decoders:\n  - ffmpeg: added support for the tags comment, genre, year\n  - ffmpeg: don't warn of empty packet output\n  - ffmpeg: check if the time stamp is valid\n  - ffmpeg: fixed seek integer overflow\n  - ffmpeg: enable WAV streaming\n  - ffmpeg: added TTA support\n  - wavpack: pass NULL if the .wvc file fails to open\n  - mikmod: call MikMod_Exit() only in the finish() method\n  - aac: fix stream metadata\n* audio outputs:\n  - jack: allocate ring buffers before connecting\n  - jack: clear \"shutdown\" flag on reconnect\n  - jack: reduced sleep time to 1ms\n  - shout: fixed memory leak in the mp3 encoder\n  - shout: switch to blocking mode\n  - shout: use libshout's synchronization\n  - shout: don't postpone metadata\n  - shout: clear buffer before calling the encoder\n* mapper: remove trailing slashes from music_directory\n* player: set player error when output device fails\n* update: recursively purge deleted directories\n* update: free deleted subdirectories\n\nver 0.14.1 (2009/01/17)\n* decoders:\n  - mp4: support the writer/composer tag\n  - id3: strip leading and trailing whitespace from ID3 tags\n  - oggvorbis: fix tremor support\n  - oggvorbis: disable seeking on remote files\n* audio outputs:\n  - jack: allocate default port names (fixes a crash)\n* update:\n  - refresh stats after update\n  - save the database even if it is empty\n* input_curl:\n  - use select() to eliminate busy loop during connect\n  - honour http_proxy_* config directives\n  - fix assertion failure on \"connection refused\"\n  - fix assertion failure with empty HTTP responses\n* corrected the sample calculation in the fallback resampler\n* log: automatically append newline\n* fix setenv() conflict on Solaris\n* configure.ac: check for pkg-config before using it\n* fix minor memory leak in decoder_tag()\n* fix cross-fading bug: it used to play some chunks of the new song twice\n* playlist\n  - fix assertion failure during playlist load\n  - implement Fisher-Yates shuffle properly\n  - safely search the playlist for deleted song\n* use custom PRNG for volume dithering (speedup)\n* detect libid3tag without pkg-config\n\nver 0.14 (2008/12/25)\n* audio outputs:\n  - wait 10 seconds before reopening a failed device\n  - fifo: new plugin\n  - null: new plugin\n  - shout: block while trying to connect instead of failing\n  - shout: new timeout parameter\n  - shout: support mp3 encoding and the shoutcast protocol\n  - shout: send silence during pause, so clients don't get disconnected\n* decoders:\n  - ffmpeg: new plugin\n  - wavpack: new plugin\n  - aac: stream support added\n  - mod: disabled by default due to critical bugs in all libmikmod versions\n* commands:\n  - \"addid\" takes optional second argument to specify position\n  - \"idle\" notifies the client when a notable change occurs\n* Zeroconf support using Bonjour\n* New zeroconf_enabled option so that Zeroconf support can be disabled\n* Stop the player/decode processes when not playing to allow the CPU to sleep\n* Fix a bug where closing an ALSA dmix device could cause MPD to hang\n* Support for reading ReplayGain from LAME tags on MP3s\n* MPD is now threaded, which greatly improves performance and stability\n* memory usage reduced by merging duplicate tags in the database\n* support connecting via unix domain socket\n* allow authenticated local users to add any local file to the playlist\n* 24 bit audio support\n* optimized PCM conversions and dithering\n* much code has been replaced by using GLib\n* the HTTP client has been replaced with libcurl\n* symbolic links in the music directory can be disabled; the default\n  is to ignore symlinks pointing outside the music directory\n\nver 0.13.0 (2007/5/28)\n* New JACK audio output\n* Support for \"file\" as an alternative to \"filename\" in search, find, and list\n* FLAC 1.1.3 API support\n* New playlistadd command for adding to stored playlists\n* New playlistclear command for clearing stored playlists\n* Fix a bug where \"find any\" and \"list <type> any\" wouldn't return any results\n* Make \"list any\" return an error instead of no results and an OK\n* New gapless_mp3_playback option to disable gapless MP3 playback\n* Support for seeking HTTP streams\n* Zeroconf support using Avahi\n* libsamplerate support for high quality audio resampling\n* ID3v2 \"Original Artist/Performer\" tag support\n* New playlistsearch command for searching the playlist (similar to \"search\")\n* New playlistfind command for finding songs in the playlist (similar to \"find\")\n* libmikmod 3.2.0 beta support\n* New tagtypes command for retrieving a list of available tag types\n* Fix a bug where no ACK was returned if loading a playlist failed\n* Fix a bug where db_update in stats would be 0 after initial database creation\n* New count command for getting stats on found songs (similar to \"find\")\n* New playlistmove command for moving songs in stored playlists\n* New playlistdelete command for deleting songs from stored playlists\n* New rename command for renaming stored playlists\n* Increased default buffer_before_play from 0% to 10% to prevent skipping\n* Lots of bug fixes, cleaned up code, and performance improvements\n\nver 0.12.2 (2007/3/20)\n* Fix a bug where clients could cause MPD to segfault\n\nver 0.12.1 (2006/10/10)\n* Fix segfault when scanning an MP3 that has a Xing tag with 0 frames\n* Fix segfault when there's no audio output specified and one can't be detected\n* Fix handling of escaping in quotes\n* Allow a quality of -1 to be specified for shout outputs\n* A few minor cleanups\n\nver 0.12.0 (2006/9/22)\n* New audio output code which supports:\n  * A plugin-like architecture\n  * Non-libao (\"native\") outputs:\n    * ALSA\n    * OSS\n    * OS X\n    * Media MVP\n    * PulseAudio\n    * Shout (Icecast or Shoutcast)\n  * Playing through multiple outputs at once\n  * Enabling/disabling outputs while MPD is running\n  * Saving output state (enabled/disabled) to the state_file\n* OggFLAC support\n* Musepack support\n* Gapless MP3 playback\n* MP3 ReplayGain support (using ID3v2 tags only)\n* Support for MP2 files if MP3 support is enabled\n* Composer, Performer, Comment, and Disc metadata support\n* New outputs command for listing available audio outputs\n* New enableoutput and disableoutput commands for enabling/disabling outputs\n* New plchangesposid command for a stripped down version of plchanges\n* New addid command for adding to the playlist and returning a song ID\n* New commands and notcommands commands for checking available commands\n* Can now specify any supported metadata type or \"any\" in search, find, and list\n* New volume_normalization parameter for enabling Audio Compress normalization\n* New metadata_to_use parameter for choosing supported metadata types\n* New pid_file parameter for saving the MPD process ID to the specified file\n* The db_file parameter is now required\n* The port parameter is now optional (defaults to 6600)\n* Can specify bind_to_address multiple times\n* New --kill argument for killing MPD if pid_file is specified\n* Removed --update-db argument (use the update function in your client instead)\n* New mpdconf.example\n* New mpd.conf man page \n* Removed bundled libmad and libid3tag\n* Lots of bug fixes, cleaned up code, and performance improvements\n\nver 0.11.5 (2004/11/1)\n1) New id3v1_encoding config option to configure the id3v1 tag encoding (patch\nfrom dottedmag)\n2) Strip '\\r' from m3u playlists (thank you windows)\n3) Use random() instead of rand() for playlist randomizing\n4) Fix a bug trying skipping some commented lines in m3u playlist files\n5) Fix a bug when fetching metadata from streams that may cause certain\nweirdnesses\n6) Fix a bug where replaygain preamp was used on files w/o replaygain tags\n7) Fix a busy loop when trying to prebuffer a nonexistant or missing stream\n8) Fix a bug in forgetting to remove leading ' ' in content-type for http\nstreams\n9) Check for ice-name in http headers\n10) Be sure the strip all '\\n' chars in tags\n11) Set $HOME env variable when setuid'ing, this should fix the /root/.mcop\nerrors triggered by arts/libao\n\nver 0.11.4 (2004/7/26)\n1) Fixed a segfault when decoding mp3's with corrupt id3v2 tags\n2) Fixed a memory leak when encountering id3v2 tags in mp3 decoder\n\nver 0.11.3 (2004/7/21)\n1) Add support for http authentication for streams\n2) Added replaygain pre-amp support\n3) Better error handling for fread() in inputStream_file\n4) Fixed a bug so that when a freeAllInterfaces is called, it sets\nmax_interface_connections to 0.  This prevents potential segfaults and other\nnastiness for forked processes, like the player and update-er (do to\ninterfacePrintWithFD()).\n5) Allow blockingWrite() to handle errors more gracefully (for example, if the\ndisc is full, and thus the write() fails or can't be completed, we just skip\nthis write() and continue, instead of getting stuck in an infinite loop until\nthe write() becomes successful)\n6) Updated mpdconf.example from sbh/avuton\n7) If \"user\" is specified, then convert ~ in paths to the user's home path\nspecified by \"user\" config paramter (not the actual current user running mpd).\n\nver 0.11.2 (2004/7/5) \n1) Work around in computing total time for mp3's whose first valid mpeg frame is\nnot layer III\n2) Fix mp3 and mp4 decoders when seeking past the end of the file\n3) Fix replaygain for flac and vorbis\n4) Fix memory leaks in flac decoder (from normalperson)\n5) Fix Several other bugs in playlist.c and directory.c (from normalperson)\n\nver 0.11.1 (2004/6/24)\n1) Fix a bug that caused \"popping\" at the beginning of mp3's\n2) Fix playlistid command\n3) Fix move commands so they don't mess up the song id's\n4) Added support for HTTP Proxy\n5) Detect and skip recursive links in the music directory\n6) Fix addPathToDB() so updating on a specific path doesn't exist correctly adds\nthe parent directories to the DB\n\nver 0.11.0 (2004/6/18)\n1) Support for playing mp3 and Ogg Vorbis streams\n2) Non-blocking Update\n3) Replaygain support for Ogg Vorbis and FLAC (by Eric Moore aka AliasMrJones)\n4) audio_output_format option that allows for all audio output to be converted\nto a format compatible with any sound card\n5) Own routines for to always support UTF-8 <-> ISO-8859-1 conversion\n6) Added \"Id\" and \"Pos\" metadata for songs in playlist\n7) Added commands: plchanges, currentsong, playid, seekid, playlistid, moveid,\nswapid, deleteid\n8) UTF-8 validation of all tags\n9) Update specific files/directories (for fast, incremental updating)\n10) Added ACK error codes\n11) Mod file support\n12) Added command_list_ok_begin\n13) Play after stop resumes from last position in the playlist\n14) Play while pause resumes playback\n15) Better signal handling by mackstann\n16) Cleanup decoder interface (now called InputPlugins)\n17) --create-db no long starts the daemon\n18) --no-daemon outputs to log files\n19) --stdout sends output to stdout/stderr\n20) Default port is now 6600\n21) Lots of other cleanups and Bugfixes\n\nver 0.10.4 (2004/5/26)\n1) Fix configure problems on OpenBSD with langinfo and iconv\n2) Fix an infinte loop when writing to an interface and it has expired\n3) Fix a segfault in decoding flac's\n4) Ingore CRC stuff in mp3's since some encoders did not compute the CRC\ncorrectly\n5) Fix a segfault in processing faulty mp4 metadata\n\nver 0.10.3 (2004/4/2)\n1) Fix a segfault when a blanck line is sent from a client\n2) Fix for loading playlists on platforms where char is unsigned\n3) When pausing, release audio device after we say pause is successful (this\nmakes pause appear to not lag)\n4) When returning errors for unknown types by player, be sure to copy the\nfilename\n5) add --disable-alsa for disabling alsa mixer support\n6) Use select() for a portable usleep()\n7) For alsa mixer, default to \"Master' element, not first element\n\nver 0.10.2 (2004/3/25)\n1) Add suport for AAC\n2) Substitute '\\n' with ' ' in tag info\n3) Remove empty directories from db\n4) Resume from current position in song when using state file\n5) Pause now closes the music device, and reopens it on resuming\n6) Fix unnecessary big endian byte swapping\n7) If locale is \"C\" or \"POSIX\", then use ISO-8859-1 as the fs charset\n8) Fix a bug where alsa mixer wasn't detecting volume changes\n9) For alsa and software mixer, show volume to be the same as it was set (even\nif its not the exact volume)\n10) Report bitrate for wave files\n11) Compute song length of CBR mp3's more accurately\n\nver 0.10.1 (2004/3/7)\n1) Check to see if we need to add \"-lm\" when linking mpd\n2) Fix issues with skipping bad frames in an mp3 (this way we get the correct\nsamplerate and such)\n3) Fix crossfading bug with ogg's\n4) Updated libmad and libid3tag included w/ source to 0.15.1b\n\nver 0.10.0 (2004/3/3)\n1) Use UTF-8 for all client communications\n2) Crossfading support\n3) Password Authentication (all in plaintext)\n4) Software mixer\n5) Buffer Size is configurable\n6) Reduced Memory consumption (use directory tree for search and find)\n7) Bitrate support for Flac\n8) setvol command (deprecates volume command)\n9) add command takes directories\n10) Path's in config file now work with ~\n11) Add samplerate,bits, and channels to status\n12) Reenable playTime in stats display\n13) Fix a segfault when doing: add \"\"\n14) Fix a segfault with flac vorbis comments simply being \"=\"\n15) Fix a segfault/bug in queueNextSong with repeat+random\n16) Fix a bug, where one process may segfault, and cause more processes to spawn\nw/o killing ones that lost their parent.\n17) Fix a bug when the OSS device was unable to fetch the current volume,\nit would close the device (when it maybe previously closed by the exact same\ncode)\n18) command.c cleanup by mackstann\n19) directory.c and command.c cleanup by tw-nym\n\nver 0.9.4 (2004/1/21)\n1) Fix a bug where updated tag info wasn't being detected\n2) Set the default audio write size to 1024 bytes (should decrease cpu load a\nbit on some machines).\n3) Make audio write size configurable via \"audio_write_size\" config option\n4) Tweak output buffer size for connections by detecting the kernel output\nbuffer size.\n\nver 0.9.3 (2003/10/31)\n1) Store total time/length of songs in db and display in *info commands\n2) Display instantaneous bitrate in status command\n3) Add Wave Support using libaudiofile (Patch from normalperson)\n4) Command code cleanup (Patch from tw-nym)\n5) Optimize listing of playlists (10-100x faster)\n6) Optimize interface output (write in 4kB chunks instead of on every '\\n')\n7) Fix bug that prevented rm command from working\n8) Fix bug where deleting current song skips the next song\n9) Use iconv to convert vorbis comments from UTF-8 to Latin1\n\nver 0.9.2 (2003/10/6)\n1) Fix FreeBSD Compilation Problems\n2) Fix bug in move command\n3) Add mixer_control options to configure which mixer control/device mpd\ncontrols\n4) Randomize on play -1\n5) Fix a bug in toggling repeat off and at the end of the playlist\n\nver 0.9.1 (2003/9/30)\n1) Fix a statement in the middle of declarations in listen.c, causes error for\ngcc 2.7\n\nver 0.9.0 (2003/9/30)\n1) Random play mode\n2) Alsa Mixer Support\n3) Save and Restore \"state\"\n4) Default config file locations (.mpdconf and /etc/mpd.conf)\n5) Make db file locations configurable\n6) Move songs around in the playlist\n7) Gapless playback\n8) Use Xing tags for mp3's\n9) Remove stop_on_error\n10) Seeking support\n11) Playlists can be loaded and deleted from subdirectories\n12) Complete rewrite of player layer (fork()'s only once, opens and closes\naudio device as needed).\n13) Eliminate use and dependence of SIGIO\n14) IPv6 support\n15) Solaris compilations fixes\n16) Support for different log levels\n17) Timestamps for log entries\n18) \"user\" config parameter for setuid (patch from Nagilum)\n19) Other misc features and bug fixes\n\nver 0.8.7 (2003/9/3)\n1) Fix a memory leak.  When closing a interface, was called close() on the fd\ninstead of calling fclose() on the fp that was opened with fdopen().\n\nver 0.8.6 (2003/8/25)\n1) Fix a memory leak when a buffered existed, and a connection was unexpectedly\nclosed, and i wasn't free'ing the buffer apropriatly.\n\nver 0.8.5 (2003/8/17)\n1) Fix a bug where an extra end of line is returned when attempting to play a\nnon existing file.  This causes parsing errors for clients.\n\nver 0.8.4 (2003/8/13)\n1) Fix a bug where garbage is returned with errors in \"list\" command\n\nver 0.8.3 (2003/8/12) \n1) Fix a compilation error on older linux systems\n2) Fix a bug in searching by title\n3) Add \"list\" command\n4) Add config options for specifying libao driver/plugin and options\n5) Add config option to specify which address to bind to\n6) Add support for loading and saving absolute pathnames in saved playlists\n7) Playlist no longer creates duplicate entries for song data (more me\nefficient)\n8) Songs deleted from the db are now removed for the playlist as well\n\nver 0.8.2 (2003/7/22)\n1) Increased the connection que for listen() from 0 to 5\n2) Cleanup configure makefiles so that mpd uses MPD_LIBS and MPD_CFLAGS\nrather than LIBS and CFLAGS\n3) Put a cap on the number of commands per command list\n4) Put a cap on the maximum number of buffered output lines\n5) Get rid of TIME_WAIT/EADDRINUSE socket problem\n6) Use asynchronious IO (i.e. trigger SIGIO instead so we can sleep in\nselect() calls longer)\n\nver 0.8.1 (2003/7/11)\n1) FreeBSD fixes\n2) Fix for rare segfault when updating\n3) Fix bug where client was being hungup on when done playing current song\n4) Fix bug when playing flac's where it incorrectly reports an error\n5) Make stop playlist on error configurable\n6) Configure checks for installed libmad and libid3tag and uses those if found\n7) Use buffer->finished in *_decode's instead of depending on catching signals\n\nver 0.8.0 (2003/7/6)\n1) Flac support\n2) Make playlist max length configurable\n3) New backward compatible status (backward compatible for 0.8.0 on)\n4) listall command now can take a directory as an argument\n5) Buffer rewritten to use shared memory instead of sockets\n6) Playlist adding done using db\n7) Add sort to list, and use binary search for finding\n8) New \"stats\" command\n9) Command list (for faster adding of large batches of files)\n10) Add buffered chunks before play\n11) Useful error reporting to clients (part of status command)\n12) Use libid3tag for reading id3 tags (more stable)\n13) Non-blocking output to clients\n14) Fix bug when removing items from directory\n15) Fix bug when playing mono mp3's\n16) Fix bug when attempting to delete files when using samba\n17) Lots of other bug fixes I can't remember\n\nver 0.7.0 (2003/6/20)\n1) use mad instead of mpg123 for mp3 decoding\n2) volume support\n3) repeate playlist support\n4) use autoconf/automake (i.e. \"configure\")\n5) configurable max connections\n\nver 0.6.2 (2003/6/11)\n1) Buffer support for ogg\n2) new config file options: \"connection_timeout\" and \"mpg123_ignore_junk\"\n3) new commands: \"next\", \"previous\", and \"listall\"\nThanks to Niklas Hofer for \"next\" and \"previous\" patches!\n4) Search by filename\n5) bug fix for pause when playing mp3's\n\nver 0.6.1 (2003/5/29)\n1) Add conf file support\n2) Fix a bug when doing mp3stop (do wait3(NULL,WNOHANG|WUNTRACED,NULL))\n3) Fix a bug when fork'ing, fflush file buffers before forking so the\nchild doesn't print the same stuff in the buffer.\n\nver 0.6.0 (2003/5/25)\n1) Add ogg vorbis support\n2) Fix two bugs relating to tables, one for search by title, and one where we\nfreed the tables before directories, causing a segfault\n3) The info command has been removed.\n\nver 0.5.0-0.5.2\nInitial release(s).  Support for MP3 via mpg123\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 0.91796875,
          "content": "# Music Player Daemon\n\nhttp://www.musicpd.org\n\nA daemon for playing music of various formats.  Music is played through the \nserver's audio device.  The daemon stores info about all available music, \nand this info can be easily searched and retrieved.  Player control, info\nretrieval, and playlist management can all be managed remotely.\n\nFor basic installation instructions\n[read the manual](https://www.musicpd.org/doc/user/install.html).\n\n# Users\n\n- [Manual](http://www.musicpd.org/doc/user/)\n- [Forum](http://forum.musicpd.org/)\n- [IRC](ircs://irc.libera.chat:6697/#mpd)\n- [Bug tracker](https://github.com/MusicPlayerDaemon/MPD/issues/)\n\n# Developers\n\n- [Protocol specification](http://www.musicpd.org/doc/protocol/)\n- [Developer manual](http://www.musicpd.org/doc/developer/)\n\n# Legal\n\nMPD is released under the\n[GNU General Public License version 2](https://www.gnu.org/licenses/gpl-2.0.txt),\nwhich is distributed in the COPYING file.\n"
        },
        {
          "name": "android",
          "type": "tree",
          "content": null
        },
        {
          "name": "build",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "meson.build",
          "type": "blob",
          "size": 16.09375,
          "content": "project(\n  'mpd',\n  ['c', 'cpp'],\n  version: '0.24',\n  meson_version: '>= 1.0',\n  default_options: [\n    'c_std=c11',\n    'build.c_std=c11',\n    'cpp_std=c++20',\n    'build.cpp_std=c++20',\n    'warning_level=3',\n\n    'fmt:cpp_std=c++20',\n\n    # If we build those libraries as Meson subproject, they shall be\n    # linked statically into the MPD executable.\n    'curl:default_library=static',\n    'expat:default_library=static',\n    'flac:default_library=static',\n    'fmt:default_library=static',\n    'gtest:default_library=static',\n    'id3tag:default_library=static',\n    'lame:default_library=static',\n    'libmpdclient:default_library=static',\n    'liburing:default_library=static',\n    'ogg:default_library=static',\n    'openssl:default_library=static',\n    'opus:default_library=static',\n    'sqlite3:default_library=static',\n    'vorbis:default_library=static',\n\n    # Not interested in compiler warnings from subprojects.\n    'curl:werror=false',\n    'curl:warning_level=0',\n    'expat:werror=false',\n    'expat:warning_level=0',\n    'flac:werror=false',\n    'flac:warning_level=0',\n    'fmt:warning_level=0',\n    'gtest:warning_level=0',\n    'id3tag:werror=false',\n    'id3tag:warning_level=0',\n    'lame:werror=false',\n    'lame:warning_level=0',\n    'liburing:warning_level=0',\n    'sqlite3:warning_level=0',\n    'oggiopus:werror=false',\n    'ogg:warning_level=0',\n    'openssl:werror=false',\n    'openssl:warning_level=0',\n    'opus:werror=false',\n    'opus:warning_level=0',\n    'vorbis:warning_level=0',\n\n    # Disable subprojects features we don't need\n    'curl:tool=disabled',\n    'curl:tests=disabled',\n    'curl:unittests=disabled',\n    'curl:brotli=disabled',\n    'curl:cookies=disabled',\n    'curl:progress-meter=disabled',\n    'curl:zstd=disabled',\n    'curl:kerberos-auth=disabled',\n    'curl:negotiate-auth=disabled',\n    'curl:gss-api=disabled',\n    'curl:ntlm=disabled',\n    'curl:ssh=disabled',\n    'curl:dict=disabled',\n    'curl:file=disabled',\n    'curl:ftp=disabled',\n    'curl:gopher=disabled',\n    'curl:imap=disabled',\n    'curl:ldap=disabled',\n    'curl:ldaps=disabled',\n    'curl:mqtt=disabled',\n    'curl:pop3=disabled',\n    'curl:rtmp=disabled',\n    'curl:rtsp=disabled',\n    'curl:smb=disabled',\n    'curl:smtp=disabled',\n    'curl:telnet=disabled',\n    'curl:tftp=disabled',\n    'lame:decoder=false',\n    'lame:tools=disabled',\n    'libmpdclient:documentation=false',\n    'libmpdclient:test=false',\n    'openssl:build_cli=false',\n    'openssl:asm=disabled',\n    'opus:docs=disabled',\n    'opus:extra-programs=disabled',\n    'opus:tests=disabled',\n  ],\n  license: 'GPLv2+',\n)\n\nversion_cxx = vcs_tag(input: 'src/GitVersion.cxx', output: 'GitVersion.cxx')\n\ncompiler = meson.get_compiler('cpp')\nc_compiler = meson.get_compiler('c')\n\nif compiler.get_id() == 'gcc' and compiler.version().version_compare('<10')\n  warning('Your GCC version is too old.  You need at least version 10.')\nelif compiler.get_id() == 'clang' and compiler.version().version_compare('<11')\n  warning('Your clang version is too old.  You need at least version 11.')\nendif\n\nversion_conf = configuration_data()\nversion_conf.set_quoted('PACKAGE', meson.project_name())\nversion_conf.set_quoted('PACKAGE_NAME', meson.project_name())\nversion_conf.set_quoted('VERSION', meson.project_version())\nversion_conf.set_quoted('PROTOCOL_VERSION', '0.24.0')\nconfigure_file(output: 'Version.h', configuration: version_conf)\n\nconf = configuration_data()\nconf.set_quoted('SYSTEM_CONFIG_FILE_LOCATION', join_paths(get_option('prefix'), get_option('sysconfdir'), 'mpd.conf'))\n\ncommon_global_cppflags = [\n  '-D_GNU_SOURCE',\n]\n\ncommon_cppflags = [\n]\n\ntest_global_common_flags = [\n  '-fvisibility=hidden',\n]\n\ntest_common_flags = [\n  '-ffast-math',\n  '-ftree-vectorize',\n\n  '-Wcast-qual',\n  '-Wdouble-promotion',\n  '-Wmissing-declarations',\n  '-Wshadow',\n  '-Wunused',\n  '-Wvla',\n  '-Wwrite-strings',\n\n  # clang specific warning options:\n  '-Wunreachable-code-aggressive',\n  '-Wused-but-marked-unused',\n\n  # suppress bogus GCC12 warnings in libfmt headers\n  '-Wno-stringop-overflow',\n\n  # libfmt causes this warning due to -ffast-math\n  '-Wno-nan-infinity-disabled',\n]\n\ntest_global_cxxflags = test_global_common_flags + [\n]\n\ntest_global_cflags = test_global_common_flags + [\n]\n\ntest_cxxflags = test_common_flags + [\n  '-fno-threadsafe-statics',\n  '-fmerge-all-constants',\n\n  '-Wcomma-subscript',\n  '-Wextra-semi',\n  '-Wmismatched-tags',\n  '-Woverloaded-virtual',\n  '-Wsign-promo',\n  '-Wvolatile',\n  '-Wvirtual-inheritance',\n\n  # a vtable without a dtor is just fine\n  '-Wno-non-virtual-dtor',\n\n  # clang specific warning options:\n  '-Wcomma',\n  '-Wheader-hygiene',\n  '-Winconsistent-missing-destructor-override',\n]\n\nif compiler.get_id() != 'gcc' or compiler.version().version_compare('>=9')\n  # The GCC 8 implementation of this flag is buggy: it complains even\n  # if \"final\" is present, which implies \"override\".\n  test_cxxflags += '-Wsuggest-override'\nendif\n\ntest_cflags = test_common_flags + [\n  '-Wmissing-prototypes',\n  '-Wstrict-prototypes',\n]\n\ntest_ldflags = [\n  # make relocations read-only (hardening)\n  '-Wl,-z,relro',\n\n  # no lazy binding, please - not worth it for a daemon\n  '-Wl,-z,now',\n]\n\nif get_option('buildtype') != 'debug'\n  test_global_cxxflags += [\n    '-ffunction-sections',\n    '-fdata-sections',\n  ]\n  test_global_cflags += [\n    '-ffunction-sections',\n    '-fdata-sections',\n  ]\n  test_ldflags += [\n    '-Wl,--gc-sections',\n  ]\nendif\n\nif get_option('fuzzer')\n  fuzzer_flags = []\n  if get_option('libfuzzer')\n    fuzzer_flags += ['-fsanitize=fuzzer']\n  endif\n  if get_option('b_sanitize') == 'none'\n    fuzzer_flags += ['-fsanitize=address,undefined']\n  endif\n  add_global_arguments(fuzzer_flags, language: 'cpp')\n  add_global_arguments(fuzzer_flags, language: 'c')\n  add_global_link_arguments(fuzzer_flags, language: 'cpp')\nendif\n\nadd_global_arguments(compiler.get_supported_arguments(test_global_cxxflags), language: 'cpp')\nadd_global_arguments(c_compiler.get_supported_arguments(test_global_cflags), language: 'c')\nadd_project_arguments(compiler.get_supported_arguments(test_cxxflags), language: 'cpp')\nadd_project_arguments(c_compiler.get_supported_arguments(test_cflags), language: 'c')\nadd_project_link_arguments(compiler.get_supported_link_arguments(test_ldflags), language: 'cpp')\n\nis_linux = host_machine.system() == 'linux'\nis_android = get_option('android_ndk') != ''\nis_darwin = host_machine.system() == 'darwin'\nis_windows = host_machine.system() == 'windows'\n\nif is_android\n  common_cppflags += '-DANDROID'\nendif\n\nif is_windows\n  common_cppflags += [\n    # enable Windows Vista APIs\n    '-DWINVER=0x0600', '-D_WIN32_WINNT=0x0600',\n\n    # enable Unicode support (TCHAR=wchar_t) in the Windows API (macro\n    # \"UNICODE) and the C library (macro \"_UNICODE\")\n    '-DUNICODE', '-D_UNICODE',\n\n    # enable strict type checking in the Windows API headers\n    '-DSTRICT',\n\n    # reduce header bloat by disabling obscure and obsolete Windows\n    # APIs\n    '-DWIN32_LEAN_AND_MEAN',\n\n    # disable more Windows APIs which are not used by MPD\n    '-DNOGDI', '-DNOBITMAP', '-DNOCOMM',\n    '-DNOUSER',\n\n    # reduce COM header bloat\n    '-DCOM_NO_WINDOWS_H',\n\n    # disable Internet Explorer specific APIs\n    '-D_WIN32_IE=0',\n  ]\n\n  subdir('win32')\nendif\n\nif is_android\n  # With ndk27 libcpp doesn't seem to have a rune table defined for the \n  # localization module, tell it to use the one it ships with\n  common_cppflags += ['-D_LIBCPP_PROVIDES_DEFAULT_RUNE_TABLE']\n\n  subdir('android')\nendif\n\nadd_global_arguments(common_global_cppflags, language: 'c')\nadd_global_arguments(common_global_cppflags, language: 'cpp')\n\nadd_project_arguments(common_cppflags, language: 'c')\nadd_project_arguments(common_cppflags, language: 'cpp')\n\nenable_daemon = not is_windows and not is_android and get_option('daemon')\nconf.set('ENABLE_DAEMON', enable_daemon)\n\nconf.set('HAVE_GETPWNAM_R', compiler.has_function('getpwnam_r'))\nconf.set('HAVE_INITGROUPS', compiler.has_function('initgroups'))\nconf.set('HAVE_FNMATCH', compiler.has_function('fnmatch'))\n\n# Explicitly exclude Windows in this check because\n# https://github.com/mesonbuild/meson/issues/3672 (reported in 2018,\n# still not fixed in 2020) causes Meson to believe it exists, because\n# __builtin_strndup() exists (but strndup() still cannot be used).\nconf.set('HAVE_STRNDUP', not is_windows and compiler.has_function('strndup', prefix: '#define _GNU_SOURCE\\n#include <string.h>'))\n\nconf.set('HAVE_STRCASESTR', compiler.has_function('strcasestr'))\n\nconf.set('HAVE_PRCTL', is_linux)\n\nif not get_option('syslog').disabled()\n  if compiler.has_function('syslog')\n    conf.set('HAVE_SYSLOG', true)\n  elif get_option('syslog').enabled()\n    error('syslog() not found')\n  endif\nendif\n\nenable_database = get_option('database')\nconf.set('ENABLE_DATABASE', enable_database)\n\nenable_inotify = get_option('inotify') and is_linux and enable_database\nconf.set('ENABLE_INOTIFY', enable_inotify)\n\nconf.set('ENABLE_DSD', get_option('dsd'))\n\ninc = include_directories(\n  'src',\n\n  # for the generated config.h\n  '.',\n)\n\nsubdir('src/lib/fmt')\n\nlog = static_library(\n  'log',\n  'src/Log.cxx',\n  'src/LogBackend.cxx',\n  include_directories: inc,\n  dependencies: fmt_dep,\n)\n\nlog_dep = declare_dependency(\n  link_with: log,\n  dependencies: fmt_dep,\n)\n\nsources = [\n  version_cxx,\n  'src/Main.cxx',\n  'src/protocol/ArgParser.cxx',\n  'src/protocol/IdleFlags.cxx',\n  'src/command/CommandError.cxx',\n  'src/command/PositionArg.cxx',\n  'src/command/AllCommands.cxx',\n  'src/command/QueueCommands.cxx',\n  'src/command/TagCommands.cxx',\n  'src/command/PlayerCommands.cxx',\n  'src/command/PlaylistCommands.cxx',\n  'src/command/FileCommands.cxx',\n  'src/command/OutputCommands.cxx',\n  'src/command/MessageCommands.cxx',\n  'src/command/ClientCommands.cxx',\n  'src/command/PartitionCommands.cxx',\n  'src/command/OtherCommands.cxx',\n  'src/command/CommandListBuilder.cxx',\n  'src/config/PartitionConfig.cxx',\n  'src/config/PlayerConfig.cxx',\n  'src/config/ReplayGainConfig.cxx',\n  'src/Idle.cxx',\n  'src/decoder/Thread.cxx',\n  'src/decoder/Control.cxx',\n  'src/decoder/Bridge.cxx',\n  'src/decoder/DecoderPrint.cxx',\n  'src/client/Listener.cxx',\n  'src/client/Client.cxx',\n  'src/client/Config.cxx',\n  'src/client/Domain.cxx',\n  'src/client/Event.cxx',\n  'src/client/Expire.cxx',\n  'src/client/Idle.cxx',\n  'src/client/List.cxx',\n  'src/client/New.cxx',\n  'src/client/Process.cxx',\n  'src/client/Read.cxx',\n  'src/client/Write.cxx',\n  'src/client/Message.cxx',\n  'src/client/Subscribe.cxx',\n  'src/client/File.cxx',\n  'src/client/Response.cxx',\n  'src/client/ThreadBackgroundCommand.cxx',\n  'src/client/ProtocolFeature.cxx',\n  'src/Listen.cxx',\n  'src/LogInit.cxx',\n  'src/ls.cxx',\n  'src/Instance.cxx',\n  'src/MusicBuffer.cxx',\n  'src/MusicPipe.cxx',\n  'src/MusicChunk.cxx',\n  'src/MusicChunkPtr.cxx',\n  'src/Mapper.cxx',\n  'src/Partition.cxx',\n  'src/Permission.cxx',\n  'src/player/CrossFade.cxx',\n  'src/player/Thread.cxx',\n  'src/player/Control.cxx',\n  'src/PlaylistError.cxx',\n  'src/PlaylistPrint.cxx',\n  'src/PlaylistSave.cxx',\n  'src/playlist/Length.cxx',\n  'src/playlist/PlaylistStream.cxx',\n  'src/playlist/PlaylistMapper.cxx',\n  'src/playlist/PlaylistAny.cxx',\n  'src/playlist/PlaylistSong.cxx',\n  'src/playlist/PlaylistQueue.cxx',\n  'src/playlist/Print.cxx',\n  'src/db/PlaylistVector.cxx',\n  'src/queue/Queue.cxx',\n  'src/queue/Print.cxx',\n  'src/queue/Save.cxx',\n  'src/queue/Selection.cxx',\n  'src/queue/Playlist.cxx',\n  'src/queue/PlaylistControl.cxx',\n  'src/queue/PlaylistEdit.cxx',\n  'src/queue/PlaylistTag.cxx',\n  'src/queue/PlaylistState.cxx',\n  'src/LocateUri.cxx',\n  'src/SongUpdate.cxx',\n  'src/SongLoader.cxx',\n  'src/SongPrint.cxx',\n  'src/SongSave.cxx',\n  'src/StateFile.cxx',\n  'src/StateFileConfig.cxx',\n  'src/Stats.cxx',\n  'src/TagPrint.cxx',\n  'src/TagSave.cxx',\n  'src/TagFile.cxx',\n  'src/TagStream.cxx',\n  'src/TagAny.cxx',\n  'src/TimePrint.cxx',\n  'src/mixer/Memento.cxx',\n  'src/PlaylistFile.cxx',\n]\n\nif is_windows\n  sources += [\n    'src/win32/Win32Main.cxx',\n  ]\nendif\n\nif not is_android\n  sources += [\n    'src/CommandLine.cxx',\n    'src/unix/SignalHandlers.cxx',\n  ]\nelse\n  sources += [\n    'src/android/Context.cxx',\n    'src/android/AudioManager.cxx',\n    'src/android/Environment.cxx',\n    'src/android/LogListener.cxx',\n  ]\nendif\n\nif enable_daemon\n  sources += 'src/unix/Daemon.cxx'\nendif\n\nif enable_database\n  sources += [\n    'src/storage/StorageState.cxx',\n    'src/queue/PlaylistUpdate.cxx',\n    'src/command/StorageCommands.cxx',\n    'src/command/DatabaseCommands.cxx',\n  ]\nendif\n\nsubdir('src/util')\nsubdir('src/cmdline')\nsubdir('src/time')\nsubdir('src/lib/icu')\nsubdir('src/fs')\nsubdir('src/io')\nsubdir('src/io/uring')\nsubdir('src/system')\nsubdir('src/thread')\nsubdir('src/net')\nsubdir('src/event')\nsubdir('src/win32')\n\nsubdir('src/fs/glue')\n\nsubdir('src/config')\nsubdir('src/pcm')\n\nsubdir('src/lib/dbus')\nsubdir('src/lib/smbclient')\nsubdir('src/lib/zlib')\n\nsubdir('src/lib/alsa')\nsubdir('src/lib/chromaprint')\nsubdir('src/lib/curl')\nsubdir('src/lib/expat')\nsubdir('src/lib/ffmpeg')\nsubdir('src/lib/gcrypt')\nsubdir('src/lib/nfs')\nsubdir('src/lib/oss')\nsubdir('src/lib/pcre')\nsubdir('src/lib/pipewire')\nsubdir('src/lib/pulse')\nsubdir('src/lib/sndio')\nsubdir('src/lib/sqlite')\nsubdir('src/lib/systemd')\nsubdir('src/lib/upnp')\nsubdir('src/lib/yajl')\n\nsubdir('src/lib/crypto')\n\nsubdir('src/zeroconf')\n\nsubdir('src/tag')\nsubdir('src/neighbor')\nsubdir('src/input')\nsubdir('src/archive')\nsubdir('src/filter')\nsubdir('src/mixer')\nsubdir('src/output')\nsubdir('src/lib/xiph')\nsubdir('src/decoder')\nsubdir('src/encoder')\nsubdir('src/song')\nsubdir('src/playlist')\n\nif curl_dep.found()\n  sources += 'src/RemoteTagCache.cxx'\nendif\n\nif sqlite_dep.found()\n  sources += [\n    'src/command/StickerCommands.cxx',\n    'src/sticker/Database.cxx',\n    'src/sticker/Print.cxx',\n    'src/sticker/SongSticker.cxx',\n    'src/sticker/TagSticker.cxx',\n    'src/sticker/AllowedTags.cxx',\n    'src/sticker/CleanupService.cxx',\n  ]\nendif\n\nif chromaprint_dep.found()\n  sources += [\n    'src/command/FingerprintCommands.cxx',\n    'src/lib/chromaprint/DecoderClient.cxx',\n  ]\nendif\n\nbasic = static_library(\n  'basic',\n  'src/ReplayGainMode.cxx',\n  'src/SingleMode.cxx',\n  'src/ConsumeMode.cxx',\n  include_directories: inc,\n)\n\nbasic_dep = declare_dependency(\n  link_with: basic,\n)\n\nif enable_database\n  subdir('src/storage')\nelse\n  storage_glue_dep = dependency('', required: false)\nendif\nsubdir('src/db')\n\nif neighbor_glue_dep.found()\n  sources += 'src/command/NeighborCommands.cxx'\nendif\n\nif archive_glue_dep.found()\n  sources += [\n    'src/TagArchive.cxx',\n  ]\n\n  if enable_database\n    sources += ['src/db/update/Archive.cxx']\n  endif\nendif\n\nif is_windows\n  sources += windows_resources\nendif\n\nlink_args = []\nmore_deps = []\nif is_android\n  subdir('src/java')\n  target_type = 'shared_library'\n  target_name = 'mpd'\n  link_args += [\n    '-Wl,--no-undefined,-shared,-Bsymbolic',\n    '-llog',\n    '-lz',\n  ]\n  more_deps += [\n    declare_dependency(sources: [bridge_header]),\n    java_dep,\n  ]\n\n  android_abi = get_option('android_abi')\n  install_dir = meson.current_source_dir() / 'android/app/src/main/jnilibs' / android_abi\nelse\n  target_type = 'executable'\n  target_name = 'mpd'\n  install_dir = get_option('bindir')\nendif\n\nmpd = build_target(\n  target_name,\n  sources,\n  target_type: target_type,\n  include_directories: inc,\n  dependencies: [\n    cmdline_dep,\n    basic_dep,\n    config_dep,\n    dbus_dep,\n    fs_dep,\n    net_dep,\n    util_dep,\n    event_dep,\n    thread_dep,\n    neighbor_glue_dep,\n    input_glue_dep,\n    archive_glue_dep,\n    output_glue_dep,\n    mixer_glue_dep,\n    decoder_glue_dep,\n    encoder_glue_dep,\n    playlist_glue_dep,\n    db_glue_dep,\n    storage_glue_dep,\n    song_dep,\n    systemd_dep,\n    sqlite_dep,\n    zeroconf_dep,\n    more_deps,\n    chromaprint_dep,\n    fmt_dep,\n  ],\n  link_args: link_args,\n  build_by_default: not get_option('fuzzer'),\n  install : true,\n  install_dir: install_dir\n)\n\nconfigure_file(output: 'config.h', configuration: conf)\n\nif systemd_dep.found()\n  subdir('systemd')\nendif\n\nif not is_android\n  install_data(\n    'mpd.svg',\n    install_dir: join_paths(get_option('datadir'), 'icons', 'hicolor', 'scalable', 'apps'),\n  )\n\n  install_data(\n    'AUTHORS', 'COPYING', 'NEWS', 'README.md',\n    install_dir: join_paths(get_option('datadir'), 'doc', meson.project_name()),\n  )\nendif\n\nsubdir('doc')\n\nif get_option('test')\n  subdir('test')\nendif\n\nif get_option('fuzzer')\n  subdir('test/fuzzer')\nendif\n"
        },
        {
          "name": "meson_options.txt",
          "type": "blob",
          "size": 8.7705078125,
          "content": "option('documentation', type: 'feature', description: 'Build documentation')\noption('html_manual', type: 'boolean', value: true, description: 'Build the HTML manual')\noption('manpages', type: 'boolean', value: true, description: 'Build manual pages')\noption('doxygen', type: 'boolean', value: false, description: 'Build doxygen source documentation')\n\noption('syslog', type: 'feature', description: 'syslog support')\noption('inotify', type: 'boolean', value: true, description: 'inotify support (for automatic database update)')\noption('io_uring', type: 'feature', description: 'Linux io_uring support using liburing')\n\noption('daemon', type: 'boolean', value: true, description: 'enable daemonization')\noption('systemd', type: 'feature', description: 'systemd support')\n\noption('systemd_system_unit_dir', type: 'string', description: 'systemd system service directory')\noption('systemd_user_unit_dir', type: 'string', description: 'systemd user service directory')\n\n#\n# Options for developers\n#\n\noption('test', type: 'boolean', value: false, description: 'Build the unit tests and debug programs')\noption('fuzzer', type: 'boolean', value: false, description: 'Build fuzzers')\noption('libfuzzer', type: 'boolean', value: true, description: 'Enable libFuzzer support for the fuzzers')\n\n#\n# Android\n#\n\noption('android_sdk', type: 'string', description: 'The path where Android SDK is installed')\noption('android_ndk', type: 'string', description: 'The path where Android NDK is installed')\noption('android_abi', type: 'string', value: 'armeabi-v7a', description: 'The Android ABI to be built')\n\noption('android_strip', type: 'string', value: 'strip', description: 'The \"strip\" tool from the NDK')\n\noption('android_debug_keystore', type: 'string', description: 'The keystore file used to sign debug APK files')\n\noption('android_keystore', type: 'string', description: 'The keystore file used to sign APK files')\noption('android_keyalias', type: 'string', description: 'The key alias used to sign APK files')\noption('android_keypass', type: 'string', description: 'The password of the keystore used to sign APK files')\n\n#\n# System call support\n#\n\noption('epoll', type: 'boolean', value: true, description: 'Use epoll on Linux')\noption('eventfd', type: 'boolean', value: true, description: 'Use eventfd() on Linux')\noption('signalfd', type: 'boolean', value: true, description: 'Use signalfd() on Linux')\n\n#\n# Network support\n#\n\noption('tcp', type: 'boolean', value: true, description: 'Support for clients connecting via TCP')\noption('ipv6', type: 'feature', description: 'Support for IPv6')\noption('local_socket', type: 'boolean', value: true, description: 'Support for clients connecting via local sockets')\n\n#\n# Audio formats\n#\n\noption('dsd', type: 'boolean', value: true, description: 'Support the DSD audio format')\n\n#\n# Database plugins\n#\n\noption('database', type: 'boolean', value: true, description: 'enable support for the music database')\noption('upnp', type: 'combo',\n       choices: ['auto', 'pupnp', 'npupnp', 'disabled'],\n       value: 'auto',\n       description: 'UPnP client support')\noption('libmpdclient', type: 'feature', description: 'libmpdclient support (for the proxy database plugin)')\n\n#\n# Neighbor plugins\n#\n\noption('neighbor', type: 'boolean', value: true, description: 'enable support for neighbor discovery')\n\n#\n# Storage plugins\n#\n\noption('udisks', type: 'feature', description: 'Support for removable media using udisks2')\noption('webdav', type: 'feature', description: 'WebDAV support using CURL and Expat')\n\n#\n# Playlist plugins\n#\n\noption('cue', type: 'boolean', value: true, description: 'CUE sheet support')\n\n#\n# Input plugins\n#\n\noption('cdio_paranoia', type: 'feature', description: 'libcdio_paranoia input plugin')\noption('curl', type: 'feature', description: 'HTTP client using CURL')\noption('mms', type: 'feature', description: 'MMS protocol support using libmms')\noption('nfs', type: 'feature', description: 'NFS protocol support using libnfs')\n\n# The \"smbclient\" plugin is disabled by default because libsmbclient\n# has a serious bug which crashes MPD very quickly:\n# https://bugzilla.samba.org/show_bug.cgi?id=11413\noption('smbclient', type: 'feature', value: 'disabled', description: 'SMB support using libsmbclient')\n\n#\n# Commercial services\n#\n\noption('qobuz', type: 'feature', description: 'Qobuz client')\noption('soundcloud', type: 'feature', description: 'SoundCloud client')\n\n#\n# Archive plugins\n#\n\noption('bzip2', type: 'feature', description: 'bzip2 support using libbz2')\noption('iso9660', type: 'feature', description: 'ISO9660 support using libiso9660')\noption('zzip', type: 'feature', description: 'ZIP support using zziplib')\n\n#\n# Tag plugins\n#\n\noption('id3tag', type: 'feature', description: 'ID3 support using libid3tag')\noption('chromaprint', type: 'feature', description: 'ChromaPrint / AcoustID support')\n\n#\n# Decoder plugins\n#\n\noption('adplug', type: 'feature', description: 'AdPlug decoder plugin')\noption('audiofile', type: 'feature', description: 'libaudiofile decoder plugin')\noption('faad', type: 'feature', description: 'AAC decoder using libfaad')\noption('ffmpeg', type: 'feature', description: 'FFmpeg codec support')\noption('flac', type: 'feature', description: 'FLAC decoder plugin')\noption('fluidsynth', type: 'feature', description: 'fluidsynth MIDI decoder plugin')\noption('gme', type: 'feature', description: 'Game Music Emulator decoder plugin')\noption('mad', type: 'feature', description: 'MP3 decoder using libmad')\noption('mikmod', type: 'feature', description: 'MikMod decoder plugin')\noption('modplug', type: 'feature', description: 'Modplug decoder plugin')\noption('openmpt', type: 'feature', description: 'OpenMPT decoder plugin')\noption('mpcdec', type: 'feature', description: 'Musepack decoder plugin')\noption('mpg123', type: 'feature', description: 'MP3 decoder using libmpg123')\noption('opus', type: 'feature', description: 'Opus decoder plugin')\noption('sidplay', type: 'feature', description: 'C64 SID support via libsidplayfp or libsidplay2')\noption('sndfile', type: 'feature', description: 'libsndfile decoder plugin')\noption('tremor', type: 'feature', description: 'Fixed-point vorbis decoder plugin')\noption('vorbis', type: 'feature', description: 'Vorbis decoder plugin')\noption('wavpack', type: 'feature', description: 'WavPack decoder plugin')\noption('wildmidi', type: 'feature', description: 'WildMidi decoder plugin')\n\n#\n# Encoder plugins\n#\n\noption('vorbisenc', type: 'feature', description: 'Vorbis encoder plugin')\noption('lame', type: 'feature', description: 'LAME MP3 encoder plugin')\noption('twolame', type: 'feature', description: 'TwoLAME MP2 encoder plugin')\noption('shine', type: 'feature', description: 'shine MP3 encoder plugin')\noption('wave_encoder', type: 'boolean', value: true, description: 'PCM wave encoder encoder plugin')\n\n#\n# Filter plugins\n#\n\noption('libsamplerate', type: 'feature', description: 'libsamplerate resampler')\noption('soxr', type: 'feature', description: 'libsoxr resampler')\n\n#\n# Output plugins\n#\n\noption('alsa', type: 'feature', description: 'ALSA support')\noption('ao', type: 'feature', description: 'libao output plugin')\noption('fifo', type: 'boolean', value: true, description: 'FIFO output plugin')\noption('httpd', type: 'boolean', value: true, description: 'HTTP streaming output plugin')\noption('jack', type: 'feature', description: 'JACK output plugin')\noption('openal', type: 'feature', description: 'OpenAL output plugin')\noption('oss', type: 'feature', description: 'Open Sound System support')\noption('pipe', type: 'boolean', value: true, description: 'Pipe output plugin')\noption('pipewire', type: 'feature', description: 'PipeWire support')\noption('pulse', type: 'feature', description: 'PulseAudio support')\noption('recorder', type: 'boolean', value: true, description: 'Recorder output plugin')\noption('shout', type: 'feature', description: 'Shoutcast streaming support using libshout')\noption('snapcast', type: 'boolean', value: true, description: 'Snapcast output plugin')\noption('sndio', type: 'feature', description: 'sndio output plugin')\noption('solaris_output', type: 'feature', description: 'Solaris /dev/audio support')\n\n#\n# Misc libraries\n#\n\noption('dbus', type: 'feature', description: 'D-Bus support')\noption('expat', type: 'feature', description: 'Expat XML support')\noption('icu', type: 'feature', description: 'Use libicu for Unicode')\noption('iconv', type: 'feature', description: 'Use iconv() for character set conversion')\noption('pcre', type: 'feature', description: 'Enable regular expression support (using libpcre)')\noption('sqlite', type: 'feature', description: 'SQLite database support (for stickers)')\noption('yajl', type: 'feature', description: 'libyajl for YAML support')\noption('zlib', type: 'feature', description: 'zlib support (for database compression)')\n\noption('zeroconf', type: 'combo',\n       choices: ['auto', 'avahi', 'disabled'],\n       value: 'auto',\n       description: 'Zeroconf support')\n"
        },
        {
          "name": "mpd.svg",
          "type": "blob",
          "size": 27.412109375,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?>\n<!-- Created with Sodipodi (\"http://www.sodipodi.com/\") -->\n\n<svg\n   xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\n   xmlns:cc=\"http://creativecommons.org/ns#\"\n   xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n   xmlns:svg=\"http://www.w3.org/2000/svg\"\n   xmlns=\"http://www.w3.org/2000/svg\"\n   xmlns:xlink=\"http://www.w3.org/1999/xlink\"\n   xmlns:sodipodi=\"http://sodipodi.sourceforge.net/DTD/sodipodi-0.dtd\"\n   xmlns:inkscape=\"http://www.inkscape.org/namespaces/inkscape\"\n   version=\"1.0\"\n   x=\"0\"\n   y=\"0\"\n   width=\"128\"\n   height=\"128\"\n   id=\"svg1\"\n   sodipodi:version=\"0.32\"\n   sodipodi:docname=\"mpd.svg\"\n   inkscape:version=\"0.47pre4 r22446\"\n   inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-test5.png\"\n   inkscape:export-xdpi=\"76.799988\"\n   inkscape:export-ydpi=\"76.799988\">\n  <sodipodi:namedview\n     id=\"base\"\n     inkscape:zoom=\"2.6884788\"\n     inkscape:cx=\"71.610485\"\n     inkscape:cy=\"61.484977\"\n     inkscape:window-width=\"1680\"\n     inkscape:window-height=\"994\"\n     inkscape:window-x=\"0\"\n     inkscape:window-y=\"0\"\n     showguides=\"true\"\n     inkscape:guide-bbox=\"true\"\n     showgrid=\"false\"\n     inkscape:window-maximized=\"1\"\n     inkscape:current-layer=\"svg1\" />\n  <defs\n     id=\"defs3\">\n    <inkscape:perspective\n       sodipodi:type=\"inkscape:persp3d\"\n       inkscape:vp_x=\"0 : 80 : 1\"\n       inkscape:vp_y=\"0 : 1000 : 0\"\n       inkscape:vp_z=\"160 : 80 : 1\"\n       inkscape:persp3d-origin=\"80 : 53.333333 : 1\"\n       id=\"perspective118\" />\n    <linearGradient\n       id=\"linearGradient919\">\n      <stop\n         style=\"stop-color:#000000;stop-opacity:0.86092716;\"\n         offset=\"0.0000000\"\n         id=\"stop920\" />\n      <stop\n         style=\"stop-color:#ffffff;stop-opacity:0.0000000;\"\n         offset=\"1.0000000\"\n         id=\"stop921\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient1068\">\n      <stop\n         offset=\"0.0000000\"\n         style=\"stop-color:#d2d2d2;stop-opacity:1.0000000;\"\n         id=\"stop1070\" />\n      <stop\n         offset=\"1.0000000\"\n         style=\"stop-color:#ffffff;stop-opacity:1.0000000;\"\n         id=\"stop1069\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient1065\">\n      <stop\n         offset=\"0.0000000\"\n         style=\"stop-color:#ffffff;stop-opacity:1.0000000;\"\n         id=\"stop1067\" />\n      <stop\n         offset=\"1.0000000\"\n         style=\"stop-color:#c2bfbf;stop-opacity:0.99607843;\"\n         id=\"stop1066\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient1060\">\n      <stop\n         offset=\"0.0000000\"\n         style=\"stop-color:#878787;stop-opacity:1.0000000;\"\n         id=\"stop1063\" />\n      <stop\n         offset=\"1.0000000\"\n         style=\"stop-color:#000000;stop-opacity:0.99607843;\"\n         id=\"stop1061\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient645\">\n      <stop\n         style=\"stop-color:#aca597;stop-opacity:1.0000000;\"\n         offset=\"0.0000000\"\n         id=\"stop646\" />\n      <stop\n         style=\"stop-color:#ffffff;stop-opacity:1.0000000;\"\n         offset=\"1.0000000\"\n         id=\"stop647\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient593\">\n      <stop\n         style=\"stop-color:#478acf;stop-opacity:1.0000000;\"\n         offset=\"0.0000000\"\n         id=\"stop594\" />\n      <stop\n         style=\"stop-color:#65c6f7;stop-opacity:1.0000000;\"\n         offset=\"1.0000000\"\n         id=\"stop595\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient574\">\n      <stop\n         style=\"stop-color:#85ad92;stop-opacity:1.0000;\"\n         offset=\"0\"\n         id=\"stop575\" />\n      <stop\n         style=\"stop-color:#559db2;stop-opacity:0.7725;\"\n         offset=\"1\"\n         id=\"stop576\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient570\">\n      <stop\n         style=\"stop-color:#999999;stop-opacity:0.7176;\"\n         offset=\"0\"\n         id=\"stop571\" />\n      <stop\n         style=\"stop-color:#ffffff;stop-opacity:0.3725;\"\n         offset=\"1\"\n         id=\"stop572\" />\n    </linearGradient>\n    <linearGradient\n       id=\"linearGradient573\"\n       xlink:href=\"#linearGradient1068\"\n       x1=\"40.458553\"\n       y1=\"389.65582\"\n       x2=\"36.063946\"\n       y2=\"357.28375\"\n       gradientTransform=\"matrix(2.3025192,0,0,0.29683004,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n    <linearGradient\n       id=\"linearGradient1213\"\n       xlink:href=\"#linearGradient1068\"\n       x1=\"123.71407\"\n       y1=\"141.41566\"\n       x2=\"98.353867\"\n       y2=\"113.41083\"\n       gradientTransform=\"matrix(0.91680324,0,0,0.74547827,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n    <radialGradient\n       id=\"radialGradient581\"\n       xlink:href=\"#linearGradient919\"\n       cx=\"0.095785439\"\n       cy=\"0.16814159\"\n       r=\"1.5409589\"\n       fx=\"0.095785439\"\n       fy=\"0.16814159\" />\n    <linearGradient\n       id=\"linearGradient580\"\n       xlink:href=\"#linearGradient1068\"\n       x1=\"132.0352\"\n       y1=\"135.68469\"\n       x2=\"119.62381\"\n       y2=\"111.07157\"\n       gradientTransform=\"matrix(0.90170536,0,0,0.75796032,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n    <linearGradient\n       xlink:href=\"#linearGradient1060\"\n       id=\"linearGradient901\"\n       x1=\"0.93491787\"\n       y1=\"0.92044502\"\n       x2=\"-0.052546836\"\n       y2=\"0.20347559\" />\n    <linearGradient\n       xlink:href=\"#linearGradient593\"\n       id=\"linearGradient902\" />\n    <linearGradient\n       xlink:href=\"#linearGradient1068\"\n       id=\"linearGradient916\"\n       x1=\"0.14831461\"\n       y1=\"-1.6875\"\n       x2=\"0.43370786\"\n       y2=\"1.8125\" />\n    <defs\n       id=\"defs890\">\n      <linearGradient\n         id=\"linearGradient922\"\n         x1=\"0\"\n         y1=\"0.5\"\n         x2=\"1\"\n         y2=\"0.5\"\n         gradientUnits=\"objectBoundingBox\"\n         spreadMethod=\"pad\"\n         xlink:href=\"#linearGradient1065\" />\n      <linearGradient\n         id=\"linearGradient908\"\n         x1=\"0\"\n         y1=\"0.5\"\n         x2=\"1\"\n         y2=\"0.5\"\n         gradientUnits=\"objectBoundingBox\"\n         spreadMethod=\"pad\"\n         xlink:href=\"#linearGradient1060\" />\n      <linearGradient\n         id=\"linearGradient894\"\n         x1=\"0\"\n         y1=\"0.5\"\n         x2=\"1\"\n         y2=\"0.5\"\n         gradientUnits=\"objectBoundingBox\"\n         spreadMethod=\"pad\"\n         xlink:href=\"#linearGradient1068\" />\n      <linearGradient\n         xlink:href=\"#linearGradient894\"\n         id=\"linearGradient897\"\n         x1=\"0.5955056\"\n         y1=\"-0.33587787\"\n         x2=\"0.61348313\"\n         y2=\"1.1908396\" />\n      <linearGradient\n         xlink:href=\"#linearGradient894\"\n         id=\"linearGradient898\"\n         x1=\"0.96449792\"\n         y1=\"1.0278323\"\n         x2=\"0.46738392\"\n         y2=\"0.21800731\" />\n      <linearGradient\n         xlink:href=\"#linearGradient908\"\n         id=\"linearGradient907\"\n         x1=\"0.57078654\"\n         y1=\"2.3770492\"\n         x2=\"0.33258426\"\n         y2=\"0.49180329\" />\n      <linearGradient\n         xlink:href=\"#linearGradient922\"\n         id=\"linearGradient921\"\n         x1=\"0.47058824\"\n         y1=\"0.15384616\"\n         x2=\"0.46547315\"\n         y2=\"0.98380566\" />\n      <linearGradient\n         xlink:href=\"#linearGradient922\"\n         id=\"linearGradient948\" />\n      <defs\n         id=\"defs987\">\n        <linearGradient\n           id=\"linearGradient855\"\n           x1=\"0\"\n           y1=\"0.5\"\n           x2=\"1\"\n           y2=\"0.5\"\n           gradientUnits=\"objectBoundingBox\"\n           spreadMethod=\"pad\"\n           xlink:href=\"#linearGradient908\" />\n        <linearGradient\n           id=\"linearGradient1188\"\n           x1=\"0\"\n           y1=\"0.5\"\n           x2=\"1\"\n           y2=\"0.5\"\n           gradientUnits=\"objectBoundingBox\"\n           spreadMethod=\"pad\"\n           xlink:href=\"#linearGradient922\" />\n        <linearGradient\n           id=\"linearGradient831\">\n          <stop\n             style=\"stop-color:#94897f;stop-opacity:1.0000000;\"\n             offset=\"0.0000000\"\n             id=\"stop832\" />\n          <stop\n             style=\"stop-color:#fff5fe;stop-opacity:1.0000000;\"\n             offset=\"1.0000000\"\n             id=\"stop833\" />\n        </linearGradient>\n        <linearGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"linearGradient834\"\n           x1=\"0.87550199\"\n           y1=\"0.34817815\"\n           x2=\"-0.29317269\"\n           y2=\"0.93522269\"\n           gradientUnits=\"objectBoundingBox\"\n           spreadMethod=\"pad\" />\n        <radialGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"radialGradient835\"\n           r=\"0.55628061\"\n           fy=\"0.28125\"\n           fx=\"0.59090906\"\n           cy=\"0.28125\"\n           cx=\"0.59090906\"\n           spreadMethod=\"pad\" />\n        <linearGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"linearGradient893\"\n           x1=\"0.12793733\"\n           y1=\"0.76923078\"\n           x2=\"0.49608356\"\n           y2=\"0.70850199\" />\n        <linearGradient\n           xlink:href=\"#linearGradient855\"\n           id=\"linearGradient625\"\n           x1=\"0.035955057\"\n           y1=\"1.0276498\"\n           x2=\"0.053932585\"\n           y2=\"-0.359447\" />\n        <linearGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"linearGradient627\"\n           x1=\"1.2826855\"\n           y1=\"0.12550607\"\n           x2=\"-0.15547703\"\n           y2=\"0.96356273\" />\n        <radialGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"radialGradient628\"\n           r=\"1.5982224\"\n           fy=\"0.4866707\"\n           fx=\"0.36789617\"\n           cy=\"0.4866707\"\n           cx=\"0.36789617\"\n           gradientTransform=\"scale(0.877379,1.139758)\" />\n        <linearGradient\n           xlink:href=\"#linearGradient1188\"\n           id=\"linearGradient628\"\n           x1=\"0.76923078\"\n           y1=\"0.14979757\"\n           x2=\"0.41909814\"\n           y2=\"0.73279351\" />\n      </defs>\n      <sodipodi:namedview\n         id=\"namedview898\"\n         pagecolor=\"#ffffff\"\n         bordercolor=\"#666666\"\n         borderopacity=\"1.0\"\n         inkscape:pageopacity=\"0.0\"\n         inkscape:pageshadow=\"2\"\n         inkscape:zoom=\"3.4732669\"\n         inkscape:cx=\"50.051177\"\n         inkscape:cy=\"18.096983\"\n         inkscape:window-width=\"1022\"\n         inkscape:window-height=\"670\"\n         showguides=\"false\"\n         snaptoguides=\"false\"\n         showgrid=\"false\"\n         snaptogrid=\"false\"\n         inkscape:window-x=\"0\"\n         inkscape:window-y=\"25\">\n        <sodipodi:guide\n           orientation=\"vertical\"\n           position=\"28.705556\"\n           id=\"guide879\" />\n        <sodipodi:guide\n           orientation=\"horizontal\"\n           position=\"30.130655\"\n           id=\"guide880\" />\n      </sodipodi:namedview>\n    </defs>\n    <sodipodi:namedview\n       id=\"namedview1003\"\n       pagecolor=\"#ffffff\"\n       bordercolor=\"#666666\"\n       borderopacity=\"1.0\"\n       inkscape:pageopacity=\"0.0\"\n       inkscape:pageshadow=\"2\"\n       inkscape:zoom=\"1.3368738\"\n       inkscape:cx=\"24.541029\"\n       inkscape:cy=\"14.368596\"\n       inkscape:window-width=\"640\"\n       inkscape:window-height=\"499\"\n       showguides=\"true\"\n       snaptoguides=\"true\"\n       inkscape:window-x=\"138\"\n       inkscape:window-y=\"169\" />\n    <linearGradient\n       xlink:href=\"#linearGradient1060\"\n       id=\"linearGradient1304\"\n       x1=\"-0.20218579\"\n       y1=\"0.21681416\"\n       x2=\"0.67759562\"\n       y2=\"0.57522124\" />\n    <linearGradient\n       xlink:href=\"#linearGradient1065\"\n       id=\"linearGradient1322\"\n       x1=\"0.32404181\"\n       y1=\"0.77876109\"\n       x2=\"0.24041812\"\n       y2=\"0.26548672\" />\n    <defs\n       id=\"defs989\">\n      <linearGradient\n         id=\"linearGradient850\">\n        <stop\n           style=\"stop-color:#eed680;stop-opacity:1.0000000;\"\n           offset=\"0.0000000\"\n           id=\"stop852\" />\n        <stop\n           style=\"stop-color:#dfb546;stop-opacity:1.0000000;\"\n           offset=\"0.68035328\"\n           id=\"stop858\" />\n        <stop\n           style=\"stop-color:#d8a429;stop-opacity:1.0000000;\"\n           offset=\"0.77277374\"\n           id=\"stop859\" />\n        <stop\n           style=\"stop-color:#d1940c;stop-opacity:1.0000000;\"\n           offset=\"1.0000000\"\n           id=\"stop857\" />\n      </linearGradient>\n      <linearGradient\n         xlink:href=\"#linearGradient850\"\n         id=\"linearGradient569\"\n         x1=\"0.11875\"\n         y1=\"0.12612613\"\n         x2=\"0.59375\"\n         y2=\"0.66066068\"\n         spreadMethod=\"pad\" />\n      <linearGradient\n         id=\"linearGradient839\">\n        <stop\n           style=\"stop-color:#46a046;stop-opacity:1.0000000;\"\n           offset=\"0.0000000\"\n           id=\"stop840\" />\n        <stop\n           style=\"stop-color:#df421e;stop-opacity:1.0000000;\"\n           offset=\"0.39364964\"\n           id=\"stop841\" />\n        <stop\n           style=\"stop-color:#ada7c8;stop-opacity:1.0000000;\"\n           offset=\"0.72036445\"\n           id=\"stop842\" />\n        <stop\n           style=\"stop-color:#eed680;stop-opacity:1.0000000;\"\n           offset=\"1.0000000\"\n           id=\"stop843\" />\n      </linearGradient>\n      <linearGradient\n         xlink:href=\"#linearGradient839\"\n         id=\"linearGradient836\"\n         x1=\"1.3267924e-17\"\n         y1=\"0.5\"\n         x2=\"1\"\n         y2=\"0.5\" />\n      <defs\n         id=\"defs604\">\n        <linearGradient\n           id=\"linearGradient622\">\n          <stop\n             style=\"stop-color:#f8e29d;stop-opacity:0.4471;\"\n             offset=\"0\"\n             id=\"stop623\" />\n          <stop\n             style=\"stop-color:#272d2d;stop-opacity:0.4784;\"\n             offset=\"1\"\n             id=\"stop624\" />\n        </linearGradient>\n        <linearGradient\n           id=\"linearGradient617\">\n          <stop\n             style=\"stop-color:#ffffff;stop-opacity:1;\"\n             offset=\"0\"\n             id=\"stop618\" />\n          <stop\n             style=\"stop-color:#000000;stop-opacity:1;\"\n             offset=\"1\"\n             id=\"stop619\" />\n        </linearGradient>\n        <linearGradient\n           id=\"linearGradient613\">\n          <stop\n             style=\"stop-color:#ffffff;stop-opacity:0.6235;\"\n             offset=\"0\"\n             id=\"stop614\" />\n          <stop\n             style=\"stop-color:#5d6567;stop-opacity:1;\"\n             offset=\"1\"\n             id=\"stop615\" />\n        </linearGradient>\n        <linearGradient\n           id=\"linearGradient607\">\n          <stop\n             style=\"stop-color:#d7d5d5;stop-opacity:1;\"\n             offset=\"0\"\n             id=\"stop608\" />\n          <stop\n             style=\"stop-color:#000000;stop-opacity:0.4039;\"\n             offset=\"1\"\n             id=\"stop609\" />\n        </linearGradient>\n        <radialGradient\n           xlink:href=\"#linearGradient607\"\n           id=\"radialGradient610\"\n           cx=\"1.4287461\"\n           cy=\"0.75323397\"\n           r=\"0.85534656\"\n           fx=\"1.4287461\"\n           fy=\"0.75323397\"\n           gradientTransform=\"matrix(1,2.268336e-6,-1.975559e-5,1,5.713033e-8,3.856326e-8)\" />\n        <linearGradient\n           xlink:href=\"#linearGradient617\"\n           id=\"linearGradient612\"\n           x1=\"7.7024956\"\n           y1=\"-2.0263922\"\n           x2=\"62.759903\"\n           y2=\"56.137772\"\n           gradientTransform=\"scale(0.9953779,1.0046436)\"\n           gradientUnits=\"userSpaceOnUse\" />\n        <radialGradient\n           xlink:href=\"#linearGradient613\"\n           id=\"radialGradient616\"\n           cx=\"58.70882\"\n           cy=\"53.831562\"\n           r=\"43.551846\"\n           fx=\"58.70882\"\n           fy=\"53.831562\"\n           gradientTransform=\"scale(0.99517298,1.0048504)\"\n           gradientUnits=\"userSpaceOnUse\" />\n        <linearGradient\n           xlink:href=\"#linearGradient617\"\n           id=\"linearGradient621\" />\n        <linearGradient\n           xlink:href=\"#linearGradient617\"\n           id=\"linearGradient626\"\n           x1=\"72.060211\"\n           y1=\"55.161442\"\n           x2=\"32.409\"\n           y2=\"12.126946\"\n           gradientTransform=\"matrix(0.995134,-1.068631e-5,-1.31398e-7,1.00489,0,0)\"\n           gradientUnits=\"userSpaceOnUse\" />\n        <linearGradient\n           xlink:href=\"#linearGradient607\"\n           id=\"linearGradient687\"\n           x1=\"67.707405\"\n           y1=\"49.314793\"\n           x2=\"-10.031048\"\n           y2=\"4.6068792\"\n           gradientTransform=\"scale(0.99522839,1.0047945)\"\n           gradientUnits=\"userSpaceOnUse\" />\n        <linearGradient\n           xlink:href=\"#linearGradient617\"\n           id=\"linearGradient742\"\n           x1=\"-7.4378386\"\n           y1=\"25.923714\"\n           x2=\"18.009745\"\n           y2=\"10.089797\"\n           gradientTransform=\"scale(0.889853,1.123781)\" />\n      </defs>\n      <sodipodi:namedview\n         id=\"namedview889\"\n         showguides=\"true\"\n         snaptoguides=\"true\"\n         inkscape:zoom=\"7.5625000\"\n         inkscape:cx=\"24.000000\"\n         inkscape:cy=\"24.000000\"\n         inkscape:window-width=\"640\"\n         inkscape:window-height=\"496\"\n         inkscape:window-x=\"0\"\n         inkscape:window-y=\"26\" />\n    </defs>\n    <sodipodi:namedview\n       id=\"namedview1023\"\n       pagecolor=\"#ffffff\"\n       bordercolor=\"#666666\"\n       borderopacity=\"1.0\"\n       inkscape:pageopacity=\"0.0\"\n       inkscape:pageshadow=\"2\"\n       inkscape:zoom=\"3.5521067\"\n       inkscape:cx=\"66.459318\"\n       inkscape:cy=\"62.629296\"\n       inkscape:window-width=\"1150\"\n       inkscape:window-height=\"752\"\n       showgrid=\"true\"\n       snaptogrid=\"true\"\n       inkscape:window-x=\"0\"\n       inkscape:window-y=\"29\">\n      <inkscape:grid\n         id=\"GridFromPre046Settings\"\n         type=\"xygrid\"\n         originx=\"0px\"\n         originy=\"0px\"\n         spacingx=\"1.0000000mm\"\n         spacingy=\"1.0000000mm\"\n         color=\"#0000ff\"\n         empcolor=\"#0000ff\"\n         opacity=\"0.2\"\n         empopacity=\"0.4\"\n         empspacing=\"5\" />\n    </sodipodi:namedview>\n    <linearGradient\n       inkscape:collect=\"always\"\n       xlink:href=\"#linearGradient1068\"\n       id=\"linearGradient2924\"\n       x1=\"41.673889\"\n       y1=\"320.40921\"\n       x2=\"36.082947\"\n       y2=\"279.22458\"\n       gradientTransform=\"matrix(2.3376099,0,0,0.29237422,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n    <linearGradient\n       inkscape:collect=\"always\"\n       xlink:href=\"#linearGradient1068\"\n       id=\"linearGradient2926\"\n       x1=\"134.95444\"\n       y1=\"108.16693\"\n       x2=\"102.05431\"\n       y2=\"71.835884\"\n       gradientTransform=\"matrix(0.91680324,0,0,0.74547824,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n    <linearGradient\n       inkscape:collect=\"always\"\n       xlink:href=\"#linearGradient1068\"\n       id=\"linearGradient2928\"\n       x1=\"145.32188\"\n       y1=\"101.97199\"\n       x2=\"129.22044\"\n       y2=\"70.041069\"\n       gradientTransform=\"matrix(0.90170536,0,0,0.75796032,-0.91913426,-1.5117091)\"\n       gradientUnits=\"userSpaceOnUse\" />\n  </defs>\n  <rect\n     style=\"fill-opacity:0.47154475;fill-rule:evenodd;stroke-width:3pt\"\n     id=\"rect918\"\n     width=\"48.72493\"\n     height=\"42.16835\"\n     ry=\"0.74231374\"\n     x=\"67.536102\"\n     y=\"66.474693\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.7811048\" />\n  <rect\n     style=\"fill-opacity:0.47154475;fill-rule:evenodd;stroke-width:3pt\"\n     id=\"rect1006\"\n     width=\"63.211483\"\n     height=\"54.705563\"\n     ry=\"0.74231374\"\n     x=\"64.47226\"\n     y=\"30.558294\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.7811048\" />\n  <rect\n     style=\"fill:#000000;fill-opacity:0.47058824;fill-rule:evenodd\"\n     id=\"rect1005\"\n     width=\"57.843418\"\n     height=\"9.0050545\"\n     ry=\"0.62889248\"\n     x=\"65.398254\"\n     y=\"82.153206\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.66175652\" />\n  <rect\n     style=\"fill:url(#linearGradient2924);fill-opacity:0.75;fill-rule:evenodd;stroke:#000000;stroke-width:0.82671446\"\n     id=\"rect1007\"\n     width=\"54.910637\"\n     height=\"6.1445785\"\n     ry=\"0.42912331\"\n     x=\"64.622299\"\n     y=\"82.282539\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.44939452\" />\n  <rect\n     width=\"57.905403\"\n     height=\"47.084496\"\n     ry=\"1.7822117\"\n     x=\"63.784973\"\n     y=\"32.456562\"\n     style=\"font-size:12px;fill:url(#linearGradient2926);fill-rule:evenodd;stroke:#000000;stroke-width:0\"\n     id=\"rect1009\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"1.6336281\" />\n  <rect\n     style=\"fill:#000000;fill-opacity:0.47058824;fill-rule:evenodd\"\n     id=\"rect971\"\n     width=\"44.58709\"\n     height=\"6.9413123\"\n     ry=\"0.62889248\"\n     x=\"68.249886\"\n     y=\"106.24529\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.66175652\" />\n  <rect\n     width=\"64.637024\"\n     height=\"54.068516\"\n     ry=\"1.4120796\"\n     x=\"59.853096\"\n     y=\"28.740753\"\n     style=\"font-size:12px;fill:url(#linearGradient2928);fill-rule:evenodd;stroke:#000000;stroke-width:1.65869105\"\n     id=\"rect1008\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"1.3970968\" />\n  <rect\n     width=\"51.129478\"\n     height=\"39.964478\"\n     ry=\"0.5422883\"\n     x=\"66.358932\"\n     y=\"34.89621\"\n     style=\"font-size:12px;fill:#00b4ed;fill-opacity:1;fill-rule:evenodd;stroke:#000000;stroke-width:0.79054338;stroke-linejoin:round\"\n     id=\"rect976\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.5422883\" />\n  <metadata\n     id=\"metadata982\">\n    <rdf:RDF>\n      <cc:Work\n         rdf:about=\"\">\n        <dc:format>image/svg+xml</dc:format>\n        <dc:type\n           rdf:resource=\"http://purl.org/dc/dcmitype/StillImage\" />\n      </cc:Work>\n    </rdf:RDF>\n  </metadata>\n  <rect\n     width=\"44.634872\"\n     height=\"36.293858\"\n     ry=\"1.7822117\"\n     x=\"67.006332\"\n     y=\"67.937927\"\n     style=\"font-size:12px;fill:url(#linearGradient1213);fill-rule:evenodd;stroke:#000000;stroke-width:0\"\n     id=\"rect575\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"1.633628\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill:#444040;fill-opacity:0.47058824;fill-rule:evenodd\"\n     id=\"path672\"\n     d=\"m 68.473,57.85183 a 23.629898,3.2222576 0 1 1 -47.259797,0 23.629898,3.2222576 0 1 1 47.259797,0 z\"\n     sodipodi:cx=\"44.843102\"\n     sodipodi:cy=\"57.85183\"\n     sodipodi:rx=\"23.629898\"\n     sodipodi:ry=\"3.2222576\"\n     transform=\"matrix(1.4221482,0,-0.30247168,1.9834766,9.6201687,-10.428817)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill:#4e4d4b;fill-rule:evenodd;stroke:#000000;stroke-width:2.30019999;stroke-opacity:0.9565\"\n     id=\"path625\"\n     d=\"m 58.291138,27.531645 a 19.367088,19.556963 0 1 1 -38.734177,0 19.367088,19.556963 0 1 1 38.734177,0 z\"\n     sodipodi:cx=\"38.924049\"\n     sodipodi:cy=\"27.531645\"\n     sodipodi:rx=\"19.367088\"\n     sodipodi:ry=\"19.556963\"\n     transform=\"matrix(-1.0172416,-0.47376693,-0.5523759,1.3286212,116.84611,57.272851)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill:url(#linearGradient612);fill-rule:evenodd;stroke:#000000;stroke-width:2.06100011;stroke-opacity:0.9565\"\n     id=\"path605\"\n     d=\"m 58.291138,27.531645 a 19.367088,19.556963 0 1 1 -38.734177,0 19.367088,19.556963 0 1 1 38.734177,0 z\"\n     sodipodi:cx=\"38.924049\"\n     sodipodi:cy=\"27.531645\"\n     sodipodi:rx=\"19.367088\"\n     sodipodi:ry=\"19.556963\"\n     transform=\"matrix(-1.4321234,-0.79696518,-1.1299666,2.2349846,128.07685,29.383033)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill:url(#radialGradient616);fill-rule:evenodd;stroke:#000000;stroke-width:0.317;stroke-opacity:0.97829997\"\n     id=\"path606\"\n     d=\"m 58.291138,27.531645 a 19.367088,19.556963 0 1 1 -38.734177,0 19.367088,19.556963 0 1 1 38.734177,0 z\"\n     sodipodi:cx=\"38.924049\"\n     sodipodi:cy=\"27.531645\"\n     sodipodi:rx=\"19.367088\"\n     sodipodi:ry=\"19.556963\"\n     transform=\"matrix(-1.1546358,-0.69851175,-0.95634664,1.9588777,108.06887,31.115628)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill-rule:evenodd;stroke-width:1.63499999\"\n     id=\"path686\"\n     d=\"m 58.291138,27.531645 a 19.367088,19.556963 0 1 1 -38.734177,0 19.367088,19.556963 0 1 1 38.734177,0 z\"\n     sodipodi:cx=\"38.924049\"\n     sodipodi:cy=\"27.531645\"\n     sodipodi:rx=\"19.367088\"\n     sodipodi:ry=\"19.556963\"\n     transform=\"matrix(-0.39495459,-0.4546194,-0.52881207,0.94219495,73.198184,52.427791)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <path\n     sodipodi:type=\"arc\"\n     style=\"font-size:12px;fill:url(#linearGradient687);fill-rule:evenodd;stroke:#3f3b3b;stroke-width:0.77380002\"\n     id=\"path611\"\n     d=\"m 58.291138,27.531645 a 19.367088,19.556963 0 1 1 -38.734177,0 19.367088,19.556963 0 1 1 38.734177,0 z\"\n     sodipodi:cx=\"38.924049\"\n     sodipodi:cy=\"27.531645\"\n     sodipodi:rx=\"19.367088\"\n     sodipodi:ry=\"19.556963\"\n     transform=\"matrix(-0.36949013,-0.40957751,-0.49471918,0.84885391,70.248021,52.066881)\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big2.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\" />\n  <rect\n     style=\"fill:url(#linearGradient573);fill-opacity:0.75;fill-rule:evenodd;stroke:#000000;stroke-width:0.82671446\"\n     id=\"rect934\"\n     width=\"42.326431\"\n     height=\"4.7363882\"\n     ry=\"0.42912331\"\n     x=\"67.651756\"\n     y=\"106.34497\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.44939449\" />\n  <rect\n     width=\"49.823761\"\n     height=\"41.677303\"\n     ry=\"1.4120796\"\n     x=\"63.975548\"\n     y=\"65.073692\"\n     style=\"font-size:12px;fill:url(#linearGradient580);fill-rule:evenodd;stroke:#000000;stroke-width:1.27855873;stroke-opacity:1\"\n     id=\"rect562\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"1.3970969\" />\n  <rect\n     width=\"39.411831\"\n     height=\"30.805574\"\n     ry=\"0.5422883\"\n     x=\"68.990387\"\n     y=\"70.097008\"\n     style=\"font-size:12px;fill:#003d88;fill-opacity:1;fill-rule:evenodd;stroke:#000000;stroke-width:0.61407685;stroke-linejoin:round;stroke-miterlimit:4;stroke-opacity:0.93023257\"\n     id=\"rect975\"\n     inkscape:export-filename=\"/cowserver/documents/httpd/vhosts/images/mpd-big7.png\"\n     inkscape:export-xdpi=\"721.66998\"\n     inkscape:export-ydpi=\"721.66998\"\n     rx=\"0.5422883\" />\n</svg>\n"
        },
        {
          "name": "python",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "subprojects",
          "type": "tree",
          "content": null
        },
        {
          "name": "systemd",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "valgrind.suppressions",
          "type": "blob",
          "size": 7.857421875,
          "content": "# GLib allocates a lot of memory which is never freed, and this makes\n# it too hard to read valgrind memcheck results.  You can pass this\n# file with \"--suppressions=valgrind.suppressions\" to disable lots of\n# bogus messages.\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_random_int\n}\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   fun:g_mutex_impl_new\n   fun:g_mutex_get_impl\n   fun:g_mutex_lock\n   fun:g_main_context_new\n}\n\n{\n   g_main_context_dispatch\n   Memcheck:Leak\n   fun:malloc\n   fun:g_malloc\n   fun:g_slice_alloc\n   fun:g_slice_alloc0\n   fun:get_dispatch\n   fun:g_main_context_dispatch\n}\n\n{\n   g_main_context_default\n   Memcheck:Leak\n   fun:?alloc\n   ...\n   fun:g_main_context_default\n}\n\n{\n   g_main_loop_run\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_main_context_iterate*\n   fun:g_main_loop_run\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_once_init_leave\n}\n\n{\n   g_log\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_mutex_lock\n   fun:g_log_set_default_handler\n}\n\n{\n   g_mutex\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:thread_memory_from_self*\n   fun:g_slice_*\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_static_mutex_get_mutex_impl\n}\n\n{\n   g_private\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_private_?et\n}\n\n{\n   g_static_private_set\n   Memcheck:Leak\n   fun:memalign\n   ...\n   fun:g_static_private_set\n}\n\n{\n   g_static_private_set\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_static_private_set\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_intern_static_string\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_intern_string\n}\n\n{\n   g_get_language_names\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_get_language_names\n}\n\n{\n   g_get_language_names\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_get_home_dir\n}\n\n{\n   g_get_language_names\n   Memcheck:Leak\n   fun:memalign\n   ...\n   fun:g_get_language_names\n}\n\n{\n   g_set_prgname\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_set_prgname\n}\n\n{\n   g_set_application_name\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_set_application_name\n}\n\n{\n   g_thread_init_glib\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_thread_init_glib\n}\n\n{\n   g_thread_self\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_slice_*\n   fun:g_thread_self\n}\n\n{\n   g_thread_create\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_mutex_lock\n   ...\n   fun:g_thread_create\n}\n\n{\n   g_slice_init_nomessage\n   Memcheck:Leak\n   fun:calloc\n   fun:g_malloc0\n   fun:g_slice_init_nomessage\n}\n\n{\n   g_get_filename_charsets\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_get_filename_charsets\n}\n\n{\n   g_get_charset\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_get_charset\n}\n\n{\n   openssl\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:ENGINE_load_dynamic\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_data_initialize\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_resolver_get_default\n}\n\n{\n   openssl\n   Memcheck:Leak\n   fun:malloc\n   fun:CRYPTO_malloc\n   ...\n   fun:SSL_COMP_get_compression_methods\n   fun:SSL_library_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   fun:CRYPTO_malloc\n   ...\n   fun:ERR_get_state\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   fun:CRYPTO_malloc\n   ...\n   fun:RSA_new_method\n}\n\n{\n   GnuTLS\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:gnutls_global_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:?alloc\n   ...\n   fun:do_dlopen\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:?alloc\n   ...\n   fun:dlopen*\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:malloc\n   ...\n   fun:dlclose\n}\n\n{\n   inet_ntoa\n   Memcheck:Leak\n   fun:malloc\n   fun:inet_ntoa\n}\n\n{\n   wildmidi\n   Memcheck:Leak\n   fun:malloc\n   fun:realloc\n   fun:init_gauss\n   fun:WildMidi_Init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:malloc\n   fun:strdup\n   ...\n   fun:ao_initialize\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:calloc\n   fun:ao_initialize\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Addr4\n   ...\n   fun:WildMidi_Init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:*alloc\n   ...\n   fun:g_quark_init\n}\n\n{\n   g_quark_from_string\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_quark_from_*\n}\n\n{\n   g_get_any_init_do\n   Memcheck:Leak\n   fun:malloc\n   fun:g_malloc\n   fun:g_strdup\n   fun:g_get_any_init_do\n}\n\n{\n   g_get_any_init_do\n   Memcheck:Leak\n   fun:malloc\n   fun:g_malloc\n   fun:g_strjoinv\n   fun:g_get_any_init_do\n}\n\n{\n   nss\n   Memcheck:Leak\n   fun:malloc\n   fun:__nss_lookup_function\n}\n\n{\n   nss\n   Memcheck:Leak\n   fun:malloc\n   fun:tsearch\n   fun:__nss_lookup_function\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_*_class_intern_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:type_iface_vtable_base_init_Wm\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_object_do_class_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_object_base_class_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:g_object_class_install_property\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:*alloc\n   ...\n   fun:g_type_register_static\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:gobject_init_ctor\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:intern_header_name\n}\n\n{\n   nss\n   Memcheck:Leak\n   fun:malloc\n   fun:nss_parse_service_list\n   fun:__nss_database_lookup\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:?alloc\n   ...\n   fun:xmlInitParser\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:?alloc\n   fun:snd1_dlobj_cache_get\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:_Znwm\n   ...\n   obj:*/libjack.so*\n   fun:call_init\n   fun:_dl_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Cond\n   fun:index\n   fun:expand_dynamic_string_token\n   fun:fillin_rpath\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Cond\n   fun:index\n   fun:expand_dynamic_string_token\n   ...\n   fun:do_preload\n}\n\n#\n# libgcrypt\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:*alloc\n   ...\n   fun:_gcry_mpi_init\n}\n\n#\n# libopenal\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:calloc\n   obj:*/libopenal.so*\n   ...\n   fun:_dl_init\n}\n\n#\n# libadplug\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:malloc\n   ...\n   obj:*/libadplug*.so*\n   ...\n   fun:_dl_init\n}\n\n#\n# libjack\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:_Znwm\n   obj:*/libjack.so*\n   ...\n   fun:_dl_init\n}\n\n#\n# libsmbclient\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:smbc_*_context\n   fun:smbc_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:smbc_setDebug\n   fun:smbc_init\n}\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   fun:*alloc\n   ...\n   fun:SMBC_module_init\n}\n\n#\n# libgomp\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:malloc\n   ...\n   fun:gomp_init_num_threads\n   ...\n   fun:_dl_init\n}\n\n#\n# libpixman\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:*alloc\n   ...\n   fun:pixman_constructor\n}\n\n#\n# libssh (via libcurl)\n#\n\n{\n   <insert_a_suppression_name_here>\n   Memcheck:Leak\n   match-leak-kinds: reachable\n   fun:*alloc\n   ...\n   fun:libssh2_init\n}\n"
        },
        {
          "name": "win32",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}