{
  "metadata": {
    "timestamp": 1736565955770,
    "page": 934,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjk0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "OpenXcom/OpenXcom",
      "stars": 1937,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".astylerc",
          "type": "blob",
          "size": 0.080078125,
          "content": "style=allman\nindent=tab\npad-oper\npad-header\nunpad-paren\nalign-pointer=name\nmode=c\n"
        },
        {
          "name": ".clang-format",
          "type": "blob",
          "size": 0.2490234375,
          "content": "{\n\tBasedOnStyle: LLVM,\n\tStandard: c++03,\n\tColumnLimit: 0,\n\tUseTab: ForContinuationAndIndentation,\n\tIndentWidth: 4,\t\n\tTabWidth: 4,\n\tBreakBeforeBraces: Allman,\n\tFixNamespaceComments: false,\n\tPointerAlignment: Right,\n#\tEmptyLineAfterAccessModifier: Never,\n}\n"
        },
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.37109375,
          "content": "root = true\n\n[*]\n; Broken in Visual Studio\n;charset = utf-8\ntrim_trailing_whitespace = true\nvc_generate_documentation_comments = doxygen_slash_star\n\n[*.{yml,rul}]\nindent_style = space\nindent_size = 2\n\n[*.{c,cpp,h,hpp}]\nindent_style = tab\nindent_brace_style = Allman\ninsert_final_newline = true\n\n[Makefile]\nindent_style = tab\n\n[CMakeLists.txt]\nindent_style = space\nindent_size = 2\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.43359375,
          "content": "# Set the default behavior, in case people don't have core.autocrlf set.\n* text=auto\n\n# Explicitly declare text files you want to always be normalized and converted\n# to native line endings on checkout.\n*.cpp text\n*.h text\n*.rc text\n\n# Declare files that will always have CRLF line endings on checkout.\n*.sln text eol=crlf\n*.vcxproj* text eol=crlf\n\n# Denote all files that are truly binary and should not be modified.\n*.png binary\n*.gif binary\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.8603515625,
          "content": "# autotools\naclocal.m4\nm4/pkg.m4\nmissing\ninstall-sh\nconfig.status\nconfig.guess\nconfig.sub\nconfigure\nMakefile\nMakefile.in\ndepcomp\ncompile\n.deps/\n*.tar.gz\n*.tar.xz\nopenxcom\n.dirstamp\n# Doxygen autogenerated conf\ndocs/Doxyfile\n# basics\n*.o\n.DS_Store\nThumbs.db\n#Ignore files built by Visual Studio\n*.obj\n*.exe\n*.exp\n*.pdb\n*.dll\n*.*.*.user\n*.aps\n*.pch\n*.vspscc\n*_i.c\n*_p.c\n*.ncb\n*.suo\n*.tlb\n*.tlh\n*.bak\n*.cache\n*.ilk\n*.log\n*.tlog\n*.zip\n[Dd]ebug*/\n*.lib\n*.sbr\n[Rr]elease*/\n[Tt]est[Rr]esults/\n_UpgradeReport_Files/\n_ReSharper.*/\n*.ipch\n[Ii]pch*/\n*.aps\n*.svl*\n*.mvf\n*.*sdf\n*.idc\n*.tmp\n*.dgml\n.vs/\n*.VC.*\n#OpenXcom stuff (no ending slashes for dirs so symlinks can be ignored as well as real dirs)\nbin/UFO\nbin/TFTD\ndeps/\ndocs/html/\nbuild/\nDependencies/\ntranslations/\n*.*.user\n!install/win/plugins/**/*.dll\n#Ignore Vim swap files\n*.swp\n#Ignore NetBeans project directory\nnbproject/\n/makefile"
        },
        {
          "name": ".tx",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.txt",
          "type": "blob",
          "size": 36.017578125,
          "content": "Version 1.0 (13-06-2014)\n-------------------------\nNew features:\n  General:\n- Rudimentary mod support has been added to the ruleset loading, including:\n  -- Modular ruleset support.\n  -- The ability to define extra strings, sounds and sprites.\n  -- The starting date can now be set in the ruleset.\n  -- Soldier stat caps are now acquired from the ruleset.\n  -- Added support for custom images in the UFO craft preview window.\n  -- Implemented a list weight value for items, which determines where they appear in ingame lists.\n  -- Allow for resizing of UI surfaces through rulesets.\n  -- Allow for weapons to change max range, autoshots, blast radius, strength modifier, melee attack, dropoff, LOS, bullet speed, etc.\n  -- Allow for armors to change unit stats.\n  -- Allow for setting producedItems for manufacture.\n  -- Allow for negative costs.\n  -- Rulesets will now internally number themselves and offset IDs by 1000 to avoid conflicts intelligently.\n- Begun development on loading TFTD content, specifically .BDY files.\n- Various translation updates, including new languages: Dutch, Finnish, Greek, Norweigan, Portuguese (BR), Slovak, Swedish, Turkish.\n- Localized installer in multiple languages.\n- Updated soldier names: Italian, Belgian, Congolese, Dutch, Greek, French, Kenyan, Korean, Indian, Polynesian, Slovakian.\n- New Battle will now load available terrains from the ruleset instead of having them hardcoded.\n- New Battle now allows unlimited items to be assigned to the craft.\n- Implemented weighting for which soldier look is chosen by which origin. This should decrease the likelihood of races not matching names to realistic levels.\n- Screen is now centered on higher base resolutions.\n- Mouse capture option added, as well as key shortcut.\n- New language format, system language auto-detected on first start.\n- Complete overhaul of pause menu, now totally consistent between geoscape/battlescape.\n- Options can be changed mid-game.\n- Saved Games will now indicate the system save time, in-game date and time, and if appropriate, turn number.\n- Saved Games can now be sorted by creation date or name.\n- Combo Box and Slider functionality added.\n- Scroll bars added to text lists.\n- Options menu completely overhauled.\n  -- Most hidden options now available on the menu.\n  -- All options have in-game descriptions.\n  -- UI volume now adjustable.\n  -- Audio format adjustable.\n  -- New display options: Borderless, Resizable, Letterboxing.\n  -- Internal game resolution may be adjusted for battlescape and geoscape separately.\n  -- All kinds of in-game timings are now adjustable, so you can make it run like your old 286, or pentium.\n  -- Mods can now be activated from in-game, and don't require a restart.\n  -- Many more advanced options added, most of which were previously omitted for requiring a restart.\n  -- Many UFOextender and XComUtil options added (either as advanced options or individual mods).\n  -- Mousewheel scroll speed is now configurable.\n  -- FPS limiter added.\n- New Battle menu completely overhauled.\n- Support for old or modded savedgames improved, including warnings about potential incompatibilities.\n- Multiline support added for textlists.\n- Improved text input.\n- Support added for multiple data folders.\n- Dedicated auto-save and quick-save slots added.\n- Added ironman mode.\n- New loading screen with better error handling.\n- Adlib music emulation added, MIDI playback is no longer required.\n\n  Geoscape:\n- Automatically end dogfights if the UFO outpaces the fighter and the window is minimised.\n- When areas don't have mission data set, they will now fall back to data for an area that does.\n- Psionic training at any time option added: allows adding/removing soldiers from psionic training at your discretion rather than on a monthly basis, and updates their progress daily.*\n- Fields added to craft rulesets for further moddability.\n- Added \"Sack\" button to soldier info screen.\n- Added inventory screen to craft equip screen.\n- Added estimates for craft repair/refuel/rearm times.\n- Alien Containment management screen added.\n- Soldier Memorial screen added to keep track of Xcom casualties.\n- Hotkeys for base selection added.\n- Last selected base now preserved on closing base window.\n- Fixed craft renaming not working.\n- Fixed HWPs not reloading when new ammo arrived.\n- Added Prev/Next key shortcuts to Basescape soldier info.\n- Aircraft flight path line indicators added.\n- Storage limit enforcement option added, complete with \"overflowed item\" management screen.*\n- Drag scroll added.\n- Melee accuracy now shown on soldier stat screens.\n- Manufacture auto sale button added to manufacture screen.\n- Infinite quantity added to manufacture screen.\n- Background now filled out in higher base resolutions.\n- Added various Go To Base shortcuts in Geoscape popups.\n- Added right-click on craft in Intercept screen to center on it.\n- Added right-click on soldier in Craft screen to show their stats.\n- Ufopaedia now shows armor damage and stat modifiers.\n- New Advanced-Option: View soldier's Psi-Strength after the appropriate research has been completed.*\n\n  Battlescape:\n- Inventory: Ctrl-click an item to attempt to swap it between the ground and your soldier's inventory.\n- Inventory: Added ability to define paper dolls for non-player units.\n- Alt-click can now be used as an alternative to right-clicking.\n- Various soldier weapon display changes:\n -- When using two two-handed weapons, display the one currently in use.\n -- Display soldier hands in front of rifles.\n -- If holding a pistol and a two-handed weapon, display both while firing.\n- Factored height into the throwing calculation.\n- Plasma tanks and sectopods now play the correct firing sounds.\n- Item stacking implemented: Functionally identical items will appear in the same place on the ground with a number displayed over them, if there are a large stack of similar items.\n- 2012 item recovery option added: only captured aliens drop intact weapons.*\n- Path preview option updated: displays yellow when you can move to a spot but are unable to perform auto shot (or the type of shot you have on reserve) with your remaining TUs.\n- Path preview option updated: can now be set to show arrows, remaining TUs, or both.*\n- Units will no longer poke their heads through floors above them when standing on tall objects.\n- AI almost completely re-written from scratch, should more closely resemble vanilla.\n- Painkillers from the medikit now work.\n- Tooltips added for all buttons.\n- Number of Auto-shots is now a definable attribute of a weapon.\n- Warning messages added when handling live grenades.\n- Weapons can be defined to charge a \"flat rate\" rather than a percentage of TUs.\n- Reaction fire mechanics completely re-written to replicate vanilla.\n- Stats added to Armor, allowing it to enhance (or hinder) a soldier's abilities.\n- Map draw functions hugely optimized, game is now playable on Android.\n- Buttons for Reserve for Kneel and Zero Time Units added.\n- Debug feature to kill all aliens added. (Ctrl+K)\n- Auto-Equipment function rewritten to mimic vanilla, and an option added to completely disable auto-assignment.\n- Accuracy model completely rewritten to replicate vanilla as closely as possible.\n- Range based accuracy removed - UFO Extender accuracy added.\n- Throw formula modified to mimic vanilla behaviour, with arc angle being a factor of weight, strength and distance.\n- Items in Base storage are now randomly distributed on the floors of storage facility maps.\n- Explosives will deal directional damage to units outside the \"ground zero\" radius.\n- Aliens will now target and destroy \"essential\" objects in base modules, possibly leading to their destruction.\n- When using a medi-kit, any injured body part will be selected by default.\n- Sprites added for mind controlled terror unit weapons.\n- Shotgun behaviour added for modded weapons.\n- Deployment data for crafts added, allows for fine-tuned placement of units.\n- New sprites added for alien weapons, courtesy of Arne.\n- TFTD damage formula added.*\n- Melee Aliens will now hit you with their strength rather than a static value.\n- Notification added for disarming grenades pre-battle.\n- Smooth bullet camera mode, follows the bullet as it moves rather than jumping the camera around.*\n- Confirm fire mode, requires a second click to confirm a fire order.*\n- Melee skill now included in hit calculations.\n- More meaningful errors added to inventory screen.\n\n* These features are disabled by default but can be enabled in the advanced options menu or by editing your configuration file.\n\nBugfixes:\n\n  General:\n- Fixed \"classic mouse behaviour\" and made it the default. (You should now be able to hold down the left mouse button and drag it down a list, incrementing several items)\n- Various Linux and OSX-related fixes.\n- Renamable fields no longer accept blank strings. (ie. no more bases, interceptors, or soldiers named \"\")\n- Can now set the config folder via command line switch (-user)\n- Fixed loading data from multiple folders.\n- Extra sprites fixed for OSX.\n- Game icon now correctly displayed in game window on all operating systems.\n- Palette system overhauled to prevent windows changing colours incorrectly.\n- Fixed various bugs with Unicode handling in paths and strings.\n- Fixed various UI bugs on tablets.\n\n  Geoscape:\n- X-Com now correctly pays their first month's rent and maintenance in advance.\n- To avoid lawsuits, sacked soldiers no longer take their armour with them.\n- Crashed and landed UFOs no longer display a heading, even if that information is available.\n- If a base is lost and a craft from that base is following a UFO but running low on fuel, do not prompt the player to return the craft to the lost base.\n- Fighters no longer get quicker shots due to a bug that made them move in and out of their maximum weapon range when changing behaviours rapidly.\n- UFOs should no longer escape dogfights too quickly.\n- When the game starts, play the \"GMGEO1\" music track, instead of choosing randomly.\n- When only one item remains to research and is added to the active projects, properly clear it from the \"new projects\" menu.\n- Research now consumes items only as appropriate.\n- Landed/Crashed UFOs will no longer try to detect X-Com bases.\n- Graphs screen scale corrected.\n- UFO flight-paths fixed to use correct areas for waypoint selection. Flight paths should now mimic vanilla (as much as something that's random can)\n- Crafts teleporting when over poles corrected.\n- Rare music bug in base defences fixed.\n- Fix for soldiers in transfer not being counted when handing out promotions.\n- Fix the council congratulating XCom on a job well done as they cancel the project.\n- Downed UFOs will use appropriate behaviour after XCom dusts off.\n- Alien mission timers fixed.\n\n  Battlescape:\n- Fixes to various UFOpaedia articles.\n- Loading saved games now correctly preserves the difficulty adjustments to alien stats.\n- Prime grenade buttons over 10 now work.\n- Alien soldiers now reserve less TUs for reaction fire, and commanders reserve more.\n- Stop turning when a new enemy is spotted, but ensure units will always face their targets when shooting.\n- Re-wrote the reaction fire code to implement fixes and changes, including:\n -- Better handling of reaction fire against the last alien in the battle.\n -- Reaction shots should only be snap shots, not auto.\n -- Firing will trigger a reaction check.\n -- Hitting an alien with a non-melee weapon will cause it to face you.\n -- When two units spot each other at the same time, no reaction fire will occur.\n- Adjusted various distance thresholds to compensate for the original game's attempt to approximate bresenham algorithms.\n- Explosions now correctly cause fire.\n- Fixed strafing through doors.\n- Fixed the order of events in the battlescape loop.\n- Fixed a bug causing some tiles to inappropriately act transparent.\n- Aliens have night vision again, as per the original game, spotting soldiers within 20 tiles regardless of light.\n- XCOM soldiers should now always spot aliens within 18 tiles, regardless of light, and 20 tiles in good light.\n- Inventory: Allow scrolling of items on the ground when only two tiles of empty space remain, instead of just one.\n- When ending a turn, the game will now close doors before setting off explosions.\n- When returning a mind controlled alien to alien control, return their lighting to normal.\n- Corrected how gravity applies to Reapers.\n- Check tiles above explosions for whether items or units need to fall.\n- Fixed silacoid attack ability, and made them immune to fire, so that they don't roast themselves.\n- Fixed some celatid sprites.\n- Stop displaying the PSI button after a psi-capable unit dies.\n- Clear waypoints and top displaying the LAUNCH button if the turn is ended while setting waypoints for the blaster launcher.\n- Fixed a crash on loading the battlescape.\n- Fixed line of sight errors for certain walls.\n- Fixed a crash bug relating to automatically ending battles.\n- Tank inventories will no longer open during the Cydonia phase two transition.\n- Properly reset the turn counter for phase two of Cydonia.\n- Improved attribution of grenade kills.\n- Fixed issues with shooting blaster bombs directly into walls not damaging nearby units.\n- Fixed a bug that caused run mode to \"stick\" after pressing Control while the Strafe setting option was enabled.\n- Fixed a bug that caused grenades primed above \"0\" to still instantly explode when Instant Grenades option was enabled.\n- Weapons that aren't armour piercing now also cause minor stun damage.\n- When aborting a mission, mind controlled aliens no longer count as friendly units for scoring purposes.\n- Soldiers now panic in a way that's more consistent with the original game.\n- All buttons disabled while projectiles are in-flight to disable cheating.\n- Fixed TU costs for some alien weapons. (Some alien melee attacks should have flat costs instead of a percentage of TUs)\n- Instant grenade behaviour fixed.\n- Clip recovery fixed.\n- Grenades no longer cause crashes when used to kill the final enemy.\n- Visibility in smoke corrected.\n- Turning to walk and being interrupted (by spotting a unit) now properly costs TUs.\n- Melee and Medikits now use the same algorithm, and obey stairs properly.\n- Units with built-in weapons no longer drop them when falling unconscious.\n- Fixed various issues regarding \"tanks only\" deployment to mission sites.\n- Revived units will no longer have their full TUs.\n- Units can no longer be saved from zombification by reloading.\n- Chryssalid screaming behaviour fixed.\n- Broken alien base map modules removed from ruleset.\n- Alien equipment random distribution re-aligned with vanilla.\n- Aliens will no longer prime grenades unless they have already thrown it.\n- Explosions now play the full animation instead of starting half way through.\n- Lots of bugs regarding flying in power armor and kneeling fixed.\n- Unconscious units being carried into the exit zone will now be properly accounted for.\n- Accuracy formula corrected.\n- Camera movements now follow vanilla formula.\n- Pathfinding preview altered and fixed in many ways.\n  -- Now updates appropriately according to reserve setting.\n  -- No longer thinks that paths moving vertically wipe out all remaining TUs.\n- Energy recovery now in-line with vanilla formula.\n- Mouse Position (relative to screen) now preserved while drag-scrolling.\n- Z-axis scrolling corrected.\n- Large unit rendering fixed to no longer be drawn through walls.\n- Sprite drawing routines revised.\n\nVersion 0.9 (07-05-2013)\n-------------------------\nNew features:\n  General:\n- Intro cinematic.\n- Game can now be completed, game over screens for winning and losing.\n- Randomizer for \"New Battle\" mode.\n- Your settings in \"New Battle\" mode will be saved for next time you play.\n- New translations: Ukrainian, Bulgarian, Portuguese (Portugal), Spanish (Latin American), Danish.\n- New soldier names: Italian, Hungarian.\n- Aliens progress their equipment levels, races and aggression over time.\n- Added \"Alien Weapon Level\" button in New Battle menu.\n- Added \"Right Click to Delete\" function in save/load menus.\n- Added various display filters to the game, including HQX and various OpenGL shaders.*\n- The game can be dynamically resized to a new display resolution when in windowed mode.*\n- The default windowed mode position can now be edited in the configuration file.*\n- Modular Ruleset support.\n- Added \"Controls\" menu.\n- Added \"Advanced Options\" menu.\n- Added button to Restore Defaults to options.\n- Pause Game on Loss of Focus.**\n\n  Geoscape:\n- Live alien capture and interrogation.\n- Psionic training.\n- Hyper-wave decoding.\n- Alien base handling.\n- Scoring for both aliens and Xcom.\n- Funding nation decision making.\n- Multiple dogfight handling.\n- Graphs screen.\n- Base Defense screens.\n- Full research tree.\n- Alien UFO Mission Generation.\n- Alien retaliatory attacks on Xcom bases.\n- Show radar-range lines on the globe after pressing R key.\n- Show funds above the time.*\n- Added the number of soldiers allocated on craft equipment-screen.\n- Custom initial base layout.* (requires a new game to take effect)\n- Building-Queue: Can place buildings next to uncompleted-buildings.*\n- AutoSell Production state for a manufacturing project by a right click on the increase button.*\n- Allowed multiple items to be produced per hour when very large numbers of engineers are assigned to a project.*\n- Upper limit for alien captures per containment facility.* (visible on Base Info screen)\n- Captive aliens can now be sold in the same manner as dead aliens.*\n- Can transfer crafts while airborne.*\n- Increase/decrease buttons now respond to mouse wheel scrolling when the cursor is above them.*\n- Allocate Scientists and Allocate Engineers screens now respond to mouse wheel scrolling.+\n- Debug mode now enables drawing of country and region borders.\n\n  Battlescape:\n- Battlescape melee unit AI.\n- Unit conversion for chryssalids and zombies.\n- All missing units implemented, both alien units and xcom tanks.\n- All missing items implemented.\n- Psionic attacks implemented.\n- Units dual wielding single handed weapons is now represented on the battlescape.\n- The game now dynamically replaces sprite colours in order to represent soldier ethnicity and hair colour.\n- Equipment loadout saving.\n- Show more stats in inventory view.*\n- Proper A* pathfinding.\n- Battlescape RMB scrolling changed to MMB, renamed to Drag-Scroll, improved.\n- Landing Ufos/Ground Assault missions.\n- Ruleset support for multiple-stage missions.\n- Certain units now \"Yell\" when engaging another unit.\n- Enemy unit stats and armour are now affected by difficulty.\n- Grenade explosions now properly credit the previous owner of the grenade with the kill when a unit dies.\n- Units can now \"fall\" off edges by walking off the side of a roof or platform, and other gravity-related features are implemented.\n- The game now centres on the active soldier when the player closes the inventory screen.\n- Reapers can now reaction-attack soldiers that move into a tile adjacent to them.\n- Aliens will attempt to avoid areas where other aliens have died, except in base defense missions.\n- Various AI improvements.\n- Debug mode now has tile colourisation to represent AI evaluations.\n- Debug mode now has a time-slowing feature, which can be used for graphical or voxel debugging.\n- Alien Bases can now be neutralized by destroying the control room.\n- Mission can be won by mind-controlling all remaining units.*\n\n* These features are disabled by default but can be enabled in the advanced options menu or by editing your configuration file.\n+ These features are enabled by default but can be disabled in the advanced options menu or by editing your configuration file.\n** These features can be altered by editing your configuration file.\n\nBugfixes:\n  General:\n- Updated translations.\n- Added support for more Unicode letters.\n- Fix for extra mouse buttons.\n- Various cursor-related bugfixes/improvements.\n- Support for Haiku folder paths.\n- Fix for 8 KHz WAV-file (in SAMPLEx.CAT) playing.\n- Fixed various memory leaks.\n\n  Geoscape:\n- Fix for a crash bug involving an edge case where several craft were sent to intercept a single UFO.\n- Adjusted the length of the date column on the saved game screen to allow room for translated text.\n- Research consumes items properly.\n- If necessary, craft will now always rearm after refuelling.\n- Fixed error in great circle calculation.\n- It is no longer possible to assign armour to a soldier while they're away from the base.\n- Up/down buttons now need to be held for a quarter-second before they increment by more than one.\n(This should fix single-clicks incrementing totals by more than one, making it hard to hit exact values)\n- Items are no longer removed from stores when they are researched.\n- Cut off input to dogfight screens when your craft is destroyed or the UFO decides to disengage.\n- \"New research available\" popups should now only display the first time you research a technology that will unlock a new branch of research.\n- Fixed: Can't dismantle ANY facility if some of the attributes is overflowed!\n- Fixed: Busy people weren't getting paychecks\n- Fixed radar detection calculation.\n\nBattlescape:\n- Battlescape buttons are now unavailable during alien turn.\n- Fixed bug in map generator regarding nodes outside the map.\n- Improved map generation of alien base assault missions.\n- The player no longer reveals the tile an alien is standing on when they detect an alien on an unrevealed tile.\n- The camera resets after non-reaction shots.\n- Camera now correctly centers on explosions, and properly detects explosion visibility.\n- Projectiles are now visible when they fly above an unrevealed tile.\n- Fixed various display bugs with projectiles.\n- UFO walls can no longer be seen through from certain angles.\n- Reaper Corpse tiles now arranged correctly.\n- Doors should no longer close on top of large units.\n- Players can now recover large unit corpses if the northwest piece is intact, as per the original game.\n- Units on stairs will now correctly reveal tiles on the level above.\n- Opening doors now uses time units correctly.\n- Fixed strange spawn behaviour.\n- Undiscovered aliens are no longer factored into pathfinding.\n- Applying stun damage to unconscious units increasing the time they will remain unconscious.\n- Stun damage should no longer damage items.\n- When units are auto-equipped for battle they will now assign as many items to their belt slots as will fit instead of stopping after 1.\n(This should fix alien grenades being recovered less often than in the original)\n- Motion scanners now detect motion on all different levels in addition to the level of the scanning soldier.\n- Various bugfixes for large units.\n- Various psi-related bugfixes.\n- Various clipping issues fixed.\n- Various pathfinding bugfixes/improvements.\n- Various sound-related fixes.\n- Ethereals can now fly as intended. You have been warned.\n- Added some more robust behaviour around what happens when a unit is forced into an occupied tile.\n(ie. for the floor collapsing beneath a soldier standing above another soldier, and for when an unconscious soldier revives when another soldier is standing in their tile)\n- Fixed a bug where items with unlimited ammo would weigh twice as much as they should.\n(removed the step to add clip weight to a weapon if the weapon is its own ammunition)\n\nVersion 0.4.5 (04-11-2012)\n---------------------------\nNew features:\n- Ufopaedia.\n- Hungarian translation.\n- Rightclick mouse scrolling.\n- Rightclick arrow buttons to min/max values.\n- Can prime a grenade on mission pre-equip (Inventory view) with a right-click.\n- Weapons can be toggled on/off during dogfights.\n- Modular rulesets (specified in options.cfg).\n- Soldier reordering.\n- New options.\n- Man page / command-line help.\n- Logging.\n\nBugfixes:\n- Updated translations.\n- Updated soldier names.\n- Various string clipping issues.\n- Various UI issues.\n- Infinite error message when tanks didn't have ammo.\n- Tanks getting it on in the storage room (recovered when mission ended).\n- Multiple \"Tracking Lost\" windows per UFO.\n- Improved auto-equipping to ignore empty weapons and load weapons on the ground.\n- Brought alien weapons counted towards score.\n- Civilians didn't count towards score.\n- Crash when completing a research.\n- Crash during dogfights.\n- Wrong mouse input in minimap.\n- Starting inventory didn't work correctly in mission simulator.\n- HWP ammo popped up in soldier inventory.\n- Incorrect armor damage modifiers.\n- Workaround for big corpse pieces being recovered.\n- Missing rules for Reaper (crashed terror missions).\n- Ammo being reused after loaded.\n- Civilians counting as saved when mission failed.\n- Projectiles went through UFO if missed.\n- Weird avenger spawn point.\n- Item in elevator crash.\n- Diagonally walking through trees.\n- Items flying in the air when flying unit drops items.\n- Fixed proximity grenade.\n- Wrong craft speed when patrolling.\n- Crash when patrolling after UFO lost.\n- \"Go to last known UFO position\" button not working.\n- Incorrect UFO recovery items.\n- Ammo in weapons wasn't recovered after missions.\n- Crafts were fully unloaded after missions.\n- New crafts don't start in base position.\n- Ammo graphics weren't cleared after unloading weapon.\n- Minimap doesn't update level when using scroll wheel.\n- Missing \"Not enough equipment to fully re-equip squad\" screen.\n- Incorrect title in Promotions screen.\n- Various changes to item creation/recovery in Battlescape.\n- Wrong UFO graphics in interception window.\n- Wrong craft/UFO altitudes.\n- \"UFO tracking lost\" window missing sometimes.\n- Crash when targeted terror site disappears.\n- Reapers having incorrect behavior.\n- Soldiers can turn without TUs.\n- Walking through knocked down walls takes 4 TUs.\n- Primed state of a grenade is not saved in the savegame.\n- Firing and throwing accuracy does not decrease on injury.\n- Diagonal line of sight through windows.\n- Minimap not showing visible aliens on invisible tiles.\n- Visible units not stored in save.\n- Beam weapons not dealing any damage to UFOs.\n- Rewritten dogfight radar animation.\n- Dogfight UFO hit animation.\n- Dogfight UFO crash animation.\n- Dogfight projectiles animation.\n- Projectiles could hit UFO even if it was out of their range.\n- Added craft damage indication.\n- Added translated terrain names to New Battle.\n- Sound and graphics of flying suit.\n- Small pathfinding issue.\n- Segfault when mindprobing empty space.\n- Untranslated Geoscape sidebar.\n- Implemented faster unit walk speed off screen.\n- Items visible on minimap on undiscovered tiles.\n- Units walking on top of each other.\n- Incorrect behavior with ground items in inventory.\n- Options screen and resolution selection.\n- Craft has wrong position when transferred.\n- Craft doesn't reequip when transferred.\n- Game returns to the actual game after saving (instead of previous menu).\n- Drawing issue in medikit and scanner view.\n- Improved explosion animation scaling with power.\n- Explosion sound.\n- Added Elerium-115 to battlescape.\n- Vertical pathfinding.\n- Cancel firing mode when pressing move up/down.\n- Flying up/down graphics.\n- Show damage percent of craft on its state-panel.\n- Buttons not pressing with right-clicks.\n- Bugs in soldier name generation.\n- Added geoscape position to saves.\n- Added \"We can now produce\" Geoscape window.\n- Walk/move sounds.\n- Proper ammo accounting after battles.\n- Added \"loading/saving...\" messages to savegame screens.\n- Being able to input text in resolution.\n- Non-ASCII character input.\n- Non-ASCII savegame names.\n- Crash when trying to rearm crafts with empty weapon slots.\n- Weapons glitching when dropped by panicked soldiers.\n- UFO trying to escape after being destroyed.\n- Freeze in wordwrapping.\n- Big text automatically switches to small if string doesn't fit.\n- Battlescape crash when items were dropped.\n- Unlimited ammo weapons being incorrectly recovered.\n- Mouse being restricted to 320x200 area in some systems.\n- Not being able to overwrite saves with non-ASCII names.\n- Save list not synchronizing with text input.\n- Weapon unload not clearing text.\n- Basescape not resetting time to 5 Secs.\n- Random seed missing in saves.\n- Crash when large units tried to move outside the map.\n- Wrong reaper sound.\n\nVersion 0.4 (13-08-2012)\n-------------------------\nNew features:\n- Basescape:\n-- Research screens.\n-- Manufacture screens.\n-- Soldier improved stats.\n-- Tank equipping.\n-- Armor equipping.\n-- Wound recovery.\n- Geoscape:\n-- New globe shading.\n-- Craft pathfinding now uses great circles (more accurate).\n-- New radar detection formula (more accurate).\n-- Terror sites.\n-- UFOs of all sizes.\n-- Tied research requirements to everything.\n-- UFOs in dogfights fight back.\n- Battlescape:\n-- Abort screen.\n-- Debriefing screen.\n-- Battlescape save game.\n-- Panicking units.\n-- Skill increase and promotions.\n-- Ranged based accuracy is now optional (see UFO Extender for details on Ranged Based Accuracy).\n-- Minimap.\n-- Flying units.\n-- Grav lifts.\n-- Optional pathfinding preview.\n-- Medikits.\n-- Laser weapons.\n-- Large units.\n-- Motion scanner.\n-- Alien deployment rules.\n-- AI taking cover & throwing grenades.\n-- Damage to items.\n-- Mind probe.\n-- Stun rod.\n-- Show/hide battlescape layers button.\n-- Rough battlescape artefacts salvaging functionality.\n-- Added civilians.\n-- Added support for skyranger landing on non 0-level.\n-- Added support for multiple craft/ufo maps.\n-- Psi Amp.\n-- Added support for more alien races.\n-- Load Game button.\n- External rulesets.\n- Added entries for most entities in the game.\n- New Battle screen.\n- Options screen.\n- Startup logging.\n- 64-bit version.\n- Game icon and logo.\n- Support for multiple data folders.\n- Support for XDG specification.\n- Support for user soldier name pools.\n- Various new options (see docs).\n- Debug mode.\n\nBugfixes:\n- Two duplicating ammo bugs.\n- Wrong rocket launcher hand sprite.\n- \"Not enough time units\" during alien turn.\n- Bug where alien weapons are given to the soldiers.\n- Target mode is canceled when switching unit.\n- Reserve time unit button is reset when starting new turn.\n- Minor drawing glitch visible when walking down the skyranger ramp.\n- Geoscape sidebar didn't show up on first start on some languages.\n- Bug with line of sight inside UFOs along diagonal walls.\n- Bug with pathfinding inside UFOs along diagonal walls.\n- Aliens not black when in undiscovered terrain.\n- Issue with turn and shoot.\n- Too many reaction fires from autoshot (each shot had a chance of a reaction shot which is wrong).\n- Unit selection arrow showed up during alien turn.\n- Double sliding door didn't open when walking diagonally.\n- Energy usage not calculated correctly.\n- Missing text in Monthly Report.\n- Ground items showing up in soldier's hands.\n- Improved interface performance.\n- Bug with seeing through undiscovered floors.\n- Updated the Rank Bonus values used to calculate soldier \"value\".\n- Apply changes to the base / soldier name when user presses OK.\n- Incorrect globe zoom levels.\n- Incorrect UI strings.\n- Incorrect colors in Battlescape UI.\n- Crash when starting mission on back side of globe.\n- Endless number of soldiers in Skyranger.\n- Clicking visible enemy units clicks other stuff too.\n- Fixed lazy ground inventory arrangement.\n- Aliens do not suffer from fatal wounds anymore.\n- Improved straight line pathfinding in battlescape.\n- Fixed unable to hit unit on stairs.\n- Fixed drawing hidden object's outlines.\n- Fixed pistol aiming position.\n- Fixed HWP rank image.\n- Fixed no LOF error issues.\n- Fixed issue where unit stopped walking when not seeing new alien units.\n- Fixed alien reaction shots costing no TUs.\n- Camera centers on selected unit on battlescape start.\n- Fixed battlescape kill counter not working.\n- Fix cursor hiding and scrolling during AI turn\n- Fix camera scrolling into dark infinite and beyond\n- Fix unit FOV calculated before AI reaction shot.\n- Fixed \"alien floating error\".\n- Fixed walking under skyranger.\n- Fixed firing XP from explosive ammo.\n- Fixed active weapon display.\n- Fixed issue with dead alien count.\n- Fixed autoshot of HE ammo issue.\n- Save turn number in savegame.\n- Fixed free autoshot ammo.\n- Fixed wrong UI colors.\n- Updated translations.\n- Fixed craft loading bug.\n- Fixed crash with invalid savegames.\n- Fixed savegame list not being sorted.\n- Game no longer crashes if no sound device is available.\n- Crafts that are outside of base no longer show in base view.\n- Fixed globe not redrawing properly sometimes.\n- Fixed various data loading bugs.\n- Sell screen now decreases item quantity.\n- Fixed craft pathing bugs.\n- Fixed bug in command-line parameters.\n- Various performance improvements.\n- Added fallback if no soldier name pools are available.\n- Fixed radar detection.\n- Fixed some bugs in globe.\n- Fixed inventory crash with certain armor types.\n- Fixed crash with loading DOS sounds.\n- Fixed battlescape buttons responding to wrong mouse button.\n- Improved mouse click handling.\n- Fixed Language dialog having wrong height.\n- Game no longer crashes if language isn't found.\n- Game no longer crashes if User directory is unavailable.\n- Game now shows an error if no languages are available.\n- Fixed various bugs with text strings not fitting.\n- Fixed text caret not always aligning properly.\n- Fixed crash with UI buttons.\n- Fixed Intercept string not always showing correct stats.\n- Fixed colors in Target Info and Items Arriving windows.\n- Fixed various savegame bugs.\n\nVersion 0.3 (01-09-2011)\n-------------------------\nNew features:\n- Basescape:\n-- Craft rearming.\n-- Craft equipping.\n-- Purchase/Recruit.\n-- Sell/Sack.\n-- Base transfers.\n- Battlescape:\n-- Battle turns.\n-- Item equipping, firing, throwing.\n-- Environment: fire, smoke, explosions, damage, kills.\n-- Unit stats.\n-- Inventory.\n-- AI Phase 1 (patrol, aggro).\n- New languages: Czech, English (UK), Polish, Romanian, Russian.\n- Support for custom font characters and full Unicode.\n- Options.\n- Platform-specific folders.\n- Partial Ufopaedia.\n- Externalized soldier names.\n- Nag screen only shows once.\n- Swapped F5 and F12 keys.\n- Movable caret in text input.\n- Stores column in Purchase screen.\n\nBugfixes:\n- Bug in Geoscape pathfinding.\n- Incorrect language names.\n- Cross-platform bug when loading PCK files.\n- Invisible loading errors.\n- Incorrect mouse events.\n- Missing strings.\n- Various UI issues.\n- Various translation issues.\n- Bug in craft rearming.\n- FPS Counter didn't always show up properly.\n- Crash sites didn't vanish properly.\n- Failing to load a game could crash the Geoscape.\n- Games weren't always saved properly.\n- Monthly report didn't show correct date.\n- Crafts in base view weren't positioned correctly.\n- Music loading issues.\n- Various battlescape fixes.\n- Various performance improvements.\n\nVersion 0.2 (28-01-2011)\n-------------------------\nNew features:\n- Battlescape!\n-- Crash site missions.\n-- Map generation.\n-- Pathfinding.\n-- Alien placement.\n-- Basic lighting.\n-- Basic fog of war.\n- New language format (with Spanish and Italian languages).\n- Crude Unicode support.\n- Windows installer for all your lazy needs!\n- Load/save infinite games.\n- Screenshot, FPS Counter and Fullscreen keys.\n- Any-resolution scaling.\n- Support for DOS music.\n- Being able to remove bases (Access Lift).\n- Friendly start reminder.\n\nBugfixes:\n- Bug in cursor rendering.\n- Removed unused strings and trademarked game names.\n- Craft maintenance bugs.\n- Bug in text list alignment.\n- Bug in bar rendering.\n- Crash when a UFO intercepted by multiple craft was destroyed.\n- Incorrect text in some screens.\n- Some localized strings didn't fit on screen.\n- Palette bugs.\n- Various memory leaks.\n- Being able to click on globe through windows.\n- Bugs with multiple-target display.\n- Various fixes to globe rendering.\n- Big in text word-wrapping.\n- Reorganized country/region data.\n- Added OK button to Base Name window for people having trouble with Enter key.\n- Removed preloading of every language (only one language is used at once, what was I thinking!).\n- Bug in pixel blitting.\n- Improved error handling.\n- Probably many other minor fixes.\n\nVersion 0.1 (17-11-2010)\n-------------------------\nFirst release!\n- Geoscape:\n-- Fully-controllable globe.\n-- Globe details like country borders and names.\n-- Day/night effect.\n-- Initial base placement.\n-- Basic UFO spawning and detection.\n-- Craft interception with fuel consumption and basic dogfights.\n-- Craft repairing/refuelling/rearming.\n-- Funding overview.\n-- Monthly funding.\n-- Scroll-wheel support.\n- Basescape:\n-- Full base view with facilities.\n-- Building new bases with access lift placement.\n-- Base information.\n-- Base stores.\n-- Soldier stats (with randomly generated soldiers).\n-- Craft info and equipping.\n-- Facility building/removal.\n-- Scroll-wheel support.\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 8.1396484375,
          "content": "cmake_minimum_required ( VERSION 3.1 )\n\nproject ( OpenXcom )\n\nset ( CMAKE_MODULE_PATH \"${CMAKE_SOURCE_DIR}/cmake/modules\" )\ninclude(BuildType)\ninclude(GNUInstallDirs)\n\n# For yaml-cpp\nset (CMAKE_CXX_STANDARD 11)\n# use std=c++11 rather than std=gnu++11\nset (CMAKE_CXX_EXTENSIONS OFF)\n\noption ( DEV_BUILD \"Development Build. Disable this for release builds\" ON )\noption ( BUILD_PACKAGE \"Prepares build for creation of a package with CPack\" ON )\noption ( ENABLE_WARNING \"Always show warnings (even for release builds)\" OFF )\noption ( FATAL_WARNING \"Treat warnings as errors\" OFF )\noption ( ENABLE_CLANG_ANALYSIS \"When building with clang, enable the static analyzer\" OFF )\noption ( CHECK_CCACHE \"Check if ccache is installed and use it\" OFF )\nset ( MSVC_WARNING_LEVEL 3 CACHE STRING \"Visual Studio warning levels\" )\noption ( FORCE_INSTALL_DATA_TO_BIN \"Force installation of data to binary directory\" OFF )\nset ( DATADIR \"\" CACHE STRING \"Where to search for datafiles\" )\nset ( OPENXCOM_VERSION_STRING \"\" CACHE STRING \"Version string (after x.x)\" )\n\nif ( CHECK_CCACHE )\n  find_program( CCACHE_PROGRAM ccache )\n  if( NOT CCACHE_PROGRAM )\n    message ( \"CCACHE requested but not found on the system.\" )\n  else ()\n    set_property( GLOBAL PROPERTY RULE_LAUNCH_COMPILE \"${CCACHE_PROGRAM}\" )\n    set_property( GLOBAL PROPERTY RULE_LAUNCH_LINK \"${CCACHE_PROGRAM}\" )\n    message ( \"found CCACHE (${CCACHE_PROGRAM})\" )\n  endif()\nendif ()\n\nif ( WIN32 )\n  set ( default_deps_dir \"${CMAKE_SOURCE_DIR}/deps\" )\nendif ()\n\nif ( APPLE )\n  set ( MACOS_SDLMAIN_M_PATH \"${CMAKE_SOURCE_DIR}/src/apple/SDLMain.m\" CACHE STRING \"Path to SDLMain.m file\" )\n  option ( CREATE_BUNDLE \"Create a Mac OS application bundle\" ON )\n  if ( NOT EXISTS \"${MACOS_SDLMAIN_M_PATH}\" )\n    message ( FATAL_ERROR \"On Mac OS, SDLMain.m is required. Please set the MACOS_SDLMAIN_M_PATH variable\" )\n  endif ()\nendif ()\n\nset ( DEPS_DIR \"${default_deps_dir}\" CACHE STRING \"Dependencies directory\" )\n\n# Add check for library (SDL_gfx, yaml-cpp )\nif ( IS_DIRECTORY ${DEPS_DIR}/include )\n   include_directories ( SYSTEM ${DEPS_DIR}/include/SDL ${DEPS_DIR}/include/yaml-cpp ${DEPS_DIR}/include )\n   if ( CMAKE_CL_64 )\n     link_directories ( ${DEPS_DIR}/lib/x64 )\n   else ( )\n     link_directories ( ${DEPS_DIR}/lib/Win32 )\n   endif()\n   set( SDL_LIBRARY SDL )\n   set ( SDLGFX_LIBRARY SDL_gfx )\n   set ( SDLMIXER_LIBRARY SDL_mixer )\n   set ( SDLIMAGE_LIBRARY SDL_image )\n   set ( YAMLCPP_LIBRARY yaml-cpp )\n   set ( YAMLCPP_LIBRARY_DEBUG yaml-cppd )\n   add_definitions( -DYAML_CPP_DLL )\nelse ( )\n  find_package ( SDL2 COMPONENTS mixer gfx image)\n  find_package ( Yaml_cpp 0.5.3)\n  set ( YAMLCPP_LIBRARY_DEBUG ${YAMLCPP_LIBRARY} )\n\n  if ( NOT SDL_FOUND )\n    message ( FATAL_ERROR \"Can't find SDL which is required\" )\n  else ()\n    include_directories ( SYSTEM ${SDL_INCLUDE_DIR} )\n    message ( \"found SDL ${SDL_MAJOR}.${SDL_MINOR}.${SDL_MICRO} (${SDL_LIBRARY_DIRS}:${SDL_INCLUDE_DIR})\" )\n  endif ()\n\n  if ( NOT SDLMIXER_FOUND )\n    message ( FATAL_ERROR \"Can't find SDL_mixer which is required\" )\n  else ()\n    include_directories ( SYSTEM ${SDLMIXER_INCLUDE_DIR} )\n    message ( \"found SDL_mixer ${SDL_MIXER_MAJOR}.${SDL_MIXER_MINOR}.${SDL_MIXER_MICRO} (${SDL_MIXER_LIBRARY_DIRS}:${SDLMIXER_INCLUDE_DIR})\" )\n  endif ()\n\n  if ( NOT SDLGFX_FOUND )\n    message ( FATAL_ERROR \"Can't find SDL_gfx which is required\" )\n  else ()\n    include_directories ( SYSTEM ${SDLGFX_INCLUDE_DIR} )\n    message ( \"found SDL_gfx ${SDL_GFX_MAJOR}.${SDL_GFX_MINOR}.${SDL_GFX_MICRO} (${SDL_GFX_LIBRARY_DIRS}:${SDLGFX_INCLUDE_DIR})\" )\n  endif ()\n\n  if ( NOT SDLIMAGE_FOUND )\n    message ( FATAL_ERROR \"Can't find SDL_image which is required\" )\n  else ()\n    include_directories ( SYSTEM ${SDLIMAGE_INCLUDE_DIR} )\n    message ( \"found SDL_image ${SDL_IMAGE_MAJOR}.${SDL_IMAGE_MINOR}.${SDL_IMAGE_MICRO} (${SDL_IMAGE_LIBRARY_DIRS}:${SDLIMAGE_INCLUDE_DIR})\" )\n  endif ()\n\n  if ( NOT YAMLCPP_FOUND )\n    message ( FATAL_ERROR \"Can't find yaml-cpp which is required\" )\n  else ()\n    include_directories ( SYSTEM ${YAMLCPP_INCLUDE_DIR} )\n    message ( \"found yaml-cpp(${YAMLCPP_LIBRARY_DIRS}:${YAMLCPP_INCLUDE_DIR})\" )\n  endif ( NOT YAMLCPP_FOUND )\nendif()\n\n# Find OpenGL\nset (OpenGL_GL_PREFERENCE LEGACY)\nfind_package ( OpenGL )\nif ( NOT OPENGL_FOUND )\n  message ( WARNING \"Can't find OpenGL; how does that even happen?\\n\"\n    \"Continuing building without OpenGL support.\"\n    )\n  add_definitions(-D__NO_OPENGL)\nelse ()\n    include_directories ( SYSTEM ${OPENGL_INCLUDE_DIR} )\n    message ( \"found openGL (${OPENGL_LIBRARIES})\" )\nendif ()\n\n# Resolve backtraces\nif ( WIN32 )\n\tlink_libraries( dbghelp )\nendif ()\nif ( UNIX )\n\tlink_libraries( ${CMAKE_DL_LIBS} )\nendif ()\n\n# Read version number\nset ( file \"${CMAKE_SOURCE_DIR}/src/version.h\" )\nfile ( READ ${file} lines )\nstring ( REGEX MATCH \"[.]*OPENXCOM_VERSION_SHORT \\\"([0-9]).([0-9])\" version_line \"${lines}\" )\nset ( CPACK_PACKAGE_VERSION_MAJOR ${CMAKE_MATCH_1} )\nset ( CPACK_PACKAGE_VERSION_MINOR ${CMAKE_MATCH_2} )\nset ( CPACK_PACKAGE_VERSION_PATCH \"\" )\n\nif ( \"${OPENXCOM_VERSION_STRING}\" STREQUAL \"\" )\n  find_package ( Git )\n  if ( GIT_FOUND )\n    message(\"git found: ${GIT_EXECUTABLE}\")\n    execute_process ( COMMAND ${GIT_EXECUTABLE} describe --dirty\n      WORKING_DIRECTORY ${CMAKE_SOURCE_DIR}\n      OUTPUT_VARIABLE git_describe_out\n      ERROR_VARIABLE git_describe_error\n      RESULT_VARIABLE git_describe_result\n      )\n    string ( REGEX MATCH \"([a-z|0-9|.]*)-([0-9]*)-g([a-z|0-9]*)([-|a-z]*)\" git_commit \"${git_describe_out}\" )\n    set ( git_tag ${CMAKE_MATCH_1} )\n    set ( git_nb_commit ${CMAKE_MATCH_2} )\n    set ( git_commit ${CMAKE_MATCH_3} )\n    set ( git_dirty ${CMAKE_MATCH_4} )\n    set ( OPENXCOM_VERSION_STRING \".${git_commit}${git_dirty}\" )\n  endif()\nendif()\n\nadd_definitions( -DGIT_BUILD=1 )\n\nconfigure_file(\"${CMAKE_SOURCE_DIR}/src/git_version.h.in\" \"${CMAKE_CURRENT_BINARY_DIR}/git_version.h\" )\ninclude_directories ( \"${CMAKE_CURRENT_BINARY_DIR}\" )\n\n\nif ( DEV_BUILD )\n  # Append the commit to version number\n  set ( CPACK_PACKAGE_VERSION_PATCH \"${git_commit}${git_dirty}\" )\n  set ( CPACK_PACKAGE_VERSION \"${CPACK_PACKAGE_VERSION_MAJOR}.${CPACK_PACKAGE_VERSION_MINOR}.${CPACK_PACKAGE_VERSION_PATCH}\" )\nelse ()\n  set ( CPACK_PACKAGE_INSTALL_DIRECTORY \"${CPACK_NSIS_PACKAGE_NAME}\" )\n  set ( CPACK_PACKAGE_VERSION \"${CPACK_PACKAGE_VERSION_MAJOR}.${CPACK_PACKAGE_VERSION_MINOR}\" )\nendif ()\n\nif ( BUILD_PACKAGE )\n  if ( NOT DEV_BUILD )\n    string ( LENGTH \"${git_dirty}\" is_dirty )\n    if ( ${is_dirty} GREATER 0 )\n      message ( FATAL_ERROR \"Release package must be built from a clean tree\" )\n    endif ()\n    if ( \"${CMAKE_BUILD_TYPE}\" STREQUAL \"Debug\" )\n      message ( FATAL_ERROR \"Release package can't be built from a debug build\" )\n    endif ()\n  endif ( )\n\n  if ( NOT CPACK_GENERATOR )\n    set ( CPACK_GENERATOR \"TXZ\" )\n  endif ()\n  if ( NOT CPACK_SOURCE_GENERATOR )\n    set ( CPACK_SOURCE_GENERATOR \"TXZ\" )\n  endif ()\n\n  set ( CPACK_PACKAGE_VENDOR \"The OpenXcom project\" )\n  set ( CPACK_PACKAGE_DESCRIPTION_SUMMARY \"Open-source clone of UFO: Enemy Unknown\" )\n  set ( CPACK_PACKAGE_DESCRIPTION_FILE \"${CMAKE_SOURCE_DIR}/cmake/modules/Description.txt\" )\n  set ( CPACK_RESOURCE_FILE_README \"${CMAKE_SOURCE_DIR}/README.md\" )\n  if ( NOT APPLE )\n    set ( CPACK_RESOURCE_FILE_LICENSE \"${CMAKE_SOURCE_DIR}/LICENSE.txt\" )\n  endif ()\n  set ( CPACK_PACKAGE_CONTACT \"The OpenXcom project (http://www.openxcom.org)\" )\n\n  include ( LinuxDEB )\n  include ( LinuxRPM )\n  include ( nsis )\n  include ( apple )\n  include ( CPack )\n  message ( \"version:${CPACK_PACKAGE_VERSION_MAJOR}.${CPACK_PACKAGE_VERSION_MINOR}.${CPACK_PACKAGE_VERSION_PATCH}\"\n)\nendif()\n\nif ( NOT WIN32 )\n  install(FILES \"${CMAKE_SOURCE_DIR}/res/linux/openxcom.desktop\"\n    DESTINATION \"${CMAKE_INSTALL_FULL_DATAROOTDIR}/applications\")\n  install(FILES \"${CMAKE_SOURCE_DIR}/res/linux/icons/openxcom_48x48.png\"\n    DESTINATION \"${CMAKE_INSTALL_FULL_DATAROOTDIR}/icons/hicolor/48x48/apps\" RENAME openxcom.png)\n  install(FILES \"${CMAKE_SOURCE_DIR}/res/linux/icons/openxcom_128x128.png\"\n    DESTINATION \"${CMAKE_INSTALL_FULL_DATAROOTDIR}/icons/hicolor/128x128/apps\" RENAME openxcom.png)\n  install(FILES \"${CMAKE_SOURCE_DIR}/res/linux/icons/openxcom.svg\"\n    DESTINATION \"${CMAKE_INSTALL_FULL_DATAROOTDIR}/icons/hicolor/scalable/apps\")\nendif ()\n\nadd_subdirectory ( docs )\nadd_subdirectory ( src )\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 34.322265625,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>."
        },
        {
          "name": "README-OSX.md",
          "type": "blob",
          "size": 2.3125,
          "content": "# Building for MacOS\n\n## Dependencies\nTo successfully build an OpenXcom OSX bundle you will need to ensure all the relevant dependencies installed in /usr/local/.\n\nThe dependencies you require are following:\n- cmake, version 3.12.0 or later\n- SDL (libsdl1.2)\n- SDL_mixer (libsdl-mixer1.2)\n- SDL_gfx (libsdl-gfx1.2), version 2.0.22 or later\n- SDL_image (libsdl-image1.2)\n- yaml-cpp, version 0.5 or later\n\nWe recommend using [Homebrew](https://brew.sh) to facilitate this.  With a working brew utility installed, run the following:\n```\n$ brew install cmake yaml-cpp --with-static-lib sdl sdl_gfx sdl_image sdl_mixer --with-flac --with-libmikmod --with-libvorbis --with-static-lib\n```\nThis should install all of these necessary dependencies to their appropriate place under /usr/local.\n\n## Building\nThis project has two ways to build: one with make and the other with Xcode.  The make way is typically used for CI builds and produces a similar artifact as the Linux build.  If you're just looking to get a quick build, this is a good way to do so.  The Xcode way is useful if you're developing features (or bug fixes) and require the need for a debugger or an IDE experience.\n\n### Make\n1. In the root of the repository, generate the Makefile with cmake (Release is also a valid build type):\n```\ncmake -DCMAKE_BUILD_TYPE=Debug -B build .\n```\n1. Copy the vanilla game assets (UFO/TFTD) into the build's `bin/` directory.\n1. Build the project (2 being the number of threads to run):\n```\ncmake --build build -j2\n```\n1. Make sure that you set up your [Data directory](https://github.com/OpenXcom/OpenXcom#directory-locations) properly.\n1. Your artifact will be named `openxcom.app` in the build target directory.\n\n\n### Xcode\n1. In the root of the repository, generate the XCode project file with cmake (Release is also a valid build type):\n```\ncmake -DCMAKE_BUILD_TYPE=Debug -G Xcode -B build .\n```\n1. Open the `OpenXcom.xcodeproj` in Xcode.\n1. Copy the vanilla game assets (UFO/TFTD) into the build's `bin/` directory.\n1. Build with cmd-B\n1. Your artifact will be named `openxcom.app` in the build target directory (Debug or Release).\n\n## Additional Help\nShould you require any further assistance regarding the OSX build - feel free to ask around on the official forums - https://openxcom.org/forum/ or contact us directly on GitHub - [@rcreasey](http://github.com/rcreasey)\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.5927734375,
          "content": "# OpenXcom [![Workflow Status][workflow-badge]][actions-url]\n\n[workflow-badge]: https://github.com/OpenXcom/OpenXcom/workflows/ci/badge.svg\n[actions-url]: https://github.com/OpenXcom/OpenXcom/actions\n\nOpenXcom is an open-source clone of the popular \"UFO: Enemy Unknown\" (\"X-COM:\nUFO Defense\" in the USA release) and \"X-COM: Terror From the Deep\" videogames\nby Microprose, licensed under the GPL and written in C++ / SDL.\n\nSee more info at the [website](https://openxcom.org)\nand the [wiki](https://www.ufopaedia.org/index.php/OpenXcom).\n\nUses modified code from SDL\\_gfx (LGPL) with permission from author.\n\n## Installation\n\nOpenXcom requires a vanilla copy of the X-COM resources -- from either or both\nof the original games.  If you own the games on Steam, the Windows installer\nwill automatically detect it and copy the resources over for you.\n\nIf you want to copy things over manually, you can find the Steam game folders\nat:\n\n    UFO: \"Steam\\SteamApps\\common\\XCom UFO Defense\\XCOM\"\n    TFTD: \"Steam\\SteamApps\\common\\X-COM Terror from the Deep\\TFD\"\n\nDo not use modded versions (e.g. with XcomUtil) as they may cause bugs and\ncrashes.  Copy the UFO subfolders to the UFO subdirectory in OpenXcom's data\nor user folder and/or the TFTD subfolders to the TFTD subdirectory in OpenXcom's\ndata or user folder (see below for folder locations).\n\n## Mods\n\nMods are an important and exciting part of the game.  OpenXcom comes with a set\nof standard mods based on traditional XcomUtil and UFOExtender functionality.\nThere is also a [mod portal website](https://openxcom.mod.io/) with a thriving\nmod community with hundreds of innovative mods to choose from.\n\nTo install a mod, go to the mods subdirectory in your user directory (see below\nfor folder locations).  Extract the mod into a new subdirectory.  WinZip has an\n\"Extract to\" option that creates a directory whose name is based on the archive\nname.  It doesn't really matter what the directory name is as long as it is\nunique.  Some mods are packed with extra directories at the top, so you may\nneed to move files around inside the new mod directory to get things straighted\nout.  For example, if you extract a mod to mods/LulzMod and you see something\nlike:\n\n    mods/LulzMod/data/TERRAIN/\n    mods/LulzMod/data/Rulesets/\n\nand so on, just move everything up a level so it looks like:\n\n    mods/LulzMod/TERRAIN/\n    mods/LulzMod/Rulesets/\n\nand you're good to go!  Enable your new mod on the Options -> Mods page in-game.\n\n## Directory Locations\n\nOpenXcom has three directory locations that it searches for user and game files:\n\n<table>\n  <tr>\n    <th>Folder Type</th>\n    <th>Folder Contents</th>\n  </tr>\n  <tr>\n    <td>user</td>\n    <td>mods, savegames, screenshots</td>\n  </tr>\n  <tr>\n    <td>config</td>\n    <td>game configuration</td>\n  </tr>\n  <tr>\n    <td>data</td>\n    <td>UFO and TFTD data files, standard mods, common resources</td>\n  </tr>\n</table>\n\nEach of these default to different paths on different operating systems (shown\nbelow).  For the user and config directories, OpenXcom will search a list of\ndirectories and use the first one that already exists.  If none exist, it will\ncreate a directory and use that.  When searching for files in the data\ndirectory, OpenXcom will search through all of the named directories, so some\nfiles can be installed in one directory and others in another.  This gives\nyou some flexibility in case you can't copy UFO or TFTD resource files to some\nsystem locations.  You can also specify your own path for each of these by\npassing a commandline argument when running OpenXcom.  For example:\n\n    openxcom -data \"$HOME/bin/OpenXcom/usr/share/openxcom\"\n\nor, if you have a fully self-contained installation:\n\n    openxcom -data \"$HOME/games/openxcom/data\" -user \"$HOME/games/openxcom/user\" -config \"$HOME/games/openxcom/config\"\n\n### Windows\n\nUser and Config folder:\n- C:\\Documents and Settings\\\\\\<user\\>\\My Documents\\OpenXcom (Windows 2000/XP)\n- C:\\Users\\\\\\<user\\>\\Documents\\OpenXcom (Windows Vista/7)\n- \\<game directory\\>\\user\n- .\\user\n\nData folders:\n- C:\\Documents and Settings\\\\\\<user\\>\\My Documents\\OpenXcom\\data (Windows 2000/XP)\n- DATADIR build flag\n- C:\\Users\\\\\\<user\\>\\Documents\\OpenXcom\\data (Windows Vista/7/8)\n- \\<game directory\\>\n- . (the current directory)\n\n### Mac OS X\n\nUser and Config folder:\n- $XDG\\_DATA\\_HOME/openxcom (if $XDG\\_DATA\\_HOME is defined)\n- $HOME/Library/Application Support/OpenXcom\n- $HOME/.openxcom\n- ./user\n\nData folders:\n- $XDG\\_DATA\\_HOME/openxcom (if $XDG\\_DATA\\_HOME is defined)\n- $HOME/Library/Application Support/OpenXcom (if $XDG\\_DATA\\_HOME is not defined)\n- DATADIR build flag\n- $XDG\\_DATA\\_DIRS/openxcom (for each directory in $XDG\\_DATA\\_DIRS if $XDG\\_DATA\\_DIRS is defined)\n- /Users/Shared/OpenXcom (if $XDG\\_DATA\\_DIRS is not defined or is empty)\n- . (the current directory)\n\n### Linux\n\nUser folder:\n- $XDG\\_DATA\\_HOME/openxcom (if $XDG\\_DATA\\_HOME is defined)\n- $HOME/.local/share/openxcom (if $XDG\\_DATA\\_HOME is not defined)\n- $HOME/.openxcom\n- ./user\n\nConfig folder:\n- $XDG\\_CONFIG\\_HOME/openxcom (if $XDG\\_CONFIG\\_HOME is defined)\n- $HOME/.config/openxcom (if $XDG\\_CONFIG\\_HOME is not defined)\n\nData folders:\n- $XDG\\_DATA\\_HOME/openxcom (if $XDG\\_DATA\\_HOME is defined)\n- $HOME/.local/share/openxcom (if $XDG\\_DATA\\_HOME is not defined)\n- DATADIR build flag\n- $XDG\\_DATA\\_DIRS/openxcom (for each directory in $XDG\\_DATA\\_DIRS if $XDG\\_DATA\\_DIRS is defined)\n- /usr/local/share/openxcom (if $XDG\\_DATA\\_DIRS is not defined or is empty)\n- /usr/share/openxcom (if $XDG\\_DATA\\_DIRS is not defined or is empty)\n- the directory data files were installed to\n- . (the current directory)\n\n## Configuration\n\nOpenXcom has a variety of game settings and extras that can be customized, both\nin-game and out-game. These options are global and affect any old or new\nsavegame.\n\nFor more details please check the [wiki](https://ufopaedia.org/index.php/Options_(OpenXcom)).\n\n## Development\n\nOpenXcom requires the following developer libraries:\n\n- [SDL](https://www.libsdl.org) (libsdl1.2)\n- [SDL\\_mixer](https://www.libsdl.org/projects/SDL_mixer/) (libsdl-mixer1.2)\n- [SDL\\_gfx](https://www.ferzkopp.net/wordpress/2016/01/02/sdl_gfx-sdl2_gfx/) (libsdl-gfx1.2), version 2.0.22 or later\n- [SDL\\_image](https://www.libsdl.org/projects/SDL_image/) (libsdl-image1.2)\n- [yaml-cpp](https://github.com/jbeder/yaml-cpp), version 0.5.3 or later\n\nThe source code includes files for the following build tools:\n\n- Microsoft Visual C++ 2010 or newer\n- Xcode\n- Make (see Makefile.simple)\n- CMake\n\nIt's also been tested on a variety of other tools on Windows/Mac/Linux. More\ndetailed compiling instructions are available at the\n[wiki](https://ufopaedia.org/index.php/Compiling_(OpenXcom)), along with\npre-compiled dependency packages.\n"
        },
        {
          "name": "Run-Win32-Debug.bat",
          "type": "blob",
          "size": 0.0537109375,
          "content": "@cd bin\\Win32\n@start Debug\\OpenXcom.exe -data \"..\\data\""
        },
        {
          "name": "Run-Win32-Release.bat",
          "type": "blob",
          "size": 0.0556640625,
          "content": "@cd bin\\Win32\n@start Release\\OpenXcom.exe -data \"..\\data\""
        },
        {
          "name": "Run-Win64-Debug.bat",
          "type": "blob",
          "size": 0.0517578125,
          "content": "@cd bin\\x64\n@start Debug\\OpenXcom.exe -data \"..\\data\""
        },
        {
          "name": "Run-Win64-Release.bat",
          "type": "blob",
          "size": 0.0537109375,
          "content": "@cd bin\\x64\n@start Release\\OpenXcom.exe -data \"..\\data\""
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "cmake",
          "type": "tree",
          "content": null
        },
        {
          "name": "deps",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "install",
          "type": "tree",
          "content": null
        },
        {
          "name": "obj",
          "type": "tree",
          "content": null
        },
        {
          "name": "res",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}