{
  "metadata": {
    "timestamp": 1736565353560,
    "page": 181,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "oclint/oclint",
      "stars": 3788,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.3955078125,
          "content": "# Optional modules\noclint-json-compilation-database/\noclint-xcodebuild/\n\n# Third-party dependencies and build directory\ngoogletest/\nllvm/\nbuild/\noclint-scripts/llvm.sh\n\n# Compile Commands\ncompile_commands.json\n\n# Compiled Object files\n*.slo\n*.lo\n*.o\n\n# Compiled Dynamic libraries\n*.so\n*.dylib\n\n# Compiled Static libraries\n*.lai\n*.la\n*.a\n\n# Compiled Python Objects\n*.pyc\n\n# System files\n.DS_Store\n.vscode/\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.6484375,
          "content": "Copyright (C) 2010-2014 Longyi Qi and the OCLint project contributors.\nCopyright (C) 2015-2018 Ryuichi Laboratories and the OCLint project contributors.\nCopyright (C) 2019-2022 Ryuichi Intellectual Property and the OCLint project contributors.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n* Neither the name of the author nor the names of its contributors may be used\n  to endorse or promote products derived from this software without specific\n  prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 0.7890625,
          "content": "# OCLint - https://oclint.org\n\n[![GitHub Actions Status](https://github.com/oclint/oclint/workflows/Builds/badge.svg?branch=master)](https://github.com/oclint/oclint/actions)\n\nOCLint is a static code analysis tool for improving quality and reducing defects\nby inspecting C, C++ and Objective-C code.\n\nIt looks for potential problems that aren't visible to compilers, for example:\n\n* Possible bugs - empty if/else/try/catch/finally statements\n* Unused code - unused local variables and parameters\n* Complicated code - high cyclomatic complexity, NPath complexity and high NCSS\n* Redundant code - redundant if statement and useless parentheses\n* Code smells - long method and long parameter list\n* Bad practices - inverted logic and parameter reassignment\n* ...\n\nFor more information, visit https://oclint.org\n"
        },
        {
          "name": "oclint-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "oclint-driver",
          "type": "tree",
          "content": null
        },
        {
          "name": "oclint-metrics",
          "type": "tree",
          "content": null
        },
        {
          "name": "oclint-reporters",
          "type": "tree",
          "content": null
        },
        {
          "name": "oclint-rules",
          "type": "tree",
          "content": null
        },
        {
          "name": "oclint-scripts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}