{
  "metadata": {
    "timestamp": 1736565838620,
    "page": 777,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjc4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ncmpcpp/ncmpcpp",
      "stars": 2167,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1875,
          "content": "*.o\nGTAGS\nGRTAGS\nTAGS\nMakefile\nMakefile.in\naclocal.m4\nautom4te.cache/\ncompile\nconfig.*\nconfigure\ndepcomp\n**/.dirstamp\ninstall-sh\nlibtool\nltmain.sh\nmissing\n**.m4\n**/.deps/\nsrc/ncmpcpp\nstamp-h1\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 1.6865234375,
          "content": "Adrian Kowalski <adpkow@gmail.com>\nAlexander Lopatin <sbar.geek@gmail.com>\nAlexey Semenko <igogo.dev@gmail.com>\nAndreas Rammhold <andreas@rammhold.de>\nAndrzej Rybczak <andrzej@rybczak.net>\nAnton Simakov <ttohin@gmail.com>\nArnaud Guignard <aguignard@gmail.com>\nAsa Sourdiffe <asourdiffe@gmail.com>\nBenoît Dardenne <benoit.dardenne@gmail.com>\nBenoit Pierre <benoit.pierre@gmail.com>\nbrezerk <brezerk@gmail.com>\nChris Gregory <czipperz@gmail.com>\nCzipperz <czipperz@gmail.com>\nDamien Leone <damien.leone@fensalir.fr>\nDaniel <quite@hack.org>\nDarby Payne <darby.payne@gmail.com>\nDavid Coppa <dcoppa@gmail.com>\nDmitriy Kusterskiy <dimykus@gmail.com>\nEric Izoita <ericizoita@gmail.com>\nFrank Blendinger <fb@intoxicatedmind.net>\ngreenbagels <greenbagels@teknik.io>\nHamuko <hamuko@burakku.com>\nHugh Wang <hghwng@gmail.com>\nJacek Sowiński <mruwek.fs@vcf.pl>\nJames Pike <jpike@chilon.net>\nJan Palus <jan.palus@gmail.com>\nJesse Kleve <jesse.kleve@gmail.com>\njgr <jgr006@gmail.com>\nJohn Fresco <john.fresco@utah.edu>\nLarson Carter <larsoncarter@blazermail.net>\nLennart Braun <lenerd@posteo.de>\nMaarten de Vries <maarten@de-vri.es>\nMarc Jessome <marc.jessome@gmail.com>\nMatthew Hague <matthewhague@zoho.com>\nMax Kellermann <max@duempel.org>\nMichaël Cadilhac <michael@cadilhac.name>\nMoritz Lipp <mlq@pwmt.org>\nNeeds <needs@mailoo.org>\nPawel Tomak <pawel.tomak@gmail.com>\nQball Cow <qball@QDesk.site>\nRaghavendra D Prabhu <rprabhu@wnohang.net>\nSam Simmons <sam@samiconductor.com>\nSebastian Peters <koelnconcert@googlemail.com>\nsphaugh <sean.haugh@emerson.com>\nTrygve Aaberge <trygveaa@gmail.com>\nWieland Hoffmann <themineo@gmail.com>\nWojciech Siewierski <wojciech.siewierski@onet.pl>\nYannick LM <yannicklm1337@gmail.com>\nV <v@anomalous.eu>\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 28.8759765625,
          "content": "# ncmpcpp-0.10.1 (2024-10-24)\n* Fix compilation with `libc++`.\n* Remove `autogen.sh` in favour of `autoreconf`.\n* Do not crash when trying to reverse an empty playlist.\n\n# ncmpcpp-0.10 (2024-09-03)\n* Add the configuration option `mpd_password`.\n* Separate chunks of lyrics with a double newline.\n* Fix separator between albums with the same name, to check for album artist\n  instead of artist.\n* Column widths are now configurable via `media_library_column_width_ratio_two`,\n  `media_library_column_width_ratio_three` and\n  `playlist_editor_column_width_ratio`.\n* Removed deprecated `visualizer_fifo_path` and `visualizer_sync_interval`\n  options.\n* Added support for italic text.\n* Framerate limit for visualizer was removed.\n* Performer tag is now read from the `TPE4` frame instead of `TPE3`.\n* Potential crash when fetching lyrics for streams in the background was fixed.\n* Seeking now accepts the `hh:mm:ss` format.\n* Tag editor now only writes to files with modified tags.\n* Column view can now display full filepaths.\n* Updated the list of working lyrics fetchers.\n* Add `visualizer_spectrum_smooth_look_legacy_chars` option (enabled by default)\n  for potentially improved bottom part of the spectrum visualizer in terminals\n  with transparent background.\n* Add support for fetching lyrics from tags.\n\n# ncmpcpp-0.9.2 (2021-01-24)\n* Revert suppression of output of all external commands as that makes e.g album\n  art addons no longer work.\n* Gracefully handle failures when asking for a password.\n\n# ncmpcpp-0.9.1 (2020-12-23)\n* Add support for fetching lyrics from musixmatch.com.\n* Fix intermittent failures of the Genius fetcher.\n* Fix crash on startup with Visualizer as the initial screen.\n* Fix crash on startup with Browser as the initial screen.\n* Show the Visualizer immediately if it's the initial screen.\n* Draw a separator between albums with the same name, but a different artist.\n* Suppress output of all external commands.\n* Consider mouse support when pausing and unpausing curses interface.\n* Reduce CPU usage of the frequency spectrum visualizer.\n* Enable Link Time Optimization by default.\n* Enable full sorting of items in the local browser if it's not.\n* Bind `Play` to `Backspace` by default.\n* Fix fetching information about artists from last.fm.\n\n# ncmpcpp-0.9 (2020-12-20)\n* Fix various Mopidy specific bugs.\n* Add `run_external_console_command` action for running terminal applications.\n* Pass lyrics filename in single quotes to shell.\n* Add support for fetching lyrics from zeneszoveg.hu.\n* Add `Play` action for starting playback in stopped state.\n* Properly expand `~` in mpd_host when preceded by a password.\n* Add support for `message_delay_time` equal to 0.\n* Add support for album only view in the Media Library.\n* Add `random_exclude_pattern` option to a configuration file.\n* Add `connected_message_on_startup` option to a configuration file.\n* Fix compilation with GCC 10.\n* Remove Lyricwiki fetcher as the site closed down.\n* Remove Lyricsmania fetcher as it no longer works.\n* Fix Genius and Tekstowo fetchers.\n* Add dedicated `Load` action for loading playlists.\n* Add `media_library_hide_album_dates` option to a configuration file.\n* Improve look of the frequency spectrum visualizer.\n* Add `visualizer_spectrum_smooth_look`, `visualizer_spectrum_dft_size`,\n  `visualizer_spectrum_gain`, `visualizer_spectrum_hz_min` and\n  `visualizer_spectrum_hz_max` options to a configuration file for controlling\n  the look of the new spectrum visualizer.\n* Add `visualizer_autoscale` option to a configuration file.\n* Add `visualizer_fps` option to a configuration file (60 by default).\n* Allow for editing multiple titles in the Tag Editor.\n* Support gstreamer's udpsink as a data source for visualization (Mopidy).\n* Deprecate `visualizer_fifo_path` in favor of `visualizer_data_source`.\n* Don't run volume changing actions if there is no mixer.\n* Do not loop after sending a database update command to Mopidy.\n* Deprecate `visualizer_sync_interval` configuration option.\n* Deprecate `noop` value of `browser_sort_mode` in favor of `none`.\n* Add `type` value of `browser_sort_mode` (set by default).\n* Prefer `$XDG_CONFIG_HOME/ncmpcpp` as a folder with configuration.\n\n# ncmpcpp-0.8.2 (2018-04-11)\n* Help screen: fixed display of EoF keycode\n* Fixed possible integer overflow when resizing screen\n* Fixed fetching lyrics from lyricsmania.com, metrolyrics.com and sing365.com\n* Search engine now properly interacts with filtering\n* Fixed redraw of separator after interface switch while MPD was stopped\n* Reset position of a window when fetching lyrics\n* Fixed compilation with ICU >= 61.\n\n# ncmpcpp-0.8.1 (2017-10-11)\n* Setting `colors_enabled` to `no` no longer results in a crash.\n* Using `--quiet` command line argument no longer results in a crash.\n* If songs in media library have no track numbers, sort them by their display format.\n* Fixed a situation in which songs added to playlist from media library or playlist editor screens would not be immediately marked as such.\n* Do not start prompt with the current search constraint when applying a new one.\n\n# ncmpcpp-0.8 (2017-05-21)\n* Configuration variable `execute_on_player_state_change` was added.\n* Support for controlling whether ncmpcpp should display multiple tags as-is or make an effort to hide duplicate values (show_duplicate_tags configuration variable, enabled by default).\n* Support for filtering of lists was brought back from the dead.\n* Require C++14 compatible compiler during compilation.\n* Lyrics from files containing DOS line endings now load properly on Linux.\n* Added support for fetching lyrics from genius.com.\n* Added support for fetching lyrics from tekstowo.pl.\n* The list of lyrics fetchers can now be set via configuration file.\n* Lyrics can now be fetched for songs with no tags.\n* libcurl dependency is no longer optional.\n* When an attempt to write tags fails, show detailed error message.\n* Support for fetching lyrics for selected items in background was added.\n* Application will now exit if stdin is closed.\n* Configuration variable `visualizer_sample_multiplier` was deprecated and will be removed in 0.9.\n* Wide character version of ncurses is now required.\n* Added `statusbar_time_color` and `player_state_color` configuration variables for further customization of statusbar.\n* Setting foreground color only now preserves current background color.\n* Format information can now be attached to selected color variables in the configuration file. Because of that variable `progressbar_boldness` is now deprecated in favor of extended `progressbar_color` and `progressbar_elapsed_color` (for more information see example configuration file).\n* Lyrics and last_fm can now be startup screens and are lockable.\n* Action `update_environment` now also synchronizes status with MPD.\n* Fixed an issue that could cause some MPD events to be missed.\n* Action `jump_to_playing_song` is not runnable now if there is no playing song.\n* Fixed fetching artist info in language other than English.\n* Added test that checks if lyrics fetchers work (available via command line parameter --test-lyrics-fetchers).\n* Fixed fetching lyrics from justsomelyrics.com.\n* Added support for fetching lyrics from jah-lyrics.com and plyrics.com.\n* Seek immediately after invoking appropriate action once.\n* Added support for locating current song in playlist editor.\n* Disable autocenter mode while searching and filtering.\n* Added `--quiet` comand line argument that supresses messages shown at startup.\n* Multiple songs in Media library are now added to playlist in the same order they are displayed.\n* Added configuration option `media_library_albums_split_by_date` that determines whether albums in media library should be split by date.\n* Added configuration option `ignore_diacritics` that allows for ignoring diacritics while searching (boost compiled with ICU support is required).\n* Added support for reading multiple bindings files (the ones in ~/.ncmpcpp/bindings and $XDG_CONFIG_HOME/ncmpcpp/bindings are read by default).\n* `main_window_highlight_color` and `active_column_color` configuration options are now deprecated in favor of `current_item_prefix`/`current_item_suffix` and `current_item_inactive_column_prefix`/`current_item_inactive_column_suffix` (note that now highlight of inactive column is customizable instead of the active one in presence of multiple columns).\n\n# ncmpcpp-0.7.7 (2016-10-31)\n* Fixed compilation on 32bit platforms.\n\n# ncmpcpp-0.7.6 (2016-10-30)\n* Fixed assertion failure on trying to search backwards in an empty list.\n* Updated installation instructions in INSTALL file.\n* Make sure that stream of random numbers is not deterministic.\n* Opening playlist editor when there is no MPD playlists directory no longer freezes the application.\n* Added info about behavior of MPD_HOST and MPD_PORT environment variables to man page.\n* Tilde will now be expanded to home directory in visualizer_fifo_path, execute_on_song_change and external_editor configuration variables.\n* Fixed lyricwiki and justsomelyrics fetchers.\n\n# ncmpcpp-0.7.5 (2016-08-17)\n* Action chains can be now used for seeking.\n* Fixed fetching artist info from last.fm.\n* Default value of regular_expressions was changed from `basic` to `perl` to work around boost issue (#12222).\n* Fixed crash occuring when searching backward in an empty list.\n\n# ncmpcpp 0.7.4 (2016-04-17)\n* Fetching lyrics from lyricwiki.org was fixed.\n* Configure script now continues without errors if ICU library was not found.\n\n# ncmpcpp 0.7.3 (2016-01-20)\n* Home and End keys are now recognized in a few specific terminal emulators.\n\n# ncmpcpp-0.7.2 (2016-01-16)\n* Attempt to add non-song item to playlist from search engine doesn't trigger assertion failure anymore.\n* Fetching lyrics from metrolyrics.com was fixed.\n* Alternative UI separator color is now respected regardless of the header_visibility flag.\n\n# ncmpcpp-0.7.1 (2016-01-01)\n* Selected songs in media library can now be added to playlists.\n* Confirmation before shuffling a playlist can now be disabled.\n\n# ncmpcpp-0.7 (2015-11-22)\n* Playlist sorting dialog now contains `Album artist` option.\n* Default keybindings were corrected to allow tag edition in the right column of tag editor.\n* Mouse is properly kept disabled if it was disabled in the configuration file.\n\n# ncmpcpp-0.6.8 (2015-11-11)\n* Application is now compatible with MPD >= 0.20.\n* Check for readline library was fixed.\n\n# ncmpcpp-0.7_beta1 (2015-11-04)\n* Visualizer has now support for multiple colors (visualizer_color configuration variable takes the list of colors to be used).\n* Visualizer has now support for two more modes: sound wave filled and sound ellipse.\n* Visualizer's spectrum mode now scales better along with window's width.\n* It is now possible to abort the current action using Ctrl-C or Ctrl-G in prompt mode. As a result, empty value is no longer a special value that aborts most of the actions.\n* Directories and playlists in browser can now be sorted by modification time.\n* ~ is now expanded to home directory in mpd_host configuration variable.\n* It is now possible to define startup slave screen using -S/--slave-screen command line option or startup_slave_screen configuration variable.\n* List filtering has been removed due to the major part of its functionality overlapping with find forward/backward and obscure bugs.\n* Find backward/forward function is now incremental.\n* Support for 256 colors and customization of background colors has been added.\n* Multiple configuration files via command line arguments are now accepted. In addition, by default ncmpcpp attempts to read both $HOME/.ncmpcpp/config and $XDG_CONFIG_HOME/ncmpcpp/config (in this order).\n* Support for PDCurses has been removed due to the library being unmaintained and buggy.\n* Current MPD host may now be shown in playlist (playlist_show_mpd_host configuration variable, disabled by default).\n* Random album artists can now be added to the playlist.\n* Case insensitive searching is now Unicode aware as long as boost was compiled with ICU support.\n* Searching with regular expressions is now enabled by default.\n* Support for the Perl regular expression syntax was added.\n* BOOST_LIB_SUFFIX configure variable is now empty by default.\n* Shuffle function now shuffles only selected range if selection in playlist is active.\n* NCurses terminal sequence escaping is no longer used as it's not accurate enough.\n* Selecting items no longer depends on space mode and is bound by default to Insert key.\n* Support for Alt, Ctrl and Shift modifiers as well as Escape key was added.\n* Action that updates the environment can now be used in bindings configuration file.\n* Monolithic `press_space` action was split into `add_item_to_playlist`, `toggle_lyrics_update_on_song_change` and `toggle_visualization_type`.\n* Monolithic `press_enter` action was split into `enter_directory`, `play_item`, `run_action` and `toggle_output`.\n* Sorting actions were rebound to Ctrl-S.\n* Support for range selection was added (bound to Ctrl-V by default). In addition, sorting, reversing and shuffling items in playlist now works on ranges.\n* Support for selecting found items was added (bound to Ctrl-_ by default).\n* Tracks in media library are now properly sorted for track numbers greater than 99.\n* Value of `visualizer_sync_interval` is now restricted to be greater than 9.\n* Output of the visualizer now scales automatically as long as `visualizer_sample_multiplier` is set to 1.\n* Command line switch that prints current song to the standard output is available once again.\n* Defined action chains are now shown in help screen.\n* Action chains for selecting an item and scrolling up/down are now bound to Shift-Up and Shift-Down respectively.\n\n# ncmpcpp-0.6.7 (2015-09-12)\n* Fetching artist info from last.fm was fixed.\n\n# ncmpcpp-0.6.6 (2015-09-07)\n* A typo in the example configuration file was fixed.\n* Fetching lyrics from lyricwiki.com was fixed.\n\n# ncmpcpp-0.6.5 (2015-07-05)\n* Description of mouse wheel usage on volume is now correct.\n* Configure script now fails if either readline or pthread specific headers are not present.\n* Searching in text fields now respects regular expression configuration.\n* When numbering tracks in tag editor all the other track tags are discarded.\n* Xiph tag DESCRIPTION is now rewritten as COMMENT when updating tags.\n* Possible access of already freed memory when downloading artist info is fixed.\n* Name of an item is now displayed correctly if present.\n* Assertion failure when resizing terminal window with no active MPD connection is fixed.\n* Lyrics fetchers were updated to work with sites that changed their HTML structure.\n\n# ncmpcpp-0.6.4 (2015-05-02)\n* Fix title of a pop-up which shows during adding selected items to the current playlist.\n* Correctly deal with leading separator while parsing filenames in tag editor.\n* Fix initial incorrect window size that was occuring in some cases.\n* Unknown and invalid configuration options can now be ignored using command line option `ignore-config-errors`.\n\n# ncmpcpp-0.6.3 (2015-03-02)\n* Fix floating point exception when adding a specific number of random items.\n* Passwords are no longer added to the input history.\n* It is now possible to put more than one specific flag consecutively in formats.\n* Bash completion file was removed as it no longer works.\n* Description of available configuration options in man page was updated.\n\n# ncmpcpp-0.6.2 (2014-12-13)\n* Delete key now aditionally binds by default to action that deletes files in browser.\n* Fix incremental seeking so that it doesn't reset after 30 seconds.\n\n# ncmpcpp-0.6.1 (2014-11-06)\n* Comment tag is now properly written to mp3 files.\n* Only ID3v2.4 tags are now saved to mp3 files.\n* Mouse scrolling with newer ncurses API now works properly.\n* Adding songs from an album in media library now works properly with fetch delay.\n* Adding songs from a playlist in playlist editor now works properly with fetch delay.\n* Trying to fetch lyrics from an empty list doesn't crash the application anymore.\n\n# ncmpcpp-0.6 (2014-10-25)\n* Feature `locate song` no more has a chance to crash the program.\n* Following lyrics of current song now works properly with consume mode active.\n* Deletion of empty playlists in playlist editor now works properly.\n* Toggling consume mode with crossfade mode active displays proper info.\n* Support for regular expressions works properly now.\n\n# ncmpcpp-0.6_beta5 (2014-10-04)\n* Corrupted tags no longer cause assertion failures.\n* MPD connection attempts are now made at most once per second.\n* Deletion of playlists in both browser and playlist editor is now properly handled.\n* Various actions no longer cause the program to crash when invoked with empty playlist.\n\n# ncmpcpp-0.6_beta4 (2014-09-19)\n* Jumping to current song in playlist doesn't trigger assertion failures anymore.\n* Readline's completion feature is now properly disabled.\n\n# ncmpcpp-0.6_beta3 (2014-09-14)\n* Handling of server events has been improved.\n* Readline now ignores escape key.\n* Cropping a playlist now works only if its length is bigger than 1.\n* Browser and media library sorting now works properly with filtering.\n* Compilation with boost-1.56 has been fixed.\n* Configuration option visualizer_type now accepts \"spectrum\" value.\n* Configuration option autocenter_mode is now properly read.\n* Configuration option visualizer_sample_multiplier now accepts all positive numbers.\n* Documentation was updated to reflect the changes.\n* Mouse event handling in media library now works properly.\n* ncmpcpp now works properly with password protected server.\n* Data fetching delay in media library and playlist editor is now optional.\n\n# ncmpcpp-0.6_beta2 (2014-09-03)\n* Fixed the issue that prevented MPD flags toggling from working properly.\n* Song change event is now properly handled after song ends with consume flag active.\n* ncmpcpp now operates in raw terminal mode and ignores SIGINT.\n* Separators between columns in media library, playlist editor and tag editor are now reliably colored.\n* Build failures due to the missing include are now fixed.\n* Playlist cropping now works as expected if no item is selected.\n\n# ncmpcpp-0.6_beta1 (2014-09-03)\n* Support for polling communication mode has been removed. Additionally, MPD version >= 0.16 is required.\n* Keybinding system has been redesigned: \"keys\" file is now deprecated; \"bindings\" file is used instead. It has support for many features, including binding to non-ascii characters and macros.\n* Support for readline library was added.\n* Browser has support for custom sort format.\n* Playlist has support for MPD priorities.\n* Media library can be sorted by modification time.\n* Visualizer's frequency spectrum was adjusted to look more pleasant.\n* Broken compatibility of various actions with filtered lists has been corrected.\n* Tons of other small changes and improvements were made.\n\n# ncmpcpp-0.5.10 (2012-04-01)\n* fix compilation with gcc 4.7\n* fix building without curl support\n\n# ncmpcpp-0.5.9 (2012-03-17)\n* new feature: support for fetching lyrics for currently playing song in background\n* new feature: support for stereo visualization\n* new feature: support for merging screens together\n* playlist editor: add support for columns display mode\n* settings: provide a way to use alternative location for configuration file\n* settings: make characters used in visualizer customizable\n* lyrics fetcher: add support for lololyrics.com\n* various bugfixes\n\n# ncmpcpp-0.5.8 (2011-10-11)\n* lyrics fetcher: add support for justsomelyrics.com\n* add command line switch -s/--screen for switching screen at startup\n* add proper support for asx/cue/m3u/pls/xspf playlists\n* bugfixes\n\n# ncmpcpp-0.5.7 (2011-04-21)\n* convert input path to utf8 before calling `add` command\n* extras: add program that copies Artist to AlbumArtist for mp3/ogg/flac files\n* lyrics fetcher: add support for lyricsvip.com\n* lyrics fetcher: skip lyricwiki if there's licence restriction on lyrics\n* tag editor: do not convert filenames back to utf8 while reading files using taglib\n* search engine: fix error occuring while trying to select first album in results\n\n# ncmpcpp-0.5.6 (2011-01-02)\n* settings: make displaying `empty tag` entry optional\n* bugfixes\n\n# ncmpcpp-0.5.5 (2010-08-04)\n* new feature: select album around cursor\n* new feature: `replay` function\n* fixed feature: display separators between albums\n* playlist: support for adding last.fm streams\n* browser: support for operations on m3u playlists not created by MPD\n* browser: support for deleting group of selected items\n* media library: show songs with primary tag unspecified\n* lyrics: new fetching system\n* lyrics: support for storing lyrics in song's directory\n* artist info: support for preffered language\n* settings: support for custom visualization color\n* settings: support for `empty` part of progressbar in progressbar_look\n* settings: new config option: titles_visibility\n* song format: support for limiting maximal length of a tag\n* a lot of minor fixes\n\n# ncmpcpp-0.5.4 (2010-06-03)\n* new feature: toggle bitrate visibility at runtime\n* new feature: locate song in tag editor\n* new feature: separators between albums in playlist\n* new feature: customizable columns' names\n* new feature: support for multiple tag types in one column\n* media library: support for \"All tracks\" option in middlle column\n* playlist: shorten units' names displayed in statusbar\n* browser: critical bugfix in feature \"remove directory physically from hdd\"\n* a few other bugfixes\n\n# ncmpcpp-0.5.3 (2010-04-04)\n* new feature: new movement keys: {Up,Down}{Album,Artist}\n* new feature: make displaying volume level in statusbar optional\n* new feature: jump from browser to playlist editor\n* bugfixes\n\n# ncmpcpp-0.5.2 (2010-02-26)\n* bugfixes\n\n# ncmpcpp-0.5.1 (2010-02-15)\n* new feature: customizable startup screen\n* new feature: locate song in media library\n* new feature: support for built-in mpd searching in search engine\n* new feature: support for adding random artists/albums to playlist\n* new feature: support for album artist tag\n* new feature: support for switching between user-defined sequence of screens\n* new feature: discard column colors if item is selected (optional)\n* new feature: support for adding tracks to playlist after highlighted item\n* make displaying dates of albums in media library optional\n* several bugfixes\n\n# ncmpcpp-0.5 (2009-12-31)\n* bash completion support\n* libmpdclient2 support\n* \"idle\" command support\n* new screen: mpd server info\n* new feature: sort songs in browser by mtime\n* new feature: lyrics \"refreshing\"\n* new feature: toggle replay gain mode\n* new feature: support for centered cursor\n* new feature: add selected items to playlist at given position\n* playlist: support for range sort/reverse\n* tag editor: support for numerating tracks using xx/xx format\n* a lot of minor fixes\n\n# ncmpcpp-0.4.1 (2009-10-03)\n* support for writing performer, composer and disc tags into ogg and flac files\n* support for custom prefix/suffix of now playing song\n* support for system charset encoding autodetection\n* support for underlined text\n* optimizations and bugfixes\n\n# ncmpcpp-0.4 (2009-09-09)\n* new screen: music visualizer with sound wave/frequency spectrum modes\n* new feature: alternative user interface\n* new feature: command line switch for displaying now playing song\n* new feature: support for fixed size and/or right aligned columns\n* new feature: display bitrate of current song in statusbar (optional)\n* new feature: display remaining time of current song instead of elapsed (optional)\n* new feature: jump to now playing song at start (enabled by default)\n* new feature: additional attributes for columns\n* song format: support for nested braces\n* support for colors in song_status_format\n* customizable progressbar look\n* mouse support for additional windows\n* optional user prompting before clearing main playlist\n* track and year tag are not limited to numbers anymore if mp3 files are edited\n* marker for full filename (F) has been replaced with directory (D)\n* a lot of other minor improvements and bugfixes\n\n# ncmpcpp-0.3.5 (2009-06-24)\n* new feature: custom command execution on song change\n* new feature: allow for physical files and directories deletion\n* new feature: add local directories recursively\n* new feature: add random songs to playlist\n* new feature: mouse support\n* new screen: outputs\n* text scrolling in header was made optional\n* some bugfixes\n\n# ncmpcpp-0.3.4 (2009-05-19)\n* new feature: search in help, lyrics and info screen\n* new feature: two columns view in media library\n* new feature: input box history\n* make displaying hidden files in local browser optional\n* bugfixes\n\n# ncmpcpp-0.3.3 (2009-04-02)\n* new feature: cyclic scrolling\n* support for single mode (requires >=mpd-0.15_alpha*)\n* support for consume mode (requires >=mpd-0.15_alpha*)\n* support for pdcurses library\n* support for WIN32\n* improvements and bugfixes\n\n# ncmpcpp-0.3.2 (2009-03-17)\n* new feature: locate currently playing song in browser\n* new feature: stop playing after current song\n* new feature: move item(s) in playlist to actual cursor's position\n* new feature: reverse playlist's order\n* support for external console editor\n* support for multiple composer, performer and disc tags\n* support for basic and extended regular expressions\n* make blocking search constraints after succesful searching optional\n* improved searching in screens\n* minor improvements and bugfixes\n\n# ncmpcpp-0.3.1 (2009-02-23)\n* support for columns in browser and search engine\n* support for lyricsplugin database\n* support for any tag in search engine\n* support for ignoring leading \"the\" word while sorting (optional)\n* new feature: apply filter to screen (Ctrl-F by default)\n* new feature: playlist sorting (Ctrl-V by default)\n* new feature: open lyrics in external editor\n* other minor improvements and bugfixes\n\n# ncmpcpp-0.3 (2009-01-22)\n* general core rewrite\n* new screen - clock\n* support for asian wide characters\n* support for non-utf8 encodings\n* a lot of bugfixes\n\n# ncmpcpp-0.2.5 (2008-12-05)\n* support for unix domain sockets\n* support for adding to playlist files outside mpd music directory (requires mpd >= 0.14_alpha*)\n* support for browsing local directories tree (requires mpd >= 0.14_alpha*)\n* support for searching in current playlist\n* many bugfixes\n\n# ncmpcpp-0.2.4 (2008-10-12)\n* fixed bug with not null terminated strings on mac os x\n* support for renaming files in tiny tag editor\n* support for editing composer, performer and disc tag in mp3 files\n* support for user defined base seek time\n* support for user defined tag type in left column of media library\n* support for user defined display format in album column of media library\n* support for basic mpc commands and command line arguments\n* adding items to playlist can be done like in ncmpc\n* fetching lyrics and artist's info doesn't lock ncmpcpp anymore\n* changed place of storing config files\n* list of recently used patterns in tag editor is now remembered\n\n# ncmpcpp-0.2.3 (2008-09-20)\n* new screen - complex tag editor (with albums/directories view)\n* brand new song info screen (old one removed)\n* support for renaming files and directories\n* support for reading tags from filename\n* support for editing artist and album in media library\n* support for playlist renaming\n* support for following lyrics of now playing song\n* support for fetching artist's info from last.fm\n* fixed compilation for Mac OS X and *BSD\n* fixed compilation for older gcc versions\n* extended configuration (e.g. all colors can be user-defined)\n* `repeat one song` mode works with random mode now\n* incremental seeking (old behaviour is still available through config)\n* a bunch of fixes and improvements\n\n# ncmpcpp-0.2.2 (2008-09-05)\n* new screen - playlist editor\n* new playlist view - columns\n* playlist view switcher added (key 'p' by default)\n* find function modes added (wrapped/normal, switch is 'w' by default)\n* albums in media library sorted by year (and it's also displayed)\n* multiple items selection support and related functions added\n* playlists management support\n* new function - \"go to dir containing selected song\" (key 'G' by default)\n* moving items improved\n* lots of minor fixes\n\n# ncmpcpp-0.2.1 (2008-08-27)\n* support for composer, performer and disc tag\n* customizable keybindings\n* \"add\" option added\n* example config files are installed automatically now\n* \"repeat one song\" mode added (works only if ncmpcpp is running)\n* minor fixes, improvements etc.\n\n# ncmpcpp-0.2 (2008-08-20)\n* libmpd dependency dropped\n* pkgconfig is not needed anymore\n* ncmpcpp now shows more info if it cannot connect to mpd\n* proper handling for mpd password added\n* if ncmpcpp lose connection to mpd it'll try to reconnect\n* playlist status added\n* new screen - lyrics\n* switching between playlist and browser with tab key added\n* alternate movement keys added (j and k keys)\n* auto center mode added\n* new option - crossfade can be set to any value now (X key)\n* new option - going to parent directory in browser using backspace key\n* issue with backspace key fixed\n* sorting items in browser is case insensitive now\n* many fixes and improvements\n\n# ncmpcpp-0.1.2 (2008-08-12)\n* parts of interface are hideable now\n* new screen - media library\n* new option - crop (it removes all songs from playlist except the playing one)\n* many fixes and optimizations\n\n# ncmpcpp-0.1.1 (2008-08-07)\n* add example configuration file\n* configure.in now works as expected\n* taglib dependency is optional now\n* more customizable options\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.5888671875,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.\n                       51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA.\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Library General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\f\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\f\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\f\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\f\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\f\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA.\n\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Library General\nPublic License instead of this License.\n"
        },
        {
          "name": "INSTALL",
          "type": "blob",
          "size": 6.7763671875,
          "content": "Basic Installation\n==================\n\n   These are generic installation instructions.\n\n   The `configure' shell script attempts to guess correct values for\nvarious system-dependent variables used during compilation.  It uses\nthose values to create a `Makefile' in each directory of the package.\nIt may also create one or more `.h' files containing system-dependent\ndefinitions.  Finally, it creates a shell script `config.status' that\nyou can run in the future to recreate the current configuration, a file\n`config.cache' that saves the results of its tests to speed up\nreconfiguring, and a file `config.log' containing compiler output\n(useful mainly for debugging `configure').\n\n   If you need to do unusual things to compile the package, please try\nto figure out how `configure' could check whether to do them, and mail\ndiffs or instructions to the address given in the `README' so they can\nbe considered for the next release.  If at some point `config.cache'\ncontains results you don't want to keep, you may remove or edit it.\n\n   The file `configure.ac' is used to create `configure' by a program\ncalled `autoconf'.  You only need `configure.ac' if you want to change\nit or regenerate `configure' using a newer version of `autoconf'.\n\nThe simplest way to compile this package is:\n\n  1. `cd' to the directory containing the package's source code.\n\n  For the next two commands, `csh' users will need to prefix them with\n  `sh '.\n\n  2. Run `autoreconf -fiv' to generate the `configure' script.\n\n  3. Run `./configure' to configure the package for your system.  This\n     will take a while.  While running, it prints some messages\n     telling which features it is checking for.\n\n  4. Run `make' to compile the package.\n\n  5. Type `make install' to install the programs and any data files\n     and documentation.\n\n  6. You can remove the program binaries and object files from the\n     source code directory by typing `make clean'.\n\nCompilers and Options\n=====================\n\n   Some systems require unusual options for compilation or linking that\nthe `configure' script does not know about.  You can give `configure'\ninitial values for variables by setting them in the environment.  Using\na Bourne-compatible shell, you can do that on the command line like\nthis:\n     CC=c89 CFLAGS=-O2 LIBS=-lposix ./configure\n\nOr on systems that have the `env' program, you can do it like this:\n     env CPPFLAGS=-I/usr/local/include LDFLAGS=-s ./configure\n\nCompiling For Multiple Architectures\n====================================\n\n   You can compile the package for more than one kind of computer at the\nsame time, by placing the object files for each architecture in their\nown directory.  To do this, you must use a version of `make' that\nsupports the `VPATH' variable, such as GNU `make'.  `cd' to the\ndirectory where you want the object files and executables to go and run\nthe `configure' script.  `configure' automatically checks for the\nsource code in the directory that `configure' is in and in `..'.\n\n   If you have to use a `make' that does not supports the `VPATH'\nvariable, you have to compile the package for one architecture at a time\nin the source code directory.  After you have installed the package for\none architecture, use `make distclean' before reconfiguring for another\narchitecture.\n\nInstallation Names\n==================\n\n   By default, `make install' will install the package's files in\n`/usr/local/bin', `/usr/local/man', etc.  You can specify an\ninstallation prefix other than `/usr/local' by giving `configure' the\noption `--prefix=PATH'.\n\n   You can specify separate installation prefixes for\narchitecture-specific files and architecture-independent files.  If you\ngive `configure' the option `--exec-prefix=PATH', the package will use\nPATH as the prefix for installing programs and libraries.\nDocumentation and other data files will still use the regular prefix.\n\n   If the package supports it, you can cause programs to be installed\nwith an extra prefix or suffix on their names by giving `configure' the\noption `--program-prefix=PREFIX' or `--program-suffix=SUFFIX'.\n\nOptional Features\n=================\n\n   Some packages pay attention to `--enable-FEATURE' options to\n`configure', where FEATURE indicates an optional part of the package.\nThey may also pay attention to `--with-PACKAGE' options, where PACKAGE\nis something like `gnu-as' or `x' (for the X Window System).  You can \nfind a list of `--enable-' and `--with-' options that the package \nrecognizes via `./configure --help`.\n\n   For packages that use the X Window System, `configure' can usually\nfind the X include and library files automatically, but if it doesn't,\nyou can use the `configure' options `--x-includes=DIR' and\n`--x-libraries=DIR' to specify their locations.\n\nSpecifying the System Type\n==========================\n\n   There may be some features `configure' can not figure out\nautomatically, but needs to determine by the type of host the package\nwill run on.  Usually `configure' can figure that out, but if it prints\na message saying it can not guess the host type, give it the\n`--host=TYPE' option.  TYPE can either be a short name for the system\ntype, such as `sun4', or a canonical name with three fields:\n     CPU-COMPANY-SYSTEM\n\nSee the file `config.sub' for the possible values of each field.  If\n`config.sub' isn't included in this package, then this package doesn't\nneed to know the host type.\n\n   If you are building compiler tools for cross-compiling, you can also\nuse the `--target=TYPE' option to select the type of system they will\nproduce code for and the `--build=TYPE' option to select the type of\nsystem on which you are compiling the package.\n\nSharing Defaults\n================\n\n   If you want to set default values for `configure' scripts to share,\nyou can create a site shell script called `config.site' that gives\ndefault values for variables like `CC', `cache_file', and `prefix'.\n`configure' looks for `PREFIX/share/config.site' if it exists, then\n`PREFIX/etc/config.site' if it exists.  Or, you can set the\n`CONFIG_SITE' environment variable to the location of the site script.\nA warning: not all `configure' scripts look for a site script.\n\nOperation Controls\n==================\n\n   `configure' recognizes the following options to control how it\noperates.\n\n`--cache-file=FILE'\n     Use and save the results of the tests in FILE instead of\n     `./config.cache'.  Set FILE to `/dev/null' to disable caching, for\n     debugging `configure'.\n\n`--help'\n     Print a summary of the options to `configure', and exit.\n\n`--quiet'\n`--silent'\n`-q'\n     Do not print messages saying which checks are being made.\n\n`--srcdir=DIR'\n     Look for the package's source code in directory DIR.  Usually\n     `configure' can determine that directory automatically.\n\n`--version'\n     Print the version of Autoconf used to generate the `configure'\n     script, and exit.\n\n`configure' also accepts some other, not widely useful, options.\n\n"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 0.2490234375,
          "content": "# not a GNU package. You can remove this line, if\n# have all needed files, that a GNU package needs\nAUTOMAKE_OPTIONS = foreign 1.4\n\nSUBDIRS = src doc\ndocdir = $(prefix)/share/doc/$(PACKAGE)\ndoc_DATA = AUTHORS CHANGELOG.md COPYING\nEXTRA_DIST = $(doc_DATA)\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.30859375,
          "content": "# NCurses Music Player Client (Plus Plus)\n\n## ncmpcpp – featureful ncurses based MPD client inspired by ncmpc\n\n### Project status\n\nThe project is officially in maintenance mode. I (Andrzej Rybczak) still use it\ndaily, but it's feature complete for me and there is very limited time I have\nfor tending to the issue tracker and open pull requests.\n\nNo new, substantial features should be expected (at least from me). However, if\nthere are any serious bugs or the project outright stops compiling because of\nnew, incompatible versions of dependencies, it will be fixed.\n\n### Main features:\n* tag editor\n* playlist editor\n* easy to use search engine\n* media library\n* music visualizer\n* ability to fetch artist info from last.fm\n* new display mode\n* alternative user interface\n* ability to browse and add files from outside of MPD music directory\n…and a lot more minor functions.\n\n### Dependencies:\n* [boost](https://www.boost.org/)\n* [ncurses](https://invisible-island.net/ncurses/announce.html)\n* [readline](https://tiswww.case.edu/php/chet/readline/rltop.html)\n* [curl](https://curl.se), for fetching lyrics and last.fm data\n#### Optional libraries\n* [fftw](http://www.fftw.org), for frequency spectrum music visualization mode\n* [taglib](https://taglib.org/), for tag editing\n\n### Known issues:\n* No full support for handling encodings other than UTF-8.\n\n### Installation:\nThe simplest way to compile this package is:\n\n  1. `cd` to the directory containing the package's source code.\n\n  For the next two commands, `csh` users will need to prefix them with\n  `sh `.\n\n  2. Run `autoreconf -fiv` to generate the `configure` script.\n\n  3. Run `./configure` to configure the package for your system.  This\n     will take a while.  While running, it prints some messages\n     telling which features it is checking for.\n\n  4. Run `make` to compile the package.\n\n  5. Type `make install` to install the programs and any data files\n     and documentation.\n\n  6. You can remove the program binaries and object files from the\n     source code directory by typing `make clean`.\n\nDetailed intallation instructions can be found in the `INSTALL` file. \n\n### Optional features:\nOptional features can be enable by specifying them during configure. For\nexample, to enable visualizer run `./configure --enable-visualizer`. \n\nAdditional details can be found in the INSTALL file. \n"
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 7.8798828125,
          "content": "AC_INIT([ncmpcpp],[0.10.1])\nAC_CONFIG_SRCDIR([configure.ac])\nAC_CONFIG_HEADERS(config.h)\nAM_INIT_AUTOMAKE([subdir-objects])\n\nAC_CONFIG_MACRO_DIR([m4])\n\nAC_PREREQ([2.71])\n\nAC_LANG([C++])\nAC_PROG_CXX\nLT_INIT\n\nAC_ARG_ENABLE(outputs, AS_HELP_STRING([--enable-outputs], [Enable outputs screen @<:@default=no@:>@]), [outputs=$enableval], [outputs=no])\nAC_ARG_ENABLE(visualizer, AS_HELP_STRING([--enable-visualizer], [Enable music visualizer screen @<:@default=no@:>@]), [visualizer=$enableval], [visualizer=no])\nAC_ARG_ENABLE(clock, AS_HELP_STRING([--enable-clock], [Enable clock screen @<:@default=no@:>@]), [clock=$enableval], [clock=no])\n\nAC_ARG_WITH(fftw, AS_HELP_STRING([--with-fftw], [Enable fftw support (required for frequency spectrum vizualization) @<:@default=auto@:>@]), [fftw=$withval], [fftw=auto])\nAC_ARG_WITH(taglib, AS_HELP_STRING([--with-taglib], [Enable tag editor @<:@default=auto@:>@]), [taglib=$withval], [taglib=auto])\nAC_ARG_WITH(lto, AS_HELP_STRING([--with-lto], [Enable LTO (link time optimization) @<:@default=yes@:>@]), [lto=$withval], [lto=yes])\n\nif test \"$outputs\" = \"yes\"; then\n\tAC_DEFINE([ENABLE_OUTPUTS], [1], [enables outputs screen])\nfi\n\nif test \"$clock\" = \"yes\"; then\n\tAC_DEFINE([ENABLE_CLOCK], [1], [enables clock screen])\nfi\n\n# -flto\nif test \"$lto\" != \"no\"; then\n  AC_MSG_CHECKING([whether compiler supports -flto])\n  old_CXXFLAGS=\"$CXXFLAGS\"\n  # support specifying the number of threads\n  if test \"$lto\" != \"yes\"; then\n    flto=\"-flto=$lto\"\n  else\n    flto=\"-flto\"\n  fi\n  CXXFLAGS=\"$flto\"\n  AC_LINK_IFELSE([AC_LANG_PROGRAM([[ ]])],\n    AC_MSG_RESULT([yes]),\n    AC_MSG_RESULT([no])\n      flto=\"\"\n  )\n  CXXFLAGS=\"$old_CXXFLAGS $flto\"\nfi\n\n# -ftree-vectorize\nAC_MSG_CHECKING([whether compiler supports -ftree-vectorize])\nold_CXXFLAGS=\"$CXXFLAGS\"\nCXXFLAGS=\"-ftree-vectorize\"\nAC_COMPILE_IFELSE([AC_LANG_PROGRAM([[ ]])],\n  AC_MSG_RESULT([yes])\n    tree_vectorize=\"-ftree-vectorize\",\n  AC_MSG_RESULT([no])\n    tree_vectorize=\"\"\n)\nCXXFLAGS=\"$old_CXXFLAGS $tree_vectorize\"\n\n# -ffast-math\nAC_MSG_CHECKING([whether compiler supports -ffast-math])\nold_CXXFLAGS=\"$CXXFLAGS\"\nCXXFLAGS=\"-ffast-math\"\nAC_COMPILE_IFELSE([AC_LANG_PROGRAM([[ ]])],\n  AC_MSG_RESULT([yes])\n    fast_math=\"-ffast-math\",\n  AC_MSG_RESULT([no])\n    fast_math=\"\"\n)\nCXXFLAGS=\"$old_CXXFLAGS $fast_math\"\n\n# -std=c++20\nAC_MSG_CHECKING([whether compiler supports -std=c++20])\nold_CXXFLAGS=\"$CXXFLAGS\"\nCXXFLAGS=\"-std=c++20\"\nAC_COMPILE_IFELSE([AC_LANG_PROGRAM([[ ]])],\n\tAC_MSG_RESULT([yes])\n\t\tstd_cpp14=\"-std=c++20\",\n\tAC_MSG_RESULT([no])\n\t\tAC_MSG_ERROR([[Your compiler doesn't seem to support C++20, please upgrade]])\n)\nCXXFLAGS=\"$old_CXXFLAGS $std_cpp14\"\n\n# generic lambda expressions support\nAC_MSG_CHECKING([whether compiler supports generic lambda expressions])\nAC_COMPILE_IFELSE([AC_LANG_PROGRAM([], [[auto f = [](auto n) { return n*n; }; f(7);]])],\n\tAC_MSG_RESULT([yes]),\n\tAC_MSG_RESULT([no])\n\t\tAC_MSG_ERROR([[Your compiler doesn't seem to support generic lambda expressions, please upgrade (GCC >= 5)]])\n)\n\n# warnings\nCXXFLAGS=\"$CXXFLAGS -Wall -Wextra -Wshadow -Wimplicit-fallthrough\"\n\n# boost\nBOOST_REQUIRE([1.60])\nAC_SUBST(BOOST_CPPFLAGS)\nCPPFLAGS=\"$CPPFLAGS $BOOST_CPPFLAGS\"\n\nBOOST_STRING_ALGO\nBOOST_FORMAT\nBOOST_HASH\nBOOST_CONVERSION\nBOOST_MATH\nBOOST_OPTIONAL\nBOOST_RANGE\nBOOST_TOKENIZER\nBOOST_TUPLE\nBOOST_VARIANT\n\nBOOST_DATE_TIME\nAC_SUBST(BOOST_DATE_TIME_LDFLAGS)\nAC_SUBST(BOOST_DATE_TIME_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_DATE_TIME_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_DATE_TIME_LIBS\"\n\nBOOST_FILESYSTEM\nAC_SUBST(BOOST_FILESYSTEM_LDFLAGS)\nAC_SUBST(BOOST_FILESYSTEM_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_FILESYSTEM_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_FILESYSTEM_LIBS\"\n\nBOOST_LOCALE\nAC_SUBST(BOOST_LOCALE_LDFLAGS)\nAC_SUBST(BOOST_LOCALE_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_LOCALE_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_LOCALE_LIBS\"\n\nBOOST_PROGRAM_OPTIONS\nAC_SUBST(BOOST_PROGRAM_OPTIONS_LDFLAGS)\nAC_SUBST(BOOST_PROGRAM_OPTIONS_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_PROGRAM_OPTIONS_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_PROGRAM_OPTIONS_LIBS\"\n\nBOOST_REGEX\nAC_SUBST(BOOST_REGEX_LDFLAGS)\nAC_SUBST(BOOST_REGEX_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_REGEX_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_REGEX_LIBS\"\n\nBOOST_THREAD\nAC_SUBST(BOOST_THREAD_LDFLAGS)\nAC_SUBST(BOOST_THREAD_LIBS)\nLDFLAGS=\"$LDFLAGS $BOOST_THREAD_LDFLAGS\"\nLIBS=\"$LIBS $BOOST_THREAD_LIBS\"\n\n# icu\nAH_TEMPLATE([BOOST_REGEX_ICU], [boost.regex was compiled with ICU support])\nPKG_CHECK_MODULES([ICU], [icu-i18n icu-uc], [\n\told_CPPFLAGS=\"$CPPFLAGS\"\n\told_LIBS=\"$LIBS\"\n\tAC_SUBST(ICU_CFLAGS)\n\tAC_SUBST(ICU_LIBS)\n\tCPPFLAGS=\"$CPPFLAGS $ICU_CFLAGS\"\n\tLIBS=\"$LIBS $ICU_LIBS\"\n\tAC_MSG_CHECKING([whether boost.regex was compiled with ICU support])\n\tAC_LINK_IFELSE([AC_LANG_PROGRAM([\n    #include <boost/regex/icu.hpp>\n    ], [boost::u32regex rx = boost::make_u32regex(\"foo\"); if (boost::u32regex_search(\"foobar\", rx)) { }])],\n\tAC_MSG_RESULT([yes])\n\t\tAC_DEFINE([BOOST_REGEX_ICU], [1]),\n\tAC_MSG_RESULT([no])\n\t\tCPPFLAGS=\"$old_CPPFLAGS\"\n\t\tLIBS=\"$old_LIBS\",\n\t)\n], [[]])\n\n# various headers\nAC_CHECK_HEADERS([netinet/tcp.h netinet/in.h], , AC_MSG_ERROR(vital headers missing))\nAC_CHECK_HEADERS([langinfo.h], , AC_MSG_WARN(locale detection disabled))\n\n# libmpdclient2\nPKG_CHECK_MODULES([libmpdclient], [libmpdclient >= 2.8], [\n\tAC_SUBST(libmpdclient_CFLAGS)\n\tAC_SUBST(libmpdclient_LIBS)\n\tCPPFLAGS=\"$CPPFLAGS $libmpdclient_CFLAGS\"\n\tAC_CHECK_HEADERS([mpd/client.h],\n\t\tLIBS=\"$LIBS $libmpdclient_LIBS\"\n\t,\n\t\tAC_MSG_ERROR([missing mpd/client.h header])\n\t)\n],\n\tAC_MSG_ERROR([libmpdclient >= 2.8 is required!])\n)\n\n# readline\nAX_LIB_READLINE\nif test \"$ax_cv_lib_readline\" = \"no\"; then\n  AC_MSG_ERROR([no readline compatible library found])\nfi\nif test \"$ax_cv_lib_readline_history\" = \"no\"; then\n  AC_MSG_WARN([readline library has no history functionality])\nfi\n\n# pthread\nAC_CHECK_LIB(pthread, pthread_create, LIBS=\"$LIBS -lpthread\",\n\tAC_MSG_ERROR([pthread library is required])\n)\n\n# ncursesw\nPKG_CHECK_MODULES([ncursesw], [ncursesw], [\n\tAC_SUBST(ncursesw_CFLAGS)\n\tAC_SUBST(ncursesw_LIBS)\n\tCPPFLAGS=\"$CPPFLAGS $ncursesw_CFLAGS\"\n\tAC_CHECK_HEADERS([curses.h],\n\t\tLIBS=\"$LIBS $ncursesw_LIBS\"\n\t,\n\t\tAC_MSG_ERROR([missing curses.h header])\n\t)\n  AC_CHECK_LIB(ncursesw, initscr, , AC_MSG_ERROR([ncursesw doesn't provide initscr]))\n  AC_MSG_CHECKING([whether curses.h exposes wide-char functions by default])\n  AC_LINK_IFELSE([AC_LANG_PROGRAM([\n    #include <curses.h>\n    ], [waddnwstr(stdscr, L\"123\", 3)])],\n\tAC_MSG_RESULT([yes]),\n\tAC_MSG_RESULT([no])\n\t\tCPPFLAGS=\"$CPPFLAGS -D_XOPEN_SOURCE_EXTENDED\",\n\t)\n],\n\tAC_MSG_ERROR([ncursesw is required!])\n)\n\n# fftw3\nif test \"$visualizer\" = \"yes\" ; then\n\tif test \"$fftw\" != \"no\" ; then\n\t\tPKG_CHECK_MODULES([fftw3], [fftw3 >= 3], [\n\t\t\tAC_SUBST(fftw3_LIBS)\n\t\t\tAC_SUBST(fftw3_CFLAGS)\n\t\t\tCPPFLAGS=\"$CPPFLAGS $fftw3_CFLAGS\"\n\t\t\tAC_CHECK_HEADERS([fftw3.h],\n\t\t\t\tLIBS=\"$LIBS $fftw3_LIBS\"\n\t\t\t,\n\t\t\t\tif test \"$fftw\" = \"yes\" ; then\n\t\t\t\t\tAC_MSG_ERROR([missing fftw3.h header])\n\t\t\t\tfi\n\t\t\t)\n\t\t],\n\t\t\tif test \"$fftw\" = \"yes\" ; then\n\t\t\t\tAC_MSG_ERROR([fftw3 library is required!])\n\t\t\tfi\n\t\t)\n\tfi\n\tAC_DEFINE([ENABLE_VISUALIZER], [1], [enables music visualizer screen])\nfi\n\n# libcurl\nPKG_CHECK_MODULES([libcurl], [libcurl], [\n\tAC_SUBST(libcurl_CFLAGS)\n\tAC_SUBST(libcurl_LIBS)\n\tCPPFLAGS=\"$CPPFLAGS $libcurl_CFLAGS\"\n\tAC_CHECK_HEADERS([curl/curl.h],\n\t\tLIBS=\"$LIBS $libcurl_LIBS\"\n\t,\n\t\tAC_MSG_ERROR([missing curl/curl.h header])\n\t)\n],\n\tAC_MSG_ERROR([libcurl is required!])\n)\n\n# taglib\nif test \"$taglib\" != \"no\" ; then\n\tPKG_CHECK_MODULES([taglib], [taglib], [\n\t\tAC_SUBST(taglib_CFLAGS)\n\t\tAC_SUBST(taglib_LIBS)\n\t], [\n\t\tAC_PATH_PROG([TAGLIB_CONFIG], [taglib-config])\n\t\tif test \"$TAGLIB_CONFIG\" != \"\"; then\n\t\t\ttaglib_CFLAGS=`$TAGLIB_CONFIG --cflags`\n\t\t\ttaglib_LIBS=`$TAGLIB_CONFIG --libs`\n\t\telse\n\t\t\tif test \"$taglib\" = \"yes\" ; then\n\t\t\t\tAC_MSG_ERROR([could not find taglib.pc or taglib-config executable])\n\t\t\tfi\n\t\tfi\n\t])\n\n\tif test \"$TAGLIB_CONFIG$taglib_LIBS\" != \"\" ; then\n\t\tCPPFLAGS=\"$CPPFLAGS $taglib_CFLAGS\"\n\t\tLIBS=\"$LIBS $taglib_LIBS\"\n\n\t\tAC_CHECK_HEADERS([taglib.h], ,\n\t\t\tif test \"$taglib\" = \"yes\" ; then\n\t\t\t\tAC_MSG_ERROR([missing taglib.h header])\n\t\t\tfi\n\t\t)\n\tfi\nfi\n\nAC_CONFIG_FILES([Makefile src/Makefile doc/Makefile])\nAC_OUTPUT\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "extras",
          "type": "tree",
          "content": null
        },
        {
          "name": "m4",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}