{
  "metadata": {
    "timestamp": 1736565776202,
    "page": 706,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "lammps/lammps",
      "stars": 2292,
      "defaultBranch": "develop",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2353515625,
          "content": ".gitattributes export-ignore\n.gitignore export-ignore\n.github export-ignore\n.lgtm.yml export-ignore\nSECURITY.md export-ignore\nCITATION.cff export-ignore\n*       text=auto\n*.jpg   -text\n*.pdf   -text\n*.gz    -text\n*.png   -text\n*.ps    -text\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.5537109375,
          "content": "*~\n*.o\n*.so\n*.lo\n*.cu_o\n*.ptx\n*_ptx.h\n*.a\n*.d\n*.x\n*.exe\n*.sif\n*.dll\n*.pyc\n*.whl\na.out\n__pycache__\n\nObj_*\nlog.lammps\nlog.cite\n*.bz2\n*.gz\n*.tar\n.*.swp\n*.orig\n*.rej\nvgcore.*\n.vagrant\n\\#*#\n.#*\n.vscode\n\n.DS_Store\n.DS_Store?\n._*\n.Spotlight-V100\n.Trashes\nehthumbs.db\nThumbs.db\n.lammps_history\n.vs\n\n#cmake\n/build*\nCMakeCache.txt\nCMakeFiles\n/Makefile\nTesting\nTemporary\ncmake_install.cmake\n/lmp\nout/Debug\nout/RelWithDebInfo\nout/Release\nout/x86\nout/x64\nsrc/Makefile.package-e\nsrc/Makefile.package.settings-e\n/cmake/build/x64-Debug-Clang\n/install/x64-GUI-MSVC\n/install\n.Rhistory\n"
        },
        {
          "name": ".lgtm.yml",
          "type": "blob",
          "size": 0.2607421875,
          "content": "extraction:\n  cpp:\n    configure:\n      command:\n      - \"mkdir build\"\n      - \"cd build\"\n      - \"cmake -G Ninja -C ../cmake/presets/most.cmake ../cmake\"\n    index:\n      build_command:\n      - \"cd build\"\n      - \"ninja\"\n  python:\n    python_setup:\n      version: 3\n"
        },
        {
          "name": "CITATION.cff",
          "type": "blob",
          "size": 2.6591796875,
          "content": "# YAML 1.2\n---\ncff-version: 1.2.0\ntitle: \"LAMMPS: Large-scale Atomic/Molecular Massively Parallel Simulator\"\ntype: software\nauthors:\n  - family-names: \"Plimpton\"\n    given-names: \"Steven J.\"\n  - family-names: \"Kohlmeyer\"\n    given-names: \"Axel\"\n    orcid: \"https://orcid.org/0000-0001-6204-6475\"\n  - family-names: \"Thompson\"\n    given-names: \"Aidan P.\"\n    orcid: \"https://orcid.org/0000-0002-0324-9114\"\n  - family-names: \"Moore\"\n    given-names: \"Stan G.\"\n  - family-names: \"Berger\"\n    given-names: \"Richard\"\n    orcid: \"https://orcid.org/0000-0002-3044-8266\"\ndoi: 10.5281/zenodo.3726416\nlicense: GPL-2.0-only\nurl: https://www.lammps.org\nrepository-code: https://github.com/lammps/lammps/\nkeywords:\n  - \"Molecular Dynamics\"\n  - \"Materials Modeling\"\nmessage: \"If you are referencing LAMMPS in a publication, please cite the paper below.\"\npreferred-citation:\n  type: article\n  doi: \"10.1016/j.cpc.2021.108171\"\n  url: \"https://www.sciencedirect.com/science/article/pii/S0010465521002836\"\n  authors:\n  - family-names: \"Thompson\"\n    given-names: \"Aidan P.\"\n    orcid: \"https://orcid.org/0000-0002-0324-9114\"\n  - family-names: \"Aktulga\"\n    given-names: \"H. Metin\"\n  - family-names: \"Berger\"\n    given-names: \"Richard\"\n    orcid: \"https://orcid.org/0000-0002-3044-8266\"\n  - family-names: \"Bolintineanu\"\n    given-names: \"Dan S.\"\n  - family-names: \"Brown\"\n    given-names: \"W. Michael\"\n  - family-names: \"Crozier\"\n    given-names: \"Paul S.\"\n  - family-names: \"in 't Veld\"\n    given-names: \"Pieter J.\"\n  - family-names: \"Kohlmeyer\"\n    given-names: \"Axel\"\n    orcid: \"https://orcid.org/0000-0001-6204-6475\"\n  - family-names: \"Moore\"\n    given-names: \"Stan G.\"\n  - family-names: \"Nguyen\"\n    given-names: \"Trung Dac\"\n  - family-names: \"Shan\"\n    given-names: \"Ray\"\n  - family-names: \"Stevens\"\n    given-names: \"Mark J.\"\n  - family-names: \"Tranchida\"\n    given-names: \"Julien\"\n  - family-names: \"Trott\"\n    given-names: \"Christian\"\n  - family-names: \"Plimpton\"\n    given-names: \"Steven J.\"\n  title: \"LAMMPS - a flexible simulation tool for particle-based materials modeling at the atomic, meso, and continuum scales\"\n  journal: \"Computer Physics Communications\"\n  keywords:\n   - Molecular dynamics\n   - Materials modeling\n   - Parallel algorithms\n   - LAMMPS\n  month: 2\n  volume: 271\n  issn: 0010-4655\n  pages: 108171\n  year: 2022\nreferences:\n - title: \"Fast Parallel Algorithms for Short-Range Molecular Dynamics\"\n   type: article\n   journal: Journal of Computational Physics\n   volume: 117\n   number: 1\n   pages: \"1-19\"\n   year: 1995\n   issn: 0021-9991\n   doi: 10.1006/jcph.1995.1039\n   url: https://www.sciencedirect.com/science/article/pii/S002199918571039X\n   authors:\n   - family-names: \"Plimpton\"\n     given-names: \"Steve\"\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.296875,
          "content": "GNU GENERAL PUBLIC LICENSE\n\nVersion 2, June 1991\n\nCopyright (C) 1989, 1991 Free Software Foundation, Inc.  \n51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA\n\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\n\nPreamble\n\nThe licenses for most software are designed to take away your freedom\nto share and change it. By contrast, the GNU General Public License is\nintended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users. This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it. (Some other Free Software Foundation software is covered by\nthe GNU Library General Public License instead.) You can apply it to\nyour programs, too.\n\nWhen we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\nTo protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the\nrights. These restrictions translate to certain responsibilities for\nyou if you distribute copies of the software, or if you modify it.\n\nFor example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have. You must make sure that they, too, receive or can get the\nsource code. And you must show them these terms so they know their\nrights.\n\nWe protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\nAlso, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware. If the software is modified by someone else and passed on,\nwe want its recipients to know that what they have is not the\noriginal, so that any problems introduced by others will not reflect\non the original authors' reputations.\n\nFinally, any free program is threatened constantly by software\npatents. We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary. To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at\nall.\n\nThe precise terms and conditions for copying, distribution and\nmodification follow.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n0. This License applies to any program or other work which contains a\nnotice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License. The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage. (Hereinafter, translation is included without limitation in\nthe term \"modification\".) Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope. The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the Program\n(independent of having been made by running the Program). Whether that\nis true depends on what the Program does.\n\n1. You may copy and distribute verbatim copies of the Program's source\ncode as you receive it, in any medium, provided that you conspicuously\nand appropriately publish on each copy an appropriate copyright notice\nand disclaimer of warranty; keep intact all the notices that refer to\nthis License and to the absence of any warranty; and give any other\nrecipients of the Program a copy of this License along with the\nProgram.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a\nfee.\n\n2. You may modify your copy or copies of the Program or any portion of\nit, thus forming a work based on the Program, and copy and distribute\nsuch modifications or work under the terms of Section 1 above,\nprovided that you also meet all of these conditions:\n\n     a) You must cause the modified files to carry prominent notices\n     stating that you changed the files and the date of any change.\n\n     b) You must cause any work that you distribute or publish, that\n     in whole or in part contains or is derived from the Program or\n     any part thereof, to be licensed as a whole at no charge to all\n     third parties under the terms of this License.\n\n     c) If the modified program normally reads commands interactively\n     when run, you must cause it, when started running for such\n     interactive use in the most ordinary way, to print or display an\n     announcement including an appropriate copyright notice and a\n     notice that there is no warranty (or else, saying that you\n     provide a warranty) and that users may redistribute the program\n     under these conditions, and telling the user how to view a copy\n     of this License. (Exception: if the Program itself is interactive\n     but does not normally print such an announcement, your work based\n     on the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole. If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works. But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote\nit.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n     a) Accompany it with the complete corresponding machine-readable\n     source code, which must be distributed under the terms of\n     Sections 1 and 2 above on a medium customarily used for software\n     interchange; or,\n\n     b) Accompany it with a written offer, valid for at least three\n     years, to give any third party, for a charge no more than your\n     cost of physically performing source distribution, a complete\n     machine-readable copy of the corresponding source code, to be\n     distributed under the terms of Sections 1 and 2 above on a medium\n     customarily used for software interchange; or,\n\n     c) Accompany it with the information you received as to the offer\n     to distribute corresponding source code. (This alternative is\n     allowed only for noncommercial distribution and only if you\n     received the program in object code or executable form with such\n     an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it. For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable. However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License. Any attempt otherwise\nto copy, modify, sublicense or distribute the Program is void, and\nwill automatically terminate your rights under this License. However,\nparties who have received copies, or rights, from you under this\nLicense will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n5. You are not required to accept this License, since you have not\nsigned it. However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works. These actions are\nprohibited by law if you do not accept this License. Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions. You may not impose any further\nrestrictions on the recipients' exercise of the rights granted\nherein. You are not responsible for enforcing compliance by third\nparties to this License.\n\n7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License. If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all. For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded. In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n9. The Free Software Foundation may publish revised and/or new\nversions of the General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program\nspecifies a version number of this License which applies to it and\n\"any later version\", you have the option of following the terms and\nconditions either of that version or of any later version published by\nthe Free Software Foundation. If the Program does not specify a\nversion number of this License, you may choose any version ever\npublished by the Free Software Foundation.\n\n10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the\nauthor to ask for permission. For software which is copyrighted by the\nFree Software Foundation, write to the Free Software Foundation; we\nsometimes make exceptions for this. Our decision will be guided by the\ntwo goals of preserving the free status of all derivatives of our free\nsoftware and of promoting the sharing and reuse of software generally.\n\nNO WARRANTY\n\n11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO\nWARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE\nLAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS\nAND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF\nANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nPROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY\nAND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU\nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nPROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these\nterms.\n\nTo do so, attach the following notices to the program. It is safest to\nattach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\none line to give the program's name and an idea of what it does.\nCopyright (C) yyyy  name of author\n\nThis program is free software; you can redistribute it and/or modify\nit under the terms of the GNU General Public License version 2 as\npublished by the Free Software Foundation.\n\nThis program is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, write to the Free Software\nFoundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.\n\nAlso add information on how to contact you by electronic and paper mail. \n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\nGnomovision version 69, Copyright (C) year name of author\nGnomovision comes with ABSOLUTELY NO WARRANTY; for details\ntype `show w'.  This is free software, and you are welcome\nto redistribute it under certain conditions; type `show c' \nfor details.\n\nThe hypothetical commands `show w' and `show c' should show the\nappropriate parts of the General Public License. Of course, the\ncommands you use may be called something other than `show w' and `show\nc'; they could even be mouse-clicks or menu items--whatever suits your\nprogram.\n\nYou should also get your employer (if you work as a programmer) or\nyour school, if any, to sign a \"copyright disclaimer\" for the program,\nif necessary. Here is a sample; alter the names:\n\nYoyodyne, Inc., hereby disclaims all copyright\ninterest in the program `Gnomovision'\n(which makes passes at compilers) written \nby James Hacker.\n\nsignature of Ty Coon, 1 April 1989\nTy Coon, President of Vice\n\nThis General Public License does not permit incorporating your program\ninto proprietary programs. If your program is a subroutine library,\nyou may consider it more useful to permit linking proprietary\napplications with the library. If this is what you want to do, use the\nGNU Library General Public License instead of this License.\n"
        },
        {
          "name": "README",
          "type": "blob",
          "size": 2.328125,
          "content": "This is the LAMMPS software package.\n\nLAMMPS stands for Large-scale Atomic/Molecular Massively Parallel\nSimulator.\n\nCopyright (2003) Sandia Corporation.  Under the terms of Contract\nDE-AC04-94AL85000 with Sandia Corporation, the U.S. Government retains\ncertain rights in this software.  This software is distributed under\nthe GNU General Public License.\n\n----------------------------------------------------------------------\n\nLAMMPS is a classical molecular dynamics simulation code designed to\nrun efficiently on parallel computers.  It was developed at Sandia\nNational Laboratories, a US Department of Energy facility, with\nfunding from the DOE.  It is an open-source code, distributed freely\nunder the terms of the GNU Public License (GPL) version 2.\n\nThe code is maintained by the LAMMPS development team who can be emailed\nat developers@lammps.org.  The LAMMPS WWW Site at www.lammps.org has\nmore information about the code and its uses.\n\nThe LAMMPS distribution includes the following files and directories:\n\nREADME                     this file\nLICENSE                    the GNU General Public License (GPL)\nbench                      benchmark problems\ncmake                      CMake build files\ndoc                        documentation\nexamples                   simple test problems\nfortran                    Fortran wrapper for LAMMPS\nlib                        additional provided or external libraries\npotentials                 interatomic potential files\npython                     Python wrappers for LAMMPS\nsrc                        source files\ntools                      pre- and post-processing tools\n\nPoint your browser at any of these files to get started:\n\nhttps://docs.lammps.org/Manual.html         LAMMPS manual\nhttps://docs.lammps.org/Intro.html          hi-level introduction\nhttps://docs.lammps.org/Build.html          how to build LAMMPS\nhttps://docs.lammps.org/Run_head.html       how to run LAMMPS\nhttps://docs.lammps.org/Commands_all.html   Table of available commands\nhttps://docs.lammps.org/Library.html        LAMMPS library interfaces\nhttps://docs.lammps.org/Modify.html         how to modify and extend LAMMPS\nhttps://docs.lammps.org/Developer.html      LAMMPS developer info\n\nYou can also create these doc pages locally:\n\n% cd doc\n% make html                # creates HTML pages in doc/html\n% make pdf                 # creates Manual.pdf\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 2.689453125,
          "content": "# Security Policy\n\nLAMMPS is designed as a user-level application to conduct computer\nsimulations for research using classical mechanics.  As such LAMMPS\ndepends to some degrees on users providing correctly formatted input and\nLAMMPS needs to read and write files based on uncontrolled user input.\nAs a parallel application for use in high-performance computing\nenvironments, performance critical steps are also done without checking\ndata.\n\nLAMMPS also is interfaced to a number of external libraries, including\nlibraries with experimental research software, that are not validated\nand tested by the LAMMPS developers, so it is easy to import bad\nbehavior from calling functions in one of those libraries.\n\nThus is is quite easy to crash LAMMPS through malicious input and do all\nkinds of file system manipulations.  And because of that LAMMPS should\n**NEVER** be compiled or **run** as superuser, either from a \"root\" or\n\"administrator\" account directly or indirectly via \"sudo\" or \"su\".\n\nTherefore what could be seen as a security vulnerability is usually\neither a user mistake or a bug in the code.  Bugs can be reported in the\nLAMMPS project [issue tracker on\nGitHub](https://github.com/lammps/lammps/issues).\n\nTo mitigate issues with using homoglyphs or bidirectional reordering in\nunicode, which have been demonstrated as a vector to obfuscate and hide\nmalicious changes to the source code, all LAMMPS submissions are checked\nfor unicode characters and only all-ASCII source code is accepted.\n\n# Version Updates\n\nLAMMPS follows a continuous release development model.  We aim to keep\nthe development version (`develop` branch) always fully functional and\nemploy a variety of automatic testing procedures to detect failures of\nexisting functionality from adding or modifying features.  Most of those\ntests are run on pull requests and must be passed *before* merging to\nthe `develop` branch.  The `develop` branch is protected, so all changes\n*must* be submitted as a pull request and thus cannot avoid the\nautomated tests.\n\nAdditional tests are run *after* merging.  Before releases are made\n*all* tests must have cleared.  Then a release tag is applied and the\n`release` branch is fast-forwarded to that tag.  This is referred to to\nas a \"feature release\".  Bug fixes and updates are applied first to the\n`develop` branch.  Later, they appear in the `release` branch when the\nnext patch release occurs.  For stable releases, backported bug fixes\nand infrastructure updates are first applied to the `maintenance` branch\nand then merged to `stable` and published as \"updates\".  For a new\nstable release the `stable` branch is updated to the corresponding state\nof the `release` branch and a new stable tag is applied in addition to\nthe release tag.\n"
        },
        {
          "name": "bench",
          "type": "tree",
          "content": null
        },
        {
          "name": "cmake",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "fortran",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "potentials",
          "type": "tree",
          "content": null
        },
        {
          "name": "python",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "unittest",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}