{
  "metadata": {
    "timestamp": 1736565378487,
    "page": 213,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "LibreVR/Revive",
      "stars": 3632,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 4.412109375,
          "content": "## Ignore Visual Studio temporary files, build results, and\n## files generated by popular Visual Studio add-ons.\n\n# User-specific files\n*.suo\n*.user\n*.userosscache\n*.sln.docstates\n\n# User-specific files (MonoDevelop/Xamarin Studio)\n*.userprefs\n\n# Build results\n[Dd]ebug/\n[Dd]ebugPublic/\n[Rr]elease/\n[Rr]eleases/\n[Nn]ightly/\nx64/\nx86/\nbld/\n[Bb]in/\n[Oo]bj/\n[Ll]og/\nbuild*/\n\n# Visual Studio 2015 cache/options directory\n.vs/\n# Uncomment if you have tasks that create the project's static files in wwwroot\n#wwwroot/\n\n# MSTest test Results\n[Tt]est[Rr]esult*/\n[Bb]uild[Ll]og.*\n\n# NUNIT\n*.VisualState.xml\nTestResult.xml\n\n# Build Results of an ATL Project\n[Dd]ebugPS/\n[Rr]eleasePS/\ndlldata.c\n\n# DNX\nproject.lock.json\nartifacts/\n\n*_i.c\n*_p.c\n*_i.h\n*.ilk\n*.meta\n*.obj\n*.pch\n*.pdb\n*.pgc\n*.pgd\n*.rsp\n*.sbr\n*.tlb\n*.tli\n*.tlh\n*.tmp\n*.tmp_proj\n*.log\n*.vspscc\n*.vssscc\n.builds\n*.pidb\n*.svclog\n*.scc\n\n# Chutzpah Test files\n_Chutzpah*\n\n# Visual C++ cache files\nipch/\n*.aps\n*.ncb\n*.opendb\n*.opensdf\n*.sdf\n*.cachefile\n*.VC.db\n\n# Visual Studio profiler\n*.psess\n*.vsp\n*.vspx\n*.sap\n\n# TFS 2012 Local Workspace\n$tf/\n\n# Guidance Automation Toolkit\n*.gpState\n\n# ReSharper is a .NET coding add-in\n_ReSharper*/\n*.[Rr]e[Ss]harper\n*.DotSettings.user\n\n# JustCode is a .NET coding add-in\n.JustCode\n\n# TeamCity is a build add-in\n_TeamCity*\n\n# DotCover is a Code Coverage Tool\n*.dotCover\n\n# NCrunch\n_NCrunch_*\n.*crunch*.local.xml\nnCrunchTemp_*\n\n# MightyMoose\n*.mm.*\nAutoTest.Net/\n\n# Web workbench (sass)\n.sass-cache/\n\n# Installshield output folder\n[Ee]xpress/\n\n# DocProject is a documentation generator add-in\nDocProject/buildhelp/\nDocProject/Help/*.HxT\nDocProject/Help/*.HxC\nDocProject/Help/*.hhc\nDocProject/Help/*.hhk\nDocProject/Help/*.hhp\nDocProject/Help/Html2\nDocProject/Help/html\n\n# Click-Once directory\npublish/\n\n# Publish Web Output\n*.[Pp]ublish.xml\n*.azurePubxml\n# TODO: Comment the next line if you want to checkin your web deploy settings\n# but database connection strings (with potential passwords) will be unencrypted\n*.pubxml\n*.publishproj\n\n# Microsoft Azure Web App publish settings. Comment the next line if you want to\n# checkin your Azure Web App publish settings, but sensitive information contained\n# in these scripts will be unencrypted\nPublishScripts/\n\n# NuGet Packages\n*.nupkg\n# The packages folder can be ignored because of Package Restore\n**/packages/*\n# except build/, which is used as an MSBuild target.\n!**/packages/build/\n# Uncomment if necessary however generally it will be regenerated when needed\n#!**/packages/repositories.config\n# NuGet v3's project.json files produces more ignoreable files\n*.nuget.props\n*.nuget.targets\n\n# Microsoft Azure Build Output\ncsx/\n*.build.csdef\n\n# Microsoft Azure Emulator\necf/\nrcf/\n\n# Windows Store app package directories and files\nAppPackages/\nBundleArtifacts/\nPackage.StoreAssociation.xml\n_pkginfo.txt\n\n# Visual Studio cache files\n# files ending in .cache can be ignored\n*.[Cc]ache\n# but keep track of directories ending in .cache\n!*.[Cc]ache/\n\n# Others\nClientBin/\n~$*\n*~\n*.dbmdl\n*.dbproj.schemaview\n*.pfx\n*.publishsettings\nnode_modules/\norleans.codegen.cs\n\n# Since there are multiple workflows, uncomment next line to ignore bower_components\n# (https://github.com/github/gitignore/pull/1529#issuecomment-104372622)\n#bower_components/\n\n# RIA/Silverlight projects\nGenerated_Code/\n\n# Backup & report files from converting an old project file\n# to a newer Visual Studio version. Backup files are not needed,\n# because we have git ;-)\n_UpgradeReport_Files/\nBackup*/\nUpgradeLog*.XML\nUpgradeLog*.htm\n\n# SQL Server files\n*.mdf\n*.ldf\n\n# Business Intelligence projects\n*.rdl.data\n*.bim.layout\n*.bim_*.settings\n\n# Microsoft Fakes\nFakesAssemblies/\n\n# GhostDoc plugin setting file\n*.GhostDoc.xml\n\n# Node.js Tools for Visual Studio\n.ntvs_analysis.dat\n\n# Visual Studio 6 build log\n*.plg\n\n# Visual Studio 6 workspace options file\n*.opt\n\n# Visual Studio LightSwitch build output\n**/*.HTMLClient/GeneratedArtifacts\n**/*.DesktopClient/GeneratedArtifacts\n**/*.DesktopClient/ModelManifest.xml\n**/*.Server/GeneratedArtifacts\n**/*.Server/ModelManifest.xml\n_Pvt_Extensions\n\n# Paket dependency manager\n.paket/paket.exe\npaket-files/\n\n# FAKE - F# Make\n.fake/\n\n# JetBrains Rider\n.idea/\n*.sln.iml\n\n# Ignore third-party library\nExternals/LibOVR/\n\n# Ignore compiled installers\nInstaller/*.exe\n\n# Ignore generated HLSL headers\n*.hlsl.h\n\n# Ignore Nvidia NSight config\n*.nvuser\n\n# Ignore Qt generated files\nGeneratedFiles\n*.qmlc\n*.jsc\n.qmake.stash\nmsvc_make.bat\n\n# Ignore generated proxy file\nLibOVRProxy/OVR_CAPIShim.c\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.4052734375,
          "content": "[submodule \"openvr\"]\n\tpath = Externals/openvr\n\turl = https://github.com/ValveSoftware/openvr.git\n[submodule \"WinSparkle\"]\n\tpath = Externals/WinSparkle\n\turl = https://github.com/LibreVR/ext-win-sparkle.git\n[submodule \"microprofile\"]\n\tpath = Externals/microprofile\n\turl = https://github.com/zeux/microprofile.git\n[submodule \"Vulkan\"]\n\tpath = Externals/Vulkan\n\turl = https://github.com/KhronosGroup/Vulkan-Headers.git\n"
        },
        {
          "name": "BUILDING.md",
          "type": "blob",
          "size": 1.4150390625,
          "content": "# Building Revive\n\nFor your convenience, there is a script to help retrieve and set up\ndependencies in the project root. This script will also attempt to build OpenXR\nand Revive.\n\nInstructions for both scripted and manual build are below.\n\n## Script\n\n- Clone this repository:\n  ```\n  git clone git@github.com:LibreVR/Revive.git\n  ```\n- Install Visual Studio 2017, CMake, and Git, and ensure all three are in your PATH from within PowerShell.\n- Run the setup script (PowerShell):\n  ```\n  cd Revive\n  .\\setup.ps1\n  ```\n\n## Manual\n\nBefore the project can be built, you must retrieve some external dependencies through [vcpkg](https://docs.microsoft.com/en-us/cpp/build/vcpkg).\n\nIn bash for Windows:\n\n```\ngit clone git@github.com:microsoft/vcpkg.git\ncd vcpkg\nbootstrap-vcpkg.bat\n```\n\nNow that vcpkg has been installed we need to install the dependencies and integrate with VS2017\n\n```\nvcpkg install openxr-loader:x64-windows glfw3:x64-windows-static glfw3:x86-windows-static\nvcpkg integrate\n```\n\nNow we're ready to clone the Revive repository and set up vendored dependencies.\n\n```\ncd ..\ngit clone --recursive git@github.com:LibreVR/Revive.git\n```\n\nDownload the Oculus SDK for Windows\n[here](https://developer.oculus.com/downloads/package/oculus-sdk-for-windows/)\nand place it in `Revive/Externals/'. Then:\n\n```\ncd Revive/Externals\nunzip ovr_sdk_win_<version>.zip\n```\n\nThe Revive, ReviveXR and ReviveInjector projects can then build normally in VS2017.\n"
        },
        {
          "name": "Common.props",
          "type": "blob",
          "size": 0.443359375,
          "content": "﻿<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<Project ToolsVersion=\"4.0\" xmlns=\"http://schemas.microsoft.com/developer/msbuild/2003\">\n  <ImportGroup Label=\"PropertySheets\" />\n  <PropertyGroup Label=\"UserMacros\">\n    <Externals>$(SolutionDir)Externals\\</Externals>\n  </PropertyGroup>\n  <PropertyGroup />\n  <ItemDefinitionGroup />\n  <ItemGroup>\n    <BuildMacro Include=\"Externals\">\n      <Value>$(Externals)</Value>\n    </BuildMacro>\n  </ItemGroup>\n</Project>"
        },
        {
          "name": "Externals",
          "type": "tree",
          "content": null
        },
        {
          "name": "Images",
          "type": "tree",
          "content": null
        },
        {
          "name": "Installer",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 22.984375,
          "content": "Revive\n\nMIT License\n\nCopyright (c) 2016 LibreVR\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n-------------------------------------------------------------------------------\nOpenVR\n\nCopyright (c) 2015, Valve Corporation\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\n3. Neither the name of the copyright holder nor the names of its contributors\nmay be used to endorse or promote products derived from this software without\nspecific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n-------------------------------------------------------------------------------\nDetours\n\n# Copyright (c) Microsoft Corporation\n\nAll rights reserved.\n\n# MIT License\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies\nof the Software, and to permit persons to whom the Software is furnished to do\nso, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED *AS IS*, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\n-------------------------------------------------------------------------------\nCImg\n\nThis software is governed either by the CeCILL or the CeCILL-C license\nunder French law and abiding by the rules of distribution of free software.\nYou can  use, modify and or redistribute the software under the terms of\nthe CeCILL or CeCILL-C licenses as circulated by CEA, CNRS and INRIA\nat the following URL: \"http://cecill.info\".\n\n-------------------------------------------------------------------------------\nOpenXR\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n-------------------------------------------------------------------------------\nThe Qt Toolkit is Copyright (C) 2018 The Qt Company Ltd. and other contributors\nContact: https://www.qt.io/licensing/\n\n GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n  This version of the GNU Lesser General Public License incorporates\nthe terms and conditions of version 3 of the GNU General Public\nLicense, supplemented by the additional permissions listed below.\n\n  0. Additional Definitions.\n\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\nGeneral Public License.\n\n  \"The Library\" refers to a covered work governed by this License,\nother than an Application or a Combined Work as defined below.\n\n  An \"Application\" is any work that makes use of an interface provided\nby the Library, but which is not otherwise based on the Library.\nDefining a subclass of a class defined by the Library is deemed a mode\nof using an interface provided by the Library.\n\n  A \"Combined Work\" is a work produced by combining or linking an\nApplication with the Library.  The particular version of the Library\nwith which the Combined Work was made is also called the \"Linked\nVersion\".\n\n  The \"Minimal Corresponding Source\" for a Combined Work means the\nCorresponding Source for the Combined Work, excluding any source code\nfor portions of the Combined Work that, considered in isolation, are\nbased on the Application, and not on the Linked Version.\n\n  The \"Corresponding Application Code\" for a Combined Work means the\nobject code and/or source code for the Application, including any data\nand utility programs needed for reproducing the Combined Work from the\nApplication, but excluding the System Libraries of the Combined Work.\n\n  1. Exception to Section 3 of the GNU GPL.\n\n  You may convey a covered work under sections 3 and 4 of this License\nwithout being bound by section 3 of the GNU GPL.\n\n  2. Conveying Modified Versions.\n\n  If you modify a copy of the Library, and, in your modifications, a\nfacility refers to a function or data to be supplied by an Application\nthat uses the facility (other than as an argument passed when the\nfacility is invoked), then you may convey a copy of the modified\nversion:\n\n   a) under this License, provided that you make a good faith effort to\n   ensure that, in the event an Application does not supply the\n   function or data, the facility still operates, and performs\n   whatever part of its purpose remains meaningful, or\n\n   b) under the GNU GPL, with none of the additional permissions of\n   this License applicable to that copy.\n\n  3. Object Code Incorporating Material from Library Header Files.\n\n  The object code form of an Application may incorporate material from\na header file that is part of the Library.  You may convey such object\ncode under terms of your choice, provided that, if the incorporated\nmaterial is not limited to numerical parameters, data structure\nlayouts and accessors, or small macros, inline functions and templates\n(ten or fewer lines in length), you do both of the following:\n\n   a) Give prominent notice with each copy of the object code that the\n   Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the object code with a copy of the GNU GPL and this license\n   document.\n\n  4. Combined Works.\n\n  You may convey a Combined Work under terms of your choice that,\ntaken together, effectively do not restrict modification of the\nportions of the Library contained in the Combined Work and reverse\nengineering for debugging such modifications, if you also do each of\nthe following:\n\n   a) Give prominent notice with each copy of the Combined Work that\n   the Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\n   document.\n\n   c) For a Combined Work that displays copyright notices during\n   execution, include the copyright notice for the Library among\n   these notices, as well as a reference directing the user to the\n   copies of the GNU GPL and this license document.\n\n   d) Do one of the following:\n\n       0) Convey the Minimal Corresponding Source under the terms of this\n       License, and the Corresponding Application Code in a form\n       suitable for, and under terms that permit, the user to\n       recombine or relink the Application with a modified version of\n       the Linked Version to produce a modified Combined Work, in the\n       manner specified by section 6 of the GNU GPL for conveying\n       Corresponding Source.\n\n       1) Use a suitable shared library mechanism for linking with the\n       Library.  A suitable mechanism is one that (a) uses at run time\n       a copy of the Library already present on the user's computer\n       system, and (b) will operate properly with a modified version\n       of the Library that is interface-compatible with the Linked\n       Version.\n\n   e) Provide Installation Information, but only if you would otherwise\n   be required to provide such information under section 6 of the\n   GNU GPL, and only to the extent that such information is\n   necessary to install and execute a modified version of the\n   Combined Work produced by recombining or relinking the\n   Application with a modified version of the Linked Version. (If\n   you use option 4d0, the Installation Information must accompany\n   the Minimal Corresponding Source and Corresponding Application\n   Code. If you use option 4d1, you must provide the Installation\n   Information in the manner specified by section 6 of the GNU GPL\n   for conveying Corresponding Source.)\n\n  5. Combined Libraries.\n\n  You may place library facilities that are a work based on the\nLibrary side by side in a single library together with other library\nfacilities that are not Applications and are not covered by this\nLicense, and convey such a combined library under terms of your\nchoice, if you do both of the following:\n\n   a) Accompany the combined library with a copy of the same work based\n   on the Library, uncombined with any other library facilities,\n   conveyed under the terms of this License.\n\n   b) Give prominent notice with the combined library that part of it\n   is a work based on the Library, and explaining where to find the\n   accompanying uncombined form of the same work.\n\n  6. Revised Versions of the GNU Lesser General Public License.\n\n  The Free Software Foundation may publish revised and/or new versions\nof the GNU Lesser General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\n  Each version is given a distinguishing version number. If the\nLibrary as you received it specifies that a certain numbered version\nof the GNU Lesser General Public License \"or any later version\"\napplies to it, you have the option of following the terms and\nconditions either of that published version or of any later version\npublished by the Free Software Foundation. If the Library as you\nreceived it does not specify a version number of the GNU Lesser\nGeneral Public License, you may choose any version of the GNU Lesser\nGeneral Public License ever published by the Free Software Foundation.\n\n  If the Library as you received it specifies that a proxy can decide\nwhether future versions of the GNU Lesser General Public License shall\napply, that proxy's public statement of acceptance of any version is\npermanent authorization for you to choose that version for the\nLibrary."
        },
        {
          "name": "LibOVRProxy",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.5546875,
          "content": "# Revive Compatibility Layer\n\nThis is a compatibility layer between the Oculus SDK and OpenVR/OpenXR. It allows you to play Oculus-exclusive games on your HTC Vive or Valve Index.\n\n[Refer to the wiki](https://github.com/LibreVR/Revive/wiki) if you run into any problems. You can also find a [community-compiled list of working games on the wiki](https://github.com/LibreVR/Revive/wiki/Compatibility-list), feel free to add your own results.\n\n## Installation\n\n*Always check the [compatibility list](https://github.com/LibreVR/Revive/wiki/Compatibility-list) before making a purchase.*\n\n1. Download and install [Oculus Rift Software](https://www.oculus.com/rift/setup/). When you get to \"Select Your Headset\", choose to \"Skip\".\n2. [Download the latest Revive installer.](https://github.com/LibreVR/Revive/releases/latest)\n3. Install Revive in your preferred directory.\n4. Start SteamVR if it's not already running.\n5. Put on the headset, open the dashboard and click the new Revive tab.\n6. If you run into any problems, read the known issues below or refer to the [wiki](https://github.com/LibreVR/Revive/wiki).\n\n## Known Issues\n\n- Newly installed applications may refuse to start when you try to launch them for the first time, [simply follow these instructions to fix it](https://github.com/LibreVR/Revive/wiki/Troubleshooting#im-getting-an-entitlement-error-or-oculus-rift-not-found) or reboot your PC.\n- If you don't see the Revive tab, go to the start menu on your desktop and start the Revive Dashboard. Or check the Applications tab in the SteamVR settings to see if the tab is enabled.\n"
        },
        {
          "name": "Revive.sln",
          "type": "blob",
          "size": 5.4990234375,
          "content": "﻿\nMicrosoft Visual Studio Solution File, Format Version 12.00\n# Visual Studio Version 16\nVisualStudioVersion = 16.0.32630.194\nMinimumVisualStudioVersion = 10.0.40219.1\nProject(\"{8BC9CEB8-8B4A-11D0-8D11-00A0C91BC942}\") = \"Revive\", \"Revive\\Revive.vcxproj\", \"{BC34622B-5BFC-42D0-858A-331BECC048AE}\"\nEndProject\nProject(\"{8BC9CEB8-8B4A-11D0-8D11-00A0C91BC942}\") = \"ReviveInjector\", \"ReviveInjector\\ReviveInjector.vcxproj\", \"{589559C6-2B51-41F4-A896-5D9DB2537A7F}\"\nEndProject\nProject(\"{8BC9CEB8-8B4A-11D0-8D11-00A0C91BC942}\") = \"ReviveXR\", \"ReviveXR\\ReviveXR.vcxproj\", \"{CD882909-7404-4CFC-BC8E-47364CC4727D}\"\nEndProject\nProject(\"{8BC9CEB8-8B4A-11D0-8D11-00A0C91BC942}\") = \"openvr_api\", \"Externals\\openvr_api.vcxproj\", \"{8940FE26-E0D4-4977-8A24-AB26AE687432}\"\nEndProject\nProject(\"{8BC9CEB8-8B4A-11D0-8D11-00A0C91BC942}\") = \"LibOVRProxy\", \"LibOVRProxy\\LibOVRProxy.vcxproj\", \"{520A780B-AEF3-436A-93AF-9CBE65B7FD41}\"\nEndProject\nGlobal\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\n\t\tDebug|x64 = Debug|x64\n\t\tDebug|x86 = Debug|x86\n\t\tNightly|x64 = Nightly|x64\n\t\tNightly|x86 = Nightly|x86\n\t\tRelease|x64 = Release|x64\n\t\tRelease|x86 = Release|x86\n\tEndGlobalSection\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Debug|x64.Build.0 = Debug|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Debug|x86.ActiveCfg = Debug|Win32\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Debug|x86.Build.0 = Debug|Win32\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Nightly|x64.ActiveCfg = Nightly|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Nightly|x64.Build.0 = Nightly|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Nightly|x86.ActiveCfg = Nightly|Win32\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Nightly|x86.Build.0 = Nightly|Win32\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Release|x64.ActiveCfg = Release|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Release|x64.Build.0 = Release|x64\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Release|x86.ActiveCfg = Release|Win32\n\t\t{BC34622B-5BFC-42D0-858A-331BECC048AE}.Release|x86.Build.0 = Release|Win32\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Debug|x64.Build.0 = Debug|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Debug|x86.ActiveCfg = Debug|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Nightly|x64.ActiveCfg = Nightly|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Nightly|x64.Build.0 = Nightly|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Nightly|x86.ActiveCfg = Nightly|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Release|x64.ActiveCfg = Release|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Release|x64.Build.0 = Release|x64\n\t\t{589559C6-2B51-41F4-A896-5D9DB2537A7F}.Release|x86.ActiveCfg = Release|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Debug|x64.Build.0 = Debug|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Debug|x86.ActiveCfg = Debug|Win32\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Debug|x86.Build.0 = Debug|Win32\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Nightly|x64.ActiveCfg = Nightly|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Nightly|x64.Build.0 = Nightly|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Nightly|x86.ActiveCfg = Nightly|Win32\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Nightly|x86.Build.0 = Nightly|Win32\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Release|x64.ActiveCfg = Release|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Release|x64.Build.0 = Release|x64\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Release|x86.ActiveCfg = Release|Win32\n\t\t{CD882909-7404-4CFC-BC8E-47364CC4727D}.Release|x86.Build.0 = Release|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Debug|x64.Build.0 = Debug|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Debug|x86.ActiveCfg = Debug|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Debug|x86.Build.0 = Debug|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Nightly|x64.ActiveCfg = Nightly|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Nightly|x64.Build.0 = Nightly|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Nightly|x86.ActiveCfg = Nightly|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Nightly|x86.Build.0 = Nightly|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Release|x64.ActiveCfg = Release|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Release|x64.Build.0 = Release|x64\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Release|x86.ActiveCfg = Release|Win32\n\t\t{8940FE26-E0D4-4977-8A24-AB26AE687432}.Release|x86.Build.0 = Release|Win32\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Debug|x64.Build.0 = Debug|x64\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Debug|x86.ActiveCfg = Debug|Win32\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Debug|x86.Build.0 = Debug|Win32\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Nightly|x64.ActiveCfg = Nightly|x64\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Nightly|x64.Build.0 = Nightly|x64\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Nightly|x86.ActiveCfg = Nightly|Win32\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Nightly|x86.Build.0 = Nightly|Win32\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Release|x64.ActiveCfg = Nightly|x64\n\t\t{520A780B-AEF3-436A-93AF-9CBE65B7FD41}.Release|x86.ActiveCfg = Nightly|Win32\n\tEndGlobalSection\n\tGlobalSection(SolutionProperties) = preSolution\n\t\tHideSolutionNode = FALSE\n\tEndGlobalSection\n\tGlobalSection(ExtensibilityGlobals) = postSolution\n\t\tSolutionGuid = {5FBBBCB0-AF09-413D-B7A5-BA3A3F4810EC}\n\tEndGlobalSection\nEndGlobal\n"
        },
        {
          "name": "Revive",
          "type": "tree",
          "content": null
        },
        {
          "name": "ReviveInjector",
          "type": "tree",
          "content": null
        },
        {
          "name": "ReviveOverlay",
          "type": "tree",
          "content": null
        },
        {
          "name": "ReviveXR",
          "type": "tree",
          "content": null
        },
        {
          "name": "appcast.xml",
          "type": "blob",
          "size": 1.298828125,
          "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<rss version=\"2.0\" xmlns:sparkle=\"http://www.andymatuschak.org/xml-namespaces/sparkle\" xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\n\t<channel>\n\t\t<title>Revive Changelog</title>\n\t\t<link>https://raw.githubusercontent.com/LibreVR/Revive/master/appcast.xml</link>\n\t\t<language>en</language>\n\t\t<item>\n\t\t\t<title>Version 3.2.0</title>\n\t\t\t<description>\n\t\t\t<![CDATA[\n<h3>Changes</h3>\n\n<ul>\n    <li>Updated OpenVR to v1.23.7</li>\n    <li>Pose prediction has been rewritten resulting in improved motion smoothing</li>\n    <li>Allow games to recenter room-scale experiences</li>\n    <li>In-game recentering is no longer persistent</li>\n    <li>Implemented automatic HMD audio device selection</li>\n    <li>Decreased scrolling speed in Revive Dashboard</li>\n    <li>Added tray icon menu item to create a Revive Injector shortcut</li>\n</ul>\n\n<h3>Bug fixes</h3>\n\n<ul>\n    <li>Revive: Golf+ doesn't launch correctly in headset (#1804)</li>\n    <li>Revive: Bonelab extreme stutters and low performance (#1788)</li>\n</ul>\n\t\t\t]]>\n\t\t\t</description>\n\t\t\t<pubDate>23 March 2023</pubDate>\n\t\t\t<enclosure url=\"https://github.com/LibreVR/Revive/releases/download/3.2.0/ReviveInstaller.exe\"\n\t\t\t\t\t   type=\"application/exe\"\n\t\t\t\t\t   sparkle:version=\"3.2.0.0\"\n\t\t\t\t\t   sparkle:os=\"windows-x64\"/>\n\t\t</item>\n\t</channel>\n</rss>\n"
        },
        {
          "name": "appveyor.yml",
          "type": "blob",
          "size": 3.26171875,
          "content": "version: '3.2.0.{build}'\r\nimage: Visual Studio 2019\r\nclone_folder: c:\\projects\\revive\r\n\r\nenvironment:\r\n  QTDIR: C:\\Qt\\5.15.2\\msvc2019_64\r\n\r\ninstall:\r\n  # update vcpkg to the latest version\r\n  - cd C:\\Tools\\vcpkg\r\n  - git pull\r\n  - git apply %APPVEYOR_BUILD_FOLDER%\\fix-vcpkg-openxr-static-loader.patch\r\n  - .\\bootstrap-vcpkg.bat\r\n  - cd %APPVEYOR_BUILD_FOLDER%\r\n  - git submodule update --init --recursive\r\n  - mkdir c:\\projects\\download_cache\r\n  # download and extract Oculus SDK\r\n  - ps: |\r\n      Invoke-WebRequest -Uri 'https://securecdn.oculus.com/binaries/download/?id=4377593722298679' -OutFile 'c:\\projects\\download_cache\\oculus_sdk.zip'\r\n      cd c:\\projects\\revive\\Externals\r\n      unzip c:\\projects\\download_cache\\oculus_sdk.zip\r\n  # install required NSIS plugins\r\n  - ps: |\r\n      Invoke-WebRequest -Uri 'https://nsis.sourceforge.io/mediawiki/images/4/4a/AccessControl.zip' -OutFile 'c:\\projects\\download_cache\\NSIS_AccessControl.zip'\r\n      cd c:\\projects\\download_cache\r\n      unzip NSIS_AccessControl.zip\r\n      copy Plugins\\i386-ansi\\AccessControl.dll 'C:\\Program Files (x86)\\NSIS\\Plugins\\x86-ansi'\r\n      copy Plugins\\i386-unicode\\AccessControl.dll 'C:\\Program Files (x86)\\NSIS\\Plugins\\x86-unicode'\r\n      \r\nbuild_script:\r\n  # ensure vcpkg dependencies are installed\r\n  - ps: |\r\n      vcpkg integrate install\r\n      vcpkg install --triplet x86-windows-static detours openxr-loader glfw3\r\n      vcpkg install --triplet x64-windows-static detours openxr-loader glfw3\r\n  # build the solution\r\n  - ps: |\r\n      cd C:\\Projects\\Revive\r\n      msbuild Revive.sln /t:Build /p:Configuration=Release /p:Platform=x64\r\n      msbuild Revive.sln /t:Build /p:Configuration=Release /p:Platform=x86\r\n  # build the overlay\r\n  - call \"C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Community\\VC\\Auxiliary\\Build\\vcvars64.bat\"\r\n  - cd C:\\Projects\\Revive\\ReviveOverlay\r\n  - C:\\Qt\\5.15.2\\msvc2019_64\\bin\\qmake.exe\r\n  - nmake\r\n\r\nafter_build:\r\n  # copy dependencies using windeployqt\r\n  - C:\\Qt\\5.15.2\\msvc2019_64\\bin\\windeployqt.exe --no-translations --qmldir C:\\Projects\\Revive\\ReviveOverlay C:\\Projects\\Revive\\Release\\ReviveOverlay.exe\r\n  # copy additional files to the build folder\r\n  - ps: |\r\n      cd C:\\Projects\\Revive\\Release\r\n      copy ..\\ReviveOverlay\\SupportAssets . -Filter \"*.jpg\" -Recurse -Container\r\n      copy C:\\openssl-v111-win64\\bin\\libcrypto-1_1-x64.dll .\r\n      copy C:\\openssl-v111-win64\\bin\\libssl-1_1-x64.dll .\r\n  # gather build artifacts\r\n  - ps: |\r\n      cd C:\\Projects\\Revive\\Release\r\n      7z a ..\\Installer\\Revive.zip ReviveInjector.exe LibRevive32.dll LibRevive64.dll LibReviveXR64.dll LibReviveXR32.dll\r\n  # run NSIS to generate installer\r\n  - ps: |\r\n      cd C:\\Projects\\Revive\\Installer\r\n      $env:Path += \";C:\\Program Files (x86)\\NSIS\"\r\n      If ($env:APPVEYOR_REPO_TAG -eq \"true\") {\r\n        makensis Revive.nsi\r\n      } Else {\r\n        makensis /DNIGHTLY Revive.nsi\r\n      }\r\n\r\nartifacts:\r\n  - path: Installer\\ReviveInstaller.exe\r\n    name: Revive Installer\r\n  - path: Installer\\Revive.zip\r\n    name: Revive Build\r\n\r\ndeploy:\r\n  provider: GitHub\r\n  auth_token:\r\n    secure: 9ktb/rF39gcllEG+9tZgsNz5nU57xL517ki2bOnhGuGAmbNetV91B8lFBEjDC41UXEzzy4WqPTxYBl/9v/F9OkoO1ZDUk9wAS8Uo873Eq+UP/BTVQCskrK8YP4kE6Hhl\r\n  artifact: 'Revive Installer'\r\n  draft: true\r\n  prerelease: false\r\n  on:\r\n    APPVEYOR_REPO_TAG: true\r\n"
        },
        {
          "name": "fix-vcpkg-openxr-static-loader.patch",
          "type": "blob",
          "size": 2.8564453125,
          "content": "diff --git a/ports/openxr-loader/fix-static-loader.patch b/ports/openxr-loader/fix-static-loader.patch\nnew file mode 100644\nindex 000000000..d06ee8cc7\n--- /dev/null\n+++ b/ports/openxr-loader/fix-static-loader.patch\n@@ -0,0 +1,32 @@\n+diff --git a/src/loader/CMakeLists.txt b/src/loader/CMakeLists.txt\n+index 9add93809..d125180e7 100644\n+--- a/src/loader/CMakeLists.txt\n++++ b/src/loader/CMakeLists.txt\n+@@ -174,27 +174,6 @@ if(CMAKE_SYSTEM_NAME STREQUAL \"Linux\")\n+     install(FILES \"${CMAKE_CURRENT_BINARY_DIR}/openxr.pc\" DESTINATION \"${CMAKE_INSTALL_LIBDIR}/pkgconfig\")\n+ elseif(WIN32)\n+     if(MSVC)\n+-        # WindowsStore (UWP) apps must be compiled with dynamic CRT linkage (default)\n+-        if(NOT CMAKE_SYSTEM_NAME STREQUAL \"WindowsStore\")\n+-            foreach(configuration in CMAKE_C_FLAGS_DEBUG\n+-                                    CMAKE_C_FLAGS_RELEASE\n+-                                    CMAKE_C_FLAGS_RELWITHDEBINFO\n+-                                    CMAKE_CXX_FLAGS_DEBUG\n+-                                    CMAKE_CXX_FLAGS_RELEASE\n+-                                    CMAKE_CXX_FLAGS_RELWITHDEBINFO)\n+-                # If building DLLs, force static CRT linkage\n+-                if(DYNAMIC_LOADER)\n+-                    if(${configuration} MATCHES \"/MD\")\n+-                        string(REGEX REPLACE \"/MD\" \"/MT\" ${configuration} \"${${configuration}}\")\n+-                    endif()\n+-                else() # Otherwise for static libs, link the CRT dynamically\n+-                    if(${configuration} MATCHES \"/MT\")\n+-                        string(REGEX REPLACE \"/MT\" \"/MD\" ${configuration} \"${${configuration}}\")\n+-                    endif()\n+-                endif()\n+-            endforeach()\n+-        endif()\n+-\n+         target_compile_options(openxr_loader PRIVATE /wd6386)\n+     endif()\n+ \ndiff --git a/ports/openxr-loader/portfile.cmake b/ports/openxr-loader/portfile.cmake\nindex 04a518602..0bac03b83 100644\n--- a/ports/openxr-loader/portfile.cmake\n+++ b/ports/openxr-loader/portfile.cmake\n@@ -7,6 +7,7 @@ vcpkg_from_github(\n     HEAD_REF master\n     PATCHES\n         fix-openxr-sdk-jsoncpp.patch\n+        fix-static-loader.patch\n )\n \n vcpkg_from_github(\n@@ -18,6 +19,7 @@ vcpkg_from_github(\n     PATCHES\n         fix-openxr-sdk-jsoncpp.patch\n         fix-jinja2.patch\n+        fix-static-loader.patch\n )\n \n vcpkg_from_github(\n@@ -30,15 +32,11 @@ vcpkg_from_github(\n         002-fix-hpp-gen.patch\n )\n \n-# Weird behavior inside the OpenXR loader.  On Windows they force shared libraries to use static crt, and\n-# vice-versa. Might be better in future iterations to patch the CMakeLists.txt for OpenXR\n if (VCPKG_TARGET_IS_UWP OR VCPKG_TARGET_IS_WINDOWS)\n     if(VCPKG_LIBRARY_LINKAGE STREQUAL static)\n         set(DYNAMIC_LOADER OFF)\n-        set(VCPKG_CRT_LINKAGE dynamic)\n     else()\n         set(DYNAMIC_LOADER ON)\n-        set(VCPKG_CRT_LINKAGE static)\n     endif()\n endif()\n \n"
        },
        {
          "name": "hook.cmd",
          "type": "blob",
          "size": 0.8857421875,
          "content": "@echo off\nif not exist \"%~dp0ReviveInjector.exe\" (\n\techo ReviveInjector.exe not found\n\tpause\n\texit\n)\nset /p exe=\"Enter executable name to hook: \"\nreg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\%exe%\" /v Debugger 2>NUL | Find \"ReviveInjector.exe\"\nif %errorlevel% equ 0 (\n\techo Removing existing hook on %exe%\n\treg delete \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\%exe%\" /f\n\tpause\n\texit\n)\nreg query \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\%exe%\" 2>NUL 1>NUL\nif %errorlevel% equ 0 (\n\techo Cannot hook a system program\n\tpause\n\texit\n)\nreg add \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution Options\\%exe%\" /v Debugger /t REG_SZ /d \"%~dp0ReviveInjector.exe /debug\"\nif %errorlevel% neq 0 echo Right-click this script and select \"Run as administrator\" to try again\npause"
        }
      ]
    }
  ]
}