{
  "metadata": {
    "timestamp": 1736709642492,
    "page": 17,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "SAP/styleguides",
      "stars": 1701,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.05078125,
          "content": "*.adoc linguist-detectable\n*.md linguist-detectable\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0244140625,
          "content": ".idea\nbuild\nnode_modules\n"
        },
        {
          "name": ".reuse",
          "type": "tree",
          "content": null
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODEOWNERS",
          "type": "blob",
          "size": 0.234375,
          "content": "# global owners as fallback for anything not matched below\n* @KlausHaeuptleSAP @HrFlorianHoffmann @xtough\n\n# one line for each document\n/abap-code-review/ @xtough\n/clean-abap/ @HrFlorianHoffmann @KlausHaeuptleSAP @SAP/clean-abap-code-owner\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 9.3291015625,
          "content": "# Contributing to SAP Styleguides\n\nYou want to contribute to the SAP Style Guides? Welcome! Please read this document to understand what you can do:\n- [Contributing to SAP Styleguides](#contributing-to-sap-styleguides)\n    - [Help Others](#help-others)\n    - [Analyze Issues](#analyze-issues)\n        - [Quick Checklist for Issues and Change Proposals](#quick-checklist-for-issues-and-change-proposals)\n        - [Issue Handling Process](#issue-handling-process)\n        - [Usage of Labels](#usage-of-labels)\n        - [Issue Reporting Disclaimer](#issue-reporting-disclaimer)\n    - [Pull Requests](#pull-requests)\n        - [Developer Certificate of Origin (DCO)](#developer-certificate-of-origin-dco)\n    - [Issues](#issues)\n        - [How to Contribute - the Process](#how-to-contribute---the-process)\n        - [Decision Making by the Commmiters](#decision-making-by-the-commmiters)\n    - [Discussions](#discussions)\n    - [Forks](#forks)\n    - [Use English](#use-english)\n\n## Help Others\n\nYou can help Clean ABAP by helping others to learn Clean Code, Clean ABAP, Test Automation, Code Reviews and ABAP. You will find more resources and tools to foster clean code in the [introduction, motivation and overview blog post](https://blogs.sap.com/2022/12/21/clean-code-writing-maintainable-readable-and-testable-code/).\n\n## Analyze Issues\n\nAnalyzing issues can be a lot of effort. Any help is welcome!\nGo to [the Github issue tracker](https://github.com/SAP/styleguides/issues) and find issues and express your thoughts by up-voting, down-voting, sharing a comment and help to develop the issue further.\n\nMaybe you can [contribute](#pull-requests) a change proposal via pull request, which could close the issue?\n\nIf the committers have time to look at issues, they will first look at the  [most highly ranked issues](https://github.com/SAP/styleguides/issues?q=is%3Aissue+is%3Aopen+sort%3Areactions-%2B1-desc).\n\n### Quick Checklist for Issues and Change Proposals\n\nIssue report checklist:\n* No duplicate\n* Good summary\n* Well-documented\n* Minimal example\n* Use an existing template\n\n### Issue Handling Process\n\nWhen an issue is reported, the community can participate in the discussion express their thoughts by up-voting, down-voting, sharing a comment and help to develop the issue further.\n\nA committer will sooner or later look at it (can take some time) and either confirm it as a real issue (by giving the \"in progress\" label), close it if it is not an issue, or ask for more details. In-progress issues are then either assigned to a committer in GitHub, or left open as \"contribution welcome\" for easy or not so urgent fixes. If a committer has time they usually look first at the open pull requests and the [most highly ranked issues](https://github.com/SAP/styleguides/issues?q=is%3Aissue+is%3Aopen+sort%3Areactions-%2B1-desc).\n\nAn issue requesting changes in the style guide is closed as soon as a change (pull request) that resolves it is committed to the main branch or if consensus is reached that no such change will be made.\n\n### Usage of Labels\n\nGitHub offers labels to categorize issues. We use the following labels:\n\nStatus of open issues:\n* unconfirmed: This report needs confirmation whether it is a valid or invalid request (no label; this is the default status).\n* in progress: This issue has been reviewed and a commiter has been assigned.\n* author action: The author is required to provide more information.\n* contribution welcome: The requested change is generally seen as desirable, and everyone is invited to contribute a possible solution via pull request. If you are working on a fix for such an issue yourself, it is good to leave a comment in the issue or ask for it to be assigned to you so that people don't start work on something someone else is already working on\n\nStatus/resolution of closed issues:\n* fixed: a fix for the issue was provided\n* duplicate: the problem is also reported in a different issue and is handled there\n* invalid: for some reason or another this issue report will not be handled further (maybe lack of information or issue does not apply anymore)\n\nThe labels can only be set and modified by committers.\n\n### Issue Reporting Disclaimer\n\nWe want to improve the quality of SAP Style Guides and change proposals are welcome! But our capacity is limited, so we cannot handle questions or consultation requests not directly related to the guides. So we reserve the right to close or to not process off-topic issues or issues/pull requests with insufficient information in favor of those that are clearly documented and address actual issues with the guide. Even though we would like to address each well-documented issue, there is always a chance that it won't happen - remember: SAP Style Guides are Open Source, and your help in processing issues or improving the guides is always welcome!\n\n## Pull Requests\n\nCreate [pull requests](https://github.com/SAP/clean-abap/compare) when you know exactly what you want to change, and how, in particular when you are addressing an open issue. They are most welcome, and may range from minor formatting corrections to adding whole sections. Of course, entirely new rules and sections may take longer to review and simple corrections.\n\nWhen creating a pull request, we will ask you to accept the Developer Certificate of Origin (DCO).\n\n### Developer Certificate of Origin (DCO)\n\nDue to legal reasons, contributors will be asked to accept a DCO before they submit the first pull request to this project. SAP uses [the standard DCO text of the Linux Foundation](https://developercertificate.org/).  This happens in an automated fashion during the submission process: the CLA assistant tool will add a comment to the pull request. Click it to check the DCO, then accept it on the following screen. CLA assistant will save this decision for upcoming contributions from the same Github account.\n\nThis DCO replaces the previously used CLA (\"Contributor License Agreement\") as well as the \"Corporate Contributor License Agreement\" with new terms which are well-known standards and hence easier to approve by legal departments. Contributors who had already accepted the CLA in the past may be asked once to accept the new DCO.\n\n## Issues\n\nCreate [issues](https://github.com/SAP/clean-abap/issues/new) if you have a problem with the guides' content but do not immediately have a solution in form of a pull request or if you want to discuss your issue with the community first. Feel free to comment on existing issues and add your voice - every contribution counts, and since our style guides should be applicable to a wide range of different developers, we always welcome hearing opinions from new contributors.\n\nWe will ask you for permission before taking over text and examples proposed in issues unchanged or ask you to contribute them in a pull request yourself.\n\n### How to contribute - the Process\n\n1. Make sure your intended change would be welcome - if you have any doubts at all, open an issue discussing the change first. If you are sure that the change is welcome by the community, you can also directly open a pull request.\n2. Create a fork of this repository and do your changes in a branch on your fork, using legible and meaningful commit messages.\n3. Create a pull request with a description summarizing your change, in particular (for changes that are not obvious corrections) the motivation behind it and any prior discussion.\n   If your change resolves an existing GitHub issue, add the following line to the message:\n    - ```Fixes https://github.com/SAP/styleguides/issues/(issueNumber)```\n4. If contributing for the first time, see the [chapter on Developer Certificate of Origin (DCO)](#developer-certificate-of-origin-dco) for more detail\n5. Wait for code reviews to come in and be ready to respond to requested changes or questions by the reviewers\n    - Depending on the effort required for reviewing and clarification this process may take a while\n    - We also intentionally often delay merging new proposals for up to 3 months to allow the community some time to provide feedback before it is merged. Corrections that do not introduce new rules may be merged faster.\n6. Once the review process is finished, a committer will merge your pull request. You can delete your branch and/or fork after this.\n\n### Decision Making by the Commmiters\n\nTo be able to make decisions and represent the huge diversity of ABAP developers, we have defined a [decision making process](GOVERNANCE.md).\n\nOne reason for the process was to increase to the confidence in making decisions by representing different groups and set it up to be more sustainable (i.e. independent from the original creators). The committers usually meet every second week. The first priority of the meeting is to go through open pull requests. The discussion about every single PR takes some time, but this means you can usually expect an initial reaction to your pull request from someone within two weeks.\n\n## Discussions\n\nWe encourage you to participate in the discussions of the issues and pull requests. To get notification you can star or watch the repository.\n\n## Forks\n\nIf you generally agree with this styleguide, but want to adapt certain things to your team's personal needs, we recommend to fork this repository and add your changes there.\n\n## Use English\n\nPlease use English for issues, pull requests, and discussions. Due to the wide-spread presence of English as a second language, SAP uses English as its common language to facilitate cross-culture communication.\n"
        },
        {
          "name": "GOVERNANCE.md",
          "type": "blob",
          "size": 11.0087890625,
          "content": "# Clean Code Community - Contribution, Discussion, Review and Decision Process\n\nWith the success of the style guide, there comes the need for a more formal process when it comes to reviewing issues and improvement proposals to be able to form a common understanding and be effective in making decisions.\nClarity on how those should be opened, are processed and the typical timeframe. Besides, especially for changes with a larger impact (e.g. incompatible changes) we need a formal process for decision making.\n\n**Note: The document replicates the parts of the SAP internal governance document, which can be made public - more than 95% of the text is the same.**\n\n## Principles for Decision Making\n\nThe style guides are based on some universal principles. So when we make the decision between different alternatives we keep those principles in mind:\n\n- Testability: Every piece of code needs to be testable in an efficient, fast and robust way\n- Readability and Maintainability is important and determines developer productivity\n  - [Studies](https://www.researchgate.net/publication/359129462_Code_Red_The_Business_Impact_of_Code_Quality_--_A_Quantitative_Study_of_39_Proprietary_Production_Codebases) found that developers spend about 60% of their development time on program comprehension activities and at least 10 times the amount of time is used for reading compared to writing the same piece of code.\n- Readability and Modularity over premature performance optimization, but performance is important (e.g. mass read over single read)\n- Tradeoffs: If we cannot come up with a consensus, we list the tradeoffs and explain the consequences of the alternatives.\n- Same terminology and principles across programming languages (e.g. [testing terminology](https://blogs.sap.com/2021/12/06/shared-language-for-talking-about-test-strategy/) is the same for JavaScript and ABAP)\n\n## Review and Discussion\n\nCompared to an open source software project, the rate of change for a style guide should be much slower. Due to the adoption by many projects and usage by S4HANA as official programming guideline changes can have an impact on many projects and can result in an adjustment of code check profiles. Therefore, we want to give the community of readers and contributors enough time to have a conversation on the issues and pull requests.\n\nWhen moderating the discussion and more clarity is needed for the discussed topic you should consider the following. Discussions are unlikely to give a clear picture of the community as a whole for several reasons. They favor people who like to argue, those who are more articulate or have more experience in English (or whatever language the discussion is in), and those who feel like they're in the \"in\" crowd and will have a popular opinion. Finally, they hide how many people are in agreement with someone who speaks up. With this in mind, use the discussion to explore different sides of the issue. Raise awareness of the discussion by announcing in the community channels (if appropriate) to make sure that the entire community is able to weigh in.\n\n## Labeling\n\nFor deciding how to proceed with a pull request, we want to classify the different issues and pull requests into categories. Therefore, we have the following labels:\n- Type of Change\n  - Clarity of Text, e.g. misunderstanding in text\n  - `Formatting`, e.g. missing `.` in code, or wrong \",\" in text\n  - Content Error, e.g. bad link, `me->` where it doesn't belong (= consistency issue)\n  - New Rule, e.g. add a new rule\n  - Adjustment of Rule, e.g. change content of rule, such as generalizing a rule\n  - Idea - Usually an issue e.g. request to add a guide for clean EML\n- Status\n  - Ready for Decision\n\nWe use these labels to organize our collaboration. Externals cannot add/remove them.\n\n## Review and Decision Process\n\n### Review by Maintainers and Owners\n\nEvery team member with triage rights can approve pull requests or request changes. Only Code Owners can merge the pull request.\nTo join the team of clean code moderators, you can join the respective group:\n- [Clean ABAP review and discussion moderators](https://github.com/orgs/SAP/teams/clean-abap-review-and-discussion-moderation/members?query=) - - Due to technical reasons only visible to members of the SAP GitHub organization.\n\n**Meetings:** For discussing changes and other issues the **Clean ABAP review and discussion moderators meet every second week**. To ensure efficient processing an issue or pull request is presented by an advocate with a proposal how to proceed with the issue. Most of the issues and pull requests can be closed or merged within this meeting, but for reviewing changes with impact (e.g. new rules or adjustment of rules) there is an additional community meeting with a larger amount of participants:\n- **Once every quarter, the agile software engineering community** with members from application development, tools and abap meet to discuss about important changes\n- An advocate presents the change to the community\n- In order to ensure efficient decision making the following checklist needs to be fulfilled to bring the issue or pull request to the community:\n  - The issue or pull request is older than 3 month so that the external and internal community had time for a conversation\n  - The external and internal community expressed their opinion\n\nFor more details on process for important changes see the [chapter on decision making for important changes](#decision-making-for-important-changes).\n\n### Action by Author and Request for Changes\n\nWhen asked to provide feedback or the pull request is set to request for changes, the author has 2 month time. After the 2 month, the issue or pull request can be closed or the code owner take over the necessary steps to include the proposal into the guide.\n\n### Advocate\n\nAn advocate takes the ownership to drive the process for a specific issue or pull request towards closing an issue / pull request or merging a pull request and represent the topic in the different community meetings. When picking up the topic, an advocate assigns himself to the issue or pull request.\n\n### Decision Board for ABAP\n\nThe decision board should represent the diversity of business applications and technology:\n\n- ASE Application Development Community - 6 colleagues representing large business application areas\n- ABAP group - 3 colleagues representing areas of the ABAP foundation\n\nEveryone in the community can participate and express his opinion, but only the decision board members have the power to block a change.\n\n### Decision Making for important changes\n\nIn the Clean Code Projects a discussion toward a decision follows this process. For important decisions about new rules or change of existing rules (labeled as \"New Rule\" or \"Change of rule\"), we strive for consensus among the decision board members. It only becomes a consensus when at least 2/3 of the members of the decision board - i.e. 6 or more of the 9 people in the decision board - have given a +1 and no additional member voted with -1. Therefore, we ask whether all those entitled to vote agree and aim for a consensus. Consensus means that no one has an objection, that a person responsibly shares the decision, if he decides not to veto that for him the decision is ok. So consensus looks at the veto, at the opposition.\n\n1. A proposal is put forth and a check for consensus is made.\n  - Consensus is signified through a +1 vote.\n2. A check is made for any dissent on the proposal.\n  - Reservations\n    - Reservations about the proposal are worked through, seeking consensus to resolve the reservations.\n    - A reservation is not a vote against the proposal, but may turn into a vote against if unresolved. It is often expressed with an initial -1 vote to indicate reservations and concerns. This indicates there is still discussion to be had.\n  - Stand aside? No comment, or state concerns without a -1 reservation\n    - This option allows a member to have issues with the proposal without choosing to block the proposal, by instead standing aside with a +/-0 vote.\n    - The stated concerns may influence other people to have or release reservations.\n  - Block? Vote -1 with reasons for the block.\n    - This is a complete block on a proposal, refusing to let it pass. A block is a -1 vote and must be accompanied with substantive arguments that are rooted in the merit criteria of the Project protecting the community, the upstream, technical reasons, and so forth.\n\nBlock (-1) votes used as a veto are typically used only when consensus cannot otherwise be met, and are effectively a veto that any sitting Board member can utilize with sufficient substantiation. A block should only happen if there are very strong concerns about the proposal (e.g. creates potential security problem or severe performance degradation).\n\nA way to deal with reservations, concerns and vetos is to document the tradeoffs for the different alternatives.\n\nIn Github, this process is represented as follows: Any important change is represented by a pull request. The votes in the above description correspond to reviews of this pull request, with:\n\n- +1 votes corresponding to reviews that approve the changes\n- -1 votes (both blocks and reservations) corresponding to reviews that request changes\n- Standing aside or concerns without reservation corresponding to comments or commenting reviews\n\n### Notify Code Owners about the need for decision making\n\nIf there is a pull request, which needs the decision from the code owners, write a short comment in the [discussion section of the code owner team](https://github.com/orgs/SAP/teams/clean-abap-code-owner/discussions).\n\n### Code Owners\n\nCode Owners put the decision of the group into practice and can merge smaller changes without going through the decision making process. Every code owner commits to follow the clean code community process description and to agile software engineering principles.\n\nCode Owner Teams:\n- [Clean ABAP Code Owner](https://github.com/orgs/SAP/teams/clean-abap-code-owner) - Due to technical reasons only visible to members of the SAP GitHub organization. \n\n### Merge of Pull Request\n\nPull Request are merged with squash and merge:\n- Example: [Commit Message](https://github.com/SAP/styleguides/commit/81e2d9e601c3f4e4a2c806737e161bb9826332b9)\n  - title: recommend avoiding manual versioning through comments\n  - description: #278, no vetos, 7 approvals\n\n## Process after Important Changes\n\n**Change Log:** The new rules or adjusted rules can be found in the [change log](https://github.com/SAP/styleguides/pulls?q=is%3Apr+is%3Aclosed+label%3A%22Adjustment+Of+Rule%22%2C%22New+Rule%22+is%3Amerged+)\n\nThe **Code Pal+* team is watching the merged pull request and elaborates if static code check adjustments are needed.\n\n**Update of the translations** is not directly triggered after the change is merged. The translators are asked for watching the changes and update the translation from time.\n\n## Related Topics\n\n**How are new language features considered for an update of Clean ABAP?**\n\nSeveral members of the clean abap team are part of the ABAP team and also involved when rolling out those new ABAP features. These colleagues will create a pull request to update Clean ABAP if necessary.  \n\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 18.9619140625,
          "content": "# CC BY 3.0\n\n> CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES.\n> DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE\n> COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO\n> WARRANTIES REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES\n> RESULTING FROM ITS USE.\n\nLicense\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC\nLICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW.\nANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS\nPROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE\nTERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE\nLICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH\nTERMS AND CONDITIONS.\n\n1. Definitions\n\n    a. \"Adaptation\" means a work based upon the Work, or upon the Work and other pre-existing works, such as a\n       translation, adaptation, derivative work, arrangement of music or other alterations of a literary or artistic work, or\n       phonogram or performance and includes cinematographic adaptations or any other form in which the Work may be\n       recast, transformed, or adapted including in any form recognizably derived from the original, except that a work that\n       constitutes a Collection will not be considered an Adaptation for the purpose of this License. For the avoidance of\n       doubt, where the Work is a musical work, performance or phonogram, the synchronization of the Work in timed-\n       relation with a moving image (\"synching\") will be considered an Adaptation for the purpose of this License.\n\n    b. \"Collection\" means a collection of literary or artistic works, such as encyclopedias and anthologies, or performances,\n       phonograms or broadcasts, or other works or subject matter other than works listed in Section 1(f) below, which, by\n       reason of the selection and arrangement of their contents, constitute intellectual creations, in which the Work is\n       included in its entirety in unmodified form along with one or more other contributions, each constituting separate and\n       independent works in themselves, which together are assembled into a collective whole. A work that constitutes a\n       Collection will not be considered an Adaptation (as defined above) for the purposes of this License.\n\n    c. \"Distribute\" means to make available to the public the original and copies of the Work or Adaptation, as appropriate,\n       through sale or other transfer of ownership.\n\n    d. \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this License.\n\n    e. \"Original Author\" means, in the case of a literary or artistic work, the individual, individuals, entity or entities who\n       created the Work or if no individual or entity can be identified, the publisher; and in addition (i) in the case of a\n       performance the actors, singers, musicians, dancers, and other persons who act, sing, deliver, declaim, play in,\n       interpret or otherwise perform literary or artistic works or expressions of folklore; (ii) in the case of a phonogram the\n       producer being the person or legal entity who first fixes the sounds of a performance or other sounds; and, (iii) in the\n       case of broadcasts, the organization that transmits the broadcast.\n\n    f. \"Work\" means the literary and/or artistic work offered under the terms of this License including without limitation any\n       production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression including\n       digital form, such as a book, pamphlet and other writing; a lecture, address, sermon or other work of the same nature;\n       a dramatic or dramatico-musical work; a choreographic work or entertainment in dumb show; a musical composition\n       with or without words; a cinematographic work to which are assimilated works expressed by a process analogous to\n       cinematography; a work of drawing, painting, architecture, sculpture, engraving or lithography; a photographic work to\n       which are assimilated works expressed by a process analogous to photography; a work of applied art; an illustration,\n       map, plan, sketch or three-dimensional work relative to geography, topography, architecture or science; a\n       performance; a broadcast; a phonogram; a compilation of data to the extent it is protected as a copyrightable work; or\n       a work performed by a variety or circus performer to the extent it is not otherwise considered a literary or artistic work.\n\n    g. \"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of\n       this License with respect to the Work, or who has received express permission from the Licensor to exercise rights\n       under this License despite a previous violation.\n\n    h. \"Publicly Perform\" means to perform public recitations of the Work and to communicate to the public those public\n       recitations, by any means or process, including by wire or wireless means or public digital performances; to make\n       available to the public Works in such a way that members of the public may access these Works from a place and at a\n       place individually chosen by them; to perform the Work to the public by any means or process and the communication\n       to the public of the performances of the Work, including by public digital performance; to broadcast and rebroadcast\n       the Work by any means including signs, sounds or images.\n\n    i. \"Reproduce\" means to make copies of the Work by any means including without limitation by sound or visual\n       recordings and the right of fixation and reproducing fixations of the Work, including storage of a protected performance\n       or phonogram in digital form or other electronic medium.\n\n2. Fair Dealing Rights. Nothing in this License is intended to reduce, limit, or restrict any uses free from copyright or rights\narising from limitations or exceptions that are provided for in connection with the copyright protection under copyright law or\nother applicable laws.\n\n3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free,\nnon-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated\nbelow:\n\n    a. to Reproduce the Work, to incorporate the Work into one or more Collections, and to Reproduce the Work\n       as incorporated in the Collections;\n\n    b. to create and Reproduce Adaptations provided that any such Adaptation, including any translation in any medium,\n       takes reasonable steps to clearly label, demarcate or otherwise identify that changes were made to the original Work.\n        For example, a translation could be marked \"The original work was translated from English to Spanish,\" or a\n        modification could indicate \"The original work has been modified.\";\n\n    c. to Distribute and Publicly Perform the Work including as incorporated in Collections; and,\n\n    d. to Distribute and Publicly Perform Adaptations.\n\n    e. For the avoidance of doubt:\n\n          i. Non-waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties\n             through any statutory or compulsory licensing scheme cannot be waived, the Licensor reserves the exclusive\n             right to collect such royalties for any exercise by You of the rights granted under this License;\n\n         ii. Waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through\n             any statutory or compulsory licensing scheme can be waived, the Licensor waives the exclusive right to collect\n             such royalties for any exercise by You of the rights granted under this License; and,\n\n        iii. Voluntary License Schemes. The Licensor waives the right to collect royalties, whether individually or, in the\n             event that the Licensor is a member of a collecting society that administers voluntary licensing schemes, via\n             that society, from any exercise by You of the rights granted under this License.\n\nThe above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. Subject to Section 8(f), all rights not expressly granted by Licensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:\n\n    a. You may Distribute or Publicly Perform the Work only under the terms of this License. You must include a copy of, or\n       the Uniform Resource Identifier (URI) for, this License with every copy of the Work You Distribute or Publicly Perform.\n       You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of the recipient\n       of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the\n       Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties with every copy of\n       the Work You Distribute or Publicly Perform. When You Distribute or Publicly Perform the Work, You may not impose\n       any effective technological measures on the Work that restrict the ability of a recipient of the Work from You to\n       exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as\n       incorporated in a Collection, but this does not require the Collection apart from the Work itself to be made subject to\n       the terms of this License. If You create a Collection, upon notice from any Licensor You must, to the extent practicable,\n       remove from the Collection any credit as required by Section 4(b), as requested. If You create an Adaptation, upon\n       notice from any Licensor You must, to the extent practicable, remove from the Adaptation any credit as required by\n       Section 4(b), as requested.\n\n    b. If You Distribute, or Publicly Perform the Work or any Adaptations or Collections, You must, unless a request has been\n       made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium\n       or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or if the\n       Original Author and/or Licensor designate another party or parties (e.g., a sponsor institute, publishing entity, journal)\n       for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the\n       name of such party or parties; (ii) the title of the Work if supplied; (iii) to the extent reasonably practicable, the URI, if\n       any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or\n       licensing information for the Work; and (iv) , consistent with Section 3(b), in the case of an Adaptation, a credit\n       identifying the use of the Work in the Adaptation (e.g., \"French translation of the Work by Original Author,\" or\n       \"Screenplay based on original Work by Original Author\"). The credit required by this Section 4 (b) may be\n       implemented in any reasonable manner; provided, however, that in the case of a Adaptation or Collection, at a\n       minimum such credit will appear, if a credit for all contributing authors of the Adaptation or Collection appears, then as\n       part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the\n       avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner\n       set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any\n       connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as\n       appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original\n       Author, Licensor and/or Attribution Parties.\n\n    c. Except as otherwise agreed in writing by the Licensor or as may be otherwise permitted by applicable law, if You\n       Reproduce, Distribute or Publicly Perform the Work either by itself or as part of any Adaptations or Collections, You\n       must not distort, mutilate, modify or take other derogatory action in relation to the Work which would be prejudicial to\n       the Original Author's honor or reputation. Licensor agrees that in those jurisdictions (e.g. Japan), in which any\n       exercise of the right granted in Section 3(b) of this License (the right to make Adaptations) would be deemed to be a\n       distortion, mutilation, modification or other derogatory action prejudicial to the Original Author's honor and reputation,\n       the Licensor will waive or not assert, as appropriate, this Section, to the fullest extent permitted by the applicable\n       national law, to enable You to reasonably exercise Your right under Section 3(b) of this License (right to make\n       Adaptations) but not otherwise.\n\n5. Representations, Warranties and Disclaimer\n\nUNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS\nAND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS,\nIMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE,\nMERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT\nOR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT\nDISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH\nEXCLUSION MAY NOT APPLY TO YOU.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR\nBE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR\nEXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS\nBEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. Termination\n\n    a. This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this\n       License. Individuals or entities who have received Adaptations or Collections from You under this License, however,\n       will not have their licenses terminated provided such individuals or entities remain in full compliance with those\n       licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.\n\n    b. Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable\n       copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different\n       license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to\n       withdraw this License (or any other license that has been, or is required to be, granted under the terms of this\n       License), and this License will continue in full force and effect unless terminated as stated above.\n\n8. Miscellaneous\n\n    a. Each time You Distribute or Publicly Perform the Work or a Collection, the Licensor offers to the recipient a license to\n       the Work on the same terms and conditions as the license granted to You under this License.\n\n    b. Each time You Distribute or Publicly Perform an Adaptation, Licensor offers to the recipient a license to the original\n       Work on the same terms and conditions as the license granted to You under this License.\n\n    c. If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or\n       enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement,\n       such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\n    d. No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or\n       consent shall be in writing and signed by the party to be charged with such waiver or consent.\n\n    e. This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are\n       no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be\n       bound by any additional provisions that may appear in any communication from You. This License may not be\n       modified without the mutual written agreement of the Licensor and You.\n\n    f. The rights granted under, and the subject matter referenced, in this License were drafted utilizing the terminology of\n       the Berne Convention for the Protection of Literary and Artistic Works (as amended on September 28, 1979), the\n       Rome Convention of 1961, the WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms Treaty of\n       1996 and the Universal Copyright Convention (as revised on July 24, 1971). These rights and subject matter take\n       effect in the relevant jurisdiction in which the License terms are sought to be enforced according to the corresponding\n       provisions of the implementation of those treaty provisions in the applicable national law. If the standard suite of rights\n       granted under applicable copyright law includes additional rights not granted under this License, such additional rights\n       are deemed to be included in the License; this License is not intended to restrict the license of any rights under\n       applicable law.\n\n> Creative Commons Notice\n\n> Creative Commons is not a party to this License, and makes no warranty whatsoever in connection with the Work.\n> Creative Commons will not be liable to You or any party on any legal theory for any damages whatsoever, including\n> without limitation any general, special, incidental or consequential damages arising in connection to this license.\n> Notwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor\n> hereunder, it shall have all rights and obligations of Licensor.\n\n> Except for the limited purpose of indicating to the public that the Work is licensed under the CCPL, Creative Commons\n> does not authorize the use by either party of the trademark \"Creative Commons\" or any related trademark or logo of\n> Creative Commons without the prior written consent of Creative Commons. Any permitted use will be in compliance with\n> Creative Commons' then-current trademark usage guidelines, as may be published on its website or otherwise made\n> available upon request from time to time. For the avoidance of doubt, this trademark restriction does not form part of this\n> License.\n\n> Creative Commons may be contacted at https://creativecommons.org/."
        },
        {
          "name": "LICENSES",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.361328125,
          "content": "# SAP Code Style Guides\n\n[![REUSE status](https://api.reuse.software/badge/github.com/SAP/styleguides)](https://api.reuse.software/info/github.com/SAP/styleguides)\n\n[**Continuous Release**](#continuous-release)\n&nbsp;路&nbsp;\n[**Open Source**](#open-source)\n&nbsp;路&nbsp;\n[**Grassroots Project**](#grassroots-project)\n&nbsp;路&nbsp;\n[**Optional**](#optional)\n&nbsp;路&nbsp;\n[**Ecosystem**](#ecosystem)\n\nThis repository provides SAP's style guides for coding.\n\nProgramming languages enable us to say the same thing in different ways.\nWhile all of them may be correct, some may be more efficient,\neasier to understand, and more robust than others.\n\nOur style guides want to show up differences and guide you\ntowards code that has a healthy balance between all of these qualities.\n\n## Style Guides\n\n- [**Clean ABAP**](clean-abap/CleanABAP.md)\n- [**ABAP Code Reviews**](abap-code-review/ABAPCodeReview.md)\n\n## Continuous Release\n\nThese guides are updated **continuously**,\nmeaning any change is reviewed and immediately put \"live\",\nwithout special publication versions.\n\nAs programming languages and our understanding of them evolve,\nwe believe that these guides are \"work in progress\"\nand will probably never see a status \"finished\";\nas agile developers, we welcome this.\n\n## Open Source\n\nThis repository is **open source**,\nmeaning it is written by a loose community of interested persons,\nand anybody from within and without SAP is invited to contribute.\n\n[LICENSE](LICENSE) describes how you may use this material.\n[Creative Commons' summary](https://creativecommons.org/licenses/by/3.0/)\nmay be easier to understand for non-jurists.\nIn short, you can freely use and share this repository's content.\nYou can also use it in own works, such as presentations or books,\neven commercially, as long as you give credit to this source,\nand point out your changes. Detailed information including third-party\ncomponents and their licensing/copyright information is available\nvia the\n[REUSE tool](https://api.reuse.software/info/github.com/SAP/styleguides).\n\n[CONTRIBUTING](CONTRIBUTING.md) describes how you can contribute.\nIn short, you can use GitHub's standard means to add to this repository,\nand you have to agree to our [license](LICENSE) to contribute directly.\n\nWe believe that clean code should be discussed freely and openly.\n\n## Grassroots Project\n\nThese guides are **grassroots projects**, meaning they were started,\nand are still driven, by programmers who spend their day coding,\nand want to get better at it.\n\nWe are developers, architects, quality engineers, and consultants,\nfrom associates to chief experts,\nfrom language creators to tool developers,\nfrom S/4HANA to the ABAP language group.\nWe respect all roles, ranks, and units,\nand welcome any suggestions and improvements.\n\n## Optional\n\nFollowing these style guides is **optional**,\nmeaning you - or more precisely: your team -\ncan choose whether you want to adhere to it.\nThis applies equally to in-house developers, partners, and customers.\n\nWe believe that clean code comes from conviction, not from pressure.\n\n## Ecosystem \n\nIf you want to learn more about the motivation, the underlying principles and the forming ecosystem of tools, books and related practices around the style guide, you can follow the [blog on Clean Code: Writing maintainable, readable and testable code](https://blogs.sap.com/2022/12/21/clean-code-writing-maintainable-readable-and-testable-code/).  \n"
        },
        {
          "name": "abap-code-review",
          "type": "tree",
          "content": null
        },
        {
          "name": "clean-abap",
          "type": "tree",
          "content": null
        },
        {
          "name": "mlc_config.json",
          "type": "blob",
          "size": 0.1328125,
          "content": "{  \n  \"timeout\": \"20s\",\n  \"retryOn429\": true,\n  \"retryCount\": 5,\n  \"fallbackRetryDelay\": \"30s\",\n  \"aliveStatusCodes\": [200, 206, 403]\n}\n"
        },
        {
          "name": "package-lock.json",
          "type": "blob",
          "size": 14.5498046875,
          "content": "{\n  \"name\": \"sap-code-style-guides\",\n  \"version\": \"1.0.0\",\n  \"lockfileVersion\": 3,\n  \"requires\": true,\n  \"packages\": {\n    \"\": {\n      \"name\": \"sap-code-style-guides\",\n      \"version\": \"1.0.0\",\n      \"license\": \"ISC\",\n      \"devDependencies\": {\n        \"markdown-link-check\": \"^3.11.1\"\n      }\n    },\n    \"node_modules/async\": {\n      \"version\": \"3.2.4\",\n      \"resolved\": \"https://registry.npmjs.org/async/-/async-3.2.4.tgz\",\n      \"integrity\": \"sha512-iAB+JbDEGXhyIUavoDl9WP/Jj106Kz9DEn1DPgYw5ruDn0e3Wgi3sKFm55sASdGBNOQB8F59d9qQ7deqrHA8wQ==\",\n      \"dev\": true\n    },\n    \"node_modules/boolbase\": {\n      \"version\": \"1.0.0\",\n      \"resolved\": \"https://registry.npmjs.org/boolbase/-/boolbase-1.0.0.tgz\",\n      \"integrity\": \"sha512-JZOSA7Mo9sNGB8+UjSgzdLtokWAky1zbztM3WRLCbZ70/3cTANmQmOdR7y2g+J0e2WXywy1yS468tY+IruqEww==\",\n      \"dev\": true\n    },\n    \"node_modules/chalk\": {\n      \"version\": \"5.2.0\",\n      \"resolved\": \"https://registry.npmjs.org/chalk/-/chalk-5.2.0.tgz\",\n      \"integrity\": \"sha512-ree3Gqw/nazQAPuJJEy+avdl7QfZMcUvmHIKgEZkGL+xOBzRvup5Hxo6LHuMceSxOabuJLJm5Yp/92R9eMmMvA==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \"^12.17.0 || ^14.13 || >=16.0.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/chalk/chalk?sponsor=1\"\n      }\n    },\n    \"node_modules/cheerio\": {\n      \"version\": \"1.0.0-rc.12\",\n      \"resolved\": \"https://registry.npmjs.org/cheerio/-/cheerio-1.0.0-rc.12.tgz\",\n      \"integrity\": \"sha512-VqR8m68vM46BNnuZ5NtnGBKIE/DfN0cRIzg9n40EIq9NOv90ayxLBXA8fXC5gquFRGJSTRqBq25Jt2ECLR431Q==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"cheerio-select\": \"^2.1.0\",\n        \"dom-serializer\": \"^2.0.0\",\n        \"domhandler\": \"^5.0.3\",\n        \"domutils\": \"^3.0.1\",\n        \"htmlparser2\": \"^8.0.1\",\n        \"parse5\": \"^7.0.0\",\n        \"parse5-htmlparser2-tree-adapter\": \"^7.0.0\"\n      },\n      \"engines\": {\n        \"node\": \">= 6\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/cheeriojs/cheerio?sponsor=1\"\n      }\n    },\n    \"node_modules/cheerio-select\": {\n      \"version\": \"2.1.0\",\n      \"resolved\": \"https://registry.npmjs.org/cheerio-select/-/cheerio-select-2.1.0.tgz\",\n      \"integrity\": \"sha512-9v9kG0LvzrlcungtnJtpGNxY+fzECQKhK4EGJX2vByejiMX84MFNQw4UxPJl3bFbTMw+Dfs37XaIkCwTZfLh4g==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"boolbase\": \"^1.0.0\",\n        \"css-select\": \"^5.1.0\",\n        \"css-what\": \"^6.1.0\",\n        \"domelementtype\": \"^2.3.0\",\n        \"domhandler\": \"^5.0.3\",\n        \"domutils\": \"^3.0.1\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/sponsors/fb55\"\n      }\n    },\n    \"node_modules/commander\": {\n      \"version\": \"10.0.0\",\n      \"resolved\": \"https://registry.npmjs.org/commander/-/commander-10.0.0.tgz\",\n      \"integrity\": \"sha512-zS5PnTI22FIRM6ylNW8G4Ap0IEOyk62fhLSD0+uHRT9McRCLGpkVNvao4bjimpK/GShynyQkFFxHhwMcETmduA==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \">=14\"\n      }\n    },\n    \"node_modules/css-select\": {\n      \"version\": \"5.1.0\",\n      \"resolved\": \"https://registry.npmjs.org/css-select/-/css-select-5.1.0.tgz\",\n      \"integrity\": \"sha512-nwoRF1rvRRnnCqqY7updORDsuqKzqYJ28+oSMaJMMgOauh3fvwHqMS7EZpIPqK8GL+g9mKxF1vP/ZjSeNjEVHg==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"boolbase\": \"^1.0.0\",\n        \"css-what\": \"^6.1.0\",\n        \"domhandler\": \"^5.0.2\",\n        \"domutils\": \"^3.0.1\",\n        \"nth-check\": \"^2.0.1\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/sponsors/fb55\"\n      }\n    },\n    \"node_modules/css-what\": {\n      \"version\": \"6.1.0\",\n      \"resolved\": \"https://registry.npmjs.org/css-what/-/css-what-6.1.0.tgz\",\n      \"integrity\": \"sha512-HTUrgRJ7r4dsZKU6GjmpfRK1O76h97Z8MfS1G0FozR+oF2kG6Vfe8JE6zwrkbxigziPHinCJ+gCPjA9EaBDtRw==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \">= 6\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/sponsors/fb55\"\n      }\n    },\n    \"node_modules/debug\": {\n      \"version\": \"3.2.7\",\n      \"resolved\": \"https://registry.npmjs.org/debug/-/debug-3.2.7.tgz\",\n      \"integrity\": \"sha512-CFjzYYAi4ThfiQvizrFQevTTXHtnCqWfe7x1AhgEscTz6ZbLbfoLRLPugTQyBth6f8ZERVUSyWHFD/7Wu4t1XQ==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"ms\": \"^2.1.1\"\n      }\n    },\n    \"node_modules/dom-serializer\": {\n      \"version\": \"2.0.0\",\n      \"resolved\": \"https://registry.npmjs.org/dom-serializer/-/dom-serializer-2.0.0.tgz\",\n      \"integrity\": \"sha512-wIkAryiqt/nV5EQKqQpo3SToSOV9J0DnbJqwK7Wv/Trc92zIAYZ4FlMu+JPFW1DfGFt81ZTCGgDEabffXeLyJg==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"domelementtype\": \"^2.3.0\",\n        \"domhandler\": \"^5.0.2\",\n        \"entities\": \"^4.2.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/cheeriojs/dom-serializer?sponsor=1\"\n      }\n    },\n    \"node_modules/domelementtype\": {\n      \"version\": \"2.3.0\",\n      \"resolved\": \"https://registry.npmjs.org/domelementtype/-/domelementtype-2.3.0.tgz\",\n      \"integrity\": \"sha512-OLETBj6w0OsagBwdXnPdN0cnMfF9opN69co+7ZrbfPGrdpPVNBUj02spi6B1N7wChLQiPn4CSH/zJvXw56gmHw==\",\n      \"dev\": true,\n      \"funding\": [\n        {\n          \"type\": \"github\",\n          \"url\": \"https://github.com/sponsors/fb55\"\n        }\n      ]\n    },\n    \"node_modules/domhandler\": {\n      \"version\": \"5.0.3\",\n      \"resolved\": \"https://registry.npmjs.org/domhandler/-/domhandler-5.0.3.tgz\",\n      \"integrity\": \"sha512-cgwlv/1iFQiFnU96XXgROh8xTeetsnJiDsTc7TYCLFd9+/WNkIqPTxiM/8pSd8VIrhXGTf1Ny1q1hquVqDJB5w==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"domelementtype\": \"^2.3.0\"\n      },\n      \"engines\": {\n        \"node\": \">= 4\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/fb55/domhandler?sponsor=1\"\n      }\n    },\n    \"node_modules/domutils\": {\n      \"version\": \"3.0.1\",\n      \"resolved\": \"https://registry.npmjs.org/domutils/-/domutils-3.0.1.tgz\",\n      \"integrity\": \"sha512-z08c1l761iKhDFtfXO04C7kTdPBLi41zwOZl00WS8b5eiaebNpY00HKbztwBq+e3vyqWNwWF3mP9YLUeqIrF+Q==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"dom-serializer\": \"^2.0.0\",\n        \"domelementtype\": \"^2.3.0\",\n        \"domhandler\": \"^5.0.1\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/fb55/domutils?sponsor=1\"\n      }\n    },\n    \"node_modules/entities\": {\n      \"version\": \"4.4.0\",\n      \"resolved\": \"https://registry.npmjs.org/entities/-/entities-4.4.0.tgz\",\n      \"integrity\": \"sha512-oYp7156SP8LkeGD0GF85ad1X9Ai79WtRsZ2gxJqtBuzH+98YUV6jkHEKlZkMbcrjJjIVJNIDP/3WL9wQkoPbWA==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \">=0.12\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/fb55/entities?sponsor=1\"\n      }\n    },\n    \"node_modules/html-link-extractor\": {\n      \"version\": \"1.0.5\",\n      \"resolved\": \"https://registry.npmjs.org/html-link-extractor/-/html-link-extractor-1.0.5.tgz\",\n      \"integrity\": \"sha512-ADd49pudM157uWHwHQPUSX4ssMsvR/yHIswOR5CUfBdK9g9ZYGMhVSE6KZVHJ6kCkR0gH4htsfzU6zECDNVwyw==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"cheerio\": \"^1.0.0-rc.10\"\n      }\n    },\n    \"node_modules/htmlparser2\": {\n      \"version\": \"8.0.2\",\n      \"resolved\": \"https://registry.npmjs.org/htmlparser2/-/htmlparser2-8.0.2.tgz\",\n      \"integrity\": \"sha512-GYdjWKDkbRLkZ5geuHs5NY1puJ+PXwP7+fHPRz06Eirsb9ugf6d8kkXav6ADhcODhFFPMIXyxkxSuMf3D6NCFA==\",\n      \"dev\": true,\n      \"funding\": [\n        \"https://github.com/fb55/htmlparser2?sponsor=1\",\n        {\n          \"type\": \"github\",\n          \"url\": \"https://github.com/sponsors/fb55\"\n        }\n      ],\n      \"dependencies\": {\n        \"domelementtype\": \"^2.3.0\",\n        \"domhandler\": \"^5.0.3\",\n        \"domutils\": \"^3.0.1\",\n        \"entities\": \"^4.4.0\"\n      }\n    },\n    \"node_modules/iconv-lite\": {\n      \"version\": \"0.6.3\",\n      \"resolved\": \"https://registry.npmjs.org/iconv-lite/-/iconv-lite-0.6.3.tgz\",\n      \"integrity\": \"sha512-4fCk79wshMdzMp2rH06qWrJE4iolqLhCUH+OiuIgU++RB0+94NlDL81atO7GX55uUKueo0txHNtvEyI6D7WdMw==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"safer-buffer\": \">= 2.1.2 < 3.0.0\"\n      },\n      \"engines\": {\n        \"node\": \">=0.10.0\"\n      }\n    },\n    \"node_modules/is-absolute-url\": {\n      \"version\": \"4.0.1\",\n      \"resolved\": \"https://registry.npmjs.org/is-absolute-url/-/is-absolute-url-4.0.1.tgz\",\n      \"integrity\": \"sha512-/51/TKE88Lmm7Gc4/8btclNXWS+g50wXhYJq8HWIBAGUBnoAdRu1aXeh364t/O7wXDAcTJDP8PNuNKWUDWie+A==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \"^12.20.0 || ^14.13.1 || >=16.0.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/sponsors/sindresorhus\"\n      }\n    },\n    \"node_modules/is-relative-url\": {\n      \"version\": \"4.0.0\",\n      \"resolved\": \"https://registry.npmjs.org/is-relative-url/-/is-relative-url-4.0.0.tgz\",\n      \"integrity\": \"sha512-PkzoL1qKAYXNFct5IKdKRH/iBQou/oCC85QhXj6WKtUQBliZ4Yfd3Zk27RHu9KQG8r6zgvAA2AQKC9p+rqTszg==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"is-absolute-url\": \"^4.0.1\"\n      },\n      \"engines\": {\n        \"node\": \">=14.16\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/sponsors/sindresorhus\"\n      }\n    },\n    \"node_modules/isemail\": {\n      \"version\": \"3.2.0\",\n      \"resolved\": \"https://registry.npmjs.org/isemail/-/isemail-3.2.0.tgz\",\n      \"integrity\": \"sha512-zKqkK+O+dGqevc93KNsbZ/TqTUFd46MwWjYOoMrjIMZ51eU7DtQG3Wmd9SQQT7i7RVnuTPEiYEWHU3MSbxC1Tg==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"punycode\": \"2.x.x\"\n      },\n      \"engines\": {\n        \"node\": \">=4.0.0\"\n      }\n    },\n    \"node_modules/link-check\": {\n      \"version\": \"5.2.0\",\n      \"resolved\": \"https://registry.npmjs.org/link-check/-/link-check-5.2.0.tgz\",\n      \"integrity\": \"sha512-xRbhYLaGDw7eRDTibTAcl6fXtmUQ13vkezQiTqshHHdGueQeumgxxmQMIOmJYsh2p8BF08t8thhDQ++EAOOq3w==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"is-relative-url\": \"^4.0.0\",\n        \"isemail\": \"^3.2.0\",\n        \"ms\": \"^2.1.3\",\n        \"needle\": \"^3.1.0\"\n      }\n    },\n    \"node_modules/lodash\": {\n      \"version\": \"4.17.21\",\n      \"resolved\": \"https://registry.npmjs.org/lodash/-/lodash-4.17.21.tgz\",\n      \"integrity\": \"sha512-v2kDEe57lecTulaDIuNTPy3Ry4gLGJ6Z1O3vE1krgXZNrsQ+LFTGHVxVjcXPs17LhbZVGedAJv8XZ1tvj5FvSg==\",\n      \"dev\": true\n    },\n    \"node_modules/markdown-link-check\": {\n      \"version\": \"3.11.1\",\n      \"resolved\": \"https://registry.npmjs.org/markdown-link-check/-/markdown-link-check-3.11.1.tgz\",\n      \"integrity\": \"sha512-1O5CYb1qbrQGwG9kx3GKZ1t128ZMojKZwDCrGP7mC/xvXSF8KfMjcSUhdtdhvNJeDyNUO23YaAu7hSD72h9w5Q==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"async\": \"^3.2.4\",\n        \"chalk\": \"^5.2.0\",\n        \"commander\": \"^10.0.0\",\n        \"link-check\": \"^5.2.0\",\n        \"lodash\": \"^4.17.21\",\n        \"markdown-link-extractor\": \"^3.1.0\",\n        \"needle\": \"^3.2.0\",\n        \"progress\": \"^2.0.3\"\n      },\n      \"bin\": {\n        \"markdown-link-check\": \"markdown-link-check\"\n      }\n    },\n    \"node_modules/markdown-link-extractor\": {\n      \"version\": \"3.1.0\",\n      \"resolved\": \"https://registry.npmjs.org/markdown-link-extractor/-/markdown-link-extractor-3.1.0.tgz\",\n      \"integrity\": \"sha512-r0NEbP1dsM+IqB62Ru9TXLP/HDaTdBNIeylYXumuBi6Xv4ufjE1/g3TnslYL8VNqNcGAGbMptQFHrrdfoZ/Sug==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"html-link-extractor\": \"^1.0.5\",\n        \"marked\": \"^4.1.0\"\n      }\n    },\n    \"node_modules/marked\": {\n      \"version\": \"4.3.0\",\n      \"resolved\": \"https://registry.npmjs.org/marked/-/marked-4.3.0.tgz\",\n      \"integrity\": \"sha512-PRsaiG84bK+AMvxziE/lCFss8juXjNaWzVbN5tXAm4XjeaS9NAHhop+PjQxz2A9h8Q4M/xGmzP8vqNwy6JeK0A==\",\n      \"dev\": true,\n      \"bin\": {\n        \"marked\": \"bin/marked.js\"\n      },\n      \"engines\": {\n        \"node\": \">= 12\"\n      }\n    },\n    \"node_modules/ms\": {\n      \"version\": \"2.1.3\",\n      \"resolved\": \"https://registry.npmjs.org/ms/-/ms-2.1.3.tgz\",\n      \"integrity\": \"sha512-6FlzubTLZG3J2a/NVCAleEhjzq5oxgHyaCU9yYXvcLsvoVaHJq/s5xXI6/XXP6tz7R9xAOtHnSO/tXtF3WRTlA==\",\n      \"dev\": true\n    },\n    \"node_modules/needle\": {\n      \"version\": \"3.2.0\",\n      \"resolved\": \"https://registry.npmjs.org/needle/-/needle-3.2.0.tgz\",\n      \"integrity\": \"sha512-oUvzXnyLiVyVGoianLijF9O/RecZUf7TkBfimjGrLM4eQhXyeJwM6GeAWccwfQ9aa4gMCZKqhAOuLaMIcQxajQ==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"debug\": \"^3.2.6\",\n        \"iconv-lite\": \"^0.6.3\",\n        \"sax\": \"^1.2.4\"\n      },\n      \"bin\": {\n        \"needle\": \"bin/needle\"\n      },\n      \"engines\": {\n        \"node\": \">= 4.4.x\"\n      }\n    },\n    \"node_modules/nth-check\": {\n      \"version\": \"2.1.1\",\n      \"resolved\": \"https://registry.npmjs.org/nth-check/-/nth-check-2.1.1.tgz\",\n      \"integrity\": \"sha512-lqjrjmaOoAnWfMmBPL+XNnynZh2+swxiX3WUE0s4yEHI6m+AwrK2UZOimIRl3X/4QctVqS8AiZjFqyOGrMXb/w==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"boolbase\": \"^1.0.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/fb55/nth-check?sponsor=1\"\n      }\n    },\n    \"node_modules/parse5\": {\n      \"version\": \"7.1.2\",\n      \"resolved\": \"https://registry.npmjs.org/parse5/-/parse5-7.1.2.tgz\",\n      \"integrity\": \"sha512-Czj1WaSVpaoj0wbhMzLmWD69anp2WH7FXMB9n1Sy8/ZFF9jolSQVMu1Ij5WIyGmcBmhk7EOndpO4mIpihVqAXw==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"entities\": \"^4.4.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/inikulin/parse5?sponsor=1\"\n      }\n    },\n    \"node_modules/parse5-htmlparser2-tree-adapter\": {\n      \"version\": \"7.0.0\",\n      \"resolved\": \"https://registry.npmjs.org/parse5-htmlparser2-tree-adapter/-/parse5-htmlparser2-tree-adapter-7.0.0.tgz\",\n      \"integrity\": \"sha512-B77tOZrqqfUfnVcOrUvfdLbz4pu4RopLD/4vmu3HUPswwTA8OH0EMW9BlWR2B0RCoiZRAHEUu7IxeP1Pd1UU+g==\",\n      \"dev\": true,\n      \"dependencies\": {\n        \"domhandler\": \"^5.0.2\",\n        \"parse5\": \"^7.0.0\"\n      },\n      \"funding\": {\n        \"url\": \"https://github.com/inikulin/parse5?sponsor=1\"\n      }\n    },\n    \"node_modules/progress\": {\n      \"version\": \"2.0.3\",\n      \"resolved\": \"https://registry.npmjs.org/progress/-/progress-2.0.3.tgz\",\n      \"integrity\": \"sha512-7PiHtLll5LdnKIMw100I+8xJXR5gW2QwWYkT6iJva0bXitZKa/XMrSbdmg3r2Xnaidz9Qumd0VPaMrZlF9V9sA==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \">=0.4.0\"\n      }\n    },\n    \"node_modules/punycode\": {\n      \"version\": \"2.3.0\",\n      \"resolved\": \"https://registry.npmjs.org/punycode/-/punycode-2.3.0.tgz\",\n      \"integrity\": \"sha512-rRV+zQD8tVFys26lAGR9WUuS4iUAngJScM+ZRSKtvl5tKeZ2t5bvdNFdNHBW9FWR4guGHlgmsZ1G7BSm2wTbuA==\",\n      \"dev\": true,\n      \"engines\": {\n        \"node\": \">=6\"\n      }\n    },\n    \"node_modules/safer-buffer\": {\n      \"version\": \"2.1.2\",\n      \"resolved\": \"https://registry.npmjs.org/safer-buffer/-/safer-buffer-2.1.2.tgz\",\n      \"integrity\": \"sha512-YZo3K82SD7Riyi0E1EQPojLz7kpepnSQI9IyPbHHg1XXXevb5dJI7tpyN2ADxGcQbHG7vcyRHk0cbwqcQriUtg==\",\n      \"dev\": true\n    },\n    \"node_modules/sax\": {\n      \"version\": \"1.2.4\",\n      \"resolved\": \"https://registry.npmjs.org/sax/-/sax-1.2.4.tgz\",\n      \"integrity\": \"sha512-NqVDv9TpANUjFm0N8uM5GxL36UgKi9/atZw+x7YFnQ8ckwFGKrl4xX4yWtrey3UJm5nP1kUbnYgLopqWNSRhWw==\",\n      \"dev\": true\n    }\n  }\n}\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.6416015625,
          "content": "{\n  \"name\": \"sap-code-style-guides\",\n  \"version\": \"1.0.0\",\n  \"private\": true,\n  \"description\": \"SAP's style guides for coding.\",\n  \"main\": \"index.js\",\n  \"scripts\": {\n    \"test\": \"find . -path ./node_modules -prune -false -o -name '*.md' ! -name '*_??.md' -print0 | xargs -0 -n1 markdown-link-check -q -c mlc_config.json\"\n  },\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/SAP/styleguides.git\"\n  },\n  \"author\": \"\",\n  \"license\": \"ISC\",\n  \"bugs\": {\n    \"url\": \"https://github.com/SAP/styleguides/issues\"\n  },\n  \"homepage\": \"https://github.com/SAP/styleguides#readme\",\n  \"devDependencies\": {\n    \"markdown-link-check\": \"^3.11.1\"\n  }\n}\n"
        },
        {
          "name": "translation_v2.json",
          "type": "blob",
          "size": 0.5185546875,
          "content": "{\n  \"comment\": \"More information: https://jam4.sapjam.com/wiki/show/UFKzGv6i81yui7orPvmwtQ\",\n  \"collections\": [\n    {\n      \"collectionName\": \"Clean_ABAP\",\n      \"folders\": [\n        {\n          \"startingFolderPath\": \"**/clean-abap/**\",\n          \"sourceFilters\": [\n            \"CleanABAP.md\"\n          ],\n          \"targetFolderPath\": \".\"\n        }\n      ]\n    }\n  ],\n  \"defaultConfiguration\": {\n    \"pseudoLocFolderPath\": \".\",\n    \"oneQFolderPath\": \".\",\n    \"targetFileNamingConvention\": \"[filename]_[langCode].[extension]\"\n  }\n}"
        }
      ]
    }
  ]
}