{
  "metadata": {
    "timestamp": 1736561222176,
    "page": 201,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mail-in-a-box/mailinabox",
      "stars": 14149,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.4248046875,
          "content": "# EditorConfig helps developers define and maintain consistent\n# coding styles between different editors and IDEs\n# editorconfig.org\n\nroot = true\n\n[*]\nindent_style = space\nindent_size = 4\nend_of_line = lf\ncharset = utf-8\ntrim_trailing_whitespace = true\ninsert_final_newline = true\n\n[Makefile]\nindent_style = tab\nindent_size = 4\n\n[Vagrantfile]\nindent_size = 2\n\n[*.rb]\nindent_size = 2\n\n[*.py]\nindent_style = tab\n\n[*.js]\nindent_size = 2\n\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.126953125,
          "content": "*~\ntests/__pycache__/\nmanagement/__pycache__/\ntools/__pycache__/\nexternals/\n.env\n.vagrant\napi/docs/api-docs.html\n*.code-workspace\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 62.7265625,
          "content": "CHANGELOG\n=========\n\nVersion 71 (January 4, 2025)\n----------------------------\n\n(Version 71a was posted on January 6, 2025 and fixes a setup regression.)\n\nUpgrades\n\n* Roundcube upgraded to version 1.6.9.\n* Z-Push upgraded to version 2.7.5.\n\nAutomated Maintenance\n\n* Daily automated tasks are now run at 1am in the box's timezone and full backups are now restricted to running only on Saturdays and Sundays at that time.\n* Backups now exclude the owncloud-backup folder so that we're not backing up backups.\n* Old TLS certificates are now automatically deleted to improve control panel performance.\n\nSetup\n\n* Fixed broken setup if SSH was configured to listen on multiple ports.\n* Ubuntu MOTD advertisements are now disabled.\n* Fixed missing Roundcube dependency package if NextCloud isn't installed.\n\nControl Panel\n\n* Improved status checks for secondary nameservers.\n* Spamhaus is now queried for the box's IPv6 address also.\n* DSA and EC private keys are now accepted for TLS certificates.\n* Timeouts for loading slow control panel pages are reduced.\n\nAnd other minor fixes.\n\nVersion 70 (August 15, 2024)\n----------------------------\n\n* Roundcube is updated to version 1.6.8 fixing security vulnerabilities.\n\nVersion 69 (July 20, 2024)\n--------------------------\n\nPackage updates:\n\n* Nextcloud is updated to 26.0.13.\n* Z-Push is updated to 2.7.3.\n\nOther updates:\n\n* Fixed an error generating the weekly statistics.\n* Fixed file permissions when setting up Nextcloud.\n* Added an undocumented option to proxy websockets.\n* Internal improvements to the code to make it more reliable and readable.\n\nVersion 69a (July 21, 2024) and 69b (July 23, 2024) correct setup failures.\n\nVersion 68 (April 1, 2024)\n--------------------------\n\nPackage updates:\n\n* Roundcube updated to version 1.6.6.\n* Nextcloud is updated to version 26.0.12.\n\nMail:\n\n* Updated postfix's configuration to guard against SMTP smuggling to the long-term fix (https://www.postfix.org/smtp-smuggling.html).\n\nControl Panel:\n\n* Improved reporting of Spamhaus response codes.\n* Improved detection of SSH port.\n* Fixed an error if last saved status check results were corrupted.\n* Other minor fixes.\n\nOther:\n\n* fail2ban is updated to see \"HTTP/2.0\" requests to munin also.\n* Internal improvements to the code to make it more reliable and readable.\n\nVersion 67 (December 22, 2023)\n------------------------------\n\n* Guard against a newly published vulnerability called SMTP Smuggling. See https://sec-consult.com/blog/detail/smtp-smuggling-spoofing-e-mails-worldwide/.\n\nVersion 66 (December 17, 2023)\n------------------------------\n\n* Some users reported an error installing Mail-in-a-Box related to the virtualenv command. This is hopefully fixed.\n* Roundcube is updated to 1.6.5 fixing a security vulnerability.\n* For Mail-in-a-Box developers, a new setup variable is added to pull the source code from a different repository.\n\nVersion 65 (October 27, 2023)\n-----------------------------\n\n* Roundcube updated to 1.6.4 fixing a security vulnerability.\n* zpush.sh updated to version 2.7.1.\n* Fixed a typo in the control panel.\n\nVersion 64 (September 2, 2023)\n------------------------------\n\n* Fixed broken installation when upgrading from Mail-in-a-Box version 56 (Nextcloud 22) and earlier because of an upstream packaging issue.\n* Fixed backups to work with the latest duplicity package which was not backwards compatible.\n* Fixed setting B2 as a backup target with a slash in the application key.\n* Turned off OpenDMARC diagnostic reports sent in response to incoming mail.\n* Fixed some crashes when using an unreleased version of Mail-in-a-Box.\n* Added z-push administration scripts.\n\nVersion 63 (July 27, 2023)\n--------------------------\n\n* Nextcloud updated to 25.0.7.\n\nVersion 62 (May 20, 2023)\n-------------------------\n\nPackage updates:\n\n* Nextcloud updated to 23.0.12 (and its apps also updated).\n* Roundcube updated to 1.6.1.\n* Z-Push to 2.7.0, which has compatibility for Ubuntu 22.04, so it works again.\n\nMail:\n\n* Roundcube's password change page is now working again.\n\nControl panel:\n\n* Allow setting the backup location's S3 region name for non-AWS S3-compatible backup hosts.\n* Control panel pages can be opened in a new tab/window and bookmarked and browser history navigation now works.\n* Add a Copy button to put the rsync backup public key on clipboard.\n* Allow secondary DNS xfr: items added in the control panel to be hostnames too.\n* Fixed issue where sshkeygen fails when IPv6 is disabled.\n* Fixed issue opening munin reports.\n* Fixed report formatting in status emails sent to the administrator.\n\nVersion 61.1 (January 28, 2023)\n-------------------------------\n\n* Fixed rsync backups not working with the default port.\n* Reverted \"Improve error messages in the management tools when external command-line tools are run.\" because of the possibility of user secrets being included in error messages.\n* Fix for TLS certificate SHA fingerprint not being displayed during setup.\n\nVersion 61 (January 21, 2023)\n-----------------------------\n\nSystem:\n\n* fail2ban didn't start after setup.\n\nMail:\n\n* Disable Roundcube password plugin since it was corrupting the user database.\n\nControl panel:\n\n* Fix changing existing backup settings when the rsync type is used.\n* Allow setting a custom port for rsync backups.\n* Fixes to DNS lookups during status checks when there are timeouts, enforce timeouts better.\n* A new check is added to ensure fail2ban is running.\n* Fixed a color.\n* Improve error messages in the management tools when external command-line tools are run.\n\nVersion 60.1 (October 30, 2022)\n-------------------------------\n\n* A setup issue where the DNS server nsd isn't running at the end of setup is (hopefully) fixed.\n* Nextcloud is updated to 23.0.10 (contacts to 4.2.2, calendar to 3.5.1).\n\nVersion 60 (October 11, 2022)\n-----------------------------\n\nThis is the first release for Ubuntu 22.04.\n\n**Before upgrading**, you must **first upgrade your existing Ubuntu 18.04 box to Mail-in-a-Box v0.51 or later**, if you haven't already done so. That may not be possible after Ubuntu 18.04 reaches its end of life in April 2023, so please complete the upgrade well before then. (If you are not using Nextcloud's contacts or calendar, you can migrate to the latest version of Mail-in-a-Box from any previous version.)\n\nFor complete upgrade instructions, see:\n\nhttps://discourse.mailinabox.email/t/version-60-for-ubuntu-22-04-is-about-to-be-released/9558\n\nNo major features of Mail-in-a-Box have changed in this release, although some minor fixes were made.\n\nWith the newer version of Ubuntu the following software packages we use are updated:\n\n* dovecot is upgraded to 2.3.16, postfix to 3.6.4, opendmark to 1.4 (which adds ARC-Authentication-Results headers), and spampd to 2.53 (alleviating a mail delivery rate limiting bug).\n* Nextcloud is upgraded to 23.0.4 (contacts to 4.2.0, calendar to 3.5.0).\n* Roundcube is upgraded to 1.6.0.\n* certbot is upgraded to 1.21 (via the Ubuntu repository instead of a PPA).\n* fail2ban is upgraded to 0.11.2.\n* nginx is upgraded to 1.18.\n* PHP is upgraded from 7.2 to 8.0.\n\nAlso:\n\n* Roundcube's login session cookie was tightened. Existing sessions may require a manual logout.\n* Moved Postgrey's database under $STORAGE_ROOT.\n\nVersion 57a (June 19, 2022)\n---------------------------\n\n* The Backblaze backups fix posted in Version 57 was incomplete. It's now fixed.\n\nVersion 57 (June 12, 2022)\n--------------------------\n\nSetup:\n\n* Fixed issue upgrading from Mail-in-a-Box v0.40-v0.50 because of a changed URL that Nextcloud is downloaded from.\n\nBackups:\n\n* Fixed S3 backups which broke with duplicity 0.8.23.\n* Fixed Backblaze backups which broke with latest b2sdk package by rolling back its version.\n\nControl panel:\n\n* Fixed spurious changes in system status checks messages by sorting DNSSEC DS records.\n* Fixed fail2ban lockout over IPv6 from excessive loads of the system status checks.\n* Fixed an incorrect IPv6 system status check message.\n\nVersion 56 (January 19, 2022)\n-----------------------------\n\nSoftware updates:\n\n* Roundcube updated to 1.5.2 (from 1.5.0), and the persistent_login and CardDAV (to 4.3.0 from 3.0.3) plugins are updated.\n* Nextcloud updated to 20.0.14 (from 20.0.8), contacts to 4.0.7 (from 3.5.1), and calendar to 3.0.4 (from 2.2.0).\n\nSetup:\n\n* Fixed failed setup if a previous attempt failed while updating Nextcloud.\n\nControl panel:\n\n* Fixed a crash if a custom DNS entry is not under a zone managed by the box.\n* Fix DNSSEC instructions typo.\n\nOther:\n\n* Set systemd journald log retention to 10 days (from no limit) to reduce disk usage.\n* Fixed log processing for submission lines that have a sasl_sender or other extra information.\n* Fix DNS secondary nameserver refresh failure retry period.\n\nVersion 55 (October 18, 2021)\n-----------------------------\n\nMail:\n\n* \"SMTPUTF8\" is now disabled in Postfix. Because Dovecot still does not support SMTPUTF8, incoming mail to internationalized addresses was bouncing. This fixes incoming mail to internationalized domains (which was probably working prior to v0.40), but it will prevent sending outbound mail to addresses with internationalized local-parts.\n* Upgraded to Roundcube 1.5.\n\nControl panel:\n\n* The control panel menus are now hidden before login, but now non-admins can log in to access the mail and contacts/calendar instruction pages.\n* The login form now disables browser autocomplete in the two-factor authentication code field.\n* After logging in, the default page is now a fast-loading welcome page rather than the slow-loading system status checks page.\n* The backup retention period option now displays for B2 backup targets.\n* The DNSSEC DS record recommendations are cleaned up and now recommend changing records that use SHA1.\n* The Munin monitoring pages no longer require a separate HTTP basic authentication login and can be used if two-factor authentication is turned on.\n* Control panel logins are now tied to a session backend that allows true logouts (rather than an encrypted cookie).\n* Failed logins no longer directly reveal whether the email address corresponds to a user account.\n* Browser dark mode now inverts the color scheme.\n\nOther:\n\n* Fail2ban's IPv6 support is enabled.\n* The mail log tool now doesn't crash if there are email addresses in log messages with invalid UTF-8 characters.\n* Additional nsd.conf files can be placed in /etc/nsd.conf.d.\n\nv0.54 (June 20, 2021)\n---------------------\n\nMail:\n\n* Forwarded mail using mail filter rules (in Roundcube; \"sieve\" rules) stopped re-writing the envelope address at some point, causing forwarded mail to often be marked as spam by the final recipient. These forwards will now re-write the envelope as the Mail-in-a-Box user receiving the mail to comply with SPF/DMARC rules.\n* Sending mail is now possible on port 465 with the \"SSL\" or \"TLS\" option in mail clients, and this is now the recommended setting. Port 587 with STARTTLS remains available but should be avoided when configuring new mail clients.\n* Roundcube's login cookie is updated to use a new encryption algorithm (AES-256-CBC instead of DES-EDE-CBC).\n\nDNS:\n\n* The ECDSAP256SHA256 DNSSEC algorithm is now available. If a DS record is set for any of your domain names that have DNS hosted on your box, you will be prompted by status checks to update the DS record at your convenience.\n* Null MX records are added for domains that do not serve mail.\n\nContacts/calendar:\n\n* Updated Nextcloud to 20.0.8, contacts to 3.5.1, calendar to 2.2.0 (#1960).\n\nControl panel:\n\n* Fixed a crash in the status checks.\n* Small wording improvements.\n\nSetup:\n\n* Minor improvements to the setup scripts.\n\nv0.53a (May 8, 2021)\n--------------------\n\nThe download URL for Z-Push has been revised because the old URL stopped working.\n\nv0.53 (April 12, 2021)\n----------------------\n\nSoftware updates:\n\n* Upgraded Roundcube to version 1.4.11 addressing a security issue, and its desktop notifications plugin.\n* Upgraded Z-Push (for Exchange/ActiveSync) to version 2.6.2.\n\nControl panel:\n\n* Backblaze B2 is now a supported backup protocol.\n* Fixed an issue in the daily mail reports.\n* Sort the Custom DNS by zone and qname, and add an option to go back to the old sort order (creation order).\n\nMail:\n\n* Enable sending DMARC failure reports to senders that request them.\n\nSetup:\n\n* Fixed error when upgrading from Nextcloud 13.\n\nv0.52 (January 31, 2021)\n------------------------\n\nSoftware updates:\n\n* Upgraded Roundcube to version 1.4.10.\n* Upgraded Z-Push to 2.6.1.\n\nMail:\n\n* Incoming emails with SPF/DKIM/DMARC failures now get a higher spam score, and these messages are more likely to appear in the junk folder, since they are often spam/phishing.\n* Fixed the MTA-STS policy file's line endings.\n\nControl panel:\n\n* A new Download button in the control panel's External DNS page can be used to download the required DNS records in zonefile format.\n* Fixed the problem when the control panel would report DNS entries as Not Set by increasing a bind query limit.\n* Fixed a control panel startup bug on some systems.\n* Improved an error message on a DNS lookup timeout.\n* A typo was fixed.\n\nDNS:\n\n* The TTL for NS records has been increased to 1 day to comply with some registrar requirements.\n\nSystem:\n\n* Nextcloud's photos, dashboard, and activity apps are disabled since we only support contacts and calendar.\n\nv0.51 (November 14, 2020)\n-------------------------\n\nSoftware updates:\n\n* Upgraded Nextcloud from 17.0.6 to 20.0.1 (with Contacts from 3.3.0 to 3.4.1 and Calendar from 2.0.3 to 2.1.2)\n* Upgraded Roundcube to version 1.4.9.\n\nMail:\n\n* The MTA-STA max_age value was increased to the normal one week.\n\nControl panel:\n\n* Two-factor authentication can now be enabled for logins to the control panel. However, keep in mind that many online services (including domain name registrars, cloud server providers, and TLS certificate providers) may allow an attacker to take over your account or issue a fraudulent TLS certificate with only access to your email address, and this new two-factor authentication does not protect access to your inbox. It therefore remains very important that user accounts with administrative email addresses have strong passwords.\n* TLS certificate expiry dates are now shown in ISO8601 format for clarity.\n\nv0.50 (September 25, 2020)\n--------------------------\n\nSetup:\n\n* When upgrading from versions before v0.40, setup will now warn that ownCloud/Nextcloud data cannot be migrated rather than failing the installation.\n\nMail:\n\n* An MTA-STS policy for incoming mail is now published (in DNS and over HTTPS) when the primary hostname and email address domain both have a signed TLS certificate installed, allowing senders to know that an encrypted connection should be enforced.\n* The per-IP connection limit to the IMAP server has been doubled to allow more devices to connect at once, especially with multiple users behind a NAT.\n\nDNS:\n\n* autoconfig and autodiscover subdomains and CalDAV/CardDAV SRV records are no longer generated for domains that don't have user accounts since they are unnecessary.\n* IPv6 addresses can now be specified for secondary DNS nameservers in the control panel.\n\nTLS:\n\n* TLS certificates are now provisioned in groups by parent domain to limit easy domain enumeration and make provisioning more resilient to errors for particular domains.\n\nControl panel:\n\n* The control panel API is now fully documented at https://mailinabox.email/api-docs.html.\n* User passwords can now have spaces.\n* Status checks for automatic subdomains have been moved into the section for the parent domain.\n* Typo fixed.\n\nWeb:\n\n* The default web page served on fresh installations now adds the `noindex` meta tag.\n* The HSTS header is revised to also be sent on non-success responses.\n\nv0.48 (August 26, 2020)\n-----------------------\n\nSecurity fixes:\n\n* Roundcube is updated to version 1.4.8 fixing additional cross-site scripting (XSS) vulnerabilities.\n\nv0.47 (July 29, 2020)\n---------------------\n\nSecurity fixes:\n\n* Roundcube is updated to version 1.4.7 fixing a cross-site scripting (XSS) vulnerability with HTML messages with malicious svg/namespace (CVE-2020-15562) (https://roundcube.net/news/2020/07/05/security-updates-1.4.7-1.3.14-and-1.2.11).\n* SSH connections are now rate-limited at the firewall level (in addition to fail2ban).\n\nv0.46 (June 11, 2020)\n---------------------\n\nSecurity fixes:\n\n* Roundcube is updated to version 1.4.6 (https://roundcube.net/news/2020/06/02/security-updates-1.4.5-and-1.3.12).\n\nv0.45 (May 16, 2020)\n--------------------\n\nSecurity fixes:\n\n* Fix missing brute force login protection for Roundcube logins.\n\nSoftware updates:\n\n* Upgraded Roundcube from 1.4.2 to 1.4.4.\n* Upgraded Nextcloud from 17.0.2 to 17.0.6 (with Contacts from 3.1.6 to 3.3.0 and Calendar from 1.7.1 to v2.0.3)\n* Upgraded Z-Push to 2.5.2.\n\nSystem:\n\n* Nightly backups now occur on a random minute in the 3am hour (in the system time zone). The minute is chosen during Mail-in-a-Box installation/upgrade and remains the same until the next upgrade.\n* Fix for mail log statistics report on leap days.\n* Fix Mozilla autoconfig useGlobalPreferredServer setting.\n\nWeb:\n\n* Add a new hidden feature to set nginx alias in www/custom.yaml.\n\nSetup:\n\n* Improved error handling.\n\nv0.44 (February 15, 2020)\n-------------------------\n\nSystem:\n\n* TLS settings have been upgraded following Mozilla's recommendations for servers. TLS1.2 and 1.3 are now the only supported protocols for web, IMAP, and SMTP (submission).\n* Fixed an issue starting services when Mail-in-a-Box isn't on the root filesystem.\n* Changed some performance options affecting Roundcube and Nextcloud.\n\nSoftware updates:\n\n* Upgraded Nextcloud from 15.0.8 to 17.0.2 (with Contacts from 3.1.1 to 3.1.6 and Calendar from 1.6.5 to 1.7.1)\n* Upgraded Z-Push to 2.5.1.\n* Upgraded Roundcube from 1.3.10 to 1.4.2 and changed the default skin (theme) to Elastic.\n\nControl panel:\n\n* The Custom DNS list of records is now sorted.\n* The emails that report TLS provisioning results now has a less scary subject line.\n\nMail:\n\n* Fetching of updated whitelist for greylisting was fetching each day instead of every month.\n* OpenDKIM signing has been changed to 'relaxed' mode so that some old mail lists that forward mail can do so.\n\nDNS:\n\n* Automatic autoconfig.* subdomains can now be suppressed with custom DNS records.\n* DNS zone transfer now works with IPv6 addresses.\n\nSetup:\n\n* An Ubuntu package source was missing on systems where it defaults off.\n\nv0.43 (September 1, 2019)\n-------------------------\n\nSecurity fixes:\n\n* A security issue was discovered in rsync backups. If you have enabled rsync backups, the file `id_rsa_miab` may have been copied to your backup destination. This file can be used to access your backup destination. If the file was copied to your backup destination, we recommend that you delete the file on your backup destination, delete `/root/.ssh/id_rsa_miab` on your Mail-in-a-Box, then re-run Mail-in-a-Box setup, and re-configure your SSH public key at your backup destination according to the instructions in the Mail-in-a-Box control panel.\n* Brute force attack prevention was missing for the managesieve service.\n\nSetup:\n\n* Nextcloud was not upgraded properly after restoring Mail-in-a-Box from a backup from v0.40 or earlier.\n\nMail:\n\n* Upgraded Roundcube to 1.3.10.\n* Fetch an updated whitelist for greylisting on a monthly basis to reduce the number of delayed incoming emails.\n\nControl panel:\n\n* When using secondary DNS, it is now possible to specify a subnet range with the `xfr:` option.\n* Fixed an issue when the secondary DNS option is used and the secondary DNS hostname resolves to multiple IP addresses.\n* Fix a bug in how a backup configuration error is shown.\n\nv0.42b (August 3, 2019)\n-----------------------\n\nChanges:\n\n* Decreased the minimum supported RAM to 502 Mb.\n* Improved mail client autoconfiguration.\n* Added support for S3-compatible backup services besides Amazon S3.\n* Fixed the control panel login page to let LastPass save passwords.\n* Fixed an error in the user privileges API.\n* Silenced some spurious messages.\n\nSoftware updates:\n\n* Upgraded Roundcube from 1.3.8 to 1.3.9.\n* Upgraded Nextcloud from 14.0.6 to 15.0.8 (with Contacts from 2.1.8 to 3.1.1 and Calendar from 1.6.4 to 1.6.5).\n* Upgraded Z-Push from 2.4.4 to 2.5.0.\n\nNote that v0.42 (July 4, 2019) was pulled shortly after it was released to fix a Nextcloud upgrade issue.\n\nv0.41 (February 26, 2019)\n-------------------------\n\nSystem:\n\n* Missing brute force login attack prevention (fail2ban) filters which stopped working on Ubuntu 18.04 were added back.\n* Upgrades would fail if Mail-in-a-Box moved to a different directory in `systemctl link`.\n\nMail:\n\n* Incoming messages addressed to more than one local user were rejected because of a bug in spampd packaged by Ubuntu 18.04. A workaround was added.\n\nContacts/Calendar:\n\n* Upgraded Nextcloud from 13.0.6 to 14.0.6.\n* Upgraded Contacts from 2.1.5 to 2.1.8.\n* Upgraded Calendar from 1.6.1 to 1.6.4.\n\nv0.40 (January 12, 2019)\n------------------------\n\nThis is the first release for Ubuntu 18.04. This version and versions going forward can **only** be installed on Ubuntu 18.04; however, upgrades of existing Ubuntu 14.04 boxes to the latest version supporting Ubuntu 14.04 (v0.30) continue to work as normal.\n\nWhen **upgrading**, you **must first upgrade your existing Ubuntu 14.04 Mail-in-a-Box box** to the latest release supporting Ubuntu 14.04 --- that's v0.30 --- before you migrate to Ubuntu 18.04. If you are running an older version of Mail-in-a-Box which has an old version of ownCloud or Nextcloud, you will *not* be able to upgrade your data because older versions of ownCloud and Nextcloud that are required to perform the upgrade *cannot* be run on Ubuntu 18.04. To upgrade from Ubuntu 14.04 to Ubuntu 18.04, you **must create a fresh Ubuntu 18.04 machine** before installing this version. In-place upgrades of servers are not supported. Since Ubuntu's support for Ubuntu 14.04 has almost ended, everyone is encouraged to create a new Ubuntu 18.04 machine and migrate to it.\n\nFor complete upgrade instructions, see:\n\nhttps://discourse.mailinabox.email/t/mail-in-a-box-version-v0-40-and-moving-to-ubuntu-18-04/4289\n\nThe changelog for this release follows.\n\nSetup:\n\n* Mail-in-a-Box now targets Ubuntu 18.04 LTS, which will have support from Ubuntu through 2022.\n* Some of the system packages updated in virtue of using Ubuntu 18.04 include postfix (2.11=>3.3) nsd (4.0=>4.1), nginx (1.4=>1.14), PHP (7.0=>7.2), Python (3.4=>3.6), fail2ban (0.8=>0.10), Duplicity (0.6=>0.7).\n* [Unofficial Bash Strict Mode](http://redsymbol.net/articles/unofficial-bash-strict-mode/) is turned on for setup, which might catch previously uncaught issues during setup.\n\nMail:\n\n* IMAP server-side full text search is no longer supported because we were using a custom-built `dovecot-lucene` package that we are no longer maintaining.\n* Sending email is now disabled on port 25 --- you must log in to port 587 to send email, per the long-standing mail instructions.\n* Greylisting may delay more emails from new senders. We were using a custom-built postgrey package previously that whitelisted sending domains in dnswl.org, but we are no longer maintaining that package.\n\nv0.30 (January 9, 2019)\n-----------------------\n\nSetup:\n\n* Update to Roundcube 1.3.8 and the CardDAV plugin to 3.0.3.\n* Add missing rsyslog package to install line since some OS images don't have it installed by default.\n* A log file for nsd was added.\n\nControl Panel:\n\n* The users page now documents that passwords should only have ASCII characters to prevent character encoding mismatches between clients and the server.\n* The users page no longer shows user mailbox sizes because this was extremely slow for very large mailboxes.\n* The Mail-in-a-Box version is now shown in the system status checks even when the new-version check is disabled.\n* The alises page now warns that alises should not be used to forward mail off of the box. Mail filters within Roundcube are better for that.\n* The explanation of greylisting has been improved.\n\nv0.29 (October 25, 2018)\n------------------------\n\n* Starting with v0.28, TLS certificate provisioning wouldn't work on new boxes until the mailinabox setup command was run a second time because of a problem with the non-interactive setup.\n* Update to Nextcloud 13.0.6.\n* Update to Roundcube 1.3.7.\n* Update to Z-Push 2.4.4.\n* Backup dates listed in the control panel now use an internationalized format.\n\nv0.28 (July 30, 2018)\n---------------------\n\nSystem:\n\n* We now use EFF's `certbot` to provision TLS certificates (from Let's Encrypt) instead of our home-grown ACME library.\n\nContacts/Calendar:\n\n* Fix for Mac OS X autoconfig of the calendar.\n\nSetup:\n\n* Installing Z-Push broke because of what looks like a change or problem in their git server HTTPS certificate. That's fixed.\n\nv0.27 (June 14, 2018)\n---------------------\n\nMail:\n\n* A report of box activity, including sent/received mail totals and logins by user, is now emailed to the box's administrator user each week.\n* Update Roundcube to version 1.3.6 and Z-Push to version 2.3.9.\n\nControl Panel:\n\n* The undocumented feature for proxying web requests to another server now sets X-Forwarded-For.\n\nv0.26c (February 13, 2018)\n--------------------------\n\nSetup:\n\n* Upgrades from v0.21c (February 1, 2017) or earlier were broken because the intermediate versions of ownCloud used in setup were no longer available from ownCloud.\n* Some download errors had no output --- there is more output on error now.\n\nControl Panel:\n\n* The background service for the control panel was not restarting on updates, leaving the old version running. This was broken in v0.26 and is now fixed.\n* Installing your own TLS/SSL certificate had been broken since v0.24 because the new version of openssl became stricter about CSR generation parameters.\n* Fixed password length help text.\n\nContacts/Calendar:\n\n* Upgraded Nextcloud from 12.0.3 to 12.0.5.\n\nv0.26b (January 25, 2018)\n-------------------------\n\n* Fix new installations which broke at the step of asking for the user's desired email address, which was broken by v0.26's changes related to the control panel.\n* Fix the provisioning of TLS certificates by pinning a Python package we rely on (acme) to an earlier version because our code isn't yet compatible with its current version.\n* Reduce munin's log_level from debug to warning to prevent massive log files.\n\nv0.26 (January 18, 2018)\n------------------------\n\nSecurity:\n\n* HTTPS, IMAP, and POP's TLS settings have been updated to Mozilla's intermediate cipher list recommendation. Some extremely old devices that use less secure TLS ciphers may no longer be able to connect to IMAP/POP.\n* Updated web HSTS header to use longer six month duration.\n\nMail:\n\n* Adding attachments in Roundcube broke after the last update for some users after rebooting because a temporary directory was deleted on reboot. The temporary directory is now moved from /tmp to /var so that it is persistent.\n* `X-Spam-Score` header is added to incoming mail.\n\nControl panel:\n\n* RSASHA256 is now used for DNSSEC for .lv domains.\n* Some documentation/links improvements.\n\nInstaller:\n\n* We now run `apt-get autoremove` at the start of setup to clear out old packages, especially old kernels that take up a lot of space. On the first run, this step may take a long time.\n* We now fetch Z-Push from its tagged git repository, fixing an installation problem.\n* Some old PHP5 packages are removed from setup, fixing an installation bug where Apache would get installed.\n* Python 3 packages for the control panel are now installed using a virtualenv to prevent installation errors due to conflicts in the cryptography/openssl packages between OS-installed packages and pip-installed packages.\n\nv0.25 (November 15, 2017)\n-------------------------\n\nThis update is a security update addressing [CVE-2017-16651, a vulnerability in Roundcube webmail that allows logged-in users to access files on the local filesystem](https://roundcube.net/news/2017/11/08/security-updates-1.3.3-1.2.7-and-1.1.10).\n\nMail:\n\n* Update to Roundcube 1.3.3.\n\nControl Panel:\n\n* Allow custom DNS records to be set for DNS wildcard subdomains (i.e. `*`).\n\nv0.24 (October 3, 2017)\n-----------------------\n\nSystem:\n\n* Install PHP7 via a PPA. Switch to the on-demand process manager.\n\nMail:\n\n* Updated to [Roundcube 1.3.1](https://roundcube.net/news/2017/06/26/roundcube-webmail-1.3.0-released), but unfortunately dropping the Vacation plugin because it has not been supported by its author and is not compatible with Roundcube 1.3, and updated the persistent login plugin.\n* Updated to [Z-Push 2.3.8](http://download.z-push.org/final/2.3/z-push-2.3.8.txt).\n* Dovecot now uses stronger 2048 bit DH params for better forward secrecy.\n\nNextcloud:\n\n* Nextcloud updated to 12.0.3, using PHP7.\n\nControl Panel:\n\n* Nameserver (NS) records can now be set on custom domains.\n* Fix an erroneous status check error due to IPv6 address formatting.\n* Aliases for administrative addresses can now be set to send mail to +tag administrative addresses.\n\nv0.23a (May 31, 2017)\n---------------------\n\nCorrects a problem in the new way third-party assets are downloaded during setup for the control panel, since v0.23.\n\nv0.23 (May 30, 2017)\n--------------------\n\nMail:\n\n* The default theme for Roundcube was changed to the nicer Larry theme.\n* Exchange/ActiveSync support has been replaced with z-push 2.3.6 from z-push.org (rather than z-push-contrib).\n\nownCloud (now Nextcloud):\n\n* ownCloud is replaced with Nextcloud 10.0.5.\n* Fixed an error in Owncloud/Nextcloud setup not updating domain when changing hostname.\n\nControl Panel/Management:\n\n* Fix an error in the control panel showing rsync backup status.\n* Fix an error in the control panel related to IPv6 addresses.\n* TLS certificates for internationalized domain names can now be provisioned from Let's Encrypt automatically.\n* Third-party assets used in the control panel (jQuery/Bootstrap) are now downloaded during setup and served from the box rather than from a CDN.\n\nDNS:\n\n* Add support for custom CAA records.\n\nv0.22 (April 2, 2017)\n---------------------\n\nMail:\n\n* The CardDAV plugin has been added to Roundcube so that your ownCloud contacts are available in webmail.\n* Upgraded to Roundcube 1.2.4 and updated the persistent login plugin.\n* Allow larger messages to be checked by SpamAssassin.\n* Dovecot's vsz memory limit has been increased proportional to system memory.\n* Newly set user passwords must be at least eight characters.\n\nownCloud:\n\n* Upgraded to ownCloud 9.1.4.\n\nControl Panel/Management:\n\n* The status checks page crashed when the mailinabox.email website was down - that's fixed.\n* Made nightly re-provisioning of TLS certificates less noisy.\n* Fixed bugs in rsync backup method and in the list of recent backups.\n* Fixed incorrect status checks errors about IPv6 addresses.\n* Fixed incorrect status checks errors for secondary nameservers if round-robin custom A records are set.\n* The management mail_log.py tool has been rewritten.\n\nDNS:\n\n* Added support for DSA, ED25519, and custom SSHFP records.\n\nSystem:\n\n* The SSH fail2ban jail was not activated.\n\nInstallation:\n\n* At the end of installation, the SHA256 -- rather than SHA1 -- hash of the system's TLS certificate is shown.\n\nv0.21c (February 1, 2017)\n-------------------------\n\nInstallations and upgrades started failing about 10 days ago with the error \"ImportError: No module named 'packaging'\" after an upstream package (Python's setuptools) was updated by its maintainers. The updated package conflicted with Ubuntu 14.04's version of another package (Python's pip). This update upgrades both packages to remove the conflict.\n\nIf you already encountered the error during installation or upgrade of Mail-in-a-Box, this update may not correct the problem on your existing system. See https://discourse.mailinabox.email/t/v0-21c-release-fixes-python-package-installation-issue/1881 for help if the problem persists after upgrading to this version of Mail-in-a-Box.\n\nv0.21b (December 4, 2016)\n-------------------------\n\nThis update corrects a first-time installation issue introduced in v0.21 caused by the new Exchange/ActiveSync feature.\n\nv0.21 (November 30, 2016)\n-------------------------\n\nThis version updates ownCloud, which may include security fixes, and makes some other smaller improvements.\n\nMail:\n\n* Header privacy filters were improperly running on the contents of forwarded email --- that's fixed.\n* We have another go at fixing a long-standing issue with training the spam filter (because of a file permissions issue).\n* Exchange/ActiveSync will now use your display name set in Roundcube in the From: line of outgoing email.\n\nownCloud:\n\n* Updated ownCloud to version 9.1.1.\n\nControl panel:\n\n* Backups can now be made using rsync-over-ssh!\n* Status checks failed if the system doesn't support iptables or doesn't have ufw installed.\n* Added support for SSHFP records when sshd listens on non-standard ports.\n* Recommendations for TLS certificate providers were removed now that everyone mostly uses Let's Encrypt.\n\nSystem:\n\n* Ubuntu's \"Upgrade to 16.04\" notice is suppressed since you should not do that.\n* Lowered memory requirements to 512MB, display a warning if system memory is below 768MB.\n\nv0.20 (September 23, 2016)\n--------------------------\n\nownCloud:\n\n* Updated to ownCloud to 8.2.7.\n\nControl Panel:\n\n* Fixed a crash that occurs when there are IPv6 DNS records due to a bug in dnspython 1.14.0.\n* Improved the wonky low disk space check.\n\nv0.19b (August 20, 2016)\n------------------------\n\nThis update corrects a security issue introduced in v0.18.\n\n* A remote code execution vulnerability is corrected in how the munin system monitoring graphs are generated for the control panel. The vulnerability involves an administrative user visiting a carefully crafted URL.\n\nv0.19a (August 18, 2016)\n------------------------\n\nThis update corrects a security issue in v0.19.\n\n* fail2ban won't start if Roundcube had not yet been used - new installations probably do not have fail2ban running.\n\nv0.19 (August 13, 2016)\n-----------------------\n\nMail:\n\n* Roundcube is updated to version 1.2.1.\n* SSLv3 and RC4 are now no longer supported in incoming and outgoing mail (SMTP port 25).\n\nControl panel:\n\n* The users and aliases APIs are now documented on their control panel pages.\n* The HSTS header was missing.\n* New status checks were added for the ufw firewall.\n\nDNS:\n\n* Add SRV records for CardDAV/CalDAV to facilitate autoconfiguration (e.g. in DavDroid, whose latest version didn't seem to work to configure with entering just a hostname).\n\nSystem:\n\n* fail2ban jails added for SMTP submission, Roundcube, ownCloud, the control panel, and munin.\n* Mail-in-a-Box can now be installed on the i686 architecture.\n\nv0.18c (June 2, 2016)\n---------------------\n\n* Domain aliases (and misconfigured aliases/catch-alls with non-existent local targets) would accept mail and deliver it to new mailbox folders on disk even if the target address didn't correspond with an existing mail user, instead of rejecting the mail. This issue was introduced in v0.18.\n* The Munin Monitoring link in the control panel now opens a new window.\n* Added an undocumented before-backup script.\n\nv0.18b (May 16, 2016)\n---------------------\n\n* Fixed a Roundcube user accounts issue introduced in v0.18.\n\nv0.18 (May 15, 2016)\n--------------------\n\nownCloud:\n\n* Updated to ownCloud to 8.2.3\n\nMail:\n\n* Roundcube is updated to version 1.1.5 and the Roundcube login screen now says \"[hostname] Webmail\" instead of \"Mail-in-a-Box/Roundcube webmail\".\n* Fixed a long-standing issue with training the spam filter not working (because of a file permissions issue).\n\nControl panel:\n\n* Munin system monitoring graphs are now zoomable.\n* When a reboot is required (due to Ubuntu security updates automatically installed), a Reboot Box button now appears on the System Status Checks page of the control panel.\n* It is now possible to add SRV and secondary MX records in the Custom DNS page.\n* Other minor fixes.\n\nSystem:\n\n* The fail2ban recidive jail, which blocks long-duration brute force attacks, now no longer sends the administrator emails (which were not helpful).\n\nSetup:\n\n* The system hostname is now set during setup.\n* A swap file is now created if system memory is less than 2GB, 5GB of free disk space is available, and if no swap file yet exists.\n* We now install Roundcube from the official GitHub repository instead of our own mirror, which we had previously created to solve problems with SourceForge.\n* DKIM was incorrectly set up on machines where \"localhost\" was defined as something other than \"127.0.0.1\".\n\nv0.17c (April 1, 2016)\n----------------------\n\nThis update addresses some minor security concerns and some installation issues.\n\nownCloud:\n\n* Block web access to the configuration parameters (config.php). There is no immediate impact (see [#776](https://github.com/mail-in-a-box/mailinabox/pull/776)), although advanced users may want to take note.\n\nMail:\n\n* Roundcube html5_notifier plugin updated from version 0.6 to 0.6.2 to fix Roundcube getting stuck for some people.\n\nControl panel:\n\n* Prevent click-jacking of the management interface by adding HTTP headers.\n* Failed login no longer reveals whether an account exists on the system.\n\nSetup:\n\n* Setup dialogs did not appear correctly when connecting to SSH using Putty on Windows.\n* We now install Roundcube from our own mirror because Sourceforge's downloads experience frequent intermittent unavailability.\n\nv0.17b (March 1, 2016)\n----------------------\n\nownCloud moved their source code to a new location, breaking our installation script.\n\nv0.17 (February 25, 2016)\n-------------------------\n\nMail:\n\n* Roundcube updated to version 1.1.4.\n* When there's a problem delivering an outgoing message, a new 'warning' bounce will come after 3 hours and the box will stop trying after 2 days (instead of 5).\n* On multi-homed machines, Postfix now binds to the right network interface when sending outbound mail so that SPF checks on the receiving end will pass.\n* Mail sent from addresses on subdomains of other domains hosted by this box would not be DKIM-signed and so would fail DMARC checks by recipients, since version v0.15.\n\nControl panel:\n\n* TLS certificate provisioning would crash if DNS propagation was in progress and a challenge failed; might have shown the wrong error when provisioning fails.\n* Backup times were displayed with the wrong time zone.\n* Thresholds for displaying messages when the system is running low on memory have been reduced from 30% to 20% for a warning and from 15% to 10% for an error.\n* Other minor fixes.\n\nSystem:\n\n* Backups to some AWS S3 regions broke in version 0.15 because we reverted the version of boto. That's now fixed.\n* On low-usage systems, don't hold backups for quite so long by taking a full backup more often.\n* Nightly status checks might fail on systems not configured with a default Unicode locale.\n* If domains need a TLS certificate and the user hasn't installed one yet using Let's Encrypt, the administrator would get a nightly email with weird interactive text asking them to agree to Let's Encrypt's ToS. Now just say that the provisioning can't be done automatically.\n* Reduce the number of background processes used by the management daemon to lower memory consumption.\n\nSetup:\n\n* The first screen now warns users not to install on a machine used for other things.\n\nv0.16 (January 30, 2016)\n------------------------\n\nThis update primarily adds automatic SSL (now \"TLS\") certificate provisioning from Let's Encrypt (https://letsencrypt.org/).\n\nControl Panel:\n\n* The SSL certificates (now referred to as \"TLS certificates\") page now supports provisioning free certificates from Let's Encrypt.\n* Report free memory usage.\n* Fix a crash when the git directory is not checked out to a tag.\n* When IPv6 is enabled, check that all domains (besides the system hostname) resolve over IPv6.\n* When a domain doesn't resolve to the box, don't bother checking if the TLS certificate is valid.\n* Remove rounded border on the menu bar.\n\nOther:\n\n* The Sieve port is now open so tools like the Thunderbird Sieve extension can be used to edit mail filters.\n* .be domains now offer DNSSEC options supported by the TLD\n* The daily backup will now email the administrator if there is a problem.\n* Expiring TLS certificates are now automatically renewed via Let's Encrypt.\n* File ownership for installed Roundcube files is fixed.\n* Typos fixed.\n\nv0.15a (January 9, 2016)\n------------------------\n\nMail:\n\n* Sending mail through Exchange/ActiveSync (Z-Push) had been broken since v0.14 in some setups. This is now fixed.\n\nv0.15 (January 1, 2016)\n-----------------------\n\nMail:\n\n* Updated Roundcube to version 1.1.3.\n* Auto-create aliases for abuse@, as required by RFC2142.\n* The DANE TLSA record is changed to use the certificate subject public key rather than the whole certificate, which means the record remains valid after certificate changes (so long as the private key remains the same, which it does for us).\n\nControl panel:\n\n* When IPv6 is enabled, check that system services are accessible over IPv6 too, that the box's hostname resolves over IPv6, and that reverse DNS is setup correctly for IPv6.\n* Explanatory text for setting up secondary nameserver is added/fixed.\n* DNS checks now have a timeout in case a DNS server is not responding, so the checks don't stall indefinitely.\n* Better messages if external DNS is used and, weirdly, custom secondary nameservers are set.\n* Add POP to the mail client settings documentation.\n* The box's IP address is added to the fail2ban whitelist so that the status checks don't trigger the machine banning itself, which results in the status checks showing services down even though they are running.\n* For SSL certificates, rather than asking you what country you are in during setup, ask at the time a CSR is generated. The default system self-signed certificate now omits a country in the subject (it was never needed). The CSR_COUNTRY Mail-in-a-Box setting is dropped entirely.\n\nSystem:\n\n* Nightly backups and system status checks are now moved to 3am in the system's timezone.\n* fail2ban's recidive jail is now active, which guards against persistent brute force login attacks over long periods of time.\n* Setup (first run only) now asks for your timezone to set the system time.\n* The Exchange/ActiveSync server is now taken offline during nightly backups (along with SMTP and IMAP).\n* The machine's random number generator (/dev/urandom) is now seeded with Ubuntu Pollinate and a blocking read on /dev/random.\n* DNSSEC key generation during install now uses /dev/urandom (instead of /dev/random), which is faster.\n* The $STORAGE_ROOT/ssl directory is flattened by a migration script and the system SSL certificate path is now a symlink to the actual certificate.\n* If ownCloud sends out email, it will use the box's administrative address now (admin@yourboxname).\n* Z-Push (Exchange/ActiveSync) logs now exclude warnings and are now rotated to save disk space.\n* Fix pip command that might have not installed all necessary Python packages.\n* The control panel and backup would not work on Google Compute Engine because GCE installs a conflicting boto package.\n* Added a new command `management/backup.py --restore` to restore files from a backup to a target directory (command line arguments are passed to `duplicity restore`).\n\nv0.14 (November 4, 2015)\n------------------------\n\nMail:\n\n* Spamassassin's network-based tests (Pyzor, others) and DKIM tests are now enabled. (Pyzor had always been installed but was not active due to a misconfiguration.)\n* Moving spam out of the Spam folder and into Trash would incorrectly train Spamassassin that those messages were not spam.\n* Automatically create the Sent and Archive folders for new users.\n* The HTML5_Notifier plugin for Roundcube is now included, which when turned on in Roundcube settings provides desktop notifications for new mail.\n* The Exchange/ActiveSync backend Z-Push has been updated to fix a problem with CC'd emails not being sent to the CC recipients.\n\nCalender/Contacts:\n\n* CalDAV/CardDAV and Exchange/ActiveSync for calendar/contacts wasn't working in some network configurations.\n\nWeb:\n\n* When a new domain is added to the box, rather than applying a new self-signed certificate for that domain, the SSL certificate for the box's primary hostname will be used instead.\n* If a custom DNS record is set on a domain or 'www'+domain, web would not be served for that domain. If the custom DNS record is just the box's IP address, that's a configuration mistake, but allow it and let web continue to be served.\n* Accommodate really long domain names by increasing an nginx setting.\n\nControl panel:\n\n* Added an option to check for new Mail-in-a-Box versions within status checks. It is off by default so that boxes don't \"phone home\" without permission.\n* Added a random password generator on the users page to simplify creating new accounts.\n* When S3 backup credentials are set, the credentials are now no longer ever sent back from the box to the client, for better security.\n* Fixed the jumpiness when a modal is displayed.\n* Focus is put into the login form fields when the login form is displayed.\n* Status checks now include a warning if a custom DNS record has been set on a domain that would normally serve web and as a result that domain no longer is serving web.\n* Status checks now check that secondary nameservers, if specified, are actually serving the domains.\n* Some errors in the control panel when there is invalid data in the database or an improperly named archived user account have been suppressed.\n* Added subresource integrity attributes to all remotely-sourced resources (i.e. via CDNs) to guard against CDNs being used as an attack vector.\n\nSystem:\n\n* Tweaks to fail2ban settings.\n* Fixed a spurious warning while installing munin.\n\nv0.13b (August 30, 2015)\n------------------------\n\nAnother ownCloud 8.1.1 issue was found. New installations left ownCloud improperly setup (\"You are accessing the server from an untrusted domain.\"). Upgrading to this version will fix that.\n\nv0.13a (August 23, 2015)\n------------------------\n\nNote: v0.13 (no 'a', August 19, 2015) was pulled immediately due to an ownCloud bug that prevented upgrades. v0.13a works around that problem.\n\nMail:\n\n* Outbound mail headers (the Received: header) are tweaked to possibly improve deliverability.\n* Some MIME messages would hang Roundcube due to a missing package.\n* The users permitted to send as an alias can now be different from where an alias forwards to.\n\nDNS:\n\n* The secondary nameservers option in the control panel now accepts more than one nameserver and a special xfr:IP format to specify zone-transfer-only IP addresses.\n* A TLSA record is added for HTTPS for DNSSEC-aware clients that support it.\n\nSystem:\n\n* Backups can now be turned off, or stored in Amazon S3, through new control panel options.\n* Munin was not working on machines confused about their hostname and had lots of errors related to PANGO, NTP peers and network interfaces that were not up.\n* ownCloud updated to version 8.1.1 (with upgrade work-around), its memcached caching enabled.\n* When upgrading, network checks like blocked port 25 are now skipped.\n* Tweaks to the intrusion detection rules for IMAP.\n* Mail-in-a-Box's setup is a lot quieter, hiding lots of irrelevant messages.\n\nControl panel:\n\n* SSL certificate checks were failing on OVH/OpenVZ servers due to missing /dev/stdin.\n* Improve the sort order of the domains in the status checks.\n* Some links in the control panel were only working in Chrome.\n\nv0.12c (July 19, 2015)\n----------------------\n\nv0.12c was posted to work around the current Sourceforge.net outage: pyzor's remote server is now hard-coded rather than accessing a file hosted on Sourceforge, and roundcube is now downloaded from a Mail-in-a-Box mirror rather than from Sourceforge.\n\nv0.12b (July 4, 2015)\n---------------------\n\nThis version corrects a minor regression in v0.12 related to creating aliases targeting multiple addresses.\n\nv0.12 (July 3, 2015)\n--------------------\n\nThis is a minor update to v0.11, which was a major update. Please read v0.11's advisories.\n\n* The administrator@ alias was incorrectly created starting with v0.11. If your first install was v0.11, check that the administrator@ alias forwards mail to you.\n* Intrusion detection rules (fail2ban) are relaxed (i.e. less is blocked).\n* SSL certificates could not be installed for the new automatic 'www.' redirect domains.\n* PHP's default character encoding is changed from no default to UTF8. The effect of this change is unclear but should prevent possible future text conversion issues.\n* User-installed SSL private keys in the BEGIN PRIVATE KEY format were not accepted.\n* SSL certificates with SAN domains with IDNA encoding were broken in v0.11.\n* Some IDNA functionality was using IDNA 2003 rather than IDNA 2008.\n\nv0.11b (June 29, 2015)\n----------------------\n\nv0.11b was posted shortly after the initial posting of v0.11 to correct a missing dependency for the new PPA.\n\nv0.11 (June 29, 2015)\n---------------------\n\nAdvisories:\n* Users can no longer spoof arbitrary email addresses in outbound mail. When sending mail, the email address configured in your mail client must match the SMTP login username being used, or the email address must be an alias with the SMTP login username listed as one of the alias's targets.\n* This update replaces your DKIM signing key with a stronger key. Because of DNS caching/propagation, mail sent within a few hours after this update could be marked as spam by recipients. If you use External DNS, you will need to update your DNS records.\n* The box will now install software from a new Mail-in-a-Box PPA on Launchpad.net, where we are distributing two of our own packages: a patched postgrey and dovecot-lucene.\n\nMail:\n* Greylisting will now let some reputable senders pass through immediately.\n* Searching mail (via IMAP) will now be much faster using the dovecot lucene full text search plugin.\n* Users can no longer spoof arbitrary email addresses in outbound mail (see above).\n* Fix for deleting admin@ and postmaster@ addresses.\n* Roundcube is updated to version 1.1.2, plugins updated.\n* Exchange/ActiveSync autoconfiguration was not working on all devices (e.g. iPhone) because of a case-sensitive URL.\n* The DKIM signing key has been increased to 2048 bits, from 1024, replacing the existing key.\n\nWeb:\n* 'www' subdomains now automatically redirect to their parent domain (but you'll need to install an SSL certificate).\n* OCSP no longer uses Google Public DNS.\n* The installed PHP version is no longer exposed through HTTP response headers, for better security.\n\nDNS:\n* Default IPv6 AAAA records were missing since version 0.09.\n\nControl panel:\n* Resetting a user's password now forces them to log in again everywhere.\n* Status checks were not working if an ssh server was not installed.\n* SSL certificate validation now uses the Python cryptography module in some places where openssl was used.\n* There is a new tab to show the installed version of Mail-in-a-Box and to fetch the latest released version.\n\nSystem:\n* The munin system monitoring tool is now installed and accessible at /admin/munin.\n* ownCloud updated to version 8.0.4. The ownCloud installation step now is resilient to download problems. The ownCloud configuration file is now stored in STORAGE_ROOT to fix loss of data when moving STORAGE_ROOT to a new machine.\n* The setup scripts now run `apt-get update` prior to installing anything to ensure the apt database is in sync with the packages actually available.\n\n\nv0.10 (June 1, 2015)\n--------------------\n\n* SMTP Submission (port 587) began offering the insecure SSLv3 protocol due to a misconfiguration in the previous version.\n* Roundcube now allows persistent logins using Roundcube-Persistent-Login-Plugin.\n* ownCloud is updated to version 8.0.3.\n* SPF records for non-mail domains were tightened.\n* The minimum greylisting delay has been reduced from 5 minutes to 3 minutes.\n* Users and aliases weren't working if they were entered with any uppercase letters. Now only lowercase is allowed.\n* After installing an SSL certificate from the control panel, the page wasn't being refreshed.\n* Backups broke if the box's hostname was changed after installation.\n* Dotfiles (i.e. .svn) stored in ownCloud Files were not accessible from ownCloud's mobile/desktop clients.\n* Fix broken install on OVH VPS's.\n\n\nv0.09 (May 8, 2015)\n-------------------\n\nMail:\n\n* Spam checking is now performed on messages larger than the previous limit of 64KB.\n* POP3S is now enabled (port 995).\n* Roundcube is updated to version 1.1.1.\n* Minor security improvements (more mail headers with user agent info are anonymized; crypto settings were tightened).\n\nownCloud:\n\n* Downloading files you uploaded to ownCloud broke because of a change in ownCloud 8.\n\nDNS:\n\n* Internationalized Domain Names (IDNs) should now work in email. If you had custom DNS or custom web settings for internationalized domains, check that they are still working.\n* It is now possible to set multiple TXT and other types of records on the same domain in the control panel.\n* The custom DNS API was completely rewritten to support setting multiple records of the same type on a domain. Any existing client code using the DNS API will have to be rewritten. (Existing code will just get 404s back.)\n* On some systems the `nsd` service failed to start if network interfaces were not ready.\n\nSystem / Control Panel:\n\n* In order to guard against misconfiguration that can lead to domain control validation hijacking, email addresses that begin with admin, administrator, postmaster, hostmaster, and webmaster can no longer be used for (new) mail user accounts, and aliases for these addresses may direct mail only to the box's administrator(s).\n* Backups now use duplicity's built-in gpg symmetric AES256 encryption rather than my home-brewed encryption. Old backups will be incorporated inside the first backup after this update but then deleted from disk (i.e. your backups from the previous few days will be backed up).\n* There was a race condition between backups and the new nightly status checks.\n* The control panel would sometimes lock up with an unnecessary loading indicator.\n* You can no longer delete your own account from the control panel.\n\nSetup:\n\n* All Mail-in-a-Box release tags are now signed on github, instructions for verifying the signature are added to the README, and the integrity of some packages downloaded during setup is now verified against a SHA1 hash stored in the tag itself.\n* Bugs in first user account creation were fixed.\n\nv0.08 (April 1, 2015)\n---------------------\n\nMail:\n\n* The Roundcube vacation_sieve plugin by @arodier is now installed to make it easier to set vacation auto-reply messages from within Roundcube.\n* Authentication-Results headers for DMARC, added in v0.07, were mistakenly added for outbound mail --- that's now removed.\n* The Trash folder is now created automatically for new mail accounts, addressing a Roundcube error.\n\nDNS:\n\n* Custom DNS TXT records were not always working and they can now override the default SPF, DKIM, and DMARC records.\n\nSystem:\n\n* ownCloud updated to version 8.0.2.\n* Brute-force SSH and IMAP login attempts are now prevented by properly configuring fail2ban.\n* Status checks are run each night and any changes from night to night are emailed to the box administrator (the first user account).\n\nControl panel:\n\n* The new check that system services are running mistakenly checked that the Dovecot Managesieve service is publicly accessible. Although the service binds to the public network interface we don't open the port in ufw. On some machines it seems that ufw blocks the connection from the status checks (which seems correct) and on some machines (mine) it doesn't, which is why I didn't notice the problem.\n* The current backup chain will now try to predict how many days until it is deleted (always at least 3 days after the next full backup).\n* The list of aliases that forward to a user are removed from the Mail Users page because when there are many alises it is slow and times-out.\n* Some status check errors are turned into warnings, especially those that might not apply if External DNS is used.\n\nv0.07 (February 28, 2015)\n-------------------------\n\nMail:\n\n* If the box manages mail for a domain and a subdomain of that domain, outbound mail from the subdomain was not DKIM-signed and would therefore fail DMARC tests on the receiving end, possibly result in the mail heading into spam folders.\n* Auto-configuration for Mozilla Thunderbird, Evolution, KMail, and Kontact is now available.\n* Domains that only have a catch-all alias or domain alias no longer automatically create/require admin@ and postmaster@ addresses since they'll forward anyway.\n* Roundcube is updated to version 1.1.0.\n* Authentication-Results headers for DMARC are now added to incoming mail.\n\nDNS:\n\n* If a custom CNAME record is set on a 'www' subdomain, the default A/AAAA records were preventing the CNAME from working.\n* If a custom DNS A record overrides one provided by the box, the a corresponding default IPv6 record by the box is removed since it will probably be incorrect.\n* Internationalized domain names (IDNs) are now supported for DNS and web, but email is not yet tested.\n\nWeb:\n\n* Static websites now deny access to certain dot (.) files and directories which typically have sensitive info: .ht*, .svn*, .git*, .hg*, .bzr*.\n* The nginx server no longer reports its version and OS for better privacy.\n* The HTTP->HTTPS redirect is now more efficient.\n* When serving a 'www.' domain, reuse the SSL certificate for the parent domain if it covers the 'www' subdomain too\n* If a custom DNS CNAME record is set on a domain, don't offer to put a website on that domain. (Same logic already applies to custom A/AAAA records.)\n\nControl panel:\n\n* Status checks now check that system services are actually running by pinging each port that should have something running on it.\n* The status checks are now parallelized so they may be a little faster.\n* The status check for MX records now allow any priority, in case an unusual setup is required.\n* The interface for setting website domain-specific directories is simplified.\n* The mail guide now says that to use Outlook, Outlook 2007 or later on Windows 7 and later is required.\n* External DNS settings now skip the special \"_secondary_nameserver\" key which is used for storing secondary NS information.\n\nSetup:\n\n* Install cron if it isn't already installed.\n* Fix a units problem in the minimum memory check.\n* If you override the STORAGE_ROOT, your setting will now persist if you re-run setup.\n* Hangs due to apt wanting the user to resolve a conflict should now be fixed (apt will just clobber the problematic file now).\n\nv0.06 (January 4, 2015)\n-----------------------\n\nMail:\n\n* Set better default system limits to accommodate boxes handling mail for 20+ users.\n\nContacts/calendar:\n\n* Update to ownCloud to 7.0.4.\n* Contacts syncing via ActiveSync wasn't working.\n\nControl panel:\n\n* New control panel for setting custom DNS settings (without having to use the API).\n* Status checks showed a false positive for Spamhause blacklists and for secondary DNS in some cases.\n* Status checks would fail to load if openssh-sever was not pre-installed, but openssh-server is not required.\n* The local DNS cache is cleared before running the status checks using 'rncd' now rather than restarting 'bind9', which should be faster and wont interrupt other services.\n* Multi-domain and wildcard certificate can now be installed through the control panel.\n* The DNS API now allows the setting of SRV records.\n\nMisc:\n\n* IPv6 configuration error in postgrey, nginx.\n* Missing dependency on sudo.\n\nv0.05 (November 18, 2014)\n-------------------------\n\nMail:\n\n* The maximum size of outbound mail sent via webmail and Exchange/ActiveSync has been increased to 128 MB, the same as when using SMTP.\n* Spam is no longer wrapped as an attachment inside a scary Spamassassin explanation. The original message is simply moved straight to the Spam folder unchanged.\n* There is a new iOS/Mac OS X Configuration Profile link in the control panel which makes it easier to configure IMAP/SMTP/CalDAV/CardDAV on iOS devices and Macs.\n* \"Domain aliases\" can now be configured in the control panel.\n* Updated to [Roundcube 1.0.3](http://trac.roundcube.net/wiki/Changelog).\n* IMAP/SMTP is now recommended even on iOS devices as Exchange/ActiveSync is terribly buggy.\n\nControl panel:\n\n* Installing an SSL certificate for the primary hostname would cause problems until a restart (services needed to be restarted).\n* Installing SSL certificates would fail if /tmp was on a different filesystem.\n* Better error messages when installing a SSL certificate fails.\n* The local DNS cache is now cleared each time the system status checks are run.\n* Documented how to use +tag addressing.\n* Minor UI tweaks.\n\nOther:\n\n* Updated to [ownCloud 7.0.3](http://owncloud.org/changelog/).\n* The ownCloud API is now exposed properly.\n* DNSSEC now works on `.guide` domains now too (RSASHA256).\n\nv0.04 (October 15, 2014)\n------------------------\n\nBreaking changes:\n\n* On-disk backups are now retained for a minimum of 3 days instead of 14. Beyond that the user is responsible for making off-site copies.\n* IMAP no longer supports the legacy SSLv3 protocol. SSLv3 is now known to be insecure. I don't believe any modern devices will be affected by this. HTTPS and SMTP submission already had SSLv3 disabled.\n\nControl panel:\n\n* The control panel has a new page for installing SSL certificates.\n* The control panel has a new page for hosting static websites.\n* The control panel now shows mailbox sizes on disk.\n* It is now possible to create catch-all aliases from the control panel.\n* Many usability improvements in the control panel.\n\nDNS:\n\n* Custom DNS A/AAAA records on subdomains were ignored.\n* It is now possible to set up a secondary DNS server.\n* DNS zones were updating even when nothing changed.\n* Strict SPF and DMARC settings are now set on all subdomains not used for mail.\n\nSecurity:\n\n* DNSSEC is now supported for the .email TLD which required a different key algorithm.\n* Nginx and Postfix now use 2048 bits of DH parameters instead of 1024.\n\nOther:\n\n* Spam filter learning by dragging mail in and out of the Spam folder should hopefully be working now.\n* Some things were broken if the machine had an IPv6 address.\n* Other things were broken if the machine was on a non-utf8 locale.\n* No longer implementing webfinger.\n* Removes apache before installing nginx, in case it has been installed by distro.\n\nv0.03 (September 24, 2014)\n--------------------------\n\n* Update existing installs of Roundcube.\n* Disabled catch-alls pending figuring out how to get users to take precedence.\n* Z-Push was not working because in v0.02 we had accidentally moved to a different version.\n* Z-Push is now locked to a specific commit so it doesn't change on us accidentally.\n* The start script is now symlinked to /usr/local/bin/mailinabox.\n\nv0.02 (September 21, 2014)\n--------------------------\n\n* Open the firewall to an alternative SSH port if set.\n* Fixed missing dependencies.\n* Set Z-Push to use sync command with ownCloud.\n* Support more concurrent connections for z-push.\n* In the status checks, handle wildcard certificates.\n* Show the status of backups in the control panel.\n* The control panel can now update a user's password.\n* Some usability improvements in the control panel.\n* Warn if a SSL cert is expiring in 30 days.\n* Use SHA2 to generate CSRs.\n* Better logic for determining when to take a full backup.\n* Reduce DNS TTL, not that it seems to really matter.\n* Add SSHFP DNS records.\n* Add an API for setting custom DNS records\n* Update to ownCloud 7.0.2.\n* Some things were broken if the machine had an IPv6 address.\n* Use a dialogs library to ask users questions during setup.\n* Other fixes.\n\nv0.01 (August 19, 2014)\n-----------------------\n\nFirst versioned release after a year of unversioned development.\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 4.7529296875,
          "content": "# Mail-in-a-Box Code of Conduct\n\nMail-in-a-Box is an open source community project about working, as a group, to empower ourselves and others to have control over our own digital communications. Just as we hope to increase technological diversity on the Internet through decentralization, we also believe that diverse viewpoints and voices among our community members foster innovation and creative solutions to the challenges we face.\n\nWe are committed to providing a safe, welcoming, and harassment-free space for collaboration, for everyone, without regard to age, disability, economic situation, ethnicity, gender identity and expression, language fluency, level of knowledge or experience, nationality, personal appearance, race, religion, sexual identity and orientation, or any other attribute. Community comes first. This policy supersedes all other project goals.\n\nThe maintainers of Mail-in-a-Box share the dual responsibility of leading by example and enforcing these policies as necessary to maintain an open and welcoming environment. All community members should be excellent to each other.\n\n## Scope\n\nThis Code of Conduct applies to all places where Mail-in-a-Box community activity is occurring, including on GitHub, in discussion forums, on Slack, on social media, and in real life. The Code of Conduct applies not only on websites/at events run by the Mail-in-a-Box community (e.g. our GitHub organization, our Slack team) but also at any other location where the Mail-in-a-Box community is present (e.g. in issues of other GitHub organizations where Mail-in-a-Box community members are discussing problems related to Mail-in-a-Box, or real-life professional conferences), or whenever a Mail-in-a-Box community member is representing Mail-in-a-Box to the public at large or acting on behalf of Mail-in-a-Box.\n\nThis code does not apply to activity on a server running Mail-in-a-Box software, unless your server is hosting a service for the Mail-in-a-Box community at large.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment include:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Showing empathy towards other community members\n* Making room for new and quieter voices\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or advances\n* Trolling, insulting/derogatory/unwelcome comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic address, without explicit permission\n* Aggressive and micro-aggressive behavior, such as unconstructive criticism, providing corrections that do not improve the conversation (sometimes referred to as \"well actually\"s), repeatedly interrupting or talking over someone else, feigning surprise at someone's lack of knowledge or awareness about a topic, or subtle prejudice (for example, comments like \"That's so easy my grandmother could do it.\", which is prejudicial toward grandmothers).\n* Other conduct which could reasonably be considered inappropriate in a professional setting\n* Retaliating against anyone who reports a violation of this code.\n\nWe will not tolerate harassment. Harassment is any unwelcome or hostile behavior towards another person for any reason. This includes, but is not limited to, offensive verbal comments related to personal characteristics or choices, sexual images or comments, deliberate intimidation, bullying, stalking, following, harassing photography or recording, sustained disruption of discussion or events, nonconsensual publication of private comments, inappropriate physical contact, or unwelcome sexual attention. Conduct need not be intentional to be harassment.\n\n## Enforcement\n\nWe will remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not consistent with this Code of Conduct. We may ban, temporarily or permanently, any contributor for violating this code, when appropriate.\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project lead, [Joshua Tauberer](https://razor.occams.info/). All reports will be treated confidentially, impartially, consistently, and swiftly.\n\nBecause the need for confidentiality for all parties involved in an enforcement action outweighs the goals of openness, limited information will be shared with the Mail-in-a-Box community regarding enforcement actions that have taken place.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant, version 1.4](http://contributor-covenant.org/version/1/4) and the code of conduct of [Code for DC](http://codefordc.org/resources/codeofconduct.html).\n\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.658203125,
          "content": "# Contributing\n\nMail-in-a-Box is an open source project. Your contributions and pull requests are welcome.\n\n## Development\n\nTo start developing Mail-in-a-Box, [clone the repository](https://github.com/mail-in-a-box/mailinabox) and familiarize yourself with the code.\n\n    $ git clone https://github.com/mail-in-a-box/mailinabox\n\n### Vagrant and VirtualBox\n\nWe recommend you use [Vagrant](https://www.vagrantup.com/intro/getting-started/install.html) and [VirtualBox](https://www.virtualbox.org/wiki/Downloads) for development. Please install them first.\n\nWith Vagrant set up, the following should boot up Mail-in-a-Box inside a virtual machine:\n\n    $ vagrant up --provision\n\n_If you're seeing an error message about your *IP address being listed in the Spamhaus Block List*, simply uncomment the `export SKIP_NETWORK_CHECKS=1` line in `Vagrantfile`. It's normal, you're probably using a dynamic IP address assigned by your Internet providerthey're almost all listed._\n\n### Modifying your `hosts` file\n\nAfter a while, Mail-in-a-Box will be available at `192.168.56.4` (unless you changed that in your `Vagrantfile`). To be able to use the web-based bits, we recommend to add a hostname to your `hosts` file:\n\n    $ echo \"192.168.56.4 mailinabox.lan\" | sudo tee -a /etc/hosts\n\nYou should now be able to navigate to https://mailinabox.lan/admin using your browser. There should be an initial admin user with the name `me@mailinabox.lan` and the password `12345678`.\n\n### Making changes\n\nYour working copy of Mail-in-a-Box will be mounted inside your VM at `/vagrant`. Any change you make locally will appear inside your VM automatically.\n\nRunning `vagrant up --provision` again will repeat the installation with your modifications.\n\nAlternatively, you can also ssh into the VM using:\n\n    $ vagrant ssh\n\nOnce inside the VM, you can re-run individual parts of the setup like in this example:\n\n    vm$ cd /vagrant\n    vm$ sudo setup/owncloud.sh # replace with script you'd like to re-run\n\n### Tests\n\nMail-in-a-Box needs more tests. If you're still looking for a way to help out, writing and contributing tests would be a great start!\n\n## Public domain\n\nThis project is in the public domain. Copyright and related rights in the work worldwide are waived through the [CC0 1.0 Universal public domain dedication][CC0]. See the LICENSE file in this directory.\n\nAll contributions to this project must be released under the same CC0 wavier. By submitting a pull request or patch, you are agreeing to comply with this waiver of copyright interest.\n\n[CC0]: http://creativecommons.org/publicdomain/zero/1.0/\n\n## Code of Conduct\n\nThis project has a [Code of Conduct](CODE_OF_CONDUCT.md). Please review it when joining our community.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.8828125,
          "content": "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.71875,
          "content": "Mail-in-a-Box\n=============\n\nBy [@JoshData](https://github.com/JoshData) and [contributors](https://github.com/mail-in-a-box/mailinabox/graphs/contributors).\n\nMail-in-a-Box helps individuals take back control of their email by defining a one-click, easy-to-deploy SMTP+everything else server: a mail server in a box.\n\n**Please see [https://mailinabox.email](https://mailinabox.email) for the project's website and setup guide!**\n\n* * *\n\nOur goals are to:\n\n* Make deploying a good mail server easy.\n* Promote [decentralization](http://redecentralize.org/), innovation, and privacy on the web.\n* Have automated, auditable, and [idempotent](https://web.archive.org/web/20190518072631/https://sharknet.us/2014/02/01/automated-configuration-management-challenges-with-idempotency/) configuration.\n* **Not** make a totally unhackable, NSA-proof server.\n* **Not** make something customizable by power users.\n\nAdditionally, this project has a [Code of Conduct](CODE_OF_CONDUCT.md), which supersedes the goals above. Please review it when joining our community.\n\n\nIn The Box\n----------\n\nMail-in-a-Box turns a fresh Ubuntu 22.04 LTS 64-bit machine into a working mail server by installing and configuring various components.\n\nIt is a one-click email appliance. There are no user-configurable setup options. It \"just works.\"\n\nThe components installed are:\n\n* SMTP ([postfix](http://www.postfix.org/)), IMAP ([Dovecot](http://dovecot.org/)), CardDAV/CalDAV ([Nextcloud](https://nextcloud.com/)), and Exchange ActiveSync ([z-push](http://z-push.org/)) servers\n* Webmail ([Roundcube](http://roundcube.net/)), mail filter rules (thanks to Roundcube and Dovecot), and email client autoconfig settings (served by [nginx](http://nginx.org/))\n* Spam filtering ([spamassassin](https://spamassassin.apache.org/)) and greylisting ([postgrey](http://postgrey.schweikert.ch/))\n* DNS ([nsd4](https://www.nlnetlabs.nl/projects/nsd/)) with [SPF](https://en.wikipedia.org/wiki/Sender_Policy_Framework), DKIM ([OpenDKIM](http://www.opendkim.org/)), [DMARC](https://en.wikipedia.org/wiki/DMARC), [DNSSEC](https://en.wikipedia.org/wiki/DNSSEC), [DANE TLSA](https://en.wikipedia.org/wiki/DNS-based_Authentication_of_Named_Entities), [MTA-STS](https://tools.ietf.org/html/rfc8461), and [SSHFP](https://tools.ietf.org/html/rfc4255) policy records automatically set\n* TLS certificates are automatically provisioned using [Let's Encrypt](https://letsencrypt.org/) for protecting https and all of the other services on the box\n* Backups ([duplicity](http://duplicity.nongnu.org/)), firewall ([ufw](https://launchpad.net/ufw)), intrusion protection ([fail2ban](http://www.fail2ban.org/wiki/index.php/Main_Page)), and basic system monitoring ([munin](http://munin-monitoring.org/))\n\nIt also includes system management tools:\n\n* Comprehensive health monitoring that checks each day that services are running, ports are open, TLS certificates are valid, and DNS records are correct\n* A control panel for adding/removing mail users, aliases, custom DNS records, configuring backups, etc.\n* An API for all of the actions on the control panel\n\nInternationalized domain names are supported and configured easily (but SMTPUTF8 is not supported, unfortunately).\n\nIt also supports static website hosting since the box is serving HTTPS anyway. (To serve a website for your domains elsewhere, just add a custom DNS \"A\" record in you Mail-in-a-Box's control panel to point domains to another server.)\n\nFor more information on how Mail-in-a-Box handles your privacy, see the [security details page](security.md).\n\n\nInstallation\n------------\n\nSee the [setup guide](https://mailinabox.email/guide.html) for detailed, user-friendly instructions.\n\nFor experts, start with a completely fresh (really, I mean it) Ubuntu 22.04 LTS 64-bit machine. On the machine...\n\nClone this repository and checkout the tag corresponding to the most recent release (which you can find in the tags or releases lists on GitHub):\n\n\t$ git clone https://github.com/mail-in-a-box/mailinabox\n\t$ cd mailinabox\n\t$ git checkout TAGNAME\n\nBegin the installation.\n\n\t$ sudo setup/start.sh\n\nThe installation will install, uninstall, and configure packages to turn the machine into a working, good mail server.\n\nFor help, DO NOT contact Josh directly --- I don't do tech support by email or tweet (no exceptions).\n\nPost your question on the [discussion forum](https://discourse.mailinabox.email/) instead, where maintainers and Mail-in-a-Box users may be able to help you.\n\nNote that while we want everything to \"just work,\" we can't control the rest of the Internet. Other mail services might block or spam-filter email sent from your Mail-in-a-Box.\nThis is a challenge faced by everyone who runs their own mail server, with or without Mail-in-a-Box. See our discussion forum for tips about that.\n\n\nContributing and Development\n----------------------------\n\nMail-in-a-Box is an open source project. Your contributions and pull requests are welcome. See [CONTRIBUTING](CONTRIBUTING.md) to get started. \n\n\nThe Acknowledgements\n--------------------\n\nThis project was inspired in part by the [\"NSA-proof your email in 2 hours\"](http://sealedabstract.com/code/nsa-proof-your-e-mail-in-2-hours/) blog post by Drew Crawford, [Sovereign](https://github.com/sovereign/sovereign) by Alex Payne, and conversations with <a href=\"https://twitter.com/shevski\" target=\"_blank\">@shevski</a>, <a href=\"https://github.com/konklone\" target=\"_blank\">@konklone</a>, and <a href=\"https://github.com/gregelin\" target=\"_blank\">@GregElin</a>.\n\nMail-in-a-Box is similar to [iRedMail](http://www.iredmail.org/) and [Modoboa](https://github.com/tonioo/modoboa).\n\n\nThe History\n-----------\n\n* In 2007 I wrote a relatively popular Mozilla Thunderbird extension that added client-side SPF and DKIM checks to mail to warn users about possible phishing: [add-on page](https://addons.mozilla.org/en-us/thunderbird/addon/sender-verification-anti-phish/), [source](https://github.com/JoshData/thunderbird-spf).\n* In August 2013 I began Mail-in-a-Box by combining my own mail server configuration with the setup in [\"NSA-proof your email in 2 hours\"](http://sealedabstract.com/code/nsa-proof-your-e-mail-in-2-hours/) and making the setup steps reproducible with bash scripts.\n* Mail-in-a-Box was a semifinalist in the 2014 [Knight News Challenge](https://www.newschallenge.org/challenge/2014/submissions/mail-in-a-box), but it was not selected as a winner.\n* Mail-in-a-Box hit the front page of Hacker News in [April](https://news.ycombinator.com/item?id=7634514) 2014, [September](https://news.ycombinator.com/item?id=8276171) 2014, [May](https://news.ycombinator.com/item?id=9624267) 2015, and [November](https://news.ycombinator.com/item?id=13050500) 2016.\n* FastCompany mentioned Mail-in-a-Box a [roundup of privacy projects](http://www.fastcompany.com/3047645/your-own-private-cloud) on June 26, 2015.\n"
        },
        {
          "name": "Vagrantfile",
          "type": "blob",
          "size": 0.890625,
          "content": "# -*- mode: ruby -*-\n# vi: set ft=ruby :\n\nVagrant.configure(\"2\") do |config|\n  config.vm.box = \"ubuntu/jammy64\"\n\n  # Network config: Since it's a mail server, the machine must be connected\n  # to the public web. However, we currently don't want to expose SSH since\n  # the machine's box will let anyone log into it. So instead we'll put the\n  # machine on a private network.\n  config.vm.hostname = \"mailinabox.lan\"\n  config.vm.network \"private_network\", ip: \"192.168.56.4\"\n\n  config.vm.provision :shell, :inline => <<-SH\n    # Set environment variables so that the setup script does\n    # not ask any questions during provisioning. We'll let the\n    # machine figure out its own public IP.\n    export NONINTERACTIVE=1\n    export PUBLIC_IP=auto\n    export PUBLIC_IPV6=auto\n    export PRIMARY_HOSTNAME=auto\n    #export SKIP_NETWORK_CHECKS=1\n\n    # Start the setup script.\n    cd /vagrant\n    setup/start.sh\nSH\nend\n"
        },
        {
          "name": "api",
          "type": "tree",
          "content": null
        },
        {
          "name": "conf",
          "type": "tree",
          "content": null
        },
        {
          "name": "management",
          "type": "tree",
          "content": null
        },
        {
          "name": "security.md",
          "type": "blob",
          "size": 10.197265625,
          "content": "Mail-in-a-Box Security Guide\n============================\n\nMail-in-a-Box turns a fresh Ubuntu 22.04 LTS 64-bit machine into a mail server appliance by installing and configuring various components.\n\nThis page documents the security posture of Mail-in-a-Box. The term box is used below to mean a configured Mail-in-a-Box.\n\nReporting Security Vulnerabilities\n----------------------------------\n\nSecurity vulnerabilities should be reported to the [project's maintainer](https://joshdata.me) via email.\n\nThreat Model\n------------\n\nNothing is perfectly secure, and an adversary with sufficient resources can always penetrate a system.\n\nThe primary goal of Mail-in-a-Box is to make deploying a good mail server easy, so we balance  as everyone does  privacy and security concerns with the practicality of actually deploying the system. That means we make certain assumptions about adversaries. We assume that adversaries . . .\n\n* Do not have physical access to the box (i.e., we do not aim to protect the box from physical access).\n* Have not been given Unix accounts on the box (i.e., we assume all users with shell access are trusted).\n\nOn the other hand, we do assume that adversaries are performing passive surveillance and, possibly, active man-in-the-middle attacks. And so:\n\n* User credentials are always sent through SSH/TLS, never in the clear, with modern TLS settings.\n* Outbound mail is sent with the highest level of TLS possible.\n* The box advertises its support for [DANE TLSA](https://en.wikipedia.org/wiki/DNS-based_Authentication_of_Named_Entities), when DNSSEC is enabled at the domain name registrar, so that inbound mail is more likely to be transmitted securely.\n\nAdditional details follow.\n\nUser Credentials\n----------------\n\nThe box's administrator and its (non-administrative) mail users must sometimes communicate their credentials to the box.\n\n### Services behind TLS\n\nThese services are protected by [TLS](https://en.wikipedia.org/wiki/Transport_Layer_Security):\n\n* SMTP Submission (ports 465/587). Mail users submit outbound mail through SMTP with TLS (port 465) or STARTTLS (port 587).\n* IMAP/POP (ports 993, 995). Mail users check for incoming mail through IMAP or POP over TLS.\n* HTTPS (port 443). Webmail, the Exchange/ActiveSync protocol, the administrative control panel, and any static hosted websites are accessed over HTTPS.\n\nThe services all follow these rules:\n\n* TLS certificates are generated with 2048-bit RSA keys and SHA-256 fingerprints. The box provides a self-signed certificate by default. The [setup guide](https://mailinabox.email/guide.html) explains how to verify the certificate fingerprint on first login. Users are encouraged to replace the certificate with a proper CA-signed one. ([source](setup/ssl.sh))\n* Only TLSv1.2+ are offered (the older SSL protocols are not offered).\n* We track the [Mozilla Intermediate Ciphers Recommendation](https://wiki.mozilla.org/Security/Server_Side_TLS), balancing security with supporting a wide range of mail clients. Diffie-Hellman ciphers use a 2048-bit key for forward secrecy. For more details, see the [output of SSLyze for these ports](tests/tls_results.txt).\n\nAdditionally:\n\n* SMTP Submission on port 587 will not accept user credentials without STARTTLS (true also of SMTP on port 25 in case of client misconfiguration), and the submission port won't accept mail without encryption. The minimum cipher key length is 128 bits. (The box is of course configured not to be an open relay. User credentials are required to send outbound mail.) ([source](setup/mail-postfix.sh))\n* HTTPS (port 443): The HTTPS Strict Transport Security header is set. A redirect from HTTP to HTTPS is offered. The [Qualys SSL Labs test](https://www.ssllabs.com/ssltest) should report an A+ grade. ([source 1](conf/nginx-ssl.conf), [source 2](conf/nginx.conf))\n\n### Password Storage\n\nThe passwords for mail users are stored on disk using the [SHA512-CRYPT](http://man7.org/linux/man-pages/man3/crypt.3.html) hashing scheme. ([source](management/mailconfig.py)) Password changes (as well as changes to control panel two-factor authentication settings) expire any control panel login sessions.\n\n### Console access\n\nConsole access (e.g. via SSH) is configured by the system image used to create the box, typically from by a cloud virtual machine provider (e.g. Digital Ocean). Mail-in-a-Box does not set any console access settings, although it will warn the administrator in the System Status Checks if password-based login is turned on.\n\nThe [setup guide video](https://mailinabox.email/) explains how to verify the host key fingerprint on first login.\n\nIf DNSSEC is enabled at the box's domain name's registrar, the SSHFP record that the box automatically puts into DNS can also be used to verify the host key fingerprint by setting `VerifyHostKeyDNS yes` in your `ssh/.config` file or by logging in with `ssh -o VerifyHostKeyDNS=yes`. ([source](management/dns_update.py))\n\n### Brute-force attack mitigation\n\n`fail2ban` provides some protection from brute-force login attacks (repeated logins that guess account passwords) by blocking offending IP addresses at the network level.\n\nThe following services are protected: SSH, IMAP (dovecot), SMTP submission (postfix), webmail (roundcube), Nextcloud/CalDAV/CardDAV (over HTTP), and the Mail-in-a-Box control panel (over HTTP).\n\nSome other services running on the box may be missing fail2ban filters.\n\nOutbound Mail\n-------------\n\nThe basic protocols of email delivery did not plan for the presence of adversaries on the network. For a number of reasons it is not possible in most cases to guarantee that a connection to a recipient server is secure.\n\n### DNSSEC\n\nThe first step in resolving the destination server for an email address is performing a DNS look-up for the MX record of the domain name. The box uses a locally-running [DNSSEC](https://en.wikipedia.org/wiki/DNSSEC)-aware nameserver to perform the lookup. If the domain name has DNSSEC enabled, DNSSEC guards against DNS records being tampered with.\n\n### Encryption\n\nThe box (along with the vast majority of mail servers) uses [opportunistic encryption](https://en.wikipedia.org/wiki/Opportunistic_encryption), meaning the mail is encrypted in transit and protected from passive eavesdropping, but it is not protected from an active man-in-the-middle attack. Modern encryption settings (TLSv1 and later, no RC4) will be used to the extent the recipient server supports them. ([source](setup/mail-postfix.sh))\n\n### DANE\n\nIf the recipient's domain name supports DNSSEC and has published a [DANE TLSA](https://en.wikipedia.org/wiki/DNS-based_Authentication_of_Named_Entities) record, then on-the-wire encryption is forced between the box and the recipient MTA and this encryption is not subject to a man-in-the-middle attack. The TLSA record contains a certificate fingerprint which the receiving MTA (server) must present to the box. ([source](setup/mail-postfix.sh))\n\n### Domain Policy Records\n\nDomain policy records allow recipient MTAs to detect when the _domain_ part of of the sender address in incoming mail has been spoofed. All outbound mail is signed with [DKIM](https://en.wikipedia.org/wiki/DomainKeys_Identified_Mail) and \"quarantine\" [DMARC](https://en.wikipedia.org/wiki/DMARC) records are automatically set in DNS. Receiving MTAs that implement DMARC will automatically quarantine mail that is \"From:\" a domain hosted by the box but which was not sent by the box. (Strong [SPF](https://en.wikipedia.org/wiki/Sender_Policy_Framework) records are also automatically set in DNS.) ([source](management/dns_update.py))\n\n### User Policy\n\nWhile domain policy records prevent other servers from sending mail with a \"From:\" header that matches a domain hosted on the box (see above), those policy records do not guarantee that the user portion of the sender email address matches the actual sender. In enterprise environments where the box may host the mail of untrusted users, it is important to guard against users impersonating other users.\n\nThe box restricts the envelope sender address (also called the return path or MAIL FROM address --- this is different from the \"From:\" header) that users may put into outbound mail. The envelope sender address must be either their own email address (their SMTP login username) or any alias that they are listed as a permitted sender of. (There is currently no restriction on the contents of the \"From:\" header.)\n\nIncoming Mail\n-------------\n\n### Encryption Settings\n\nAs with outbound email, there is no way to require on-the-wire encryption of incoming mail from all senders. When the box receives an incoming email (SMTP on port 25), it offers encryption (STARTTLS) but cannot require that senders use it because some senders may not support STARTTLS at all and other senders may support STARTTLS but not with the latest protocols/ciphers. To give senders the best chance at making use of encryption, the box offers protocols back to TLSv1 and ciphers with key lengths as low as 112 bits. Modern clients (senders) will make use of the 256-bit ciphers and Diffie-Hellman ciphers with a 2048-bit key for perfect forward secrecy, however. ([source](setup/mail-postfix.sh))\n\n### MTA-STS\n\nThe box publishes a SMTP MTA Strict Transport Security ([SMTP MTA-STS](https://en.wikipedia.org/wiki/Simple_Mail_Transfer_Protocol#SMTP_MTA_Strict_Transport_Security)) policy (via DNS and HTTPS) in \"enforce\" mode. Senders that support MTA-STS will use a secure SMTP connection. (MTA-STS tells senders to connect and expect a signed TLS certificate for the \"MX\" domain without permitting a fallback to an unencrypted connection.)\n\n### DANE\n\nWhen DNSSEC is enabled at the box's domain name's registrar, [DANE TLSA](https://en.wikipedia.org/wiki/DNS-based_Authentication_of_Named_Entities) records are automatically published in DNS. Senders supporting DANE will enforce encryption on-the-wire between them and the box --- see the section on DANE for outgoing mail above. ([source](management/dns_update.py))\n\n### Filters\n\nIncoming mail is run through several filters. Email is bounced if the sender's IP address is listed in the [Spamhaus Zen blacklist](http://www.spamhaus.org/zen/) or if the sender's domain is listed in the [Spamhaus Domain Block List](http://www.spamhaus.org/dbl/). Greylisting (with [postgrey](http://postgrey.schweikert.ch/)) is also used to cut down on spam. ([source](setup/mail-postfix.sh))\n"
        },
        {
          "name": "setup",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}