{
  "metadata": {
    "timestamp": 1736561248481,
    "page": 238,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "PySimpleGUI/PySimpleGUI",
      "stars": 13506,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.0859375,
          "content": "## Contributing to PySimpleGUI\n\nWe are happy to receive issues describing bug reports and feature requests! If your bug report relates to a security vulnerability, please do not file a public issue, and please instead reach out to us at issues@PySimpleGUI.com.\n\nWe do not accept (and do not wish to receive) contributions of user-created or third-party code, including patches, pull requests, or code snippets incorporated into submitted issues. Please do not send us any such code! Bug reports and feature requests should not include any source code.\n\nIf you nonetheless submit any user-created or third-party code to us, (1) you assign to us all rights and title in or relating to the code; and (2) to the extent any such assignment is not fully effective, you hereby grant to us a royalty-free, perpetual, irrevocable, worldwide, unlimited, sublicensable, transferrable license under all intellectual property rights embodied therein or relating thereto, to exploit the code in any manner we choose, including to incorporate the code into PySimpleGUI and to redistribute it under any terms at our discretion.\n"
        },
        {
          "name": "DemoPrograms",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 35.5107421875,
          "content": "PySimpleGUI License Agreement\n\nVersion 1.1, Last updated: March 26, 2024\n\nThis PySimpleGUI License Agreement (the \"Agreement\") governs the use,\nreproduction, distribution, modification and all other exploitation of\nPySimpleGUI. The Agreement is made by and between PySimpleSoft, Inc.\n(\"Licensor\") and the person or legal entity using PySimpleGUI hereunder\n(\"Licensee\" and, together with Licensor, the \"Parties\").\n\nIf you are using PySimpleGUI on behalf of a legal entity such as an employer,\nthen \"Licensee\" means that legal entity, and you represent and warrant that you\nhave the authority and capacity to enter into this Agreement on behalf of\nLicensee.\n\n\"PySimpleGUI\" consists of the following materials:\n* the PySimpleGUI software library, version 5.0 or later (the \"Library\");\n* the PySimpleGUI Library documentation (the \"Documentation\");\n* sample programs demonstrating use of the Library (the \"Demo Programs\"); and\n* utility programs relating to PySimpleGUI (the \"Utilities\").\n\nPySimpleGUI may require you to obtain and use third-party software which is\ndistributed under separate license terms. Any such software is not considered\n\"PySimpleGUI\" hereunder and is subject solely to such separate license terms.\n\nPySimpleGUI is made available to Licensee pursuant to this Agreement for the\npurpose of (1) pursuant to Section 1.2, enabling Authorized Developers to use\nthe Library in connection with developing Licensee Applications, and to use the\nDocumentation, the Demo Programs and the Utilities in connection therewith; and\n(2) pursuant to Section 1.3, enabling End Users of the Licensee Applications to\nexecute the Library as a dependency of the Licensee Applications; each as\ndefined and more fully set forth herein and subject to the limitations set\nforth herein.\n\nLicensor agrees to license PySimpleGUI to Licensee only in accordance with the\nterms of this Agreement. By using PySimpleGUI, Licensee agrees to be bound by\nthe terms of this Agreement. If you do not agree to the terms of this\nAgreement, you may not copy, use, distribute, modify or otherwise attempt to\nexploit PySimpleGUI.\n\nLicensee acknowledges that Licensor may from time to time update or modify this\nAgreement, by publishing a new version of this Agreement on Licensor's website.\nLicensee may continue to use the version of PySimpleGUI that it previously\nobtained under the prior version of this Agreement, but any version of\nPySimpleGUI received or used thereafter shall be subject to the updated version\nof this Agreement.\n\nAccordingly, in consideration of the mutual covenants set forth herein, the\nreceipt and sufficiency of which is hereby acknowledged, the Parties agree as\nfollows.\n\n1.\tAuthorized Developers; License Grants; Limitations.\n\n1.1.\tDefinitions. As used herein:\n\n* \"Authorized Developer\" means any individual person who has registered on\n  Licensor's site at https://PySimpleGUI.com (the \"Site\") to develop one or\n  more of Licensee's own applications which make use of the Library as a\n  dependency in accordance with Section 1.5 (collectively, \"Licensee\n  Applications\") and is either (1) a Hobbyist Developer; or (2) a Commercial\n  Developer who has purchased an active PySimpleGUI paid license hereunder\n  which is fully paid up pursuant to Section 3.\n\n* \"Hobbyist Developer\" means any individual who uses PySimpleGUI for\n  development purposes solely for either or both of the following: (1) personal\n  (e.g., not on behalf of an employer or other third party), Non-Commercial\n  purposes; or (2) Non-Commercial educational or learning purposes (1 and 2\n  together, the \"Permitted No-cost Purposes\").\n\n* \"Commercial Developer\" means any individual who uses PySimpleGUI for\n  development purposes who is not a Hobbyist Developer.\n\nAs used in this Section 1, \"Non-Commercial\" means use which is both (1) not on\nbehalf or for the benefit of any company or other organization; and (2) not\ninvolving the receipt of any commercial advantage or monetary compensation. If\nyou have questions about whether your contemplated use is \"Non-Commercial,\"\nplease contact us at license@pysimplegui.com.\n\nFor the avoidance of doubt: \n\n* Only Authorized Developers (e.g., Hobbyist Developers and Commercial\n  Developers who satisfy the requirements for Authorized Developers) may use\n  PySimpleGUI for development purposes.\n\n* A Hobbyist Developer may not use PySimpleGUI for any development purpose\n  other than the Permitted No-cost Purposes.\n\n* Only Commercial Developers may use PySimpleGUI to develop Licensee\n  Applications for any commercial purpose; for the benefit of, on behalf of or\n  on computer hardware belonging to an employing company or other organization;\n  or for commercial educational purposes, such as the development of a paid\n  training course.\n\nIf you have questions about whether your contemplated Licensee Application\nwould be a Permitted No-cost Purpose subject to a Hobbyist Developer license,\nplease contact us at license@pysimplegui.com.\n\n1.2.\tDevelopment License Grants. Subject to the terms and conditions of this\nAgreement:\n\n1.2.1.\tLibrary. Licensor grants Licensee a limited, personal, revocable,\nnon-exclusive, non-sublicensable, non-transferable license during the Term (1)\nfor its Authorized Developers to internally install, use, reproduce and modify\nthe Library to develop Licensee Applications; and (2) to redistribute the\nLibrary to recipients of its Licensee Applications (\"End Users\"); provided,\nthat such redistribution may not include publishing the source code of the\nLibrary (in modified or unmodified form) in a publicly accessible website or\nrepository or in other publicly accessible form.\n\n1.2.2.\tDocumentation. Licensor grants Licensee a limited, personal, revocable,\nnon-exclusive, non-sublicensable, non-transferable license during the Term for\nits Authorized Developers to internally access, use, and reproduce a reasonable\nnumber of copies of the Documentation for the sole purpose of facilitating the\nuse of the Library by Licensee Applications in accordance with this Agreement.\nFor the avoidance of doubt, Licensee may not modify or redistribute the\nDocumentation.\n\n1.2.3.\tDemo Programs. Licensor grants Licensee a limited, personal, revocable,\nnon-exclusive, non-sublicensable, non-transferable license during the Term to\ninstall, use, execute, reproduce and modify the Demo Programs, and to\nincorporate modified portions of the Demo Programs into the Licensee\nApplications; provided, that (1) the Demo Programs may not be used for any\npurposes other than in connection with the use of the Library; and (2) the Demo\nPrograms may not be (individually or as a whole) redistributed in unmodified\nform or as a program with substantially similar functionality to the Demo\nPrograms.\n\n1.2.4.\tUtilities. Licensor grants Licensee a limited, personal, revocable,\nnon-exclusive, non-sublicensable, non-transferable license during the Term to\ninstall, use, execute, reproduce and modify the Utilities, but not to\ndistribute or publish the Utilities or any modified version.\n\n1.2.5.\tDeveloper Key Required. The licenses granted in this Section 1.2 may\nonly be exercised by Authorized Developers. For Hobbyist Developers, these\nlicenses may only be exercised within the period of time during which each such\nHobbyist Developer has a then-active Developer Key pursuant to Section 3.\nLicensor may in its discretion permit recipients of PySimpleGUI to make limited\nuse of it for a limited trial period without a Developer Key.\n\n1.2.6.\tLimitations for Hobbyist Developers. For Hobbyist Developers, the\nlicenses granted in this Section 1.2 may only be exercised for the Permitted\nNo-cost Purposes.\n\n1.2.7.\tLimitations on Modification of the Library. Licensee's right to modify\nthe Library pursuant to this Section 1.2 is further limited as follows: (a)\nLicensee may not modify or extend the Library or take any other action which\nhas the effect of enabling bypass of the Library's protection mechanisms\nrequiring the use of valid Developer Keys or Distribution Keys. (b) Licensee\nexplicitly acknowledges and agrees that Licensor's digital signature of the\nLibrary is only applicable to the unmodified Library as made available by\nLicensor, and that any modifications to the Library will result in Licensor's\ndigital signature no longer applying to the modified version.\n\n1.2.8.\tLimitations on Distribution of the Library. Licensee's right to\ndistribute the Library (in modified or unmodified form) pursuant to this\nSection 1.2 is subject to Licensee (a) including the applicable proprietary\nnotices set forth in Section 2.2; and (b) including the PySimpleGUI Flow-Down\nLicense Terms set forth in Exhibit A in the license terms that Licensee uses to\ndistribute the Licensee Application.\n\n1.2.9.\tDistribution Keys. Commercial Developers may obtain from Licensor a\nPySimpleGUI distribution key (\"Distribution Key\") through the Authorized\nDeveloper's Site account and utilizing the Distribution Key through the\nprotection mechanism made available in the Library to permit distribution to\nEnd Users. The Commercial Developer may use its Distribution Key to enable End\nUsers to install and execute the Licensee Applications, including the Library\nincorporated therein, without requiring each recipient to obtain a Developer\nKey or be limited to a trial period as described in Section 1.2.5. Licensee\nshall be responsible for all activities occurring under Distribution Keys\nobtained by its Authorized Developers and for the compliance with this\nAgreement of all Licensee Applications using such Distribution Keys.\n\n1.3.\tRun-time End User License Grant. Subject to the terms and conditions of\nthis Agreement, Licensor grants Licensee a limited, personal, revocable,\nnon-exclusive, non-sublicensable, non-transferable license during the Term to\ninstall and execute the Library solely for it and its employee End Users to\ninternally use the corresponding Licensee Applications with which the Library\nis distributed. For the avoidance of doubt, the license set forth in this\nSection 1.3 does not permit modification, external redistribution, integration\nof the Library with other software, or any other use of the Library (for\ndevelopment purposes or otherwise) except solely as distributed with the\nunmodified Licensee Applications; any such activities are permitted only by\nAuthorized Developers and only to the extent permitted by Section 1.2. If the\nLicensee Application does not include a valid Distribution Key from a\nCommercial Developer, then the period of use of the Library within the Licensee\nApplication will be limited to a trial period for any End User who does not\nregister as an Authorized Developer hereunder.\n\n1.4.\tLicense Restrictions. The licenses granted to Licensee hereunder are\nexpressly made subject to the following limitations: except as expressly\npermitted herein, Licensee may not (and shall not permit any third party to):\n(a) copy all or any portion of PySimpleGUI; (b) modify or translate\nPySimpleGUI; (c) reverse engineer, decompile or disassemble the Software, in\nwhole or in part, except solely to the extent permitted under applicable law;\n(d) create derivative works based on PySimpleGUI; (e) publicly display or\npublish PySimpleGUI; (f) rent, lease, sublicense, sell, distribute, assign,\ntransfer, or otherwise permit access to PySimpleGUI to any third party; (g)\nbypass or work around any requirements for license keys, limitations on access,\nor obfuscation or security mechanisms incorporated into PySimpleGUI; (h) use\nPySimpleGUI for illegal or otherwise harmful purposes, including without\nlimitation harassment, defamation, creation or delivery of unsolicited emails\nor spam, infringement of third party intellectual property rights or other\nthird party rights, or distribution of viruses, worms, malware or other harmful\nor destructive software; (i) incorporate PySimpleGUI or any portion thereof\ninto any software that purports to subject it to open source software or\nsimilar license terms, including any prior version of PySimpleGUI (modified or\nunmodified) which was previously distributed under such licenses; or (j)\nexercise any other right to PySimpleGUI not expressly granted in this\nAgreement. \n\n1.5.\tLicensee Application Prohibitions. Notwithstanding anything else in\nthis Agreement, Licensee shall ensure that Licensee Applications (a) do not\nhave the purpose, intent or functionality of enabling End Users to make further\nuse of PySimpleGUI for their own development purposes or to carry out any\nactivities otherwise restricted or prohibited hereunder; (b) do not have a\nsubstantially similar purpose to PySimpleGUI; (c) do not enable End Users to\ninteract, integrate or otherwise develop user interfaces via direct or indirect\naccess to PySimpleGUI's functionality; and (d) are not intended or designed for\nuse in high-risk use cases that could reasonably result in death, severe bodily\ninjury, or other physical property or environmental damage.\n\n1.6.\tNo Use with Earlier Versions of PySimpleGUI. For the avoidance of\ndoubt, no portions of PySimpleGUI distributed under this Agreement may be used\nin connection with, or in any way incorporated with or into, any versions of\nthe PySimpleGUI library prior to version 5.0 that have been distributed under\nthe GNU Lesser General Public License.\n\n1.7.\tAdditional Grant to Python Software Foundation. With regards to\nportions of PySimpleGUI that Licensor uploads to PyPI, Python Software\nFoundation (\"PSF\") may copy and redistribute such portions unmodified on PyPI\nin the form provided by Licensor, with no further action required by PSF.\n\n1.8.\tProhibition on Training Artificial Intelligence. As used herein,\n\"Artificial Intelligence\" means a system or model that is intended to generate\nor identify patterns in code or data, produce insights or correlations, or make\npredictions, recommendations, or decisions; in each case, where the system or\nmodel operates using machine learning, neural networks, large language models,\nor other approaches designed to approximate cognitive abilities. Licensee shall\nnot (and shall not directly or indirectly permit or assist anyone else to) use\nPySimpleGUI, or any part thereof, to train an Artificial Intelligence that is\noffered to third parties on a commercial basis or as part of a larger\ncommercial offering. The preceding sentence does not prohibit use of\nPySimpleGUI in conjunction with an Artificial Intelligence in other ways, such\nas developing a front-end user interface.\n\n2.\tIntellectual Property Ownership; Notices.\n\n2.1.\tLicensor Ownership. PySimpleGUI is not sold to Licensee, and all rights\nnot expressly granted herein are reserved to Licensor. As between the parties,\nLicensor and its licensors own all right, title and interest in and to\nPySimpleGUI and any part thereof, including, without limitation, all\ncopyrights, patents, trademarks, trade secrets or other intellectual property\nor proprietary rights.\n\n2.2.\tProprietary Notices. Licensee shall not modify or remove any copyright\nor patent notices or other proprietary notices or markings from any portion of\nPySimpleGUI (whether modified or unmodified) without Licensor's explicit\nwritten permission. Licensor shall ensure that any Licensee Applications that\nuse the Library include a notice in the following form within the Licensee\nApplication as well as any corresponding Licensee documentation or materials:\n\nFor unmodified versions of PySimpleGUI:\n\n    This product includes PySimpleGUI (https://PySimpleGUI.com).  PySimpleGUI\n    is Copyright (c) PySimpleSoft, Inc. and/or its licensors.  Use of\n    PySimpleGUI is subject to the license terms available at\n    https://PySimpleGUI.com/eula\n\n    PYSIMPLEGUI IS PROVIDED \"AS IS,\" WITHOUT ANY WARRANTIES, WHETHER EXPRESS OR\n    IMPLIED. PYSIMPLESOFT DISCLAIMS ALL IMPLIED WARRANTIES, INCLUDING WITHOUT\n    LIMITATION THE IMPLIED WARRANTIES OF NONINFRINGEMENT, TITLE,\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nFor modified versions of PySimpleGUI:\n\n    This product includes a modified version of PySimpleGUI\n    (https://PySimpleGUI.com).  PySimpleGUI is Copyright (c) PySimpleSoft, Inc.\n    and/or its licensors.  Use of PySimpleGUI is subject to the license terms\n    available at https://PySimpleGUI.com/eula\n\n    PYSIMPLEGUI IS PROVIDED \"AS IS,\" WITHOUT ANY WARRANTIES, WHETHER EXPRESS OR\n    IMPLIED. PYSIMPLESOFT DISCLAIMS ALL IMPLIED WARRANTIES, INCLUDING WITHOUT\n    LIMITATION THE IMPLIED WARRANTIES OF NONINFRINGEMENT, TITLE,\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\nIf the Licensee Application or the corresponding Licensee documentation or\nmaterials include Licensee's copyright notices or other third parties' notices,\nthen Licensee shall include the above notice together with such notices.\n\n2.3.\tLicensor Marks. As between the parties hereto, all of Licensor's\ntrademarks and service marks applicable to Licensor or PySimpleGUI\n(collectively, the \"Licensor Marks\") are the sole property of Licensor and/or\nits licensors. Subject to the terms and conditions of this Agreement, Licensor\ngrants Licensee a limited, personal, revocable, non-exclusive,\nnon-sublicensable, non-transferable license to use the Licensor Mark\n\"PySimpleGUI\" in connection with Licensee's permitted distribution of the\nLibrary hereunder. The license set forth in this Section 2.3 is explicitly\nconditioned on (a) Licensee's agreement not to challenge Licensor's ownership\nof the Licensor Marks at any time during the Term or thereafter; (b) Licensee\nensuring that any modified version of the Library is clearly and prominently\nnoted as such; (c) Licensee complying with all trademark usage guidelines and\nrequirements that Licensor may publish from time to time; and (d) Licensee\nimmediately correcting incorrect usage of the Licensor Marks upon request from\nLicensor. Licensee shall immediately cease usage of the Licensor Marks upon\nwritten notice thereof from Licensor. All goodwill arising from use of the\nLicensor Marks shall inure to the benefit of Licensor.\n\n3.\tDeveloper Keys; Fees and Payments.\n\n3.1.\tDeveloper Keys. In order to develop Licensee Applications pursuant to\nSection 1.2 (and subject to any limited trial period usage as may be permitted\nby Licensor from time to time), each Authorized Developer shall obtain a\nPySimpleGUI developer license key (\"Developer Key\") by registering on the\nSite as set forth therein. Each Developer Key is personal to the specific\nAuthorized Developer, and Licensee shall not permit Authorized Developers to\ndisclose, share or reuse Developer Keys. For the avoidance of doubt, any\ndisclosure, sharing or reuse of a Developer Key by Licensee's Authorized\nDevelopers, whether or not authorized by Licensee, shall be a material breach\npermitting termination of this Agreement pursuant to Section 8.3. Developer\nKeys are Licensor's Confidential Information pursuant to Section 5. Developer\nKeys are limited to a specified time period (which shall be annual from the\nstart date of the Developer Key, unless otherwise explicitly stated by\nLicensor). Upon the expiration of a Developer Key for a Hobbyist Developer,\nthey may no longer use the Developer Key and must obtain a new Developer Key\nfrom the Site in order to continue using PySimpleGUI for development purposes\npursuant to Section 1.2. Upon the expiration of a Developer Key for a\nCommercial Developer, they may continue to use their Developer Key for versions\nof PySimpleGUI released during that period, but may not obtain subsequent\nupdated versions under Section 4.2 unless they purchase a new Developer Key.\n\n3.2.\tFees for Commercial Developer Keys; Taxes. Before obtaining each\nDeveloper Key for a Commercial Developer, Licensee shall pay to Licensor the\ncorresponding fees as stated on the Site and using the payment mechanism made\navailable on the Site. All payments shall be made in United States dollars. All\namounts payable by Licensee hereunder are exclusive of taxes and similar\nassessments, and Licensee is responsible for all sales, use, and excise taxes,\nand any other similar taxes of any kind imposed by any federal, state, or local\ngovernmental or regulatory authority on any amounts payable by Licensee\nhereunder, excluding any taxes imposed on Licensor's income.\n\n3.3.\tAccuracy of Registration Details. Licensee represents and warrants that\n(a) all information provided by it and its Authorized Developers when\nregistering for Developer Keys shall be truthful, accurate, complete and not\nmisleading, and (b) it and its Authorized Developers shall not misrepresent\ntheir use of PySimpleGUI as qualifying for a Hobbyist Developer Key if their\nuse does not satisfy the Permitted No-cost Purposes.\n\n4.\tSupport and Updates.\n\n4.1.\tSupport. Licensor has no obligation hereunder to provide support to\nLicensee or its Authorized Developers. Authorized Developers may submit\nFeedback (as defined in Section 5.4) consisting of issues and bug reports to\nthe PySimpleGUI software repository as described on the Site or in the\nDocumentation. Licensor may in its sole discretion address such issues or bug\nreports in current or future versions of PySimpleGUI, but has no obligation to\ndo so.\n\n4.2.\tUpdates. Licensor has no obligation hereunder to make available updated\nversions of PySimpleGUI. In the event that Licensor elects to make available an\nupdated version of PySimpleGUI, then Authorized Developers with a then-active\nDeveloper Key may download and use the updated version, and the updated version\nshall be included in the definition of \"PySimpleGUI\" thereafter for purposes of\nthis Agreement.\n\n5.\tConfidentiality; Feedback.\n\n5.1.\tConfidential Information. Licensee acknowledges that portions of\nPySimpleGUI and certain other materials are confidential as provided herein.\n\"Confidential Information\" means any and all information, whether provided in\nwriting, orally, visually, electronically or by other means, related to\nLicensor's or its licensors' services and/or business that, whether it\nconstitutes a Trade Secret or not, is treated as confidential or secret by\nLicensor (that is, it is the subject of efforts by Licensor that are reasonable\nunder the circumstances to maintain its secrecy), including, but not limited\nto, (i) Trade Secrets as defined below; (ii) any and all other information\nwhich is disclosed by Licensor to Licensee orally, electronically, visually, or\nin a document or other tangible form which is either identified as or should be\nreasonably understood to be confidential and/or proprietary; and, (iii) any\nnotes, extracts, analysis, or materials prepared by Licensee which are copies\nof or derivative works of Licensor's or its licensors' proprietary or\nconfidential information from which the substance of Confidential Information\ncan be inferred or otherwise understood. Confidential Information shall not\ninclude information which Licensee can clearly establish by written evidence:\n(a) already is lawfully known to or independently developed by Licensee without\naccess to the Confidential Information or Trade Secrets, (b) is disclosed by\nLicensor in non-confidential published materials, (c) is generally known to the\npublic, or (d) is rightfully obtained from any third party without any\nobligation of confidentiality.\n\n5.2.\tTrade Secrets. As used herein, \"Trade Secrets\" means all non-public\ninformation whether tangible or intangible related to Licensor's and its\nlicensors' services or business that (i) derives economic value, actual or\npotential, from not being generally known to or readily ascertainable by other\npersons who can obtain economic value from its disclosure or use; and (ii) is\nthe subject of efforts that are reasonable under the circumstances to maintain\nits secrecy, which may include, without limitation, (a) marking any information\nreduced to tangible form clearly and conspicuously with a legend identifying\nits confidential or trade secret nature; (b) identifying any oral communication\nas confidential or secret immediately before, during, or after such oral\ncommunication; or (c) otherwise treating such information as confidential.\n\n5.3.\tLicensee Obligations. Licensee agrees not to disclose Confidential\nInformation or Trade Secrets to any third party and will protect and treat all\nConfidential Information and Trade Secrets with the highest degree of care.\nExcept as otherwise expressly provided in this Agreement, Licensee will not use\nor make any copies of Confidential Information or Trade Secrets, in whole or in\npart, without the prior written authorization of Licensor.  Licensee may\ndisclose Confidential Information or Trade Secrets if required by statute,\nregulation, or order of a court of competent jurisdiction, provided that\nLicensee provides Licensor with prior notice, discloses only the minimum\nConfidential Information or Trade Secrets required to be disclosed, and\ncooperates with Licensor in taking appropriate protective measures.  These\nobligations shall continue for three (3) years following termination or\nexpiration of this Agreement with respect to Confidential Information that does\nnot rise to the level of a Trade Secret and shall continue for Trade Secrets so\nlong as they remain Trade Secrets.\n\n5.4.\tFeedback. As used herein, \"Feedback\" means any comments, questions,\nsuggestions, issues, bug reports, or related feedback provided by Licensee to\nLicensor relating to PySimpleGUI, including, without limitation, suggesting or\nrecommending changes to any part of PySimpleGUI, or new features or\nfunctionality relating thereto. All Feedback is, and will be treated as,\nnon-confidential and non-proprietary, regardless of any markings Licensee may\napply to it. Licensee hereby assigns to Licensor all right, title, and interest\nin, and Licensor is free to use without any attribution or compensation to\nLicensee, any ideas, know-how, concepts, techniques, or other intellectual\nproperty and proprietary rights contained in the Feedback, whether or not\npatentable, for any purpose whatsoever, including but not limited to,\ndeveloping, manufacturing, having manufactured, licensing, marketing, and\nselling, directly or indirectly, products and services using such Feedback. To\nthe extent the foregoing assignment of rights, title and interest in and to\nFeedback is prohibited by applicable law, Licensee hereby grants Licensor a\nnon-exclusive, perpetual, irrevocable, royalty-free, fully paid-up, worldwide\nlicense (including the right to sublicense through multiple tiers) to (a) fully\nuse, practice and exploit those non-assignable rights, title and interest,\nincluding, but not limited to, the right to use, reproduce, adapt, publicly\nperform, publicly display, modify, prepare derivative works, publish, transmit\nand distribute Feedback, or any portion thereof, in any form, medium or\ndistribution method now known or hereafter existing, known or developed, for\nany purpose, and to develop, manufacture, have manufactured, license, market,\nand sell, directly or indirectly, products and services using Feedback; and (b)\nauthorize any such use by others of Feedback, or any portion thereof, in the\nsame manner.\n\n6.\tNO LICENSOR WARRANTIES; LIABILITY.\n\n6.1.\tDISCLAIMER OF WARRANTIES. PYSIMPLEGUI IS PROVIDED TO LICENSEE \"AS IS\".\nLICENSOR DOES NOT MAKE ANY, AND HEREBY SPECIFICALLY DISCLAIMS ANY,\nREPRESENTATIONS, ENDORSEMENTS, GUARANTEES, OR WARRANTIES, EXPRESS OR IMPLIED,\nRELATED TO PYSIMPLEGUI INCLUDING, BUT NOT LIMITED TO, ANY IMPLIED WARRANTY OF\nMERCHANTABILITY, TITLE, FITNESS FOR A PARTICULAR PURPOSE OR NONINFRINGEMENT OF\nINTELLECTUAL PROPERTY RIGHTS. Licensee acknowledges that Licensor does not\nguarantee compatibility between PySimpleGUI and any future versions thereof,\nand that Licensor makes no commitments as to future development, availability,\nrelease or licensing of any current or future versions of PySimpleGUI. Licensee\nwill have sole responsibility for the adequate protection and backup of\nLicensee's software, data and equipment used with PySimpleGUI. The entire risk\nas to the quality and performance of PySimpleGUI and any obligation with\nrespect to service and support is borne by Licensee. Licensee understands that\nSoftware hosted by Licensor for evaluation purposes may not be secure or\nstable. Licensee waives any claim against Licensor which may arise as a result\nof Licensee's breach of the foregoing. This Agreement does not grant Licensee\nany right to any maintenance, services, including without limitation, any\nsupport, enhancement, modification, bug fix or update to the Software, and\nLicensor is under no obligation to provide or inform Licensee of any such\nmaintenance or services.\n\n6.2.\tDISCLAIMER OF LIABILITY. LICENSEE EXPLICITLY AGREES THAT, TO THE\nMAXIMUM EXTENT PERMITTED BY LAW, LICENSOR SHALL NOT BE LIABLE UNDER ANY LEGAL\nTHEORY FOR ANY DAMAGES SUFFERED IN CONNECTION WITH THE USE OF THE SOFTWARE,\nINCLUDING BUT NOT LIMITED TO ANY LOST PROFITS, LOST SAVINGS OR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES,\nWHETHER RESULTING FROM IMPAIRED OR LOST DATA, SOFTWARE OR COMPUTER FAILURE, THE\nLICENSEE APPLICATIONS, OR ANY OTHER CAUSE, BY LICENSEE OR ANY OTHER THIRD\nPARTY, EVEN IF IT HAS BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.\nLICENSEE HEREBY EXPRESSLY RELEASES LICENSOR FROM ANY AND ALL LIABILITY OR\nRESPONSIBILITY TO ANY DAMAGE CAUSED, DIRECTLY OR INDIRECTLY, TO LICENSEE OR ANY\nTHIRD PARTY AS A RESULT OF THE USE OF THE SOFTWARE OR THE INSTALLATION THEREOF\nINTO LICENSEE'S COMPUTER ENVIRONMENT. IN THE EVENT THAT THE DISCLAIMERS OF\nLIABILITY SET FORTH HEREIN ARE HELD TO BE UNENFORCEABLE, THE PARTIES AGREE THAT\nUNDER NO CIRCUMSTANCES SHALL LICENSOR'S AGGREGATE LIABILITY HEREUNDER OR IN\nCONNECTION WITH THIS AGREEMENT EXCEED THE AMOUNTS PAID BY LICENSEE TO LICENSOR\nIN THE 12 MONTHS PRECEDING THE DATE THAT A CLAIM FIRST ACCRUES. LICENSEE SHALL\nBRING ANY CLAIM AGAINST LICENSOR WITHIN 12 MONTHS OF THE DATE THAT THE CLAIM\nFIRST ACCRUES, AND HEREBY WAIVES ANY CLAIMS THAT IT DOES NOT BRING WITHIN SUCH\nTIME PERIOD.\n\n6.3.\tEssential Terms. THIS SECTION 6 IS AN ESSENTIAL BASIS OF LICENSOR'S\nDECISION TO OFFER PYSIMPLEGUI, AND SHALL APPLY REGARDLESS OF THE LEGAL THEORY\nUPON WHICH DAMAGES MAY BE CLAIMED; REGARDLESS OF WHETHER A PARTY KNEW OR SHOULD\nHAVE KNOWN OF THE POSSIBILITY OF SUCH DAMAGES; AND REGARDLESS OF WHETHER THE\nFOREGOING LIMITATIONS OF LIABILITY CAUSE ANY REMEDY TO FAIL IN ITS ESSENTIAL\nPURPOSE.\n\n7.\tIndemnification. Licensee agrees to defend, indemnify and hold Licensor\nand its directors, officers, employees and representatives harmless for any\nclaims, expenses, losses, costs, fees (including attorneys' fees) or damages of\nany sort resulting from (a) Licensee's breach of this Agreement; (b) Licensee's\nuse of PySimpleGUI or exercise of the license rights granted hereunder; or (c)\nthe Licensee Applications, or Licensee's or any third party's use thereof. \n\n8.\tTerm and Termination.\n\n8.1.\tTerm. This Agreement shall commence on the date on which Licensee\ndownloads PySimpleGUI or otherwise obtains a copy of PySimpleGUI, and shall\ncontinue thereafter until terminated as set forth herein.\n\n8.2.\tTermination by Licensee. Licensee may terminate this Agreement with\nwritten notice to Licensor, effective upon Licensee destroying all copies of\nPySimpleGUI in its possession and refraining from receiving or downloading\nfurther copies.\n\n8.3.\tTermination for Licensee's Breach. This limited License will\nimmediately terminate without notice if Licensee fails to comply with any\nobligation of this Agreement. Additionally, if Licensor reasonably suspects\nthat Licensee has breached the Agreement, then Licensor may deliver written\nnotice of the suspected breach to Licensee, and the Agreement shall\nautomatically terminate 10 days following the date of such notice unless\nLicensee cures the breach to Licensor's satisfaction within such period.\n\n8.4.\tEffect of Termination; Survival. Upon termination of this Agreement for\nany reason, the licenses granted to Licensee with respect to PySimpleGUI shall\nimmediately terminate and Licensee hereby undertakes to: (i) immediately cease\nto use, distribute or otherwise exploit any part of PySimpleGUI or any modified\nversion thereof; and (ii) promptly destroy and delete any copy of PySimpleGUI\ninstalled or copied by Licensee. Sections 2.1, 2.3, 3, 5-7, 8.4, 9 and 10 will\nsurvive termination of this Agreement indefinitely in accordance with their\nterms.\n\n9.\tAssignment; Governing Law. The License is personal to Licensee and\nLicensee agrees not to transfer, sublicense, lease, rent, or assign their\nrights under this Agreement, and any such attempt shall be null and void.\nLicensor may assign, transfer, or sublicense this Agreement or any rights or\nobligations thereunder at any time in its sole discretion. This Agreement shall\nbe governed by and construed in accordance with the laws of the State of North\nCarolina and the United States of America without regard to the conflicts of\nlaws provisions thereof. The parties expressly exclude the United Nations\nConvention on Contracts for the International Sale of Goods from this\nAgreement. All actions arising out of or in connection with this Agreement\nshall be brought in the state or federal courts residing in Durham, North\nCarolina, United States of America, and both parties hereby irrevocably consent\nto the exclusive jurisdiction of such courts and waive any objections as to\nvenue or inconvenience of forum.\n\n10.\tMiscellaneous. No changes or modifications to this Agreement by\nLicensee or waivers of any provision of this Agreement by Licensor shall be\neffective unless evidenced in a writing referencing this Agreement and signed\nfor and on behalf of Licensor. The failure of Licensor to enforce its rights\nunder this Agreement at any time for any period shall not be construed as a\nwaiver of such rights. There are no third party beneficiaries hereunder. This\nAgreement constitutes the entire agreement between the parties regarding the\nsubject matter hereof and supersede all negotiations, conversations, or\ndiscussions between or among the parties relating to the subject matter of this\nAgreement. Neither Party relied on any promises or representations, written or\noral, of the other party in forming this Agreement, except for those expressly\ncontained herein. In the event that any provision of this Agreement shall be\ndetermined to be unenforceable, that provision will be limited or eliminated to\nthe minimum extent necessary so that this Agreement shall otherwise remain in\nfull force and effect and enforceable. Licensee may not distribute, download or\notherwise export or re-export PySimpleGUI or any underlying technology except\nin full compliance with this Agreement, United States laws and regulations and\nany other applicable laws and regulations. Licensee represents and warrants\nthat it and its Authorized Developers are not located in, under control of, or\na national or resident of any country where exercise of the licenses granted\nhereunder would not comply with all such laws or regulations. It is agreed that\nbecause of the proprietary nature of PySimpleGUI, Licensor's remedies at law\nfor a breach by the Licensee of its obligations under this Agreement may be\ninadequate and that Licensor will, in the event of such breach, be entitled to,\nin addition to any other remedy available to it, equitable relief, including\ninjunctive relief, without the posting of any bond and in addition to all other\nremedies provided under this Agreement or available at law.\n\nExhibit A\n\nPySimpleGUI Flow-Down License Terms\n\nThis product (the \"Product\") includes PySimpleGUI (https://PySimpleGUI.com) or\na version of PySimpleGUI modified by the person or legal entity that provided\nyou with this product (\"Provider\").\n\nPySimpleGUI is Copyright (c) PySimpleSoft, Inc. and/or its licensors.\n\nUse of PySimpleGUI is subject to the license terms available at\nhttps://PySimpleGUI.com/eula, including all limitations of liability and other\nterms set forth therein. By using the Product, you acknowledge and agree that\nPySimpleSoft has no obligation or liability to you regarding the operation,\nsupport or maintenance of PySimpleGUI or of the Product. PYSIMPLEGUI IS\nPROVIDED \"AS IS,\" WITHOUT ANY WARRANTIES, WHETHER EXPRESS OR IMPLIED.\nPYSIMPLESOFT DISCLAIMS ALL IMPLIED WARRANTIES, INCLUDING WITHOUT LIMITATION THE\nIMPLIED WARRANTIES OF NONINFRINGEMENT, TITLE, MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0146484375,
          "content": "<p align=\"center\">\n    <img src=\"https://pysimplegui.net/images/big_news_emoji2.png\">\n    <br>\n    For more information visit <a href=\"https://home.PySimpleGUI.com\">PySimpleGUI.com</a>\n</p>\n\n\n##\n\n<p align=\"center\">\n    <img height=\"250\" src=\"https://pysimplegui.net/images/logos/Logo_Full_Transparent_Cropped.png\">\n    <h2 align=\"center\">User Interfaces for Humans<sup>TM</sup></h2>\n</p>\n\n# Welcome to PySimpleGUI 5 !!\n\nDo you use PySimpleGUI 4? [Here is what you need to know.](https://docs.pysimplegui.com/en/latest/readme/sunset/)\n\n**PySimpleGUI creates desktop applications easily**, enhancing the tkinter, Qt, WxPython, and Remi frameworks with a much simpler programming interface:\n\n1. PySimpleGUI user interfaces are defined using core Python data types (lists and dictionaries) that are easily understood by beginners.\n2. PySimpleGUI event handling changes from a complex callback-based model to a simple message passing one.\n3. PySimpleGUI uses simple Python code and has no requirement for object oriented architecture.\n\nPySimpleGUI is more than a GUI library: PySimpleGUI simplifies much of your Python development process. Sure, it makes developing user interfaces much easier, but PySimpleGUI also tames advanced Python functionality (such as threading) and makes it easy for all users to take their Python applications to the next level. PySimpleGUI is a robust toolkit.\n\n## Introducing PySimpleGUI 5\n\nFor the last 5 years, PySimpleGUI offered free software with the hope of sustaining the\ncompany by donations. We appreciate the support we received, but the amount has been too\nsmall to support the PySimpleGUI project. For this reason, PySimpleGUI is switching to a\ncommercial model, where commercial users are expected to pay a nominal license fee.\n\n\nPySimpleGUI is now part of PySimpleSoft, Inc., whose mission is to make the best Python\napplication development environment much, much better. Since launching in 2018, PySimpleGUI\nhas helped hobbyists and professionals alike create Python GUIs in a fraction of the time.\nPySimpleGUI 5 takes PySimpleGUI to the next level, providing hundreds of improvements,\nincluding new features, enhanced security, and priority support.\n\n\nPySimpleGUI 5 is licensed software. As the [License Agreement](LICENSE.txt) explains, after a trial\nperiod, all PySimpleGUI 5 users must register at PySimpleGUI.com to obtain a Developer Key.\nFor most users (Hobbyist Users), the license is at NO COST. If you are a Commercial User, you must buy a license.\n\n<p align=\"center\">\n    <img src=\"https://pysimplegui.net/images/pricing_summary.png\">\n</p>\n\n[Register Now](https://pricing.PySimpleGUI.com) and help support the PySimpleGUI community.\n\n## Examples\n\nPySimpleGUI users have created thousands of amazing desktop applications. Here are a few screen shots. For more examples, see the [PySimpleGUI gallery](https://gallery.PySimpleGUI.com/).\n\n<p align=\"center\">\n    <img height=\"150\" src=\"https://pysimplegui.net/images/for_readme/gallery1.jpg\" />\n    <img height=\"150\" src=\"https://pysimplegui.net/images/for_readme/gallery2.jpg\" />\n    <img height=\"150\" src=\"https://pysimplegui.net/images/for_readme/gallery3.jpg\" />\n</p>\n\n## Get Started at No Cost\n\nWhether you are a Hobbyist User or Commercial User, you can start using PySimpleGUI at no cost.\nTo get started with a 30-day trial period, first install Python and then\n\n    python -m pip install pysimplegui\n\nand run some code, like\n\n    import PySimpleGUI as sg\n    layout = [ [sg.Text('Hello, world!')] ]\n    window = sg.Window('Hello Example', layout)\n    while True:\n        event, values = window.read()\n        if event == sg.WIN_CLOSED:\n            break\n    window.close()\n\n(You might need to use `python3` instead of `python`.)\n\nYou can try PySimpleGUI for 30 days, after which you will need to register. Hobbyist users register at no cost, and Commercial Users must buy a license. For more details, see [PySimpleGUI.com/pricing](https://pricing.PySimpleGUI.com).\n\n## Documentation\n\nPySimpleGUI provides extensive documentation. Here are some starting points, depending on your needs and expertise:\n\n\n* [FAQ](https://faq.pysimplegui.com/) - Frequently Asked Questions\n* [Documentation](https://docs.pysimplegui.com/) - Extensive PySimpleGUI documentation*\n* [Examples](https://examples.pysimplegui.com/) - Hundreds of sample PySimpleGUI applications.\n* [SDK Reference](https://sdk.pysimplegui.com/) - details for each PySimpleGUI element\n* [Home Website](https://PySimpleGUI.com) - New PySimpleGUI home page\n* [GitHub Repo](https://github.PySimpleGUI.com) - Informational only. Download from PyPi with pip.\n* [Updated Documentation](https://docs.PySimpleGUI.com) - Everything you need to know about the latest and best PySimpleGUI\n\t* [Cookbook](https://cookbook.PySimpleGUI.com) - Hundreds of basic PySimpleGUI examples. Find a starting point that is close to what you need.\n\t* [Call Reference](https://cookbook.PySimpleGUI.com) - Just the facts, Ma'am\n* [Udemy Course](https://www.udemy.com/course/pysimplegui/?couponCode=2B7B3757CA48ACB49EBF) - Become a PySimpleGUI expert in no time. Bundled with Commercial Developer License.\n"
        },
        {
          "name": "development_build_changelog.txt",
          "type": "blob",
          "size": 0.2275390625,
          "content": "Changelog since last major release\n\n5.0.8       Released 06-Jan-2025\n\n5.0.8.1     User Setting API - if attempting to read the global PSG settings file and it's empty, print an error rather than attempting to display an error window\n"
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}