{
  "metadata": {
    "timestamp": 1736711289966,
    "page": 22,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "p0dalirius/Awesome-RCE-techniques",
      "stars": 1858,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 12.626953125,
          "content": "# Introduction\n\n### Welcome contributors!\n\nFirst off, thank you for considering contributing to Awesome-RCE-techniques. It's people like you that make Awesome-RCE-techniques such a great ressource.\n\n### Our guidelines.\n\nPlease take a moment to review this document in order to make the contribution process easy and effective for everyone involved. Awesome-RCE-techniques is a compilation of code exectution techniques that aims to be the most comprehansive and beginner friendly.\n\n\n### Contributions we are looking for.\n\nDocumentating all the RCE techniques is a time consuming process, you can help by : \n\n * Reporting a technique or an application that isn't covered yet. Consider adding all the informations you got to help \nthe team (github page, version, screenshot, documentation, walkthrough ...)\n * Writing a step-by-step process of how to achieve Remote Code Execution on this application.\n * Providing test environnment (docker) to allow everyone to try these Remote Code Execution (RCE) techniques locally.\n\n### Contributions we are NOT looking for.\n\nPlease, don't use the issue tracker for support questions. If you can't figure out how to RCE an application, feel free to check this ressources:\n\n * The Hacker Recipes (https://www.thehacker.recipes/)\n * HackTricks (https://book.hacktricks.xyz/welcome/readme)\n * Payloads All The Things (https://github.com/swisskyrepo/PayloadsAllTheThings)\n\n# Community Code of Conduct\n\n### Be respectful\n\n> This community and its members treat one another with respect. Everyone can make a valuable contribution to Awesome-RCE-techniques. We may not always agree, but disagreement is no excuse for poor behavior and poor manners. We might all experience some frustration now and then, but we cannot allow that frustration to turn into a personal attack. It's important to remember that a community where people feel uncomfortable or threatened isn't a productive one. We expect members of the community to be respectful when dealing with other contributors as well as with people outside the Awesome-RCE-techniques project and with users of this documentation.\n\n### Be collaborative\n\n> Collaboration is central to the free software community. We should always be open to collaboration. Your work should be done\ntransparently and patches should be given back to the community when they're made, not just when the distribution releases. If you wish to work on new code for existing upstream projects, at least keep those projects informed of your ideas and progress. It many not be possible to get consensus from upstream, or even from your colleagues about the correct implementation for an idea, so don't feel obliged to have that agreement before you begin, but at least keep the outside world informed of your work, and publish your work in a way that allows outsiders to test, discuss, and contribute to your efforts.\n\n### When you disagree, consult others\n\n> Disagreements, both political and technical, happen all the time and the Celery community is no exception. It's important that we resolve disagreements and differing views constructively and with the help of the community and community process. If you really want to go a different way, then we encourage you to make a derivative distribution or alternate set of packages that still build on the work we've done to utilize as common of a core as possible.\n\n### When you're unsure, ask for help\n\n> Nobody knows everything, and nobody is expected to be perfect. Asking questions avoids many problems down the road, and so questions are encouraged. Those who are asked questions should be responsive and helpful. However, when asking a question, care must be taken to do so in an appropriate forum.\n\n### Step down considerately\n\nDevelopers on every project come and go and here is no different. When you leave or disengage from the project, in whole or in part, we ask that you do so in a way that minimizes disruption to the project. This means you should tell people you're leaving and take the proper steps to ensure that others can pick up where you left off.\n\n[source: [Celery](https://github.com/celery/celery/blob/master/CONTRIBUTING.rst#community-code-of-conduct) \n\n# Your First Contribution\n\n> Unsure where to begin contributing to Awesome-RCE-techniques? You can start by looking through these beginner and help-wanted issues:\n> Beginner issues - issues which should only require a few lines of code, and a test or two.\n> Help wanted issues - issues which should be a bit more involved than beginner issues.\n> Both issue lists are sorted by total number of comments. While not perfect, number of comments is a reasonable proxy for impact a given change will have.\n\n[source: [Atom](https://github.com/atom/atom/blob/master/CONTRIBUTING.md#your-first-code-contribution)] **Need more inspiration?** [1] [Read the Docs](http://docs.readthedocs.org/en/latest/contribute.html#contributing-to-development) [2] [Django](https://docs.djangoproject.com/en/dev/internals/contributing/new-contributors/#first-steps) (scroll down to \"Guidelines\" as well)\n\n### You never contributed to an open source project ?\nHere are a couple of friendly tutorials: http://makeapullrequest.com/ and http://www.firsttimersonly.com/\n\n> Working on your first Pull Request? You can learn how from this *free* series, [How to Contribute to an Open Source Project on GitHub](https://egghead.io/series/how-to-contribute-to-an-open-source-project-on-github).\n\n[source: [React](https://github.com/facebook/react/blob/master/CONTRIBUTING.md#pull-requests)]  \n\nAs a side note, it helps to use newcomer-friendly language throughout the rest of your document. Here are a couple of examples from [Active Admin](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md):\n\n>At this point, you're ready to make your changes! Feel free to ask for help; everyone is a beginner at first :smile_cat:\n>\n>If a maintainer asks you to \"rebase\" your PR, they're saying that a lot of code has changed, and that you need to update your branch so it's easier to merge.\n\n# Getting started\n### Give them a quick walkthrough of how to submit a contribution.\nHow you write this is up to you, but some things you may want to include:\n\n>For something that is bigger than a one or two line fix:\n\n>1. Create your own fork of the code\n>2. Do the changes in your fork\n>3. If you like the change and think the project could use it:\n    * Be sure you have followed the code style for the project.\n    * Sign the Contributor License Agreement, CLA, with the jQuery Foundation.\n    * Note the jQuery Foundation Code of Conduct.\n    * Send a pull request indicating that you have a CLA on file.\n\n[source: [Requirejs](http://requirejs.org/docs/contributing.html)] **Need more inspiration?** [1] [Active Admin](https://github.com/activeadmin/activeadmin/blob/master/CONTRIBUTING.md#1-where-do-i-go-from-here) [2] [Node.js](https://github.com/nodejs/node/blob/master/CONTRIBUTING.md#code-contributions) [3] [Ember.js](https://github.com/emberjs/ember.js/blob/master/CONTRIBUTING.md#pull-requests)\n\n### If you have a different process for small or \"obvious\" fixes, let them know.\n\n> Small contributions such as fixing spelling errors, where the content is small enough to not be considered intellectual property, can be submitted by a contributor as a patch, without a CLA.\n>\n>As a rule of thumb, changes are obvious fixes if they do not introduce any new functionality or creative thinking. As long as the change does not affect functionality, some likely examples include the following:\n>* Spelling / grammar fixes\n>* Typo correction, white space and formatting changes\n>* Comment clean up\n>* Bug fixes that change default return values or error codes stored in constants\n>* Adding logging messages or debugging output\n>* Changes to ‘metadata’ files like Gemfile, .gitignore, build scripts, etc.\n>* Moving source files from one directory or package to another\n\n[source: [Chef](https://github.com/chef/chef/blob/master/CONTRIBUTING.md#chef-obvious-fix-policy)] **Need more inspiration?** [1] [Puppet](https://github.com/puppetlabs/puppet/blob/master/CONTRIBUTING.md#making-trivial-changes)\n\n# How to report a bug\n### Explain security disclosures first!\nAt bare minimum, include this sentence:\n> If you find a security vulnerability, do NOT open an issue. Email XXXX instead.\n\nIf you don’t want to use your personal contact information, set up a “security@” email address. Larger projects might have more formal processes for disclosing security, including encrypted communication. (Disclosure: I am not a security expert.)\n\n> Any security issues should be submitted directly to security@travis-ci.org\n> In order to determine whether you are dealing with a security issue, ask yourself these two questions:\n> * Can I access something that's not mine, or something I shouldn't have access to?\n> * Can I disable something for other people?\n>\n> If the answer to either of those two questions are \"yes\", then you're probably dealing with a security issue. Note that even if you answer \"no\" to both questions, you may still be dealing with a security issue, so if you're unsure, just email us at security@travis-ci.org.\n\n[source: [Travis CI](https://github.com/travis-ci/travis-ci/blob/master/CONTRIBUTING.md)] **Need more inspiration?** [1] [Celery](https://github.com/celery/celery/blob/master/CONTRIBUTING.rst#security) [2] [Express.js](https://github.com/expressjs/express/blob/master/Security.md)\n\n### Tell your contributors how to file a bug report.\nYou can even include a template so people can just copy-paste (again, less work for you).\n\n> When filing an issue, make sure to answer these questions:\n>\n> 1. What operating system and processor architecture are you using?\n> 2. What did you do?\n> 3. What did you expect to see?\n> 4. What did you see instead?\n\n[source: [Go](https://github.com/golang/go/blob/master/CONTRIBUTING.md#filing-issues)] **Need more inspiration?** [1] [Celery](https://github.com/celery/celery/blob/master/CONTRIBUTING.rst#other-bugs ) [2] [Atom](https://github.com/atom/atom/blob/master/CONTRIBUTING.md#reporting-bugs) (includes template)\n\n# How to suggest a feature or enhancement\n### If you have a particular roadmap, goals, or philosophy for development, share it here.\nThis information will give contributors context before they make suggestions that may not align with the project’s needs.\n\n> The Express philosophy is to provide small, robust tooling for HTTP servers, making it a great solution for single page applications, web sites, hybrids, or public HTTP APIs.\n>\n> Express does not force you to use any specific ORM or template engine. With support for over 14 template engines via Consolidate.js, you can quickly craft your perfect framework.\n\n[source: [Express](https://github.com/expressjs/express#philosophy)] **Need more inspiration?** [Active Admin](https://github.com/activeadmin/activeadmin#goals)\n\n### Explain your desired process for suggesting a feature.\nIf there is back-and-forth or signoff required, say so. Ask them to scope the feature, thinking through why it’s needed and how it might work.\n\n> If you find yourself wishing for a feature that doesn't exist in Elasticsearch, you are probably not alone. There are bound to be others out there with similar needs. Many of the features that Elasticsearch has today have been added because our users saw the need. Open an issue on our issues list on GitHub which describes the feature you would like to see, why you need it, and how it should work.\n\n[source: [Elasticsearch](https://github.com/elastic/elasticsearch/blob/master/CONTRIBUTING.md#feature-requests)] **Need more inspiration?** [1] [Hoodie](https://github.com/hoodiehq/hoodie/blob/master/CONTRIBUTING.md#feature-requests) [2] [Ember.js](https://github.com/emberjs/ember.js/blob/master/CONTRIBUTING.md#requesting-a-feature)\n\n# Code review process\n\n### Explain how a contribution gets accepted after it’s been submitted.\n\nWho reviews it? Who needs to sign off before it’s accepted? When should a contributor expect to hear from you? How can contributors get commit access, if at all?\n\n> The core team looks at Pull Requests on a regular basis in a weekly triage meeting that we hold in a public Google Hangout. The hangout is announced in the weekly status updates that are sent to the puppet-dev list. Notes are posted to the Puppet Community community-triage repo and include a link to a YouTube recording of the hangout.\n> After feedback has been given we expect responses within two weeks. After two weeks we may close the pull request if it isn't showing any activity.\n\n[source: [Puppet](https://github.com/puppetlabs/puppet/blob/master/CONTRIBUTING.md#submitting-changes)] **Need more inspiration?** [1] [Meteor](https://meteor.hackpad.com/Responding-to-GitHub-Issues-SKE2u3tkSiH ) [2] [Express.js](https://github.com/expressjs/express/blob/master/Contributing.md#becoming-a-committer)\n"
        },
        {
          "name": "Content-Management-Systems-(CMS)",
          "type": "tree",
          "content": null
        },
        {
          "name": "Frameworks",
          "type": "tree",
          "content": null
        },
        {
          "name": "Learning-Management-Systems-(LMS)",
          "type": "tree",
          "content": null
        },
        {
          "name": "Other",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.6396484375,
          "content": "# Awesome RCE techniques\n\n<p align=\"center\">\n  Awesome list of techniques to achieve Remote Code Execution (RCE) on various apps!\n  <br>\n  <img alt=\"Number of RCE techniques\" src=\"https://img.shields.io/badge/techniques-24-brightgreen\">\n  <a href=\"https://twitter.com/intent/follow?screen_name=podalirius_\" title=\"Follow\"><img src=\"https://img.shields.io/twitter/follow/podalirius_?label=Podalirius&style=social\"></a>\n  <a href=\"https://www.youtube.com/c/Podalirius_?sub_confirmation=1\" title=\"Subscribe\"><img alt=\"YouTube Channel Subscribers\" src=\"https://img.shields.io/youtube/channel/subscribers/UCF_x5O7CSfr82AfNVTKOv_A?style=social\"></a>\n  <br>\n</p>\n\n## Goal of this project\n\nThe goal of this project is to provide an OpenSource knowledge database of all the techniques to achieve Remote Code Execution (RCE) on various applications. All of these techniques also comes with a test environnement (usually a Docker image) for you to train these techniques.\n\n## Techniques\n\n\n - [Content-Management-Systems-(CMS)](./Content-Management-Systems-(CMS)/)\n   + [**Drupal**: (3 techniques)](./Content-Management-Systems-(CMS)/Drupal/)\n   + [**FuelCMS**: (1 technique)](./Content-Management-Systems-(CMS)/FuelCMS/)\n   + [**Joomla**: (1 technique)](./Content-Management-Systems-(CMS)/Joomla/)\n   + [**SweetRice**: (2 techniques)](./Content-Management-Systems-(CMS)/SweetRice/)\n   + [**Typo3**: (1 technique)](./Content-Management-Systems-(CMS)/Typo3/)\n   + [**Wordpress**: (3 techniques)](./Content-Management-Systems-(CMS)/Wordpress/)\n\n\n - [Frameworks](./Frameworks/)\n   + [**Apache-Tomcat**: (2 techniques)](./Frameworks/Apache-Tomcat/)\n   + [**JBoss**: (1 technique)](./Frameworks/JBoss/)\n   + [**JoGet**: (1 technique)](./Frameworks/JoGet/)\n   + [**WildFly**: (1 technique)](./Frameworks/WildFly/)\n\n\n - [Learning-Management-Systems-(LMS)](./Learning-Management-Systems-(LMS)/)\n   + [**Moodle**: (1 technique)](./Learning-Management-Systems-(LMS)/Moodle/)\n\n\n - [Other](./Other/)\n   + [**GiTea**: (1 technique)](./Other/GiTea/)\n   + [**Gitlab**: (1 technique)](./Other/Gitlab/)\n   + [**Jenkins**: (1 technique)](./Other/Jenkins/)\n   + [**LimeSurvey**: (1 technique)](./Other/LimeSurvey/)\n   + [**PHP**: (1 technique)](./Other/PHP/)\n   + [**Rocket.Chat**: (1 technique)](./Other/Rocket.Chat/)\n   + [**Webmin**: (1 technique)](./Other/Webmin/)\n\n\n\n## Work in progress\n\nThese techniques are a work in progress. You can help us finish them by opening a pull request!\n\n\n\n## Troubleshooting\n\nReport all the issues on https://github.com/p0dalirius/Awesome-RCE-techniques/issues.\n\n## Contributors\n\nPull requests are welcome. Feel free to open an issue if you want to add other Remote Code Execution (RCE) techniques."
        }
      ]
    }
  ]
}