{
  "metadata": {
    "timestamp": 1736710308644,
    "page": 100,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "hrvach/deskhop",
      "stars": 6670,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".clang-format",
          "type": "blob",
          "size": 0.6220703125,
          "content": "BasedOnStyle: LLVM\nBinPackParameters: 'false'\nBinPackArguments: 'false'\nAlignAfterOpenBracket: Align\nAlignConsecutiveMacros: 'true'\nAlignConsecutiveAssignments: 'true'\nAlignConsecutiveDeclarations: 'false'\nAlignEscapedNewlines: Left\nAlignOperands: 'true'\nAlignTrailingComments: 'true'\nAllowAllArgumentsOnNextLine: 'true'\nAllowShortFunctionsOnASingleLine: 'false'\nBreakBeforeBinaryOperators: 'All'\nColumnLimit: '110'\nIndentWidth: '4'\nIndentCaseLabels: 'true'\nIndentWrappedFunctionNames: 'false'\nKeepEmptyLinesAtTheStartOfBlocks: 'true'\nMaxEmptyLinesToKeep: '2'\nPointerAlignment: Right\nReflowComments: 'true'\nStandard: Cpp11\nUseTab: Never\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.005859375,
          "content": "build\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 3.8583984375,
          "content": "cmake_minimum_required(VERSION 3.6)\n\n## Version Configuration\nset(VERSION_MAJOR 00)\nset(VERSION_MINOR 162)\n\n## Release Type Selection\noption(DH_DEBUG \"Build a debug version\" OFF)\n\n## Hardware Configuration\nset(DP_PIN_DEFAULT 14 CACHE STRING \"Default USB D+ Pin Number\")\nset(PIO_USE_TINYUSB 1 CACHE STRING \"Make TinyUSB Manage the PIO USB Port\")\nset(PICO_BOARD \"pico\")\n\n## Pico SDK Configuration\nset(PICO_SDK_FETCH_FROM_GIT off)\nset(PICO_SDK_PATH ${CMAKE_CURRENT_LIST_DIR}/pico-sdk)\nset(SRC_DIR ${CMAKE_CURRENT_LIST_DIR}/src)\ninclude(pico_sdk_import.cmake)\n\n## Project Setup\nproject(deskhop_project C CXX ASM)\nset(CMAKE_C_STANDARD 11)\nset(CMAKE_CXX_STANDARD 17)\nset(PICO_COPY_TO_RAM 1)\n\n## Compiler Flags\nset(CMAKE_C_FLAGS \"-Ofast -Wall -mcpu=cortex-m0plus -mtune=cortex-m0plus -fstack-usage\")\n\n## Initialize Pico SDK\npico_sdk_init()\n\n## PIO USB Library Setup\nset(PICO_PIO_USB_DIR ${CMAKE_CURRENT_LIST_DIR}/Pico-PIO-USB)\n\nadd_library(Pico-PIO-USB STATIC\n  ${PICO_PIO_USB_DIR}/src/pio_usb.c\n  ${PICO_PIO_USB_DIR}/src/pio_usb_host.c\n  ${PICO_PIO_USB_DIR}/src/usb_crc.c\n)\npico_generate_pio_header(Pico-PIO-USB ${PICO_PIO_USB_DIR}/src/usb_tx.pio)\npico_generate_pio_header(Pico-PIO-USB ${PICO_PIO_USB_DIR}/src/usb_rx.pio)\n\ntarget_link_libraries(Pico-PIO-USB PRIVATE\n  pico_stdlib\n  pico_multicore\n  hardware_pio\n  hardware_dma\n)\ntarget_include_directories(Pico-PIO-USB PRIVATE ${PICO_PIO_USB_DIR})\n\n## Source Files\nset(COMMON_SOURCES\n  ${SRC_DIR}/usb_descriptors.c\n  ${SRC_DIR}/defaults.c\n  ${SRC_DIR}/constants.c\n  ${SRC_DIR}/protocol.c\n  ${SRC_DIR}/hid_parser.c\n  ${SRC_DIR}/hid_report.c\n  ${SRC_DIR}/utils.c\n  ${SRC_DIR}/handlers.c\n  ${SRC_DIR}/setup.c\n  ${SRC_DIR}/keyboard.c\n  ${SRC_DIR}/mouse.c\n  ${SRC_DIR}/tasks.c\n  ${SRC_DIR}/led.c\n  ${SRC_DIR}/uart.c\n  ${SRC_DIR}/usb.c\n  ${SRC_DIR}/main.c\n  ${SRC_DIR}/ramdisk.c\n  ${PICO_TINYUSB_PATH}/src/portable/raspberrypi/pio_usb/dcd_pio_usb.c\n  ${PICO_TINYUSB_PATH}/src/portable/raspberrypi/pio_usb/hcd_pio_usb.c\n)\n\n## Include Directories\nset(COMMON_INCLUDES\n  ${SRC_DIR}/include\n  ${PICO_PIO_USB_DIR}/src\n)\n\n## Library Dependencies\nset(COMMON_LINK_LIBRARIES\n  pico_stdlib\n  hardware_flash\n  hardware_uart\n  hardware_gpio\n  hardware_pio\n  hardware_dma\n\n  tinyusb_device \n  tinyusb_host\n  pico_multicore\n  Pico-PIO-USB\n)\nset(binary deskhop)\n\n## Disk Image Configuration\n# This assembles disk.S, then updates the elf section in post-build\n# With the disk FAT image binary in /disk/disk.img \n\nset(DISK_ASM \"${CMAKE_CURRENT_LIST_DIR}/disk/disk.S\")\nset(DISK_BIN \"${CMAKE_CURRENT_LIST_DIR}/disk/disk.img\")\nset_property(SOURCE ${DISK_ASM} APPEND PROPERTY COMPILE_OPTIONS \"-x\" \"assembler-with-cpp\")\n\nadd_executable(${binary} ${DISK_ASM})\n\ntarget_sources(${binary} PUBLIC ${COMMON_SOURCES})\ntarget_compile_definitions(${binary} \n    PRIVATE \n    PIO_USB_USE_TINYUSB=${PIO_USE_TINYUSB}\n    PIO_USB_DP_PIN_DEFAULT=${DP_PIN_DEFAULT}\n    __disk_file_path__=\"${DISK_BIN}\"\n)\n\n## Support building a debug version\nif (DH_DEBUG)\n  add_definitions(-DDH_DEBUG)  \nendif()\n  \ntarget_include_directories(${binary} PUBLIC ${COMMON_INCLUDES})\ntarget_link_libraries(${binary} PUBLIC ${COMMON_LINK_LIBRARIES})\n\n## Configure Pico Library\npico_enable_stdio_usb(${binary} 0)\npico_enable_stdio_uart(${binary} 0)\npico_set_linker_script(${binary} ${CMAKE_SOURCE_DIR}/memory_map.ld)\n\n## Build other file formats as well\npico_add_extra_outputs(${binary})\n\n## Post-Build Commands\nadd_custom_command(\n    TARGET ${binary} POST_BUILD\n    COMMAND python3 ${CMAKE_SOURCE_DIR}/tools/crc32.py ${binary}.bin ${binary}.crc ${VERSION_MAJOR}${VERSION_MINOR}\n    COMMAND ${CMAKE_OBJCOPY} --update-section .section_metadata=${binary}.crc ${binary}.elf\n    COMMAND ${CMAKE_OBJCOPY} -O binary ${binary}.elf ${binary}.bin\n    COMMAND ${CMAKE_BINARY_DIR}/elf2uf2/elf2uf2 ${binary}.elf ${binary}.uf2\n    COMMENT \"Update CRC32 section to match the actual binary\"  \n)\n\n## Linker Options\ntarget_link_options(${binary} PRIVATE\n  -Xlinker\n  --print-memory-usage\n)\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 34.3251953125,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<https://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<https://www.gnu.org/licenses/why-not-lgpl.html>.\n"
        },
        {
          "name": "Pico-PIO-USB",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 23.345703125,
          "content": "#  DeskHop - Fast Desktop Switching\n\nDid you ever notice how, in the crazy world of tech, there's always that one quirky little project trying to solve a problem so niche that its only competitors might be a left-handed screwdriver and a self-hiding alarm clock?\n\nI use two different computers in my daily workflow and share a single keyboard/mouse pair between them. Trying several USB switching boxes found on Amazon made me realize they all suffer from similar issues - it takes a while to switch, the process is quite clumsy when trying to find the button and frankly, it just doesn't get any better with time. \n\nAll I wanted was a way to use a keyboard shortcut to quickly switch outputs, paired with the ability to do the same by magically moving the mouse pointer between monitors. This project enables you to do both, even if your computers run different operating systems!\n\n![Image](img/case_and_board_s.png)\n\n## Features\n\n- Completely **[free and open source](https://certification.oshwa.org/de000149.html)**\n- No noticeable delay when switching\n- Simply drag the mouse pointer between computers\n- No software installed\n- Affordable and obtainable components (<15€)\n- 3D printable snap-fit case\n- Full Galvanic isolation between your outputs\n- Works with Linux, macOS and Windows\n\n[User Manual](user-manual.pdf) is now available\n\n![Image](img/oshw.svg)\n------\n\n## How it works\n\nThe device acts as an intermediary between your keyboard/mouse and the computer, establishing and maintaining connections with both computers at once. Then it chooses where to forward your mouse and keystrokes to, depending on your selection. Keyboard follows the mouse and vice versa, so just dragging the mouse to the other desktop will switch both.\n\n## Mouse \n\nTo get the mouse cursor to magically jump across, the mouse hid report descriptor was changed to use absolute coordinates and then the mouse reports (that still come in relative movements) accumulate internally, keeping the accurate tally on the position. \n\nWhen you try to leave the monitor area in the direction of the other monitor, it keeps the Y coordinate and swaps the maximum X for a minimum X, then flips the outputs. This ensures that the cursor seamlessly appears at the same height on the other monitor, enhancing the perception of a smooth transition.\n\n![Image](img/deskhop-demo.gif)\n\n <p align=\"center\"> Dragging the mouse from Mac to Linux automatically switches outputs. \n </p>\n\n-----\n \nThe actual switch happens at the very moment when one arrow stops moving and the other one starts.\n\n## Keyboard\n\nActing as a USB Host and querying your keyboard periodically, it looks for a preconfigured hotkey in the hid report (usually Ctrl + Caps Lock for me). When found, it will forward all subsequent characters to the other output.\n\nTo have a visual indication which output you are using at any given moment, you can repurpose keyboard LEDs and have them provide the necessary feedback. \n\nIt also remembers the LED state for each computer, so you can pick up exactly how you left it. \n\n![Image](img/demo-typing.gif)\n\n## How to build\n\nTo avoid version mismatch and reported path issues when building, as well as to save you from having to download a large SDK, the project now bundles minimal pico sdk and tinyusb.\n\nOn a Debian/Ubuntu systems, make sure to install these:\n\n```\nsudo apt install cmake gcc-arm-none-eabi libnewlib-arm-none-eabi build-essential\n```\n\nYou should be able to build by running:\n\n```\ncmake -S . -B build\ncmake --build build\n```\n\nadditionally, to rebuild web UI check webconfig/ and execute ```./render.py```, you'll need jinja2 installed.\n\nTo rebuild the disk, check disk/ folder and run ```./create.sh```, tweak to your system if needed. You'll need **dosfstools** (to provide mkdosfs),   \n\n## Using a pre-built image\n\nAlternatively, you can use the [pre-built images](https://github.com/hrvach/deskhop/releases). Since version 0.6 there is only a single universal image. You need the .uf2 file which you simply copy to the device in one of the following ways:\n\n## Upgrading firmware\n\n**Option 1** - (firmware 0.6 and later) Put the device in \"config mode\" by simultaneously pressing **left ctrl + right shift + c + o**. Device your keyboard is plugged into will reboot and turn into a USB drive called \"DESKHOP\". All you need to do is copy the .uf2 file to it. Once image is verified, device will flash and reboot, then proceed to upgrade the other board. During this operation the led will blink. Once it's done, it will write flash and reboot, completing the operation.\n\n_Note_ - This is not an actual generic USB drive, you can't use it to copy files to it.\n\n**Option 2** - Using the ROM bootloader - hold the on-board button while connecting each Pico and copy the uf2 to the flash drive that appears. Images later than 0.6 support holding the button without having to fiddle around the power supply, but the \"hold button while plugging\" should always work, regardless of device state.\n\n## Misc features\n\n### Mouse slowdown\n\nEver tried to move that YT video slider to a specific position but your mouse moves too jumpy and suddenly you are moving your hand super-carefully like you're 5 and playing \"Operation\" all over again?\n\n**Press right CTRL + right ALT** to toggle a slow-mouse mode. The mouse pointer will slow down considerably, enabling you to get the finer precision work done and still have your mouse moving normally by quickly pressing the same keys again.\n\n### Switch Lock\n\nIf you want to lock yourself to one screen, use ```RIGHT CTRL + K```.\nThis will make sure you won't accidentally leave your current screen. To turn off, press the same key combo again.\n\n### Lock Both Screens\n\nYou can lock both computers at once by using ```RIGHT CTRL + L```. \nTo make use of this feature, first set up the OS for each output in config (since the shortcuts are different).\n\n### Gaming Mode\n\nIf you're gaming, there is a chance your game might not work properly with absolute mouse mode. To address that issue, a **gaming mode** is introduced, toggled by ```LEFT CTRL + RIGHT SHIFT + G```. When in gaming mode, you are locked to the current screen and your mouse behaves like a standard relative mouse. This should also fix various virtual machine issues, currently unsupported operating systems etc.\n\n### Screensaver\n\nSupposedly built in to prevent computer from entering standby, but truth be told - it is just fun to watch. **Off by default**, will make your mouse pointer bounce around the screen like a Pong ball. When enabled, it activates after a period of inactivity defined in user config header and automatically switches off as soon as you send any output towards that screen. \n\nPotential usage example - I have a buggy USB dock that won't resume video from standby, so not allowing it to sleep can be a handy workaround. \n\n## Hardware\n\n[The circuit](schematics/DeskHop_v1.1.pdf) is based on two Raspberry Pi Pico boards, chosen because they are cheap (4.10 € / pc), can be hand soldered and most suppliers have them in stock.\n\nThe Picos are connected using UART and separated by an Analog Devices ADuM1201 dual-channel digital isolator (~3€) or a much cheaper, faster and pin-compatible TI ISO7721DR (~1.5€) which is the preferred choice. \n\nWhile they normally don't have support for dual USB, thanks to an [amazing project](https://github.com/sekigon-gonnoc/Pico-PIO-USB) where USB is implemented using the programmable IO wizardry found in RP2040, there is support for it to act both as an USB host and device.  \n\n## PCB [updated]\n\nTo keep things as simple as possible for DIY builds, the traces were kept on one side and the number of parts kept to a minimum.\n\n![Image](img/plocica2.png)\n\nUSB D+/D- differential lines should be identical in length, but they are slightly asymmetrical on purpose to counter the length difference on the corresponding GPIO traces PICO PCB itself, so the overall lengths should match.\n\nZd (differential impedance) is aimed as 90 ohm (managed to get ~107, close enough :)).\n\nThe thickness is designed to be 1.6 mm for snap-fit to work as expected.\n\nThere are 2 versions of the PCB (no major differences for the user). Original (v1.0) is easier to solder and assemble, while v1.1 offers some upgrades like:\n - added ESD protection (TPD4E1U06DBVR)\n - added VBUS capacitor for the keyboard/mouse connectors\n - silkscreen orientation markings\n - holes for clone boards with headers pre-soldered and easier alignment\n - USB 27 ohm resistors\n \n  This version is slightly more difficult to hand solder due to the small transient voltage suppressor IC and 0805 resistors, but it's totally doable. TVS can in theory be omitted (not advised) and it will still work.\n\nUpcoming - board with bare rp2040s that doesn't need Picos, is smaller and more convenient.\n\n## Case\n\nSince I'm not very good with 3d, the case is [simple and basic](case/) but does the job. It should be easy to print, uses ~33g of filament and takes a couple of hours.\n\nHorizontal PCB movements are countered by pegs sliding through holes and vertical movements by snap-fit lugs on the sides - no screws required. The case was given a slight redesign to feature the logo and two additional snap-fit lugs, so it provides a better seal.\n\nMicro USB connectors on both boards are offset from the side of the case, so slightly larger holes should allow for cables to reach in. \n\nThe lid is of a snap-fit design, with a screwdriver slot for opening. The markings on top are recessed and can be finished with e.g. crayons to give better contrast (or simply left as-is).\n\n![Image](img/deskhop-case.gif)\n\n## Bill of materials \n\n<details closed>\n  <summary>Click here to view original PCB v1.0 BOM</summary>\n\n| Component          | Qty | Unit Price / € | Price / €|\n|--------------------|-----|----------------|----------|\n| Raspberry Pi Pico  | 2   | 4.10           | 8.20     |\n| ADuM1201BRZ        | 1   | 2.59           | 2.59     |\n| Cap 1206 SMD 100nF | 2   | 0.09           | 0.18     |\n| USB-A PCB conn.    | 2   | 0.20           | 0.40     |\n| Headers 2.54 1x03  | 2   | 0.08           | 0.16     |\n|                    |     |                |          |\n|                    |     |          Total | 11.53    |\n\nTI ISO7721DR can be used instead of the ADuM - it's pin-compatible, much cheaper and with better specs.\n\n</details>\n\n#### PCB v1.1\n\n| Component      | Part                | Qty | Unit Price / € | Price / €|\n|----------------|---------------------|-----|----------------|----------|\n|     U1, U2     | Raspberry Pi Pico   | 2   | 4.10           | 8.20     |\n|     J1, J4     | USB-A PCB conn.     | 2   | 0.20           | 0.40     |\n|       U4       | TI ISO7721DR        | 1   | 1.40           | 1.40     |\n|                | (**OR** ADuM1201BRZ)|     |                |          |\n|     C1, C2     | Cap 0805 SMD 100nF  | 2   | 0.09           | 0.18     |\n| R1, R2, R3, R4 | Res 0805 SMD 27ohm  | 4   | 0.03           | 0.12     |\n|     U3, U5     | TPD4E1U06DBVR       | 2   | 0.31           | 0.62     |\n|     C3, C4     | Cap 4.7uF SMD 0805  | 2   | 0.07           | 0.14     |\n|     J2, J3     | Headers 2.54 1x03   | 2   | 0.08           | 0.16     |\n|                |                     |     |                |          |\n|                |                     |     |          Total | 11.22    |\n\nUSB-A connector can be Molex MX-67643-0910 or a cheaper/budget one that shares the same dimensions.\n\nAdditional steps:\n\n - making the PCB ([Gerber provided](pcb/), choose 1.6 mm thickness)\n - 3d printing the case ([stl files provided](case/), ~33g filament)\n\n## Assembly guide\n\nIf you have some experience with electronics, you don't need this. However, some of you might not, and in that case this video might help guide you through the process. Please note, after soldering you should clean the flux from the PCB to prevent corrosion. \n\nThe standard process to do that is using isopropyl alcohol and an old toothbrush. But guess what? I'm not putting my old toothbrush online, so you'll just have to improvise that part :)\n\n[![PCB Assembly Guide](img/yt-video-s.jpg)](https://www.youtube.com/watch?v=LxI9NYi_oOU)\n\n[NOTE] The video assembly guide covers pcb v1.0. The revised version is very similar and the procedure is basically the same. \n\n## Usage guide\n\n### Keyboard shortcuts - (fw versions 0.68+)\n\n_Config_\n- ~~```Left Shift```~~ ```Left Ctrl + Right Shift + C + O``` - enter config mode\n- ```Right Shift + F12 + D``` - remove flash config\n- ```Right Shift + F12 + Y``` - save screen switch offset\n\n_Usage_\n- ```Right CTRL + Right ALT``` - Toggle slower mouse mode\n- ```Right CTRL + K``` - Lock/Unlock mouse desktop switching\n- ```Right CTRL + L``` - Lock both outputs at once (set output OS before, see shortcuts below)\n- ~~```Left Shift```~~ ```Left CTRL + Right Shift + G``` - Toggle gaming mode (lock to screen, act as standard mouse)\n- ```Left CTRL + Right Shift + S``` - Enable screensaver\n- ```Left CTRL + Right Shift + X``` - Disable screensaver\n- ```Left CTRL + Caps Lock``` - Switch between outputs\n\nNote: some keyboards don't send both shifts at the same time properly, that's why the shortcut was changed - to work for everyone. Apologies for the confusion.\n\n### Switch cursor height calibration\n\nThis step is not required, but it can be handy if your screens are not perfectly aligned or differ in size. The objective is to have the mouse pointer come out at exactly the same height.\n\n![Image](img/border_top_s.png)\n\nJust park your mouse on the LARGER screen at the height of the smaller/lower screen (illustrated) and press ```Right Shift + F12 + Y```. Your LED (and caps lock) should flash in confirmation.\n\nRepeat for the bottom border (if it's above the larger screen's border). This will get saved to flash and it should keep this calibration value from now on.\n\n### Multiple screens per output\n\nWindows and Mac have issues with multiple screens and absolute positioning, so workarounds are needed (still experimental). There is a better workaround under construction, but for now you have to set the operating system for each output and number of screens.\n\nYour main screens need to be in the middle, and secondary screen(s) on the edges. To configure the actual options, open the web configuration page for your device.\n\n![Image](img/deskhop-scr.png)\n\n### Web configuration mode\n\nStarting with fw 0.6, an improved configuration mode is introduced. To configure your device, follow these instructions:\n\n1. Press Left Ctrl + Right Shift + C + O - your device will reboot and enter configuration mode (on the side your keyboard is plugged into). LED will keep blinking during the configuration session.\n2. A new USB drive will appear named \"DESKHOP\" with a single file, config.htm\n3. Open that file with Chromium / Chrome. Unfortunately FF is not supported right now, since they avoid implementing WebHID.\n4. Click connect and allow deskhop device to pair.\n\n![Image](img/connect-dialog.png)\n\n5. Configure the options as you wish and click save to write to device.\n6. Click \"exit\" in the menu to leave configuration mode for added safety.\n\n![Image](img/config-page-big.png)\n\nQ: Why not simply create a nice online web page like Via instead of dealing with this weird USB drive thing? \nA: Loading javascript from a random online location that interacts with your input devices is a potential security risk. The configuration web page is local only and nothing is ever loaded externally.\n\n<details closed>\n  <summary>Linux doesn't see device? Click here.</summary>\n\nQ: Chromium on Linux doesn't work. \nA: You probably need to tweak /dev permissions or create a corresponding udev rules file and make sure your user is in the right group, like so:\n\n/etc/udev/rules.d/99-deskhop.rules\n```\nKERNEL==\"hidraw*\", SUBSYSTEM==\"hidraw\", ATTRS{idVendor}==\"1209\", ATTRS{idProduct}==\"c000\", GROUP=\"plugdev\", MODE=\"0660\" \n```\n</details><br />\n\nPlease note the config web page is not \"weird\" because of deliberate obfuscation - it's self-decompressing due to very limited storage. Entire source is 100% open and a part of this repo. You are encouraged to rebuild everything yourself.\n\n### Functional verification\n\nWhen you connect a new USB peripheral, the board will flash the led twice, and instruct the other board to do the same. This way you can test if USB and outgoing communication works for each board.\n\nDo this test by first plugging the keyboard on one side and then on the other. If everything is OK, leds will flash quickly back and forth in both cases.\n\n## Security and Safety\n\nSome features are missing on purpose, despite the fact it would make the device easier to use or simpler to configure. Here is a quick breakdown of these decisions:\n\n- There is no copy-paste or *any* information sharing between systems. This prevents information leakage.\n- No webhid device management without explicit user consent. No inbound connectivity from the output computers, with the only exception of standard keyboard LED on/off messages and hard limited to 1 byte of data.\n- No FW upgrade triggering from the outputs. Only explicit and deliberate user action through a special keyboard shortcut may do that.\n- No plugged-in keyboard/mouse custom endpoints are exposed or information forwarded towards these devices. Their potential vulnerabilities are effectively firewalled from the computer.\n- No input history is allowed to be retained.\n- No device-initiated keystrokes, for any reason. Only thing that comes out is what you type/trigger.\n- Outputs are physically separated and galvanically isolated with a minimal isolation voltage of 2kV.\n- All packets exchanged between devices are of fixed length, config options transferred are limited to a short list. Most options are read-only. Cross-device firmware upgrades can be disabled.\n- There is no bluetooth or wifi, networking, Internet access, etc.\n- No connected computer is considered trusted under any circumstances.\n- Configuration mode is automatically disabled after a period of inactivity.\n- Entirety of the code is open source, without any binary blobs and thoroughly commented to explain its purpose. I encourage you to never trust anyone and always make sure you know what you are running by doing a manual audit.\n\nThis still doesn't guarantee anything, but I believe it makes a reasonable set of ground rules to keep you safe and protected.\n\n## FAQ\n\n1. I just have two Picos, can I do without a PCB and isolator?\n\n*Sure. Having an isolator is recommended but it should work without it.*\n\n2. What happens if I have two different resolutions on my monitors?\n\n*The mouse movement is done in abstract coordinate space and your computer figures out how that corresponds with the physical screen, so it should just work.*\n\n3. Where can I buy it?\n\n*I'm not selling anything, this is just a personal, non-commercial hobby project.*\n\n[UPDATE] It seems you can order it in QTY of 1 (for either PCB, assembled PCB or a fully assembled device) from [Elecrow if you follow this link](https://www.elecrow.com/deskhop-fast-desktop-switching.html)\nAs reported by users, your **board will arrive blank** and you have to write the firmware yourself.\n\n[UPDATE2] - I never asked Elecrow for anything, but a couple of days ago they offered to sponsor the project with a small budget that will be used for future board prototyping. Since my goal is to create a better board with more than 2 outputs etc, I believe prototyping services might be beneficial to the project.\n\n4. When the active screen is changed via the mouse, does the keyboard follow (and vice versa)?\n\n*Yes, the idea was to make it behave like it was one single computer.*\n\n5. Will this work with keyboard/mouse combo dongles, like the Logitech Unifying receiver?\n\nIt should work. After a recent FW update, support for combo receivers should be much better.\n\n6. Will this work with wireless mice and keyboards that have separate wireless receivers (one for the mouse, another for the keyboard)?\n\n*It should work - tried an Anker wireless mouse with a separate receiver and that worked just fine.*\n\n7. I have issues with build or compilation\n\n*Check out the [Troubleshooting Wiki](https://github.com/hrvach/deskhop/wiki/Troubleshooting) that might have some answers.*\n\n## Software Alternatives\n\nThere are several software alternatives you can use if that works in your particular situation.\n\n1. [Barrier](https://github.com/debauchee/barrier) - Free, Open Source\n2. [Input Leap](https://github.com/input-leap/input-leap) - Free, Open Source\n3. [Synergy](https://symless.com/synergy) - Commercial\n4. [Mouse Without Borders](https://www.microsoft.com/en-us/garage/wall-of-fame/mouse-without-borders/) - Free, Windows only\n5. [Universal Control](https://support.apple.com/en-my/HT212757) - Free, Apple thing\n\n## Shortcomings\n\n- Windows 10 broke HID absolute coordinates behavior in KB5003637, so you can't use more than 1 screen on Windows (mouse will stay on the main screen). There is an experimental workaround with a better one on the way.\n- Code needs cleanup, some refactoring etc.\n- Not tested with a wide variety of devices, I don't know how it will work with your hardware. There is a reasonable chance things might not work out-of-the-box. \n- Advanced keyboards (with knobs, extra buttons or sliders) will probably face issues where this additional hardware doesn't work.\n- Super-modern mice with 300 buttons might see some buttons not work as expected.\n- NOTE: **Both computers need to be connected and provide power to the USB for this to work** (as each board gets powered by the computer it plugs into). Many desktops and laptops will provide power even when shut down nowadays. If you need to run with one board fully disconnected, you should be able to use a USB hub to plug both keyboard and mouse to a single port.\n- MacOS has issues with more than one screens, latest firmware offers an experimental workaround that fixes it.\n\n## Progress\n\nSo, what's the deal with all the enthusiasm? I can't believe it - please allow me to thank you all! I've never expected this kind of interest in a simple personal project, so the initial features are pretty basic (just like my cooking skills) and mostly cover my own usecase. Stay tuned for firmware updates that should bring wider device compatibility, more features and less bugs. As this is a hobby project, I appreciate your understanding for being time-constrained and promise to do the best I can.\n\nPlanned features:\n- Better workarounds for multiscreen windows and macos\n- Transparent / Gaming mode\n- Support for more than 2 outputs\n- Improvements on the configuration UI\n- ... and more!\n\nWorking on a *lite* version which provides basic functionality with just a single Pico W board, lowering the cost even further and enabling you to try it out even with no added hardware or PCB.\n\nMouse polling should now work at 1000 Hz (the dips in the graph is my arm hurting from all the movement :-)):\n\n![Mouse polling rate](img/polling_rate.png)\n\n## Sponsor / donate\n\nI'm NOT doing this for profit or any other reason except to try and help people by creating a better working environment for everyone.\nIf you want to support the project further, please consider making a small donation towards a charity like **Doctors Without Borders**.\n\n[![](https://www.paypalobjects.com/en_US/i/btn/btn_donateCC_LG.gif)](https://donate.doctorswithoutborders.org/secure/donate)\n\nPlease allow me to thank everyone who helped or considering it!\n\n## Disclaimer\n\nI kindly request that anyone attempting to build this project understands and acknowledges that I am not liable for any injuries, damages, or other consequences. Your safety is important, and I encourage you to approach this project carefully, taking necessary precautions and assuming personal responsibility for your well-being throughout the process. Please don't get electrocuted, burned, stressed or angry. Have fun and enjoy! \n\nHappy switchin'!\n"
        },
        {
          "name": "case",
          "type": "tree",
          "content": null
        },
        {
          "name": "disk",
          "type": "tree",
          "content": null
        },
        {
          "name": "img",
          "type": "tree",
          "content": null
        },
        {
          "name": "memory_map.ld",
          "type": "blob",
          "size": 8.513671875,
          "content": "/* Based on GCC ARM embedded samples.\n   Defines the following symbols for use by code:\n    __exidx_start\n    __exidx_end\n    __etext\n    __data_start__\n    __preinit_array_start\n    __preinit_array_end\n    __init_array_start\n    __init_array_end\n    __fini_array_start\n    __fini_array_end\n    __data_end__\n    __bss_start__\n    __bss_end__\n    __end__\n    end\n    __HeapLimit\n    __StackLimit\n    __StackTop\n    __stack (== StackTop)\n*/\n\n/* Total image is 256 kB, consisting of:\n    Executable = 188 kB\n    FAT disk image = 64 kB\n    Firmware metadata = 4 kB (contains checksum)\n*/\n\n__FLASH_LEN = 188k;\n__DISK_IMAGE_LEN = 64k;\n__METADATA_LEN = 4k;\n__TOTAL_IMAGE_LENGTH = 256k;\n\n__CONFIG_STORAGE_LEN = 4k;\n\nMEMORY\n{\n    FLASH(rx) : ORIGIN = 0x10000000, LENGTH = __FLASH_LEN\n    DISK_IMAGE(rw) : ORIGIN = 0x10000000 + __FLASH_LEN, LENGTH = __DISK_IMAGE_LEN\n    FW_METADATA(rw) : ORIGIN = 0x10000000 + (__TOTAL_IMAGE_LENGTH - __METADATA_LEN), LENGTH = __METADATA_LEN\n    FW_STAGING(rw) : ORIGIN = 0x10000000 + __TOTAL_IMAGE_LENGTH, LENGTH = __TOTAL_IMAGE_LENGTH\n\n    FLASH_CONFIG(rw) : ORIGIN = 0x10000000 + (2048k - __CONFIG_STORAGE_LEN), LENGTH = __CONFIG_STORAGE_LEN\n    RAM(rwx) : ORIGIN =  0x20000000, LENGTH = 256k\n    SCRATCH_X(rwx) : ORIGIN = 0x20040000, LENGTH = 4k\n    SCRATCH_Y(rwx) : ORIGIN = 0x20041000, LENGTH = 4k\n}\nPROVIDE(_staging_metadata = ORIGIN(FW_STAGING) + (__TOTAL_IMAGE_LENGTH - __METADATA_LEN));\nPROVIDE(_firmware_metadata = ORIGIN(FW_METADATA));\n\nENTRY(_entry_point)\n\nSECTIONS\n{\n    /* Second stage bootloader is prepended to the image. It must be 256 bytes big\n       and checksummed. It is usually built by the boot_stage2 target\n       in the Raspberry Pi Pico SDK\n    */\n\n    .flash_begin : {\n        ADDR_FW_RUNNING = .;\n        __flash_binary_start = .;\n    } > FLASH\n\n    .boot2 : {\n        __boot2_start__ = .;\n        KEEP (*(.boot2))\n        __boot2_end__ = .;\n    } > FLASH\n\n    ASSERT(__boot2_end__ - __boot2_start__ == 256,\n        \"ERROR: Pico second stage bootloader must be 256 bytes in size\")\n\n    /* The second stage will always enter the image at the start of .text.\n       The debugger will use the ELF entry point, which is the _entry_point\n       symbol if present, otherwise defaults to start of .text.\n       This can be used to transfer control back to the bootrom on debugger\n       launches only, to perform proper flash setup.\n    */\n\n    .flashtext : {\n        __logical_binary_start = .;\n        KEEP (*(.vectors))\n        KEEP (*(.binary_info_header))\n        __binary_info_header_end = .;\n        KEEP (*(.reset))\n    }\n\n    .rodata : {\n        /* segments not marked as .flashdata are instead pulled into .data (in RAM) to avoid accidental flash accesses */\n        *(SORT_BY_ALIGNMENT(SORT_BY_NAME(.flashdata*)))\n        . = ALIGN(4);\n    } > FLASH\n\n    .ARM.extab :\n    {\n        *(.ARM.extab* .gnu.linkonce.armextab.*)\n    } > FLASH\n\n    __exidx_start = .;\n    .ARM.exidx :\n    {\n        *(.ARM.exidx* .gnu.linkonce.armexidx.*)\n    } > FLASH\n    __exidx_end = .;\n\n    /* Machine inspectable binary information */\n    . = ALIGN(4);\n    __binary_info_start = .;\n    .binary_info :\n    {\n        KEEP(*(.binary_info.keep.*))\n        *(.binary_info.*)\n    } > FLASH\n    __binary_info_end = .;\n    . = ALIGN(4);\n\n    /* Vector table goes first in RAM, to avoid large alignment hole */\n   .ram_vector_table (NOLOAD): {\n        *(.ram_vector_table)\n    } > RAM\n\n    .text : {\n        __ram_text_start__ = .;\n        *(.init)\n        *(.text*)\n        *(.fini)\n        /* Pull all c'tors into .text */\n        *crtbegin.o(.ctors)\n        *crtbegin?.o(.ctors)\n        *(EXCLUDE_FILE(*crtend?.o *crtend.o) .ctors)\n        *(SORT(.ctors.*))\n        *(.ctors)\n        /* Followed by destructors */\n        *crtbegin.o(.dtors)\n        *crtbegin?.o(.dtors)\n        *(EXCLUDE_FILE(*crtend?.o *crtend.o) .dtors)\n        *(SORT(.dtors.*))\n        *(.dtors)\n\n        *(.eh_frame*)\n        . = ALIGN(4);\n        __ram_text_end__ = .;\n    } > RAM AT> FLASH\n    __ram_text_source__ = LOADADDR(.text);\n    . = ALIGN(4);\n\n    .data : {\n        __data_start__ = .;\n        *(vtable)\n\n        *(.time_critical*)\n\n        . = ALIGN(4);\n        *(.rodata*)\n        . = ALIGN(4);\n\n        *(.data*)\n\n        . = ALIGN(4);\n        *(.after_data.*)\n        . = ALIGN(4);\n        /* preinit data */\n        PROVIDE_HIDDEN (__mutex_array_start = .);\n        KEEP(*(SORT(.mutex_array.*)))\n        KEEP(*(.mutex_array))\n        PROVIDE_HIDDEN (__mutex_array_end = .);\n\n        . = ALIGN(4);\n        /* preinit data */\n        PROVIDE_HIDDEN (__preinit_array_start = .);\n        KEEP(*(SORT(.preinit_array.*)))\n        KEEP(*(.preinit_array))\n        PROVIDE_HIDDEN (__preinit_array_end = .);\n\n        . = ALIGN(4);\n        /* init data */\n        PROVIDE_HIDDEN (__init_array_start = .);\n        KEEP(*(SORT(.init_array.*)))\n        KEEP(*(.init_array))\n        PROVIDE_HIDDEN (__init_array_end = .);\n\n        . = ALIGN(4);\n        /* finit data */\n        PROVIDE_HIDDEN (__fini_array_start = .);\n        *(SORT(.fini_array.*))\n        *(.fini_array)\n        PROVIDE_HIDDEN (__fini_array_end = .);\n\n        *(.jcr)\n        . = ALIGN(4);\n        /* All data end */\n        __data_end__ = .;\n    } > RAM AT> FLASH\n    /* __etext is (for backwards compatibility) the name of the .data init source pointer (...) */\n    __etext = LOADADDR(.data);\n\n    .uninitialized_data (NOLOAD): {\n        . = ALIGN(4);\n        __udata_end__ = .;\n        *(.uninitialized_data*)\n    } > RAM\n\n    /* Start and end symbols must be word-aligned */\n    .scratch_x : {\n        __scratch_x_start__ = .;\n        *(.scratch_x.*)\n        . = ALIGN(4);\n        __scratch_x_end__ = .;\n    } > SCRATCH_X AT > FLASH\n    __scratch_x_source__ = LOADADDR(.scratch_x);\n\n    .scratch_y : {\n        __scratch_y_start__ = .;\n        *(.scratch_y.*)\n        . = ALIGN(4);\n        __scratch_y_end__ = .;\n    } > SCRATCH_Y AT > FLASH\n    __scratch_y_source__ = LOADADDR(.scratch_y);\n\n    .bss  : {\n        . = ALIGN(4);\n        __bss_start__ = .;\n        *(SORT_BY_ALIGNMENT(SORT_BY_NAME(.bss*)))\n        *(COMMON)\n        . = ALIGN(4);\n        __bss_end__ = .;\n    } > RAM\n\n    .heap (NOLOAD):\n    {\n        __end__ = .;\n        end = __end__;\n        KEEP(*(.heap*))\n        __HeapLimit = .;\n    } > RAM\n\n    /* Store web configuration utility HTML */\n    .section_disk : {\n        ADDR_DISK_IMAGE = .;  \n        KEEP(*(.section_disk))\n    } > DISK_IMAGE    \n\n    /* Firmware metadata section (4k in size, contains version, checksum etc.) */   \n    .section_metadata : {\n        ADDR_FW_METADATA = .;  \n        KEEP(*(.section_metadata));\n    } > FW_METADATA\n\n    /* Firmware staging section (256k in size, near the end of flash) */\n    .section_staging : {\n        ADDR_FW_STAGING = .;  \n        KEEP(*(.section_staging))\n    } > FW_STAGING\n\n    /* Just padding so we can have a nice, consistently-sized .bin file */\n    .fill : {\n        FILL(0x00);\n        . = ORIGIN(FW_METADATA) + LENGTH(FW_METADATA) - 1;\n        BYTE(0x00)\n        ___ROM_AT = .;\n    } > FW_METADATA\n\n    /* Configuration flash section (4k in size, end of flash) */   \n    .section_config (NOLOAD) : {\n        ADDR_CONFIG = .;\n    } > FLASH_CONFIG\n\n    /* .stack*_dummy section doesn't contains any symbols. It is only\n     * used for linker to calculate size of stack sections, and assign\n     * values to stack symbols later\n     *\n     * stack1 section may be empty/missing if platform_launch_core1 is not used */\n\n    /* by default we put core 0 stack at the end of scratch Y, so that if core 1\n     * stack is not used then all of SCRATCH_X is free.\n     */\n    .stack1_dummy (NOLOAD):\n    {\n        *(.stack1*)\n    } > SCRATCH_X\n    .stack_dummy (NOLOAD):\n    {\n        KEEP(*(.stack*))\n    } > SCRATCH_Y\n\n    .flash_end : {\n        __flash_binary_end = .;\n    } > FLASH\n\n    .pad : {\n        /* This section will be filled with zeroes */\n        FILL(0x00)\n        . = ADDR_DISK_IMAGE - __flash_binary_end - 1;\n        BYTE(0x00)\n        KEEP(*(.pad))\n    } > FLASH    \n\n    /* stack limit is poorly named, but historically is maximum heap ptr */\n    __StackLimit = ORIGIN(RAM) + LENGTH(RAM);\n    __StackOneTop = ORIGIN(SCRATCH_X) + LENGTH(SCRATCH_X);\n    __StackTop = ORIGIN(SCRATCH_Y) + LENGTH(SCRATCH_Y);\n    __StackOneBottom = __StackOneTop - SIZEOF(.stack1_dummy);\n    __StackBottom = __StackTop - SIZEOF(.stack_dummy);\n    PROVIDE(__stack = __StackTop);\n\n    /* Check if data + heap + stack exceeds RAM limit */\n    ASSERT(__StackLimit >= __HeapLimit, \"region RAM overflowed\")\n\n    ASSERT( __binary_info_header_end - __logical_binary_start <= 256, \"Binary info must be in first 256 bytes of the binary\")\n    /* todo assert on extra code */\n}\n\n"
        },
        {
          "name": "pcb",
          "type": "tree",
          "content": null
        },
        {
          "name": "pico-sdk",
          "type": "tree",
          "content": null
        },
        {
          "name": "pico_sdk_import.cmake",
          "type": "blob",
          "size": 2.6982421875,
          "content": "# This is a copy of <PICO_SDK_PATH>/external/pico_sdk_import.cmake\n\n# This can be dropped into an external project to help locate this SDK\n# It should be include()ed prior to project()\n\nif (DEFINED ENV{PICO_SDK_PATH} AND (NOT PICO_SDK_PATH))\n    set(PICO_SDK_PATH $ENV{PICO_SDK_PATH})\n    message(\"Using PICO_SDK_PATH from environment ('${PICO_SDK_PATH}')\")\nendif ()\n\nif (DEFINED ENV{PICO_SDK_FETCH_FROM_GIT} AND (NOT PICO_SDK_FETCH_FROM_GIT))\n    set(PICO_SDK_FETCH_FROM_GIT $ENV{PICO_SDK_FETCH_FROM_GIT})\n    message(\"Using PICO_SDK_FETCH_FROM_GIT from environment ('${PICO_SDK_FETCH_FROM_GIT}')\")\nendif ()\n\nif (DEFINED ENV{PICO_SDK_FETCH_FROM_GIT_PATH} AND (NOT PICO_SDK_FETCH_FROM_GIT_PATH))\n    set(PICO_SDK_FETCH_FROM_GIT_PATH $ENV{PICO_SDK_FETCH_FROM_GIT_PATH})\n    message(\"Using PICO_SDK_FETCH_FROM_GIT_PATH from environment ('${PICO_SDK_FETCH_FROM_GIT_PATH}')\")\nendif ()\n\nset(PICO_SDK_PATH \"${PICO_SDK_PATH}\" CACHE PATH \"Path to the Raspberry Pi Pico SDK\")\nset(PICO_SDK_FETCH_FROM_GIT \"${PICO_SDK_FETCH_FROM_GIT}\" CACHE BOOL \"Set to ON to fetch copy of SDK from git if not otherwise locatable\")\nset(PICO_SDK_FETCH_FROM_GIT_PATH \"${PICO_SDK_FETCH_FROM_GIT_PATH}\" CACHE FILEPATH \"location to download SDK\")\n\nif (NOT PICO_SDK_PATH)\n    if (PICO_SDK_FETCH_FROM_GIT)\n        include(FetchContent)\n        set(FETCHCONTENT_BASE_DIR_SAVE ${FETCHCONTENT_BASE_DIR})\n        if (PICO_SDK_FETCH_FROM_GIT_PATH)\n            get_filename_component(FETCHCONTENT_BASE_DIR \"${PICO_SDK_FETCH_FROM_GIT_PATH}\" REALPATH BASE_DIR \"${CMAKE_SOURCE_DIR}\")\n        endif ()\n        FetchContent_Declare(\n                pico_sdk\n                GIT_REPOSITORY https://github.com/raspberrypi/pico-sdk\n                GIT_TAG master\n        )\n        if (NOT pico_sdk)\n            message(\"Downloading Raspberry Pi Pico SDK\")\n            FetchContent_Populate(pico_sdk)\n            set(PICO_SDK_PATH ${pico_sdk_SOURCE_DIR})\n        endif ()\n        set(FETCHCONTENT_BASE_DIR ${FETCHCONTENT_BASE_DIR_SAVE})\n    else ()\n        message(FATAL_ERROR\n                \"SDK location was not specified. Please set PICO_SDK_PATH or set PICO_SDK_FETCH_FROM_GIT to on to fetch from git.\"\n                )\n    endif ()\nendif ()\n\nget_filename_component(PICO_SDK_PATH \"${PICO_SDK_PATH}\" REALPATH BASE_DIR \"${CMAKE_BINARY_DIR}\")\nif (NOT EXISTS ${PICO_SDK_PATH})\n    message(FATAL_ERROR \"Directory '${PICO_SDK_PATH}' not found\")\nendif ()\n\nset(PICO_SDK_INIT_CMAKE_FILE ${PICO_SDK_PATH}/pico_sdk_init.cmake)\nif (NOT EXISTS ${PICO_SDK_INIT_CMAKE_FILE})\n    message(FATAL_ERROR \"Directory '${PICO_SDK_PATH}' does not appear to contain the Raspberry Pi Pico SDK\")\nendif ()\n\nset(PICO_SDK_PATH ${PICO_SDK_PATH} CACHE PATH \"Path to the Raspberry Pi Pico SDK\" FORCE)\n\ninclude(${PICO_SDK_INIT_CMAKE_FILE})\n"
        },
        {
          "name": "schematics",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "user-manual.pdf",
          "type": "blob",
          "size": 2521.1533203125,
          "content": null
        },
        {
          "name": "webconfig",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}