{
  "metadata": {
    "timestamp": 1736710295298,
    "page": 77,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "veracrypt/VeraCrypt",
      "stars": 7113,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 1.2080078125,
          "content": "# Set the default behavior, in case people don't have core.autocrlf set.\n*\ttext=auto\n\n# Explicitly declare text files that could be normalized and converted\n# to native line endings on checkout. However, as per the policy they're\n# supposed to have LF endings on all platforms.\n*.[ch]\ttext diff=cpp eol=lf\n*.[ch]pp\ttext diff=cpp eol=lf\n*.asm\ttext eol=lf\nMakefile\ttext eol=lf\n*.make\ttext eol=lf\n*.mk\ttext eol=lf\n*.inc\ttext eol=lf\n*.md\ttext eol=lf\n*.xml\ttext eol=lf\n*.xpm\ttext -diff -merge eol=lf\n*.pem\ttext -diff -merge eol=lf\n*.cer\ttext -diff -merge eol=lf\n*.manifest\ttext eol=lf\n*.sh\ttext eol=lf\n*.txt\ttext eol=lf\n*.html\ttext diff=html eol=lf\n*.idl\ttext eol=lf\n*.fbp\ttext eol=lf\n*.rgs\ttext eol=lf\n*.pkgproj\ttext eol=lf\n*.S\ttext eol=lf\nSources\ttext eol=lf\n\n# Declare files that will always have LF line endings on checkout.\n*.desktop\ttext eol=lf\n\n# Declare files that will always have CRLF line endings on checkout.\n*.sln\ttext eol=crlf\n*.vcproj\ttext eol=crlf\n*.rc\ttext eol=crlf\n*.bat\ttext eol=crlf\n*.cmd\ttext eol=crlf\n\n# Denote all files that are truly binary and should not be modified.\n*.png\tbinary\n*.jpg\tbinary\n*.pdf\tbinary\n*.bmp\tbinary\n*.ico\tbinary\n*.od[fgpst]\tbinary\n*.hc\tbinary\n*.icns\tbinary\n*.rtf\tbinary\n*.bz2\tbinary\n*.pfx\tbinary\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.9501953125,
          "content": "# For those using Visual Studio Code for development\n.vscode/\n\n# CLion\n.idea/\n\n# VC Linux build artifacts\n*.o\n*.o0\n*.d\n*.a\n*.bmp.h\n*.xml.h\n*.txt.h\n*.h.gch\nsrc/Main/veracrypt\n*.osse41\n*.ossse3\n*.oshani\n\n# VC macOS build artifacts\nsrc/Main/VeraCrypt\nsrc/Main/VeraCrypt.app\nsrc/Main/*.dmg\nsrc/Setup/MacOSX/*.pkg\n*.oo\n*.o.32\n*.o.64\n.DS_Store\n\n# wxWidgets Linux build artifacts\nsrc/wxrelease\nsrc/wxdebug\n\nsrc/.vs\n\nsrc/Boot/Windows/obj\nsrc/Boot/Windows/Release\nsrc/Boot/Windows/Release_AES\nsrc/Boot/Windows/Release_AES_SHA2\nsrc/Boot/Windows/Release_Camellia\nsrc/Boot/Windows/Release_Camellia_SHA2\nsrc/Boot/Windows/Release_Serpent\nsrc/Boot/Windows/Release_Serpent_SHA2\nsrc/Boot/Windows/Release_SHA2\nsrc/Boot/Windows/Release_Twofish\nsrc/Boot/Windows/Release_Twofish_SHA2\nsrc/Boot/Windows/Rescue\nsrc/Boot/Windows/Rescue_AES\nsrc/Boot/Windows/Rescue_AES_SHA2\nsrc/Boot/Windows/Rescue_Camellia\nsrc/Boot/Windows/Rescue_Camellia_SHA2\nsrc/Boot/Windows/Rescue_Serpent\nsrc/Boot/Windows/Rescue_Serpent_SHA2\nsrc/Boot/Windows/Rescue_SHA2\nsrc/Boot/Windows/Rescue_Twofish\nsrc/Boot/Windows/Rescue_Twofish_SHA2\n\nsrc/Common/Debug\nsrc/Common/obj_driver_debug\nsrc/Common/obj_driver_release\nsrc/Common/Release\nsrc/Common/x64\nsrc/Common/ARM64\nsrc/Common/*.log\n\nsrc/Crypto/Debug\nsrc/Crypto/obj_driver_debug\nsrc/Crypto/obj_driver_release\nsrc/Crypto/Release\nsrc/Crypto/x64\nsrc/Crypto/ARM64\n\nsrc/Debug\n\nsrc/Driver/Debug\nsrc/Driver/obj\nsrc/Driver/obj_driver_debug\nsrc/Driver/obj_driver_release\nsrc/Driver/Release\nsrc/Driver/ARM64\n\nsrc/ExpandVolume/Debug\nsrc/ExpandVolume/Release\nsrc/ExpandVolume/x64\nsrc/ExpandVolume/ARM64\nsrc/ExpandVolume/*.tlb\n\nsrc/Format/Debug\nsrc/Format/Release\nsrc/Format/x64\nsrc/Format/ARM64\nsrc/Format/*.tlb\nsrc/Format/FormatCom_h.h\nsrc/Format/FormatCom_i.c\n\nsrc/Mount/Debug\nsrc/Mount/Release\nsrc/Mount/x64\nsrc/Mount/ARM64\nsrc/Mount/*.tlb\nsrc/Mount/MainCom_h.h\nsrc/Mount/MainCom_i.c\n\nsrc/Setup/Debug\nsrc/Setup/PortableDebug\nsrc/Setup/Release\nsrc/Setup/PortableRelease\n\nsrc/SetupDLL/Debug\nsrc/SetupDLL/Release"
        },
        {
          "name": "License.txt",
          "type": "blob",
          "size": 39.466796875,
          "content": "VeraCrypt License\nSoftware distributed under this license is distributed on an \"AS\nIS\" BASIS WITHOUT WARRANTIES OF ANY KIND. THE AUTHORS AND\nDISTRIBUTORS OF THE SOFTWARE DISCLAIM ANY LIABILITY. ANYONE WHO\nUSES, COPIES, MODIFIES, OR (RE)DISTRIBUTES ANY PART OF THE\nSOFTWARE IS, BY SUCH ACTION(S), ACCEPTING AND AGREEING TO BE\nBOUND BY ALL TERMS AND CONDITIONS OF THIS LICENSE. IF YOU DO NOT\nACCEPT THEM, DO NOT USE, COPY, MODIFY, NOR (RE)DISTRIBUTE THE\nSOFTWARE, NOR ANY PART(S) THEREOF.\n\nVeraCrypt is multi-licensed under Apache License 2.0 and\nthe TrueCrypt License version 3.0, a verbatim copy of both\nlicenses can be found below.\n\nThis license does not grant you rights to use any\ncontributors' name, logo, or trademarks, including IDRIX,\nVeraCrypt and all derivative names.\nFor example, the following names are not allowed: VeraCrypt,\nVeraCrypt+, VeraCrypt Professional, iVeraCrypt, etc. Nor any\nother names confusingly similar to the name VeraCrypt (e.g.,\nVera-Crypt, Vera Crypt, VerKrypt, etc.)\n____________________________________________________________\n\n\t\t\t\t\t\t\tApache License\n\t\t\t\t\t   Version 2.0, January 2004\n\t\t\t\t\thttps://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n  \"License\" shall mean the terms and conditions for use, reproduction,\n  and distribution as defined by Sections 1 through 9 of this document.\n\n  \"Licensor\" shall mean the copyright owner or entity authorized by\n  the copyright owner that is granting the License.\n\n  \"Legal Entity\" shall mean the union of the acting entity and all\n  other entities that control, are controlled by, or are under common\n  control with that entity. For the purposes of this definition,\n  \"control\" means (i) the power, direct or indirect, to cause the\n  direction or management of such entity, whether by contract or\n  otherwise, or (ii) ownership of fifty percent (50%) or more of the\n  outstanding shares, or (iii) beneficial ownership of such entity.\n\n  \"You\" (or \"Your\") shall mean an individual or Legal Entity\n  exercising permissions granted by this License.\n\n  \"Source\" form shall mean the preferred form for making modifications,\n  including but not limited to software source code, documentation\n  source, and configuration files.\n\n  \"Object\" form shall mean any form resulting from mechanical\n  transformation or translation of a Source form, including but\n  not limited to compiled object code, generated documentation,\n  and conversions to other media types.\n\n  \"Work\" shall mean the work of authorship, whether in Source or\n  Object form, made available under the License, as indicated by a\n  copyright notice that is included in or attached to the work\n  (an example is provided in the Appendix below).\n\n  \"Derivative Works\" shall mean any work, whether in Source or Object\n  form, that is based on (or derived from) the Work and for which the\n  editorial revisions, annotations, elaborations, or other modifications\n  represent, as a whole, an original work of authorship. For the purposes\n  of this License, Derivative Works shall not include works that remain\n  separable from, or merely link (or bind by name) to the interfaces of,\n  the Work and Derivative Works thereof.\n\n  \"Contribution\" shall mean any work of authorship, including\n  the original version of the Work and any modifications or additions\n  to that Work or Derivative Works thereof, that is intentionally\n  submitted to Licensor for inclusion in the Work by the copyright owner\n  or by an individual or Legal Entity authorized to submit on behalf of\n  the copyright owner. For the purposes of this definition, \"submitted\"\n  means any form of electronic, verbal, or written communication sent\n  to the Licensor or its representatives, including but not limited to\n  communication on electronic mailing lists, source code control systems,\n  and issue tracking systems that are managed by, or on behalf of, the\n  Licensor for the purpose of discussing and improving the Work, but\n  excluding communication that is conspicuously marked or otherwise\n  designated in writing by the copyright owner as \"Not a Contribution.\"\n\n  \"Contributor\" shall mean Licensor and any individual or Legal Entity\n  on behalf of whom a Contribution has been received by Licensor and\n  subsequently incorporated within the Work.\n\n2. Grant of Copyright License. Subject to the terms and conditions of\n  this License, each Contributor hereby grants to You a perpetual,\n  worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n  copyright license to reproduce, prepare Derivative Works of,\n  publicly display, publicly perform, sublicense, and distribute the\n  Work and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License. Subject to the terms and conditions of\n  this License, each Contributor hereby grants to You a perpetual,\n  worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n  (except as stated in this section) patent license to make, have made,\n  use, offer to sell, sell, import, and otherwise transfer the Work,\n  where such license applies only to those patent claims licensable\n  by such Contributor that are necessarily infringed by their\n  Contribution(s) alone or by combination of their Contribution(s)\n  with the Work to which such Contribution(s) was submitted. If You\n  institute patent litigation against any entity (including a\n  cross-claim or counterclaim in a lawsuit) alleging that the Work\n  or a Contribution incorporated within the Work constitutes direct\n  or contributory patent infringement, then any patent licenses\n  granted to You under this License for that Work shall terminate\n  as of the date such litigation is filed.\n\n4. Redistribution. You may reproduce and distribute copies of the\n  Work or Derivative Works thereof in any medium, with or without\n  modifications, and in Source or Object form, provided that You\n  meet the following conditions:\n\n  (a) You must give any other recipients of the Work or\n\t  Derivative Works a copy of this License; and\n\n  (b) You must cause any modified files to carry prominent notices\n\t  stating that You changed the files; and\n\n  (c) You must retain, in the Source form of any Derivative Works\n\t  that You distribute, all copyright, patent, trademark, and\n\t  attribution notices from the Source form of the Work,\n\t  excluding those notices that do not pertain to any part of\n\t  the Derivative Works; and\n\n  (d) If the Work includes a \"NOTICE\" text file as part of its\n\t  distribution, then any Derivative Works that You distribute must\n\t  include a readable copy of the attribution notices contained\n\t  within such NOTICE file, excluding those notices that do not\n\t  pertain to any part of the Derivative Works, in at least one\n\t  of the following places: within a NOTICE text file distributed\n\t  as part of the Derivative Works; within the Source form or\n\t  documentation, if provided along with the Derivative Works; or,\n\t  within a display generated by the Derivative Works, if and\n\t  wherever such third-party notices normally appear. The contents\n\t  of the NOTICE file are for informational purposes only and\n\t  do not modify the License. You may add Your own attribution\n\t  notices within Derivative Works that You distribute, alongside\n\t  or as an addendum to the NOTICE text from the Work, provided\n\t  that such additional attribution notices cannot be construed\n\t  as modifying the License.\n\n  You may add Your own copyright statement to Your modifications and\n  may provide additional or different license terms and conditions\n  for use, reproduction, or distribution of Your modifications, or\n  for any such Derivative Works as a whole, provided Your use,\n  reproduction, and distribution of the Work otherwise complies with\n  the conditions stated in this License.\n\n5. Submission of Contributions. Unless You explicitly state otherwise,\n  any Contribution intentionally submitted for inclusion in the Work\n  by You to the Licensor shall be under the terms and conditions of\n  this License, without any additional terms or conditions.\n  Notwithstanding the above, nothing herein shall supersede or modify\n  the terms of any separate license agreement you may have executed\n  with Licensor regarding such Contributions.\n\n6. Trademarks. This License does not grant permission to use the trade\n  names, trademarks, service marks, or product names of the Licensor,\n  except as required for reasonable and customary use in describing the\n  origin of the Work and reproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty. Unless required by applicable law or\n  agreed to in writing, Licensor provides the Work (and each\n  Contributor provides its Contributions) on an \"AS IS\" BASIS,\n  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n  implied, including, without limitation, any warranties or conditions\n  of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n  PARTICULAR PURPOSE. You are solely responsible for determining the\n  appropriateness of using or redistributing the Work and assume any\n  risks associated with Your exercise of permissions under this License.\n\n8. Limitation of Liability. In no event and under no legal theory,\n  whether in tort (including negligence), contract, or otherwise,\n  unless required by applicable law (such as deliberate and grossly\n  negligent acts) or agreed to in writing, shall any Contributor be\n  liable to You for damages, including any direct, indirect, special,\n  incidental, or consequential damages of any character arising as a\n  result of this License or out of the use or inability to use the\n  Work (including but not limited to damages for loss of goodwill,\n  work stoppage, computer failure or malfunction, or any and all\n  other commercial damages or losses), even if such Contributor\n  has been advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability. While redistributing\n  the Work or Derivative Works thereof, You may choose to offer,\n  and charge a fee for, acceptance of support, warranty, indemnity,\n  or other liability obligations and/or rights consistent with this\n  License. However, in accepting such obligations, You may act only\n  on Your own behalf and on Your sole responsibility, not on behalf\n  of any other Contributor, and only if You agree to indemnify,\n  defend, and hold each Contributor harmless for any liability\n  incurred by, or claims asserted against, such Contributor by reason\n  of your accepting any such warranty or additional liability.\n____________________________________________________________\n\nTrueCrypt License Version 3.0\n\nSoftware distributed under this license is distributed on an \"AS\nIS\" BASIS WITHOUT WARRANTIES OF ANY KIND. THE AUTHORS AND\nDISTRIBUTORS OF THE SOFTWARE DISCLAIM ANY LIABILITY. ANYONE WHO\nUSES, COPIES, MODIFIES, OR (RE)DISTRIBUTES ANY PART OF THE\nSOFTWARE IS, BY SUCH ACTION(S), ACCEPTING AND AGREEING TO BE\nBOUND BY ALL TERMS AND CONDITIONS OF THIS LICENSE. IF YOU DO NOT\nACCEPT THEM, DO NOT USE, COPY, MODIFY, NOR (RE)DISTRIBUTE THE\nSOFTWARE, NOR ANY PART(S) THEREOF.\n\n\nI. Definitions\n\n1. \"This Product\" means the work (including, but not limited to,\nsource code, graphics, texts, and accompanying files) made\navailable under and governed by this version of this license\n(\"License\"), as may be indicated by, but is not limited to,\ncopyright notice(s) attached to or included in the work.\n\n2. \"You\" means (and \"Your\" refers to) an individual or a legal\nentity (e.g., a non-profit organization, commercial\norganization, government agency, etc.) exercising permissions\ngranted by this License.\n\n3. \"Modification\" means (and \"modify\" refers to) any alteration\nof This Product, including, but not limited to, addition to or\ndeletion from the substance or structure of This Product,\ntranslation into another language, repackaging, alteration or\nremoval of any file included with This Product, and addition of\nany new files to This Product.\n\n4. \"Your Product\" means This Product modified by You, or any\nwork You derive from (or base on) any part of This Product. In\naddition, \"Your Product\" means any work in which You include any\n(modified or unmodified) portion of This Product. However, if\nthe work in which you include it is an aggregate software\ndistribution (such as an operating system distribution or a\ncover CD-ROM of a magazine) containing multiple separate\nproducts, then the term \"Your Product\" includes only those\nproducts (in the aggregate software distribution) that use,\ninclude, or depend on a modified or unmodified version of This\nProduct (and the term \"Your Product\" does not include the whole\naggregate software distribution). For the purposes of this\nLicense, a product suite consisting of two or more products is\nconsidered a single product (operating system distributions and\ncover media of magazines are not considered product suites).\n\n5. \"Distribution\" means (and \"distribute\" refers to), regardless\nof means or methods, conveyance, transfer, providing, or making\navailable of This/Your Product or portions thereof to third\nparties (including, but not limited to, making This/Your\nProduct, or portions thereof, available for download to third\nparties, whether or not any third party has downloaded the\nproduct, or any portion thereof, made available for download).\n\n\n\nII. Use, Copying, and Distribution of This Product\n\n1. Provided that You comply with all applicable terms and\nconditions of this License, You may make copies of This Product\n(unmodified) and distribute copies of This Product (unmodified)\nthat are not included in another product forming Your Product\n(except as permitted under Chapter III). Note: For terms and\nconditions for copying and distribution of modified versions of\nThis Product, see Chapter III.\n\n2. Provided that You comply with all applicable terms and\nconditions of this License, You may use This Product freely (see\nalso Chapter III) on any number of computers/systems for non-\ncommercial and/or commercial purposes.\n\n\n\nIII. Modification, Derivation, and Inclusion in Other Products\n\n1. If all conditions specified in the following paragraphs in\nthis Chapter (III) are met (for exceptions, see Section III.2)\nand if You comply with all other applicable terms and conditions\nof this License, You may modify This Product (thus forming Your\nProduct), derive new works from This Product or portions thereof\n(thus forming Your Product), include This Product or portions\nthereof in another product (thus forming Your Product, unless\ndefined otherwise in Chapter I), and You may use (for non-\ncommercial and/or commercial purposes), copy, and/or distribute\nYour Product.\n\n    a. The name of Your Product (or of Your modified version of\n    This Product) must not contain the name TrueCrypt (for\n    example, the following names are not allowed: TrueCrypt,\n    TrueCrypt+, TrueCrypt Professional, iTrueCrypt, etc.) nor\n    any other names confusingly similar to the name TrueCrypt\n    (e.g., True-Crypt, True Crypt, TruKrypt, etc.)\n\n    All occurrences of the name TrueCrypt that could reasonably\n    be considered to identify Your Product must be removed from\n    Your Product and from any associated materials. Logo(s)\n    included in (or attached to) Your Product (and in/to\n    associated materials) must not incorporate and must not be\n    confusingly similar to any of the TrueCrypt logos\n    (including, but not limited to, the non-textual logo\n    consisting primarily of a key in stylized form) or\n    portion(s) thereof. All graphics contained in This Product\n    (logos, icons, etc.) must be removed from Your Product (or\n    from Your modified version of This Product) and from any\n    associated materials.\n\n    b. The following phrases must be removed from Your Product\n    and from any associated materials, except the text of this\n    License: \"A TrueCrypt Foundation Release\", \"Released by\n    TrueCrypt Foundation\", \"This is a TrueCrypt Foundation\n    release.\"\n\n    c. Phrase \"Based on TrueCrypt, freely available at\n    http://www.truecrypt.org/\" must be displayed by Your Product\n    (if technically feasible) and contained in its\n    documentation. Alternatively, if This Product or its portion\n    You included in Your Product constitutes only a minor\n    portion of Your Product, phrase \"Portions of this product\n    are based in part on TrueCrypt, freely available at\n    http://www.truecrypt.org/\" may be displayed instead. In each\n    of the cases mentioned above in this paragraph,\n    \"http://www.truecrypt.org/\" must be a hyperlink (if\n    technically feasible) pointing to http://www.truecrypt.org/\n    and You may freely choose the location within the user\n    interface (if there is any) of Your Product (e.g., an\n    \"About\" window, etc.) and the way in which Your Product will\n    display the respective phrase.\n\n    Your Product (and any associated materials, e.g., the\n    documentation, the content of the official web site of Your\n    Product, etc.) must not present any Internet address\n    containing the domain name truecrypt.org (or any domain name\n    that forwards to the domain name truecrypt.org) in a manner\n    that might suggest that it is where information about Your\n    Product may be obtained or where bugs found in Your Product\n    may be reported or where support for Your Product may be\n    available or otherwise attempt to indicate that the domain\n    name truecrypt.org is associated with Your Product.\n\n    d. The complete source code of Your Product must be freely\n    and publicly available (for exceptions, see Section III.2)\n    at least until You cease to distribute Your Product. This\n    condition can be met in one or both of the following ways:\n    (i) You include the complete source code of Your Product\n    with every copy of Your Product that You make and distribute\n    and You make all such copies of Your Product available to\n    the general public free of charge, and/or (ii) You include\n    information (valid and correct at least until You cease to\n    distribute Your Product) about where the complete source\n    code of Your Product can be obtained free of charge (e.g.,\n    an Internet address) or for a reasonable reproduction fee\n    with every copy of Your Product that You make and distribute\n    and, if there is a web site officially associated with Your\n    Product, You include the aforementioned information about\n    the source code on a freely and publicly accessible web\n    page to which such web site links via an easily viewable\n    hyperlink (at least until You cease to distribute Your\n    Product).\n\n    The source code of Your Product must not be deliberately\n    obfuscated and it must not be in an intermediate form (e.g.,\n    the output of a preprocessor). Source code means the\n    preferred form in which a programmer would usually modify\n    the program.\n\n    Portions of the source code of Your Product not contained in\n    This Product (e.g., portions added by You in creating Your\n    Product, whether created by You or by third parties) must be\n    available under license(s) that (however, see also\n    Subsection III.1.e) allow(s) anyone to modify and derive new\n    works from the portions of the source code that are not\n    contained in This Product and to use, copy, and redistribute\n    such modifications and/or derivative works. The license(s)\n    must be perpetual, non-exclusive, royalty-free, no-charge,\n    and worldwide, and must not invalidate, weaken, restrict,\n    interpret, amend, modify, interfere with or otherwise affect\n    any part, term, provision, or clause of this License. The\n    text(s) of the license(s) must be included with every copy\n    of Your Product that You make and distribute.\n\n    e. You must not change the license terms of This Product in\n    any way (adding any new terms is considered changing the\n    license terms even if the original terms are retained),\n    which means, e.g., that no part of This Product may be put\n    under another license. You must keep intact all the legal\n    notices contained in the source code files. You must include\n    the following items with every copy of Your Product that You\n    make and distribute: a clear and conspicuous notice stating\n    that Your Product or portion(s) thereof is/are governed by\n    this version of the TrueCrypt License, a verbatim copy of\n    this version of the TrueCrypt License (as contained herein),\n    a clear and conspicuous notice containing information about\n    where the included copy of the License can be found, and an\n    appropriate copyright notice.\n\n\n2. You are not obligated to comply with Subsection III.1.d if\nYour Product is not distributed (i.e., Your Product is available\nonly to You).\n\n\n\nIV. Disclaimer of Liability, Disclaimer of Warranty,\nIndemnification\n\nYou expressly acknowledge and agree to the following:\n\n1. IN NO EVENT WILL ANY (CO)AUTHOR OF THIS PRODUCT, OR ANY\nAPPLICABLE INTELLECTUAL-PROPERTY OWNER, OR ANY OTHER PARTY WHO\nMAY COPY AND/OR (RE)DISTRIBUTE THIS PRODUCT OR PORTIONS THEREOF,\nAS MAY BE PERMITTED HEREIN, BE LIABLE TO YOU OR TO ANY OTHER\nPARTY FOR ANY DAMAGES, INCLUDING, BUT NOT LIMITED TO, ANY\nDIRECT, INDIRECT, GENERAL, SPECIAL, INCIDENTAL, PUNITIVE,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, CORRUPTION OR LOSS OF DATA, ANY LOSSES SUSTAINED BY YOU OR\nTHIRD PARTIES, A FAILURE OF THIS PRODUCT TO OPERATE WITH ANY\nOTHER PRODUCT, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES, OR\nBUSINESS INTERRUPTION), WHETHER IN CONTRACT, STRICT LIABILITY,\nTORT (INCLUDING, BUT NOT LIMITED TO, NEGLIGENCE) OR OTHERWISE,\nARISING OUT OF THE USE, COPYING, MODIFICATION, OR\n(RE)DISTRIBUTION OF THIS PRODUCT (OR A PORTION THEREOF) OR OF\nYOUR PRODUCT (OR A PORTION THEREOF), OR INABILITY TO USE THIS\nPRODUCT (OR A PORTION THEREOF), EVEN IF SUCH DAMAGES (OR THE\nPOSSIBILITY OF SUCH DAMAGES) ARE/WERE PREDICTABLE OR KNOWN TO\nANY (CO)AUTHOR, INTELLECTUAL-PROPERTY OWNER, OR ANY OTHER PARTY.\n\n2. THIS PRODUCT IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY\nKIND, WHETHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT\nLIMITED TO, THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\nPARTICULAR PURPOSE, AND NON-INFRINGEMENT. THE ENTIRE RISK AS TO\nTHE QUALITY AND PERFORMANCE OF THIS PRODUCT IS WITH YOU. SHOULD\nTHIS PRODUCT PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL\nNECESSARY SERVICING, REPAIR, OR CORRECTION.\n\n3. THIS PRODUCT MAY INCORPORATE IMPLEMENTATIONS OF CRYPTOGRAPHIC\nALGORITHMS THAT ARE REGULATED (E.G., SUBJECT TO EXPORT/IMPORT\nCONTROL REGULATIONS) OR ILLEGAL IN SOME COUNTRIES. IT IS SOLELY\nYOUR RESPONSIBILITY TO VERIFY THAT IT IS LEGAL TO IMPORT AND/OR\n(RE)EXPORT AND/OR USE THIS PRODUCT (OR PORTIONS THEREOF) IN\nCOUNTRIES WHERE YOU INTEND TO USE IT AND/OR TO WHICH YOU INTEND\nTO IMPORT IT AND/OR FROM WHICH YOU INTEND TO EXPORT IT, AND IT\nIS SOLELY YOUR RESPONSIBILITY TO COMPLY WITH ANY APPLICABLE\nREGULATIONS, RESTRICTIONS, AND LAWS.\n\n4. YOU SHALL INDEMNIFY, DEFEND AND HOLD ALL (CO)AUTHORS OF THIS\nPRODUCT, AND APPLICABLE INTELLECTUAL-PROPERTY OWNERS, HARMLESS\nFROM AND AGAINST ANY AND ALL LIABILITY, DAMAGES, LOSSES,\nSETTLEMENTS, PENALTIES, FINES, COSTS, EXPENSES (INCLUDING\nREASONABLE ATTORNEYS' FEES), DEMANDS, CAUSES OF ACTION, CLAIMS,\nACTIONS, PROCEEDINGS, AND SUITS, DIRECTLY RELATED TO OR ARISING\nOUT OF YOUR USE, INABILITY TO USE, COPYING, (RE)DISTRIBUTION,\nIMPORT AND/OR (RE)EXPORT OF THIS PRODUCT (OR PORTIONS THEREOF)\nAND/OR YOUR BREACH OF ANY TERM OF THIS LICENSE.\n\n\n\nV. Trademarks\n\nThis License does not grant permission to use trademarks\nassociated with (or applying to) This Product, except for fair\nuse as defined by applicable law and except for use expressly\npermitted or required by this License. Any attempt otherwise to\nuse trademarks associated with (or applying to) This Product\nautomatically and immediately terminates Your rights under This\nLicense and may constitute trademark infringement (which may be\nprosecuted).\n\n\n\nVI. General Terms and Conditions, Miscellaneous Provisions\n\n1. ANYONE WHO USES AND/OR COPIES AND/OR MODIFIES AND/OR CREATES\nDERIVATIVE WORKS OF AND/OR (RE)DISTRIBUTES THIS PRODUCT, OR ANY\nPORTION(S) THEREOF, IS, BY SUCH ACTION(S), AGREEING TO BE BOUND\nBY AND ACCEPTING ALL TERMS AND CONDITIONS OF THIS LICENSE (AND\nTHE RESPONSIBILITIES AND OBLIGATIONS CONTAINED IN THIS LICENSE).\nIF YOU DO NOT ACCEPT (AND AGREE TO BE BOUND BY) ALL TERMS AND\nCONDITIONS OF THIS LICENSE, DO NOT USE, COPY, MODIFY, CREATE\nDERIVATIVE WORKS OF, NOR (RE)DISTRIBUTE THIS PRODUCT, NOR ANY\nPORTION(S) THEREOF.\n\n2. YOU MAY NOT USE, MODIFY, COPY, CREATE DERIVATIVE WORKS OF,\n(RE)DISTRIBUTE, OR SUBLICENSE THIS PRODUCT, OR PORTION(S)\nTHEREOF, EXCEPT AS EXPRESSLY PROVIDED IN THIS LICENSE (EVEN IF\nAPPLICABLE LAW GIVES YOU MORE RIGHTS). ANY ATTEMPT (EVEN IF\nPERMITTED BY APPLICABLE LAW) OTHERWISE TO USE, MODIFY, COPY,\nCREATE DERIVATIVE WORKS OF, (RE)DISTRIBUTE, OR SUBLICENSE THIS\nPRODUCT, OR PORTION(S) THEREOF, AUTOMATICALLY AND IMMEDIATELY\nTERMINATES YOUR RIGHTS UNDER THIS LICENSE AND CAN CONSTITUTE\nCOPYRIGHT INFRINGEMENT (WHICH MAY BE PROSECUTED). ANY CONDITIONS\nAND RESTRICTIONS CONTAINED IN THIS LICENSE ARE ALSO LIMITATIONS\nON THE SCOPE OF THIS LICENSE AND ALSO DEFINE THE SCOPE OF YOUR\nRIGHTS UNDER THIS LICENSE. YOUR FAILURE TO COMPLY WITH THE TERMS\nAND CONDITIONS OF THIS LICENSE OR FAILURE TO PERFORM ANY\nAPPLICABLE OBLIGATION IMPOSED BY THIS LICENSE AUTOMATICALLY AND\nIMMEDIATELY TERMINATES YOUR RIGHTS UNDER THIS LICENSE AND CAN\nCAUSE OR BE CONSIDERED COPYRIGHT INFRINGEMENT (WHICH MAY BE\nPROSECUTED). NOTHING IN THIS LICENSE SHALL IMPLY OR BE CONSTRUED\nAS A PROMISE, OBLIGATION, OR COVENANT NOT TO SUE FOR COPYRIGHT\nOR TRADEMARK INFRINGEMENT IF YOU DO NOT COMPLY WITH THE TERMS\nAND CONDITIONS OF THIS LICENSE.\n\n3. This License does not constitute or imply a waiver of any\nintellectual property rights except as may be otherwise\nexpressly provided in this License. This License does not\ntransfer, assign, or convey any intellectual property rights\n(e.g., it does not transfer ownership of copyrights or\ntrademarks).\n\n4. Subject to the terms and conditions of this License, You may\nallow a third party to use Your copy of This Product (or a copy\nthat You make and distribute, or Your Product) provided that the\nthird party explicitly accepts and agrees to be bound by all\nterms and conditions of this License and the third party is not\nprohibited from using This Product (or portions thereof) by this\nLicense (see, e.g., Section VI.7) or by applicable law. However,\nYou are not obligated to ensure that the third party accepts\n(and agrees to be bound by all terms of) this License if You\ndistribute only the self-extracting package (containing This\nProduct) that does not allow the user to install (nor extract)\nthe files contained in the package until he or she accepts and\nagrees to be bound by all terms and conditions of this License.\n\n5. Without specific prior written permission from the authors of\nThis Product (or from their common representative), You must not\nuse the name of This Product, the names of the authors of This\nProduct, or the names of the legal entities (or informal groups)\nof which the authors were/are members/employees, to endorse or\npromote Your Product or any work in which You include a modified\nor unmodified version of This Product, or to endorse or promote\nYou or Your affiliates, or in a way that might suggest that Your\nProduct (or any work in which You include a modified or\nunmodified version of This Product), You, or Your affiliates\nis/are endorsed by one or more authors of This Product, or in a\nway that might suggest that one or more authors of This Product\nis/are affiliated with You (or Your affiliates) or directly\nparticipated in the creation of Your Product or of any work in\nwhich You include a modified or unmodified version of This\nProduct.\n\n6. IF YOU ARE NOT SURE WHETHER YOU UNDERSTAND ALL PARTS OF THIS\nLICENSE OR IF YOU ARE NOT SURE WHETHER YOU CAN COMPLY WITH ALL\nTERMS AND CONDITIONS OF THIS LICENSE, YOU MUST NOT USE, COPY,\nMODIFY, CREATE DERIVATIVE WORKS OF, NOR (RE)DISTRIBUTE THIS\nPRODUCT, NOR ANY PORTION(S) OF IT. YOU SHOULD CONSULT WITH A\nLAWYER.\n\n7. IF (IN RELEVANT CONTEXT) ANY PROVISION OF CHAPTER IV OF THIS\nLICENSE IS UNENFORCEABLE, INVALID, OR PROHIBITED UNDER\nAPPLICABLE LAW IN YOUR JURISDICTION, YOU HAVE NO RIGHTS UNDER\nTHIS LICENSE AND YOU MUST NOT USE, COPY, MODIFY, CREATE\nDERIVATIVE WORKS OF, NOR (RE)DISTRIBUTE THIS PRODUCT, NOR ANY\nPORTION(S) THEREOF.\n\n8. Except as otherwise provided in this License, if any\nprovision of this License, or a portion thereof, is found to be\ninvalid or unenforceable under applicable law, it shall not\naffect the validity or enforceability of the remainder of this\nLicense, and such invalid or unenforceable provision shall be\nconstrued to reflect the original intent of the provision and\nshall be enforced to the maximum extent permitted by applicable\nlaw so as to effect the original intent of the provision as\nclosely as possible.\n\n____________________________________________________________\n\n\nThird-Party Licenses\n\nThis Product contains components that were created by third\nparties and that are governed by third-party licenses, which are\ncontained hereinafter (separated by lines consisting of\nunderscores). Each of the third-party licenses applies only to\n(portions of) the source code file(s) in which the third-party\nlicense is contained or in which it is explicitly referenced,\nand to compiled or otherwise processed forms of such source\ncode. None of the third-party licenses applies to This Product\nas a whole, even when it uses terms such as \"product\",\n\"program\", or any other equivalent terms/phrases. This Product\nas a whole is governed by the TrueCrypt License (see above).\nSome of the third-party components have been modified by the\nauthors of This Product. Unless otherwise stated, such\nmodifications and additions are governed by the TrueCrypt\nLicense (see above). Note: Unless otherwise stated, graphics and\nfiles that are not part of the source code are governed by the\nTrueCrypt License.\n\n____________________________________________________________\n\nLicense agreement for Encryption for the Masses.\n\nCopyright (C) 1998-2000 Paul Le Roux. All Rights Reserved.\n\nThis product can be copied and distributed free of charge,\nincluding source code.\n\nYou may modify this product and source code, and distribute such\nmodifications, and you may derive new works based on this\nproduct, provided that:\n\n1. Any product which is simply derived from this product cannot\nbe called E4M, or Encryption for the Masses.\n\n2. If you use any of the source code in your product, and your\nproduct is distributed with source code, you must include this\nnotice with those portions of this source code that you use.\n\nOr,\n\nIf your product is distributed in binary form only, you must\ndisplay on any packaging, and marketing materials which\nreference your product, a notice which states:\n\n\"This product uses components written by Paul Le Roux\n<pleroux@swprofessionals.com>\"\n\n3. If you use any of the source code originally by Eric Young,\nyou must in addition follow his terms and conditions.\n\n4. Nothing requires that you accept this License, as you have\nnot signed it. However, nothing else grants you permission to\nmodify or distribute the product or its derivative works.\n\nThese actions are prohibited by law if you do not accept this\nLicense.\n\n5. If any of these license terms is found to be to broad in\nscope, and declared invalid by any court or legal process, you\nagree that all other terms shall not be so affected, and shall\nremain valid and enforceable.\n\n6. THIS PROGRAM IS DISTRIBUTED FREE OF CHARGE, THEREFORE THERE\nIS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. UNLESS OTHERWISE STATED THE PROGRAM IS PROVIDED\n\"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR\nIMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE\nENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS\nWITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE\nCOST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n7. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY\nMODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE\nLIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL,\nINCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\nINABILITY TO USE THE PROGRAM, INCLUDING BUT NOT LIMITED TO LOSS\nOF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH\nANY OTHER PROGRAMS, EVEN IF SUCH HOLDER OR OTHER PARTY HAD\nPREVIOUSLY BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n____________________________________________________________\n\nCopyright (c) 1998-2008, Brian Gladman, Worcester, UK.\nAll rights reserved.\n\nLICENSE TERMS\n\nThe free distribution and use of this software is allowed (with\nor without changes) provided that:\n\n 1. source code distributions include the above copyright\n    notice, this list of conditions and the following\n    disclaimer;\n\n 2. binary distributions include the above copyright notice,\n    this list of conditions and the following disclaimer in\n    their documentation;\n\n 3. the name of the copyright holder is not used to endorse\n    products built using this software without specific written\n    permission.\n\nDISCLAIMER\n\nThis software is provided 'as is' with no explicit or implied\nwarranties in respect of its properties, including, but not\nlimited to, correctness and/or fitness for purpose.\n____________________________________________________________\n\nCopyright (C) 1995-2023 Jean-loup Gailly and Mark Adler\n\n  This software is provided 'as-is', without any express or implied\n  warranty.  In no event will the authors be held liable for any damages\n  arising from the use of this software.\n\n  Permission is granted to anyone to use this software for any purpose,\n  including commercial applications, and to alter it and redistribute it\n  freely, subject to the following restrictions:\n\n  1. The origin of this software must not be misrepresented; you must not\n     claim that you wrote the original software. If you use this software\n     in a product, an acknowledgment in the product documentation would be\n     appreciated but is not required.\n  2. Altered source versions must be plainly marked as such, and must not be\n     misrepresented as being the original software.\n  3. This notice may not be removed or altered from any source distribution.\n\n  Jean-loup Gailly        Mark Adler\n  jloup@gzip.org          madler@alumni.caltech.edu\n____________________________________________________________\nCopyright (C) 1999-2023 Dieter Baron and Thomas Klausner\n\nThe authors can be contacted at <libzip@nih.at>\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n  notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\n  notice, this list of conditions and the following disclaimer in\n  the documentation and/or other materials provided with the\n  distribution.\n\n3. The names of the authors may not be used to endorse or promote\n  products derived from this software without specific prior\n  written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nIN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n____________________________________________________________\nCopyright (c) 2013, Alexey Degtyarev. All rights reserved.\n\n____________________________________________________________\nCopyright (c) 2016. Disk Cryptography Services for EFI (DCS), Alex Kolotnikov\nThis program and the accompanying materials are licensed and made available \nunder the terms and conditions of the GNU Lesser General Public License, \nversion 3.0 (LGPL-3.0).\n\nThe full text of the license may be found at https://opensource.org/licenses/LGPL-3.0\n____________________________________________________________\nCopyright (c) 1999-2016 Jack Lloyd. \n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n  notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\n  notice, this list of conditions and the following disclaimer in\n  the documentation and/or other materials provided with the\n  distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHORS ``AS IS'' AND ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER\nIN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n____________________________________________________________\nCopyright (c) 2013-2019 Stephan Mueller <smueller@chronox.de>\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, and the entire permission notice in its entirety, \n   including the disclaimer of warranties.\n\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in\n   the documentation and/or other materials provided with the\n   distribution.\n\n3. The name of the author may not be used to endorse or promote\n   products derived from this software without specific prior\n   written permission.\n\nALTERNATIVELY, this product may be distributed under the terms of\nthe GNU General Public License, in which case the provisions of the\nGPL2 are required INSTEAD OF the above restrictions. (This clause is\nnecessary due to a potential bad interaction between the GPL and the\nrestrictions contained in a BSD-style copyright.)\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, ALL OF WHICH\nARE HEREBY DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF NOT ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n____________________________________________________________\nCopyright (c) 1999-2023 Igor Pavlov\n\nLZMA SDK is written and placed in the public domain by Igor Pavlov.\n\nSome code in LZMA SDK is based on public domain code from another developers:\n  1) PPMd var.H (2001): Dmitry Shkarin\n  2) SHA-256: Wei Dai (Crypto++ library)\n\nAnyone is free to copy, modify, publish, use, compile, sell, or distribute the \noriginal LZMA SDK code, either in source code form or as a compiled binary, for \nany purpose, commercial or non-commercial, and by any means.\n____________________________________________________________\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.091796875,
          "content": "This archive contains the source code of VeraCrypt.\nIt is based on the original TrueCrypt 7.1a with security enhancements and modifications.\n\n# Important\n\nYou may use the source code contained in this archive only if you accept and\nagree to the license terms contained in the file 'License.txt', which is\nincluded in this archive.\n\nNote that the license specifies, for example, that a derived work must not be\ncalled 'TrueCrypt' or 'VeraCrypt'\n\n# Contents\n\n[I. Windows](#i-windows)\n\n[II. Linux and Mac OS X](#ii-linux-and-mac-os-x)\n\n[III. FreeBSD](#iii-freebsd)\n\n[IV. Third-Party Developers (Contributors)](#iv-third-party-developers-contributors)\n\n[V. Legal Information](#v-legal-information)\n\n[VI. Further Information](#vi-further-information)\n\n# I. Windows\n\n## Requirements for Building VeraCrypt for Windows:\n\nA detailed guide on how to build VeraCrypt on Windows can be found in\nthe [documentation](./doc/html/CompilingGuidelineWin.html) in the repository and\nit is also available [online](https://www.veracrypt.fr/en/CompilingGuidelineWin.html).\n\nIMPORTANT:\n\nThe 64-bit editions of Windows Vista and later versions of Windows, and in\nsome cases (e.g. playback of HD DVD content) also the 32-bit editions do not\nallow the VeraCrypt driver to run without an appropriate digital signature.\nTherefore, all .sys files in official VeraCrypt binary packages are digitally\nsigned with the digital certificate of the IDRIX, which was issued by\nGlobalSign certification authority. At the end of each official .exe and\n.sys file, there are embedded digital signatures and all related certificates\n(i.e. all certificates in the relevant certification chain, such as the\ncertification authority certificates, CA-MS cross-certificate, and the\nIDRIX certificate).\n\nKeep this in mind if you compile VeraCrypt and compare your binaries with the\nofficial binaries. If your binaries are unsigned, the sizes of the official\nbinaries will usually be approximately 10 KiB greater than the sizes of your\nbinaries (there may be further differences if you use a different version of\nthe compiler, or if you install a different or no service pack for Visual\nStudio, or different hotfixes for it, or if you use different versions of\nthe required SDKs).\n\n## Instructions for Signing and Packaging VeraCrypt for Windows:\n\nFirst, create an environment variable 'WSDK81' pointing to the Windows SDK\nfor Windows 8.1 installation directory.\n\nThe folder \"Signing\" contains a batch file (sign.bat) that will sign all\nVeraCrypt components using a code signing certificate present on the\ncertificate store and build the final installation setup and MSI package.\nThe batch file assumes that the code signing certificate is issued by\nGlobalSign. This is the case for IDRIX's certificate. If yours is issued by\nanother CA, then you should put its intermediate certificates in the \"Signing\"\nfolder and modify sign.bat accordingly.\n\nTo generate MSI packages, WiX Toolset v3.11 must be installed.\n\n## VeraCrypt EFI Boot Loader:\n\nVeraCrypt source code contains pre-built EFI binaries under src\\Boot\\EFI.\nThe source code of VeraCrypt EFI Boot Loader is licensed under LGPL and\nit is available at https://github.com/veracrypt/VeraCrypt-DCS.\nFor build instructions, please refer to the file src\\Boot\\EFI\\Readme.txt.\n\n# II. Linux and Mac OS X\n\nA detailed guide on how to build VeraCrypt on Linux can be found in\nthe [documentation](./doc/html/CompilingGuidelineLinux.html) in the repository and\nit is also available [online](https://www.veracrypt.fr/en/CompilingGuidelineLinux.html).\n\n## Requirements for Building VeraCrypt for Linux and Mac OS X:\n\n- GNU Make\n- GNU C++ Compiler 4.0 or compatible\n- Apple Xcode or Xcode command line tools (Mac OS X only)\n- YASM 1.3.0 or newer (Linux only, x86/x64 architecture only)\n- pkg-config\n- wxWidgets 3.0 shared library and header files installed or\n  wxWidgets 3.0 library source code (available at https://www.wxwidgets.org)\n- FUSE library and header files (available at https://github.com/libfuse/libfuse\n  and https://osxfuse.github.io/)\n- PCSC-lite library and header files (available at https://github.com/LudovicRousseau/PCSC)\n\n## Instructions for Building VeraCrypt for Linux and Mac OS X:\n\n1. Change the current directory to the root of the VeraCrypt source code.\n\n2. If you have no wxWidgets shared library installed, run the following\n   command to configure the wxWidgets static library for VeraCrypt and to\n   build it:\n\n   `$ make WXSTATIC=1 WX_ROOT=/usr/src/wxWidgets wxbuild`\n\n   The variable `WX_ROOT` must point to the location of the source code of the\n   wxWidgets library. Output files will be placed in the './wxrelease/'\n   directory.\n\n3. To build VeraCrypt, run the following command:\n\n   `$ make`\n\n   or if you have no wxWidgets shared library installed:\n\n   `$ make WXSTATIC=1`\n\n4. If successful, the VeraCrypt executable should be located in the directory\n   'Main'.\n\nBy default, a universal executable supporting both graphical and text user\ninterface (through the switch --text) is built.\nOn Linux, a console-only executable, which requires no GUI library, can be\nbuilt using the 'NOGUI' parameter:\n\n`$ make NOGUI=1 WXSTATIC=1 WX_ROOT=/usr/src/wxWidgets wxbuild`\n\n`$ make NOGUI=1 WXSTATIC=1`\n\nOn MacOSX, building a console-only executable is not supported.\n\n## Mac OS X specifics:\n\nUnder MacOSX, the latest installed SDK is used by default. To use a different version\nof the SDK when building using make, you can export the environment variable VC_OSX_SDK:\n\n`$ export VC_OSX_SDK=13.0`\n\nFor development dependencies management, you can use [homebrew](https://brew.sh).\n\n`$ brew install pkg-config yasm wxwidgets`\n\nYou also need system dependencies\n\n`$ brew install --cask macfuse packages`\n\nAfter installing dependencies via brew, you can build a local development build\n\n`$ ./src/Build/build_veracrypt_macosx.sh -b`\n\nIf you want to build the package, you must pass `-p` to the build script above. The built\nexecutable will be in `.src/Main`\n\nIf you prefer to build from sources, or without homebrew, pkg-config and packages must be installed.\n\nGet pkg-config from https://pkgconfig.freedesktop.org/releases/pkg-config-0.29.2.tar.gz and\ncompile using the following commands:\n\n`$ CFLAGS=\"-Wno-int-conversion\" CXXFLAGS=\"-Wno-int-conversion\" ./configure --with-internal-glib`\n\n`$ make`\n\n`$ sudo make install`\n\nAfter making sure pkg-config is available, download and install OSXFuse from\nhttps://osxfuse.github.io/\n\nThe [build_veracrypt_macosx.sh](./src/Build/build_veracrypt_macosx.sh) script performs the\nfull build of VeraCrypt including the creation of the installer pkg. It expects\nto find the wxWidgets 3.2.5 sources at the same level as where you put\nVeraCrypt sources (i.e. if \"src\" path is \"/Users/joe/Projects/VeraCrypt/src\"\nthen wxWidgets should be at \"/Users/joe/Projects/wxWidgets-3.2.5\")\n\nThe make build process uses Code Signing certificates whose ID is specified in\nsrc/Main/Main.make (look for lines containing \"Developer ID Application\" and\n\"Developer ID Installer\"). You'll have to modify these lines to put the ID of\nyour Code Signing certificates or comment them out if you don't have one.\n\nBecause of incompatibility issues with OSXFUSE, the SDK 10.9 generates a\nVeraCrypt binary that has issues communicating with the OSXFUSE kernel extension.\nThus, we recommend using a different OSX SDK version for building VeraCrypt.\n\nThe Packages installer that is used for the VeraCrypt official build has been notarized by IDRIX and it is available at\nhttps://github.com/idrassi/packages/releases\n\n# III. FreeBSD\n\nFreeBSD is supported starting from version 11.\nThe build requirements and instructions are the same as Linux except that gmake\nshould be used instead of make.\n\n# IV. Third-Party Developers (Contributors)\n\nIf you intend to implement a feature, please contact us first to make sure:\n\n1. That the feature has not been implemented (we may have already implemented\n   it, but haven't released the code yet).\n2. That the feature is acceptable.\n3. Whether we need the help of third-party developers with implementing the feature.\n\nInformation on how to contact us can be found at:\nhttps://www.veracrypt.fr/\n\n# V. Legal Information\n\n## Copyright Information\n\nThis software as a whole:  \nCopyright (c) 2013-2024 IDRIX. All rights reserved.  \n\nPortions of this software:  \nCopyright (c) 2013-2024 IDRIX. All rights reserved.  \nCopyright (c) 2003-2012 TrueCrypt Developers Association. All rights reserved.  \nCopyright (c) 1998-2000 Paul Le Roux. All rights reserved.  \nCopyright (c) 1998-2008 Brian Gladman, Worcester, UK. All rights reserved.  \nCopyright (c) 1995-2023 Jean-loup Gailly and Mark Adler.  \nCopyright (c) 2016 Disk Cryptography Services for EFI (DCS), Alex Kolotnikov  \nCopyright (c) 1999-2023 Dieter Baron and Thomas Klausner.  \nCopyright (c) 2013, Alexey Degtyarev. All rights reserved.  \nCopyright (c) 1999-2016 Jack Lloyd. All rights reserved.  \nCopyright (c) 2013-2019 Stephan Mueller <smueller@chronox.de>  \nCopyright (c) 1999-2023 Igor Pavlov  \n\nFor more information, please see the legal notices attached to parts of the\nsource code.\n\n## Trademark Information\n\nAny trademarks contained in the source code, binaries, and/or in the\ndocumentation, are the sole property of their respective owners.\n\n# VI. Further Information\n\nhttps://www.veracrypt.fr\n"
        },
        {
          "name": "Tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "Translations",
          "type": "tree",
          "content": null
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}