{
  "metadata": {
    "timestamp": 1736710326675,
    "page": 128,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "akopytov/sysbench",
      "stars": 6209,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.66015625,
          "content": "*.o\n*.a\nMakefile\nMakefile.in\naclocal.m4\nautom4te.cache\n/config/config.h\n/config/ltmain.sh\n/config/stamp-h1\n/doc/manual.html\n/config.log\n/config.status\n/configure\n/libtool\n/doc/xsl/catalog.xml\n/src/.deps\n/src/.libs\n/src/sysbench\n/src/drivers/mysql/.deps\n/src/drivers/oracle/.deps\n/src/drivers/pgsql/.deps\n/src/tests/cpu/.deps\n/src/tests/fileio/.deps\n/src/tests/memory/.deps\n/src/tests/mutex/.deps\n/src/tests/oltp/.deps\n/src/tests/threads/.deps\n/TAGS\n/backup.bzr\n/config/config.guess\n/config/config.h.in\n/config/config.sub\n/src/TAGS\n/src/drivers/TAGS\n/src/drivers/mysql/TAGS\n/src/tests/TAGS\n/src/tests/cpu/TAGS\n/src/tests/fileio/TAGS\n/src/tests/memory/TAGS\n/src/tests/mutex/TAGS\n/src/tests/oltp/TAGS\n/src/tests/threads/TAGS\n/config/compile\n/config/depcomp\n/config/install-sh\n/config/missing\n/m4/libtool.m4\n/m4/ltoptions.m4\n/m4/ltsugar.m4\n/m4/ltversion.m4\n/m4/lt~obsolete.m4\n/src/drivers/drizzle/.deps\n/src/scripting/.deps\n/src/scripting/lua/src/.deps\nGPATH\nGRTAGS\nGTAGS\n/config/ar-lib\n/src/drivers/attachsql/.deps/\n/config/test-driver\n*.DS_Store\n/tests/*.log\n/tests/*.trs\n*.gcda\n*.gcno\n/tests/include/config.sh\n/third_party/concurrency_kit/include/\n/third_party/concurrency_kit/lib/\n/third_party/concurrency_kit/share/\n/third_party/concurrency_kit/tmp/\nthird_party/luajit/bin/\nthird_party/luajit/inc/\nthird_party/luajit/lib/\nthird_party/luajit/share/\nthird_party/luajit/tmp/\nsrc/lua/internal/sysbench.lua.h\nsrc/lua/internal/sysbench.sql.lua.h\n/src/lua/internal/sysbench.rand.lua.h\n/src/lua/internal/sysbench.opt.lua.h\ntests/t/*.err\n/src/lua/internal/sysbench.cmdline.lua.h\n/src/lua/internal/sysbench.compat.lua.h\n/src/lua/internal/sysbench.histogram.lua.h\nparts\nprime\nstage\n*.snap\n/snap/snapcraft.yaml\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 6.3310546875,
          "content": "# vim ft=yaml\n#\n# Travis CI configuration\n\narch:\n  - amd64\n  - arm64\n\ndist: trusty\nsudo: required\n\nservices:\n  - docker\n  - mysql\n  - postgresql\n\ngit:\n  depth: 100500\n\nlanguage: c\n\nos:\n  - linux\n  - osx\n\nosx_image: xcode12.2\n\ncompiler:\n  - gcc\n  - clang\n\nenv:\n    matrix:\n      - TARGET=distcheck\n      - TARGET=test\n      - TARGET=coverage\n      - OS=el DIST=7\n      - OS=el DIST=8\n      - OS=fedora DIST=32\n# Currently unsupported by packagecloud\n#      - OS=fedora DIST=33\n      - OS=ubuntu DIST=xenial\n      - OS=ubuntu DIST=bionic\n      - OS=ubuntu DIST=focal\n      - OS=ubuntu DIST=groovy\n      - OS=debian DIST=stretch\n      - OS=debian DIST=buster\n      - OS=debian DIST=sid\n      - OS=ubuntu DIST=xenial ARCH=i386\n      - OS=ubuntu DIST=bionic ARCH=i386\n      - OS=debian DIST=stretch ARCH=i386\n      - OS=debian DIST=buster ARCH=i386\n      - OS=debian DIST=sid ARCH=i386\n\nmatrix:\n  exclude:\n    - env: OS=el DIST=7\n      compiler: clang\n    - env: OS=el DIST=8\n      compiler: clang\n    - env: OS=fedora DIST=32\n      compiler: clang\n    - env: OS=fedora DIST=33\n      compiler: clang\n    - env: OS=ubuntu DIST=xenial\n      compiler: clang\n    - env: OS=ubuntu DIST=bionic\n      compiler: clang\n    - env: OS=ubuntu DIST=disco\n      compiler: clang\n    - env: OS=ubuntu DIST=focal\n      compiler: clang\n    - env: OS=ubuntu DIST=groovy\n      compiler: clang\n    - env: OS=debian DIST=stretch\n      compiler: clang\n    - env: OS=debian DIST=buster\n      compiler: clang\n    - env: OS=debian DIST=sid\n      compiler: clang\n    - env: OS=ubuntu DIST=xenial ARCH=i386\n      compiler: clang\n    - env: OS=ubuntu DIST=bionic ARCH=i386\n      compiler: clang\n    - env: OS=ubuntu DIST=disco ARCH=i386\n      compiler: clang\n    - env: OS=debian DIST=stretch ARCH=i386\n      compiler: clang\n    - env: OS=debian DIST=buster ARCH=i386\n      compiler: clang\n    - env: OS=debian DIST=sid ARCH=i386\n      compiler: clang\n    - env: OS=ubuntu DIST=xenial ARCH=i386\n      arch: arm64\n    - env: OS=ubuntu DIST=bionic ARCH=i386\n      arch: arm64\n    - env: OS=ubuntu DIST=disco ARCH=i386\n      arch: arm64\n    - env: OS=debian DIST=stretch ARCH=i386\n      arch: arm64\n    - env: OS=debian DIST=buster ARCH=i386\n      arch: arm64\n    - env: OS=debian DIST=sid ARCH=i386\n      arch: arm64\n    - env: OS=el DIST=7\n      os: osx\n    - env: OS=el DIST=8\n      os: osx\n    - env: OS=fedora DIST=32\n      os: osx\n    - env: OS=fedora DIST=33\n      os: osx\n    - env: OS=ubuntu DIST=xenial\n      os: osx\n    - env: OS=ubuntu DIST=bionic\n      os: osx\n    - env: OS=ubuntu DIST=disco\n      os: osx\n    - env: OS=ubuntu DIST=focal\n      os: osx\n    - env: OS=ubuntu DIST=groovy\n      os: osx\n    - env: OS=debian DIST=stretch\n      os: osx\n    - env: OS=debian DIST=buster\n      os: osx\n    - env: OS=debian DIST=sid\n      os: osx\n    - env: TARGET=distcheck\n      compiler: clang\n    - env: TARGET=distcheck\n      os: osx\n    - env: TARGET=distcheck\n      arch: arm64\n    - env: TARGET=coverage\n      os: osx\n    - env: TARGET=coverage\n      compiler: clang\n    - env: TARGET=coverage\n      arch: arm64\n    - os: osx\n      compiler: gcc\n    - os: osx\n      arch: arm64\n    - arch: arm64\n      compiler: clang\n\naddons:\n  apt:\n    packages:\n    - libmysqlclient-dev\n    - libpq-dev\n    - libaio-dev\n    - clang-3.6\n\nbefore_install:\n  # Upload builds corresponding to release tags to the 'sysbench'\n  # repository, push other ones to 'sysbench-prereleases'\n  - git describe --long --always\n  - commits=$(git describe --long --always | sed -n 's/^\\([0-9\\.]*\\)-\\([0-9]*\\)-\\([a-z0-9]*\\)/\\2/p')\n  - >\n    if [ ${commits:-0} = 0 ]; then\n      export VERSION=$(git describe)\n      PACKAGECLOUD_REPO=sysbench\n    else\n      PACKAGECLOUD_REPO=sysbench-prereleases\n    fi\n  - >\n    if [ \"x$TARGET\" = \"xtest\" ]; then\n      case \"${TRAVIS_OS_NAME:-linux}\" in\n      osx)\n        brew update\n        brew install mysql postgresql\n\n        # OS X requires servers to be started explicitly\n        brew services start mysql\n\n        cat /usr/local/var/mysql/*.err\n        lsof -c mysql\n\n        brew postgresql-upgrade-database\n        brew services start postgresql\n\n        echo \"Starting PostgreSQL\"\n        pg_ctl -wD /usr/local/var/postgres start\n        echo \"Creating user postgres\"\n        createuser -s postgres\n        ;;\n      linux)\n        export ASAN_OPTIONS=\"detect_leaks=0\"\n        if [ \"${CC}\" = \"clang\" ]; then\n          CC=clang-3.6\n        fi\n        ;;\n      esac\n    fi\n\ninstall:\n  - >\n    case \"${TRAVIS_OS_NAME:-linux}\" in\n    osx)\n      # OS X requires this for user-local pip packages\n      export PATH=~/Library/Python/2.7/bin:$PATH\n      ;;\n    linux)\n      pip install --user cpp-coveralls\n      ;;\n    esac\n\nbefore_script:\n  - mysql -u root -e 'CREATE DATABASE sbtest'\n  - psql -U postgres -c 'CREATE DATABASE sbtest'\n\nscript:\n  - >\n    if [ -n \"$TARGET\" ]; then\n      case \"$TARGET\" in\n      test)\n        ./autogen.sh && ./configure --with-mysql --with-pgsql\n        make\n        SBTEST_MYSQL_ARGS=\"--mysql-user=root\" SBTEST_PGSQL_ARGS=\"--pgsql-user=postgres\" make test\n        ;;\n      distcheck)\n        ./autogen.sh && ./configure --without-mysql\n        make\n        make distcheck\n        ;;\n      coverage)\n        ./autogen.sh && ./configure --enable-coverage --enable-asan --enable-msan --with-mysql --with-pgsql\n        make -j2\n        SBTEST_MYSQL_ARGS=\"--mysql-user=root\" SBTEST_PGSQL_ARGS=\"--pgsql-user=postgres\" make test\n        ;;\n      esac\n    else\n      # To avoid name conflicts, deploy source packages only for\n      # \"default\", i.e. x86_64 architecture\n      if [[ -z \"$ARCH\" && \"$TRAVIS_CPU_ARCH\" == amd64 ]]; then\n        PACKAGECLOUD_GLOB='build/*.{rpm,deb,dsc}'\n      else\n      # Exclude *.src.rpm and *.dsc\n        PACKAGECLOUD_GLOB='build/*{[^c].rpm,.deb}'\n      fi\n\n      git clone https://github.com/akopytov/packpack.git packpack\n      packpack/packpack\n    fi\n\ndeploy:\n  # Deploy packages to PackageCloud\n  - provider: packagecloud\n    username: \"${PACKAGECLOUD_USER}\"\n    repository: \"${PACKAGECLOUD_REPO}\"\n    token: \"${PACKAGECLOUD_TOKEN}\"\n    dist: \"${OS}/${DIST}\"\n    package_glob: \"${PACKAGECLOUD_GLOB}\"\n    skip_cleanup: true\n    on:\n      all_branches: true\n      condition: -n \"$OS\" && -n \"$DIST\" && -n \"$PACKAGECLOUD_TOKEN\" && \"$DIST\" != \"rawhide\" && \"$DIST\" != \"sid\"\n\nafter_success:\n  - >\n    if [ \"x$TARGET\" = \"xcoverage\" ]; then\n      coveralls --exclude third_party/ --gcov-options '\\-lp'\n    fi\n\n# Local variables:\n# mode: yaml\n# End:\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.66796875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "ChangeLog",
          "type": "blob",
          "size": 16.3623046875,
          "content": "2020-04-24  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.20\n\t* build/CI/packaging: Add arm64 to Travis CI matrix (#358)\n\t* build/CI/packaging: add Ubuntu Focal\n\t* build/CI/packaging: remove Fedora Rawhide from CI matrix\n\t* build/CI/packaging: fix regression tests to work with MySQL 8.0.19+\n\t* build/CI/packaging: fix macOS builds in Travis\n\t* build/CI/packaging: remove Ubuntu Disco (EOL)\n\n2019-12-08  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.19\n\t* build/CI/packaging: fix Ubuntu packaging for Bionic and later versions\n\t* regression tests: compatibility fix for PostgreSQL 12\n\t* build/CI/packaging: fix macOs builds in Travis\n\t* build/CI/packaging: add Fedora 31.\n\n2019-10-21  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.18\n\t* build/CI/packaging: add Ubuntu Eoan.\n\t* build/CI/packaging: remove Ubuntu Cosmic (EOL).\n\t* build/CI/packaging: add CentOS 8.\n\t* build/CI/packaging: add Ubuntu Disco.\n\t* build/CI/packaging: remove Ubuntu Trusty (EOL).\n\t* build/CI/packaging: remove Fedora 28 (EOL).\n\t* build/CI/packaging: add Fedora 30.\n\t* build/CI/packaging: cherry-pick fix for LuaJIT/LuaJIT#484 to\n\tfix builds on macOS Mojave.\n\t* build/CI/packaging: add Debian Buster\n\n2019-03-15  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.17\n\t* build/CI/packaging: update RPM spec to support RHEL8-beta\n\t(thanks to Alexey Bychko for the patch)\n\t* regression tests: remove unnecessary error leading to opt_rate.t instability.\n\t* --rate mode: return a non-zero exit code on event queue\n\toverflow.\n\t* --rate mode: fix a bogus error about eventgen thread termination\n\n2018-12-16  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.16\n\t* build/CI/packaging: add Ubuntu Cosmic.\n\t* build/CI/packaging: add Fedora 29.\n\t* build/CI/packaging: remove Fedora 27 (EOL).\n\t* SQL API: fix GH-282 (Mysql's fetch_row() is broken)\n\t* --rate mode: fix latency stats skew on low rates\n\t* Lua: Add /usr/share/lua/5.1 to LUA_PATH and /usr/lib/lua/5.1\n\tto LUA_CPATH.\n\t* build/CI/packaging: add -Wvla to default compiler flags.\n\t* build/CI/packaging: fix debian/changelog format\n\t* build/CI/packaging: fix buildpack.sh to not push multiple file\n\ttypes to packagecloud.\n\t* build/CI/packaging: add libaio-dev to Debian/Ubuntu build\n\tdependencies.\n\n2018-07-03  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.15\n\t* CI/build/packaging: add Fedora 28\n\t* CI/build/packaging: add Ubuntu Bionic\n\t* CI/build/packaging: remove Fedora 26 (EOL)\n\t* CI/build/packaging: remove Debian Wheezy (EOL)\n\t* fileio: fix GH-229 (--file-fsync-freq=0 seems to prevent\n\tfsync() at the end of the test)\n\t* command line: improve parsing of boolean command line options\n\t* tests: fix GH-220 (Testsuite api_sql_mysql.t failed ...)\n\t* tests: fix GH-223 (test failure on ppc64)\n\t* tests: fix opt_help.t to pass when the binary is not\n\tconfigured with MySQL support\n\t* MySQL driver: use it by default in DB benchmarks\n\n2018-04-01  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.14\n\t* reports: fix JSON stats reporter to produce valid JSON\n\t(GH-195)\n\t* Lua SQL API: don't crash when query_row() is called with a\n\tSELECT returning empty result set\n\t* Lua SQL API: don't crash when bulk insert API calls are used\n\tout of order\n\t* regression tests: make PostgreSQL tests compatible with the\n\tnew dump format introduced in 10.3\n\t* regression tests: minor stability and coverage improvements\n\n2018-02-17  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.13\n\t* remove Ubuntu Zesty from CI/build/packaging matrices (EOL)\n\t* minor cleanups in build scripts\n\t* improve report formatting for long latency values\n\t* fileio: --file-extra-flags now accepts a list of flags rather\n\tthan just a single value\n\t* OLTP: re-prepare prepared statements after reconnects, i.e. in\n\tcases when a server connection is lost and sysbench is\n\tconfigured to ignore such errors\n\n2018-01-17  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.12\n\t* improve --rate mode precision for high argument values\n\t* add Fedora Rawhide and Debian Sid to CI matrix\n\t* fix compile-time architecture detection for some Broadwell\n\tCPUs which were incorrectly identified as Core 2.\n\t* remove build dependency on xxd (and vim-minimal package)\n\t* fix Lua API to correctly stop the benchmark when event()\n\treturns a value other than nil or false (thanks to caojiafeng\n\tfor the patch)\n\t* fix the fileio benchmark when the specified file size is not a\n\tmultiple of block size\n\t* fix the fileio benchmark to throw a descriptive error when the\n\tspecified file size does not match the size of files created by\n\t'prepare'\n\t* remove Fedora 25 from CI/build/packaging matrices (EOL)\n\t* minor improvements in tests and documentation.\n\n2017-12-09  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.11\n\t* add Debian Stretch to CI/build/packaging matrices\n\t* add Fedora 27 to CI/build/packaging matrices\n\t* make statistic counters usable from Lua scripts\n\t* fix the PostgreSQL driver to be compatible with CockroachDB\n\t(GH-180)\n\t* fix oltp_insert.lua to work correctly when both --tables and\n\t--threads are greater than 1 (GH-178)\n\t* fix FreeBSD builds by adding -rdynamic to the default linker\n\tflags (GH-174)\n\t* minor documentation updates\n\n2017-10-25  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.10\n\t* fixed PK conflicts in oltp_insert.lua by creating empty tables\n\ton 'prepare'\n\t* made sysbench.opt available to init()/done() by exporting it\n\tto the global Lua state\n\t* added Fedora 26 (both x86_64 and AArch64) to the list of\n\tsupported and tested distributions\n\t* fixed GH-172: sysbench 1.0.9 doesn't build with mariadb 10.2.8\n\t* add the /usr/local LuaRocks root directory to default LUA_PATH\n\tand LUA_CPATH\n\t* removed Fedora 24, Ubuntu Precise, Yakkety from default build\n\tmatrices\n\t* added Ubuntu Artful to default build matrices\n\n2017-09-05  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.9\n\t* fixed oltp_delete.lua to not use INSERT statements for\n\tconsistency with other oltp_* benchmarks (GH-168)\n\t* added a workaround for MySQL bug #87337 \"8.0.2 reintroduces\n\tmy_bool to client API\"\n\t* fixed building on on Debian GNU/kFreeBSD (GH-161)\n\t* fixed building against MariaDB 10.2 (thanks to Xavier Bachelot\n\tfor the patch, GH-160)\n\n2017-07-04  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.8\n\t* fixed api_report test for slow machines (thanks to @jcfp)\n\t* fileio: suggest to run prepare step on missing files (thanks\n\tto Heinrich Schuchardt)\n\t* JSON reports: removed an erroneous trailing comma (GH-139)\n\t* added events per second to the CPU benchmark report (GH-140)\n\t* fixed db_connect() in legacy SQL API to use the default value\n\tfor --db-driver (GH-146)\n\t* removed busy-wait in the bounded event generation mode\n\t(--rate) to avoid CPU hogging\n\n2017-05-15  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.7\n\t* Ubuntu Zesty added to package build matrix\n\t* fixed GH-130: Mutex Benchmark Documentation\n\t* fixed latency reports in the --rate mode\n\t* fixed compiler warnings when building against MySQL 8.0 client\n\tlibraries\n\n2017-04-13  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.6\n\t* no functional changes\n\t* many build- and packaging-related improvements\n\t* Linux packages are now automatically built using Travis CI and\n\tpackpack, hosted by packagecloud.io\n\n2017-04-02  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.5\n\t* various build-related documentation updates\n\t* benchmark can now be specified by a module name on the command\n\tline\n\t* memory benchmark: performance and scalability improvements\n\t* fix ARMv6 builds with system ConcurrencyKit\n\t* fix GH-123: Table already exists error on prepare\n\t* fix GH-121: make buildhost cpudetection optional\n\n2017-03-13  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.4\n\t* fixed a number of compilation errors and warnings that were\n\tspecific to 32-bit platforms\n\t* bundle cram (regression tests framework) and use it by default\n\tin 'make test'\n\t* bundled ConcurrencyKit updated to 0.6.0\n\n2017-02-26  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.3\n\t* LuaJIT scalability improvements for non-x86 architectures\n\t* performance optimizations in oltp_read_write.lua to avoid Lua\n\tstring management\n\t* fixed Illumos builds (thanks to Dillon Amburgey)\n\n2017-02-17  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.2\n\t* improved scalability for --report-checkpoints mode\n\t* fix builds on CentoOS 6 and autoconf 2.63\n\t* support for Snap (http://snapcraft.io) packages\n\n2017-02-05  Alexey Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.1\n\t* fix clock_gettime runtime failure built with macOS 10.11 and\n\tXcode 8.x\n\t\n2017-02-04  Aleksei Kopytov  <akopytov@gmail.com>\n\n\t* version 1.0.0\n\t* too much time and too many changes since the previous formal\n\trelease, so briefly:\n\t* Lua scripts instead of hard-coded C tests for database\n\t(\"oltp\") benchmarks + ability to create custom workloads\n\t* much better single-threaded performance\n\t* much better scalability\n\t* improvements and cleanups in command line syntax and options\n\t* latency histograms in cumulative statistic reports\n\t* report hooks to print statistics in custom formats\n\t(CSV/JSON/XML/etc.)\n\t* Dropped Windows support\n\t* Dropped support for Oracle, Drizzle and libattachsql drivers\n\n2006-10-10  Alexey Kopytov <alexeyk@mysql.com>\n\n\t* Removed the debugging code in OLTP test which got into 0.4.7 by mistake\n\t* Handle ER_CHECKREAD in the same way as deadlocks in the MySQL driver\n\t* version 0.4.8\n\t\n2006-05-28  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* count fsync() time as request execution time in file-fsync-all mode\n\n2006-05-24  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added --oltp-reconnect option\n\n2006-05-18  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Allow build with non-gcc compilers\n\t* Fixed random numbers generation on Solaris\n\t* Added --mysql-ssl option\n\t* version 0.4.7\n\t\n2006-04-03  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added a warning for inaccurate gettimeofday() implementations\n\t* version 0.4.6\n\n2006-03-10  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed crash at the end of OLTP test\n\n2006-03-03  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Made auto_increment id column optional\n\t* Use TYPE= or ENGINE= in MySQL driver depending on the version of client libraries\n\n2006-01-17  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* version 0.4.5\n\t* Added several hosts capability to MySQL driver\n\t* Fixed several memory leaks in OLTP test\n\n2005-12-14  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Renamed option 'mysql-table-type' to 'mysql-table-engine'\n\t* It's now possible to pass arbitrary engine names to MySQL driver\n\t* Transactions support must be explicitly specified with \n\t'mysql-engine-trx' option for those engines, which are unknown to SysBench\n\n2005-09-27  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Changed 'thread fairness' calculation from percents to stddev\n\t* Added validation mode to OLTP test (--validate switch)\n\t* Remove auto_increment from the 'id' field before running OLTP tests\n\t* Print separate time for query execution and result fetching in --debug mode\n\t* version 0.4.3\n\n2005-07-25  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Minor cleanups in help messages\n\t* Several FreeBSD-related fixes\n\t* Fixed the Oracle driver\n\t* Version 0.4.1\n\n2005-03-04  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed a lot of small bugs, including portability issues on Mac OS X, \n\t64-bit platforms and old MySQL versions\n\t* Documentation added to the main tree\n\t* New validation mode in fileio test\n\n2005-01-27  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed compilation on Solaris\n\t* Added call to thr_setconcurrency() on Solaris\n\t* Fixed an overflow bug in sb_timer_current()\n\t* Changed the default number of threads to 1\n\t* Added non-transactional mode to the OLTP test\n\t* Fixed bug with excessive number of connections in OLTP test\n\t* Handle ER_LOCK_WAIT_TIMEOUT in the same way as ER_LOCK_DEADLOCK\n\t* Version 0.3.2\n\n2004-07-27  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed MySQL driver to use new PS API in MySQL >= 4.1.2\n\n2004-07-12  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed final fsync in random I/O requests\n\t* Fixed several race conditions\n\n2004-07-09  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Removed --oltp-time-limit option (obsoleted by --max-time)\n\n2004-07-06  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Changed statistics output to more human-readable format\n\n2004-07-04  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added new logger interface to internal API\n\t* Modified all tests to use the new logger interface\n\n2004-06-17  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed table type autodetection with MySQL >= 4.1\n\n2004-06-06  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added preliminary support of prepared statements to DB API\n\n2004-05-31  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added slow-mmap mode for 32-bit boxes in fileio test \n\n2004-05-30  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed compilation with gcc >= 3.3\n\t* Fixed 'prepare' command for sequential write test\n\n2004-05-26  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Changed formatting of file sizes in output\n\t* Fixed type cast warning on SuSE 8.1 \n\n2004-05-21  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added mutex performance benchmark \n\n2004-05-12  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Extended memory benchmark to calculate more useful results\n\n2004-05-10  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Split test file creation, test running and cleaning up into separate \n\tcommands (prepare, run, cleanup) for fileio test\n\n2004-05-05  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Removed limit on maximum block size for fileio test \n\n2004-05-04  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* added --max-time option to limit total test execution time \n\n2004-05-03  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed compilation with --without-mysql option. \n\n2004-04-13  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added mmaped I/O support to fileio test\n\n2004-04-11  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Changed default table size to a lower value in OLTP test\n\n2004-04-07  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added automatic table type detection to MySQL driver\n\t* Changed the default table type for MySQL driver to InnoDB\n\t* Added support for BDB and NDB table types\n\n2004-04-06  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added autoconf macro to handle older (incompatible) version of \n\tlibaio.h\n\n2004-04-05  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed compilation on 64-bit systems\n\t* Replaced Linux AIO calls with more portable equivalents\n\n2004-04-04  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added parameter to specify maximum number of queued operations\n\tin fileio async mode (file-async-backlog)\n\t* Added parameter to specify extra open() flags (file-extra-flags)\n\t* Fixed memory allocation bug in command line parser\n\n2004-04-02  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added Linux asynchronous I/O support to fileio test\n\t* Fixed bug with statistic counters\n\n2004-04-01  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added test file creation to fileio test\n\t* Added read-only mode to OLTP test \n\n2004-03-31  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Close database connections in OLTP test\n\t* Added file-fsync-all mode for fileio test\n\t\n2004-03-30  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Added myisam-max-rows option for MySQL driver\n\t* Fixed configure.ac for cases when no MySQL libraries found\n\n2004-03-10  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Implement proper handling of table locks in OLTP test\n\n2004-03-09  Alexey Kopytov  <alexeyk@mysql.com>\n\n        * Recognize MySQL table type when creating test database\n\t* Fix driver-specific options\n\t* Now it's possible to pass MySQL root directory in --with-mysql option\n\t* Trim trailing '.libs' if user passed it in --with-mysql-libs option\n\tto configure\n\n2004-03-08  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Build drivers and tests as separate libraries (first step to \n\tdynamically loaded modules)\n\t* Display help when required arguments are missing in fileio test\n\t* Changed code formatting to match MySQL coding guidelines\n\n2004-03-04  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Generalized DB-dependent code\n\t* Added 'database capabilities' feature\n\n2004-02-28  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Fixed possible memory leak in sql request generator\n\n2004-03-27  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Split OLTP code into DB-independent part and MySQL driver \n\n2004-02-23  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Use libtool for linking with external libraries\n\t* Statically link external libraries when they are not installed\n\n2004-02-19  Alexey Kopytov  <alexeyk@mysql.com>\n\n\t* Print more info when configure finds no MySQL development files\n\t* Added --with-mysql-includes and --with-mysql-libs to configure\n\t* Fixed compilation error when compiling without MySQL support\n\t* Combine several inserts into one query to speed up database creation\n\t\n\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.4599609375,
          "content": "FROM ubuntu:xenial\n\nRUN apt-get update\n\nRUN apt-get -y install make automake libtool pkg-config libaio-dev git\n\n# For MySQL support\nRUN apt-get -y install libmysqlclient-dev libssl-dev\n\n# For PostgreSQL support\nRUN apt-get -y install libpq-dev\n\nRUN git clone https://github.com/akopytov/sysbench.git sysbench\n\nWORKDIR sysbench\nRUN ./autogen.sh\nRUN ./configure --with-mysql --with-pgsql\nRUN make -j\nRUN make install\n\nWORKDIR /root\nRUN rm -rf sysbench\n\nENTRYPOINT sysbench\n"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 1.5107421875,
          "content": "# Copyright (C) 2004 MySQL AB\n# Copyright (C) 2004-2018 Alexey Kopytov <akopytov@gmail.com>\n#\n# This program is free software; you can redistribute it and/or modify\n# it under the terms of the GNU General Public License as published by\n# the Free Software Foundation; either version 2 of the License, or\n# (at your option) any later version.\n# \n# This program is distributed in the hope that it will be useful,\n# but WITHOUT ANY WARRANTY; without even the implied warranty of\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n# GNU General Public License for more details.\n# \n# You should have received a copy of the GNU General Public License\n# along with this program; if not, write to the Free Software\n# Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n\nACLOCAL_AMFLAGS = -I m4\nAM_DISTCHECK_CONFIGURE_FLAGS = --without-mysql\n\nif USE_BUNDLED_LUAJIT\n  LUAJIT_DIR = third_party/luajit\nendif\n\nif USE_BUNDLED_CK\n  CK_DIR = third_party/concurrency_kit\nendif\n\nSUBDIRS = $(LUAJIT_DIR) $(CK_DIR) src tests\n\nEXTRA_DIST = autogen.sh README.md ChangeLog \\\n             snap/snapcraft.yaml.in third_party/cram \\\n             debian/changelog debian/compat debian/control debian/copyright \\\n             debian/dirs debian/docs debian/install debian/rules \\\n             debian/source/format \\\n             rpm/sysbench.spec \\\n             scripts/buildpack.sh\n\ndist-hook:\n\t$(MAKE) -C $(distdir)/third_party/cram clean\n\ntest:\n\tcd tests && $(MAKE) test\n\nclean-local:\n\t$(MAKE) -C $(top_srcdir)/third_party/cram clean\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 18.505859375,
          "content": "[![Latest Release][release-badge]][release-url]\n[![Build Status][action-badge]][action-url]\n[![Debian Packages][deb-badge]][deb-url]\n[![RPM Packages][rpm-badge]][rpm-url]\n[![Coverage Status][coveralls-badge]][coveralls-url]\n[![License][license-badge]][license-url]\n\n<!-- markdown-toc start - Don't edit this section. Run M-x markdown-toc-generate-toc again -->\n**Table of Contents**\n\n- [sysbench](#sysbench)\n    - [Features](#features)\n- [Installing from Binary Packages](#installing-from-binary-packages)\n    - [Linux](#linux)\n    - [macOS](#macos)\n    - [Windows](#windows)\n- [Building and Installing From Source](#building-and-installing-from-source)\n    - [Build Requirements](#build-requirements)\n        - [Windows](#windows)\n        - [Debian/Ubuntu](#debianubuntu)\n        - [RHEL/CentOS](#rhelcentos)\n        - [Fedora](#fedora)\n        - [macOS](#macos)\n    - [Build and Install](#build-and-install)\n- [Usage](#usage)\n    - [General Syntax](#general-syntax)\n    - [General Command Line Options](#general-command-line-options)\n    - [Random Numbers Options](#random-numbers-options)\n- [Versioning](#versioning)\n\n<!-- markdown-toc end -->\n\n# sysbench\n\nsysbench is a scriptable multi-threaded benchmark tool based on\nLuaJIT. It is most frequently used for database benchmarks, but can also\nbe used to create arbitrarily complex workloads that do not involve a\ndatabase server.\n\nsysbench comes with the following bundled benchmarks:\n\n- `oltp_*.lua`: a collection of OLTP-like database benchmarks\n- `fileio`: a filesystem-level benchmark\n- `cpu`: a simple CPU benchmark\n- `memory`: a memory access benchmark\n- `threads`: a thread-based scheduler benchmark\n- `mutex`: a POSIX mutex benchmark\n\n## Features\n\n- extensive statistics about rate and latency is available, including\n  latency percentiles and histograms;\n- low overhead even with thousands of concurrent threads. sysbench is\n  capable of generating and tracking hundreds of millions of events per\n  second;\n- new benchmarks can be easily created by implementing pre-defined hooks\n  in user-provided Lua scripts;\n- can be used as a general-purpose Lua interpreter as well, simply\n  replace `#!/usr/bin/lua` with `#!/usr/bin/sysbench` in your script.\n\n# Installing from Binary Packages\n\n## Linux\n\nThe easiest way to download and install sysbench on Linux is using\nbinary package repositories hosted by\n[packagecloud](https://packagecloud.io). The repositories are\nautomatically updated on each sysbench release. Currently x86_64, i386\nand aarch64 binaries are available.\n\nMultiple methods to download and install sysbench packages are available and\ndescribed at <https://packagecloud.io/akopytov/sysbench/install>.\n\nQuick install instructions:\n\n- Debian/Ubuntu\n  ``` shell\n  curl -s https://packagecloud.io/install/repositories/akopytov/sysbench/script.deb.sh | sudo bash\n  sudo apt -y install sysbench\n  ```\n\n- RHEL/CentOS:\n  ``` shell\n  curl -s https://packagecloud.io/install/repositories/akopytov/sysbench/script.rpm.sh | sudo bash\n  sudo yum -y install sysbench\n  ```\n\n- Fedora:\n  ``` shell\n  curl -s https://packagecloud.io/install/repositories/akopytov/sysbench/script.rpm.sh | sudo bash\t\n  sudo dnf -y install sysbench\n  ```\n\n- Arch Linux:\n  ``` shell\n  sudo pacman -Suy sysbench\n  ```\n\n## macOS\n\nOn macOS, up-to-date sysbench packages are available from Homebrew:\n```shell\n# Add --with-postgresql if you need PostgreSQL support\nbrew install sysbench\n```\n\n## Windows\nAs of sysbench 1.0 support for native Windows builds was dropped. It may\nbe re-introduced in later releases. Currently, the recommended way to\nobtain sysbench on Windows is\nusing\n[Windows Subsystem for Linux available in Windows 10](https://msdn.microsoft.com/en-us/commandline/wsl/about).\n\nAfter installing WSL and getting into he bash prompt on Windows\nfollowing Debian/Ubuntu installation instructions is\nsufficient. Alternatively, one can use WSL to build and install sysbench\nfrom source, or use an older sysbench release to build a native binary.\n\n# Building and Installing From Source\n\nIt is recommended to install sysbench from the official binary\npackages as described in\n[Installing from Binary Packages](#installing-from-binary-packages). Below\nare instruction for cases when you want to use sysbench on an\narchitecture for which no binary packages are available.\n\n## Build Requirements\n\n### Windows\nAs of sysbench 1.0 support for native Windows builds was\ndropped. It may be re-introduced in later versions. Currently, the\nrecommended way to build sysbench on Windows is using\n[Windows Subsystem for Linux available in Windows 10](https://msdn.microsoft.com/en-us/commandline/wsl/about).\n\nAfter installing WSL and getting into bash prompt on Windows, following\nDebian/Ubuntu build instructions is sufficient. Alternatively, one can\nbuild and use an older 0.5 release on Windows.\n\n### Debian/Ubuntu\n``` shell\n    apt -y install make automake libtool pkg-config libaio-dev\n    # For MySQL support\n    apt -y install libmysqlclient-dev libssl-dev\n    # For PostgreSQL support\n    apt -y install libpq-dev\n```\n\n### RHEL/CentOS\n``` shell\n    yum -y install make automake libtool pkgconfig libaio-devel\n    # For MySQL support, replace with mysql-devel on RHEL/CentOS 5\n    yum -y install mariadb-devel openssl-devel\n    # For PostgreSQL support\n    yum -y install postgresql-devel\n```\n\n### Fedora\n``` shell\n    dnf -y install make automake libtool pkgconfig libaio-devel\n    # For MySQL support\n    dnf -y install mariadb-devel openssl-devel\n    # For PostgreSQL support\n    dnf -y install postgresql-devel\n```\n\n### macOS\n\nAssuming you have Xcode (or Xcode Command Line Tools) and Homebrew installed:\n``` shell\n    brew install automake libtool openssl pkg-config\n    # For MySQL support\n    brew install mysql\n    # For PostgreSQL support\n    brew install postgresql\n    # openssl is not linked by Homebrew, this is to avoid \"ld: library not found for -lssl\"\n    export LDFLAGS=-L/usr/local/opt/openssl/lib \n```\n\n## Build and Install\n``` shell\n    ./autogen.sh\n    # Add --with-pgsql to build with PostgreSQL support\n    ./configure\n    make -j\n    make install\n```\n\nThe above will build sysbench with MySQL support by default. If you have\nMySQL headers and libraries in non-standard locations (and no\n`mysql_config` can be found in the `PATH`), you can specify them\nexplicitly with `--with-mysql-includes` and `--with-mysql-libs` options\nto `./configure`.\n\nTo compile sysbench without MySQL support, use `--without-mysql`. If no\ndatabase drivers are available database-related scripts will not work,\nbut other benchmarks will be functional.\n\n# Usage\n\n## General Syntax\n\nThe general command line syntax for sysbench is:\n\n\t\t  sysbench [options]... [testname] [command] \n\n- *testname* is an optional name of a built-in test (e.g. `fileio`,\n  `memory`, `cpu`, etc.), or a name of one of the bundled Lua scripts\n  (e.g. `oltp_read_only`), or a *path* to a custom Lua script. If no\n  test name is specified on the command line (and thus, there is no\n  *command* too, as in that case it would be parsed as a *testname*), or\n  the test name is a dash (\"`-`\"), then sysbench expects a Lua script to\n  execute on its standard input.\n\n- *command* is an optional argument that will be passed by sysbench to\n  the built-in test or script specified with *testname*. *command*\n  defines the *action* that must be performed by the test. The list of\n  available commands depends on a particular test. Some tests also\n  implement their own custom commands.\n\n  Below is a description of typical test commands and their purpose:\n\n\t+ `prepare`: performs preparative actions for those tests which need\n\tthem, e.g. creating the necessary files on disk for the `fileio`\n\ttest, or filling the test database for database benchmarks.\n\t+ `run`: runs the actual test specified with the *testname*\n    argument. This command is provided by all tests.\n\t+ `cleanup`: removes temporary data after the test run in those\n    tests which create one.\n\t+ `help`: displays usage information for the test specified with the\n\t*testname* argument. This includes the full list of commands\n\tprovided by the test, so it should be used to get the available\n\tcommands.\n\n- *options* is a list of zero or more command line options starting with\n\t`'--'`. As with commands, the `sysbench testname help` command\n\tshould be used to describe available options provided by a\n\tparticular test.\n\n\tSee [General command line options](README.md#general-command-line-options)\n\tfor a description of general options provided by sysbench itself.\n\n\nYou can use `sysbench --help` to display the general command line syntax\nand options.\n\n## General Command Line Options\n\nThe table below lists the supported common options, their descriptions and default values:\n\n*Option*              | *Description* | *Default value*\n----------------------|---------------|----------------\n| `--threads`           | The total number of worker threads to create                                                                                                                                                                                                                                                                                                                                                                                                                            | 1               |\n| `--events`            | Limit for total number of requests. 0 (the default) means no limit                                                                                                                                                                                                                                                                                                                                                                                                      | 0               |\n| `--time`              | Limit for total execution time in seconds. 0 means no limit                                                                                                                                                                                                                                                                                                                                                                                                             | 10              |\n| `--warmup-time`       | Execute events for this many seconds with statistics disabled before the actual benchmark run with statistics enabled. This is useful when you want to exclude the initial period of a benchmark run from statistics. In many benchmarks, the initial period is not representative because CPU/database/page and other caches need some time to warm up                                                                                                                                                                                                                                                                                                  | 0               |\n| `--rate`              | Average transactions rate. The number specifies how many events (transactions) per seconds should be executed by all threads on average. 0 (default) means unlimited rate, i.e. events are executed as fast as possible                                                                                                                                                                                                                                                                 | 0               |\n| `--thread-init-timeout` | Wait time in seconds for worker threads to initialize                                                                                                                                                                                                                                                                                                                                                                                                                  | 30              |\n| `--thread-stack-size` | Size of stack for each thread                                                                                                                                                                                                                                                                                                                                                                                                                                           | 32K             |\n| `--report-interval`   | Periodically report intermediate statistics with a specified interval in seconds. Note that statistics produced by this option is per-interval rather than cumulative. 0 disables intermediate reports                                                                                                                                                                                                                                                                  | 0               |\n| `--debug`             | Print more debug info                                                                                                                                                                                                                                                                                                                                                                                                                                                   | off             |\n| `--validate`          | Perform validation of test results where possible                                                                                                                                                                                                                                                                                                                                                                                                                       | off             |\n| `--help`              | Print help on general syntax or on a specified test, and exit                                                                                                                                                                                                                                                                                                                                                                                                           | off             |\n| `--verbosity`         | Verbosity level (0 - only critical messages, 5 - debug)                                                                                                                                                                                                                                                                                                                                                                                                                 | 4               |\n| `--percentile`        | sysbench measures execution times for all processed requests to display statistical information like minimal, average and maximum execution time. For most benchmarks it is also useful to know a request execution time value matching some percentile (e.g. 95% percentile means we should drop 5% of the most long requests and choose the maximal value from the remaining ones). This option allows to specify a percentile rank of query execution times to count | 95              |\n| `--luajit-cmd`        | perform a LuaJIT control command. This option is equivalent to `luajit -j`. See [LuaJIT documentation](http://luajit.org/running.html#opt_j) for more information                                                                                                                                                                                                                                                                                                       |               |\n\nNote that numerical values for all *size* options (like `--thread-stack-size` in this table) may be specified by appending the corresponding multiplicative suffix (K for kilobytes, M for megabytes, G for gigabytes and T for terabytes).\n\n## Random Numbers Options\n\nsysbench provides a number of algorithms to generate random numbers that are distributed according to a given probability distribution. The table below lists options that can be used to control those algorithms.\n\n*Option*              | *Description* | *Default value*\n----------------------|---------------|----------------\n`--rand-type` | random numbers distribution {uniform, gaussian, special, pareto, zipfian} to use by default. Benchmark scripts may choose to use either the default distribution, or specify it explictly, i.e. override the default. | special\n`--rand-seed` | seed for random number generator. When 0, the current time is used as an RNG seed. | 0\n`--rand-spec-iter` | number of iterations for the special distribution | 12\n`--rand-spec-pct` | percentage of the entire range where 'special' values will fall in the special distribution | 1\n`--rand-spec-res` | percentage of 'special' values to use for the special distribution | 75\n`--rand-pareto-h` | shape parameter for the Pareto distribution | 0.2\n`--rand-zipfian-exp` | shape parameter (theta) for the Zipfian distribution | 0.8\n\n# Versioning\n\nFor transparency and insight into its release cycle, and for striving to maintain backward compatibility, sysbench will be maintained under the Semantic Versioning guidelines as much as possible.\n\nReleases will be numbered with the following format:\n\n`<major>.<minor>.<patch>`\n\nAnd constructed with the following guidelines:\n\n* Breaking backward compatibility bumps the major (and resets the minor and patch)\n* New additions without breaking backward compatibility bumps the minor (and resets the patch)\n* Bug fixes and misc changes bumps the patch\n\nFor more information on SemVer, please visit [http://semver.org/](http://semver.org/).\n\n[coveralls-badge]: https://coveralls.io/repos/github/akopytov/sysbench/badge.svg?branch=master\n[coveralls-url]: https://coveralls.io/github/akopytov/sysbench?branch=master\n[action-url]: https://github.com/akopytov/sysbench/actions/workflows/ci.yml\n[action-badge]: https://github.com/akopytov/sysbench/actions/workflows/ci.yml/badge.svg\n[license-badge]: https://img.shields.io/badge/license-GPLv2-blue.svg\n[license-url]: COPYING\n[release-badge]: https://img.shields.io/github/release/akopytov/sysbench.svg\n[release-url]: https://github.com/akopytov/sysbench/releases/latest\n[deb-badge]: https://img.shields.io/badge/Packages-Debian-red.svg?style=flat\n[deb-url]: https://packagecloud.io/akopytov/sysbench?filter=debs\n[rpm-badge]: https://img.shields.io/badge/Packages-RPM-blue.svg?style=flat\n[rpm-url]: https://packagecloud.io/akopytov/sysbench?filter=rpms\n"
        },
        {
          "name": "autogen.sh",
          "type": "blob",
          "size": 0.025390625,
          "content": "#!/bin/sh\n\nautoreconf -vi\n"
        },
        {
          "name": "config",
          "type": "tree",
          "content": null
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 11.12890625,
          "content": "# Process this file with autoconf to produce a configure script.\n\nAC_PREREQ(2.63)\nAC_INIT([sysbench],[1.1.0],[https://github.com/akopytov/sysbench/issues],\n        [sysbench], [https://github.com/akopytov/sysbench])\nAC_CONFIG_AUX_DIR([config])\n\n# Define m4_ifblank and m4_ifnblank macros from introduced in\n#  autotools 2.64 m4sugar.m4 if using an earlier autotools.\nm4_ifdef([m4_ifblank], [], [\nm4_define([m4_ifblank],\n[m4_if(m4_translit([[$1]],  [ ][\t][\n]), [], [$2], [$3])])\n])\n\nm4_ifdef([m4_ifnblank], [], [\nm4_define([m4_ifnblank],\n[m4_if(m4_translit([[$1]],  [ ][\t][\n]), [], [$3], [$2])])\n])\n\n# Setting CFLAGS here prevents AC_CANONICAL_TARGET from injecting them\nSAVE_CFLAGS=${CFLAGS}\nSAVE_CXXFLAGS=${CXXFLAGS}\nCFLAGS=\nCXXFLAGS=\nAC_CANONICAL_TARGET\n\nCFLAGS=${SAVE_CFLAGS}\nCXXFLAGS=${SAVE_CXXFLAGS}\n \nAM_INIT_AUTOMAKE([-Wall -Werror foreign])\nAC_CONFIG_SRCDIR([src/sysbench.c])\nAC_CONFIG_HEADER([config/config.h])\nAC_CONFIG_MACRO_DIR([m4])\n\nm4_pattern_forbid([^PKG_[A-Z_]+$],\n        [pkg-config has to be installed to build sysbench])\n\nACX_USE_SYSTEM_EXTENSIONS\n\nAC_PROG_CC\nAC_PROG_CC_C99\nAC_PROG_CPP\nAM_PROG_CC_C_O\n\nif test x\"$ac_cv_prog_cc_c99\" = xno; then\n   AC_MSG_ERROR([a C99 compiler is required to build sysbench])\nfi\n\n# Try to guess the most optimal compiler architecture flag, unless it's already\n# been specified by the user via CFLAGS (or --without-gcc-arch is passed to\n# configure)\nAS_CASE([$CFLAGS],\n  [*-march=*],,\n  [AX_GCC_ARCHFLAG([no])]\n)\n\nm4_ifdef([AM_PROG_AR], [AM_PROG_AR])\n\nAC_PROG_LIBTOOL\n\nAC_CHECK_PROG(sb_have_pkg_config, pkg-config, yes, no)\nif test x\"$sb_have_pkg_config\" = xno; then\n  AC_MSG_ERROR([the pkg-config package is required to build sysbench])\nfi\n\nAX_COMPILER_VENDOR\n\n# Checks for user arguments\n\nAC_LIB_PREFIX()\n\nCPPFLAGS=\"-D_GNU_SOURCE ${CPPFLAGS}\"\n\n# Mac OS X requires _DARWIN_C_SOURCE for valloc(3) to be visible\ncase \"${host_cpu}-${host_os}\" in\n\t*-darwin*) CPPFLAGS=\"-D_DARWIN_C_SOURCE ${CPPFLAGS}\";;\nesac\n\n# Build optimized or debug version ?\n# First check for gcc and g++\nif test \"$GCC\" = \"yes\"\nthen\n  CFLAGS=\"-ggdb3 ${CFLAGS}\"\n  DEBUG_CFLAGS=\"-O0\"\n  OPTIMIZE_CFLAGS=\"-O3 -funroll-loops\"\n  GCOV_CFLAGS=\"-O0 --coverage\"\n  GCOV_LDFLAGS=\"-coverage\"\n  ASAN_CFLAGS=\"-fsanitize=address\"\n  ASAN_LDFLAGS=\"${ASAN_CFLAGS}\"\n  MSAN_CFLAGS=\"-fsanitize=memory\"\n  MSAN_LDFLAGS=\"${MSAN_LDFLAGS}\"\nfi\nif test \"$ax_cv_c_compiler_vendor\" = \"sun\"\nthen\n  isainfo_k=`isainfo -k`\n  if test \"$target_cpu\" = \"sparc\"\n  then\n    MEMALIGN_FLAGS=\"-xmemalign=8s\"\n    IS_64=\"-m64\"\n    LDFLAGS=\"${LDFLAGS} -L/usr/lib/${isainfo_k} -L/usr/local/lib/${isainfo_k}\"\n  else\n    if test \"$isainfo_k\" = \"amd64\"\n    then\n      IS_64=\"-m64\"\n      LDFLAGS=\"${LDFLAGS} -L/usr/lib/${isainfo_k} -L/usr/local/lib/${isainfo_k}\"\n    fi\n  fi\n  CPPFLAGS=\"${CPPFLAGS} -I/usr/local/include\"\n\n  CFLAGS=\"-g -mt ${IS_64} ${MEMALIGN_FLAGS} ${CFLAGS}\"\n  DEBUG_CFLAGS=\"-xO0\"\n  OPTIMIZE_CFLAGS=\"-xO2 -xlibmil -xdepend -Xa -mt -xstrconst\"\n# TODO: Set flags for Gcov-enabled builds, if supported by Sun Studio\nfi\n\n\n# Check if we should compile with MySQL support\nAC_ARG_WITH([mysql],\n            AS_HELP_STRING([--with-mysql],\n                           [compile with MySQL support (default is enabled)]),\n            [], [with_mysql=yes])\nAC_MSG_CHECKING([whether to compile with MySQL support])\nAS_IF([test \"x$with_mysql\" != \"xno\"],\n   [mysql_support=yes],\n   [mysql_support=no])\nAC_MSG_RESULT([$mysql_support])\n\n# Check if we should compile with PostgreSQL support\nAC_ARG_WITH([pgsql],\n            AS_HELP_STRING([--with-pgsql],\n                           [compile with PostgreSQL support (default is disabled)]),\n            [], [with_pgsql=no])\nAC_MSG_CHECKING([whether to compile with PostgreSQL support])\nAS_IF([test \"x$with_pgsql\" != \"xno\"],\n   [pgsql_support=yes],\n   [pgsql_support=no])\nAC_MSG_RESULT([$pgsql_support])\n\n# Set LuaJIT flags\nSB_LUAJIT\n\n# Set Concurrency Kit flags\nSB_CONCURRENCY_KIT\n\n# Check if we should enable large files support\nAC_ARG_ENABLE(largefile,\n    AS_HELP_STRING([--enable-largefile],[enable large files support (default is enabled)]), ,\n    enable_largefile=yes\n)\n\n# For SHM_HUGETLB on Linux\nAC_CHECK_DECLS(SHM_HUGETLB, \n    AC_DEFINE([HAVE_LARGE_PAGES], [1], \n              [Define if you have large pages support])\n    AC_DEFINE([HUGETLB_USE_PROC_MEMINFO], [1],\n              [Define if /proc/meminfo shows the huge page size (Linux only)])\n    , ,\n    [\n#include <sys/shm.h>\n    ]\n)\n\n# Check if we should enable Linux AIO support\nAC_ARG_ENABLE(aio,\n   AS_HELP_STRING([--enable-aio],[enable Linux asynchronous I/O support (default is enabled)]), ,\n   enable_aio=yes\n)\n\nAC_CHECK_DECLS(O_SYNC, ,\n   AC_DEFINE([O_SYNC], [O_FSYNC],\n             [Define to the appropriate value for O_SYNC on your platform]),\n   [\n#include <fcntl.h>\n   ]\n)\n\n\n# Checks for libraries.\n\nACX_PTHREAD\n\nAC_CHECK_LIB(m, sqrt)\n\nSB_CHECK_MYSQL\n\nAS_IF([test x$with_pgsql != xno], [\n    AC_CHECK_PGSQL([$with_pgsql])\n    USE_PGSQL=1\n    AC_DEFINE(USE_PGSQL,1,[Define to 1 if you want to compile with PostgreSQL support])\n    AC_SUBST([PGSQL_LIBS])\n    AC_SUBST([PGSQL_CFLAGS])\n])\nAM_CONDITIONAL(USE_PGSQL, test x$with_pgsql != xno)\nAC_SUBST([USE_PGSQL])\n\n# Check for libaio\nAC_CHECK_AIO\nAM_CONDITIONAL(USE_AIO, test x$enable_aio = xyes)\n\n# Checks for header files.\nAC_HEADER_STDC\n\nAC_CHECK_HEADERS([ \\\nerrno.h \\\nfcntl.h \\\nmath.h \\\npthread.h \\\nsched.h \\\nsignal.h \\\nstdlib.h \\\nstring.h \\\nsys/aio.h \\\nsys/ipc.h \\\nsys/time.h \\\nsys/mman.h \\\nsys/shm.h \\\nthread.h \\\nunistd.h \\\nlimits.h \\\nlibgen.h \\\n])\n\n\n# Checks for typedefs, structures, and compiler characteristics.\nAC_TYPE_OFF_T\nAC_HEADER_TIME\nAX_TLS([],\n  AC_MSG_ERROR([thread-local storage is not suppored by the target platform!])\n)\n\n# Define HAVE_FUNC_ATTRIBUTE_FORMAT if compiler supports the\n# __attribute__((format...)) function attribute\nAX_GCC_FUNC_ATTRIBUTE(format)\n\n# Define HAVE_FUNC_ATTRIBUTE_UNUSED if compiler supports the\n# __attribute__((unused)) function attribute\nAX_GCC_FUNC_ATTRIBUTE(unused)\n\nif test \"$enable_largefile\" = yes; then\n    AC_SYS_LARGEFILE\nfi\n\nAC_CHECK_SIZEOF(size_t)\nAC_CHECK_SIZEOF(bool,,\n  [\n    #include <stdbool.h>\n  ])\n\n# Checks for library functions.\nAC_FUNC_MMAP\nAC_FUNC_STRERROR_R\n\nAC_SEARCH_LIBS([clock_gettime], [rt]) \n\nsave_CFLAGS=\"$CFLAGS\"\nCFLAGS=\"$CFLAGS $PTHREAD_CFLAGS\"\nsave_LIBS=\"$LIBS\"\nLIBS=\"$PTHREAD_LIBS $LIBS\"\n\nAC_CHECK_FUNCS([ \\\nalarm \\\nclock_gettime \\\ndirectio \\\nfdatasync \\\ngettimeofday \\\nisatty \\\nmemalign \\\nmemset \\\nposix_memalign \\\npthread_cancel \\\npthread_yield \\\nsetvbuf \\\nsqrt \\\nstrdup \\\nthr_setconcurrency \\\nvalloc \\\n])\n\nAC_CHECK_FUNC(pthread_once, , \n              AC_MSG_ERROR([*** pthread_once() is not available on this platform ***])\n)\n\nLIBS=\"$save_LIBS\"\nCFLAGS=\"$save_CFLAGS\"\n\nAC_ARG_WITH([debug],\n    [AS_HELP_STRING([--with-debug],\n       [Add debug code/turns off optimizations (yes|no) @<:@default=no@:>@])],\n    [with_debug=$withval],\n    [with_debug=no])\n\nAC_ARG_ENABLE([coverage],\n    [AS_HELP_STRING([--enable-coverage],\n       [Toggle coverage @<:@default=no@:>@])],\n    [ac_coverage=\"$enableval\"],\n    [ac_coverage=\"no\"])\n\nAC_ARG_ENABLE([asan],\n  [AS_HELP_STRING([--enable-asan],\n    [Enable AddressSanitizer @<:@default=no@:>@])],\n  [ac_asan=\"$enableval\"],\n  [ac_asan=\"no\"])\n\nAC_ARG_ENABLE([msan],\n  [AS_HELP_STRING([--enable-msan],\n    [Enable MemorySanitizer @<:@default=no@:>@])],\n  [ac_msan=\"$enableval\"],\n  [ac_msan=\"no\"])\n\nAC_ARG_ENABLE([fail],\n    [AS_HELP_STRING([--disable-fail],\n       [Turn warnings into failures @<:@default=no@:>@])],\n    [ac_warn_fail=\"$enableval\"],\n    [ac_warn_fail=\"no\"])\n\nif test \"$with_debug\" = \"yes\"\nthen\n  # Debugging. No optimization.\n  CFLAGS=\"${DEBUG_CFLAGS} -DDEBUG ${CFLAGS}\"\nelif test \"$ac_coverage\" = \"yes\"\nthen\n  # Gcov-enabled build. No optimization.\n  CFLAGS=\"${GCOV_CFLAGS} ${CFLAGS}\"\n  LDFLAGS=\"${GCOV_LDFLAGS} ${LDFLAGS}\"\nelse\n  # Optimized version. No debug\n  CFLAGS=\"${OPTIMIZE_CFLAGS} ${CFLAGS}\"\nfi\n\nif test \"$ac_asan\" = \"yes\"\nthen\n  # Add -fsanitize=address to CFLAGS/LDFLAGS if supported by the compiler\n  AX_CHECK_COMPILE_FLAG([-fsanitize=address],\n  [\n    CFLAGS=\"${ASAN_CFLAGS} ${CFLAGS}\"\n    LDFLAGS=\"${ASAN_LDFLAGS} ${LDFLAGS}\"\n  ])\nfi\n\nif test \"$ac_msan\" = \"yes\"\nthen\n  # Add -fsanitize=memory to CFLAGS/LDFLAGS if supported by the compiler\n  AX_CHECK_COMPILE_FLAG([-fsanitize=memory],\n  [\n    CFLAGS=\"${MSAN_CFLAGS} ${CFLAGS}\"\n    LDFLAGS=\"${MSAN_CFLAGS} ${LDFLAGS}\"\n  ])\nfi\n\nif test \"$GCC\" = \"yes\"\nthen\n  if test \"$ac_warn_fail\" = \"yes\"\n  then\n    W_FAIL=\"-Werror\"\n  fi\n\n  CC_WARNINGS=\"-Wall -Wextra -Wpointer-arith -Wbad-function-cast \\\n-Wstrict-prototypes -Wnested-externs -Wno-format-zero-length \\\n-Wundef -Wstrict-prototypes -Wmissing-prototypes -Wmissing-declarations \\\n-Wredundant-decls -Wcast-align -Wvla ${W_FAIL}\"\nfi\n\nif test \"$ax_cv_c_compiler_vendor\" = \"sun\"\nthen\n  CC_WARNINGS=\"-v -errtags=yes -errwarn=%all -erroff=E_INTEGER_OVERFLOW_DETECTED -erroff=E_STATEMENT_NOT_REACHED\"\nfi\n\nAM_CFLAGS=\"${CC_WARNINGS} ${AM_CFLAGS} ${PTHREAD_CFLAGS}\"\n\nAM_CPPFLAGS=\"${AM_CPPFLAGS} -I\\$(top_srcdir)/src ${LUAJIT_CFLAGS} ${CK_CFLAGS}\"\n\nAM_LDFLAGS=\"$PTHREAD_LIBS\"\n\nAC_SUBST(AM_CFLAGS)\nAC_SUBST(AM_CPPFLAGS)\nAC_SUBST(AM_LDFLAGS)\n\n# Define SB_GIT_SHA\ngit=$(which git)\nif test -n \"$git\"\nthen\n        SB_GIT_SHA=$(git rev-parse --short HEAD 2>/dev/null)\n        if test -n \"$SB_GIT_SHA\"\n        then\n          SB_GIT_SHA=\"-$SB_GIT_SHA\"\n        fi\nfi\nAC_DEFINE_UNQUOTED([SB_GIT_SHA], [\"$SB_GIT_SHA\"], [Git commit hash, if available.])\nAC_SUBST([SB_GIT_SHA])\n\nAC_CONFIG_FILES([\nMakefile\nthird_party/luajit/Makefile\nthird_party/concurrency_kit/Makefile\nsrc/Makefile\nsrc/drivers/Makefile\nsrc/drivers/mysql/Makefile\nsrc/drivers/pgsql/Makefile\nsrc/tests/Makefile\nsrc/tests/cpu/Makefile\nsrc/tests/fileio/Makefile\nsrc/tests/memory/Makefile\nsrc/tests/threads/Makefile\nsrc/tests/mutex/Makefile\nsrc/lua/Makefile\nsrc/lua/internal/Makefile\ntests/Makefile\ntests/include/config.sh\nsnap/snapcraft.yaml\n])\nAC_OUTPUT\n\nAC_MSG_RESULT([===============================================================================])\nAC_MSG_RESULT([sysbench version   : ${PACKAGE_VERSION}${SB_GIT_SHA}])\nAC_MSG_RESULT([CC                 : ${CC}])\nAC_MSG_RESULT([CFLAGS             : ${CFLAGS} ${AM_CFLAGS}])\nAC_MSG_RESULT([CPPFLAGS           : ${CPPFLAGS} ${AM_CPPFLAGS}])\nAC_MSG_RESULT([LDFLAGS            : ${LDFLAGS} ${AM_LDFLAGS}])\nAC_MSG_RESULT([LIBS               : ${LIBS}])\nAC_MSG_RESULT([])\nAC_MSG_RESULT([prefix             : $(eval echo ${prefix})])\nAC_MSG_RESULT([bindir             : $(eval echo ${bindir})])\nAC_MSG_RESULT([libexecdir         : $(eval echo ${libexecdir})])\nAC_MSG_RESULT([mandir             : $(eval echo ${mandir})])\nAC_MSG_RESULT([datadir            : $(eval echo ${datadir})])\nAC_MSG_RESULT([])\nAC_MSG_RESULT([MySQL support      : ${mysql_support}])\nAC_MSG_RESULT([PostgreSQL support : ${pgsql_support}])\nAC_MSG_RESULT([])\nAC_MSG_RESULT([LuaJIT             : ${sb_use_luajit}])\nAC_MSG_RESULT([LUAJIT_CFLAGS      : ${LUAJIT_CFLAGS}])\nAC_MSG_RESULT([LUAJIT_LIBS        : ${LUAJIT_LIBS}])\nAC_MSG_RESULT([LUAJIT_LDFLAGS     : ${LUAJIT_LDFLAGS}])\nAC_MSG_RESULT([])\nAC_MSG_RESULT([Concurrency Kit    : ${sb_use_ck}])\nif test \"$sb_use_ck\" = bundled; then\n  AC_MSG_RESULT([CK_CFLAGS          : ${CK_CFLAGS}])\n  AC_MSG_RESULT([CK_LIBS            : ${CK_LIBS}])\n  AC_MSG_RESULT([configure flags    : ${CK_CONFIGURE_FLAGS}])\nfi\nAC_MSG_RESULT([===============================================================================])\n"
        },
        {
          "name": "debian",
          "type": "tree",
          "content": null
        },
        {
          "name": "install-sh",
          "type": "blob",
          "size": 6.955078125,
          "content": "#!/bin/sh\n#\n# install - install a program, script, or datafile\n#\n# This originates from X11R5 (mit/util/scripts/install.sh), which was\n# later released in X11R6 (xc/config/util/install.sh) with the\n# following copyright and license.\n#\n# Copyright (C) 1994 X Consortium\n#\n# Permission is hereby granted, free of charge, to any person obtaining a copy\n# of this software and associated documentation files (the \"Software\"), to\n# deal in the Software without restriction, including without limitation the\n# rights to use, copy, modify, merge, publish, distribute, sublicense, and/or\n# sell copies of the Software, and to permit persons to whom the Software is\n# furnished to do so, subject to the following conditions:\n#\n# The above copyright notice and this permission notice shall be included in\n# all copies or substantial portions of the Software.\n#\n# THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\n# X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN\n# AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNEC-\n# TION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n#\n# Except as contained in this notice, the name of the X Consortium shall not\n# be used in advertising or otherwise to promote the sale, use or other deal-\n# ings in this Software without prior written authorization from the X Consor-\n# tium.\n#\n#\n# FSF changes to this file are in the public domain.\n#\n# Calling this script install-sh is preferred over install.sh, to prevent\n# `make' implicit rules from creating a file called install from it\n# when there is no Makefile.\n#\n# This script is compatible with the BSD install script, but was written\n# from scratch.  It can only install one file at a time, a restriction\n# shared with many OS's install programs.\n\n\n# set DOITPROG to echo to test this script\n\n# Don't use :- since 4.3BSD and earlier shells don't like it.\ndoit=\"${DOITPROG-}\"\n\n\n# put in absolute paths if you don't have them in your path; or use env. vars.\n\nmvprog=\"${MVPROG-mv}\"\ncpprog=\"${CPPROG-cp}\"\nchmodprog=\"${CHMODPROG-chmod}\"\nchownprog=\"${CHOWNPROG-chown}\"\nchgrpprog=\"${CHGRPPROG-chgrp}\"\nstripprog=\"${STRIPPROG-strip}\"\nrmprog=\"${RMPROG-rm}\"\nmkdirprog=\"${MKDIRPROG-mkdir}\"\n\ntransformbasename=\"\"\ntransform_arg=\"\"\ninstcmd=\"$mvprog\"\nchmodcmd=\"$chmodprog 0755\"\nchowncmd=\"\"\nchgrpcmd=\"\"\nstripcmd=\"\"\nrmcmd=\"$rmprog -f\"\nmvcmd=\"$mvprog\"\nsrc=\"\"\ndst=\"\"\ndir_arg=\"\"\n\nwhile [ x\"$1\" != x ]; do\n    case $1 in\n\t-c) instcmd=$cpprog\n\t    shift\n\t    continue;;\n\n\t-d) dir_arg=true\n\t    shift\n\t    continue;;\n\n\t-m) chmodcmd=\"$chmodprog $2\"\n\t    shift\n\t    shift\n\t    continue;;\n\n\t-o) chowncmd=\"$chownprog $2\"\n\t    shift\n\t    shift\n\t    continue;;\n\n\t-g) chgrpcmd=\"$chgrpprog $2\"\n\t    shift\n\t    shift\n\t    continue;;\n\n\t-s) stripcmd=$stripprog\n\t    shift\n\t    continue;;\n\n\t-t=*) transformarg=`echo $1 | sed 's/-t=//'`\n\t    shift\n\t    continue;;\n\n\t-b=*) transformbasename=`echo $1 | sed 's/-b=//'`\n\t    shift\n\t    continue;;\n\n\t*)  if [ x\"$src\" = x ]\n\t    then\n\t\tsrc=$1\n\t    else\n\t\t# this colon is to work around a 386BSD /bin/sh bug\n\t\t:\n\t\tdst=$1\n\t    fi\n\t    shift\n\t    continue;;\n    esac\ndone\n\nif [ x\"$src\" = x ]\nthen\n\techo \"$0: no input file specified\" >&2\n\texit 1\nelse\n\t:\nfi\n\nif [ x\"$dir_arg\" != x ]; then\n\tdst=$src\n\tsrc=\"\"\n\n\tif [ -d \"$dst\" ]; then\n\t\tinstcmd=:\n\t\tchmodcmd=\"\"\n\telse\n\t\tinstcmd=$mkdirprog\n\tfi\nelse\n\n# Waiting for this to be detected by the \"$instcmd $src $dsttmp\" command\n# might cause directories to be created, which would be especially bad\n# if $src (and thus $dsttmp) contains '*'.\n\n\tif [ -f \"$src\" ] || [ -d \"$src\" ]\n\tthen\n\t\t:\n\telse\n\t\techo \"$0: $src does not exist\" >&2\n\t\texit 1\n\tfi\n\n\tif [ x\"$dst\" = x ]\n\tthen\n\t\techo \"$0: no destination specified\" >&2\n\t\texit 1\n\telse\n\t\t:\n\tfi\n\n# If destination is a directory, append the input filename; if your system\n# does not like double slashes in filenames, you may need to add some logic\n\n\tif [ -d \"$dst\" ]\n\tthen\n\t\tdst=$dst/`basename \"$src\"`\n\telse\n\t\t:\n\tfi\nfi\n\n## this sed command emulates the dirname command\ndstdir=`echo \"$dst\" | sed -e 's,[^/]*$,,;s,/$,,;s,^$,.,'`\n\n# Make sure that the destination directory exists.\n#  this part is taken from Noah Friedman's mkinstalldirs script\n\n# Skip lots of stat calls in the usual case.\nif [ ! -d \"$dstdir\" ]; then\ndefaultIFS='\n\t'\nIFS=\"${IFS-$defaultIFS}\"\n\noIFS=$IFS\n# Some sh's can't handle IFS=/ for some reason.\nIFS='%'\nset - `echo \"$dstdir\" | sed -e 's@/@%@g' -e 's@^%@/@'`\nIFS=$oIFS\n\npathcomp=''\n\nwhile [ $# -ne 0 ] ; do\n\tpathcomp=$pathcomp$1\n\tshift\n\n\tif [ ! -d \"$pathcomp\" ] ;\n        then\n\t\t$mkdirprog \"$pathcomp\"\n\telse\n\t\t:\n\tfi\n\n\tpathcomp=$pathcomp/\ndone\nfi\n\nif [ x\"$dir_arg\" != x ]\nthen\n\t$doit $instcmd \"$dst\" &&\n\n\tif [ x\"$chowncmd\" != x ]; then $doit $chowncmd \"$dst\"; else : ; fi &&\n\tif [ x\"$chgrpcmd\" != x ]; then $doit $chgrpcmd \"$dst\"; else : ; fi &&\n\tif [ x\"$stripcmd\" != x ]; then $doit $stripcmd \"$dst\"; else : ; fi &&\n\tif [ x\"$chmodcmd\" != x ]; then $doit $chmodcmd \"$dst\"; else : ; fi\nelse\n\n# If we're going to rename the final executable, determine the name now.\n\n\tif [ x\"$transformarg\" = x ]\n\tthen\n\t\tdstfile=`basename \"$dst\"`\n\telse\n\t\tdstfile=`basename \"$dst\" $transformbasename |\n\t\t\tsed $transformarg`$transformbasename\n\tfi\n\n# don't allow the sed command to completely eliminate the filename\n\n\tif [ x\"$dstfile\" = x ]\n\tthen\n\t\tdstfile=`basename \"$dst\"`\n\telse\n\t\t:\n\tfi\n\n# Make a couple of temp file names in the proper directory.\n\n\tdsttmp=$dstdir/_inst.$$_\n\trmtmp=$dstdir/_rm.$$_\n\n# Trap to clean up temp files at exit.\n\n\ttrap 'status=$?; rm -f \"$dsttmp\" \"$rmtmp\" && exit $status' 0\n\ttrap '(exit $?); exit' 1 2 13 15\n\n# Move or copy the file name to the temp name\n\n\t$doit $instcmd \"$src\" \"$dsttmp\" &&\n\n# and set any options; do chmod last to preserve setuid bits\n\n# If any of these fail, we abort the whole thing.  If we want to\n# ignore errors from any of these, just make sure not to ignore\n# errors from the above \"$doit $instcmd $src $dsttmp\" command.\n\n\tif [ x\"$chowncmd\" != x ]; then $doit $chowncmd \"$dsttmp\"; else :;fi &&\n\tif [ x\"$chgrpcmd\" != x ]; then $doit $chgrpcmd \"$dsttmp\"; else :;fi &&\n\tif [ x\"$stripcmd\" != x ]; then $doit $stripcmd \"$dsttmp\"; else :;fi &&\n\tif [ x\"$chmodcmd\" != x ]; then $doit $chmodcmd \"$dsttmp\"; else :;fi &&\n\n# Now remove or move aside any old file at destination location.  We try this\n# two ways since rm can't unlink itself on some systems and the destination\n# file might be busy for other reasons.  In this case, the final cleanup\n# might fail but the new file should still install successfully.\n\n{\n\tif [ -f \"$dstdir/$dstfile\" ]\n\tthen\n\t\t$doit $rmcmd -f \"$dstdir/$dstfile\" 2>/dev/null ||\n\t\t$doit $mvcmd -f \"$dstdir/$dstfile\" \"$rmtmp\" 2>/dev/null ||\n\t\t{\n\t\t  echo \"$0: cannot unlink or rename $dstdir/$dstfile\" >&2\n\t\t  (exit 1); exit\n\t\t}\n\telse\n\t\t:\n\tfi\n} &&\n\n# Now rename the file to the real destination.\n\n\t$doit $mvcmd \"$dsttmp\" \"$dstdir/$dstfile\"\n\nfi &&\n\n# The final little trick to \"correctly\" pass the exit status to the exit trap.\n\n{\n\t(exit 0); exit\n}\n"
        },
        {
          "name": "m4",
          "type": "tree",
          "content": null
        },
        {
          "name": "missing",
          "type": "blob",
          "size": 10.025390625,
          "content": "#! /bin/sh\n# Common stub for a few missing GNU programs while installing.\n# Copyright (C) 1996, 1997, 1999, 2000, 2002, 2003 Free Software Foundation, Inc.\n# Originally by Fran,cois Pinard <pinard@iro.umontreal.ca>, 1996.\n\n# This program is free software; you can redistribute it and/or modify\n# it under the terms of the GNU General Public License as published by\n# the Free Software Foundation; either version 2, or (at your option)\n# any later version.\n\n# This program is distributed in the hope that it will be useful,\n# but WITHOUT ANY WARRANTY; without even the implied warranty of\n# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n# GNU General Public License for more details.\n\n# You should have received a copy of the GNU General Public License\n# along with this program; if not, write to the Free Software\n# Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA\n# 02111-1307, USA.\n\n# As a special exception to the GNU General Public License, if you\n# distribute this file as part of a program that contains a\n# configuration script generated by Autoconf, you may include it under\n# the same distribution terms that you use for the rest of that program.\n\nif test $# -eq 0; then\n  echo 1>&2 \"Try \\`$0 --help' for more information\"\n  exit 1\nfi\n\nrun=:\n\n# In the cases where this matters, `missing' is being run in the\n# srcdir already.\nif test -f configure.ac; then\n  configure_ac=configure.ac\nelse\n  configure_ac=configure.in\nfi\n\ncase \"$1\" in\n--run)\n  # Try to run requested program, and just exit if it succeeds.\n  run=\n  shift\n  \"$@\" && exit 0\n  ;;\nesac\n\n# If it does not exist, or fails to run (possibly an outdated version),\n# try to emulate it.\ncase \"$1\" in\n\n  -h|--h|--he|--hel|--help)\n    echo \"\\\n$0 [OPTION]... PROGRAM [ARGUMENT]...\n\nHandle \\`PROGRAM [ARGUMENT]...' for when PROGRAM is missing, or return an\nerror status if there is no known handling for PROGRAM.\n\nOptions:\n  -h, --help      display this help and exit\n  -v, --version   output version information and exit\n  --run           try to run the given command, and emulate it if it fails\n\nSupported PROGRAM values:\n  aclocal      touch file \\`aclocal.m4'\n  autoconf     touch file \\`configure'\n  autoheader   touch file \\`config.h.in'\n  automake     touch all \\`Makefile.in' files\n  bison        create \\`y.tab.[ch]', if possible, from existing .[ch]\n  flex         create \\`lex.yy.c', if possible, from existing .c\n  help2man     touch the output file\n  lex          create \\`lex.yy.c', if possible, from existing .c\n  makeinfo     touch the output file\n  tar          try tar, gnutar, gtar, then tar without non-portable flags\n  yacc         create \\`y.tab.[ch]', if possible, from existing .[ch]\"\n    ;;\n\n  -v|--v|--ve|--ver|--vers|--versi|--versio|--version)\n    echo \"missing 0.4 - GNU automake\"\n    ;;\n\n  -*)\n    echo 1>&2 \"$0: Unknown \\`$1' option\"\n    echo 1>&2 \"Try \\`$0 --help' for more information\"\n    exit 1\n    ;;\n\n  aclocal*)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified \\`acinclude.m4' or \\`${configure_ac}'.  You might want\n         to install the \\`Automake' and \\`Perl' packages.  Grab them from\n         any GNU archive site.\"\n    touch aclocal.m4\n    ;;\n\n  autoconf)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified \\`${configure_ac}'.  You might want to install the\n         \\`Autoconf' and \\`GNU m4' packages.  Grab them from any GNU\n         archive site.\"\n    touch configure\n    ;;\n\n  autoheader)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified \\`acconfig.h' or \\`${configure_ac}'.  You might want\n         to install the \\`Autoconf' and \\`GNU m4' packages.  Grab them\n         from any GNU archive site.\"\n    files=`sed -n 's/^[ ]*A[CM]_CONFIG_HEADER(\\([^)]*\\)).*/\\1/p' ${configure_ac}`\n    test -z \"$files\" && files=\"config.h\"\n    touch_files=\n    for f in $files; do\n      case \"$f\" in\n      *:*) touch_files=\"$touch_files \"`echo \"$f\" |\n\t\t\t\t       sed -e 's/^[^:]*://' -e 's/:.*//'`;;\n      *) touch_files=\"$touch_files $f.in\";;\n      esac\n    done\n    touch $touch_files\n    ;;\n\n  automake*)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified \\`Makefile.am', \\`acinclude.m4' or \\`${configure_ac}'.\n         You might want to install the \\`Automake' and \\`Perl' packages.\n         Grab them from any GNU archive site.\"\n    find . -type f -name Makefile.am -print |\n\t   sed 's/\\.am$/.in/' |\n\t   while read f; do touch \"$f\"; done\n    ;;\n\n  autom4te)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is needed, and you do not seem to have it handy on your\n         system.  You might have modified some files without having the\n         proper tools for further handling them.\n         You can get \\`$1' as part of \\`Autoconf' from any GNU\n         archive site.\"\n\n    file=`echo \"$*\" | sed -n 's/.*--output[ =]*\\([^ ]*\\).*/\\1/p'`\n    test -z \"$file\" && file=`echo \"$*\" | sed -n 's/.*-o[ ]*\\([^ ]*\\).*/\\1/p'`\n    if test -f \"$file\"; then\n\ttouch $file\n    else\n\ttest -z \"$file\" || exec >$file\n\techo \"#! /bin/sh\"\n\techo \"# Created by GNU Automake missing as a replacement of\"\n\techo \"#  $ $@\"\n\techo \"exit 0\"\n\tchmod +x $file\n\texit 1\n    fi\n    ;;\n\n  bison|yacc)\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified a \\`.y' file.  You may need the \\`Bison' package\n         in order for those modifications to take effect.  You can get\n         \\`Bison' from any GNU archive site.\"\n    rm -f y.tab.c y.tab.h\n    if [ $# -ne 1 ]; then\n        eval LASTARG=\"\\${$#}\"\n\tcase \"$LASTARG\" in\n\t*.y)\n\t    SRCFILE=`echo \"$LASTARG\" | sed 's/y$/c/'`\n\t    if [ -f \"$SRCFILE\" ]; then\n\t         cp \"$SRCFILE\" y.tab.c\n\t    fi\n\t    SRCFILE=`echo \"$LASTARG\" | sed 's/y$/h/'`\n\t    if [ -f \"$SRCFILE\" ]; then\n\t         cp \"$SRCFILE\" y.tab.h\n\t    fi\n\t  ;;\n\tesac\n    fi\n    if [ ! -f y.tab.h ]; then\n\techo >y.tab.h\n    fi\n    if [ ! -f y.tab.c ]; then\n\techo 'main() { return 0; }' >y.tab.c\n    fi\n    ;;\n\n  lex|flex)\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified a \\`.l' file.  You may need the \\`Flex' package\n         in order for those modifications to take effect.  You can get\n         \\`Flex' from any GNU archive site.\"\n    rm -f lex.yy.c\n    if [ $# -ne 1 ]; then\n        eval LASTARG=\"\\${$#}\"\n\tcase \"$LASTARG\" in\n\t*.l)\n\t    SRCFILE=`echo \"$LASTARG\" | sed 's/l$/c/'`\n\t    if [ -f \"$SRCFILE\" ]; then\n\t         cp \"$SRCFILE\" lex.yy.c\n\t    fi\n\t  ;;\n\tesac\n    fi\n    if [ ! -f lex.yy.c ]; then\n\techo 'main() { return 0; }' >lex.yy.c\n    fi\n    ;;\n\n  help2man)\n    if test -z \"$run\" && ($1 --version) > /dev/null 2>&1; then\n       # We have it, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n\t you modified a dependency of a manual page.  You may need the\n\t \\`Help2man' package in order for those modifications to take\n\t effect.  You can get \\`Help2man' from any GNU archive site.\"\n\n    file=`echo \"$*\" | sed -n 's/.*-o \\([^ ]*\\).*/\\1/p'`\n    if test -z \"$file\"; then\n\tfile=`echo \"$*\" | sed -n 's/.*--output=\\([^ ]*\\).*/\\1/p'`\n    fi\n    if [ -f \"$file\" ]; then\n\ttouch $file\n    else\n\ttest -z \"$file\" || exec >$file\n\techo \".ab help2man is required to generate this page\"\n\texit 1\n    fi\n    ;;\n\n  makeinfo)\n    if test -z \"$run\" && (makeinfo --version) > /dev/null 2>&1; then\n       # We have makeinfo, but it failed.\n       exit 1\n    fi\n\n    echo 1>&2 \"\\\nWARNING: \\`$1' is missing on your system.  You should only need it if\n         you modified a \\`.texi' or \\`.texinfo' file, or any other file\n         indirectly affecting the aspect of the manual.  The spurious\n         call might also be the consequence of using a buggy \\`make' (AIX,\n         DU, IRIX).  You might want to install the \\`Texinfo' package or\n         the \\`GNU make' package.  Grab either from any GNU archive site.\"\n    file=`echo \"$*\" | sed -n 's/.*-o \\([^ ]*\\).*/\\1/p'`\n    if test -z \"$file\"; then\n      file=`echo \"$*\" | sed 's/.* \\([^ ]*\\) *$/\\1/'`\n      file=`sed -n '/^@setfilename/ { s/.* \\([^ ]*\\) *$/\\1/; p; q; }' $file`\n    fi\n    touch $file\n    ;;\n\n  tar)\n    shift\n    if test -n \"$run\"; then\n      echo 1>&2 \"ERROR: \\`tar' requires --run\"\n      exit 1\n    fi\n\n    # We have already tried tar in the generic part.\n    # Look for gnutar/gtar before invocation to avoid ugly error\n    # messages.\n    if (gnutar --version > /dev/null 2>&1); then\n       gnutar \"$@\" && exit 0\n    fi\n    if (gtar --version > /dev/null 2>&1); then\n       gtar \"$@\" && exit 0\n    fi\n    firstarg=\"$1\"\n    if shift; then\n\tcase \"$firstarg\" in\n\t*o*)\n\t    firstarg=`echo \"$firstarg\" | sed s/o//`\n\t    tar \"$firstarg\" \"$@\" && exit 0\n\t    ;;\n\tesac\n\tcase \"$firstarg\" in\n\t*h*)\n\t    firstarg=`echo \"$firstarg\" | sed s/h//`\n\t    tar \"$firstarg\" \"$@\" && exit 0\n\t    ;;\n\tesac\n    fi\n\n    echo 1>&2 \"\\\nWARNING: I can't seem to be able to run \\`tar' with the given arguments.\n         You may want to install GNU tar or Free paxutils, or check the\n         command line arguments.\"\n    exit 1\n    ;;\n\n  *)\n    echo 1>&2 \"\\\nWARNING: \\`$1' is needed, and you do not seem to have it handy on your\n         system.  You might have modified some files without having the\n         proper tools for further handling them.  Check the \\`README' file,\n         it often tells you about the needed prerequisites for installing\n         this package.  You may also peek at any GNU archive site, in case\n         some other package would contain this missing \\`$1' program.\"\n    exit 1\n    ;;\nesac\n\nexit 0\n"
        },
        {
          "name": "mkinstalldirs",
          "type": "blob",
          "size": 1.94140625,
          "content": "#! /bin/sh\n# mkinstalldirs --- make directory hierarchy\n# Author: Noah Friedman <friedman@prep.ai.mit.edu>\n# Created: 1993-05-16\n# Public domain\n\nerrstatus=0\ndirmode=\"\"\n\nusage=\"\\\nUsage: mkinstalldirs [-h] [--help] [-m mode] dir ...\"\n\n# process command line arguments\nwhile test $# -gt 0 ; do\n  case $1 in\n    -h | --help | --h*)         # -h for help\n      echo \"$usage\" 1>&2\n      exit 0\n      ;;\n    -m)                         # -m PERM arg\n      shift\n      test $# -eq 0 && { echo \"$usage\" 1>&2; exit 1; }\n      dirmode=$1\n      shift\n      ;;\n    --)                         # stop option processing\n      shift\n      break\n      ;;\n    -*)                         # unknown option\n      echo \"$usage\" 1>&2\n      exit 1\n      ;;\n    *)                          # first non-opt arg\n      break\n      ;;\n  esac\ndone\n\nfor file\ndo\n  if test -d \"$file\"; then\n    shift\n  else\n    break\n  fi\ndone\n\ncase $# in\n  0) exit 0 ;;\nesac\n\ncase $dirmode in\n  '')\n    if mkdir -p -- . 2>/dev/null; then\n      echo \"mkdir -p -- $*\"\n      exec mkdir -p -- \"$@\"\n    fi\n    ;;\n  *)\n    if mkdir -m \"$dirmode\" -p -- . 2>/dev/null; then\n      echo \"mkdir -m $dirmode -p -- $*\"\n      exec mkdir -m \"$dirmode\" -p -- \"$@\"\n    fi\n    ;;\nesac\n\nfor file\ndo\n  set fnord `echo \":$file\" | sed -ne 's/^:\\//#/;s/^://;s/\\// /g;s/^#/\\//;p'`\n  shift\n\n  pathcomp=\n  for d\n  do\n    pathcomp=\"$pathcomp$d\"\n    case $pathcomp in\n      -*) pathcomp=./$pathcomp ;;\n    esac\n\n    if test ! -d \"$pathcomp\"; then\n      echo \"mkdir $pathcomp\"\n\n      mkdir \"$pathcomp\" || lasterr=$?\n\n      if test ! -d \"$pathcomp\"; then\n  \terrstatus=$lasterr\n      else\n  \tif test ! -z \"$dirmode\"; then\n\t  echo \"chmod $dirmode $pathcomp\"\n    \t  lasterr=\"\"\n  \t  chmod \"$dirmode\" \"$pathcomp\" || lasterr=$?\n\n  \t  if test ! -z \"$lasterr\"; then\n  \t    errstatus=$lasterr\n  \t  fi\n  \tfi\n      fi\n    fi\n\n    pathcomp=\"$pathcomp/\"\n  done\ndone\n\nexit $errstatus\n\n# Local Variables:\n# mode: shell-script\n# sh-indentation: 2\n# End:\n# mkinstalldirs ends here\n"
        },
        {
          "name": "rpm",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "snap",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "third_party",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}