{
  "metadata": {
    "timestamp": 1736566274871,
    "page": 23,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "scottbez1/smartknob",
      "stars": 19743,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.4384765625,
          "content": "# KiCAD files\n*.000\n*.bak\n*.bck\n*.kicad_pcb-bak\n*.sch-bak\n*.net\n*.dsn\nfp-info-cache\n_autosave*.kicad_pcb\n*.kicad_prl\nelectronics/*/*backups\n\n# Proprietary 3d model (for KiCAD)\n**/proprietary/*.stp\n**/proprietary/*.step\n\n# PlatformIO\n.pio/\n\n# General build outputs\nbuild/\n\n# Apple/Macintosh\n.DS_Store\n\n# VSCode\n.vscode/*\n!.vscode/settings.json\n!.vscode/tasks.json\n#!.vscode/launch.json\n!.vscode/extensions.json\n!.vscode/*.code-snippets\n\n__pycache__\n\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.095703125,
          "content": "[submodule \"thirdparty/nanopb\"]\n\tpath = thirdparty/nanopb\n\turl = git@github.com:nanopb/nanopb.git\n"
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 11.677734375,
          "content": "   smartknob - Copyright 2022 Scott Bezek\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n----\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 22.1162109375,
          "content": "# SmartKnob\nSmartKnob is an open-source input device with software-configurable endstops and virtual detents.\n\nA brushless gimbal motor is paired with a magnetic encoder to provide closed-loop torque feedback control, making it\npossible to dynamically create and adjust the feel of detents and endstops.\n\nJoin the [Discord community](https://discord.gg/5jyhjcbTnR) to discuss the project with others, show off your build, or help answer each others' questions!\n\n[![Build Status](https://github.com/scottbez1/smartknob/actions/workflows/electronics.yml/badge.svg?branch=master)](https://github.com/scottbez1/smartknob/actions/workflows/electronics.yml)\n[![Build Status](https://github.com/scottbez1/smartknob/actions/workflows/pio.yml/badge.svg?branch=master)](https://github.com/scottbez1/smartknob/actions/workflows/pio.yml)\n\n# Designs\n\n## SmartKnob View\nThe \"SmartKnob View\" is the premium SmartKnob experience with an integrated display shown in my [demo video](https://www.youtube.com/watch?v=ip641WmY4pA). Under active development.\n\n🎉 **Motors are [now available](https://www.sparkfun.com/products/20441)!** If you've been following this project,\nyou'll know that the recommended motors went out of stock nearly immediately after it was published.\nThanks to [the community](https://github.com/scottbez1/smartknob/issues/16#issuecomment-1094482805%5D), we were able to\nidentify the likely original manufacturer, and recently SparkFun Electronics has been getting them produced and regularly\n[stocking them](https://www.sparkfun.com/products/20441)! (However, they've been selling out quickly each time they restock, so definitely sign up for backorder notifications if they're out of stock when you check). Thanks to everyone who helped search and investigate different\nmotor options along the way!\n\nFeatures:\n - 240x240 round LCD (\"GC9A01\"), protected by 39.5mm watch glass on rotor\n - BLDC gimbal motor, with a hollow shaft for mechanically & electrically connecting the LCD\n - Powered by ESP32-PICO-V3-02 (Lilygo TMicro32 Plus module)\n - PCB flexure and SMD resistors used as strain gauges for press detection (haptic feedback provided via the motor)\n - 8 side-firing RGB LEDs (SK6812-SIDE-A) illuminate ring around the knob\n - USB-C (2.0) connector for 5V power and serial data/programming (CH340)\n - VEML7700 ambient light sensor for automatic backlight & LED intensity adjustment\n - Versatile back plate for mounting - use either 4x screws, or 2x 3M medium Command strips (with cutouts for accessing removal tabs after installation)\n - Front cover snaps on for easy access to the PCB\n\n**Current status:** Not recommended for general use, but may be a fun project for an advanced electronics hobbyist.\n\n### Demo video\n\n<a href=\"https://www.youtube.com/watch?v=ip641WmY4pA\">\n    <img src=\"https://img.youtube.com/vi/ip641WmY4pA/maxresdefault.jpg\" width=\"480\" />\n</a>\n\n### How it works\n<a href=\"https://www.youtube.com/watch?v=Q76dMggUH1M\">\n    <img src=\"https://img.youtube.com/vi/Q76dMggUH1M/maxresdefault.jpg\" width=\"480\" />\n</a>\n\n### 3D CAD\n\n![Exploded view](doc/img/explodedv145.gif)\n\nLatest Fusion 360 Model: https://a360.co/3BzkU0n\n\n\n#### DEMO: video editor timeline control\n\nIf you edit audio/video, imagine having a jog wheel where you could _feel_ the clip boundaries as you scrolled through the timeline. Then switch to playback speed control, with a wheel that's spring-loaded to return to \"paused,\" with snaps at 1x, 2x, 4x, etc. The SmartKnob can do this; it just needs some software integrations to be written. Check out a demo using a SmartKnob prototype to control a mock video timeline:\n\n<a href=\"https://www.youtube.com/watch?v=J9192DfZplk\">\n    <img src=\"https://img.youtube.com/vi/J9192DfZplk/maxresdefault.jpg\" width=\"480\" />\n</a>\n\n(you can actually try this demo yourself if you've already built a SmartKnob; plug it in over USB and go to https://scottbez1.github.io/smartknob/)\n\n### Build your own?\n\nWhile this is a \"DIY\" open-source project, it is not yet a mature plug-and-play project. If you intend to build your own, note that it requires advanced soldering experience to build - very small-pitch surface-mount soldering is required (reflow or hot air recommended), and assembly is quite time-consuming and delicate. Please go into it with the expectation that you will almost certainly need to be able to troubleshoot some hardware and firmware issues yourself - I recommend reviewing/understanding the schematics and basic firmware before jumping in!\n\nMore documentation on the BOM and what parts you need to order is coming in the future - thanks so much for your interest! Follow me on [Twitter](https://twitter.com/scottbez1) for the latest updates on this and other projects.\n\nView the latest auto-generated (untested) [Base PCB Interactive BOM](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-ibom.html) and [Screen PCB Interactive BOM](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-ibom.html) (or, the combined [BOM csv](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-bom.csv)) for electronics/hardware parts list. ⚠️ These are auto-generated from the latest untested revision on GitHub. For tested/stable/recommended artifacts, use a [release](https://github.com/scottbez1/smartknob/releases) instead.\n\nA few miscellaneous notes in the meantime:\n\n - There's limited space inside the LCD mount for wiring, and 8 wires need to fit through the hole in the center. I used 30 AWG wire-wrapping wire. Enamel-coated wire would probably work too.\n - Older versions of the design (as seen in the videos) used glued-on BF350-3AA strain gauges to detect presses; in v0.5 these were replaced with footprints for SMD resistors, which exhibit similar properties when stretched/compressed and are much easier to assemble. \n - The TMC6300 is _tiny_ and has a bottom pad, so I would seriously consider getting a stencil along with the PCB order. Even with the stencil I needed to manually clean up some bridging afterward; I _highly_ recommend Chip Quik NC191 gel flux, available on [Amazon](https://amzn.to/3MGDSr5) (or use this [non-affiliate link](https://www.amazon.com/Smooth-Flow-No-Clean-syringe-plunger/dp/B08KJPG3NZ) instead) or from your electronics distributor of choice. Flux is also very helpful when soldering the LCD ribbon cable to to screen PCB.\n - For breadboard prototyping, the [TMC6300-BOB](https://www.trinamic.com/support/eval-kits/details/tmc6300-bob/) or SparkFun's [TMC6300 driver board](https://www.sparkfun.com/products/21867) are awesome and way easier to work with than the bare chip if you just want to play around with low current BLDC motors\n - For AliExpress purchases: I highly recommend **only** using AliExpress Standard Shipping (purchasing in the US). I have had multiple purchases take months or never get delivered when purchased with Cainiao or other low cost shipping options, whereas AliExpress Standard is very reliable and generally faster in my experience.\n - Make sure to check the [open issues](https://github.com/scottbez1/smartknob/issues) - this design is not yet \"stable\", so beware that everything may not go smoothly.\n\nFuture plans:\n - consider switch to using an ESP32-S3-MINI-1 module\n - get wifi configured and working (probably MQTT?). Currently memory is an issue with the full display framebuffer sprite. PSRAM might fix this (requires newer ESP-IDF & unreleased Arduino core, and from a brief test I got horrible performance with PSRAM enabled), or the next item might help reduce memory:\n - migrate to LVGL, for better display rendering and easy support for menus, etc. Shouldn't require a full 240x240x24b framebuffer in memory, freeing some for wifi, etc.\n - Home Assistant integration, or other real-world applications\n - ???\n - [Profit](https://github.com/sponsors/scottbez1/) 😉\n\n#### Already built one?\nCheck out the [firmware/software documentation](https://paper.dropbox.com/doc/SmartKnob-firmware-and-software--B_oWj~L1dXqHgAqqYmhwwuqzAg-VUb9nq7btuhnHw5KlgJIH)\nfor tips on getting it programmed and hooking it up to your own software integrations.\n\nIf you've already uploaded the standard firmware and gone through the calibration process (see guide linked above if you don't know what this means),\ngo to https://scottbez1.github.io/smartknob/ to try out an interactive web-based demo that uses Web Serial to talk to a SmartKnob that's plugged into your\ncomputer's USB port!\n\n#### Base PCB\n\n<a href=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-front-3d.png\">\n    <img src=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-front-3d.png\" width=\"300\" />\n</a>\n<a href=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-back-3d.png\">\n    <img src=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-back-3d.png\" width=\"300\" />\n</a>\n\nOrdering notes: use white soldermask, for reflecting light from RGB LED ring around the knob. Should be 1.2mm thick (not \"standard\" 1.6mm).\n\nIf you are ordering a stencil for solder paste from JLCPCB and plan to apply paste by hand (as\n[shown in the video](https://youtu.be/Q76dMggUH1M?t=372)) without a stencil frame/machine, make sure to select\n**\"Customized size\"** and enter smaller dimensions (e.g. 100mm x 100mm) to avoid getting a much larger stencil than you\nneed. This will also likely reduce the cost of shipping substantially! Also, select only the **Top** side; the bottom\nonly has 2 SMT components - the motor connector and VEML7700 ALS - so it's not worth getting a stencil for that.\n\nLatest auto-generated (untested and likely broken!) artifacts⚠️:\n\n[Schematic](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-schematic.pdf)\n\n[Interactive BOM](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-ibom.html)\n\n[PCB Packet](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-pcb-packet.pdf)\n\n[Gerbers](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_base-jlc/gerbers.zip)\n\n⚠️ For tested/stable/recommended artifacts, use a [release](https://github.com/scottbez1/smartknob/releases) instead.\n\n#### Screen PCB\n\n<a href=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-front-3d.png\">\n    <img src=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-front-3d.png\" width=\"300\" />\n</a>\n<a href=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-back-3d.png\">\n    <img src=\"https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-back-3d.png\" width=\"300\" />\n</a>\n\nOrdering notes: Must be 1.2mm thick (not \"standard\" 1.6mm) per mechanical design. (The PCB silkscreen mentions 0.6mm thickness - this is the thickness of the **VHB tape** for adhering the LCD; the PCB should be 1.2mm thick)\n\nThere are few enough components on the Screen PCB that I chose to hand-solder them rather than reflow with solder paste\nand a stencil, but if you order a stencil, see the note above about selecting a \"Customized size\" to be easier to\nhandle and save on shipping. Also make sure to select the **Bottom** side only; all the components are on the bottom\nside of the screen PCB.\n\nLatest auto-generated (untested and likely broken!) artifacts⚠️:\n\n[Schematic](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-schematic.pdf)\n\n[Interactive BOM](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-ibom.html)\n\n[PCB Packet](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-pcb-packet.pdf)\n\n[Gerbers](https://smartknob-artifacts.s3.us-west-1.amazonaws.com/master/electronics/view_screen-jlc/gerbers.zip)\n\n⚠️ For tested/stable/recommended artifacts, use a [release](https://github.com/scottbez1/smartknob/releases) instead.\n\n#### Printed parts\nYou will need six printed parts. The current stable designs can be found as STL assets in the [v185 mechanical release](https://github.com/scottbez1/smartknob/releases/tag/releases%2Fmechanical%2Fv185-dummy-tag) or you can export the latest untested designs from the CAD model by opening it in Fusion 360: https://a360.co/3BzkU0n\n\nThe parts can _probably_ be FDM 3D printed with a well-tuned printer, but the parts shown in videos/photos were MJF printed in nylon for tight tolerances and better surface finish. \n\nIf you wanted a simpler build, you could omit the LCD and just merge the knob + glass from the model into a single STL to get a closed-top knob.\n\nExport and print the following 6 parts:\n* `Enclosure`\n* `Knob` (RotorAssembly->KnobAssembly->Knob)\n* `ScreenPlatform`\n* `RotorSpacer` (RotorAssembly->RotorSpacer)\n* `MountBase`\n* `BackPlate`\n\n⚠️ If you opt to go for MJF Nylon printing from JLCPCB, their system may complain about `< 0.8mm wall thickness detected` on the `MountBase`, `ScreenPlatform` and `RotorSpacer` parts. This appears to be a false positive, possibly on some of the print tapers. You should be able to ignore this, as all print orders at JLCPCB are subject to a final manual review, and they will contact you by email if there are any job-stopping issues or risks with your prints.\n\n## NanoFOC (3rd party)\nIf you're looking to tinker with FOC/haptic feedback, but don't want to build a full SmartKnob View yourself, I can\nrecommend the NanoFOC DevKit++, an [open-source design](https://github.com/katbinaris/nanofoc_devkit) made and\n[sold](https://store.binaris.io/products/nanofoc-devkit) by a member of the SmartKnob community! It's super compact\nand is a great testbed or core for building your own BLDC-based haptic input device.\n\n![Image of the NanoFOC PCB](https://cdn.shopify.com/s/files/1/0729/7433/6335/products/IMG_20230418_120554-01.jpg?width=416)\n\n\nThe NanoFOC uses an ESP32-S3, and the SmartKnob firmware works on it out of the box; just select the `nanofoc`\nenvironment in PlatformIO rather than the `view` environment when uploading.\n\n# Frequently Asked Questions (FAQ)\n\n### Can I use this cheap gimbal BLDC motor I found on AliExpress?\n\nI can't stop you, but I will caution that **you probably won't be super happy with it** depending on your intended application.\n\nNearly every off-the-shelf BLDC gimbal motor that the community has tested (which is pretty much ALL the cheap ones you'll find on AliExpress, trust me) has\n_moderate to severge cogging_. That means the motor wants to snap to certain positions by itself even when unpowered. This means you won't be able to get\ncompletely smooth rotation when virtual detents are turned off, and the motor's cogging may interfere with or overpower the virtual detents, particularly if\nyou set them to lower strength or make then very fine-grained.\n\nThe recommended motor is definitely the best (i.e. lowest cogging) off-the-shelf motor we've come across so far, and is the only readily-available motor\nthat I would consider \"good\" for this application.\n\nIf you've found another motor that is completely smooth when unpowered, we'd LOVE to hear about it in the discord; if you're wondering about some cheap motor\nyou saw online, either just order one and try it for yourself, or ask about it in discord but don't be surprised (or offended) if the response you get is\nsomething terse like \"nope, no good\".\n\n### How much does it cost?\n\nI wish I could tell you now, but I don't actually know off the top of my head. Check back soon - I've only built a few so far, which was the result of a bunch of tinkering and prototyping over an extended period, so I don't have all the expenses tallied up yet. Probably less than $200 in parts? But some items have gotten more expensive, and you may be limited by minimum order quantities or shipping charges from multiple separate suppliers.\n\n### Does it work with XYZ?\n\nNot yet, regardless of whatever \"XYZ\" you're thinking of. So far I've only implemented enough firmware for the demo shown in the video, so you can't actually use it for anything productive yet. The basic detent configuration API is there, but not much else. Lots of firmware work remains to be done. If you build one, I'd love your help adding support for \"XYZ\" though!\n\n### Can I buy one as a kit or already assembled?\n\nProbably not? Or at least, I don't have any immediate plans to sell them myself. It's not that I don't want you to be happy, but hardware is a hard business and I just work on this stuff in my free time.\n\nIt's open source with a fairly permissive license though, so in theory anyone could start offering kits/assemblies. If someone does go down that route of selling them, note that attribution is\n _required_ (and I wouldn't say no to [royalties/tips/thanks](https://github.com/sponsors/scottbez1/) if you're in a giving mood 🙂).\n\n# Firmware and Software\nMore extensive documentation of the firmware and software (and how to get started) can be found in the dedicated [SmartKnob Firmware and Software Guide](https://paper.dropbox.com/doc/SmartKnob-firmware-and-software--Byho6npe9XvZLZLxJ_8bK5TqAg-VUb9nq7btuhnHw5KlgJIH#:h2=Calibration)\n\n## General Component Info\n\n### Magnetic encoders\n\n#### MT6701 (MagnTek)\nExcellent sensor at a reasonable price - highly recommended. Less noisy than TLV493D, and more responsive (control loop is more stable) using SSI.\n\n - Lots of IO options - SSI, I2C, and ABZ - should offer good response latency\n - SSI includes CRC to validate data\n - No power-down or low-power options - may not be ideal for battery-powered devices\n - Not available from US distributors (Mouser, Digi-Key)\n\n[Datasheet](http://www.magntek.com.cn/upload/MT6701_Rev.1.5.pdf)\n\n[Ordering (LCSC)](https://lcsc.com/product-detail/Angle-Linear-Position-Sensors_Magn-Tek-MT6701CT-STD_C2856764.html)\n\n#### TLV493D (Infineon)\nNot used in the SmartKnob view, but a common/popular magnetic encoder in general. It's a mediocre choice for a haptic feedback implementation. Easy to prototype with using [Adafruit's QWIIC breakout board](https://www.adafruit.com/product/4366).\n\nIn my testing, it's noisy, requiring filtering/smoothing that can slow responsiveness, hurting control loop stability. Or, with less filtering, the noise\ncan easily be \"amplified\" by the derivative component in the PID motor torque controller, causing audible (and tactile) humming/buzzing.\n\nBut the bigger issue is that there is apparently a known silicon issue that causes the internal ADC to sometimes completely lock up, requiring a full reset and re-configuration, which can cause delays/gaps in data! See section\n5.6 in the [User Manual](https://www.infineon.com/dgdl/Infineon-TLV493D-A1B6_3DMagnetic-UM-v01_03-EN.pdf?fileId=5546d46261d5e6820161e75721903ddd)\n\n    In the Master Controlled Mode (MCM) or the Fast Mode (FM) the ADC conversion may hang up. A hang up can\n    be detected by:\n     - Frame Counter (FRM) counter stucks and does not increment anymore.\n\nIn my experience testing 4 different Adafruit breakout boards, 2 of them (50%) regularly exhibit this lockup behavior within a minute or two of use. It is possible to detect and auto-reset (and there is code in the project to do so), but it is slow and may cause undesirable jumps/delays if the sensor locks up often.\n\n[Datasheet](https://www.mouser.com/datasheet/2/196/Infineon_TLV493D_A1B6_DataSheet_v01_10_EN-1227967.pdf)\n\n\n#### AS5600 (AMS)\nA mediocre choice. Cheap breakout boards are readily available.\n\nIn my testing, it's fairly noisy (anecdotally, noisier than the TLV493d), requiring filtering/smoothing that can slow responsiveness, hurting control loop stability. Additionally, it saturates at a lower magnetic field strength than other sensors I tested, requiring a significant air gap (8-10mm) when used with a strong neodymium diametric magnet like [Radial Magnets 8995](https://www.digikey.com/en/products/detail/radial-magnets-inc/8995/5126077).\n\n[Datasheet](https://ams.com/documents/20143/36005/AS5600_DS000365_5-00.pdf)\n\n### Motor drivers\n#### TMC6300-LA\nThis is a relatively new IC and it's a perfect match! There generally aren't any other drivers (with integrated fets) that meet the requirements for the low-voltage and low-current motors used in this project (DRV8316 might work, but has not been tested).\n\nHighlights:\n - 2-11V DC motor supply input\n - Up to 1.2A RMS\n - Tiny (3x3mm QFN)\n\n [Datasheet](https://www.trinamic.com/fileadmin/assets/Products/ICs_Documents/TMC6300_datasheet_rev1.07.pdf)\n\n [Product page](https://www.trinamic.com/products/integrated-circuits/details/tmc6300-la/)\n\n### Motors\n#### 32mm Rotor, Hollow Shaft, Diametric magnet\n<a href=\"doc/img/motors/PXL_20220121_221746595.jpg\"><img src=\"doc/img/motors/PXL_20220121_221746595.jpg\" width=\"200\" /></a>\n<a href=\"doc/img/motors/PXL_20220121_221738745.jpg\"><img src=\"doc/img/motors/PXL_20220121_221738745.jpg\" width=\"200\" /></a>\n\n\n- 32mm rotor\n- 15mm overall height (including magnet), 12.75mm height w/o magnet, 9mm rotor height\n- low/zero cogging - excellent for completely smooth input\n- 5.9mm hollow shaft\n- built-in diametric magnet for encoder\n- Proven option\n\nThis is overall the easiest motor to get started with. Low cogging and a built-in diametric magnet are great!\n\nAvailable [from SparkFun](https://www.sparkfun.com/products/20441)!\n\n# Acknowledgements\nThis project was greatly inspired by Jesse Schoch's video \"[haptic textures and virtual detents](https://www.youtube.com/watch?v=1gPQfDkX3BU)\" and the\ncorresponding [discussion in the SimpleFOC community](https://community.simplefoc.com/t/haptic-textures/301). Seriously, this project wouldn't exist if not for that video - thank you Jesse!\n\n\n# License\n\nThis project is licensed under Apache v2 (software, electronics, documentation) and Creative Commons Attribution 4.0 (hardware/mechanical) (see [LICENSE.txt](LICENSE.txt) and [Creative Commons](https://creativecommons.org/licenses/by/4.0/)).\n\n    Copyright 2022 Scott Bezek\n    \n    Licensed under the Apache License, Version 2.0 (the \"License\");\n    you may not use this file except in compliance with the License.\n    You may obtain a copy of the License at\n    \n        http://www.apache.org/licenses/LICENSE-2.0\n    \n    Unless required by applicable law or agreed to in writing, software\n    distributed under the License is distributed on an \"AS IS\" BASIS,\n    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n    See the License for the specific language governing permissions and\n    limitations under the License.\n\n"
        },
        {
          "name": "__init__.py",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "cad",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "electronics",
          "type": "tree",
          "content": null
        },
        {
          "name": "firmware",
          "type": "tree",
          "content": null
        },
        {
          "name": "platformio.ini",
          "type": "blob",
          "size": 8.158203125,
          "content": "; PlatformIO Project Configuration File\n;\n;   Build options: build flags, source filter\n;   Upload options: custom upload port, speed and extra flags\n;   Library options: dependencies, extra library storages\n;   Advanced options: extra scripting\n;\n; Please visit documentation for the other options and examples\n; https://docs.platformio.org/page/projectconf.html\n\n[platformio]\ndefault_envs = view\nsrc_dir = firmware/src\nlib_dir = firmware/lib\ninclude_dir = firmware/include\ntest_dir = firmware/test\ndata_dir = firmware/data\n\n[base_config]\nplatform = espressif32@3.4\nframework = arduino\nmonitor_speed = 921600\nmonitor_flags = \n\t--eol=CRLF\n\t--echo\n\t--filter=esp32_exception_decoder\nupload_speed = 921600\nlib_deps =\n    infineon/TLV493D-Magnetic-Sensor @ 1.0.3\n    bxparks/AceButton @ 1.9.1\n    bakercp/PacketSerial @ 1.4.0\n    nanopb/Nanopb @ 0.4.7   ; Ideally this would reference the nanopb submodule, but that would require\n                            ; everyone to check out submodules to just compile, so we use the library\n                            ; registry for the runtime. The submodule is available for manually updating\n                            ; the pre-compiled (checked in) .pb.h/c files when proto files change, but is\n                            ; otherwise not used during application firmware compilation.\nbuild_flags =\n    -DMONITOR_SPEED=921600\n\n[env:view]\nextends = base_config\nboard = esp32doit-devkit-v1\nboard_build.partitions = default_ffat.csv\nlib_deps =\n  ${base_config.lib_deps}\n  askuric/Simple FOC @ 2.2.0\n  bodmer/TFT_eSPI@2.4.25\n  fastled/FastLED @ 3.5.0\n  bogde/HX711 @ 0.7.5\n  adafruit/Adafruit VEML7700 Library @ 1.1.1\n\nbuild_flags =\n  ${base_config.build_flags}\n  ; Display enabled: 1=enable, 0=disable\n  -DSK_DISPLAY=1\n  ; Display orientation: 0=usb bottom, 2=usb top\n  -DSK_DISPLAY_ROTATION=0\n  ; LEDs enabled: 1=enable, 0=disable\n  -DSK_LEDS=1\n  ; Number of LEDs\n  -DNUM_LEDS=8\n  ; Strain-gauge press input enabled: 1=enable, 0=disable\n  -DSK_STRAIN=1\n  ; Ambient light sensor (VEML7700) enabled: 1=enable (display/LEDs match ambient brightness), 0=disable (100% brightness all the time)\n  -DSK_ALS=1\n  ; Use MT6701 magnetic encoder\n  -DSENSOR_MT6701=1\n  ; Invert direction of angle sensor (motor direction is detected relative to angle sensor as part of the calibration procedure)\n  -DSK_INVERT_ROTATION=1\n\n  -DMOTOR_WANZHIDA_ONCE_TOP=1\n\n  ; Pin configurations\n  -DPIN_UH=26\n  -DPIN_UL=25\n  -DPIN_VH=27\n  -DPIN_VL=32\n  -DPIN_WH=12\n  -DPIN_WL=33\n  -DPIN_BUTTON_NEXT=-1\n  -DPIN_BUTTON_PREV=-1\n  -DPIN_SDA=15\n  -DPIN_SCL=8\n  -DPIN_MT_DATA=37\n  -DPIN_MT_CLOCK=13\n  -DPIN_MT_CSN=14\n  -DPIN_LED_DATA=7\n  -DPIN_LCD_BACKLIGHT=19\n  -DPIN_STRAIN_DO=38\n  -DPIN_STRAIN_SCK=2\n\n  -DDESCRIPTION_FONT=Roboto_Thin_24\n  -DDESCRIPTION_Y_OFFSET=20\n  -DVALUE_OFFSET=30\n  -DDRAW_ARC=0\n\n  -DSK_BACKLIGHT_BIT_DEPTH=16\n\n  ; TFT_eSPI setup\n  -DUSER_SETUP_LOADED=1\n  -DGC9A01_DRIVER=1\n  -DCGRAM_OFFSET=1\n  -DTFT_WIDTH=240\n  -DTFT_HEIGHT=240\n  -DTFT_MISO=-1\n  -DTFT_MOSI=5\n  -DTFT_SCLK=20\n  -DTFT_CS=21\n  -DTFT_DC=22\n  -DTFT_RST=4\n  -DTFT_BL=-1\n  -DLOAD_GLCD=1\n  -DLOAD_GFXFF=1\n  -DSPI_FREQUENCY=40000000\n\n  ; Reduce loop task stack size (only works on newer IDF Arduino core)\n  ; -DARDUINO_LOOP_STACK_SIZE=2048\n\n  -DCORE_DEBUG_LEVEL=ARDUHAL_LOG_LEVEL_DEBUG\n\n  ; FastLED setup\n  ; Modify the default unusable pin mask to allow GPIO 7 (allowed to use on ESP32-PICO-V3-02)\n  ; Unusable bits: 6, 8, 9, 10, 20\n  ; (0ULL | _FL_BIT(6) | _FL_BIT(8) | _FL_BIT(9) | _FL_BIT(10) | _FL_BIT(20))\n  -DFASTLED_UNUSABLE_PIN_MASK=0x100740LL\n  ; 0~39 except from 24, 28~31 are valid\n  ; (0xFFFFFFFFFFULL & ~(0ULL | _FL_BIT(24) | _FL_BIT(28) | _FL_BIT(29) | _FL_BIT(30) | _FL_BIT(31)))\n  -DSOC_GPIO_VALID_GPIO_MASK=0xFF0EFFFFFF\n  ; GPIO >= 34 are input only\n  ; (SOC_GPIO_VALID_GPIO_MASK & ~(0ULL | _FL_BIT(34) | _FL_BIT(35) | _FL_BIT(36) | _FL_BIT(37) | _FL_BIT(38) | _FL_BIT(39)))\n  -DSOC_GPIO_VALID_OUTPUT_GPIO_MASK=0x30EFFFFFF\n\n\n[env:nanofoc]\nextends = base_config\nplatform = espressif32@6.3.1\nboard = adafruit_feather_esp32s3\nboard_build.partitions = firmware/partitions-4MB-fat.csv\nlib_deps =\n  ${base_config.lib_deps}\n  askuric/Simple FOC@2.3.0\n  bodmer/TFT_eSPI@2.5.0\n\nbuild_flags =\n  ${base_config.build_flags}\n  ; Display enabled: 1=enable, 0=disable\n  -DSK_DISPLAY=0\n  ; Display orientation: 0=usb bottom, 2=usb top\n  -DSK_DISPLAY_ROTATION=0\n  ; LEDs enabled: 1=enable, 0=disable\n  -DSK_LEDS=0\n  ; Number of LEDs\n  -DNUM_LEDS=8\n  ; Strain-gauge press input enabled: 1=enable, 0=disable\n  -DSK_STRAIN=0\n  ; Ambient light sensor (VEML7700) enabled: 1=enable (display/LEDs match ambient brightness), 0=disable (100% brightness all the time)\n  -DSK_ALS=0\n\n  -DSENSOR_MAQ430=1\n  -DPIN_MAQ_SCK=6\n  -DPIN_MAQ_MISO=7\n  -DPIN_MAQ_MOSI=5\n  -DPIN_MAQ_SS=4\n  ; Invert direction of angle sensor (motor direction is detected relative to angle sensor as part of the calibration procedure)\n  -DSK_INVERT_ROTATION=1\n\n  -DMOTOR_MAD2804=1\n\n  ; Pin configurations\n  -DPIN_UH=21\n  -DPIN_UL=12\n  -DPIN_VH=14\n  -DPIN_VL=10\n  -DPIN_WH=13\n  -DPIN_WL=11\n  -DPIN_BUTTON_NEXT=-1\n  -DPIN_BUTTON_PREV=-1\n  -DPIN_LED_DATA=7\n  -DPIN_LCD_BACKLIGHT=08\n\n  -DPIO_FRAMEWORK_ARDUINO_ENABLE_CDC=1\n  -DUSBCON=1\n  -DARDUINO_USB_CDC_ON_BOOT=1\n  -DARDUINO_USB_MODE=1\n  -DCORE_DEBUG_LEVEL=2\n  -DHSPI_SPEED=100000 ; MA/MAQ Nominal SPI Speed in Mhz (HSPI)\n  -DVSPI_SPEED=400000 ; TFt Nominal SPI Speed in Mhz (VSPI)\n\n  ; Reduce loop task stack size (only works on newer IDF Arduino core)\n  ; -DARDUINO_LOOP_STACK_SIZE=2048\n\n\n[env:brushknight_esp32s3]\nextends = base_config\nplatform = espressif32@6.3.1\nboard = esp32-s3-devkitc-1\nboard_build.partitions = default_ffat.csv\n\nmonitor_speed = 115200\n\nlib_deps =\n  ${base_config.lib_deps}\n  bodmer/TFT_eSPI@2.5.0\n  fastled/FastLED @ 3.5.0\n  bogde/HX711 @ 0.7.5\n  adafruit/Adafruit VEML7700 Library @ 1.1.1\n  askuric/Simple FOC@2.3.0\n\nbuild_flags =\n  ${base_config.build_flags}\n  ; Use physical UART for the serial stream rather than the S3 default USB CDC\n  -DSK_FORCE_UART_STREAM=1\n  -DMONITOR_SPEED=115200\n  ; Display enabled: 1=enable, 0=disable\n  -DSK_DISPLAY=1\n  ; PWM bit resolution (even esp32s3 claims that there are 13 bits, max is 12, after it panics)\n  -DSK_BACKLIGHT_BIT_DEPTH=12\n  ; Display orientation: 0=usb bottom, 2=usb top\n  -DSK_DISPLAY_ROTATION=0\n  ; LEDs enabled: 1=enable, 0=disable\n  -DSK_LEDS=1\n  ; Number of LEDs\n  -DNUM_LEDS=8\n  ; Strain-gauge press input enabled: 1=enable, 0=disable\n  -DSK_STRAIN=1\n  ; Ambient light sensor (VEML7700) enabled: 1=enable (display/LEDs match ambient brightness), 0=disable (100% brightness all the time)\n  -DSK_ALS=0\n  ; Use MT6701 magnetic encoder\n  -DSENSOR_MT6701=1\n  ; Invert direction of angle sensor (motor direction is detected relative to angle sensor as part of the calibration procedure)\n  -DSK_INVERT_ROTATION=1\n\n  -DMOTOR_WANZHIDA_ONCE_TOP=1\n\n  ; Pin configurations\n  ; Motor\n  -DPIN_UH=20\n  -DPIN_UL=19\n  -DPIN_VH=21\n  -DPIN_VL=17\n  -DPIN_WH=12\n  -DPIN_WL=18\n\n  -DPIN_BUTTON_NEXT=-1\n  -DPIN_BUTTON_PREV=-1\n  -DPIN_LED_DATA=7\n  -DPIN_LCD_BACKLIGHT=5\n\n  -DPIN_SDA=15\n  -DPIN_SCL=8\n\n  -DPIN_MT_DATA=37\n  -DPIN_MT_CLOCK=13\n  -DPIN_MT_CSN=14\n\n  -DPIN_STRAIN_DO=38\n  -DPIN_STRAIN_SCK=1\n\n  -DDESCRIPTION_FONT=Roboto_Thin_24\n  -DDESCRIPTION_Y_OFFSET=20\n  -DVALUE_OFFSET=30\n  -DDRAW_ARC=0\n\n  ; TFT_eSPI setup\n  -DUSER_SETUP_LOADED=1\n  -DGC9A01_DRIVER=1\n  -DCGRAM_OFFSET=1\n  -DTFT_WIDTH=240\n  -DTFT_HEIGHT=240\n  -DTFT_MISO=-1 # fake\n  -DTFT_MOSI=3\n  -DTFT_SCLK=4\n  -DTFT_CS=9\n  -DTFT_DC=2\n  -DTFT_RST=6\n  -DTFT_BL=-1\n  -DLOAD_GLCD=1\n  -DLOAD_GFXFF=1\n  -DSPI_FREQUENCY=40000000\n\n  ; Reduce loop task stack size (only works on newer IDF Arduino core)\n  ; -DARDUINO_LOOP_STACK_SIZE=2048\n\n  -DCORE_DEBUG_LEVEL=ARDUHAL_LOG_LEVEL_DEBUG\n\n  ; FastLED setup\n  ; Modify the default unusable pin mask to allow GPIO 7 (allowed to use on ESP32-PICO-V3-02)\n  ; Unusable bits: 6, 8, 9, 10, 20\n  ; (0ULL | _FL_BIT(6) | _FL_BIT(8) | _FL_BIT(9) | _FL_BIT(10) | _FL_BIT(20))\n  -DFASTLED_UNUSABLE_PIN_MASK=0x100740LL\n  ; 0~39 except from 24, 28~31 are valid\n  ; (0xFFFFFFFFFFULL & ~(0ULL | _FL_BIT(24) | _FL_BIT(28) | _FL_BIT(29) | _FL_BIT(30) | _FL_BIT(31)))\n  -DSOC_GPIO_VALID_GPIO_MASK=0xFF0EFFFFFF\n  ; GPIO >= 34 are input only\n  ; (SOC_GPIO_VALID_GPIO_MASK & ~(0ULL | _FL_BIT(34) | _FL_BIT(35) | _FL_BIT(36) | _FL_BIT(37) | _FL_BIT(38) | _FL_BIT(39)))\n  -DSOC_GPIO_VALID_OUTPUT_GPIO_MASK=0x30EFFFFFF\n"
        },
        {
          "name": "proto",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "software",
          "type": "tree",
          "content": null
        },
        {
          "name": "thirdparty",
          "type": "tree",
          "content": null
        },
        {
          "name": "util",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}