{
  "metadata": {
    "timestamp": 1736566356156,
    "page": 114,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "acaudwell/Gource",
      "stars": 11934,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0224609375,
          "content": "*.cmd   text eol=crlf\n\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2392578125,
          "content": "*.avi\n*.mpg\n*.mkv\n*.mp4\ngource-*.png\n.objs\n/gource\n/gource.exe\ngource.pro.user\ndebug.log\nMakefile\nMakefile.in\n*.dll\n*.dll.a\nlogs/*\n/aclocal.m4\n/autom4te.cache\n/configure\n/config.log\n/config.status\n/dev/win64\n/build-aux\n*.swp\n*.d\n.deps\n.dirstamp\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.0830078125,
          "content": "[submodule \"src/core\"]\n\tpath = src/core\n\turl = https://github.com/acaudwell/Core.git\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 34.3232421875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "ChangeLog",
          "type": "blob",
          "size": 12.6767578125,
          "content": "0.56:\n * Request compatibility profile when creating OpenGL context.\n\n0.55:\n * Fixed build with Boost 1.85.0 (cho-m).\n\n0.54:\n * Added experimental support for Wayland (beroset).\n * Fixed building on Apple M1 by updating autoconf macros (Ckhardin).\n\n0.53:\n * Added --high-dpi option.\n * Fixed various bugs with Retina displays on MacOS.\n * Fixed slider timestamp font not affected by --font-scale.\n * Fixed hovering over end of slider stopping time advancing.\n\n0.52:\n * Support rendering at native resolution on Retina / Ultra HD displays.\n * Support ISO 8601 timestamp format.\n * Allow custom log and caption file timestamps to be strings.\n * Change regular expression library to PCRE2.\n * Fixed filenames not being affected by --font-scale (Carl Colena).\n * Fixed file key not being affected by --font-scale.\n * Added --file-idle-time-at-end option.\n * Added --fixed-user-size option.\n\n0.51:\n * Fixed --font-file relative path handling.\n * Fixed a bug in resolving the repository root directory from a relative path.\n\n0.50:\n * Right mouse button rotation now pivots around the camera.\n * Added --font-file option.\n * Added --enable-font-file option to configure.\n * Added --no-time-travel option (Lars Schmertmann).\n * Added --dir-name-position option (Lars Schmertmann).\n * Added --file-extension-fallback option (Lars Schmertmann).\n * Added --user-show-filter option (Victor Lopez).\n * Added --disable-input option (Joey Parrish).\n * Added --loop-delay-seconds option (Joey Parrish).\n * Added --font-scale option.\n * Added filename, dirname and user font size options (Carl Colena).\n * Added workaround for FFMpeg error parsing Gource PPM video output.\n * Fixed a bug in the Mercurial log parser that caused changes to be missed.\n * Fixed file removal being cancelled by an action with an earlier timestamp.\n * Fixed a bug in the log file format detection that could result in the wrong\n   first entry being displayed for a custom log.\n * Fixed a bug where automatically cycling through a config with multiple\n   repositories reset settings to their defaults.\n\n0.49:\n * Fixed compatibility with GLM 0.9.9.0.\n\n0.48:\n * Can now generate logs from git sub module directories.\n\n0.47:\n * Fixed low mouse movement speed with some mice while repositioning camera.\n\n0.46:\n * Added --screen option.\n\n0.45:\n * Added --window-position XxY option.\n * Added --frameless option.\n * Added --file-show-filter REGEX option (swoogles).\n * Added --filename-time and filename-colour options (gh2k).\n * Improved handling of very low seconds-per-day values (malengrin).\n * Fixed crash when SVN log lacks author information (obarthel).\n * Additional git log command validation (cym13).\n * Allow lower case hex colours in custom logs (HSorensen).\n * Enabled STDOUT support with --output-stream '-' on Windows (circulosmeos).\n * Now requires SDL 2 to build (deprecated SDL 1.2 support removed).\n\n0.44:\n * Fixed crash when taking a screenshot with an odd resolution.\n * Fixed type deduction compilation error with newer versions of GCC.\n * Documentation improvements.\n\n0.43:\n * Updated boost autoconf macros to fix multi-arch detection.\n\n0.42:\n * Fixed bzr log command when no start date was specified (chrisf).\n * Fixed hg log commit order when date range specified.\n * Fixed hg log command line on Windows.\n * Fixed parser bug in date range filtering code.\n\n0.41:\n * Multi-monitor support using SDL 2.0 when available.\n * SDL 1.2 support is deprecated.\n * Full screen mode now uses desktop resolution by default.\n * Added --start-date, --stop-date 'YYYY-MM-DD hh:mm:ss' options.\n * Added --dir-name-depth option.\n * Changed --file-idle-time default value to 0.\n * Changed screenshot format to PNG.\n\n0.40:\n * Added caption support.\n * Improved command line interoperability on Windows.\n * Fixed directory deletion short circuiting processing the rest of a commit.\n * Fixed issue loading non-ascii user image filenames on windows.\n * Ignore UTF-8 byte order mark at the start of lines in custom log files.\n * Fix to boost macros for Macs and non-GNU systems (mistydemeo).\n * Autotools improvements (flameeyes).\n\n0.39:\n * Fixed blurry non power of 2 logos.\n * File colour changes now supported in custom logs (rmyorston).\n * Fixed building against Boost 1.50 (svenstaro).\n * Updated boost autoconf macros (flameeyes).\n * Autogen script (matthiaskrgr).\n\n0.38:\n * New high quality sprites.\n * Fullscreen toggle with alt + enter.\n * Window is now resizable. -WIDTHxHEIGHT! creates a non-resizable window.\n * Lowered minimum zoom distance.\n * Use AM_CPPFLAGS in Makefile.am to allow passing custom CPPFLAGS.\n * Don't add files that match the path of a known directory.\n * Fixed divide by zero in text shader causing artifacts on some video cards.\n * Recursively search for repository directory when log-format not specified\n   (thanks to Jörg Bachmann for original concept / prototype).\n * New dependency on Boost Filesystem.\n * Doubled the maximum zoom out distance.\n * Allow negative timestamps before 1970 in custom log (artzub).\n * Fix for UTF8-CPP checked.h compilation issue (vszakats).\n * Fixed bug causing missing characters in text.\n * Fixed --highlight-users option not using highlight-colour.\n * highlight-colour default changed to white.\n * Added --selection-colour option (applied to selected users and files).\n * Added --dir-colour option (applied to directories).\n\n0.37:\n * Made SVN log GMT timestamp conversion fix portable.\n\n0.36:\n * Fixed SVN log GMT timestamp conversion.\n * Fixed issue with sub-dirs of deleted dir not being removed in some cases.\n\n0.35:\n * Added long file extension truncation handling to file key (--key).\n * Treat changes in Mercurial log files with the same time/user as one commit.\n * Fixed handling of spaces in directory names with Mercurial.\n * Fixed --font-colour option.\n\n0.34:\n * Now using VBOs and shaders for faster rendering when OpenGL 2.0 is available.\n * Eliminated bloom colour banding artifacts (requires OpenGL 2.0).\n * New font rendering library derived from FTGL (FTGL no longer required).\n * Single pass font/shadow rendering (with lots of help from Chris Forbes).\n * Added --no-vsync option.\n * Fixed bug where tree is out of alignment with object positions in windowed\n   mode due to using the wrong display dimensions internally.\n * Removed default max-files limit.\n\n0.33:\n * Added --hide root option to not draw branches from the root directory.\n * Fixed log parsing of Bazaar merges and tagged commits.\n * --output-custom-log now skips unparsed log entries instead of exiting.\n\n0.32:\n * Fixed behaviour of user camera tracking.\n\n0.31:\n * Added --with-tinyxml option to configure (use the system TinyXML library).\n\n0.30:\n * Fixed crash when SVN log entry contains no 'paths' element.\n * Handle directory deletion (happens in SVN logs).\n\n0.29:\n * SVN built-in support.\n * cvs2cl log support (cvs-exp support is now deprecated).\n * Made camera behaviour when zooming and selecting objects more intuitive.\n * Improved interactive performance.\n * Added file extension key (--key or toggled with 'K').\n * Added mouse-over tool tips.\n * Added --highlight-colour option.\n * Added --hash-seed option. The S key now randomizes colours.\n * Added --output-custom-log option.\n * Exposed --time-scale option (previously only available interactively).\n * Removed arbitrary 1024 maximum length limit for log lines.\n * Fixed two file colouring bugs (quoted files from git, period in file path).\n * Fix handling of avatars for UTF-8 usernames on MACOSX (Christian Köstlin).\n * Recover from video mode failing to set due to multi-sampling (Siddhesh Poyarekar).\n\n0.28:\n * Bazaar support for merged commits (Nick Moffit).\n * C++ efficiency improvements (Oliver Smith).\n * Improved cvs-exp log compatibility.\n * Re-show name of user when adding a new action if user is idle.\n * Added --padding option to control camera view padding.\n * More accurate camera tracking (tracks the bounding boxes of objects).\n * Improved automatic rotation logic.\n\n0.27:\n * Display time stops at the time of the last commit.\n * Users fade out when end reached rather than ending abruptly.\n * Position slider is now hidden by default if recording a video.\n * Automatic camera rotation for better use of screen space.\n * Support international keyboards (Peter Kjellerstedt).\n * C++ efficiency improvements (Jacob Metcalfe).\n * Fixed crash when reading from STDIN.\n * Fixed intermittent crash closing Gource when using --output-ppm-stream.\n * Added ini style config file support (see --load/save-config).\n * Added screenshot button (F12). Screenshots respect the alpha channel.\n * Added --transparent to make the background see-through (for screenshots).\n * Added --logo and --background-image options.\n * Added --dont-stop option for manual exiting when recording videos.\n * Added --stop-at-time option to stop Gource after a number of seconds.\n * Added --hide 'mouse' option.\n * Added --highlight-dirs option.\n * Added --file-extensions to show filename extensions only.\n * Added --user-filter REGEX option.\n * Allow --file-idle-time 0 (files will never expire).\n * Allow --start-position 'random' to set a random start position.\n * --log-command VCS replaces multiple --log-command-VCS options.\n * Replaced --disable-progress and --disable-bloom with arguments to --hide.\n\n0.26a:\n * Updated to latest version of GL autoconf macros.\n\n0.26:\n * Improved mouse dragging.\n * Holding right mouse button and moving the mouse rotates the view.\n * The middle mouse button now toggles the camera mode.\n * Username positions now scale correctly.\n * Simulation time no longer incremented while paused, counting towards file time lag.\n * M key now toggles mouse visibility.\n * Added --hide option to use instead of multiple --hide-ELEMENT options.\n\n0.25:\n * Bazaar support (John Arbash Meinel).\n * Dragging the mouse on the background moves the camera.\n * Added --camera-mode option (track,overview).\n * Support DOS line endings in logs.\n * Improved compatibility of hg log command (Brendan Cully).\n * Fixed PPM exporter producing blank images on some video cards.\n * Fixed parsing of negative timezones from cvs-exp.pl logs.\n * Fixed various gdb and compiler warnings.\n\n0.24:\n * PPM output speed improvements, including using a second thread (HighlandSun).\n * Now using standard autotools (Flameeyes).\n * Fixed --max-file-lag not working with some custom log files.\n * Gource will stop at the end of the log by default when recording a video.\n * Fixed STDIN stopping working after the first lot of records with tail -f.\n * Added proper exception handling.\n * Print errors to stderr.\n\n0.23:\n * Hiding filenames no longer hides directory names.\n * Fixed --stop-on-idle option.\n * Added --stop-at-end option (more intuitive than --stop-position 1.0).\n\n0.22:\n * Fixed Mercurial log order.\n\n0.21b:\n * Fixed windows build.\n\n0.21: \n * Some documentation fixes.\n\n0.20:\n * Added bloom effect (turn off with --disable-bloom).\n * Added support for Mercurial (thanks to Justin Love for gource.style).\n * --start-position option now works in combination with --disable-progress.\n\n0.19:\n * Use time_t instead of long for timestamps.\n\n0.18:\n * Fixed camera movement while the simulation is paused.\n\n0.17:\n * Show correct month for CVS logs.\n * Added time scaling (Bitshifter).\n\n0.16:\n * Added --hide-dirnames option.\n * Added --user-scale option.\n * Added --date-format option (Pat Notz).\n * Fix bug when encountering long log lines.\n * Fixed incorrect parsing of trivial merges.\n * Fixed building issues on OSX.\n\n0.15:\n * Added PPM output support for creating videos (Johannes Schindelin).\n * Added experimental Apache combined access log support (--log-format apache).\n * Added --stop-position and --stop-on-idle options (useful for making videos).\n * Added --max-file-lag option to limit how long after a commit file changes can take to appear.\n * Added --no-renames to the git log command as they don't display correctly.\n * Added --max-user-speed and --user-friction as options.\n * Now builds on OSX Leopard (with the required libaries installed).\n * Caught raw exception from replace_invalid().\n * Added CXXFLAGS. You may want to override the default (eg CXXFLAGS=-O3 ./configure).\n\n0.14:\n * Updated SVN instructions.\n\n0.13:\n * Removed single quotes from log command (fixes running gource --git-log-command in back ticks)\n * Added SVN instructions.\n * Fixed manpage hyphens.\n\n0.12:\n * Added --enable-ttf-font-dir=DIR option to configure (to specify the ttf-freefont directory).\n * UTF-8 support using UTF8-CPP (http://utfcpp.sourceforge.net/).\n * Changed the git log command (see --git-log-command) to require less work to parse.\n   Log files generated with the previous git-log command used by gource should continue to work.\n * Allow --seconds-per-day value less than 1.0.\n * Added --git-branch command.\n * Added --loop command.\n * Added --crop command.\n\n0.11:\n * Made N key skip to next entry.\n * Documented --user-image-dir flag.\n * temp file name now uses uid instead of time\n\n0.1:\n * First release.\n"
        },
        {
          "name": "INSTALL",
          "type": "blob",
          "size": 1.82421875,
          "content": "This file is to help you configure, build and install Gource for your system.\n\nContents\n========\n\n1. Dependencies\n2. Building\n3. Configure Options\n\n1. Dependencies\n===============\n\nGource requires the following libraries to compile (package names may vary):\n\n    SDL 2.0 (libsdl2-dev)\n    SDL Image 2.0 (libsdl2-image-dev)\n    PCRE2 (libpcre2-dev)\n    Freetype 2 (libfreetype6-dev)\n    GLEW (libglew-dev)\n    GLM >= 0.9.3 (libglm-dev)\n    Boost Filesystem >= 1.46 (libboost-filesystem-dev)\n    PNG >= 1.2 (libpng-dev)\n\nOptional:\n\n   TinyXML (libtinyxml-dev)\n\nSDL Image 2.0 needs to have been built with support PNG and JPEG images.\n\n2. Building\n===========\n\nGource requires a GNU compatible C++ compiler that supports c++0x features such as 'auto' and the new 'for' loop syntax.\n\nGCC 4.6+ or Clang recommended.\n\nIf you got the source directly from the Gource.git repository, you will first\nneed to run autogen.sh which will generate the configure script and\ninitialize and update the submodules.\n\n    ./autogen.sh\n\nGeneric build instructions for Linux/Mac OS:\n\n    ./configure\n    make\n    make install\n\nBuilding on Windows:\n\nOn Windows compile gource.pro with Qt Creator.\n\nA pre-built version for Windows is normally available from the homepage.\n\nGource expects SDL to have been built with the NO_STDIO_REDIRECT flag.\n\n3. Configure Options\n====================\n\nBy default Gource will install some GNU FreeFont TTF Fonts on your system.\n\nIf you already have these fonts, you can configure Gource to use them with:\n\n    ./configure --enable-ttf-font-dir=/path/to/freefont/\n\nYou can also build Gource with a different font:\n\n    ./configure --enable-font-file=/path/to/alternate/font.ttf\n\nThe font file format must be supported by Free Type 2.\n\nGource includes a copy of TinyXML. To build against the system version of the\nlibrary use:\n\n    ./configure --with-tinyxml\n\n"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 2.5341796875,
          "content": "ACLOCAL_AMFLAGS = -I m4\n\nbin_PROGRAMS = gource\n\ngource_CXXFLAGS = -std=gnu++0x -Wall -Wno-sign-compare -Wno-reorder -Wno-unused-but-set-variable -Wno-unused-variable\n\nsources = \\\n\tsrc/action.cpp \\\n\tsrc/bloom.cpp \\\n\tsrc/caption.cpp \\\n\tsrc/core/conffile.cpp \\\n\tsrc/core/display.cpp \\\n\tsrc/core/frustum.cpp \\\n\tsrc/core/fxfont.cpp \\\n\tsrc/core/logger.cpp \\\n\tsrc/core/mousecursor.cpp \\\n\tsrc/core/plane.cpp \\\n\tsrc/core/ppm.cpp \\\n\tsrc/core/quadtree.cpp \\\n\tsrc/core/regex.cpp \\\n\tsrc/core/resource.cpp \\\n\tsrc/core/sdlapp.cpp \\\n\tsrc/core/seeklog.cpp \\\n\tsrc/core/settings.cpp \\\n\tsrc/core/shader.cpp \\\n\tsrc/core/shader_common.cpp \\\n\tsrc/core/stringhash.cpp \\\n\tsrc/core/texture.cpp \\\n\tsrc/core/png_writer.cpp \\\n\tsrc/core/timezone.cpp \\\n\tsrc/core/vbo.cpp \\\n\tsrc/core/vectors.cpp \\\n\tsrc/dirnode.cpp \\\n\tsrc/file.cpp \\\n\tsrc/formats/apache.cpp \\\n\tsrc/formats/bzr.cpp \\\n\tsrc/formats/commitlog.cpp \\\n\tsrc/formats/custom.cpp \\\n\tsrc/formats/cvs-exp.cpp \\\n\tsrc/formats/cvs2cl.cpp \\\n\tsrc/formats/git.cpp \\\n\tsrc/formats/gitraw.cpp \\\n\tsrc/formats/hg.cpp \\\n\tsrc/formats/svn.cpp \\\n\tsrc/gource.cpp \\\n\tsrc/gource_shell.cpp \\\n\tsrc/gource_settings.cpp \\\n\tsrc/key.cpp \\\n\tsrc/logmill.cpp \\\n\tsrc/pawn.cpp \\\n\tsrc/slider.cpp \\\n\tsrc/spline.cpp \\\n\tsrc/textbox.cpp \\\n\tsrc/user.cpp \\\n\tsrc/zoomcamera.cpp\n\nif USE_BUNDLED_TINYXML\nsources += \\\n\tsrc/tinyxml/tinyxmlerror.cpp \\\n\tsrc/tinyxml/tinystr.cpp \\\n\tsrc/tinyxml/tinyxml.cpp \\\n\tsrc/tinyxml/tinyxmlparser.cpp\nendif\n\ngource_SOURCES = src/main.cpp ${sources}\n\nAM_CPPFLAGS = -DSDLAPP_RESOURCE_DIR=\\\"$(pkgdatadir)\\\"\n\ndist_pkgdata_DATA = data/beam.png data/bloom.tga data/bloom_alpha.tga data/file.png data/user.png data/gource.style\n\nshadersdir = $(pkgdatadir)/shaders\ndist_shaders_DATA = data/shaders/shadow.vert data/shaders/shadow.frag data/shaders/bloom.vert data/shaders/bloom.frag data/shaders/text.vert data/shaders/text.frag\n\ninstall-data-hook:\n\t$(MKDIR_P) $(DESTDIR)$(mandir)/man1\n\tgzip -cf9 $(srcdir)/data/gource.1 > $(DESTDIR)$(mandir)/man1/gource.1.gz\n\nuninstall-hook:\n\trm -f $(DESTDIR)$(mandir)/man1/gource.1.gz\n\nif FONTFILE\nAM_CPPFLAGS += -DGOURCE_FONT_FILE=\\\"$(gourcefontfile)\\\"\nelse\nif FONTDIR\nAM_CPPFLAGS += -DSDLAPP_FONT_DIR=\\\"$(gourcefontdir)\\\"\nelse\nfontsdir = $(pkgdatadir)/fonts\ndist_fonts_DATA = data/fonts/README data/fonts/FreeSans.ttf\nendif\nendif\n\ncheck_PROGRAMS = gource_tests\ngource_tests_CPPFLAGS = -I src/test/ ${BOOST_CPPFLAGS}\ngource_tests_LDFLAGS = ${BOOST_LDFLAGS}\ngource_tests_LDADD = ${BOOST_UNIT_TEST_FRAMEWORK_LIB}\n\ngource_tests_SOURCES = \\\n\tsrc/test/main.cpp \\\n\tsrc/test/datetime_tests.cpp \\\n\tsrc/test/regex_tests.cpp \\\n\t${sources}\n\nTESTS = gource_tests\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 13.703125,
          "content": "Gource\n======\n\nhttps://gource.io\n\nDescription\n===========\n\nGource is a visualization tool for source control repositories.\n\nThe repository is displayed as a tree where the root of the repository is the\ncentre, directories are branches and files are leaves. Contributors to the\nsource code appear and disappear as they contribute to specific files and\ndirectories.\n\nRequirements\n============\n\nGource's display is rendered using OpenGL and requires a 3D accelerated video\ncard to run.\n\nUsing Gource\n============\n\n```\ngource [options] [path]\n\noptions:\n\n    -h, --help\n            Help ('-H' for extended help).\n\n    -WIDTHxHEIGHT, --viewport WIDTHxHEIGHT\n            Set the viewport size. If -f is also supplied, will attempt to set\n            the video mode to this also. Add ! to make the window non-resizable.\n\n    --screen SCREEN\n            Set the number of the screen to display on.\n\n    --high-dpi\n            Request a high DPI display when creating the window.\n\n            On some platforms such as MacOS, the window resolution is specified in points instead of pixels.\n            The --high-dpi flag may be required to access some higher resolutions.\n\n            E.g. requesting a high DPI 800x600 window may produce a window that is 1600x1200 pixels.\n\n    --window-position XxY\n            Initial window position on your desktop which may be made up of\n            multiple monitors.\n\n            This will override the screen setting so don't specify both.\n\n    --frameless\n            Frameless window.\n\n    -f, --fullscreen\n            Fullscreen.\n\n    -w, --windowed\n            Windowed.\n\n    --transparent\n            Make the background transparent. Only really useful for screenshots.\n\n    --start-date \"YYYY-MM-DD hh:mm:ss +tz\"\n            Start with the first entry after the supplied date and optional time.\n\n            If a time zone offset isn't specified the local time zone is used.\n\n            Example accepted formats:\n\n                \"2012-06-30\"\n                \"2012-06-30 12:00\"\n                \"2012-06-30 12:00:00 +12\"\n\n    --stop-date \"YYYY-MM-DD hh:mm:ss +tz\"\n            Stop after the last entry prior to the supplied date and optional time.\n\n            Uses the same format as --start-date.\n\n    -p, --start-position POSITION\n            Begin at some position in the log (between 0.0 and 1.0 or 'random').\n\n        --stop-position  POSITION\n            Stop (exit) at some position in the log (does not work with STDIN).\n\n    -t, --stop-at-time SECONDS\n            Stop (exit) after a specified number of seconds.\n\n        --stop-at-end\n            Stop (exit) at the end of the log / stream.\n\n        --loop\n            Loop back to the start of the log when the end is reached.\n\n        --loop-delay-seconds\n            Seconds to delay before looping.\n\n    -a, --auto-skip-seconds SECONDS\n            Skip to next entry if nothing happens for a number of seconds.\n\n    -s, --seconds-per-day SECONDS\n            Speed of simulation in seconds per day.\n\n        --realtime\n            Realtime playback speed.\n\n        --no-time-travel\n            Use the time of the last commit if the time of a commit is in the past.\n\n    -c, --time-scale SCALE\n            Change simulation time scale. This affects the movement speed of user avatars.\n\n            E.g. 0.5 for half speed, 2 for double speed.\n\n    -i, --file-idle-time SECONDS\n            Time in seconds files remain idle before they are removed or 0\n            for no limit.\n\n        --file-idle-time-at-end SECONDS\n            Time in seconds files remain idle at the end before they are\n            removed.\n\n    -e, --elasticity FLOAT\n            Elasticity of nodes.\n\n    -b, --background-colour FFFFFF\n            Background colour in hex.\n\n    --background-image IMAGE\n            Set a background image.\n\n    --logo IMAGE\n            Logo to display in the foreground.\n\n    --logo-offset XxY\n            Offset position of the logo.\n\n    --title TITLE\n            Set a title.\n\n    --font-file FILE\n            Specify the font. Should work with most font file formats supported by FreeType, such as TTF and OTF, among others.\n\n    --font-scale SCALE\n            Scale the size of all fonts.\n\n    --font-size SIZE\n            Font size used by the date and title.\n\n    --file-font-size SIZE\n            Font size of filenames.\n\n    --dir-font-size SIZE\n            Font size of directory names\n\n    --user-font-size SIZE\n            Font size of user names.\n\n    --font-colour FFFFFF\n            Font colour used by the date and title in hex.\n\n    --key\n            Show file extension key.\n\n    --date-format FORMAT\n            Specify display date string (strftime format).\n\n    --log-command VCS\n            Show the VCS log command used by gource (git,svn,hg,bzr,cvs2cl).\n\n    --log-format VCS\n            Specify the log format (git,svn,hg,bzr,cvs2cl,custom).\n\n            Required when reading from STDIN.\n\n    --git-branch\n            Get the git log of a branch other than the current one.\n\n    --follow-user USER\n            Have the camera automatically follow a particular user.\n\n    --highlight-dirs\n            Highlight the names of all directories.\n\n    --highlight-user USER\n            Highlight the names of a particular user.\n\n    --highlight-users\n            Highlight the names of all users.\n\n    --highlight-colour FFFFFF\n            Font colour for highlighted users in hex.\n\n    --selection-colour FFFFFF\n            Font colour for selected users and files.\n\n    --filename-colour FFFFFF\n            Font colour for filenames.\n\n    --dir-colour FFFFFF\n            Font colour for directories.\n\n    --dir-name-depth DEPTH\n            Draw names of directories down to a specific depth in the tree.\n\n    --dir-name-position FLOAT\n            Position along edge of the directory name\n            (between 0.1 and 1.0, default is 0.5).\n\n    --filename-time SECONDS\n            Duration to keep filenames on screen (>= 2.0).\n\n    --file-extensions\n            Show filename extensions only.\n\n    --file-extension-fallback\n            Use filename as extension if the extension is missing or empty.\n\n    --file-filter REGEX\n            Filter out file paths matching the specified regular expression.\n\n    --file-show-filter REGEX\n            Show only file paths matching the specified regular expression.\n\n    --user-filter REGEX\n            Filter usernames matching the specified regular expression.\n\n    --user-show-filter REGEX\n            Show only usernames matching the specified regular expression.\n\n    --user-image-dir DIRECTORY\n            Directory containing .jpg or .png images of users\n            (eg \"Full Name.png\") to use as avatars.\n\n    --default-user-image IMAGE\n            Path of .jpg or .png to use as the default user image.\n\n    --fixed-user-size\n            Forces the size of the user image to remain fixed throughout.\n\n    --colour-images\n            Colourize user images.\n\n    --crop AXIS\n            Crop view on an axis (vertical,horizontal).\n\n    --padding FLOAT\n            Camera view padding.\n\n    --multi-sampling\n            Enable multi-sampling.\n\n    --no-vsync\n            Disable vsync.\n\n    --bloom-multiplier FLOAT\n            Adjust the amount of bloom.\n\n    --bloom-intensity FLOAT\n            Adjust the intensity of the bloom.\n\n    --max-files NUMBER\n            Set the maximum number of files or 0 for no limit.\n\n            Excess files will be discarded.\n\n    --max-file-lag SECONDS\n            Max time files of a commit can take to appear.\n\n            Use -1 for no limit.\n\n    --max-user-speed UNITS\n            Max speed users can travel per second.\n\n    --user-friction SECONDS\n            Time users take to come to a halt.\n\n    --user-scale SCALE\n            Change scale of user avatars.\n\n    --camera-mode MODE\n            Camera mode (overview,track).\n\n    --disable-auto-rotate\n            Disable automatic camera rotation.\n\n    --disable-input\n            Disable keyboard and mouse input.\n\n    --hide DISPLAY_ELEMENT\n            Hide one or more display elements from the list below:\n\n            bloom     - bloom effect\n            date      - current date\n            dirnames  - names of directories\n            files     - file icons\n            filenames - names of files\n            mouse     - mouse cursor\n            progress  - progress bar widget\n            root      - root directory of tree\n            tree      - animated tree structure\n            users     - user avatars\n            usernames - names of users\n\n            Separate multiple elements with commas (eg \"mouse,progress\")\n\n    --hash-seed SEED\n            Change the seed of hash function.\n\n    --caption-file FILE\n            Caption file (see Caption Log Format).\n\n    --caption-size SIZE\n            Caption size.\n\n    --caption-colour FFFFFF\n            Caption colour in hex.\n\n    --caption-duration SECONDS\n            Caption duration.\n\n    --caption-offset X\n            Caption horizontal offset (0 to centre captions).\n\n    -o, --output-ppm-stream FILE\n            Output a PPM image stream to a file ('-' for STDOUT).\n\n            This will automatically hide the progress bar initially and\n            enable 'stop-at-end' unless other behaviour is specified.\n\n    -r, --output-framerate FPS\n            Framerate of output (25,30,60). Used with --output-ppm-stream.\n\n    --output-custom-log FILE\n            Output a custom format log file ('-' for STDOUT).\n\n    --load-config CONFIG_FILE\n            Load a gource conf file.\n\n    --save-config CONFIG_FILE\n            Save a gource conf file with the current options.\n\n    --path PATH\n\n    path    Either a supported version control directory, a pre-generated log\n            file (see log commands or the custom log format), a Gource conf\n            file or '-' to read STDIN.\n\n            If path is omitted, gource will attempt to read a log from the\n            current directory.\n```\n\nGit, Bazaar, Mercurial and SVN Examples:\n\nView the log of the repository in the current path:\n\n```\n    gource\n```\n\nView the log of a project in the specified directory:\n\n```\n    gource my-project-dir\n```\n\nFor large projects, generating a log of the project history may take a long\ntime. For centralized VCS like SVN, generating the log may also put load on\nthe central VCS server.\n\nIn these cases, you may like to save a copy of the log for later use.\n\nYou can generate a log in the VCS specific log format using\nthe --log-command VCS option:\n\n```\n    cd my-svn-project\n    `gource --log-command svn` > my-svn-project.log\n    gource my-svn-project.log\n```\n\nYou can also have Gource write a copy of the log file in its own format:\n\n```\n    gource --output-custom-log my-project-custom.log\n```\n\nCVS Support:\n\nUse 'cvs2cl' to generate the log and then pass it to Gource:\n\n```\n    cvs2cl --chrono --stdout --xml -g-q > my-cvs-project.log\n    gource my-cvs-project.log\n```\n\nCustom Log Format:\n\nIf you want to use Gource with something other than the supported systems,\nthere is a pipe ('|') delimited custom log format:\n\n    timestamp - An ISO 8601 or unix timestamp of when the update occurred.\n    username  - The name of the user who made the update.\n    type      - initial for the update type - (A)dded, (M)odified or (D)eleted.\n    file      - Path of the file updated.\n    colour    - A colour for the file in hex (FFFFFF) format. Optional.\n\nCaption Log Format:\n\nGource can display captions along the timeline by specifying a caption file\n(using --caption-file) in the pipe ('|') delimited format below:\n\n    timestamp - An ISO 8601 or A unix timestamp of when to display the caption.\n    caption   - The caption\n\nRecording Videos:\n\nSee the guide on the homepage for examples of recording videos with Gource:\n\nhttps://github.com/acaudwell/Gource/wiki/Videos\n\nMore Information:\n\nVisit the Gource homepage for guides and examples of using Gource with various\nversion control systems:\n\nhttps://gource.io\n\nInterface:\n\nThe time shown in the top left of the screen is set initially from the first\nlog entry read and is incremented according to the simulation speed\n(--seconds-per-day).\n\nPressing SPACE at any time will pause/resume the simulation. While paused you\nmay use the mouse to inspect the detail of individual files and users.\n\nTAB cycles through selecting the current visible users.\n\nThe camera mode, either tracking activity or showing the entire code tree, can\nbe toggled using the Middle mouse button.\n\nYou can drag the left mouse button to manually control the camera. The right\nmouse button rotates the view.\n\nInteractive keyboard commands:\n\n    (V)   Toggle camera mode\n    (C)   Displays Gource logo\n    (K)   Toggle file extension key\n    (M)   Toggle mouse visibility\n    (N)   Jump forward in time to next log entry\n    (S)   Randomize colours\n    (D)   Toggle directory name display mode\n    (F)   Toggle file name display mode\n    (U)   Toggle user name display mode\n    (G)   Toggle display of users\n    (T)   Toggle display of directory tree edges\n    (R)   Toggle display of root directory edges\n    (<>)  Adjust time scale / user avatar movement speed\n    (+-)  Adjust simulation speed\n    (Keypad +-) Adjust camera zoom\n    (TAB) Cycle through visible users\n    (F12) Screenshot\n    (Alt+Enter) Fullscreen toggle\n    (ESC) Quit\n\nCopyright\n=========\n\nGource - software version control visualization\nCopyright (C) 2009 Andrew Caudwell <acaudwell@gmail.com>\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program. If not, see <http://www.gnu.org/licenses/>.\n"
        },
        {
          "name": "THANKS",
          "type": "blob",
          "size": 0.0693359375,
          "content": "Cheers to everyone at Catalyst IT for their support and encouragement.\n"
        },
        {
          "name": "autogen.sh",
          "type": "blob",
          "size": 0.4736328125,
          "content": "#! /bin/sh\nif (autoreconf -f -i) ; then\n\techo \"autoreconf ran successfully.\"\n\techo \"Initializing submodules...\"\n\tif (git submodule init) ; then\n\t\techo \"Updating submodules...\"\n\t\tif (git submodule update --init --recursive) ; then\n\t\t\techo \"Run './configure && make' to continue.\"\n\t\telse\n\t\t\techo \"Error: could not update submodules!\"\n\t\tfi\n\telse\n\t\techo \"Error: could not initialize submodules!\"\n\tfi\nelse\n\techo \"Running autoreconf failed, please make sure you have autoconf installed.\"\nfi\n"
        },
        {
          "name": "cmd",
          "type": "tree",
          "content": null
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 2.6875,
          "content": "#                                               -*- Autoconf -*-\n# Process this file with autoconf to produce a configure script.\n\nAC_PREREQ(2.61)\n\nAC_INIT(Gource, 0.56, [acaudwell@gmail.com])\nAC_CONFIG_AUX_DIR([build-aux])\nAC_CONFIG_SRCDIR([src/main.h])\nAM_INIT_AUTOMAKE([dist-bzip2 foreign subdir-objects])\n\nAC_CANONICAL_HOST\n\n# Checks for programs.\nAC_PROG_CXX\nAC_LANG(C++)\n\nAC_CHECK_FUNCS([timegm unsetenv])\n\n#Disable X11 on Macs unless required\nAS_IF([test \"$with_x\" != yes], [\n    case \"$host_os\" in\n    darwin*)\n        with_x=\"no\"\n        LIBS=\"$LIBS -framework CoreFoundation\"\n    ;;\n    esac\n], [])\n\n#GL\nAX_CHECK_GL\nAX_CHECK_GLU\nCXXFLAGS=\"$CXXFLAGS $GL_CFLAGS $GLU_CFLAGS\"\nCPPFLAGS=\"$CPPFLAGS $GL_CFLAGS $GLU_CFLAGS\"\nLIBS=\"$LIBS $GL_LIBS $GLU_LIBS\"\n\nPKG_CHECK_MODULES([FT2], [freetype2 >= 9.0.3])\nPKG_CHECK_MODULES([PCRE2], [libpcre2-8])\nPKG_CHECK_MODULES([GLEW], [glew])\nPKG_CHECK_MODULES([SDL2], [sdl2 SDL2_image]);\nPKG_CHECK_MODULES([PNG], [libpng >= 1.2])\n\nCPPFLAGS=\"${CPPFLAGS} ${FT2_CFLAGS} ${PCRE2_CFLAGS} ${GLEW_CFLAGS} ${SDL2_CFLAGS} ${PNG_CFLAGS}\"\nLIBS=\"${LIBS} ${FT2_LIBS} ${PCRE2_LIBS} ${GLEW_LIBS} ${SDL2_LIBS} ${PNG_LIBS}\"\n\nAC_CHECK_FUNCS([IMG_LoadPNG_RW], , AC_MSG_ERROR([SDL2_image with PNG support required. Please see INSTALL]))\nAC_CHECK_FUNCS([IMG_LoadJPG_RW], , AC_MSG_ERROR([SDL2_image with JPEG support required. Please see INSTALL]))\n\n#BOOST\nAX_BOOST_BASE([1.46], , AC_MSG_ERROR(Boost Filesystem >= 1.46 is required. Please see INSTALL))\nAX_BOOST_SYSTEM\nAX_BOOST_FILESYSTEM\n\nCPPFLAGS=\"$CPPFLAGS $BOOST_CPPFLAGS\"\nLIBS=\"$LIBS $BOOST_SYSTEM_LIB $BOOST_FILESYSTEM_LIB\"\n\nAC_ARG_ENABLE(font-file,[AS_HELP_STRING([--enable-font-file=FILE],[override the default font])],[gourcefontfile=\"$enableval\"],[gourcefontfile=\"\"])\nAM_CONDITIONAL([FONTFILE], [test \"x$gourcefontfile\" != \"x\"])\nAC_SUBST(gourcefontfile)\n\n#see if ttf-font-dir option is enabled\nAC_ARG_ENABLE(ttf-font-dir,[AS_HELP_STRING([--enable-ttf-font-dir=DIR],[directory containing GNU FreeFont TTF fonts])],[gourcefontdir=\"$enableval\"],[gourcefontdir=\"\"])\nAM_CONDITIONAL([FONTDIR], [test \"x$gourcefontdir\" != \"x\"])\nAC_SUBST(gourcefontdir)\n\n#GLM\nAC_CHECK_HEADER([glm/glm.hpp],, AC_MSG_ERROR(GLM headers are required. Please see INSTALL))\n\n#see if building against system TinyXML library\nuse_tinyxml_system_library=no\nAC_ARG_WITH(tinyxml, AS_HELP_STRING([--with-tinyxml],[Use system installed TinyXML library]), use_tinyxml_system_library=$withval)\nif test \"x$use_tinyxml_system_library\" = \"xyes\"; then\n    AC_CHECK_LIB([tinyxml],[main],[],[AC_MSG_ERROR(TinyXML library was requested but not found)],[])ac_cv_lib_tinyxml=ac_cv_lib_tinyxml_main\n\nfi\nAM_CONDITIONAL(USE_BUNDLED_TINYXML, test \"x$use_tinyxml_system_library\" != \"xyes\")\n\nAC_CONFIG_FILES([Makefile])\nAC_OUTPUT\n"
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "dev",
          "type": "tree",
          "content": null
        },
        {
          "name": "gource.pro",
          "type": "blob",
          "size": 3.2919921875,
          "content": "# Note: this project file currently only implements building on Windows with Mingw-w64\n# See the INSTALL file for building instructions\n\nTEMPLATE = app\nCONFIG += console\nCONFIG -= app_bundle\nCONFIG -= qt\nDEFINES -= UNICODE\n\nCONFIG += c++11\nCONFIG += object_parallel_to_source\n\ngcc {\n    QMAKE_CXXFLAGS_WARN_ON = -Wall -Wno-unused-variable -Wno-sign-compare -Wno-unused-parameter -Wno-reorder\n    QMAKE_CXXFLAGS_DEBUG += -DASSERTS_ENABLED\n}\n\nmingw {\n    QMAKE_CXXFLAGS += -Dmain=SDL_main\n    QMAKE_LFLAGS   += -mconsole\n\n    INCLUDEPATH += C:\\msys64\\mingw64\\include\\SDL2\n    INCLUDEPATH += C:\\msys64\\mingw64\\include\\freetype2\n\n    LIBS += -lmingw32 -lSDL2main -lSDL2.dll\n    LIBS += -lSDL2_image.dll -lfreetype.dll -lpcre2-8.dll -lpng.dll -lglew32.dll -lboost_system-mt -lboost_filesystem-mt -lopengl32 -lglu32\n    LIBS += -static-libgcc -static-libstdc++\n    LIBS += -lcomdlg32\n}\n\nVPATH += ./src\n\nSOURCES += \\\n    action.cpp \\\n    bloom.cpp \\\n    caption.cpp \\\n    dirnode.cpp \\\n    file.cpp \\\n    gource.cpp \\\n    gource_settings.cpp \\\n    gource_shell.cpp \\\n    key.cpp \\\n    logmill.cpp \\\n    main.cpp \\\n    pawn.cpp \\\n    slider.cpp \\\n    spline.cpp \\\n    textbox.cpp \\\n    user.cpp \\\n    zoomcamera.cpp \\\n    formats/apache.cpp \\\n    formats/bzr.cpp \\\n    formats/commitlog.cpp \\\n    formats/custom.cpp \\\n    formats/cvs-exp.cpp \\\n    formats/cvs2cl.cpp \\\n    formats/git.cpp \\\n    formats/gitraw.cpp \\\n    formats/hg.cpp \\\n    formats/svn.cpp \\\n    tinyxml/tinystr.cpp \\\n    tinyxml/tinyxml.cpp \\\n    tinyxml/tinyxmlerror.cpp \\\n    tinyxml/tinyxmlparser.cpp \\\n    core/conffile.cpp \\\n    core/display.cpp \\\n    core/frustum.cpp \\\n    core/fxfont.cpp \\\n    core/logger.cpp \\\n    core/mousecursor.cpp \\\n    core/plane.cpp \\\n    core/png_writer.cpp \\\n    core/ppm.cpp \\\n    core/quadtree.cpp \\\n    core/regex.cpp \\\n    core/resource.cpp \\\n    core/sdlapp.cpp \\\n    core/seeklog.cpp \\\n    core/settings.cpp \\\n    core/shader.cpp \\\n    core/shader_common.cpp \\\n    core/stringhash.cpp \\\n    core/texture.cpp \\\n    core/tga.cpp \\\n    core/timezone.cpp \\\n    core/vbo.cpp \\\n    core/vectors.cpp\n\nHEADERS += \\\n    action.h \\\n    bloom.h \\\n    caption.h \\\n    dirnode.h \\\n    file.h \\\n    gource.h \\\n    gource_settings.h \\\n    gource_shell.h \\\n    key.h \\\n    logmill.h \\\n    main.h \\\n    pawn.h \\\n    slider.h \\\n    spline.h \\\n    textbox.h \\\n    user.h \\\n    zoomcamera.h \\\n    formats/apache.h \\\n    formats/bzr.h \\\n    formats/commitlog.h \\\n    formats/custom.h \\\n    formats/cvs-exp.h \\\n    formats/cvs2cl.h \\\n    formats/git.h \\\n    formats/gitraw.h \\\n    formats/hg.h \\\n    formats/svn.h \\\n    tinyxml/tinystr.h \\\n    tinyxml/tinyxml.h \\\n    core/bounds.h \\\n    core/conffile.h \\\n    core/display.h \\\n    core/frustum.h \\\n    core/fxfont.h \\\n    core/gl.h \\\n    core/logger.h \\\n    core/mousecursor.h \\\n    core/pi.h \\\n    core/plane.h \\\n    core/png_writer.h \\\n    core/ppm.h \\\n    core/quadtree.h \\\n    core/regex.h \\\n    core/resource.h \\\n    core/sdlapp.h \\\n    core/seeklog.h \\\n    core/settings.h \\\n    core/shader.h \\\n    core/shader_common.h \\\n    core/stringhash.h \\\n    core/texture.h \\\n    core/tga.h \\\n    core/timezone.h \\\n    core/vbo.h \\\n    core/vectors.h\n\nDISTFILES += \\\n    data/shaders/bloom.frag \\\n    data/shaders/shadow.frag \\\n    data/shaders/text.frag \\\n    data/shaders/bloom.vert \\\n    data/shaders/shadow.vert \\\n    data/shaders/text.vert\n"
        },
        {
          "name": "m4",
          "type": "tree",
          "content": null
        },
        {
          "name": "resources",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}