{
  "metadata": {
    "timestamp": 1736566342176,
    "page": 95,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "AaronFeng753/Waifu2x-Extension-GUI",
      "stars": 13498,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "Change_log.md",
          "type": "blob",
          "size": 85.3642578125,
          "content": "# Change log\n---\n#### [📝中文版 更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/Change_log_CN.md)\n\n#### [💾Latest stable release](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest)\n---\n## v3.121.01\n- New RIFE frame interpolation model: [v4.22-lite], provides higher quality than the previous models.\n- Add introduction document for Real-ESRGAN models.\n- Add a [Select folder] button for [Output Folder].\n- When switching the \"Image Style\" of the ESRGAN engine, the model's image style label in the engine settings tab will be highlighted.\n- Add a [Help] button for [Import ESRGAN models] settings.\n---\n## v3.120.01\n- NEW ESRGAN Model: [Photo-Small-W2xEX], fast photo upscaling model, achieved higher photo upscaling quality compared to [Universal-Fast-W2xEX] while maintained similar speed.\n- NEW Feature: AV1 Video Encoder support.\n- Add SVT-AV1 software encoder.\n- Add Nvidia, Intel, and AMD AV1 hardware encoder.\n- Update settings preset to utilize the new model.\n- Better compatibility with AV1 video codec.\n- Update RIFE engine.\n- Update GIF plugin.\n- Update other plugin.\n---\n## v3.119.01\n- NEW Feature: Better GIF quality, GIF now supports [Transparent image Clarity Enhancement].\n- V2 update for Omni-Mini Real-ESRGAN model, improving its image quality without compromising performance.\n- Improve the compatibility of [Video Color Management].\n---\n## v3.118.01\n- New RIFE model: [v4.17-lite], compared to the previous Lite model, it can generate more stable frames.\n- Additional options for quick Image resize and compress:\n- [Do not upscale]: If images resolution is lower then the Custom resolution, they will only be converted(compressed).\n- [Ignore scale ratio]: Always ignore scale ratio settings when using [Convert format ONLY (Static Images)].\n- [Skip if not smaller]: Converted image will be deleted if its file size is not smaller than the original. The original image will be copied to output folder instead.\n- [Skip low resolution images]: When [Convert format ONLY (Static Images)] and [Resize] is enabled, only process images when their resolution is higher then Custom resolution.\n- Fix bug: [keep aspect ratio by expanding] not working properly when upscaling images.\n---\n## v3.117.01\n#### Change log:\n- New Real-ESRGAN model: [Omni-Mini-W2xEX], a super fast tiny model designed to mimic the quality and speed of RTX Super-resolution, bring RTX Super-res capability to ALL platforms.\n- Upgrade Real-ESRGAN [Sequential decoding] to [Image decode threads]. Boost image upscaling performance by auto adjust decode threads based on PCs hardware, up to 87.94% faster during testing.\n- Fix bug: In some situations, number of frames does not meet expectation after frame interpolation.\n---\n## v3.116.01\n#### Change log:\n- New RIFE model: [rife-v4.15-lite], compared to the previous Lite model, it offers higher quality, faster speed, and reduced VRAM usage.\n- New feature: Added a [Resize] option for [Convert format ONLY(Static Image)], using fast scaling algorithm (not super-resolution), capable of instant and simultaneously scaling, compressing, and converting image formats.\n- Updated automatic thread allocation algorithm for RIFE frame interpolation engine, improving stability.\n- Added a [Reset] right-click menu option for [Static Image Quality], facilitating quick resetting of quality values to 100.\n- Optimized code performance.\n- Improved UI.\n- Fixed issue: [Transparent image Clarity Enhancement] may cause dark parts of some images to become semi-transparent.\n- Fixed potential UI option conflicts.\n- Removed some historical legacy UI errors.\n---\n## v3.115.01\n#### Change log:\n- NEW [Photo-HQ-W4xEX] Real-ESRGAN model, a high-quality photo upscale model. Compared to previous models, it better preserves details and generates cleaner images.\n- New Feature: [Automatic Video Deinterlacing], automatically detect interlaced videos and perform deinterlacing before upscaling (frame interpolation).\n- Optimize UI performance\n- Improved compatibility with some regional formats.\n---\n## v3.114.01\n#### Change log:\n- NEW RIFE frame interpolation model: [RIFE V4.17], which has higher quality and can generate more stable frames compared to the previous v4.14 model.\n- Significantly faster video encoding speed: When [Process video by segment] is enabled, a new method will be used to assemble video segments, reducing the time spent assembling segments from minutes to seconds in tests.\n- Improved the [Video Color Management] UI to support direct selection of all pixel formats supported by the current video encoder.\n- Switch default video container format to MKV.\n- Optimized UI performance.\n- Fixed an issue when [Process video by segment] is enabled, frame interpolation might cause the video stream and audio stream to be out of sync.\n- Fixed an issue where a small part of the content might be omitted at the end of the video when [Process video by segment] is enabled.\n- Fixed an issue where using [Optimize Looped video] might generate extra duplicate frames, resulting in unsmooth loop playback.\n- Fixed an issue where extra frames appeared at the end of the video after frame interpolation.\n- Fixed an issue where enabling both [Target FPS] and [Optimize Looped video] could cause errors.\n- Fixed an issue where using [Target FPS] to interpolate very short videos resulted in an actual frame rate lower than expected.\n- Fixed a conflict issue between [Speed Boost] and [Optimize Looped video].\n- Fixed a conflict issue between [Scene Shift Detection] and optimized looped videos.\n- Fixed compatibility issues with the latest version of ffmpeg and updated the built-in ffmpeg to the latest version, preparing for future support of more video encoders and decoders.\n- Fixed compatibility issues with the latest version of ffprobe and updated the built-in ffprobe to the latest version.\n- Fixed a rare issue where Real-ESRGAN might freeze when processing videos and animated images.\n- Updated the User Guide, adding jump links to the directory.\n- Updated daily tips.\n- Corrected typos.\n---\n## v3.113.01\n#### Change log:\n- NEW UI Design for [Video Encoder] settings.\n- NEW Feature: ProRes video decoding & encoding. (Location: Video settings tab, Video Encoder)\n- NEW Feature: [Sequential decoding] for Real-ESRGAN, reduce CPU usage during image decoding and increase performance.\n- Performance optimization for [Anime-HQ-W4xEX] Real-ESRGAN model.\n- Better multi-threaded performance when upscaling images using Real-ESRGAN.\n- [Encoding Quality] and [Hardware-accelerated encoding] are now merged with the new [Video Encoder] settings.\n- Fix bug: Some PCs will stuck at image decoding for a long time when using RealESRGAN to upscale static images.\n---\n## v3.112.01\n#### Change log:\n- NEW [Anime-HQ-W4xEX] Real-ESRGAN model for High Quality Anime upscaling, which retains detail better and can generate cleaner image compare to previous models.\n- NEW Feature: [Video Color Management], software now can automatically adjust color-related parameters to achieve better color accuracy, or you can adjust these parameters by yourself. (Location: Video settings tab)\n- Updated [Auto optimize engine settings] to boost the performance of Real-ESRGAN, up to 48% faster than the previous version.\n- Better RIFE Auto model selection, now you can tell Waifu2x to use v4.14 model instead of v4.13-lite when automatically selecting model.\n- Some UI improvements.\n---\n## v3.111.01\n#### Change log:\n- NEW [RIFE-v4.14] model for Higher quality video frame interpolation, which could generate more stable results compare to previous models.\n- NEW [RIFE-v4.13-lite] model for Fast and High quality frame interpolation, which is 30% faster than 4.14 model but could achieve similar quality.\n- NEW [Auto-Select] feature, automatically select rife model based on your PCs hardware and resolution of the video. (Enabled by default)\n- Built-in [User guide] to help new users quickly get started with the software. (Location: Home tab, big question mark icon in the lower right corner)\n- [Universal-Fast-W2xEX] RealESRGAN Model is now up to 30% faster by updating [Auto optimize engine settings].\n- Update [Settings presets] to utilize the new [Universal-Fast-W2xEX] RealESRGAN Model.\n- Fix some UI issues.\n- Fix bug: Pausing while processing frame folders may cause the software to crash.\n---\n## v3.110.01\n#### Change log:\n- NEW [Universal-Fast-W2xEX] Model for RealESRGAN engine, designed for fast photo upscaling, 30.5x faster than the RealESRGAN-x4plus model while retain decent image quality.\n- NEW Feature: Now you can select [Preset] for Nvidia and Intel hardware encoders, which will affect the quality of the result video. (Location: Video settings, Hardware-accelerated Encoding)\n- NEW Feature: [Stop then excute action], Stop right after the currently \"Processing\" files are finished, then execute an action. (Location: Home tab, in the \"Do nothing(when finished)\" options list)\n- Add [Copy] and [Paste] buttons for the right-click menu of [Output path folder].\n- Update several plugins.\n- Some UI improvements\n- [Optimize Looped video] setting will be saved like other settings.\n- Fix bug: In certain situations, NCNN-Vulkan engines will randomly get stuck.\n---\n## v3.109.01\n#### Change log:\n- NEW Feature: [Encoding Quality], adjust video encoding quality when using software and hardware encoders. (location: video settings tab)\n- NEW Feature: [Stop process new files], automatically stop after finished processing current tasks. (Location: Home tab, in the \"Do nothing(when finished)\" options list)\n- When output upscaled images, replace [_Compressed] with [_Q<Static Images Quality value>], like [_Q95], when [Static Images Quality] taken effect.\n- NEW video subtitle processing method, better video compatibility.\n- Automatically disable Dynamic RAM Cache after the RAM Disk is detached.\n- Fix bug: When there are multiple subtitles in one video, the output video might be broken.\n---\n## v3.108.01\n#### Change log:\n- NEW Feature: [Import frames folder], browse and add folders of Frames Images for frame interpolation.\n- NEW Feature: [Reduce Video FPS], reduce frame rate of the Video before frame interpolation and upscaling. (Additional settings tab, Tools section)\n- NEW Feature: [Copy Skipped files], when enabled, also Copy Skipped files to the output folder. (Home tab, output folder section)\n- NEW Feature: Now you can adjust how many threads [Convert format ONLY (Static Images)] will use by adjusting: [Engine settings, Number of threads (Super-resolution), Image].\n- Significantly improved UI performance, now the Files list UI can handle large amount of files much better than before.\n- Optimize code related to video processing.\n- Add m4v to the default video file extensions list.\n- Fix bug: Real-CUGAN might output incorrect color in certain situations.\n- Fix several bugs related to [Convert format ONLY (Static Images)].\n- NEW Feature: [Frame interpolation for frames folder] now supports [Delete original files], [Replace original fils] and [Output folder]\n- Fix bug: When using [Frame interpolation for frames folder], some original frames might be incorrectly deleted after frame interpolation.\n---\n## v3.107.01\n#### Change log:\n- NEW Feature: [Speed Boost 2.0], HUGE Speed boost for duplicated frames detection, faster & more accurate, which means [Speed Boost 2.0] can save way more time then previous version.\n- NEW Feature: More [Save as] formats for animated webp: apng, mp4 and webm.\n- NEW Feature: [Sync video aspect ratio], Synchronize sample aspect ratio with display aspect ratio.\n- Add warning pop-up for [Delete original files] and [Replace original file] options.\n- Improve image quality of APNG and WebP upscaling.\n- Improve UI, and fix incorrect description.\n- Complete translation.\n- Fix bug: Broken output when using some engines to upscale WebP and APNG.\n- Fix bug: When running on PCs with new(high-end) CPUs, occasionally waifu2x will stuck during frame interpolation.\n- Fix bug: When frame interpolation and RTX Super-res both enabled, Video sampling might stop working.\n---\n## v3.106.01\n#### Change log:\n- NEW Feature: [Scene Shift Detection 2.0], HUGE Speed boost for Scene Shift Detection, 65x faster than the previous version, which means Scene Shift Detection won't cost any extra time during frame interpolation.\n- NEW Feature: [Gif & APNG] option, when enabled, the Animated WebP quality value will also be used when saving APNG and GIF as WebP. (location: Image settings tab)\n- NEW Feature: Add [Sync with Home] option for Animated WebP, when enabled, the quality value of Animated WebP will be synced with [static images quality] value at the Home tab. (location: Image settings tab, enabled by default)\n- Improved video quality, especially when using hardware encoders.\n- When [Gif & APNG] option of Animated WebP is enabled, gif and apng will automatically be saved as WebP.\n- Fix bug: In some situations, [Speed boost] could not restore frames and will result in failure.\n- Fix bug: In some situations, the [put PC to sleep after finished] feature won't work.\n- Fix bug: When [Video sampling] enabled, RTX Super-resolution engine might unable to upscale the video.\n- Fix bug: Click the \"Execute NOW\" button of finish action might crash the software.\n- Fix bug: In some rare situations, might unable to encode the final video when process video by segment is enabled.\n---\n## v3.105.01\n#### Change log:\n- NEW Feature: Animated WebP support, ALL super-res engines can now upscale Animated WebP images.\n- NEW Feature: Now you can save Animated WebP as GIF. (location: Image settings tab)\n- NEW Feature: Now you can adjust the quality of upscaled Animated WebP. (location: Image settings tab)\n- Variable frame rate support for Animated WebP, other animated pics formats will also support this in the future updates.\n- Improved launcher, more issue detection and better pop-up message.\n- Fix bug: Always failed to upscale APNGs when their suffix are in upper cases.\n- Fix bug: When loading settings preset files from older version, some options will be reseted.\n- Fix bug: Messages may contain errors when processing Animated WebP.\n---\n## v3.104.01\n#### Change log:\n- NEW Feature: [Auto archive Files List]: Automatically saves Files List every 15 seconds after starting to process files.(Location: Additional settings tab, enabled by default)\n- NEW Feature: [Skip Failed files]: Always skip \"Failed\" files in the files list.(Location: Additional settings tab, disabled by default)\n- Improved [Auto Engine optimization] for Real-ESRGAN engine, better picture upscaling performance on most PCs.\n- Code optimization, imporve UI performance.\n- Add some necessary messages for Save(Read) settings presets.\n- Fix bug: The [Priority] setting of RTX Super-resolution engine was not working.\n- Fix bug: Always re-process finished files.\n- Fix bug: Thread blocking when using Real-ESRGAN engine with auto adjusted settings.\n- Fix bug: UI shrinks after loading settings preset file.\n- Update ImageMagick.\n- Better tooltips.\n---\n## v3.103.01\n#### Change log:\n- NEW Feature: [Save & Read settings presets files], Now you can save(and read) your settings as custom preset files.\n- NEW Feature: [Transparent image Clarity Enhancement] now supports multi-threading, significantly improves efficiency.\n- NEW Feature: Add a right click menu for the [Limiter] of [scene shift detection], now user can select how many threads will be running during [scene shift detection].\n- NEW Feature: Now software will automatically check the integrity of current installation, and will display a warning when files are missing.\n- Move the [Prioritize Image Quality] option of RTX Super-resolution to Home tab for easy access.\n- Upscaling APNG while enabled [Transparent image Clarity Enhancement] is now faster, up to 50% faster compare to the last version.\n- Faster APNG upscaling when using SRMD-CUDA and RTX Super-resolution.\n- Improve UI performance.\n- Add necessary status messages for [Transparent image Clarity Enhancement] to avoid confusion.\n- Other performance optimization.\n- Update ImageMagick.\n---\n## v3.102.01\n#### Change log:\n- NEW feature: RTX Super-resolution engine now supports APNG upscaling.\n- NEW Feature: ALL super-res engines now supports [Transparent image Clarity Enhancement] when upscaling APNG.\n- Improve SRMD-CUDAs compatibility with media that has alpha channel.\n- Improve SRMD-CUDAs compatibility with APNG.\n- Performance optimization.\n- Fix bug: UI error when using [Quick engine switch].\n- Fix bug: Progress display error when using some engines to upscale APNGs.\n- Complete translation.\n---\n## v3.101.01\n#### Change log:\n- New Feature: [Prioritize image quality] option for RTX Super resolution, improve image quality in most situations, especially when upscaling low resolution media.\n- New Feature: [Settings Presets] now supports RTX Super resolution engine.\n- Add [Always disable denoise] option for RTX Super resolution.\n- Improved device compatibility of RTX Super resolution.\n- Performance optimization.\n- Update ImageMagick.\n- Fix bug: Might unable to upscale video when using RTX Super resolution and HEVC encoding at the same time.\n- Fix bug: Auto-retry is not working when using RTX Super resolution to upscale videos.\n- Fix typo in the tooltips.\n---\n## v3.100.01\n#### Change log:\n- Significantly improved [Files List] UI performance, up to 35x faster files loading speed in the test(16K media files in 800 folders)\n- Improved code efficiency related to video, gif and apng processing.\n- Code optimization, improved UI and scheduler performance.\n- Improved video quality when using Nvidia video encoder\n- Better video compatibility when using RTX Super-res.\n- Improve mp4 conversion to avoid potential compatibility issue.\n- Improved audio quality when encoding mp4 video.\n- Improve stability of RTX Super Resolution engine.\n- Simplified video compatibility checker.\n- Add a \"help\" button next to the RTX Super-res on the compatibility test page.\n- The result of the compatibility test button at the engine settings of RTX Super-res is now connected to the [Compatibility test] tab.\n- Fix bug: Unable to upscale some videos when using RTX Super Resolution.\n- Fix bug: Audio and video might out of sync when using RTX Super Resolution to upscale some videos.\n- Fix bug: When using RTX Super Resolution, might unable to upscale video when frame interpolation is enabled.\n- Fix bug: Unable to detect and fix some video compatibility issue of RTX Super Resolution.\n- Fix bug: In some rare occasions, unable to detect duplicated files when loading files to [Files List].\n---\n## v3.99.01\n#### Change log:\n- NEW Super-resolution Engine: RTX Super Resolution, a fast and light-weight upscaler designed for Nvidia RTX GPUs.\n- Exclusive enhancements for RTX Super Resolution like Alpha channel support, various input/output formats and more.\n- New Feature: [Auto Apply] option for Custom resolution: When adding new files, the current [Custom resolution] setting will be automatically applied to ALL files.\n- When upscaling and interpolating videos, videos with frame rate higher than the specified frame rate are no longer simply skipped, but only upscaled.\n- Update FFmpeg\n- Update ImageMagick\n- Fix bug: Real-ESRGAN can not upscale media correctly when 2d and 3d models are different.\n- Fix bug: When using certain settings, unable to encode video after upscale and frame interpolation.\n- Fix bug: Incomplete closing process.\n- Fix typo.\n---\n## v3.98.01\n#### Change log:\n- NEW model for Real-ESRGAN engine: Photo-Conservative-x4\n- NEW Feature: [Pause after decoding] option, automatically pause after finished decoding the video, until the user clicks the [Continue] button. (Additional settings, disabled by default)\n- NEW Feature: Split the models list of Real-ESRGAN to 2 lists, [3D Real-life] and [2D Anime] for easier use.\n- Smarter [Limiter] for Scene Shift Detection, automatically adjusts the load according to the progress.\n- Optimize scene shift detection scheduler.\n- Improve GUI.\n- Improve the stability of [Limiter] for Scene Shift Detection.\n- Update ImageMagick.\n- Update ffmpeg.\n- Code optimization.\n- Fix bug: [Always pre-process images with Alpha Channel] not working properly when processing images with invalid alpha channel.\n- Fix bug: Some warning messages are outdated and incorrect.\n- Fix bug: [Keep Aspect Ratio By Expanding] not working as intended.\n---\n## v3.97.01\n#### Change log:\n- ★ NEW Real-ESRGAN models: RealESR-General-x4v3 and RealESR-General-WDN-x4v3\n- ★ NEW Feature: [Same as original image] option, save image as the same format of the original image.(only static images)\n- ★ NEW Feature: [Reserved VRAM], reserve part of VRAM to improve stability, you can adjust it at [Additional settings] tab.\n- NEW Feature: Add [Reset to default] buttons for Input file extensions.\n- NEW Feature: Now you can disable [Constant Rate Factor (CRF)] in the Custom video settings.\n- Improved Real-ESRGAN auto settings optimization.\n- Improve UI and default settings.\n- Code optimization.\n- Update ImageMagick.\n- Update ffmpeg.\n- Fix bug: [Bitrate(video)] setting in the [Custom video settings] often will not take effect.\n- Fix bug: Unable to save images to PNG when using [Convert format ONLY (Static Images)].\n- Fix bug: Some output images will be broken when using [pro] models of Real-CUGAN.\n- Fix bug: UI issues related to Real-ESRGAN engine.\n---\n## v3.96.01\n#### Change log:\n- New RIFE-v4.6 model, better frame interpolation quality.\n- New feature: [Auto-Create output folders], automatically create output folder when needed, including all parent folders.\n- New feature: Now RIFE v4 and v4.6 models supports TTA.\n- Better auto engine settings optimization algorithm.\n- Auto engine settings optimization now supports all Real-Cugan models.\n- Improve UI.\n- Update Rife-ncnn-vulkan.\n- Update ImageMagick.\n- Update ffmpeg.\n- Fix bug: Switch Real-Cugan models won't work properly when processing videos and GIFs.\n---\n## v3.95.23\n#### Change log:\n- NEW Feature: New aspect ratio strategy: [Specify Minimum resolution]\n- Performance optimization.\n- Better error report and tooltip.\n- Fix bug: When processing static images, upscale ratio with decimal digits may not work properly.\n- Fix bug: When processing static images, 1x scale ratio isn't working when using some engines.\n- Fix bug: When processing static images, [Specify Width(Height) ONLY & Keep Aspect Ratio] not working properly.\n- Fix translation error.\n- Update heif plugins.\n- Update ImageMagick.\n- Update ffmpeg.\n---\n## v3.95.01\n#### Change log:\n- NEW Feature: Display current progress when Finding scene shifts.\n- Newly redesigned internal image resizer, better compatibility and image quality.\n- Improved image quality.\n- Improved compatibility.\n- Performance optimization.\n- Reconstruct some codes to improve stability.\n- Update FFmpeg\n- Update ImageMagick\n- Remove some unnecessary warning messages.\n- Fix bug: In certain situations, failed to output final image when using Real-ESRGAN and [Transparent image Clarity Enhancement] at the same time.\n- Fix bug: In some situations, the final image is incompatible with some image viewers.\n- Fix bug: [Automatic file list scrolling] was not working.\n- Fix bug: UI logical error.\n- Fix bug: Unable to reach target frame rate after video frame interpolation.\n---\n## v3.94.01\n#### Change log:\n- NEW feature: Now [Scene Shift Detection] can running in parallel with video frame interpolation, will significantly improve performance and efficiency.\n- NEW feature: Add [Quick Engine Switch]. at [Home] tab for easy super-res engine switching.\n- NEW feature: ALL 6 IFRNet models now supports \"Auto-Adjust\" multithreading.\n- NEW feature: ALL 10 RIFE models now supports \"Auto-Adjust\" multithreading.\n- NEW feature: Thread [Limiter] option for [Scene Shift Detection], can improve PC responsivity during during [Scene Shift Detection].\n- Improve code efficiency and stability.\n- Update FFmpeg and ImageMagick\n- Bug fix.\n---\n## v3.93.01\n#### Change log:\n- NEW frame interpolation engine: IFRNet-ncnn-vulkan.\n- Add new \"Pro\" models for Real-CUGAN.\n- Faster Real-CUGAN super-resolution.\n- Update multiple Engines, reduce overall VRAM usage.\n- Real-CUGAN now supports model switching.\n- Update auto engine settings optimization strategy.\n- More accurate detection method for variable frame rate video.\n- Improve compatibility with variable frame rate video.\n- Improve user interface.\n- Update ALL frame interpolation engines.\n- Update Real-CUGAN, RealSR, SRMD(vulkan), Waifu2x(vulkan).\n- Fix multiple bugs, fix translation error.\n---\n## v3.92.01\n#### Change log:\n- NEW Feature: [Transparent image Clarity Enhancement]. Improve clarity when upscaling images with transparent background(Alpha channel).\n- ALL engines supports [Transparent image Clarity Enhancement] when processing Static Images and PSD.\n- NEW Feature: After the compatibility test, automatically switch to compatible engines for new users.\n- Improve Auto-optimize Engine settings.\n- Improve UI performance.\n- Fix bug: Unexpected frame rate change of the result video.\n- Other bug fix and improvements.\n---\n## v3.91.01\n#### Change log:\n- New Feature: Import and use 3rd party model for Real-ESRGAN engine.\n- New Feature: Bring back lossless PNG compression for static images.\n- New Feature: Bit depth adjustment and 16 bit image output for Waifu2x-caffe engine.\n- New Feature: Now you can adjust the size of status console.\n- Improve image quality when using custom resolution.\n- Better denoise levels support for Real-CUGAN native 4x upscale.\n- Smarter model picking for Real-CUGAN.\n- Improved automatic multithreading, better utilize the performance of high-end PCs.\n- [Constant Rate Factor (CRF)] in the [Custom video settings] now supports more encoders.\n- Improve VFR video detection.\n- Some UI improvements.\n- Improve network stability for checking new updates and update QR code.\n- Update several plugins.\n- Fix multiple bugs.\n---\n## v3.90.01\n#### Change log:\n- Faster Real-ESRGAN super-resolution, up to 240% faster than previous version.\n- Faster Waifu2x super-resolution, up to 320% faster than previous version.(Waifu2x-NCNN-Vulkan)\n- New AnimeVideo-v3 model for Real-ESRGAN engine, better and faster anime video upscale.\n- New Feature: Save GIF as APNG.\n- New Feature: [Auto empty Files List], Automatically empty Files List after finished processing.(Disabled by default, additional settings)\n- Improve the auto multi-threading performance of Real-ESRGAN and Waifu2x-NCNN-Vulkan.\n- Smarter auto multi-threading for Real-ESRGAN and Waifu2x-NCNN-Vulkan.\n- Faster image pre-processing.\n- Improve default settings.\n- Some internal structural improvements for GUI.\n- Fix bug: Unable to assemble PSD files.\n- Some other bug fix and improvements.\n---\n## v3.89.01\n#### Change log:\n- Faster Real-CUGAN super-resolution, up to 60% faster than previous version\n- Faster and more Efficient frame interpolationm when using RIFE.\n- New feature: Add new option for Real-CUGAN, [Always use 2x models], could improve image clarity in some situations.\n- New feature: Save images as JPEG XL format(.jxl)\n- New feature: Now you can adjust image quality when save images as AVIF format\n- Smarter auto model selection for Real-CUGAN\n- Reduce the VRAM usage of RIFE\n- Improve the auto multi-threading performance of RIFE\n- Improve auto engine settings optimization.\n- Fix multiple BUGs.\n---\n## v3.88.01\n#### Change log:\n- NEW Super-Resolution Engine: Real-CUGAN-NCNN-Vulkan, high quality 2D anime upscaler.\n- New Feature: New Rife-V4.0 model, Faster frame interpolation and less VRAM usage.\n- New Feature: Save images as Jfif and Jpeg.\n- New Feature: Add Real-CUGAN model for Waifu2x-Caffe.\n- Improve custom resolution mechanism, and performance optimization.\n- Improve Video, GIF and APNG compatibility.\n- Improve settings presets and UI.\n- Fix multiple bugs.\n---\n## v3.87.01\n#### Change log:\n- New Feature: Now you can choose the Container format of the video output.(At Video Settings tab)\n- New Feature: [Keep subtitles (MKV)]: Include subtitles in the final video output.(At Video Settings tab)\n- New Feature:[Convert format ONLY (Static Images)]: Only convert format of the images, no further processing.(Additional settings---Tools)\n- New Feature: Automatic chroma adjustment option for HEIF/HEIC images.\n- New Feature: [Save CFR MP4 to RAM]: Re-direct CFR Mp4 cache to Dynamic RAM Cache.(Optional,Not enabled by default,Additional settings)\n- Improve multi-threading performance.\n- Update UI and fix typo.\n---\n## v3.86.74\n#### Change log:\n- Happy New Year 2022!\n- New Audio processing method, better Compatibility, better Quality and Faster speed.\n- Improve Auto engine settings optimization.\n- Improve GUI, Update plugins.\n- Fix multiple bugs.\n---\n## v3.86.02\n#### Change log:\n```\nv3.86.02:\n- Fix bug: Real-ESRGAN Video & GIF upscale fix\nv3.86.01:\n- New Feature: Add support for RealESRGANv2-animevideo-xsx2(4) model.\n- NEW Feature: Save images as HEIC/HEIF format.\n- Faster 2D-Anime Video and GIF upscale speed when using RealESRGAN-NCNN-Vulkan engine.\n- Multiple GUI improvements to fully utilize the new RealESRGAN model.\n- Enhance the compatibility of RealESRGAN-NCNN-Vulkan engine.\n- Improve Performance and Compatibility of GIF processing.\n- Fix multiple bugs.\n```\n---\n## v3.85.01\n#### Change log:\n- NEW Feature: Save APNG as other formats, including gif, mp4, webp and webm. (At Image settings)\n- NEW Feature: Support GIF with variable frame rate.\n- Introduce [Auto I/O redirection] to greatly improve compatibility.(Enabled by default, Additional settings)\n- New way to Save and Read GIF, Faster and Better image quality.\n- Improve the [Save as other formats] function of GIF, better device compatibility and performance.\n- Improve UI.\n- Update several plugins, remove useless plugins.\n- Fix multiple bugs.\n---\n## v3.84.01\n#### Change log:\n- New Feature: Save GIF as other formats, including mp4, webp and webm. (At Image settings)\n- New Feature: [Optimize Looped video] option, improve the effcet of frame interpolation.when processing looped video.(At Additional settings)\n- Significantly improved the speed and space usage of [Pre-processing Boost].\n- Improve video quality, smarter video quality control.\n- New hardware decoders: OpenCL and Vulkan.\n- New aspect ratio strategy: Specify Width(or Height) ONLY.\n- Update FFmpeg and improve compatibility.\n- Fix multiple bugs.\n- Improve UI, compatibility test and daily tips.\n---\n## v3.83.21\n#### Change log:\n- NEW Feature: Save images as PSD.\n- Speed up the program startup speed.\n- Improve user experience.\n- More automation, improve default settings.\n- Improve video quality, improve video conversion speed, reduce space usage.\n- Update FFmpeg and ImageMagick.\n- Fix bug: In some situations, video stream will become shorter when [Pre-processing Boost] enabled.\n- Fix UI issues.\n---\n## [v3.83.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.83.01)\n#### Change log:\n- NEW Feature: [Pre-processing Boost]: Remove ALL unnecessary duplicate frames in the video before processing. Can improve both the processing speed and effcet of frame interpolation.\n- NEW Feature: [Remove dupduplicate frames ONLY (Video)]: ONLY remove all unnecessary dupduplicate frames in the video, no further processing.\n- NEW Feature: [Remember window size].\n- NEW Feature: [RAM Cache Validity Check] toggle, now you can use RAM Disk created by other software after disable this check.\n- NEW Feature: [Auto Scroll] toggle for console.\n- NEW Feature: Now GUI will be able to detect if the cache disk is full during frame interpolation and super-resolution.\n- Global optimization, improve code efficiency, reduce GUI's CPU usage.\n- Improve thread scheduling.\n- Improve video quality, especially when using hardware encoder.\n- Improve MP4 conversion.\n- Update FFmpeg, ImageMagick.\n- Many other improvements.\n- Fix multiple bugs.\n---\n## [v3.81.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.81.01)\n#### Change log:\n- 🌟NEW Super-Resolution Engine: RealESRGAN-NCNN-Vulkan.\n- 🌟Significantly improved the UI performance, especially the Files List UI.\n- 🌟NEW Feature: [Video sampling]: Only process part of the video from the start to the end of the time you set.(At [Additional settings] tab)\n- Improve internet connection speed.\n- Add more settings presets\n- Driver version detection for NVENC encoder.\n- Improve MP4 conversion.\n- Improve pop-up messages.\n- And many other improvements.\n- Fix multiple bugs.\n---\n## [v3.73.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.73.14)\n#### Change log:\n- New method for cut video, significantly reduced the extra time cost of processing video by segment.\n- Further improve the [Auto-adjust] for frame interpolation.\n- Further improve the [Optimize Settings] for super-res engines.\n- Reduce the time and resource cost when processing video with certain FPS values.\n- Faster Internet connection speed.\n- Fix several bugs.\n---\n## [v3.72.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.72.13)\n#### Change log:\n- NEW Feature: Upgrade [Auto-reduce] to [Auto-Adjust], now GUI can automatically adjust the number of threads for frame interpolation engine based the source video and PCs hardware.\n- All non-natively supported image formats will be pre-processed before being scaled.\n- AVIF and HEIC images support.\n- Improve [Optimize Settings] for super-resolution engine.\n- Fix bug: frame rate of the result gif is wrong.\n- Fix bug: Sometimes unable to open local html.\n---\n## [v3.71.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.71.01)\n#### Change log:\n- New feature: Add [Optimize Settings] button for helping user adjust engine settings based on PCs hardware,including [Block(Tile) size] and [Number of threads].(At [Engine settings] tab)\n- Now you can tell GUI to stop showing you warning when enable Hardware-accelerated Encoding & Decoding.\n- Resume progress when video frame cache in the RAM is lost.\n- Add [GeForce RTX ON] switch for SRMD-CUDA engine.\n- Update FFmpeg, ImageMagick, SRMD-CUDA.\n- Show a warning when enable [Speed Boost].\n- Fix 10 bugs.\n---\n## [v3.70.02](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.70.02)\n#### Change log:\n- NEW Feature: [Dynamic RAM Cache]: Now GUI can save & read video caches(frames) from the RAM, which is a lot faster and will protect the lifespan of your hard drive.\n- NEW Feature: [Target FPS]: Now you can specify the FPS of the result video(e.g. 120FPS).\n- NEW Feature: [Hardware-accelerated Decoding]: Now GUI can use GPU to accelerate video decoding.\n- NEW Feature: [Frame codec]: Now you can switch the codec of video frames to JPEG to reduce cache size.\n- NEW Feature: Now you can adjust the settings of GIF & APNG optimization, they are on the [Image settings] tab.\n- NEW Feature: PSD(Photoshop Document) support.\n- Improve GUI, Update Anime4K, and fix multiple bugs.\n- Fix bug: Unable to display frame interpolation progress correctly when [Multiple of FPS] is higher than [2].\n- Fix bug: All EMPTY parent folders will be deleted when delete a folder.\n- Fix bug: Unable to update processing progress if the processing speed is extremely fast.\n- Fix bug: GUI will becomes laggy when there are too many lines in the Console.\n- Fix bug: Sorting the files list by file name does not sort numbers logically.\n- Fix bug: Unable to adjust the window size correctly.\n---\n## [v3.52.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.52.11)\n#### Change log:\n```\nv3.52.11:\n- Fix typo.\n- Fix bug: Unable to detect scene shift correctly when processing Hight-res videos.\n- Fix bug: Unable to read images resolution in certain situations.\n- Fix bug: \"FrameAnalyzeMB\" was not deleted in certain situations.\n\nv3.52.10-beta:\n- New feature: \"Reset [Frame Analysis] Settings\" button.\n- Improve GUI.\n- Improve the default settings of [Frame Analysis].\n- Automatically switch to software encoder when hardware encoder unable to convert some videos to CFR MP4.\n- More detailed ERROR reports.\n- Fix bug: Unable to convert some videos to CFR MP4, caused by hardware encoder.\n- Fix bug: Unable to detect failures correctly when processing videos.\n- Fix bug: Pixel format parameter was ignored.\n```\n---\n## [v3.52.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.52.01)\n#### Change log:\n```\nv3.52.01:\n- New Feature: [Keep ALL parent folders]: Keep ALL the parent folders of the source file when output the result file to the output folder.\n- New Feature: Now you can change the extension(format) of the result video.\n- New Feature: Now you can choose which video Encoder to use when converting video to CFR MP4.\n- New Feature: [Hardware-accelerated Encoding]: Using GPU to accelerate video encoding.\n- New Feature: [Hyper-threading (SMT)] switch.\n- optimize multi-threading performance.\n- New Feature: Show available GPUs name when detecting GPU IDs for NCNN-Vulkan engines.\n- New Feature: New right-click menu option for [Settings Presets]:[Re-Apply Current Preset]\n- Show how many duplicate frames and scene shifts has been found.\n- Optimize the performance of [Speed Boost]&[Scene Shift Detection]\n- Better High DPI screen support.\n- Fix bug: compatibility test stuck at SRMD-CUDA.\n- Fix bug: even though PC passed DAIN-NCNN-Vulkan compatibility test, program will still tell the user that all frame interpolation engines are incompatible.\n- Fix bug: Unable to generate video when video stream is not the 0 stream.\n- Fix bug: Unable to assemble video when [Process video by segment]&[Custom video settings] are both enabled.\n\nv3.51.01-BETA:\n- New Feature: [Speed Boost]: Boost video processing speed by analyzing frames.\n- New Feature: [Scene Shift Detection]: Detect Scene Shift in the Video to improve the result of video frame interpolation.\n- New Feature: [Settings Presets]: Several settings presets provided by the developer.\n- New Feature: [Constant Rate Factor(CRF)] adjustment.\n- New Feature: [Daily Tip].\n- New RIFE-ncnn-Vulkan Model: rife-v3.0,rife-v3.1\n- Improve Video quality, Default settings, GUI and scale performance of Waifu2x-NCNN-Vulkan.\n- Update rife-ncnn-vulkan, Waifu2x-NCNN-Vulkan.\n- Fix bug: Unable to reset all custom video settings.\n```\n---\n## [v3.42.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.42.11)\n#### Change log:\n- Faster APNG processing.\n- New Faster methods for resize,assemble and optimize APNG.\n- Support for Videos with Multiple Audio Tracks.\n- Individual toggle for APNG optimization: [Optimize Gif&APNG].\n---\n## [v3.41.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.41.13)\n#### Change log:\n```\nv3.41.13:\n- New Feature: Automatically try to create output folder when the output folder does not exist.\n- New option for system tray menu.\n- Compatibility test for APNG plugins.\n- Chinese translation.\n- Fix bug: Unable to assemble APNG when there are \"%\" in the path.\n- Fix bug: Wrong message were displayed when all files lists are cleared.\n\nv3.41.01-beta:\n- New Feature: APNG(Animated PNG) support.\n- Improve GUI.\n- Some other improvements.\n\nv3.31.21-beta:\n- Performance optimization.\n- Update FFmpeg, ImageMagick.\n- Some other improvements.\n```\n---\n## [v3.31.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.31.13)\n#### Change log:\n- NEW Super-Resolution Engine: SRMD-CUDA (By @MrZihan).\n- Some improvements.\n- Fix bug: Frame rate of the result GIF is always 10fps.\n---\n## [v3.22.26](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.22.26)\n#### Change log:\n```\nv3.22.26:\n- New option for system tray menu.\n- Fix bug: Unable to naming images correctly when using Anime4k.\n- Fix bug: False error report.\n- Fix bug: Unable to continue process existing video cache when frame interpolation is enabled.\n\nv3.22.25-beta:\n- Optimize performance.\n- Improve description.\n- Improve stability.\n- Fix bug: Unable to continue process existing video cache when frame interpolation is enabled.\n\nv3.22.24-beta:\n- Improve quality of the result video.\n- Improve the naming of result files when using Anime4k engine.\n- Optimize performance.\n- Remove first time start tips.\n- Fix bug: Denoise level is still being loaded even though HDN is not enabled.\n- Fix bug: Crash when unable to read video or gif info correctly.\n- Fix bug: Unstable Internet connection might cause some unexpected error.\n\nv3.22.23-beta:\n- Improve quality of the result video.\n- Improve the naming of result image.\n- Optimize performance.\n- Online update for Top Supporters List.\n- Redesign the credits page for Top Supporters(patreon).\n- Improve description.\n\nv3.22.22-beta:\n- New feature: Now you can choose to automatically open the output folder after processing all files by enabling [Auto-open after finished].\n- Update FFmpeg&FFprobe, ImageMagick.\n- New option for system tray menu.\n- Credits page for Top Supporters(patreon).\n- Display a notification when program is closing.\n\nv3.22.21-beta:\n- New option: [Ignore frame rate mode]\n- Improve the progress display of video frame interpolation.\n- Fix bug: Sometimes the remaining time cannot be calculated correctly.\n```\n---\n## [v3.22.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.22.14)\n#### Change log:\n```\nv3.22.14:\n- Improve GUI.\n- Complete Chinese translation.\n- Fix bug: Might stuck at Waifu2x-Caffe(cuDNN) during the compatibility test.\n\nv3.22.03-beta:\n- Add a Patreon button. https://www.patreon.com/aaronfeng\n- Optimize performance.\n- Fix bug: Video will be skipped even though [Frame Interpolation only(Video)] is enabled.\n\nv3.22.02-beta:\n- Optimize performance.\n- More detailed tool tips.\n- Update FFmpeg&FFprobe.\n\nv3.22.01-beta:\n- New Feature: Non-integer scale ratio support.\n```\n---\n## [v3.21.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.21.13)\n#### Change log:\n```\nv3.21.13:\n- Complete multi-language translation.\n- Fix bug: Turn off screen button doesn't work.\n- Fix bug: compatibility test progress bar not working normally.\n\nv3.21.02-beta:\n- New Feature: [Multiple of FPS] adjustment is now available for all video frame interpolation engines.\n- Improve GUI.\n- Fix bug: Potential video cache conflict.\n- Fix bug: Unable to generate a video when multiple of fps is higher then 2.\n\nv3.21.01-beta:\n- New Frame Interpolation engine: DAIN-NCNN-Vulkan.\n- New Feature: Multiple of frames.(Only available when using DAIN-NCNN-Vulkan.)\n- Improve GUI.\n- Fix bug: Unable to generate a video when frame interpolation failed.\n\nv3.11.33-beta:\n- New Feature: Now you can choose when you wanna interpolate the frames, before or after upscaled the frames.(Thanks to @CAFUCSteven for suggestion)\n- New options: [Start], [Pause] and [Donate] for system tray menu.\n- Add icons for system tray menu.\n- Fix bug: The [Background mode] in system tray menu didn't work when frame interpolation is enabled.\n- Fix bug: Video cache will be abandoned when frame interpolation setting is changed, even though [Process video by segment] is disabled.\n- Fix bug: False error report when pause.\n\nv3.11.32-beta:\n- New options: [About] and [Send feedback] for system tray menu.\n- Better naming for cache files.\n- Optimize performance.\n- Update FFmpeg&FFprobe,ImageMagick.\n- Fix typo.\n\nv3.11.31-beta:\n- New Feature: Show summary after processing all files.\n- New Feature: Now you can save multiple files lists.\n- No longer need to fix the suffix of mp4 files.\n- Optimize performance.\n- Remove 日本語 translation.\n```\n---\n## [v3.11.27](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.11.27)\n#### Change log:\n```\nv3.11.26-beta:\n- New model: rife-v2.4 for rife-ncnn-vulkan.\n- Update rife-ncnn-vulkan.\n\nv3.11.25-beta:\n- Add a turn off screen button.\n\nv3.11.24-beta:\n- Waiting for the main file processing thread to stop instead of force it to stop when user close the program.\n- Improve \"Pause\".\n\nv3.11.23-beta:\n- Optimize performance.\n\nv3.11.22-beta:\n- Multithreading of frame interpolation engines will not be enabled by default.\n- Update FFmpeg&FFprobe.\n- Fix bug: When [Process video by segment] is enabled, if the user forcibly closes the program and then restarts the software to continue processing the video, it may cause a cache error.\n\nv3.11.21-beta:\n- Update GUI layout.\n- Optimize performance.\n- Update ImageMagick,FFmpeg&FFprobe.\n- Fix bug: Engine settings are pre-loaded even though it's not being used.\n- Fix bug: Unable to overwrite files sometime.\n- Fix bug: Cannot fix the suffix of mp4 video when reading files.\n```\n---\n## [v3.11.19](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.11.19)\n#### Change log:\n```\nv3.11.19:\n- Optimize performance.\n- Update GUI.\n- Fix bug: Cannot interpolate frames of video with \"%\" in the absolute path.\n- Fix bug: [Hide Text Browser] doesn't work properly.\n\nv3.11.08-beta:\n- Fix bug: Failure detection for NCNN-Vulkan engines not working normally.\n- Fix bug: Extra commands are always loaded when [Process video by segment] is enabled.\n- Fix bug: Compatibility test may provide incorrect results.\n- Fix bug: Available GPU ID detection for NCNN-Vulkan engines may provide incorrect results.\n\nv3.11.07-beta:\n- Update GUI layout.\n\nv3.11.06-beta:\n- New Feature: Automatically enable [UHD Mode] when Ultra High Definition input is detected.\n- Much more compact gui.\n- Optimize performance.\n- Fix bug: Extra commands for video are not loaded when [Process video by segment] is enabled.\n- Fix bug: [Automatic file list scrolling] not working normally after user rearrange the files list.\n- Fix bug: [Verify] button is enabled when [Multi GPU] is disabled.\n\nv3.11.05-beta:\n- Fix bug: Unable to use [Process video by segment] when Frame Interpolation is disabled.\n\nv3.11.04-beta:\n- Add a shortcut for enable Frame Interpolation in home tab.\n- [Verify] button for Frame Interpolation.\n- Complete translation.\n- Other improvements.\n\nv3.11.03-beta:\n- New Feature: Now you can skip the super-resolution, only interpolate video frames by enable [Frame Interpolation only(Video)].\n- Add pause support for frame interpolation.\n- Add auto adjust for number of threads of frame interpolation.\n- Add failure detection for frame interpolation.\n- Remove temporary code for debug.\n- Fix bug: If frame interpolation failed in the middle of processing video by segment, clip with wrong frame rate gonna be generated.\n- Fix bug: Cannot read video configuration correctly.\n\nv3.11.02-beta:\n- New Feature: Video frame interpolation using cain-ncnn-vulkan(@nihui).\n- Add tool tips.\n- Fix bug: Video frame interpolation engines won't work when there are special characters in the installation path.\n- Fix bug: Video frame interpolation setting is not saved in the video configuration file.\n\nv3.11.01-beta:\n- New Feature: Video frame interpolation using rife-ncnn-vulkan(@nihui).\n- Update Waifu2x-NCNN-Vulkan,SRMD-NCNN-Vulkan,RealSR-NCNN-Vulkan.\n- Fix bug: Failure detection for NCNN-Vulkan engines doesn't work as intended when processing GIF and Video.\n```\n---\n## [v2.71.22](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.71.22)\n#### Change log:\n- The maximum number of threads will no longer be limited by the number of CPU logical cores.\n- Speed up the assembly of GIF.\n- Kill the sub process that is stuck in the background after stopping processing the file.\n- Fix bug: Gif scale ratio is wrong when using Anime4k.\n- Fix bug: Modifying the duration of the video clip after pausing and then continuing processing will cause the video sequence to be disordered.\n- Fix bug: Hotkey for Remove from list is still enabled when processing files.\n- Fix bug: [Time remaining] and [ETA] are still bing calculated even though they are not being displayed.\n---\n## [v2.71.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.71.12)\n#### Change log:\n- Significantly improve the efficiency, speed and stability of ALL engines when processing Video and GIF.\n- The OLD version of waifu2x-ncnn-vulkan engine will no longer support the use of multiple graphics cards to process GIF and video.\n- Fix bug: When custom resolution and video settings are enabled and the video stream bit rate is left 0, the video stream bit rate cannot be calculated normally.\n- Fix bug: Scale ratio might be incorrect when using srmd-ncnn-vulkan.\n- Fix bug: Unable to assemble gif because ImageMagick is not compatible with new AMD GPU driver.\n- Update ImageMagick,FFmpeg&FFprobe.\n---\n## [v2.62.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.62.13)\n#### Change log:\n- Improve the performance of SRMD-NCNN-Vulkan.\n- Fix bug: Incorrect scale ratio when using SRMD-NCNN-Vulkan.\n---\n## [v2.62.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.62.12)\n#### Change log:\n- Speed up the processing of video and gif.\n- Abandon python extension to improve performance.\n- Improve download speed, video processing flow, multithreading performance and other performance improvements.\n- More detailed tool tips, fix typo.\n- Fix bug: Cannot process variable frame rate video properly.\n- Fix bug: After the compatibility test is over, the waifu2x-caffe process will stay in the background.\n---\n## [v2.61.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.61.13)\n#### Change log:\n- NEW Feature: Automatically skip file when its resolution is larger than the specified resolution.\n- NEW Feature: CUDA support for Anime4k\n- Preload engines settings to improve performance,and other performance improvements.\n- Update and adapt to the new version of Anime4K.\n- Improve the way of reading picture resolution.\n- Improve the GUI based on [@Nova-Aurora](https://github.com/Nova-Aurora)'s suggestion.\n- Update FFmpeg&FFprobe,ImageMagick.\n- English localization fixes(Thanks to [@Nova-Aurora](https://github.com/Nova-Aurora)), and GUI fixes.\n- Fix bug: After the user specifies the processor, the [Disable GPU] option of Waifu2x-Converter will not take effect.\n- Fix bug: If pause during the image processing, useless files will be generated.\n---\n## [v2.59.15](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.59.15)\n```\nv2.59.15:\n- Improve GUI.\n\nv2.59.04-beta:\n- Images will only be forced to be saved as PNG when the specified file format does not support Alpha channel.\n- Add buttons to adjust the block size to the nth power of 2.\n- Performance optimization.\n- Edit tool tip.\n- Other improvements.\n- Update ImageMagick,FFmpeg&FFprobe.\n\nv2.59.03-beta:\n- Automatically disable [Save Files List] button when files list is empty.\n- More compact GUI, and other improvements.\n- Edit tool tip and Chinese translation.\n\nv2.59.02-beta:\n- NEW Feature: Reset Files List scale.\n- NEW Feature: File count for each kind of file.\n- New icons.\n- Performance optimization.\n- Other improvements to the GUI.\n- Complete translation.\n- Fix bug: [Add Files] button is not disabled when loading Files list.\n- Fix bug: Horizontal header data of the Files List will lost after using the right-click menu of [Remove item].\n\nv2.59.01-beta:\n- NEW Feature: Now you can hide components easier by drag the handle.\n- Improve GUI design.\n\nv2.58.14-beta:\n- NEW Feature: Now you can adjust the horizontal width of the file list.\n- Move [Move to Recycle Bin] option to Right-click menu of [Delete original files]\n- Other improvements to the GUI.\n- Notify users GPU ID list is empty when they try to enable Multi-GPU.\n- Optimize performance.\n```\n---\n## [v2.58.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.58.13)\n#### Change log:\n- NEW Feature: CPU support for waifu2x-ncnn-vulkan.\n- NEW Feature: Keyboard shortcuts for Files list.\n- Notify user when all files in Files list are Finished or Deleted.\n- Update Waifu2x-NCNN-Vulkan,ImageMagick,FFmpeg&FFprobe.\n- Compatible with future version of NCNN-Vulkan engines.\n- More detailed tooltips.\n---\n## [v2.57.41](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.41)\n#### Change log:\n- ♥Happy New Year in advance, and thank you for your support of this project in 2020.\n- The setting value will not be modified when using Force retry.\n- The optimized gif will not replace original gif when it's not smaller than the original.\n- Update Waifu2x-converter,Anime4K,ImageMagick,FFmpeg&FFprobe.\n- Optimize performance, fix typo(Chinese) and some other improvements.\n- Fix bug: Gif files will be misplaced if user put \"gif\" in the input file extensions list.\n- Fix bug: Sometimes Files list randomly scrolls horizontally by itself.\n---\n## [v2.57.31](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.31)\n#### Change log:\n- Update Anime4K,FFmpeg&FFprobe,ImageMagick.\n- Improve performance and compatibility.\n- Some other minor improvements.\n- ✅Fix grammatical,UI and compatibility issues.\n- ✅Fix bug: Unable to process gif and video, when there are % in the file path.\n- ✅Fix bug: Cannot read the GPUs List of the latest Anime4K.\n- ✅Fix bug: When engines randomly crashes for some unknown reasons, the compatibility test will provide incorrect results.\n- ✅Fix bug: Image with alpha channel will still be reprocessed even the current engine doesn't support processing alpha channel.\n---\n## [v2.57.21](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.21)\n#### Change log:\n- New feature: Intelligently detect whether the Alpha channel is lost, and automatically reprocess the picture.\n- New feature: [`Always pre-process images with Alpha Channel`].\n- Update ImageMagick.\n- Improve stability and performance.\n- Fix bug: NCNN-Vulkan engines cannot keep the alpha channel of some special png pics.\n- Fix typo.\n---\n## [v2.57.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.12)\n#### Change log:\n- Optimize the file list, greatly improve the speed of reading files.\n- Other prformance optimization.\n- Update FFmpeg&FFprobe,ImageMagick.\n- Fix typo and grammatical issues in the tooltip.(Thanks to @CaptainStabs for feedback)\n---\n## [v2.56.95](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.95)\n#### Change log:\n- New feature: Now you can save pictures in multiple formats.(thanks to [@loafylemon](https://github.com/loafylemon) for suggestion)\n- Optimize performance.\n- Update FFmpeg&FFprobe.\n- Remove redundant function, code and comments.\n- Fix bug: Audio and video might out of sync because of the wrong frame rate.(thanks to [@CAFUCSteven](https://github.com/CAFUCSteven) for feedback and assistance in testing.)\n- And other minor improvements.\n---\n## [v2.56.82](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.82)\n#### Change log:\n- New feature: Now you can sort the files in the file list.\n- Other improvements to the file list.\n- Add more nice icons.\n- Update FFmpeg&FFprobe,ImageMagick.\n- Improve performance.\n- Reduce cache file.\n- Add more tooltip.\n- Fix multiple bugs.\n---\n## [v2.56.71](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.71)\n#### Change log:\n- New feature: The right-click menu of the file list now supports applying and canceling custom resolution setting of individual file.\n- New feature: Now you can choose to keep the parent folder when outputting files to the output path.\n- Performance optimization.\n- Improve user interface.\n- Update and adapt Anime4KCPP, FFmpeg&FFprobe, ImageMagick.\n- Fix multiple bugs.\n---\n## [v2.56.52](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.52)\n#### Change log:\n- New feature: Now you can enable [Replace original file] to directly replace the original file with the processed file. (Additional settings, optional, disabled by default)\n- Performance optimization.\n- Update FFmpeg&FFprobe, ImageMagick.\n- Fix bugs.\n---\n## [v2.56.46](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.46)\n#### Change log:\n- Automatically check for updates after switching update channels.\n- Add a right-click menu for the [Remove Item] button.\n- Improve Files List.\n- Performance optimization.\n- Update waifu2x-caffe, ImageMagick.\n- Enhance the compatibility of waifu2x-caffe engine and Anime4k engine.\n- Jump to the homepage after automatically adjusting engine settings.\n- Fix bug: the right mouse button cannot select the file in the Files List.\n---\n## [v2.56.41](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.41)\n#### Change log:\n- New feature: Add a progress bar for compatibility test.\n- Update FFmpeg&FFprobe.\n- Fix typo.\n- Complete multilingual translation.\n- Fix bug.\n---\n## [v2.56.35](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.35)\n#### Change log:\n- According to the length of the video, automatically determine whether to enable segmentation processing.\n- Update the NCNN-Vulkan series engines.\n- Update FFmpeg&FFprobe.\n- Fix multiple bugs.\n---\n## [v2.56.32](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.32)\n#### Change log:\n- Add more actions (shut down, sleep, hibernate, restart) that can be performed after processing all the files. (Thanks to @Michael18751 for the suggestion)\n- Adapt to the new version of FFmpeg.\n- Update FFmpeg&FFprobe, ImageMagick.\n- Performance optimization.\n- Fix multiple bugs.\n---\n## [v2.56.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.12)\n#### Change log:\n- Anime4k engine can support adjusting the noise reduction level after enabling [HDN mode].\n- Add support for automatic detection of Alpha channel for Anime4k engine. (The new version of Anime4k engine supports processing Alpha channel)\n- Add right-click menu options for [Files List]: [Open selected file], [Open the folder of the selected file] and [Remove selected file from list]\n- Add a right-click menu for [Output Path] to open the output path folder.\n- Update FFmpeg & FFprobe, Anime4K.\n- Fix multiple bugs.\n- Other improvements.\n---\n## [v2.55.24](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.55.24)\n#### Change log:\n- Update FFmpeg & FFprobe, Python extension, waifu2x-ncnn-vulkan, ImageMagick.\n- Performance optimization.\n- Other improvements.\n---\n## [v2.55.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.55.12)\n#### Change log:\n- New feature: Add buttons to show the current multi-gpu settings for all engines.\n- Update FFmpeg&FFprobe, ImageMagick.\n- Performance optimization.\n- Improve multi-language support.\n- Fix multiple bugs.\n---\n## [v2.54.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.54.13)\n#### Change log:\n- Update QT to 5.15.0 than recompile the program.\n- When it is detected that the custom resolution contains an odd number, the custom resolution will be automatically corrected for the video.\n- After enabling [Ban Gitee], automatically detect whether raw.githubusercontent.com can be connected.\n- Update waifu2x-ncnn-vulkan, srmd-ncnn-vulkan, realsr-ncnn-vulkan, FFmpeg & FFprobe.\n- Performance optimization.\n- Fix multiple bugs.\n- [And many other improvements, click to view detailed change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.54.13_v2.53.14_Detailed_change_log.txt)\n---\n## [v2.53.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.53.14)\n#### Change log:\n- New feature: [Add File] button now supports selecting and adding multiple files.\n- New feature: Add [Ban Gitee] option, enabling this option will prevent the software from downloading files from Gitee.\n- Update RealSR-ncnn-vulkan, Waifu2x-ncnn-vulkan, ImageMagick, Python extension.\n- Performance optimization, reduce network traffic consumption and calls to external programs.\n- Fix multiple bugs.\n- [And many other improvements, click to view detailed change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.53.14_v2.52.16_Detailed_change_log.txt)\n---\n## [v2.52.16](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.52.16)\n#### Change log:\n- New feature: Add buttons to verify GPUs configuration for Anime4k & Waifu2x-caffe engine.\n- Optimize SRMD-ncnn-vulkan engine to improve performance.\n- Update ImageMagick, FFmpeg&FFprobe, waifu2x-caffe, Anime4k.\n- Built-in cuDNN.\n- Performance optimization.\n- Fix multiple bugs.\n- [And many other improvements, click to view detailed change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.52.16_v2.51.17_Detailed_change_log.txt)\n---\n## [v2.51.17](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.51.17)\n#### Change log:\n- New feature: Add Multi-GPU support for all engines.\n- New feature: Add taskbar icon, support minimize to taskbar.\n- New feature: Background mode.\n- New feature: Multiple update channel (stable, beta).\n- New feature: The original settings will be retained after the update.\n- New feature: Add fast mode support for the ACNet algorithm of the Anime4k engine.\n- New feature: ACNet algorithm supports Specify GPUs.\n- New feature: Add overwrite switch.\n- Update ImageMagick, waifu2x-ncnn-vulkan, FFmpeg.\n- Performance optimization.\n- Fix multiple bugs.\n- [And many other improvements, click to view detailed change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.51.17_v2.45.18_Detailed_change_log.txt)\n---\n## [v2.45.18](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.45.18)\n#### Change log:\n- New feature: Add HDN mode support to the Anime4k engine to improve image quality. (HDN can only be enabled after ACNet is enabled)\n- New feature: Keep original file name. (optional, disabled by default)\n- Update Anime4K, ImageMagick, FFmpeg.\n- New notification sound with fadeout.(Edited by @Michael18751)\n- Performance optimization.\n- Fix multiple bugs.\n- And many other improvements.\n---\n## [v2.44.18](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.44.18)\n#### Change log:\n- New feature: Add ACNet algorithm support for Anime4K engine, ACNet can achieve high-speed processing while improving image quality.(You need to manually enable ACNet in the Anime4k engine settings)\n- Update ImageMagick, waifu2x-ncnn-vulkan, SRMD-ncnn-Vulkan, realsr-ncnn-vulkan, Anime4K.\n- Optimize performance and improve stability.\n- Fixed multiple bugs.\n- And many other improvements.\n---\n## [v2.43.17](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.43.17)\n#### Change log:\n- New feature: Pre-process Image. This will improve compatibility. (Additional settings, optional, disabled by default)\n- Update Python extension,waifu2x-ncnn-vulkan,srmd-ncnn-vulkan,realsr-ncnn-vulkan,FFmpeg,ImageMagick.\n- Improve the process of checking for update.\n- Improve multi-thread scheduling mechanism.\n- Add and modify tooltip.\n- Support online update of donate QR code.\n- Add some tips, modify some text, correct typos.\n- Performance optimization.\n- Fix several bugs.\n- Other improvements.\n---\n## [v2.41.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.41.12)\n#### Change log:\n- #### New features: Add RealSR-ncnn-vulkan engine, greatly improving the ability to process 3D Real-life style images (thanks to @CAFUCSteven for assistance in testing software).\n- New feature: All engines (except Anime4k) now support automatic recognition and processing of Alpha channel pictures.\n- Update waifu2x-ncnn-vulkan engine.\n- Update srmd-ncnn-vulkan engine.\n- Update ImageMagick.\n- Optimize the launcher.\n- Optimize the process of checking for update.\n- Adjust the processing flow for pictures with Alpha channel.\n- Fixe several bugs.\n- Other improvements.\n---\n## [v2.31.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.31.14)\n#### Change log:\n- New feature: Add waifu2x-caffe engine (experimental function) (thanks to @CAFUCSteven for assistance in testing the software).\n- New feature: waifu2x-caffe engine supports quick switching of image styles.\n- New feature: Support for switching the engine used when processing images with Alpha channels.\n- Optimize the process of processing pictures with Alpha channel.\n- Adjust the compatibility test interface.\n- Performance optimization.\n- Change default settings.\n- Add some tips, modify some text, correct typos.\n- Fix multiple bugs.\n- Other improvements.\n---\n## [v2.21.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.21.12)\n#### Change log:\n- New feature: When processing video or GIF, the progress of the current file (a progress bar, Time cost, Time remaining, ETA) is displayed separately.\n- Performance optimization.\n- Improve the compatibility of ffporbe plugin.\n- Fix bug: In some cases, the video processing will be stuck in the step of obtaining the duration.\n- Other improvements.\n---\n## [v2.11.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.11.3)\n#### Change log:\n- New feature: Anime4K engine supports processing Image and GIF.\n- New feature: Automatically adjust engine settings based on compatibility test results.\n- After the compatibility test, a pop up will shows up according to the test results.\n- Update Anime4K (v1.8.1).\n- Update ImageMagick (7.0.10-12-Q16-x64).\n- Change default settings.\n- Add some tips.\n- Check whether the software has write permission in the directory where the file is located before processing the file.\n- Improved permission detection when the software starts.\n- Fix bug: In special cases, the video may be stuck in the step of obtaining the duration.\n- Fix bug: Can't detect whether the software has write permission for output path normally.\n- Fix bug: when using Anime4k engine to process video, the custom resolution setting is invalid.\n---\n## [v2.02.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.02.3)\n#### Change log:\n- Update Anime4K (v1.7.0).\n- Improve Simplified Chinese support.\n- Reduce resource usage when running compatibility tests.\n- Add some tips.\n- Fix bug: In some cases, the program will get stuck when running compatibility tests.\n- Fix bug: Some components are not disabled when processing files, which may cause potential errors.\n---\n## [v2.01.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.01.1)\n#### Change log:\n- New feature: Redesigned user interface.\n- New feature: add [繁體中文] support (thanks @uimee for assistance in translation).\n- New feature: Anime4K engine supports specified GPU.\n- New feature: store and read GPU settings of all engines.\n- New features: improved compatibility testing, increased inspection items, and support for storing test results.\n- Update Anime4K (v1.6.0).\n- Update ImageMagick (7.0.10-10-Q16-x64).\n- Improved multi-thread management.\n- Add some tips.\n- Performance optimization.\n- Fix bugs.\n---\n## [v1.73.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.73.3)\n#### Change log:\n- New feature: Add GPU acceleration support for Anime4K engine.\n- New feature: After installing the software, a pop-up window allows users to choose their own language when they first start up.\n- Update Anime4K (v1.5.0)\n- It is no longer allowed to disable the automatic check for updates, but the automatic update pop-up window can be disabled. After disabling the pop-up window, an update prompt will be displayed in the text box.\n- A pop-up window prompts the user to view the test results after the compatibility test.\n- Improve compatibility test.\n- Hide ETA and remaining time when GIF or video is included in the file list.\n- Improve multi-language support.\n- Fix bugs.\n---\n## [v1.71.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.71.1)\n#### Change log:\n- New feature: replaced the previous Anime4K-JAVA with Anime4KCPP.Anime4KCPP is faster and has better image quality than Anime4K-JAVA.\n- New feature: Add a lot of custom settings for the Anime4K engine.\n- Interface layout adjustment.\n- Fixe translation errors.\n- Modify some texts.\n---\n## [v1.63.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.63.1)\n#### Change log:\n- Improve stability.\n- Optimize performance.\n- Add some tips.\n- Change some text.\n- Fix translation errors.\n- Fix bug: In rare cases, the cached files will have the same name and cause an error.\n- Fix bug: Reset video settings button does not work properly.\n---\n## [v1.62.5](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.5)\n#### Change log:\n- Fix bug: when the `Process video by segment` is enabled, the cache cannot be read normally, which will cause the software unable to continue the previous progress.(Thanks to Esper Wang for feedback✔)\n---\n## [v1.62.4](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.4)\n#### Change log:\n- Fix bug: In some cases, the output video will be out of sync.(thanks to  @FITHRPG6 for feedback)\n---\n## [v1.62.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.3)\n#### Change log:\n- New feature: waifu2x-ncnn-vulkan adds fp16p support, which improves compatibility with some old drivers.\n- Update waifu2x-ncnn-vulkan (version 20200414).\n- Update ImageMagick (7.0.10-6-Q16-x64).\n- Change the default custom resolution aspect ratio strategy to keep aspect ratio.\n- Fixe bug: interface display error in some cases.\n- Fixe bug: when the source video file name contains Chinese, the video cannot be assembled correctly after processing the video in segments.\n---\n## [v1.61.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.61.3)\n#### Change log:\n- New feature: Processing video in segments, greatly reducing the hard disk space occupied when processing video. 🎉🥳🎉 (Optional, additional settings, enabled by default)\n- Improve multi-language support.\n- Other minor improvements.\n- Fix bug: When the processing process is stopped, the ffmpeg process will be forcibly terminated, which will cause the cache file cannot be generated normally.\n- Fix bug: In some cases, the progress bar cannot display the progress normally.\n---\n## [v1.51.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.51.3)\n#### Change log:\n- Performance optimization.\n- Remove redundant code.\n- Improve multi-language support.\n- Fix bug: When the software language is Japanese, the Readme cannot be opened normally.\n- Fixed bug: Some cache files automatically generated by this software may be recognized as empty files by junk cleaning software and deleted.\n- Fix bug: Inaccurate countdown time before shutdown.\n- Other small improvements.\n---\n## [v1.50.2](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.50.2)\n#### Change log:\n- New feature: Use SoX (14.4.2-win32) to reduce the noise of the video's audio. (Optional, additional settings, disabled by default) (thanks @wenbob for the suggestion)\n- New feature: Software settings will be saved before automatically shutting down the computer.\n- Optimized interface display.\n- Improve multi-language support and fix translation errors.\n- Fix bug: When [Keep Video Cache] is enabled, the source video files will still be deleted.\n---\n## [v1.45](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.45)\n#### Change log:\n- New feature: You can choose whether to show a pop up when exit. (Optional, additional settings, enabled by default)\n- New feature: Automatically enable(or disable) [Auto Detect Alpha Channel] based on the results of the compatibility test.\n- New feature: Keep video cache. (Optional, additional settings, enabled by default)\n- New feature: When the user stops the task or an error occurs, the video's cache will not be automatically deleted, and it can also be read by the software to continue the previous progress.\n- Improve the stability of multi-threaded scheduling.\n- Fix bug: In some cases, the file cannot be renamed properly then the video cannot be assembled normally.\n- Fix bug: The files in the list could not be processed normally due to the thread scheduling error.\n---\n## [v1.37](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.37)\n#### Change log:\n- New feature: When converting videos to mp4, support to automatically obtain the bit rate of the original video and apply it to the converted mp4.\n- New feature: When outputting video, the bit rate will be allocated using the software's built-in algorithm.\n- Change the default [compressed \".jpg\" image quality] value to 95.\n- Fix bug: Progress bar could not display progress normally in some cases.\n---\n## [v1.31](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.31)\n#### Change log:\n- New feature: Automatically determine whether the picture has an alpha channel and switch to a compatible engine. (Optional, additional settings, disabled by default) (`Please make sure your computer is compatible with waiuf2x-converter before enabling this feature.`)\n- New feature: Compatibility tests run automatically the first time the software is launched.\n- Improved multi-thread management and stability.\n- Remove the [Show Tips] button.\n- Fix bug: In some cases, outputting the processor list of waifu2x-converter will cause the software to enter an endless loop.\n---\n## [v1.21](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.21)\n#### Change log:\n- New feature: support remember the last browsed folder\n- New feature: Improved automatic check for updates, support for displaying update logs\n- New feature: Launcher added multi-open detection.\n- New feature: Support for typing extra commands in video customization settings.\n- Update ImageMagick (7.0.9-27-Q16-x64)\n- Update User-Agent used when checking for updates automatically.\n- Changed some interface layouts.\n- Improved stability.\n- Added some tips.\n- Modified some confusing text.\n---\n## [v1.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.11)\n#### Change log:\n- New feature: Add SRMD-NCNN-Vulkan engine. 🎉🥳🎉\nThe SRMD-NCNN-Vulkan engine can support both `2D Anime` and `3D Real-life` image styles.\nYou can [click this page](https://github.com/cszn/SRMD) to learn about SRMD.\n---\n## [v1.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.01)\n#### Change log:\n- ### End the beta test and start the development of the stable version. 🎉🥳🎉\n- New feature: Add [ 日本語 Japanese ] language support.  🐱‍👤\n`(Machine translation, may contain errors)`\n- Added some tips.\n- Fix bug: text error.\n- Fixed bug: After switching languages, some texts were displayed incorrectly.\n---\n## [v0.57-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.57-beta)\n#### Change log:\n- Add PayPal donate button\n- Rewrite code related to file list to speed up operation and reduce memory consumption.\n- Fix bug: When there are many entries in the list, removing a single entry will cause no response.\n- Fix bug: After specifying the output path, files with the same file name will overwrite each other.\n- Fix bug: New and old versions of waifu2x-ncnn-vulkan are not distinguished when detecting available GPU ID\n---\n## [v0.56-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.56-beta)\n#### Change log:\n- Fix bug: slow reading files speed\n- Fix bug: unable to stop processing file process normally due to waiting for ffmpeg to split video (or GIF)\n- Fix bug: In some cases, external plugins are still running when exiting the program\n---\n## [v0.55-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.55-beta)\n#### Change log:\n- Old version of waifu2x-ncnn-vulkan engine is enabled by default. (Because of the stability issue of new version of waifu2x-ncnn-vulkan)\n`If you need to use the TTA feature of the waifu2x-ncnn-vulkan engine, switch to the new version.`\n- Improve stability.\n- Fix bug: Adding a large number of files at one time will cause the program to become unresponsive.\n---\n## [v0.54-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.54-beta)\n#### Change log:\n- New feature: When the software is closed, a pop-up window asks the user whether to confirm the exit.\n- New feature: Added [Forced Retry], when waifu2x thread is stuck, you can perform forced retry to remove the stuck, and it will not interrupt the entire [scale and denoise] process\n- Improve error detection of waifu2x-ncnn-vulkan engine.\n- Fix bug: not delete all temporary files in some cases\n- Fix bug: In some special cases, multi-threaded scheduling error will cause stuck\n---\n## [v0.53-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.53-beta)\n#### Change log:\n- New feature: Support switching waifu2x-ncnn-vulkan engine version. When your computer has problems using waifu2x-ncnn-vulkan engine, you can try to update the graphics card driver or enable the old version of waifu2x-ncnn-vulkan engine\n- New feature: Added compatibility test for older versions of waifu2x-ncnn-vulkan engine\n- New feature: Custom retry times (additional settings)\n- Try to fix the problem of high DPI screen display. (I cannot test because I don’t have a high DPI display myself)\n- Fix bug: text error\n---\n## [v0.52-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.52-beta)\n#### Change log:\n- Improved stability, will retry when the engine crashes, and will not fail the entire process because of an engine crash\n- Improve the stability of Anime4k engine\n- Disable lineEdit of output path when output path is not enabled\n- Fix text errors\n- Update waifu2x-ncnn-vulkan (version 20200224)\n---\n## [v0.51-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.51-beta)\n#### Change log:\n- New feature: When \"Delete original file\" is enabled, you can choose to move the original file to the recycle bin\n- New feature: Support to choose whether to enable custom video settings (additional settings, optional, disabled by default)\n- New feature: Specify output directory\n- New feature: Scan subfolders (additional settings, optional, enabled by default)\n- New feature: Added TTA support for waifu2x-ncnn-vulkan engine\n- New feature: Added TTA support for waifu2x-converter engine\n- New feature: file list interactivity settings (additional settings)\n- Update waifu2x-ncnn-vulkan (20200223)\n- Performance optimization\n- Improve error detection\n- Fix bug: text error\n---\n## [v0.461-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.461-beta)\n#### v0.461-beta Change log:\n- Fix bug: Source video files may get lost in some cases\n#### v0.46-beta Change log:\n- New feature: Support for more video-related custom parameters\n- New feature: Show prompts on initial startup\n- Update waifu2x-ncnn-vulkan (20200222)\n- Interface layout adjustment\n- Enhance video quality\n- Fix bug: Temporary mp4 video generated by software was not deleted when processing stopped\n- Fix bug: When waifu2x-ncnn-vulkan is enabled, the target magnification cannot be calculated correctly (thanks to slimekingwin8cn for feedback)\n---\n## [v0.45-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.45-beta)\n#### Change log:\n- New feature: waifu2x-ncnn-vulkan engine supports switching to cunet model\n- New feature: custom video encoder, bitrate and pixel format (in additional settings)\n- New feature: Custom resolution supports apply settings to all files together\n- Enhanced video quality\n- Performance optimization, reducing the time required to process GIF and video when custom resolution is enabled\n- Fix bug: target magnification cannot be calculated correctly when custom resolution is enabled\n---\n## [v0.411-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.411-beta)\n#### v0.411 Change log:\n- Improve compatibility of waifu2x-converter\n#### v0.41 Change log:\n- New feature: waifu2x-converter supports more noise reduction levels\n- New feature: Added waifu2x-converter engine custom settings\n- New feature: custom font\n- New feature: minimize form\n- New feature: hide text browser\n- Update waifu2x-converter (v5.3.3) (thanks to NyanMisaka for feedback)\n- Interface layout adjustment\n- Improve stability\n- Many other improvements\n- Fix bug: File extensions are not recognized correctly (thanks to zhehenkaifa for feedback)\n- Fix bug: When the video extension is \".MP4\" instead of \".mp4\", it will cause an error\n- Fix bug: error caused by extra \".\" In file name (thanks to 我叫黄伟达 for feedback)\n- Fix bug: unable to stop processing in some special cases\n---\n## [v0.37-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.37-beta)\n#### Change log:\n- New feature: Custom \".jpg\" file compressed image quality\n- Improve file extension filtering in browse file dialog\n- Update ImageMagick (7.0.9-22-Q16-x64)\n- Improve stability\n- Improve Simplified Chinese support\n- Other small improvements\n- Fix bug: stuck in the background after the program is closed\n---\n## [v0.35-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.35-beta)\n#### Change log:\n- New feature: Custom global font size (additional settings)\n- New feature: Browse and add files\n- Performance optimization\n- Improve stability\n- Review code and add code comments\n- Interface layout adjustment\n- Multiple minor improvements\n- Fix bug: Cannot be compatible with custom scaling of Windows system\n- Fix bug: In some special cases, it can't judge whether the file is added repeatedly\n- Fix bug: Can't save noise reduction level setting\n---\n## [v0.31-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.31-beta)\n#### Change log:\n- New feature: show progress while loading file list\n- New feature: Customizable aspect ratio strategy of \"Custom Resolution\" (in [Additional Settings])\n- New feature: popup prompt after manually saving settings\n- New feature: \"Settings\" can always be hidden (optional, disabled by default, in [Additional Settings])\n- New feature: Show total number of GIF and video threads\n- Fine-tune interface layout\n- Fix bug: When processing gif, the file processing status cannot be changed normally after stopping the process\n---\n## [v0.291-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.291-beta)\n#### Change log:\n- New feature: Automatically save settings when closing the program (optional, enabled by default)\n- New feature: [input path] can be hidden all the time (optional, disabled by default)\n- New feature: Add [About]\n- New feature: Permission detection\n- Adjust the interface layout, move some setting options to [Additional settings]\n- Improve Simplified Chinese support\n- Fix bug: In some special cases, the program will be stuck in the background\n---\n## [v0.281-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.281-beta)\n#### Change log:\n- New feature: [Files List] supports deselect\n- Interface Beautification\n- Adjust interface layout\n- Improve Simplified Chinese support\n- Fix bug: GIF frames could not be arranged properly in some cases\n- Fix bug: In some cases, the thread will be automatically closed in advance and the task cannot be completed\n- Fix bug: In some cases, the program cannot exit completely and will stay in the background to execute an infinite loop\n- Fix bug: When there is no Java runtime environment in the system, calling Anime4k may cause the software to enter an infinite loop\n---\n## [v0.25-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.25-beta)\n#### Change log:\n- New feature: Read screen resolution and set as default custom resolution value when first started\n- New feature: When loading File List, automatically output items with status [Failed] in Textbrowser\n- Update FFmpeg (4.2.2)\n- Fix bug: In some special cases, automatic check for updates will falsely report the existence of a new version\n- Fix bug: Automatic shutdown of computer could not be performed normally\n- Fixed bug: [File Count] cannot be displayed normally after language switching\n- Improve Simplified Chinese language support\n---\n## [v0.21-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.21-beta)\n#### Change log:\n- New feature: [Completed number of files/Total number of files] is displayed on the left side of the progress bar.\n- New feature: Added setting options to control whether to automatically check for updates at startup (It is `not recommended` to turn off automatic updates)\n- New feature: The total number of files is displayed below the file list.\n- New feature: Save/Read file list\n- New feature: Automatically save the file list before automatically shutting down the computer,  you can manually load the file list to check the file processing status after the next software startup\n- New feature: pop-up window prompt before auto shutdown\n- Improve Simplified Chinese language support\n- Select the readme to open based on the current language\n- Before processing a file, check if it exists\n- Fix bug: After saving the settings, the [Image Style] settings that were saved cannot be read normally\n- Fix bug: After removing a single row, the custom resolution settings of all remaining rows will be cleared\n- Fix bug: When there are files with the same file name and different extensions in the file list, if multi-threading is enabled, it will cause read and write conflicts.\n- Fix bug: The problem that the new version download page cannot be opened normally after detecting the new version automatically.\n---\n## [v0.12-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.12-beta)\n#### Change log:\n- NEW Feature: Check for updates automatically.\n- Fix bug: GIF and video cannot read the scale ratio setting normally.\n- Fix bug: When processing videos and gif files, if an error occurs, it will cause thread management problems.\n---\n## [v0.11-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.11-beta)\n#### Change log:\n- NEW Feature: Customize the resolution of image, GIF and video output. (At the request of an anonymous donor.🧐)\n- NEW Feature: Multi-language.(Add Simplified Chinese.)(At the request of an anonymous donor.🧐)\n- NEW Feature: Support to save the current settings, automatically restore the last saved settings when starting the software.\n- NEW Feature: Switch the display status of setting options. (Hide / Show)\n- NEW Feature: Switch the display status of [Input]. (Hide / Show)\n- NEW Feature: Prompt when misoperation.\n- NEW Feature: Automatically scroll to the bottom after changing the font size of Textbrowser.\n- NEW Feature: Textbrowser automatically slides to the bottom after outputting new content\n- NEW Feature: Tableview automatically adjusts sieze based on content\n- NEW Feature: Check available GPU and set GPU ID.\n- Improve tableview selection logic. When one tableview is selected, the other two are automatically unselected.\n- Optimize the tableview display logic. After inputting the file, only change the display state of the corresponding tableview.\n- Remove redundant code\n- Fix bug: [Remove item] will cause the program to crash when the file is finished and [Re-process finished files] is not enabled.\n- Fix bug: [video_gif_info.exe] Chinese characters cannot be read normally\n- Fix bug: [Compatibility check] button is not automatically enabled after all files have been processed.\n---\n## [v0.01-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.01-beta)\n#### Change log:\n- First release.\n"
        },
        {
          "name": "Change_log_CN.md",
          "type": "blob",
          "size": 70.462890625,
          "content": "# 更新日志\n---\n#### [📝English Change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/Change_log.md)\n\n#### [💾获取最新的稳定版](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest)\n---\n## v3.121.01\n- 新的RIFE补帧模型：[v4.22-lite]，与之前的模型相比质量更高。\n- 为Real-ESRGAN模型添加介绍文档。\n- 为[输出文件夹]添加[选择文件夹]按钮。\n- 当切换ESRGAN引擎的\"图像风格\"时，引擎设置标签中的模型图像风格标签将被高亮显示。\n- 为[导入ESRGAN模型]设置添加[帮助]按钮。\n---\n## v3.120.01\n- 新 ESRGAN 模型：[Photo-Small-W2xEX]，快速照片放大模型，在保持与 [Universal-Fast-W2xEX] 类似速度的同时，实现了更高的照片放大质量。\n- 新功能：支持 AV1 视频编码器。\n- 增加 SVT-AV1 软件编码器。\n- 增加 Nvidia、Intel 和 AMD 的 AV1 硬件编码器。\n- 更新设置预设以利用新模型。\n- 更好地兼容 AV1 视频编解码器。\n- 更新 RIFE 引擎。\n- 更新 GIF 插件。\n- 更新其他插件。\n---\n## v3.119.01 \n- 新特性: GIF画质改进, GIF现已支持[透明背景图像清晰度增强].\n- Omni-Mini Real-ESRGAN 模型 V2 更新，改进图像质量的同时不影响性能.\n- 改进[视频色彩管理]的兼容性.\n---\n## v3.118.01 \n```\n- 新RIFE补帧模型:[v4.17-lite], 与之前的Lite模型相比, 生成帧质量更高.\n- 为快速图片缩放压缩添加多个选项:\n- [不放大]: 如果图像分辨率低于自定义分辨率，它们将只会被转换（压缩）。\n- [忽略放大倍率]: 在使用[仅转换格式（静态图像）]时，总是忽略放大倍率设置。\n- [未变小则跳过]: 如果转换后的图像文件大小没有变小，则转换后的图像将被删除，原始图像将被复制到输出文件夹。\n- [跳过低分辨率图片]: 当启用[仅转换格式（静态图像）]和[缩放]时，只有当图像分辨率高于自定义分辨率时才会处理图像。\n- 修复问题: [保持纵横比（扩展）]纵横比策略在处理图片时可能分配错误的分辨率.\n```\n---\n## v3.117.01\n#### 更新日志:\n- 新 Real-ESRGAN 模型：[Omni-Mini-W2xEX]，超高速迷你模型，旨在模仿RTX超分辨率的质量和速度，让所有显卡都可以体验RTX超分辨率功能.\n- 将 Real-ESRGAN 的 [顺序解码] 升级为 [图片解码线程数]。通过基于电脑硬件自动调整解码线程，提升图像放大性能，测试中速度提升最高达87.94%。\n- 修复错误：在某些情况下，帧插值后帧数量不符合预期。\n---\n## v3.116.01\n#### 更新日志:\n- 新RIFE补帧模型:[rife-v4.15-lite], 与之前的Lite模型相比, 生成帧质量更高, 速度更快, 显存用量更小.\n- 新特性: 为[仅转换格式(图片)]添加[缩放]选项, 使用快速缩放算法(而非超分辨率), 可以快速对图片同时进行缩放,压缩与转换格式.\n- 更新RIFE补帧引擎的自动线程分配算法, 改进稳定性.\n- 为[静态图片质量]添加[重置]右键菜单选项, 方便将质量值快速重置到100.\n- 优化代码性能.\n- 改进UI.\n- 修复问题: [透明背景图像清晰度增强] 可能导致一些图片的暗色部分变成半透明.\n- 修复潜在的UI选项冲突.\n- 移除部分历史遗留的UI错误.\n---\n## v3.115.01\n#### 更新日志:\n- 新增 [Photo-HQ-W4xEX] Real-ESRGAN 模型, 高质量照片放大模型, 与以前的模型相比, 可以更好地保留细节, 并可以生成更干净的图像.\n- 新功能: [自动视频去隔行], 自动检测隔行扫描的视频, 并在放大(补帧)前对其进行去隔行处理.\n- 改进对部分区域格式的兼容性.\n- 优化UI性能\n---\n## v3.114.01\n#### 更新日志:\n- 新增RIFE补帧模型: [RIFE V4.17], 与之前的v4.14模型相比质量更高, 画面更稳定.\n- 大幅加快视频编码速度: 在启用[分段处理视频]时, 将使用全新的方式组装视频片段, 在测试中可以将组装片段的时间花费从几分钟缩短到几秒钟.\n- 改进[视频色彩管理]的UI, 支持直接选择当前视频编码器支持的所有像素格式.\n- 切换默认视频封装格式到MKV.\n- 优化UI性能.\n- 修复问题: 在启用[分段处理视频]时, 一些情况下视频补帧可能造成视频流与音频流轻微不同步.\n- 修复了启用[分段处理视频]后, 视频末尾可能有少部分内容被遗落的问题\n- 修复了使用[优化循环的视频]时, 可能额外生成重复帧, 继而造成循环播放不流畅的问题\n- 修复了对视频补帧后, 视频末尾有多余帧的问题\n- 修复了同时启用[指定帧率]和[优化循环的视频]可能导致错误的问题.\n- 修复了使用[指定帧率]时, 对很短的视频补帧后, 生成的视频实际帧率偏低的问题\n- 修复了[智能加速]与[优化循环的视频]冲突的问题\n- 修复了[转场检测]与优化循环视频冲突的问题\n- 修复了与最新版ffmpeg的兼容问题, 并更新内置的ffmpeg到最新版本, 为未来支持更多视频编码器&解码器做准备\n- 修复了与最新版ffprobe的兼容问题, 并更新内置的ffprobe到最新版本\n- 修复了Real-ESRGAN处理视频和动态图片时, 极少数情况下可能卡死的问题.\n- 更新使用教程, 为目录添加跳转链接.\n- 更新每日提示.\n- 更正错字.\n---\n## v3.113.01\n#### 更新日志:\n- [视频编码器]设置的全新 UI 设计。\n- 新功能: ProRes 视频解码和编码。(位置: 视频设置 选项卡, 视频编码器)\n- 新特性: Real-ESRGAN 支持[顺序解码], 减少图片解码的CPU占用并提高性能.\n- [Anime-HQ-W4xEX] Real-ESRGAN 模型性能优化.\n- 使用 Real-ESRGAN 进行图片放大时, 多线程性能得到改善。\n- [编码质量]和[硬件加速 视频编码]现已合并到新的[视频编码器]设置UI中。\n- 修复问题: 一些电脑在使用RealESRGAN放大静态图片时可能长时间卡在解码.\n---\n## v3.112.01\n#### 更新日志:\n- 新增 [Anime-HQ-W4xEX] Real-ESRGAN 模型, 高质量2D动漫放大模型, 与以前的模型相比, 可以更好地保留细节, 并可以生成更干净的图像.\n- 新特性: [视频色彩管理], 软件现在可以自动调节色彩相关的参数以改进色彩准确度, 或者您可以自行调整这些参数.(位置: 视频设置)\n- 更新了[自动优化引擎设置]以提升Real-ESRGAN的性能，比之前的版本相比, 速度提升最高可达48%.\n- 更好的 RIFE 自动模型选择，现在您可以告诉 Waifu2x 在自动选择模型时使用 v4.14 模型而不是 v4.13-lite.\n- 一些UI改进.\n- 新增 [Anime-HQ-W4xEX] Real-ESRGAN 模型, 高质量2D动漫放大模型, 与以前的模型相比, 可以更好地保留细节, 并可以生成更干净的图像.\n- 新特性: [视频色彩管理], 软件现在可以自动调节色彩相关的参数以改进色彩准确度, 或者您可以自行调整这些参数.(位置: 视频设置)\n- 更新了[自动优化引擎设置]以提升Real-ESRGAN的性能，比之前的版本相比, 速度提升最高可达48%.\n- 更好的 RIFE 自动模型选择，现在您可以告诉 Waifu2x 在自动选择模型时使用 v4.14 模型而不是 v4.13-lite.\n- 一些UI改进.\n---\n## v3.111.01\n#### 更新日志:\n- 新增 [RIFE-v4.14], 高质量补帧模型, 与之前的模型相比, 可以生成更稳定画面.\n- 新增 [RIFE-v4.13-lite], 快速且高质量的补帧模型, 与v4.14相比快30%, 并且画面稳定性接近v4.14.\n- 新增 [自动选择] 功能, 根据您的电脑硬件和源视频分辨率自动选择合适的RIFE补帧模型. (默认启用)\n- 内置 [使用教程] 来帮助新用户快速上手本软件. (位置: 主页, 右下角的问号图标按钮)\n- [Universal-Fast-W2xEX] RealESRGAN 模型现在速度加快了至高30%, 通过更新[自动引擎设定优化]算法.\n- 更新[快捷预设]以利用最近更新的[Universal-Fast-W2xEX]模型.\n- 修复一些UI问题.\n- 修复问题: 处理帧文件夹期间暂停可能导致软件崩溃.\n---\n## v3.110.01\n#### 更新日志:\n- 新增 RealESRGAN 模型: [Universal-Fast-W2xEX], 为快速照片放大而设计, 比 RealESRGAN-x4plus 模型快30.5x倍, 但仍能保持较好的画质.\n- 新特性: 支持为英伟达和英特尔硬件编码器选择[预设], 这将影响最终视频的编码画质. (位置: 视频设置, 硬件加速 视频编码)\n- 新特性: 为处理完成后的动作列表添加[停止后执行动作]选项, 处理完已经正在处理的文件, 然后再执行一个动作.\n- 为[输出文件夹路径]的右键菜单添加[复制]和[粘贴]按钮.\n- 更新多个内置插件.\n- 一些UI改进.\n- [优化循环的视频]设定将会被正常保存.\n- 修复问题: 少数情况下, NCNN-Vulkan 系列引擎可能随机卡死.\n---\n## v3.109.01\n#### 更新日志:\n- 新特性: [编码质量], 启用后可以随意调整视频编码质量, 使用软件和硬件编码器时均能生效. (位置: 视频设置选项卡)\n- 新特性: 为处理完成后的动作列表添加[停止处理新文件]选项, 处理完已经正在处理的文件就不再处理新文件.\n- 输出放大后的图片时, 将[_Compressed]后辍替换为[_Q<静态图片质量值>]. 例如[_Q95], 当[静态图片质量值]生效时.\n- 新的字幕导入方式, 改进对视频的兼容性.\n- 卸载内存盘后自动禁用动态内存缓冲.\n- 修复问题: 当源视频包含多个字幕时, 处理后的视频若保留字幕可能无法正常播放.\n---\n## v3.108.01\n#### 更新日志:\n- 新功能: [导入帧图片文件夹], 浏览并导入包含视频帧图片的文件夹, 并对其补帧.\n- 新功能: [削减视频帧率], 先削减视频的帧率到指定的百分比或帧率, 然后再进行补帧或放大.\n- 新功能: [复制被跳过的文件], 启用后, 被跳过的文件也将被复制到输出文件夹.\n- 新功能: 现在你可以通过调整引擎设置中的图片线程数量, 来调整 [仅转换格式(静态图片)] 将使用的线程数量.\n- 大幅改进UI性能, 即使在导入大量文件后文件列表UI依旧可以保持流畅, 减少处理文件期间UI的CPU占用.\n- 视频相关代码性能优化.\n- 添加m4v到默认视频扩展名列表\n- 修复问题: Real-CUGAN在一些情况下会输出错误的颜色.\n- 修复多个与[仅转换格式(静态图片)]相关的问题.\n- 新特性: [帧文件夹补帧]现已支持[删除源文件],[替换原文件]和[输出文件夹]\n- 修复问题: 当使用[帧文件夹补帧]时, 部分源帧文件可能在补帧后被错误地删除.\n---\n## v3.107.01\n#### 更新日志:\n- 新特性: [智能加速 2.0], 大幅提高检测重复帧的速度和准确性, 这意味着 [智能加速 2.0] 与之前的版本相比可以节约更多时间.\n- 新特性: 支持另存动态webp到更多格式: apng, mp4 和 webm.\n- 新特性: [同步视频横纵比], 将视频的样本横纵比与显示横纵比同步.\n- 为[删除原文件]和[替换原文件]选项添加警告弹窗.\n- 改进放大APNG和WebP的画质.\n- 改进UI, 修复错误描述.\n- 补全翻译.\n- 修复问题: 部分引擎放大webp和apng时可能输出错位的图像.\n- 修复问题: 在拥有新款(或高端)CPU的电脑上运行时, waifu2x可能偶尔在补帧期间卡住.\n- 修复问题: 同时启用补帧和RTX Super-res时, 视频取样可能无法正常工作.\n---\n## v3.106.01\n#### 更新日志:\n- 新特性: [转场检测 2.0], 大幅提升转场检测速度, 与之前的版本相比速度提升了65倍, 这意味着转场检测在补帧时不会再造成任何额外时间消耗.\n- 新特性: [Gif & APNG]选项, 启用后, 在保存gif和apng到webp时也支持调用动态webp的质量设定值. (位置: 图片设置 选项卡)\n- 新特性: 为动态WebP的质量控制添加[与主页同步]选项, 启用后动态webp的质量值将于主页的[静态图片质量]值同步. (位置: 图片设置 选项卡, 默认启用)\n- 改进视频画质, 尤其是硬件加速编码器时.\n- 启用动态WebP的[Gif & APNG]选项后, gif和apng将自动被另存为webp.\n- 修复问题: 一些情况下, [智能加速]可能无法正常工作并导致视频处理失败.\n- 修复问题: 一些情况下, 完成任务后自动进入睡眠状态的功能可能无法正常工作.\n- 修复问题: 启用视频取样后, RTX Super-resolution引擎可能无法正常放大视频.\n- 修复问题: 启用分段后偶尔无法编码最终视频.\n- 修复问题: 一些情况下, 点击按钮\"立即执行\"关机或睡眠等操作可能导致软件崩溃.\n---\n## v3.105.01\n#### 更新日志:\n- 新特性: 支持处理动态WebP图片, 所有超分辨率引擎均已支持放大动态WebP图片.\n- 新特性: 支持保存动态Webp为GIF. (位置: 图片设置 选项卡)\n- 新特性: 支持调整放大后动态WebP的压缩质量. (位置: 图片设置 选项卡)\n- 处理动态WebP时支持保留可变帧率特性, 其他动态图片格式均会在未来的更新中支持可变帧率.\n- 改进启动器, 可以检测更多问题以及更好的提示消息.\n- 修复问题: 当载入来自旧版本的自定义预设文件时, 可能错误地改变一些设置选项的值.\n- 修复问题: 处理动态webp时消息输出包含错误.\n- 修复问题: 当APNG的后辍为大写时会导致一直处理失败.\n---\n## v3.104.01\n#### 更新日志:\n- 新特性: [自动保存文件列表]: 开始处理文件后, 每15秒自动保存一次文件列表.(位置:附加设置选项卡, 默认启用)\n- 新特性: [跳过失败的文件]: 总是跳过文件列表中状态为\"Failed\"(失败)的文件.(位置:附加设置选项卡, 默认禁用)\n- 为Real-ESRGAN引擎改进引擎设定自动优化算法, 改进在绝大多数PC上放大图片的性能.\n- 优化代码, 改进UI性能.\n- 为保存(读取)预设文件添加必要的提示讯息.\n- 修复问题: RTX Super-resolution 引擎的\"优先级\"设定无法生效.\n- 修复问题: 总是重复处理已经完成的文件.\n- 修复问题: 当使用软件自动分配的引擎设定时, Real-ESRGAN引擎可能面临线程阻塞.\n- 修复问题: 加载预设文件后软件窗口自动缩小.\n- 更新 ImageMagick.\n- 补充工具提示.\n---\n## v3.103.01\n#### 更新日志:\n- 新特性: [保存与读取 设定预设文件], 现在您可以将您的设定保存为预设文件, 而且可以随时从文件再次载入设定.\n- 新特性: [透明背景图像清晰度增强]现已支持多线程, 大幅减少时间占用.\n- 新特性: 为[转场检测]的[限制器]添加右键菜单, 以支持手动设定线程数量.\n- 新特性: 现在软件启动时将在后台自动检测当前软件安装的完整性, 并在有文件缺失时弹出警告.\n- 将 RTX Super-resolution 引擎的[画质优先]开关移动到主页, 以方便访问.\n- 启用[透明背景图像清晰度增强]时的APNG处理速度加快, 在测试中与之前版本相比速度提升了50%.\n- 加快 SRMD-CUDA 和 RTX Super-resolution 引擎放大APNG的速度.\n- 改进UI性能.\n- 为[透明背景图像清晰度增强]添加必要的状态消息提示.\n- 其它代码性能优化.\n- 更新 ImageMagick.\n---\n## v3.102.01\n#### 更新日志:\n- 新特性: RTX Super-resolution 现已支持APNG放大.\n- 新特性: 现在所有超分辨率引擎均支持在放大APNG时调用[透明背景图像清晰度增强].\n- 改进 SRMD-CUDA 对带有透明通道的媒体的兼容性.\n- 改进 SRMD-CUDA 对APNG的兼容性.\n- 性能优化.\n- 修复问题: 使用[快捷 引擎切换]时的UI显示错误.\n- 修复问题: 使用部分引擎放大APNG时的进度显示问题.\n- 补全翻译.\n---\n## v3.101.01\n#### 更新日志:\n- 新特性: 为 RTX Super resolution 添加 [画质优先] 模式, 开启后在一些情况下可以增强图像质量, 尤其是处理低分辨率图像时.\n- 新特性: [快捷 预设]支持调用RTX Super resolution引擎.\n- 为 RTX Super resolution 添加 [总是禁用降噪] 选项.\n- 改进 RTX Super resolution 的设备兼容性.\n- 更新 ImageMagick.\n- 优化代码性能.\n- 修复问题: 当同时使用RTX Super resolution和HEVC硬件加速编码时可能无法放大视频.\n- 修复问题: 当使用RTX Super resolution处理视频时, 自动重试机制无法正常工作.\n- 修正工具提示中的错误.\n---\n## v3.100.01\n#### 更新日志:\n- 大幅改进 [文件列表] UI 的性能, 在测试中文件加载速度至高提升35x (使用800个文件夹中的1万6个媒体文件进行测试)\n- 改进与视频,GIF和APNG处理相关的代码效率.\n- 优化代码, 改进UI和调度器性能.\n- 改进使用英伟达视频编码器时的视频画质.\n- 改进RTX Super-res的视频兼容性.\n- 改进mp4转换流程以避免潜在兼容性问题.\n- 改进编码mp4视频时的音频质量.\n- 改进RTX Super Resolution引擎的稳定性.\n- 简化视频兼容性检测流程.\n- RTX Super-res引擎设置页的兼容性测试结果现已与兼容性测试页连接.\n- 为兼容性测试页的RTX Super-res测试结果边上添加了\"帮助\"按钮.\n- 修复问题: 使用 RTX Super Resolution 时无法放大部分视频.\n- 修复问题: 使用 RTX Super Resolution 时, 部分视频的音频流和视频流不同步.\n- 修复问题: 在极少数情况下, 向文件列表载入文件时检测不到重复的文件.\n- 修复问题: 使用 RTX Super Resolution 时, 若启用补帧可能无法正常放大视频.\n- 修复问题: 无法检测到部分视频与 RTX Super Resolution 的兼容性问题.\n---\n## v3.99.01\n#### 更新日志:\n- 新增超分辨率引擎: RTX Super Resolution, 为英伟达RTX显卡设计的快速超分辨率方式.\n- 对RTX Super Resolution的多项独家改进: 支持处理带有透明通道的图片, 更多输入/输出格式等.\n- 新特性: 为自定义分辨率新增[自动应用]选项: 当添加新文件时, 自动将当前自定义分辨率设定应用到所有文件.\n- 当对视频同时进行放大和补帧时, 帧率高于指定帧率的视频不会被直接跳过, 这些视频会仅被放大.\n- 更新 FFmpeg\n- 更新 ImageMagick\n- 修复问题: 当Real-ESRGAN引擎的2D与3D模型不同时, 可能无法正常放大媒体文件(图片,动图和视频).\n- 修复问题: 使用某些设定时, 补帧加放大视频后可能无法正常编码视频.\n- 修复问题: 退出流程不完整.\n- 修复错字.\n---\n## v3.98.01\n#### 更新日志:\n- 新增Real-ESRGAN模型: Photo-Conservative-x4\n- 新特性: [解码后暂停], 解码视频后自动暂停, 直到用户点击[继续]按钮.(位于附加设置, 默认禁用)\n- 新特性: 将Real-ESRGAN的模型列表拆分成两个, [3D写实]和[2D动漫]以便于使用.\n- 更智能的转场检测[限制器], 根据视频处理进度智能调节负载.\n- 改进 GUI.\n- 改进转场检测的限制器的稳定性.\n- 优化转场检测调度器.\n- 其他代码优化.\n- 更新 ImageMagick.\n- 更新 ffmpeg.\n- 修复问题: 保持纵横比(扩展) 无法正常工作.\n- 修复问题: 当遇到包含无效透明通道的图片时, [总是预处理带有Alpha通道的图片]无法正常工作.\n- 修复问题: 过时且错误的警告讯息.\n---\n## v3.97.01\n#### 更新日志:\n- ★ 新增 Real-ESRGAN 模型: RealESR-General-x4v3 和 RealESR-General-WDN-x4v3\n- ★ 新特性: [与原图片保持一致]选项, 支持保存图片为与原图片相同的格式.(仅静态图片)\n- ★ 新特性: [预留VRAM], 预留部分显存以改进稳定性, 您可以在附加设置选项卡调整此设定.\n- 新特性: 为[(输入)文件扩展名]列表添加[重置为默认值]按钮.\n- 新特性: 现在您可以禁用[自定义视频设置]中的[固定码率因子CRF]选项.\n- 改进 Real-ESRGAN 的自动引擎设定优化.\n- 改进UI和默认设定.\n- 优化部分代码.\n- 更新 ImageMagick.\n- 更新 ffmpeg.\n- 修复问题: [自定义视频设置]中的[比特率(视频)]选项经常不会生效.\n- 修复问题: 使用[仅转换格式 (静态图片)]时无法将图片转换为PNG.\n- 修复问题: 使用 Real-CUGAN 的 [pro] 模型时可能生成损坏的图片.\n- 修复问题: 与 Real-ESRGAN 引擎设置UI相关的问题.\n---\n## v3.96.01\n#### 更新日志:\n- 新 RIFE-v4.6 模型, 更佳的补帧画质.\n- 新特性: [自动创建输出文件夹], 自动帮助用户创建输出文件夹(包括所有上级文件夹).\n- 新特性: 现在 RIFE v4和v4.6模型均支持TTA.\n- 更佳的引擎设定自动优化算法.\n- 引擎设定自动优化支持所有Real-Cugan模型.\n- 改进UI.\n- 更新 Rife-ncnn-vulkan.\n- 更新 ImageMagick.\n- 更新 ffmpeg.\n- 修复问题:切换Real-Cugan模型无法在处理视频和GIF时生效.\n---\n## v3.95.23\n#### 更新日志:\n- 新特性: 新纵横比策略: [指定分辨率底线]\n- 性能优化\n- 更佳的错误报告与工具提示.\n- 修复问题: 处理静态图片时,带有小数位的放大倍率可能无法正常生效.\n- 修复问题: 处理静态图片时,部分引擎的1x放大无法正常工作\n- 修复问题: 处理静态图片时,指定高度(或宽度)无法正常工作\n- 修复翻译错误.\n- 更新 heif 插件.\n- 更新 ImageMagick.\n- 更新 ffmpeg.\n---\n## v3.95.01\n#### 更新日志:\n- 新特性: 查找转场时支持显示查找进度.\n- 全新重构的内部图片缩放器, 更好的兼容性与画质.\n- 提高静态图片画质.\n- 改进兼容性\n- 性能优化.\n- 重构部分代码以改进代码稳定性.\n- 更新FFmpeg\n- 更新ImageMagick\n- 移除部分没必要的警告讯息.\n- 修复问题: 使用Real-ESRGAN引擎的同时启用[透明通道清晰度增强], 可能造成输出图像丢失.\n- 修复问题: 一些情况下, 处理后的图片无法与部分图片查看器兼容\n- 修复问题: 自动滑动文件列表功能无法正常工作\n- 修复问题: UI 逻辑错误.\n- 修复问题: 补帧时无法达到指定的视频帧率\n---\n## v3.94.01\n#### 更新日志:\n- 新特性: 可以在视频补帧的同时执行[转场检测], 大幅改进性能和执行效率.\n- 新特性: 新增 [快捷 引擎切换]. 位于 [主页] 选项卡, 可以更加便捷的切换超分辨率引擎.\n- 新特性: 所有 IFRNet补帧模型 均支持自动多线程数量调节.\n- 新特性: 所有 RIFE 补帧模型 均支持自动多线程数量调节.\n- 新特性: 为 [转场检测] 添加线程数量 [限制器] 选项, 可以改进电脑在查找转场画面时的流畅度.\n- 改进稳定性和代码效率.\n- 更新FFmpeg和ImageMagick\n- 错误修复.\n---\n## v3.93.01\n#### 更新日志:\n- 新增补帧引擎: IFRNet-ncnn-vulkan.\n- 为Real-CUGAN添加新的 \"Pro\" 模型.\n- 更快的 Real-CUGAN 超分辨率.\n- 更新多个引擎, 减少显存占用.\n- Real-CUGAN 现已支持切换模型.\n- 更新自动引擎设定优化的策略.\n- 更准确的可变帧率视频检测方式.\n- 改进与可变帧率视频的兼容性.\n- 改进用户界面.\n- 更新所有补帧引擎.\n- 更新 Real-CUGAN, RealSR, SRMD(vulkan), Waifu2x(vulkan).\n- 修复多项问题, 修正翻译错误.\n---\n## v3.92.01\n#### 更新日志:\n- 新特性: [透明背景图像清晰度增强]. 在处理带有透明背景(Alpha通道)的图像时, 进一步增强图像清晰度.\n- 全部引擎均已在处理 静态图片 和 PSD 时支持 [透明背景图像清晰度增强].\n- 新特性: 兼容性测试完成后, 自动为新用户调整到兼容的引擎.\n- 改进引擎设定自动优化策略.\n- 改进 UI 性能.\n- 修复问题: 输出视频后, 最终视频的帧率意外改变.\n- 其他问题修复与改进.\n---\n## v3.91.01\n#### 更新日志:\n- 新特性: Real-ESRGAN引擎支持导入与使用第三方模型.\n- 新特性: PNG无损压缩功能回归.\n- 新特性: Waifu2x-caffe引擎支持位深度调整与16位深度图像输出.\n- 新特性: 现在您可以调整底部状态文本框的大小.\n- 改进使用自定义分辨率时的图像质量.\n- Real-CUGAN原生4x放大支持更多降噪等级\n- 更智能的Real-CUGAN模型选择.\n- 改进自动多线程, 更充分的利用高端PC的性能.\n- 自定义视频设置中的[CRF 固定码率因子]参数现在可以支持更多编码器.\n- 改进VFR可变帧率视频检测.\n- 一些UI细节改进.\n- 改进在线检测更新与更新QR码的网络稳定性.\n- 更新多个内部插件.\n- 修复多项问题.\n---\n## v3.90.01\n#### 更新日志:\n- 更快的 Real-ESRGAN 超分辨率, 与之前比速度提升高达 240%.\n- 更快的 Waifu2x 动漫超分辨率, 与之前比速度提升高达 320%.(Waifu2x-NCNN-Vulkan)\n- 新Real-ESRGAN模型: AnimeVideo-v3, 更快更高质量的动漫视频放大模型.\n- 新特性: 保存 GIF 为 APNG.\n- 新特性: [自动清空文件列表], 处理完列表内所有文件后自动清空列表.(默认不启用, 附加设置)\n- 改进Real-ESRGAN 和 Waifu2x-NCNN-Vulkan的自动多线程性能.\n- 更智能的Real-ESRGAN 和 Waifu2x-NCNN-Vulkan自动多线程调度.\n- 加快图片预处理速度.\n- 改进默认设定.\n- 一些GUI内部结构改进.\n- 修复问题: 无法组装PSD图像文件.\n- 其他修复与改进.\n---\n## v3.89.01\n#### 更新日志:\n- 更快的 Real-CUGAN 动漫放大, 与老版本比最多快60%\n- 更快,效率更高的RIFE视频补帧.\n- 新特性: 为Real-CUGAN添加新选项, [总是使用2x模型], 在一些情况下可改进图像的清晰度.\n- 新特性: 支持另存图片为 JPEG XL 格式(.jxl)\n- 新特性: 另存图片为 AVIF 格式时支持调整图像质量\n- 更智能的 Real-CUGAN 模型自动选择\n- 减少RIFE的显存占用\n- 改进RIFE的自动多线程性能\n- 改进自动引擎设定优化.\n- 修复多项问题.\n---\n## v3.88.01\n#### 更新日志:\n- 新超分辨率引擎: Real-CUGAN-NCNN-Vulkan, 高质量 2D动漫 超分辨率放大.\n- 新补帧模型: 新增 Rife-V4.0 模型, 更快的补帧与更低的显存占用.\n- 新特性: 保存图片到Jfif和Jpeg扩展名.\n- 新特性: 为 Waifu2x-Caffe 添加 Real-CUGAN 模型.\n- 改进自定义分辨率机制, 优化性能.\n- 增强 视频, GIF 和 APNG 兼容性.\n- 改进设定预设和UI.\n- 修复多项问题.\n---\n## v3.87.01\n#### 更新日志:\n- 新特性: 现在您可以选择输出视频的封装格式(另存格式).(位于视频设置选项卡)\n- 新特性: [保留字幕(MKV)]: 在输出视频到MKV时保留字幕.(位于视频设置选项卡)\n- 新特性:[仅转换格式 (静态图片)]: 仅转换图片的格式, 不进行诸如超分辨率等的其他处理.(附加设置---工具)\n- 新特性: [另存CFR MP4到RAM]: 重定向CFR Mp4缓存到动态内存缓冲.(可选,默认未开启,附加设定)\n- 新特性: 支持自动调整HEIF/HEIC图片的色度.\n- 改进多线程性能.\n- 更新用户界面, 修复单词拼写错误.\n---\n## v3.86.74\n#### 更新日志:\n- 2022 新年快乐!\n- 新的音频提取方法, 兼容性更好, 音质更好, 速度更快\n- 改进引擎设定的自动优化\n- 改进GUI, 更新内置插件.\n- 修复多项问题.\n---\n## v3.86.02\n#### 更新日志:\n```\nv3.86.02:\n- 修复问题: Real-ESRGAN 引擎在一些情况下无法正确放大视频和GIF.\nv3.86.01:\n- 新特性: 支持RealESRGANv2-animevideo-xsx2(4)模型.\n- 新特性: 另存图片为HEIC/HEIF格式.\n- 加快使用RealESRGAN-NCNN-Vulkan引擎处理2D动漫视频和GIF的速度.\n- 多项GUI改进以充分利用新的RealESRGANv2模型.\n- 增强RealESRGAN-NCNN-Vulkan引擎的兼容性.\n- 改进GIF处理的速度和兼容性.\n- 修复多项问题.\n```\n---\n## v3.85.01\n#### 更新日志:\n- 新特性: 另存APNG到其他格式, 包括gif, mp4, webp和webm. (位于图片设定选项卡)\n- 新特性: 支持可变帧率的GIF.\n- 新增[自动I/O重定向]以改进兼容性.(默认启用,附加设置)\n- 新的GIF生成和读取方式, 速度更快, 画质更好.\n- 改进另存GIF到其他格式的功能, 更好的性能与设备兼容性.\n- 改进UI.\n- 更新多个内部组件, 移除无用组件.\n- 修复多项问题.\n---\n## v3.84.01\n#### 更新日志:\n- 新特性: 将GIF另存为其他格式, 包括mp4, webp和webm.(位于图片设置选项卡)\n- 新特性: [优化循环的视频] 选项, 启用以改进处理循环视频时的补帧效果.(位于附加设定选项卡)\n- 大幅改进[预处理加速], 加快速度以及减少空间占用.\n- 改进视频画质, 更加智能的视频质量控制.\n- 新的纵横比策略: 仅指定宽度(或高度)\n- 新的硬件解码器: OpenCL和Vulkan.\n- 更新FFmpeg并改善兼容性.\n- 修复多项问题.\n- 改进用户界面, 兼容性测试以及每日提示.\n---\n## v3.83.21\n#### 更新日志:\n- 新特性: 支持将图片另存为PSD.\n- 加快软件启动速度.\n- 用户体验改进.\n- 加强自动化, 改进默认设定.\n- 改善视频画质, 改进视频转换速度, 减少空间占用.\n- 更新FFmpeg和ImageMagick.\n- 修复问题: 某些情况下, 预处理加速 可能导致视频流长度变短.\n- 修复UI问题.\n---\n## [v3.83.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.83.01)\n#### 更新日志:\n- 新特性: [预处理加速]: 处理视频前移除视频内所有无用重复帧.可以改进处理速度和补帧的效果.\n- 新特性: [仅移除重复帧 (视频)]: 仅移除视频中的无用重复帧,不进行进一步处理.\n- 新特性: [记忆窗口大小].\n- 新特性: [内存缓冲有效性检查]开关, 现在你可以在禁用此检查后使用其他软件创建的内存盘.\n- 新特性: 为控制台添加[自动滑动]开关.\n- 新特性: GUI现在可以检测插帧或超分辨率期间, 缓存盘空间是否被填满.\n- 全局优化, 提高代码效率, 降低GUI的CPU占用.\n- 改进线程调度器.\n- 改进视频画质,尤其是当使用硬件编码器时.\n- 改进mp4转换流程.\n- 更新 FFmpeg, ImageMagick.\n- 其他诸多改进.\n- 修复多项问题.\n---\n## [v3.81.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.81.01)\n#### 更新日志:\n- 🌟新增超分辨率引擎: RealESRGAN-NCNN-Vulkan.\n- 🌟大幅提升UI性能, 尤其是与文件列表相关的UI.\n- 🌟新特性: [视频取样]: 从视频中取出用户指定的一段进行处理.(在[附加设定]选项卡)\n- 改进网络连接速度.\n- 添加更多设定预设.\n- NVENC编码器的驱动版本检测.\n- 改进MP4转换流程.\n- 改进弹窗消息.\n- 以及其他更多改进.\n- 修复多项问题.\n---\n## [v3.73.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.73.14)\n#### 更新日志:\n- 全新的视频切段方式, 大幅削减分段处理视频造成的额外时间损耗.\n- 进一步改进自动分配补帧线程数量的算法.\n- 进一步改进自动优化超分辨率引擎设定的算法.\n- 减少对部分特定帧率的视频进行补帧时的资源和时间消耗.\n- 改善网络连接速度.\n- 修复多项问题.\n---\n## [v3.72.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.72.13)\n#### 更新日志:\n- 新特性:将插帧引擎多线程的[自动减少]升级为[自动调整], 现在软件可以根据源视频和电脑硬件自动调整插帧引擎的线程数量.\n- 所有非原生支持的图片格式都将在被放大前进行自动预处理.\n- AVIF和HEIC图片支持.\n- 改进超分辨率引擎的自动设定优化.\n- 修复bug: gif帧率错误.\n- 修复bug: 有时无法打开本地html\n---\n## [v3.71.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.71.01)\n#### 更新日志:\n- 新特性: 添加[优化设定]按钮以帮助用户根据PC硬件优化引擎设定, 包含[块大小]和[线程数量].(位于[引擎设置]选项卡)\n- 现在您可以告诉GUI停止在启用硬件加速解码结和编码时显示警告.\n- 当内存中的视频帧缓存丢失时恢复进度.\n- 为SRMD-CUDA添加[GeForce RTX ON]开关.\n- 更新FFmpeg, ImageMagick, SRMD-CUDA.\n- 启用[智能加速]时显示提示.\n- 修复10项错误.\n---\n## [v3.70.02](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.70.02)\n#### 更新日志:\n- 新特性: [动态内存缓冲]: 现在GUI可以直接从内存写入和读取视频缓存(视频帧),这样比之前快得多,并且可以保护硬盘的寿命.\n- 新特性: [指定帧率]: 现在你可以直接指定视频的帧率(比如120FPS).\n- 新特性: [硬件加速 视频解码]: 现在GUI可以调用显卡来加速视频解码.\n- 新特性: [帧编码]: 现在您可以将视频帧的编码切换为JPEG来缩小缓存.\n- 新特性: 现在你可以调整 GIF & APNG 优化的设定, 他们位于 [图片设置] 选项卡.\n- 新特性: PSD(Photoshop Document) 支持.\n- 改进 GUI, 更新 Anime4K, 并修复多个问题.\n---\n## [v3.52.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.52.11)\n#### 更新日志:\n```\nv3.52.11:\n- 第一次启动软件时,选择语言后,立即记忆语言设定.\n- 修正错字.\n- 修复bug:处理高分辨率视频时无法正确识别转场.\n- 修复bug:一些特殊情况下无法读取图片分辨率.\n- 修复bug:一些特殊情况下\"FrameAnalyzeMB\"文件夹没有被自动删除.\n\nv3.52.10-beta:\n- 新特性:[重置画面分析设定]按钮.\n- 改进GUI.\n- 改进画面分析的默认值.\n- 当硬件编码器无法正确转换视频时,自动改用软件编码器.\n- 更详细的报错信息.\n- 修复bug:无法正确检测CFR MP4转换失败.\n- 修复bug:无法正确检测组装视频失败.\n- 修复bug:自定义的像素格式参数设定无法生效.\n```\n---\n## [v3.52.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.52.01)\n#### 更新日志:\n```\nv3.52.01:\n- 新特性:保留所有上级文件夹\n- 新特性:自定义视频扩展名(格式)\n- 新特性:自定义转换到mp4时的视频编码器\n- 新特性:硬件加速编码,支持自动检测兼容并调整\n- 新特性:超线程开关&多线程性能优化.\n- 新特性:NCNN-Vulkan系列引擎在检测GPU ID时会输出ID对应的显卡名称\n- 启动设定预设时弹出提示,告知用户会改变设定\n- 新特性:设定预设右键菜单:[重新应用当前预设]\n- 画面分析完成时显示已经找到的转场画面和重复帧数量.\n- 优化画面分析的性能.\n- 改进对高分辨率显示器的兼容.\n- 移除启用多线程补帧时的警告.\n- 修复bug: SRMD-CUDA 在跑兼容性测试时卡死.\n- 修复bug: 即便通过了DAIN-NCNN-Vulkan的兼容性测试,仍会提示没有兼容的补帧引擎.\n- 修复bug: 视频流不在stream.0将导致软件无法组装生成视频.\n- 修复bug: 分段处理视频时重复加载自定义视频设置导致无法组装视频.\n\nv3.51.01-BETA:\n- 新特性: [智能加速]: 通过分析画面加速视频处理\n- 新特性: [转场检测]: 通过分析视频中的转场来改进补帧后的视频画质\n- 新特性: [预设设定]: 开发者提供的多个设定预设\n- 新特性: [固定码率因子(CRF)] 调整.\n- 新特性: [每日提示].\n- 新的RIFE-ncnn-Vulkan模型: rife-v3.0,rife-v3.1\n- 改进视频画质, 默认设定, 用户界面以及Waifu2x-NCNN-Vulkan的缩放性能.\n- 更新rife-ncnn-vulkan, Waifu2x-NCNN-Vulkan.\n- 修复问题: 无法重置所有自定义视频设定.\n```\n---\n## [v3.42.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.42.11)\n#### 更新日志:\n- 加快APNG处理速度.\n- 更快的APNG缩放,组装和优化方式.\n- 支持带有多个音轨的视频.\n- 独立的APNG优化开关: [优化Gif&APNG].\n---\n## [v3.41.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.41.13)\n#### 更新日志:\n- 新特性: APNG(动态PNG)支持.\n- 当输出文件夹不存在时自动尝试创建它.\n- 为任务栏菜单添加选项.\n- 改进图形界面.\n- 性能优化.\n- 更新FFmpeg,ImageMagick.\n- 修复多个bug以及一些其他改进.\n---\n## [v3.31.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.31.13)\n#### 更新日志:\n- 新增超分辨率引擎: SRMD-CUDA (引擎作者: @MrZihan).\n- 一些其他改进.\n- 修复问题: 生成GIF的帧率一直是10 FPS.\n---\n## [v3.22.26](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.22.26)\n#### 更新日志:\n- 新特性: 现在您可以启用 [结束后自动打开] 以在处理完所有文件后自动打开输出文件夹.\n- 新选项: [忽略帧率模式].\n- 支持者名单页面(patreon).\n- 改进生成视频的画质, 以及生成文件的命名.\n- 为任务栏菜单添加更多选项.\n- 修复多项问题, 优化性能以及其他诸多改进.\n---\n## [v3.22.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.22.14)\n#### 更新日志:\n- 新特性: 现已支持带有小数位的放大倍率.\n- 改进GUI, 性能优化.\n- 添加了一个Patreon按钮.\n- 更新FFmpeg&FFprobe.\n- 修复多项问题.\n---\n## [v3.21.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.21.13)\n#### 更新日志:\n- ✨新的插帧引擎: DAIN-NCNN-Vulkan.\n- ✨新特性: 现在您可以调节[帧率倍率].\n- 为任务栏菜单添加更多选项和图标.\n- 新特性: 处理完所有文件后展示总结弹窗.\n- 新特性: 现在您可以保存多份文件列表.\n- 更新 FFmpeg&FFprobe,ImageMagick.\n- ✅修复多项错误, 并优化性能.\n---\n## [v3.11.27](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.11.27)\n#### 更新日志:\n- 为Rife-ncnn-vulkan引擎新添加模型: [rife-v2.4]\n- 新添加关闭屏幕按钮.\n- 改进 [暂停] 功能.\n- 更新rife-ncnn-vulkan, ImageMagick, FFmpeg&FFprobe.\n- 优化性能\n- ✅多项错误修复.\n---\n## [v3.11.19](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v3.11.19)\n#### 更新日志:\n- 新特性: 借助机器学习对视频进行插帧(补帧). 您可以选择在对进行视频放大后对视频进行插帧, 或者仅对视频进行插帧.\n- 新增内置插帧引擎: RIFE-NCNN-Vulkan, CAIN-NCNN-Vulkan.\n- 新的用户界面布局设计.\n- 多项错误修复.\n---\n## [v2.71.22](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.71.22)\n#### 更新日志:\n- 最大线程数量将不再受到CPU逻辑核心数量的限制.\n- 加快组装GIF的速度.\n- 停止处理文件后，杀死滞留在后台的子进程。\n- 修复bug: 当使用Anime4k时,GIF放大倍率错误.\n- 修复bug: 即便在处理文件时,从列表中移除文件的热键依旧可用.\n- 修复bug: 即使[剩余时间]和[预计完成时间]没有被显示,但是仍旧被计算.\n- 修复bug: 暂停后修改视频片段时长然后继续处理会造成视频顺序错乱.\n---\n## [v2.71.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.71.12)\n#### 更新日志:\n- 重写大量代码,大幅提升所有引擎在处理视频和GIF时的效率,速度和稳定性.\n- 旧版本的waifu2x-ncnn-vulkan引擎不再支持使用多显卡处理视频和GIF.\n- 修复bug: 某些情况下无法正确计算视频的比特率.\n- 修复bug: 使用srmd-ncnn-vulkan时放大倍率可能不准确.\n- 修复bug: 因ImageMagick与新版AMD显卡驱动不兼容而无法组装GIF.\n- 更新ImageMagick,FFmpeg&FFprobe.\n---\n## [v2.62.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.62.13)\n#### 更新日志:\n- 改进SRMD-NCNN-Vulkan的性能.\n- 修复错误: 使用SRMD-NCNN-Vulkan时的放大倍率错误.\n---\n## [v2.62.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.62.12)\n#### 更新日志:\n- 加快视频和gif的处理速度。\n- 替换掉python扩展以提高性能。\n- 改进下载速度, 视频处理流程, 多线程性能以及其他性能改进。\n- 更详尽的工具提示，修正错字。\n- 修复错误：无法正确处理可变帧率视频。\n- 修复错误：兼容性测试结束后，waifu2x-caffe进程可能滞留在后台。\n---\n## [v2.61.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.61.13)\n#### 更新日志:\n- 新特性: 当文件分辨率大于指定分辨率时,自动跳过文件.\n- 新特性: Anime4k新增CUDA运算支持.\n- 预载入引擎设定以改进性能,以及其他性能改进.\n- 更新并适配新版Anime4K.\n- 改进读取图片分辨率的方式.\n- 根据 [@Nova-Aurora](https://github.com/Nova-Aurora) 的建议改进GUI.\n- 更新FFmpeg&FFprobe,ImageMagick.\n- 修复英语翻译问题(感谢 [@Nova-Aurora](https://github.com/Nova-Aurora)), 以及GUI问题修复.\n- 修复bug: 在用户指定处理器后, Waifu2x-Converter的[禁用GPU]选项将不会生效.\n- 修复bug: 如果在处理图片时暂停,会产生垃圾文件.\n---\n## [v2.59.15](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.59.15)\n```\nv2.59.15:\n- 改进 GUI.\n\nv2.59.04-beta:\n- 仅在指定的图片格式不支持Alpha通道时,才将图像强制保存为PNG。\n- 添加按钮以将块大小调整为2的n次方。\n- 性能优化。\n- 编辑工具提示。\n- 其他改进。\n- 更新ImageMagick，FFmpeg＆FFprobe。\n\nv2.59.03-beta：\n- 当文件列表为空时，自动禁用[保存文件列表]按钮。\n- 更紧凑的GUI和其他GUI改进。\n- 编辑工具提示和中文翻译。\n\nv2.59.02-beta：\n- 新功能：重置文件列表比例。\n- 新功能：针对每种文件的文件计数。\n- 新图标。\n- 性能优化。\n- 对GUI的其他改进。\n- 完整的翻译。\n- 修复bug：“加载文件”列表时未禁用[添加文件]按钮。\n- 修复bug：使用[移除项目]的右键菜单后，文件列表的横向标题数据将丢失。\n\nv2.59.01-beta：\n- 新功能：现在您可以通过拖动来更轻松地隐藏组件。\n- 改善GUI设计。\n\nv2.58.14-beta：\n- 新功能：现在，您可以调整文件列表的水平宽度。\n- 将[移至回收站]选项移至[删除原始文件]的右键菜单\n- 对GUI的其他改进。\n- 当用户尝试启用多GPU并且GPU ID列表为空时，通知用户。\n- 优化性能。\n```\n---\n## [v2.58.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.58.13)\n#### 更新日志:\n- 新特性: Waifu2x-ncnn-vulkan 引擎支持使用CPU运算.\n- 新特性: 文件列表支持键盘快捷键.\n- 当文件列表内的文件已经全部处理完成或者被删除时, 提示用户.\n- 更新 Waifu2x-NCNN-Vulkan,ImageMagick,FFmpeg&FFprobe.\n- 与未来版本的NCNN-Vulkan引擎兼容.\n- 更加详尽的工具提示.\n---\n## [v2.57.41](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.41)\n#### 更新日志:\n- ♥预祝各位新年快乐, 感谢各位在2020年中对本项目的支持.\n- 使用强制重试时将不会再改变设定值.\n- 如果优化后的GIF体积不小于原GIF,则其不会被用于替换原GIF.\n- 更新Waifu2x-converter,Anime4K,ImageMagick,FFmpeg&FFprobe.\n- 优化性能,修正错字,以及其他改进.\n- 修复bug: 如果用户将\"gif\"放入文件扩展名列表中,会导致gif文件错位.\n- 修复bug: 有时文件列表会随机横向滑动.\n---\n## [v2.57.31](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.31)\n#### 更新日志:\n- 更新Anime4K,FFmpeg&FFprobe,ImageMagick.\n- 改进性能与兼容性.\n- 一些其他小改进\n- ✅修正多个(英语)语法,UI以及兼容性问题.\n- ✅修复多个bug.\n---\n## [v2.57.21](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.21)\n#### 更新日志:\n- 新特性: 智能检测透明通道是否丢失, 并重新处理文件.\n- 新特性: [`总是预处理带有Alpha通道的图片`].\n- 更新 ImageMagick.\n- 改进性能与稳定性.\n- 修复bug: NCNN-Vulkan 系列引擎无法保留某些特殊png图片的透明通道.\n- 修正错字.\n---\n## [v2.57.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.57.12)\n#### 更新日志:\n- 优化文件列表, 大大提高了文件读取速度.\n- 其他性能优化.\n- 更新 FFmpeg＆FFprobe, ImageMagick.\n- 修正了工具提示中的英文拼写错误和语法问题. (感谢 @CaptainStabs 反馈)\n---\n## [v2.56.95](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.95)\n#### 更新日志:\n- 新特性: 现在您可以将图片另存为多种格式.(感谢 [@loafylemon](https://github.com/loafylemon) 的建议)\n- 优化性能.\n- 更新 FFmpeg&FFprobe.\n- 移除多余的功能,代码,以及注释.\n- 修复bug: 因帧率不正确导致的视频音画不同步.(感谢 [@CAFUCSteven](https://github.com/CAFUCSteven) 的反馈以及协助测试.)\n- 以及其他改进.\n---\n## [v2.56.82](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.82)\n#### 更新日志:\n- 新特性: 现在您可以对文件列表内的文件进行排序.\n- 对文件列表的其他改进.\n- 添加更多好看的图标.\n- 更新FFmpeg&FFprobe,ImageMagick.\n- 改进性能.\n- 减少缓存文件.\n- 添加更多提示信息.\n- 修复多个bug.\n---\n## [v2.56.71](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.71)\n#### 更新日志:\n- 新特性:文件列表右键菜单支持应用与取消自定义分辨率设定.\n- 新特性:将文件输出到指定路径时可以选择保留上级文件夹.\n- 性能优化.\n- 改进用户界面.\n- 更新与适配Anime4KCPP,FFmpeg&FFprobe,ImageMagick.\n- 修复多个bug.\n---\n## [v2.56.52](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.52)\n#### 更新日志:\n- 新特性:可启用[替换原文件]以直接用处理后的文件替换原文件.(附加设置,可选,默认禁用)\n- 性能优化.\n- 更新FFmpeg&FFprobe,ImageMagick.\n- 修复bug.\n---\n## [v2.56.46](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.46)\n#### 更新日志:\n- 在切换更新通道后自动检查更新.\n- 为[移除条目]按钮添加右键菜单.\n- 改善文件列表的易用性.\n- 性能优化.\n- 更新waifu2x-caffe,ImageMagick.\n- 增强waifu2x-caffe引擎,Anime4k引擎的兼容性.\n- 自动调整引擎设置后跳转到主页.\n- 修复bug:鼠标右键无法选中文件列表内的文件.\n---\n## [v2.56.41](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.41)\n#### 更新日志:\n- 新特性:为兼容性测试增加进度条.\n- 更新FFmpeg&FFprobe.\n- 更正错误的描述.\n- 补全多语言翻译.\n- 修复bug.\n---\n## [v2.56.35](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.35)\n#### 更新日志:\n- 根据视频时长,自动判断是否需要启用分段处理.\n- 更新NCNN-Vulkan系列引擎.\n- 更新FFmpeg&FFprobe.\n- 修复多个bug.\n---\n## [v2.56.32](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.32)\n#### 更新日志:\n- 添加更多处理完文件后可执行的动作(关机,睡眠,休眠,重启).(感谢 @Michael18751 的建议)\n- 适配新版FFmpeg.\n- 更新FFmpeg&FFprobe,ImageMagick.\n- 性能优化.\n- 修复多个bug.\n---\n## [v2.56.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.56.12)\n#### 更新日志:\n- Anime4k引擎在启用HDN后可支持调节降噪等级.\n- 为Anime4k引擎添加自动检测Alpha通道的支持.(新版Anime4k引擎支持保留Alpha通道)\n- 为[文件列表]添加右键菜单选项:[打开选中文件],[从列表移除所选文件]和[打开选中文件的文件夹]\n- 为[输出路径]添加右键菜单以打开输出路径文件夹.\n- 更新FFmpeg&FFprobe,Anime4K.\n- 修复多个bug.\n- 其他改进.\n---\n## [v2.55.24](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.55.24)\n#### 更新日志:\n- 更新FFmpeg&FFprobe,Python扩展,waifu2x-ncnn-vulkan,ImageMagick.\n- 性能优化.\n- 其他改进.\n---\n## [v2.55.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.55.12)\n#### 更新日志:\n- 新特性:为所有引擎加入显示当前多显卡设定的按钮.\n- 更新FFmpeg&FFprobe,ImageMagick.\n- 性能优化.\n- 完善多语言支持.\n- 修复多个bug.\n---\n## [v2.54.13](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.54.13)\n#### 更新日志:\n- 更新QT版本至5.15.0,并使用新版QT重新编译.\n- 当检测到自定义分辨率包含奇数时,自动为视频修正自定义分辨率.\n- 在启用[禁止连接码云]后,自动在后台检测是否可以连接raw.githubusercontent.com.\n- 更新waifu2x-ncnn-vulkan,srmd-ncnn-vulkan,realsr-ncnn-vulkan,FFmpeg&FFprobe.\n- 性能优化.\n- 修复多个bug.\n- [以及其他诸多改进, 点击查看详细更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.54.13_v2.53.14_Detailed_change_log.txt)\n---\n## [v2.53.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.53.14)\n#### 更新日志:\n- 新特性:[添加文件]按钮支持选中并添加多个文件.\n- 新特性:加入[禁止连接码云]选项,启用本选项将禁止本软件从码云下载文件.\n- 更新RealSR-ncnn-vulkan,Waifu2x-ncnn-vulkan,ImageMagick,Python扩展.\n- 性能优化,减少网络流量消耗和对外部程序的调用.\n- 修复多个bug.\n- [以及其他诸多改进, 点击查看详细更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.53.14_v2.52.16_Detailed_change_log.txt)\n---\n## [v2.52.16](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.52.16)\n#### 更新日志:\n- 新特性:为Anime4k & Waifu2x-caffe引擎添加验证显卡配置的按钮.\n- 优化SRMD-ncnn-vulkan处理图像的流程,提高性能.\n- 更新ImageMagick,FFmpeg&FFprobe,waifu2x-caffe,Anime4k.\n- 内置cuDNN.\n- 性能优化.\n- 修复多处bug.\n- [以及其他诸多改进, 点击查看详细更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.52.16_v2.51.17_Detailed_change_log.txt)\n---\n## [v2.51.17](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.51.17)\n#### 更新日志:\n- 新特性:为所有引擎添加多显卡支持.\n- 新特性:添加任务栏图标,支持最小化到任务栏.\n- 新特性:后台模式.\n- 新特性:可选择更新通道(稳定版,测试版).\n- 新特性:更新后将保留原来的设置.\n- 新特性:为Anime4k引擎的ACNet算法添加快速模式支持.\n- 新特性:ACNet算法支持指定显卡.\n- 新特性:为输出到指定文件夹添加[直接覆盖]选项.\n- 更新ImageMagick,waifu2x-ncnn-vulkan,FFmpeg.\n- 性能优化.\n- 修复多处bug.\n- [以及其他诸多改进, 点击查看详细更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/temp/v2.51.17_v2.45.18_Detailed_change_log.txt)\n---\n## [v2.45.18](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.45.18)\n#### 更新日志:\n- 新特性:为Anime4k引擎加入HDN模式支持,可改善画质.(启用ACNet后才能启用HDN)\n- 新特性:保留原文件名.(可选,默认禁用)\n- 更新Anime4K,ImageMagick,FFmpeg.\n- 为提示音添加淡出效果.(由 @Michael18751 编辑)\n- 性能优化.\n- 修复多处Bug.\n- 以及其他多项改进.\n---\n## [v2.44.18](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.44.18)\n#### 更新日志:\n- 新特性:为Anime4K引擎加入ACNet算法支持, ACNet可以在改善画质的同时实现高速处理.(您需要在Anime4k引擎设置中手动启用ACNet)\n- 更新 ImageMagick,waifu2x-ncnn-vulkan,SRMD-ncnn-Vulkan,realsr-ncnn-vulkan,Anime4K.\n- 优化性能,提高稳定性.\n- 修复多处Bug.\n- 以及其他多项改进.\n---\n## [v2.43.17](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.43.17)\n#### 更新日志:\n- 新特性:支持预处理图片以兼容更多图片格式.(附加设置,可选,默认禁用)\n- 更新Python extension,waifu2x-ncnn-vulkan,srmd-ncnn-vulkan,realsr-ncnn-vulkan,FFmpeg,ImageMagick.\n- 改进自动检查更新流程.\n- 改进多线程调度机制.\n- 添加与修改tooltip.\n- 支持在线更新捐赠二维码.\n- 添加一些提示,修改一些文本,修正错字.\n- 性能优化.\n- 修复若干bug.\n- 其他改进.\n---\n## [v2.41.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.41.12)\n#### 更新日志:\n- #### 新特性:新增realsr-ncnn-vulkan引擎,大幅提升对3D写实风格图像的处理效果(感谢 @CAFUCSteven 协助测试软件).\n- 新特性:除Anime4k外的引擎均支持自动识别并处理Alpha通道图片.\n- 更新waifu2x-ncnn-vulkan引擎.\n- 更新srmd-ncnn-vulkan引擎.\n- 更新ImageMagick.\n- 优化启动器.\n- 优化检查更新的流程.\n- 调整对带有Alpha通道的图片的处理流程.\n- 修复若干bug.\n- 其他改进.\n---\n## [v2.31.14](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.31.14)\n#### 更新日志:\n- 新特性:新增waifu2x-caffe引擎(实验性功能)(感谢 @CAFUCSteven 协助测试软件).\n- 新特性:waifu2x-caffe引擎支持快速切换图像样式.\n- 新特性:支持切换处理带有Alpha通道的图片时使用的引擎.\n- 优化处理带有Alpha通道的图片的流程.\n- 调整兼容性测试界面.\n- 性能优化.\n- 更改默认设置.\n- 添加一些提示,修改一些文本,修正错字.\n- 修复多个bug.\n- 其他改进.\n---\n## [v2.21.12](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.21.12)\n#### 更新日志:\n- 新特性:处理视频或GIF时,单独显示当前文件的进度(进度条,消耗时间,剩余时间,ETA).\n- 性能优化.\n- 改善ffporbe插件的兼容性.\n- 修复bug:一些情况下,处理视频时会卡在获取时长那一步.\n- 其他改进.\n---\n## [v2.11.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.11.3)\n#### 更新日志:\n- 新特性:Anime4K引擎支持处理图片和GIF.\n- 新特性:根据兼容性测试结果自动调整引擎设置.\n- 兼容性测试结束后,根据测试结果给予用户提示.\n- 更新Anime4K(v1.8.1).\n- 更新ImageMagick(7.0.10-12-Q16-x64).\n- 更改默认设置.\n- 添加一些提示.\n- 处理文件前检测是否拥有文件所在目录的写权限.\n- 改进软件启动时的权限检测.\n- 修复bug:特殊情况下,处理视频时可能会卡在获取时长那一步.\n- 修复bug:无法正常检测是否拥有输出路径的写权限.\n- 修复bug:当使用Anime4k引擎处理视频时,自定义分辨率设定无效.\n---\n## [v2.02.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.02.3)\n#### 更新日志:\n- 更新Anime4K(v1.7.0).\n- 改进简体中文支持.\n- 改进兼容性测试,减少资源占用.\n- 添加一些提示.\n- 修复bug:某些情况下,程序会在运行兼容性测试时卡住.\n- 修复bug:某些组件未在处理文件时禁用,可能导致潜在错误.\n---\n## [v2.01.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v2.01.1)\n#### 更新日志:\n- 新特性:重新设计用户界面.\n- 新特性:添加[繁體中文]支持(感謝 @uimee 協助翻譯).\n- 新特性:Anime4K引擎支持指定GPU.\n- 新特性:存储与读取所有引擎的GPU设置.\n- 新特性:改进兼容性测试,增加检测项目,支持存储测试结果.\n- 更新Anime4K(v1.6.0).\n- 更新ImageMagick(7.0.10-10-Q16-x64).\n- 改进多线程管理.\n- 添加一些提示.\n- 性能优化.\n- 修复bug.\n---\n## [v1.73.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.73.3)\n#### 更新日志:\n- 新特性:为Anime4K引擎加入GPU加速支持.\n- 新特性:安装软件后,首次启动时弹窗让用户选择自己所使用的语言.\n- 更新Anime4K(v1.5.0)\n- 不再允许禁用自动检查更新，但是可以禁用自动更新弹窗，禁用弹窗后将在文本框内显示更新提示.\n- 兼容测试结束后弹窗提示用户查看测试结果.\n- 完善兼容性测试.\n- 当文件列表内包含GIF或视频时隐藏ETA和剩余时间.\n- 完善多语言支持.\n- 修复bug.\n---\n## [v1.71.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.71.1)\n#### 更新日志:\n- 新特性:用Anime4KCPP替换掉了之前的Anime4K-JAVA,Anime4KCPP与Anime4K-JAVA相比速度更快,画质更好.\n- 新特性:为Anime4K引擎添加了大量自定义设置.\n- 界面布局调整.\n- 修正翻译错误.\n- 修改部分文本.\n---\n## [v1.63.1](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.63.1)\n#### 更新日志:\n- 提高稳定性.\n- 优化性能.\n- 添加一些提示.\n- 修改部分文字.\n- 修正翻译错误.\n- 修复bug:极少数情况下缓存文件会重名并导致错误.\n- 修复bug:重置视频设置按钮无法正常工作.\n---\n## [v1.62.5](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.5)\n#### 更新日志:\n- 修复bug:当`分段处理视频`启用时,无法正常读取缓存,这将导致软件无法继续之前的进度.(感谢 Esper Wang 的反馈✔)\n---\n## [v1.62.4](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.4)\n#### 更新日志:\n- 修复bug: 一些情况下,输出的视频会音画不同步.(感谢  @FITHRPG6 的反馈)\n---\n## [v1.62.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.62.3)\n#### 更新日志:\n- 新特性:waifu2x-ncnn-vulkan新增了fp16p支持,改善了对一些老驱动的兼容性.\n- 更新waifu2x-ncnn-vulkan(version 20200414).\n- 更新ImageMagick(7.0.10-6-Q16-x64).\n- 将默认的自定义分辨率的纵横比策略更改为保持纵横比.\n- 修复bug:某些情况下的界面显示错误.\n- 修复bug:当源视频文件名称内包含中文时,分段处理视频后无法正确的组装视频.\n---\n## [v1.61.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.61.3)\n#### 更新日志:\n- 新特性:分段处理视频,大幅减少处理视频时占用的硬盘空间. 🎉🥳🎉 (可选,附加设置,默认启用)\n- 完善多语言支持.\n- 其他小改进.\n- 修复bug:停止处理进程时将强制终止ffmpeg进程,会导致无法正常生成缓存文件,影响下次读取任务进度.\n- 修复bug:某些情况下进度条无法正常显示进度.\n---\n## [v1.51.3](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.51.3)\n#### 更新日志:\n- 性能优化.\n- 删除冗余代码.\n- 完善多语言支持.\n- 修复bug:当软件语言为日语时,无法正常打开Readme.\n- 修复bug:一些由本软件自动生成的缓存文件可能会被垃圾清理软件识别为空文件并删除.\n- 修复bug:关机前的倒计时的时间不准确.\n- 其他小改进.\n---\n## [v1.50.2](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.50.2)\n#### 更新日志:\n- 新特性:借助SoX(14.4.2-win32)对视频的音频进行降噪.(可选,附加设置,默认禁用)(感谢 @wenbob 的建议)\n- 新特性:自动关闭计算机前将保存软件设置.\n- 优化界面显示.\n- 完善多语言支持,修正翻译错误.\n- 修复bug:当启用[保存视频缓存]后,仍会删除源视频文件.\n---\n## [v1.45](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.45)\n#### 更新日志:\n- 新特性:可选择是否在退出时弹窗.(可选,附加设置,默认启用)\n- 新特性:根据兼容性测试结果自动判断是否启用[自动检测Alpha通道].\n- 新特性:保存视频缓存.(可选,附加设置,默认启用)\n- 新特性:在用户停止任务或者发生错误时,视频的缓存不会被自动删除,并且还可以被软件读取以继续之前的进度.\n- 提高多线程调度的稳定性.\n- 修复bug:某些情况下无法正常重命名文件导致无法正常组装视频.\n- 修复bug:因线程调度错误而导致无法正常处理列表内的文件.\n---\n## [v1.37](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.37)\n#### 更新日志:\n- 新特性:在将视频转换到mp4时,支持自动获取原视频的比特率并应用到转换后的mp4上.\n- 新特性:在输出视频时,将使用软件内置算法分配比特率.\n- 将默认的[压缩后的\".jpg\"图像质量]值改为95.\n- 修复bug:某些情况下进度条无法正常显示进度.\n---\n## [v1.31](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.31)\n#### 更新日志:\n- 新特性:自动判断图片是否带有Alpha通道并切换到兼容的引擎.(可选,附加设置,默认禁用)(`启用此特性前请先确保您的电脑与waiuf2x-converter兼容.`)\n- 新特性:第一次启动软件时自动运行兼容性测试.\n- 改进多线程管理,提高稳定性.\n- 去掉[显示Tips]按钮.\n- 修复bug:某些情况下输出waifu2x-converter的处理器列表会造成软件陷入死循环.\n---\n## [v1.21](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.21)\n#### 更新日志:\n- 新特性:支持记住上一次浏览的文件夹.\n- 新特性:改进自动检查更新, 支持显示更新日志.\n- 新特性:启动器加入多开检测.\n- 新特性:视频自定义设置中支持键入额外指令.\n- 更新 ImageMagick (7.0.9-27-Q16-x64)\n- 更新 自动检查更新时使用的User-Agent.\n- 更改部分界面布局.\n- 改进稳定性.\n- 添加了一些提示.\n- 修改了一些令人迷惑的文本.\n---\n## [v1.11](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.11)\n#### 更新日志:\n- 新特性:新增SRMD-NCNN-Vulkan引擎. 🎉🥳🎉\nSRMD-NCNN-Vulkan引擎可以同时支持`2D动漫`和`3D现实`两种图像样式.\n您可以[点击本页面](https://github.com/cszn/SRMD)以了解SRMD技术.\n\n---\n## [v1.01](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v1.01)\n#### 更新日志:\n- ### 结束beta测试,开始正式版本的更新迭代. 🎉🥳🎉\n- 新特性:新增[日本語]语言支持. 🐱‍👤\n`(机器翻译,可能包含错误)`\n- 增加一些提示.\n- 修复bug:文本错误.\n- 修复bug:切换语言后,部分文本显示错误的问题.\n---\n## [v0.57-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.57-beta)\n#### 更新日志:\n- 添加PayPal捐赠按钮\n- 重写文件列表相关的代码,加快运行速度,减少内存占用.\n- 修复bug:当列表内条目较多时,移除单个条目会造成无响应.\n- 修复bug:指定输出路径后, 同一文件名的文件将互相覆盖.\n- 修复bug:当检测可用的GPU ID时未区分新旧版本的waifu2x-ncnn-vulkan\n---\n## [v0.56-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.56-beta)\n#### 更新日志:\n- 修复bug:读取文件速度慢\n- 修复bug:因为等待ffmpeg拆分视频(或GIF)而导致无法正常停止处理文件进程\n- 修复bug:某些情况下,当退出程序后外部插件仍在运行\n---\n## [v0.55-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.55-beta)\n#### 更新日志:\n- 默认启用旧版本的waifu2x-ncnn-vulkan引擎.(因为新版本的waifu2x-ncnn-vulkan存在稳定性问题)\n`如果您需要使用waifu2x-ncnn-vulkan引擎的TTA的特性,切换到新版本即可.`\n- 提高稳定性.\n- 修复bug:一次性添加大量文件时会造成程序无响应.\n---\n## [v0.54-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.54-beta)\n#### 更新日志:\n- 新特性:关闭软件时弹出窗口询问用户是否确认退出.\n- 新特性:新增[强制重试], 当waifu2x线程卡死时可以执行强制重试以解除卡死,并且不会中断整个[放大与降噪]进程\n- 完善对waifu2x-ncnn-vulkan引擎的错误检测, 提高稳定性.\n- 修复bug:一些情况下未删除所有临时文件\n- 修复bug:某些特殊情况下多线程调度出错导致卡死\n---\n## [v0.53-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.53-beta)\n#### 更新日志:\n- 新特性:支持切换waifu2x-ncnn-vulkan引擎版本, 当您的电脑使用waifu2x-ncnn-vulkan引擎出现问题时, 可以尝试更新显卡驱动或启用旧版本的waifu2x-ncnn-vulkan引擎\n- 新特性:兼容性测试新增对旧版本waifu2x-ncnn-vulkan引擎的测试\n- 新特性:自定义重试次数(附加设置)\n- 尝试修复高DPI屏幕显示的问题.(因为我自己没有高DPI显示器, 故无法测试)\n- 修复bug:文本错误\n---\n## [v0.52-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.52-beta)\n#### 更新日志:\n- 提高稳定性, 当引擎崩溃时将重试, 不会再因为一次引擎崩溃而整个处理过程失败\n- 提高Anime4k引擎的稳定性\n- 当未启用输出路径时, 禁用输出路径的lineEdit\n- 修正文本错误\n- 更新 waifu2x-ncnn-vulkan (version 20200224)\n---\n## [v0.51-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.51-beta)\n#### 更新日志:\n- 新特性:当启用\"删除原文件\"时,可选择将原文件移动到回收站\n- 新特性:支持选择是否启用自定义视频设置(附加设置,可选,默认禁用)\n- 新特性:指定输出目录\n- 新特性:扫描子文件夹(附加设置,可选,默认启用)\n- 新特性:waifu2x-ncnn-vulkan 引擎新增TTA支持\n- 新特性:waifu2x-converter 引擎新增TTA支持\n- 新特性:文件列表互动性设置(附加设置)\n- 更新waifu2x-ncnn-vulkan(20200223)\n- 性能优化\n- 完善错误检测\n- 修复bug:文本错误\n---\n## [v0.461-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.461-beta)\n#### v0.461-beta 更新日志:\n- 修复bug:某些情况下会造成源视频文件丢失\n#### v0.46-beta 更新日志:\n- 新特性:支持更多视频相关的自定义参数\n- 新特性:初次启动时显示提示\n- 更新 waifu2x-ncnn-vulkan (20200222)\n- 界面布局调整\n- 增强视频画质\n- 修复bug:停止处理时没有删除软件生成的临时mp4视频\n- 修复bug:启用waifu2x-ncnn-vulkan时,无法正确计算目标放大倍数 (感谢 slimekingwin8cn 反馈)\n---\n## [v0.45-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.45-beta)\n#### 更新日志:\n- 新特性:waifu2x-ncnn-vulkan引擎支持切换到cunet模型\n- 新特性:自定义视频的编码器,码率和像素格式(在附加设置中)\n- 新特性:自定义分辨率支持应用设置到所有文件\n- 视频画质增强\n- 性能优化,减少启用自定义分辨率时处理GIF和视频所需的时间\n- 修复bug:启用自定义分辨率时无法正确计算目标放大倍数\n---\n## [v0.411-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.411-beta)\n#### v0.411 更新日志:\n- 改善waifu2x-converter的兼容性\n#### v0.41 更新日志:\n- 新特性: waifu2x-converter 支持更多降噪等级\n- 新特性:新增 waifu2x-converter 引擎自定义设置\n- 新特性:自定义字体\n- 新特性:最小化窗体\n- 新特性:隐藏文本框\n- 更新 waifu2x-converter (v5.3.3) (感谢 NyanMisaka 反馈)\n- 界面布局调整\n- 提高稳定性\n- 其他多项改进\n- 修复bug:当文件扩展名大写时无法正确识别(感谢 zhehenkaifa 反馈)\n- 修复bug:当视频扩展名为\".MP4\"而非\".mp4\"时, 会导致错误\n- 修复bug:当文件名称内有多余的\".\"时会导致软件错误(感谢 我叫黄伟达 反馈)\n- 修复bug:某些特殊情况下无法停止处理\n---\n## [v0.37-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.37-beta)\n#### 更新日志:\n- 新特性:自定义\".jpg\"文件压缩后的图像质量\n- 完善浏览文件对话框的文件扩展名过滤\n- 更新ImageMagick(7.0.9-22-Q16-x64)\n- 提高稳定性\n- 完善简体中文支持\n- 其他小改进\n- 修复bug:程序关闭后滞留后台\n---\n## [v0.35-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.35-beta)\n#### 更新日志:\n- 新特性:自定义全局字体大小(附加设置)\n- 新特性:浏览与添加文件\n- 性能优化\n- 提高稳定性\n- 审查代码,增加代码注释\n- 界面布局调整\n- 多处微小改进\n- 修复bug:不能兼容Windows系统的自定义缩放\n- 修复bug:某些特殊情况下无法正常识别文件是否被重复添加的问题\n- 修复bug:无法保存降噪等级设置\n---\n## [v0.31-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.31-beta)\n#### 更新日志:\n- 新特性:加载文件列表时显示进度\n- 新特性:可自定义\"自定义分辨率\"的纵横比策略(在[附加设置]内)\n- 新特性:手动保存设置后弹窗提示\n- 新特性:可以一直隐藏\"设置\"(可选,默认禁用,在[附加设置]内)\n- 新特性:显示GIF和视频线程数量之总数\n- 界面布局微调\n- 修复bug:当正在处理gif时,停止处理进程后无法正常改变文件处理状态\n---\n## [v0.291-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.291-beta)\n#### 更新日志:\n- 新特性:关闭程序时自动保存设置(可选,默认启用)\n- 新特性:可以一直隐藏\"输入路径\"(可选,默认禁用)\n- 新特性:增加[关于]\n- 新特性:权限检测\n- 调整界面布局,将部分设置选项移动到[附加设置]内\n- 完善简体中文支持\n- 修复bug:一些特殊情况下程序会滞留在后台运行\n---\n## [v0.281-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.281-beta)\n#### 更新日志:\n- 新特性:[文件列表]支持选中后再次点击取消选中\n- 界面美化\n- 调整界面布局\n- 完善简体中文支持\n- 修复bug:某些情况下GIF的帧无法正常排列\n- 修复bug:某些情况下线程会被提前自动关闭导致任务无法完成\n- 修复bug:某些情况下程序无法完全退出会滞留在后台执行无限循环\n- 修复bug:当系统内没有Java运行环境时,调用Anime4k可能会造成软件进入无限循环\n---\n## [v0.25-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.25-beta)\n#### 更新日志:\n- 新特性:首次启动时读取屏幕分辨率并设定为默认的自定义分辨率值\n- 新特性:加载文件列表时,在Textbrowser内自动输出状态为[失败]的条目\n- 更新FFmpeg(4.2.2)\n- 修复bug:某些特殊的情况下,自动检查更新会误报存在新版本\n- 修复bug:无法正常执行自动关闭计算机\n- 修复bug:切换语言后无法正常显示[文件数量]\n- 完善简体中文语言支持\n---\n## [v0.21-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.21-beta)\n#### 更新日志:\n- 新特性:进度条左侧显示[完成数量/总数量].\n- 新特性:增加设置选项,控制是否在启动时自动检查更新.(不建议关闭自动更新)\n- 新特性:文件列表下方显示总文件数量.\n- 新特性:保存/读取文件列表\n- 新特性:自动关机前自动保存文件列表,下次开机后可手动加载文件列表查看文件处理情况\n- 新特性:自动关机前弹窗提示\n- 完善简体中文语言支持\n- 根据当前语言来选择要打开的说明文档\n- 在开始处理一个文件前,先检查其是否存在\n- 修复bug:保存设置后,无法正常读取曾保存的[图像风格]设置\n- 修复bug:移除单一条目后,其余所有条目的自定义分辨率设置会被清除\n- 修复bug:当文件列表内有文件名称相同而扩展名不同的文件时, 如果启用多线程会造成读写冲突.\n- 修复bug:自动检测到新版本后无法正常打开新版下载页面的问题.\n---\n## [v0.12-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.12-beta)\n#### 更新日志:\n- 新增功能: 自动检查更新\n- 修复bug: gif和视频无法正常获取放大倍数设定\n- 修复bug: 当处理视频或gif时, 如果产生错误, 将导致线程管理问题.\n---\n## [v0.11-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.11-beta)\n#### 更新日志:\n- 新增功能: 自定义图片, GIF和视频输出时的分辨率. (应一名匿名捐赠者的要求.🧐)\n- 新增功能: 多语言.(加入简体中文) 🎉🥳🎉(应一名匿名捐赠者的要求.🧐)\n- 新增功能: 支持保存当前设置, 启动软件时自动恢复上一次保存的设置.\n- 新增功能: 切换设置选项显示状态.(隐藏/显示)\n- 新增功能: 切换[输入路径]显示状态.(隐藏/显示)\n- 新增功能: 用户误操作时弹出提示.\n- 新增功能: 更改Textbrowser的字体大小后自动滑动到底端.\n- 新增功能: Textbrowser输出新内容后自动滑动到最底端\n- 新增功能: 文件列表表格自动根据显示内容调整大小\n- 新增功能: 检测可用GPU与设定GPU ID\n- 改进tableview选中逻辑. 当其中一个tableview被选中时, 其余两个自动取消选中.\n- 优化tableview显示逻辑, 在输入文件后, 仅改变对应tableview的显示状态.\n- 去除冗余代码\n- 修复bug: 当[Re-process finished files]未启用时, 尝试移除已经处理完成的文件会导致程序崩溃.\n- 修复bug: [video_gif_info.exe] 无法正常读取中文字符\n- 修复bug: 处理完所有文件后未自动启用[兼容性检测]按钮\n---\n## [v0.01-beta](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/tag/v0.01-beta)\n#### 更新日志:\n- 第一个发行版.\n"
        },
        {
          "name": "Donate_page.md",
          "type": "blob",
          "size": 0.9453125,
          "content": "# ❤ Donate 捐赠 ❤ (PayPal, 支付宝&微信)\n```\nPlease donate to support developers, so we can bring further update for this software, thank you! (｡･∀･)ﾉﾞ\n\n请捐赠以支持开发者, 您的支持是我们更新软件的动力, 谢谢您! (｡･∀･)ﾉﾞ\n```\n---\n\n### [⬇Become a Patron to access the ✨Premium Version✨](https://www.patreon.com/aaronfeng)\n\n<p align=\"left\">\n<a href=\"https://www.patreon.com/aaronfeng\"><img src=\"https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/BecomePatron.jpg?raw=true\" alt=\"Patreon donate button\" height=\"45\"/> </a>\n</p>\n\n---\n#### 微信+支付宝\n\n# [➡ 爱发电(众筹)](https://afdian.net/@AaronFeng)\n\n### [➡ PayPal(海外QQ用户) ⬅](https://www.paypal.me/aaronfeng753)\n\n![donate_new](/donate_new.jpg)\n#### 如果donate(捐赠)二维码图片无法正常加载,请[打开此链接查看](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI/raw/master/donate_new.jpg)\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.45703125,
          "content": "Waifu2x-Extension-GUI is free for PERSONAL USE ONLY.\n\nIf you wish to use Waifu2x-Extension-GUI commercially, please purchase\nthe Premium version from:\nhttps://www.patreon.com/aaronfeng\n\nLimitation of Liability\nTHIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY \nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT \nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND \nFITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE \nQUALITY AND PERFORMANCE OF THE SOFTWARE IS WITH THE LICENSEE. \nSHOULD THE SOFTWARE PROVE DEFECTIVE, YOU ASSUME THE COST \nOF ALL NECESSARY SERVICING, REPAIR OR CORRECTION. IF ANY \nALGORITHM IS PATENTED IN YOUR COUNTRY, YOU SHOULD ACQUIRE \nA LICENSE BEFORE USING THIS COMPONENT.\n\nIN NO EVENT WILL THE AUTHOR OR ANY OTHER PARTY WHO MAY HAVE \nDISTRIBUTED THE SOFTWARE AS PERMITTED ABOVE, BE LIABLE TO YOU \nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR \nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO \nUSE THE SOFTWARE (INCLUDING BUT NOT LIMITED TO LOSS OF DATA \nOR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU \nOR THIRD PARTIES OR A FAILURE OF THE SOFTWARE TO OPERATE WITH \nANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS \nBEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. \n\nYOU ACKNOWLEDGE THAT YOU HAVE READ THIS AGREEMENT, \nUNDERSTAND IT AND AGREE TO BE BOUND BY ITS TERMS \nAND CONDITIONS.\n\nWaifu2x-Extension-GUI\nCopyright (C) 2021 Aaron Feng\n\nhttps://github.com/AaronFeng753/Waifu2x-Extension-GUI\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.1708984375,
          "content": "<p align=\"center\">\n<img src=\"/.github/README/ICON.png\" height=\"150\">\n</p>\n\n<h2 align=\"center\"> Waifu2x-Extension-GUI </h2>\n\n<h3 align=\"center\"> Photo/Video/GIF enlargement and Video frame interpolation using machine learning </h3>\n<h3 align=\"center\"> Supports AMD / Nvidia / Intel GPU </h3>\n\n<p align=\"center\">\n<a href=https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest><img src=\"https://img.shields.io/github/v/release/aaronfeng753/waifu2x-extension-gui?label=Latest%20stable%20release&style=flat-square&color=brightgreen\"></a>\n<img src=\"https://img.shields.io/badge/Support-Windows%20x64-blue?logo=Windows&style=flat-square\">\n</p>\n\n### [📜中文 说明文档](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/README_CN.md)\n\n# [💾Download Latest Stable Build (Windows x64)](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest)\nDownload Latest portable package for `Windows x64` PCs with `Intel/AMD/Nvidia` GPUs.\n\nDownload Latest Build➡: https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest\n\n#### ➡Get ✨Premium version on Patreon: https://patreon.com/aaronfeng\n\n#### [📝Full change log](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/Change_log.md)\n\nSupported Languages: English, 简体中文, 繁體中文.\n\n# What is Waifu2x-Extension-GUI?\n\n### `Image` & `GIF` & `Video` `Super-Resolution` and Video `Frame Interpolation` using Deep Convolutional Neural Networks.\n\n### ✨Key features:\n- #### 💡EASY TO USE: Just Unzip and Start. And built-in `Settings Presets` can help you adjust all the settings with `ONE Click`.\n- #### 📺Multimedia support: Supports processing Image & Animated GIF&APNG&WebP & Video at the same time.\n- #### 😍Full image style support: Multiple built-in algorithms, 2D anime, or your daily photos & videos, this software can handle all of them.\n- #### 🎞Video frame interpolation: Automatically use AI to interpolate frames after enlarge the video.\n- #### ⚡Video Frame Analysis: Analyze video frames to Improve video Quality and Speed Up video processing.\n- #### ✅Great compatibility: Multiple built-in engines, compatible with almost all modern Windows PCs.\n- 📊Flexible multi-thread setting: You can adjust the number of threads freely while providing a complete set of settings for each engine, Take advantage of all the capabilities of your PC.\n- 🚀🚀🚀Multi-GPU support: Multi-GPU support for ALL built-in engines.\n- 🛠Numerous customizable settings: You can automate your workflow by adjusting the many customizable settings in the software.\n- 🤖Smart settings: This software can automatically adjust some software settings based on your PC hardware information and the information of the files you want to process.\n- 😉Easy-to-use graphical user interface.\n- 📨Continual maintenance and updates.\n\n<p align=\"left\">\n<img src=\"/.github/README/Powered_by_nvidia.jpg\" height=\"70\">\n</p>\n\n```\nBuilt-in super-resolution algorithms:\nWaifu2x / SRMD / RealSR / Real-ESRGAN / Real-CUGAN / Anime4K\nACNet / RTX Super Resolution (RTX VSR / RTX Video Super Resolution)\n\nBuilt-in super-resolution engines:\nWaifu2x-caffe / Waifu2x-converter / Waifu2x-ncnn-vulkan\nSRMD-ncnn-vulkan / RealSR-ncnn-vulkan / Anime4KCPP / SRMD-CUDA\nRealESRGAN-NCNN-Vulkan / Real-CUGAN-ncnn-vulkan / RTX Super Resolution\n\nBuilt-in Video frame interpolation algorithms:\nRIFE / CAIN / DAIN / IFRNet\n\nBuilt-in Video frame interpolation engines:\nrife-ncnn-vulkan / cain-ncnn-vulkan / dain-ncnn-vulkan\nIFRNet-ncnn-vulkan\n```\n\n#### ✅Already been tested on the `AMD` RX 550, `NVIDIA` GeForce RTX 3060/4060 and `Intel` UHD 620.\n\n![mainwindow](/Screenshot/mainwindow.jpg)\n\n![Engine_Settings](/Screenshot/Engine_Settings_EN.jpg)\n\n![VideoSettings_EN](/Screenshot/VideoSettings_EN.jpg)\n\n![Additional_Settings](/Screenshot/Additional_Settings_EN.jpg)\n\n# [Samples👀](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/tree/master/Samples/)\n\n### [➡Comparison(3D Real-life)](https://imgsli.com/NjQ4NzY)\n#### [Photo by Jonatan Pie on Unsplash](https://unsplash.com/photos/Yv9WbjBgZXY)\n![Comparison](/Samples/image/Comparison_3D_Real-life.png)\n\n### [➡Comparison(2D Anime)](https://imgsli.com/MjUyNDAx)\n![Comparison](/Samples/image/Comparison.jpg)\n\n#### Original 2D Anime Image 480x300:\n![Original Imgae](/Samples/image/Original_[480x300].jpg)\n\n#### After 4x Upscale, Denoise and JPG compression 1920x1200: [🔗Comparison](https://imgsli.com/MjUyNDA0)\n![Scaled Imgae](/Samples/image/Waifu2x_4x_[1920x1200].jpg)\n\n#### Original GIF 500 x 372:\n![Original GIF](/Samples/gif/GIF_2_original.gif)\n\n#### After 2x Upscale, Denoise and GIF optimization 1000 x 744:\n![Original GIF](/Samples/gif/GIF_2_waifu2x.gif)\n\n#### `Github doesn't support online video playback, please check link below:`\n\n### **`Video`** : https://github.com/AaronFeng753/Waifu2x-Extension-GUI/tree/master/Samples/video\n\n# ❤ Donate ❤ (推荐使用 支付宝 或者 微信)\n\n<p align=\"left\">\n<a href=\"https://www.patreon.com/aaronfeng\"><img src=\"https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/BecomePatron.jpg?raw=true\" alt=\"Patreon donate button\" height=\"35\"/> </a>\n</p>\n\n# [PayPal](https://www.paypal.me/aaronfeng753)\n\n![donate_new](/donate_new.jpg)\n\n#### 如果捐赠二维码图片无法正常加载,请[打开此链接查看](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI/raw/master/donate_new.jpg)或者合法的连接国际网络后刷新页面, 当然您也可以[按照这个教程来尝试修复github图片加载的问题](https://github.com/AaronFeng753/Github_dns_hosts#github_dns_hosts).\n\n# [📄License](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/LICENSE)\n\n#### Waifu2x-Extension-GUI is free for PERSONAL USE ONLY.\n\n#### If you wish to use Waifu2x-Extension-GUI commercially, please purchase the Premium version from:\n#### https://www.patreon.com/aaronfeng\n\n# Privacy policy🙈🙉🙊\n\nWe respect your privacy, so the following is the privacy policy of this software:\n```\n1. This software won't upload anything to the internet, so we won't collect any data from you, we don't even have a server.\n\n2. This software will only connect to the internet when checking for new updates and update the QRCode on the Donate tab, which\nwill download two .ini files and two .jpg files from GitHub and Gitee. (Gitee is a copycat version of GitHub in The\nPeople's Republic of China, you can disable downloading anything from Gitee by enabling [Ban Gitee] in [Additional settings])\n\nIn conclusion, we won't collect any data from you.\n```\n\n# 💝Credits💝:\n- ❤All donors❤\n- Special thanks to [@CAFUCSteven](https://github.com/CAFUCSteven) for helping me test the software, report multiple bugs and give me multiple suggestions.\n- Special thanks to [@MrZihan](https://github.com/MrZihan) for create the [SRMD-CUDA](https://github.com/MrZihan/Super-resolution-SR-CUDA) engine and help me integrated it in the Waifu2x-Extension-GUI.\n- Anime4K: https://github.com/bloc97/Anime4K\n- Anime4KCPP: https://github.com/TianZerL/Anime4KCPP\n- APNG Assembler: https://sourceforge.net/projects/apngasm/\n- APNG Disassembler: https://sourceforge.net/projects/apngdis/\n- APNG Optimizer: https://sourceforge.net/projects/apng/files/APNG_Optimizer/\n- Beautiful Soup: https://www.crummy.com/software/BeautifulSoup/\n- cain-ncnn-vulkan: https://github.com/nihui/cain-ncnn-vulkan\n- Channel Attention Is All You Need for Video Frame Interpolation: https://github.com/myungsub/CAIN\n- DAIN ncnn Vulkan: https://github.com/nihui/dain-ncnn-vulkan\n- DAIN (Depth-Aware Video Frame Interpolation): https://github.com/baowenbo/DAIN\n- FFmpeg: https://ffmpeg.org/\n- FFmpeg Builds - gyan.dev: https://www.gyan.dev/ffmpeg/builds/\n- FFmpeg Builds - Zeranoe (This website has ceased operations): https://ffmpeg.zeranoe.com/builds/\n- Gifsicle: https://www.lcdf.org/gifsicle/\n- GIMP: https://www.gimp.org/\n- GNU Wget: https://www.gnu.org/software/wget/\n- IFRNet: https://github.com/ltkong218/IFRNet\n- ifrnet-ncnn-vulkan: https://github.com/nihui/ifrnet-ncnn-vulkan\n- ImageMagick: http://www.imagemagick.org/\n- ImDisk Toolkit: https://sourceforge.net/projects/imdisk-toolkit/\n- NCNN: https://github.com/Tencent/ncnn\n- NirCmd: https://www.nirsoft.net/utils/nircmd.html\n- NSIS: https://nsis.sourceforge.io/\n- Nvidia: https://www.nvidia.com/\n- OpenCV: https://opencv.org/\n- Pillow: https://python-pillow.org/\n- PyInstaller: https://github.com/pyinstaller/pyinstaller\n- Python: https://www.python.org/\n- QT: https://www.qt.io/\n- Real-CUGAN: https://github.com/bilibili/ailab\n- realcugan-ncnn-vulkan: https://github.com/nihui/realcugan-ncnn-vulkan\n- Real-ESRGAN: https://github.com/xinntao/Real-ESRGAN\n- RealSR-ncnn-vulkan: https://github.com/nihui/realsr-ncnn-vulkan\n- Real-World Super-Resolution: https://github.com/jixiaozhong/RealSR\n- rife-ncnn-vulkan: https://github.com/nihui/rife-ncnn-vulkan\n- RIFE Video Frame Interpolation: https://github.com/hzwer/arXiv2020-RIFE\n- SoX: http://sox.sourceforge.net/\n- SRMD: https://github.com/cszn/SRMD\n- SRMD-ncnn-Vulkan: https://github.com/nihui/srmd-ncnn-vulkan\n- Super-resolution-SR-CUDA: https://github.com/MrZihan/Super-resolution-SR-CUDA\n- Waifu2x: https://github.com/nagadomi/waifu2x\n- Waifu2x-caffe: https://github.com/lltcggie/waifu2x-caffe\n- Waifu2x-converter: https://github.com/DeadSix27/waifu2x-converter-cpp\n- Waifu2x-Extension: https://github.com/AaronFeng753/Waifu2x-Extension\n- Waifu2x-ncnn-vulkan: https://github.com/nihui/waifu2x-ncnn-vulkan\n- [psd2waifu2x配布・サポートページ | 投稿者: HIMAKIKUROGANE](https://gkalumnium.com/devlog/psd2waifu2x%e9%85%8d%e5%b8%83%e3%83%bb%e3%82%b5%e3%83%9d%e3%83%bc%e3%83%88%e3%83%9a%e3%83%bc%e3%82%b8/)\n- Icons made by : [Freepik](https://www.flaticon.com/authors/freepik) & [Roundicons](https://www.flaticon.com/authors/roundicons) & [Icongeek26](https://www.flaticon.com/authors/Icongeek26) From Flaticon : https://www.flaticon.com/\n- Thanks to [@uimee](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/issues/85) for 繁體中文 translation.\n- Thanks to [@Nova-Aurora](https://github.com/Nova-Aurora) for fixing several errors in the English README.\n- Thanks to [@Michael18751](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/issues/118) for adding a fadeout effect to the notification sound.\n- Thanks to [@CaptainStabs](https://github.com/CaptainStabs) for fixing several English grammar errors.\n"
        },
        {
          "name": "README_CN.md",
          "type": "blob",
          "size": 10.3955078125,
          "content": "<p align=\"center\">\n<img src=\"/.github/README/ICON.png\" height=\"150\">\n</p>\n\n<h2 align=\"center\"> Waifu2x-Extension-GUI </h2>\n\n<h3 align=\"center\"> 使用机器学习放大 图片/视频/GIF 以及 视频插帧(补帧). </h3>\n<h3 align=\"center\"> 支持 AMD / Nvidia / Intel 显卡 </h3>\n\n<p align=\"center\">\n<img src=\"https://img.shields.io/github/v/release/aaronfeng753/waifu2x-extension-gui?label=Latest%20stable%20release&style=flat-square&color=brightgreen\">\n<img src=\"https://img.shields.io/badge/Support-Windows%20x64-blue?logo=Windows&style=flat-square\">\n</p>\n\n### [📜English README](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/README.md) | [🔗GitHub](https://github.com/AaronFeng753/Waifu2x-Extension-GUI) | [🔗Gitee 码云](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI)\n\n如果README内的图片无法正常加载,请[🔗点击本链接查看码云内存储的README](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI/blob/master/README_CN.md). 码云上的内容并非与Github实时同步, 请以[🔗官方Github为准](https://github.com/AaronFeng753/Waifu2x-Extension-GUI).\n\n# [💾下载最新稳定版本 (Windows x64)](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest)\n下载最新版本的绿色版安装包, 适用于拥有`Intel/AMD/Nvidia`显卡的`Windows 64位`系统个人电脑.\n\n下载最新版: https://github.com/AaronFeng753/Waifu2x-Extension-GUI/releases/latest\n\n#### [📝点击查看完整更新日志](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/Change_log_CN.md)\n\n支持的语言: English, 简体中文, 繁體中文.\n\n[🔗点击访问位于Gitee(码云, 开源中国)的安装包下载页面](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI/releases/latest)\n\n# Waifu2x-Extension-GUI是什么?\n\n### 借助深度卷积神经网络对`图片` & `GIF` & `视频`进行`超分辨率`放大(即放大与降噪) 以及 对视频进行 `插帧(即补帧)`.\n\n### ✨主要特性:\n- #### 💡简单无门槛: 解压即用. 内置 快捷预设 功能, 可帮助您一键调整各种设置. \n- #### 📺自动化处理多种媒体: 支持处理 图片 的同时,实现了自动化处理 动态GIF&APNG&WebP 和 视频.\n- #### 😍全图像风格支持: 内置多种算法, 无论是 二次元动漫 还是 您日常拍摄的照片&录像 ,都可以进行清晰化处理.\n- #### 🎞视频插帧(补帧): 在对视频进行超分辨率后,自动对视频进行插帧以改进视频流畅度.\n- #### ⚡视频画面分析: 通过智能分析视频画面,来加快视频处理速度以及改进视频画质.\n- #### ✅强大的兼容性: 内置多个引擎, 几乎与所有现代 Windows PC 兼容.\n- 📊灵活的多线程设定: 在为每个引擎提供完备的设置项的同时,您也可以自由调整线程数量,充分利用PC的一切性能.\n- 🚀🚀🚀多GPU支持: 内置的所有引擎均可支持多显卡,充分利用您的PC的所有性能.\n- 🛠众多自定义设置: 您可以通过调整软件内的众多自定义设置实现自动化的工作流.\n- 🤖智能设定: 本软件可根据您的PC硬件信息和您要处理文件的信息自动调整部分软件设定.\n- 😉易于使用的图形用户界面.\n- 📨持续的维护与更新.\n\n<p align=\"left\">\n<img src=\"/.github/README/Powered_by_nvidia.jpg\" height=\"70\">\n</p>\n\n```\n内置超分辨率算法:\nWaifu2x / SRMD / RealSR / Real-ESRGAN/ Real-CUGAN / Anime4K\nACNet / RTX Super Resolution (RTX VSR / RTX Video Super Resolution)\n\n内置超分辨率引擎:\nWaifu2x-caffe / Waifu2x-converter / Waifu2x-ncnn-vulkan\nSRMD-ncnn-vulkan / RealSR-ncnn-vulkan / Anime4KCPP / SRMD-CUDA\nRealESRGAN-NCNN-Vulkan / Real-CUGAN-ncnn-vulkan / RTX Super Resolution\n\n内置插帧算法:\nRIFE / CAIN / DAIN / IFRNet\n\n内置插帧引擎:\nrife-ncnn-vulkan / cain-ncnn-vulkan / dain-ncnn-vulkan\nIFRNet-ncnn-vulkan\n```\n\n#### ✅已经在 `AMD` RX 550, `NVIDIA` GeForce RTX 3060/4060 和 `Intel` UHD 620 上通过测试.\n\n![mainwindow](/Screenshot/mainwindow_cn.jpg)\n\n![Engine_Settings](/Screenshot/Engine_Settings_CN.jpg)\n\n![VideoSettings_CN](/Screenshot/VideoSettings_CN.jpg)\n\n![Additional_Settings](/Screenshot/Additional_Settings_CN.jpg)\n\n# [示例👀](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/tree/master/Samples/)\n\n### [➡对比(3D写实)](https://imgsli.com/NjQ4NzY)\n#### [原照片来自Unsplash,由Jonatan Pie拍摄.](https://unsplash.com/photos/Yv9WbjBgZXY)\n![Comparison](/Samples/image/Comparison_3D_Real-life.png)\n\n### [➡对比(2D动漫)](https://imgsli.com/MjUyNDAx)\n![Comparison](/Samples/image/Comparison.jpg)\n\n#### 原图 2D动漫图片 480x300:\n![Original Imgae](/Samples/image/Original_[480x300].jpg)\n\n#### 经过4x放大&降噪,以及JPG压缩后 1920x1200: [🔗对比](https://imgsli.com/MjUyNDA0)\n![Scaled Imgae](/Samples/image/Waifu2x_4x_[1920x1200].jpg)\n\n#### 原图 GIF 500 x 372:\n![Original GIF](/Samples/gif/GIF_2_original.gif)\n\n#### 经过2x放大&降噪,以及gif优化后 1000 x 744:\n![Original GIF](/Samples/gif/GIF_2_waifu2x.gif)\n\n### `github不支持在线播放视频, 请点击下方链接查看视频示例:`\n\n### **`视频`** : https://github.com/AaronFeng753/Waifu2x-Extension-GUI/tree/master/Samples/video\n\n# ❤ 捐赠 ❤ (推荐使用 支付宝 或者 微信)\n\n<p align=\"left\">\n<a href=\"https://www.patreon.com/aaronfeng\"><img src=\"https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/.github/BecomePatron.jpg?raw=true\" alt=\"Patreon donate button\" height=\"35\"/> </a>\n</p>\n\n# [PayPal](https://www.paypal.me/aaronfeng753)\n\n# [爱发电(众筹)](https://afdian.net/@AaronFeng)\n\n![donate_new](/donate_new.jpg)\n\n#### 如果捐赠二维码图片无法正常加载,请[打开此链接查看](https://gitee.com/aaronfeng0711/Waifu2x-Extension-GUI/raw/master/donate_new.jpg).\n\n# [📄许可协议](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/blob/master/LICENSE)\n\n#### Waifu2x-Extension-GUI仅许可个人免费使用.\n\n#### 如果您想获得Waifu2x-Extension-GUI的商业使用许可, 请在Patreon获取Premium版本:\n#### https://www.patreon.com/aaronfeng\n\n# 隐私政策🙈🙉🙊\n\n我们尊重您的隐私,所以本软件的隐私政策如下:\n```\n1. 本软件不会向互联网上传任何数据, 所以我们不会收集您的任何信息, 我们甚至没有服务器.\n\n2. 本软件仅在检查更新与更新捐赠页的二维码时会连接互联网, 此时将从Github和码云下载两个.ini文件和两个.jpg文件.\n(码云是一个类似Github的网站, 由中华人民共和国政府监管, 您可以在附加设置内启用[禁止连接码云]以禁止本软件从码云下载数据.)\n\n总之, 我们不会收集您的任何信息.\n```\n\n# 💝鸣谢💝:\n- ❤捐赠者们❤\n- 感谢 [@CAFUCSteven](https://github.com/CAFUCSteven) 长期以来帮助我测试软件，并反馈了许多Bug与建议.\n- 感谢 [@MrZihan](https://github.com/MrZihan) 编写 [SRMD-CUDA](https://github.com/MrZihan/Super-resolution-SR-CUDA) 引擎并帮助我将其集成到Waifu2x-Extension-GUI中.\n- Anime4K: https://github.com/bloc97/Anime4K\n- Anime4KCPP: https://github.com/TianZerL/Anime4KCPP\n- APNG Assembler: https://sourceforge.net/projects/apngasm/\n- APNG Disassembler: https://sourceforge.net/projects/apngdis/\n- APNG Optimizer: https://sourceforge.net/projects/apng/files/APNG_Optimizer/\n- Beautiful Soup: https://www.crummy.com/software/BeautifulSoup/\n- cain-ncnn-vulkan: https://github.com/nihui/cain-ncnn-vulkan\n- Channel Attention Is All You Need for Video Frame Interpolation: https://github.com/myungsub/CAIN\n- DAIN ncnn Vulkan: https://github.com/nihui/dain-ncnn-vulkan\n- DAIN (Depth-Aware Video Frame Interpolation): https://github.com/baowenbo/DAIN\n- FFmpeg: https://ffmpeg.org/\n- FFmpeg Builds - gyan.dev: https://www.gyan.dev/ffmpeg/builds/\n- FFmpeg Builds - Zeranoe(该网站已停止运营): https://ffmpeg.zeranoe.com/builds/\n- Gifsicle: https://www.lcdf.org/gifsicle/\n- GIMP: https://www.gimp.org/\n- GNU Wget: https://www.gnu.org/software/wget/\n- IFRNet: https://github.com/ltkong218/IFRNet\n- ifrnet-ncnn-vulkan: https://github.com/nihui/ifrnet-ncnn-vulkan\n- ImageMagick: http://www.imagemagick.org/\n- ImDisk Toolkit: https://sourceforge.net/projects/imdisk-toolkit/\n- NCNN: https://github.com/Tencent/ncnn\n- NirCmd: https://www.nirsoft.net/utils/nircmd.html\n- NSIS: https://nsis.sourceforge.io/\n- Nvidia: https://www.nvidia.com/\n- OpenCV: https://opencv.org/\n- Pillow: https://python-pillow.org/\n- PyInstaller: https://github.com/pyinstaller/pyinstaller\n- Python: https://www.python.org/\n- QT: https://www.qt.io/\n- Real-CUGAN: https://github.com/bilibili/ailab\n- realcugan-ncnn-vulkan: https://github.com/nihui/realcugan-ncnn-vulkan\n- Real-ESRGAN: https://github.com/xinntao/Real-ESRGAN\n- RealSR-ncnn-vulkan: https://github.com/nihui/realsr-ncnn-vulkan\n- Real-World Super-Resolution: https://github.com/jixiaozhong/RealSR\n- rife-ncnn-vulkan: https://github.com/nihui/rife-ncnn-vulkan\n- RIFE Video Frame Interpolation: https://github.com/hzwer/arXiv2020-RIFE\n- SoX: http://sox.sourceforge.net/\n- SRMD: https://github.com/cszn/SRMD\n- SRMD-ncnn-Vulkan: https://github.com/nihui/srmd-ncnn-vulkan\n- Super-resolution-SR-CUDA: https://github.com/MrZihan/Super-resolution-SR-CUDA\n- Waifu2x: https://github.com/nagadomi/waifu2x\n- Waifu2x-caffe: https://github.com/lltcggie/waifu2x-caffe\n- Waifu2x-converter: https://github.com/DeadSix27/waifu2x-converter-cpp\n- Waifu2x-Extension: https://github.com/AaronFeng753/Waifu2x-Extension\n- Waifu2x-ncnn-vulkan: https://github.com/nihui/waifu2x-ncnn-vulkan\n- [psd2waifu2x配布・サポートページ | 投稿者: HIMAKIKUROGANE](https://gkalumnium.com/devlog/psd2waifu2x%e9%85%8d%e5%b8%83%e3%83%bb%e3%82%b5%e3%83%9d%e3%83%bc%e3%83%88%e3%83%9a%e3%83%bc%e3%82%b8/)\n- 图标作者: [Freepik](https://www.flaticon.com/authors/freepik) & [Roundicons](https://www.flaticon.com/authors/roundicons) & [Icongeek26](https://www.flaticon.com/authors/Icongeek26) 来自 Flaticon : https://www.flaticon.com/\n- [psd2waifu2x配布・サポートページ | 投稿者: HIMAKIKUROGANE](https://gkalumnium.com/devlog/psd2waifu2x%e9%85%8d%e5%b8%83%e3%83%bb%e3%82%b5%e3%83%9d%e3%83%bc%e3%83%88%e3%83%9a%e3%83%bc%e3%82%b8/)\n- 感謝 [@uimee](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/issues/85) 協助進行繁體中文翻譯.\n- 感谢 [@Nova-Aurora](https://github.com/Nova-Aurora) 协助修复英文版README中的语法和拼写错误.\n- 感谢 [@Michael18751](https://github.com/AaronFeng753/Waifu2x-Extension-GUI/issues/118) 为提示音添加了淡出效果.\n- 感谢 [@CaptainStabs](https://github.com/CaptainStabs) 协助修复多个英语语法错误.\n"
        },
        {
          "name": "SRC_v3.41.01-beta",
          "type": "tree",
          "content": null
        },
        {
          "name": "Samples",
          "type": "tree",
          "content": null
        },
        {
          "name": "Screenshot",
          "type": "tree",
          "content": null
        },
        {
          "name": "donate_new.jpg",
          "type": "blob",
          "size": 807.3681640625,
          "content": null
        }
      ]
    }
  ]
}