{
  "metadata": {
    "timestamp": 1736566134862,
    "page": 140,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "360Controller/360Controller",
      "stars": 6690,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 4.2880859375,
          "content": "#########################\n# .gitignore file for Xcode4 / OS X Source projects\n#\n# Version 2.1\n# For latest version, see: http://stackoverflow.com/questions/49478/git-ignore-file-for-xcode-projects\n#\n# 2013 updates:\n# - fixed the broken \"save personal Schemes\"\n# - added line-by-line explanations for EVERYTHING (some were missing)\n#\n# NB: if you are storing \"built\" products, this WILL NOT WORK,\n# and you should use a different .gitignore (or none at all)\n# This file is for SOURCE projects, where there are many extra\n# files that we want to exclude\n#\n#########################\n\n# Xcode configuration files used for storing developer information\n*.xcconfig\n\n#####\n# OS X temporary files that should never be committed\n#\n# c.f. http://www.westwind.com/reference/os-x/invisibles.html\n\n.DS_Store\n\n# c.f. http://www.westwind.com/reference/os-x/invisibles.html\n\n.Trashes\n\n# c.f. http://www.westwind.com/reference/os-x/invisibles.html\n\n*.swp\n\n# *.lock - this is used and abused by many editors for many different things.\n#    For the main ones I use (e.g. Eclipse), it should be excluded\n#    from source-control, but YMMV\n\n*.lock\n\n#\n# profile - REMOVED temporarily (on double-checking, this seems incorrect; I can't find it in OS X docs?)\n#profile\n\n\n####\n# Xcode temporary files that should never be committed\n#\n# NB: NIB/XIB files still exist even on Storyboard projects, so we want this...\n\n*~.nib\n\n\n####\n# Xcode build files -\n#\n# NB: slash on the end, so we only remove the FOLDER, not any files that were badly named \"DerivedData\"\n\nDerivedData/\n\n# NB: slash on the end, so we only remove the FOLDER, not any files that were badly named \"build\"\n\nbuild/\n\n\n#####\n# Xcode private settings (window sizes, bookmarks, breakpoints, custom executables, smart groups)\n#\n# This is complicated:\n#\n# SOMETIMES you need to put this file in version control.\n# Apple designed it poorly - if you use \"custom executables\", they are\n#  saved in this file.\n# 99% of projects do NOT use those, so they do NOT want to version control this file.\n#  ..but if you're in the 1%, comment out the line \"*.pbxuser\"\n\n# .pbxuser: http://lists.apple.com/archives/xcode-users/2004/Jan/msg00193.html\n\n*.pbxuser\n\n# .mode1v3: http://lists.apple.com/archives/xcode-users/2007/Oct/msg00465.html\n\n*.mode1v3\n\n# .mode2v3: http://lists.apple.com/archives/xcode-users/2007/Oct/msg00465.html\n\n*.mode2v3\n\n# .perspectivev3: http://stackoverflow.com/questions/5223297/xcode-projects-what-is-a-perspectivev3-file\n\n*.perspectivev3\n\n#    NB: also, whitelist the default ones, some projects need to use these\n!default.pbxuser\n!default.mode1v3\n!default.mode2v3\n!default.perspectivev3\n\n####\n# Xcode 5 - checkout data\n*.xccheckout\n\n####\n# Xcode 4 - semi-personal settings\n#\n#\n# OPTION 1: ---------------------------------\n#     throw away ALL personal settings (including custom schemes!\n#     - unless they are \"shared\")\n#\n# NB: this is exclusive with OPTION 2 below\nxcuserdata\n\n# OPTION 2: ---------------------------------\n#     get rid of ALL personal settings, but KEEP SOME OF THEM\n#     - NB: you must manually uncomment the bits you want to keep\n#\n# NB: this *requires* git v1.8.2 or above; you may need to upgrade to latest OS X,\n#    or manually install git over the top of the OS X version\n# NB: this is exclusive with OPTION 1 above\n#\n#xcuserdata/**/*\n\n#     (requires option 2 above): Personal Schemes\n#\n#!xcuserdata/**/xcschemes/*\n\n####\n# XCode 4 workspaces - more detailed\n#\n# Workspaces are important! They are a core feature of Xcode - don't exclude them :)\n#\n# Workspace layout is quite spammy. For reference:\n#\n# /(root)/\n#   /(project-name).xcodeproj/\n#     project.pbxproj\n#     /project.xcworkspace/\n#       contents.xcworkspacedata\n#       /xcuserdata/\n#         /(your name)/xcuserdatad/\n#           UserInterfaceState.xcuserstate\n#     /xcsshareddata/\n#       /xcschemes/\n#         (shared scheme name).xcscheme\n#     /xcuserdata/\n#       /(your name)/xcuserdatad/\n#         (private scheme).xcscheme\n#         xcschememanagement.plist\n#\n#\n\n####\n# Xcode 4 - Deprecated classes\n#\n# Allegedly, if you manually \"deprecate\" your classes, they get moved here.\n#\n# We're using source-control, so this is a \"feature\" that we do not want!\n\n*.moved-aside\n\n####\n# UNKNOWN: recommended by others, but I can't discover what these files are\n#\n# ...none. Everything is now explained.\n\n# Ignore build products\nbuilds/\n*.dmg\n*.dmg.zip\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.388671875,
          "content": "language: objective-c\ncompiler:\n  - clang\nos:\n  - osx\nosx_image:\n  - xcode6.4\nbefore_install:\n  - brew update\n  - brew outdated <package-name> || brew upgrade <package-name>\nsudo: required\nbefore_install:\n  - wget \"http://s.sudre.free.fr/Software/files/Packages.dmg\"\n  - sudo installer -pkg Packages.dmg -target /\n  - rm -f Packages.dmg\nxcode_workspace: 360Driver.xcworkspace\nscript:\n  - ./build.sh"
        },
        {
          "name": "360 Driver.xcodeproj",
          "type": "tree",
          "content": null
        },
        {
          "name": "360Controller",
          "type": "tree",
          "content": null
        },
        {
          "name": "360Daemon",
          "type": "tree",
          "content": null
        },
        {
          "name": "360Driver.xcworkspace",
          "type": "tree",
          "content": null
        },
        {
          "name": "DriverTool",
          "type": "tree",
          "content": null
        },
        {
          "name": "Feedback360",
          "type": "tree",
          "content": null
        },
        {
          "name": "Install360Controller",
          "type": "tree",
          "content": null
        },
        {
          "name": "Licence.txt",
          "type": "blob",
          "size": 17.5888671875,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.\n                       51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Library General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\f\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\f\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\f\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\f\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\f\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA\n\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Library General\nPublic License instead of this License.\n"
        },
        {
          "name": "Pref360Control",
          "type": "tree",
          "content": null
        },
        {
          "name": "Readme.md",
          "type": "blob",
          "size": 22.275390625,
          "content": "# Xbox Controller Driver for macOS\r\n\r\n## Table of Contents\r\n1. [About](#about)\r\n2. [Installation](#installation)\r\n3. [Uninstallation](#uninstallation)\r\n4. [Usage](#usage)\r\n5. [My controller doesn't work!](#my-controller-doesnt-work)\r\n   1. [I'm using a driver from the Tattiebogle website](#im-using-a-driver-from-the-tattiebogle-website)\r\n   2. [My controller doesn't work with a game!](#my-controller-doesnt-work-with-a-game)\r\n   3. [How do I find my Vendor ID and Product ID?](#how-do-i-find-my-vendor-id-and-product-id)\r\n   4. [Original Xbox Controllers](#original-xbox-controllers)\r\n   5. [Wired Xbox 360 Controllers](#wired-xbox-360-controllers)\r\n   6. [Wireless Xbox 360 Controllers](#wireless-xbox-360-controllers)\r\n   7. [Xbox One Controllers connected with USB](#xbox-one-controllers-connected-with-usb)\r\n   8. [Xbox One Controllers connected with Wireless Adapter](#xbox-one-controllers-connected-with-wireless-adapter)\r\n   9. [Xbox One Controllers connected with Bluetooth](#xbox-one-controllers-connected-with-bluetooth)\r\n   10. [Xbox One Adaptive Controller](#xbox-one-adaptive-controller)\r\n6. [Adding Third Party Controllers](#adding-third-party-controllers)\r\n7. [Developer Info](#developer-info)\r\n   1. [Building](#building)\r\n   2. [Building the .pkg](#building-the-pkg)\r\n   3. [Disabling signing requirements](#disabling-signing-requirements)\r\n   4. [Re-Enabling signing requirements](#re-enabling-signing-requirements)\r\n   5. [Debugging the driver](#debugging-the-driver)\r\n   6. [Debugging the preference pane](#debugging-the-preference-pane)\r\n   7. [A note on Unity mappings](#a-note-on-unity-mappings)\r\n8. [Licence](#licence)\r\n\r\n## About\r\n\r\n**As of December 28, 2020, there are not plans to add Big Sur support, including Apple Silicon support. It will most likely not work on Big Sur.**\r\n\r\nThis driver supports the Microsoft Xbox series of controllers including:\r\n\r\n1. Original Xbox\r\n    - Original Xbox controllers are supported by using a USB adapter.\r\n\r\n2. Xbox 360\r\n    - Wired Xbox 360 controllers are supported directly.\r\n    - **As of macOS 10.11, Wireless Xbox 360 controller support causes kernel panics. This issue cannot be resolved with minor changes to the driver, and requires that the driver be re-written from scratch to resolve the issue. Due to an excess of caution, we have disabled Wireless Xbox 360 controller support as of 0.16.6. If you want to use a wireless controller, download 0.16.5 or earlier and disable the driver before the computer enters a \"sleep\" state in order to prevent kernel panics. Alternatively, you can revert to a macOS version before 10.11 to avoid this issue.**\r\n\r\n3. Xbox One\r\n    - Xbox One controllers are supported when connected with a micro USB cable. Using the controller with the Wireless Adapter is not currently supported.\r\n    - Bluetooth capable Xbox One controllers (released after August 2016) are natively supported by macOS without the use of this driver. However, installing this driver will allow you to use the controller via USB.\r\n\r\nThe driver provides developers with access to both force feedback and the LEDs of the controllers. Additionally, a preference pane has been provided so that users can configure their controllers and ensure that the driver has been installed properly.\r\n\r\nController support includes ALL devices that work with an Xbox series piece of hardware. All wheels, fight sticks, and controllers should work. This includes things like the Xbox One Elite controller. If your hardware does not work with an Xbox console we cannot support it. Sorry.\r\n\r\nThis project is a fork of the [Xbox360Controller project](http://tattiebogle.net/index.php/ProjectRoot/Xbox360Controller) originally created by Colin Munro.\r\n\r\n## Installation\r\nSee the [releases page](https://github.com/360Controller/360Controller/releases) for the latest compiled and signed version of the driver. Most users will want to run this installer. If you are using macOS 10.13.4 or later, then you will have to allow the signing certificate of \"Drew Mills\" in order for the software to run. Usually, the installer will prompt you to complete this process:\r\n![System prompt: System Extension Blocked](https://imgur.com/zXM5JlU.png)\r\nYou can either click \"Open Security Preferences\" to quickly fix this. If you didn't see this prompt, you can navigate to the same window using the Apple menu in the top left hand corner of your screen, navigating the \"System Preferences\" and then clicking on \"Security & Privacy.\" This will open up the following page. All you need to do is click the \"Allow\" button near the bottom right.\r\n![Security & Privacy Preference Pane displaying prompt to user: System software from user \"Drew Mills\" was blocked from loading](https://imgur.com/HrL77Ii.png)\r\nThis prompt has been known to have issues with software or hardware that interferes with mouse movement. If you are using software that impacts the movement of your mouse, such as MagicKeys, or are using a special interface device, such as a Wacom tablet, please using a standard input device, such as a mouse, to click this button. This is a security feature of macOS and is out of our control.\r\n\r\n## Uninstallation\r\nIn order to uninstall the driver: navigate to the preference pane by opening your \"System Preferences,\" navigating to the \"Xbox 360 Controllers\" pane, clicking on the \"Advanced\" tab and pressing the \"Uninstall\" button. This will prompt you to enter your password so that the uninstaller can remove all of the bundled software from your machine.\r\n\r\n## Usage\r\nThe driver exposes a standard game pad with a number of standard controls, so any game that supports gaming devices should work. In some cases, this may require an update from the developer of the game. The preference pane uses the standard macOS frameworks for accessing HID devices in addition to access of Force Feedback capabilities. This means that the preference pane is a good indicator that the driver is functional for other programs.\r\n\r\nIt is important to note that this driver does not work, and can never work, with Apple's \"Game Controller Framework.\" This GCController framework corresponds to physical gamepads that have been offically reviewed by Apple and accepted into the mFi program. Due to the fact that we are not Microsoft, we cannot get their gamepad certified to be a GCController. This is an unfortunate oversight on Apple's part. If you would like to discuss this, please do so at [this location.](https://github.com/360Controller/360Controller/issues/55)\r\n\r\nUsers have been maintaining a [partial list of working and non-working games.](https://github.com/360Controller/360Controller/wiki/Games) Please contribute your findings so that you can help others debug their controller issues.\r\n\r\n## My controller doesn't work!\r\n\r\n### I'm using a driver from the Tattiebogle website\r\nThe Tattiebogle driver is NOT the same driver as this Github project. We do NOT support that driver. Under NO circumstances will we support that driver. If you download the latest version of this driver from the [releases page](https://github.com/360Controller/360Controller/releases) we will do our best to help you out. This driver will install over the Tattiebogle driver. You don't have to worry about uninstalling the Tattiebogle driver first.\r\n\r\n### My controller doesn't work with a game!\r\nWe cannot fix game specific issues. This driver does its absolute best to put out a standardized format for games to use. If they don't take advantage of that, there is **ABSOLUTELY NOTHING** we can do. The best we can do for you is give you the \"Pretend to be an Xbox 360 Controller\" option in the \"Advanced\" tab. This will make any wired Xbox 360 or wired Xbox One controller appear to games as if it were an official Microsoft Xbox 360 Controller. That way if the game is only looking for Xbox 360 controllers and isn't looking for other devices like third party Xbox 360 controllers or Xbox One controllers, you should be able to trick the game. If you experience an issue with a game that this toggle does not fix, we cannot help you, sorry. That is just the nature of drivers.\r\n\r\n### How do I find my Vendor ID and Product ID?\r\nNavigate to the Apple menu at the top left corner of your screen. Select the `About This Mac` option. This will open a new window, where you need to select `System Report...` in the `Overview` tab. This will open another new window. On the left hand side of this window, there will be a number of options. Select `USB`. It will be somewhere near the bottom of the `Hardware` section. This will show you the USB device tree. Find and click on the entry that corresponds to your controller. This will provide you with the information needed at the bottom of the window. If you cannot find your device, make sure that all devices are properly connected to the computer. Try different cables if the controller still is not found.\r\n\r\n### Original Xbox Controllers\r\nMake an issue describing your problem.\r\n\r\n### Wired Xbox 360 Controllers\r\nAlways check your controller with the preference pane found at: `Apple Menu -> System Preferences -> Xbox 360 Controllers` before creating an issue. If the controller works in this menu, then the driver is operating as intended. If your controller works with this menu, but not with a specific game, then read the [My controller doesn't work with a game!](#my-controller-doesnt-work-with-a-game) section.\r\nIf you have a third party controller, make an issue following the template with the \"Product ID\" and \"Vendor ID\" of the controller. Follow [How do I find my Vendor ID and Product ID?](#how-do-i-find-my-vendor-id-and-product-id) for instructions on how to find this information.\r\n\r\n### Wireless Xbox 360 Controllers\r\n**As of macOS 10.11, Wireless Xbox 360 controller support causes kernel panics. This issue cannot be resolved with minor changes to the driver, and requires that the driver be re-written from scratch to resolve the issue. Due to an excess of caution, we have disabled Wireless Xbox 360 controller support as of 0.16.6. If you want to use a wireless controller, download 0.16.5 or earlier and disable the driver before the computer enters a \"sleep\" state in order to prevent kernel panics. Alternatively, you can revert to a macOS version before 10.11 to avoid this issue.**\r\n\r\n### Xbox One Controllers connected with USB\r\nAlways check your controller with the preference pane found at: `Apple Menu -> System Preferences -> Xbox 360 Controllers` before creating an issue. If the controller works in this menu, then the driver is operating as intended. If your controller works with this menu, but not with a specific game, then read the [My controller doesn't work with a game!](#my-controller-doesnt-work-with-a-game) section.\r\nIf your controller is recognized by the preference pane, but you aren't getting any response from button presses, this is likely due to an issue with macOS 10.11 and later. Apple changed some of the underlying USB code with this release and broke compatibility with some controllers. This is specifically found in controllers from PDP and PowerA. If you revert to macOS 10.10 or earlier, these controllers will work.\r\nIf the preference pane can't find your controller, make sure that it is listed in `Apple Menu -> About this Mac -> System Report -> Overview -> Hardware -> USB`. This menu should list a device called \"Controller.\" If it isn't listed there, then you likely have a \"charge\" Micro USB cable instead of a \"data\" cable. If the cable isn't sending data, then you can't use the driver. Try a different cable.\r\nIf you have a third party controller, make an issue following the template with the \"Product ID\" and \"Vendor ID\" of the controller. Follow [How do I find my Vendor ID and Product ID?](#how-do-i-find-my-vendor-id-and-product-id) for instructions on how to find this information.\r\n**At this time, PDP and PowerA controllers are unsupported by this driver as of macOS 10.11+ thanks to a rewrite of the macOS USB kernel. We cannot resolve this issue. It is a bug in Apple's core OS code.**\r\n\r\n### Xbox One Controllers connected with Wireless Adapter\r\nXbox One controllers connected with the Wireless Adapter are currently not supported. Please be patient as we figure out this complicated protocol.\r\n\r\n### Xbox One Controllers connected with Bluetooth\r\nThe Xbox One controller works with macOS automatically when connected over Bluetooth via System Preferences. Only specific Xbox One controllers released after August 2016 have Bluetooth capability. See [Microsoft's support page](https://support.xbox.com/en-US/xbox-on-windows/accessories/connect-and-troubleshoot-xbox-one-bluetooth-issues-windows-10) for determining if your controller supports Bluetooth. Due to the fact that this controller works by default, it will not be supported by this driver. If you choose to plug this controller in via USB, you will need this driver. If you do not wish to connect the controller via USB, then you do not need this driver. Any problems with game compatibility in Bluetooth mode are completely out of our control and are up to you to solve in conjunction with the game developer.\r\n\r\n### Xbox One Adaptive Controller\r\nThe Xbox One adaptive controller can connect to your macOS machine through either a Bluetooth or wired connection. In Bluetooth mode, it is not controlled by the driver in any way, and will not show up in the \"Xbox 360 Controllers\" preference pane. If you are having issues with a wired connection, where the preference pane is recognizing your controller, but isn't recieving inputs, please connect it to a PC or VM running Windows in order to recieve a crucial firmware update. This update may also be possible through an Xbox One console.\r\n\r\n## Adding Third Party Controllers\r\nFirst, [disable signing requirements](#disabling-signing-requirements) so that you can run your custom build with your third party controller added. Then edit `360Controller/360Controller/Info.plist`. Add your controller following the pattern of pre-existing controllers by adding your vendor and product IDs to a new entry. After this, follow the information in the [building](#building) section, following the \"If you don't have a signing certificate\" path to build your new .kext. Then, place your shiny new `360Controller.kext` in to `/Library/Extensions` over the old one. You may need to take ownership of the driver in order for it to operate properly. You can do this with `sudo chown -R root:wheel /Library/Extensions/360Controller.kext`. Then, to make sure everything went according to plan, run `sudo kextutil /Library/Extensions/360Controller.kext`. This will load your kext into the OS and you should be able to use your controller. Once you reboot, your custom driver should be loaded automatically.\r\n\r\n## Developer Info\r\nDrivers inherently modify the core operating system kernel. Using the driver as a developer can lead to dangerous kernel panics that can cause data loss or other permanent damage to your computer. Be very careful about how you use this information. We are not responsible for anything this driver does to your computer, or any loss it may incur. Normal users will never have to worry about the developer section of this README.\r\n\r\n### Building\r\n\r\n##### Apple has recently changed how drivers work in Xcode 7. In order to build the driver, you will need Xcode 6.4 or earlier.\r\nAdditionally, to use the included build scripts, you will need to change your preferred Xcode installation using `xcode-select`.\r\n\r\n##### You must have a signing certificate to install a locally built driver. Alternatively, you can disable driver signing on your machine, however this is a major security hole and the decision should not be taken lightly.\r\n\r\nYou will need a full installation of Xcode to build this project. The command line tools are not enough.\r\n\r\nThe project consists of three main parts: The driver (implemented in C++, as an I/O Kit C++ class), the force feedback plugin (implemented in C, as an I/O Kit COM plugin) and the preference pane (implemented in Objective C as a preference pane plugin). To build, use the standard Xcode build for Deployment on each of the 3 projects. Build Feedback360 before 360Controller, as the 360Controller project includes a script to copy the Feedback360 bundle to the correct place in the .kext to make it work.\r\n\r\nTo debug the driver, `sudo cp -R 360Controller.kext /tmp/` to assign the correct properties - note that the Force Feedback plugin only seems to be found by OSX if the driver is in /System/Library/Extensions so it can only be debugged in place. Due to the fact that drivers are now stored in /Library/Extenions, this means that you must create a symlink between the location of the driver and /System/Library/Extensions so that the force feedback plugin can operate properly.\r\n\r\n### Building the .pkg\r\n\r\nIn order to build the .pkg, you will need to install [Packages.app](http://s.sudre.free.fr/Software/Packages/about.html).\r\n\r\n#### If you don't have a signing certificate\r\n\r\n* Open `360 Driver.xcodeproj` using Xcode.\r\n* Select the `360 Driver` project in the Navigator.\r\n* Select the `360Daemon` target from the top right corner.\r\n* Select the `Build Settings` tab from the top of the screen.\r\n* In the `Code Signing` section, find `Code Signing Identity` section and expand it.\r\n* In the `Release` section, change the selection to `Don't Code Sign`.\r\n* Set the code signing identity for `360Daemon`, `Feedback360`, `360Controller`, `DriverTool`, `Pref360Control`, `Wireless360Controller`, `WirelessGamingReceiver` and `Whole Driver`.\r\n* Run `./build.sh` to build the .pkg. This .pkg can be found in the `Install360Controller` directory.\r\n\r\n#### If you have a signing certificate\r\n\r\n* Create a file named `DeveloperSettings.xcconfig`\r\n* Select the `360 Driver` project in the Navigator.\r\n* In this file, add the following lines:\r\n   * `DEVELOPMENT_TEAM = XXXXXXXXXX` where `XXXXXXXXXX` is the development team on your Developer ID Application and Installer certificates.\r\n   * `DEVELOPER_NAME = First Last` where `First Last` is the name on the Developer ID Installer certificate.\r\n   * `DEVELOPER_EMAIL = my.address@email.com` where `my.address@email.com` is the email address of your Apple account that has your Developer ID Application and Installer certificates.\r\n   * `NOTARIZATION_PASSWORD = abcd-efgh-ijkl-mnop` where `abcd-efgh-ijkl-mnop` is a temporary password that you have generated for your Apple account for the purposes of notarization.\r\n\r\n### Disabling signing requirements\r\n\r\nSince Yosemite (macOS 10.10) all global kexts are required to be signed. This means if you want to build the drivers and install locally, you need a very specific signing certificate that Apple closely controls. If you want to disable the signing requirement from macOS, you will need to do several things.\r\n\r\nFirst, execute these commands in your terminal:\r\n```\r\nsudo nvram boot-args=\"kext-dev-mode=1\"\r\nsudo kextcache -m /System/Library/Caches/com.apple.kext.caches/Startup/Extensions.mkext /System/Library/Extensions\r\n```\r\n\r\nNext, you must disable System Integrity Protection. To do this, boot into recovery mode by holding down `CMD + R` while the computer is starting. Once recovery mode has been loaded, open the terminal from the `Utilites` menu item. Execute the following command:\r\n```\r\ncsrutil disable\r\n```\r\n\r\n### Re-Enabling signing requirements\r\n\r\nFrom recovery mode, execute the following command:\r\n```\r\ncsrutil enable\r\n```\r\n\r\nReboot into macOS like normal. You can reset the boot arguments by executing this command:\r\n```\r\nsudo nvram -d boot-args\r\n```\r\nThis will remove ALL boot-args. If you have previously manipulated your boot-args, those changes will be erased as well!\r\n\r\n### Notarization of the driver\r\n\r\nThis is only possible if you have a signing certificate, but it is a relatively straightforward process.\r\n\r\n* Build the driver as previously instructed and make sure to include the necessary information in your `DeveloperSettings.xcconfig` file, as they will be used during this process.\r\n* Make sure to `cd` into the `Install360Controller` directory and run `./makedmg.sh`\r\n* Run `./notarize.sh`\r\n* This should finish with the message: `The validate action worked!`\r\n\r\nThen you can distribute the notarized and stapled version of the driver.\r\n\r\n### Debugging the driver\r\n\r\nDebugging the driver depends on which part you intend to debug. For the 360Controller driver itself, it uses `IOLog` to output to the `system.log` which can be accessed using Console.app. Feedback360 uses `fprintf(stderr, ...)`, which should appear within the console of the program attempting to use force feedback.\r\n\r\n### Debugging the preference pane\r\n\r\nMost of these instructions are pulled directly from [this blog post.](http://www.condition-alpha.com/blog/?p=1314) Please visit it for futher information.\r\n\r\nFirst, create a copy of `System Preferences.app` called `System Preferences (signed).app`. Then sign this new System Preferences with the command:\r\n\r\n```codesign -s \"Developer ID Application: First Last (XXXXXXXXXX)\" -f /Applications/System\\ Preferences\\ \\(signed\\).app/```\r\n\r\nwhere `Developer ID Application: First Last (XXXXXXXXXX)` is the name of your Developer ID Application signing certificate.\r\n\r\nEdit your build scheme for Pref360Control, and select the \"Run\" scheme, and make sure you are editing \"Debug\" (A). In the environment variables section, click on \"+\" to add a new environment variable (B). Name the new variable OBJC_DISABLE_GC, and set its value to YES.\r\n\r\nNext, click the little disclosure triangle for the run scheme to reveal its detailed settings. Then select pre-actions. Click the \"+\" at the bottom to add a run script action. Enter /bin/sh as the shell, make sure that your target is selected to provide build settings, and type a shell command line to install the newly compiled pref pane in your personal Library folder:\r\n\r\n```cp -Rf ${CONFIGURATION_BUILD_DIR}/Pref360Control.prefPane ~/Library/PreferencePanes```\r\n\r\nFinally, select the run step, choose \"other\" from the executable drop-down menu, and select `System Preferences (signed)` in the Applications folder. Verify that \"Debug executable\" and \"Automatically\" are both checked.\r\n\r\n### A note on Unity mappings\r\n\r\nThe issues with the button and axis mappings in the Unity game engine are outside of our control. Unity mangles the button and axis values provided by the controller and remaps them to different values. There is absolutely no way that we can introduce a shim to fix it. Complaints about this should be directed at Unity, not at us.\r\n\r\n## Licence\r\n\r\nCopyright (C) 2006-2013 Colin Munro\r\n\r\nThis driver is licensed under the GNU Public License. A copy of this license is included in the distribution file, please inspect it before using the binary or source.\r\n"
        },
        {
          "name": "Wireless360Controller",
          "type": "tree",
          "content": null
        },
        {
          "name": "WirelessGamingReceiver",
          "type": "tree",
          "content": null
        },
        {
          "name": "XBOBTFF",
          "type": "tree",
          "content": null
        },
        {
          "name": "XboxOneBluetooth",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.sh",
          "type": "blob",
          "size": 2.0302734375,
          "content": "#!/bin/bash\n\nDEV_NAME=`echo | grep DEVELOPER_NAME DeveloperSettings.xcconfig`\nDEV_TEAM=`echo | grep DEVELOPMENT_TEAM DeveloperSettings.xcconfig`\nCERT_ID=\"${DEV_NAME//\\DEVELOPER_NAME = } (${DEV_TEAM//\\DEVELOPMENT_TEAM = })\"\n\nmkdir -p build\nzip -r build/360ControllerSource.zip * -x \"build*\"\n\nxcrun xcodebuild -configuration Release -target \"Whole Driver\" -xcconfig \"DeveloperSettings.xcconfig\" OTHER_CODE_SIGN_FLAGS=\"--timestamp --options=runtime\"\nif [ $? -ne 0 ]\n  then\n    echo \"******** BUILD FAILED ********\"\n    exit 1\nfi\n\ncd Install360Controller\npackagesbuild -v Install360Controller.pkgproj --identity \"Developer ID Installer: \"\"${CERT_ID}\"\nmv build 360ControllerInstall\nhdiutil create -srcfolder 360ControllerInstall -fs HFS+ -format UDZO ../build/360ControllerInstall.dmg\nmv 360ControllerInstall build\ncd ..\necho \"** File contents **\"\nxcrun lipo -info build/Release/360Controller.kext/Contents/MacOS/360Controller\nxcrun lipo -info build/Release/360Controller.kext/Contents/PlugIns/Feedback360.plugin/Contents/MacOS/Feedback360\nxcrun lipo -info build/Release/360Daemon.app/Contents/MacOS/360Daemon\nxcrun lipo -info build/Release/Pref360Control.prefPane/Contents/MacOS/Pref360Control\nxcrun lipo -info build/Release/Pref360Control.prefPane/Contents/Resources/DriverTool\n# xcrun lipo -info build/Release/WirelessGamingReceiver.kext/Contents/MacOS/WirelessGamingReceiver\n# xcrun lipo -info build/Release/Wireless360Controller.kext/Contents/MacOS/Wireless360Controller\necho \"** File signatures **\"\nxcrun spctl -a -v build/Release/360Controller.kext\nxcrun spctl -a -v build/Release/360Controller.kext/Contents/PlugIns/Feedback360.plugin\nxcrun spctl -a -v build/Release/360Daemon.app/Contents/MacOS/360Daemon\nxcrun spctl -a -v build/Release/Pref360Control.prefPane\nxcrun spctl -a -v build/Release/Pref360Control.prefPane/Contents/Resources/DriverTool\n# xcrun spctl -a -v build/Release/WirelessGamingReceiver.kext\n# xcrun spctl -a -v build/Release/Wireless360Controller.kext\nxcrun spctl -a -v --type install Install360Controller/build/Install360Controller.pkg\necho \"*** DONE ***\"\n"
        },
        {
          "name": "clean.sh",
          "type": "blob",
          "size": 0.1123046875,
          "content": "#!/bin/bash\nfor i in Install360Controller; do\n    rm -rf $i/build\ndone\nrm -rf build\necho \"Deleted build products.\"\n"
        },
        {
          "name": "issue_template.md",
          "type": "blob",
          "size": 1.3671875,
          "content": "### Type of Controller\nReplace this text with: Original Xbox, Xbox 360, Xbox One, All or N/A\n\n### OS Version\nReplace this text with the version of macOS that you are running\n\n### Driver Version\nReplate this text with the version or versions of the driver that you are using or have tested\n\n### Connection Method\nReplace this text with: Wired, Wireless Adapter, Bluetooth, N/A or more specific method if applicable\n\n### Device Name and Info\n(If you don't know this information, please refer to the README for how to find it. Enter N/A if not applicable)\n>Device Name:\n<br/>Product ID:\n<br/>Vendor ID:\n\n### Response of Controller\nReplace this text with information on how the physical controller reacts. Does the guide button light up? Does it vibrate? Etc.\n\n### Response in Preference Pane\nReplace this text with information about the controller's reaction in the preference pane. Does the controller appear in the preference pane? Do all of the buttons, joysticks, and triggers act as expected?\n\n### Detailed Explaination of Issue\nReplace this text with a detailed explaination of your issue. Simply saying \"it doesn't work\" is a quick way to ensure that your issue is never fixed. Without detailed information on your specific issue, we cannot fix your issue. Including as much information as possible in this section increases the likelyhood of getting your issue quickly and effectively resolved.\n"
        }
      ]
    }
  ]
}