{
  "metadata": {
    "timestamp": 1736566171697,
    "page": 182,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Sigil-Ebook/Sigil",
      "stars": 6048,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0966796875,
          "content": ".git export-ignore\n.gitattributes export-ignore\n.gitignore export-ignore\nversion.xml export-ignore\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.8984375,
          "content": "# Backup files left behind by the Emacs editor.\r\n*~\r\n\r\n# Lock files used by the Emacs editor.\r\n.\\#*\r\n\r\n# emacs auto recovery files from aborted edits\r\n\\#*\\#\r\n\r\n#use ful for stashing files\r\n*.orig\r\n*.keep\r\n\r\n# Temporary files used by the vim editor.\r\n.*.swp\r\n.swp\r\n\r\n# A hidden file created by the Mac OS X Finder.\r\n.DS_Store\r\n\r\n# Image thumbnail database created by windows\r\nThumbs.db\r\n\r\n# Various files created by Visual Studio\r\n*.sln\r\n*.suo\r\n*.vcproj\r\n*.user*\r\n#*.rc\r\n*.ncb\r\n*.pch\r\n*.dep\r\n*.idb\r\n*.exp\r\n*.res\r\n*.manifest\r\n*.ilk\r\n*.pdb\r\n*.def\r\nRelease\r\nDebug\r\nBuildLog.htm\r\n\r\n# Various files and folders created by CMake\r\nCMakeFiles\r\nCMakeScripts\r\nCMakeCache.txt\r\n*.dir\r\nALL_BUILD*\r\n\r\n# Various Qt files\r\nui_*\r\nmoc_*\r\nqrc_*\r\n\r\n# Misc files\r\n*.svn\r\n*.a\r\n*.o\r\n*.obj\r\n*.lib\r\n*.exe\r\n*.dll\r\n*.a\r\n*.app\r\n*.xcodeproj\r\n*.pbxbtree\r\n*.pbxindex\r\n*.build\r\n*.smp\r\n*.pl\r\n*.pyc\r\n*.pyo\r\n*.orig\r\n*.bak\r\n*.rar\r\nOpenCandy\r\ntags\r\nbuild\r\n\r\n"
        },
        {
          "name": "3rdparty",
          "type": "tree",
          "content": null
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 7.2109375,
          "content": "########################################################\n#  \n#  This is a CMake configuration file.\n#  To use it you need CMake which can be \n#  downloaded from here: \n#    http://www.cmake.org/cmake/resources/software.html\n#\n#########################################################\n\n# Hard minimum version of cmake for all sub projects and Sigil\ncmake_minimum_required( VERSION 3.18 ) \n\nproject( Sigil )\n\n# Change this URL if the location of the CI Windows Qt6 download ever changes\nset (WINQTURL \"https://github.com/dougmassay/win-qtwebkit-5.212/releases/download/v5.212-1\")\n\n# Used to keep downloaded Qt and PySide6 versions in sync.\n# Check https://github.com/dougmassay/win-qtwebkit-5.212/releases/ to\n# see what versions are available. Defaults to 6.7.3.\nif(NOT DEFINED QTVER)\n    set(QTVER 6.7.3)\nendif()\n\n# Default to using newe findPython3 on Windows and Linux\nif ( NOT DEFINED TRY_NEWER_FINDPYTHON3 )\n    if ( NOT APPLE )\n        set ( TRY_NEWER_FINDPYTHON3 1 )\n    else()\n        set ( TRY_NEWER_FINDPYTHON3 0 )\n    endif()\nendif()\n\n# Set to 1 to create and use a virtual Python venv on Windows and Linux.\n# Use in conjunction with QTVER to download/install correct PySide6 module\nif ( NOT DEFINED USE_VIRT_PY )\n    set ( USE_VERT_PY 0 )\nendif()\n\n# Set to 1 to download and use a custom-built Qt from WINQTURL.\n# Use in conjunction with QTVER to clarify which version of Qt to download.\nif ( NOT DEFINED DOWNLOAD_QT )\n    set ( DOWNLOAD_QT 0 )\nendif()\n\n# Set Inno minimum Windows version \nif ( NOT DEFINED BUILD_FOR_WIN7 )\n    # Windows 10 (1809)\n    set( BUILD_FOR_WIN7 0 )\n    set ( WIN_MIN_VERSION 10.0.17763 )\nelse()\n    # Windows 7sp1\n    set ( WIN_MIN_VERSION 6.1.7601 )\nendif()\n\nif (TRY_NEWER_FINDPYTHON3)\n    set ( USE_NEWER_FINDPYTHON3 1 )\nelse()\n    set ( USE_NEWER_FINDPYTHON3 0 )\nendif()\n\nset( CMAKE_DEBUG_POSTFIX \"d\" )\n# Avoid the whole Release/Debug folder creation with Visual Studio\nif (MSVC_IDE)\n   set( CMAKE_RUNTIME_OUTPUT_DIRECTORY_DEBUG \"${PROJECT_BINARY_DIR}/bin\")\n   set( CMAKE_RUNTIME_OUTPUT_DIRECTORY_RELEASE \"${PROJECT_BINARY_DIR}/bin\")\n   set( CMAKE_RUNTIME_OUTPUT_DIRECTORY_RELWITHDEBINFO \"${PROJECT_BINARY_DIR}/bin\")\n   set( CMAKE_LIBRARY_OUTPUT_DIRECTORY_DEBUG \"${PROJECT_BINARY_DIR}/lib\")\n   set( CMAKE_LIBRARY_OUTPUT_DIRECTORY_RELEASE \"${PROJECT_BINARY_DIR}/lib\")\n   set( CMAKE_LIBRARY_OUTPUT_DIRECTORY_RELWITHDEBINFO \"${PROJECT_BINARY_DIR}/lib\")\n   set( CMAKE_ARCHIVE_OUTPUT_DIRECTORY_DEBUG \"${PROJECT_BINARY_DIR}/lib\")\n   set( CMAKE_ARCHIVE_OUTPUT_DIRECTORY_RELEASE \"${PROJECT_BINARY_DIR}/lib\")\n   set( CMAKE_ARCHIVE_OUTPUT_DIRECTORY_RELWITHDEBINFO \"${PROJECT_BINARY_DIR}/lib\")\nendif()\nset( CMAKE_RUNTIME_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/bin )\nset( CMAKE_LIBRARY_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/lib )\nset( CMAKE_ARCHIVE_OUTPUT_DIRECTORY ${PROJECT_BINARY_DIR}/lib )\nset( PACKAGE_DIRECTORY ${PROJECT_BINARY_DIR}/package )\nset( CMAKE_MODULE_PATH ${CMAKE_MODULE_PATH} \"${CMAKE_CURRENT_SOURCE_DIR}/cmake_extras\" )\n\nset( SIGIL_MAJOR_VERSION 2 )\nset( SIGIL_MINOR_VERSION 4 )\nset( SIGIL_REVISION_VERSION 0 )\nset( SIGIL_FULL_VERSION ${SIGIL_MAJOR_VERSION}.${SIGIL_MINOR_VERSION}.${SIGIL_REVISION_VERSION} )\n\nif( UNIX AND NOT APPLE )\n   include(GNUInstallDirs)\n\n   # Make sure the correct rpath is set for the sigil executable\n   # on Linux -- for both the build and the installed versions.\n   # Needed to make sure the installed shared hunspell and gumbo\n   # libraries are found/used at runtime.\n\n   # use, i.e. don't skip the full RPATH for the build tree\n   SET(CMAKE_SKIP_BUILD_RPATH  FALSE)\n\n   # when building, don't use the install RPATH already\n   # (but later on when installing)\n   SET(CMAKE_BUILD_WITH_INSTALL_RPATH FALSE)\n\n   SET(CMAKE_INSTALL_RPATH \"${CMAKE_INSTALL_FULL_LIBDIR}/sigil\")\n\n   # add the automatically determined parts of the RPATH\n   # which point to directories outside the build tree to the install RPATH.\n   # This will ensure the Qt5 lib directory is always included after install.\n   SET(CMAKE_INSTALL_RPATH_USE_LINK_PATH TRUE)\n\n   # Because GCC's link time optimization is willfully choosing to suck.\n   add_compile_options(-fno-lto)\nendif()\n\n# Check if platform is 64 bit\nif( NOT APPLE )\n   if( CMAKE_SIZEOF_VOID_P EQUAL 4 )\n     set( 64_BIT_PLATFORM 0 )\n   else()\n     set( 64_BIT_PLATFORM 1 )\n   endif()\nendif()\n\n# Profiler configuration for GCC\nif( CMAKE_COMPILER_IS_GNUCXX  )\n    set( CMAKE_BUILD_TYPE profiling )\n    set( CMAKE_CXX_FLAGS_PROFILING \"-O2 -DNDEBUG -pg -g -fno-omit-frame-pointer -fno-inline-functions -fno-inline-functions-called-once -fno-optimize-sibling-calls\" )\n\n    # After creating the new build type,\n    # we clear the default back to empty\n    set( CMAKE_BUILD_TYPE  )\nendif()\n\nif (USE_SYSTEM_LIBS)\n    MESSAGE(STATUS \"Trying to use System Libraries...\")\n    find_package( ZLIB )\n    find_package( PkgConfig )\n    find_package( MiniZip )\n    pkg_check_modules( HUNSPELL hunspell )\n    if ( NOT APPLE )\n        pkg_check_modules( PCRE2 libpcre2-16 )\n    endif()\nendif()\n\nmessage(STATUS \"CMake version in use: ${CMAKE_VERSION}\")\n\nif (${USE_NEWER_FINDPYTHON3})\n    message(STATUS \"Using newer findpython3 cmake module\")\n    if ( APPLE )\n        find_package(Python3 3.9 COMPONENTS Interpreter Development)\n    endif()\n    if ( WIN32 )\n        if ( DOWNLOAD_QT )\n            include(windownloadqt.cmake)\n            set(CMAKE_PREFIX_PATH \"${CMAKE_CURRENT_BINARY_DIR}/Qt${QTVER}/lib/cmake\")\n            set(Qt6_Dir \"${CMAKE_CURRENT_BINARY_DIR}/Qt${QTVER}/lib/cmake/Qt6\")\n            if(NOT EXISTS \"${Qt6_Dir}\")\n                message(FATAL_ERROR \"Qt6 download/configure unsuccessful!\")\n            endif()\n        endif()\n        if ( USE_VIRT_PY )\n            include(winvirtpy.cmake)\n            # Set hints so virtual Python environement is found first\n            set(Python3_FIND_VIRTUAL ONLY)\n            set(Python3_FIND_REGISTRY NEVER)\n            set(Python3_FIND_STRATEGY LOCATION)\n            # Trick cmake's findPython3 module into thinking the virtual python is activated\n            set(VIRT_PATH \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy\")\n            set(ENV{VIRTUAL_ENV} \"${VIRT_PATH}\")\n            if(NOT EXISTS \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy/Scripts/python.exe\")\n                message(FATAL_ERROR \"Virtual Python setup unsuccessful!\")\n            endif()\n        endif()\n        find_package(Python3 3.9 REQUIRED COMPONENTS Interpreter Development)\n    endif()\n    if( UNIX AND NOT APPLE )\n        if ( USE_VIRT_PY )\n            # Must be run in an environment with the venv activated\n            set ( Python3_FIND_VIRTUAL ONLY )\n            add_definitions( -DLINUX_VIRT_PY )\n        endif()\n        find_package(Python3 3.9 COMPONENTS Interpreter Development)\n    endif()\nelse()\n    message(STATUS \"Using older findpython cmake module\")\n    if ( APPLE )\n        find_package(PythonInterp 3.9)\n        find_package (PythonLibs 3.9)\n    endif()\n    if ( WIN32 )\n        find_package(PythonInterp 3.9)\n        find_package (PythonLibs 3.9)\n    endif()\n    if( UNIX AND NOT APPLE )\n        find_package(PythonInterp 3.9)\n        find_package (PythonLibs 3.9)\n    endif()\nendif()\n\n# gumbo-parser it is our main xhtml/html5 parser.\n# We have an internal version because it diverges from Google's and GitHub's\n# versions and neither want's our epub specific changes.\nadd_subdirectory( internal/gumbo )\n\nadd_subdirectory( 3rdparty/ )\nadd_subdirectory( src/ )\n"
        },
        {
          "name": "COPYING.txt",
          "type": "blob",
          "size": 34.3232421875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "ChangeLog.txt",
          "type": "blob",
          "size": 154.357421875,
          "content": "Sigil-2.4.0\n   New Features\n     - added a GetInfo dialog and right click menu option for XHTML files that provides a collection\n         of information specific to that file without having to run Reports (including a word count)\n     - added support for multiple semantics per xhtml file, while uncommon is technically allowed by the spec\n     - made debugging with VS IDE easier\n     - streamlined Sigil logos and installer for Windows\n     - improve Sigil Well-Formed (sanity check) to better identify errors with missing attribute quotes\n     - update to Qt 6.7.3 and its PySide6 version for MacOS and Windows release builds\n     - updates to building on linux documentation\n     - add support for building with and using virtual python environments on Windows and Linux\n     - change Replacement Chooser to use Checkboxes to determine if replacements should be made, no deletes\n     - allow Windows Sigil installer to run on Windows arm64\n \n   Bug Fixes\n     - readability improvments for Load Warnings (thank you BeckyEbook)\n     - remove xhtml meta charset information after converting to utf-8 on initial load to prevent encoding errors\n     - forced the Preferences KeyboardShortcuts assign and remove buttons into the tab focus chain\n     - PR #778 building Sigil with recent Qt versions that no longer accept the QT_IMPLICIT_QCHAR_CONSTRUCTION macro\n     - fixes for using QTimeZone to prevent build warnings where possible (modified version of PR #779)\n     - fixes for better whitespace handling in TagLister codebase\n\n   \nSigil-2.3.1\n   Bug Fixes\n     - fix to prevent double epub load warnings\n     - fix to prevent load warnings without details from causing a crash\n     - fix to prevent rename templates from using characters forbidden in file names and paths\n     - fix to better restoreState when MainWindow is Maximized of FullScreen\n     - fix lost External Editor Preference when browse cancelled (BeckyEbook)\n     - fix for crashes related to serious epub load exceptions\n     - better handle epubs with missing NCX files\n\n\nSigil-2.3.0\n   New Features\n     - removed support for building Sigil with Qt5 as our code had become a rats nest of qt version ifdefs\n           See our git branch \"qt5final\" for the very last buildable version of Sigil under Qt5\n     - our new minium version to build Qt is Qt 6.4.0 or later\n     - removed the need and usage for Qt6Compat5 as its contents were deprecated and will go away eventually\n     - added support for using the IUC library to help replace the range of encodings supported by the old QTextCodec\n     - we are now using NFC unicode normalization form for all content, links, urls, and file paths.\n     - made Sigil's Well-Formed Check (Sanity Check) more robust to whitespace parsing rules and allowed\n          it to detect and report missing XML Headers\n     - we have upgraded to use Qt 6.7.2 and Python 3.11.9 for the base of our Windows and MacOS releases\n     - added a Bookmark Location toolbar icon right beside the Back button for easier use\n     - Opening EditTOC, SpeckcheckEditor or MetaDataEditor will now highlight the first line entry\n     - Add new Tool: Rebase OPF Manifest IDs on Current Filenames\n     - Update to 3rdparty PCRE2 version 10.44 for bug fixes\n     - General code cleanup to remove unneeded hacks and workarounds for old Qt bugs now fixed\n  \n   Bug Fixes\n     - reverted all Qt Buttons and CheckBoxes to default TabFocus to speed up focus changes and reduce clicks\n     - fixed SelectFiles (AddCover, Insert Image) to again use the arrows keys to walk the list\n     - fixed some lost or stolen focus issues\n     - fix overwriting of existing nav document and cover-image manifest properties\n     - fix for Reports column sorting that use thousands group separators\n     - fix for Reports file size column that did not properly use QLocale for decimal points and separators\n     - fix crashing due to PCRE2 bugs in Qt 6.7.2 with their internal PCRE2\n\n\nSigil-2.2.1\n   Bug Fixes\n     - fix bug introduced by using ClickFocus policy on QToolButtons with menus instead of NoFocus\n     - update base.ts for late Preferences tranaslation change missed in the last release\n     - update Translations from Transifex\n     - fix incorrect std button icon under Fusion for Sigil Preferences Open Preference Folder\n     - set default button in the fix doctype/headers dialog on epub load to Yes to match earlier behaviour\n\n     \nSigil-2.2.0\n    New Features\n      - add support for Windows live switching from dark to light and light to dark modes\n      - add support for Linux kde and gtk3 live switching from dark to light and light to dark modes\n      - add new environment variable: SIGIL_PREVIEW_TIMEOUT\n           (in milliseconds) to allow user control of the Preview updating intervals,\n           valid range 100 - 10000.  default value: 1000.  Set only once at Sigil startup.\n      - add new Find and Replace targets: Selected SVG files, Selected Javascript Files, and Selected Misc XML\n      - add new Find and Replace Regular Expression menu option: Unicode Property (*UCP)\n      - add ability to rename files when new name is just a case variant on case insensitive filesystems\n      - extended the number of clips that can be assigned to toolbars (total now of 60 clips supported)\n      - Accessibility improvements:\n          - add abiity to highlight the widget with current focus (Thanks BeckyEbook)\n          - add ability to double text insertion point width throughout Sigil\n      - Extend Python Plugin Interface with info on preferred font mangling information\n      - There will be no more built-in HighDPI diddling in Sigil's prefs. If you have special needs in that regard, set your own Qt environment variables.\n      - replacement strings in F&R can now use \\x{hhhh} hex escape codes to represent unicode characters numerically\n\n    Bug Fixes\n      - reformating css with multiline now adds space after selector comma\n      - add in bulk resource move and use bulk delete to handle epubs with thousands of files\n      - add in bulk resource rename to handle epubs with thousands of files\n      - if Replace has focus and Find done, CodeView should get focus (Thanks BeckyEbook)\n      - fix dark mode Toolbar continuation symbols for Windows (Thank you BeckyEbook)\n      - fixed bug in Save-As context menu action in ImageTabs\n      - fix dark mode live switching on macOS issues qith QTreeView and QStandardItemModels\n      - fix bug in missing CharToEntity in the Create TOC process\n      - fix TabManager tab close symbol on macOS to match that used in dockwidgets\n      - use Unciode NormalizationForm C inside Sigil and for io\n      - fix macOS stuck at Maximized size issue\n\n\nSigil-2.1.0\n    New Features\n      - assign menu accelerators P - &Plugins, and K - Chec&kpoints (thank you BeckyEbook)\n      - add ability to change keyboard focus using keyboard shortcuts or menus\n          to BookBrowser, Preview, CodeView, ClipsWindow, and TableOfContents Windows\n      - preserve Media Overlay Active Classes when deleting unused classes\n      - Goto Link Or Style (or Ctrl-Clicking on a class will now search selectors\n          with combinators if nothing found in normal css classes\n      - update to a newer Spanish hunspell dictionary\n      - overhaul of Building on Linux documentation\n      - update 3rdparty zlib to version 1.3.1 for security and other bug fixes\n      - update 3rdparty pcre2 to version 10.43 for security and other bug fixes\n      - update to Qt 6.6.2 for security fixes, accessibility improvements\n      - allow cancelling of Save if mend on save set and not well formed\n      - Windows users can now set the SIGIL_USE_FREETYPE_FONTENGINE environment variable\n           to more fully support woff and woff2 fonts\n      \n    Bug Fixes\n      - multiple bug fixes from Qt 6.6.2 such as the transient child window resize bug on Windows, etc\n      - fix QuickParser bug when parsing attribute names not properly ignoring all legal whitespace\n      - make OPF parsing robust to alternative whitespace usage as well\n      - fix creation of thumbnails of svg images in SelectFiles and Image Report for macOS\n      - fix svg rendering in QtSvg by filtering out desc and title tags inside text tags pre-rendering\n      - fix Python plugin quickparser.py to better handle svg mixed case tag names\n      - better handle cancelling out of plugins prior to their completion\n      - better handle Guide/Landmark title translations (thank you BeckyEbook)\n      - clean up cmake and build warnings\n      - fix crash on Windows when using woff/woff2 fonts\n\n\nSigil-2.0.2\n    Bug Fixes\n      - fix incorrect clip tool button insertion point due to null activeWindow value\n      - fix Windows multiple screen issues when not properly identified (Qt6.5.2 patch fix)\n      - fix Mac Accessibility related crashes when using non-native QFileDialog (Qt 6.5.2 patch fix)\n      - workaround MacOS QMessageBox loss of focus Qt 6.5.X bug without hurting other platforms\n      - fix pretty print mend not formatting mathml\n      - fix Accessibility related crashes in QFontComboBox (Qt 6.5.2 patch fix)\n      - prevent crashing if user mistakenly tries to delete entire ncx in CodeView\n      - harden delete unused styles to trailing whitespace in class names\n      - fix unrecognized media-types application/xml and text/xml\n      - fix cursor just before end tag bug in align justiry, centre, right\n      - fix crash when all metadata removed by user in MetaEditor\n      - fix macOS min in Info.plist to be the actual 11.0\n      - update build docs to Qt 6.5.3\n\n\nSigil-2.0.1\n    Bug Fixes\n      - fix crash when right click on Misc folder in BookBrowser\n      - Allow user to revert CodeView drag_and_drop change via environment variable: SIGIL_ALLOW_CODEVIEW_DROP=1\n        Note: Using DragnDrop in CodeView is still NOT officially supported.\n      - add inadvertantly missed updated serbian translation (ts) file\n\n\nSigil-2.0.0\n    Bug Fixes\n      - fix incorrect assert in sigil-gumbo\n      - recognize application/pdf mediatype on epub import\n      - remove compiler build warnings to clean up the build output\n      - recognize source tag attribute srcset for xhtml source updates\n      - fix Preview disconnect bug after split at cursor\n      - fixed sigil-gumbo interface for plugins\n      - added workaround for ADE epub3 bug with scaled cover images\n      - fix encoding for named entities in opf metadata\n      - fix drag/drop crash by disabling drop inside CodeViewEditor\n      - fix CodeView to Preview syncing on text after an inline xhtml comment\n\n    New Features\n      - updated to Qt 6.5.2 which is now used for official releases\n      - updated to Python 3.11.3 and uses the latest EmbededPython interface\n      - updated to the latest jquery version 3.6.4\n      - supports use of embedded pdfs ala ADE\n      - added dark window titlebars for Windows platforms\n      - add support for a user's cover-template2.xhtml and cover-template3.xhtml\n      - add user preference to control printing dpi and add busy indicator icon \n\n\nSigil-1.9.30\n    Bug Fixes\n      - fix Checkpointing to work with dulwich version 0.20.46+\n      - fix css value parsing when !important is used\n      - EmbeddedPython fixes to work with Python 3.11 and later (thank you sharkcz)\n      - leave cursor position unchanged if nothing found when search groups of files\n      - make all Numeric items in Reports align right\n      - add support for thousands separator to Reports\n      - allow blank dc:language values to prevent crashing (as Sigil-1.9.10 did)\n      - allow unknown language codes to pass through MetaEditor\n      - MetaEditor under epub2, allow custom opf scheme values\n      - prevent duplicate spaces when reformatting CSS in import, charset and namespace\n      - better prevent random OPF attribute order changes to simplify Checkpoint diffs\n      - fixed file menu Print Preview for xhtml and image tabs\n      - prevent plugins from crashing Sigil by deleting last xhtml file in epub\n      - fix issue where images/css could not be properly added in an epub3 with no css files\n\n    New Features\n      - allow user to edit Checkpoint descriptions for clarity via Checkpoint menu\n      - add ability to show the Checkpoint Change Log via Checkpoint menu \n      - update to Hunspell 1.7.2 (released in December 2022) for spellchecking\n      - update to latest zlib-1.2.13 for latest security fixes\n      - move completely away from ever using OS system tmp folder for storing Sigil wip files\n          instead create a new \"workspace\" folder inside Sigil Preferences folder\n      - added ability to Print Preview and Print contents of Sigil's Preview window\n\n    \nSigil-1.9.20\n    Bug Fixes\n      - double width of new Find Replace icons to make them easier to access\n      - improve new Find Replace icon tooltips to be include short name on top\n      - fix bug that caused file rename changes to fail when updating smil\n      - Metadata Editor will now strip out unneeded xmlns:dc attributes on dc tags\n      - Metadata Editor is now more robust to language codes that have incorrect case in the metadata\n      - clarify Create HTML ToC menu entry works from existing ToC\n      - prevent indavertent \"\\\" chars be treated like escapes when updating metadata\n      - fix MetaEditor nit of not auto adding \"aut\" role to Author metadata for epub2\n      - make Spellcheck Editor count align column numerically (right)\n\n     New Features\n      - add ability for a user-template*.xhtml and user-template*.css\n          be read from Sigil Prefs to create new empty xhtml and css files\n      - updated to very latest MathJax version 3.2.2 for mathml support in Preview\n      - add ability to cycle through 2 different custom stylesheets (and none at all) for use with Preview \n\n\nSigil-1.9.10\n    Bug Fixes\n      - Fix insertion of id and links when cursor immediately before a closing tag\n      - Make sure bundled PySide6 can find QtWebEngine resources on Windows (Qt6)\n      - Properly recreate or remove encryption.xml depending on font obfuscating or not\n      - Make Qt6 versions of Sigil use their own ini files to prevent corruption\n      - treat figcaption as an \"other text holder\" when prettifying\n        \n    New Features\n      - Redesign the FindReplace dialog user interface to minimize size while adding features\n      - Add a FindReplace \"Text\" only checkbox and support to exclude tags from search\n      - Add a Toggle Line Wrap Mode and its support added to CodeView via pop-up menu\n      - Add a Dry Run Replace dialog to act as \"Replace All\" what if. (Shift + Count All)\n      - Add a Replacement filter dialog to allow users to delete unwanted\n            replacements before applying Replace All (Shift + Replace All)\n      - Add a Counts Report to Saved Searches to show Saved Search Group counts by search\n\n\n    \nSigil-1.9.2\n    Bug Fixes\n      - fix loss of highlight on match when searching\n      - fix incorrect search counts\n      - fix incomplete replace all\n      - fix useability issues in Saved Searches\n      - fix handling or subcapture replacements when no search capture groups are provided\n      - fix crash on Windows from too fast/repeated Find Net and Find Previous launched via keyboard shortcuts\n\nSigil-1.9.1\n    Bug Fixes\n     - Allow creation of a Windows 7 Legacy Installer to return Sigil to Windows 7 (for now)\n     - Completely revamped Find and Replace (yet again) to return most of its\n           earlier behaviour for finding next\n     - Prevent Find and Replace Count from changing current location\n     - Extend spellcheck suggestions to properly handle end of sentence vs abbreviations\n     - Center Image Report File Sizes vertically within their row.\n     - Go To Link Or Style will now properly skip leading comments on selectors in CSS stylesheets\n     - ecmascript is considered a core media type for javascript files\n     - make URLInterceptor robust when the Book pointer is NULL (has been cleared)\n\n\nSigil-1.9.0\n    Bug Fixes\n     - Update gumbo to follow WhatWG changes for closing br and p tags in foreign content\n     - Fix Saved Search Controls code typo for Tabbed Html Files\n     - Plug long existant memory leaks related to Saved Searches that stop after a match is found\n     - More file position of 0 fixes and handle toInt() result failures from N/A in ValidationResults\n     - Fix incorrect copied permissions with AddContentFileToFolder after QFile::copy\n     - Fix broken page up / down by key sequence in Repo Log and Automate Log.\n     - Fix broken PluginRunner error signal\n\n    New Features\n     - Make Validation Results sortable by clicking on column header\n     - Add Export All to Validation Results for text or csv output\n     - Completely redesign Find Replace and Saved Searches to not overload wrap when searching multiple targets\n         and add \"Restart Search\" button to make skipping replacements in Saved Searches easier\n     - Update to use the PCRE2 library for regular expression searching\n     - Add a new Sigil Preferences settings to disable GPU acceleration for QtWebEngine/Preview\n         to make it easier for Sigil to keep working even with older graphics drivers\n     - Add indicator to MainWindow titlebar that indicates if epub in old Sigil Standard form\n     - Support building from source on macOS M1 (arm64) machines\n     - Update Windows and Mac embedded python to Python 3.9.9\n     - Allow building Sigil with Qt6.2.2+ or Qt5.10+ from the same codebase\n     - Speed up \"Add Blank HTML\" in epubs with huge numbers of files\n     - Store and set Epub Zip modification dates where possible\n     - Support PySide6 to replace PyQt5 in plugins when building Sigil under Qt6\n     - Handle deprecated embedded Python PyEvalInitThreads properly during build\n     - Support QUiTool in PySide6 under Qt6 for plugins using .ui files\n     - MacOS Python 3.9.9 now now includes TclTK 8.6.12 (no exteral TclTk package needed anymore)\n     - Added Select All Checkbox in Delete Unused Media and CSS (PRs from @luisparravicini)\n     - Add ability to rename classes when editing stylesheet in CV, will rename in all html as needed     \n     - SpellcheckEditor now uses LocaleAware sorting vs Case-Insensitive which did not handle diacritics well\n     - Speed up loading of epubs with large numbers of xhtml files by using concurrency\n     - New Hunspell spelling dictionaries based on scowl size 70 for en_GB and en_US\n     - Support ending \".\" in spellchecker wordbreaks for better abbreviations is dictionary aff supports it\n     - Faster CSS stylesheet reformmating that can handle minor errors and still function\n    \n\nSigil-1.8.0\n    Bug Fixes:\n     - Reports now generate properly quoted csv when saved\n     - Workaround Bug in QtWebengine when using custom scheme handler and specific audio/video codecs\n     - Fix CV -> Preview sync after intial load when Preview Zoom is not equal to 100%\n     - Fix link tags with rel set to stylesheets via Mend and Mend and Prettify that are missing type\n     - Fix GoToLinkOrStyle to work on css link tags in head\n     - Fix logic in GoToLinkOrStyle to better identify the actual target with styles\n     - Fix insert media file when cursor at very start of tag\n     - Fix Windows and macOS bugs when generating Keyboard Shortcuts\n     - Fix insert closing tag when cursor at very start of tag\n     - Fix double copy to Clipboard from OPF and NCX Tabs\n     - Fix GoToLinkOrStyle when class attribute present but cursor not in the class attribute\n     - Fix TabManager scroll to position to properly handle position of 0\n     - Fix crash using Split At Markers when body tag is completely empty (no whitespace or anything)\n\n    New Features:\n     - BookBrowser can now link javascripts similarly to how it links stylesheets\n     - Epub3 javascripts can now open windows if javascript is enabled\n     - Add Find and Replace context menu to clear its curent values and history\n     - Add support for 3 Automation lists that support editing and automatically running a list of\n         commands that can include all Sigil plugins and a limited set of Tools\n     - Add support for BookBrowser to insert a blank javascript file\n     - Do not require replacement prompt if current book is unmodified and input plugin is run\n\n\nSigil-1.7.0\n    Bug Fixes\n     - Workaround to ensure the Saved Searches Controls editor widget is movable on all platforms\n     - Make the External Xhtml Editor Button/Feature work with both PageEdit and non-PageEdit editors again\n     - Fix Preview sync when CV transitions from xhtml to css and back to xhtml\n     - Fix Preview sync when Find and Replace opens new tab with search target\n     - Fix Preview sync when Validation error clicked on\n     - Fix Preview sync when mathml is being used (compensate for mathjax changes)\n     - Fix mathml use when external MathJax directory is specified in builds on Linux\n     - Prevent Sigil from loading any manifested mimtype file from bad epubs, give load warning\n     - Make Spellcheck dialog use double-click to control search in CV, to speed paging word list.\n     - Prevent duplicate translated semantic names\n     - Fix heading tool issues after self-closed BLOCK tags\n     - Prevent stack overflow crashes in pcre lib due to recursion with some valid regex\n     - Fix second window opening on macOS when first launching app with file\n     - Remove [other.] semantic indicators for epub2\n     - Fix crash in CSS Selectors Report when using Filters\n\n    New Features:\n     - added Find Replace Regular Expression validator\n     - added SIGIL_DISABLE_VERSION_META environment variable to control writing of Sigil Version\n     - enable JIT compiler for pcre library to improve regex look-up performance\n     - update the pcre library to version 8.45 (Final EOL)\n\n\nSigil-1.6.0\n    Bug Fixes:\n     - add Qt workaround for restoring Sigil window sizes when FindReplace left open on macOS\n     - add missing tr() calls to the tooltips in the Special Character selection dialog\n     - fix bug when all unused selectors are removed as unused in css stylesheet - uses a placeholder\n     - make empty Nav have a title to help empty epub passing epubcheck\n     - fix bug where fonts couldn't be previewed when a space was in the path\n     - redesigned code to make Merging large numbers of files much faster\n     - fix bug in blank language field in Spellcheck Dialog (Thank you Tex2002ans)\n     - fix use of different indentation of css via PR from BeckyEbook (Thank you)\n     - fix typos in plugin framework guide (Thank you Doitsu)\n     - fix hang on launch when opf manifested files exist inside the META_INF (Thank you un_pogaz)\n     - fix Metadata Editor bugs related to alternate-script (Thank you Carmina16) (#613)\n     - fix Metadata Editor bugs related to epub2 event dates (Thank you Octet-nl) (#616)\n\n    New Features:\n     - extended Find and Replace search targets to include tabbed files, CSS files, OPF, and NCX files\n     - extended Saved Searches to allow a user to set full search controls for each search including:\n          mode, direction, options, and target file sets\n     - Preview loading has been made completely asynchronous with a new progress bar and loading placeholder \n     - merge will now automatically prevent duplicate ids.\n     - merge will now automatically add ids at previous file boundaries to maintain the guide,\n          nav, and ncx links\n     - completely redesigned the XHtmlHighlighter to speedup highlighting especially when Working\n          with single large xhtml files\n     - rewrote CV spellchecking code to speed it up (closer to old Sigil 1.3.0 performance levels)\n          but if working on large single book html files pre-split, turning off CV spellchecking\n          will result in much improved performance\n     - added PyQtWebEngine as a required python module for Sigil plugins.  This will greatly expand the\n          capability of PyQt5 plugins for Sigil.  Allows us to supply a ReadiumReader plugin for Sigil.\n\n\nSigil-1.5.1\n    Bug Fixes:\n     - change when highlight open close tag pair is triggered to eliminate noise\n     - change select tag to use shift-double-click, and select tag and contents to alt-double-click\n     - add missing ability to edit name fields of custom metadata tags in the MetaEditor\n\n\nSigil-1.5.0 (Beta release)\n    Bug Fixes:\n      - fix issue with custom ncx names in non-standard empty epub layouts\n      - fix Import Text to properly add ncx if missing for epub2\n      - fix issue with \"Delete Unused Styles\" not properly detecting all used selectors\n      - fix issues with repeated use of Mend and Prettify on bare text in structural tags\n      - fix extra line issue with Link to Stylesheet (Thank you BeckyEBook!)\n      - fix bug in id assignment in epub3 Metadata editor\n      - fix bug in trailing slash in Move To Folder paths\n      - fix bug in spelling of Columbia->Colombia in Languages (Thank you Tex2002ans!)\n      - fix bug in Clip Editor pasting of multiple clips\n      - fix bug in PerformCSSUpdates related to quoted string in content: values\n      - fix bug related to iframe handling when loading Preview\n      - fix typos in XMLEntities descriptions (Thank you BeckEbook!)\n      - fix numeric table alignment to align right in multiple tables (Thank you BeckyEbook!)\n      - fix bug in Add Existing not properly using QProgressDialog for long import\n      - remove long deprecated and now invalid use of \"altlang\" in epub3 Metadata Editor\n\n    New Features:\n      - added \"sigil\" url scheme and schemehandler to break 2mb limit on single xhtml file size\n      - highlight matched open close tag pairs while editing in CodeView\n      - added capability to delete highlighted open close tag pairs (Remove Tag Pair)\n      - added default selection of text for basic CodeView formatting including bold, italic, etc\n      - added default tag double-click (and shift double-click) to select tag contents (including tag)\n      - extended split on Sigil Split Marker capabilities to work better with nested tags\n      - added a CSS Parser and Query engine that works with Sigil's version of Gumbo\n      - the Reports tool for \"CSS Selectors\" now lists all CSS selectors not just classes\n      - the \"Delete Unused Styles\" tool now handles all unused CSS Selectors not just classes\n      - the Reports for \"CSS Selectors\" and \"Delete Unused Selectors\" now handle selectors in XHTML Style tags\n      - added ability to load text and csv files to Group Saved Searches to automate lists of replacements\n      - reworked the Metadata Editor to be much more Human Readable with tooltips to show xml tags\n      - added semantic code to the descriptive field in Add Semantics as a learning aid (Thank You BeckyEbook!)\n      - Checkpoint ManageRepos now has the ability to sort the repo table by any column (Thank You BeckyEbook!)\n\n\nSigil-1.4.3\n    Bug Fixes:\n      - fix multiple mismatched wait cursor setting and restoring in MainWindow\n      - fix crashes if no dictionaries or preferred dictionary does not exist on start-up\n      - fix link breakage when runing split on a file with bare internal links\n      - fix bug which caused split to lose fragments from some link targets\n      - fix double # chars in fragment ids during merge\n      - fix hang on load with bad encryption.xml font uris\n      - quiet uneeded debug output\n      - fix opf cleanup bug when identical xmlns values are used with two different prefixes\n      - properly update the language code to dictionary mappings when a user changes Primary/Secondary dictionaries\n\nSigil-1.4.2\n    Bug Fixes:\n      - fix bug in \"Add Existing\" files when file names would require percent encoding\n      - fix bug in multiple language spellchecking dialog word lookup \n            when no language attributes used\n      - update de, nl, sv, ko, ru translations that missed the Sigil 1.4.0 initial release\n      - fix bug in OPF metadata attributes that use named entities\n\nSigil-1.4.1\n    Bug Fixes:\n      - critical bug fix for *over* xml encoding html used inside metadata in the opf\n      - return use of ctrl-f to its long standing functionality\n\nSigil-1.4.0\n    New Features:\n      - Two different types of Multiple Language Spellchecking support added:\n          - A user can now specify a Primary and a Secondary Language dictionary \n               for real-time spellchecking (red squiggley underline).\n          - The Spellcheck Dialog will now support spell checking as determined by\n               xml:lang and lang attributes in any languages with dictionaries\n      - Main UI icons now use scalable svg files to better serve higher res displays.\n        All provided by BeckyEbook (ala BeckyDTP).  A huge Thank You! to BeckyEbook\n      - New brighter Sigil Application Icon is now being used.\n      - Alternate Sigil main Application Icon now available as a build-time option\n      - Sigil now provides 3 different Icon Themes for the user: Main, Fluent, and Material\n           Again all thanks goes to BeckyEbook for creating/collecting all of the icon themes!\n      - Sigil will now support a custom user-determined Icon theme via a custom .rcc file.\n          - pre-made icon themes for Legacy and Material themes in different base colors \n            are now available with more user-contributed theme files to hopefully come.\n            Again Thank BeckyEbook!\n      - New main toolbar icons are now available and improved icon groupings have\n          been made to provide the user with a greater degree of toolbar customization.\n          Users may need to drag and drop icon grouping and modfy their selections of Toolbars\n          to see some of these new options.\n      - Improved support for IRI (international) hrefs.  OPF newly added file manifest ids \n          now converted to plain ascii to prevent issues with older readers\n\n    Bug Fixes:\n      - Fix bugs in Marking for Index\n      - Perform major URL en/decode refactoring to properly handle '#' \n            (and other reserved chars) in file names\n      - Translate \"Table of Contents\" using book language not ui langauge\n      - Fix handling of links when using Add Existing on xhtml files with links\n            to other xhtml files\n      - Fix split code to better handle duplicate target ids that reside in different files\n      - Bug fixes for the plugin interface from wrCisco (Thank you!)\n      - Bug fixes for the plugin interface setguide from BeckyDTP (Thank you!)\n      - Fix bug in OPF parsing when valid but non-traditional namespace prefixes are used\n      - Fix rare off by one condition in clip number to clip enditor model conversion\n\n\nSigil-1.3.0\n    New Features:\n      - Added FontTab to show a specific font by double-clicking in BookBrowser\n      - Added Index Toolbar\n      - Windows/macOS release build updated to Qt 5.12.9 with added bug fixes\n      - Windows/macOS release build updated to Python 3.8.3\n      - Added increased protection against evil epubs manipulating file: urls\n      - Changes to support building with Visual Studio 2019 on Windows\n      - Improved Windows Installer and handling of C++ runtime libraries\n      - Updated Build instructions for MacOS, Windows, and Linux\n\n    Bug Fixes:\n      - Reorganized the source code to add a Widgets folder to reduce code duplication\n      - Fixed spelling mistakes in MetaEditor user interface and xmlsanitycheck error messages\n      - Fixed mistakes handling font files (and other files) whose names start with a \".\" on macOS/Linux\n      - Improved embedded python error messages\n      - Improved some error messages on epub load\n      - Fix TabConnections to properly handle the new FontTab tabs\n      - grew Preferences Colour widths to better handle non-English colour names (Thanks BeckyEbook)\n      - Fixed bug in handling missing local links when using Add Existing ...\n      - Removed all python2 remanants from the Sigil plugin and pythonlib code\n      - If \"Mend on Open\" set, better handle import of huge file of of run-on lines\n      - Bug fix for css url updating\n      - Fix bug that prevented css updates from being shown in Preview without reload\n      - Fix gcc8 build warnings where possible\n      - Prevent BookBrowser's Rename and RERename from using URI delimiters (\"#\",etc) in file names\n\n\nSigil-1.2.1\n    Bug Fix:\n      - Source code only release for Linux using Python versions <  3.8 to define sys.argv\n \nSigil-1.2.0\n    New Features:\n      - Provide a tweak setting to adjust drag distance for Windows & Linux\n      - Added YesToAll and NoToAll options for replacing images via Add Existing...\n      - Highdpi and uifont setting information is now available to Sigil's plugins\n      - Add a Checkpoint feature to Sigil for fast versioned saves to git repositories\n          - add ability to easily create a Checkpoint (stored via a local git repository)\n\t  - add ability to see the changes between the current epub and any earlier Checkpoint\n\t  - add ability to revert the entire epub back to an earlier Checkpoint\n\t  - added ability to manage and delete Checkpoint repositories.\n    Bug Fixes:\n      - Fix cosmetic file name issue when aborts file rename edits in BookBrowser\n      - Improve default drag-distance for BookBrowser for Windows & Linux\n      - Reduce required drag distance for macOS\n      - Fix index generation bug related to non-escaped text used in regular expressions\n      - Fix bug that caused lost class attributes when marking words for an index\n      - Guide to Landmark Semantic mappings have been extended to better cover \"other.*\" guide items\n      - Changed the removeDir() routine to better deal with Windows delete file issues.\n      - Updated Building on Windows docs\n      - Updated Building on MacOS docs\n      - Modified the codebase to use Ordered hashes/dictionaries throughout \n            to prevent unneeded reordering in tag attribute order\n\n\nSigil-1.1.0\n    New Features:\n      - Added Support for Dark Mode for Windows, Linux and macOSX (Thanks BeckyEbook!)\n      - Added new icons that work well under both Light and Dark modes (Thanks BeckyEbook)\n      - Added ability to use Dark Mode for Preview (controlled by Preferences)\n      - Added Zoom Keys Ctrl +/- support to the Inspector (for improved Accessibility)\n      - Added support for a second Clip bar with up to 20 additional clips\n      - Select Special Character Dialog now support scrollbars\n      - Guide and Nav titles are now translated into ebook language (if translations available)\n      - All Report Names have been shortened to allow larger font sizes for better Accessibility\n      - Added improved contrast icons (Thank you BeckyEbook!)\n      - Completely reworked all Sigil Preference Dialogs to make them more screen/user friendly\n      - Improve High DPI Preference Settings for Windows users\n      - Clips from the Clips QDockwidget window can now be used in CSS Tabs as well.\n      - The plugin interface has been extended to show current colorMode and primary colors\n      \n    Bug Fixes:\n      - Replaced deprecated QSignalMapper code with QActionGroups throughout Sigil's code base\n      - Fixed bug in \"open-with\" on macOSX that did not allow .app files to be selected\n      - Soft hyphens characters are now handled properly by Spellchecking [PR from BeckyEbook]\n      - Fixed bug in 'split at cursor\" that created extra empty pages\n      - Fix bug in Insert Files from Disk\n      - Fixed same thread re-entrancy issues with tab creation / deletion code due to Qt signal/slot handling\n      - Fixed source code typos [PR from luzpaz]\n      - Fixed incorrect number of \"times used\" in Image Reports\n      - Fixed plugin font_iter() code to properly handle new Iana.org font media types\n      - Broken links are no longer changed during ImportHTML (Add Existing...) operations\n      - Cover svg image \"vh\" \"vw\" fixup code now properly handles empty headers on cover page\n      - GetBookpathByPathEnd() will now work properly and thereby better handle detection of file\n           name conflicts during imports\n      - Better handle file name info from Validation plugins\n      - Inserting Links now creates proper links for top of page of the same file\n      - Fix ImportHTML when creating a new book to properly add an NCX if needed\n      - Include official QT backported fixes to Qt 5.12.6 to make it more stable\n      - The nav will now properly handle internal links to top of page of the nav itself\n      - harden lxml xml processing with resolve_entities set to false for improved security\n\n\nSigil-1.0.0\n    Bug Fixes:\n      - All bugs reported in alpha release have been fixed. \n        Special thanks to Vroni, BeckyEBook, Doitsu, Odamizu, \n        Un_Pogaz, snarkophilus, and many others who ran tests and reported bugs.\n      - Fix for crash on macOS opening Preferences following New MainWindow\n      - Workaround Qt bug in restoreState after maximize with Find and Replace open\n      - Fix logic to identify and store window geometry when normal (not maximized)\n      - Fix handling of plugin dialog being closed or aborted / cancelled\n      - Prevent Preview timer related crashes on closing MainWindow on macOS\n      - Update and harden media types recognition\n      - Use non-native QFileDialogs on macOS to workaround Qt bugs\n      - Fix crash of fast Tab closing on all platforms\n      - Prevent whitespace inside code tags from being changed when prettifying\n      - replace case change \"text icon\" with actual sizable icon (Thank you BeckyEbook)\n\n    New Features:\n      - Add Load/Save capability for the Custom Empty Epub Layout Designer\n      - Large speedups in Reports using QtConcurrent\n      - Speedups in Spellcheck Dialog sorting\n      - Add File Name to Preview Window title\n      - Add Regular Expression File Renamer to BookBrowser context menu\n      - Mend on Open or Save only touch/repair non-wellformed files\n      - Re-enable Drag and Drop of Tabs\n      - Add menus/icons for \"New ePub2\" and \"New ePub3\" to ease creation of empty epubs (icons courtesy of BeckyEbook)\n      - Extend ePub2 Guide Semantics to include many of the \"other.*\" codes common to ePub3 as well\n\n\nSigil-0.9.991 (pre1.0 Alpha Release)\n    Bug Fixes:\n      - handle javascript location.href style in Preview \n      - use CaseInsensitive sort in Plugins menu (Thank you BeckyDTP)\n      - use Locale aware sort routines for AddMetadata, and MetaData Names (Thankyou Doitsu)\n      - recognize x-font-otf style media types\n      - recognize vnd.adobe.page-template+xml media type\n      - recognize webp images media type\n      - improve updating of smil xml files when moved\n      - preserve whitespace inside the code element when prettifying\n      - try again to prevent timer events during MainWindow close that causes random crashes on exit on macOS\n      - fix svg cover images to use 100vh and 100vx in Preview\n\n    New Features:\n      - completely reworked most of Sigil's internals to now load all Epubs in their \"as-is\" state \n           and fully allow editing and plugins to work\n      - added Tools menu item to standardize an epub to Sigil norm.\n      - added Tools menu item to allow user to design a custom empty epub and make it default\n      - added font tooltips that describe each font by mousing over in BookBrowser (with improvements by BeckyDTP)\n\n\nSigil-0.9.18\n    Bug Fixes:\n     - fix bug in macOS that caused spurious warnings about missing file in the manifest\n     - hopefully fix macOS bug about launching files using open-with from Desktop\n     - make sure JQuery gets loaded before starting to use Preview javascript functions\n     - fix local links during split that incorrectly used target filename for internal link\n     - create GetEnvironmentVar to make access to environment variables more cross-platform\n     - fix macOS bug when hitting close on the title bar of MainWindow causing strange window behaviour\n     - hopefully fix macOS segfault on close by disabling Preview timer immediately\n     - fix Windows 7 issues when running batch (.bat) files via OpenExternally (open with)\n     - all error messages are now properly logged\n     - fix improperly disabled open-with menu in Image Tabs popup context menu\n     - removed use of Qt obsolete methods in About and Error Dialogs\n\n    New Features:\n     - enable use of SIGIL_DEBUG_LOGFILE environment var to control saving debug output to a file\n     - properly update the ncx after merging xhtml files\n     - properly warn users if a multiple rendition epub (multiple OPF files) has been loaded\n     - make Sigil's external XHtml editor work to pass an OPF file (see PageEdit new features)\n     - Allow epub3 metadata editor to edit primary meta tags\n     - Replace buggy cssutils module used in plugins with our own drop-in replacement fork: css-parser\n     - Updated Mac, Windows, and Linux build documentation\n\n\nSigil-0.9.17\n    Bug Fixes:\n     - fix missing python3 network certifications on macOS\n     - do not apply named entities in Preserve Entities to epub3 epubs\n     - fix build docs for macOS\n     - prevent FlowTab destructor race crash when opening a new book (Linux, Mac, Windows)\n     - fix suggestions for built-in en_US dictionary by adding \"x\" to the TRY list\n     - fix plugins adding and deleting ncx under epub3\n     - throw exception in plugins when epub2 tries to add or delete the ncx\n     - fix bad Warning message about missing nav.xhtml file that was not missing\n     - fix CodeView to Preview sync breakage due to minimize/restore\n     - fix CodeView to Preview sync breakage due to attempting to load the Preview before it \n          finished loading the last update\n     - fix sigil_bs4 to work with latest python lxml 4.4.X in a backwards compatible manner\n     - fix missing Preview to CodeView sync on Qt versions 5.9.X\n     - fix segfault on app close related to the PreviewWindow update timer firing at a bad time\n     - fix syncing loss caused by spurous load finished signals causing ExecuteCaretUpdate to stop working \n     - fix macOS specific bug that allowed multiple Dockwidget MainWindows to become tabs\n    New Features\n     - add a python3 plugin module navprocessor.py for plugin devs\n     - show Preview by default (tabified with TOC) for new installations of Sigil\n\n\nSigil-0.9.16\n    Bug Fixes:\n     - add missing title tag to nav head to make epubcheck happy\n     - add dcterms:modified to empty epub 3 opf to keep epubcheck happy\n     - fix lost Preview-CodeView sync when internal links are followed in Preview\n     - fix macOS specific bug with newer versions of PIL (Pillow) used by plugins\n     - no longer link against unused Qt frameworks when building (thank you eli-schwartz!)\n     - prevent ms vc++ automatic reboots during Windows installs\n     - prevent user from changing semantics of the nav file itself (it must be set to \"toc\")\n     - fix bug that dropped nav from spine when HTML TOC created\n    New Features\n     - added epub3 tool: Generate NCX/Guide for epub2 e-readers\n     - added epub3 tool: Remove NCX and Guide\n     - added right click on link in Preview copies url to clipboard\n     - added check mark indicator for current semantic set in AddSemantics dialog\n     - opf guide is no longer used/updated in epub3, unless new epub3 tool menu is used \n     - harden Sigil against maliciously crafted epub zip archives (aka zip-slip attacks)\n     - added bk.getnavid() to the plugin framework and navprocessor.py for plugin devs\n     - updated build documents to the latest Qt 5.12.3 and Python 3.7.2\n\nSigil-0.9.15 - A Beta Release of Sigil ported to QtWebEngine to replace QtWebKit\n    New Features\n     - ported to use QtWebEngine (based on Chromium) to replace QtWebkit\n     - QtWebEngine plugs many major memory leaks.  Memory footprint should stay low to moderate.\n     - QtWebEngine has ongoing security and support patches from Qt/Google/Chromium\n     - removes the broken/deprecated BookView Editor that relied on QtWebKit\n     - created PageEdit app (that uses QtWebEngine) that replaces much BookView functionality\n           (see https://github.com/Sigil-Ebook/PageEdit)\n     - allows the user to control use of javascript and remote access by epubs when editing\n           to improve overall security\n     - adds action to launch one preferred external xhtml editor via shortcut or icon\n           (can be used to fast launch PageEdit app or any other xhtml open-with editor)\n     - adds 5 more plugin quicklaunch buttons to main menu for a total of 10\n           (with all new icons! Thanks so much BeckyEbook!)\n\nIt also includes all of the fixes and updates from Sigil-0.9.14.\n\nSigil-0.9.14\n   Bug Fixes\n     - flush all changes to disk before creating a Report so that files sizes are correct\n     - stop writing python bytecode to Program Files on Windows\n     - remember cover semantics if cover image replaced by Add Existing...\n     - fix issues with the Plugin Framework documentation epub\n     - more memory leaks plugged\n     - minor code cleanups\n   New Features\n     - updated to Qt 5.12.3 with Annulen Webkit 5.212 with extra QtCursor memory leak fixes\n     - updated to Python 3.7.2\n     - updated build docs for macOS, Linux and Windows\n     - build system now uses GNUInstallDirs to determine the best installation libdir on Linux\n     - updated desktop integration for Linux\n     - reduce PCRE cache size to help lower memory footprint\n     - improve mapping of hunspell dictionary names to actual language names (thanks BeckyDTP)\n     - add warning during import if unmanifested files exist in the epub zip archive\n     - no longer requires use of non-breaking space entities (or any entities at all!)\n     - special spaces are now visisble via syntax highlighting in CodeView\n     - dropping epubs on Sigil.app no longer opens an extra empty epub on macOS\n     - reload Preview only when needed to help prevent screen flicker and lower memory use\n     - enabled Windows automated builds using Apppveyor\n     - characters in HTML files report now uses gumbo for speed\n     - allow user's custom plugin icons to survive a plugin update\n\nSigil-0.9.13\n   Bug Fixes\n     - Revert change of INI encoding to utf-8 as QSettings very broken under utf-8 (commit 5484463)\n     - Ensure all url attributes in shape-outside properties in CSS stylesheets get updated (commit de7b09f)\n     - Workaround for lost cursor in qlineedit Qt bug (issue #398) (commit a8acab7)\n     - Workaround missing File New, Open, Quit menus in Mac menubar if windows closed (commit 660a8aa)\n     - Remove Icon from Tab for macOS only to workaround Qt bug (commit 5c91924)\n     - Plug some memory leaks (commits: 85f78d7, cb9b833, 614d601, bf2f2f4, ebfb613, 4qa8f33) \n     - Backport Qt 5.12alpha fix to prevent heap corruption due to qwidget next focus pointers (commit f5c7284)\n     - Plug macOS memory leaks when closing a main window (commit fbf9015)\n     - Put back quote in tag name bug fix lost in recent changes (commit ebd8c7c)\n     - Disable Netscape Plugins being used in BookView and Preview Window (commit 79314ea)\n     - Use custom version of qtwebkit with Qt 5.5 memory leak fix added back and no load plugins if disabled \n       \t   (see commits 94a28d7,  9f7ebba, and 4b968a9)\n\n   New Features\n     - Add filename to tab tooltip (commit 27f8db7)\n     - Clear memory caches when Preview changes to keep memory footprint smaller (commit 87b9247)\n     - Update to MathJax 2.75, adds support for mathml mlongdiv, mstack, mcarries (commit 568aba5)\n     - Reduce memory footprint by letting worker threads expire (commit c1ee7ca)\n     - Reduce memory footprint by properly setting web page caches (commit 9f07cbe)\n\n\nSigil-0.9.12\n   Bug Fixes\n    - fix typo in cssreformatter that caused errors with @fontface (issue #394)\n    - workaround for qt bug affecting tab close buttons on Mac (commit f3b9399)\n    - fix Mac Qt5 plugin dylibs that macdeployqt broke in Sigil-0.9.11\n\nSigil-0.9.11\n   Bug Fixes\n    - after mend and prettify - put cursor at enclosing tag if possible\n    - allow both links in Preview and clicking in Preview to reposition CV\n    - fix new cursor repositioning under new tab ala Spellcheck\n    - fix prettyprinting of the mark tag in gumbo and sigil_bs4\n    - fix crash when tagname illegally (for xhtml) includes single or double quotes\n    - fix crash in Reports for non-wellformed xhtml that was okay under html5\n    - fix deletion of multiple css files when Book View is open (Windows)\n    - fix bug in reformat CSS with media queries\n    - fix bug in closing some tabs needlessly when linking stylesheets\n    - fix crash bug in gumbo parser under very strange circumstances\n    - remove empty guide elements in epub2 opf as epubcheck now flags these\n    - fix issue with index generation reordering spine entries under certain conditions\n\n   New Features\n    - update official builds to use Qt 5.11.2 and Python 3.7\n    - update internal Python modules to use latest versions\n    - update Sigil's gumbo parser to fix all known bugs and greatly speedup parsing\n    - embed new project css_parser (fork of cssutils)  as a python library to fix css parsing \n    - Sigil no longer attempts to upgrade the VC++ runtime on Windows. It only installs the\n        bundled VC++ runtime if there is no compatible version already installed\n    - add support for internal but unmanifested opf metadata link resources under epub3\n    - extend \"Open With\" context menu to allow up to 5 external editors per resource type\n    - make format of all Sigil ini files to be utf-8 encoded to more easily allow user changes\n\n   Changes\n    - Support for Windows Vista officially ends ... Win7sp1 is official minimum required Windows\n      The unofficial Legacy Windows version of Sigil will be available to XP and Vista users\n\n\nSigil-0.9.10\n   Bug Fixes\n    - Fix signal handling to prevent double launch of plugins immediately after plugin installed\n    - Fixed incorrect named entity tooltips for many of the Insert-> Special Characters\n    - Fixed lack of recognition of woff2 fonts inside Sigil and for plugins\n    - Fix segfault when .xml is first file in BookBrowser and add new html or split at cursor is invoked\n    - Fix bug that allowed multiple audio/video tabas of the same resource to be opened\n    - Fix plugin related bug when adding/removing last xhtml file\n    - Fix Text Direction setting inside body to use structural dir attribute under epub3\n    - Fix duplicate group-position property in epub3 MetaData Editor\n    - Use absolute path references when first opening Sigil with an ebook so that Open Recent works better\n    - Fix \"issue\" in handling self-closing script tags in head (similar issue that we had with self-closing title tags)\n    - Fix issue converting Qt Strings to their Python equivalent when outside the BMP\n    - Fix issue with trying to add existing html files when names clash due to case insensitive file systems\n    - Fix crash bug after styling text in BookView and immediately going to CodeView without moving cursor\n    - Fix crash bugs after deleting resources contained in a Report in the BookBrowser\n    - Fix bug that destroys nav if left in unparseable state by user even temporarily\n    - Fix bug that moved curosr to beginning of tag block when save is done in CodeView\n\n   New Features\n    - allow plugins to supply their own icon (plugin.png 48x48) for use on the Quick Launch Toolbar icons\n    - extend plugin interface to include the status of the epub inside Sigil (modified or saved)\n    - extend plugin interface to include the path to the saved epub file or the null string if never saved\n    - extend Insert->Special Characters to include both a Greek letter panel and a mathematical symbol panel \n    - add support for calibre:series and calibre:series_index to Metadata Editor for epub2\n    - add support for calibre:title_sort to Metadata Editor for epub2\n    - add support for clicking internal links in Preview to load the proper destination tab\n    - add support for loading Qt's base translation files if present. Allows buttons on native qt dialogs to\n        be translated (Windows users may need to manually copy newer qtbase_xx.qm files to Sigil's translation\n        directory if they didn't exist in Qt5.6.2)\n    - allow user to add custom css rules to Preview/Book View by creating a file called \"custom_preview_style.css\"\n        in the Sigil preferences folder (not responsible for custom css and ebook css fighting with each other)\n\n\nSigil-0.9.9\n   Bug Fixes\n    - Add python_3.5_fixes3.patch to Python build and update build docs on OSX to fix missing symbols\n    - Fix crash caused by Preview holding pointer to user removed resource when front tab is non-html resource\n    - Fix crash in FlowTab destructor due to re-entering flowtab during Syntax Highlighting and signals\n    - Fix issue with file icons disappearing when reordering in Book Browser (commit ecb56b1f)\n    - Fix missing epub3 Manifest cover-image property setting/unsetting with BookBrowser\n    - Fix issue where cancelling the SaveAs dialog disconnected an existing epub from its saved path\n    - Fix assertion error in sigil-gumbo when handling extraneous script end tags\n    - Apply multiple fixes for gumbo from upstream\n    - Fix segfault in Split at Cursor when not an html file\n    - Make sure Add Cover tool properly handles existing manifest cover properties in EPUB3s\n    - Correct error dialog to say \"Sigil may need to close.\"\n    - Prevent Images and Misc items from being dragged to the Text folder in Book Browser (commit 30bb96d)\n    - Fix Linux bug that prevents rich text from other programs being pasted into Book View (issue #320)\n    - Fix bug where index entries inside em and dfn tags were ignored during index generation\n    - Fix bug on Windows in spell checking when smart right single quotes are used for apostrophes\n    - Fix bug in simple well-formed check to handle generic xml processing instructions\n    - Fix bug in epub3 MetaEditor with title-type and collection-type properties\n    - Fix plugin code to prevent book href vs manifest id clashes\n    - Fix bug in Plugin Runner to allow it to delete non-manifested files properly\n    - Fix bug in SourceUpdates to handle properly handle css properties with multiple urls\n    - Fix bugs in well-formed check to better handle missing doctypes\n\n   New Features\n    - Add SIGIL_DISABLE_CURSOR_BLINK environment variable to disable text cursor to aid Accessibility on OSX\n    - Better use semantic information (guide types and Landmarks) to allow the user finer control of index generation\n    - Attempt to improve Metadata Editor placeholder text to help beginners\n    - Preview Window Title bar will now show height and width of the Preview Window\n    - Allow users to limit/disable clipboard history saving via General Preferences\n    - Convert br tags in header text to linebreaks for toc/ncx/nav generation routines\n    - Support spell checking of words with numbers controlled by Preference settings\n    - Add two additional Quick Lauch Icons for Plugins\n\n \nSigil-0.9.8\n   Bug Fixes\n    - Make sure when new empty epub3's are created that the toc does not use a doctype (Issue # 250)\n    - Make GetUniqueFilenameVersion work even on Case-Insensitive filesystems (Issue #247)\n    - Properly urlencode/decode all hrefs in plugin's ResultXML in launcher/PluginRunner to prevent parse errors\n    - Enable Basic Cut Copy Paste Icons/Actions in OPF, NCX, XML, SVG, and other Misc Text Tabs \n    - Add proper detection for minimum service pack requirements in Windows installer\n    - Include workaround for bug in KDE Qt5 plugin on Linux that keep plugins from launching from menu\n    - Prevent splitting Section0001.xhtml (Split at Cursor) needlessly rewrite the file's manifest id with a uuid\n    - Fix issue where merging files when non-xhtml tabs were open was causing Python errors or crashes\n    - Fix segfault in Image Reports when deleting unused image files\n    - Fix bug in prettyprint_xhtml in sigil_bs4 (put back inadvertently dropped is_void_tag routine)\n    - Fix gumbo serialize to better handle injected newlines\n    - Harden bundled Python isolation on Windows and add subset of PyQt5 to bundled modules\n    - Harden plugin interface code to properly unquote/quote hrefs\n    - Stop Sigil from nagging about unsupported mimetypes when epubs with Adobe xpgt page-templates are opened\n    - Fix Book Browser highlighting issue when editable XML files from the \"Misc\" folder are opened\n    - Pull upstream bug fixes from google's gumbo parser for Sigil\n    - Force formatting buttons in BookView to generate inline-styled spans instead of \"strike\", \"b\", etc\n    - Fix bug from deprecated use of jquery $.browser.msie introduced when jQuery was updated\n    - Fix temp folder specification on Windows systems that delete the system temp folder for every login (Issue #285)\n    - Fix typos in metadata descriptions to allow better translations\n\n   New Features\n    - New preference setting (Appearance section) which allows user to adjust the size of the main menu icons\n    - Add manifest properties to Book Browser tooltips and to All Files Reports Widget for epub3\n    - Make Sigil's UI and spellchecker language settings available to plugins\n    - Add support for PyQt5 for plugin gui widgets\n    - Internal builds now use Qt 5.6.2 with Webkit added back\n    - Major compiler tool change and update for Windows build to sync Qt/Python/Sigil on Windows\n    - Update all build it yourself from source documentation for new requirements\n\n\nSigil-0.9.7\n   Bug Fixes\n    - Allow tags in the svg and mathml namespace to automtically self-close if empty to help work around\n         a bug in Kindlegen that will not seem to accept a closing svg image tag even though image is non-void\n    - Prevent TextTab from constantly recentering page when focus is lost\n    - Fix bugs in plugin basename_to_id when used with xpgt files or any unrecognized extensions\n    - Fix typos in pls mimetype in plugins\n    - Fix code synchronization issues among 3 places where file extensions are mapped to mimetypes\n    - Fix plugin readotherfile interface to rebuild the opf on the fly only if it has been modified\n    - Fix plugin validation issues with integer vs string representations of line number and character offsets\n    - Fix duplicate filename in multiple directories bug when updating CSS urls\n    - Fix bug in page-map.xml mimetype when \"Add Existing ...\" is used\n    - Fix undefined behaiviour shifting signed negative values in 3rdparty libs and fix many warnings\n    - Fix text vs binary file type recognition in the plugin interface (CSS and js files are text not binary) \n    - Fix too small toolbar icons on high dpi displays\n    - Fix bug that caused text highlighting to get lost on some systems when doing a CSS Find & Replace.\n    - Fix bug in plugin interface basename_to_id to recognize .htm extensions\n    - Fix bug in epub3 semantic popups to always refect the local name of epub:type setting\n    - Fix bug where creation on an HTML TOC could overwrite an existing Nav under epub3\n    - Fix manifest id not starting with alpha character bug\n\n  New Features\n    - Extend validation plugin interface with add_extended_result() method to allow better cursor positioning\n    - Extend TextTab and  Tabs derived by it to position cursor based on offset\n    - Allow editing of page-map.xml files, xpgt files and other misc xml based files inside Sigil\n    - Update Windows builds use Python 3.5, VS2015\n    - Update Mac OS X builds and build instructions to use Python-3.5.2\n    - Remove support for python2.7 *only* plugins and simply Manage Plugins settings\n    - Update to Qt 5.6.1-1 with QtWebKit added back for release builds for Windows (VS2015)  and Mac OSX\n    - Update Mac OS X and Linux build instruction documentation for recent changes\n    - Allow Linux Dictionaries to look up default paths  for dictionaries passed in by build cmake settings\n    - Mke the columns in the Manage Plugins table be sortable by the user\n    - Better detect undefined and non-existing url fragments to prevent issues when splitting or merging files\n    - Make tooltips for Run Plugin Icons show the name of the selected plugin on hover\n    - Upgrade from jquery 1.6.2 to version 2.2.4\n    - Upgrade from jquery.scrollTo 1.4.2 to version 2.1.2\n    - Upgrade to double sized 48x48 pixel icons for High DPI displays, Special Thanks to PatNY for creating our icons\n\n\nSigil-0.9.6\n   Bug Fixes\n    - Make StdWarningDialog resizeable when \"Show Details\" is used\n    - Fix CleanSource svg prefix removal bug that sometimes broke valid svg code \n    - Remove svg image and html5 menuitem from the list of void elements in the Sigil and plugin code\n    - Properly xml escape \"&\" in metadata attribute values\n    - Properly perform source updates on epub load even when they do not follow recommended spec\n    - Make handling of comments in both xhtml and xml more roubst\n    - Properly url escape css file names to handle css files with spaces in them\n    - Try to make direct editing of content.opf more safe by auto-fixing errors when possible\n    - Properly handle WellFormed checks for pure XML in XMLResource.cpp by using embedded python3 lxml\n    - Make opf_newparser.py and xmlprocessor.py more robust to broken user input in content.opf\n    - Make ProcessXML (repairXML in xmlprocessor.py) - leave untouched anything well-formed\n    - Fix thinko in plugin bookcontainer.py and outputcontainer.py contributed by wrCisco \n    - Fix for improper encoding in plugins on Mac OS X due to missing inherited plugin environment\n    - Fix for typos in epub xmlns when splitting epub3 ebooks in BookView\n    - Update testplugin_v012.zip to testplugin_v013.zip to handle sgc-nav.css new feature\n    - Fix bugs in DeleteUnusedStyles when selector exists more than once in the same stylesheet\n    - Fix bugs in DeleteUnusedStyles when group selectors span more than one line\n    - Fix bugs in Reports: CSS Styles missing cases when selector exists more than once\n    - Fix bug in Reports: All Files to use Landmark Semantics under epub3 not guide semantics\n    - Fix bug, slow in loading ini when too large clipboard history, user can delete them via dialog\n    - Stop cosmetic double-spaces being introduced into OPF manifest, spine and guide entries\n    - Fix bug when user selects too much in BookView and then tries to change case\n    - Fix bug in Delete Unused Media when css urls do not use quotes \n    - Try to set all ways of updating the ncx to use 2 character indentation of head element\n    - Fix Building Relocatable Python on Mac build instructions to remove BeautifulSoup4 requirement\n    - Fix for generating empty guide for epub3 when in plugins\n\n  New Features\n    - create sgc-nav.css stylesheet for nav and allow templates in Prefs Dir for user to control it \n    - Add General Setting to allow user to set own temporary directory location\n    - Add Qt Stylesheet support - Recognize and load \"qt_styles.qss\" file if stored in Sigil Preferences folder\n    - Extended the plugin interface to add support for epub3 bindings elements\n    - Add option + forward delete shortcut to active Metadata Editor remove\n\n\nSigil-0.9.5\n   Bug Fixes\n    - Fix regression when ImportHTML in gathering HTML based DC. metadata\n    - Fix regression - remove incorrect use of opf:scheme from dc:creator and dc:contributor under epub2\n    - Fix regression - the guide reference tag is always a void tag\n    - Fix issues with hunspell spell checking under Windows when non-ascii paths to dictionaries\n    - Fix issues with overridding the prefs directory on Windows with non-ascii paths\n    - Fix broken manual \"Check\" button on W3C stylesheet validation's generated html form.\n    - Fix media-type recognition for .m4a and .m4v file extenstions in main Sigil and plugin code\n    - Treat ruby and rt as inline tags when pretty-printing in Sigils and for plugins\n\n   New Features\n    - Allow user to choose what level of CSS gets used in the \"Validate Stylesheets\n         With W3C\" tool via user preference (General).\n\nSigil-0.9.4\n   Bug Fixes\n    - Prevent the use of zero length key fields when obfuscating fonts\n    - IDPF font obfuscation key accepts all input except as specified\n    - Fix typo in main.ui accelerator assignment\n    - Update Transifex project URL\n    - Prevent NCX Weirdness with ampersand added when editing NCX in codeview and TOC widget showing\n    - Fix lost namespace attributes on metadata tag\n    - Allow auto conversion from package version 1.0 to 2.0\n    - Remove unused parameter from gumbo create_text_node\n    - Fix bug that hits package version when no xml declaration on opf on import\n    - Add id to Heading structure to greatly speed up NCX/TOC creation even more\n    - Only the true nav should ever have the nav manifest property set\n    - Prevent nav property from being overwritten when updating manifest properties\n    - Prevent segfault if user add semantics but never chooses one\n    - Prevent Add Cover from returning the wrong doctype for epub3\n    - Make sure cover-image and svg (if needed) are added as epub3 manifest properties when adding a cover\n    - Make sure all referenced resources are found for Delete Unused Media\n    - Remap non-standard epub namespace prefixes in the opf to those now reserved for epub3\n    - Make loading epubs with broken opf files more robust\n\n   New Features\n    - Extract all MarcRelators related code into its own class so it can be shared\n    - Added some missing MARC relators\n    - Removed obsolete MARC relators (ctb replaced clb, and sng replaces voc)\n    - Completely redesign MetaEditor gui to work with both epub2 and epub3 metadata\n        - Add default metadata language and title for the user\n    - Make the Nav a required part of an epub3 - create an empty one if need be\n        - Create NavProcessor to use gumbo to update the nav.xhtml\n        - Add support for Adding/Removing Nav Landmarks\n        - Better identify the true nav when loading epub3s\n        - Add ability to generate Nav TOC from Book Headings to CreateTOC tool\n        - Check for valid nav otherwise create a new default one ready for updates\n        - Do not allow split markers to be added to nav.xhtml\n        - Do not allow nav to get merged\n        - Do not allow the nav to be deleted\n        - Do not allow plugins to delete the nav under epub3\n    - Completely Revamp BookBrowser interface to support both Guide and Landmark Semantics\n        - Create Semantics Dialog to better handle epub2 and epub3 semantics\n        - Create Separate Guide/Landmarks classes for epub2 and epub3 respectively\n        - Rename DescriptiveMetaInfo structure to just DescriptiveInfo to work with guide/landmarks elements\n        - Add a mapping from Landmark to Guide and Back\n        - Remove old GuideSemantics code\n        - Make sure Landmarks semantics show up in BookBrowser tooltips\n        - Update epub3 semantic vocab in Landmarks\n    - Completely Revamp how the dockable TableOfContents gui widget is built and updated\n        - Remove strong coupling between TableOfContents widget and NCX\n        - Allow dockable Table Of Contents to refresh from Nav under epub3\n    - Large update for translations needed\n        - Many new strings supporting the MetaEditor GUI and Add Semantics GUI were added\n\n\nSigil-0.9.3\n   Bug Fixes\n    - Add a python based updatechecker for Sigil updates to prevent Windows OpenSSL build issues\n    - Stop 'Generate TOC' from introducing unnecessary spaces in front of class attibute values\n    - Use localeAwareCompare to attempt to add Index Entries to build them sorted\n    - Fix segfault caused by use of possibly stale htmlresource pointer in FlowTab destructor\n    - Workaround Qt bug that causes slow selection/highlighting of xhtml on Linux\n    - Fix multiple typos in sigil_gumbo_bs4_adapter code\n   New Features\n    - Add an autostart/autoclose capability for plugin developers\n    - Add 3 User-assignable ToolBar Buttons for up to 3 plugins - users can an assign key accelerators to them\n    - Add General Settings Preference for setting default (epub 2 or 3) for new documents\n    - Merge CleanSource Preference Settings into General Settings Preferences\n    - Add Setting to control Epub access non-multimedia remote resources\n    - Completely reworked Sigil internals to support epub version (2 or 3) specific functionality\n        - ImportHTML, ImportEPUB, Splitting and Merging, Index Generation, Mending, are all now epub version aware\n    - AddModificationDate upon save is now epub2 and epub3 aware\n    - Add \"Epub3 Tools\" to the Tools menu\n    - Add three new epub3 tools: \"Update Manifest Properties\", \"Generate Nav From NCX\" and \n        \"Generate NCX From Nav\" to \"Epub3 Tools\" menu\n    - Add local-storage support to PV/BV for epub3's that use javascripts\n    - Added support to recognize and update upon load SMIL files and Adobe page-map.xml files\n    - Make quoteurl url scheme-aware in both python and for Qt, since epub3 allows external resources\n    - Extend url address recognition to include track, video, and object elements attributes\n    - Recognize and store .vtt and .ttml files for video subtitles and captioning\n    - Prevent attempts from using Metadata Editor gui from hurting epub3 until support is added later\n    - Many epub3 related bug fixes and changes to make sure all new epub3 href/links are properly updated\n    - Reworked the plugin_launcher epub3 interface code to allow fallback and media-overlay attributes\n    - Added support for MathML in Preview via Mathjax.js-single polyfill\n    - Added the MathML list of void tags to GumboInterface for proper serialization\n    - Add technique to call long EmbeddedPython calls by using QtConcurrent::run\n\n\nSigil 0.9.2\n    - Update BuildingOnLinux docs\n    - Update Building on Mac OS X docs\n    - Fix example clips/searches loading on Linux\n    - Simplify UseBundledInterpreter Logic\n    - Preliminary Linux binary installer support added\n    - Include Pull Request 161 by pinotree \"Switch TempFolder to QTemporaryDir\" to improve safety\n    - Fix bug when adding existing html links to stylesheets not being updated\n    - Fix bug in Well-Formed error messages due to bug inside gumbo's error.c\n    - Add xmlns=\"http://www.w3.org/1999/xhtml\" attribute to html tag if missing\n    - Reduce fear of Cleaning ToValidXHTML by using serialize not prettyprint\n    - Add ability to change Sigil's user preferences directory by specifying a new path\n         via the SIGIL_PREFS_DIR environment variable (path must be user-writable).\n    - Fix lost DOCTYPE info when splitting or merging\n    - Completely rework pretty printing via gumbo to be much more robust\n    - Make identification and storage of page-map.xml more robust\n    - Completely revamp Cleaning to use \"Mend Code\" and remove PrettyPrintGumbo as on option\n    - Rename PrettyPrintGumbo to \"Mend and Prettify\" and move to CodeView Right-click menu\n    - Restore Sigil's update checker that's been broken for a while\n    - Update sigil_bs4 prettyprint_xhtml and serialize_xhtml routines to use logic of code in GumboInterface\n    - Update sigil_bs4 to use numeric entities when faced with nbsp so they do not get lost later in Sigil\n    - Rename \"Sanity Check\" to \"Well-Formed Check EPUB\" and remove check icon people confused with FlightCrew\n    - Fix out of date error message referencing Tidy\n    - Coerce missing or bad doctypes to meet either epub2 or epub3 standard\n    - Inject empty title tag if missing from head\n    - Html escape Index entry text used to create index.html\n\n\nSigil 0.9.1\n    - Fix bug when template sgc_toc.css could be changed to blank on save, since no InitialLoad() was done\n    - Change order of TextResource m_IsLoaded and m_CacheInUse flags to minimize potential race exposure.\n    - Fix PluginRunner bug that introduced errors into xhtml files when both the content.opf and xhtml were modified\n    - Auto XML Decode and Escape Metadata entries created in the Metadata GUI\n    - Alter pluginhunspell.py so a missing libhunspell doesn't stop ALL plugins from working\n    - Default to using clean by gumbo vs prettyprint gumbo in new installs\n    - Fix prettyprint bug with trailing whitespace improperly inserted after inline tags inside div tags\n    - Fix for bundled interpreter packages PIL and cssutils on Mac OS X that were missing\n    - Fix for crash when using Find in BV on pages with no text, only images (issue #156)\n    - Added testplugin_v010.zip to docs to allow Linux packagers to test their plugin implementation\n    - Fix for prettyprint bug with tables (issue # 158)\n    - Fix for serialize in gumbo to limit injected returns\n    - Update to Sigil_Plugin_Framework_rev6.epub\n    - Make build order of sigilgumbo deterministic in order to help Linux packagers\n    - Make plugin launcher success and error messages robust to non-utf-8 strings\n    - Fix for crash bug when comments exist inside manifest of opf\n    - Fix for Sigil's gumbo - only inject end tags when current token does NOT need to be reprocessed\n\n\nSigil 0.9.0 Release\n    - Add \"Use Bundled Python\" option to bring sanity and choice to Python3 Interpreter selection\n    - Merge EmbeddedPython code across platforms and fix python flags for all platforms\n    - Properly build translation base.ts to prevent blank message fields being generated by tr()\n    - Allow PrettyPrint_Gumbo to condense whitespace where allowed\n    - In PluginRunner auto-repair modified xml (opf, ncx), do not check xml with xhtml wellformed check\n    - Fix bug in plugin epub3 interface, conversion of properties with null strings to None\n    - Restore ability to override hunspell dictionary locations on Linux with SIGIL_DICTIONARIES env var\n    - Restore ability to build Sigil against system hunspell libraries on Linux\n    - Adjust pluginhunspell.py to try to find system hunspell if bundled hunspell is not built/installed\n    - Fix hang/slowness in TOC creation when huge number of headings all exist in the same file\n    - Performance speedups for NCX writing to help with slow ToC Creation\n    - Bug fix for better detecting comments in sanitycheck.py\n    - Bug fix for Adding Blank xhtml files to an epub3\n    - Bug fix for Issue 140 - TOC gets cut-off under some platforms (lxml needs utf-8 not unicode)\n    - Add cmake option INSTALL_BUNDLED_DICTS to enable/disable installation of bundled hunspell dictionaries\n    - Allow SIGIL_DICTIONARIES env var to specify multiple paths (colon delimited)\n    - Fix bug in sanitycheck.py error message creation\n    - Identify woff files as fonts when importing epubs\n    - Fixes for nbsp being \"lost\" when linking in stylesheets and when splitting and merging chapters\n    - Fix for lost whitespace inside text holding tags when pretty printing\n    - Workaround for broken QShortCut in Qt 5.4.X see Issue 149\n    - Cleanup up some compiler warnigns\n\n\nSigil 0.8.901 Second in the pre-release series - primarily a bug fix release\n\n    Fixes\n    - fix for hang when trying to add a cover\n    - multiple fixes for segfaults in the TOC creation code\n    - fixes for blank TOC headings caused by tags nested inside of h1-h6 tags\n    - workaround for an instability caused by a compiler bug in Visual Studio 2013 on Windows\n    - fixes for multiple xml header declarations appearing when using sigil_bs4 prettyprint_xhtml() or serialzie_xhtml()\n    - build fixes to include MSVCR100.DLL for Windows machines that are too new to have it\n    - fix pretty printing using gumbo to support some mbp: tags\n    - fixes to deal with self-closing iframe tags which made gumbo stumble\n    - fixes to more robustly convert from QByteArray types to their char * pointers\n    - fixes and improvements to the Building on Linux instructions\n    - protect gumbo parsing with a mutex to prevent unknown issues with potential for non-reentrant code in that library\n    - workaround Qt QHash operator()= bugs that caused static QHash objects to freed multiple times\n    - fix for internal opf processing encoding detection being confused by xml header declarations\n         potentially resulting in missing spine and manifest items.\n\n    Features\n    - new launcher/wrapper code interface to support plugins that operate on epub3 ebooks\n    - added cssutils, cssselect, and chardet to the site-packages of the embedded Python 3.4 interpreter\n    - validation plugins that report no errors will now have \"No problems found\" appear in the Sigil Validation window.\n    - validation plugins will auto accept/close the plugin runner window no matter the results\n    - Windows installer now detects whether MS redistributable runtimes are already installed\n\n\n\nPrimarily Infrastructure Changes Toward Dual Epub2 / Epub3 support:\n\nSigil 0.8.900 (pre Sigil 0.9.0 series) \n    - Kill tidy and replace it with a combination of a specially modified Gumbo \n         parser that supports html5\n    - Kill Xerces and XercesExtras.\n    - Kill Boost, replace with C++ 11\n    - Kill unused bundles.\n    - Replace all \"undefined - behaviour\" use of \"Null\" References with proper \n         pointers across entire codebase to allow it to work with the latest \n         clang compilers\n    - Completely revamp the build process to embed the Python 3.4 Interpreter \n         inside of Sigil and integrate it in, including as site-packages:\n         [lxml, bs4, PIL, regex, six, html5lib].  This will allow plugins \n         that use the internal Python 3.X engine access to all of these \n         specialized packaes by default with no additional action\n         needed by end users of their plugin.\n    - Create our own version of BeautifulSoup4-4.4.0 called sigil_bs4 that \n         fixes lxml namespace bugs, fixes serialization/prettyprinting of \n         inline xhtml tags, and modifies the bs4 codebase so that a single \n         sourcecode works equally well on both Python 2.7 and Python 3.X\n    - Replace internal opf and ncx xml processing and cleaning with a \n         combination of embedded Python 3.4, sigil_bs4 / lxml\n    - Build hunspell as a shared library and then add a ctypes interface to allow\n         plugins to spellcheck\n    - Build our modified gumbo html5 parser as a shared library \n         and provide a bs4 ctypes interface to it for easy xhtml processing \n         in plugins that use Python 2.7 and Python 3.X\n    - Allow plugins to auto-fix \"text/html\" media-types to \"application/xhtml+xml\"\n    - Redesign the ebook source updates upon load process to use our modified \n         gumbo-parser\n    - Begin the transition to allow for both epub2 and epub3 editing \n         (Note: epub3 editing is still incomplete)\n    - Convert Flightcrew to become a Sigil plugin and replace it with\n         a simple and fast internal sanity checker.\n    - Update Hunspell dictionaries to be actual dictioanries and not word lists for en_US and en_GB\n    - Updated other dictionaries to their most current version to match what is used in LibreOffice 5\n    - Fix issue #54 modified date using local numerials when it should be\n         using Arabic numerals per the spec.\n    - Set the book to modified when font's are obfuscated.\n    - Change FORCE_BUNDLED_COPIES build flag to USE_SYSTEM_LIBS. This flips\n         the meaning of the flag. Now USE_SYSTEM_LIBS will enable using system\n         libraries. Also, SYSTEM_LIBS_REQUIRED was added which will fail the\n         cmake configure if any system libraries are not found instead of\n         falling back to the bundled copy. Finally, this makes the build more\n         consistent for Windows and OS X users.\n\nSigil 0.8.7 2015.06.14\n    - Update links\n    - Try to work around clang compiler issues with older C++ codebase\n\nSigil 0.8.6 2015.04.12\n    - Fix for crash during merging xhtml files.\n    - Changed fix for \"Create TOC crash in Sigil 0.8.5\" to reduce the degree\n      of disconnecting to prevent lost signals on html resources.\n    - Fix for missing audio and video mime types in OPFResource  and\n      FolderKeeper.\n    - Attempt to prevent Tidy from simply deleting all mathml during cleaning.\n\nSigil 0.8.5 2015.03.29\n    - Fix text resource not alwalys saving to disk.\n    - Fix bug in missing CSS.\n    - Fix create html toc crash bug.\n    - Update some links in the help menu.\n\nSigil 0.8.4 2015.02.01\n    - Fix for removeall plugins bug where all plugins would remove all plugins\n      regardless if the user clicked no instead of yes.\n\nSigil 0.8.3 2015.01.31\n    - 10.9.5 is now the minimum OS X version required. Only 10.10.1 has been tested.\n    - -DCODE_SIGN_ID=XYZ option has been added to auto sign the app bundle on OS X.\n    - Validation result plugins will auto close the Plugin Runner\n      Dialog since the dialog has no real info and openes the\n      validation pane with the results anyway.\n    - New Plugin Preferences Support added\n    - Plugins Manager will now remember last folder used\n    - Support for building both Linux .deb and .rpm packages\n    - Lots of Linux build support, compilation, installation, and \n      documentation improvements\n    - Qt 5.4 is now a minimum requirement.\n    - Build changes to support update to latest Qt 5.4.0 and to \n      use latest C++11 compiler\n    - Numerous bugs fixed or worked around including:\n       - Make Invocation of CSS W3C Online Validator more reliable\n       - Fix to make Preview Window update after BookView to prevent \n         memory corruption and crashes\n       - Workaround Qt bug (font cache assertion) when using \n         clearMemoryCaches() - see https://bugreports.qt.io/browse/QTBUG-43504\n       - Properly handle loadFinsihed Signal in BookViewPreview to \n         prevent clashes between BookView and Preview\n       - Fix for Sigil memory use after it was freed bug\n       - Workaround to the extent possible Qt bug with memory use after \n         free using QWebInspectors - see https://bugreports.qt.io/browse/QTBUG-43725\n       - Workaround to the extent possible Qt bug with memory use \n         after free when closing MainWindows - see https://bugreports.qt.io/browse/QTBUG-43692\n       - Bug fix to prevent crashes in KeyboardsShortcuts when accessing \n         Preferences with multiple MainWindows\n     \nSigil 0.8.2 2014.11.28\n    - Validator plugin type which can load validation results into\n      the main window validation panel.\n    - Corrections to Sigil Plugin Framework Documentation\n    - Pull request #17: Fix typos in README.md\n    - Additional python plugin interface features:\n       - multiple plugin engines now allowed for plugins that \n         work on both python 2.7 and python 3.4\n       - launcher revision date interface\n       - plugin stdout will now appear immediately in Sigil \n    - Multiple plugin launcher bug fixes:\n       - make parsing more robust to poorly formed xhtml\n       - modified text iterator to follow spine order\n       - bug fixes for readotherfile, and writeotherfile\n       - bug fixes for guide types and setting the guide\n\nSigil 0.8.1 2014.10.12\n    - Set minimum OS X version to 10.9.0 in Info.plist so users trying to\n      run on older versions of OS X will receive an error dialog instead of\n      a crash dialog.\n    - Set minimum Windows version to Vista in Installer so installation will\n      error when trying to install on XP (which is not supported and Sigil\n      binary packages won't run on).\n    - Fix issue #21: Use Hunspell WORDCHARS to help in tokenization of words.\n    - Pull request #19: Moving plugin description to ToolTips.\n    - Pull request #20: Preserve current file name for future save as actions\n      if appropriate.\n    - Fix bug where save after using input plugin would fail.\n\nSigil 0.8.0 2014.09.27\n    - Plugin framework.\n    - Add the svg image tag as an svg inline element (not a block element) and\n      add it as an empty element (TidyEmptyTags).\n    - Allow user defined list of entities to preserve.\n    - Pull request #16: Hardcode menu Plugins in UI, move it before menu Help.\n    - Pull request #10: Add ability to move entries in TOC up and down.\n    - Pull request #8: Allow pasting HTML as HTML or plain text in BookView.\n\nSigil 0.7.4 2013.10.27\n    - Use numeric entity for non-breaking spaces (nbsp) instead of named\n      entity. Fixes issues where files without a doctype won't open properly.\n\nSigil 0.7.3 2013.08.03\n    - Fix issue 2309: Compile failure due to case issue on m_lastFolderOpen.\n    - Fix issue 2269: \"Conflicts with:\" always in English.\n    - Fix issue 2186: Sigil 0.7.2 crashes on \"Add existing files\".\n    - Fix issue 2232: The nbsp characters in UTF-8 files are converted to normal spaces.\n    - Fix issue 2201: Save does not prompt for filename if filename not set\n      after cancelling save operation.\n    - Fix issue 2193: Incorrect country code used for Serbia.\n    - Implement issue 2199: Mac, Don't open empty book by default.\n\nSigil 0.7.2 2013.04.14\n    - Implement issue 2129: Enhance archive filename encoding handling.\n    - Implement issue 2128: Warnings for non-ASCII characters in filenames.\n    - Implement issue 2113: Preview should zoom separately from other views.\n    - Implement issue 1997: Tool to Add Cover image and file automatically.\n    - Implement issue 1993: Find & Replace should have a Marked Text option.\n    - Implement issue 2083: Enhance invalid OPF recovery.\n    - Implement issue 2082: Improve performance of Book Browser refresh.\n    - Fix issue 2170: Spellcheck should remember position after changing word.\n    - Fix issue 2148: Don't delete cover image in \"Delete unused media files\".\n    - Fix issue 2147: Doubleclick in Delete Files dialog can cause crash.\n    - Fix issue 2143: Bulk rename with just a number for filename does not use correct number of 0s.\n    - Fix issue 2121: Wait cursor shows when dialog is open while saving or opening.\n    - Fix issue 2107: Heading not accepted due to split at end of file.\n    - Fix issue 2110: Insert Special Character inserts wrong code for nnbsp.\n    - Fix issue 2021: Importing UTF-16 encoded files results in empty file.\n    - Fix issue 2088: Ctrl-click on text files does not work in Code View.\n    - Fix Issue 2071: Anchor dialog has disabled text field.\n    - Fix Issue 2077: Rename dialog incorrectly sized.\n    - Fix issue 2081: Book Browser tooltips are not updated when semantics change or for cover images.\n    - Fix issue 2080: OPF meta title not updated correctly for Add Semantic.\n    - Fix issue 2079: UI Language dropdown does not show language names for entries containing _.\n\nSigil 0.7.1 2013.03.03\n    - Implement issue 2058: Code View should be able to show resizable image.\n    - Implement issue 2038: Spellcheck \"change selected word to\" should remember sorting order.\n    - Implement issue 2043: Spellcheck should allow case-insensitive sorting.\n    - Implement issue 2029: Save and open should warn if HTML files are not well formed.\n    - Implement issue 2009: Add semantic tags to filenames in reports.\n    - Implement issue 2028: Special characters should work in non-html files.\n    - Implement issue 2027: Upgrade Boost to Boost 1.53.0.\n    - Fix issue 2069: Work around for archives where filenames are not utf-8 encoded.\n    - Fix issue 2068: ZIP general purpose bit 11 (utf-8) filename not set.\n    - Fix issue 2061: Language code using wrong character to separate country code.\n    - Fix issue 2057: Text selected across lines using Ctrl-F cannot be found with Find.\n    - Fix issue 2036: Mark for Index can insert HTML tags into code making it invalid.\n    - Fix issue 2041: Preview does not sync cursor after using Sigil for a while.\n    - Fix issue 2030: The &#160; character is incorrectly converted to space on open.\n    - Fix issue 2035: Index Editor entries with nbsp character don't match text.\n    - Fix issue 2016: Find with wrap off and All HTML Files still wraps on last file.\n    - Fix issue 2001: Spellcheck does not always highlight a word the first time.\n    - Fix issue 2017: Clips pasted into some windows does not work correctly.\n    - Fix issue 2008: Index adds extra comma in some cases.\n\nSigil 0.7.0 2013.02.17\n    - Implement issue 1983: Set the tooltips of files in Book Browser to the filename.\n    - Implement issue 1965: Allow opening files that are missing container.xml.\n    - Implement issue 1975: HTML TOC and Index should use CSS files instead of inline stylesheet.\n    - Implement issue 1968: Bookmark location in editing window.\n    - Implement issue 1963: Table Of Contents window should default to expanded when opened or refreshed.\n    - Implement issue 1953: Allow entering a list of new words into dictionary preferences.\n    - Implement issue 1952: Add shortcut for Copy HTML file.\n    - Implement issue 1951: Doubleclick on Image Report file should find next use of image.\n    - Implement issue 1949: Add support for multiple active user dictionaries.\n    - Implement issue 1947: Spellcheck dialog to manage all misspelled words at once.\n    - Implement issue 62: Add document's css styles to menu.\n    - Implement issue 1945: Allow editing of CSS while displaying page.\n    - Implement issue 1661: Report list of all different characters in the book.\n    - Implement issue 1746: Add Report for Links and Footnotes.\n    - Implement issue 1941: Add Find & Replace option to wrap or not wrap searches.\n    - Implement issue 1940: Update Insert Image to Insert File to support insert of audio/video.\n    - Implement issue 1938: Update Delete Image files to Delete Media files to include audio/video.\n    - Implement issue 1937: Add Report for All Files.\n    - Implement issue 1936: Add Clip Bar toolbar with buttons for Clips and shortcuts for Clips.\n    - Implement issue 1931: Change to QRegularExpression for most regexes.\n    - Implement issue 1185: Edit Table of Contents without needing Generate TOC.\n    - Implement issue 1929: Add support for playing audio and video files.\n    - Implement issue 917: Sigil should support audio and video tags.\n    - Implement issue 1928: Add well-formed check to HTML File Report.\n    - Implement issue 1864: Allow Metadata Editor dialog to stay open while editing.\n    - Implement issue 1871: Code View context menu should show clips even if word is misspelled.\n    - Implement issue 1870: Saved Searches should use mode settings from Find & Replace.\n    - Implement issue 1927: Add support for basic replacement Clips (e.g. span) in Book View.\n    - Implement issue 20: Embedded fonts support.\n    - Implement issue 1926: Upgrade to Qt5.\n    - Implement issue 1924: Add dockable Clips window to select clips.\n    - Implement issue 1925: Don't force well formed checks unless absolutely necessary.\n    - Implement issue 1843: Preview should be real-time display of Code View.\n    - Fix issue 1989: Problem with nested index entries.\n    - Fix issue 1964: Correcting a word using spellcheck does not make file go to \"not saved\" state.\n    - Fix issue 1961: Generate TOC should not create IDs for headings when it only points to filenames.\n    - Fix issue 1857: CSS Highlighting inline styles inconsistent.\n    - Fix issue 1946: Highlight misspelled words checkbox should be available in Preferences.\n    - Fix issue 1943: Reports can crash if file has non well-formed xml.\n    - Fix issue 1883: TOC window does not jump to right location for some entries.\n    - Fix issue 1906: \"Delete unused image files\" deleting background images.\n    - Fix issue 1874: Using Delete Unused Stylesheet Classes deletes pseudo-elements.\n    - Fix issue 1939: CSS parser does not match wildcard selectors consistently.\n    - Fix issue 1935: Improve speed of Index Editor autofill by removing progress dialog.\n    - Fix issue 1891: Opening the Saved Searches expands all groups.\n    - Fix issue 1934: Go To Style does not work with CSS filenames that have spaces in them.\n    - Fix issue 1933: No message is displayed if Go To Style can't find a style.\n    - Fix issue 1932: Replace All needs to be run twice in some cases.\n    - Fix issue 1930: Fix Metadata language dropdown selection incorrect matching.\n    - Fix issue 1775: Sigil-0.6.0 edit very slow with Thai e-Pub.\n    - Fix issue 1764: Sigil crashes on KDE after rearranging text sections.\n    - Fix issue 1720: Book View highlights text apparently randomly.\n    - Fix issue 1923: CSS validation should use EPUB 2 profile.\n    - Fix issue 1922: Invalid EPUB warning dialog is not long enough.\n    - Fix issue 1918: Support import of tab separated entries for Index Editor.\n    - Fix issue 1917: Keep selection when deleting unused images if an HTML file was selected.\n    - Fix issue 1916: Allow Go To Style to work for link type text/x-oeb1-css.\n    - Fix issue 1869: Backspace in Preferences - Shortcuts causes crash.\n    - Fix issue 1818: Hyperlink of URL with & causes invalid code.\n    - Fix issue 1824: Cursor position changes when saving the book.\n\nSigil 0.6.2 2012.12.06\n    - Fix issue 1834: Pretty Print should be removed due to formatting issues.\n    - Fix issue 1821: Audio files missing.\n    - Fix issue 1816: Height is incorrect in Reports->Image Files.\n    - Fix issue 1809: Fix crash related to cursor syncing.\n    - Fix issue 1808: Editing in book view changes DTD to incorrect value.\n\nSigil 0.6.1 2012.12.02\n    - Implement issue 1801: Audio and Video tags and files should be supported by Sigil.\n    - Implement issue 1797: Clean Source should have preference options to set when it should run.\n    - Implement issue 1768: Add non-destructive pretty printer as an option in addition to the Tidy provided one.\n    - Implement issue 1770: Change Clean Source to no longer warn about restarting Sigil.\n    - Implement issue 1767: Change default file extension from html to xhtml.\n    - Implement issue 1695: Add tooltips to show counts of files in Book Browser and headings in Generate TOC.\n    - Implement issue 1731: Delete files, Unused Images and Styles dialog should be scrollable and allow unselecting entries.\n    - Implement issue 1735: Print stylesheets and other non-HTML files.\n    - Implement issue 1758: Handle importing invalid files with duplicate IDs in OPF file.\n    - Implement issue 1711: Reports should allow saving to comma separated text file.\n    - Implement issue 1712: Reports should be non-modal and allow editing book while still open.\n    - Implement issue 1748: Add a Copy Image context menu option for images.\n    - Implement issue 1738: Move Generate Table of Contents button to toolbar.\n    - Implement issue 1743: Insert Image should include an alt tag with filename.\n    - Implement issue 1717: Allow more control of Author field in Metadata Editor.\n    - Implement issue 1729: Bulk rename should allow changing file extension.\n    - Implement issue 1728: Open/add invalid HTML files should show line numbers of error.\n    - Implement issue 1742: Add context menu option in Preview View for Inspect Element.\n    - Implement issue 1734: Splitting files and new blank HTML files should use existing file extension.\n    - Implement issue 1732: Index Editor should support opening/importing .txt files.\n    - Implement issue 1687: Insert ID should warn if invalid ID names are used.\n    - Fix issue 1791: All &nbsp; are replaced by normal space when switching from Book View to Code View.\n    - Fix issue 1798: Files, *-tmp.epub, are left in /tmp/Sigil/scratchpad after closing Sigil.\n    - Fix issue 1785: Split at Cursor in Book View does not always update href links.\n    - Fix issue 1759: Zipped files get wrong date and time.\n    - Fix issue 1757: Spellcheck does not handle one letter misspellings properly.\n    - Fix issue 1750: Loading HTML file should not automatically generate TOC.\n    - Fix issue 1749: Right click on SVG images should give same options as other images.\n    - Fix issue 1730: Changing view or using back button should select file in Book Browser.\n    - Fix issue 1726: Selecting all text and replacing with a Clip causes crash.\n    - Fix issue 1707: Application may crash when editing files externally.\n    - Fix issue 1733: Files edited with Open With are not always updated when externally saved.\n    - Fix issue 1704: Language dropdown entries have blank entries.\n    - Fix issue 1740: When dockable windows are stacked the program can give error on close.\n\nSigil 0.6.0 2012.10.27\n    - Implement issue 1664: Improve performance of opening and changing tabs.\n    - Implement issue 1665: Attempt to recover EPUB if it is missing an ncx file.\n    - Implement issue 1643: Change Clean Source default to Pretty Print instead of Tidy.\n    - Implement issue 1636: Add shift-click Replace for Replace Current - replace but not find next match.\n    - Implement issue 1638: Improve performance of Generate TOC.\n    - Implement issue 1637: Provide more friendly handling of bad EPUBs by not crashing after showing warning.\n    - Implement issue 1629: Localization of title in contentx.opf semantics.\n    - Implement issue 1622: Allow Font Obfuscation to work for multiple font files.\n    - Implement issue 1620: Well-formed check option should be removed and replaced with more appropriate automatic checking.\n    - Implement issue 1617: Split should split at cursor position not at end of paragraph.\n    - Implement issue 1619: Generate TOC should show tooltip details for the heading in case title and text is blank.\n    - Implement issue 1618: Generate TOC should allow changing heading levels in document and TOC.\n    - Implement issue 1615: Generate TOC should number sigil_toc_id's across all files and delete unused id's before generating.\n    - Implement issue 1612: Improve performance of merging files.\n    - Implement issue 1611: Improve performance of switching and closing tabs.\n    - Implement issue 1610: Use html instead of xhtml as the default extension for new blank HTML files.\n    - Implement issue 1606: Allow rename of titles in Generate Table Of Contents and show filenames in tooltip.\n    - Implement issue 1601: Delete unused Images.\n    - Implement issue 1602: Delete unused Styles.\n    - Implement issue 1603: Allow formatting buttons to work in Code View.\n    - Implement issue 1600: Option to delete one line in Code View without selecting text.\n    - Implement issue 1597: Show HTML tag information for current location in text while in Book View.\n    - Implement issue 1594: Allow miscellaneous text files to be edited and others to be opened externally.\n    - Implement issue 1590: Insert image should allow insert from disk.\n    - Implement issue 1557: Sigil requires Qt 4.8 or above.\n    - Implement issue 1586: Spellcheck should allow setting a keyboard shortcut for Ignore Word to speed editing.\n    - Implement issue 1585: Spellcheck should have a menu entry to clear all ignored words.\n    - Implement issue 1584: Sigil should allow CSS file to be edited while viewing HTML.\n    - Implement issue 1583: Sigil should remember the current view state when it restarts.\n    - Implement issue 1573: Improve performance of bulk rename.\n    - Implement issue 1468: Allow images to be opened externally.\n    - Implement issue 1571: Display whether classes are used in the HTML or CSS files in a new Reports dialog.\n    - Implement issue 1572: Add feature to re-format CSS files\n    - Implement issue 1567: Remove XPGT support.\n    - Implement issue 755: Support 'code view' for svg images that are loaded as separate files.\n    - Implement issue 1561: Add Save A Copy option to save file under a different name without renaming current file.\n    - Implement issue 1559: Add option to insert special characters into document.\n    - Implement issue 1333: Add Hyperlink editor buttons to select target from existing ids and set id anchor.\n    - Implement issue 401: Add edit buttons for Uppercase, Lowercase, Propercase, Capitization.\n    - Implement issue 985: Sigil fonts should be configurable in Preferences.\n    - Implement issue 1248: Code View/CSS should allow colors to be configurable in Preferences.\n    - Implement issue 1153: Highlighted Text in Code view Difficult/Impossible to see.\n    - Implement issue 1511: Prompt to replace an image when adding an image that already exists in the book.\n    - Implement issue 1542: Add a Go to Style option to jump to the CSS class used by a tag.\n    - Implement issue 1541: Heading styles should optionally remove/keep attributes in tags.\n    - Implement issue 1540: Add option to tokenise spaces and numbers in F&R find text.\n    - Implement issue 1539: Regex should support options for minimal matching, dot includes newlines.\n    - Implement issue 1535: Add Clipboard History to automatically saved recent cut or copied text.\n    - Implement issue 1534: Option to toggle Book View or Preview View to Code View and vice versa.\n    - Implement issue 1528: Shortcut preferences should be simplified.\n    - Implement issue 1536: Split at Chapter Markers should split all files.\n    - Implement issue 1530: The heading dropdown should be changed to buttons for quicker selection.\n    - Implement issue 1529: Code View should support heading/formatting buttons as used in Book View.\n    - Implement issue 73: External HTML links should be usable but evoke warning dialog.\n    - Implement issue 1521: Tab headers right click to close other tabs, toggle view state.\n    - Implement issue 715: Search Editor for saving and executing Find & Replaces searches.\n    - Implement issue 588: Clip Editor for saving and inserting text.\n    - Implement issue 1519: Open and go back to links in Code View and Book View.\n    - Implement issue 167: Index Editor to create a book index.\n    - Implement issue 1450: View classes used in HTML files.\n    - Implement issue 102: View details of all HTML files.\n    - Implement issue 839: Word Count (in View HTML details).\n    - Implement issue 1392: View details of all images.\n    - Implement issue 1513: Add progress indicators to various functions.\n    - Implement issue 1510: Add Existing Files should only open last file not all files.\n    - Implement issue 1428: Find&Replace should allow Ctrl/Shift key modifiers to set what to search.\n    - Implement issue 1325: Insert Images support for multiple images, resizing, thumbnails.\n    - Implement issue 31: Automatically set \"date of modification\" on save.\n    - Implement issue 1508: Allow export/saving of individual files.\n    - Implement issue 1367: Shortcut key to remove code tags from selected text.\n    - Implement issue 761: Shortcut key to close last open tag (Code View).\n    - Implement issue 1507: Metadata dialogs should allow double click to select.\n    - Implement issue 1457: Save should not add heading ids - already done in Generate TOC.\n    - Implement issue 1444: Sigil should not include .txt or .html in file associations during install.\n    - Implement issue 1443: Find&Replace should save state on restart.\n    - Implement issue 1416: Don't add selected text to F&R history and increase selected\n      text limit for being auto loaded into F&R.\n    - Implement issue 1414: Cover semantic should not be added automatically.\n    - Implement issue 1405: Cleared shortcut reset to default after restart.\n    - Implement issue 1407: Tidy should allow more fine-grained control.\n    - Implement issue 1393: Add Semantics Text should only apply to one file.\n    - Implement issue 1369: Add support for \\xDD as Regex replacement in F&R.\n    - Implement issue 1285: Display image properties.\n    - Implement issue 534: Link to Stylesheets option for HTML files.\n    - Implement issue 1385: Metadata editor should always display fields\n    - Implement issue 1311: Metadata support for all RfC 639-2 languages.\n    - Implement issue 1335: Run Save As automatically if saving new html file.\n    - Implement issue 1366: TOC window tree support for collapse/expand all.\n    - Implement issue 759: Auto generate inline TOC HTML file.\n    - Implement issue 32: Metadata custom \"date\" options.\n    - Implement issue 33: Metadata options for creators and contributors.\n    - Implement issue 1374: Split View is now Preview View with code inspector.\n    - Implement issue 184: Superscript/subscript buttons.\n    - Implement issue 443: Book View RTL languages support (right to left rtl tag).\n    - Implement issue 504: Book View button for normal paragraph.\n    - Implement issue 1265: Preference to manually set UI language.\n    - Implement issue 1295: Metadata Editor support for translating descriptions.\n    - Implement issue 77: Metadata support for multiple language elements.\n    - Implement issue 1180: Spell Check button/menu to find next misspelled word.\n    - Implement issue 1045: Better highlighting of misspelled words.\n    - Implement issue 1301: Preferences for User and Additional Dictionary locations.\n    - Implement issue 1058: Use ini format for settings on all platforms.\n    - Implement issue 1376: Change organization name and location of settings to sigil-ebook.\n    - Implement issue 1381: Switch to using Minizip for 1.1 for ZIP support. \n      - Remove ZipArchive and Zipios++.\n    - Implement issue 1380: Update zlib to 1.2.7.\n    - Implement issue 1383: Remove the use of a precompiled header.\n    - Implement issue 1377: Update PCRE to 8.31.\n      - Make PCRE 8.31 with UTF-16 support the minimum required version.\n      - Bundled PCRE uses PCRE's JIT for faster searching.\n      - Modify Regex search code to use UTF-16 instead of UTF-8 for all\n        searches. This brings search in line with the view components\n        being able to display UTF-16 characters.\n    - Implement issue 1378: Update Hunspell to 1.3.2.\n    - Implement issue 1379: Update Boost to Boost 1.49.0.\n    - Implement issue 1283: Spell check should have an ignore option.\n    - Fix issue 1694: User dictionary shows duplicate entries and doesn't scroll to new entry when adding.\n    - Fix issue 1693: Words in user dictionary could be lost if blank entries are saved.\n    - Fix issue 1692: Code View highlighting incorrectly hides spelling issues if an & is used.\n    - Fix issue 1674: Batch rename changes filename extension.\n    - Fix issue 1663: Generate TOC gives heading ids for items not in the TOC.\n    - Fix issue 1642: Replace sometimes leaves a \\1 in the text.\n    - Fix issue 1635: Replace can replace too much text if manual selection includes extra text.\n    - Fix issue 1639: Ensure Spellcheck treats single quotes as word boundary appropriately.\n    - Fix issue 1624: Do not close Sigil if an invalid HTML file was added.\n    - Fix issue 1623: Do not leave Sigil in an invalid state if an invalid book was opened.\n    - Fix issue 1605: Sigil cannot read epubs missing mimetypes as first file since container.xml might not be found.\n    - Fix issue 1621: Change sigilNotInTOC to sigil_not_in_toc for consistency but still recognize legacy value in old files.\n    - Fix issue 1477: Sigil may crash when loading ePubs containing empty (zero-sized) files.\n    - Fix issue 1589: Clicking on TOC entry the first time does not scroll to a heading at the top of the page.\n    - Fix issue 1582: Replace All should be single-threaded to avoid certain crashes.\n    - Fix issue 1581: Caret position in Book View - Code View syncing is not always correct.\n    - Fix issue 1580: Chapter split starts new files with suffix _002 instead of 001.\n    - Fix issue 1579: Generate Headings in TOC should select next item after unchecking an item.\n    - Fix issue 1563: Split Chapter break can create empty page.\n    - Fix issue 1284: Image and Stylesheet paths not updated for duplicate references when importing.\n    - Fix issue 1155: Filename removed from href in anchor tag when importing HTML.\n    - Fix issue 1553: Rename of one html file should keep file selected, allow rename shortcut, link stylesheets.\n    - Fix issue 1551: Generate TOC include column scrolls offscreen when headings are long.\n    - Fix issue 1550: Table of Contents window is not emptied if all TOC entries deleted manually.\n    - Fix issue 1549: Sigil should not modify source by converting shy/ndash/mdash to entities automatically.\n    - Fix issue 1345: Adding accented words dictionary doesn't work.\n    - Fix issue 1546: Find&Replace loses focus when changing tabs or going from Book to Code View.\n    - Fix issue 425: Shift+ PgUp/PgDn does not work in text editor.\n    - Fix issue 1390: Image is not updated until restart if deleted and re-added.\n    - Fix issue 1413: Crashes when opening a particular epub.\n    - Fix issue 1543: Tabs should only do updates when finished loading to improve performance.\n    - Fix issue 1395: A type of hyphen, when pasted in code view, crashes Sigil.\n    - Fix issue 1429: Changes to stylesheets are not seen in book and preview views.\n    - Fix issue 1406: Typing spaces on a word highlighted by spelling crashes Sigil.\n    - Fix issue 1524: Replace \\s does not always match newlines.\n    - Fix issue 1538: Sigil can save a corrupted epub file if zip fails.\n    - Fix issue 1517: Delete selected file should not open another file unnecessarily.\n    - Fix issue 1474: New lines added in every xhtml file after saving.\n    - Fix issue 1486: Replace replaces even if text doesn't match if manually changed.\n    - Fix issue 1483: Add Existing Files adds HTML files in reverse order.\n    - Fix issue 1479: F&R auto-completer preventing searching for same word different case.\n    - Fix issue 1424: Spell check does not allow paste next to misspelled word.\n    - Fix issue 1422: Delete file should not update tab if opened file is not deleted.\n    - Fix issue 1417: OPF meta tags not updated if Cover image renamed or deleted.\n    - Fix issue 1408: Book Browser should not translate folder names.\n    - Fix issue 1308: Allow renaming file extensions.\n    - Fix issue 1363: Open and Save file directory inconsistent.\n    - Fix issue 1130: Content.opf edits overwritten by save.\n    - Fix issue 1354: Chapter Split breaks links in second half of document.\n    - Fix issue 999: Split does not update file references in TOC.\n    - Fix issue 1277: Meta-editor will not open.\n    - Fix issue 1281: Semantics information retained for deleted files.\n    - Fix issue 1338: F&R Replace All can crash using current file with large replaces.\n    - Fix issue 1296: F&R Search All crashes if HTML file doesn't have focus.\n    - Fix issue 1382: Settings not saving to disk.\n    - Fix issue 1272: Tabs should always use the View state set by the View buttons.\n\nSigil 0.5.3 2012.02.25\n    - Fix issue 1254: Bulk rename will stop if one name matches, context menu\n      needs cleanup and warnings.\n    - Fix issue 1268: Find/Replace all files does not search in book order,\n      and other issues.\n    - Fix issue 1266: Store user dictionary as UTF-8.\n    - Ensure the checkmarks in add semantic are set correctly when selecting\n      multiple files.\n    - Fix issue 1030: Don't close if canceling out of a failed save.\n    - Fix issue 1258: Find/Replace step by step in All HTML files is broken.\n\nSigil 0.5.2 2012.02.09\n    - Fix issue 1253: Replace All in All HTML files adds extra blank lines in\n      style section.\n    - Fix issue 1251: Merge does not work if you previously used split chapter.\n    - Fix issue 1249: Replace All in All HTML Files leaves cursor at the\n      bottom.\n    - Fix issue 1247: Cannot rename file extension in book browser and rename\n      selected should default to first extension name.\n    - Fix issue 1238: Deleting a file does not go to the next closest entry\n      in book browser.\n    - Fix issue 1236: Replace All in Current file does not center cursor.\n    - Fix issue 1234: Switching from Code View to Split View and SplitCV to\n      CV does not vertically center the cursor.\n    - Fix issue 1237: Rename does not keep current selection in book browser.\n    - Fix issue 1242: Metadata::FreeFormMetadata missing assignment line 360.\n    - Fix issue 1235: Deleting one file does not give a warning dialog.\n    - Fix issue 1129: Crash when importing existing image.\n\nSigil 0.5.1 2012.02.05\n    - Issue 1225:\n      * Add searching selected files.\n      * Add search wrapping.\n      * Replace in BV automatically goes to CV.\n      * Fixed bug where in CV if you do a replace of a word and then replace\n        all when there are the same words on the page, the page view wouldn't\n        be refreshed.\n      * Various fixes.\n    - Add English translation file used for plural strings.\n    - Implement issue 986: Automatically renumber playorder in TOC NCX.\n    - Implement issue 1224: F&R modifications to update layout and add Regex Multiline.\n    - Fix issue 1214: Dictionary files do not include hypen files or GB files.\n    - Fix issue 1213: Find and Replace does not save file when F&R is already\n      open and searching all HTML files.\n    - Remove the ability to use F&R to replace text in BV as it is unfixable in\n      its current state.\n    - Fix issue 1215: Book View line/column incorrect in status bar.\n    - Fix issue 1216: Re-opening a document already in a tab resets the cursor\n      position back to the top.\n    - Fix issue 1218: F&R cleanup.\n    - Fix issue 1212: Remove opf namespace rewriting when opening a file because\n      it ended up being more trouble than it was wroth.\n    - Fix issue 1188: New Sigil Regex engine crashes when pressing \"replace all\",\n      works fine on pushing \"replace\" over and over and over again.\n    - Implement issue 269: Select more than one item in the Book Browser Column.\n    - Implement issues 792: Add Shortcuts for next/previous HTML file with regard\n      to reading order, and sync selection in book browser to open tab.\n    - Implement issue 1135: New blank section must be automatically selected on book browser.\n    - Implement issue 1148: Allow user to change the order of split view so book view or code\n      view is first.\n    - Implement issue 1168: Add ability to sort HTML files alphanumerically.\n    - Implement issue 1174: Add new blank html section should insert section after selected file.\n    - Implement issue 1181: Merge Previous when previous file is open in current tab requires\n      refresh to see merged data.\n\nSigil 0.5.0 2012.01.21\n    - Implement issue 533 and 1079: allow user to select which level(s) of <h> to include.\n    - Fix issue 788: Error saving when the folder the file was in was renamed\n      outside Sigil.\n    - Fix issue 998: Don't select file extension on rename in book browser.\n    - Fix issue 1111: Failure to rename to same name with case change.\n    - Implement issue 205: Drag and drop for images to book and code views.\n    - Fix issue 1019: issues with opf-namespace declaration.\n    - Inline spell check with right click replace in Code View.\n    - Fix issue 1064: Issues with editing epubs with differing html extensions.\n      Take mimetype into account when opening the file to help determine how to\n      deal with the file.\n    - Fix issue 1055, 1038, 1006: Focus switching causes unwanted cursor jumping\n      in split view. Don't auto sync cursor position between views.\n    - Implement issue 375: Add image selection dialog for inserting existing\n      images into book and code views.\n    - Add menu items for setting heading, adding new items, show / hide toolbars.\n    - Organize menu.\n    - Fix issue 803: Print prints immediately, no dialog box.\n    - Implement 245: Unify zoom levels (book, text, image) and store the levels.\n    - i18n capability. Build and load translation files.\n    - Add keyboard shortcut manager so user can change the keyboard shortcuts. Fixes 966.\n    - Add preference dialog. Closes 206, 718.\n    - Refactor Find & Replace into a widget that appears below the editor. Closes issues:\n      961, 579.\n    - Windows Installer: Add Sigil as a handler for EPUB and HTML files so that jump lists\n      will work and it will always show up on the 'Open With...' menu.\n    - Fix issue 1033, 1034: Implement scroll to fragment for Code View and fix scrolling for\n      book view.\n    - Fix issue 1032: Remove '=' from the list of valid characters for ids.\n    - Fix issue 1001: Valid IDs are now formed by replacing invalid characters with\n      underscores. Colon removed from the list of valid characters.\n    - Fix issue 1014: Sigil was erroneously assuming that fragment ids would be unique\n      across the entire book, whereas they're only required to be unique within a\n      particular xhtml document. New code implemented to cover those situations where\n      this assumption is wrong.\n    - Fix issue 1015: Fix issues with cursor positioning in Split View.\n    - Fix issue 1022: Added support for Adobe's page-map.xml pagination extension. (Must\n      use this exact filename).\n    - Implement issue 183: Use a PCRE regular expression engine instead of QRegExp.\n      Also fixes issue 498: regex '^' (start of line) broken.\n    - Implement issue 168: Allow selection of multiple Meta Editor properties.\n    - Allow for deleting multiple metadata items.\n    - Implement issue 368: Pressing enter key on item in book browser should open item.\n    - Fix issue 1005: Regression from change to ensure metdata element has dc namespace.\n\nSigil v0.4.2 2011.09.02\n    - Fix issue 993: Split then selection jumps back to top instead of selection point.\n    - Fix issue 988: fail to scroll properly after chapter split.\n    - Allow users to disable Well-Formed checks or if they should be auto fixed as they\n      were in 0.3.x.\n    - Don't read use tidy setting from disk each time it's checked. Store the setting and\n      save / load it upon edit and startup. This prevents Sigil from using the wrong value\n      when multiple instances are open.\n    - Use Pretty Print when auto fixing well formed errors.\n    - Added a safety check to LoadTabContent() to ensure that focus changes don't cause a\n      loss of non-well-formed data that has been entered but not saved.\n    - Fix an issue where the opf namespace is being written in individual elements in the metadata\n      section in the OPF. We're now going to clean and write the dc and opf namespaces directly\n      to the metadata element when loading an OPF to ensure they're present and correct.\n    - Fix for entities not being displayed when loading a file where they are saved as unicode\n      in the file itself.\n    - Fix for typo in code to preserve entities.\n    - Fix for path encoding issue on reconstructing the opf.\n\nSigil v0.4.1 2011.08.26\n    - Fix issue 615: implement undo for Find/Replace in Book View.\n    - Update Toc section of manual for 0.4 Toc panel.\n    - Implement issue 80: Select lines when clicking on line number in line number area in\n      code view.\n    - Fix issue 770: Incorrect file permissions for some files in archive create on OS X.\n    - Fix issue 890: Line number mismatch between Code View and Validation Results when\n      style tag in head section contains CDATA. CDATA was being stripped from the Code View.\n    - Fix issue 942: Work around for the Nook not being able to deal with cover meta element having\n      attributes in alphabetic order.\n    - Fix issue 976: Creation of new Code View tab fails to show all content if the web page's \n      asynchronous loading is delayed.\n    - Fix an issue where the line numbers in code view were not aligned to the line they represent.\n    - Fix issue 871: Update heading combo when putting cursor on block with heading style.\n    - Fix the formation of an empty paragraph at the top of the new file on doing a chapter split\n      in Book View.\n    - Fix issue 967: toc.ncx file keeps erasing manual input.\n    - Fix issues 657, 661, 694 and 867: The Heading Selector in Book View will now function as\n      expected and find the correct block-level tag to change rather than attempting to change\n      inline tags. It will also retain the attributes (including class) of the old tag.\n    - Fix the entity display for shy, mdash and ndash.\n    - Set modified state on book when page order is changed.\n    - Fixed the cursor issues on moving from Book to Code View and vice-versa. The new view should\n      now always gain keyboard focus and show the cursor properly.\n    - Insert the xml tag explicitly so that Tidy doesn't insert one without encoding and standalone\n      attributes.\n    - Fix issue #877: Invalid xml error prevents Find/Replace window from opening.\n    - Fix issue where switching between code and book view causes the code view to load old data\n      from book view.\n    - Implement issue 364: Go to line #.\n    - Implement issue 742: Shortcut/menu action to close all tabs except the current one.\n    - Fix issue 959: Original creator's name is mangled in About dialog.\n    - Fix for chapter splitting issue involving filenames with spaces.\n    - Makes sure the cursor is properly displayed on entering Code View.\n\nSigil v0.4.0 2011.08.15\n    - Fix issue 650: Convert SVG prefixes into a form that Tidy will tolerate.\n    - Fix issue 952: Allow compatible extension changes.\n    - Fix issue 835: File, Close shortcut does not work on OS X due to shortcut conflict.\n    - Fix issue 793: Don't delete com.apple.ibooks.display-options.xml.\n    - Fix issue 319: Adding chapter break in code view at end of current chapter creates new\n      chapter before the current one.\n    - Fix issue 947: Normalise headings before automatically generating the TOC.\n    - Build system changes to accomidate the Windows SDK.\n    - Remove empty styles on body tags when cleaning webkit junk.\n    - Fix  issue 549 : Split on SGF Chapter Markers puts new files (sections) at end of file list.\n    - Fix issue 869: Right-click in Code View with error in code shows error dialog.\n    - Fix issue 919 and issue 316: Replace potentially problematic characters with named or\n      numerical entities.\n    - Change About to include an authors section.\n    - Fixed and issue where chapter splitting loses some chapters, places others in wrong order\n      (issue 836).\n    - Fixed an issue where language was not being properly detected (issue 923).\n    - Fixed an issue where font mangling caused file duplication (issue 932).\n    - Fixed an issue where extra blank lines were left in the STYLE section (issue 937).\n    - Fixed an issue where FlightCrew was reporting erroneous Resource is reachable but not present\n      in OPF errors (issue 813).\n    - Fixed string format compile warnings (issue 892).\n    - Fixed GCC 4.6 compile failure (issue 864).\n    - Changed Save As shortcut key to Ctrl+Shift+S (issue 838).\n    - Fixed an issue where the shortcut keys were not working properly on OS X (issue 838).\n    - Fixed an issue where metadata changed in metadata editor unsaved if Sigil closed right after\n      (issue 930).\n    - OS X minimum version bumped to 10.6.\n    - on Linux machines, the installer now places a shortcut to Sigil in the Applications->Office\n    menu instead of in a special \"Sigil\" folder under the Gnome root menu (issue #162)\n\nSigil v0.4.0 RC1 2011.04.22.\n    - fixed an issue with splitting on SGF chapter markers creating the new HTML files in the wrong\n    order (issue #828)\n    - fixed a rare crash/memory corruption issue with automatic OPF updates\n    - made the CSS resource path updates faster and more robust\n    - updated FlightCrew so that CSS resource use is now far more robustly detected (issue #822)\n    - fixed a rare hang when opening the Meta Editor on Win XP machines\n    - a more accurate error message is now displayed for problems with file loading/saving\n    (issue #772)\n    - fixed an issue with incorrect font filepath updates in the CSS (issue #736)\n    - fixed an issue with paths in the OPF not being URL-encoded (issue #823) \n\nSigil v0.4.0 3 2011.03.24\n    - added a workaround for loading broken epub files that use the incorrect mimetype for the \n    NCX (issue #815)\n    - fixed a rare issue with loading epub files with OPF's that had the XML version set to 1.1,\n    but also had other attributes in the XML declaration (issue #812)\n    - fixed an issue with entries appearing at random in the TOC after a split on SGF markers\n    is followed up with \"Generate TOC from headings\" request (issue #804)\n    - fixed an issue with files not appearing in the Book Browser after a split on SGF markers\n    (issue #816)\n    - fixed a regression that caused the auto-cover-setting heuristics to unset covers when they\n    are already set (issue #806)\n    - opening an HTML file now automatically builds a TOC from the headings\n    - fixed a regression that caused the Add Semantics menu to stop working (issue #807)\n\nSigil v0.4.0 2 2011.03.21.\n    - fixed an issue with the ID of the manifest item of a resource not being updated when the \n    resource was renamed\n    - fixed an issue with chapter splits being created in the wrong reading order (issue #797)\n    - fixed an issue with some HTML files disappearing after a save/load cycle if chapter splitting\n    was performed before the save\n    - fixed an issue with renaming a file and then splitting it causing duplicate ID's in the OPF\n    manifest (issue #800)\n    - fixed a validation issue with the Meta Editor not adding the correct namespace prefix to some\n    Dublin Core metadata element attributes\n\nSigil v0.4.0 1 2011.03.20\n    - fixed an issue with CSS @import rules in the '@import \"something.css\"' format not being \n    recognized and thus not updated on import\n    - removed the \"CustomID\" basic metadata entry from the Meta Editor; those wishing to use\n    custom ID's can now add them directly to the OPF\n    - Sigil now preserves custom unique identifiers in the OPF (issue #552)\n    - removed support for the Sigil-proprietary SGF format\n    - the user can now edit the OPF file by hand (issue #281) \n    - the user can now edit the NCX file by hand (issue #282)\n    - the OPF file is now preserved on import (issue #586)\n    - the NCX file is now preserved on import (issue #283)\n    - the Table Of Contents editor has been replaced with a new Table of Contents sidebar;\n    clicking on an item in this sidebar takes the user to the target location, enabling TOC\n    navigation (issue #100)\n    - a dialog now informs the user if his XHTML, NCX or OPF documents are not well-formed \n    XML (with error location and description), thus allowing him to fix the potential problems\n    by hand instead of leaving them to Tidy to fix (issue #519)\n    - fixed a rare issue with no tab opened by default when loading epubs\n    - made the sigil.sh startup script more robust (courtesy of Craig Sanders) (issue #737) \n\nSigil v0.3.4 2011.01.12.\n    - fixed a regression (\"Not a folder\" error) with opening certain epub files on Mac and \n    Linux systems (issue #731) \n\nSigil v0.3.3 2011.01.06.\n    - added a small \"Donate\" button to the toolbar and a related entry in the Help menu \n    - added a .desktop file for the make install target (courtesy of Richard Gibert)\n    - this time *really* worked around a Tidy bug that added blank lines to the start of <pre> \n    and <style> elements (issue #655)\n    - updated ZipArchive from 4.0.1 to 4.1.0\n    - fixed a regression crash bug with loading extremely rare HTML content documents that have\n    an internal DTD subset\n    - added a workaround for a crash bug caused by invalid epubs that use obfuscated fonts but \n    with incorrect UUID URN key syntax (issue #709)\n    - integrated the FlightCrew epub validation library; a new toolbar icon triggers epub \n    validation and displays the results (issue #28)\n    - fixed a rare input truncation problem when the input file contains a unicode nbsp and also\n    specifies standalone=\"yes\" in the XML declaration (issue #677)\n\nSigil v0.3.2 2010.11.24.\n    - added a new toolbar button for turning Tidy cleaning on/off; this option is also available\n    from the Tools menu (issue #553)\n    - added support for TrueType Collection fonts with extension TTC\n    - InDesign (as of CS5) refuses to list the fonts it embeds in the OPF manifest of the epub \n    files it exports, even though the epub standard demands it. This causes Sigil to not pick up\n    these fonts when opening such epub files. A workaround has been added that will detect such\n    problematic epubs and then load the font files.\n    - fixed a rare crash issue when loading epub files\n\nSigil v0.3.1 2010.11.07\n    - added a new \"Font Obfuscation\" context menu for font files in the Book Browser; the user can\n    now select (or de-select) the use of Adobe's or the IDPF's font obfuscation methods; this also\n    resolves the problem where Sigil refused to open epub files that use such obfuscated fonts with  \n    the message that the epub has DRM\n    - fixed a validation issue caused by Sigil using \"application/x-font-opentype\" as the OPF\n    mimetype instead of \"application/vnd.ms-opentype\"\n    - fixed a crash when opening the TOC editor for some epub files (issue #654)\n\nSigil v0.3.0 2010.11.04\n    - root rights no longer needed to install on Linux\n    - fixed an issue with some child headings being attached to incorrect parent headings in the \n    TOC if the parent was marked as \"not in TOC\" (issue #476)\n    - fixed an issue with some UTF-8 characters outside the BMP (usually CJK characters) not being\n    saved properly (issue #180)    \n    - fixed an issue with certain path types not being correctly updated as a result of the \n    fix for issue #501 (issue #561)\n    - the Book Browser now prevents adding files that already exist in the epub\n    - previously, when adding external XHTML files through the Book Browser, any files (like CSS \n    stylesheets or images) that were linked from that file were included in the epub under a \n    different name if their original name was \"taken\"; this caused duplicates so this behavior \n    has changed: files whose names are \"taken\" are now skipped over (issue #482)    \n    - fixed a rare issue that caused incorrect path updates for anchor links pointing to file names\n    that were suffixes of other chapter file names, and the anchor had a fragment ID (issue #598)  \n    - fixed an issue with the image paths in background-image CSS rules not being updated when\n    the path changes (issue #594)\n    - Sigil now informs the user that DRMed files cannot be opened, instead of just crashing\n    (issue #624)\n    - this time *really* fixed the \"acknowledgments\" error that was reported as fixed in RC1\n    - fixed a crash on load (with an error dialog) issue on Linux systems occurring when multiple\n    users on the same machine tried to use Sigil (issue #642)\n    - fixed a randomly occurring crash, usually triggered on Macs during loading (issue #643) \n\nSigil v0.3.0RC2 2010.10.08\n    - fixed a file-corruption-on-save issue caused by XHTML files being saved in UTF-8, but\n    declared as UTF-16 (issue #617)\n\nSigil v0.3.0RC1 2010.10.08\n    - fixed a validation issue caused by using the American spelling for \"acknowledgments\" where\n    the OPF spec uses the British \"acknowledgements\" (issue #611)\n    - Sigil now uses \"application/x-font-ttf\" as the media type in the OPF for TrueType fonts\n    (issue #609)\n    - on Mac OS X, the universal build now includes an x64 version of Sigil, and builds now\n    use Cocoa instead of Carbon; support for Mac OS X 10.4 is dropped along with support for\n    PowerPC Macs\n    - fixed a problem with opening files from the Ubuntu \"Open With\" menu (issue #524)\n    - made Tidy handle common user errors like \"&co.\" in the HTML source instead of \"&amp;co.\"\n    - fixed a rare Tidy bug with disappearing spaces when the only whitespace in an element was \n    the newline following a start tag (issue #387)\n    - changed the internal DOM engine from Qt's QDom to Xerces; this should also bring numerous\n    bug fixes and performance improvements plus a small (~10%) decrease in memory consumption\n    (issue #367)\n    - updated Qt to 4.7: this should bring a 400%+ performance increase in Book View rendering \n    along with countless smaller performance improvements and bug fixes across the board\n    - switched to the MSVC 10 compiler for Windows releases; should bring ~5% general performance \n    improvement \n    - fixed several crash/error problems relating to opening, saving and modifying epub files which\n    have onerous file permissions set for internal content files (issue #574)\n    - added a workaround for broken epubs created by other epub-producing software which caused\n    a crash on certain searches with the Find dialog (issue #548)\n    - fixed a problem with Book Browser's \"Merge with previous\" action if a file was previously \n    deleted from the Book Browser (issue #565)\n    - fixed a problem with chapter splits being placed in the wrong reading order if a file was\n    previously deleted from the Book Browser (issue #497)\n\nSigil v0.2.4 2010.08.12.\n    - fixed a problem with updating image paths for images with the same filename but coming from\n    different parent directories (issue #501)\n    - added a new \"Merge With Previous\" context menu action for XHTML files in the Book Browser\n    (issue #265)\n    - changed Tidy to handle the common typing mistake of ending entities with a ':' instead\n    of a ';' (issue #535)\n    - fixed a bug where double-clicking a file in the Book Browser for a file that was already \n    opened in a tab switched that tab back to Book View; the tab now retains whatever View\n    it was in previously\n    - newly opened tabs now default to the View of the current tab (issue #468)\n    - re-engineered the locations where Sigil stores its work files; the system-provided temp\n    folder is now used; this should alleviate some permissions issues on certain machines,\n    especially Macs (issue #404)\n    - Sigil now prevents the renaming of files in the Book Browser to filesystem invalid names\n    (issue #493)\n    - changed the keyboard shortcut that opens the Replace dialog from Cmd+H to Cmd+Shift+F\n    on Macs only; Cmd+H is used by Mac OS X for window hiding (issue #477)\n    - fixed an issue with Sigil using XHTML 1.0 for OPS doctypes, instead of XHTML 1.1\n    (issue #503)\n    - several files can now be marked as having the Text semantic type (issue #522)\n    - fixed an issue with Direction: All in book wide searching skipping last XHTML file \n    (issue #520)\n    - fixed an issue with the declared XML encoding not being picked up if it was wrapped\n    in single quotes instead of the more standard double quotes\n    - fixed an issue where the user could avoid the warning dialog for book-wide searching in\n    Book View if he switched to this mode in Code View, and then switched back\n\nSigil v0.2.3 2010.06.22.\n    - fixed an issue with the new data from one view sometimes not being saved in the final\n    epub when switching to the other view\n    - worked around a Qt focus issue causing current tab data to sometimes not be saved;\n    this was uncovered by fixing the hang-on-save issue, which was caused by the same \n    underlying problem (issue #466)\n\nSigil v0.2.2 2010.06.20.\n    - simplified the resource locking mechanism; should eliminate the hang-on-save issue\n    - fixed a problem with BookView chapter splitting sometimes not being registered on save,\n    causing duplicate content (issue #450)\n\nSigil v0.2.1 2010.06.18.\n    - XHTML files that specify two different encodings are now fixed by removing the incorrect one\n    - Sigil now checks the XML encoding attribute for an encoding before the HTML metatag\n    and charset; should now be more compatible with Calibre created epub books\n    - created/used 16px version of all icons; icons in menus are not blurry anymore (issue #121)\n    - the Find&Replace dialog now uses the currently selected text (if any) as the default search\n    term (issue #370)\n    - fixed issues with unnecessary reloads of the code view (issue #412, issue #398)\n    - fixed an issue with the HTML file filter in the open file dialog not correctly filtering \n    files (issue #416)\n    - fixed an issue with files without extensions not being saved in the final epub (issue #400)\n    - fixed an issue with XPGT resources sometimes being saved blank (issue #433)\n    - fixed a regression that made it impossible to add removed headings back into the TOC\n    (issue #439)\n    - fixed a problem with some file-wide replacements reverting\n    - fixed a problem with the opened tabs not being updated until the user gave them keyboard\n    focus when a file-wide replace was performed (issue 408)\n    - fixed a problem with Book View not reflecting changes done in Code View when the\n    Code View was used for editing, and then the tab closed\n    - use of custom synchronization primitives should resolve most infrequent hang bugs\n    - fixed a problem with the search not progressing in Book View find&replace when using\n    recursive replacements\n    - fixed an issue with inserting images that have apostrophes in the filename (issue #391) \n    - TOC text now has leading and trailing whitespace trimmed, and inner whitespace condensed \n    (issue #422)\n    - an empty ALT attribute is now added to <img> elements that don't have them (issue #406)\n    - added the build time to the About dialog, showing date and time in UTC\n\nSigil v0.2.0 2010.05.11.\n    - added new entries to the help menu for the online manual and the FAQ\n\nSigil v0.2.0 RC4 2010.05.08.\n    - fixed a regression that broke FindNext opening new tabs when searching across HTML files \n    (issue #384)\n    - fixed an issue with autocompletion in Find dialog ignoring the case of search terms \n    (issue #385)\n\nSigil v0.2.0 RC3 2010.05.07.\n    - fixed a regression that messed up the tab order of the controls in the Find dialog\n    (issue #380)\n    - fixed an issue with cross-file FindNext causing a hang when the search term is not in\n    the book and \"Direction: All\" is used (issue #378)\n    - the Text folder in the Book Browser is now expanded by default after loading\n\nSigil v0.2.0 RC2 2010.05.05.\n    - fixed an issue with ReplaceAll across files not using correct replacement lengths\n    - fixed an issue with code in Code View not being pretty-printed\n    - fixed an issue with the ReplaceAll across files not informing the opened tabs of the change\n\nSigil v0.2.0 RC1 2010.05.03.\n    - changes in the Book Browser now update the modified state of the main window (issue #331)\n    - the Book Browser can now be opened/closed from the View menu (issue #335)\n    - all the toolbars now have UI-facing names\n    - by injecting a custom XML reader into QDom, the following issues were fixed:\n        - Book View search sometimes skipping over instances (issue #253)\n        - Book View ReplaceAll causing Sigil to hang on rare occasions (issue #293)\n        - spaces disappearing from some HTML constructs (issue #352)\n    - implemented component-wide search&replace for Code View searches (issue #372)\n    - the Find&Replace dialog now remembers up to 20 previously used search and replace strings\n    (issue #369)\n    - fixed an issue with positive regex lookaheads in normal Replace (not ReplaceAll) (issue #261) \n    - fixed a rare off-by-one error in Book View searching when the caret was at the start of\n    the matched string; this made the search skip that instance of the match (issue #280)\n    - fixed an issue with the Find Dialog not correctly scrolling to the found text in\n    Book View (issue #195)\n    - fixed an issue with Tidy not fixing free ampersands into \"&amp;\", even when configured\n    to do so (issue #365)\n    - fixed an issue with the current tab unnecessarily reloading after book saves (issue #354)\n    - fixed issues with filename basenames being read only until the first dot; was causing\n    problems with OPF manifest ID generation (issue #351)\n    - hitting the keyboard shortcut for the Find&Replace window while the window is open\n    now switches focus to that window (issue #362)\n    - fixed an issue with the applied headings not \"sticking\" and not showing up in the TOC\n    editor (issue #300)\n    - the special iPad- and Calibre-friendly cover meta tag information is now preserved\n    after loading\n    - added a new \"Cover Image\" entry for image resources in the \"Add Semantics\" Book Browser menu  \n    - if an image is not set as a cover image manually, Sigil now uses heuristics on save\n    to determine if the epub has a cover image\n    - if an epub has an image set as a cover image, Sigil will now write a special meta tag\n    that identifies this image in the OPF; this tag is then used by the iPad (and Calibre)\n    for the book cover, for instance\n    - all OPF <guide> element information when loading epubs is now preserved\n    - added a new \"Add Semantics\" menu for XHTML documents; it can be used to mark XHTMLs as\n    \"Dedication\", \"Colophon\", \"Glossary\" etc. for the <guide> element of the OPF\n    - the status bar now shows a message after chapter split operations\n    - fixed an issue with filenames with characters that should not appear in valid XML IDs\n    having those characters added anyway (issue #344)\n    - fixed an issue with files with uppercase extensions not having a mimetype set in the OPF\n    (issue #349)\n    - fixed an issue with Sigil rewriting headings when the TOC was opened and no heading was \n    edited (issue #327)\n    - fixed an issue where adding an existing HTML file through the Book Browser would clear\n    the current metadata in the book (issue #329)\n    - added a check that prevents Sigil from loading the same resource multiple times in \n    invalid epubs (issue #339) \n    - fixed a bug that made the direct XHTML references in the NCX file less likely (issue #333)\n    - fixed an issue with Sigil crashing when trying to save a loaded epub that had some badly\n    formed metadata elements (issue #325)\n\nSigil v0.2.0 3 2010.03.23.\n    - added two new WYSIWYG actions that work for both Views: \"Insert SGF Chapter Marker\" which\n    inserts the old SGF horizontal rule chapter breaking marker and \"Split On SGF Chapter Markers\"\n    which splits the current chapter according to the placement of these markers (issue #262)\n    - chapter splitting now works in Code View\n    - fixed an issue with Sigil adding \"xmlns='http://www.w3.org/1999/xhtml'\" to every element\n    when performing a chapter break operation (issue #313)\n    - fixed a rare issue with false spaces being inserted into words during import (issue #139)\n    - added a confirmation dialog for removing items in the Book Browser (issue #306)\n    - fixed an issue with the line number area overlapping the text in the Code View \n    - made Sigil remove the CSS cruft WebKit was adding to the \"body\" element\n    - fixed an issue with spaces in filenames causing bad anchor element path updates\n    - fixed an issue with spaces in filenames not being URL encoded in \"href\" and \"src\" attributes\n    in the OPF and NCX files\n    - fixed an issue with spaces in filenames causing invalid IDs (issue #301)\n    - fixed a regression causing Sigil to crash when importing HTML files that reference resources\n    that don't exist on disk\n    - Tidy now converts all uppercase attributes to lowercase; mixed-case attributes are left as is\n    - fixed an issue with Tidy choking on uppercase attribute names\n\nSigil v0.2.0 2 2010.03.10.\n    - fixed an issue with exported HTML/CSS/etc. files inside EPUBs having superfluous newlines\n    - fixed an issue with the TOC editor adding empty \"class\" attributes to headings (issue #297)\n    - added a new \"Window\" menu item with new \"Next Tab\", \"Previous Tab\" and \"Close Tab\" actions \n    (issue #273)\n    - fixed an issue with the font used in the line number area in the Code View being incorrect\n    when the Code View is first opened; the problem affected mostly Mac machines (issue #290)\n    - Sigil now handles corrupt epub files with an OPF referencing non-existent files (issue #289)\n    - the Book Browser now doesn't scroll back to the top when an item is deleted or added \n    (issue #263)\n    - the Book Browser now allows a file's extension to change between HTM, HTML, XHTML and XML\n    (issue #264)\n    - OPF and NCX files don't rely anymore on UTF-8 XML default parsing, but specify their UTF-8\n    encoding directly in the declaration\n    - fixed an issue with changes in the TOC editor not being reflected in the book (issue #277)\n    - fixed an issue with the TOC editor not recognizing the \"title\" attribute on headings \n    (issue #271)\n    - fixed an issue with the user seeing the old, unclean source in the Code View (issue #286)\n    - fixed an issue with the user being prompted to save when quitting even when no changes\n    have been performed on the new/loaded file (issue #276)\n    - fixed an issue with Book/Code View keyboard shortcuts firing in the wrong view (issue #266)\n    - tentatively fixed an issue with Sigil locking up when chapter breaking (issue #267)\n    - fixed an issue with Tidy adding a superfluous 'lang' attribute that is also not allowed\n    in XHTML 1.1\n    - making sure that ID attributes used in the manifest section of the OPF are always valid\n    - fixing export of epubs with XML files for OPS documents\n\nSigil v0.2.0 1 2010.03.02.\n    - after *many* months of work, the complete redesign of the Sigil main interface and backend is \n    finished, resulting in waaaay too many changes, fixes and modifications under the hood that are\n    too numerous to list here\n    - fixed an issue with anchor elements getting unnecessary \"name\" attributes (issue #226)\n\nSigil v0.1.9 2010.02.08.\n    - fixed a regression that caused Sigil to demand that all XHTML streams in an epub file\n    be valid XML (issue #248)\n    - the \"container.xml\" reading subsystem now handles XML files with namespaces (issue #235)\n    - HTML encoding detection is now performed even on XHTML files in epub archives (per spec, \n    they have to be UTF-8 or UTF-16, but Sigil will now handle those that aren't)\n    - fixed an issue with content file filenames using \"%20\" for spaces not being loaded \n    (issue #232)\n    - the temp directory used on Windows is now <Profile>/Sigil instead of \n    <Profile>/My Documents/Sigil (issue #222)\n    - added a \"Sigil Dev Blog\" Help menu entry\n\nSigil v0.1.8 2009.12.30.\n    - fix for a regression causing all imported CSS code to be merged into one line\n    - fix for an issue with ignored linefeed characters (caused by same regression) (issue #217)\n\nSigil v0.1.7 2009.12.28.\n    - minor aesthetic toolbar fixes for Mac\n    - fixed an issue with \"&nbsp;\" in headings not being converted to a space in the TOC \n    (issue #215)\n    - minor aesthetic changes to the line number area in Code View\n    - fixed an issue with \"Insert Image\" not working if the Book View doesn't have focus \n    (issue #204)\n    - the \"Add metadata property\" dialogs in the Meta Editor now remember their size, position\n    and splitter bar position\n    - Sigil now loads HTML metadata when importing if metadata conforms to Dublin Core;\n    code contribution from Kevin Hendricks (issue #160)\n    - fixed an issue with loading TXT files with unescaped character entity references (issue #202)\n    - fixed an issue with headings not being centered after View switches (issue #200)\n    - fixed an issue with files with uppercase extensions being loaded incorrectly\n    - fixed an issue with loading TXT files with Mac-style (CR) line endings (issue #170)\n    - fixed an issue with loading UTF-16 encoded files that used Windows style (CRLF) line endings\n    - Sigil should now detect UTF-8 encoded HTML files even when they don't specify that they   \n    are UTF-8 encoded, and HTML files that use the XML \"encoding\" attribute (for any encoding)\n    - the Views can now be scrolled by one line up/down by pressing CTRL+Up/Down (issue #72)\n    - the About dialog now links to the online version of the GPLv3\n    - made viewport switching more robust; the rare crashes should now become much rarer\n\nSigil v0.1.6 2009.12.06.\n    - added a \"Report An Issue\" menu entry to the Help menu; opens a web browser and goes to the\n    \"ReportingIssues\" wiki page on Sigil's website\n    - fixed an issue with empty NavMap generation in the NCX if the file had no headings;\n    the epub specification forbids empty NavMaps (issue #174)\n    - fixed an issue with the document not being marked as modified in the GUI if the user only\n    changed the document's metadata (issue #189)\n    - fixed a rare bug with searching for a string that is at the very end of a document \n    (issue #181)\n    - new \"Remove Formatting\" WYSIWYG action (issue #56)\n    - Sigil now preserves ALL HTML entity references (it used to convert most to Unicode \n    equivalents); this change was necessary since soft hyphens were becoming \"invisible\" \n    (issue #186)\n    - implemented \"blockquote\" support through new WYSIWYG actions: \"Indent Less\" and\n    \"Indent More\" (issue #41)\n    - updating Qt fixed an issue with images wrapped in SVG tags not being shown (issue #91)\n    - updated Qt from 4.5.2 to 4.6.0\n    - fixed an issue with regex matching in Code View when such regexes referenced line\n    endings with \"\\n\" (issue #182)\n    - PageUp and PageDown keys now work in Book View (issue #130)\n    - fixed a crash invoked on switching views and searching in Book View when the caret \n    element's parent has HTML comment children (issue #179)\n    - \"Replace All\" is now treated as a single undo/redo operation *in Code View*\n    - tentatively fixed a problem with bad TOC generation if the input file had multiple headings\n    with the same ID (across XHTML files) (issue #177)\n    - fixed a regression that was causing crashes when switching views\n\nSigil v0.1.5 2009.11.25\n    - fixed a race condition with view syncing in Book View\n    - fixed an issue with loading text files that don't end with a newline (some text would end up \n    missing)\n    - A NEW FIND & REPLACE DIALOG (issue #13)\n    - no more hard line breaks in Code View (courtesy of recent performance optimisations) \n    (issue #61)\n    - TOC Editor now remembers its size across invocations and program launches\n    - the uninstaller now removes Sigil's temporary working directories \n    - removed the \"Start Sigil\" checkbox in the last page of the installer; starting Sigil like \n    this was causing problems because Sigil had admin privileges (issue #163)\n    - fixed an issue with chapter breaks not working after they are Left/Center/Right Aligned \n    (issue #158)\n    - multiple images can now be inserted with the \"Insert Image\" dialog by selecting multiple \n    images \n    - fixed an issue with loading images from documents with uppercase tags and attributes \n    (issue #156)\n    - tentatively fixed an issue with Sigil crashing on overwriting existing epubs (issue #146)\n    - fixed an issue with Sigil crashing on epubs with \"date\" OPF elements but no value set\n    for those elements (InDesign CS4 creates such invalid epubs) (issue #149)\n    - fixed an issue with words being merged on TXT import (issue #148)\n    - various performance improvements through code profiling and parallelization\n    - Linux and Mac builds should now be slightly faster because of new compiler optimizations\n    - fixed issue with Sigil incorrectly loading (and therefore subsequently saving) \"date\"\n    OPF elements with \"event\" attributes (issue 144)\n\nSigil v0.1.4 2009.10.08.\n    - SGF files are now associated with Sigil on Windows (issue #135)\n    - SGF files are now associated with Sigil on Mac OS X (issue #10)\n    - fixed issue with \"Open With\" OS actions not working on Macs (issue #111)\n    - provided more informative tooltips by following Word 2007 tooltip style (issue #64) \n    - the heading text can now be edited in the TOC Editor (issue #131)\n    - the Save As dialog now uses the current filename in the filename field (issue #18)\n    - views can now be zoomed (issue #44)\n    - Sigil no longer loads flow-specific CSS... this was causing more harm than good; loading \n    flow-specific CSS will be back in 0.2.0.\n    - implemented a NEW workaround for a webkit bug causing the first character of a heading\n    created after a chapter break to be displayed incorrectly (issue #78) \n    - fixed issue with TOC editor not resolving HTML entities (issue #125)\n    - fixed issue with Tidy changing case of attribute names (issue #120)\n    - Sigil will from now on check for a newer version on startup and present an informative\n    message if such a version is found (issue #67)\n    - made SGF importing MUCH faster (issue #119)\n    - provided a window icon on Linux\n    - providing binary installers for Windows AND LINUX (issue #6)\n    - further improved encoding detection for HTML import\n    - fixed graphical misalignment of controls in MetaEditor on Linux and Mac platforms\n    - fixed syntax highlighting for XPGT stylesheets\n    - fixed rare issue with SGF importing that displayed all body text underlined (issue #118)\n    - fixed display of the Sigil chapter break in Book View: the red double-line now\n    properly appears after all images (issue #117)\n    - added support for importing images referenced in SVG elements in HTML import\n    - HTML importing now defaults to a locale-aware codec if one is not detected in the HTML \n    stream; previously the fallback codec was UTF-8; this change should improve importing of \n    old HTML documents (issue #113)\n\nSigil v0.1.3 2009.09.02.\n    - implemented a work-around for a bug in Qt causing documents with \"us-ascii\" encoding\n    specified in the XML declaration to crash Sigil (issue #109)\n    - resource path updating rewritten; should be more robust\n    - fixed an issue where EPUB files from Google Books could not be opened (issue #106)\n    - fixed regression for storing the folder from which the user last imported an image \n    (issue #105)  \n    - refactored HTML file import resource loading: should be a lot more robust now\n    - fixed an issue with loading HTML files that reference the same images multiple times \n    (issue #90)\n    - implemented non-live View position synchronization; the Views are now synced\n    by HTML element: moving the caret in one View will center the other View (upon switching)\n    to the same HTML element that held the caret in the first View (issue #8)\n    - newlines are now removed from TOC headings to avoid rendering problems in ADE (issue #96)\n    - Sigil now creates a unique book identifier (if one is not provided by the user)\n    using the UUID standard instead of a random sequence of characters and numbers;\n    the old \"SigilGEN\" scheme is replaced with \"UUID\"\n    - initial support for calibre interoperability (issue #94)\n    - book updates from TOC editor are now faster and have a much smaller memory overhead\n    - fixed issue with removing headings from TOC in TOC editor (issue #88, part 2 and issue #21);\n    also made TOC editor updates to headings MUCH more robust\n    - all headings are now by default included in TOC... heuristics for \"guessing\" which\n    headings the users wants have been removed (issue #88, part 1)\n    - fixed critical issue with Sigil hanging when loading certain SGF files (issue #87)\n    - fixed rare issue with duplicate image loading (issue #86)\n    - implemented a workaround for a webkit bug causing the first character of a heading\n    created after a chapter break to be displayed incorrectly (issue #78)\n    - the \"makedmg\" target for Macs is not build by default anymore and needs to be\n    invoked directly; this was done to speed rebuilds\n    - Macs now have a standard multiple document interface: opening a new file opens it\n    in a new window, not in the old one (issue #22)\n    - fixed a bug with warning dialog not informing the user of unsaved changes\n    if he tried to load from the recent files list\n\nSigil v0.1.2 2009.08.12.\n    - added the ability to specify the main publication identifier directly,\n    through the \"CustomID\" basic metadata property (issue #3)\n    - fixed a bug with warning dialog not informing the user of unsaved changes\n    when editing in code view (issue #30)\n    - Sigil is now a universal Mac application (ppc and i386, in 32bit) (issue #5)\n    - implemented a workaround for a bug in QTextCodec causing bad HTML codec detection (issue #74)\n    - SVG elements are not removed anymore (issue #24)\n    - inter-document HTML links are now fully supported (issue #53)\n    - fixed rare issue where CSS style rules could get duplicated when changing views\n    - fixed issue with inline style tags in OPS documents not being loaded (issue #58)\n    - Sigil can now accept a file to load as the first command line argument; this also\n    provides support for \"Open With...\" operating system features (issue #63)\n    - fixed an issue where the reported build time in the About dialog was actually the execution\n    time (issue #65)\n    - loading of missing files in the recent files list is now improved (issue #57)\n    - fixed a rare issue where the wrong view could be sent to the printer on print actions\n    - Sigil now creates a guide element with a cover page in the OPF if the content of the first\n    OPS document is less than 1000 characters long (issue #48)\n    - support for importing UTF-16 encoded documents (not just UTF-8)\n    - provided install target for Linux; the binary is now also named \"sigil\"\n    (lower case 's') on Unix systems (except Mac) for the sake of convention (issue #46)\n    - removed dependency on \"data\" directory (issue #51)\n\nSigil v0.1.1 2009.08.06.\n    - applied provided patch for NetBSD support\n    - fixed issue with loading images in HTML and EPUB docs that have regexp special characters\n    in filenames. (issue #39)\n    - if headings have the 'title' attribute set, it is now used as the TOC text entry. (issue #26)\n    - tags are now removed from headings before they are converted to TOC entries (issue #47)\n    - Sigil now remembers the last folder from which you loaded an image (issue #34)\n    - choosing 'cancel' in TOC editor now no longer forces the views to update\n    - fixed bug with new headings getting existing IDs. (issue #36)\n    - printing support! new file menu actions: \"print\" and \"print preview\"\n    - fixed an issue when sometimes switching between views didn't enable/disable appropriate \n    actions\n    - fixed an issue with mixed-up CSS classes on Mac and Linux (issue #16)\n    - added line numbering for Code View (issue #9)\n    - added current line highlighting for Code View \n    - fixed crashing bug with some calibre generated epubs (issue #16)\n\nSigil v0.1.0 2009.08.01.\n    - initial release\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.1083984375,
          "content": "Sigil\n=====\n\nSigil is a free, open source, multi-platform ebook editor that uses\nQt6 (and QtWebEngine). It is designed to edit books in ePub format (both ePub 2 and ePub 3).\n\n\nLinks\n=====\n\n* Its website is located at http://sigil-ebook.com\n\n* Its current code repository is located at https://github.com/Sigil-Ebook/Sigil\n\n* Translations are located at https://www.transifex.com/projects/p/sigil/\n\n* Support forums are located at http://www.mobileread.com/forums\n    Select Sigil from the list of main forums\n\n* Sigil Plugin Index (hosted by www.mobileread.com) at \n    http://www.mobileread.com/forums/showthread.php?t=247431\n\n* Sigil User Guide is located at https://github.com/Sigil-Ebook/sigil-user-guide/releases/latest\n\n* An online version of the User Guide is available at: https://sigil-ebook.com/sigil-user-guide\n\nIssue Tracker\n=============\n\nPlease do not use the issue tracker to ask questions or suggest new features.  Both of the main developers\nof Sigil monitor the Sigil Forum at https://www.mobileread.com/forums.\nAll questions and feature requests should be directed there so that other interested users can help or comment.\n\nIssue tracking is intended for discussion around issues with the code. \nIt is also intended for actual bug tracking.\n\nFeature requests opened on the issue tracker will be closed.\n\n\nLinux Build and Install\n=======================\n\nStarting with Sigil 2.3.0, Qt6.4 is the minimum requirement to build Sigil. You'll need to use an older version if you need to build with Qt5.\n\nFor newer Linux systems like Ubuntu 23.04 (and its derivitives), or Arch Linux, or Debian Trixie or Unstable, you should be able to compile Sigil using repo-provided dependencies. Instructions for doing so can be found in:\n\n> [docs/Building_on_Linux.md](./docs/Building_on_Linux.md)\n\nThe Qt6 build documentation strives to provide both Debian- and Arch-based package names.\n\nFor older Linux systems whose software repositories do not provide Qt6.4.0 (or higher), the\ndetailed instructions for building/installing Sigil with Qt5 can be found in:\n\n> [docs/Building_on_Linux_older.md](./docs/Building_on_Linux.md)\n\nAn up-to-date version of Sigil is available via flatpak on Flathub. So if your distro can use Flatpak, you can always use [Sigil that way](https://flathub.org/apps/details/com.sigil_ebook.Sigil) if your distro's Sigil package seems to be lagging too far behind.\n\nFor Building on Mac OS X\n========================\n\nBuilding using purely XCode is no longer supported on Mac OS X.  The easiest \nway to build Sigil on Mac OS X is to use cmake 3.X and the XCode CommandLineTools.   \n\nAlso because Sigil now embeds Python 3.11.9, see  \n\n> [docs/Building_A_Relocatable_Python_3.11_Framework_on_MacOSX.txt](./docs/Building_A_Relocatable_Python_3.11_Framework_on_MacOSX.txt)\n\nfor detailed instructions on how to build a fully relocatable Python 3.11.3 framework before\nbuilding Sigil.  \n\nFor official releases Sigil uses Qt6.7.2 plus official local patches see:  \n\n> [docs/Building_Qt6_From_Source_on_MacOSX.txt](./docs/Building_Qt6_From_Source_on_MacOSX.txt)\n\nAnd finally to build Sigil itself see:\n\n> [docs/Building_Sigil_On_MacOSX_With_Qt6.txt](./docs/Building_Sigil_On_MacOSX_With_Qt6.txt)\n\n\nFor Installing/Building on Windows\n==================================\n\nSigil currently provides a Windows installer for x64 and will work on Windows 10 (1809) or newer.\n\nThe latest Sigil versions are also typically available via the [winget (Windows 10+)](https://winstall.app/apps/Sigil-Ebook.Sigil), [Chocolatey (Windows 10+)](https://community.chocolatey.org/packages/Sigil), and [Npackd](https://npackd.appspot.com/p?q=sigil) Windows package managers. There are no \"scary\" Microsoft warnings about unknown publishers if you install Sigil via one of these package managers. \n\nTo build Sigil on Windows yourself, see:\n\n> [docs/Building_Sigil_on_Windows_with_Qt6.md](./docs/Building_Sigil_on_Windows_with_Qt6.md).\n\n\n\nLicense\n=======\n\nSigil is licensed under the GPLv3. The complete license is located in\nCOPYING.txt.\n\nNote that libraries and components Sigil used and bundles may use a different\nlicense (that is compatible with the GPLv3) from Sigil. See the specific\ncomponent for their respective license.  The source code from these\nprojects can be found under Sigil/3rdparty unless otherwise indicated.  \nPlease see their respective folders for complete license information.\n\nCurrently these projects include:\n\n* Hunspell 1.7.2 - https://github.com/hunspell/hunspell\n* MiniZip version 1.1 (plus some security changes)\n* Perl-compatible Regular Expression Library 2 (pcre2 version 10.44)\n* ZLib Data Compression Library (zlib 1.3.1)\n* jQuery-3.6.4 (src/Resource_Files/javascript/jquery-3.6.4.min.js)\n* jQuery.ScrollTo-2.1.2 (src/Resource_Files/javascript/jquery.scrollTo-2.1.2.min.js)\n* MathJax.js Version 3.2.X [required minimum is 3.2.2]: (src/Resource_Files/polyfills)\n\nIn addtion, Sigil uses the following other packages that have been specifically\nmodified for use inside Sigil:\n\n* Beautiful Soup 4 (src/Resource_Files/plugin_launchers/sigil_bs4)\n* Sigil-gumbo based on Google's Gumbo Parser (internal/gumbo)\n\n\n\nSigil in Action\n===============\n\n![Sigil](docs/screencaps/sigil.png?raw=true) Sigil Main Window\n    \n\n![Sigil Dark Mode](docs/screencaps/sigil_dark.png?raw=true) Dark Mode\n\n\n![Generate TOC](docs/screencaps/generate_toc.png?raw=true) Generate ToC\n\n\n![Plugins](docs/screencaps/manage_plugins.png?raw=true) Python3 Plugins\n\n\n![Edit Metadata](docs/screencaps/edit_metadata.png?raw=true) Edit Metadata\n\n\n![Reports](docs/screencaps/reports.png?raw=true) Run Reports\n\n\n![Checkpoint Compare](docs/screencaps/checkpoint_compare.png?raw=true) Detect Changes\n\n\n![Preview Inspector](docs/screencaps/preview_inspector.png?raw=true) Preview's Inspector\n\n\n![Custom Layout](docs/screencaps/sigil_custom.png?raw=true) Customize Your Layout\n\n\n![Validation](docs/screencaps/validation_via_plugins.png?raw=true) Validate EPUB, CSS, XHTML, etc.\n\n\n![PageEdit Companion Program](docs/screencaps/pageedit.png?raw=true) Interface to PageEdit Visual XHtml Editor\n\n\n\n\nPackage Versions of Sigil\n=========================\n\n[![Packaging status](https://repology.org/badge/vertical-allrepos/sigil.svg)](https://repology.org/project/sigil/versions)\n"
        },
        {
          "name": "ci_scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "cmake_extras",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "installer",
          "type": "tree",
          "content": null
        },
        {
          "name": "internal",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "version.xml",
          "type": "blob",
          "size": 0.1103515625,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<information>\n    <current-version>2.3.1</current-version>\n</information>\n"
        },
        {
          "name": "windownloadqt.cmake",
          "type": "blob",
          "size": 0.4384765625,
          "content": "if(NOT EXISTS \"${CMAKE_CURRENT_BINARY_DIR}/Qt${QTVER}\")\n    message(STATUS \"Downloading Custom Qt6 from developer's github...\")\n    set(QTURL \"${WINQTURL}/Qt${QTVER}ci_x64_VS2022.7z\")\n    file(DOWNLOAD \"${QTURL}\" \"${CMAKE_CURRENT_BINARY_DIR}/qt6.7z\")\n    file(ARCHIVE_EXTRACT INPUT \"${CMAKE_CURRENT_BINARY_DIR}/qt6.7z\" )\nelse()\n    message(STATUS \"Custom Qt6 has already been downloaded to ${CMAKE_CURRENT_BINARY_DIR}. Will try to use it.\")\nendif()\n"
        },
        {
          "name": "winvirtpy.cmake",
          "type": "blob",
          "size": 1.2822265625,
          "content": "if(NOT EXISTS \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy\")\n    find_package(Python3 3.9 COMPONENTS Interpreter)\n    set(REQUIREMENTS \"${PROJECT_SOURCE_DIR}/src/Resource_Files/python_pkg/winreqs.txt\")\n    configure_file(${REQUIREMENTS} ${CMAKE_CURRENT_BINARY_DIR}/requirements.txt)\n    # Create venv with system python\n    message(STATUS \"Creating virtual python environment in ${CMAKE_CURRENT_BINARY_DIR}/sigilpy\")\n    execute_process(COMMAND \"${Python3_EXECUTABLE}\" -m venv \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy\")\n    # Update venv pip\n    execute_process(COMMAND \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy/Scripts/python.exe\" -m pip install -U pip)\n    # Pip install -r requirements.txt into venv\n    message(STATUS \"Downloading/installing required python modules into venv using pip requirements file: ${CMAKE_CURRENT_BINARY_DIR}/requirements.txt\")\n    execute_process(COMMAND \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy/Scripts/python.exe\" -m pip install -r \"${CMAKE_CURRENT_BINARY_DIR}/requirements.txt\")\n    # Unset system python so venv python can be found\n    unset(Python3_EXECUTABLE)\nelse()\n    # Try to reuse venv if already present\n    message(STATUS \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy already exists. Will try to use it.\")\n    set (Python3_EXECUTABLE  \"${CMAKE_CURRENT_BINARY_DIR}/sigilpy/Scripts/python.exe\")\nendif()\n"
        }
      ]
    }
  ]
}