{
  "metadata": {
    "timestamp": 1736711336930,
    "page": 35,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "liyupi/sql-generator",
      "stars": 3428,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".eslintrc.js",
          "type": "blob",
          "size": 0.376953125,
          "content": "module.exports = {\n  env: {\n    browser: true,\n    es2021: true,\n    node: true,\n  },\n  extends: [\"plugin:vue/vue3-recommended\", \"plugin:prettier/recommended\"],\n  parserOptions: {\n    ecmaVersion: \"latest\",\n    parser: \"@typescript-eslint/parser\",\n    sourceType: \"module\",\n  },\n  plugins: [\"vue\", \"@typescript-eslint\", \"prettier\"],\n  rules: {\n    \"prettier/prettier\": \"error\",\n  },\n};\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2646484375,
          "content": "# Logs\nlogs\n*.log\npackage-lock.json\nnpm-debug.log*\nyarn-debug.log*\nyarn-error.log*\npnpm-debug.log*\nlerna-debug.log*\n\nnode_modules\ndist\ndist-ssr\n*.local\n\n# Editor directories and files\n.vscode/*\n!.vscode/extensions.json\n.idea\n.DS_Store\n*.suo\n*.ntvs*\n*.njsproj\n*.sln\n*.sw?\n"
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.1552734375,
          "content": "FROM node:18-buster-slim\n\nRUN npm install -g http-server\n\nWORKDIR /src\n\nCOPY . .\n\nRUN npm install\n\nRUN npm run build\n\nEXPOSE 8080\nCMD [ \"http-server\", \"dist\" ]"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.7333984375,
          "content": "# 结构化 SQL 生成器\n\n> 用 JSON 来轻松生成复杂的 SQL，大幅提高写 SQL 的效率！\n> \n> by 程序员鱼皮\n\n在线使用：http://sql.yupi.icu\n\n项目介绍视频：https://www.bilibili.com/video/BV1qa411J7vh/\n\n![工具截图](./doc/assets/main.png)\n\n## 项目作用\n\n1. 将 SQL 的编写逻辑 `结构化` ，像写文章大纲一样编写和阅读 SQL\n2. 重复的 SQL 只需编写一次 ，SQL 变动时修改一处即可\n3. 可以针对某部分 SQL 进行传参和调试\n4. 查看 SQL 语句的引用树和替换过程，便于分析理解 SQL\n\n![查看调用树和替换过程](./doc/assets/invokeTree.png)\n\n## 应用场景\n\n如果你要写一句复杂的 SQL，且 SQL 中很多代码是 **相似** 但又不相同的。那么推荐使用该工具，可以不用重复编写 SQL，更有利于修改、维护和理解。\n\n尤其是在大数据分析场景下，经常会有编写复杂 SQL 的需求。 \n\n> 之所以会有这个轮子，也正是因为鱼皮在工作中要写一句长达 3000 行的 SQL 来离线分析数据，手写真的人要疯了！\n\n当然，你也完全可以把它当做一个 `重复代码生成器` ~\n\n## 示例\n\n需求：计算 id = 1 和 id = 2 的两位同学的身高差\n\nSQL 大概是这样的：\n\n```sql\nselect (s1.height - s2.height) as 身高差\nfrom \n(select * from student where id = 1) s1,\n(select * from student where id = 2) s2\n```\n\n显然，上述 SQL 中学生表查询了 2 次，而且除了查询的 id 不同外，查询逻辑完全一致！\n\n如果后面查询学生的逻辑发生修改，那么以上 2 个子查询都要同时修改，不利于维护。\n\n而使用本工具，只需编写如下 JSON，就能自动生成完整的 SQL 了：\n\n```json\n{\n    \"main\": \"select @身高差() from (@学生表(id = 1)) s1, (@学生表(id = 2)) s2\",\n    \"身高差\": \"(s1.height - s2.height) as 身高差\",\n    \"学生表\": \"select * from student where id = #{id}\"\n}\n```\n\n通过类似 `函数调用 + 传参` 的方式，我们无需重复编写 SQL，而且整个 SQL 的逻辑更清晰！\n\n当然，以上只是一个示例，真实大数据离线分析的场景下，SQL 可比这复杂 N 倍！\n\n如果感兴趣的话，欢迎往下看文档，还有更复杂的示例~\n\n## 优势\n\n1. 支持在线编辑 JSON 和 SQL，支持代码高亮、语法校验、一键格式化、查找和替换、代码块折叠等，体验良好\n2. 支持一键生成 SQL\n3. 支持参数透传，比如 @a(xx = #{yy})，yy 变量可传递给 @a 公式\n4. 支持嵌套传参（将子查询作为参数），比如 @a(xx = @b(yy = 1))\n5. 不限制用户在 JSON 中编写的内容，因此该工具也可以作为重复代码生成器来使用\n6. 支持查看 SQL 语句的调用树和替换详情，便于分析引用关系\n\n## 文档\n\n可以把下面的代码放到生成器中试试，一下就明白如何使用啦~\n\n```json\n{\n  \"main\": \"必填, 代码从这里开始生成, 用 @规则名() 引用其他语句\",\n  \"规则名\": \"可以编写任意 SQL 语句 @规则名2() @动态传参(a = 求给 ||| b = star)\",\n  \"规则名2\": {\n    \"sql\": \"用 #{参数名} 指定可被替换的值\",\n    \"params\": {\n      \"参数名\": \"在 params 中指定静态参数, 会优先被替换\"\n    }\n  },\n  \"动态传参\": \"#{a}鱼皮#{b}\"\n}\n```\n\n### 补充说明\n\n`对象键`：定义 SQL 生成规则名称，main 表示入口 SQL，从该 SQL 语句开始生成。\n\n`对象值`：定义具体生成规则。可以是 SQL 字符串或者对象。\n\n`sql`：定义模板 SQL 语句，可以是任意字符串，比如一组字段、一段查询条件、一段计算逻辑、完整 SQL 等。\n\n`params`：静态参数，解析器会优先将该变量替换到当前语句的 #{变量名} 中\n\n`#{xxx}`：定义可被替换的变量，优先用当前层级 params 替换，否则由外层传递\n\n`@xxx(yy = 1 ||| zz = #{变量})`：引用其他 SQL，可传参，参数可再用变量来表示，使用 |||（三个竖线）来分隔参数。\n\n## 复杂示例\n\n需求：用一句 SQL 查询出以下表格\n\n![](./doc/assets/complex-example.png)\n\n这个表格的难点在哪？\n\n1. 查汇总和查明细的粒度不同，不能用 group by 区分，只能用 union（红色）\n2. 分类列中不同行的数据有交叉，不能用 group by 区分，只能用 union\n3. 每一列由多张表共同 join 而成，且不同分类可关联的表不同，须进行区分（灰色表示无法关联），并将缺失的字段补齐（否则无法 union）\n4. 不同行的同一列计算公式可能不同（蓝色）\n5. 不同列的过滤条件不同（比如最后两列墨绿色是要查全校，其余列只查 1 年级）\n6. 要查询同环比，只能用 2 份完整的数据去 join 然后错位计算来得出\n\n显然，这个表中很多查询逻辑是重复但又不同的。\n\n这么算下来，最后这个 SQL 中到底会包含多少个基础表的 select 呢？每个基础表查询要重复编写多少遍呢？\n\n然而，这个表格也只是鱼皮对实际需求简化后才得来的，实际需求比这还复杂几倍！\n\n可想而知，人工写有多恶心？！\n\n但是使用本工具，只需编写如下结构化的 JSON：\n\n```json\n{\n\t\"main\": \"select (a / b - 1) from (@查整体(date = 今天)) a, (@查整体(date = 昨天)) b\",\n\t\"查整体\": \"@查年级() union @查1班() union @查2班() where date = #{date}\",\n\t\"查年级\": \"@查汇总_性别汇总() union @查汇总_性别分组() union @查汇总_爱好汇总() union @查汇总_爱好分组() union @查汇总_电脑类别汇总() union @查汇总_电脑类别分组()\",\n\t\"查汇总_性别汇总\": \"@查除电脑关联表()\",\n\t\"查汇总_性别分组\": \"@查除电脑关联表() group by 性别\",\n\t\"查汇总_爱好汇总\": \"@查除电脑关联表()\",\n\t\"查汇总_爱好分组\": \"@查除电脑关联表() where 爱好 in (xx) group by 爱好\",\n\t\"查汇总_电脑类别汇总\": \"@查除三连和学习表()\",\n\t\"查汇总_电脑类别分组\": \"@查除三连和学习表() group by 电脑类别\",\n\n\t\"查1班\": \"@查1班_性别汇总() union @查1班_性别分组() union @查1班_爱好汇总() union @查1班_爱好分组() union @查1班_电脑类别汇总() union @查汇总_电脑类别分组()\",\n\t\"查1班_性别汇总\": \"@查除电脑关联表() where 1班\",\n\t\"查1班_性别分组\": \"@查除电脑关联表() where 1班 group by 性别\",\n\t\"查1班_爱好汇总\": \"@查除电脑关联表() where 1班\",\n\t\"查1班_爱好分组\": \"@查除电脑关联表() where 1班 and 爱好 in (xx) group by 爱好\",\n\t\"查1班_电脑类别汇总\": \"@查除三连和学习表() where 1班\",\n\t\"查1班_电脑类别分组\": \"@查除三连和学习表() where 1班 group by 电脑类别\",\n\n\t\"查2班\": \"@查2班_性别汇总() union @查2班_性别分组() union @查2班_电脑类别汇总() union @查2班_电脑类别分组()\",\n\t\"查2班_性别汇总\": \"@查除电脑关联表() where 2班\",\n\t\"查2班_性别分组\": \"@查除电脑关联表() where 2班 group by 性别\",\n\t\"查2班_电脑类别汇总\": \"@查除三连和学习表() where 2班\",\n\t\"查2班_电脑类别分组\": \"@查除三连和学习表() where 2班 group by 电脑类别\",\n\n\t\"查所有关联表\": \"@查信息表() left join (@查三连表()) left join (@查学习表()) left join (@查电脑表()) left join (@查全校信息())\",\n\t\"查除电脑关联表\": \"@查信息表() left join (@查三连表()) left join (@查学习表()) left join (@查全校信息())\",\n\t\"查除三连和学习表\": \"@查信息表() left join (@查电脑表()) left join (@查全校信息())\",\n\t\"查信息表\": \"select 字段 from 信息表 where 年级 = 1\",\n\t\"查三连表\": \"select 字段 from 三连表 where 年级 = 1\",\n\t\"查学习表\": \"select 字段 from 学习表 where 年级 = 1\",\n\t\"查电脑表\": \"select 字段 from 电脑表 where 年级 = 1\",\n\t\"查全校信息\": \"select 字段 from 信息表\"\n}\n```\n\n就能自动生成 SQL 了，还可以查看调用关系，非常清晰：\n\n![](./doc/assets/complex-example-result.png)\n\n\n## 实现\n\n使用和 JSON 相性最好的 JavaScript 来实现，编写一份逻辑 JS 文件，可同时应用于 browser 和 server 端。\n\n功能比较轻量，因此选择优先在纯 browser 端实现。\n\n前端使用 `Vue3 + Vite + Ant Design Vue` 开发界面，选用 `Monaco Editor` 实现代码编辑、高亮、格式化等功能，使用 `TypeScript + ESLint` 保证代码规范。\n\nSQL 生成逻辑如下：\n\n1. JSON 字符串转对象\n2. 从入口开始，先替换 params 静态参数，得到当前层解析\n3. 对 @xxx 语法进行递归解析，递归解析时，优先替换静态参数，再替换外层传来的调用参数\n4. 得到最终 SQL\n\n解析器原本采用正则非贪婪替换方式实现，但无法实现嵌套调用，比如 @a(xx = @b())，会被识别为 @a(xx = @b()，匹配到了最近的右括号。 \n因此针对括号嵌套的情况对子查询替换算法做了优化，已支持包含括号语句的嵌套调用。\n\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "index.html",
          "type": "blob",
          "size": 0.6279296875,
          "content": "<!DOCTYPE html>\n<html lang=\"en\">\n<head>\n  <meta charset=\"UTF-8\" />\n  <link rel=\"icon\" href=\"/favicon.ico\" />\n  <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\" />\n  <title>结构化 SQL 生成器 - by 鱼皮</title>\n  <script>\n    var _hmt = _hmt || [];\n    (function() {\n      var hm = document.createElement(\"script\");\n      hm.src = \"https://hm.baidu.com/hm.js?be2635286331909052a08bcbd3ab3007\";\n      var s = document.getElementsByTagName(\"script\")[0];\n      s.parentNode.insertBefore(hm, s);\n    })();\n  </script>\n</head>\n<body>\n<div id=\"app\"></div>\n<script type=\"module\" src=\"/src/main.ts\"></script>\n</body>\n</html>\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.8974609375,
          "content": "{\n  \"name\": \"sql-generator\",\n  \"private\": true,\n  \"version\": \"0.0.1\",\n  \"scripts\": {\n    \"dev\": \"vite\",\n    \"build\": \"vue-tsc --noEmit && vite build\",\n    \"preview\": \"vite preview\"\n  },\n  \"dependencies\": {\n    \"@ant-design/icons-vue\": \"^6.1.0\",\n    \"ant-design-vue\": \"^3.2.3\",\n    \"monaco-editor\": \"^0.33.0\",\n    \"sql-formatter\": \"^4.0.2\",\n    \"vue\": \"^3.2.25\"\n  },\n  \"devDependencies\": {\n    \"@typescript-eslint/eslint-plugin\": \"^5.23.0\",\n    \"@typescript-eslint/parser\": \"^5.23.0\",\n    \"@vitejs/plugin-vue\": \"^2.3.1\",\n    \"eslint\": \"^8.15.0\",\n    \"eslint-config-prettier\": \"^8.5.0\",\n    \"eslint-config-standard\": \"^17.0.0\",\n    \"eslint-plugin-import\": \"^2.26.0\",\n    \"eslint-plugin-n\": \"^15.2.0\",\n    \"eslint-plugin-prettier\": \"^4.0.0\",\n    \"eslint-plugin-promise\": \"^6.0.0\",\n    \"eslint-plugin-vue\": \"^8.7.1\",\n    \"prettier\": \"2.6.2\",\n    \"typescript\": \"^4.5.4\",\n    \"vite\": \"^2.9.7\",\n    \"vue-tsc\": \"^0.34.7\"\n  }\n}\n"
        },
        {
          "name": "public",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tsconfig.json",
          "type": "blob",
          "size": 0.5341796875,
          "content": "{\n  \"compilerOptions\": {\n    \"target\": \"esnext\",\n    \"useDefineForClassFields\": true,\n    \"module\": \"esnext\",\n    \"moduleResolution\": \"node\",\n    \"strict\": true,\n    \"jsx\": \"preserve\",\n    \"sourceMap\": true,\n    \"resolveJsonModule\": true,\n    \"isolatedModules\": true,\n    \"esModuleInterop\": true,\n    \"lib\": [\n      \"esnext\",\n      \"dom\"\n    ],\n    \"skipLibCheck\": true\n  },\n  \"include\": [\n    \"src/**/*.ts\",\n    \"src/**/*.d.ts\",\n    \"src/**/*.tsx\",\n    \"src/**/*.vue\"\n  ],\n  \"references\": [\n    {\n      \"path\": \"./tsconfig.node.json\"\n    }\n  ]\n}\n"
        },
        {
          "name": "tsconfig.node.json",
          "type": "blob",
          "size": 0.146484375,
          "content": "{\n  \"compilerOptions\": {\n    \"composite\": true,\n    \"module\": \"esnext\",\n    \"moduleResolution\": \"node\"\n  },\n  \"include\": [\n    \"vite.config.ts\"\n  ]\n}\n"
        },
        {
          "name": "vite.config.ts",
          "type": "blob",
          "size": 0.203125,
          "content": "import { defineConfig } from \"vite\";\nimport vue from \"@vitejs/plugin-vue\";\n\n// https://vitejs.dev/config/\nexport default defineConfig({\n  server: {\n    open: true,\n    hmr: true,\n  },\n  plugins: [vue()],\n});\n"
        }
      ]
    }
  ]
}