{
  "metadata": {
    "timestamp": 1736565144198,
    "page": 66,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "alan2207/bulletproof-react",
      "stars": 29314,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.05859375,
          "content": "# dependencies\n/node_modules\n/.pnp\n.pnp.js\n\n# misc\n.DS_Store"
        },
        {
          "name": ".husky",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0458984375,
          "content": "MIT License\n\nCopyright (c) 2024 Alan Alickovic\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.2529296875,
          "content": "# Bulletproof React 🛡️ ⚛️\n\n[![MIT License](https://img.shields.io/github/license/alan2207/bulletproof-react)](https://github.com/alan2207/bulletproof-react/blob/master/LICENSE)\n[![Next.js App CI](https://github.com/alan2207/bulletproof-react/actions/workflows/nextjs-app-ci.yml/badge.svg)](https://github.com/alan2207/bulletproof-react/actions/workflows/nextjs-app-ci.yml)\n[![Next.js Pages CI](https://github.com/alan2207/bulletproof-react/actions/workflows/nextjs-pages-ci.yml/badge.svg)](https://github.com/alan2207/bulletproof-react/actions/workflows/nextjs-pages-ci.yml)\n[![React Vite CI](https://github.com/alan2207/bulletproof-react/actions/workflows/react-vite-ci.yml/badge.svg)](https://github.com/alan2207/bulletproof-react/actions/workflows/react-vite-ci.yml)\n\nA simple, scalable, and powerful architecture for building production ready React applications.\n\n## Introduction\n\nReact is an excellent tool for building front-end applications. It has a diverse ecosystem with hundreds of great libraries for literally anything you might need. However, being forced to make so many choices can be overwhelming. It is also very flexible, you can write React applications in any way you like, but that flexibility comes with a cost. Since there is no pre-defined architecture that developers can follow, it often leads to a messy, inconsistent, and over-complicated codebase.\n\nThis repo attempts to present a way of creating React applications using some of the best tools in the ecosystem with a good project structure that scales very well. Based on my experience working with a lot of different codebases, this architecture turns out to be the most effective.\n\nThe goal here is to serve as a collection of resources and best practices when developing React applications. It is supposed to showcase solving most of the real-world problems of an application in a practical way and help developers write better applications.\n\nFeel free to explore the sample app codebase to get the most value out of the repo.\n\n## What makes a React application \"bulletproof\"?\n\nThis repo doesn't aim to be a silver bullet for all React applications as there are many different use cases, but it tries to provide a solid foundation for building applications based on the following principles:\n\n- Easy to get started with\n- Simple to understand and maintain\n- Uses the right tools for the job\n- Clean boundaries between different parts of the application\n- Everyone on the team is on the same page when it comes to how things are done\n- Secure\n- Performant\n- Scalable in terms of codebase and team size\n- Issues detectable as early as possible\n\n#### Disclaimer:\n\nThis is not supposed to be a template, boilerplate or a framework. It is an opinionated guide that shows how to do some things in a certain way. You are not forced to do everything exactly as it is shown here, decide what works best for you and your team and stay consistent with your style.\n\nTo get most out of it, do not get limited by the technologies used in this sample app, but rather focus on the principles and the concepts that are being presented here. The tools and libraries used here are just a suggestion, you can always replace them with something that fits your needs better. Sometimes, your project might require a slightly different approach, and that's totally fine.\n\n## Table Of Contents:\n\n- [💻 Application Overview](docs/application-overview.md)\n- [⚙️ Project Standards](docs/project-standards.md)\n- [🗄️ Project Structure](docs/project-structure.md)\n- [🧱 Components And Styling](docs/components-and-styling.md)\n- [📡 API Layer](docs/api-layer.md)\n- [🗃️ State Management](docs/state-management.md)\n- [🧪 Testing](docs/testing.md)\n- [⚠️ Error Handling](docs/error-handling.md)\n- [🔐 Security](docs/security.md)\n- [🚄 Performance](docs/performance.md)\n- [🌐 Deployment](docs/deployment.md)\n- [📚 Additional Resources](docs/additional-resources.md)\n\n## Contributing\n\nContributions are always welcome! If you have any ideas, suggestions, fixes, feel free to contribute. You can do that by going through the following steps:\n\n1. Clone this repo\n2. Create a branch: `git checkout -b your-feature`\n3. Execute the `yarn prepare` script.\n4. Make some changes\n5. Test your changes\n6. Push your branch and open a Pull Request\n\n## License\n\n[MIT](/LICENSE)\n"
        },
        {
          "name": "apps",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.3505859375,
          "content": "{\n  \"name\": \"bulletproof-react\",\n  \"private\": true,\n  \"version\": \"1.0.0\",\n  \"description\": \"A simple, scalable, and powerful architecture for building production ready React applications.\",\n  \"scripts\": {\n    \"prepare\": \"cd ./apps/nextjs-app && yarn && cd ../nextjs-pages && yarn && cd ../react-vite && yarn\"\n  },\n  \"author\": \"alan2207\",\n  \"license\": \"MIT\"\n}\n"
        }
      ]
    }
  ]
}