{
  "metadata": {
    "timestamp": 1736711187941,
    "page": 96,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "randyrants/sharpkeys",
      "stars": 6223,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0478515625,
          "content": "\nSharpKeys/.vs/*\nSharpKeys/obj/*\nSharpKeys/bin/*\n"
        },
        {
          "name": "HandyRemapForSurfaceKeyboard.skl",
          "type": "blob",
          "size": 0.0546875,
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.728515625,
          "content": "## Project Description\nSharpKeys is a utility that manages a Registry key that allows Windows to remap one key to any other key. Included in the application is a list of common keyboard keys and a Type Key feature to automatically recognize most keyboard keys. It was originally developed in C# using .NET v2 but has been updated to support .NET 4.0 Client Profile\n\n## Original Mission:\nThis is something that I've thrown together to help people out with their keyboard mappings. What's a keyboard mapping? How many times a day do you accidentally hit cAPS lOCK BY MISTAKE AND END UP HAVING TO GO BAck and retype stuff? For me it was at least once an hour - in fact, I used to pop off the Caps Lock key so I wouldn't hit it anymore, but I found something better in Windows XP, as well as 2000, Server 2003, Vista, Windows 7, Windows 8, and Windows 10. There's a little used registry hack that allows you to remap keys across a keyboard. For me, this meant that I told my computer to treat Caps Lock as if it was a shift key, which it now does. \n\nThe more I started working with other keyboard, the more I wanted to have this ability to map other keys across my keyboard, but working with the Hex numbers and having too look up scan codes could be painful... hence SharpKeys. \n\nSharpKeys is not responsible for any of the keyboard remapping functionality - it simply exposes a Registry key that controls how Windows remaps keys and has been available to us since Windows 2000.  The list of keys that are included in the application are from most of the US-based keyboards that I've used over the years and is not guaranteed to be 100% complete for world keyboards.\n\n## Install\n\n### Manual via web or Microsoft Store\n\nClick the [Releases](https://github.com/randyrants/sharpkeys/releases) button in the header above or get the same MSI from the [Microsoft Store](https://apps.microsoft.com/store/detail/XPFFCG7M673D4F).\n\nNote: that for ARM versions of Windows, please use the ZIP file to get the EXE: the MSI is looking for x64/x86.\n\n### winget\n\nIf you are using [WinGet](https://github.com/microsoft/winget-cli/releases) and want to install the MSI from GitHub\n\n```\nwinget install -e RandyRants.SharpKeys\n```\n\nLikewise you can also install the Microsoft Store version of the app via WinGet by\n\n```\nwinget install -e XPFFCG7M673D4F\n```\n\n### scoop\n\nIf you are using [scoop](https://github.com/lukesampson/scoop)\n\n```\nscoop bucket add extras\nscoop install sharpkeys\n```\n\n## How do I use it?  Getting Started\n* Launch SharpKeys, by selecting its icon from the Start menu. If there are any errors reported, please check the Troubleshooting section below \n* Add a new key mapping or edit an existing one\n* Click \"Write to registry\" and wait for a confirmation that the registry was successfully updated\n* Close SharpKeys and either log out (and back in) or reboot to enforce the new mappings\n\n## Things that SharpKeys _will_ do:\n* Map an entire key to any other key - e.g. you could remap Caps Lock to a Shift key\n* Remap more than one key to one single key - e.g. you could remap every key on a keyboard to the letter Q\n* Force you to look for the Left or Right ALT key in the list of available keys because Type Key cannot scan for ALT\n* Allow you to swap two keys with each other - e.g. you can swap Left Windows with Left Control and vice versa\n\n## Things that SharpKeys **_will not_** do:\n* Map multiple key presses to one key - e.g. it will not support an attempt to remap Ctrl+C to the F5 key\n* Map mouse clicks to any key\n* Support certain hardware keys that never make it to Windows - e.g. Logitech’s volume buttons or most Fn keys\n* Support multiple mappings for different users - the Windows key being tweaked is for an entire machine\n* Protect you from yourself - if you disable your DEL key and can’t login because Ctrl+Alt+Del doesn’t work now, you’ll have to reformat\n\n## Additional FAQ and answers ##\n**Q: Does it run on Windows 11?**  \nA: Yes!\n\n**Q: Can I remap a combination of keys to one key?**  \nA: Sadly, no. SharpKeys only remaps whole keys rather than a modified key. For example, you can remap Ctrl or C but you can't remap Ctrl+C to another key.  That said, the Microsoft PowerToys tool does offer this functionality - you can learn more about their tool here: [Microsoft PowerToys](https://github.com/microsoft/PowerToys/releases).\n\n**Q: Can I remap the Copilot key with SharpKeys?**\nA: No.  The Copilot key's scancode is a combination of Ctrl + Windows + F23 and the Windows technology the SharpKeys exposes only supports remapping an entire key and not a modified combination of the key.\n\n**Q: Can I remap a mouse click to a new key?**  \nA: Sorry, but no. The remapping technology that Windows uses to remap your keys isn't aware of your mouse.\n\n**Q: Why can't I remap my Fn key on my [notebook or Apple] keyboard?**  \nA: Some keys simply just never get to Windows. In the case of most Fn keys, they are interpretted by the hardware and never get passed onto the OS, no matter how they appear to work... if Windows doesn't see the key, there's no way for the key to be remapped by Windows.\n\n**Q: Type a Key shows 00_100 - can I remap this key?**  \nA: 00_100 is a catch all code that Windows reports when a key is captured by hardware or some other driver so there's no way to successfully remap that key, especially since multiple keys can return the same 00_100 code.\n\n**Q: Type a Key shows Unknown Key - can I remap this key?**  \nA: Odds are this is just a key that has never been seen by SharpKeys before so it doesn't know what to do with it. Open an issue on this site for this project and someone from the Open Source community can look into adding it.\n\n**Q: Type a Key shows a code that is E0_nnnn - can I remap this key?**  \n**Q: Type a Key for AltGr shows a code that is E0_2038 - can I remap this key?**  \nA: If a scancode has 6 characters, then it is what is known as a triple-byte scancode which is something that cannot be remapped by the Windows Registry.  To remap a key like this, you'll need an active remapper like Microsoft PowerToys or AutoHotKeys or the app that came with the keyboard (e.g. Logitech's Options) if available.\n\n**Q: I have a new Microsoft keyboard with dedicated keys for Office and Emoji - can I remap those?**  \nA: Not with SharpKeys, as these are both triple-byte codes, but the Microsoft offers keyboard software that can change the function of these keys.  Specifically for the Office key, there is also this additional workaround via [HowToGeek](https://www.howtogeek.com/445318/how-to-remap-the-office-key-on-your-keyboard/).\n\n**Q: What's all this stuff about \"scan codes\"?**  \nA: Whenever you press a key on your keyboard, it sends a binary code to the keyboard controller in you PC. That code is passed on into Windows (in most cases) and Windows interprets it as \"they pressed code 0x3A so that's Caps Lock - turn that on!\" What modern versions of Windows also does is it checks a registry key when the machine boots. What that registry key does is tell windows \"even though they pressed 0x3A, treat it as 0x2A\" (which is left shift). What SharpKeys does is edits this registry key using a simple UI and sidestepping the registry editor.\n\n**Q: I have a new PC that has a hang up button I want to remap - can I remap this key?**  \nA: A lot of people ask for E0_1F65 but as the above question calls out, triple byte scancodes cannot be remapped with the Windows Registry.  This applies to Lenovo, HP, Dell, and any other PC maker's laptop or desktop.\n\n**Q: Type a Key doesn't recognize the Alt key when I type it - how do I remap this key?**  \nA: The Alt key scancode doesn't make it through the system, to get to the Type a Key window.  Basically, when you type Alt, Windows sends it to the system menu and activate it, rather than sending the scancode to the window.  You can still remap this key, but you'll see to select it from the list manually; you'll find it in the grouping of keys marked as \"Special\".\n\n**Q: What is the craziest remapping you've ever done?**  \nA: I think it's my active remapping on Surface products, where some of the cursor navigation keys share space with F9-F12. Since I use F1-F8 for a lot for Office or Visual Studio, I don't want to have to remember to hit Fn but I also don't want to leave Fn-Lock on because I also need Home, End, PgUp, and PgDn as well.  Soooooo, I leave Fn-Lock on and then remapped F9-F12 to Home/End/PgUp/PgDn and then Home/End/PgUp/PgDn to F9-F12.  I also disabled Caps Lock and remapped the Right Alt to Left Windows because that's just happy for a laptop.  Since other people might make use of this, I put [the SKL file in the depot here](https://github.com/randyrants/sharpkeys/blob/master/HandyRemapForSurfaceKeyboard.skl).\n\n**Q: What is an \"Unknown\" key?**  \nA: There's no way I could get a lab of keyboards to test, especially when almost every modern keyboard comes with extra keys or language specific keys - some companies are even making keyboards with special buttons for their own software or product line up. Consequently, when you use Type Key and it hit a key that SharpKeys may not know about, it can still be mapped, even if the label says unknown. If there's a key that you have on your keyboard that is listed as Unknown but you have a used for it, email me and I'll see about adding a better label for it.\n\n**Q: What happens if I use your utility and I add a bunch of key mapping and I can't use my computer anymore?**  \nA: Well, more or less, you're screwed. I've tested this application a good deal, and there's very little risk in modifying this Registry entry, but if you turn off a key you need for your password, you're mostly out of luck.  One option is to **try using the onscreen keyboard that's available via Accessibility** options, as that wouldn't be impacted by remapping settings for Windows.  You can also try to plug in a USB keyboard if you're on a laptop or you can boot into Safe Mode and remove the Scancode Map Registry key, but you'll be on your own. Having said this, please be careful and you're using SharpKeys at your own risk!\n\n**Q: I have to have combo key support or triple-byte enabled keys support! Why won't you make this change?!**  \nA: There is absolutely nothing I can do about it: Windows is remapping the keys and this app is just a UX for the Registry key that controls the remapping.  In fact, I think I answered this already in the FAQ.  That said, if you want a deeper level of remapping support please check out [Microsoft PowerToys](https://github.com/microsoft/PowerToys/releases).\n\n**Q: I have accidentally remapped a key I need to sign in with but I can reboot to safe mode or WinPE and get to a CMD prompt. Can I reset the mappings?**\nA: If you can get to a CMD window. you should be able to open regedit, which will prompt for Administrator rights.  Navigate to `HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Keyboard Layout`, delete the `Scancode Map` value; likewise, if you have an admin CMD prompt open already, you can remove the Registry value by running: \n`reg delete \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Keyboard Layout\" /v \"Scancode Map\"` \nReboot after resetting the Registry value.\n\n## Existing saved keyboard layouts\n* Colemak - [SKL via GitHub](https://github.com/NathanDai5287/Keyboard-Layouts-for-SharpKeys) via [@NathanDai5287](https://github.com/NathanDai5287)\n* Surface - [SKL file described in the FAQ](https://github.com/randyrants/sharpkeys/blob/master/HandyRemapForSurfaceKeyboard.skl)\n\n## Hope for GitHub contributions:\n* A more complete list to support more international keyboards\n* ~~An import/export functionality that allows people to swap keymappings easier~~\n* Continued support for new .NET Frameworks\n\n## Page for donations:\nNot calling attention to this, but [someone asked me to pop the link here](https://github.com/randyrants/sharpkeys/issues/387).  If you're interested, you can get more information [on my blog](https://www.randyrants.com/donate/).\n"
        },
        {
          "name": "SharpKeys",
          "type": "tree",
          "content": null
        },
        {
          "name": "license.md",
          "type": "blob",
          "size": 2.60546875,
          "content": "Ms-PL\r\nMicrosoft Public License (Ms-PL)\r\n\r\nThis license governs use of the accompanying software. If you use the software, you accept this license. If you do not accept the license, do not use the software.\r\n\r\n1. Definitions\r\n\r\nThe terms \"reproduce,\" \"reproduction,\" \"derivative works,\" and \"distribution\" have the same meaning here as under U.S. copyright law.\r\n\r\nA \"contribution\" is the original software, or any additions or changes to the software.\r\n\r\nA \"contributor\" is any person that distributes its contribution under this license.\r\n\r\n\"Licensed patents\" are a contributor's patent claims that read directly on its contribution.\r\n\r\n2. Grant of Rights\r\n\r\n(A) Copyright Grant- Subject to the terms of this license, including the license conditions and limitations in section 3, each contributor grants you a non-exclusive, worldwide, royalty-free copyright license to reproduce its contribution, prepare derivative works of its contribution, and distribute its contribution or any derivative works that you create.\r\n\r\n(B) Patent Grant- Subject to the terms of this license, including the license conditions and limitations in section 3, each contributor grants you a non-exclusive, worldwide, royalty-free license under its licensed patents to make, have made, use, sell, offer for sale, import, and/or otherwise dispose of its contribution in the software or derivative works of the contribution in the software.\r\n\r\n3. Conditions and Limitations\r\n\r\n(A) No Trademark License- This license does not grant you rights to use any contributors' name, logo, or trademarks.\r\n\r\n(B) If you bring a patent claim against any contributor over patents that you claim are infringed by the software, your patent license from such contributor to the software ends automatically.\r\n\r\n(C) If you distribute any portion of the software, you must retain all copyright, patent, trademark, and attribution notices that are present in the software.\r\n\r\n(D) If you distribute any portion of the software in source code form, you may do so only under this license by including a complete copy of this license with your distribution. If you distribute any portion of the software in compiled or object code form, you may only do so under a license that complies with this license.\r\n\r\n(E) The software is licensed \"as-is.\" You bear the risk of using it. The contributors give no express warranties, guarantees or conditions. You may have additional consumer rights under your local laws which this license cannot change. To the extent permitted under your local laws, the contributors exclude the implied warranties of merchantability, fitness for a particular purpose and non-infringement.\r\n"
        }
      ]
    }
  ]
}