{
  "metadata": {
    "timestamp": 1736709464411,
    "page": 100,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "pingcap/talent-plan",
      "stars": 10302,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".circleci",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.3017578125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at [ts-team@pingcap.com](mailto:ts-team@pingcap.com). All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.6640625,
          "content": "# Contributing Guide\n\nThanks for taking the time to contribute to Talent Plan! Contributions of any kind are welcome.\n\n## Ways to contribute\n\nWe love contributions from the community. Here are just a few of the ways you can contribute:\n\n- **Report bugs:** if you find a bug while taking courses, you may want to do a quick check of past issues to see if you can find any help there. Otherwise, create a new bug issue in the course repository using the provided template.\n- **Answer questions:** check out the open issues to see if you can help answer learner questions.\n- **Suggest changes:** this could come in the form of a new learning outcome, updates to the content, updates to the bot responses, or the logic of the course. If you'd like, you can fork the course and suggest the change that way, but most people like to talk about it first in an issue.\n- **Tackle an issue:** if you see an issue you would like to resolve, please feel free to fork the course and submit a PR (check out the instructions below).\n- **Translate a course:** if you have the ability to translate a course, we'd love to see it. Please fork the course and submit a PR. We'll need a second native speaker to confirm the translation so if you have anyone in mind, please @ mention them in your PR for a review.\n\n\n## How to Contribute\n\n1. Check out which [contributions](#ways-to-contribute) above you are willing to make\n1. Fork this repository.\n2. Commit your changes to your branch\n3. Open a pull request to upstream\n4. Request a review from the reviewers\n\nWant to konw more about how to use Git & GitHub to make contributions? Click [how to use Git & GitHub](courses/tp102-how-to-use-git-github.md) courses for more help\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.7734375,
          "content": "# Welcome to learn Talent Plan Courses!\n\n![Talent Plan Logo](media/talent-plan-logo.png)\n\nTalent Plan is an open source training program initiated by PingCAP. It aims to create or combine some open source learning materials for people interested in open source, distributed systems, Rust, Golang, and other infrastructure knowledge. As such, it provides a series of courses focused on open source collaboration, rust programming, distributed database and systems.\n\n> Note:\n\n> Each course is developed by different teams, so they may vary in their organization and learning outcomes. Please see the individual course documentation for details.\n\n## Our Courses\n\n### Series 1: Open Source Collaboration\n\nOpen source collaboration includes a series of open-source related learning materials to help  enthusiasts gain basic knowledge of what open source software is, the differences between existing open-source software licenses, how to participate in open source projects, and what a welcoming open source community looks like. \n\nCourses include:\n\n- [TP 101: Introduction to open source software](courses/tp101-intro-to-oss.md)\n- [TP 102: How to use Git and GitHub](courses/tp102-how-to-use-git-github.md)\n- [TP 103: Build a welcoming community](courses/tp103-open-source-community.md)\n\n### Series 2: Rust Programming\n\nThis series is core to TALENT-PLAN. It builds your understanding of Rust as a programming language and provides opportunities for you to practice with it.\n\nCourses include:\n\n- [TP 201: Practical Networked Applications in Rust](courses/rust/README.md). A series of projects that incrementally develop a single Rust project from the ground up into a high-performance, networked, parallel and asynchronous key/value store. Along the way various real-world Rust development subject matter are explored and discussed.\n\n- [TP 202: Distributed Systems in Rust](courses/dss/README.md). Adapted from the [MIT 6.824](http://nil.csail.mit.edu/6.824/2017/index.html) distributed systems coursework, this course focuses on implementing important distributed algorithms, including the [Raft](https://raft.github.io/) consensus algorithm, and the [Percolator](https://storage.googleapis.com/pub-tools-public-publication-data/pdf/36726.pdf) distributed transaction protocol.\n\n### Series 3: Distributed Database \n\nThis series provides information on TinySQL and TinyKV, which are distributed databases in Go.\n\nCourses include:\n\n- [TP 301: TinySQL, a distributed relational database in Go](https://github.com/pingcap-incubator/tinysql)\n- [TP 302: TinyKV, a distributed key value database in Go](https://github.com/pingcap-incubator/tinykv) \n\n### Series 4: Deep Dive into TiDB Ecosystems \n\nThis series provides information on TiDB and TiKV, which are distributed databases developed by PingCAP.\n\nCourses include:\n\n- TP 401: Deep Dive into TiDB(WIP)\n- TP 402: Deep Dive into TiKV(WIP)\n\n\nSee [Courses](courses/README.md) for more details.\n\n# Contributing to talent plan\n\nContributions of any kind are welcome! Check out the [Contributing Guide](CONTRIBUTING.md) in this repository for more information on how you can contribute to Talent Plan. \n\nWe love our community and take great care to ensure it is fun, safe and rewarding. Please review our [Code of Conduct](/CODE_OF_CONDUCT.md) for community expectations and guidelines for reporting concerns.\n\n\n## We're here to help\n\nIf you have questions about building (or taking) courses, you can ask in the channel **#wg-talent-plan-courses** of the [tidbcommunity](https://tidbcommunity.slack.com/join/shared_invite/enQtNzc0MzI4ODExMDc4LWYwYmIzMjZkYzJiNDUxMmZlN2FiMGJkZjAyMzQ5NGU0NGY0NzI3NTYwMjAyNGQ1N2I2ZjAxNzc1OGUwYWM0NzE#/shared-invite/email) slack workspace.\n\n## License\n\nThese courses may be freely used and modified for any purpose, under the terms of each course's individual license. See the courses for details.\n"
        },
        {
          "name": "courses",
          "type": "tree",
          "content": null
        },
        {
          "name": "media",
          "type": "tree",
          "content": null
        },
        {
          "name": "talent-challenge-program",
          "type": "tree",
          "content": null
        },
        {
          "name": "talent-challenge-program2021",
          "type": "tree",
          "content": null
        },
        {
          "name": "talent-plan-1.0",
          "type": "tree",
          "content": null
        },
        {
          "name": "tidb",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}