{
  "metadata": {
    "timestamp": 1736568003321,
    "page": 138,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "OpenNHP/opennhp",
      "stars": 13526,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.236328125,
          "content": "# Binaries for programs and plugins\r\n*.exe\r\n*.exe~\r\n*.dll\r\n*.so\r\n*.dylib\r\n\r\n# Test binary, build with `go test -c`\r\n*.test\r\n\r\n# Output of the go coverage tool, specifically when used with LiteIDE\r\n*.out\r\n\r\n# Go workspace\r\ngo.sum\r\n\r\nrelease/\r\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.0966796875,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\nopennhp@gmail.com.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 3.6083984375,
          "content": "export GO111MODULE := on\n\nall: generate-version-and-build\n\n# Repo settings\nGIT_REPO = github.com/OpenNHP/opennhp\n\n# Version and build settings\nMAKEFLAGS += --no-print-directory\nOS_NAME = $(shell uname -s | tr A-Z a-z)\n\n# Version number auto increment \nTIMESTAMP=$(shell date +%y%m%d%H%M%S)\nVERSION = $(shell cat version/VERSION).$(TIMESTAMP)\n# Other version settings\nCOMMIT_ID = $(shell git show -s --format=%H)\nCOMMIT_TIME = $(shell git show -s --format=%cd --date=format:'%Y-%m-%d %H:%M:%S')\nBUILD_TIME = $(shell date \"+%Y-%m-%d %H:%M:%S\")\n# Built Package File Name\nPACKAGE_FILE = opennhp-$(VERSION).tar.gz\n# Go build flags\nLD_FLAGS = \"-s -w -X '${GIT_REPO}/version.Version=${VERSION}' -X '${GIT_REPO}/version.CommitId=${COMMIT_ID}' -X '${GIT_REPO}/version.CommitTime=${COMMIT_TIME}' -X '${GIT_REPO}/version.BuildTime=${BUILD_TIME}'\"\n\n# Color definition\nCOLOUR_GREEN=\\033[0;32m\nCOLOUR_RED=\\033[0;31m\nCOLOUR_BLUE=\\033[0;34m\nEND_COLOUR=\\033[0m\n\n# Plugins\nNHP_PLUGINS = server/plugins\n\ngenerate-version-and-build:\n\t@echo \"$(COLOUR_BLUE)[OpenNHP] Start building... $(END_COLOUR)\"\n\t@echo \"$(COLOUR_BLUE)Version: ${VERSION} $(END_COLOUR)\"\n\t@echo \"$(COLOUR_BLUE)Commit id: ${COMMIT_ID} $(END_COLOUR)\"\n\t@echo \"$(COLOUR_BLUE)Commit time: ${COMMIT_TIME} $(END_COLOUR)\"\n\t@echo \"$(COLOUR_BLUE)Build time: ${BUILD_TIME} $(END_COLOUR)\"\n\t@$(MAKE) init\n\t@$(MAKE) agentd\n\t@$(MAKE) acd\n\t@$(MAKE) serverd\n\t@$(MAKE) kgc\n\t@$(MAKE) agentsdk\n\t@$(MAKE) devicesdk\n\t@$(MAKE) plugins\n\t@$(MAKE) archive\n\t@echo \"$(COLOUR_GREEN)[OpenNHP] Build for platform ${OS_NAME} successfully done!$(END_COLOUR)\"\n\ninit:\n\tgit clean -df release\n\tgo mod tidy\n\nagentd:\n\tgo build -trimpath -ldflags ${LD_FLAGS} -v -o ./release/nhp-agent/nhp-agentd ./agent/main/main.go\n\tcp ./agent/main/etc/*.toml ./release/nhp-agent/etc/\n\nacd:\n\tgo build -trimpath -ldflags ${LD_FLAGS} -v -o ./release/nhp-ac/nhp-acd ./ac/main/main.go\n\tcp ./ac/main/etc/*.toml ./release/nhp-ac/etc/\n\nserverd:\n\tgo build -trimpath -ldflags ${LD_FLAGS} -v -o ./release/nhp-server/nhp-serverd ./server/main/main.go\n\tmkdir -p ./release/nhp-server/etc\n\tcp ./server/main/etc/*.toml ./release/nhp-server/etc/\n\nkgc:\n\t@echo \"$(COLOUR_BLUE)[KGC] Building KGC module... $(END_COLOUR)\"\n\tmkdir -p ./release/kgc/etc\n\t@cd kgc/main && go build -trimpath -ldflags ${LD_FLAGS} -v -o ../../release/kgc/kgc ./main.go\n\tcp ./kgc/main/etc/*.toml ./release/kgc/etc/ 2>/dev/null || true\n\t@echo \"$(COLOUR_GREEN)[KGC] Build completed!$(END_COLOUR)\"\n\n\nagentsdk:\nifeq ($(OS_NAME), linux)\n\tgo build -a -trimpath -buildmode=c-shared -ldflags ${LD_FLAGS} -v -o ./release/nhp-agent/nhp-agent.so ./agent/main/main.go ./agent/main/export.go\n\tgcc ./agent/sdkdemo/nhp-agent-demo.c -I ./release/nhp-agent -l:nhp-agent.so -L./release/nhp-agent -Wl,-rpath=. -o ./release/nhp-agent/nhp-agent-demo\nendif\n\ndevicesdk:\nifeq ($(OS_NAME), linux)\n\tgo build -a -trimpath -buildmode=c-shared -ldflags ${LD_FLAGS} -v -o ./release/nhp-device/nhpdevice.so ./core/main/main.go ./core/main/nhpdevice.go\n#\tgcc ./core/sdkdemo/nhp-device-demo.c -I ./release/nhp-device -I ./core/main -l:nhpdevice.so -L./release/nhp-device -Wl,-rpath=. -o ./release/nhp-device/nhp-device-demo\nendif\n\nplugins:\n\t@if test -d $(NHP_PLUGINS); then $(MAKE) -C $(NHP_PLUGINS); fi\n\ntest:\n\t@echo \"[OpenNHP] Runing Tests for the Output Binaries ...\"\n\t@echo \"$(COLOUR_GREEN)[OpenNHP] All Tests Are Done!$(END_COLOUR)\"\n\narchive:\n\t@echo \"$(COLOUR_BLUE)[OpenNHP] Start archiving... $(END_COLOUR)\"\n\t@cd release && mkdir -p archive && tar -czvf ./archive/$(PACKAGE_FILE) nhp-agent nhp-ac nhp-server\n\t@echo \"$(COLOUR_GREEN)[OpenNHP] Package ${PACKAGE_FILE} archived!$(END_COLOUR)\"\n\n.PHONY: all generate-version-and-build init agentsdk devicesdk plugins test archive \n"
        },
        {
          "name": "README.de.md",
          "type": "blob",
          "size": 18.9404296875,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\r\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\r\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\r\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\r\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\r\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\r\n\r\n![OpenNHP Logo](docs/images/logo11.png)\r\n# OpenNHP: Zero Trust Netzwerk-Infrastruktur-Verbergungsprotokoll\r\nEin leichtgewichtiges, kryptographisch getriebenes Zero Trust Netzwerkprotokoll auf der OSI-Schicht 5, um Ihren Server und Ihre Daten vor Angreifern zu verbergen.\r\n\r\n![Build Status](https://img.shields.io/badge/build-passing-brightgreen)\r\n![Version](https://img.shields.io/badge/version-1.0.0-blue)\r\n![Lizenz](https://img.shields.io/badge/license-Apache%202.0-green)\r\n\r\n---\r\n\r\n## Herausforderung: KI verwandelt das Internet in einen \"Dunklen Wald\"\r\n\r\nDer schnelle Fortschritt der **KI**-Technologien, insbesondere gro른r Sprachmodelle (LLMs), ver칛ndert die Cybersicherheitslandschaft erheblich. Das Aufkommen der **autonomen Ausnutzung von Schwachstellen (AVE)** stellt einen gro른n Fortschritt im KI-Zeitalter dar, indem es die Ausnutzung von Schwachstellen automatisiert, wie in [diesem Forschungspapier](https://arxiv.org/abs/2404.08144) gezeigt wird. Diese Entwicklung erh칬ht das Risiko f칲r alle exponierten Netzwerkdienste erheblich und erinnert an die [Dunkle Wald-Hypothese](https://de.wikipedia.org/wiki/Dunkler_Wald) des Internets. KI-gesteuerte Tools scannen kontinuierlich die digitale Umgebung, identifizieren schnell Schwachstellen und nutzen sie aus. Folglich entwickelt sich das Internet zu einem **\"dunklen Wald\"**, in dem **Sichtbarkeit Verwundbarkeit bedeutet**.\r\n\r\n![Verwundbarkeitsrisiken](docs/images/Vul_Risks.png)\r\n\r\nGartner prognostiziert einen [schnellen Anstieg von KI-gesteuerten Cyberangriffen](https://www.gartner.com/en/newsroom/press-releases/2024-08-28-gartner-forecasts-global-information-security-spending-to-grow-15-percent-in-2025). Dieser Wandel erfordert eine Neubewertung traditioneller Cybersicherheitsstrategien mit einem Fokus auf proaktive Verteidigungsma릁ahmen, schnelle Reaktionsmechanismen und die Einf칲hrung von Netzwerkverbergungstechnologien zum Schutz kritischer Infrastrukturen.\r\n\r\n---\r\n\r\n## Schnelle Demo: OpenNHP in Aktion sehen\r\n\r\nBevor wir in die Details von OpenNHP eintauchen, beginnen wir mit einer kurzen Demonstration, wie OpenNHP einen Server vor unbefugtem Zugriff sch칲tzt. Sie k칬nnen dies in Aktion sehen, indem Sie den gesch칲tzten Server unter https://acdemo.opennhp.org aufrufen.\r\n\r\n### 1) Der gesch칲tzte Server ist f칲r nicht authentifizierte Benutzer \"unsichtbar\"\r\n\r\nStandardm칛를g f칲hrt jeder Versuch, eine Verbindung zum gesch칲tzten Server herzustellen, zu einem TIME OUT-Fehler, da alle Ports geschlossen sind, wodurch der Server *\"unsichtbar\"* und scheinbar offline wird.\r\n\r\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo0.png)\r\n\r\nDas Scannen der Ports des Servers f칲hrt ebenfalls zu einem TIME OUT-Fehler.\r\n\r\n![OpenNHP Demo](docs/images/OpenNHP_ScanDemo.png)\r\n\r\n### 2) Nach der Authentifizierung wird der gesch칲tzte Server zug칛nglich\r\n\r\nOpenNHP unterst칲tzt eine Vielzahl von Authentifizierungsmethoden, wie OAuth, SAML, QR-Codes und mehr. F칲r diese Demonstration verwenden wir einen einfachen Benutzernamen/Passwort-Authentifizierungsdienst unter https://demologin.opennhp.org.\r\n\r\n![OpenNHP Demo](docs/images/OpenNHP_DemoLogin.png)\r\n\r\nSobald Sie auf die Schaltfl칛che \"Login\" klicken, ist die Authentifizierung erfolgreich und Sie werden zum gesch칲tzten Server weitergeleitet. Zu diesem Zeitpunkt wird der Server *\"sichtbar\"* und auf Ihrem Ger칛t zug칛nglich.\r\n\r\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo1.png)\r\n\r\n---\r\n\r\n## Vision: Das Internet vertrauensw칲rdig machen\r\n\r\nDie Offenheit der TCP/IP-Protokolle hat das explosive Wachstum von Internetanwendungen vorangetrieben, aber auch Schwachstellen offengelegt, die es b칬swilligen Akteuren erm칬glichen, unbefugten Zugriff zu erhalten und jede exponierte IP-Adresse auszunutzen. Obwohl das [OSI-Netzwerkmodell](https://de.wikipedia.org/wiki/OSI-Modell) die *5. Schicht (Sitzungsschicht)* zur Verwaltung von Verbindungen definiert, wurden bisher nur wenige effektive L칬sungen hierf칲r implementiert.\r\n\r\n**NHP**, oder das **\"Netzwerk-Infrastruktur-Verbergungsprotokoll\"**, ist ein leichtgewichtiges, kryptographisch getriebenes Zero Trust Netzwerkprotokoll, das auf der *OSI-Sitzungsschicht* arbeitet und sich ideal zur Verwaltung der Netzwerkvisibilit칛t und Verbindungen eignet. Das Hauptziel von NHP ist es, gesch칲tzte Ressourcen vor unbefugten Entit칛ten zu verbergen und den Zugriff nur verifizierten, autorisierten Benutzern durch kontinuierliche 칖berpr칲fung zu gew칛hren, um so zu einem vertrauensw칲rdigeren Internet beizutragen.\r\n\r\n![Vertrauensw칲rdiges Internet](docs/images/TrustworthyCyberspace.png)\r\n\r\n---\r\n\r\n## L칬sung: OpenNHP stellt die Kontrolle 칲ber die Netzwerkvisibilit칛t wieder her\r\n\r\n**OpenNHP** ist die Open-Source-Implementierung des NHP-Protokolls. Es basiert auf der Kryptographie und wurde mit Sicherheitsprinzipien im Vordergrund entwickelt, um eine echte Zero Trust-Architektur auf der *OSI-Sitzungsschicht* zu implementieren.\r\n\r\n![OpenNHP als OSI 5. Schicht](docs/images/OSI_OpenNHP.png)\r\n\r\nOpenNHP baut auf fr칲heren Forschungen zur Netzwerkverbergungstechnologie auf und nutzt moderne kryptographische Rahmenwerke und Architektur, um Sicherheit und hohe Leistung zu gew칛hrleisten und die Einschr칛nkungen fr칲herer Technologien zu 칲berwinden.\r\n\r\n| Netzwerk-Infrastruktur-Verbergungsprotokoll | 1. Generation | 2. Generation | 3. Generation |\r\n|:---|:---|:---|:---|\r\n| **Kerntechnologie** | [Port Knocking](https://de.wikipedia.org/wiki/Port_knocking) | [Single Packet Authorization (SPA)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) | Netzwerk-Infrastruktur-Verbergungsprotokoll (NHP) |\r\n| **Authentifizierung** | Port-Sequenzen | Geteilte Geheimnisse | Modernes Kryptographie-Rahmenwerk |\r\n| **Architektur** | Kein Kontrollplan | Kein Kontrollplan | Skalierbarer Kontrollplan |\r\n| **F칛higkeit** | Ports verbergen | Ports verbergen | Ports, IPs und Domains verbergen |\r\n| **Zugriffskontrolle** | IP-Ebene | Port-Ebene | Anwendungsebene |\r\n| **Open-Source-Projekte** | [knock](https://github.com/jvinet/knock) *(C)* | [fwknop](https://github.com/mrash/fwknop) *(C++)* | [OpenNHP](https://github.com/OpenNHP/opennhp) *(Go)* |\r\n\r\n> Es ist entscheidend, eine **speichersichere** Sprache wie *Go* f칲r die Entwicklung von OpenNHP zu w칛hlen, wie im [technischen Bericht der US-Regierung](https://www.whitehouse.gov/wp-content/uploads/2024/02/Final-ONCD-Technical-Report.pdf) betont wird. F칲r einen detaillierten Vergleich zwischen **SPA und NHP** lesen Sie bitte die [Abschnitt unten](#comparison-between-spa-and-nhp).\r\n\r\n## Sicherheitsvorteile\r\n\r\nDa OpenNHP Zero Trust-Prinzipien auf der *OSI-Sitzungsschicht* implementiert, bietet es erhebliche Vorteile:\r\n\r\n- Reduziert die Angriffsfl칛che durch Verbergen der Infrastruktur\r\n- Verhindert unbefugte Netzwerkaufkl칛rung\r\n- Mildert die Ausnutzung von Schwachstellen\r\n- Verhindert Phishing durch verschl칲sseltes DNS\r\n- Sch칲tzt vor DDoS-Angriffen\r\n- Erm칬glicht granulare Zugriffskontrolle\r\n- Bietet verbindungsbasierte Identit칛tsverfolgung\r\n- Angriffszurechnung\r\n\r\n## Architektur\r\n\r\nDie Architektur von OpenNHP orientiert sich an der [NIST Zero Trust-Architektur](https://www.nist.gov/publications/zero-trust-architecture). Sie folgt einem modularen Design mit drei Hauptkomponenten: **NHP-Server**, **NHP-AC** und **NHP-Agent**, wie in der folgenden Abbildung dargestellt.\r\n\r\n![OpenNHP Architektur](docs/images/OpenNHP_Arch.png)\r\n\r\n> Weitere Informationen zur Architektur und zum Workflow finden Sie in der [OpenNHP-Dokumentation](https://opennhp.org/).\r\n\r\n## Kern: Kryptographische Algorithmen\r\n\r\nKryptographie steht im Mittelpunkt von OpenNHP und bietet robuste Sicherheit, hervorragende Leistung und Skalierbarkeit durch den Einsatz modernster kryptographischer Algorithmen. Nachfolgend sind die wichtigsten kryptographischen Algorithmen und Frameworks aufgef칲hrt, die von OpenNHP verwendet werden:\r\n\r\n- **[Elliptische Kurvenkryptographie (ECC)](https://de.wikipedia.org/wiki/Elliptische-Kurven-Kryptographie)**: Wird f칲r effiziente asymmetrische Kryptographie verwendet.\r\n\r\n> Im Vergleich zu RSA bietet ECC eine h칬here Effizienz mit st칛rkerer Verschl칲sselung bei k칲rzeren Schl칲ssell칛ngen, was sowohl die Netzwerk칲bertragung als auch die Rechenleistung verbessert. Die folgende Tabelle zeigt die Unterschiede in der Sicherheitsst칛rke, den Schl칲ssell칛ngen und dem Verh칛ltnis zwischen RSA und ECC sowie die jeweiligen G칲ltigkeitszeitr칛ume.\r\n\r\n| Sicherheitsst칛rke (Bits) | DSA/RSA-Schl칲ssell칛nge (Bits) | ECC-Schl칲ssell칛nge (Bits) | Verh칛ltnis: ECC zu DSA/RSA | G칲ltigkeit |\r\n|:------------------------:|:-----------------------------:|:------------------------:|:--------------------------:|:---------:|\r\n| 80                       | 1024                          | 160-223                  | 1:6                        | Bis 2010  |\r\n| 112                      | 2048                          | 224-255                  | 1:9                        | Bis 2030  |\r\n| 128                      | 3072                          | 256-383                  | 1:12                       | Nach 2031 |\r\n| 192                      | 7680                          | 384-511                  | 1:20                       |           |\r\n| 256                      | 15360                         | 512+                     | 1:30                       |           |\r\n\r\n- **[Noise Protocol Framework](https://noiseprotocol.org/)**: Erm칬glicht sicheren Schl칲sselaustausch, Nachrichtenverschl칲sselung/-entschl칲sselung und gegenseitige Authentifizierung.\r\n\r\n> Das Noise-Protokoll basiert auf dem [Diffie-Hellman-Schl칲sselaustausch](https://de.wikipedia.org/wiki/Diffie-Hellman-Schl%C3%BCsselaustausch) und bietet moderne kryptographische L칬sungen wie gegenseitige und optionale Authentifizierung, Identit칛tsverbergung, Vorw칛rtsgeheimnis und null Round-Trip-Verschl칲sselung. Es hat sich bereits durch seine Sicherheit und Leistung bew칛hrt und wird von beliebten Anwendungen wie [WhatsApp](https://www.whatsapp.com/security/WhatsApp-Security-Whitepaper.pdf), [Slack](https://github.com/slackhq/nebula) und [WireGuard](https://www.wireguard.com/) verwendet.\r\n\r\n- **[Identit칛tsbasierte Kryptographie (IBC)](https://de.wikipedia.org/wiki/Identit%C3%A4tsbasierte_Kryptographie)**: Vereinfacht die Schl칲sselverteilung im gro른n Ma릅tab.\r\n\r\n> Eine effiziente Schl칲sselverteilung ist entscheidend f칲r die Umsetzung von Zero Trust. OpenNHP unterst칲tzt sowohl PKI als auch IBC. W칛hrend PKI seit Jahrzehnten weit verbreitet ist, h칛ngt es von zentralisierten Zertifizierungsstellen (CA) zur Identit칛tspr칲fung und Schl칲sselverwaltung ab, was zeitaufw칛ndig und kostspielig sein kann. Im Gegensatz dazu erm칬glicht IBC einen dezentralisierten und selbstverwalteten Ansatz f칲r die Identit칛tspr칲fung und Schl칲sselverwaltung, was es kosteng칲nstiger f칲r die Zero Trust-Umgebung von OpenNHP macht, in der Milliarden von Ger칛ten oder Servern in Echtzeit gesch칲tzt und eingebunden werden m칲ssen.\r\n\r\n- **[Zertifikatslose Kryptographie (CL-PKC)](https://de.wikipedia.org/wiki/Zertifikatslose_Kryptographie)**: Empfohlener IBC-Algorithmus\r\n\r\n> CL-PKC ist ein Schema, das die Sicherheit verbessert, indem es die Schl칲sselverwaltung vermeidet und die Einschr칛nkungen der identit칛tsbasierten Kryptographie (IBC) angeht. In den meisten IBC-Systemen wird der private Schl칲ssel eines Benutzers von einer Schl칲sselgenerierungsstelle (KGC) erstellt, was erhebliche Risiken birgt. Ein kompromittierter KGC kann zur Offenlegung der privaten Schl칲ssel aller Benutzer f칲hren, wodurch volles Vertrauen in den KGC erforderlich ist. CL-PKC mindert dieses Problem, indem der Schl칲sselerstellungsprozess aufgeteilt wird, sodass der KGC nur einen Teil des privaten Schl칲ssels kennt. Dadurch kombiniert CL-PKC die St칛rken von PKI und IBC und bietet eine st칛rkere Sicherheit ohne die Nachteile der zentralisierten Schl칲sselverwaltung.\r\n\r\nWeiterf칲hrende Informationen:\r\n\r\n> Weitere Details zu den in OpenNHP verwendeten kryptographischen Algorithmen finden Sie in der [OpenNHP-Dokumentation](https://opennhp.org/cryptography/).\r\n\r\n## Hauptfunktionen\r\n\r\n- Mildert die Ausnutzung von Schwachstellen, indem standardm칛를g \"deny-all\"-Regeln angewendet werden\r\n- Verhindert Phishing-Angriffe durch verschl칲sselte DNS-Aufl칬sung\r\n- Sch칲tzt vor DDoS-Angriffen, indem die Infrastruktur verborgen wird\r\n- Erm칬glicht Angriffszurechnung durch identit칛tsbasierte Verbindungen\r\n- Standardm칛를g verweigerter Zugriff auf alle gesch칲tzten Ressourcen\r\n- Authentifizierung basierend auf Identit칛t und Ger칛ten vor dem Netzwerkzugang\r\n- Verschl칲sselte DNS-Aufl칬sung, um DNS-Hijacking zu verhindern\r\n- Verteilte Infrastruktur zur Minderung von DDoS-Angriffen\r\n- Skalierbare Architektur mit entkoppelten Komponenten\r\n- Integration mit bestehenden Systemen zur Verwaltung von Identit칛ten und Zugriffen\r\n- Unterst칲tzung f칲r verschiedene Bereitstellungsmodelle (Client-zu-Gateway, Client-zu-Server usw.)\r\n- Kryptographisch sicher unter Verwendung moderner Algorithmen (ECC, Noise Protocol, IBC)\r\n\r\n<details>\r\n<summary>Klicken Sie hier, um die Funktionsdetails zu erweitern</summary>\r\n\r\n- **Standardm칛를g verweigerter Zugriff**: Alle Ressourcen sind standardm칛를g verborgen und werden nur nach Authentifizierung und Autorisierung zug칛nglich.\r\n- **Authentifizierung basierend auf Identit칛t und Ger칛ten**: Stellt sicher, dass nur bekannte Benutzer auf zugelassenen Ger칛ten Zugriff erhalten.\r\n- **Verschl칲sselte DNS-Aufl칬sung**: Verhindert DNS-Hijacking und damit verbundene Phishing-Angriffe.\r\n- **DDoS-Minderung**: Das verteilte Infrastruktursystem hilft beim Schutz vor DDoS-Angriffen.\r\n- **Skalierbare Architektur**: Entkoppelte Komponenten erm칬glichen flexiblen Einsatz und Skalierung.\r\n- **IAM-Integration**: Funktioniert mit Ihren bestehenden Systemen zur Verwaltung von Identit칛ten und Zugriffen.\r\n- **Flexibler Einsatz**: Unterst칲tzt verschiedene Modelle, einschlie륿ich Client-zu-Gateway, Client-zu-Server und mehr.\r\n- **Starke Kryptographie**: Nutzt moderne Algorithmen wie ECC, Noise Protocol und IBC f칲r robuste Sicherheit.\r\n</details>\r\n\r\n## Bereitstellung\r\n\r\nOpenNHP unterst칲tzt mehrere Bereitstellungsmodelle f칲r unterschiedliche Anwendungsf칛lle:\r\n\r\n- Client-zu-Gateway: Sichert den Zugriff auf mehrere Server hinter einem Gateway\r\n- Client-zu-Server: Sichert direkt einzelne Server/Anwendungen\r\n- Server-zu-Server: Sichert die Kommunikation zwischen Backend-Diensten\r\n- Gateway-zu-Gateway: Sichert Standort-zu-Standort-Verbindungen\r\n\r\n> Weitere Details zur Bereitstellung finden Sie in der [OpenNHP-Dokumentation](https://opennhp.org/deploy/).\r\n\r\n## Vergleich zwischen SPA und NHP\r\nDas Single Packet Authorization (SPA)-Protokoll ist in der vom [Cloud Security Alliance (CSA)](https://cloudsecurityalliance.org/) ver칬ffentlichten [Software Defined Perimeter (SDP)-Spezifikation](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) enthalten. NHP verbessert die Sicherheit, Zuverl칛ssigkeit, Skalierbarkeit und Erweiterbarkeit durch ein modernes kryptographisches Framework und eine moderne Architektur, wie im [AHAC-Forschungspapier](https://www.mdpi.com/2076-3417/14/13/5593) gezeigt.\r\n\r\n| - | SPA | NHP | Vorteile von NHP |\r\n|:---|:---|:---|:---|\r\n| **Architektur** | Das SPA-Paketentschl칲sselungs- und Benutzer-/Ger칛teauthentifizierungskomponente ist mit der Netzwerkzugriffskontrollkomponente im SPA-Server gekoppelt. | NHP-Server (die Paketentschl칲sselungs- und Benutzer-/Ger칛teauthentifizierungskomponente) und NHP-AC (die Zugriffskontrollkomponente) sind entkoppelt. Der NHP-Server kann auf separaten Hosts bereitgestellt werden und unterst칲tzt horizontale Skalierung. | <ul><li>Performance: Die ressourcenintensive Komponente NHP-Server ist vom gesch칲tzten Server getrennt.</li><li>Skalierbarkeit: Der NHP-Server kann im verteilten oder Cluster-Modus bereitgestellt werden.</li><li>Sicherheit: Die IP-Adresse des gesch칲tzten Servers ist f칲r den Client nicht sichtbar, solange die Authentifizierung nicht erfolgreich war.</li></ul>|\r\n| **Kommunikation** | Einfache Richtung | Bidirektional | Bessere Zuverl칛ssigkeit durch Statusbenachrichtigung der Zugriffskontrolle |\r\n| **Kryptographisches Framework** | Geteilte Geheimnisse | PKI oder IBC, Noise Framework | <ul><li>Sicherheit: Bew칛hrter Schl칲sselvereinbarungsmechanismus zur Abschw칛chung von MITM-Bedrohungen</li><li>Niedrige Kosten: Effiziente Schl칲sselverteilung f칲r das Zero Trust-Modell</li><li>Performance: Hochleistungs-Verschl칲sselung/Entschl칲sselung</li></ul>|\r\n| **F칛higkeit zur Verbergung der Netzwerkinfrastruktur** | Nur Serverports | Domains, IPs und Ports | St칛rker gegen verschiedene Angriffe (z.B. Schwachstellen, DNS-Hijacking und DDoS-Angriffe) |\r\n| **Erweiterbarkeit** | Keine, nur f칲r SDP | Universell | Unterst칲tzt jedes Szenario, das eine Dienstverschleierung erfordert |\r\n| **Interoperabilit칛t** | Nicht verf칲gbar | Anpassbar | NHP kann nahtlos mit bestehenden Protokollen (z.B. DNS, FIDO usw.) integriert werden |\r\n\r\n## Beitrag leisten\r\n\r\nWir begr칲른n Beitr칛ge zu OpenNHP! Bitte lesen Sie unsere [Beitragsrichtlinien](CONTRIBUTING.md), um mehr dar칲ber zu erfahren, wie Sie sich beteiligen k칬nnen.\r\n\r\n## Lizenz\r\n\r\nOpenNHP wird unter der [Apache 2.0-Lizenz](LICENSE) ver칬ffentlicht.\r\n\r\n## Kontakt\r\n\r\n- Projekt-Website: [https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\r\n- E-Mail: [opennhp@gmail.com](mailto:opennhp@gmail.com)\r\n- Slack-Kanal: [Treten Sie unserem Slack bei](https://slack.opennhp.org)\r\n\r\nF칲r eine detaillierte Dokumentation besuchen Sie bitte unsere [Offizielle Dokumentation](https://opennhp.org).\r\n\r\n## Referenzen\r\n\r\n- [Software-Defined Perimeter (SDP) Specification v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2). Jason Garbis, Juanita Koilpillai, Junaid lslam, Bob Flores, Daniel Bailey, Benfeng Chen, Eitan Bremler, Michael Roza, Ahmed Refaey Hussein. [*Cloud Security Alliance (CSA)*](https://cloudsecurityalliance.org/). M칛rz 2022.\r\n- [AHAC: Fortschrittliches Netzwerk-Verbergung-Zugriffskontroll-Framework](https://www.mdpi.com/2076-3417/14/13/5593). Mudi Xu, Benfeng Chen, Zhizhong Tan, Shan Chen, Lei Wang, Yan Liu, Tai Io San, Sou Wang Fong, Wenyong Wang und Jing Feng. *Zeitschrift f칲r Angewandte Wissenschaften*. Juni 2024.\r\n- Noise Protocol Framework. https://noiseprotocol.org/\r\n- Vulnerability Management Framework-Projekt. https://phoenix.security/web-vuln-management/\r\n\r\n---\r\n\r\n游 Vielen Dank f칲r Ihr Interesse an OpenNHP! Wir freuen uns auf Ihre Beitr칛ge und Ihr Feedback.\r\n\r\n"
        },
        {
          "name": "README.es.md",
          "type": "blob",
          "size": 19.0947265625,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\r\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\r\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\r\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\r\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\r\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\r\n\r\n![Logo OpenNHP](docs/images/logo11.png)\r\n# OpenNHP: Protocolo de Ocultaci칩n de Infraestructura de Red Zero Trust\r\nUn protocolo de red de confianza cero impulsado por criptograf칤a en la capa 5 del modelo OSI para ocultar su servidor y sus datos de los atacantes.\r\n\r\n![Estado de Construcci칩n](https://img.shields.io/badge/build-passing-brightgreen)\r\n![Versi칩n](https://img.shields.io/badge/version-1.0.0-blue)\r\n![Licencia](https://img.shields.io/badge/license-Apache%202.0-green)\r\n\r\n---\r\n\r\n## Desaf칤o: La IA transforma Internet en un \"Bosque Oscuro\"\r\n\r\nEl r치pido avance de las tecnolog칤as de **IA**, especialmente los grandes modelos de lenguaje (LLM), est치 transformando significativamente el panorama de la ciberseguridad. El surgimiento de la **Explotaci칩n Aut칩noma de Vulnerabilidades (AVE)** representa un gran avance en la era de la IA, al automatizar la explotaci칩n de vulnerabilidades, como se muestra en [este art칤culo de investigaci칩n](https://arxiv.org/abs/2404.08144). Este desarrollo aumenta significativamente el riesgo para todos los servicios de red expuestos, evocando la [Hip칩tesis del Bosque Oscuro](https://es.wikipedia.org/wiki/Hip%C3%B3tesis_del_bosque_oscuro) en Internet. Las herramientas impulsadas por IA escanean continuamente el entorno digital, identifican r치pidamente las debilidades y las explotan. Como resultado, Internet est치 evolucionando hacia un **\"bosque oscuro\"** donde **la visibilidad equivale a vulnerabilidad**.\r\n\r\n![Riesgos de Vulnerabilidad](docs/images/Vul_Risks.png)\r\n\r\nLa investigaci칩n de Gartner pronostica un [r치pido aumento de los ciberataques impulsados por IA](https://www.gartner.com/en/newsroom/press-releases/2024-08-28-gartner-forecasts-global-information-security-spending-to-grow-15-percent-in-2025). Este cambio de paradigma requiere una reevaluaci칩n de las estrategias tradicionales de ciberseguridad, con un enfoque en defensas proactivas, mecanismos de respuesta r치pida y la adopci칩n de tecnolog칤as de ocultaci칩n de red para proteger la infraestructura cr칤tica.\r\n\r\n---\r\n\r\n## Demostraci칩n r치pida: Ver OpenNHP en acci칩n\r\n\r\nAntes de profundizar en los detalles de OpenNHP, comencemos con una breve demostraci칩n de c칩mo OpenNHP protege un servidor del acceso no autorizado. Puede verlo en acci칩n accediendo al servidor protegido en https://acdemo.opennhp.org.\r\n\r\n### 1) El servidor protegido es \"invisible\" para los usuarios no autenticados\r\n\r\nPor defecto, cualquier intento de conectar con el servidor protegido resultar치 en un error TIME OUT, ya que todos los puertos est치n cerrados, haciendo que el servidor parezca *\"invisible\"* y efectivamente fuera de l칤nea.\r\n\r\n![Demostraci칩n de OpenNHP](docs/images/OpenNHP_ACDemo0.png)\r\n\r\nEl escaneo de puertos del servidor tambi칠n devolver치 un error TIME OUT.\r\n\r\n![Demostraci칩n de OpenNHP](docs/images/OpenNHP_ScanDemo.png)\r\n\r\n### 2) Despu칠s de la autenticaci칩n, el servidor protegido se vuelve accesible\r\n\r\nOpenNHP admite una variedad de m칠todos de autenticaci칩n, como OAuth, SAML, c칩digos QR, y m치s. Para esta demostraci칩n, utilizamos un servicio de autenticaci칩n b치sica de nombre de usuario/contrase침a en https://demologin.opennhp.org.\r\n\r\n![Demostraci칩n de OpenNHP](docs/images/OpenNHP_DemoLogin.png)\r\n\r\nUna vez que haga clic en el bot칩n \"Login\", la autenticaci칩n se completar치 con 칠xito y ser치 redirigido al servidor protegido. En ese momento, el servidor se vuelve *\"visible\"* y accesible en su dispositivo.\r\n\r\n![Demostraci칩n de OpenNHP](docs/images/OpenNHP_ACDemo1.png)\r\n\r\n---\r\n\r\n## Vis칤n: Hacer de Internet un lugar confiable\r\n\r\nLa apertura de los protocolos TCP/IP ha impulsado el crecimiento explosivo de las aplicaciones de Internet, pero tambi칠n ha expuesto vulnerabilidades, permitiendo que actores malintencionados obtengan acceso no autorizado y exploten cualquier direcci칩n IP expuesta. Aunque el [modelo de red OSI](https://es.wikipedia.org/wiki/Modelo_OSI) define la *capa 5 (capa de sesi칩n)* para la gesti칩n de conexiones, pocas soluciones efectivas se han implementado para abordar este problema.\r\n\r\n**NHP**, o el **\"Protocolo de Ocultaci칩n de la Infraestructura de Red\"**, es un protocolo de red ligero y basado en criptograf칤a Zero Trust, dise침ado para funcionar en la *capa de sesi칩n OSI*, 칩ptimo para gestionar la visibilidad y las conexiones de la red. El objetivo principal de NHP es ocultar los recursos protegidos de entidades no autorizadas, otorgando acceso solo a los usuarios verificados y autorizados mediante una verificaci칩n continua, contribuyendo as칤 a un Internet m치s confiable.\r\n\r\n![Internet confiable](docs/images/TrustworthyCyberspace.png)\r\n\r\n---\r\n\r\n## Soluci칩n: OpenNHP restablece el control de la visibilidad de la red\r\n\r\n**OpenNHP** es la implementaci칩n de c칩digo abierto del protocolo NHP. Est치 impulsado por criptograf칤a y dise침ado con principios de seguridad en primer lugar, implementando una verdadera arquitectura de confianza cero en la *capa de sesi칩n OSI*.\r\n\r\n![OpenNHP como la capa 5 del OSI](docs/images/OSI_OpenNHP.png)\r\n\r\nOpenNHP se basa en investigaciones anteriores sobre tecnolog칤a de ocultaci칩n de redes, utilizando un marco criptogr치fico moderno y una arquitectura que garantiza seguridad y alto rendimiento, superando las limitaciones de tecnolog칤as anteriores.\r\n\r\n| Protocolo de Ocultaci칩n de Infraestructura de Red | 1춹 Generaci칩n | 2춹 Generaci칩n | 3춹 Generaci칩n |\r\n|:---|:---|:---|:---|\r\n| **Tecnolog칤a Clave** | [Port Knocking](https://es.wikipedia.org/wiki/Port_knocking) | [Single Packet Authorization (SPA)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) | Protocolo de Ocultaci칩n de Infraestructura de Red (NHP) |\r\n| **Autenticaci칩n** | Secuencias de puertos | Secretos compartidos | Marco Criptogr치fico Moderno |\r\n| **Arquitectura** | Sin plano de control | Sin plano de control | Plano de control escalable |\r\n| **Capacidad** | Ocultar puertos | Ocultar puertos | Ocultar puertos, IPs y dominios |\r\n| **Control de Acceso** | Nivel IP | Nivel de Puertos | Nivel de Aplicaci칩n |\r\n| **Proyectos de C칩digo Abierto** | [knock](https://github.com/jvinet/knock) *(C)* | [fwknop](https://github.com/mrash/fwknop) *(C++)* | [OpenNHP](https://github.com/OpenNHP/opennhp) *(Go)* |\r\n\r\n> Es crucial elegir un lenguaje **seguro para la memoria** como *Go* para el desarrollo de OpenNHP, como se destaca en el [informe t칠cnico del gobierno de los EE.UU.](https://www.whitehouse.gov/wp-content/uploads/2024/02/Final-ONCD-Technical-Report.pdf). Para una comparaci칩n detallada entre **SPA y NHP**, consulte la [secci칩n a continuaci칩n](#comparison-between-spa-and-nhp).\r\n\r\n## Beneficios de Seguridad\r\n\r\nDado que OpenNHP implementa los principios de confianza cero en la *capa de sesi칩n OSI*, ofrece beneficios significativos:\r\n\r\n- Reduce la superficie de ataque ocultando la infraestructura\r\n- Evita el reconocimiento no autorizado de la red\r\n- Mitiga la explotaci칩n de vulnerabilidades\r\n- Previene ataques de phishing mediante DNS cifrado\r\n- Protege contra ataques DDoS\r\n- Permite el control de acceso granular\r\n- Proporciona seguimiento de conexiones basado en identidad\r\n- Atribuci칩n de ataques\r\n\r\n## Arquitectura\r\n\r\nLa arquitectura de OpenNHP se inspira en el [est치ndar de Arquitectura de Confianza Cero del NIST](https://www.nist.gov/publications/zero-trust-architecture). Sigue un dise침o modular con los tres componentes principales: **NHP-Server**, **NHP-AC** y **NHP-Agent**, como se ilustra en el siguiente diagrama.\r\n\r\n![Arquitectura de OpenNHP](docs/images/OpenNHP_Arch.png)\r\n\r\n> Consulte la [documentaci칩n de OpenNHP](https://opennhp.org/) para obtener informaci칩n detallada sobre la arquitectura y el flujo de trabajo.\r\n\r\n## Centro: Algoritmos Criptogr치ficos\r\n\r\nLa criptograf칤a es el centro de OpenNHP, proporcionando seguridad robusta, un excelente rendimiento y escalabilidad mediante el uso de algoritmos criptogr치ficos de vanguardia. A continuaci칩n se muestran los principales algoritmos y marcos criptogr치ficos utilizados por OpenNHP:\r\n\r\n- **[Criptograf칤a de Curva El칤ptica (ECC)](https://es.wikipedia.org/wiki/Criptograf%C3%ADa_de_curva_el%C3%ADptica)**: Utilizada para criptograf칤a asim칠trica eficiente.\r\n\r\n> En comparaci칩n con RSA, ECC ofrece una mayor eficiencia con una encriptaci칩n m치s fuerte en longitudes de clave m치s cortas, mejorando tanto la transmisi칩n en la red como el rendimiento computacional. La tabla a continuaci칩n muestra las diferencias en la fortaleza de la seguridad, las longitudes de clave y la proporci칩n de longitud de clave entre RSA y ECC, junto con sus respectivos per칤odos de validez.\r\n\r\n| Fortaleza de Seguridad (bits) | Longitud de Clave DSA/RSA (bits) | Longitud de Clave ECC (bits) | Relaci칩n: ECC vs. DSA/RSA | Validez |\r\n|:----------------------------:|:-------------------------------:|:---------------------------:|:--------------------------:|:-------:|\r\n| 80                           | 1024                            | 160-223                     | 1:6                        | Hasta 2010 |\r\n| 112                          | 2048                            | 224-255                     | 1:9                        | Hasta 2030 |\r\n| 128                          | 3072                            | 256-383                     | 1:12                       | Despu칠s de 2031 |\r\n| 192                          | 7680                            | 384-511                     | 1:20                       | |\r\n| 256                          | 15360                           | 512+                        | 1:30                       | |\r\n\r\n- **[Marco de Protocolo Noise](https://noiseprotocol.org/)**: Permite el intercambio seguro de claves, el cifrado/descifrado de mensajes y la autenticaci칩n mutua.\r\n\r\n> El Protocolo Noise se basa en el [acuerdo de clave Diffie-Hellman](https://es.wikipedia.org/wiki/Intercambio_de_claves_Diffie-Hellman) y proporciona soluciones criptogr치ficas modernas como la autenticaci칩n mutua y opcional, el ocultamiento de identidad, la confidencialidad directa y el cifrado de ida y vuelta. Probado por su seguridad y rendimiento, ya es utilizado por aplicaciones populares como [WhatsApp](https://www.whatsapp.com/security/WhatsApp-Security-Whitepaper.pdf), [Slack](https://github.com/slackhq/nebula) y [WireGuard](https://www.wireguard.com/).\r\n\r\n- **[Criptograf칤a Basada en Identidad (IBC)](https://es.wikipedia.org/wiki/Criptograf%C3%ADa_basada_en_la_identidad)**: Simplifica la distribuci칩n de claves a escala.\r\n\r\n> Una distribuci칩n eficiente de claves es esencial para implementar Zero Trust. OpenNHP admite tanto PKI como IBC. Mientras que PKI se ha utilizado ampliamente durante d칠cadas, depende de Autoridades Certificadoras (CA) centralizadas para la verificaci칩n de identidad y la gesti칩n de claves, lo que puede ser costoso y llevar tiempo. En contraste, IBC permite un enfoque descentralizado y autogestionado para la verificaci칩n de identidad y la gesti칩n de claves, haci칠ndolo m치s rentable para el entorno Zero Trust de OpenNHP, donde miles de millones de dispositivos o servidores pueden necesitar protecci칩n e integraci칩n en tiempo real.\r\n\r\n- **[Criptograf칤a sin Certificados (CL-PKC)](https://es.wikipedia.org/wiki/Criptograf%C3%ADa_sin_certificado)**: Algoritmo IBC recomendado\r\n\r\n> CL-PKC es un esquema que mejora la seguridad al evitar la custodia de claves y abordar las limitaciones de la Criptograf칤a Basada en Identidad (IBC). En la mayor칤a de los sistemas IBC, la clave privada de un usuario es generada por un Centro de Generaci칩n de Claves (KGC), lo cual conlleva riesgos significativos. Un KGC comprometido puede llevar a la exposici칩n de todas las claves privadas de los usuarios, requiriendo plena confianza en el KGC. CL-PKC mitiga este problema dividiendo el proceso de generaci칩n de claves, de modo que el KGC solo tiene conocimiento de una clave privada parcial. Como resultado, CL-PKC combina las fortalezas de PKI e IBC, ofreciendo una mayor seguridad sin los inconvenientes de la gesti칩n centralizada de claves.\r\n\r\nLectura adicional:\r\n\r\n> Consulte la [documentaci칩n de OpenNHP](https://opennhp.org/cryptography/) para una explicaci칩n detallada de los algoritmos criptogr치ficos utilizados en OpenNHP.\r\n\r\n## Caracter칤sticas Clave\r\n\r\n- Mitiga la explotaci칩n de vulnerabilidades mediante la aplicaci칩n de reglas \"denegar todo\" por defecto\r\n- Previene ataques de phishing mediante la resoluci칩n DNS cifrada\r\n- Protege contra ataques DDoS ocultando la infraestructura\r\n- Permite la atribuci칩n de ataques mediante conexiones basadas en identidad\r\n- Control de acceso predeterminado para todos los recursos protegidos\r\n- Autenticaci칩n basada en identidad y dispositivos antes del acceso a la red\r\n- Resoluci칩n DNS cifrada para prevenir secuestro de DNS\r\n- Infraestructura distribuida para mitigar ataques DDoS\r\n- Arquitectura escalable con componentes desacoplados\r\n- Integraci칩n con sistemas de gesti칩n de identidades y accesos existentes\r\n- Compatible con varios modelos de despliegue (cliente a puerta de enlace, cliente a servidor, etc.)\r\n- Seguridad criptogr치fica con algoritmos modernos (ECC, Noise Protocol, IBC)\r\n\r\n<details>\r\n<summary>Haga clic para expandir los detalles de las caracter칤sticas</summary>\r\n\r\n- **Control de acceso predeterminado**: Todos los recursos est치n ocultos por defecto, solo siendo accesibles tras la autenticaci칩n y autorizaci칩n.\r\n- **Autenticaci칩n basada en identidad y dispositivos**: Garantiza que solo los usuarios conocidos en dispositivos aprobados puedan acceder.\r\n- **Resoluci칩n DNS cifrada**: Evita el secuestro de DNS y los ataques de phishing asociados.\r\n- **Mitigaci칩n de DDoS**: El dise침o de infraestructura distribuida ayuda a proteger contra los ataques de denegaci칩n de servicio distribuidos.\r\n- **Arquitectura escalable**: Los componentes desacoplados permiten un despliegue y escalado flexibles.\r\n- **Integraci칩n IAM**: Funciona con sus sistemas de gesti칩n de identidades y accesos existentes.\r\n- **Despliegue flexible**: Compatible con varios modelos, incluido cliente a puerta de enlace, cliente a servidor y m치s.\r\n- **Criptograf칤a robusta**: Utiliza algoritmos modernos como ECC, Noise Protocol e IBC para una seguridad robusta.\r\n</details>\r\n\r\n## Despliegue\r\n\r\nOpenNHP admite varios modelos de despliegue para adaptarse a diferentes casos de uso:\r\n\r\n- Cliente a puerta de enlace: Asegura el acceso a varios servidores detr치s de una puerta de enlace\r\n- Cliente a servidor: Asegura directamente servidores/aplicaciones individuales\r\n- Servidor a servidor: Asegura la comunicaci칩n entre servicios backend\r\n- Puerta de enlace a puerta de enlace: Asegura conexiones entre sitios\r\n\r\n> Consulte la [documentaci칩n de OpenNHP](https://opennhp.org/deploy/) para obtener instrucciones detalladas de despliegue.\r\n\r\n## Comparaci칩n entre SPA y NHP\r\nEl protocolo Single Packet Authorization (SPA) est치 incluido en la [especificaci칩n del Per칤metro Definido por Software (SDP)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) publicada por la [Cloud Security Alliance (CSA)](https://cloudsecurityalliance.org/). NHP mejora la seguridad, la fiabilidad, la escalabilidad y la extensibilidad mediante un marco criptogr치fico moderno y una arquitectura moderna, como se demuestra en el [art칤culo de investigaci칩n AHAC](https://www.mdpi.com/2076-3417/14/13/5593).\r\n\r\n| - | SPA | NHP | Ventajas de NHP |\r\n|:---|:---|:---|:---|\r\n| **Arquitectura** | El componente de descifrado de paquetes SPA y autenticaci칩n de usuario/dispositivo est치 acoplado con el componente de control de acceso a la red en el servidor SPA. | NHP-Server (el componente de descifrado de paquetes y autenticaci칩n de usuario/dispositivo) y NHP-AC (el componente de control de acceso) est치n desacoplados. NHP-Server se puede desplegar en hosts separados y admite la escalabilidad horizontal. | <ul><li>Rendimiento: el componente que consume muchos recursos, NHP-server, est치 separado del servidor protegido.</li><li>Escalabilidad: NHP-server se puede desplegar en modo distribuido o cl칰ster.</li><li>Seguridad: la direcci칩n IP del servidor protegido no es visible para el cliente a menos que la autenticaci칩n sea exitosa.</li></ul>|\r\n| **Comunicaci칩n** | Direcci칩n 칰nica | Bidireccional | Mejor fiabilidad con la notificaci칩n de estado del control de acceso |\r\n| **Marco criptogr치fico** | Secretos compartidos | PKI o IBC, Marco Noise | <ul><li>Seguridad: mecanismo comprobado de intercambio de claves para mitigar las amenazas MITM</li><li>Bajo costo: distribuci칩n de claves eficiente para el modelo de confianza cero</li><li>Rendimiento: cifrado/descifrado de alto rendimiento</li></ul>|\r\n| **Capacidad de Ocultaci칩n de Infraestructura de Red** | Solo puertos de servidor | Dominios, IPs y puertos | M치s poderoso contra varios ataques (p. ej., vulnerabilidades, secuestro de DNS y ataques DDoS) |\r\n| **Extensibilidad** | Ninguna, solo para SDP | Todo uso | Compatible con cualquier escenario que necesite oscurecimiento del servicio |\r\n| **Interoperabilidad** | No disponible | Personalizable | NHP puede integrarse sin problemas con protocolos existentes (p. ej., DNS, FIDO, etc.) |\r\n\r\n## Contribuir\r\n\r\n춰Damos la bienvenida a las contribuciones a OpenNHP! Consulte nuestras [Directrices de Contribuci칩n](CONTRIBUTING.md) para obtener m치s informaci칩n sobre c칩mo participar.\r\n\r\n## Licencia\r\n\r\nOpenNHP se publica bajo la [Licencia Apache 2.0](LICENSE).\r\n\r\n## Contacto\r\n\r\n- Sitio web del proyecto: [https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\r\n- Correo electr칩nico: [opennhp@gmail.com](mailto:opennhp@gmail.com)\r\n- Canal de Slack: [칔nase a nuestro Slack](https://slack.opennhp.org)\r\n\r\nPara obtener una documentaci칩n m치s detallada, visite nuestra [Documentaci칩n Oficial](https://opennhp.org).\r\n\r\n## Referencias\r\n\r\n- [Especificaci칩n del Per칤metro Definido por Software (SDP) v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2). Jason Garbis, Juanita Koilpillai, Junaid lslam, Bob Flores, Daniel Bailey, Benfeng Chen, Eitan Bremler, Michael Roza, Ahmed Refaey Hussein. [*Cloud Security Alliance (CSA)*](https://cloudsecurityalliance.org/). Marzo 2022.\r\n- [AHAC: Marco Avanzado de Control de Acceso Oculto en Red](https://www.mdpi.com/2076-3417/14/13/5593). Mudi Xu, Benfeng Chen, Zhizhong Tan, Shan Chen, Lei Wang, Yan Liu, Tai Io San, Sou Wang Fong, Wenyong Wang y Jing Feng. *Revista de Ciencias Aplicadas*. Junio 2024.\r\n- Noise Protocol Framework. https://noiseprotocol.org/\r\n- Proyecto de Marco de Gesti칩n de Vulnerabilidades. https://phoenix.security/web-vuln-management/\r\n\r\n---\r\n\r\n游 춰Gracias por su inter칠s en OpenNHP! Esperamos sus contribuciones y comentarios.\r\n\r\n"
        },
        {
          "name": "README.fr.md",
          "type": "blob",
          "size": 19.384765625,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\r\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\r\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\r\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\r\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\r\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\r\n\r\n![Logo OpenNHP](docs/images/logo11.png)\r\n# OpenNHP : Protocole de Masquage de l'Infrastructure R칠seau en Z칠ro Confiance\r\nUn protocole r칠seau de z칠ro confiance, bas칠 sur la cryptographie, au niveau 5 du mod칟le OSI, permettant de cacher votre serveur et vos donn칠es des attaquants.\r\n\r\n![Statut de Construction](https://img.shields.io/badge/build-passing-brightgreen)\r\n![Version](https://img.shields.io/badge/version-1.0.0-blue)\r\n![Licence](https://img.shields.io/badge/license-Apache%202.0-green)\r\n\r\n---\r\n\r\n## D칠fi : L'IA transforme Internet en une \"For칡t Sombre\"\r\n\r\nL'avancement rapide des technologies d'**IA**, en particulier les grands mod칟les de langage (LLM), transforme de mani칟re significative le paysage de la cybers칠curit칠. L'칠mergence de l'**exploitation autonome des vuln칠rabilit칠s (AVE)** repr칠sente un bond majeur dans l'칟re de l'IA, automatisant l'exploitation des vuln칠rabilit칠s, comme le montre [cet article de recherche](https://arxiv.org/abs/2404.08144). Ce d칠veloppement augmente de mani칟re significative le risque pour tous les services r칠seau expos칠s, 칠voquant l'hypoth칟se de la [for칡t sombre](https://fr.wikipedia.org/wiki/For%C3%AAt_sombre) sur Internet. Les outils pilot칠s par l'IA scannent continuellement l'environnement num칠rique, identifiant rapidement les faiblesses et les exploitant. Ainsi, Internet devient une **\"for칡t sombre\"** o칯 **la visibilit칠 칠quivaut  la vuln칠rabilit칠**.\r\n\r\n![Risques de Vuln칠rabilit칠](docs/images/Vul_Risks.png)\r\n\r\nSelon les recherches de Gartner, les [cyberattaques pilot칠es par l'IA vont augmenter rapidement](https://www.gartner.com/en/newsroom/press-releases/2024-08-28-gartner-forecasts-global-information-security-spending-to-grow-15-percent-in-2025). Ce paradigme en 칠volution impose une r칠칠valuation des strat칠gies de cybers칠curit칠 traditionnelles, avec un accent sur les d칠fenses proactives, des m칠canismes de r칠ponse rapide, et l'adoption de technologies de masquage r칠seau pour prot칠ger les infrastructures critiques.\r\n\r\n---\r\n\r\n## D칠mo rapide : Voir OpenNHP en action\r\n\r\nAvant de plonger dans les d칠tails d'OpenNHP, commen칞ons par une d칠monstration rapide de la fa칞on dont OpenNHP prot칟ge un serveur contre les acc칟s non autoris칠s. Vous pouvez le voir en action en acc칠dant au serveur prot칠g칠  l'adresse suivante : https://acdemo.opennhp.org.\r\n\r\n### 1) Le serveur prot칠g칠 est \"invisible\" aux utilisateurs non authentifi칠s\r\n\r\nPar d칠faut, toute tentative de connexion au serveur prot칠g칠 r칠sultera en une erreur de TYPE OUT, car tous les ports sont ferm칠s, rendant le serveur *\"invisible\"* et apparemment hors ligne.\r\n\r\n![D칠mo OpenNHP](docs/images/OpenNHP_ACDemo0.png)\r\n\r\nLe scan des ports du serveur retournera 칠galement une erreur de TYPE OUT.\r\n\r\n![D칠mo OpenNHP](docs/images/OpenNHP_ScanDemo.png)\r\n\r\n### 2) Apr칟s authentification, le serveur prot칠g칠 devient accessible\r\n\r\nOpenNHP supporte une vari칠t칠 de m칠thodes d'authentification, telles que OAuth, SAML, QR codes, et plus encore. Pour cette d칠monstration, nous utilisons un service d'authentification bas칠 sur un nom d'utilisateur/mot de passe simple  l'adresse https://demologin.opennhp.org.\r\n\r\n![D칠mo OpenNHP](docs/images/OpenNHP_DemoLogin.png)\r\n\r\nUne fois que vous cliquez sur le bouton \"Login\", l'authentification est r칠ussie, et vous 칡tes redirig칠 vers le serveur prot칠g칠. Le serveur devient alors *\"visible\"* et accessible sur votre appareil.\r\n\r\n![D칠mo OpenNHP](docs/images/OpenNHP_ACDemo1.png)\r\n\r\n---\r\n\r\n## Vision : Faire d'Internet un espace de confiance\r\n\r\nL'ouverture des protocoles TCP/IP a stimul칠 la croissance des applications Internet, mais a aussi expos칠 des vuln칠rabilit칠s, permettant aux acteurs malveillants d'acc칠der de mani칟re non autoris칠e  toute adresse IP expos칠e. Bien que le [mod칟le r칠seau OSI](https://fr.wikipedia.org/wiki/Mod%C3%A8le_OSI) d칠finisse la *couche 5 (couche session)* pour la gestion des connexions, peu de solutions efficaces ont 칠t칠 mises en place  cet 칠gard.\r\n\r\n**NHP**, ou **\"Protocole de Masquage de l'Infrastructure R칠seau\"**, est un protocole r칠seau de z칠ro confiance, bas칠 sur la cryptographie, con칞u pour fonctionner au *niveau de la couche session OSI*, id칠al pour g칠rer la visibilit칠 r칠seau et les connexions. L'objectif principal de NHP est de dissimuler les ressources prot칠g칠es des entit칠s non autoris칠es, accordant l'acc칟s uniquement aux utilisateurs v칠rifi칠s et autoris칠s par une v칠rification continue, contribuant ainsi  un Internet plus digne de confiance.\r\n\r\n![Internet de Confiance](docs/images/TrustworthyCyberspace.png)\r\n\r\n---\r\n\r\n## Solution : OpenNHP r칠tablit le contr칪le de la visibilit칠 r칠seau\r\n\r\n**OpenNHP** est l'impl칠mentation open source du protocole NHP. Il est bas칠 sur la cryptographie et con칞u avec des principes de s칠curit칠 en priorit칠, impl칠mentant une v칠ritable architecture de z칠ro confiance au *niveau de la couche session OSI*.\r\n\r\n![OpenNHP en tant que couche 5 OSI](docs/images/OSI_OpenNHP.png)\r\n\r\nOpenNHP s'appuie sur des recherches ant칠rieures sur la technologie de masquage r칠seau, en utilisant des cadres et une architecture modernes de cryptographie pour garantir la s칠curit칠 et des performances 칠lev칠es, surmontant ainsi les limitations des technologies pr칠c칠dentes.\r\n\r\n| Protocole de Masquage de l'Infrastructure | 1칟re G칠n칠ration | 2칟me G칠n칠ration | 3칟me G칠n칠ration |\r\n|:---|:---|:---|:---|\r\n| **Technologie Cl칠** | [Port Knocking](https://fr.wikipedia.org/wiki/Port_knocking) | [Autorisation par Paquet Unique (SPA)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) | Protocole de Masquage de l'Infrastructure R칠seau (NHP) |\r\n| **Authentification** | S칠quences de ports | Secrets partag칠s | Cadre cryptographique moderne |\r\n| **Architecture** | Pas de plan de contr칪le | Pas de plan de contr칪le | Plan de contr칪le scalable |\r\n| **Capacit칠** | Masquer les ports | Masquer les ports | Masquer les ports, IPs et domaines |\r\n| **Contr칪le d'Acc칟s** | Niveau IP | Niveau Port | Niveau Application |\r\n| **Projets Open Source** | [knock](https://github.com/jvinet/knock) *(C)* | [fwknop](https://github.com/mrash/fwknop) *(C++)* | [OpenNHP](https://github.com/OpenNHP/opennhp) *(Go)* |\r\n\r\n> Il est crucial de choisir un langage **s칱r pour la m칠moire** comme *Go* pour le d칠veloppement d'OpenNHP, comme le souligne le [rapport technique du gouvernement des 칄tats-Unis](https://www.whitehouse.gov/wp-content/uploads/2024/02/Final-ONCD-Technical-Report.pdf). Pour une comparaison d칠taill칠e entre **SPA et NHP**, r칠f칠rez-vous  la [section ci-dessous](#comparison-between-spa-and-nhp).\r\n\r\n## B칠n칠fices en mati칟re de s칠curit칠\r\n\r\nPuisqu'OpenNHP impl칠mente les principes de z칠ro confiance au *niveau de la couche session OSI*, il offre des avantages significatifs :\r\n\r\n- R칠duit la surface d'attaque en cachant l'infrastructure\r\n- Emp칡che la reconnaissance r칠seau non autoris칠e\r\n- Att칠nue l'exploitation des vuln칠rabilit칠s\r\n- Emp칡che le phishing via DNS chiffr칠\r\n- Prot칟ge contre les attaques DDoS\r\n- Permet un contr칪le d'acc칟s granulaire\r\n- Fournit un suivi des connexions bas칠 sur l'identit칠\r\n- Attribution des attaques\r\n\r\n## Architecture\r\n\r\nL'architecture d'OpenNHP s'inspire de la [norme d'architecture Zero Trust du NIST](https://www.nist.gov/publications/zero-trust-architecture). Elle suit une conception modulaire avec trois composants principaux : **NHP-Server**, **NHP-AC** et **NHP-Agent**, comme illustr칠 dans le diagramme ci-dessous.\r\n\r\n![Architecture OpenNHP](docs/images/OpenNHP_Arch.png)\r\n\r\n> Veuillez consulter la [documentation d'OpenNHP](https://opennhp.org/) pour des informations d칠taill칠es sur l'architecture et le flux de travail.\r\n\r\n## C콉ur : Algorithmes Cryptographiques\r\n\r\nLa cryptographie est au c콉ur d'OpenNHP, fournissant une s칠curit칠 robuste, d'excellentes performances et une bonne 칠volutivit칠 en utilisant des algorithmes cryptographiques de pointe. Voici les principaux algorithmes et cadres cryptographiques employ칠s par OpenNHP :\r\n\r\n- **[Cryptographie  Courbes Elliptiques (ECC)](https://fr.wikipedia.org/wiki/Cryptographie_sur_courbe_elliptique)** : Utilis칠e pour la cryptographie asym칠trique efficace.\r\n\r\n> Compar칠e  RSA, l'ECC offre une efficacit칠 sup칠rieure avec un chiffrement plus fort  des longueurs de cl칠 plus courtes, am칠liorant la transmission r칠seau et les performances de calcul. Le tableau ci-dessous montre les diff칠rences de force de s칠curit칠, de longueurs de cl칠 et du ratio entre RSA et ECC, ainsi que leurs p칠riodes de validit칠 respectives.\r\n\r\n| Force de S칠curit칠 (bits) | Longueur de Cl칠 DSA/RSA (bits) | Longueur de Cl칠 ECC (bits) | Ratio : ECC vs DSA/RSA | Validit칠 |\r\n|:--------------------------:|:------------------------------:|:--------------------------:|:-----------------------:|:---------:|\r\n| 80                         | 1024                           | 160-223                    | 1:6                     | Jusqu'en 2010 |\r\n| 112                        | 2048                           | 224-255                    | 1:9                     | Jusqu'en 2030 |\r\n| 128                        | 3072                           | 256-383                    | 1:12                    | Apr칟s 2031 |\r\n| 192                        | 7680                           | 384-511                    | 1:20                    | |\r\n| 256                        | 15360                          | 512+                       | 1:30                    | |\r\n\r\n- **[Cadre de Protocole Noise](https://noiseprotocol.org/)** : Permet l'칠change de cl칠s s칠curis칠, le chiffrement/d칠chiffrement des messages, et l'authentification mutuelle.\r\n\r\n> Le protocole Noise est bas칠 sur l'[accord de cl칠 Diffie-Hellman](https://fr.wikipedia.org/wiki/%C3%89change_de_cl%C3%A9_Diffie-Hellman) et offre des solutions cryptographiques modernes telles que l'authentification mutuelle et optionnelle, le masquage de l'identit칠, la s칠curit칠 persistante, et le chiffrement  tour de passez-tour de z칠ro. D칠j prouv칠 pour sa s칠curit칠 et ses performances, il est utilis칠 par des applications populaires comme [WhatsApp](https://www.whatsapp.com/security/WhatsApp-Security-Whitepaper.pdf), [Slack](https://github.com/slackhq/nebula), et [WireGuard](https://www.wireguard.com/).\r\n\r\n- **[Cryptographie bas칠e sur l'Identit칠 (IBC)](https://fr.wikipedia.org/wiki/Cryptographie_bas%C3%A9e_sur_l%27identit%C3%A9)** : Simplifie la distribution des cl칠s  grande 칠chelle.\r\n\r\n> Une distribution efficace des cl칠s est essentielle pour impl칠menter le Z칠ro Confiance. OpenNHP prend en charge  la fois PKI et IBC. Alors que PKI est utilis칠e depuis des d칠cennies, elle d칠pend de Certificats d'Autorit칠 centralis칠s (CA) pour la v칠rification de l'identit칠 et la gestion des cl칠s, ce qui peut 칡tre long et co칱teux. En revanche, l'IBC permet une approche d칠centralis칠e et autonome de la v칠rification de l'identit칠 et de la gestion des cl칠s, la rendant plus rentable pour l'environnement Zero Trust d'OpenNHP, o칯 des milliards d'appareils ou de serveurs peuvent avoir besoin de protection et d'int칠gration en temps r칠el.\r\n\r\n- **[Cryptographie  Cl칠 Publique sans Certificat (CL-PKC)](https://fr.wikipedia.org/wiki/Cryptographie_sans_certificat)** : Algorithme IBC recommand칠\r\n\r\n> CL-PKC est un sch칠ma qui am칠liore la s칠curit칠 en 칠vitant la garde des cl칠s et en r칠pondant aux limites de la cryptographie bas칠e sur l'identit칠 (IBC). Dans la plupart des syst칟mes IBC, la cl칠 priv칠e d'un utilisateur est g칠n칠r칠e par un Centre de G칠n칠ration de Cl칠s (KGC), ce qui introduit des risques importants. Un KGC compromis peut entra칥ner l'exposition des cl칠s priv칠es de tous les utilisateurs, n칠cessitant une confiance totale dans le KGC. CL-PKC att칠nue ce probl칟me en divisant le processus de g칠n칠ration de cl칠s, de sorte que le KGC n'a connaissance que d'une cl칠 priv칠e partielle. En cons칠quence, CL-PKC combine les forces du PKI et de l'IBC, offrant une s칠curit칠 renforc칠e sans les inconv칠nients de la gestion centralis칠e des cl칠s.\r\n\r\nPour en savoir plus :\r\n\r\n> Veuillez consulter la [documentation OpenNHP](https://opennhp.org/cryptography/) pour une explication d칠taill칠e des algorithmes cryptographiques utilis칠s dans OpenNHP.\r\n\r\n## Principales Fonctionnalit칠s\r\n\r\n- Att칠nue l'exploitation des vuln칠rabilit칠s en appliquant par d칠faut des r칟gles \"deny-all\"\r\n- Emp칡che les attaques de phishing via la r칠solution DNS chiffr칠e\r\n- Prot칟ge contre les attaques DDoS en cachant l'infrastructure\r\n- Permet l'attribution des attaques via des connexions bas칠es sur l'identit칠\r\n- Contr칪le d'acc칟s par d칠faut pour toutes les ressources prot칠g칠es\r\n- Authentification bas칠e sur l'identit칠 et les appareils avant l'acc칟s au r칠seau\r\n- R칠solution DNS chiffr칠e pour emp칡cher le piratage DNS\r\n- Infrastructure distribu칠e pour att칠nuer les attaques DDoS\r\n- Architecture 칠volutive avec des composants d칠coupl칠s\r\n- Int칠gration avec les syst칟mes existants de gestion des identit칠s et des acc칟s\r\n- Prend en charge divers mod칟les de d칠ploiement (client--passerelle, client--serveur, etc.)\r\n- S칠curit칠 cryptographique avec des algorithmes modernes (ECC, Noise Protocol, IBC)\r\n\r\n<details>\r\n<summary>Cliquez pour d칠velopper les d칠tails des fonctionnalit칠s</summary>\r\n\r\n- **Contr칪le d'acc칟s par d칠faut** : Toutes les ressources sont cach칠es par d칠faut, ne devenant accessibles qu'apr칟s authentification et autorisation.\r\n- **Authentification bas칠e sur l'identit칠 et les appareils** : Garantit que seuls les utilisateurs connus sur des appareils approuv칠s peuvent acc칠der.\r\n- **R칠solution DNS chiffr칠e** : Emp칡che le piratage DNS et les attaques de phishing associ칠es.\r\n- **Att칠nuation des DDoS** : Conception d'infrastructure distribu칠e aide  prot칠ger contre les attaques par DDoS.\r\n- **Architecture 칠volutive** : Les composants d칠coupl칠s permettent un d칠ploiement et une 칠volution flexibles.\r\n- **Int칠gration IAM** : Fonctionne avec vos syst칟mes de gestion des identit칠s et des acc칟s.\r\n- **D칠ploiement flexible** : Prend en charge divers mod칟les, y compris client--passerelle, client--serveur, et plus encore.\r\n- **Cryptographie forte** : Utilise des algorithmes modernes comme ECC, Noise Protocol, et IBC pour une s칠curit칠 robuste.\r\n</details>\r\n\r\n## D칠ploiement\r\n\r\nOpenNHP prend en charge plusieurs mod칟les de d칠ploiement pour r칠pondre  diff칠rents cas d'utilisation :\r\n\r\n- Client--Passerelle : S칠curise l'acc칟s  plusieurs serveurs derri칟re une passerelle\r\n- Client--Serveur : S칠curise directement des serveurs/applications individuels\r\n- Serveur--Serveur : S칠curise la communication entre les services backend\r\n- Passerelle--Passerelle : S칠curise les connexions site--site\r\n\r\n> Veuillez consulter la [documentation OpenNHP](https://opennhp.org/deploy/) pour des instructions de d칠ploiement d칠taill칠es.\r\n\r\n## Comparaison entre SPA et NHP\r\nLe protocole d'Autorisation par Paquet Unique (SPA) est inclus dans la [sp칠cification du P칠rim칟tre D칠fini par Logiciel (SDP)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) publi칠e par l'[Alliance pour la S칠curit칠 Cloud (CSA)](https://cloudsecurityalliance.org/). NHP am칠liore la s칠curit칠, la fiabilit칠, la scalabilit칠 et l'extensibilit칠 gr칙ce  un cadre et une architecture de cryptographie modernes, comme d칠montr칠 dans l'article de recherche [AHAC](https://www.mdpi.com/2076-3417/14/13/5593).\r\n\r\n| - | SPA | NHP | Avantages de NHP |\r\n|:---|:---|:---|:---|\r\n| **Architecture** | Le d칠chiffrement du paquet SPA et le composant d'authentification de l'utilisateur/appareil sont coupl칠s au composant de contr칪le d'acc칟s r칠seau dans le serveur SPA. | NHP-Server (le composant de d칠chiffrement de paquet et d'authentification utilisateur/appareil) et NHP-AC (le composant de contr칪le d'acc칟s) sont d칠coupl칠s. NHP-Server peut 칡tre d칠ploy칠 sur des h칪tes distincts et prend en charge la mise  l'칠chelle horizontale. | <ul><li>Performance : le composant gourmand en ressources NHP-server est s칠par칠 du serveur prot칠g칠.</li><li>Scalabilit칠 : NHP-server peut 칡tre d칠ploy칠 en mode distribu칠 ou en cluster.</li><li>S칠curit칠 : l'adresse IP du serveur prot칠g칠 n'est pas visible par le client tant que l'authentification n'a pas r칠ussi.</li></ul>|\r\n| **Communication** | Simple direction | Bidirectionnelle | Meilleure fiabilit칠 avec la notification d'칠tat du contr칪le d'acc칟s |\r\n| **Cadre cryptographique** | Secrets partag칠s | PKI ou IBC, Cadre Noise | <ul><li>S칠curit칠 : m칠canisme 칠prouv칠 d'칠change de cl칠s pour att칠nuer les menaces MITM</li><li>Co칱t faible : distribution efficace des cl칠s pour le mod칟le de z칠ro confiance</li><li>Performance : chiffrement/d칠chiffrement haute performance</li></ul>|\r\n| **Capacit칠 de Masquage de l'Infrastructure R칠seau** | Uniquement les ports de serveur | Domaines, IP et ports | Plus puissant contre diverses attaques (e.g., vuln칠rabilit칠s, piratage DNS, et attaques DDoS) |\r\n| **Extensibilit칠** | Aucune, uniquement pour SDP | Tout usage | Prise en charge de tout sc칠nario n칠cessitant un obscurcissement de service |\r\n| **Interop칠rabilit칠** | Non disponible | Personnalisable | NHP peut s'int칠grer de mani칟re transparente avec les protocoles existants (e.g., DNS, FIDO, etc.) |\r\n\r\n## Contribuer\r\n\r\nNous accueillons avec plaisir les contributions  OpenNHP ! Veuillez consulter nos [lignes directrices de contribution](CONTRIBUTING.md) pour plus d'informations sur la mani칟re de participer.\r\n\r\n## Licence\r\n\r\nOpenNHP est publi칠 sous la [licence Apache 2.0](LICENSE).\r\n\r\n## Contact\r\n\r\n- Site Web du Projet : [https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\r\n- E-mail : [opennhp@gmail.com](mailto:opennhp@gmail.com)\r\n- Canal Slack : [Rejoignez notre Slack](https://slack.opennhp.org)\r\n\r\nPour plus de documentation d칠taill칠e, veuillez visiter notre [Documentation Officielle](https://opennhp.org).\r\n\r\n## R칠f칠rences\r\n\r\n- [Sp칠cification du P칠rim칟tre D칠fini par Logiciel (SDP) v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2). Jason Garbis, Juanita Koilpillai, Junaid lslam, Bob Flores, Daniel Bailey, Benfeng Chen, Eitan Bremler, Michael Roza, Ahmed Refaey Hussein. [*Cloud Security Alliance (CSA)*](https://cloudsecurityalliance.org/). Mar 2022.\r\n- [AHAC : Cadre Avanc칠 de Contr칪le d'Acc칟s Cach칠 au R칠seau](https://www.mdpi.com/2076-3417/14/13/5593). Mudi Xu, Benfeng Chen, Zhizhong Tan, Shan Chen, Lei Wang, Yan Liu, Tai Io San, Sou Wang Fong, Wenyong Wang, et Jing Feng. *Journal des Sciences Appliqu칠es*. Juin 2024.\r\n- Noise Protocol Framework. https://noiseprotocol.org/\r\n- Projet de Cadre de Gestion des Vuln칠rabilit칠s. https://phoenix.security/web-vuln-management/\r\n\r\n---\r\n\r\n游 Merci pour votre int칠r칡t dans OpenNHP ! Nous attendons vos contributions et vos commentaires avec impatience.\r\n\r\n"
        },
        {
          "name": "README.ja.md",
          "type": "blob",
          "size": 14.171875,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\r\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\r\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\r\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\r\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\r\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\r\n\r\n![OpenNHP Logo](docs/images/logo11.png)\r\n# OpenNHP: 쩎쇆걲뽺좪걲꽦걲쩎벆돾뽺좪걲뽺剖먿댷쇆걲쁖r\n賚磊괚왞쩎넊쩎뻒쩎뉠먺뙊쇮SI蓂5欄벆擔꽪쫉뙊芳쫼쉱뚱낑깼敷긧拏쩎쇆걲뽺좪걲꽦걲쩎쇆걲뙊\r\n\r\n![Build Status](https://img.shields.io/badge/build-passing-brightgreen)\r\n![Version](https://img.shields.io/badge/version-1.0.0-blue)\r\n![License](https://img.shields.io/badge/license-Apache%202.0-green)\r\n\r\n---\r\n\r\n## 쇆봮쀢쉰걀젶r\n\r\nOpenNHP*OSI欄*쩎쇆걲뽺좪걲쉰곊뉜醱뷖縷뫢쉮걲쀤뱒꽦쀤걀좪꺾귂쮞뙊\r\n\r\n- 벆돾뽺쉴먿댷걲賚磊咐뮊쉰곍琉뜦r\n- 疸꽩솎쀢꽦걲쩎왠쉴쒽속\r\n- 欖쐕쉱쀦댣뉠쒺\r\n- 廖낑깼돾꺾륛NS걲돾썰쒽속\r\n- DDoS賚磊亂쮞뙊俯쒼쭤\r\n- 募썮뉜줝쉮뮊좬걌籃뫢뉜쬪r\n- 뮊벆뙊쩎좪쉱꿘帽뛷찧紡멮r\n- 賚磊쉰쟗欄룊r\n\r\n## 뮊쩎쇆뮾r\n\r\nOpenNHP쉮뮊쩎쇆슡NIST쩎쇆걲뽺좪걲뮊쩎쇆淚뙍줐](https://www.nist.gov/publications/zero-trust-architecture)倣뷚똨돾꺾뷖쮞뙊坍봯잶쉰띱命쥒뙊걲3벆쉯쟡魃쀢뢖쩎꽦걾짿**NHP-Server****NHP-AC****NHP-Agent**庸괚뉝깨벆뮊젂봮쩎傍쇋뺃籃쮞뙊\r\n\r\n![OpenNHP architecture](docs/images/OpenNHP_Arch.png)\r\n\r\n> 뮊쩎쇆뻒쩎돾쇆쩎쉳뽑募썪벆뷖[OpenNHP괚쇆봮뫢](https://opennhp.org/)뉜끡뷖먺돾\r\n\r\n## : 廖낑깼뮊얶쀢쥒\r\n\r\n廖낑깼슖penNHP쉯쟔纜귂欖궅쀢쇆봮쀢父떢놲돾뽺쩎뤾좪귂걲좪쐒쩎뽺쀢뉝끯曇뙊燎雷썪쉱뚱낑깼뮊얶쀢쥒먺뉜걀覓뻒뷖쮞뙊坍봯잶OpenNHP擔覓뻒돾꺾뷖疸魃쀥뚱낑깼뮊얶쀢쥒먺뻒돾섞쩎먺쩎뙊\r\n\r\n- **[婁됀料쒾읰廖낑庸ECC庸겧(https://en.wikipedia.org/wiki/Elliptic-curve_cryptography)**庸뛴궟꾾眄쀤설둚꼿廖낑擔覓뻒돾꺾뷖쮞뙊\r\n\r\n> RSA뻕싒蒡뷖ECC麵쇆꼿鳳欖궅쀥뚱낑깼뉝끯曇꽦걲쩎憺뢜뻗뺃酩놲돾뽺쩎뤾좪뉜냄疸귂돾쮞뙊坍봯잶쉳몯RSAECC쉮쇆봮쀢欖擥뷖꼿鳳귂걲꼿鳳쉱싒꾾쉴돾뉞뱤뢖꺾뤾꺾쉱랠궟燎不뉞뱤뷖쮞뙊\r\n\r\n| 쇆봮쀢欖擥뷢짿걾쨀 | DSA/RSA꼿鳳庸걲걾쨀 | ECC꼿鳳庸걲걾쨀 | 鏤덚꾾庸뙨CC亂쬓SA/RSA | 燎괜궟燎傅 |\r\n|:------------------------:|:-------------------------:|:---------------------:|:----------------------:|:--------:|\r\n| 80                       | 1024                      | 160-223               | 1:6                    | 2010嵐얶쮞 |\r\n| 112                      | 2048                      | 224-255               | 1:9                    | 2030嵐얶쮞 |\r\n| 128                      | 3072                      | 256-383               | 1:12                   | 2031嵐얷진傅 |\r\n| 192                      | 7680                      | 384-511               | 1:20                   | |\r\n| 256                      | 15360                     | 512+                  | 1:30                   | |\r\n\r\n- **[뀎벆쥒쇆걲돾섞쩎먺쩎슣(https://noiseprotocol.org/)**庸뛴술뻒쀨꼿啖벉끹뫢쩎젂쉱뚱낑깼/籃뽼낑깼귂걲眠젃뉟뿘傍쩎뉜낊쫶쮞뙊\r\n\r\n> 뀎벆쥒쇆걲슡돾쩎떢뤾꼿쐕랠](https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange)癩쥒봮뷖귂귂眠젃뉚귂걲쀢쉳뿘傍쩎뮊벆쉴먿댷곐雷좮븾쩎쇆뽺뷖괚걲쀢廖낑깼쀢뽺쉱雷썪쉱뚱낑깼쫶쀢봮쩎뉝끯曇쮞뙊뢖쉮쇆봮쀢뻒놲돾뽺쩎뤾좪[WhatsApp](https://www.whatsapp.com/security/WhatsApp-Security-Whitepaper.pdf)[Slack](https://github.com/slackhq/nebula)귂걲쓭WireGuard](https://www.wireguard.com/)쀢뽺쉯줰陋뮊쀢쐒쩎了뮊傍쩑땙돾꺾뷖쮞뙊\r\n\r\n- **[뮊벆뙊쩎좭뚱낑庸IBC庸겧(https://en.wikipedia.org/wiki/Identity-based_cryptography)**庸뛴뱒魃淚뫢쀨꼿꽨잮뉞쌰募먼깼쮞뙊\r\n\r\n> 궟꾾眄쀨꼿꽨잮쩎쇆걲뽺좪걲쉰醱疸꽨낊縷먺뙊OpenNHP슗KIIBC쉯쟈雷좪뉚왞뢖쩎걲뷖쮞뙊PKI賴썬꼐嵐얶뷘죾擔覓뻒돾꺾뷖꽦쮞꺾뮊벆쉲뭨妨꽦뻘꼿酩뫦낹疸쇈뱙副淚뽾뚟쀧뿘傍쩐庸CA庸괚曇뢘솆뷖귂귂寮不뻒좪걲꺾뻒꺾귂쮞뙊疸雷좪IBC뮊벆쉲뭨妨꽦뻘꼿酩뫦낹뉜갡賴拏쀤임酩뫦낹낊쫶쀥뒃柳돾發꺾뻒꺾꽦쀢뮊벆먺擔됀꼐쉮넊벆좪왞쩎넊쩎뉛찋彷쀢럮쩎썪뙊纜魃꺾귪penNHP쉮쩎쇆걲뽺좪걶눯螺귂뷖걲귂좪건궟꾾眄뙊\r\n\r\n- **[傍쩑땙料젂섞좬설둚꼿廖낑庸CL-PKC庸겧(https://en.wikipedia.org/wiki/Certificateless_cryptography)**庸뛵꿛樂뻒돾꺾귤BC뮊얶쀢쥒\r\n\r\n> CL-PKC꼿뻒좪쇆쩎뉜륄뮊벆뙊쩎좭뚱낑庸IBC庸괚쉰걌傅넊亂쮠뷖뙊뻒쇆봮쀢뉜쨩깼뙊좪쇆쩎먺뙊뻒뽺쇨BC좪먺뷖쩎윆쩎쉲븾亂꼿꼿覓갫쩚짿KGC庸괚걲뷚갫돾꺾꺾꽨뱒쀢쀢좪뉚괚쮞뙊KGC꺿쭷丹돾꺾羅언낻뙊좪뷖쉮뷖쩎윆쩎쉲븾亂꼿껀설둚돾꺾낊쫹꺾귂KGC젂쉰숣뻒쀣찌婦쩎껀쯴魃뙊CL-PKC꼿覓갫쇆좪뉜갡쒺KGC뻔갡眄쀦븾亂꼿쉮뉞린뷖CL-PKC슗KIIBC쉯쟈雷좪쉰쨩뉞옋낻疸쇈뱙副淚뽾뚟쀨꼿酩뫦낹쉱먾좪쀢欖궅쀢쇆봮쀢뉝끯曇쮞뙊\r\n\r\n坊募썪벆뷢쨐\r\n\r\n> OpenNHP擔覓뻒돾꺾뷖廖낑깼뮊얶쀢쥒먺쉳뽑募썪쀧뿳僚뀎벆뷖[OpenNHP괚쇆봮뫢](https://opennhp.org/cryptography/)뉜끡뷖먺돾\r\n\r\n## 疸쀥쪂r\n\r\n- 돾뽺걲꺾뙊좪뷙뉜냕꽦쩎뉠뽾댣뙊뻒걲귂欖쐕쉱쀦댣뉟짛琉뜦r\n- 廖낑깼돾꺾륛NS倣劉쥒뉠뛲떢뷖돾썭댵磊뉠쒽속\r\n- 벆돾뽺쉴먿댷걲귟DoS賚磊쉴쒼쭤\r\n- 뮊벆뙊쩎좪쉱꿘帽뛲걲賚磊쉰쟗欄룊r\n- 淡뢛송돾꺾쀢쫶쩎좪亂쮞뙊뙊좪뷖쉮뮊좪뉚돾뽺걲뉜냕\r\n- 꽦걲쩎뮊좬곐뮊벆귂걲넊벆좪뙊쩎좪쉳뿘傍\r\n- DNS벆젂뉠쒽속뙊쉱뚱낑깼돾꺾륛NS倣劉죞r\n- DDoS賚磊뉞일得꺾뙊쉰갡賴벆돾뼆r\n- 갡副뮊돾꺾뢖쩎꽦걲걲좪쐒쩎뽺뒦쀢뮊쩎쇆뮾r\n- 了뮌솆쉮뮊벆귂걲뮊좮숴낹좪먺뻒쉲옴낻\r\n- 돾쮞뒦쮞쀤쏏不뮊뉚왞뢖쩎걾짿뽺벆뮊건쮞쒺쩎걲뷖벆뽺벆뮊건쮞왞쩎넊쩎쀢뾆쨀\r\n- 燎雷썪쉮뮊얶쀢쥒멆짿ECC뀎벆쥒쇆걲IBC庸괚뉛覓뻒廖낑깼걲쇆봮쀢쉲뭨淡렢r\n\r\n<details>\r\n<summary>漏쫶쉳뽑募썪뉟몯命</summary>\r\n\r\n- **돾뽺걵뉜냕쉮뮊좬걌籃**庸뛲뙊좪뷖쉮쀢쫶쩎좪돾뽺걲剖먿댷돾꺾妨꽫뺲뻗뿘낊껃몗꺾籃꺾쉮뮊좬낊쫶쀢귂쮞뙊\r\n- **뮊벆귂걲넊벆좪뙊쩎좪쉳뿘傍**庸뛵딕麵봮쉮뷖쩎윆쩎뻕妨꽦돾꺾넊벆좪쉮꺾뮊좬낊쫶뙊\r\n- **廖낑깼돾꺾륛NS倣劉**庸뙧NS벆젂뻒뢖꺾憺얶돾썭댵磊뉠쒽속쮞뙊\r\n- **DDoS慕뽼눏**庸뛴갡賴拏벆돾뽿뺤傍걲걲귂갡賴拏왞쩎좭뉜냕賚磊뉠쒼쭤쮞뙊\r\n- **좪쐒쩎뽺뒦쀢뮊쩎쇆**庸뛴갡副뮊돾꺾뢖쩎꽦걲걲귅릢芳쀤쏏不뻒좪쐒쩎쀢썪껀낊쫶뙊\r\n- **IAM姆쐔낻**庸뛵딕駱떢쉮뮊벆귂걲뮊좮숴낹좪먺뻘냨쮞뙊\r\n- **聊덛쀤쏏不**庸뛲뽺벆뮊건쮞쒺쩎걲뷖벆뽺벆뮊건쮞왞쩎넊쩎쀢뽺돾쮞뒦쮞쀢뮊뉚왞뢖쩎걲쮞뙊\r\n- **欖궅쀥뚱낑깼**庸뙨CC뀎벆쥒쇆걲IBC쀢뽺쉱雷썪뮊얶쀢쥒먺뉛覓뻒뷘쨩궅쀢쇆봮쀢뉝끯曇쮞뙊\r\n</details>\r\n\r\n## 欄됄둚\r\n\r\nOpenNHP돾쮞뒦쮞쀢뷖쩎좪쐒쩎좪낻鉢賴썪쉰쏏不뮊뉚왞뢖쩎걲뷖쮞뙊\r\n\r\n- 뽺벆뮊건쮞쒺쩎걲뷖벒쨐쒺쩎걲뷖벆쉳껀쭓鉢賴썪쉮왞쩎넊쩎젂쉮뮊좪뉛찋彷쮞뗖r\n- 뽺벆뮊건쮞왞쩎넊쩚쨐쉮왞쩎넊/뮊쀢쐒쩎뉞띲꿘淡뢛송쮞뗖r\n- 왞쩎넊쩐쮞왞쩎넊쩚쨐넊뻒괚왞쩎좰둡쉴뛳찌뉛찋彷쮞뗖r\n- 쒺쩎걲뷖번쮞쒺쩎걲뷖벒쨐왞벆걸둡꿘帽뛲뉛찋彷쮞뗖r\n\r\n> 坊募썪쀤쏏不곎婦벆뷖[OpenNHP괚쇆봮뫢](https://opennhp.org/deploy/)뉜끡뷖먺돾\r\n\r\n## SPANHP쉱싒蒡\r\n[뽺뷖괚쇆봮쀢뮊뽺벆뮊좶짿CSA庸겧(https://cloudsecurityalliance.org/)꺾쀢쀢쩎좪륱쫶돾걲뷖뮌숰毛뽼묶免껊짿SDP庸괛즷樓](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2)썪놲쐒걷뿘傍쩚짿SPA庸괚쇆걲껀냚쮞꺾뷖쮞뙊NHP燎雷썪쉱뚱낑깼돾섞쩎먺쩎뻒뮊쩎쇆뉠뛲떢뷖쇆봮쀢淡뫨먚좪쐒쩎뽺쀢기欖왡뉜냄疸귂돾[AHAC滅덚뽔尨뒩둖](https://www.mdpi.com/2076-3417/14/13/5593)命쥒돾꺾뷖걲籃療봮쉱發쉴똃免꺾뉜燎꽦뷖쮞뙊\r\n\r\n| - | SPA |NHP | NHP쉰걀  |\r\n|:---|:---|:---|:---|\r\n| **뮊쩎쇆** | SPA왞쩎넊쩎쉮놲쐒건쭬낑깼귂걲뷖쩎윆/넊벆좯뿘傍쩎뢖쩎꽦걲꺾꽦걲쩎뮊좬걌籃뫢뢖쩎꽦걲뻖옗낻돾꺾뷖쮞뙊 | NHP-Server庸걲놲쐒건쭬낑깼귂걲뷖쩎윆/넊벆좯뿘傍쩎뢖쩎꽦걾쨀NHP-AC庸걲뮊좬걌籃뫢뢖쩎꽦걾쨀껀갡副뮊돾꺾뷖쮞뙊NHP-Server갼쉮좪걲欄됄둚꽦陋언좁좪쐒쩎쀢썪뉚왞뢖쩎걲쮞뙊 | <ul><li>놲돾뽺쩎뤾좶쨐쀢쫶쩎좭욷昉쉰뱈뢖쩎꽦NHP-Server꺿찋彷돾꺾왞쩎넊쩎괜갡副뮊돾꺾뷖쮞뙊</li><li>좪쐒쩎뽺쀢庸뙱HP-Server갡賴쮞뽺좪쩐깼뮊쩎괚欄됄둚낊쫶뙊</li><li>쇆봮쀢庸뛷뿘傍쩎껁갫뙊쮞淡뢛송돾꺾왞쩎넊쩎쇨P뮊괚섞좪꺾뽺벆뮊걲魃걲쮞</li></ul>|\r\n| **뛳찌** | 꼦雷좬냄 | 끫雷좬냄 | 뮊좬걌籃뫢쉮좪쩎좰뛶린걲淡뫨먚쉰냄疸 |\r\n| **廖낑깼돾섞쩎먺쩎** | 쐕랠쩎섞 | PKI쮞슐BC뀎벆쥒돾섞쩎먺쩎 |<ul><li>쇆봮쀢庸뙰ITM珞뉟짛琉뙊傍쩑땙돾꺾丹괜뻒쀨꼿啖벉끹뫢쥒</li><li>擔뀎좪걾쨐쩎쇆걲뽺좪걲뮊귂놲궟꾾眄쀨꼿꽨잮</li><li>놲돾뽺쩎뤾좶쨐父떢놲돾뽺쩎뤾좪쉱뚱낑깼/籃뽼낑깼</li></ul>|\r\n| **꽦걲쩎벆돾뽺좪걲뽺剖먿댷쫸궅** | 왞쩎넊쩎뢖쩎걲쉮 | 괚뫢벆IP뢖쩎 | 欖쐕DNS벆젂DDoS賚磊쀢뽺돾쮞뒦쮞쀥댵磊亂쮞뙊欖궅쀨쒼쭤 |\r\n| **기欖왡** | 쀢SDP卵覓 | 劉뀒댣 | 괚왞쩎좭뚱部뉜깼쉰쯴魃꺾귂쀢쀢亂쮠찊 |\r\n| **眠젃뉠覓뻕** | 걀覓뻓잸낊 | 좪뤾벆쥔낊쪞 NHP了뮌솆쉮쇆걲庸걳쭒庸뙧NSFIDO쀢뾆쨀뻒쩎먺섞좪姆쐔낻낊 |\r\n\r\n## 걲쀢봮쩎쓮r\n\r\nOpenNHP젂쉳쒁꺑뉝솁謗뀎쮞뙖째昉뮎꺑雷좭씟쉳뽑募썪벆뷖[걲쀢봮쩎섞벆괚뽺벆쓯(CONTRIBUTING.md)뉜끡뷖먺돾\r\n\r\n## 뽺벆젶r\n\r\nOpenNHP슡Apache 2.0뽺벆젷(LICENSE)쉯잶쀢쀢쩎좪돾꺾뷖쮞뙊\r\n\r\n## 姆뫤\r\n\r\n- 쇆젂걲뷖뒦왞벆걾쨐[https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\r\n- 뫢쩎庸뙽opennhp@gmail.com](mailto:opennhp@gmail.com)\r\n- Slack꽦庸뙽Slack끡먺뙊귷(https://slack.opennhp.org)\r\n\r\n坊募썪쀢괚쇆봮뫢걲벆뷖[선쨆괚쇆봮뫢](https://opennhp.org)뉚덛붢먺돾\r\n\r\n## 끡雷꺑\r\n\r\n- [쫶돾걲뷖뮌숰毛뽼묶免껊짿SDP庸괛즷樓 v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2)Jason GarbisJuanita KoilpillaiJunaid IslamBob FloresDaniel BaileyBenfeng ChenEitan BremlerMichael RozaAhmed Refaey Hussein[*뽺뷖괚쇆봮쀢뮊뽺벆뮊좶짿CSA庸*](https://cloudsecurityalliance.org/)2022嵐3燎걲\r\n- [AHAC庸뛸삊擥뷖쀢꽦걲쩎剖먿댷뮊좬걌籃뫢돾섞쩎먺쩎슣(https://www.mdpi.com/2076-3417/14/13/5593)Mudi XuBenfeng ChenZhizhong TanShan ChenLei WangYan LiuTai Io SanSou Wang FongWenyong WangJing Feng*纜럲댣椧놴솑젂쩎귂*2024嵐6燎걲\r\n- 뀎벆쥒쇆걲돾섞쩎먺쩎https://noiseprotocol.org/\r\n- 欖쐕酩뫦낹돾섞쩎먺쩎쇆젂걲https://phoenix.security/web-vuln-management/\r\n\r\n---\r\n\r\n九 OpenNHP덜둭纜뉚귄싃먺꽦귂꺾뻒덖뒦쮞뙖째眄樓떢쉳쒁꺑뻒돾쩎괚넊뉚귄쭌뫢뷖귂귂쮞뙊\r\n\r\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 18.212890625,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\n\n![OpenNHP Logo](docs/images/logo11.png)\n# OpenNHP: Zero Trust Network-resource Hiding Protocol\n\n**NHP (Network-resource Hiding Protocol)** is a lightweight, cryptography-based Zero Trust protocol designed to safeguard servers and data from attackers by leveraging resource-hiding and encryption. It includes two core sub-protocols:\n\n- **Network-infrastructure Hiding Protocol (nHP):** Protects servers and applications by concealing domains, IP addresses, and ports.  \n- **Data-object Hiding Protocol (dHP):** Ensures data security and privacy by making data \"usable but not visible\" through cryptographic key negotiation and encryption.\n\n**OpenNHP** is the open source implementation of NHP.\n\n![Build Status](https://img.shields.io/badge/build-passing-brightgreen)\n![Version](https://img.shields.io/badge/version-1.0.0-blue)\n![License](https://img.shields.io/badge/license-Apache%202.0-green)\n\n---\n\n## Challenge: AI transforms the Internet into a \"Dark Forest\" \n\nThe rapid evolution of **AI** technologies, particularly large language models (LLMs), is significantly reshaping the cybersecurity landscape. The emergence of **Autonomous Vulnerability Exploitation (AVE)** represents a major leap in the AI era, streamlining the exploitation of vulnerabilities, as highlighted in recent research such as [[1]](https://googleprojectzero.blogspot.com/2024/10/from-naptime-to-big-sleep.html), [[2]](https://arxiv.org/abs/2404.08144), [[3]](https://github.com/protectai/vulnhuntr) and etc. This development dramatically increases the risk for any exposed network services, reflecting the [Dark Forest Hypothesis](https://en.wikipedia.org/wiki/Dark_forest_hypothesis) of the Internet. AI-powered tools are continuously scanning the digital realm, quickly finding and exploiting weaknesses. Consequently, the Internet is evolving into a **\"Dark Forest,\"** where **visibility equates to vulnerability**.\n\n![Vulnerability Risks](docs/images/Vul_Risks.png)\n\nGartner research anticipates a [sharp rise in AI-driven cyberattacks](https://www.gartner.com/en/newsroom/press-releases/2024-08-28-gartner-forecasts-global-information-security-spending-to-grow-15-percent-in-2025). To address these threats, CISA recently issued an executive order mandating a [14-day deadline for vulnerability remediation](https://www.cisa.gov/sites/default/files/2024-10/Proposed-Security-Requirements-EO-14117-21Oct24508.pdf). This shift necessitates a reevaluation of traditional cybersecurity approaches, emphasizing proactive defense, rapid response strategies, and the deployment of network-hiding technologies to protect critical infrastructure.\n\n---\n\n## Quick Demo: See OpenNHP in Action\n\nBefore diving into the details of OpenNHP, let's start with a quick demonstration of how OpenNHP protects a server from unauthorized access. You can see it in action by accessing the protected server at https://acdemo.opennhp.org.\n\n### 1) The Protected Server is \"Invisible\" to Unauthenticated Users\n\nBy default, any attempt to connect to the protected server will result in a TIME OUT error, as all ports are closed, making the server appear offline and effectively *\"invisible.\"*\n\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo0.png)\n\nPort scanning the server will also return a TIME OUT error.\n\n![OpenNHP Demo](docs/images/OpenNHP_ScanDemo.png)\n\n### 2) After Authentication, the Protected Server Becomes Accessible\n\nOpenNHP supports a variety of authentication methods, such as OAuth, SAML, QR codes, and more. For simplicity, this demo uses a basic username/password authentication service at https://demologin.opennhp.org to demonstrate the process.\n\n![OpenNHP Demo](docs/images/OpenNHP_DemoLogin.png)\n\nOnce you click the \"Login\" button, authentication is completed successfully, and you are redirected to the protected server. At this point, the server becomes *\"visible\"* and accessible on your device.\n\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo1.png)\n\n---\n\n## Vision: Making the Internet Trustworthy\n\nThe openness of TCP/IP protocols has driven the explosive growth of internet applications but also exposed vulnerabilities, allowing malicious actors to gain unauthorized access and exploit any exposed IP address. Although the [OSI network model](https://en.wikipedia.org/wiki/OSI_model) defines the *5th layer (Session Layer)* for managing connections, few effective solutions have been implemented to address this.\n\n**NHP**, or the **\"Network-resource Hiding Protocol\"**, is a lightweight cryptography-driven Zero Trust  protocol designed to function at the *OSI 5th and 6th Layer*, which is optimal for managing network visibility and connections. NHP's key objective is to conceal protected resources from unauthorized entities, granting access only to verified, authorized users through continuous verification, contributing to a more trustworthy Internet.\n\n![Trustworthy Internet](docs/images/TrustworthyCyberspace.png)\n\n---\n\n## Solution: OpenNHP Fixes the Network/Data Visibility Control\n\n**OpenNHP** is the open-source implementation of the NHP protocol. It is cryptography-driven and designed with security-first principles, implementing a true zero-trust architecture at the *OSI Session and Presentation Layer*. \n\n![OpenNHP as the OSI 5th and 6th layer](docs/images/OSI_OpenNHP2.png)\n\nOpenNHP builds upon earlier research in network hiding technology, utilizing modern cryptographic framework and architecture to ensure security and high performance, thereby overcoming the limitations of previous technologies.\n\n| Network Hiding Protocol | 1st Generation | 2nd Generation | 3rd Generation |\n|:---|:---|:---|:---|\n| **Core Technology** | [Port Knocking](https://en.wikipedia.org/wiki/Port_knocking) | [Single Packet Authorization (SPA)](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) | Network-resource Hiding Protocol (NHP) |\n| **Authentication** | Port sequences | Shared Secrets | Modern Crypto Framework |\n| **Architecture** | No Control Plane | No Control Plane | Scalable Control Plane |\n| **Capability** | Hide Ports | Hide Ports | Hide Ports, IPs and Domains |\n| **Access Control** | IP Level | Port Level | Application Level |\n| **Open Source Projects** | [knock](https://github.com/jvinet/knock) *(C)* | [fwknop](https://github.com/mrash/fwknop) *(C++)* | [OpenNHP](https://github.com/OpenNHP/opennhp) *(Go)* |\n\n> It is crucial to choose a **memory-safe** language like *Go* for OpenNHP development, as emphasized in the [US Government technical report](https://www.whitehouse.gov/wp-content/uploads/2024/02/Final-ONCD-Technical-Report.pdf). For a detailed comparison between **SPA and NHP**, refer to the [section below](#comparison-between-spa-and-nhp).\n\n## Security Benefits\n\nSince OpenNHP implements Zero Trust principles at the *OSI Session Layer*, it offers significant benefits:\n\n- Reduces attack surface by hiding infrastructure\n- Prevents unauthorized network reconnaissance\n- Mitigates vulnerability exploitation\n- Stops phishing via encrypted DNS\n- Protects against DDoS attacks\n- Enables fine-grained access control\n- Provides identity-based connection tracking\n- Attack attribution\n\n## Architecture\n\nThe OpenNHP architecture is inspired by the [NIST Zero Trust Architecture standard](https://www.nist.gov/publications/zero-trust-architecture). It follows a modular design with the 3 core components: **NHP-Server**, **NHP-AC** and **NHP-Agent**, as illustrated in the below diagram.\n\n![OpenNHP architecture](docs/images/OpenNHP_Arch.png)\n\n> Please refer to the [OpenNHP Documentation](https://opennhp.org/) for detailed information about architecture and workflow.\n\n## Core: Cryptographic Algorithms\n\nCryptography is at the heart of OpenNHP, providing robust security, excellent performance, and scalability by utilizing cutting-edge cryptographic algorithms. Below are the key cryptographic algorithms and frameworks employed by OpenNHP:\n\n- **[Elliptic Curve Cryptography (ECC)](https://en.wikipedia.org/wiki/Elliptic-curve_cryptography):** Used for efficient public key cryptography.\n\n> Compared to RSA, ECC offers superior efficiency with stronger encryption at shorter key lengths, improving both network transmission and computational performance. The table below highlights the differences in security strength, key lengths, and the key length ratio between RSA and ECC, along with their respective validity periods.\n\n| Security Strength (bits) | DSA/RSA Key Length (bits) | ECC Key Length (bits) | Ratio: ECC vs. DSA/RSA | Validity |\n|:------------------------:|:-------------------------:|:---------------------:|:----------------------:|:--------:|\n| 80                       | 1024                      | 160-223               | 1:6                    | Until 2010 |\n| 112                      | 2048                      | 224-255               | 1:9                    | Until 2030 |\n| 128                      | 3072                      | 256-383               | 1:12                   | After 2031 |\n| 192                      | 7680                      | 384-511               | 1:20                   | |\n| 256                      | 15360                     | 512+                  | 1:30                   | |\n\n- **[Noise Protocol Framework](https://noiseprotocol.org/):** Enables secure key exchange, message encryption/decryption, and mutual authentication.\n\n> The Noise Protocol is built around the [Diffie-Hellman key agreement](https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange) and provides modern cryptographic solutions like mutual and optional authentication, identity hiding, forward secrecy, and zero round-trip encryption. Proven for its security and performance, it is already used by popular applications like [WhatsApp](https://www.whatsapp.com/security/WhatsApp-Security-Whitepaper.pdf), [Slack](https://github.com/slackhq/nebula) and [WireGuard](https://www.wireguard.com/).\n\n- **[Identity-Based Cryptography (IBC)](https://en.wikipedia.org/wiki/Identity-based_cryptography):** Simplifies key distribution at scale.\n\n> Efficient key distribution is essential for implementing Zero Trust. OpenNHP supports both PKI and IBC. While PKI has been widely used for decades, it depends on centralized Certificate Authorities (CA) for identity verification and key management, which can be time-consuming and costly. In contrast, IBC allows for a decentralized and self-governing approach to identity verification and key management, making it more cost-effective for OpenNHP's Zero Trust environment, where billions of devices or servers may need protection and onboarding in real-time.\n\n- **[Certificateless Public Key Cryptography (CL-PKC)](https://en.wikipedia.org/wiki/Certificateless_cryptography):** Recommended IBC algorithm \n\n> CL-PKC is a scheme that enhances security by avoiding key escrow and addressing the limitations of Identity-Based Cryptography (IBC). In most IBC systems, a user's private key is generated by a Key Generation Center (KGC), which introduces significant risks. A compromised KGC can lead to the exposure of all users' private keys, requiring full trust in the KGC. CL-PKC mitigates this issue by splitting the key generation process, so the KGC only has knowledge of a partial private key. As a result, CL-PKC combines the strengths of both PKI and IBC, offering stronger security without the drawbacks of centralized key management.\n\nFurther reading:\n\n> Please refer to the [OpenNHP Documentation](https://opennhp.org/cryptography/) for detailed explanation of cryptographic algorithms used in OpenNHP.\n\n## Key Features\n\n- Mitigates vulnerability exploitation by enforcing \"deny-all\" rules by default\n- Prevents phishing attacks through encrypted DNS resolution\n- Protects against DDoS attacks by hiding infrastructure\n- Enables attack attribution through identity-based connections\n- Default-deny access control for all protected resources\n- Identity and device-based authentication before network access\n- Encrypted DNS resolution to prevent DNS hijacking\n- Distributed infrastructure to mitigate DDoS attacks\n- Scalable architecture with decoupled components\n- Integration with existing identity and access management systems\n- Support for various deployment models (client-to-gateway, client-to-server, etc)\n- Cryptographically secure using modern algorithms (ECC, Noise Protocol, IBC)\n\n<details>\n<summary>Click to expand feature details</summary>\n\n- **Default-deny access control**: All resources are hidden by default, only becoming accessible after authentication and authorization.\n- **Identity and device-based authentication**: Ensures that only known users on approved devices can gain access.\n- **Encrypted DNS resolution**: Prevents DNS hijacking and associated phishing attacks.\n- **DDoS mitigation**: Distributed infrastructure design helps protect against Distributed Denial of Service attacks.\n- **Scalable architecture**: Decoupled components allow for flexible deployment and scaling.\n- **IAM integration**: Works with your existing Identity and Access Management systems.\n- **Flexible deployment**: Supports various models including client-to-gateway, client-to-server, and more.\n- **Strong cryptography**: Utilizes modern algorithms like ECC, Noise Protocol, and IBC for robust security.\n</details>\n\n## Deployment\n\nOpenNHP supports multiple deployment models to suit different use cases:\n\n- Client-to-Gateway: Secures access to multiple servers behind a gateway\n- Client-to-Server: Directly secures individual servers/applications\n- Server-to-Server: Secures communication between backend services\n- Gateway-to-Gateway: Secures site-to-site connections\n\n> Please refer to the [OpenNHP Documentation](https://opennhp.org/deploy/) for detailed deployment instructions.\n\n## Comparison between SPA and NHP\nThe Single Packet Authorization (SPA) protocol is included in the [Software Defined Perimeter (SDP) specification](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) released by the [Cloud Security Alliance (CSA)](https://cloudsecurityalliance.org/). NHP improves security, reliability, scalability, and extensibility through a modern cryptographic framework and architecture, as demonstrated in the [AHAC research paper](https://www.mdpi.com/2076-3417/14/13/5593).\n\n| - | SPA |NHP | NHP Advantages  |\n|:---|:---|:---|:---|\n| **Architecture** | The SPA packet decryption and user/device authentication component is coupled with the network access control component in the SPA server. | NHP-Server (the packet decryption and user/device authentication component) and NHP-AC( the access control component) are decoupled. NHP-Server can be deployed in separate hosts and supports horizontal scaling. | <ul><li> Performance: the resource-consuming component NHP-server is separated from the protected server. </li><li>Scalability: NHP-server can be deployed in distributed or clustered mode.</li><li>Security: the IP address of the protected server is not visible to the client unless the authentication succeeded. </li></ul>|\n| **Communication** | Single direction | Bi-direction | Better reliability with the status notification of access control |\n| **Cryptographic framework** | Shared Secretes | PKI or IBC, Noise Framework |<ul><li>Security: proven secure key exchange mechanism to mitigate the MITM threats</li><li>Low cost: efficient key distribution for zero trust model</li><li>Performance: high performance encryption/decryption</li></ul>|\n| **Capability of Hiding network infrastructure** | Only server ports | Domain, IP, and ports | More powerful against various attacks(e.g., vulnerabilities, DNS hijack, and DDoS attacks) |\n| **Extensibility** | None, only for SDP | All-purpose | Support any scenario that needs service darkening |\n| **Interoperability** | Not available | Customizable| NHP can seamlessly integrate with existing protocols (e.g., DNS, FIDO, etc.) |\n\n\n## Contributing\n\nWe welcome contributions to OpenNHP! Please see our [Contributing Guidelines](CONTRIBUTING.md) for more information on how to get involved.\n\n\n## License\n\nOpenNHP is released under the [Apache 2.0 License](LICENSE).\n\n\n## Contact\n\n- Project Website: [https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\n- Email: [opennhp@gmail.com](mailto:opennhp@gmail.com)\n- Slack Channel: [Join our Slack](https://slack.opennhp.org)\n\nFor more detailed documentation, please visit our [Official Documentation](https://opennhp.org).\n\n\n## References\n\n1. [From Naptime to Big Sleep: Using Large Language Models To Catch Vulnerabilities In Real-World Code](https://googleprojectzero.blogspot.com/2024/10/from-naptime-to-big-sleep.html), Google Big Sleep team. Google Project Zero. Oct 2024.\n2. [LLM Agents can Autonomously Exploit One-day Vulnerabilities](https://arxiv.org/abs/2404.08144). Richard Fang, Rohan Bindu, Akul Gupta, Daniel Kang. arxiv. April 2004.\n3. [VulnHuntr: Zero shot vulnerability discovery using LLMs](https://github.com/protectai/vulnhuntr). VulnHuntr Open Source Project: https://github.com/protectai/vulnhuntr. \n4. [Software-Defined Perimeter (SDP) Specification v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2). Jason Garbis, Juanita Koilpillai, Junaid lslam, Bob Flores, Daniel Bailey, Benfeng Chen, Eitan Bremler, Michael Roza, Ahmed Refaey Hussein. [*Cloud Security Alliance(CSA)*](https://cloudsecurityalliance.org/). Mar 2022.\n5. [AHAC: Advanced Network-Hiding Access Control Framework](https://www.mdpi.com/2076-3417/14/13/5593). Mudi Xu, Benfeng Chen, Zhizhong Tan, Shan Chen, Lei Wang, Yan Liu, Tai Io San, Sou Wang Fong, Wenyong Wang, and Jing Feng. *Applied Sciences Journal*. June 2024.\n6. Noise Protocol Framework. https://noiseprotocol.org/\n7. Vulnerability Management Framework project. https://phoenix.security/web-vuln-management/ \n\n---\n\n游 Thank you for your interest in OpenNHP! We look forward to your contributions and feedback.\n"
        },
        {
          "name": "README.zh-cn.md",
          "type": "blob",
          "size": 14.8046875,
          "content": "[![en](https://img.shields.io/badge/lang-en-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.md)\n[![zh-cn](https://img.shields.io/badge/lang-zh--cn-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.zh-cn.md)\n[![de](https://img.shields.io/badge/lang-de-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.de.md)\n[![ja](https://img.shields.io/badge/lang-ja-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.ja.md)\n[![fr](https://img.shields.io/badge/lang-fr-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.fr.md)\n[![es](https://img.shields.io/badge/lang-es-green.svg)](https://github.com/OpenNHP/opennhp/blob/master/README.es.md)\n\n![OpenNHP Logo](docs/images/logo11.png)\n# OpenNHP: 副윇찌坍母놶즾剖넏줢꼞房쇺nOpenNHP僚疸疸쀧쫕暮癩쥓줉먼싅酩柳됂뚟副윇찌坍母놶즾꼞房쉺쨃윈인擔런랻OSI母놶즾淚뫤룲蓂섟줎欄庸껂댣啖뀔뚫般뻖뚟燎꽨궈謄뻔눏賴썭꼹庸껄꽫뭚賚끰꿣得껃付쇺n\n![Build Status](https://img.shields.io/badge/build-passing-brightgreen)\n![Version](https://img.shields.io/badge/version-1.0.0-blue)\n![License](https://img.shields.io/badge/license-Apache%202.0-green)\n\n---\n\n## 깸갲庸뙤I 卵啖뉟덚쪰끶疸쥑럴즴廖龍쉱룽렢n\n**AI** 燎眄纜끰欄됊쨃卵번윉땶邏放쇋淚뫤룲庸LLM庸괦쨃蔞喇뻕쮣녱賚좬끶母놶즾丹괜뻕먚欄**쀣쟡硫榴륀걀覓뻞짿AVE庸** 眄얻옹僚 AI 了윇짂眄疸疸쀨꽨뱒富륃읚庸껀뱒邏酩깼啖硫榴륂뚟걀覓뻞쨃謗뙋좬랻[謗뙎싆滅덚뽔房쥕둖](https://arxiv.org/abs/2404.08144)疸쇉랠放뷚즩放얹땙謗뙋끰欄됁쮣녱螺륀먻줁坍擔됁뛊否쒾쪰某럱랤궈眄富뀔똘庸꺿잹啖뉟덚쪰眄ㅌ部놵뚱龍쉱룽放](https://en.wikipedia.org/wiki/Dark_forest_hypothesis)疸꽫쌞껀낻AI 浮쐔궏眄剌봰疸꽩둸곪끮賴썬솅꿢螺庸껃쯴放걂得껀걀覓뻔쨤좪騰먽솏庸꺿뉟덚쪰蔞넍잻갫疸쥓疸**럴즴廖龍쉱룽**庸**낊倣鈍緬欖쐕**\n\n![Vulnerability Risks](docs/images/Vul_Risks.png)\n\nGartner 滅덚뽔孵流庸[AI 浮쐔궏眄母놶즾賚卵謗螺륀](https://www.gartner.com/en/newsroom/press-releases/2024-08-28-gartner-forecasts-global-information-security-spending-to-grow-15-percent-in-2025)謗뙋끶깼魃劉꽩둻放憺썫먾眄母놶즾丹괜뻖솄免봺쨃꽪좭쮠랻疸궏俯쒼쭤纜嶝꽨줎燎쥔걌得껂쪰某럴뚫般燎眄覓뻞쨃坍봯찋궋鋒쉰맄蔑房쮡뒇\n\n---\n\n## 纜硫덚뱤庸뛵린綿 OpenNHP 眄剌봯쪺낹\n\n喇뻕임봯줁倣 OpenNHP 眄放뷚즩淡뫥達곐庸껃숼갬坍선걵론綿疸疸 OpenNHP 洛擔돿찋궋燎꽨궈謄뻔꽨끵燎쀦즲꾿療房付쉲뚟硫덚뱤뻔낊坍봴뛷쯶房付 https://acdemo.opennhp.org 聊봲랢윈륄뗸賴걵뤂\n\n### 1) 끵淡뢙궋眄燎꽨궈謄뻔싳燎쀦즲舫坍쫼뿗放眄覓뻕걍럯잸낊倣렢n\n部떧숷왟잶庸꺿짙擔됃싓騰쮣륁꿘끵淡뢙궋燎꽨궈謄뻖뚟賂꽧쪺쫷쨐亂쩓얻운了윌댗放庸껀먻쟠燎괞삞끾쫹땶付쇊뚟庸꺿燎꽨궈謄뻖랢滂療봰僚*럲붵暮*疸던륄뗸疸귅땶럯잸낊倣뢚뚟\n\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo0.png)\n\n亂좭랤궈謄뻗찉發껂삞끾곪끮達憺뛷찂騰륃운了윌댗放\n\n![OpenNHP Demo](docs/images/OpenNHP_ScanDemo.png)\n\n### 2) 舫坍쫼뿗放냁庸껀끵淡뢙궋眄燎꽨궈謄뻔끶籃낊房付쇺n\nOpenNHP 賚깨邏뛶븴舫坍쫼뿗放雷좭씟庸껀북 OAuthSAML啖껂짒滅螟괚疸쥓줁硫덚뱤雷좫庸껁랿縷뫥쨊命쥓覓 https://demologin.opennhp.org 疸귆뚟癩쥕랿覓뻕걍냀/亂滅舫坍쫼뿗放燎꽨궈療봰쏏命쥗신謗溟\n\n![OpenNHP Demo](docs/images/OpenNHP_DemoLogin.png)\n\n좬럲똩濫돽뢙깰蜂쉰냁庸껃줢坍쫼뿗放갫丹껁갫庸껁뻓쨐跋꽨숰냄걇끵淡뢙궋眄燎꽨궈謄뻒蔞벉딨庸껁랤궈謄뻔랻뻖뚟房쮠밶疸귄끶籃*런낊倣*嵐윇잾낊坍봳付쉮\n\n![OpenNHP Demo](docs/images/OpenNHP_ACDemo1.png)\n\n---\n\n## 寮庸뛷숼啖뉟덚쪰끶籃쩐쭝淡뫧옜\n\nTCP/IP 꼞房쉲뚟欖賚쮡꿛궏啖啖뉟덚쪰擥덚댣眄갡전쨆螺륄庸꺿쪥達廖얼쒻줁硫榴륊쨃擔籃윉賚낊坍봳꿩籃燎쀦즲꾿療眄房付쉰좄걀覓뻓짙擔됁뛊否쒾뚟 IP 喇썬卵쫺숴 [OSI 母놶즾淚뫤룲](https://en.wikipedia.org/wiki/OSI_model) 喇*蓂섟줎欄庸걳쨐放뢘쎽庸*丹뛳졜啖謗륁꿘酩뫦낹庸꺿쪥喇뻔륄뗸疸쇈쭏卵놵랠燎괝뎯眄倣雷좭몓쫸擥던싳謗뙋깸갲\n\n**NHP**庸껀꼽**럲쪰某런맄蔑房쮡뒇剖넏딆꼞房쉭**庸껁땶疸椧꽫쫕暮癩쥓줉먼싅眄副윇찌坍母놶즾꼞房쉺쨃了뻔랻剌봯쪺啖*OSI 憺뛷싛欄*庸껃신欄喇뻖숴낹母놶즾낊倣得껃륁꿘雷좰록僚燎擔괝길NHP 眄疸魃眠쉱맪僚卵끵淡뢙궋眄滂留널뚫般啖뀑랽꾿療眄丹뤿쪱庸껀낅ㅖ房젆즲謗溥껃싀眄覓뻕걍뛷쯶깨某쇋숷放房付쉺쨃坍뀓꺿쟠料언쩐쭝淡뫧옜眄啖뉟덚쪰擔런쥗야꺑\n\n![Trustworthy Internet](docs/images/TrustworthyCyberspace.png)\n\n---\n\n## 倣雷좭몓庸뙲penNHP 倣母놶즾낊倣꿚걌付쉴뭊\n\n**OpenNHP** 僚 NHP 꼞房쉲뚟欖留넌륂꿣丹癩쥓줉먼싅燎庸껄覓뻔술뻓쨎걶뚟갳庸껀랻*OSI 憺뛷싛欄*丹륂꿣啖綿蔞眄副윇찌坍瞭윉룫\n\n![OpenNHP as the OSI 5th layer](docs/images/OSI_OpenNHP.png)\n\nOpenNHP 瞭攬쥔랻了뽽眄母놶즾剖넏딆燎滅덚뽔癩쥖達疸귎쨃걀覓뻖꿣坍먼싅遼瞭윈눏瞭윉룫蔑쉯찋丹괜뻕得껄삊쬂쨃坍뀓껀燎꽧줁곐坍燎眄欄傅넍\n\n| 母놶즾剖넏딆꼞房 | 蓂섟坍 | 蓂섟줇坍 | 蓂섟잴坍 |\n|:---|:---|:---|:---|\n| **蓼전쯲燎** | [茗끾賴쓀딛](https://en.wikipedia.org/wiki/Port_knocking) | [꼣깬房벋싀庸SPA庸겧(https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) | 母놶즾癩쥖房쮡뒇剖넏딆꼞房쉺짿NHP庸 |\n| **舫坍쫻숷放** | 茗끾擥갱 | 쐓줢亂蜂 | 꿣坍먼싅遼瞭 |\n| **瞭윉룫** | 了먽꿚걌嵐咐 | 了먽꿚걌嵐咐 | 낊골欄됁꿚걌嵐咐 |\n| **** | 剖넏딆茗끾 | 剖넏딆茗끾 | 剖넏딆茗끾IP 得껀냀 |\n| **房付쉱꿚걌** | IP 欄暮 | 茗끾欄暮 | 擥덚댣欄暮 |\n| **欖留널몿眠** | [knock](https://github.com/jvinet/knock) *(C)* | [fwknop](https://github.com/mrash/fwknop) *(C++)* | [OpenNHP](https://github.com/OpenNHP/opennhp) *(Go)* |\n\n> 欖끰 OpenNHP 괝길擔覓**駱떤술**眄放쇋洛 *Go*庸껃찇疸좬랻[毛뀐띻賚擥럱燎권鈍굏(https://www.whitehouse.gov/wp-content/uploads/2024/02/Final-ONCD-Technical-Report.pdf)疸쇈쭝걇啖欖쥗쌖燎괜 **SPA 得 NHP** 達付얻싡某眄鏤덛쭊庸껃싱끡倣[疸雷](#comparison-between-spa-and-nhp)\n\n## 丹괜뻕憺떤쯒n\n覓쐓줉 OpenNHP 喇 *OSI 憺뛷싛欄*丹륂꿣啖副윇찌坍갳庸껀먽솏燎괝쮣녱眄憺떤庸뙾n\n- 뛷쯶剖넏딆癩쥖房쮡뒇卵놵댵咐묖n- 俯쒽속燎쀦즲꾿療眄母놶즾曇뷘륲n- 卵놵쨆榴륀걀覓뻖뚟낊쫹븊n- 뛷쯶먼싅眄 DNS 淡뢙궋俯쒽속蜂膚\n- 궛籃 DDoS 賚즆n- 끯曇某侮뉜줝眄房付쉱꿚걌\n- 丹륂꿣癩쥓줉舫坍쫺뚟謗륁꿘謗쫻쟑\n- 賚깨賚留留\n\n## 瞭윉룫\n\nOpenNHP 眄瞭윉룫끵 [NIST 副윇찌坍瞭윉룫蓼](https://www.nist.gov/publications/zero-trust-architecture) 냞끰庸껄覓뻕뺘懶깼房쮣숴庸껀깬냚疸괛쟑蓼전쯲某坍윒쨐**NHP-Server****NHP-AC** 得 **NHP-Agent**庸껀북疸騰쮡命쥒\n\n![OpenNHP architecture](docs/images/OpenNHP_Arch.png)\n\n> 燎괜瞭윉룫得껀인擔럱예溟眄放뷚즩淡뫥庸껃싱끡俯 [OpenNHP 雷遼뮿(https://opennhp.org/)\n\n## 蓼전쯲庸뛴먼싅酩柳뎊n\n먼싅僚 OpenNHP 眄蓼전쯲庸껁끯曇欖쥔뱒眄丹괜뻕쥗쒾뚟쫸눏낊골欄됁庸꺿覓뻓줁걷찉眄먼싅酩柳돾坍봯잶僚 OpenNHP 覓뻖뚟鋒쉰먼싅酩柳됀눏遼瞭윒쨐\n\n- **[壘쇈랝料쒾亂滅駱뷢짿ECC庸겧(https://en.wikipedia.org/wiki/Elliptic-curve_cryptography)**庸뛶댣啖뀔삊賴걶뚟설눤亂滅駱뷖\n\n> 疸 RSA 眠젅싒庸ECC 燎괝띲父떦뚟賴걶꾾庸꺿진訪麵쇊뚟亂蜂봴擥뷙끯曇料언쨬眄먼싅쫸궅庸꺿즱껁끯父떦쪰某럯먿쭙得껃숴酩쫶疸發뻕쮢뱤啖 RSA 得 ECC 喇뻔술뻔쨬擥뷖亂蜂봴擥뷘눏亂蜂봴擥뷙싒꾾疸귆뚟剌쉰짹庸꺿진끩윉랠賴걵\n\n| 丹괜뻔쨬擥뷢짿擔꽲쨀 | DSA/RSA 亂蜂봴擥뷢짿擔꽲쨀 | ECC 亂蜂봴擥뷢짿擔꽲쨀 | 鏤덚꾾庸뙨CC 疸 DSA/RSA | 燎괝뎯燎 |\n|:---------------:|:----------------------:|:-----------------:|:------------------:|:------:|\n| 80              | 1024                   | 160-223           | 1:6                | 걇 2010 嵐 |\n| 112             | 2048                   | 224-255           | 1:9                | 걇 2030 嵐 |\n| 128             | 3072                   | 256-383           | 1:12               | 2031 嵐언냁 |\n| 192             | 7680                   | 384-511           | 1:20               | |\n| 256             | 15360                  | 512+              | 1:30               | |\n\n- **[Noise 꼞房쉱몑瞭욓(https://noiseprotocol.org/)**庸뛶댣啖뀐술뻖뚟亂蜂봯줛꼭溜걵먼싅/倣亂得껂띶啖뉟줢坍쫻숷放\n\n> Noise 꼞房쉰맄啖꾙Diffie-Hellman 亂蜂봯줛꼭](https://en.wikipedia.org/wiki/Diffie%E2%80%93Hellman_key_exchange)庸껁끯曇啖꿣坍먼싅倣雷좭몓庸껀북眠젃뉜눏낊괟숷放舫坍쫼뚫般곐냄丹괜뻕得껄띴蚌쉱샤먼싅丹剌쒿뭚 WhatsAppSlack 得 WireGuard 螟괜줎覓뻔柳溥껃싀嵐윇覓뻞쨃放僚뀐윈술뻕得껁쫶\n\n- **[癩쥓줉舫坍쫺뚟먼싅庸IBC庸겧(https://en.wikipedia.org/wiki/Identity-based_cryptography)**庸뛶깼啖邏倣淚뫦뚟亂蜂봰갡끰\n\n> 父떥뎯眄亂蜂봰갡끰僚丹륂꿣副윇찌坍眄鋒쉮OpenNHP 賚깨 PKI 得 IBC返쫺 PKI 剌쒾즲跋嵐柳擔覓뻞쨃擔丹曇뢛옜啖뀔띉疸쇈쨆眄放達뷜무끰燎쥕룫庸CA庸괟찉發껃줢坍쫼뿗放得껀싅蜂봲숴낹庸껃찇喇뻕딨付언눏갫燎섟잵訪疸쥕땍榜왞眠젅싒達疸庸IBC ㅖ房전랻舫坍쫼뿗放得껀싅蜂봲숴낹雷좰록覓뻔꿭疸쇈쯲깼得껃쀥갬酩뫦낹眄雷좭씟庸꺿윈랻 OpenNHP 眄副윇찌坍꿢螺疸쇉띲갫燎섡뎯眠귎쨃卵번윉땶喇뻘魃丹륁딨淡뢙궋得껂숴낹賴썬꼐啖房쮠밶갰燎꽨궈謄뻖뚟왟잶\n\n- **[了먿싀達뷘설눤먼싅庸CL-PKC庸겧(https://en.wikipedia.org/wiki/Certificateless_cryptography)**庸뛵꿛꼟眄 IBC 酩柳돾\n\n> CL-PKC 僚疸椧꽬뛷쯶꽨싅蜂봱곚酩뫤눏倣癩쥓줉舫坍쫺뚟먼싅庸IBC庸괜傅넍療봰륀쨬丹괜뻕眄雷좭몓喇뻔뱒邏뛵돓 IBC 冒某疸쇒쨃覓뻕걍眄椧蜂봲댬亂蜂봲갫疸쇈쯲庸KGC庸괞갫庸껃찇辣뷙론啖僚쮣녱眄富뀔똘洛瞭 KGC 跋賚滅엂쨃燎괞댣걍眄椧蜂봴쫸낊쫻뭚柳否쓆쨃謗뙏부劉亂 KGC 丹껀뻓찌坍CL-PKC 뛷쯶卵亂蜂봲갫謗溟갡暝庸꺿 KGC 坍啖倣뻔갡椧蜂봺쨃坍뀓껄꽫찇疸付쉴뭊某瞭럺쨃CL-PKC 某낻啖 PKI 得 IBC 眄憺떦좶쨃喇뻓잸곸쒼술뻕眄왟잶끯曇料언쨬眄淡뢙궋\n\n料언뱈俯放庸뙾n\n> 燎괜 OpenNHP 疸쇇覓뻖뚟먼싅酩柳됂뚟放뷚즩放얹땙庸껃싱끡俯 [OpenNHP 雷遼뮿(https://opennhp.org/cryptography/)\n\n## 疸魃곷븊n\n- 뛷쯶欖쥔걌部떧숷런뻘뻕뉞즿뢛븫갳卵놵쨆榴륀걀覓\n- 뛷쯶먼싅眄 DNS 倣俯쒽속蜂膚쩑댵즆n- 뛷쯶剖넏딆癩쥖房쮡뒇淡뢙궋꽨끵 DDoS 賚즆n- 뛷쯶舫坍쫻찧肪쀧륁꿘丹륂꿣賚留留\n- 亂좭燎괜끵淡뢙궋滂留넎뚟部떧숷뉞즿房付쉱꿚걌\n- 喇뻖쪰某럳付쉰곐謗發껀맄啖뀓줢坍쫸눏房쮠밶眄舫坍쫻숷放\n- 먼싅眄 DNS 倣俯쒽속 DNS 궒깨\n- 갡辣欖癩쥖房쮡뒇궛籃 DDoS 賚즆n- 倣뷚즧坍윈륂꿣낊골欄됁뤘瞭ㅍn- 疸뀒꿣燎괟줢坍쫸눏房付쉲숴낹冒某副갫\n- 賚깨邏뛶븴뻖쒽뺘拏庸건숵걍茗걇母놴丹뮍걍茗걇燎꽨궈謄뻖셸庸겦n- 擔覓뻖꿣坍酩柳됊짿ECCNoise 꼞房쉮IBC庸괟찉發껀먼싅蔑쉯찋丹괜뻕븊n\n<details>\n<summary>좬欄됀곷放뷙</summary>\n\n- **部떧숷뉞즿房付쉱꿚걌**庸뛵燎괟옋留널즺房벌뚫般庸껀낅燎괠뛷쯶舫坍쫼뿗放得껁꾿療냁곐憺뛴끶籃낊房付쉮\n- **癩쥓줉舫坍쫸눏房쮠밶眄舫坍쫼뿗放**庸뛶몵淡뢘낅燎괜쒾린覓뻕걍喇뻕꾿療房쮠밶疸귄낊坍봳付쉮\n- **먼싅眄 DNS 倣**庸뛸쒽속 DNS 궒깨得껂띶眄蜂膚쩑댵\n- **DDoS 模倣**庸뛴갡辣欖癩쥖房쮡뒇房쮣숴燎괜궐啖뀑궛籃뫤갡辣欖뉞즿燎꽨궈賚\n- **낊골欄됁뤘瞭**庸뛷빆뷚즧坍윈ㅖ房젆왡얕뻖쒼눏골欄돾\n- **IAM 副갫**庸뛴낊坍봯잹꿣燎괟줢坍쫸눏房付쉲숴낹冒某꽨낻擔覓뻒\n- **왡얕뻖**庸뛵댪깨깬긻丹뮍걍茗걇母놴丹뮍걍茗걇燎꽨궈謄뻖셸邏뛶븴淚뫤룲\n- **欖쥔뱒먼싅**庸뛳覓뻖꿣坍酩柳됀북 ECCNoise 꼞房쉰눏 IBC 蔑쉯찋丹괜뻕\n</details>\n\n## 뻖쑆n\nOpenNHP 賚깨邏뛶븴뻖쒽뺘拏庸꺿진擥덗잸낿眄擔覓뻔럌寮庸뙾n\n- 丹뮍걍茗걇母놴庸뛳찋궋母놴냁咐뮎뚟邏뛳쟑燎꽨궈謄뻖뚟房付쇺n- 丹뮍걍茗걇燎꽨궈謄뻞쨐眠얹꿘淡뢙궋꼣疸쀥랤궈謄/擥덚댣\n- 燎꽨궈謄뻔걇燎꽨궈謄뻞쨐淡뢙궋냁茗燎꽨궈達付얺뚟뛳찌\n- 母놴걇母놴庸뛳찋궋茗뙎좬걇茗뙎좮뚟謗륁꿘\n\n> 燎괜放뷚즩뻖쒿싮僚뀚쨃放끡俯 [OpenNHP 雷遼뮿(https://opennhp.org/deploy/)\n\n## SPA 得 NHP 眄鏤덛쭊\n꼣깬房벋싀庸SPA庸괜꼞房쉳뭚깬냚喇 [蚌坍윈숰達괟쭻免껊짿SDP庸괟븫깪](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2) 疸쇒쨃覓 [啖놴술뻗덚庸CSA庸겧(https://cloudsecurityalliance.org/) 끰辣NHP 뛷쯶꿣坍먼싅遼瞭윈눏瞭윉룫喇뻔술뻕낊咐먽낊골欄됁得껀낊골欄됁雷좰록謗發꺿줁賚좯찉庸껃찇疸좬랻 [AHAC 滅덚뽔房쥕둖](https://www.mdpi.com/2076-3417/14/13/5593) 疸쇈쭝걇啖溥껃싀\n\n| - | SPA | NHP | NHP 憺떤 |\n|:---|:---|:---|:---|\n| **瞭윉룫** | SPA 燎꽨궈謄뻓쟔眄 SPA 賴썭꼹깬倣亂得껂댣걍/房쮠밶舫坍쫼뿗放某坍윇잹母놶즾房付쉱꿚걌某坍윉땶뷘낻眄 | NHP-Server庸걵돓꼹깬倣亂得껂댣걍/房쮠밶舫坍쫼뿗放某坍윒쨀得 NHP-AC庸걷付쉱꿚걌某坍윒쨀僚倣뷚뚟NHP-Server 낊坍봴뻖쒼랻긻茗眄疸燎쥓잵庸껀좄賚깨陋언좁골欄돾 | <ul><li>쬂쨐滂留넍욷邏眄某坍 NHP-Server 坍뀐끵淡뢙궋燎꽨궈謄뻔갡暝</li><li>낊골欄됁庸뙱HP-Server 낊坍봯진갡辣欖갰副毛벉뺘欖뻖쒺</li><li>丹괜뻕庸뛴끵淡뢙궋燎꽨궈謄뻖뚟 IP 喇썬喇뻗줢坍쫼뿗放갫達곐亂좬숵걍茗僚疸꽨낊倣眄</li></ul> |\n| **뛳찌** | 꼣냄 | 끫냄 | 料언봏眄낊咐먽庸껃付쉱꿚걌궜뛶린 |\n| **먼싅遼瞭** | 쐓줢亂蜂 | PKI 갰 IBC庸Noise 遼瞭 | <ul><li>丹괜뻕庸뛶즲謗溥껃싀眄丹괜뻔싅蜂봯줛꼭燎쥔걌庸껀蚌疸쇌딦啖쥕댵珞</li><li>擔뀑갫燎섪쨐낻副윇찌坍淚뫤룲眄父떥뎯亂蜂봰갡끰</li><li>쬂쨐父떥쫸먼싅/倣亂</li></ul> |\n| **剖넏딆母놶즾癩쥖房쮡뒇眄쫸궅** | 坍燎꽨궈謄뻖삞끾 | 癩냀IP 得껂삞끾 | 料언쨬邏庸껄눋亂좬낷椧꽩댵庸건북硫榴륀걀覓뻒DNS 궒깨得 DDoS 賚庸 |\n| **낊골欄됁** | 了멆쨃坍覓뻓줉 SDP | 뛶댣 | 賚깨坍擔됄魃燎꽨궈廖깼眄喇쥕똞 |\n| **啖뉝늸擔럱** | 疸꽩댪깨 | 낊丹뛴걌 | NHP 낊坍봱먾쨓副갫꿣燎괜꼞房쉺짿洛 DNSFIDO 螟괦쨀 |\n\n## 榜뫦꺑\n\n갬坍섡샥謗뀐싳 OpenNHP 眄榜뫦꺑庸燎괜洛擔됀끡疸뀒뚟料언뱈淡뫥庸껃싱끡俯갬坍섢뚟[榜뫦꺑깮꼥](CONTRIBUTING.md)\n\n## 房전낊꼞房쇺n\nOpenNHP 왠쭭 [Apache 2.0 房전낊꼞房쇻(LICENSE)\n\n## 덚앁雷좬쨆\n\n- 孚좮띭母놶삋庸뙽https://github.com/OpenNHP/opennhp](https://github.com/OpenNHP/opennhp)\n- 覓왠셿쉯짔庸뙽opennhp@gmail.com](mailto:opennhp@gmail.com)\n- Slack 孵놸庸뙽먼봱갬坍섢뚟 Slack](https://slack.opennhp.org)\n\n燎괜料얻싡某眄雷遼庸껃싱房付쉱갬坍섢뚟[丹떥뒃母놶삋](https://opennhp.org)\n\n## 끡雷꺑\n\n- [蚌坍윈숰達괟쭻免껊짿SDP庸괟븫깪 v2.0](https://cloudsecurityalliance.org/artifacts/software-defined-perimeter-zero-trust-specification-v2)Jason GarbisJuanita KoilpillaiJunaid lslamBob FloresDaniel BaileyBenfeng ChenEitan BremlerMichael RozaAhmed Refaey Hussein[*啖놴술뻗덚庸CSA庸*](https://cloudsecurityalliance.org/)2022 嵐 3 燎걲\n- [AHAC庸뛸삊暮母놶즾剖넏딆房付쉱꿚걌遼瞭욓(https://www.mdpi.com/2076-3417/14/13/5593)Mudi XuBenfeng ChenZhizhong TanShan ChenLei WangYan LiuTai Io SanSou Wang FongWenyong Wang 得 Jing Feng*擥덚댣椧놴솑療纜*2024 嵐 6 燎걲\n- Noise 꼞房쉱몑瞭윆https://noiseprotocol.org/\n- 硫榴륂숴낹遼瞭윌몿眠쉮https://phoenix.security/web-vuln-management/\n\n---\n\n游 方뮍뻔싳 OpenNHP 眄柳뻞째갬坍섡籃뻖뚟榜뫦꺑得껀끬扶걲\n\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.7607421875,
          "content": "# Security Policy\n\n## Reporting Security Issues\n\nThe OpenNHP team and community take security bugs in OpenNHP seriously. We appreciate your efforts to responsibly disclose your findings, and will make every effort to acknowledge your contributions.\n\nTo report a security issue, please use the GitHub Security Advisory [\"Report a Vulnerability\"](https://github.com/opennhp/opennhp/security/advisories/new) tab.\n\nThe OpenNHP team will send a response indicating the next steps in handling your report. After the initial reply to your report, the security team will keep you informed of the progress towards a fix and full announcement, and may ask for additional information or guidance.\n\nReport security bugs in third-party modules to the person or team maintaining the module. \n\n"
        },
        {
          "name": "ac",
          "type": "tree",
          "content": null
        },
        {
          "name": "agent",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.bat",
          "type": "blob",
          "size": 2.5556640625,
          "content": "@echo off\r\n\r\ncd %~dp0\r\n\r\nFOR /F %%i in ('powershell -c \"get-date -format yyMMddHHmmss\"') do SET BUILD_NO=%%i\r\nFOR /F \"tokens=*\" %%a in (version\\VERSION) do SET VERSION=%%a.%BUILD_NO%\r\necho OpenNHP version: %VERSION%\r\nFOR /F \"tokens=* usebackq\" %%a in (`\"git show -s \"--format^=%%H\"\"`) do SET COMMIT_ID=%%a\r\necho commit id: %COMMIT_ID%\r\nFOR /F \"tokens=* usebackq\" %%a in (`\"git show -s \"--format^=%%cd\" \"--date^=format:%%Y-%%m-%%d %%H:%%M:%%S\"\"`) do SET COMMIT_TIME=%%a\r\necho commit time: %COMMIT_TIME%\r\nFOR /F \"tokens=1 usebackq\" %%a in (`echo %date%`) do SET CURR_DATE=%%a\r\nFOR /F \"tokens=1 delims=. usebackq\" %%a in (`echo %time%`) do SET CURR_TIME=%%a\r\nSET BUILD_TIME=%CURR_DATE% %CURR_TIME%\r\necho build time: %BUILD_TIME%\r\n\r\nset LD_FLAGS=\"-X 'github.com/OpenNHP/opennhp/version.Version=%VERSION%' -X 'github.com/OpenNHP/opennhp/version.CommitId=%COMMIT_ID%' -X 'github.com/OpenNHP/opennhp/version.CommitTime=%COMMIT_TIME%' -X 'github.com/OpenNHP/opennhp/version.BuildTime=%BUILD_TIME%'\"\r\n\r\ngo mod tidy\r\nset CGO_ENABLED=1\r\n\r\n:agentd\r\ngo build -trimpath -ldflags %LD_FLAGS% -v -o release\\nhp-agent\\nhp-agentd.exe agent\\main\\main.go\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\ncopy /y agent\\main\\etc\\*.* release\\nhp-agent\\etc\r\n\r\n:acd\r\ngo build -trimpath -ldflags %LD_FLAGS% -v -o release\\nhp-ac\\nhp-acd.exe ac\\main\\main.go\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\ncopy /y ac\\main\\etc\\*.* release\\nhp-ac\\etc\r\n\r\n:serverd\r\ngo build -trimpath -ldflags %LD_FLAGS% -v -o release\\nhp-server\\nhp-serverd.exe server\\main\\main.go\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\ncopy /y server\\main\\etc\\*.* release\\nhp-server\\etc\r\n\r\n:agentsdk\r\ngo build -trimpath -buildmode=c-shared -ldflags %LD_FLAGS% -v -o release\\nhp-agent\\nhp-agent.dll agent\\main\\main.go agent\\main\\export.go\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\ngcc agent\\sdkdemo\\nhp-agent-demo.c -I release\\nhp-agent -l:nhp-agent.dll -Lrelease\\nhp-agent -Wl,-rpath=. -o release\\nhp-agent\\nhp-agent-demo.exe\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\n\r\n:devicesdk\r\ngo build -trimpath -buildmode=c-shared -ldflags %LD_FLAGS% -v -o release\\nhp-device\\nhpdevice.dll core\\main\\main.go core\\main\\nhpdevice.go\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\nREM gcc nhp\\sdkdemo\\nhp-device-demo.c -I nhp\\main -I release\\nhp-device -l:nhpdevice.dll -Lrelease\\nhp-device -Wl,-rpath=. -o release\\nhp-device\\nhp-device-demo.exe\r\nIF %ERRORLEVEL% NEQ 0 exit /b 1\r\ncd release\\nhp-device\r\ncall \"C:\\Program Files (x86)\\Microsoft Visual Studio\\2019\\Community\\VC\\Auxiliary\\Build\\vcvarsall.bat\" x64\r\nlib /def:./nhpdevice.def /name:nhpdevice.dll /out:./nhpdevice.lib /MACHINE:X64\r\ncd ..\\..\r\n\r\necho [Done] OpenNHP v%VERSION% for platform %OS% built!"
        },
        {
          "name": "common",
          "type": "tree",
          "content": null
        },
        {
          "name": "core",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.41015625,
          "content": "module github.com/OpenNHP/opennhp\n\ngo 1.20\n\nrequire (\n\tgithub.com/coocood/freecache v1.2.4\n\tgithub.com/emmansun/gmsm v0.24.1\n\tgithub.com/fsnotify/fsnotify v1.7.0\n\tgithub.com/gin-gonic/gin v1.9.1\n\tgithub.com/json-iterator/go v1.1.12\n\tgithub.com/pelletier/go-toml/v2 v2.1.1\n\tgithub.com/spf13/viper v1.18.2\n\tgithub.com/urfave/cli/v2 v2.27.0\n\tgolang.org/x/crypto v0.31.0\n\tgorm.io/driver/mysql v1.5.2\n\tgorm.io/gorm v1.25.5\n)\n"
        },
        {
          "name": "kgc",
          "type": "tree",
          "content": null
        },
        {
          "name": "log",
          "type": "tree",
          "content": null
        },
        {
          "name": "plugins",
          "type": "tree",
          "content": null
        },
        {
          "name": "relay",
          "type": "tree",
          "content": null
        },
        {
          "name": "release",
          "type": "tree",
          "content": null
        },
        {
          "name": "server",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "utils",
          "type": "tree",
          "content": null
        },
        {
          "name": "version",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}