{
  "metadata": {
    "timestamp": 1736709543145,
    "page": 60,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "rfordatascience/tidytuesday",
      "stars": 7034,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.6474609375,
          "content": "# History files\n.Rhistory\n.Rapp.history\n# R project\n.Rproj\n# Session Data files\n.RData\n# Example code in package build process\n*-Ex.R\n# Output files from R CMD build\n/*.tar.gz\n# Output files from R CMD check\n/*.Rcheck/\n# RStudio files\n.Rproj.user/\n# produced vignettes\nvignettes/*.html\nvignettes/*.pdf\n# OAuth2 token, see https://github.com/hadley/httr/releases/tag/v0.3\n.httr-oauth\n# Other secret things\n.Renviron\n# knitr and R markdown default cache directories\n/*_cache/\n/cache/\n# Temporary files created by R markdown\n*.utf8.md\n*.knit.md\n.Rproj.user\ntidytuesday_github.Rproj\n# Other leftovers\n.DS_Store\nworking.R\nsample_viz.R\nweather_working.R\nttues-script.R\n"
        },
        {
          "name": ".here",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "DESCRIPTION",
          "type": "blob",
          "size": 0.6826171875,
          "content": "Type: Book\nPackage: tidytuesday\nTitle: TidyTuesday\nVersion: 0.0.1\nAuthors@R: c(\n    person(\"Jon\", \"Harmon\", , \"jonthegeek@gmail.com\", role = c(\"aut\", \"cre\"),\n           comment = c(ORCID = \"0000-0003-4781-4346\")),\n    person(\"Data Science Learning Community\", , , \"jon@dslc.io\", role = c(\"ctb\", \"cph\"))\n  )\nDescription: This is only here for GHA dependencies.\nURL: https://github.com/rfordatascience/tidytuesday\nBugReports: https://github.com/rfordatascience/tidytuesday/issues\nDepends:\n    R (>= 4.1.0)\nImports: \n    dplyr,\n    fs,\n    glue,\n    here,\n    knitr,\n    lubridate,\n    purrr,\n    readr,\n    rlang,\n    stringr,\n    tibble,\n    usethis,\n    vctrs,\n    whisker,\n    yaml\nEncoding: UTF-8\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.8828125,
          "content": "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.5966796875,
          "content": "![Logo for the TidyTuesday project, represented by the word TidyTuesday over a messy splash of black paint](static/tt_logo.png)\n\n## About TidyTuesday\n\n- `TidyTuesday` is a weekly social data project. All are welcome to participate! Please remember to share the code used to generate your results!\n- `TidyTuesday` is organized by the [Data Science Learning Community](https://dslc.io). [Join our Slack](https://dslc.io/join) for free online help with R, Python, and other data-related topics, or to participate in a data-related book club!\n\n## Goals\n\nOur over-arching goal for TidyTuesday is to provide real-world datasets so that people can learn to work with data.\n\n- [x] For 2024, our goal was to be used in at least 10 courses. Our survey indicates that we are used in at least 30 courses!\n- [ ] For 2025, our goal is to crowdsource the curation of TidyTuesday datasets.\n\n***\n\n## How to Participate\n\n- Data is [posted to social media](dataset_announcements.md) every Monday morning. Follow the instructions in the new post for how to download the data.\n- [Explore the data](https://r4ds.hadley.nz/), watching out for interesting relationships. We would like to emphasize that you should not draw conclusions about **causation** in the data. There are various moderating variables that affect all data, many of which might not have been captured in these datasets. As such, our suggestion is to use the data provided to practice your data tidying and plotting techniques, and to consider for yourself what nuances might underlie these relationships.\n- Create a visualization, a model, a [shiny app](https://shiny.posit.co/), or some other piece of data-science-related output, using R or another programming language.\n- [Share your output and the code used to generate it](sharing.md) on social media with the #TidyTuesday hashtag.\n\n**You can also [curate a dataset for a future TidyTuesday](.github/pr_instructions.md)!**\n\n***\n\n## DataSets\n\n### [2018](data/2018) | [2019](data/2019) | [2020](data/2020)  | [2021](data/2021) | [2022](data/2022) | [2023](data/2023) | [2024](data/2024) | [2025](data/2025)\n\n| Week | Date | Data | Source | Article\n| :---: | :---: | :--- | :--- | :---|\n| 1 | `2025-01-07` | Bring your own data to start the year! | | |\n| 2 | `2025-01-14` | [posit::conf talks](data/2025/2025-01-14/readme.md) | [posit::conf attendee portal 2023](https://reg.conf.posit.co/flow/posit/positconf23/attendee-portal/page/sessioncatalog), [posit::conf attendee portal 2024](https://reg.conf.posit.co/flow/posit/positconf24/attendee-portal/page/sessioncatalog) | [posit::conf(2025) in-person registration is now open!](https://posit.co/blog/positconf2025-in-person-registration-is-now-open/) | \n| 3 | `2025-01-21` | [The History of Himalayan Mountaineering Expeditions](data/2025/2025-01-21/readme.md) | [The Himalayan Database](https://www.himalayandatabase.com/downloads.html) | [The Expedition Archives of Elizabeth Hawley](https://www.himalayandatabase.com/index.html) | \n\n***  \n\n## Citing TidyTuesday\n\nTo cite the `TidyTuesday` repo/project in publications use:\n\n  Data Science Learning Community (2024). Tidy Tuesday: A weekly social data project.\n  https://tidytues.day\n\nA BibTeX entry for LaTeX users is\n\n```\n  @misc{tidytuesday, \n    title = {Tidy Tuesday: A weekly social data project}, \n    author = {Data Science Learning Community}, \n    url = {https://tidytues.day}, \n    year = {2024} \n  }\n```\n\nNote: If you would like to cite the [tidytuesdayR](https://dslc-io.github.io/tidytuesdayR/) package, you should use `citation(\"tidytuesdayR\")` instead.\n\n***\n\n## Contributing\n\nPlease see our [contributing guide](.github/CONTRIBUTING.md) for ways that you can help!\n"
        },
        {
          "name": "alt_text.md",
          "type": "blob",
          "size": 1.9736328125,
          "content": "## Alternative Text\n\nPlease add alt text (alternative text) to all of your posted graphics for `#TidyTuesday`. \n\nThe DataViz Society/Nightingale has an [article](https://medium.com/nightingale/writing-alt-text-for-data-visualization-2a218ef43f81) on writing _good_ alt text for plots/graphs.\n> Here's a simple formula for writing alt text for data visualization:\n> ### Chart type\n> It's helpful for people with partial sight to know what chart type it is and gives context for understanding the rest of the visual.\n> Example: Line graph\n> ### Type of data\n> What data is included in the chart? The x and y axis labels may help you figure this out.\n> Example: number of bananas sold per day in the last year\n> ### Reason for including the chart\n> Think about why you're including this visual. What does it show that's meaningful. There should be a point to every visual and you should tell people what to look for.\n> Example: the winter months have more banana sales\n> ### Link to data or source\n> Don't include this in your alt text, but it should be included somewhere in the surrounding text. People should be able to click on a link to view the source data or dig further into the visual. This provides transparency about your source and lets people explore the data.\n> Example: Data from the USDA\n\nPenn State has an [article](https://accessibility.psu.edu/images/charts/) on writing alt text descriptions for charts and tables.\n\n> Charts, graphs and maps use visuals to convey complex images to users. But since they are images, these media provide serious accessibility issues to colorblind users and users of screen readers. See the [examples on this page](https://accessibility.psu.edu/images/charts/) for details on how to make charts more accessible.\n\nThe `{rtoot}` package includes the ability to post to the Mastodon social network with alt text programmatically.\n\nNeed a **reminder**? Many social networks have settings to require alt text in your posts. \nWe recommend turning them on when they are available!"
        },
        {
          "name": "data.txt",
          "type": "blob",
          "size": 0.0908203125,
          "content": "- path: tidytuesday_tweets\n  name: tidytuesday_tweets\n  rows: 23576\n  cols: 92\n  type: table\n"
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "dataset_announcements.md",
          "type": "blob",
          "size": 0.7138671875,
          "content": "## Weekly Dataset Announcements \n\n`TidyTuesday` is a *social* data project, which means we rely on social media.\nWe do our best to foster a safe, diverse, welcoming community where possible!\n\nWe post datasets to social media every Monday morning.\nData is currently posted at these locations:\n\n- [Bluesky](https://bsky.app/profile/jonthegeek.com)\n- [Mastodon](https://fosstodon.org/@jonthegeek)\n- [LinkedIn](https://www.linkedin.com/in/lgibson7/)\n- [GitHub](https://tidytues.day)\n\nWatch the #TidyTuesday, #DataViz, #RStats, and #PyData hashtags on your favorite social media platform!\nAs additional APIs become available, we will likely add additional networks, provided those networks support a safe, diverse, welcoming community.\n"
        },
        {
          "name": "links.md",
          "type": "blob",
          "size": 2.4033203125,
          "content": "# Useful links\n\nHere we have gathered links relevant to `TidyTuesday`.\n\n## Getting Started\n\n| Link | Description |\n| --- | --- |\n| [Link](https://dslc.io) | The Data Science Learning Community Website|\n| [Link](https://r4ds.hadley.nz/) | The R for Data Science textbook |\n| [Link](https://carbon.now.sh/) | Carbon for sharing beautiful code pics |\n| [Link](https://github.com/MilesMcBain/gistfo) | Post gist to Carbon from RStudio |\n| [Link](https://github.com/yonicd/carbonate) | Post to Carbon from RStudio |\n| [Link](https://github.com/join) | Join GitHub! |\n| [Link](https://guides.github.com/activities/hello-world/) | Basics of GitHub |\n| [Link](https://happygitwithr.com/) | Learn how to use GitHub with R |\n| [Link](http://ggplot2.tidyverse.org/reference/ggsave.html) | Save high-rez `ggplot2` images |\n\n# Data Sources\n\n| Link | Description |\n| --- | --- |\n| [Link](https://docs.google.com/spreadsheets/d/1wZhPLMCHKJvwOkP4juclhjFgqIY8fQFMemwKL2c64vk/edit#gid=0) | Data is Plural collection |\n| [Link](https://github.com/BuzzFeedNews/everything/blob/master/README.md) | BuzzFeedNews GitHub |\n| [Link](https://github.com/theeconomist/) | The Economist GitHub |\n| [Link](https://CRAN.R-project.org/package=fivethirtyeight) | The `fivethirtyeight` data package \n| [Link](https://github.com/TheUpshot) | The Upshot by NY Times |\n| [Link](https://github.com/baltimore-sun-data) | The Baltimore Sun Data Desk |\n| [Link](https://github.com/datadesk) | The LA Times Data Desk |\n| [Link](https://github.com/OpenNewsLabs/news-graphics-team) | Open News Labs |\n| [Link](https://t.co/BMvJO2dT1o) | BBC Data Journalism team |\n\n***\n\n# Data Viz & Data Science Books\n\nOnly books available freely online are sourced here. Feel free to add to the list\n\n| Link | Description |\n| --- | --- |\n| [Link](https://serialmentor.com/dataviz/) | Fundamentals of Data Viz by Claus Wilke |\n| [Link](https://bookdown.org/rdpeng/artofdatascience/) | The Art of Data Science by Roger D. Peng & Elizabeth Matsui |\n| [Link](https://www.tidytextmining.com/) | Tidy Text Mining by Julia Silge & David Robinson |\n| [Link](https://geocompr.robinlovelace.net/) | Geocomputation with R by Robin Lovelace, Jakub Nowosad, Jannes Muenchow |\n| [Link](https://socviz.co/index.html#preface) | Data Visualization by Kieran Healy |\n| [Link](http://www.cookbook-r.com/Graphs/) | `ggplot2` cookbook by Winston Chang |\n| [Link](https://www.bigbookofr.com/index.html) | The Big BOok of R by Oscar Baruffa |\n"
        },
        {
          "name": "sharing.md",
          "type": "blob",
          "size": 1.6884765625,
          "content": "## Sharing Your Output\n\nWe welcome all newcomers, enthusiasts, and experts to participate, but be mindful of these things:\n\n1. The data set comes from the source article or the source that the article credits. Be mindful that the data is what it is! You are welcome to explore beyond the provided dataset, but the data is provided as a \"toy\" dataset to practice techniques on.  \n2. This is NOT about criticizing the original article or graph. Real people made the graphs, collected or acquired the data! Focus on the provided dataset, learning, and improving your techniques in R.  \n3. This is NOT about criticizing or tearing down your fellow `#RStats` practitioners or their code! Be supportive and kind to each other! Like others' posts and help promote the `#RStats` community!  \n4. Use the hashtags #TidyTuesday and #RStats on social media.\n5. Include a picture of the visualization when you post to social media.  \n6. Include alt text for any visualizations shared, so that everyone can participate! We have [an article with tips and tricks to help you with this aspect of data communication](alt_text.md). This is important for any images you share on social media, and is part of learning to be an effective data science communicator!\n7. Include a copy of the code used to create your visualization when you post to social media.\n8. Focus on improving your craft, even if you end up with something simple!  \n9. Give credit to the original data source whenever possible.\n\nThe [bskyr package](https://christophertkenny.com/bskyr/) is helpful for posting to [Bluesky](https://bsky.app/), and the [rtoot package](https://schochastics.github.io/rtoot/) is helpful for posting to [Mastodon](https://fosstodon.org/tags/rstats).\n"
        },
        {
          "name": "static",
          "type": "tree",
          "content": null
        },
        {
          "name": "tidytuesday.Rproj",
          "type": "blob",
          "size": 0.2470703125,
          "content": "Version: 1.0\nProjectId: f5548854-3ef4-47be-926a-2fb13b67989e\n\nRestoreWorkspace: Default\nSaveWorkspace: Default\nAlwaysSaveHistory: Default\n\nEnableCodeIndexing: Yes\nUseSpacesForTab: Yes\nNumSpacesForTab: 2\nEncoding: UTF-8\n\nRnwWeave: Sweave\nLaTeX: pdfLaTeX\n"
        }
      ]
    }
  ]
}