{
  "metadata": {
    "timestamp": 1736709571752,
    "page": 113,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "daattali/beautiful-jekyll",
      "stars": 5452,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.685546875,
          "content": "# Define standard eol format\n\n# Web Files\n*.html text eol=lf\n*.md text eol=lf\n*.css text eol=lf\n*.js text eol=lf\n\n# Jekyll related files\n*.yml text eol=lf\n\n# Git related files\n.gittattributes text eol=lf\n.gitignore text eol=lf\n.gitkeep text eol=lf\n\n# Ruby files\n*.rb text eol=lf\nGemfile text eol=lf\nGemfile.lock text eol=lf\n\n# Github specific fies\nLICENCE text eol=lf\n\n# Docker specific files\nDockerfile text eol=lf\n\n# VSCode files\n*.json text eol=lf\n\n# General multimedia files\n*.jpg binary\n*.jpeg binary\n*.gif binary\n*.png binary\n*.t3x binary\n*.t3d binary\n*.exe binary\n*.data binary\n*.ttf binary\n*.eof binary\n*.eot binary\n*.swf binary\n*.mov binary\n*.mp4 binary\n*.mp3 binary\n*.ogg binary\n*.flv binary\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.12109375,
          "content": "# project\n_site\n.sass-cache\n.vagrant\n\n# general\n.DS_Store\nThumbs.db\nehthumbs.db\n\nGemfile.lock\n\nbeautiful-jekyll-theme-*.gem\n"
        },
        {
          "name": "404.html",
          "type": "blob",
          "size": 0.2724609375,
          "content": "---\nlayout: default\ntitle: 404 - Page not found\npermalink: /404.html\n---\n\n<div class=\"text-center\">\n  <h1>Whoops, this page doesn't exist.</h1>\n  <h1>Move along. (404 error)</h1>\n  <br/>\n\n  <img src=\"{{ 'assets/img/404-southpark.jpg' | relative_url }}\" alt=\"Not found\" />\n</div>\n"
        },
        {
          "name": "Appraisals",
          "type": "blob",
          "size": 0.099609375,
          "content": "appraise \"jekyll-3\" do\n  gem \"jekyll\", \"3.9.4\"\nend\nappraise \"jekyll-4\" do\n  gem \"jekyll\", \"4.3.3\"\nend\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 14.4970703125,
          "content": "## Unreleased version\n- BREAKING CHANGE: Allow changing the order of the social network links that appear in the footer (#1152)\n- BREAKING CHANGE: `google-scholar` social network link no longer requires the prefix `citations?user=`; if you previously set this parameter, it needs to be updated (#1189)\n- Added `mathjax` YAML parameter to allow support for MathJax, used to write LaTeX expressions (#195)\n- Added explicit support for favicons, you only need to add a `favicon.ico` file to the root directory\n- The footer of a page always sticks to the bottom, even on short pages (#576)\n- Added `author` YAML parameter to allow specifying the author(s) of a post (#1220)\n- Fixed bug where search results broke if a post title had a backslash (#1279)\n- Fixed bug where hovering over search results showed the text \"{desc}\" (#1156)\n- Added social network links for GitLab, Bluesky, Whatsapp, Untappd (#1168, #1218, #1299, #1307)\n- Support reddit social network link to either be a subreddit or a user (#1371)\n- Use CSS variables (#661)\n- Added instructions and example on how to fix image links in project sites (#1171)\n- Pagination buttons: use nicer arrows, and don't show text on small screens (#1221)\n- Updated Yelp URL format - if you previously used the `yelp` social network config parameter, you might need to update the config value (#1259)\n- Added `title-on-all-pages` config setting, that adds the website title to all page titles (#1272)\n- Change Twitter icon to X (#1193)\n- Upgraded font-awesome to 6.5.2 (#1330)\n\n## v6.0.1 (2023-06-08)\n\nThis version has been in the works for a few years. It includes several new features that were highly requested, numerous bug fixes, new documentation, and aggresively encourages migrating from the old Google Universal Analytics to the new Analytics 4.\n\n#### Breaking changes\n\n- As of July 2023, Google Universal Analytics is going away and being replaced by Google Analytics 4. Beautiful Jekyll sites that still use the old analytics tag will show a warning to encourage them to move to Analytics 4 (#1096).\n- More control over RSS feed sharing: previously, an RSS feed was *always* generated, and if the config setting `rss-description` was set then there was an RSS icon in the footer. Now, an RSS feed is only generated when the config setting `rss-description` exists, and an RSS footer icon is only shown if `rss: true` is set in the `social-network-links` config settings.\n\n#### New parameters and settings\n\n- Added `navbar-var-length` config setting that allows the navigation menu to be the same length as the longest sub-menu, so that long words in the submenu are not cut off (#765) \n- Added `post_search` config setting that creates a Search button in the navbar (#770)\n- Added `edit_page_button` config setting that adds a \"Edit page\" button to the footer (to edit the current page on GitHub) (#1004)\n- Added `footer-hover-col` config setting to customize the hover colour of links in the footer (#848)\n\n#### New features and improvements\n\n- Made the home page feed more accessible for screen readers (#950)\n- Added support for giscus comments (#886) and CommentBox (#960)\n- Added support for Cloudflare Analytics (#797)\n- Added Reddit in share options of posts (#815)\n\n#### Bug fixes\n\n- Fixed page titles, subtitles, and excerpts rendering correctly when there are special characeters in them (#856) \n- Fixed bug where navbar secondary level dropdown items didn't inherit the same colour as the primary navbar links\n- Fixed bug where the navbar \"burger\" collapsed button didn't always revert back to a light colour\n- Fixed bug where using an image as a navbar title did not render in GitHub Project pages that did not have a custom domain\n- Fixed bug where image thumbnails on the feed page were always forced into a square rather than maintaining a proper image aspect ratio\n- Fixed bug where special characters in the title led to broken share tags (#744)\n- Fixed bug where staticman didn't work jQuery slim version is used (#766)\n- Fixed very long strings to wrap around the next line rather than go off-screen (#787)\n\n#### Small changes\n\n- Updated staticman from using v2 (public servers) to v3 (private servers) due to the public servers becoming obsolete (#775)\n- Added social network links for Patreon, Medium, Itch.io, Discord, Kaggle, Hackerrank (#783, #788, #907, #961, #978)\n- Slightly reworked margins and position for avatar image to resolve an alignment issue on Safari\n- Changed the width at which the navbar collapses to a higher threshold because most modern non-mobile browsers are >1000px\n\n\n## v5.0.0 (2020-09-15)\n\nOne of the major changes in this version is that a lot of time was spent on rethinking the entire SEO and social media sharing model (how a page looks on eg. Google, Twitter, Facebok). It was redesigned to be more simple and customizable. The new documentation has a section dedicated to SEO and social media sharing of a page. Unfortunately some changes that are not backwards-compatible had to be made.\n\n#### Breaking changes\n\n- Renamed `description` YAML parameter to `share-description` to be more clear\n- Renamed `description` config setting to `rss-description` since it was only used in RSS (the FAQ explains the difference between YAML parameters and config settings if you're confused)\n- Removed YAML parameter `use-site-title` (you can now specify the exact title using `share-title`)\n- Removed undocumented YAML parameters `meta-title` and `meta-description`\n- Removed `link-tags` config setting because it wasn't necessary. If you use tags, there will now always be a tags page created; if you don't use tags there won't be a tags page.\n- The YAML parameter `show-avatar` is now true by default. This has always been the case for GitHub Pages users, but not for `remote_theme` users. For consistency, it's now the default for everyone. (#715)\n\n#### New parameters and settings\n\n- Added `full-width` YAML parameter to allow having full-width pages\n- Added `feed_show_excerpt` config setting to show/hide the post excerpts on the feed page\n- Added `feed_show_tags` config setting to show/hide the list of tags on post previews on the feed page\n- Added `share-title` YAML parameter to give control over the search engine/social media title\n- Added `last-updated` YAML parameter to show a \"Last Updated on\" date for blog posts\n- Added `before-content` and `after-content` YAML parameters that allow you to add some common HTML before the main content of a page (below the title) or after the main content (above the footer). Works in a similar way to `footer-extra`.\n- Added `head-extra` YAML parameter which is similar to `footer-extra` but is used to include custom HTML code in a page's `<head>` tag\n- Added `site-js` config setting to provide JavaScript files that are used on all pages in the site\n\n#### New features and improvements\n\n- Improved the `footer-extra` YAML parameter to support multiple files instead of only a single file\n- Added automatic navbar color detection (#702)\n- When `nav-short` is turned on, the avatar will also be shorter\n- Changed navbar and footer background colour to be slightly darker, for better contrast with the default white page background for accessibility reasons\n- Changed the behaviour of `site-css` to include site-wide CSS file **before** instead of after page-specific files\n- Renamed internal css/js files from \"main\" to \"beautifuljekyll\" to make it easier for users to troubleshoot\n- Added alt text to all images for better accessibility\n- Made thumbnail images square instead of circles, as users reported that circles cut off important parts of images\n\n#### Bug fixes\n\n- Fixed rendering issues with `nav-short` parameter that caused the body of the page to start too low\n- Fixed some CSS styles that broke during the bootstrap 4 migration (#716)\n\n#### Library upgrades\n\n- Upgraded kramdown to version 2.3.0 to fix security issues\n- Upgraded jQuery to version 3.5.1 to fix a couple security vulnerabilities with the previous version\n\n## v4.1.0 (2020-08-08)\n\n- Added Open Graph `site_name` meta field to pages automatically\n- Added `text-col` config setting  for main text color (#694)\n- Added `keywords` config setting to set the meta keywords on all pages (for SEO purposes) (#691)\n- Added `mobile-theme-col` config setting to allow a mobile theme colour (#692)\n- Added `site-css` config setting in the config file to provide CSS files that are used on all pages in the site (#695)\n- Added YAML parameter `description`: creates the meta description on a page, intended to provide a brief description of the page for search engines and when the page is shared (#690)\n\n## v4.0.1 (2020-07-13)\n\n- Fixed staticman comments UI that was broken since the migration to bootstrap 4\n\n## v4.0.0 (2020-07-12)\n\n- **BREAKING CHANGE** Replace `image` YAML parameter with `thumbnail-img` to be more clear\n- **MAJOR BEHAVIOUR CHANGE** Don't use the thumbnail as the avatar image\n- Cover image will automatically be used as thumbnail if none is provided\n- Image to share on social media will use the cover image or thumbnail if none is provided\n- All images (social media share, thumbnail, cover) can use either relative or absoluate paths.\n- Fixed issue where if a dropdown menu was the last item in the menu bar, it did not have a proper margin on the right\n- Added social network links: Mastodon (#646), Google Scholar, ORCID (#670)\n- Added support for sharing pages on new social network: VK (#657)\n- Use Open Graph type 'article' for blog posts (#669)\n- Use Twitter's large sumary card (large image) when there is a cover image, thumbnail image, or share image specified (#668)\n- Made post images in the feed page smaller on smaller devices\n- Fixed jQuery version in staticman (#671)\n\n## v3.0.0 (2020-05-07)\n\n- **BREAKING CHANGE** Upgraded from Bootstrap 3.3.2 to 4.4.1. This involved a major rewrite of most components. This shouldn't affect any users unless you have custom HTML/CSS code which the new Bootstrap could have broken.\n- **BREAKING CHANGE** Renamed `bigimg` YAML parameter to `cover-img`\n- **BREAKING CHANGE** Removed `googlefonts` YAML parameter since googlefonts are just CSS so they can be loaded via `ext-css`\n- **BREAKING CHANGE** Upgraded from jQuery 1.11.2 to 3.4.2. This should not affect most people\n- Added `navbar-border-col` setting in the config file\n- Added accessibility features where possible\n- Made the theme completely responsive by rewriting all CSS to use 'rem' instead of 'px'\n- Rewrote and simplified some JavaScript code to use CSS or Bootstrap alternatives that weren't available in 2015\n- Removed most of the sample posts so that users only have two sample posts to learn from\n- Improvements to the README instructions\n\n## v2.3.0 (2020-04-29)\n\n- Added YAML parameter `footer-extra` for including custom content in the footer\n- Fixed issue: linking to a specific part of a page resulted in scrolling too far (#69)\n- Added YAML parameter `nav-short` to have navbar permanently collapsed\n- Added social network link: Calendly\n- Fixed bug where RSS link in footer was showing even when turned off\n\n## v2.2.0 (2020-04-27)\n\n- Added social network link: Telegram (#625) (thanks @mashed-potatoes)\n- Moved the demo site to an independent URL: https://beautifuljekyll.com\n- Major documentation overhaul and cleanup of old files\n- Fixed a few bugs from the remote_theme migration\n\n## v2.0.0 (2020-04-26)\n\n- Beautiful-Jekyll v2.0.0 available as an official Ruby gem\n- Beautifull-Jekyll now supports the `remote_theme` config (#339) (thanks @gpotter2 and @skalee)\n- Consolidated the demo site, the ruby gem, and the master branch into one\n- Added a `home` layout and used it in the index page\n- Added readtime support for the post header (#622) (thanks @MutMatt and @rubyreads)\n- Removed the dependency on `_data` folder since it doesn't get copied when using `remote_theme` (#614)\n- Added support for configuring lang attribute on `html` tag (#608) (thanks @skalee)\n- Added ability to disable round logo (thanks @gpotter2)\n- Added support for Utterances comments (#596) (thanks @colynn)\n- Removed 'just-comments' as it's getting killed at the end of the year\n- Upgraded font-awesome to 5.12.1 (#587) (thanks @cketti)\n\n## Prior to 2020\n\n**2018-12-24** Add support for Staticman comments (#440) (thanks @VincentTam)\n\n**2018-10-19** Move Google Analytics to the head (#419) (thanks @jpvicari)\n\n**2018-06-08** Add support for Facebook comments (#350) (thanks @npes87184)\n\n**2018-02-22** Automatically generate sitemap (#323) (thanks @JosemyDuarte)\n\n**2018-01-18** Add clickable tags to each post and a tags index page, works for GitHub sites (#307) (thanks @OCram85)\n\n**2018-01-14** Redo Dockerfile (#302) (thanks @jennydaman)\n\n**2018-01-06** More color personalization options (#297 and #299) (thanks @jennydaman)\n\n**2018-01-05** Abstract the social networks logic (thanks @OCram85)\n\n**2018-01-03** Avatar image no longer causes a ghost click (thanks @alefi87)\n\n**2017-10-16** Add GitHub buttons to posts (#265) (thanks @yonicd)\n\n**2017-09-04** Ability to change colour/image of navbar/footer/body\n\n**2017-08-17** Add support for notification, error, and warning boxes in markdown (#227) (thanks @OCram85)\n\n**2017-08-12** Add social buttons for twitch, yelp, and steam (#234) (thanks @TheRealBenForce)\n\n**2017-03-30** Make the footer contact links friendly for screen readers (thanks @eugenius1)\n\n**2017-03-30** Started a CHANGELOG file (thanks @eugenius1)\n\n**2017-01-28** Add Subresource Integrity (SRI) support (#164) (thanks @tony-ho)\n\n**2017-01-09** Add Google Tag Manager Integration (#157) (thanks @csarigoz)\n\n**2017-01-06** Add options to configure HTML document title (#154) (thanks @tony-ho)\n\n**2016-12-25** Allow dynamic images on each blog post (#143) (thanks @bbritten)\n\n**2016-12-15** Support `title-img` config param to have image in the navbar instead of text\n\n**2016-12-08** Add support for phone numbers in footer; fix #136\n\n**2016-12-06** Update gemfile (#134) (thanks @stephentuso)\n\n**2016-10-09** Add Docker deployment (#114) (thanks @mangar)\n\n**2016-08-06** Add social share buttons for posts (thanks @rtlee9)\n\n**2016-07-29** Add CSS styling to code chunks\n\n**2016-07-27** Add clickable tags that lead to a tag page (doesn't work for GitHub hosted sites) (thanks @epwalsh)\n\n**2016-07-21** Add support for twitter cards (sharing on Twitter will be better); fixes #70\n\n**2016-03-18** Support full-width images in page headers; fixes #37\n\n**2016-03-18** Support menus in navigation bar\n\n**2016-02-07** Avatar is now conditional (thanks @hristoyankov)\n\n**2016-02-02** Migrate (forced to...) to jekyll 3\n\n**2016-01-22** Make sure not to include JQuery twice, fixes #29\n\n**2015-11-19** Support external links in navigation bar; fixes #3\n\n... Many small changes because the site was in its infancy\n\n**2015-03-12** Beautiful Jekyll version 0.0000001 is released!\n\n"
        },
        {
          "name": "Gemfile",
          "type": "blob",
          "size": 0.0693359375,
          "content": "# frozen_string_literal: true\n\nsource \"https://rubygems.org\"\n\ngemspec\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.04296875,
          "content": "MIT License\n\nCopyright (c) 2023 Dean Attali\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 20.2861328125,
          "content": "# Beautiful Jekyll\n\n[![Gem Version](https://badge.fury.io/rb/beautiful-jekyll-theme.svg)](https://badge.fury.io/rb/beautiful-jekyll-theme)\n\n> By [Dean Attali](https://deanattali.com) &middot; [Demo](https://beautifuljekyll.com/)\n\n**Beautiful Jekyll** is a ready-to-use template to help you create a beautiful website quickly. Perfect for personal sites, blogs, or simple project websites.  [Check out a demo](https://beautifuljekyll.com) of what you'll get after just two minutes.  You can also look at [my personal website](https://deanattali.com) or [my consulting website](https://attalitech.com) to see it in use, or see [examples of websites](http://beautifuljekyll.com/examples) other people created using this theme.\n\n**If you enjoy Beautiful Jekyll, please consider [supporting me](https://github.com/sponsors/daattali). You'll also gain access to office hours and more features! ❤**\n\n## Table of contents\n\n- [Features](#features)\n- [Sponsors 🏆](#sponsors)\n- [**Build your website in 3 steps**](#build-your-website-in-3-steps)\n- [Plans](#plans)\n- [Add your own content](#add-your-own-content)\n- [Customizing parameters for each page](#customizing-parameters-for-each-page)\n- [Supported parameters](#supported-parameters)\n- [Featured users (success stories!)](#featured-users-success-stories)\n- [Next steps](#next-steps)\n- [Getting help](#getting-help)\n- [Credits and contributions](#contributions)\n\n# Features\n\n__Check out [*What's New?*](https://beautifuljekyll.com/updates/) to see the latest features!__\n\n- **SIMPLE**: The primary goal of Beautiful Jekyll is to allow literally *anyone* to create a website in a few minutes.\n- **Modern**: Uses the latest best practices and technologies to achieve nearly perfect scores on Google Chrome's Audit.\n- **Mobile-first**: Designed to look great on both large-screen and small-screen (mobile) devices.\n- **Highly customizable**: Many personalization settings such as changing the background colour/image, adding a logo.\n- **Flexible usage**: Use Beautiful Jekyll directly on GitHub or via a Ruby gem - choose the best [development method](#build-your-website-in-3-steps) for you.\n- **Battle-tested**: By using Beautiful Jekyll, you'll be joining 50,000+ users enjoying this theme since 2015.\n- **SEO and social media support**: Customize how your site looks on Google and when shared on social media.\n- **Comments support**: Add comments to any page using either [Disqus](https://disqus.com/), [Facebook comments](https://developers.facebook.com/docs/plugins/comments), [Utterances](https://utteranc.es/), [Staticman](https://staticman.net), [giscus](https://giscus.app), or [CommentBox](https://commentbox.io/).\n- **Tags**: Any blog post can be tagged with keywords, and an index page is automatically generated.\n- **Analytics**: Easily integrate Google Analytics, or other analytics platforms, to track visits to your website.\n- **Search**: Let users easily find any page using a Search button in the navigation bar.\n- **Photos support**: Any page can have a full-width cover photo and thumbnail.\n- **RSS**: An RSS feed is automatically created, so you can even host a podcast easily with Beautiful Jekyll.\n\n<h2 id=\"sponsors\">Sponsors 🏆</h2>\n\nDeveloping and maintaining Beautiful Jekyll takes a lot of time and effort - thank you to anyone who helps fund this effort!\n\n- [DoFollow](https://dofollow.co.uk/)\n- [Varna Sri Raman](https://about.me/varna)\n\n**[Become a sponsor for Beautiful Jekyll and unlock new features\\!](https://github.com/sponsors/daattali/sponsorships?tier_id=39856)**\n\n# Build your website in 3 steps\n\nThere are a few different ways to build a website using Beautiful Jekyll, and this document will go through the simplest one: using a fork on GitHub. For most people (including myself!), this easy method is the recommended one.\n\nEven if you choose to use one of the [advanced installation methods](https://beautifuljekyll.com/getstarted/#install-steps-hard), I still suggest you read through the easy method first.\n\n## The easy way (recommended!)\n\nGetting started is *literally* as easy as 1-2-3 :smile:\n\nScroll down to see the steps involved, but here is a 30-second video just as a reference as you work through the steps. If you don't already have a [GitHub account](https://github.com), you'll need to sign up.\n\n![Installation steps](https://beautifuljekyll.com/assets/img/install-steps.gif)\n\n### 1. Fork this project\n\nClick on the __*Fork*__ button at the top right corner of this page. Forking means that you're copying this entire project and all its files into your account. Do not click on the __*Create fork*__ button on the next page yet.\n\n### 2. Rename the repository to `YOURUSERNAME.github.io`\n\nYou'll see the word \"repository\" used a lot in GitHub - it simply means \"project\". Under __*Repository name*__ you should see the name `beautiful-jekyll`, this is where you need to rename your project to `YOURUSERNAME.github.io` (replace `YOURUSERNAME` with your GitHub user name). It's important to use this exact name so that GitHub will recognize it and automatically create a website for this project.   \n\n> Tip: If you want to use a different URL for your website, check out the [FAQ](https://beautifuljekyll.com/faq/#custom-domain)\n \n### 3. Customize your website settings\n\nEdit the `_config.yml` file to change any settings you want. To edit the file, first click on it to view the file, and on the next page click on the pencil icon to edit it (watch the video tutorial above if you're confused).  The settings in the file are self-explanatory and there are comments inside the file to help you understand what each setting does. Any line that begins with a hashtag (`#`) is a comment, and the other lines are actual settings. After changing the settings, click the green __*Commit changes*__ button to save these edits.\n\n> Note: In the video above, only one setting in the `_config.yml` file is edited, but you should go through the rest of the settings as well.\n\n### 4. Congratulations! You have a website!\n\nIf you named your project correctly and made an edit to the config file, your website should be ready in a minute or two at `https://YOURUSERNAME.github.io`. Every time you make a change to any file, your website will get rebuilt and should be updated in about a minute or so. Your website will be initialized with several sample blog posts and a couple other pages.\n\n## The harder way (for advanced users)\n\nThe instructions above explain how to use Beautiful Jekyll in the easiest way: by forking on GitHub. There are more [advanced installation methods](https://beautifuljekyll.com/getstarted/#install-steps-hard) that include either using GitHub Pages with remote themes, or using Ruby gems. They provide you with more control, but are only intended for advanced users.\n\n> Note: Beautiful Jekyll was primarily designed to be used as a GitHub theme, so you will not get any support if you use this theme via Ruby gems. \n\n# Plans\n\nBeautiful Jekyll is, and always will be, free. But if you want to remove the Beautiful Jekyll ad from your website, use a Dark Mode skin, access office hours, or simply support the development efforts, [check out the different plans](https://beautifuljekyll.com/plans).\n\n# Add your own content\n\nTo add pages to your site, you can either write a markdown file (`.md`) or you can write an HTML file. It's much easier to write markdown than HTML, so that's the recommended approach ([here's a great tutorial](https://markdowntutorial.com/) if you need to learn markdown in 5 minutes).\n\nTo see an example of a markdown file, click on any file that ends in `.md`, for example [`aboutme.md`](./aboutme.md). On that page you can see some nicely formatted text (there's a word in bold, a link, a few bullet points), and if you click on the pencil icon to edit the file, you'll see the markdown code that generated the pretty text. Very easy! \n\nIn contrast, look at [`tags.html`](./tags.html). That's how your write HTML - not as pretty. So stick with markdown if you don't know HTML.\n\nAny markdown or HTML file that you create will be available on your website under `https://<yourusername>.github.io/<pagename>`. For example, if you create a file `about.md` (or `about.html`) then it'll exist at `https://<yourusername>.github.io/about`.\n\nFiles you create inside the [`_posts`](./_posts) directory will be treated as blog entries. You can look at the existing files there to get an idea of how to write blog posts. Note the format of the blog post files - they must follow the naming convention of `YEAR-MONTH-DAY-title.md`. After you successfully add your own post, you can delete the existing files inside [`_posts`](./_posts) to remove the sample posts, as those are just demo posts to help you learn.\n\n# Customizing parameters for each page\n\n**One last important thing**: In order to have your new pages use this template and not just be plain HTML pages, **you must add [YAML front matter](https://jekyllrb.com/docs/front-matter/) to the top of each page**:\n\n\n```\n---\n---\n```\n\nThis is where you'll be able to give each page some extra parameters (such as a title, a subtitle, an image, etc - [below is a list of all parameters](#supported-parameters)). Add any parameters you want between these two dashed lines, for example:\n\n```\n---\ntitle: Contact me\nsubtitle: Here you'll find all the ways to get in touch with me\n---\n```\n\nIf you don't want to use any parameters on a page, you still need to use the two dashed lines. If you don't, then your file will be shown as-is without the Beautiful Jekyll template.\n\nYou can look at the top of [`aboutme.md`](https://raw.githubusercontent.com/daattali/beautiful-jekyll/master/aboutme.md) as an example.\n\n**Important takeaway: ALWAYS add the YAML front matter, which is two lines of three dashes, to EVERY page. If you have any parameters, they go between the two lines.**\n\n# Supported parameters\n\nBelow is a list of the parameters that Beautiful Jekyll supports (any of these can be added to the YAML front matter of any page). Remember to also look in the `_config.yml` file to see additional site-wide settings. If there's a parameter that you want to apply to the entire site instead of one specific page, check out [this FAQ answer](https://beautifuljekyll.com/faq/#default-params).\n\n## Main parameters\n\nThese are the basic YAML parameters that you are most likely to use on most pages.\n\nParameter   | Description\n----------- | -----------\ntitle       | Page or blog post title\nsubtitle    | Short description of page or blog post that goes under the title\ntags        | List of tags to categorize the post. Separate the tags with commas and place them inside square brackets. Example: `[personal, analysis, finance]`\ncover-img   | Include a large full-width image at the top of the page. You can either provide the path to a single image (eg. `\"/path/to/img\"`) , or a list of images to cycle through (eg. `[\"/path/img1\", \"/path/img2\"]`). If you want to add a caption to an image, then you must use the list notation (use `[]` even if you have only one image), and each image should be provided as `\"/path/to/img\" : \"Caption of image\"`.\nthumbnail-img | For blog posts, if you want to add a thumbnail that will show up in the feed, use `thumbnail-img: /path/to/image`. If no thumbnail is provided, then `cover-img` will be used as the thumbnail. You can use `thumbnail-img: \"\"` to disable a thumbnail.\ncomments    | If you want do add comments to a specific page, use `comments: true`. Comments only work if you enable one of the comments providers (Facebook, disqus, staticman, utterances, giscus, CommentBox) in `_config.yml` file. Comments are automatically enabled on blog posts but not on other pages; to turn comments off for a specific post, use `comments: false`.\nmathjax     | If you want to use LaTeX formulas, you need to enable MathJax. Note that in MathJax you need to use `$$` and `\\\\(` to start and end expressions\n\n## Parameters for SEO and social media sharing\n\nThese parameters let you control what information shows up when a page is shown in a search engine (such as Google) or gets shared on social media (such as Twitter/Facebook).\n\nParameter   | Description\n----------- | -----------\nshare-title | A title for the page. If not provided, then `title` will be used, and if that's missing then the site title (from `_config.yml`) is used.\nshare-description | A brief description of the page. If not provided, then `subtitle` will be used, and if that's missing then an excerpt from the page content is used.\nshare-img   | The image to show. If not provided, then `cover-img` or `thumbnail-img` will be used if one of them is provided.\n\n## Less commonly used parameters\n\nThese are parameters that you may not use often, but can come in handy sometimes.\n\nParameter   | Description\n----------- | -----------\nauthor      | Specify the author of a blog post (useful if a website has multiple authors).\nreadtime    | If you want a post to show how many minutes it will take to read it, use `readtime: true`.\nshow-avatar | If you have an avatar configured in the `_config.yml` but you want to turn it off on a specific page, use `show-avatar: false`.\nsocial-share | By default, every blog post has buttons to share the page on social media. If you want to turn this feature off, use `social-share: false`.\nnav-short   | By default, the navigation bar gets shorter after scrolling down the page. If you want the navigation bar to always be short on a certain page, use `nav-short: true`\ngh-repo   | If you want to show GitHub buttons at the top of a post, this sets the GitHub repo name (eg. `daattali/beautiful-jekyll`). You must also use the `gh-badge` parameter to specify what buttons to show.\ngh-badge  | Select which GitHub buttons to display. Available options are: [star, watch, fork, follow]. You must also use the `gh-repo` parameter to specify the GitHub repo.\nlast-updated | If you want to show that a blog post was updated after it was originally released, you can specify an \"Updated on\" date.\nlayout      | What type of page this is (default is `post` for blog posts and `page` for other pages). See _Page types_ section below for more information.\n\n## Advanced parameters\n\nThese are advanced parameters that are only useful for people who need very fine control over their website.\n\nParameter   | Description\n----------- | -----------\nfooter-extra | If you want to include extra content below the social media icons in the footer, create an HTML file in the `_includes/` folder (for example `_includes/myinfo.html`) and set `footer-extra` to the name of the file (for example `footer-extra: myinfo.html`). Accepts a single file or a list of files.\nbefore-content | Similar to `footer-extra`, but used for including HTML before the main content of the page (below the title).\nafter-content | Similar to `footer-extra`, but used for including HTML after the main content of the page (above the footer).\nhead-extra   | Similar to `footer-extra`, but used if you have any HTML code that needs to be included in the `<head>` tag of the page.\nlanguage    | HTML language code to be set on the page's &lt;html&gt; element.\nfull-width  | By default, page content is constrained to a standard width. Use `full-width: true` to allow the content to span the entire width of the window.\njs          | List of local JavaScript files to include in the page (eg. `/assets/js/mypage.js`)\next-js      | List of external JavaScript files to include in the page (eg. `//cdnjs.cloudflare.com/ajax/libs/underscore.js/1.8.2/underscore-min.js`). External JavaScript files that support [Subresource Integrity (SRI)](https://developer.mozilla.org/en-US/docs/Web/Security/Subresource_Integrity) can be specified using the `href` and `sri` parameters eg.<br/>`href: \"//code.jquery.com/jquery-3.1.1.min.js\"`<br/>`sri: \"sha256-hVVnYaiADRTO2PzUGmuLJr8BLUSjGIZsDYGmIJLv2b8=\"`\ncss         | List of local CSS files to include in the page\next-css      | List of external CSS files to include in the page. External CSS files using SRI (see `ext-js` parameter) are also supported.\n\n## Page types\n\n- **post** - To write a blog post, add a markdown or HTML file in the `_posts` folder. As long as you give it YAML front matter (the two lines of three dashes), it will automatically be rendered like a blog post. Look at the existing blog post files to see examples of how to use YAML parameters in blog posts.\n- **page** - Any page outside the `_posts` folder that uses YAML front matter will have a very similar style to blog posts.\n- **home** - The home layout is meant to act as the homepage of your blog posts - it will display all your blog posts, sorted from newest to oldest. A file using the `home` layout must be named `index.html` (not `index.md` or anything else!).\n- **minimal** - If you want to create a page with minimal styling (ie. without the bulky navigation bar and footer), assign `layout: minimal` to the YAML front matter.\n- If you want to completely bypass the template engine and just write your own HTML page, simply omit the YAML front matter. Only do this if you know how to write HTML!\n\n# Featured users (success stories!)\n\nVisit the [Official website](http://beautifuljekyll.com/examples) to see sample websites using Beautiful Jekyll.\n\nIf you'd like to showcase yourself and join this list, [upgrading to the Individual plan](https://github.com/sponsors/daattali/sponsorships?&tier_id=7362) will give you that publicity plus some other rewards!\n\n# Next steps\n\nCongratulations on making it this far! You now have all the tools to easily build a beautiful website for free. \n\n- After you get comfortable with the basics of writing in markdown, I suggest taking a look at this [sample post](https://beautifuljekyll.com/2020-02-28-sample-markdown/) and [the code that created it](https://raw.githubusercontent.com/daattali/beautiful-jekyll/master/_posts/2020-02-28-sample-markdown.md) to learn some more advanced tips about markdown.\n\n- I **highly recommend** going over the [*Frequently Asked Questions*](https://beautifuljekyll.com/faq/) to find out answers to questions you may not even know you have. Every few months I suggest checking the [*What's New?*](https://beautifuljekyll.com/updates/) page to see if there are new features, and learn [how to update your site to the newest version](https://beautifuljekyll.com/faq/#updating) when it's time.\n\n- You can also check out the [advanced installation methods](https://beautifuljekyll.com/getstarted/#install-steps-hard) that give you a little more control but are harder to use. Keep in mind that Beautiful Jekyll was primarily designed to be used as a GitHub theme, so you will not get any support if you choose one of the Ruby installation methods. \n\n- Remember that Beautiful Jekyll is built on top of Jekyll. This means that reading through the [Jekyll documentation](https://jekyllrb.com/) will introduce you to many more features that you might find useful!\n\n# Getting help\n\nVisit the [FAQ page](https://beautifuljekyll.com/faq) for answers to commonly asked questions.\n\n**If you choose to [become a sponsor](https://beautifuljekyll.com/plans/), you'll have access to my [office hours](https://beautifuljekyll.com/officehours/) where you can ask for help.** You can also use the [Discussions](https://github.com/daattali/beautiful-jekyll/discussions) area to try and get help from the community.\n\nBeautiful Jekyll is used by 50,000+ people with wildly varying degrees of web skills, so it's impossible to answer all the questions that may arise. For any question that's not specifically related to Beautiful Jekyll and is more about Jekyll or web development in general, the answer can often be found on Google, in the [Jekyll documentation](https://jekyllrb.com/), or on the [Jekyll support forum](https://talk.jekyllrb.com/).\n\n# Contributions\n\nThank you to [all past contributors](https://github.com/daattali/beautiful-jekyll/graphs/contributors). If you find any problems or would like to contribute in any way, feel free to create a pull request/open an issue/send me a message.\n\nYou can also contribute by becoming an [official sponsor](https://github.com/sponsors/daattali/sponsorships?tier_id=39856) to help keep Beautiful Jekyll well-maintained!\n\n# Credits\n\nThis template was not made *entirely* from scratch. I'd like to give special thanks to [Jekyll Now](https://github.com/barryclark/jekyll-now) and [Bootstrap Clean Blog](https://github.com/IronSummitMedia/startbootstrap-clean-blog), from whom I've taken several ideas initially.\n\nI'd also like to thank [Dr. Jekyll's Themes](https://drjekyllthemes.github.io/), [Jekyll Themes](http://jekyllthemes.org/), and another [Jekyll Themes](http://jekyllrc.github.io/jekyllthemes/) for featuring Beautiful Jekyll in their Jekyll theme directories.\n\n"
        },
        {
          "name": "_config.yml",
          "type": "blob",
          "size": 10.189453125,
          "content": "###########################################################\n### Welcome to Beautiful Jekyll!\n### This config file is meant for settings that affect your entire website. When you first\n### set up your website you should go through all these settings and edit them, but after\n### the initial set up you won't need to come back to this file often.\n###########################################################\n\n############################\n# --- Required options --- #\n############################\n\n# Name of website\ntitle: My website\n\n# Your name to show in the footer\nauthor: Some Person\n\n###############################################\n# --- List of links in the navigation bar --- #\n###############################################\n\nnavbar-links:\n  About Me: \"aboutme\"\n  Resources:\n    - Beautiful Jekyll: \"https://beautifuljekyll.com\"\n    - Learn markdown: \"https://www.markdowntutorial.com/\"\n  Author's home: \"https://deanattali.com\"\n\n################\n# --- Logo --- #\n################\n\n# Image to show in the navigation bar - works best with a square image\n# Remove this parameter if you don't want an image in the navbar\navatar: \"/assets/img/avatar-icon.png\"\n\n# By default, the image is cut into a circle. You can disable this behaviour by setting 'round-avatar: false'\nround-avatar: true\n\n# If you want to have an image logo in the top-left corner instead of having the title of the website,\n# then specify the following parameter\n#title-img: /path/to/image\n\n\n#####################################\n# --- Footer social media links --- #\n#####################################\n\n# Select the social network links that you want to show in the footer.\n# You can change the order that they show up on the page by changing the order here.\n# Uncomment the links you want to show and add your information to each one.\nsocial-network-links:\n  email: \"someone@example.com\"\n  rss: true  # remove this line if you don't want to show an RSS link at the bottom\n  facebook: deanattali\n  github: daattali\n  twitter: daattali\n  patreon: DeanAttali\n  youtube: \"@daattali\"\n  whatsapp: 15551212\n#  medium: yourname\n#  reddit: yourname or r/yoursubreddit\n#  linkedin: daattali\n#  xing: yourname\n#  stackoverflow: \"3943160/daattali\"\n#  snapchat: deanat78\n#  instagram: deanat78\n#  spotify: yourname\n#  telephone: +14159998888\n#  steam: deanat78\n#  twitch: yourname\n#  yelp: yourname\n#  telegram: yourname\n#  calendly: yourname\n#  mastodon: instance.url/@username\n#  bluesky: yourname\n#  ORCID: your ORCID ID\n#  google-scholar: your google scholar\n#  discord: \"invite_code\" or \"users/userid\" or \"invite/invite_code\"\n#  kaggle: yourname\n#  hackerrank: yourname\n#  gitlab: yourname\n#  itchio: yourname\n#  untappd: yourname\n\n# If you want your website to generate an RSS feed, provide a description\n# The URL for the feed will be https://<your_website>/feed.xml\nrss-description: This website is a virtual proof that I'm awesome\n\n###########################\n# --- General options --- #\n###########################\n\n# Select which social network share links to show in posts\nshare-links-active:\n  twitter: true\n  facebook: true\n  linkedin: true\n  vk: false\n\n# How to display the link to your website in the footer\n# Remove this if you don't want a link in the footer\nurl-pretty: \"MyWebsite.com\"\n\n# Add the website title to the title of every page\ntitle-on-all-pages: true\n\n# Excerpt word length - Truncate the excerpt of each post on the feed page to the specified number of words\nexcerpt_length: 50\n\n# Whether or not to show an excerpt for every blog post in the feed page\nfeed_show_excerpt: true\n\n# Whether or not to show a list of tags below each post preview in the feed page\nfeed_show_tags: true\n\n# Add a search button to the navbar\npost_search: true\n\n# Add a button in the footer to edit the current page. Only works if your website is hosted on GitHub\nedit_page_button: true\n\n# Allow sub-menu items (second-level navigation menu items) to be longer than the top-level menu\n# If this setting is off, then long sub-menu words might get cut off\n# See https://github.com/daattali/beautiful-jekyll/issues/765 to understand the issue this setting can solve\nnavbar-var-length: false\n\n# The keywords to associate with your website, for SEO purposes\n#keywords: \"my,list,of,keywords\"\n\n######################################\n# --- Colours / background image --- #\n######################################\n\n# Personalize the colours in your website. Colour values can be any valid CSS colour\n\npage-col: \"#FFFFFF\"\ntext-col: \"#404040\"\nlink-col: \"#008AFF\"\nhover-col: \"#0085A1\"\nnavbar-col: \"#EAEAEA\"\nnavbar-text-col: \"#404040\"\nnavbar-border-col: \"#DDDDDD\"\nfooter-col: \"#EAEAEA\"\nfooter-text-col: \"#777777\"\nfooter-link-col: \"#404040\"\nfooter-hover-col: \"#0085A1\"\n\n# Alternatively, the navbar, footer, and page background can be set to an image\n# instead of colour\n\n#navbar-img: \"/assets/img/bgimage.png\"\n#footer-img: \"/assets/img/bgimage.png\"\n#page-img: \"/assets/img/bgimage.png\"\n\n# Suggest a colour for mobile browsers to use as the browser's theme. This is only supported by a few mobile browsers.\n#mobile-theme-col: \"#0085A1\"\n\n# For any extra visual customization, you can include additional CSS files in every page on your site. List any custom CSS files here\n#site-css:\n#  - \"/assets/css/custom-styles.css\"\n\n# If you have common JavaScript files that should be included in every page, list them here\n#site-js:\n#  - \"/assets/js/custom-script.js\"\n\n#################################\n# --- Web Analytics Section --- #\n#################################\n\n# Fill in your Google Analytics tag ID (or \"Measurement ID\") to track your website usage\n#gtag: \"G-XXXXXXXXXX\"\n\n# Fill in your Cloudflare Analytics beacon token to track your website using Cloudflare Analytics\n#cloudflare_analytics: \"\"\n\n# Google Tag Manager ID\n#gtm: \"\"\n\n# Matomo (aka Piwik) Web statistics\n# Uncomment the following section to enable Matomo. The opt-out parameter controls\n# whether or not you want to allow users to opt out of tracking.\n#matomo:\n#  site_id: \"9\"\n#  uri: \"demo.wiki.pro\"\n#  opt-out: true\n\n# Google Universal Analytics ID -- deprecated\n# As of July 2023 this is no longer supported by Google! If you are still using `google_analytics`,\n# you should switch to using the `gtag` field above instead.\n#google_analytics: \"UA-XXXXXXXX-X\"\n\n####################\n# --- Comments --- #\n####################\n\n# To use Disqus comments, sign up to https://disqus.com and fill in your Disqus shortname (NOT the userid)\n#disqus: \"\"\n\n# To use Facebook Comments, create a Facebook app and fill in the Facebook App ID\n#fb_comment_id: \"\"\n\n# To use CommentBox, sign up for a Project ID on https://commentbox.io\n#commentbox: \"\" # Project ID, e.g. \"5694267682979840-proj\"\n\n# To use Utterances comments: (0) uncomment the following section, (1) fill in\n# \"repository\" (make sure the repository is public), (2) Enable Issues in your repository,\n# (3) Install the Utterances app in your repository https://github.com/apps/utterances\n# See more details about the parameters below at https://utteranc.es/\n#utterances:\n#  repository: # GitHub username/repository eg. \"daattali/beautiful-jekyll\"\n#  issue-term: title   # Mapping between blog posts and GitHub issues\n#  theme: github-light # Utterances theme\n#  label: blog-comments # Label that will be assigned to GitHub Issues created by Utterances\n\n# To use Staticman comments, uncomment the following section. You may leave the reCaptcha\n# section commented if you aren't using reCaptcha for spam protection.\n# Using Staticman requires advanced knowledge, please consult\n# https://github.com/eduardoboucas/staticman/ and https://staticman.net/ for further\n# instructions. For any support with staticman please direct questions to staticman and\n# not to BeautifulJekyll.\n#staticman:\n#  repository : # GitHub username/repository eg. \"daattali/beautiful-jekyll\"\n#  branch     : master # If you're not using `master` branch, then you also need to update the `branch` parameter in `staticman.yml`\n#  endpoint   : # URL of your deployment, with a trailing slash eg. \"https://<your-api>/v3/entry/github/\"\n#  reCaptcha:   # (optional, set these parameters in `staticman.yml` as well)\n#    siteKey  : # You need to apply for a site key on Google\n#    secret   : # Encrypt your password by going to https://<your-own-api>/v3/encrypt/<your-site-secret>\n\n# To use giscus comments:\n# (0) Uncomment the following giscus section, (1) Enable Discussions in your GitHub repository,\n# (2) Install the giscus app in your repository (details at https://giscus.app),\n# (3) Fill in *all* the parameters below\n# See more details about giscus and each of the following parameters at https://giscus.app\n#giscus:\n#  hostname: giscus.app # Replace with your giscus instance's hostname if self-hosting\n#  repository: # GitHub username/repository eg. \"daattali/beautiful-jekyll\"\n#  repository-id: # ID of your repository, retrieve this info from https://giscus.app\n#  category: Announcements # Category name of your GitHub Discussion posts\n#  category-id: # ID of your category, retrieve this info from https://giscus.app\n#  mapping: pathname\n#  reactions-enabled: 1\n#  emit-metadata: 0\n#  theme: light\n\n################\n# --- Misc --- #\n################\n\n# Ruby Date Format to show dates of posts\ndate_format: \"%B %-d, %Y\"\n\n# Facebook App ID\n#fb_app_id: \"\"\n\n#################################################################################\n# --- You don't need to touch anything below here (but you can if you want) --- #\n#################################################################################\n\n# Output options (more information on Jekyll's site)\ntimezone: \"America/Toronto\"\nmarkdown: kramdown\nhighlighter: rouge\npermalink: /:year-:month-:day-:title/\npaginate: 5\n\nkramdown:\n  input: GFM\n\n# Default YAML values (more information on Jekyll's site)\ndefaults:\n  -\n    scope:\n      path: \"\"\n      type: \"posts\"\n    values:\n      layout: \"post\"\n      comments: true  # add comments to all blog posts\n      social-share: true # add social media sharing buttons to all blog posts\n  -\n    scope:\n      path: \"\" # any file that's not a post will be a \"page\" layout by default\n    values:\n      layout: \"page\"\n\n# Exclude these files from production site\nexclude:\n  - CHANGELOG.md\n  - CNAME\n  - Gemfile\n  - Gemfile.lock\n  - LICENSE\n  - README.md\n  - screenshot.png\n  - docs/\n\nplugins:\n  - jekyll-paginate\n  - jekyll-sitemap\n\n# Beautiful Jekyll / Dean Attali\n# 2fc73a3a967e97599c9763d05e564189\n\n"
        },
        {
          "name": "_data",
          "type": "tree",
          "content": null
        },
        {
          "name": "_includes",
          "type": "tree",
          "content": null
        },
        {
          "name": "_layouts",
          "type": "tree",
          "content": null
        },
        {
          "name": "_posts",
          "type": "tree",
          "content": null
        },
        {
          "name": "aboutme.md",
          "type": "blob",
          "size": 0.439453125,
          "content": "---\nlayout: page\ntitle: About me\nsubtitle: Why you'd want to go on a date with me\n---\n\nMy name is Inigo Montoya. I have the following qualities:\n\n- I rock a great mustache\n- I'm extremely loyal to my family\n\nWhat else do you need?\n\n### My story\n\nTo be honest, I'm having some trouble remembering right now, so why don't you just watch [my movie](https://en.wikipedia.org/wiki/The_Princess_Bride_%28film%29) and it will answer **all** your questions.\n"
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "beautiful-jekyll-theme.gemspec",
          "type": "blob",
          "size": 1.3330078125,
          "content": "# frozen_string_literal: true\n\nGem::Specification.new do |spec|\n  spec.name          = \"beautiful-jekyll-theme\"\n  spec.version       = \"6.0.1\"\n  spec.authors       = [\"Dean Attali\"]\n  spec.email         = [\"daattali@gmail.com\"]\n\n  spec.summary       = \"Beautiful Jekyll is a ready-to-use Jekyll theme to help you create an awesome website quickly. Perfect for personal blogs or simple project websites, with a focus on responsive and clean design.\"\n  spec.homepage      = \"https://beautifuljekyll.com\"\n  spec.license       = \"MIT\"\n\n  spec.files         = `git ls-files -z`.split(\"\\x0\").select { |f| f.match(%r{^(assets|_layouts|_includes|LICENSE|README|feed|404|_data|tags|staticman)}i) }\n\n  spec.metadata      = {\n    \"changelog_uri\"     => \"https://beautifuljekyll.com/updates/\",\n    \"documentation_uri\" => \"https://github.com/daattali/beautiful-jekyll#readme\"\n  }\n\n  spec.add_runtime_dependency \"jekyll\", \">= 3.9.3\"\n  spec.add_runtime_dependency \"jekyll-paginate\", \"~> 1.1\"\n  spec.add_runtime_dependency \"jekyll-sitemap\", \"~> 1.4\"\n  spec.add_runtime_dependency \"kramdown-parser-gfm\", \"~> 1.1\"\n  spec.add_runtime_dependency \"kramdown\", \"~> 2.3\"\n  spec.add_runtime_dependency \"webrick\", \"~> 1.8\"\n\n  spec.add_development_dependency \"bundler\", \">= 1.16\"\n  spec.add_development_dependency \"rake\", \"~> 12.0\"\n  spec.add_development_dependency \"appraisal\", \"~> 2.5\"\nend\n"
        },
        {
          "name": "feed.xml",
          "type": "blob",
          "size": 1.1162109375,
          "content": "---\nlayout: null\n---\n<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<rss version=\"2.0\" xmlns:atom=\"http://www.w3.org/2005/Atom\">\n  <channel>\n    {% if site.title %}\n    <title>{{ site.title | xml_escape }}</title>\n    {% endif %}\n    {% if site.rss-description %}\n    <description>{{ site.rss-description | xml_escape }}</description>\n    {% endif %}\n    <link>{{ '/' | absolute_url }}</link>\n    <atom:link href=\"{{ 'feed.xml' | absolute_url }}\" rel=\"self\" type=\"application/rss+xml\" />\n    {% assign excerpt_length = site.excerpt_length | default: 50 %}\n    {% for post in site.posts limit:20 %}\n      <item>\n        <title>{{ post.title | strip_html | xml_escape }}</title>\n        <description>\n          {% if post.subtitle %}{{ post.subtitle | strip_html | xml_escape }} - {% endif %}\n          {{ post.content | strip_html | xml_escape | truncatewords: excerpt_length }}\n        </description>\n        <pubDate>{{ post.date | date: \"%a, %d %b %Y %H:%M:%S %z\" }}</pubDate>\n        <link>{{ post.url | absolute_url }}</link>\n        <guid isPermaLink=\"true\">{{ post.url | absolute_url }}</guid>\n      </item>\n    {% endfor %}\n  </channel>\n</rss>\n"
        },
        {
          "name": "index.html",
          "type": "blob",
          "size": 0.10546875,
          "content": "---\nlayout: home\ntitle: My website\nsubtitle: This is where I will tell my friends way too much about me\n---\n"
        },
        {
          "name": "screenshot.png",
          "type": "blob",
          "size": 59.669921875,
          "content": null
        },
        {
          "name": "staticman.yml",
          "type": "blob",
          "size": 3.8046875,
          "content": "# Name of the property. You can have multiple properties with completely\n# different config blocks for different sections of your site.\n# For example, you can have one property to handle comment submission and\n# another one to handle posts.\n# To encrypt strings use the following endpoint:\n# https://{STATICMAN API INSTANCE}/v3/encrypt/{TEXT TO BE ENCRYPTED}\n# {STATICMAN API INSTANCE} should match the `endpoint` in the theme config\n# file.\n\ncomments:\n  # (*) REQUIRED\n  #\n  # Names of the fields the form is allowed to submit. If a field that is\n  # not here is part of the request, an error will be thrown.\n  allowedFields: [\"name\", \"email\", \"url\", \"message\"]\n\n  # (*) REQUIRED WHEN USING NOTIFICATIONS\n  #\n  # When allowedOrigins is defined, only requests sent from one of the domains\n  # listed will be accepted. The origin is sent as part as the `options` object\n  # (e.g. <input name=\"options[origin]\" value=\"https://yourdomain.com/post1\")\n  # allowedOrigins: [\"https://example.com\"]\n\n  # (*) REQUIRED\n  #\n  # Name of the branch being used. Must match the `branch` in the theme config\n  # file.\n  branch: \"master\"   #  use \"master\" for user page or \"gh-pages\" for project pages\n\n  commitMessage: \"New comment by {fields.name}\"\n\n  # (*) REQUIRED\n  #\n  # Destination path (filename) for the data files. Accepts placeholders.\n  filename: \"comment-{@timestamp}\"\n\n  # The format of the generated data files. Accepted values are \"json\", \"yaml\"\n  # or \"frontmatter\"\n  format: \"yaml\"\n\n  # List of fields to be populated automatically by Staticman and included in\n  # the data file. Keys are the name of the field. The value can be an object\n  # with a `type` property, which configures the generated field, or any value\n  # to be used directly (e.g. a string, number or array)\n  generatedFields:\n    date:\n      type: \"date\"\n      options:\n        format: \"iso8601\" # \"iso8601\" (default), \"timestamp-seconds\", \"timestamp-milliseconds\"\n\n  # Whether entries need to be approved before they are published to the main\n  # branch. If set to `true`, a pull request will be created for your approval.\n  # Otherwise, entries will be published to the main branch automatically.\n  moderation: false\n\n  # Akismet spam detection.\n  # akismet:\n  #   enabled: true\n  #   author: \"name\"\n  #   authorEmail: \"email\"\n  #   authorUrl: \"url\"\n  #   content: \"message\"\n  #   type: \"comment\"\n\n  # Name of the site. Used in notification emails.\n  # name: \"Your Site\"\n\n  # Notification settings. When enabled, users can choose to receive notifications\n  # via email when someone adds a reply or a new comment. This requires an account\n  # with Mailgun, which you can get for free at https://mailgun.com.\n  # notifications:\n    # Enable notifications\n    # enabled: true\n\n    # (!) ENCRYPTED\n    #\n    # Mailgun API key\n    # apiKey: \"\"\n\n    # (!) ENCRYPTED\n    #\n    # Mailgun domain (encrypted)\n    # domain: \"\"\n\n  # (*) REQUIRED\n  #\n  # Destination path (directory) for the data files. Accepts placeholders.\n  path: \"_data/comments/{options.slug}\" # (default)\n\n  # Names of required files. If any of these isn't in the request or is empty,\n  # an error will be thrown.\n  requiredFields: [\"name\", \"email\", \"message\"]\n\n  # List of transformations to apply to any of the fields supplied. Keys are\n  # the name of the field and values are possible transformation types.\n  transforms:\n    email: md5\n\n  # reCAPTCHA (OPTIONAL)\n  # To enable reCAPTCHA:\n  # 1. Set `enabled` to `true`\n  # 2. Register your domain at https://www.google.com/recaptcha/ and choose reCAPTCHA V2\n  # 3. Uncomment `siteKey` and `secret` and fill them in with your values\n  reCaptcha:\n    enabled: false\n    #siteKey: \"\"\n    # ENCRYPT reCaptcha secret key using Staticman /encrypt endpoint\n    # i.e. https://{STATICMAN API INSTANCE}/v3/encrypt/{your-site-secret}\n    # For more information, visit https://staticman.net/docs/encryption\n    #secret: \"\"\n"
        },
        {
          "name": "tags.html",
          "type": "blob",
          "size": 1.193359375,
          "content": "---\nlayout: page\ntitle: 'Tag Index'\n---\n\n{% assign date_format = site.date_format | default: \"%B %-d, %Y\" %}\n\n{%- capture site_tags -%}\n    {%- for tag in site.tags -%}\n        {{- tag | first -}}{%- unless forloop.last -%},{%- endunless -%}\n    {%- endfor -%}\n{%- endcapture -%}\n{%- assign tags_list = site_tags | split:',' | sort -%}\n\n{%- for tag in tags_list -%}\n    <a href=\"#{{- tag -}}\" class=\"btn btn-primary tag-btn\"><i class=\"fas fa-tag\" aria-hidden=\"true\"></i>&nbsp;{{- tag -}}&nbsp;({{site.tags[tag].size}})</a>\n{%- endfor -%}\n\n<div id=\"full-tags-list\">\n{%- for tag in tags_list -%}\n    <h2 id=\"{{- tag -}}\" class=\"linked-section\">\n        <i class=\"fas fa-tag\" aria-hidden=\"true\"></i>\n        &nbsp;{{- tag -}}&nbsp;({{site.tags[tag].size}})\n    </h2>\n    <div class=\"post-list\">\n        {%- for post in site.tags[tag] -%}\n            <div class=\"tag-entry\">\n                <a href=\"{{ post.url | relative_url }}\">{{- post.title | strip_html -}}</a>\n                <div class=\"entry-date\">\n                    <time datetime=\"{{- post.date | date_to_xmlschema -}}\">{{- post.date | date: date_format -}}</time>\n                </div>\n            </div>\n        {%- endfor -%}\n    </div>\n{%- endfor -%}\n</div>\n"
        }
      ]
    }
  ]
}