{
  "metadata": {
    "timestamp": 1736709553030,
    "page": 72,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "kristopolous/BOOTSTRA.386",
      "stars": 6666,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.345703125,
          "content": "# Numerous always-ignore extensions\n*.diff\n*.err\n*.orig\n*.log\n*.rej\n*.swo\n*.swp\n*.vi\n*~\n*.sass-cache\n*.map\n\n# OS or Editor folders\n.DS_Store\n._*\nThumbs.db\n.cache\n.project\n.settings\n.tmproj\n*.esproj\nnbproject\n*.sublime-project\n*.sublime-workspace\n\n# Komodo\n*.komodoproject\n.komodotools\n\n# Folders to ignore\n.hg\n.svn\n.CVS\n.idea\nnode_modules\nbuild\n.vagrant\n"
        },
        {
          "name": "CONDUCT_OF_CODE.md",
          "type": "blob",
          "size": 2.3291015625,
          "content": "# Conduct of Code\n\n## Our Pledge\n\nThe code should conduct itself accordingly following all compiler documentations and standards. \nDon't pull a fast one on me.  Especially on the computers of those in protected classes or \nother minority groups. I mean it source code! I'm watching you!\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive computing environment\ninclude:\n\n* Running on a diverse variety of platforms\n* Shallow call-stack depths\n* Being respectful of CPU cycles and memory usage\n* Gracefully accepting ctrl+c and kill -15\n* Showing useful stack traces and coherent errors\n\nExamples of unacceptable behavior by computer programs include:\n\n* Obtuse interfaces that make easy things hard and hard things impossible\n* Code that overflows your stacks and buffalos your buffers\n* Opinionated code that requires you to work around it like you're in some authoritarian hellscape\n* Sexy code that runs in NSFW ways, especially in unwelcomed naughty ways\n* Code that breaks for no reason whatsoever and then just starts working again\n* Useless error messages that read like James Joyce and William Burroughs did acid together\n* Insisting how much better it would be if only we installed your phone app\n\n## Our Responsibilities\n\nProject maintainers (that's me!) have the right and responsibility to take weekend bingers \nif code is not aligned to this Conduct of Code and desperately type in `git commit -a` \nwhile totally sloshed after tossing office equipment (for instance; pencils and notepads) \nat the computer while cursing all those who came before as hapless arrogant architects \nof our collective toilsome nightmares. Why have we been condemned to such suffering? \n\nApparently someone's ability to do a sliding window brain teaser has very low correlation with\nwhether they can release good software. \n\n## Scope\n\nThe conduct of code applies to my computer and yours in public and in private, intimate settings, \nlate at night, when nobody is looking and you turn off your anti-virus, log in as root and slide \nyour laptop in home-made lingerie to have your way with it by candlelight. \n\nWe know. We all know.\n\n## Enforcement\n\nOk, I tried playing nice. One more fucking bug and I'll toss this laptop out this damn window, \nI swear, don't tempt me safari I've had enough of your shit. \n\n## Attribution\n\nWell let's not be too precious about that. \n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.0703125,
          "content": "# Contributing to // BOOTSTRA.386 //\n\nLooking to contribute something to BOOTSTRA.386?\n\nDon't you worry! It's Easy!\n\n**Basic idea**\n\nBootstra.386 is an attempt to make an accurate-as-possible replica of a DOS or Console style interface in the web-browser using the bootstrap templating engine.  \n\nIt's in this authors opinion that there are great rewards and pleasure from a faithful exercise of this and that there is a high level of satisfaction that is a direct result of the level of care and precision taken in so doing.\n\nIt gets to a point where it's indistinguishable from an early 90s DOS screen.  The mind defies the eyes, \"how is this a web page?\" as if some great orchestration of CSS magic had been performed in front of you ... truly exhilirating.  \n\nI want all to feel this magic.  It's wonderful.\n\n**Here's how you can help.**\n\n## Issues\n\nTo file a bug you could \n\n * file an issue on github.\n * hit up the mailing list.\n * send me an email.\n * hit me up on facebook.\n * mail me something with letters cut out from magazines.\n * knock on my door at 4am and place into my palm, a dutifully hand-written description with annotated diagrams.\n \nPreferably, I like a screen shot and context. Here's an example of a good bug:\n\n> The calculations for a span4 are done in a way that centering text doesn't follow the grid rules:\n>\n> <img src=http://i.imgur.com/hTiYHSB.png>\n\n\n## CSS guidelines\n\n  * All generated text must be vertically aligned.  The letters should start at the same horizontal offset down the page, as a grid\n  * All generated text must be horizontally aligned.  Borders, margins, and paddings must be a function of the height of the font or\n    the height of the font / 2 if you are doing some special ASCII-like thing.\n  * Foreground colors can be any of the EGA 16 - background can only be the first 8.\n  * Things like shadows, darken, lighten, border-radius, underline, italics, bold - none of this is allowed - it has to have been able to have been generated in a generic ANSI terminal - think IBM AT era.\n  * Colors and spacing should be endogeneous.  That is to say that it should be based on something defined from the baseline variables.less.  There is only a few exceptions.  Generally speaking, things should be \"@white\" and not \"#fff\".  That one is obvious, but it also helps avoiding things like #F7F7F7 which appear all throughout regular bootstrap that look white-like, but actually are off enough that it destroys the magic.\n\n## HTML guidelines\n\n( * attractive intentional dust * )\n\n## JS guidelines\n\n### semicolons\nuse semi-colons, or don't - in fact, you can pad everything with semicolons.\nI mean, if the browser takes it, then that's really fine by me. Want to submit code like this?\n\n      ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;function (obj, cb) {;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;// Try to return quickly if there's nothing to do.;;;\n      ;;;;if (obj.length === 0) { return; };;;;;;;;;;;;;;;;;;;;\n      ;;;;if (_.isArr(obj)) {;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;;;obj.forEach(cb);;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;} else {;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;;;for( var key in obj ) {;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;;;;;cb(key, obj[key]);;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;;;};;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;};;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;};;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n      ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n\nThat's fine. Really. I know sed. don't worry.\n\n### commas\nwhatever you want.  If  you want to write:\n\n    if ( n === (  \n                  (0,0)\n                   ,7,  \n                    v)\n    ) {\n\nI will consider you an awesome and creative human being and gladly accept your madness.\n\n### spaces\n\nBe creative, have fun.\n\n### other styles\n\nDifferent strokes ... have a good time - make the code awesome and fun to read - like a zine self-published at a co-op. \n\nbe more awesomer!\n\n## License\n\nBy contributing your code, you agree to license your contribution under the terms of the [APLv2](LICENSE)\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 9.93359375,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.0185546875,
          "content": "Bootstrap/386 is a Twitter bootstrap v2/3/4/5(in progress) theme to make webpages look like they are from the gentler, less distracting time of the 1980s. \n\n# [See A Demo By Clicking Here](http://kristopolous.github.io/BOOTSTRA.386/v2.3.1/)\n\n\n### Download for your favorite bootstrap version with all the necessary JS and CSS to get started right away:\n\n * BOOTSTRA/386 ][ (2013) [demo](http://kristopolous.github.io/BOOTSTRA.386/) [144KB](https://github.com/kristopolous/BOOTSTRA.386/blob/master/bootstra.386-latest-v2.zip?raw=true)\n * BOOTSTRA/386 <i>iii</i> (2015) [423KB](https://github.com/kristopolous/BOOTSTRA.386/blob/master/bootstra.386-latest-v3.zip?raw=true)\n * BOOTSTRA/386 4 (2020) - [demo](http://kristopolous.github.io/BOOTSTRA.386/v4.4.1/) [remaining issues](https://github.com/kristopolous/BOOTSTRA.386/issues/85) - [current build](https://github.com/kristopolous/BOOTSTRA.386/blob/master/bootstra.386-latest-v4.zip?raw=true)\n * ブートストラップ/386 5.0 (2023) - In progress \n\nhttps://github.com/kristopolous/BOOTSTRA.386/assets/231761/9d8f7c51-0ba7-4a45-996d-d9a36e00a6a3\n\n<a href=http://i.imgur.com/chWpJfb.jpg><img src=http://i.imgur.com/chWpJfbl.jpg></a>\n<pre>\n     ____  ____  ____  _____________________  ___    ____        __   _____ ____  _____\n    / __ )/ __ \\/ __ \\/_  __/ ___/_  __/ __ \\/   |  / __ \\     _/_/  |__  /( __ )/ ___/\n   / __  / / / / / / / / /  \\__ \\ / / / /_/ / /| | / /_/ /   _/_/     /_ &lt;/ __  / __ \\ \n  / /_/ / /_/ / /_/ / / /  ___/ // / / _, _/ ___ |/ ____/  _/_/     ___/ / /_/ / /_/ / \n /_____/\\____/\\____/ /_/  /____//_/ /_/ |_/_/  |_/_/      /_/      /____/\\____/\\____/  \n\n      The Definitive All-in-one Graphical Tool-Kit for Micros and Terminals.  \n - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n  There's a lot of micros and a lot of        this future has arrived.\n  graphics modes. Today there's CGA,          \n  Hercules, MDA, and EGA. And that's only     Use primitives like buttons, \"toolbars\"\n  on the IBM-PC.                              and various \"widgets\" that will control\n                                              your application. We handle rendering\n  What about Tandy, CDC, Honeywell,           these abstractions on screen for you.\n  DEC, and Zenith? That's a different          \n  problem. How about the portables on         Think of your software in terms of\n  tomorrows' horizon? Plan to ignore the      Windows, Icons, Menus, and Pull-Downs.\n  Compaq-1? Your customers won't.             Even a WIMP can do it (TM).\n                                              \n  Such incompatibilities shouldn't be         That's the new paradigm of full-screen\n  your concern. You focus on making           interactive applications. Give your\n  great microcomputer applications. We        customers the rich interface that are\n  focus on making your application work       easy to use and also, easy to create.\n  on tomorrow's computer.                     Give yourself that one-leg up on your\n                                              competition. GUI is Good. GUI is God.\n  It's called a \"Graphical User Interface\"    \n  They've been in development for years       Just look at how beautiful\n  at places like XEROX Parc in Palo Alto      your application can look with\n  and Carnegie Mellon. And now, finally       BOOTSTRAP/386:\n\n</pre>\n\n<img src=http://i.imgur.com/CZKrANV.png>\n\n\n### Configuration\n\nJavascript settings are set via a global `_386` object.\n\n#### Animation\nThe loading animation can be configured through the following values:\n\n  * fastLoad `[bool]` (default: false) - disable all animation.\n  * onePass `[bool]` (default: false) - when set, this will disable the second flyby cursor\n  * speedFactor `[float]` (default: 1.0) - This controls how fast the animation happens. Higher values mean faster animation.\n\nExample:\n\n    _386 = { onePass: true, speedFactor: 1.25 };\n\n> Note: For the progressive animation to work you may need to set this stanza in your regular CSS: `body { visibility: hidden }`.\n\n### Accomodating users without javascript\n\nDuring a [2018 April fools' prank, a user pointed out that this theme doesn't work without javascript](https://www.reddit.com/r/linux/comments/88lump/manjaro_websites_april_1st_prank_is_the_default/dwlz0rv/). This is a valid concern, however it cannot be addressed without a user manually doing something\nsince this is just a bootstrap theme.\n\nLuckily, HTML5 permits [noscript in the head section](https://stackoverflow.com/questions/218162/embedding-extra-styles-with-noscript/1332058#1332058) which means that style can be put in the noscript section.  This means that putting this in the header would permit people without JS on to see the site:\n\n```html\n<noscript>\n  <style>\n    body { \n       visibility: visible; \n    }\n  </style>\n</noscript>\n```\n### Bugs and Stuff\n\nCheck out the [contribution](https://github.com/kristopolous/BOOTSTRA.386/blob/master/CONTRIBUTING.md) doc - it's easy, I swear.\n\n### Building yourself\n\nThese folders, and all versions, are proper forks of tagged releases of bootstrap. Because they represent very specific snapshots in time, there's no configuration json, buildbot updates or anything like that. If you want to patch updates to the dependencies and confirm the build of the old versions then please open a PR ... I ignore the automated ones that github sends me because it's not that kind of project.\n\nFor building, I have included README.md in each of the directories. Unlike the lazy chumps over at bootstrap industries, I actually support 4 versions, simultaneously. Now I do so very poorly, and with a proposterous time lag, but I supposedly do.\n\n### Contact\n\n * [Mailing list](https://groups.google.com/forum/#!forum/bootstra-386)\n\nAlso you can give me money, as little as $1/month ... Click on that heart sponsor thing at the top ... I'm a sponsorer as well!\n\n### See [the wiki](https://github.com/kristopolous/BOOTSTRA.386/wiki/) for more documentation.\n\n### Attributions\n\nThe font for v4/5 is by VileR, used under Creative Commons Share-Alike, which [can be found at int10h.org](https://int10h.org/oldschool-pc-fonts/fontlist/).\n\n"
        },
        {
          "name": "bootstra.386-latest-v2.zip",
          "type": "blob",
          "size": 148.63671875,
          "content": null
        },
        {
          "name": "bootstra.386-latest-v3.zip",
          "type": "blob",
          "size": 416.33203125,
          "content": null
        },
        {
          "name": "bootstra.386-latest-v4.zip",
          "type": "blob",
          "size": 556.646484375,
          "content": null
        },
        {
          "name": "bootstra.386-latest.v5.zip",
          "type": "blob",
          "size": 307.8955078125,
          "content": null
        },
        {
          "name": "bower.json",
          "type": "blob",
          "size": 0.5205078125,
          "content": "{\n  \"name\": \"bootstra.386\",\n  \"description\": \"A Twitter Bootstrap theme to make webpages look like they are from the 1980s.\",\n  \"keywords\": [\"bootstrap\", \"theme\"],\n  \"authors\": [ \n    { \"name\": \"Chris McKenzie\", \"homepage\": \"http://getpostdelete.com\" }\n  ],\n  \"homepage\": \"http://kristopolous.github.io/BOOTSTRA.386/\",\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"https://github.com/kristopolous/BOOTSTRA.386.git\"\n  },\n  \"license\": \"Apache-2.0\",\n  \"ignore\": [\n    \"CONTRIBUTING.md\",\n    \"deploy.sh\",\n    \"convert-image.sh\"\n  ]\n}\n"
        },
        {
          "name": "convert-image.sh",
          "type": "blob",
          "size": 0.4794921875,
          "content": "#!/bin/bash\n#\n# Converts an image, replacing it in-place ... I know! dangerous right?\n\n# first we take the image and convert it to our 16 color map without\n# dithering\n\nascii() {\n  tmp=`mktemp --suffix=png`\n  convert $1 -remap img-ref/ega16-palette.png -resize 70x $tmp\n  img2txt -W 30 -x 12.4 -y 20 -f tga $1 | convert tga:- $1\n  rm $tmp\n}\n\ncolor16() {\n  convert $1 -resize 120x - | convert - -filter box -dither FloydSteinberg -remap img-ref/ega16-palette.png -resize 360x $1\n}\ncolor16 $1\n"
        },
        {
          "name": "deploy",
          "type": "tree",
          "content": null
        },
        {
          "name": "font-magic.sh",
          "type": "blob",
          "size": 0.3271484375,
          "content": "#!/bin/bash\n#\n# This is hilarious. I smiled and laughed when I wrote it. \n# Stupid code that works is the best.\n#\nfn=Fixedsys500c.otf\nfor i in $(find v* -name Fixedsys500c.otf); do\n  wewant=$(dirname $i)\n  symlink=$(echo $wewant | sed -E 's/[^\\/]*\\//..\\//g')\n  path=$(dirname $symlink)/fonts\n  rm -r $wewant\n  ln -s $path $wewant\ndone\n"
        },
        {
          "name": "fonts",
          "type": "tree",
          "content": null
        },
        {
          "name": "homepage",
          "type": "tree",
          "content": null
        },
        {
          "name": "icon-gen.js",
          "type": "blob",
          "size": 1.5693359375,
          "content": "#!/usr/bin/env node\nconst TextToSVG = require('text-to-svg');\nconst textToSVG = TextToSVG.loadSync('fonts/Px437_IBM_EGA8.otf');\nconst fs = require('fs');\n\nif(!process.argv[2]) { \n  console.error(\"You need to specify a path to generate the svg files in as your argument\");\n  process.exit(-1);\n}\n\nconst path = (process.argv[2] || '.').replace(/\\/$/, '');\nvar list = [\"// This file is auto-generated from icon-gen in the root directory\"];\n \nconst variationList = [\n  ['black', '#000000'],\n  ['grayLight', '#bbbbbb']\n];\n\n[\n  ['[', 'left-brace'],\n  [']', 'right-brace'],\n  ['[', 'left-brace'],\n  ['-', 'hyphen'],\n  ['\\u25B2', 'arrow-up'],\n  ['\\u25Bc', 'arrow-down'],\n  ['\\u2591', 'shade-25'],\n  ['\\u2592', 'shade-50'],\n  ['\\u2593', 'shade-75'],\n  ['\\u2588', 'shade-100'],\n\n  ['[\\u25A0]', 'checkbox-checked'],\n  ['[ ]', 'checkbox-unchecked'],\n  [`\\u253c\\u2584`, 'grid'],\n  ['(\\u2022)', 'radio-checked'],\n  ['( )', 'radio-unchecked']\n].forEach(row => {\n  let [str, string] = row;\n\n  for(const [name, hex] of variationList) {\n    let props = {\n      x: 0, y: 0, \n      fontSize: 16, anchor: 'top',\n      attributes: {fill: hex}\n    };\n\n    if (row.length > 3) {\n      props = Object.assign(props, row[3]);\n    }\n\n    if(name == 'grid') {\n      props.attributes.fill += '40';\n    }\n\n    const \n      svg = textToSVG.getSVG(str, props),\n      fullpath = `${path}/${string}-${name}.svg`\n\n    fs.writeFileSync(fullpath, svg);\n\n    console.log(fullpath);\n  }\n\n  //if(bsname) {\n  //  list.push(`$${bsname}: url('data:image/svg+xml,${svg}');`);\n  //}\n});\n\n//fs.writeFileSync(`v4.4.1/scss/_autogen.scss`, list.join('\\n'));\n"
        },
        {
          "name": "img-ref",
          "type": "tree",
          "content": null
        },
        {
          "name": "package-lock.json",
          "type": "blob",
          "size": 1.705078125,
          "content": "{\n  \"name\": \"bootstra.386\",\n  \"version\": \"1.0.0\",\n  \"lockfileVersion\": 1,\n  \"requires\": true,\n  \"dependencies\": {\n    \"commander\": {\n      \"version\": \"2.20.3\",\n      \"resolved\": \"https://registry.npmjs.org/commander/-/commander-2.20.3.tgz\",\n      \"integrity\": \"sha512-GpVkmM8vF2vQUkj2LvZmD35JxeJOLCwJ9cUkugyk2nuhbv3+mJvpLYYt+0+USMxE+oj+ey/lJEnhZw75x/OMcQ==\",\n      \"dev\": true\n    },\n    \"opentype.js\": {\n      \"version\": \"0.11.0\",\n      \"resolved\": \"https://registry.npmjs.org/opentype.js/-/opentype.js-0.11.0.tgz\",\n      \"integrity\": \"sha512-Z9NkAyQi/iEKQYzCSa7/VJSqVIs33wknw8Z8po+DzuRUAqivJ+hJZ94mveg3xIeKwLreJdWTMyEO7x1K13l41Q==\",\n      \"dev\": true,\n      \"requires\": {\n        \"string.prototype.codepointat\": \"^0.2.1\",\n        \"tiny-inflate\": \"^1.0.2\"\n      }\n    },\n    \"string.prototype.codepointat\": {\n      \"version\": \"0.2.1\",\n      \"resolved\": \"https://registry.npmjs.org/string.prototype.codepointat/-/string.prototype.codepointat-0.2.1.tgz\",\n      \"integrity\": \"sha512-2cBVCj6I4IOvEnjgO/hWqXjqBGsY+zwPmHl12Srk9IXSZ56Jwwmy+66XO5Iut/oQVR7t5ihYdLB0GMa4alEUcg==\",\n      \"dev\": true\n    },\n    \"text-to-svg\": {\n      \"version\": \"3.1.5\",\n      \"resolved\": \"https://registry.npmjs.org/text-to-svg/-/text-to-svg-3.1.5.tgz\",\n      \"integrity\": \"sha512-mbeGhMz9MAFaGaZGE8n4Mh/iQV/UkVnYJXhXFrv0eWkcNTgflhpHR2a8nr2ci3NU4FekIHJYKh0N0qdc6yUpfA==\",\n      \"dev\": true,\n      \"requires\": {\n        \"commander\": \"^2.11.0\",\n        \"opentype.js\": \"0.11.0\"\n      }\n    },\n    \"tiny-inflate\": {\n      \"version\": \"1.0.3\",\n      \"resolved\": \"https://registry.npmjs.org/tiny-inflate/-/tiny-inflate-1.0.3.tgz\",\n      \"integrity\": \"sha512-pkY1fj1cKHb2seWDy0B16HeWyczlJA9/WW3u3c4z/NiWDsO3DOU5D7nhTLE9CF0yXv/QZFY7sEJmj24dK+Rrqw==\",\n      \"dev\": true\n    }\n  }\n}\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.548828125,
          "content": "{\n  \"name\": \"bootstra.386\",\n  \"version\": \"1.0.0\",\n  \"description\": \"This is only for keeping track of the package management ... \",\n  \"scripts\": {\n    \"test\": \"echo \\\"Error: no test specified\\\" && exit 1\"\n  },\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/kristopolous/BOOTSTRA.386.git\"\n  },\n  \"author\": \"\",\n  \"license\": \"ISC\",\n  \"bugs\": {\n    \"url\": \"https://github.com/kristopolous/BOOTSTRA.386/issues\"\n  },\n  \"homepage\": \"https://github.com/kristopolous/BOOTSTRA.386#readme\",\n  \"devDependencies\": {\n    \"text-to-svg\": \"^3.1.5\"\n  }\n}\n"
        },
        {
          "name": "promo",
          "type": "tree",
          "content": null
        },
        {
          "name": "update-icons.sh",
          "type": "blob",
          "size": 0.1396484375,
          "content": "#!/bin/sh\npath=${1:-v4.4.1/site/docs/4.4/dist/fonts/ site/fonts/}\nset -x \nfor i in $path; do\n  [ -d $i ] || mkdir -p $i\n\t./icon-gen.js $i\ndone\n"
        },
        {
          "name": "v2.3.1",
          "type": "tree",
          "content": null
        },
        {
          "name": "v3.3.2",
          "type": "tree",
          "content": null
        },
        {
          "name": "v4.4.1",
          "type": "tree",
          "content": null
        },
        {
          "name": "v5.3.1",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}