{
  "metadata": {
    "timestamp": 1736709535572,
    "page": 44,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "github/personal-website",
      "stars": 7468,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.064453125,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0615234375,
          "content": "*.gem\n.bundle\n.sass-cache\n_site/\nGemfile.lock\n**/.ruby-version\n"
        },
        {
          "name": "Gemfile",
          "type": "blob",
          "size": 0.1337890625,
          "content": "source 'https://rubygems.org'\ngem 'github-pages', group: :jekyll_plugins\ngem \"jekyll-github-metadata\"\ngem \"jekyll-octicons\"\ngem \"jemoji\"\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 1.0478515625,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2019 GitHub\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.9423828125,
          "content": "# Get started building your personal website\n\n### Showcase your software development skills\n\nThis repository gives you the code you'll need to kickstart a personal website that showcases your work as a software developer. And when you manage the code in a GitHub repository, it will automatically render a webpage with the owner's profile information, including a photo, bio, and repositories.\n\nYour personal website is waiting to be personalized, though. It includes space to highlight your specific areas of interest in software development, like languages or industries. And it's standing by to publish your next great blog post.\n\nIt's all possible using the combination of [Jekyll](https://jekyllrb.com/docs/) (for building your website), [GitHub Pages](https://pages.github.com/) (for hosting your website), and [GitHub's API](https://developer.github.com/v3/) (for automatically populating your website with content).\n\n![](https://user-images.githubusercontent.com/221550/110506678-51906280-80cd-11eb-803a-c41984bd9312.png)\n\n## Installation\n\n### Fork the `github/personal-website` repo\n\nYou'll be making your own copy of the \"personal website starter\" repository so you have your own project to customize. A \"fork\" is a copy of a repository. So select \"Fork\" atop [the `github/personal-website` repository](https://github.com/github/personal-website).\n\nOnce you've found a home for your forked repository, it's yours. You're the owner, so you're ready to publish, if you wish.\n\n### Install in your local development environment\n\nIf you want to manage your website in a local web development environment, you'll be using [Ruby](https://jekyllrb.com/docs/installation/).\n\nOnce you've found a home for your forked repository, **[clone it](https://help.github.com/articles/cloning-a-repository/)**.\n\n#### Install Jekyll\n\nJekyll is a [Ruby Gem](https://jekyllrb.com/docs/ruby-101/#gems) that can be installed on most systems.\n\n1. Install a full [Ruby development environment](https://jekyllrb.com/docs/installation/)\n2. Install Jekyll and [bundler](https://jekyllrb.com/docs/ruby-101/#bundler) [gems](https://jekyllrb.com/docs/ruby-101/#gems)\n```\ngem install jekyll bundler\n```\n3. Change into your new directory\n```\ncd personal-website\n```\n4. Install missing gems\n```\nbundle install\n```\n5. Build the site and make it available on a local server\n```\nbundle exec jekyll serve\n```\n\nYou should see something like:\n\n```\nConfiguration file: /octocat/personal-website/_config.yml\n            Source: /octocat/personal-website\n       Destination: /octocat/_site\n Incremental build: disabled. Enable with --incremental\n      Generating...\n   GitHub Metadata: No GitHub API authentication could be found. Some fields may be missing or have incorrect data.\n                    done in 14.729 seconds.\n Auto-regeneration: enabled for '/octocat/personal-website'\n    Server address: http://127.0.0.1:4000\n  Server running... press ctrl-c to stop.\n```\n\nDon't worry about the \"No GitHub API authentication could be found\" message. [API authentication is only necessary](https://github.com/jekyll/github-metadata/blob/master/docs/authentication.md) if you intend to display more detailed metadata, like a branch name.\n\n6. Now browse to [http://localhost:4000](http://localhost:4000)\n\n### Publish\n\nWhen you host your personal website's code on GitHub, you get the support of free hosting through GitHub Pages.\n\n**The fastest approach** is to rename your repository `username.github.io`, where `username` is your GitHub username (or organization name). Then, the next time you push any changes to your repository's `master` branch, they'll be accessible on the web at your `username.github.io` address.\n\n**If you want to use a custom domain**, you'll want to add it to your repository's \"Custom domain\" settings on github.com. And then register and/or [configure your domain with a DNS provider](https://help.github.com/articles/quick-start-setting-up-a-custom-domain/).\n\n## Customization\n\nIt's your website, and you control the source code. So you can customize everything, if you like. But we've provided a handful of quick customizations for you to consider as you get your website off the ground.\n\n### Quick configuration changes\n\nMost customizations can be done in a matter of seconds, by revising your repository's `_config.yml` file. Just remember to restart your local server each time you save new changes so your Jekyll-powered website rebuilds correctly:\n\n1. Shut down your server by entering the keyboard command <kbd>CTRL</kbd>+<kbd>c</kbd>\n2. Restart your server: `bundle exec jekyll serve`\n\n\n#### Layout\n\nYour website will display in a two-column layout by default on larger-screen devices, with your photo, name, and basic information displayed in a left-aligned \"sidebar.\" You can quickly switch to a \"stacked\" single-column layout by changing the line in your `_config.yml` file that reads `layout: sidebar` to `layout: stacked`.\n\n#### Style\n\nYour website appears with a \"light\" white and gray background by default, with dark text. You can quickly switch to a \"dark\" background with white text by changing the line in your `_config.yml` file that reads `style: light` to `style: dark`.\n\n#### Projects\n\nThe \"My Projects\" section of your website is generated by default with your nine most recently \"pushed\" repositories. It also excludes repositories that you forked, by default. But each of these parameters can be quickly customized in your repository's `_config.yml` file, under the `projects` dictionary line.\n\nParameters include:\n\n- `sort_by`: The method by which repositories are sorted. Options include `pushed` and `stars`.\n- `limit`: The maximum number of repositories that will be displayed in the \"My Projects\" section of your website. Out of the box, this number is set to `9`.\n- `exclude`:\n   - `forks`: When `true`, repositories you've forked will be excluded from the listing.\n   - `projects`: A list the repository names you want to exclude from the listing.\n\n#### Topics\n\nYour website comes pre-configured with three topics (e.g. \"Web design\" and \"Sass\") that appear in a section titled \"My Interests.\" These are also stored in your repository's `_config.yml` file, where you can define each topic's name and two other optional details:\n\n- `web_url`: The web address you'd like to your topic to link to (e.g. `https://github.com/topics/sass`).\n- `image_url`: The web address of an (ideally square) image that you'd like to appear with your topic.\n\n#### Social media\n\nYour website supports linking and sharing to social media services you're using, including Behance, Dribbble, Facebook, LinkedIn, Medium, Stack Overflow, Twitter, and YouTube. To identify the services you use:\n\n1. Edit your repository's `_config.yml` file.\n2. Edit the `social_media` dictionary line, and represent the services you like in a simple `key: value` form:\n\n```\nsocial_media:\n  behance: your_username\n  dribbble: your_username  \n  facebook: your_username\n  hackerrank: your_username\n  instagram: your_username\n  keybase: your_username\n  linkedin: your_username\n  medium: your_username\n  stackoverflow: your_user_id\n  telegram: your_username\n  twitter: your_username\n  unsplash: your_username\n  vk: your_username\n  website: http://your_website_url\n  youtube: your_username\n```\n\nLinks to your profile for each of the services you define will appear in the `<header>` of your website, appended to your bio. And if those services support sharing, any blog posts that you publish will include links to share that post using each social media service.\n\n**Note**: This feature is supported by two files in your repository:\n\n- `/_data/social_media.yml`: Defines each of the supported services, including variable name, display name, URL path, and SVG icon.\n- `/_includes/social_media_share_url.html`: Outputs the share URL required for any of the supported social media services that support sharing URLs.\n\nIf you're interested in adding a social media service that's not already supported in this repo, you can edit these two files to build that support.\n\n## Adding pages\n\nTo **add a page** to your website (e.g. detailed resume):\n\n1. Create a new `.html` or `.md` file at the root of your repository.\n2. Give it a filename that you want to be used in the page's URL (e.g. `http://yoursite.dev/filename`).\n3. At the start of your file, include the following [front matter](https://jekyllrb.com/docs/front-matter/):\n\n```\n---\nlayout: default\n---\n```\n\n## Adding blog posts\n\nTo **add a blog post** to your website:\n\n1. Create a new `.md` file in your repository's `/_posts/` directory.\n2. Give it a filename using the following format:\n\n```\nYEAR-MONTH-DAY-title.MARKUP\n```\n\n3. At the start of your file, include the following [front matter](https://jekyllrb.com/docs/front-matter/):\n\n```\n---\ntitle: \"The title of my blog post\"\n---\n```\n\nYour website comes with a placeholder blog post that you can reference. Notably, its [front matter](https://jekyllrb.com/docs/front-matter/) declares `published` as `false`, so that it won't appear on your website.\n\nWhile you can define a `layout` in the front matter, your website is pre-configured to assign the `post` layout to all of the posts in your `/_posts/` directory. So you don't have to declare that in your posts.\n\nJekyll's conventions for authoring and managing blog posts is very flexible. You can [learn more in Jekyll's documentation for \"Posts.\"](https://jekyllrb.com/docs/posts/)\n\n## Content and templates\n\nTo give you a sound foundation to start your personal website, your repository includes a handful of \"includes\" -- dynamic `.html` files that are re-used throughout your website. They're all stored in the `/_includes/` directory.\n\nThere are the usual suspects, like `header.html` and `footer.html`. But there are few more worth pointing out:\n\n- `interests.html`: A heading and dynamic list of \"My Interests,\" which is populated with the [topics](#topics) you list in your `_config.yml`.\n- `masthead.html`: A collection of your avatar, name, bio, and other metadata that's displayed prominently on all your webpages to help identify what the website is about.\n- `post-card.html`: A compact, summarized presentation of a blog post, re-used to display a listing of your latest blog posts.\n- `projects.html`: A heading and dynamic list of \"My Projects,\" which is populated with a listing of your newest GitHub repositories.\n- `repo-card.html`: A compact, summarized presentation of a repository, re-used to display a listing of your GitHub repositories.\n- `thoughts.html`: A heading and dynamic list of \"My Thoughts,\" which is populated with a listing of your latest blog posts.\n- `topic-card.html`: A compact, summarized presentation of a topic (defined in your `_config.yml`), re-used to display a listing of your interests.\n\n### Layouts\n\nYour repository comes with three layouts:\n\n- **default**: Not used by any of the built-in pages or posts, but useful for any new pages you create.\n- **home**: Used by your `index.html` homepage to display listings of your projects, interests, and (optionally) your blog posts.\n- **post**: Used by default by the posts in your `/_posts/` directory.\n\nJekyll's convention for defining layouts is very flexible. You can [learn more about customizing your layouts in the Jekyll \"Layouts\" docs.](https://jekyllrb.com/docs/layouts/)\n\n## Styles\n\nYour website is pre-configured to use [GitHub's very flexible CSS framework called \"Primer,\"](https://styleguide.github.com/primer/). It's currently referenced within your `styles.scss` file, using the CSS import at-rule:\n\n```\n@import url('https://unpkg.com/primer/build/build.css');\n```\n\nYou are, of course, welcome to remove it or replace it with another framework. Just bear in mind that the HTML that your website came pre-packaged with references multiple Primer \"utility classes\" to define things like column widths, margins, and background colors.\n\nYou also have the option to add on to and extend Primer's styles by adding custom CSS to your `/assets/styles.scss` Sass stylesheet. By editing this file, you can customize your website's color scheme, typography, and more.\n\n\n## License\n\nThe theme is available as open source under the terms of the [MIT License](https://opensource.org/licenses/MIT).\n"
        },
        {
          "name": "_config.yml",
          "type": "blob",
          "size": 1.2890625,
          "content": "layout: sidebar\nstyle: light\n\nplugins:\n  - jekyll-octicons\n  - jekyll-github-metadata\n  - jemoji\n\npermalink: /:year/:month/:day/:title/\n\ndefaults:\n  -\n    scope:\n      path: \"\" # an empty string here means all files in the project\n      type: \"posts\"\n    values:\n      layout: \"post\"\n\nprojects:\n  sort_by: pushed\n  # sort_by options:\n  #   - pushed\n  #   - stars\n  limit: 9\n  exclude:\n    archived: false\n    forks: true\n    projects:\n    # - repo-name\n\n# social_media:\n  # behance: your_username\n  # dribbble: your_username\n  # facebook: your_username\n  # hackerrank: your_username\n  # instagram: your_username\n  # keybase: your_username\n  # linkedin: your_username\n  # mastodon: your_username\n  # medium: your_username\n  # stackoverflow: your_user_id\n  # telegram: your_username\n  # twitter: your_username\n  # unsplash: your_username\n  # vk: your_username\n  # website: http://your_website_url\n  # youtube: your_username\n\ntopics:\n  - name: CSS\n    web_url: https://github.com/topics/css\n    image_url: https://raw.githubusercontent.com/github/explore/6c6508f34230f0ac0d49e847a326429eefbfc030/topics/css/css.png\n\n  - name: Web design\n\n  - name: Sass\n    web_url: https://github.com/topics/sass\n    image_url: https://raw.githubusercontent.com/github/explore/6c6508f34230f0ac0d49e847a326429eefbfc030/topics/sass/sass.png\n"
        },
        {
          "name": "_data",
          "type": "tree",
          "content": null
        },
        {
          "name": "_includes",
          "type": "tree",
          "content": null
        },
        {
          "name": "_layouts",
          "type": "tree",
          "content": null
        },
        {
          "name": "_posts",
          "type": "tree",
          "content": null
        },
        {
          "name": "_sass",
          "type": "tree",
          "content": null
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "favicon.ico",
          "type": "blob",
          "size": 6.365234375,
          "content": null
        },
        {
          "name": "index.html",
          "type": "blob",
          "size": 0.0205078125,
          "content": "---\nlayout: home\n---\n"
        }
      ]
    }
  ]
}