{
  "metadata": {
    "timestamp": 1736710401203,
    "page": 23,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "HandBrake/HandBrake",
      "stars": 18472,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.71875,
          "content": "# Visual Studio\nwin/CS/*/bin\nwin/CS/*/obj\nwin/CS/.vs\nwin/CS/**/*.suo\nwin/CS/*.VC.opendb\nwin/CS/*.VC.db\nwin/CS/**/*.Cache\nwin/CS/**/*.user\nwin/CS/packages/**/*\nwin/CS/**/applicationhost.config\nwin/CS/HandBrakeAppX/win32/**/*\nwin/CS/HandBrakeAppX/bld/**/*\nwin/CS/HandBrakeAppX/AppPackages/**/*\nwin/CS/HandBrakeAppX/BundleArtifacts/**/*\n*.ide\nwin/CS/*.DotSettings\n\n# Xcode\nmacosx/**/xcuserdata\nmacosx/**/xcshareddata/IDEWorkspaceChecks.plist\n\n# Build system\nbuild/\nbuild.*/\ndownload/\n\n# Gtk\ngtk/ABOUT-NLS\ngtk/Makefile.in*\ngtk/src/Makefile.in*\ngtk/aclocal.m4\ngtk/autom4te.cache\ngtk/compile\ngtk/config.*\ngtk/configure\ngtk/configure~\ngtk/depcomp\ngtk/install-sh\ngtk/ltmain.sh\ngtk/m4\ngtk/missing\ngtk/po/Makevars.template\ngtk/po/*.gmo\ngtk/po/*~\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "AUTHORS.markdown",
          "type": "blob",
          "size": 3.5830078125,
          "content": "# HandBrake Authors\n\nEric Petit (titer)\n\n- Original author\n- Core construct, multithreading, and BeOS/OS X/Linux ports\n- MPEG demuxer\n- MPEG-2, AC3, and MPGA decoders using libmpeg2, liba52, and libavcodec\n- LPCM \"decoder\"\n- MPEG-4, MP3, and AAC encoders using libavcodec, libxvidcore, libmp3lame, and libfaac\n- AC-3 pass-through\n- AVI muxer\n- MP4 muxer using libmp4v2\n- BeOS interface\n- OS X interface\n- French translation\n\nLaurent Aimar (fenrir)\n\n- H.264 and Vorbis encoders using libx264 and libvorbis\n- OGG/OGM muxer using libogg\n- GTK2 interface\n- wxWidgets interface\n\nVan Jacobson (van)\n\n- Universal input architecture\n- MPEG Standard Target Decoder timing model\n- Auto-typing MPEG stream files\n- Minor bug fixing in MPEG stream support\n- Minor DVD reader fixes\n- Chapter mark bug fixes\n\nJohn Allen (johnallen)\n\n- Core enhancements\n- Threading enhancements\n- Simplified Mac OS X GUI\n\nJoe Crain (dynaflash)\n\n- Mac OS X GUI enhancements/rewrite\n\nDamiano Galassi (ritsuka)\n\n- macOS GUI\n- macOS sandbox and hardened runtime support\n- Improved color spaces support\n- Various libhb fixes and enhancements\n\nEdward Groenendaal (eddyg)\n\n- Major bug fixes\n- Subtitle scan & color\n- Performance improvements\n\nDavid Foster (davidfstr)\n\n- Subtitles from file inputs\n- SSA subtitle support\n\nRodney Hester (rhester)\n\n- iPod firmware 1.2+ 640x480 MPEG-4/H.264 support\n\nAndrew Kimpton (awk)\n\n- MPEG Audio fixes\n- MPEG Stream Support\n\nChris Lee (clee)\n\n- PAR/anamorphic support\n- dvdread enhancements\n- Linux GUI\n\nChris Long (chrislong)\n\n- iPod firmware 1.2+ 640x480 MPEG-4/H.264 support\n\nBrian Mario (brianmario)\n\n- Windows GUI\n\nMaurj (maurj)\n\n- Dolby Surround and Dolby Pro Logic II mixdowns\n- 6-channel AAC audio from 5.1 source\n- Mono AAC audio from mono source\n- PAR/anamorphic support in MP4 file format\n- Chapter markers in MP4 file format\n- Mac OS X GUI enhancements\n- Support for DTS audio sources\n\nMirkwood (mirkwood)\n\n- Windows CLI port\n\nNyx (Nyx)\n\n- Frame reordering and flushing in MP4\n\nPhilippe Rigaux (prigaux)\n\n- 3rd party library integration\n- Mac OS X GUI enhancements\n- PAR/anamorphic support\n- Universal binary build process\n- Conversion from jam to make for compiles\n\nJonathon Rubin (jbrjake)\n\n- Massive core enhancements\n- Significant improvements to H.264 support\n\nScott (s55)\n\n- Windows GUI\n- UI concepts and design\n- Hardware acceleration\n- Devops and infrastructure\n- Online documentation\n\nJohn Stebbins (j45)\n\n- GTK GUI\n- TrueHD demuxing\n- libavcodec video encoding quality enhancements\n- Libhb architecture improvements, JSON API\n- Stream and sync improvements\n- Flatpak support\n- Numerous bug fixes and enhancements\n\nChris Thoman (huevos_rancheros)\n\n- Ported video filters from libmpcodec\n\nMark Krenek (travistex)\n\n- Mac OS X GUI enhancements\n- Mac OS X GUI queueing system\n\nKona \"Mike\" Blend (KonaBlend)\n\n- Build system and related guides\n\nDavid Rickard (RandomEngy)\n\n- HandBrake Interop Library\n\nTim Walker (Rodeo)\n\n- Hardware acceleration / Intel QSV\n- Libhb and macOS GUI fixes and enhancements\n- Dependencies support and integration\n- Miscellaneous fixes and enhancements\n\nBradley Sepos (BradleyS)\n\n- Build system and toolchains\n- Dependencies, platform, and device testing\n- NLMeans denoiser and other filters\n- UI concepts and design\n- Official presets\n- Online documentation\n\nMaxym Dm (maxim_d33)\n\n- Hardware acceleration / Intel QSV\n- Miscellaneous fixes and enhancements\n\nSimon L (Nomis101)\n\n- Internationalization / UI translations lead\n- Build system and toolchains fixes and enhancements\n- Miscellaneous fixes and enhancements\n\nArtem Galin (agalin89)\n\n- Hardware acceleration and presets / Intel QSV\n- Miscellaneous fixes and enhancements\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.7197265625,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as contributors and maintainers pledge to making participation in our project and our community a harassment-free experience for everyone, regardless of age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment include:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or advances\n* Trolling, insulting/derogatory/hateful comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a professional setting\n* Posting content which is illegal or of dubious legality. (This includes but is not limited to: illegally obtained copyrighted content, circumventing Digital Rights Management etc)\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces when an individual is representing the project or its community. Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event. Representation of a project may be further defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team via our [Report - Contact Us](https://handbrake.fr/report.php) page. The project team will review and investigate all complaints, and will respond in a way that it deems appropriate to the circumstances. The project team is obligated to maintain confidentiality with regard to the reporter of an incident. Further details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project's leadership.\n\n## Disclaimer\nThis is a volunteer driven project, as such, it is not possible for us to read and moderate every post in the community. If you see a post that violates our community code of conduct or is inappropriate, you can help us by reporting it. We will do our best to resolve this as soon as possible but an immediate response is not always possible.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4, available at [http://contributor-covenant.org/version/1/4][version]\n\n[homepage]: http://contributor-covenant.org\n[version]: http://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.373046875,
          "content": "## Contributing\n\nWe welcome most contributions. While it is our goal to allow everyone to contribute, contributions not meeting the project's goals or standards may be rejected. \n\nPlease read our [guide to contributing](https://handbrake.fr/docs/en/latest/contributing/contribute.html). This will provide you with all the information you need to start contributing to the project. \n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.66796875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.193359375,
          "content": "HandBrake License\n\nMost files in HandBrake are under the GNU General Public License Version 2\n(GPLv2) license; read the file COPYING for details.\n\nSome files are under the GNU General Public License Version 2 or any later\nversion (GPLv2+), the GNU Lesser General Public License Version 2.1 or any later\nversion (LGPLv2.1+), or BSD/MIT/X11-style licenses. \n\nIn any case, a compiled HandBrake build is licensed under GPLv2 \nand the terms of that license take effect. \n\nThe Fraunhofer AAC library (fdk-aac) is under a license incompatible with the\nGPLv2 license. Since both licenses cannot be satisfied simultaneously, binaries\nresulting from the combination of HandBrake and fdk-aac are neither free nor\nredistributable. As a result, fdk-aac is by default not included in HandBrake.\nIf you wish to include fdk-aac in your personal build of HandBrake, you may do\nso by passing --enable-fdk-aac to configure and making sure not to distribute\nany resulting binaries. Please read the fdk-aac license for details.\n\nHandBrake makes use of 3rd party libraries which will be licensed under a GPL-compatible license.\nThese are listed in the THANKS file.\n\nGraphic assets are covered by the license(s) specified in graphics/LICENSE.\n\n\n"
        },
        {
          "name": "NEWS.markdown",
          "type": "blob",
          "size": 125.5009765625,
          "content": "# HandBrake News\n\n\n## Upgrade Notice\n\nBefore updating HandBrake, please make sure there are no pending encodes in the queue, and be sure to make a backup of any custom presets and app preferences you have, as they may not be compatible with newer versions.\n\nWindows users, please make sure to install [Microsoft .NET Desktop Runtime version 8.0](https://dotnet.microsoft.com/en-us/download/dotnet/8.0/runtime)\nDownload available from Microsoft:\n- [For x64 (AMD or Intel CPUs)](https://aka.ms/dotnet/8.0/windowsdesktop-runtime-win-x64.exe)\n- [For Arm64 (Qualcomm or other)](https://aka.ms/dotnet/8.0/windowsdesktop-runtime-win-arm64.exe)\n\n## HandBrake 1.10.0\n\n#### General\n\n- Added new \"Social 10MB\" presets.\n\n### Windows\n\n- Added a new preference \"Default Range Mode for titles\". See Preferences -> Advanced (#6385)\n- Added a new preference to run a custom action when the queue completes. See Preferences -> When Done (#4851)\n- Added \"{destination_folder}\" as option on the \"Encode Completed\" \"Send File To\" option.\n- Updated Auto Naming Preferences to add \"{angle}\" as a filename generation option. (#6086)\n- Minor Performance Optimisations for ARM64 devices running Windows\n- Minor UI improvements throughout the UI. \n- Various bug fixes and improvements. (#6524, #6517, #6514, #6477, #6473, #6086)\n\n\n\n## HandBrake 1.9.0\n\n### All platforms\n\n#### General\n\n- Added Intel QSV VVC (hardware) video decoder\n- Added an option to enable AV1 screen content coding(SCC) on Intel Lunar Lake QSV AV1 encoder\n- Added support for lossless VP9 encoding\n- Added a preference to keep duplicated Blu-ray titles\n- Added support for Max Duration of Scan titles for disc based sources (#6304)\n\n#### Audio\n\n- Added ALAC encoder\n- Added Vorbis passthru\n- Improved scan of DTS audio profiles\n\n#### Subtitles\n\n- Improved quality of subtitles burn-in\n- Fixed a rare video corruption issue that could happen when burning-in subtitles\n\n#### Third-party libraries\n\n- Updated libraries\n  - AMF 1.4.35 (AMD VCN video encoding)\n  - FFmpeg 7.1 (decoding and filters)\n  - FreeType 2.13.3 (subtitles)\n  - Fribidi 1.0.16 (subtitles)\n  - HarfBuzz 10.1.0 (subtitles)\n  - libdav1d 1.5.0 (AV1 video decoding)\n  - libdovi 3.3.1 (Dolby Vision dynamic metadata)\n  - libjpeg-turbo 3.0.4 (preview image compression)\n  - libvpx 1.15.0 (VP8/VP9 video encoding)\n  - nv-codec-headers 12.2.72.0 (Nvidia NVENC encoding)\n  - oneVPL 2.13.0 (Intel QSV video encoding/decoding)\n  - SVT-AV1 2.3.0 (AV1 video encoding)\n  - x265 4.1 (H.265/HEVC video encoding)\n\n### Linux\n\n- Fixed the Power Save option to pause the encodes only when enabled\n- Fixed the queue being stopped when removing completed items\n- Fixed chapters names not being saved properly\n- Fixed various issues related to presets\n- Updated existing translations\n\n### Mac\n\n- Add Range Limit controls to the \"Add to Queue\" selection window (#4146)\n- Fixed an issue that could cause corrupted video when using VideoToolbox HEVC multi-pass\n- Miscellaneous bug fixes and improvements\n- Updated existing translations\n- Added new translations\n  - Swedish (Svenska)\n\n### Windows\n\n- Added Range Limit controls to the \"Add to Queue\" \"Add Selection\" window (#4146)\n- Added support for DirectX based video decoding when using the Media Foundation encoder on ARM devices\n- Added support for the AV1 Media Foundation encoder on ARM devices\n- Added a \"Start Later\" option to the Queue Window.\n- Performance Improvements in the filter pipeline for ARM devices.\n- Miscellaneous bug fixes and improvements\n- Updated existing translations\n- Added new translations\n  - Swedish (Svenska)\n\n\n## HandBrake 1.8.2\n\n### All platforms\n\n#### General\n\n- Fixed a potential crash when trying to scan deleted files\n- Fixed scan of broken video that uses reserved color matrix values\n- Fixed an issue that could cause some audio tracks to be dropped\n\n#### Third-party libraries\n\n- Updated libraries\n  - FFmpeg 7.0.2 (decoding and filters)\n  - libass 0.17.3 (subtitles)\n  - libvpx 1.14.1 (VP8/VP9 video encoding)\n\n### Windows\n\n- Fixed an issue where auto name wasn't triggering correctly with preset changes (#6159)\n- Fixed a potential crash when importing presets from the mac version. (#6186)\n- Fixed an issue loading presets where a video encode isn't available on the system. (#6184)\n- Minor startup performance improvement on some Intel based systems.\n\n### Linux\n\n- Fixed an issue where an encoded file could be output to the wrong filename when using the queue (#6067)\n\n\n## HandBrake 1.8.1\n\n### All platforms\n\n#### Video\n\n- Fixed a warning / misconfiguration when repeat-headers is used with the x265 encoder.(#6061)\n- Fixed an issue where the NVEnc encoder ignored the level option\n\n#### Subtitles\n\n- Fixed an issue where dvd subtitles could be corrupted during rendering.\n\n#### Filters\n\n- Fixed an issue that caused video artefacts to occur when using the eedi2 filter (#6073)\n\n#### Third-party libraries\n\n- Updated libraries\n  - FFmpeg 7.0.1 (decoding and filters)\n  - libdav1d 1.4.3 (AV1 video decoding)\n\n### Mac\n\n- Fixed a stall in the queue that could happen if the encoding process crashes when configuring a job\n- Removed the \"Show\" button from the notifications when there is nothing to show\n\n### Windows\n\n- Hardware decoding is now defaulted to off for new installations. Users can opt-in whilst making sure they are running up-to-date drivers\n- Fixed an issue where hardware decoding could erroneously be used for previews\n- Fixed an issue where auto name was triggering too aggressively (#6079)\n- Removed an erroneous error message when dragging files onto the main window that include a subtitle file.(#6065)\n\n\n## HandBrake 1.8.0\n\n### All platforms\n\n#### General\n\n- Allowed muxing VP9 and FLAC in the MP4 container\n- Removed timestamp jitters when using a constant NTSC frame rate in the MP4 container\n- Removed support for importing legacy plist based presets from much older versions of HandBrake\n- Updated iso639 language codes list\n\n#### Video\n\n- Added support for the FFV1 encoder, including a new preset \"Preservation FFV1\" under the Professional category\n- Added support for multi-pass CQ with VP9\n- Added support for VP9 tunes\n- Added Dolby Vision dynamic metadata pass through for SVT-AV1\n- Improved Decomb speed by removing unneeded frame copies\n- Improved Framerate Shaper metrics for high depth frames\n\n#### Command line interface\n\n- Fixed subtitle \"scan\" when not first in --subtitle list\n- Fixed override of subtitle settings\n- Fixed processing audio overrides to preset\n\n#### Audio\n\n- Added TrueHD encoder\n- Added 88.2/96/176.4/192 kHz sample rates for TrueHD and FLAC encoders\n- Improved audio tracks selection by tracking \"linked\" audio tracks\n- Fixed incorrect channel layout when encoding a 6.1 track to Opus\n\n#### Subtitles\n\n- Fixed passthru of VobSub tracks that contains empty of fully transparent subtitles samples\n- Fixed an issue that prevented decoding VobSub tracks stored inside MP4\n- Fixed burn-in of SSA/ASS subtitles inside MKV that have duplicated Read Orders\n\n#### Build system\n\n- Reviewed and improved compiler optimization options for the third-party libraries\n- Improved libdovi package to make it possible to ship it in Flathub flatpak version\n\n#### Third-party libraries\n\n- Updated libraries\n  - AMF 1.4.33 (AMD VCN video encoding)\n  - FFmpeg 7.0 (decoding and filters)\n  - HarfBuzz 8.4.0 (subtitles)\n  - libass 0.17.2 (subtitles)\n  - libdav1d 1.4.1 (AV1 video decoding)\n  - libdovi 3.3.0 (Dolby Vision dynamic metadata)\n  - libopus 1.5.2 (Opus audio encoding)\n  - libjpeg-turbo 3.0.3 (preview image compression)\n  - libvpx 1.14.0 (VP8/VP9 video encoding)\n  - oneVPL 2.10.1 (Intel QSV video encoding/decoding)\n  - SVT-AV1 2.1.0 (AV1 video encoding)\n  - x264 164 r3186 (H.264/AVC video encoding)\n  - x265 3.6 (H.265/HEVC video encoding)\n  - zlib 1.3.1 (general)\n- Removed libraries\n  - libxml2\n  \n### Linux\n\n- Migrated the UI to GTK 4\n- Added support for resursive file scan\n- Added support for drag/drop/multi-file scanning. (Including subtitle files)\n- Added --clear-queue and --auto-start-queue flags to the linux ui app.\n- Update the \"Open Source\" button to make the folder/batch mode more discoverable. \n- Refreshed app icons\n- Miscellaneous bug fixes and improvements\n- Updated existing translations\n\n### Mac\n\n- Added Dolby Vision and HDR10+ dynamic metadata pass through for VideoToolbox H.265 10-bit\n- Added Metal accelerated Comb Detect and Framerate Shaper filters\n- Added ability to drag and drop SRT and ASS subtitles files onto the main window\n- Added support for excluding file extensions when opening files in batch mode\n  - Default exclusions are common image, subtitles, and text file extensions; edit list in Preferences > Advanced\n- Added new preference to pause encodes when switching to battery\n- Added new preference to clear completed jobs at launch option\n- Reworked notification options to allow per encode or per queue control\n- Reworked toolbar to follow macOS UI style\n- Improved performance of the Activity Log window\n- Improved UI performances by avoiding uneeded window resizes and slow AppKit controls\n- Miscellaneous bug fixes and improvements\n- Updated existing translations\n- Added new translations\n  - Ukrainian\n\n### Windows\n\n- Requires Microsoft .NET Desktop Runtime 8.0.x\n- Added Invert Queue option to the Add to Queue Window (#5741)\n- Drag/Drop now supports resursive folder scan mode.\n- Miscellaneous bug fixes and improvements\n- Updated existing translations\n- Added new translations\n  - Catalan (Català)\n\n\n## HandBrake 1.7.3\n\n### All platforms\n\n#### General\n\n- Fixed formatting leading zeros for timestamps in logs\n- Miscellaneous bug fixes and improvements\n\n#### Video\n\n- Fixed an issue that could potentially cause incorrect detection of source FPS value (#5677)\n\n#### Subtitles\n\n- Fixed tx3g to SSA subtitles conversion\n\n### Linux\n\n- Fixed the \"All Files\" open file dialog filter to really show all files\n- Fixed an issue where adding a new default audio track automatically set the gain to -20 dB\n\n### macOS\n\n- Fixed a regression introduced in HandBrake 1.7.2 by the workaround for VideoToolbox crashes on Sonoma\n- Miscellaneous bug fixes and improvements\n\n### Windows\n\n- Improved security hardening of loading of DLL files within libhb by limiting search scope (#5724)\n- Improved keyboard navigation on Chapters tab (#5679)\n- Fixed an issue that could cause encodes to appear stalled when process isolation is turned on\n- Fixed an issue that could prevent QSV decode from being used when a system also has a non-Intel GPU\n- Fixed an issue where the drive label was not always correctly detected (#5711)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.7.2\n\n### All platforms\n\n#### Video\n\n- Improved automatic selection of Dolby Vision Level\n- Fixed an issue in AMD VCN, MPEG-2, MPEG-4, NVIDIA NVENC, and VP9 encoders that could cause the creation of an excessive number of keyframes (#5530)\n- Fixed unintentional automatic pass through of closed caption side data when using NVIDIA NVENC encoder\n- Miscellaneous bug fixes and improvements\n\n### Linux\n\n- Improved performance by removing duplicate graphic assets and reducing file size\n- Fixed Flatpak file chooser opening home directory instead of the previously selected directory\n- Fixed last item in the queue sometimes having the wrong destination path\n- Fixed some memory leaks in the graphical interface\n\n### Mac\n\n- Added a workaround to prevent a system crash when using VideoToolbox encoders with macOS 14 Sonoma on Apple Silicon Ultra\n- Added a workaround to prevent issues decoding H.264 video by disabling VideoToolbox hardware decoding for Level 6.1 and 6.2\n- Fixed a crash opening an empty folder\n\n### Windows\n\n- Added Automation Properties to some controls on the audio tab to assist screen readers\n- Fixed NVIDIA NVDEC option being ignored (#5569)\n- Fixed startup crash related to theme loading (#5567)\n- Fixed subtitle language order not being honoured (#5590)\n\n\n## HandBrake 1.7.1\n\n### All platforms\n\n#### Video\n\n- Fixed Decomb filter producing corrupted frames with 10-bit depth or higher source (#5518)\n- Fixed a potential crash when using the Comb Detect filter on an RGB source\n- Fixed Intel QSV devices enumeration where devices from other vendors are present (#5317, #5177)\n\n#### Mac\n\n- Fixed an issue opening EyeTV sources (#5514)\n\n\n## HandBrake 1.7.0\n\n### All platforms\n\n#### General\n\n- Added Apple VideoToolbox hardware presets\n- Updated Creator presets\n  - Disabled interlacing detection and removal; assume creators are working with progressive sources by default\n- Updated Social presets\n  - Target higher quality and frame rate over shorter durations, without interlacing detection and removal\n  - Better suited for modern social sharing of short live action clips and screen/game captures\n- Removed Email presets in favor of revised Social presets\n  - Please stop sending videos via email or use the new Social presets\n- Miscellaneous bug fixes and improvements\n\n#### Video\n\n- Added AMD VCN AV1 encoder\n- Added NVIDIA NVENC AV1 encoder\n- Added support for SVT-AV1 multi-pass ABR mode\n- Added support for preserving ambient viewing enviroment metadata\n- Added QSV Rotate and Format filters\n- Improved performance on arm64 / aarch64 / Apple Silicon architectures\n  - Latest FFmpeg provides faster HEVC decoding, 30% faster bwdif filter\n  - New SVT-AV1 assembly optimizations provide up to 4x increase in performance\n- Improved video conversion speed by removing unneeded frame copies for better memory efficiency\n- Improved Dolby Vision dynamic range metadata pass through\n  - Supported encoders: x265 10-bit\n  - Supported profiles and cross-compatibility IDs: 8.4, 8.1, 7.6 (base layer only, converted to 8.1), 5.0\n- Improved HDR10+ dynamic range metadata pass through\n  - Supported encoders: x265 10-bit, SVT-AV1\n- Improved QSV support on Linux (#4958)\n- Updated NVENC to not use multi-pass by default; user configurable advanced option\n- Renamed 2-pass encode option to multi-pass (#5019)\n- Fixed Intel QSV encoder outputting green video in some cases (#4842, #4876)\n- Fixed pixel format conversion slightly altering colors when using a 10-bit hardware encoder (#5011)\n- Fixed scan failures by using swscale instead of zscale when source resolution is not mod 2\n- Fixed incorrect PAR when reading from an anamorphic AV1 video track\n- Removed an artificial bitrate limit on VP9 CQ mode\n\n#### Command line interface\n\n- Renamed `--two-pass` to `--multi-pass` and `--no-two-pass` to `--no-multi-pass`, removed `-2` (#5019)\n- Fixed automatic cropping enabled despite using preset with cropping disabled (#5055)\n\n#### Audio\n\n- Fixed low volume level when downmixing ac3 and eac3\n- Fixed left-only and right-only mono mixdowns (#3533, #5054)\n\n#### Subtitles\n\n- Fixed locale settings potentially causing incorrect decimal separator in SSA headers\n- Fixed a potential issue affecting zero-duration subtitles\n\n#### Build system\n\n- Added Meson build system for the Linux GUI\n\n#### Third-party libraries\n\n- New libraries\n  - libdovi 3.2.0 (Dolby Vision dynamic range metadata)\n- Updated libraries\n  - AMF 1.4.30 (AMD VCN video encoding)\n  - FFmpeg 6.1 (decoding and filters)\n  - FreeType 2.13.2 (subtitles)\n  - Fribidi 1.0.13 (subtitles)\n  - HarfBuzz 8.2.2 (subtitles)\n  - libass 0.17.1 (subtitles)\n  - libdav1d 1.3.0 (AV1 video decoding)\n  - liblzma (xz) 5.4.5 (LZMA video decoding, e.g. TIFF)\n  - libopus 1.4 (Opus audio encoding)\n  - libjpeg-turbo 3.0.1 (preview image compression)\n  - libvpx 1.13.1 (VP8/VP9 video encoding)\n  - libxml 2.11.5 (general)\n  - oneVPL 2023.3.1 (Intel QSV video encoding/decoding)\n  - SVT-AV1 1.7 (AV1 video encoding)\n  - x264 164 r3107 (H.264/AVC video encoding)\n  - x265 r12776 (H.265/HEVC video encoding)\n  - zimg 3.0.5 (color conversion)\n  - zlib 1.3 (general)\n\n### Linux\n\n- Added drag and drop support for video scanning\n- Added support for native file choosers via xdg-desktop-portal\n- Added Queue > Add All menu option\n- Added XML chapter import and export\n- Added bit depth and HDR information to video summary\n- Added option to pause encoding when switching to battery power or when power save mode is activated\n- Added automatic file naming options: {codec} {bit-depth} {width} {height} {modification-date} {modification-time}\n- Updated Queue, Activity, and Presets windows to no longer float on top of the main window\n- Updated existing translations\n- Removed obsolete update checker\n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- Added support for drag and drop of multiple files at once\n- Added support for selecting multiple files at once in the Open Source dialog\n- Added support for recursive folder scanning in the Open Source dialog\n- Added support for VideoToolbox H.265/HEVC, H.264/AVC, ProRes, and VP9 hardware decoders on macOS 13 and later\n  - Enable/disable in the Preferences > Advanced tab always or full path only\n  - Using hardware decoders on modern devices may decrease CPU usage and thus speed up some filters and encoding\n- Added GPU accelerated Crop & Scale, Rotate, Pad, Yadif, Bwdif, Chroma Smooth, Unsharp, Lasharp, Grayscale filters\n- Added \"Same as source\" destination option that automatically sets the destination path to the source path\n- Improved SVT-AV1 encoding performance by up to 4x on Apple Silicon Macs\n- Improved automatic file naming Preferences UI and added new options: {width} {height} {quality_type} {encoder_bit_depth} {modification-time} {modification-date} {codec} {encoder} {encoder_bit_depth} {preset}\n- Improved handling of security scoped bookmarks\n- Fixed Chroma Smooth tune options\n- Fixed Deblock Filter custom string field\n- Fixed an issue that prevented the VideoToolbox \"speed\" preset from being used\n- Fixed the file size display on the queue statistics window when file size info is not available\n- Miscellaneous bug fixes and improvements\n- Added new translations\n  - Korean (한국어)\n  - Bulgarian (Български)\n- Updated existing translations\n\n### Windows\n\n- Added support for drag and drop of multiple files at once\n- Added support for selecting multiple files at once in the Open Source dialog\n- Added support for recursive folder scanning in the Open Source dialog\n  - Enable/disable in Preferences > Advanced\n- Added support for excluding file extensions when opening files in batch mode\n  - Default exclusions are common image, subtitles, and text file extensions; edit list in Preferences > Advanced\n- Improved Preview window native video playback to support most containers and codecs\n  - Modern codec support requires Microsoft Codec Packs from the Microsoft Store\n- Improved automatic file naming Preferences UI and added new options: {width} {height} {quality_type} {encoder_bit_depth} {modification-time} {modification-date} {encoder} {encoder_bit_depth} {preset}\n- Improved Queue window UI to optionally show additional status information on the left progress panel\n- Improved Presets panel\n  - Manage Presets button replaced with a menu of discrete options for quicker access to functionality\n  - Added an option to display the description for the selected preset\n  - Added the ability to clone a preset (create a new preset based on an existing one)\n- Improved Add Selection window to make sorting feature more discoverable\n- Improved Process Isolation reliability\n- Fixed automatic file naming when using physical drive sources (#4859)\n- Fixed Title Specific Scan for physical drive sources (#4921)\n- Fixed an potential issue that could cause an unmodified preset to display as \"modified\" (#4909, #4908)\n- Fixed an potential issue where changes to queue order were not retained (#4922)\n- Fixed an Audio tab issue where using a non-fallback encoder could lead to duplicated tracks (#5012)\n- Fixed an issue where swapping graphics cards might cause hardware presets to be incorrectly shown as disabled\n- Fixed a potential crash on startup related to Windows Notifications Service failures (#5097)\n- Miscellaneous bug fixes and improvements\n- Added new translations\n - Czech (česky) (partially complete)\n - Greek (Ελληνικά) (partially complete)\n - Estonian (Eesti) (partially complete)\n - Basque (Euskara)\n - Finnish (Suomi) (partially complete)\n- Updated existing translations\n\n\n## HandBrake 1.6.1\n\n### All platforms\n\n#### Video\n\n- Fixed a potential decoder issue that could cause desync with audio (#4788, #4789)\n\n#### Command line interface\n\n- Fixed inability to name external subtitles tracks using --subname\n\n### Mac\n\n- Fixed behavior of quality slider when changing encoders\n\n### Linux\n\n- Fixed translations missing updates as part of 1.6.0 (#4790)\n  - Bulgarian (Български)\n  - Corsican (Corsu)\n  - Dutch (Nederlands)\n  - German (Deutsch)\n  - Spanish (Español)\n- Fixed (partially) Intel QSV hardware detection (#4768)\n- Fixed a potential crash when canceling an Intel QSV encode (#4341)\n- Fixed building with -Werror=format-security by adding missing format strings where needed\n\n### Windows\n\n- Fixed quality slider not allowing negative values for encoders supporting them\n- Fixed issues upgrading presets from older versions (#4820)\n- Fixed a potential graphical interface hang when stopping the queue (#4782)\n- Fixed optical disc drives on the source selection pane not scanning correctly (#4771)\n- Fixed erroneous display of 2-pass check box for Intel QSV AV1 encoder (not yet supported) (#4777)\n- Fixed a build configuration issue that broke version 1.6.0 for Windows on arm64\n- Fixed an issue that prevented NVDEC from being available\n- Fixed passthru audio erroneously falling back to encoding (#4795)\n- Fixed the Save New Preset button incorrectly overwriting recently added presets (#4804)\n\n\n## HandBrake 1.6.0\n\n### All platforms\n\n#### General\n\n- Added AV1 video encoding\n- Added high bit depth and color depth support to various encoders and filters\n- Added 4K AV1 General, QSV (Hardware), and MKV (Matroska) presets\n- Added 4K HEVC General presets and updated related presets to use similar encoder settings\n- Revised Web presets and renamed to Creator, Email, and Social\n- Removed VP8 presets\n  - The VP8 video encoder is now deprecated and will be removed in a future release\n  - Related, the Theora encoder is long deprecated and will be removed in a future release\n- Miscellaneous other preset revisions\n\n#### Video\n\n- Added SVT-AV1 (software) and Intel QSV AV1 (hardware) video encoders\n- Added VP9 10-bit encoder\n- Added NVENC HEVC 10-bit encoder\n- Added VCN HEVC 10-bit encoder\n- Added H.264 levels 6, 6.1, and 6.2 for the x264 encoder\n- Added H.264/H.265 4:2:2 and 4:4:4 profiles for the x264 and x265 encoders\n- Added H.265 4:2:2 profile for VideoToolbox encoder on Apple Silicon\n- Added support for Intel Deep Link Hyper Encode (leverage multiple QSV media engines to increase performance)\n- Fixed longstanding issue where slowest NVENC encoder preset caused encoding failures\n- Removed support for Intel CPUs older than 6th generation (Skylake) when using Intel Quick Sync Video\n\n#### Filters\n\n- Added Bwdif deinterlace filter\n- Improved Autocrop filter algorithm\n  - Higher accuracy on mixed aspect ratio content, e.g. both letterbox and full frame pictures\n- Improved video scaling performance on Apple Silicon and ARM-based systems\n  - Use zscale (zimg) by default, falling back to swscale where necessary\n- Improved multithread performance (slightly) for the following filters on high core count systems\n  - Comb Detect\n  - Decomb\n  - Denoise\n    - NLMeans\n- Updated the following filters to support higher than 8-bit content and 4:2:2/4:4:4 chroma subsampling\n  - Detelecine\n  - Comb Detect\n  - Decomb\n  - Grayscale\n  - Denoise\n    - NLMeans\n    - HQDN3D\n  - Chroma Smooth\n  - Sharpen\n    - UnSharp\n    - LapSharp\n\n#### Build system\n\n- Added support for building for OpenBSD\n- Added --cpu configure parameter to enable building for native CPU architecture\n- Added --lto configure parameter to enable link time optimization\n- Miscellaneous bug fixes and improvements\n\n#### Third-party libraries\n\n- Updated libraries\n  - AMF 1.4.24 (AMD VCN encoding)\n  - FFmpeg 5.1.2 (decoding and filters)\n  - FreeType 2.12.1 (subtitles)\n  - Fribidi 1.0.12 (subtitles)\n  - HarfBuzz 4.4.1 (subtitles)\n  - libass 0.16.0 (subtitles)\n  - libbluray 1.3.4 (Blu-ray decoding)\n  - libdav1d 1.0.0 (AV1 decoding)\n  - libdvdread 6.1.3 (DVD decoding)\n  - liblzma (xz) 5.2.6 (LZMA video decoding, e.g. TIFF)\n  - libjpeg-turbo 2.1.4 (preview image compression)\n  - libspeex 1.2.1 (Speex audio decoding)\n  - libvpx 1.12.0 (VP8/VP9 video encoding)\n  - libxml 2.10.3 (general)\n  - oneVPL 2023.1.0 (Intel QSV encoding/decoding)\n  - x264 164 r3100 (H.264/AVC video encoding)\n  - x265 r12747 (H.265/HEVC video encoding)\n  - zimg 3.0.4 (color conversion)\n- New libraries\n  - SVT-AV1 1.4.1 (AV1 encoding)\n\n### Linux\n\n- Added many quality of life improvements contributed by community members\n- Improved parity with the Mac and Windows graphical interfaces\n- Miscellaneous bug fixes and improvements\n- Updated translations\n- Added new translations\n  - Bulgarian (Български)\n  - Finnish (Suomi)\n  - Georgian (ქართული)\n\n### Mac\n\n- Added Quick Look support to the queue\n- Miscellaneous bug fixes and improvements\n- Updated translations\n- Added Japanese translation\n\n### Windows\n\n- Miscellaneous bug fixes and improvements\n- Updated all translations\n- Added new translations\n  - Bulgarian (Български)\n  - Dutch (Nederlands)\n  - Polish (Polski)\n\n\n## HandBrake 1.5.1\n\n### Linux\n\n- Fixed an issue with the source tarball that broke Flathub builds (updated libass module to version 0.15.2)\n\n### Windows\n\n- The Windows UI is now .NET 6.0 only; .NET 5.0 is no longer additionally required\n\n\n## HandBrake 1.5.0\n\n### All platforms\n\n#### Video\n\n- Fixed an issue on older Intel CPUs causing the CLI to fail to initialize (#3924)\n- Updated video engine to preserve chroma sample location information\n- Updated Intel Quick Sync to use the Intel oneAPI Video Processing Library (oneVPL)\n\n#### Audio\n\n- Fixed MP2 audio sources not utilizing the fallback encoder when pass through is disabled (#3863)\n- Fixed FFmpeg AAC audio encoder quality mode scale range (#1295)\n\n#### Subtitles\n\n- Fixed an issue with captions pass through durations (#3764)\n\n#### Build system\n\n- Fixed multiple potential race conditions in Flatpak build process\n- Updated mac-toolchain-build script with newer tool versions\n\n#### Third-party libraries\n\n- Updated libraries\n  - FFmpeg 4.4.1 (decoding and filters)\n  - FreeType 2.11.1 (subtitles)\n  - Fribidi 1.0.11 (subtitles)\n  - HarfBuzz 3.1.2 (subtitles)\n  - Jansson 2.14 (JSON architecture)\n  - libass 0.15.2 (subtitles)\n  - libdav1d 0.9.2 (AV1 decoding)\n  - libjpeg-turbo 2.1.2 (preview image compression)\n  - libogg 1.3.5 (Xiph codecs support)\n  - libvpx 1.11.0 (VP8/VP9 video encoding)\n  - zimg 3.0.3 (color conversion)\n\n### Linux\n\n- Fixed a filter settings issue that resulted in incorrect filters being added to jobs (#3910)\n- Updated Intel QSV Flatpak plugin to use Intel MediaSDK 21.3.5\n- Updated Flatpak dependencies\n  - Freedesktop Platform 21.08\n  - GNOME 41\n- Added Corsican (Corsu) translation\n- Updated translations\n  - Simplified Chinese (简体中文)\n  - Dutch (Nederlands)\n  - French (Français)\n  - Korean (한국어)\n  - Spanish (Español)\n  - Swedish (Svenska)\n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- Requires macOS 10.13 High Sierra or later\n- Fixed potential issues where encoding process could get stuck on efficiency cores in some cases\n- Fixed an issue with automatic naming not applying correctly\n- Fixed main window not being shown upon editing a job in the queue\n- Updated queue statistics tab to include average encoding speed and percent of original file size\n- Added \"Move to top\" and \"Move to bottom\" to the queue context menu\n- Added a stop breakpoint to the queue, set when stop after job is selected and may be reordered (#2572)\n- Added native support for the VideoToolbox API, enabling advanced features such as frame multi-pass, mastering display and content light metadata, and chroma location; the previous implementation via FFmpeg's libavcodec has been removed\n- Added Corsican (Corsu) translation\n- Updated translations\n  - Simplified Chinese (简体中文)\n  - French (Français)\n  - German (Deutsch)\n  - Italian (Italiano)\n  - Portuguese (Português)\n- Miscellaneous bug fixes and improvements\n\n### Windows\n\n- Requires Windows 10 or later and Microsoft .NET Desktop Runtime 6.0.0 or later\n- Fixed a potential crash when encoding using Intel QSV in 2-pass mode (#4026)\n- Fixed potential issues where encoding process could get stuck on efficiency cores in some cases\n- Fixed an issue with static preview not updating when switching between automatic and custom cropping modes (#3911)\n- Updated the toolbar preset dropdown to an overlay panel that utilizes a tree view which saves state\n- Updated UI with various improvements to layout, typography, and cosmetics\n- Updated queue statistics tab to include average encoding speed and content information\n- Updated automatic naming file format placeholders to be live options\n- Updated Send File To preference to set HB_SOURCE, HB_DESTINATION, and HB_EXIT_CODE environment variables, which can be used instead of arguments\n- Added new exit_code parameter to Send File To preference\n- Added \"Move to top\" and \"Move to bottom\" to the queue context menu\n- Added a stop breakpoint to the queue, set when stop after job is selected and may be reordered (#2572)\n- Added support for Windows 10/11 notifications, enable in Preferences > When Done\n- Added support for Right to Left UI rendering for languages that require it. This can be set in preferences\n- Added Traditional Chinese (正體中文) and Polish (Polski) translations\n- Updated translations\n  - Simplified Chinese (简体中文) - includes fix for access keys in menus\n  - Corsican (Corsu)\n  - German (Deutsch)\n  - Italian (Italiano)\n  - Japanese (日本語)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.4.2\n\n### All platforms\n\n#### General\n- Improvements and fixes around colour bit-depth handling.\n- Fixed various issues where incorrect colour information could be written during muxing.\n\n#### Hardware Encoding\n- Fixed corrupted video output when decoding HDR10 content with QuickSync\n\n#### Subtitles\n- Fixed a slight subtitle colour shift issue when using libass\n\n### Mac\n- Fixed a build system errors that could cause failures linking libbluray \n- Fixed incorrect documentation URL\n- Fixed a possible crash that can occur when applying a malformed preset.\n\n### Windows\n- Added \"Preset\" used to the Queue summary tab.\n- Added \"Save New Preset\" to the preset menu, and toolbar preset dropdown to make it easier to find. (#3783)\n- Added category headers to the presets menu when using the flat display mode.\n- Changed the log filename format back to start with the destination filename as it did with 1.3 (#3740)\n- Changed tab selection behaviour on queue when changing jobs. it will no longer reset to the first tab. (#3813)\n- Fixed a minor UI juddering effect on the queue task list when jobs start or finish (#3813)\n- Fixed calculation errors when using padding on the dimensions tab (#3802)\n- Fixed an issue where static preview wasn't live-updating when changes occurred (#3803)\n- Fixed a crash on the Audio Defaults screen whilst trying to add Tracks (#3785)\n- Fixed incorrect taskbar icon state when running multiple encodes (#3791)\n- Fixed an issue where \"None\" resolution limit was not honoured (#3872)\n- Fixed an issue with preset export. VideoTune was not written correctly (#3829)\n\n\n## HandBrake 1.4.1\n\n### All platforms\n\n#### General\n- Fixed a crash when using \"Align AV\" on Intel based systems. (#3683)\n- Fixed a crash when reading certain DVD's with missing VOB files\n\n#### Hardware Encoding\n- Fixed an issue with QuickSync accelerated Crop/Scale generating incorrect aspect ratios (#3236)\n- Fixed a crash after a subtitle scan when using the QuickSync encoder. (#3741)\n\n#### Subtitles\n- Backport some libass patches which should correct some issues with font and font-weight selections. (#3736)\n- Fixed an issue that could prevent 3rd party software handling HandBrake files with dvb subtitles.\n\n#### Command line interface\n- Fixed a regression that prevented upscaling when using -w and -h (#3746)\n\n### Linux\n- Added: flatpak permission to show bookmarks in file dialogs (#3748)\n\n### Mac\n- Fix an issue where the Quality Slider was being ignored when using the VideoToolbox encoder. (#3751)\n- Fixed an issue where incompatible hardware presets could be selected. \n\n### Windows\n- Windows UI builds are now available for ARM64 devices. \n- Added upgrade notices to the installer welcome page advising of .NET Desktop Runtime 5 requirements and to complete existing queue. (#3693)\n- Added support for software rendering which can be enabled to workaround issues with Variable Refresh Rate and 3rd party software causing rendering corruption (#3755)\n- Added a new preference to define how the preset toolbar button renders the preset list. (#3697)\n- Fixed a crash which would prevent all user settings from loading in some circumstances. \n- Fixed \"Reset Settings\" button in preferences. Certain settings were not reset correctly. (#3726)\n- Fixed issues with the built-in updater that may cause it to fail to run the installer if the app was not running as admin.\n- Fixed an issue that required and app restart to apply changes to the max simultaneous encodes setting. \n- Fixed an issue with Audio Defaults fallback encoder quality/bitrate/mixdown settings would not display correct values (#3739)\n- Fixed an with QSV multi-instance support where multiple Intel GPU's are used.\n\n\n## HandBrake 1.4.0\n\n### All platforms\n\n#### General\n- The HandBrake engine is now 10 and 12bit capable. Please note that not all filters support 10 and 12 bits. Using an 8bit filter will cause the pipeline to run at 8bit. Please see the documentation for more information.\n- HDR10 metadata will be passed through from the source file if present. \n- Static Previews that are generated during file scans are now stored in compressed jpeg format (previously stored as YUV420).  Temporary disk space usage and disk writes are massively reduced. This uses libjpeg-turbo\n\n#### Filters\n- New Filter: Chroma Smooth\n- New Filter: Colourspace Selection. \n- New Filter: Support for QuickSync hardware accelerated Crop/Scale when using full path.\n\n#### Hardware Encoding\n\n- New Encoder: Media Foundation\n  - For Windows based ARM64 devices powered by Qualcomm Chipsets. \n- Updates to the AMD VCN encoder:\n  - Quality tuning for VCN's constrained vbr rate control mode. Results are the same or better than cqp mode, and bit rate is much more predictable.\n  - Included optimised H265 presets for 1080p and 4K content.\n- Updates to the Intel QuickSync encoder:\n  - Minor performance improvement by skipping VFR and Crop/Scale filters when they are not required. \n  - Overhauled memory management including improved zero-copy support where software filters are not used which should also improve performance. \n\n#### Audio\n- MP2 Audio Passthru support.\n\n#### Subtitles\n- New General purpose subtitle decoder\n  - Added support for DVB Subtitles (Passthru and Burn-In)\n  - Added support for EIA608 Closed Captions.\n  - Replaced current decoders for PGS, SRT and SSA  with those in ffmpeg. This should correct a number of rendering issues on Burn-In\n- Reduced default CC burn-in font-size.\n\n#### Third-party libraries\n- The following 3rd party libraries have changed:\n  - ffmpeg 4.4\n  - AMF 1.4.18 (AMD VCN encoding)\n  - nv-codec-headers 11.0.10.1 (Nvidia NVENC encoding)\n  - libmfx 1.34\n  - freetype 2.10.4\n  - fribidi 1.0.10\n  - harfbuzz 2.8.1\n  - jansson 2.13.1\n  - libass 0.15.1\n  - libbluray 1.3.0\n  - libdvdnav 6.1.1\n  - libdvdread 6.1.1\n  - dav1d 0.9.0\n  - libvorbis 1.3.7\n  - libvpx 1.10.0\n  - x264 161 r3043\n  - x265 3.5\n  - zimg and libjpeg-turbo are new dependencies. \n\n### General UI Updates (Applies to Windows, macOS and Linux)\n- The \"Dimensions\" tab has been redesigned. \n  - The Rotate and Flip filter has been moved from the filters tab.\n  - Added support for padding\n  - Added support to control the resolution limit.\n  - Added limited support for upscaling\n\n### Linux\n- Minor usability tweaks and fixes.\n- Added new translations (levels of completeness vary):\n  - Chinese (Taiwan)\n  - Hebrew\n  - Sinhala\n  - Slovenian\n- Updated existing translations (levels of completeness vary).\n\n### Mac\n- Support for Apple Silicon (macOS only)\n- Support for running multiple simultaneous jobs.\n- Support eyetv packages with .ts enclosed media file\n- Improved UI navigation\n  - Added two menu items to quickly switch between titles\n  - Improved undo/redo support\n  - Drag & drop import/export support in the presets popover\n- Preference Updates: \n  - Added a preference to control whether the current edited preset should be re-applied when changing title\n- Improved Security Scoped Bookmarks management\n- Minor improvements and fixes for macOS 11\n- Updated Sparkle Updater library.\n- Added new translations:\n  - Brazilian Portuguese\n- Updated existing translations.\n\n### Windows\n- Please note, the Windows UI now requires  \"Microsoft .NET 5 Desktop Runtime\"\n- Windows 10 is now the minimum version supported. The app will still run on Windows 7 and 8.1 however you will receive a message noting that it is not supported (twice) after which it will continue to run. Please note some functionality may not work correctly on these older operating systems and no support will be provided.\n- Process Isolation\n  - When enabled, any encodes that are started are run under a separate \"handbrake.worker.exe\" process. \n  - This protects the main UI from any crashes that could occur whilst processing a file and allows the queue to continue.\n  - Multiple jobs can be run simultaneously to improve CPU utilisation on high core count systems.\n- Audio Tab\n  - Minor improvement to the usability of auto-passthru. To prevent confusion, the \"auto-passhtru\" audio \"encoder\" option is now only available on the defaults screen and not the main audio tab. \n- Queue Improvements\n  - Restored lost \"Stop\" functionality in the new queue design that landed in 1.3. \n- Presets\n  - The legacy preset side panel has been removed. The presets button on the toolbar will now offer a \"preset manager\" and list the available for selection.\n  - The inline-preset view from 1.3 is now permanent. \n- Installer Improvements\n  - Existing NSIS installer: Option to create a shortcut for \"all users\" as the last step. \n  - An MSI based installed (mostly for system-admins) is now available to allow for easier deployments. Feedback welcome.\n- Preference Updates: \n  - New Auto Name option: Always use the default path for each new source / title selected\n  - \"Send File To\" Arguments now supports \"{source}\" and \"{destination}\" replacement placeholders. \n  - Added a preference to configure the \"Pause on Low Battery\" feature. \n  - Check for Updates is now \"opt-in\" for new installs. \n- UI Performance: Optimisations to allow better performance when handling large sets of files (1000+)\n- Added new translations (levels of completeness vary):\n  - Brazilian Portuguese\n  - Corsican\n  - Italian\n  - Japanese\n  - Persian (Iran)\n  - Thai\n  - Ukrainian\n- Updated existing translations (levels of completeness vary).\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.3.3\n\n### All platforms\n\n#### General\n\n- Fixed ISO 639-2/B language codes not set correctly in MKV (affects Hebrew, Indonesian, Javanese, and Yiddish) (#2903)\n- Improved support for sources where pixel format cannot be quickly identified, e.g. due to delayed video track start (#2893)\n- Added logging to identify where hardware support is disabled\n- Miscellaneous bug fixes and improvements\n\n#### Video\n\n- Improved Intel QSV memory footprint by eliminating a buffer pool (#2675)\n- Improved Intel QSV H.265 memory buffer size as required by newer Intel Media SDK (#2862)\n- Fixed and improved Intel QSV in various situations, especially hardware decoding (#873, #2660, #2661, #2829)\n- Fixed full range video being not being identified as limited range after conversion where filters are used (#2859)\n\n#### Subtitles\n\n- Fixed handling of overlapping SSA import subtitles (791adbac)\n- Improved support for out-of-order SSA subtitles as allowed by specification (#2906)\n\n#### Command line interface\n\n- Fixed --preset failure unless full path is specified, e.g. --preset=\"Category Name/Preset Name\" (#2838)\n\n#### Build system\n\n- Improved Flatpak to better conform to freedesktop metainfo standards\n- Improved Intel QSV Flatpak plugin build efficiency using cmake-ninja\n- Added a patch to fix cross compiling libdav1d using GCC 10.x (quality of life improvement)\n  - Official HandBrake 1.3.3 Windows release is built using GCC 9.x and is not directly affected by this issue\n\n#### Third-party libraries\n\n- Updated libraries\n  - FFmpeg 4.2.3 (decoding and filters)\n\n### Mac\n\n- Fixed preview layout not displaying properly on OS X 10.11 El Capitan\n- Fixed incorrect copyright year on About dialog (#2830)\n\n### Windows\n\n- Fixed a crash related to the dark theme (#2816)\n- Fixed a potential crash related to preview image memory allocation (#2871)\n- Fixed a potential crash due to certain actions causing no preset being selected (#2875)\n- Fixed missing E-AC-3 encoder option (#2855)\n- Fixed hardware encoder support unavailable in portable build (#2832)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.3.2\n\n### All platforms\n\n#### General\n\n- Fixed point to point end detection in certain scenarios (#2603)\n- Improved support for H.265 video in AVI container produced by some security cameras (#2622)\n- Added logging to identify problematic sources where container and video track pixel aspect ratios differ\n- Added logging to help debug potential JSON API issues\n\n#### Video\n\n- Fixed color range conversion being applied twice when scaling video (#2561)\n- Fixed incorrect identification of support for QSV HEVC encoder on older Intel hardware (#2558)\n- Added logging to identify automatic picture rotation\n- Miscellaneous bug fixes and improvements\n\n#### Audio\n\n- Fixed an upstream FFmpeg issue where passing through AAC ADTS audio could produce invalid MKV output in rare cases (error instead) (#2809)\n\n#### Filters\n\n- Fixed uninitialized memory in NLMeans prefilter leading to video corruption at bottom of picture (only affects custom settings) (#2576)\n- Fixed a crash in the Detelecine filter with out of bounds parameters (only affects custom settings) (#2560, #2804)\n\n#### Subtitles\n\n- Fixed burned in subtitles position offset where cropscale filter is not used (#2449)\n\n#### Command line interface\n\n- Fixed subtitles not being selected when specifying --all-subtitles without also specifying a non-empty --subtitle-lang-list\n\n#### Build system\n\n- Fixed building the GTK graphical interface for use on Windows (link ole32)\n- Updated Flatpak manifest creation script for compatibility with Python 3\n- Updated Flatpak runtime and numactl library versions, QSV plugin\n- Improved minimum version dependencies to facilitate building on systems with older automake and pkg-config\n- Added a workaround for an upstream libdav1d issue affecting installation on FreeBSD (#2662)\n- Miscellaneous bug fixes and improvements\n\n### Linux\n\n- Fixed point to point controls not accepting fractional seconds\n- Fixed updating presets with identical names in different categories\n- Improved parity with other platforms by allowing removal of preset categories (automatic after last preset in category is removed)\n- Improved parity with other platforms by showing title and chapter range on the queue summary tab\n\n### Mac\n\n- Fixed selection behavior new track audio mixdown set to DPL2 instead of stereo (#2641)\n- Fixed queued job failures related to removable drives by resolving security scoped resources as needed (#2566)\n\n### Windows\n\n- Fixed loading preset files with Unicode characters in path (#2427)\n- Fixed clear queue options to prevent them clearing active jobs (#2587)\n- Fixed main window status label not always reflecting the true count of queue jobs (#2538)\n- Fixed failure loading default settings which could cause various issues in the graphical interface (#2549)\n- Fixed preview images displaying incorrectly in some cases (anamorphic none, flip horizontal) (e9675bb, #2764)\n- Fixed various issues related to Auto Passthru, including fallback settings (#2619, #2627, #2611)\n- Fixed exported presets not importing correctly using the Mac graphical interface (#2531)\n- Fixed pause and resume not working correctly in some cases (#2647)\n- Fixed display of times greater than 24 hours (estimated time renaming, paused duration) (#2582, #2649)\n- Fixed various cosmetic issues in the graphical interface (#2645, #2646)\n- Improved display of long filenames in the queue (#2570)\n- Improved some UX stress cases related to the queue (#2632)\n- Improved error message when importing a preset specifying a nonexistent audio encoder (#2638)\n- Improved audio and subtitle languages behavior to preserve selected languages order where \"any\" is also selected (#2611)\n- Improved low disk space preferences and alerts (#2648)\n- Added a workaround for an upstream .NET issue causing tooltips to not render correctly in some cases (#2630)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.3.1\n\n### All platforms\n\n#### General\n\n- Fixed potential crash when opening a DVD source\n\n#### Video\n\n- Fixed rotation/flip not working properly in some cases\n- Fixed an issue with QSV failures when using --start-at\n- Updated presets using x265 to set aq-mode 1, the default prior to HandBrake 1.3.0\n- Improved AMD VCE rate control by always explicitly setting the rate control method\n- Added a workaround to fix x265 not parsing the H.265 Level setting where localized\n- Added an upstream patch to fix x265 limit-tu bug in loading co-located CU's TU depth\n- Added an upstream patch to fix x265 2-pass encoding failure\n- Added an upstream patch to fix x265 VBV macroblocking at end of final GOP\n\n#### Audio\n\n- Fixed importing older presets where \"und\" was used to select any language track\n  - Since HandBrake 1.3.0, \"any\" selects any language track and \"und\" selects undefined language tracks only\n- Fixed secondary audio tracks on Blu-ray sources not being detected in some cases\n\n#### Subtitles\n\n- Fixed importing older presets where \"und\" was used to select any language track\n  - Since HandBrake 1.3.0, \"any\" selects any language track and \"und\" selects undefined language tracks only\n\n#### Build system\n\n- Fixed cpp and lib flags causing build failures on some Linux systems\n\n#### Third-party libraries\n\n- Updated libraries\n  - FFmpeg 4.2.2 (decoding and filters)\n\n### Linux\n\n- Fixed UI translations not working in some cases\n- Fixed display of chapter start times\n- Fixed small memory leak in audio list\n\n### Mac\n\n- Fixed importing external ASS/SSA subtitles\n- Fixed statistics not updating after queue completion\n- Updated documentation link to the most recent documentation version\n\n### Windows\n\n- Fixed missing UI translations for some languages\n  - Español (Spanish)\n  - Français (French)\n  - 한국어 (Korean)\n  - русский (Russian)\n  - Türkçe (Turkish)\n- Fixed official presets not updating after installing a new release\n- Fixed preference for automatically naming file extension MP4/M4V not working\n- Fixed an issue preventing the use of relative paths for automatic naming\n- Fixed audio and subtitles selection behavior not saving when set via the Save New Preset dialog\n- Fixed closed captions not being added automatically per selection behavior\n- Fixed iPod 5G support option displaying when an incompatible encoder is selected\n- Fixed queue updating slowly or not updating in some cases\n- Fixed a few UI issues and a crash with the new dark theme.\n- Fixed window not restoring properly after minimizing to system tray\n- Fixed frame rate mode not updating on video codec change, preventing QSV zero-copy mode\n\n\n## HandBrake 1.3.0\n\n### All platforms\n\n#### General\n\n- HandBrake is now translated into many more languages\n- Redesigned queue UI\n- Removed Windows Mobile presets\n  - See the [list of compatible replacements on GitHub](https://github.com/HandBrake/HandBrake-docs/blob/03682bdd741cea425c80b06818e4bdaec75bdc5e/source/docs/en/latest/technical/official-presets.markdown#windows-mobile-presets)\n- Improved log output by silencing many lines at standard log level\n- Improved quality of Gmail presets slightly\n- Added Playstation 2160p60 4K Surround preset (supports PS4 Pro)\n- Added Discord and Discord Nitro presets\n\n#### Video\n\n- Updated Intel Quick Sync Video to use Direct3D 11 API\n- Updated minimum title scan duration to only apply to disc-based sources like Blu-ray and DVD\n- Improved detection of MPEG-1 video in program streams\n- Improved interface to FFmpeg avfilter and color handling\n- Improved Nvidia NVENC constant quality encoding slightly by not setting qmin and qmax\n- Replaced pp7 Deblock filter with FFmpeg Deblock filter\n- Added support for reading Ultra HD Blu-ray discs (without copy protection)\n- Added support for reading AV1 via libdav1d\n- Added encoding to WebM container format\n- Added Chroma Smooth filter (CLI only)\n- Added zero-copy path for Intel QSV encoding removed in a previous release\n- Added support for Intel QSV low power encoding (lowpower=1)\n- Added support for AMD VCE encoding on Linux via Vulkan\n- Added ability to select x265 encoder level and Fast Decode tune\n\n#### Audio\n\n- Updated audio resampling code to use FFmpeg swresample instead of libsamplerate\n- Added source audio bit rate to tracks list\n- Added ability to select unknown language tracks\n- Added automatic track name pass through\n\n#### Subtitles\n\n- Added ability to import external SSA/ASS subtitles\n- Added ability to select unknown language tracks\n- Added automatic track name pass through\n\n#### Command line interface\n\n- Added additional unit aliases to --start-at and --stop-at, notably seconds and frames\n\n#### Build system\n\n- HandBrake now builds with libnuma on Linux\n- Fixed Python bytestrings causing newlines to be ignored in build output\n- Fixed Xcode ignoring make jobs parameter and utilizing all CPU cores (macOS only)\n- Updated configure to enable most hardware encoders by default where appropriate by platform\n- Updated all scripts for compatibility with Python 3\n- Updated mac-toolchain-build script with newer tool versions many improvements\n- Updated mingw-w64-build script with mingw-w64 6.0.0, GCC 9.2, and many improvements\n- Improved compatibility with GCC 9 and recent Clang releases\n- Improved compatibility with recent Xcode releases (macOS only)\n- Improved host/build semantics\n- Improved namespace isolation\n- Improved handling of all options passed to configure\n- Improved configure help output\n- Improved detection of missing executable dependencies during configure\n- Added support for building on NetBSD\n- Added --harden configure parameter to enable buffer overflow protections\n- Added --sandbox configure parameter to enable sandbox build target on macOS\n- Added --enable-gtk4 configure parameter to build with GTK 4 instead of GTK 3\n- Added summary of build options to configure output\n- Miscellaneous bug fixes and improvements\n\n#### Third-party libraries\n\n- Removed libraries\n  - libsamplerate (audio resampling)\n- Updated libraries\n  - AMF 1.4.9 (AMD VCE encoding)\n  - bzip2 1.0.8 (general)\n  - FDK AAC 2.0.1 (AAC audio encoding, must compile from source)\n  - FFmpeg 4.2.1 (decoding and filters)\n  - FreeType 2.10.1 (subtitles)\n  - Fribidi 1.0.7 (subtitles)\n  - HarfBuzz 2.6.4 (subtitles)\n  - Jansson 2.12 (JSON architecture)\n  - libbluray 1.1.2 (Blu-ray decoding)\n  - libdav1d 0.5.1 (AV1 decoding)\n  - libdvdnav 6.0.1 (DVD decoding)\n  - libdvdread 6.0.2 (DVD decoding)\n  - libiconv 1.16 (character encoding support)\n  - libmfx (Intel QSV support)\n  - libogg 1.3.4 (Xiph codecs support)\n  - libopus 1.3.1 (Opus audio encoding)\n  - libvorbis 1.3.6 (Vorbis audio encoding)\n  - libvpx 1.8.1 (VP8/VP9 video encoding)\n  - libxml2 2.9.9 (general)\n  - nv-codec-headers 9.0.18.1 (Nvidia NVENC encoding)\n  - x265 3.2.1 (H.265/HEVC video encoding)\n\n### Linux\n\n- Fixed slider control not showing complete values\n- Updated translations (levels of completeness vary):\n  - Czech\n  - Chinese\n  - French\n  - German\n  - Italian\n  - Japanese\n  - Korean\n  - Norwegian\n  - Russian\n  - Spanish\n  - Thai\n- Added translations (levels of completeness vary):\n  - Afrikaans\n  - Basque\n  - Croatian\n  - Dutch\n  - Polish\n  - Portuguese\n  - Romanian\n  - Slovak\n  - Swedish\n  - Turkish\n  - Ukrainian\n- Added Intel QSV support to Flatpak (requires additional plugin installation)\n- Added ability to double-click to edit audio track settings\n- Added options to open encode log and log directory to actions menu on queue window\n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- HandBrake now requires OS X 10.11 El Capitan or later\n- HandBrake is now sandboxed and uses the macOS hardened runtime\n- Updated priority for low-priority threads on macOS to avoid potential stalls in future macOS\n- Updated translations:\n  - German\n- Added translations:\n  - French\n  - Italian\n  - Russian\n- Added preference to disable preview image on summary tab\n- Miscellaneous bug fixes and improvements\n\n### Windows\n\n- Improved browse dialog recently used to fallback to parent directory\n- Improved preferences layout\n- Improved auto naming collision behavior and file overwriting\n- Added preference to test selected notification sound\n- Added preference to perform when done action immediately without countdown\n- Added preference to disable preview image on summary tab\n- Added hardware.enabled option to portable.ini\n- Added dark theme for Windows 10\n- Added queue import/export removed in a previous release\n- Added new low battery level and disk space safety measures\n  - Encoding jobs automatically pause when battery level is low, system sleep is allowed, and jobs resume when power is restored\n  - Encoding jobs automatically pause when disk space drops to critical levels\n- Added translations (levels of completeness vary):\n  - French\n  - German\n  - Chinese\n  - Korean\n  - Russian\n  - Spanish\n  - Turkish\n- HandBrake now requires .NET Framework 4.7.1 or later (installer offers download if missing)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.2.2\n\n### Mac\n\n- Fixed built-in application updater\n\n### Windows\n\n- Fixed crash on first launch for new installs, or older installs without settings.json\n- Fixed an issue where the summary tab wasn't always up-to-date\n\n\n## HandBrake 1.2.1\n\n### All platforms\n\n#### General\n\n- Fixed potential crashes due to use of uninitialized variables\n- Improved minimum duration to only apply to DVD and BD sources\n- Miscellaneous bug fixes and improvements\n\n#### Video\n\n- Fixed incorrect video rotation where rotation is explicitly flagged as none\n- Fixed yadif deinterlace filter not properly deinterlacing all frames\n- Fixed missing frame at the end of encodes from m2ts sources\n- Fixed detection of MPEG-1 video in program streams by improving probing of unknown streams\n- Fixed decoding of MPEG-1 video in DVD sources\n- Fixed Apple VideoToolbox encoding issues related to pyramidal B-frames\n- Fixed lapsharp filter corrupting frame edges\n- Improved NLMeans performance by reducing number of threads used with CPUs with high logical core counts\n- Improved AMD VCE encoding to enable placing key frames at chapter markers\n- Improved calculation of final frame duration\n- Improved support for BT.2020 color space\n\n#### Audio\n\n- Fixed channel mapping for AAC 5.1 encoding (signal 5.1 Back instead of 5.1 Side which is less compatible)\n\n#### Command line interface\n\n- Fixed selection of encoders applied to tracks selected with `--all-audio`\n- Fixed audio settings where more are specified than exist in the preset\n- Fixed overriding audio bit rate set by the preset\n\n#### Build system\n\n- Fixed libvpx cross compilation with GCC 8 by disabling AVX-512\n- Fixed x265 cross compilation with GCC 8\n- Updated to mingw-w64-build 4.1.1 with improvements to error reporting and support for sha256sum on systems without shasum\n- Miscellaneous bug fixes and improvements\n\n#### Third-party libraries\n\n- Updated libraries\n  - libmfx (upstream API 1.27)\n\n### Linux\n\n- Fixed Flatpak icon validation by reducing resolution to pass new restrictions\n- Fixed Flatpak accessing gvfs mounted filesystems by adding an additional access permission\n- Fixed display of special characters in preset names\n- Fixed exporting presets to sanitize system reserved characters \n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- Fixed incorrect file extension when selecting a preset\n- Fixed potential user interface hang on macOS 10.12 Sierra\n- Fixed potential issue caused by setting work state to done before all threads have closed\n- Improved usability of preview controls overlay by increasing its size\n- Miscellaneous bug fixes and improvements\n\n### Windows\n\n- Fixed application uninstaller sometimes appearing behind the installer\n- Fixed potential crash when loading settings from older HandBrake versions\n- Fixed official presets not updating when a newer HandBrake version is installed\n- Fixed maximum resolution limit when selecting a preset (source or preset, whichever is smaller)\n- Fixed crop and anamorphic settings not being restored when editing a queued job\n- Fixed audio and subtitle selection behaviour where any language + first track are selected\n- Restored options control on the queue window previously removed in HandBrake 1.2.0\n- Improved user interface on displays close to the minimum recommended resolution\n- Improved quality of text rendering on the installer for high density displays\n- Improved ordering of presets and preset categories\n- Improved QSV compatibility with newer Intel drivers by updating libmfx\n- Improved removal of small temporary files that could be left behind in certain cases\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.2.0\n\n### All platforms\n\n#### General\n\n- Switched core decoding library from Libav to FFmpeg\n  - Fixes numerous sources previously unreadable or otherwise broken\n  - Facilitates a number of the improvements and features in this release and planned for the future\n- Removed deprecated Legacy presets\n  - See the [list of compatible replacements on GitHub](https://github.com/HandBrake/HandBrake-docs/blob/efb51cc2cd7d0c30fa5e9ee88366233ca34757a4/source/docs/en/latest/technical/official-presets.markdown#legacy-010x-presets)\n- Updated official presets to use stereo instead of DPL2 mixdown\n  - Avoids potential spatial positioning issues with the current DPL2 algorithm and wide pans in source material\n  - Limited in impact since DPL2 decoding has not been in widespread use for years\n- Updated official presets descriptions to revise compatibility and mention recently released devices\n- Updated official presets to rename Fire TV to Amazon Fire\n- Added Amazon Fire 720p30 and Chromecast 1080p60 presets\n- Added `{creation-date}` and `{creation-time}` to automatic file naming\n\n#### Video\n\n- Fixed an issue decoding Blu-ray titles where the aspect ratio is unknown (assume 16:9)\n- Fixed an issue encoding video with very short frame durations (less than 0.00285s or greater than 350 FPS)\n- Improved extradata handling to accommodate all codecs\n- Added support for decoding TIFF/LZMA video\n\n#### Audio\n\n- Fixed potential decoding issue for audio lacking an explicit channel layout (intelligently guess the layout)\n- Fixed a potential crash during audio probe\n- Improved resampling to allow dithering for all codecs (only where necessary)\n- Improved quality of the default AAC encoder on non-Mac platforms (FFmpeg AAC), no longer experimental\n- Improved bit rate constraints to allow Opus as low as 6 kbit/s per channel\n- Added support for up to 7.1 channel AAC encoding (note that FDK AAC/HE-AAC do not support 6.1)\n- Added support for E-AC3 audio in MP4 container\n- Added Speex audio decoder\n\n#### Subtitles\n\n- Fixed a potential crash where an SRT file cannot be opened\n- Added support for SRT files using periods instead of commas to delineate fractions\n\n#### Command line interface\n\n- Fixed inability to override preset subtitles burn setting (`native` and `none` are now valid values for `--subtitle-burned`)\n\n#### Build system\n\n- Fixed Linux packaging with an out-of-tree build directory\n- Fixed Windows graphical interface build script signing tool location\n- Removed `--enable-local-*` and associated contrib libraries; please see the [documentation](https://handbrake.fr/docs/) for dependencies help\n- Updated to mingw-w64-build 4.1.0 with gcc 7.3.0, continuous output (keep alive), and miscellaneous improvements\n- Improved support for building with Xcode 10\n- Improved support for building on FreeBSD 11, 12, and 13\n- Improved Flatpak packaging for Linux (numerous fixes and improvements, no longer experimental)\n- Improved `configure.py` to always use the Python executable found by `configure`\n- Added script for creating Flatpak manifests\n- Added support for selecting a compiler via the CC environment variable\n- Miscellaneous bug fixes and improvements\n\n#### Third-party libraries\n\n- Removed libraries\n  - Libav 12.3 (decoding and filters)\n  - yasm 1.3.0\n- Updated libraries\n  - libopus 1.3 (Opus audio encoding)\n  - x264 157 r2935 (H.264/AVC video encoding)\n  - x265 2.9 (H.265/HEVC video encoding)\n- New libraries\n  - FFmpeg 4.1 (decoding and filters)\n  - liblzma (xz) 5.2.4 (LZMA video decoding, e.g. TIFF)\n  - libspeex 1.2.0 (Speex audio decoding)\n\n### Linux\n\n- Fixed Blu-ray title name being set to device name (e.g. sr0) when scanning raw devices\n- Fixed Blu-ray default destination file names to no longer include MPLS number\n- Fixed an issue with queue state not being updated properly on reload\n- Fixed various issues importing presets\n- Updated most translations\n- Added initial support for GTK 4\n- Added ability to customize activity window font size and increased default from 7 to 8\n- Added destination overwrite protection (append number to file name on conflict)\n- Added `{source-path}` to automatic path setting\n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- HandBrake now requires OS X 10.10 Yosemite or later\n- Removed preferences option to show the advanced tab (deprecated and slated for removal)\n- Fixed minor display issues on macOS 10.14 Mojave\n- Fixed queue toolbar icon not updating\n- Removed Growl in favor of native system notifications\n- Updated Sparkle automatic update library\n- Improved handling of invalid presets\n- Improved layout to better support localization\n- Improved preview border alignment on high density displays\n- Improved automatic naming to avoid updating when unrelated settings change\n- Improved criteria for showing destination overwrite warnings\n- Improved stop encoding confirmation dialog\n- Improved notifications to no longer play sounds when alerts are disabled\n- Added initial localization support and German translation\n- Added initial support for VideoToolbox hardware-accelerated encoding\n- Added support for Dark Mode on macOS 10.14 Mojave (new Dark Mode toolbar icons require building with Xcode 10 on Mojave)\n- Added Touch Bar support to various windows and dialogs\n- Added Finder progress bar to files currently encoding\n- Added Show Source in Finder to queue contextual menu (renamed Show in Finder to Show Destination in Finder)\n- Added validation for custom filter parameters\n- Miscellaneous bug fixes and improvements\n\n### Windows\n\n- HandBrake now requires .NET Framework 4.7.1 or later (installer offers download if missing)\n- Fixed mixdown selection where the specified mixdown in the selected preset is not available\n- Fixed audio sample rate of 48 kHz being selected where Auto was the specified behavior\n- Removed preferences option to show the advanced tab (deprecated and slated for removal)\n- Removed options menu from queue in favor of contextual menu\n- Improved layout to better support localization\n- Improved error handling when adding items to the queue\n- Improved multi-instance queue recovery to avoid loading queue files from the wrong instance\n- Improved filters layout and controls\n- Improved video quality slider by allowing it to grow with window size and setting x264/x265 granularity to 0.5\n- Improved SRT import default browse location (open source video location)\n- Improved keyboard shortcuts by making Ctrl-S open the destination save dialog (start encode is now Ctrl-E)\n- Added additional keyboard shortcuts for various actions\n- Added initial localization support and German translation\n- Added support for AMD VCE and Nvidia NVENC hardware-accelerated encoders\n- Added automatic queue archiving and option to select an archived queue for recovery (archives are removed after 7 days)\n- Added support for recovering specific queue files on start using `--recover-queue-ids=<id1,id2,...>`\n- Added additional controls to passthru audio tracks to configure audio fallback parameters\n- Added ability to drag and drop SRT subtitles files onto the main window\n- Added option to disable preview image on summary tab\n- Added option to disable checking for update on start in portable mode\n- Added stop encoding confirmation dialog\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.1.2\n\n### All platforms\n\n#### General\n\n- Fixed Blu-ray title name where reading from raw device\n- Improved handling of broken units in Blu-ray source (skip and continue reading)\n\n#### Video\n\n- Fixed rare crash related to preview images, anamorphic, and default preset values\n- Fixed jitter produced by 59.94 fps to 29.97 fps frame rate conversion\n\n#### Audio\n\n- Fixed duration of silence buffers (may improve audio/video sync for some sources)\n\n#### Build system\n\n- Fixed linker warning by setting libvpx target to minimum supported macOS version\n- Fixed build failure with old GTK versions\n- Miscellaneous Flatpak-related fixes and improvements\n\n#### Third-party libraries\n\n- Updated libraries (necessary to pull in needed bug fixes)\n  - libdvdread 6.0.0 (DVD decoding)\n  - libdvdnav 6.0.0 (DVD decoding)\n\n### Linux\n\n- Fixed potential crash where $HOME directory is missing\n- Fixed legacy preferences causing preset window being shown at every launch\n- Fixed preset name and menu display on Ubuntu 14.04 Trusty Tahr\n- Fixed default destination file name for Blu-ray source to not include MPLS number\n- Fixed queue reloading in Flatpak sandbox\n- Fixed toolbar icons alignment and use correct art for lower pixel density\n- Updated most translations\n\n### Mac\n\n- Fixed menu item and tooltip strings related to selection behavior\n- Fixed crash where presets file contains invalid UTF-8\n\n### Windows\n\n- Fixed incorrect track selection behaviours on audio and subtitle tabs\n- Fixed creating an unneeded HandBrake Team directory in the user's Roaming directory\n- Improved path handling when opening a source directory from the queue\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.1.1\n\n### All platforms\n\n#### General\n\n- Fixed a potential crash in the comb detection filter\n- Fixed a potential crash in the padding filter\n\n#### Video\n\n- Fixed decoding certain very high bit rate ultra-high definition sources with extra large packets\n- Fixed last frame in source video missing in output\n\n#### Audio\n\n- Fixed crash when decoding an empty audio track\n\n#### Build system\n\n- Updated mac-toolchain-build script Nasm url and improved curl parameters for robustness\n\n#### Third-party libraries\n\n- Updated libraries (necessary to pull in needed bug fixes)\n  - libvpx 1.7.0 (VP8/VP9 video encoding)\n  - x264 155 r2901 (H.264/AVC video encoding)\n\n### Linux\n\n- Fixed Ubuntu PPA build date\n- Fixed a display issue with the quality slider control\n- Fixed issues occurring when running multiple HandBrake instances simultaneously\n- Updated Russian translation\n- Updated support for creating Flatpak bundles (experimental)\n- Miscellaneous bug fixes and improvements\n\n### Mac\n\n- Fixed corrupted output with VP8 and VP9 encoders\n- Fixed building x264 using Clang and -march=native/-mavx (thanks H. Gramner for the upstream patch)\n\n### Windows\n\n- Fixed issues with queue recovery when running multiple HandBrake instances simultaneously\n- Fixed an issue with a When Done action potentially causing the last queue item to be marked as a warning instead of success\n- Fixed burn-in behavior with MP4 files; after the first burn-in track, no additional tracks that require burn-in will be added\n- Improved window resize behavior for Add Selection to Queue dialog and allowed space bar to toggle checkbox for selected row\n- Improved tabbing behavior in various circumstances\n- Improved adding a new preset with the same name as an existing user preset; the existing preset will now be updated properly\n- Improved privacy by adding an option to disable the Summary tab preview image\n- Updated installer to block installation on 32-bit systems to avoid confusion (unsupported since 1.1.0)\n- Miscellaneous bug fixes and improvements\n\n\n## HandBrake 1.1.0\n\n### All platforms\n\n#### General\n\n- Improved user interface\n  - Redesigned main window for consistency and usability; overall flow is top to bottom, left to right\n  - Added new preset controls directly in main workflow\n  - Added new summary tab for overview of settings at a glance\n  - Updated interface icons to support high resolution displays\n- New and improved official presets\n   - Added new presets for Vimeo and YouTube\n   - Added new 2160p/4K device presets for Apple TV, Chromecast, Fire TV, and Roku\n   - Added new Production presets for post-production video editing workflows\n   - Added additional 2160p/4K Matroska presets\n- Improved AppleTV 4K support\n- Improved Intel QuickSync Video support\n  - Added Linux support (experimental)\n  - Added 10-bit H.265/HEVC encoding support for Kaby Lake and newer CPUs\n  - Added support for multiple GPUs via D3D11 encode path\n- Many bug fixes and improvements\n\n#### Video\n\n- Added new Unsharp and kernel-based Laplacian LapSharp sharpening filters\n- Added CSM prefilter option to NLMeans filter\n- Added support for mobile device orientation via auto-rotation container flag\n- x265 10- and 12-bit encoders are now included by default; additional dll files are no longer required\n\n#### Command line interface\n\n- Added support for adaptive streaming (SPS and PPS before IDR frames) via the --inline-parameter-sets parameter\n- Added --json parameter to output scan/status information in JSON format, useful for scripting\n- Audio sample rate parameter --arate now accepts \"auto\" as a valid value\n\n#### Build system\n\n- Added support for FreeBSD 11.1 (must compile from source)\n- Added support for compiling on Windows under MSYS (experimental, slow)\n- Updated to mingw-w64-build 3.1.1 with support for mingw-w64 5.0.3 and gcc 7.2.0\n- Update mac-toolchain-build to add NASM 2.13.2 (now required for x264)\n- Miscellaneous bug fixes and improvements\n\n#### Third-party libraries\n\n- Updated libraries\n  - FDK AAC 0.1.5 (AAC audio encoding, must compile from source)\n  - FreeType 2.8.1 (subtitles)\n  - HarfBuzz 1.7.2 (subtitles)\n  - Jansson 2.10 (JSON architecture)\n  - LAME 3.100 (MP3 audio encoding)\n  - Libav 12.3 (decoding and filters)\n  - libass 0.14.0 (subtitles)\n  - libbluray 1.0.2 (Blu-ray decoding)\n  - libdvdnav 5.0.3 (DVD decoding)\n  - libdvdread 5.0.3 (DVD decoding)\n  - libiconv 1.15 (character encoding support)\n  - libmfx (upstream API 1.23)\n  - libogg 1.3.2 (Xiph codecs support)\n  - libopus 1.2.1 (Opus audio encoding)\n  - libsamplerate 0.1.9-35-g02ebb9f (audio resampling)\n  - libtheora 1.1.1 (Theora video encoding)\n  - libvorbis 1.3.5 (Vorbis audio encoding)\n  - libvpx 1.6.1 (VP8/VP9 video encoding)\n  - libxml2 2.9.4 (general)\n  - x264 155 r2893 (H.264/AVC video encoding)\n  - x265 2.6 (H.265/HEVC video encoding)\n  - zlib 1.2.11 (general)\n\n### Linux\n\n- Added option to configure low disk space warning level\n- Added Intel QuickSync Video encoder (experimental, requires specific Intel driver)\n- Added support for Ubuntu 18.04 and 17.10; Ubuntu 15.04 support is removed\n- Many other bug fixes and improvements\n\n### Mac\n\n- Added option to configure low disk space warning level\n- Improved support for VoiceOver navigation\n- Many other bug fixes and improvements\n\n### Windows\n\n- Added option to configure low disk space warning level\n- Added option to play a sound (MP3/WAV) when encode or queue is finished\n- Added option to show progress, pass, passcount in the application title or task tray icon tooltip\n- Added more granular progress reporting during search for start of file and muxing\n- Added support for per-display resolution awareness\n- Added support for running HandBrake in a portable mode (see included portable.ini.template)\n- Added custom anamorphic to dimensions tab, it's back!\n- Improved static preview window still previews rendering\n- Improved audio selection behavior controls; dropdowns are now context aware and range limited with better defaults\n- Improved UI consistency throughout\n- Many other bug fixes and improvements\n\n\n## HandBrake 1.0.7\n\n### All platforms\n\n#### Video\n\n- Fixed decoding of raw video in Matroska/MKV\n- Fixed time stamp handling for containerless raw video\n- Fixed memory leaks in OpenCL\n- Fixed x265 2-pass encoding where video frame rate is altered by filters\n- Improved handling of very small amounts of sync jitter (~1 tick)\n- Improved handling of AVI files with broken indices\n\n#### Audio\n\n- Further refined fix for Libav crash encoding AAC at very high bitrates\n\n#### Subtitles\n\n- Removed fontconfig dependency on Mac and Windows; libass now uses CoreText/DirectWrite\n- Improved subtitle font selection when burning in SRT/SSA subtitles\n\n#### Command line interface\n\n- Fixed preset subtitle burn defaults override\n\n#### Build system\n\n- Updated MinGW-w64 build script for improved compatibility with hardened GCC\n\n### Linux\n\n- Fixed video preset control not updating\n- Fixed audio passthru masks not updating until preset save\n- Fixed application of SRT subtitles offset\n- Updated translations: af, cs, ja_JP, ru, sk, sv\n\n### Windows\n\n- Fixed When Done option not updating/resetting correctly\n\n\n## HandBrake 1.0.6\n\nSuperseded by HandBrake 1.0.7.\n\n\n## HandBrake 1.0.5\n\nSuperseded by HandBrake 1.0.6.\n\n\n## HandBrake 1.0.4\n\nSuperseded by HandBrake 1.0.5.\n\n\n## HandBrake 1.0.3\n\n### All platforms\n\n#### Video\n\n- Fixed H.264 decoding using Libav where the initial GOP was dropped\n- Fixed 2-pass x265 encoding where the source header incorrectly specifies frame rate\n- Fixed 2-pass encoding with bob deinterlace and constant frame rate\n- Fixed a seek issue in Libav while reading MKV sources with embedded subtitles\n- Fixed multiple issues preventing Libav from opening WMV sources properly\n- Fixed miscellaneous issues in Libav\n- Fixed memory leaks in OpenCL\n- Improved sync for streams delayed by a large amount\n\n#### Audio\n\n- Fixed a Libav crash encoding AAC at very high bitrates\n- Fixed a potential hang in Libav while decoding AAC\n- Improved Libav audio sync with MP4 sources containing edit lists\n- Improved mapping of single channel layouts to single channel layouts\n\n### Linux\n\n- Fixed a potential crash when selecting video encoders\n- Fixed various controls not applying values properly\n\n### Mac\n\n- Fixed a crash when attempting to edit a queued job\n- Improved audio start point to use edit lists when encoding using CoreAudio AAC\n\n### Windows\n\n- Fixed Title Specific Scan for DVD/Blu-ray\n- Fixed broken/missing NLMeans denoise tunes\n- Fixed an issue that could cause error -17 when encoding using Intel QuickSync Video\n- Fixed an issue where the SRT language code was not being set correctly\n\n\n## HandBrake 1.0.2\n\n### All platforms\n\n#### Video\n\n- Fixed point to point encoding end point when using frames as the unit\n- Improve error handling for libdvdread and libavcodec decoders\n\n#### Audio\n\n- Fixed an issue where fallback encoder bitrate was not set properly\n\n#### Subtitles\n\n- Fixed incorrect duration for UTF-8 subtitles\n- Fixed an issue causing extra blank lines for UTF-8 subtitles in MKV\n\n### Linux\n\n- Fixed an issue sometimes preventing dragging and dropping of presets between folders\n- Miscellaneous bug fixes\n\n### Mac\n\n- Fixed video encoder options not reset when changing encoders\n- Fixed incomplete encodes where the chapter count differs on queued items\n- Fixed sleep prevention not working in certain scenarios\n- Fixed automatic naming for EyeTV bundles\n- Added additional checks to prevent source file overwriting\n- Miscellaneous bug fixes\n\n### Windows\n\n- Fixed video encoder options not reset when changing encoders\n- Fixed subtitles defaults behaviors to improve how tracks are added\n- Fixed issues related to source maximum and custom picture setting modes\n- Fixed point to point settings when editing a queued job\n- Fixed When Done controls not updating correctly on various screens\n- Fixed split buttons not working correctly on audio and subtitles tabs\n- Fixed destination path and file name error checking\n- Fixed potential crash by disabling OpenCL detection when the scaler is not set to OpenCL Bicubic (workaround for broken system drivers)\n- Fixed a potential crash when QSV is supported but disabled at the BIOS level\n- Fixed memory leaks in the QSV encoder\n- Added QSV detection for Intel Kaby Lake CPUs\n- Miscellaneous bug fixes\n\n\n## HandBrake 1.0.1\n\n### All platforms\n\n#### Video\n\n- Fixed a potential crash when using the VP8 or VP9 video encoders\n- Fixed a potential crash when using 2-pass ABR\n\n#### Command line interface\n\n- Fixed importing chapter names from a file\n\n### Linux\n\n- Fixed Keep Aspect Ratio control (disabled) when anamorphic mode is Auto\n- Widened presets list to accommodate longer preset names\n- Miscellaneous bug fixes\n\n### Mac\n\n- Fixed a potential crash when using the subtitles burn feature on macOS versions earlier than 10.12 Sierra\n- Fixed certain controls not updating when saving or loading a preset\n- Miscellaneous bug fixes\n\n### Windows\n\n- Fixed certain controls not updating when saving or loading a preset\n- Disabled QSV decoding by default when non-QSV encoder selected (configurable)\n- Miscellaneous bug fixes\n\n\n## HandBrake 1.0.0\n\n### All platforms\n\n#### General\n\n- New online documentation at https://handbrake.fr/docs\n- Completely overhauled the official presets\n  - New general use presets for broad compatibility\n  - New device presets, now more up-to-date for common devices\n  - New web presets\n  - New Matroska (MKV) presets, including VP9 video with Opus audio\n  - Official presets from HandBrake 0.10.x are still available under `Legacy`\n- New JSON-based preset system including command line support\n- New JSON-based API for interacting with libhb\n- Improvements to audio/video sync engine to better handle difficult sources\n- Many miscellaneous bug fixes and improvements (over 1700 code commits!)\n\n#### Video\n\n- VP9 video encoding via libvpx\n- Intel QuickSync Video H.265/HEVC encoder\n  - Requires Intel Skylake or newer CPU\n- Ultra HD / 4K color pass through (support for BT.2020)\n- Additional standard frame rate selections in the graphical interfaces\n- New Auto anamorphic mode maximizes storage resolution, replaces Strict anamorphic mode\n- New Pad filter (command line only for now)\n- New Decomb/Deinterlace filter settings and improved defaults\n- Rotate filter now available in all graphical interfaces\n- New NLMeans filter tunes Tape and Sprite for analog tape recordings and vintage video games, respectively\n- Assembly optimizations NLMeans filter improve performance up to 10%\n- Assembly optimizations in x264 encoder improve performance for faster presets by 5-10%\n- x265 encoder quality improvements, especially when using tune grain\n- High bit depth encoding support via external shared libraries (video pipeline is still 8-bit 4:2:0)\n  - x264 10-bit\n  - x265 10-bit and 12-bit\n\n#### Audio\n\n- Opus audio encoding/decoding via libopus\n- Passthru now supports E-AC-3, FLAC, and TrueHD audio formats\n\n#### Subtitles\n\n- Improved subtitles rendering for some languages via HarfBuzz\n- Miscellaneous subtitles improvements\n\n#### Command line interface\n\n- Presets can now be imported and exported from the command line and are compatible with the graphical interfaces\n- Queue exported from the graphical interfaces can now be imported by the command line interface (Linux and Windows only for now)\n\n#### Build system\n\n- Add scripts to manually build and install Mac and MinGW-w64 (compile for Windows on Linux) toolchains\n- Add support for multiple source URLs for third-party downloads\n- Add SHA256 hash verification for third-party downloads\n- Add configure parameter to disable or filter allowed third-party downloads (see configure --help)\n- Use HTTPS everywhere; the few cases where a third-party does not provide packages over https, handbrake.fr does\n- New targets on Mac to install and uninstall after building\n- Add flatpak packaging support (experimental)\n\n#### Third-party libraries\n\n- Updated libraries\n  - FreeType 2.6.5 (subtitles)\n  - Fontconfig 2.12.1 (subtitles)\n  - FriBidi 0.19.7 (subtitles)\n  - Libav 12 (encoding/decoding/muxing)\n  - libass 0.13.2 (subtitles)\n  - libbluray 0.9.3 (Blu-ray decoding)\n  - libmfx v6.0.0 (Intel QuickSync Video encoding/decoding)\n  - libvpx 1.5.0 (VP8/VP9 video encoding)\n  - x264 148 r2708 (H.264/AVC video encoding)\n  - x265 2.1 (H.265/HEVC video encoding)\n- New libraries\n  - HarfBuzz 1.3.0 (subtitles)\n  - libopus 1.1.3 (Opus audio encoding)\n\n### Linux\n\n- Add options for saving and loading queue files\n- Removed system tray icon due to performance issues on Ubuntu\n- Usability improvements\n- Miscellaneous bug fixes\n\n### Mac\n\n- Updated all tooltips\n- Added undo/redo support to the graphical interface\n- Improved drag and drop support\n- Added Open Recent to the File menu\n- Added Add Titles to Queue… to the File menu (batch queueing)\n- Preview prompts to open in an external application when the internal player does not support the format\n- Preview now displays volume and audio/subtitles language selection during playback\n- Picture and Filters settings are now part of the main window\n- Settings are preserved when selecting a new title (instead of reloading the last selected preset)\n- Improved support for importing/exporting comma-separated (.csv) chapter markers\n- Queue is now automatically paused when available disk space is low\n- When Done action can now be changed directly from the Queue window\n- When Done notification is now interactive (reveals the encoded file in Finder)\n- Activity Log window is now searchable (press `⌘`+`f` to activate)\n- XQuartz is no longer required for subtitle burn-in\n- Updated Sparkle software update library\n  - Enabled DSA signature checking for improved security\n- Usability improvements\n- Miscellaneous bug fixes\n\n### Windows\n\n- Graphical interface now uses libhb directly, instead of sending commands to the command line interface\n  - Encoding can now be paused and resumed\n  - Stopping encoding will finalize the partial file to be playable\n- Reduced installer and install size\n  - The command line interface is no longer included in the graphical interface installer\n- Update checker now verifies the signature of the update file for improved security\n- Added support for quality-based audio encoding\n- Added ability to import tab-separated (.tsv), XML (.xml), and plain text (.txt) chapter markers\n- Improved the \"configure default\" options for audio and subtitles\n  - Default audio track behavior is now configurable\n  - Subtitles burn-in behavior is now configurable\n- Removed DirectX Video Acceleration (DXVA) hardware-accelerated video decoding\n  - Was causing many issues without providing sufficient improvement to decoding efficiency\n  - May be added again at a later date if performance and stability improves\n- Usability improvements\n- Miscellaneous bug fixes\n\n\n## HandBrake 0.10.5\n\n- Removed FDK AAC from binary releases\n  - Configure with `--enable-fdk` for non-free and non-redistributable build when compiling from source\n- Updated x265 to 1.9 which brings bug fixes and performance improvements\n- Improvements in large AVI file handling\n- Assorted bug fixes and performance improvements\n\n## HandBrake 0.10.3\n\n- Updated x265 to 1.8 which brings numerous bug fixes and some performance improvements\n- Assorted bug fixes and performance improvements\n\n## HandBrake 0.10.2\n\n- Assorted bug fixes and performance improvements\n\n## HandBrake 0.10.1\n\n- Assorted bug fixes for all three GUIs and the core library\n\n## HandBrake 0.10.0\n\n### Core\n\n- Intel QuickSync Video encode and decode support (beta)\n  - Windows only currently; we hope to bring this to Linux users in the future\n- DXVA hardware decode support (experimental)\n  - Windows only\n  - Suitable only for slower machines so disabled in preferences by default\n- Choice of scalers\n  - Lanczos\n    - HandBrake's default scaler\n  - Bicubic (OpenCL) (experimental)\n    - Available on the Command Line Interface (all platforms) and Windows GUI (Mac / Linux GUIs will come in a later release)\n    - Currently only available in OpenCL form so requires an AMD or Intel GPU supporting OpenCL 1.1 or later; Nvidia GPUs are not currently supported\n    - When downscaling, up to 5% performance improvement can be achieved; no benefit when not downscaling\n    - Small loss in quality over the Lanczos scaler\n- Denoise\n  - hqdn3d filter now accepts individual settings for each chroma channel (Cb, Cr)\n  - New NlMeans denoiser, very slow, but results are significantly better than hqdn3d\n- Presets\n  - Added Windows Phone 8 Preset\n- Updated Libraries\n  - x264 r2479-dd79a61\n  - Libav v10.1\n  - libbluray 0.5.0\n- libavformat is now used for muxing instead of mp4v2 and libmkv\n  - \"Large File Size\" checkbox has now been removed for MP4, as the new muxer will transition to 64bit files automatically\n  - mpeg2dec has also been replaced in favour of using libav\n- The LibAV AAC encoder is now the default as FAAC has been remove\n  - This encoder is adequate for most, but until it improves a bit further, we have enabled support for the FDK-AAC encoder also\n    - This FDK option is a temporary measure until the LibAV encoder improves\n    - Note that FDK-AAC is much slower and will likely bottleneck the encode process, but will produce better quality audio\n- H.265 encoder\n  - Now available through x265 1.4\n  - While this encoder is still fairly new, we have seen some promising results come out of it; it's still under heavy active development and is only going to improve over time\n- Added VP8 Encoder (using libvpx)\n  - Available in MKV files only\n- Removed mcdeint deinterlace and decomb modes (this relied on the snow encoder in libav which has been removed by upstream)\n- Bug fixes and misc improvements\n\n### Windows\n\n- Accessibility and usability improvements\n  - Added option to 'Use System Colors'; the app should now be usable in a high contrast mode.\n  - Fixed tab ordering to make the app more keyboard friendly\n- LibHB is now used for scanning instead of the CLI\n  - Experimental preview window is now available as a result (can be enabled via preferences)\n- Improved the layout and design of the audio and subtitle tabs\n  - Split buttons similar to the old 0.9.8 WinForms GUI\n  - Improved layout on the track listbox to make better use of the space\n- Improvements to auto-naming feature\n- When Done\n  - Added an option that will reset this to 'Do nothing' when the app is closed and restarted\n- Presets\n  - New presets menu\n  - Presets bar can now be hidden if it's not wanted\n- Numerous bug fixes\n  - Fixed the issue in the source dropdown where the drive menu items did not work when clicked\n  - Numerous fixes in the picture settings panel around resolution calculation\n  - Numerous fixes around the way presets are loaded and saved, particularly around picture settings\n  - Removed Growl for Windows support due to bugs and issues with this library that remain unfixed; project appears abandoned\n  - Many misc other fixes\n- Windows XP is no longer supported; Windows Vista with Service Pack 2 or later is now a requirement\n- The 32-bit build of the application is now considered deprecated; this is due to 32-bit process memory limitations\n\n### Mac\n\n- Build system updates to compile under OS X 10.9 and 10.10\n- Automatic audio and subtitle track selection behaviors which can be stored per preset\n- Improvements to auto-naming feature\n- Misc UI enhancements\n- Bug fixes and misc improvements\n\n### Linux\n\n- Automatic audio and subtitle track selection behaviors which can be stored per preset\n- Improvements to auto-naming feature\n- Batch add-to-queue by list selection\n- Russian and Czech translations\n- Bug fixes and misc improvements\n- Requires GTK3\n\n### Command Line Interface\n\n- Basic support for return codes from the CLI (0 = No error, 1 = Canceled, 2 = Invalid input, 3 = Initialization error, 4 = Unknown Error)\n- Bug fixes and misc improvements\n\n## HandBrake 0.9.9\n\n### General\n\n- Improved HandBrake pineapple icon by Matt Johnson\n- Improved Retina-resolution icons within the application, by [Nik Pawlak](http://nikpawlak.com)\n\n### Core\n\n- Blu-ray (PGS) subtitle support\n  - works with Foreign Audio Search\n  - can be Burned-In\n  - can be passed through to MKV (but not MP4)\n- Additional video framerates\n  - 30, 50, 59.94, 60 fps\n- Double framerate (\"bob\") mode for the deinterlace and decomb filters\n- Better audio remix support\n  - additional mixdowns: 6.1, 7.1, 7.1 (5F/2R/LFE)\n    - CLI users should note 6ch becomes 5point1\n  - better-than-Stereo sources can be upmixed to 5.1\n  - discard one channel from Stereo sources\n    - Mono (Left Only), Mono (Right Only)\n- Allow the selection of higher audio bitrates where appropriate\n- Allow the selection of lower audio samplerates where appropriate\n  - 8, 11.025, 12, 16 kHz\n- Audio dithering (TPDF) when converting to 16-bit FLAC\n- Use libavcodec for DTS audio decoding (instead of libdca)\n  - DTS-ES 6.1 Discrete support\n- All graphical interfaces: support for x264's preset, tune and profile options\n  - alternative to the Advanced panel (which is still available)\n  - HandBrake-specific option to ensure compliance with a specific H.264 level\n- Updated built-in presets\n  - take advantage of x264 preset/tune/profile support\n  - removed increasingly suboptimal and irrelevant Legacy presets\n- Assorted bug fixes and improvements to the core library (libhb)\n- Updated libraries\n  - x264 r2273-b3065e6\n  - Libav v9.6\n  - libbluray 0.2.3\n\n### Windows\n\n- User Interface has been re-written in WPF\n  - Includes many small UI enhancements\n- Switched to .NET 4 Client Profile\n  - smaller download for those who don't have .NET 4 Full installed\n\n### Mac\n\n- Assorted bug fixes\n  - including better support for Retina displays\n- Prevent sleep during encoding and scanning for Mountain Lion\n- Drag & Drop files onto the Main window or application icon to scan\n- Nicer progress indication on the dock icon\n- Preview window improvements and bugfixes\n- Updated Growl to 2.0.1\n  - Notification Center support (when Growl is not installed)\n\n### Linux\n\n- Assorted bug fixes and improvements\n- Use some system libraries rather than bundling\n  - fontconfig, freetype, libxml2, libass, libogg, libvorbis, libtheora and libsamplerate\n\n### Command Line Interface\n\n- Audio option (-a) will ignore invalid input tracks and encode with only the valid ones\n- Allow use of hh:mm:ss format when specifying p-to-p start/stop time\n- Advanced audio options\n  - enable level normalization when downmixing (disabled by default)\n  - disable audio dithering or select a specific algorithm\n\n## HandBrake 0.9.8\n\n- Corrects a few crash bugs that showed up in 0.9.7\n\n## HandBrake 0.9.7\n\n- This is a bug fix release for 0.9.6.\n- Includes an AppleTV3 Preset and updated iPad Preset\n\n## HandBrake 0.9.6\n\n### Encoders\n\n#### Video\n\n- updated libx264 (revision 2146)\n- MPEG-2 encoder (from libavcodec)\n- advanced options support for libavcodec encoders\n  - format: option1=value1:option2=value2\n    - -bf 2 -trellis 2 becomes bf=2:trellis=2\n\n#### Audio\n\n- audio gain control (increase/decrease audio volume)\n- updated libogg (1.3.0) and libvorbis (aoTuV b6.03)\n- new AAC encoder (from libavcodec) (considered experimental)\n  - (supported mixdowns: Mono/Stereo/Dolby, 5.1 will come later)\n  - (should be on par with faac in terms of quality, sometimes better)\n- FLAC encoder (16-bit, MKV container only)\n- Mac OS X: HE-AAC encoding support, via Core Audio\n- quality-based variable bitrate encoding support\n  - works with: Lame MP3, Vorbis, Core Audio AAC\n  - only implemented in CLI and Linux GUI\n- AC3 encoder: set Dolby Surround flag in stream parameters when mixdown is Dolby Surround or Pro Logic II\n\n#### Audio Passthru\n\n- DTS Passthru to MP4 container (in addition to MKV) (supported by e.g. VLC, MPlayer)\n- DTS-HD Passthru (MP4, MKV containers)\n- MP3 Passthru (MP4, MKV containers)\n- AAC Passthru (MP4, MKV containers)\n  - (known issue: Magic Cookie not passed through from MPEG Program/Transport streams, which will break playback in e.g. QuickTime Player)\n- Auto Passthru: one encoder, multiple codecs\n  - lets you define allowed codecs (from supported passthru codecs)\n  - lets you pick a fallback encoder if passthru is not possible\n\n#### Muxers\n\n- start MKV clusters with a video keyframe whenever possible\n  - should improve seeking and DLNA streaming\n- bug fix: use ISO 639-2 bibliographic form for MKV language codes\n- bug fix: fix crash due to division by zero in MP4 muxer\n- bug fix: fix muxing of Closed Captions. Improper interleaving broke playback on some players\n\n### Decoders\n\n#### Video\n\n- updated libav* libraries from Libav (http://libav.org/) (v0.7-1696-gcae4f4b, late October 2011)\n  - frame-based multithreading for H.264, VP8\n  - 10-bit decoding support for H.264, DNxHD\n  - Apple ProRes decoding support\n- improved average framerate detection\n- duplicate frame detection for improved frame drop decision (CFR/PFR)\n- new Same as source, Constant Framerate option\n  - for devices that don't support variable framerate\n  - automatically picks a constant framerate closest to the detected average framerate\n- bug fix: fix problem when resolution changes in the middle of a video stream\n\n#### Audio\n\n- Blu-ray: make TrueHD, DTS-HD and E-AC3 Secondary Audio streams available for decoding and/or passthru\n- bug fix: libavcodec-decoded streams can now be decoded multiple times\n  - previously, multiple decodes of the same source tracks weren't possible and audio output tracks had to be dropped\n- bug fix: fix audio screech at beginning of some audio tracks when decoding AC3\n- bug fix: fix DTS decoder audio volume (was too low)\n- bug fix: garbled audio when decoding DTS-HD audio from MKV containers\n- bug fix: fix support for DTS-HD High Resolution Audio in MPEG Transport streams\n\n### Subtitles\n\n- updated libass (0.10.0)\n- improved handling of subtitles with overlapping timestamps\n- improved handling of DVD subtitles without Stop Display commands\n- SSA subtitles are now passed through to MKV without conversion to SRT/UTF-8\n- bug fix: fix rendering problem with SSA subtitles when no font is embedded in the source video\n\n### Demuxers\n\n- improved MPEG Program/Transport stream support\n  - support for MPEG-1 Program streams\n  - support for HD-DVD EVOB streams\n  - improved handling of Transport streams that have no PCR\n- WTV container support (via libavformat)\n- bug fix: files with more than 20 tracks (video, audio, subtitles etc.) are now supported\n- bug fix: some QuickTime MOV files were misdirected as MPEG Transport streams\n- bug fix: fix detection of TrueType font attachments that don't have the correct MIME type\n\n### Filters\n\n- new, much improved decomb filter (but slower)\n  - new settings are default\n  - old settings become decomb \"Fast\"\n\n### Presets\n\n- improved \"Normal\" preset (much faster, similar file size and quality)\n- removed obsolete legacy presets\n- added new device presets for Android phones/tablets\n  - recent and/or powerful devices recommended\n\n### Mac OS X\n\n#### DVD decryption:\n\n- VLC 2.x or later will not work for DVD decryption and is therefore unsupported as of HandBrake 0.9.6\n- libdvdcss is now the preferred method for DVD decryption\n  - already works with HandBrake 0.9.5\n  - a .pkg installer is available from Videolan: <http://download.videolan.org/libdvdcss/last/macosx/>\n\n#### Build system:\n\n- support for Xcode 4 and Mac OS X 10.7 \"Lion\"\n- Mac OS X 10.5 \"Leopard\" no longer supported\n\n### Mac OS X GUI\n\n#### OS X 10.7 Lion support\n\n- bug fix: Live Preview window widgets updated to work under Lion\n- bug fix: fixed positioning of widgets in the Audio panel under Lion\n\n#### Other:\n\n- wider main window providing more room for various widgets\n\n### Windows GUI\n\n#### Preview window\n\n- complete redesign\n- support for VLC or the system default video player\n- dropped built-in QuickTime playback support\n\n#### Other\n\n- much improved control over the default audio and subtitle tracks selected (see Options)\n- ability to set the minimal title length that will show up during a scan (see Options)\n- several other usability improvements\n- installer now has a silent option for easier network installs (launch the installer with /S)\n\n### Linux GUI\n\n#### Audio panel\n\n- new advanced audio options section for gain and audio track names\n- dynamic range compression and samplerate moved to advanced audio options\n\n#### Other\n\n- minor UI tweaks and usability enhancements\n\n### Miscellaneous\n\n- Target Size is gone, and isn't coming back\n  - Don't bother complaining on the forums\n- CLI: support for x264 presets, tunes and profiles\n  - new --x264-preset, --x264-tune and --x264-profile options\n- DVD: fix issues with some discs (e.g. True Grit, Thor, Transformers 3)\n- DVD: improved main feature detection\n- updated libbluray (0.0.1-pre-213-ga869da8, late May 2011)\n\n## HandBrake 0.9.5\n\n### Core Library\n\n- BluRay disc structure support. (No decryption support)\n- Updated Libraries (x264, ffmpeg)\n- SSA Subtitle support. (Including burn-in)\n- MP3 audio now supported in MP4 files (Note: Limited Player compatibility)\n- VOBSUB subtitle now supported in MP4 files (Note: Limited Player compatibility)\n- Updated Presets for newer devices and better quality\n- AC3 encoding support.\n- Many Bug fixes and other small improvements\n- Improved DVD Main Feature detection (when using dvdnav)\n- Universal audio downmix support (all audio types can be downmixed)\n\n### All GUIs\n\n- Updated x264 Advanced Panel\n- Video Quality Slider drops % value and only shows RF for x264\n- Batch Scan (Scan Multiple files at once. N.B: Does not include multiple VIDEO_TS folders / Image files)\n- Peak framerate option (Capped VFR)\n- Many Bug fixes\n- Many Tweaks to improve usability.\n- Ability to edit queue jobs\n- Point-to-Point encoding (second or frame start and end times)\n\n### Mac GUI\n\n- New Audio Panel supporting >4 Audio Tracks\n- VLC detection in /Applications and ~/Applications\n\n### Windows GUI\n\n- Encode Status in GUI. (CLI window is now always hidden)\n- Improved Auto-Naming for Destination file name.\n- Drag / Drop Video onto Main Window to scan.\n\n### Linux GUI\n\n- Multiple instance support (run multiple copies of ghb at once)\n- Many Bug fixes and UI improvements.\n\n## HandBrake 0.9.4\n\n### Core\n\n- New build system, allowing 64-bit binaries (around 10% faster)\n- Soft subtitles and Closed Captions:\n  - DVD Closed Captions\n  - ATSC Closed Captions\n  - SRT subtitle import\n  - Text soft subtitles in MP4 and MKV output\n  - Bitmap soft subtitles in MKV output\n- Better support for DVD inputs:\n  - Uses libdvdnav\n  - DVD angles support\n  - Workaround for libdvdread malloc bomb on invalid PGC entry\n  - DVD drive region detection support in Linux\n  - Handles DVD programs with more than 16 streams\n  - No longer tries to detect and discard duplicate titles when scanning\n  - Libdvdnav patched to perform read error recovery\n  - Libdvdread patched to allow raw device access in Windows\n  - Handles poorly mastered DVDs that had the menus ripped out of them\n- Better support for non-DVD inputs:\n  - Preserves MP4 metadata\n  - TrueHD\n  - DTS-HD demuxing\n  - 8 bit audio\n  - Better handling of transport streams where audio starts first\n  - Better handling of transport streams that have been spliced together, leading to duplicate timestamps\n  - Better VC-1 frame detection\n  - Fixes bug that was causing one sec. of audio to be dropped on many ffmpeg files\n  - Looks harder for aspect ratio info from DV sources\n  - No longer truncates the last (dummy) chapter\n  - Allows specifying field parity for detelecine and decomb\n- Better AV sync\n- Support for sources with no audio\n- DTS passthru for MKV\n- x264 bumped from r1169 to r1347, which means speed optimizations, new default settings (see r2742 commit comment), the magic of macroblock tree rate control (mbtree), a new CRF curve (meaning you will get different, generally lower bitrates at the same RF, with similar quality metrics), and weighted P-Frames (disabled by default for Baseline encodes and the AppleTV preset).\n- Better sample interleaving\n- Better, optional deinterlacer for decomb (EEDI2)\n- New mode structure for the decomb filter\n- Variable verbose logging levels\n- Fixed timing for first two frames coming out of filters\n- Libtheora bumped to 1.1.0\n- Improvements to our theora implementation (2 pass encoding + soft target rate control)\n- Caters to Theora's insistence on content having mod16 framing dimensions specified\n- Flushes LAME encoder's final packets\n- Fixed interjob framerate calculation\n- Fixed pthreads regression in cygwin\n- Tweaks for packaging tools\n- Solaris 10 build support\n\n### All interfaces\n\n- Live video preview\n- New subtitle tab\n- New filters and picture settings inspector\n- Custom anamorphic mode\n- Updated Sparkle\n- Custom number of preview images\n- Quality slider now works off actual rate factor/quantizer values instead of percentages\n- Partially updated advanced x264 tab\n- New built-in presets\n- Use libdvdnav by default on DVD sources\n- Removed Constant QP encoding option for x264 (use CRF)\n- Various bug fixes and UI tweaks\n- x264 turbo 1st pass mode now uses subme=2 not subme=1\n\n### Mac\n\n- Core Audio AAC encoding\n- H.264 video source decoding crash fixed\n- Queue displays varying row heights based on encode settings\n- Fixed EyeTV package scanning\n- 64bit / 32 bit VLC detection\n- Preset import/export\n\n### Windows\n\n- New audio tab\n- AAC audio source decoding bug fixed\n- Tray minimization is now optional\n- Queue can now be started from main window\n- Growl for Windows notification support\n- General UI improvements\n- Preset import\n- Preferred language control for audio dubs and subtitles\n- Fixed file extensions resetting to m4v when enabling chapter markers in mkv\n- Faster updating of GUI elements from CLI data\n- Cleanup / Improved some of the programs options. (Growl, use m4v, drive detection)\n- Numerous fixes in the Picture Settings Panel and CLI Query Handling code.\n- Bug Fixes and Usability improvements.\n\n### Linux\n\n- General UI improvements\n- Inhibits sleep mode while encoding\n- Single title scan\n- Chapter duration display\n- Notifications when encodes complete\n- Tray minimization\n- Full screen preview\n- Preset import/export\n- Preferred language control for audio dubs and subtitles\n- Preferences rearrangement\n- Preference to auto-apply .m4v extension\n- New system tray icon behavior\n- Preference for what to do when encode completes\n- Preference for how often to delete activity logs\n- Preference to disable automatic scanning\n- New Gnome session manager support\n- Improved \"auto\" audio selection\n- Use .m4v as the default extension for the MPEG-4 container\n- Use .m4v when soft subs are enabled\n- Alternate angle encoding fix\n- Only strips drive letters for Windows builds\n- Show correct audio format info when it's been sanitized for incompatibilities\n- Preserve chapter list modifications made to queued jobs\n- Fixed error when navigating chapter titles with the keyboard\n- Bug Fixes.\n\n### CLI\n\n- Options to handle new subtitle, anamorphic, and preview features\n- --srt-file, --srt-codeset, --srt-offset, --srt-lang, --srt-default\n- --native-dub option lets users request dubbing instead of subs when the audio isn't in their native language\n- Allow encoding sources with no audio without explicitly stating -a none\n- Update checker on MinGW built exe should now work correctly.\n- Matches GUIs' default verbosity level of 1\n\n## HandBrake 0.9.3\n\n- Better PMT processing\n- Basic underlying support for live previews (encode from a seek point for a set number of frames)\n- Better searching for IDR frames in H.264 streams\n- Preset changes (iPhone goes CRF, some old Apple presets resurrected as Legacy)\n- Assorted bug fixes\n\n## HandBrake 0.9.3 Snapshot 5 (SVN revision 1913)\n\n### Core Library\n\n- VC-1 stream input\n- Newer libmp4v2, which fixes the issue with output > 2 gigs in Linux\n- Proper allocation for preview frames\n- Avoids corruption of previews of sources that use widths that aren't cleanly divisible by 8\n- Decodes DTS internally instead of using ffmpeg, to allow mixdowns\n- Better support for DTS in MKV files with implicit timestamps or large timestamp errors\n- Ensures proper chroma size by rounding up when dealing with odd dimensions\n- Ensures \"auto\" samplerate sends a valid value to faac (22050, 24000, 32000, 44100, or 48000)\n- Bumped Theora to 1.0 final\n- Bumped x264 to r1024, which includes Nehalem optimizations as well as speed boosts for things such as b-adapt=2\n\n### Mac GUI\n\n- Allows multibyte characters in chapter titles\n\n### Windows GUI\n\n- Fixes issue parsing presets that use maxWidth and maxHeight (-X and -Y)\n- DRC defaults to 1 now\n- Chapter markers disabled for non-DVD sources\n- Makes sure Normal preset gets loaded\n- Fixes arithmetic overflow crash when scanning\n\n### Linux GUI\n\n- Update checker\n- Limits range of chapters to encode to the number of chapters on the DVD\n- Disabled entry of dimensions larger than the source\n\n### CLI\n\n- Allows overriding of audio (tracks, bitrates, samplerates, codecs, mixdowns) and x264 options in built-in presets\n\n### Documentation\n\n- Documentation updates have begun on the wiki, although they are not yet complete\n\n## HandBrake 0.9.3 Snapshot 4 (SVN revision 1896)\n\n### Core Library\n\n- Converts video in other color spaces to YUV420 (this means DV support)\n- Official, standards-based AC3-in-MP4\n- Tries to base the AV timing for streams off audio when possible\n- Keeps some audio fixes for lost packets in over the air streams from interfering with other sources\n- Handles rendering of sources where the picture resolution changes mid-stream (this fixes the long-standing bug reading a particular episode of Doctor Who)\n- Wider window for clock references (AV sync)\n- Fixed a crash when closing out data for AAC encoding on aborted encodes\n- Rejiggered verbose activity log display to be more laconic by default\n- Updated x264 to r1016, which means b-rdo and bime are gone and replaced with new subme modes\n- DTS and HDMV DTS audio support in streams\n- Doesn't show the audio track button on iPhones/iPod Touches unless there's more than 1 track\n- Tries to avoid garbage data from AC3 sync by searching for two agreeing packets\n- As the MPEG4IP project is defunct, switched to an independently maintained libmp4v2 which has folded in all our cumbersome patches\n- Fixed SunOS compilation\n- Fixed conflict between maxHeight and maxWidth and loose anamorphic\n- Warn in the log when titles are being ignored during scan for lack of audio\n- Fixed bug with Slow/Slowest deinterlacing and decomb which could leave a flickering line at the top or bottom of the screen\n- Extracts audio and subtitle types from DVD sources, to do things like label commentary tracks\n- Better handling of the beginning of AVI and WMV sources that start after time 0\n- Optimize MP4 for web download works with AC3 tracks now\n\n### Mac GUI\n\n- Nested presets\n- Individual activity logs for each encode (stored by default in ~/Application Support/HandBrake, can be co-located with encoded file destination by preference)\n- Allows reading from ZFS volumes\n- Fixed target size mode. It keeps breaking itself. Maybe it should just be put out of its misery...\n- Assorted other improvements\n\n### Windows GUI\n\n- Nested presets\n- Individual activity logs for each encode\n- Slow and slower deinterlacing and decomb work now in Windows\n- Added resizable update window\n- Fixed parsing of non-DVD source audio formats\n- Restored Copy to Clipboard to the Activity Log Window, among other enhancements to it\n- Fixed bug with MKV presets showing up as .m4v\n- Assorted other improvements\n\n### Linux GUI (GTK)\n\n- Nested presets\n- Individual activity logs for each encode\n- Allows pending queue items to be removed, and reloaded in the main window for editing\n- Better handling of HD previews\n- Assorted other improvements\n\n### CLI\n\n- Updated presets to the equivalent of the nested ones in the GUIs\n- Allows setting custom audio track names in MP4 files\n- Allows selection of the COLR atom in MP4 files, between Bt.601 and Bt.709\n- Fixed reading of device paths in OS X\n\n### A special note on the new presets (they're collapsible-triangle-folder-thing-errific!)\n\n- Deux Six Quatre, Blind, Broke, and Bedlam are gone. They were dead weight.\n- iPod Low-Rez is now iPod Classic & iPod Nano\n- iPod High-Rez is now iPod Legacy\n- iPhone / iPod Touch is now iPhone & iPod Touch, so take care CLI users\n- Animation and Television now use the decomb and detelecine (VFR) filters\n- High Profile presets now use psy-trellis and the new subme 9 mode with B-frame RD refinement\n- AppleTV is now CRF, so sizes will vary with content\n- PS3 preset should be fixed\n- Constant Quality Rate still needs its quality % lowered, probably\n\nThe keen reader is already asking \"iPod Legacy? WTF is iPod High-Rez called iPod Legacy now?\"\n\nThe answer is Universal.\n\nThe Universal preset is designed to play on all modern iPods (anything newer than the iPod 5.5G). It also plays on iPhones. It also plays on AppleTVs. It should also play just about anywhere else, hence the name. It is full anamorphic DVD resolution--no tricks with downscaling like stuff from the iTunes Store. It includes chapters, and has the first audio track in both AAC (DPL2 downmixed) and AC3 pass-thru, just like the AppleTV preset. In fact, it should give the same quality as the AppleTV preset, but faster...and at a larger file size. Like the AppleTV preset, it used CRF, so sizes will vary.\n\n## HandBrake 0.9.3 Snapshot 3 (SVN revision 1797)\n\n### Core Library\n\n- Universal input support, utilizing libavcodec from the FFmpeg project for decoding non-MPEG-2 video\n- Newer, faster, better version of the x264 codec, including psychovisual optimizations\n- Better AV sync through full compliance with the MPEG Standard Target Decoder timing model\n- More accurate auto-cropping\n- Support for New Zealand and Norwegian HDTV broadcasts (H.264 and AAC-LATM in MPEG-TS)\n- Detelecine is now \"VFR detelecine\" by default, dropping some frames and extending others to make up lost time, old behavior of keeping duplicate frames is enabled by selecting a framerate besides \"Same as source\"\n- Threaded deinterlacing in Slow and Slower modes\n- Threaded and entirely rewritten decomb filter\n- Better audio resampling interpolator\n- Better gamma in QuickTime through the use of the COLR MP4 atom\n- Better constant quality encoding when using FFmpeg\n- Hopefully better cache and virtual memory performance by recycling buffers that were most recently used instead of least\n- Fix for MP4s with \"negative duration\" errors.\n- Set the detelecine filter to work better with PAL by using \"loose\" breaks\n- Fix for missing initial H.264 NAL units, improves reliability of 8x8dct\n- Fix for subtitle-scan with XviD encoding\n- Fix for crash at the end of 2nd pass using x264\n- Deblock filter works now\n- Rewritten update system, so the core library can read a portion of Sparkle appcasts.\n- Updates for libsamplerate, libogg, xvidcore, libtheora, libmpeg2, lame, faac, and of course ffmpeg and x264.\n\n### Mac GUI\n\n- Entirely rewritten and far more flexible queue that can be saved between sessions, capable of preserving queued items after a crash\n- Now requires vlc 0.9.xx to read protected dvd's in the users /Applications folder\n- Fix for 4x3 loose anamorphic to keep it from downscaling\n- Countless other improvements\n\n### Windows GUI\n\n- Resolution calculation\n- Better preset bar\n- Better queue (including queue recovery feature)\n- Better activity log window\n- Improved UI (layout changes, animated x264 options, DVD drive detection, duration displayed)\n- More options - includes support for custom auto name format & starting the CLI minimized\n- Countless other improvements\n\n### Linux GUI (GTK)\n\n- It's alive!\n\n### Known Issues in Snapshot 3\n\n- Possibility of a flickering line at the top or bottom of the frame after Slow or Slower deinterlacing or decombing\n- Input bitrate display may be off by a factor of 100 for H.264-in-TS sources\n- Constant Quality Rate preset probably needs a lower quality level (60% - 55%)\n- With non-DVD sources that don't have AC3 audio, you can't encode 1 input audio track to multiple output audio tracks\n- Slow and Slower deinterlacing and decombing are BROKEN in Windows\n- QuickTime won't read Xvid-in-MP4 output, although VLC will\n- Windows GUI does not detect all audio tracks from non-DVD sources\n\n## HandBrake 0.9.3 Snapshot 2 (SVN revision 1477)\n\n### Core Library\n\n- Anamorphic PAR for the AVI container\n- Allow constant frame rates when they different from the source's frame rate (otherwise pass through the variable MPEG-2 frame durations )\n- Decomb filter (selectively deinterlaces when it sees interlacing in the frame)\n- Filter bug fixed, that would skip any filters after detelecine, if VFR wasn't enabled\n- Loose anamorphic + FFmpeg video bug fixed\n\n### Windows GUI\n\n- Title dropdown list bug fixed\n- Missing log file bug fixed\n\n### CLI\n\n- Default audio samplerate changed to 48kHz, audio bitrate changed to 160kbps.\n- Samplerate entry bug fixed\n\n## HandBrake Snapshot 1 (SVN revision 1457)\n\n### Core Library\n\n- New audio subsystem (no more AAC+AC3, control each track's codec and settings individually)\n- Removed libdvdcss (HandBrake no longer decrypts DVDs on its own, will use VLC to do so if it's available)\n- Added Theora encoder\n- Fixed x264-in-avi and ffmpeg-in-avi\n- Fixed xvid\n- More accurate scaling\n- Major sync improvements\n- Major stream improvements\n- AAC+AC3 support in MKV\n- MKV seeking fixes\n- Make sure subtitles get displayed long enough to read them\n- Updated VBV 2-pass and VBV 1-pass patch for x264\n- Adaptive Quantization for x264\n- Recover from bad preview scans\n- Recover from invalid PGNs\n- Fixed vorbis bitrate control\n- Snapshot builds\n\n### Mac\n\n- New audio interface\n- Loads libdvdcss from VLC at runtime if it's present on the user's system\n- No more general-purpose \"Codecs\" menu -- set video and audio codecs individually\n- More robust preset system, in preparation for nested presets\n- Made 64-bit MP4 file widget more prominent\n- Only allow useful x264 options in the advanced tab\n- Various fixes and improvements\n\n### Windows\n\n- New x264 tab\n- New audio interface\n- Various fixes and improvements\n\n### CLI\n\n- New audio interface\n\n## HandBrake 0.9.2\n\n### Core\n\n- AC3 in MP4 support\n- Multi-track audio support for Apple devices\n- Better handling of audio discontinuities\n- More flexible, \"loose\" anamorphic\n- Variable frame rate encoding\n- MP4 optimization for progressive downloads\n- Dynamic range compression for encoding from AC3 audio\n- Ability to encode an audio stream and pass it through at the same time\n- iPhone-compatible anamorphic (pasp atom)\n- Robust program and transport stream support\n- Better handling of DVD read errors from invalid VOB units\n- Detects and works around missing end of cell markers\n- Recovers from loss of signal in a stream\n- Drops subtitles less often\n- Keeps chapter markers in better sync and prevents duplicates\n- Better handling of B-Frames\n- Tunes FIFO sizes by CPU count\n- Finally squashes the bug that cut off the end of movies\n- Preset changes\n- Standardizes on standard out for progress and standard error for everything else.\n- Correct channel counts when passing AC3 audio to Matroska\n- Tag MP4 files as encoded with HandBrake\n- No more merging short chapters\n- Newer copies of x264,\n- VBV 2-pass patch for x264\n- Sets keyframes for x264 by frame rate.\n- Support for >2GB MKV files in Linux\n- Code audio languages in a way QuickTime understands\n- Better subtitle positioning\n- Fewer crashes in 2-pass encoding\n\n### Mac\n\n- Leopard Only\n- Sparkle\n- Reads .eyetv files as well as .dvdmedia files\n- Much better queue\n- More white space\n- Code restructuring\n- Activity window logging, complete with a \"black box recorder\" for crashes\n- Ability to open a single title for a DVD instead of scanning the whole thing\n- Warns people when they try to queue up two files with the same name\n- Maintains picture filter states between jobs\n- .xib Interface Builder files SVN can track\n- Switches to NSImageView for previews, so no more useless OpenGL effects\n- Temporary loss of localizations for foreign languages (the old system was broken anyway)\n- Separate filter settings for every queued job\n\n### Win\n\n- Revamped preset system\n- Sparkle-compatible update checker\n- Activity log window\n- CLI built-in preset parsing\n- No more admin rights required in Vista\n- Handles more display resolutions\n\n### CLI\n\n- Built-in presets\n- Short names for denoising (weak, medium, strong) and deinterlacing (fast, slow, slower)\n- Solaris port\n- No more x264b30 (use -e x264 -I -x level=30:cabac=0 instead or better yet an iPod preset)\n- Chapter marker .csv input fixed\n- CRF as default quality mode for x264, now -q is CRF and if you want CQP add -Q to it\n\n## HandBrake 0.9.1\n\n### Core HandBrake Changes\n\n- Added: Forced subtitle support\n- Added: 6-channel Vorbis audio\n- Changed: Much better buffer management, leading to impressive speed-ups all over the place\n- Changed: Color subtitles now display in color, instead of being transparent.\n- Changed: All errors to stderr with hb_log() instead of to stdout with fprintf()\n- Changed: Accept stream input where the file type is in caps (.VOB instead of just .vob, etc)\n- Changed: Better quality Vorbis codec (AoTuV)\n- Changed: Faster (threaded) ffmpeg\n- Changed: Force x264 to use a key frame at chapter markers\n- Changed: Try to recover from bad preview scans instead of crashing\n- Fixed: No more hanging when using MKV with chapter markers\n- Fixed: \"Same as source\" FPS now works correctly when the end-credits of a progressive film are interlaced.\n- Fixed: \"Slow\" deinterlacing no longer doubles up the chapter markers\n- Fixed: Proper display of fading subtitles\n- Fixed: Nasty artifacts from inaccurate rounding in the video scaler\n- Fixed: Improved compatibility with streams that have missing/misplaced PMTs\n- Assorted other changes\n\n### Mac Changes\n\n- Changed: Bigger buffer for the Activity Log\n- Changed: Redesigned Queueing window\n- Changed: Redesigned Preferences window\n- Changed: Structural reorganization of the code into more segmented files\n- Fixed: Closing the main window no longer causes HandBrake to quit\n- Fixed: Changing dimensions in Picture Settings no longer causes a crash\n- Fixed: Target size bitrate calculation\n- Fixed: Picture Settings previews now scale to display resolution and screen size\n- Assorted other changes\n\n### Windows Changes\n\n- Added: More robust exception handling\n- Added: On-completion options to shutdown, suspend, etc\n- Added: Turn tooltips on or off\n- Changed: Open source, NullSoft installer\n- Fixed: Add-to-queue issues\n- Fixed: Foreign language issues\n- Assorted other changes\n\n## HandBrake 0.9.0\n\n### Core HandBrake Changes\n\n- Added: Matroska (MKV) container output\n- Added: Limited MPEG-2 transport stream (.VOB and .TS) input support\n- Added: Option to write MP4 files larger than 4GB\n- Added: Video filters (pullup, yadif, mcdeint, hqdn3d, pp7)\n- Added: DTS audio input\n- Changed: Switched to Lanczos scaling from libswscale\n- Changed: Precise chapter marker location\n- Changed: Newer libraries\n- Changed: Much faster (threaded) iPod encoding\n- Changed: \"Same as source\" works differently (better?) now\n- Fixed: Audio drops should be thoroughly banished now\n- Fixed: MP2 audio support\n- Assorted other changes\n\n### CLI Changes\n\n- Added: Chapter naming\n- Added: Many new command line options for subtitles and filters.\n- Added: Turbo for 2-pass x264 encodes\n- Assorted other changes\n\n### Mac Changes\n\n- Added: Chapter naming\n- Added: Growl support\n- Added: Advanced x264 settings tab\n- Added: Logging window\n- Added: Turbo for 2-pass x264 encodes\n- Added: Many new presets\n- Added: Unified toolbar\n- Changed: Default settings\n- Changed: Further integration of the queue and active queuing\n- Changed: Browse DVDs like any other volumes\n- Fixed: No more floating window syndrome (Mac)\n- Fixed: Presets retain \"magic sauce\" when you change settings\n- Assorted other changes\n\n### Windows Changes\n\n- Changed: New C#-based Windows GUI front-end\n- Changed: Improved queuing\n- Changed: DVD information parser\n- Assorted other changes\n\n## HandBrake 0.8.5b1\n\n### Core HandBrake Changes\n\n- Added: iTunes-style chapter markers.\n- Added: 5.1 AAC surround sound.\n- Added: Dolby Pro Logic I and II downmixing of discrete surround sound.\n- Added: 1-channel AAC sound from monophonic sources.\n- Added: Advanced x264 options. (including High Profile support)\n- Added: B-frames in x264 + .mp4\n- Added: PPC Linux Support.\n- Added: Preserve language IDs from the DVD in .mp4\n- Added: Snapshot build method.\n- Added: Anamorphic video display in QuickTime.\n- Changed: Renamed back to HandBrake.\n- Changed: Libraries updated.\n- Changed: Enabled Update Checker.\n- Fixed: Multiple Audio tracks.\n- Fixed: Sped up DVD scanning time by being nicer to libdvdread.\n- Fixed: .dmg is now mountable in Mac OS X versions older than 10.4\n- Fixed: Proper output size from x264 in target size mode.\n- Fixed: Allows output sizes larger than 2 gigs in Linux.\n- Fixed: Several small memory leaks have been plugged.\n- Fixed: Fixes for 64-bit systems.\n- Fixed: Keep Aspect Ratio is no longer forced, so user-set height values are respected.\n\n### CLI Interface Changes\n\n- Added: Customize maximum width and height while keeping aspect ratio\n- Changed: Much prettier help screen\n- Changed: HBTest/MediaForkCLI renamed to HandBrakeCLI\n- Fixed: Better display of audio and subtitle ids\n\n### Mac GUI Changes\n\n- Added: Presets! Includes initial ones for AppleTV, iPod, and PS3.\n- Added: Preference option to auto-name output files with the DVD name and title number.\n- Added: Preset support for x264 options.\n- Changed: Remembers last destination path.\n- Changed: Remembers last source path.\n- Changed: Copy and paste in text fields.\n- Changed: Updates target size more quickly.\n- Changed: Mac GUI no longer retains target size values between enqueued jobs. (http://HandBrake.m0k.org/forum/viewtopic.php?t=249)\n- Fixed: Preview frames are no longer distorted in anamorphic mode.\n- Fixed: Mac GUI no longer floats above other windows.\n- Fixed: Browse by file no longer dims the browse button preventing you from changing browse locations without switching back and forth between it and drive selection. (http://HandBrake.m0k.org/forum/viewtopic.php?t=342)\n- Fixed: Makes sure destination directory is valid.\n- Fixed: Fills in the file save field with the current output name instead of leaving it blank.\n- Fixed: Update destination field with the current path instead of using the last one, which could have been a DVD.\n\n### Windows GUI Changes - Version 2.2 beta 1\n\n- Added: A few presets for the iPod in the menu.\n- Added: Ability to set default settings for all program encode options.\n- Added: Ability to turn off Automatic Update check on start-up. See Tools > Options\n- Added: Mod 16 check on the Height and Width boxes.\n- Added: Check the amount of hard disk space left is not running low when saving file.\n- Added: Option to have a Read DVD window showup on start-up.\n- Added: ìView DVD dataî Menu item in the tools menu.\n- Added: Links to the Homepage, forum, wiki and documentation page in the Help menu.\n- Added: Chapter markers check box (New feature in 0.8.5b1 CLI)\n- Changed: View DVD Information no longer appears after clicking the ìBrowseî button.\n- Changed: A few changes to the GUI - replaced textboxes with Dropdowns which auto-populate.\n- Changed: Auto Crop and Aspect text now automatically update when a new title is selected.\n- Changed: Several tweaks to the GUI design, remove a few text items that are no longer needed.\n- Changed: Ability to Queue videos enabled with completely re-written code.\n- Changed: Ability to queue stuff up while the encoding process is running.\n- Changed: Ability to remove items from the encode queue while is running.\n- Changed: Anamorphic option blanks out resolution boxes.\n- Changed: Re-written update checker.\n- Changed: Ability to turn off update check on start-up in Tools > Options\n- Changed: Auto Crop option now fills in figures into text boxes when selected.\n- Changed: Mp4 now default output file extension.\n- Changed: Enabled 5.1 AAC option.\n- Changed: Enabled h264 advanced options.\n- Changed: Updated the FAQ.\n- Changed: Included new version of HandBrake. Version 0.8.5b1.\n- Fixed: Pixel Ratio Not being saved with the profile.\n- Removed: Both ìView Dataî buttons on the Title Selection Window.\n- Removed: The ìRead DVDî button. -  Automatically reads the DVD after selecting a source now.\n- Removed: The Help and Support window. Been replaced with a few Web Links.\n\n## HandBrake 0.8.0\n\n- MediaFork project forked from HandBrake source <http://handbrake.m0k.org/>\n- Updated libraries (meaning better quality, hopefully fewer bugs, and increased speeds)\n- iPod 5.5G support\n- Revamped graphical interface (Mac OS X)\n- Anamorphic encoding with pixel aspect ratio\n- Brighter color reproduction in QuickTime\n- Lists disks by DVD name instead of by drive name (Mac OS X)\n- Titles output movies based on the DVD name (Mac OS X)\n- 32Khz audio output\n- Constant rate factor encoding with x264\n- New preference item to turn deinterlacing on by default (Mac OS X)\n- New preference item to select the default audio language (Mac OS X)\n- Bugfix for reading straight from a DVD\n\n## HandBrake 0.7.1\n\n- Universal Binary for PPC and Intel\n- Bugfixes for missing subtitles, audio glitches with LPCM tracks and more\n\n## HandBrake 0.7.0\n\n- Multithreaded H.264 encoding with x264\n- Added option for H.264 Baseline (suitable for iPods)\n- (Very) experimental queue support\n- Fixes for some DVD titles HandBrake would not recognize\n- Fixes audio glitches when encoding from LPCM tracks\n\n## HandBrake 0.7.0-beta3\n\n- Chapters selection\n- Custom framerate\n- Subtitle support\n- Check for updates\n- Custom aspect ratio\n- Audio samplerate selection\n- mp4/H.264 output\n- Proper NTSC support\n- AC3 pass-through\n- Progress bar in the dock icon (OS X)\n- 2-pass H.264 encoding\n- Constant quality encoding\n- Grayscale encoding\n- Up-to-date BeOS UI\n\n## HandBrake 0.6.2\n\n- Support for DVDs with MPEG audio tracks\n- Rewrote the DVD navigation code\n- High quality resampler included\n- Better AVI compliance\n- Updated encoders\n- Internal improvements\n- Bugfixes\n\n## HandBrake 0.6.1\n\n- Fixed LPCM endianness issue\n\n## HandBrake 0.6.0\n\n- MP4 and OGM output\n- AAC and Vorbis encoding\n- Experimental H264 encoding\n- LPCM DVDs support\n- Autocrop\n- GTK2 linux interface\n- OS X interface localization\n\n## HandBrake 0.5.2\n\n- Bugfixes\n\n## HandBrake 0.5.1\n\n- 2-pass XviD encoding\n- Bugfixes\n\n## HandBrake 0.5\n\n- Bugfixes, rewrite of large parts of the core\n- XviD encoding (1-pass only)\n\n## HandBrake 0.4\n\n- Better multithreading\n- Allow the user to specify a target size instead of bitrate\n- Misc GUI enhancements\n- Use low-priority threads on OS X\n\n## HandBrake 0.3\n\n- OSX & Linux ports\n- Allow 2-pass encoding\n- Many internal changes & fixes\n\n## HandBrake 0.2\n\n- Fixed a major bug that made HandBrake probably crash after ~ 15\n   minutes encoded\n- Fixed a few minor memory leaks\n\n## HandBrake 0.1.1\n\n- Fixed a stupid bug that prevented to scan volumes correctly if FAT/NTFS/etc volumes were mounted\n\n## HandBrake 0.1\n\n- Automatically detect ripped DVDs on BFS volumes\n- Allow picture cropping and resizing\n- Allow dual-audio encoding\n- Created files are quite compliant now (tested with OSX/Quicktime and BSPlayer)\n- Better A/V sync with some DVDs\n\n## HandBrake 0.1-alpha2\n\n- Show length for each title\n- Fixed the screwed-audio bug\n- Many bugfixes...\n\n## HandBrake 0.1-alpha\n\n- First version.\n\n"
        },
        {
          "name": "README.markdown",
          "type": "blob",
          "size": 2.9697265625,
          "content": "# HandBrake [![macOS Build](https://github.com/HandBrake/HandBrake/workflows/macOS%20build/badge.svg)](https://github.com/HandBrake/HandBrake/actions?query=workflow%3A%22macOS+build%22) [![Windows Build](https://github.com/HandBrake/HandBrake/workflows/Windows%20Build/badge.svg)](https://github.com/HandBrake/HandBrake/actions?query=workflow%3A%22Windows+Build%22) [![Linux Build](https://github.com/HandBrake/HandBrake/workflows/Linux%20Build/badge.svg)](https://github.com/HandBrake/HandBrake/actions?query=workflow%3A%22Linux+Build%22)\n\n\nHandBrake is an open-source video transcoder available for Linux, Mac, and Windows, licensed under the [GNU General Public License (GPL) Version 2](LICENSE).\n\nHandBrake takes videos you already have and makes new ones that work on your mobile phone, tablet, TV media player, game console, computer, or web browser—nearly anything that supports modern video formats.\n\nHandBrake works with most common video files and formats, including ones created by consumer and professional video cameras, mobile devices such as phones and tablets, game and computer screen recordings, and DVD and Blu-ray discs. HandBrake leverages tools such as FFmpeg, x264, and x265 to create new MP4 or MKV video files from these *Sources*.\n\nFor information on downloading, building/installing, and using HandBrake, see the official [HandBrake Documentation](https://handbrake.fr/docs).\n\n## Community Support\n\nVisit the [HandBrake Community Forums](https://forum.handbrake.fr/).\n\nFor information on HandBrake's community support channels, please see [Community Support](https://handbrake.fr/docs/en/latest/help/community-support.html).\n\nOur [community rules](https://forum.handbrake.fr/app.php/rules) and [code of conduct](https://github.com/HandBrake/HandBrake/blob/master/CODE_OF_CONDUCT.md) apply to both our site and GitHub.\n\n\n## Contributing\n\nWe welcome most contributions. While it is our goal to allow everyone to contribute, contributions not meeting the project's goals or  standards may be rejected.\n\nPlease read our [guide to contributing](https://handbrake.fr/docs/en/latest/contributing/contribute.html). This will provide you with all the information you need to start contributing to the project. \n\n## Translations\n\nWe are now accepting translations via  [Transifex](https://www.transifex.com/HandBrakeProject/public) \n\nPlease read our [Translations Guide](https://github.com/HandBrake/HandBrake/blob/master/TRANSLATION.markdown) and follow the instructions if you are interested in joining the translation effort.\n\n\n## Additional Information\n\n[Application / Project Information](https://github.com/HandBrake/HandBrake/wiki/Application-Information)  \n[Authors](AUTHORS.markdown)  \n[License](LICENSE)  \n[News](NEWS.markdown)  \n\n## Special Thanks\n\n<a href=\"https://www.macstadium.com/\"><img width=\"200\" alt=\"MacStadium\" src=\"https://uploads-ssl.webflow.com/5ac3c046c82724970fc60918/5c019d917bba312af7553b49_MacStadium-developerlogo.png\"></a>\n\nand to many others who have contributed! [Thanks](THANKS.markdown)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.419921875,
          "content": "# Security Policy\n\n## Reporting a Vulnerability\n\nIf you believe you’ve found a security vulnerability in HandBrake or our website (https://handbrake.fr) please use the \"Report a vulnerability\" button on the [Security Tab](https://github.com/HandBrake/HandBrake/security) above.\n\nContributors to this project are also available in [#handbrake on Libera.chat IRC](https://libera.chat/) (irc://irc.libera.chat:6697/#handbrake).\nPlease note, #handbrake and #handbrake-dev are public so details should only be send to contributors via private message.\n\n\n## Responsible Disclosure\n\nWe kindly ask that you use responsible disclosure practices when alerting us to any security related issues.\nThis allows us time to investigate and take corrective action where necessary. \n\nOur goal is to deal with any issues reported as quickly as possible.  If you do not receive a direct response from us within 24 hours, please follow up with us as we may not have received the message.\n\n## Notices\n\nHandBrake is a volunteer project and we are not funded. As such, we do not participate in bug bounty programs or pay out for bugs raised.\n\n## Versions\n\nWe accept bug reports (including security reports) for the following versions:\n\n| Version                | Accepts Reports    |\n| ---------------------- | ------------------ |\n| git main (development) | :white_check_mark: |\n| 1.9.x                  | :white_check_mark: |\n| Earlier Releases       | :x:                |\n"
        },
        {
          "name": "THANKS.markdown",
          "type": "blob",
          "size": 5.5302734375,
          "content": "# HandBrake Thanks\n\n## Open Source Libraries\n\nHandBrake uses many cool libraries from the GNU/Linux world. We thank them and their authors.\n\n| Library | License | Notes |\n| ------- | ------- | ----- |\n| [AMD AMF](https://github.com/GPUOpen-LibrariesAndSDKs/AMF) | [MIT](https://github.com/GPUOpen-LibrariesAndSDKs/AMF?tab=License-1-ov-file#readme) ||\n| [ffmpeg](https://ffmpeg.org/) | [L-GPL v2.1](https://git.ffmpeg.org/gitweb/ffmpeg.git/blob_plain/refs/heads/master:/COPYING.LGPLv2.1) ||\n| [libass](https://github.com/libass/libass) | [ISC](https://github.com/libass/libass?tab=ISC-1-ov-file#readme) ||\n| [libbluray](https://www.videolan.org/developers/libbluray.html) | [L-GPL v2.1](https://code.videolan.org/videolan/libbluray/-/blob/master/COPYING) ||\n| [libbzip2](https://sourceforge.net/projects/bzip2/) | BSD-Like ||\n| [libdav1d](https://code.videolan.org/videolan/dav1d) | [Simplified BSD License](https://code.videolan.org/videolan/dav1d/-/blob/master/COPYING?ref_type=heads) ||\n| [libdovi](https://github.com/quietvoid/dovi_tool) | [MIT](https://github.com/quietvoid/dovi_tool/blob/main/LICENSE) ||\n| [libdvdnav](https://www.videolan.org/developers/libdvdnav.html) | [GPL v2](https://code.videolan.org/videolan/libdvdnav/-/blob/master/COPYING) ||\n| [libdvdread](https://www.videolan.org/developers/libdvdnav.html) | [GPL v2](https://code.videolan.org/videolan/libdvdread/-/blob/master/COPYING) ||\n| [libfontconfig](https://freedesktop.org/wiki/Software/fontconfig/) | [MIT](https://gitlab.freedesktop.org/fontconfig/fontconfig/-/blob/main/COPYING) ||\n| [libfreetype](https://freetype.org/) | [GPL v2](https://freetype.org/license.html) ||\n| [libgnurx](https://sourceforge.net/projects/mingw/files/Other/UserContributed/regex/mingw-regex-2.5.1/) | L-GPL v2.1 ||\n| [libharfbuzz](https://www.freedesktop.org/wiki/Software/HarfBuzz/) | [MIT Old](https://github.com/harfbuzz/harfbuzz?tab=License-1-ov-file#readme) ||\n| [libiconv](https://www.gnu.org/software/libiconv/) | [L-GPL v2.1](https://www.gnu.org/licenses/old-licenses/lgpl-2.1.en.html) ||\n| [libjansson](http://www.digip.org/jansson/) | [MIT + Other](https://github.com/akheron/jansson?tab=License-1-ov-file#readme) ||\n| [libjpeg-turbo](https://github.com/libjpeg-turbo/libjpeg-turbo) | [BSD 3-Clause](https://github.com/libjpeg-turbo/libjpeg-turbo?tab=License-1-ov-file#readme) ||\n| [liblame](http://lame.sourceforge.net/) | [L-GPL](https://lame.sourceforge.io/) ||\n| [liblzma (xz)](https://tukaani.org/xz/) | [BSD Zero Clause](https://git.tukaani.org/?p=xz.git;a=blob;f=COPYING.0BSD) ||\n| [libmfx](https://github.com/intel/libvpl) | [MIT](https://github.com/intel/libvpl/blob/main/LICENSE) ||\n| [libogg](https://xiph.org/ogg/) | [BSD 3-Clause](https://gitlab.xiph.org/xiph/ogg/-/blob/master/COPYING) ||\n| [libopus](https://www.opus-codec.org/) | [BSD 3-Clause](https://www.opus-codec.org/license/) ||\n| [libspeex](https://www.speex.org/) | [BSD 3-Clause](https://gitlab.xiph.org/xiph/speex/-/blob/master/COPYING) ||\n| [libtheora](https://theora.org/) | [BSD 3-Clause](https://gitlab.xiph.org/xiph/theora/-/blob/master/COPYING) ||\n| [libvorbis](http://vorbis.com/) | [BSD 3-Clause](https://gitlab.xiph.org/xiph/vorbis/-/blob/master/COPYING) ||\n| [libvpx](https://github.com/webmproject/libvpx/) |[BSD 3-Clause](https://github.com/webmproject/libvpx/?tab=BSD-3-Clause-1-ov-file#readme) ||\n| [libx264](https://www.videolan.org/developers/x264.html) | [GPL v2](https://www.videolan.org/developers/x264.html) ||\n| [libx265](http://x265.org/) | [GPL v2](https://www.x265.org/x265-licensing-faq/) ||\n| [libzlib](http://zlib.net/) | [License](https://zlib.net/zlib_license.html) ||\n| [NV-codec-headers](https://git.videolan.org/?p=ffmpeg/nv-codec-headers.git) | MIT ||\n| [SVT-AV1](https://gitlab.com/AOMediaCodec/SVT-AV1) | [BSD 3-Clause Clear](https://gitlab.com/AOMediaCodec/SVT-AV1/-/blob/master/LICENSE.md) ||\n| [zimg](https://github.com/sekrit-twc/zimg) | [WTFPL](https://bitbucket.org/the-sekrit-twc/zimg/src/master/COPYING) | |\n| [GongSolutions.WPF.DragDrop](https://github.com/punker76/gong-wpf-dragdrop) | [BSD 3-Clause](https://github.com/punker76/gong-wpf-dragdrop/blob/develop/LICENSE) | Windows UI Only |\n| [Autofac](https://autofac.org/) | [MIT](https://github.com/autofac/Autofac/blob/develop/LICENSE) |  Windows UI Only |\n| [Sparkle](https://sparkle-project.org/) | [BSD + MIT](https://github.com/sparkle-project/Sparkle?tab=License-1-ov-file#readme) |  Mac UI Only |\n| [libfdk-aac](https://sourceforge.net/projects/opencore-amr/) | Custom - In Source | HandBrake does not ship with this library but can be built with it for personal use only. |\n\n\n## Services and Software\nThe following services and tools help with the development of HandBrake but are not directly used within the application.\n\n- [handbrake.fr](https://handbrake.fr) web hosting courtesy of Eric Petit\n- [Libera.Chat IRC](https://libera.chat/)\n- [GitHub](https://github.com)\n- [phpBB](http://www.phpbb.com/)\n- [MacStadium](https://www.macstadium.com/) MacMini Server Hosting. \n<img width=\"200\" alt=\"MacStadium\" src=\"https://uploads-ssl.webflow.com/5ac3c046c82724970fc60918/5c019d917bba312af7553b49_MacStadium-developerlogo.png\">\n\n\n## Graphics\n\n- Modernised application icon by Matt Johnson <mattdog.100@gmail.com>\n- Toolbar icons by [Nik Pawlak](http://nikpawlak.com) <holla@nikpawlak.com> [@nikpawlak](https://twitter.com/nikpawlak)\n\n\n## And Many More...\n\nThanks to all who have contributed to HandBrake by testing releases, submitting patches, providing test sources, supporting HandBrake's users on our Community Forums, and more. You are all too many to name, but we're entirely grateful for your years of support.\n\n"
        },
        {
          "name": "TRANSLATION.markdown",
          "type": "blob",
          "size": 2.6142578125,
          "content": "# Translating HandBrake\n\nWe use Transifex to manage the translation resources for this project.\nPlease see: [Transifex - HandBrake Public Page](https://www.transifex.com/HandBrakeProject/public/)\n\n## Requirements and Rules\n\nWhile we wish to welcome contributions from people, we need to have some ground rules to make sure translations run smoothly. \n\n- Contributors must have fluent verbal and written English. (English is the base language used for translation.)\n- You must not use a translation service to aid translation. If anything is unclear, please ask!\n- Our [Code of Conduct](https://github.com/HandBrake/HandBrake/blob/master/CODE_OF_CONDUCT.md) and [Community Rules](https://forum.handbrake.fr/app.php/rules) must be followed.\n\n\n## How to become a translator \n\n1. Please submit a join request on transifex for the relevant GUI that you currently use.\n2. Create a \"Translation Request\" GitHub issue\n3. We will then discuss the request and make a decision whether to accept or reject it.\n\n\n## Requesting a Language\n\nHandBrake is managed by a very small team of contributors and as such, we do not have the resources to support translations for every language that may be requested and keep all the user interfaces in sync. As such, we welcome anyone who is willing to help by submitting pull requests to keep the user interface language files in sync with the translations available on [Transifex](https://www.transifex.com/HandBrakeProject/public/).\n\nLanguages that fall out of date or lack sufficient maintainers may be removed from the UI until such time they are in a suitable state.\n\nYou can request a language on the [Transifex - HandBrake Public Page](https://www.transifex.com/HandBrakeProject/public/)\n\n\n## Viewing Updated Translations\n\nAfter a pull request including the latest changes imported from Transifex is accepted and merged, you can view the updated translations in our development snapshot builds.( https://github.com/HandBrake/HandBrake-snapshots )\n\nFor macOS and Windows, these are typically published twice weekly.  \nLinux builds are currently published on an ad-hoc basis but will usually be pushed after a translation update.\n\n\n## HandBrake Release Policy (String Freeze)\n\nDue to the small and volunteer nature of the team, it's difficult to plan our releases with precision. However, we will typically try to provide 2 to 4 weeks notice via a post on Transifex when we think there may be a new HandBrake release coming. \n\nDuring this time, we will try and avoid making any string changes as much as possible. We may have to do so in the case of bugs however we are generally trying to avoid refactoring / new features during this time. \n\n\n\n\n"
        },
        {
          "name": "configure",
          "type": "blob",
          "size": 0.3896484375,
          "content": "#!/bin/sh\n\ninpath()\n{\n    IFS=:\n    for d in $PATH\n    do\n        if [ -x $d/$1 ]; then\n            return 0\n        fi\n    done\n    return 1\n}\n\nfor p in python3 python3.11 python3.10 python3.9 python3.8 python3.7 python3.6 python\ndo\n    if ( inpath $p ); then\n        exec $p `dirname $0`/make/configure.py \"$@\"\n        exit 0\n    fi\ndone\n\necho \"ERROR: no suitable version of python found.\"\nexit 1\n"
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "graphics",
          "type": "tree",
          "content": null
        },
        {
          "name": "gtk",
          "type": "tree",
          "content": null
        },
        {
          "name": "libhb",
          "type": "tree",
          "content": null
        },
        {
          "name": "macosx",
          "type": "tree",
          "content": null
        },
        {
          "name": "make",
          "type": "tree",
          "content": null
        },
        {
          "name": "pkg",
          "type": "tree",
          "content": null
        },
        {
          "name": "preset",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "win",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}