{
  "metadata": {
    "timestamp": 1736710560088,
    "page": 145,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "dart-lang/dart-pad",
      "stars": 1720,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".cloud_build",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.1533203125,
          "content": "**/pubspec.lock linguist-generated=true\npkgs/dartpad_ui/lib/samples.g.dart linguist-generated=true\npkgs/dartpad_ui/web/codemirror/** linguist-generated=true\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.228515625,
          "content": ".DS_Store\n\n# Don’t commit the following directories created by pub.\nbuild/\n.buildlog\n.dart_tool/\n.packages\n\n# Or the files created by dart2js.\n*.dart.js\n*.js.deps\n\n# Python generated files\n*.pyc\n\n# IDE configuration\n.idea/\n.vscode/\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.3203125,
          "content": "# Below is a list of people and organizations that have contributed\n# to the DartPad project. Names should be added to the list like so:\n#\n#   Name/Organization <email address>\n\nGoogle Inc.\nGuillaume Girou <guillaume.girou@gmail.com>\nKasper Peulen <kasperpeulen@gmail.com>\nGuillermo López-Anglada <guillermo.lopez@outlook.com>\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.92578125,
          "content": "# Contributing to DartPad\n\nWant to contribute? Great! First, read this page (including the small print at the end).\n\n## Before you contribute\nBefore we can use your code, you must sign the [Google Individual Contributor License Agreement](https://developers.google.com/open-source/cla/individual?csw=1) (CLA), which you can do online. The CLA is necessary mainly because you own the copyright to your changes, even after your contribution becomes part of our codebase, so we need your permission to use and distribute your code. We also need to be sure of various other things—for instance that you'll tell us if you know that your code infringes on other people's patents. You don't have to sign the CLA until after you've submitted your code for review and a member has approved it, but you must do it before we can put your code into our codebase.\n\nBefore you start working on a larger contribution, you should get in touch with us first through the issue tracker with your idea so that we can help out and possibly guide you. Coordinating up front makes it much easier to avoid frustration later on.\n\n### Code reviews\nAll submissions, including submissions by project members, require review. We use Github pull requests for this purpose.\n\n### File headers\nAll files in the project must start with the following header.\n\n    // Copyright (c) 2018, the Dart project authors.  Please see the AUTHORS file\n    // for details. All rights reserved. Use of this source code is governed by a\n    // BSD-style license that can be found in the LICENSE file.\n\n### The small print\nContributions made by corporations are covered by a different agreement than the one above, the Software Grant and Corporate Contributor License Agreement.\n\n## How to change and add to Sample Gists\n\n1) Update the samples first in the dartpad_examples repository: https://github.com/dart-lang/dartpad_examples\n\n2) If you are updating an existing sample, create your own gist based on the existing samples.\n   Gist IDs can be found in the [index file](https://github.com/dart-lang/dart-pad/blob/main/web/index.html#L54).\n   Fork the gist, if necessary, then update the contents with the new version from dartpad_examples.\n \n   Otherwise, use the same gist layout as the samples to make sure that DartPad recognizes it:\n     * `index.html` for the HTML snippet used to build the output page\n     * `styles.css` for the style sheet\n     * `main.dart` for the Dart code. \n \n   You can test your gist after updating or creating it by appending the gist ID to the URL for\n   dartpad.\n \n3) Add or change sample Gist IDs to the [index file](https://github.com/dart-lang/dart-pad/blob/main/web/index.html#L54),\n   and submit a PR for review.\n\n## How to run DartPad locally\n\nTo run the server, see the [dart_services readme](https://github.com/dart-lang/dart-pad/blob/main/pkgs/dart_services/README.md).\n\nTo run the front-end, see the [dartpad_ui readme](https://github.com/dart-lang/dart-pad/blob/main/pkgs/dartpad_ui/README.md).\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.4677734375,
          "content": "Copyright 2014, the Dart project authors.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following\n      disclaimer in the documentation and/or other materials provided\n      with the distribution.\n    * Neither the name of Google LLC nor the names of its\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.533203125,
          "content": "# DartPad\n\nDartPad is a free, open-source online editor to help developers learn about Dart\nand Flutter. You can access it at [dartpad.dev](http://dartpad.dev).\n\n## What's here?\n\n### Repo packages:\n\n| Package | Description | CI Status |\n| --- | --- | --- |\n| [dart_services](pkgs/dart_services/) | The backend service for DartPad. | [![dart_services](https://github.com/dart-lang/dart-pad/actions/workflows/dart_services.yml/badge.svg)](https://github.com/dart-lang/dart-pad/actions/workflows/dart_services.yml) |\n| [dartpad_shared](pkgs/dartpad_shared/) | Shared code between the DartPad frontend and backend. | [![dartpad_shared](https://github.com/dart-lang/dart-pad/actions/workflows/dartpad_shared.yml/badge.svg)](https://github.com/dart-lang/dart-pad/actions/workflows/dartpad_shared.yml) |\n| [dartpad_ui](pkgs/dartpad_ui/) | The frontend UI for DartPad. | [![dartpad_ui](https://github.com/dart-lang/dart-pad/actions/workflows/dartpad_ui.yml/badge.svg)](https://github.com/dart-lang/dart-pad/actions/workflows/dartpad_ui.yml) |\n| [samples](pkgs/samples/) | Sample code snippets for DartPad. | [![samples](https://github.com/dart-lang/dart-pad/actions/workflows/samples.yml/badge.svg)](https://github.com/dart-lang/dart-pad/actions/workflows/samples.yml) |\n\n## Background\n\nDartPad began as an online playground for the Dart language built by the Dart\ntools team in 2015. It compiles, analyzes, and displays the results of its\nusers' Dart code, and can be embedded in other websites as an iframe.\n\nIn Dec 2019, we launched a new version of DartPad (dartpad.dev) with a fresh new\nlook-and-feel and support for the popular Flutter UI toolkit. To learn more\nabout the new DartPad, please check this [blog\npost](https://medium.com/dartlang/a-brand-new-dartpad-dev-with-flutter-support-16fe6027784).\nInterested in embedding DartPad in your websites? Check out this [embedding\nguide](https://github.com/dart-lang/dart-pad/wiki/Embedding-Guide).\n\n![DartPad](https://raw.githubusercontent.com/dart-lang/dart-pad/main/doc/Sunflower.png)\n\n## Additional docs\n\nSome handy guides:\n\n- [Sharing Guide](https://github.com/dart-lang/dart-pad/wiki/Sharing-Guide)\n- [Embedding Guide](https://github.com/dart-lang/dart-pad/wiki/Embedding-Guide)\n\n## Issues and bugs\n\nPlease file reports on the [GitHub Issue\nTracker](https://github.com/dart-lang/dart-pad/issues).\n\n## License and Contributing\n\nContributions welcome! Please read this short\n[guide](https://github.com/dart-lang/dart-pad/blob/main/CONTRIBUTING.md)\nfirst. You can view our license\n[here](https://github.com/dart-lang/dart-pad/blob/main/LICENSE).\n"
        },
        {
          "name": "Triage.md",
          "type": "blob",
          "size": 2.078125,
          "content": "## Bug triage priorities\n\nEach issue in the tracker will be assigned a priority based on the impact to\nusers when the issue appears and the number of users impacted (widespread or\nrare).\n\nSome examples of likely triage priorities:\n\n* P0\n    *   Broken internal/external navigation links within DartPad\n    *   JavaScript console errors indicating problems with DartPad functionality in many cases, widespread.\n    *   App is down / not loading\n    *   Interface bugs preventing all or almost all uses of the application\n    *   Unable to compile or analyze valid Flutter/Dart code (widespread and/or with error messages that aren't retryable)\n* P1\n    *   Unable to compile or analyze valid Flutter/Dart code in edge cases only, and/or retryable\n    *   Incorrect or not up-to-date warning information for invalid Flutter/Dart code (widespread)\n    *   Interface bugs interfering with common uses of the application, widespread\n    *   JavaScript console errors indicating problems with DartPad functionality (edge cases / not widespread)\n    *   Enhancements that have significant data around them indicating they are a big win\n    *   User performance problem (e.g. app loading / run / analysis), widespread\n* P2\n    *   Incorrect or not up-to-date warning information for invalid Flutter/Dart code (edge cases / not widespread)\n    *   JavaScript errors not resulting in visible problems outside of the console (widespread)\n    *   Interface bugs interfering with the use of the application in edge cases.\n    *   User interface and display warts that are not significantly impacting functionality, widespread\n    *   Enhancements that are agreed to be a good idea even if they don't have data around them indicating they are a big win\n    *   User performance problem (for example, app loading / run analysis), edge cases / not widespread\n* P3\n    *   Minor user interface warts not significantly impacting functionality, on edge cases only.\n    *   JavaScript errors not resulting in visible problems outside of the console (edge cases)\n    *   Enhancements that are speculative or where we are unsure of impacts/tradeoffs\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "pkgs",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}