{
  "metadata": {
    "timestamp": 1736710514628,
    "page": 49,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "googlearchive/chromedeveditor",
      "stars": 2917,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.8876953125,
          "content": "# Line endings: enforce LF in GitHub, convert to native on checkout.\n\n* text=auto\n*.dart text\n*.js text\n*.html text\n*.json text\n*.png binary\n*.jpg binary\n\n# Make GitHub ignore vendor libraries while computing language stats.\n# See https://github.com/github/linguist#overrides.\n\n/cde-polymer-designer.dart/lib/src/* linguist-vendored=true\n/ide/web/lib/templates/web/web_starter_kit/* linguist-vendored=true\n/ide/web/third_party/* linguist-vendored=true\n/paper/* linguist-vendored=true\n\n# Explicitly specify language for non-standard extensions used under\n# ide/web/lib/templates to make GitHub correctly count their language stats.\n\n*.css_ linguist-language=CSS\n*.dart_ linguist-language=Dart\n*.html_ linguist-language=HTML\n*.js_ linguist-language=JavaScript\n*.json_ linguist-language=JSON\n*.scss_ linguist-language=CSS\n*.svg_ linguist-language=SVG\n*.yaml_ linguist-language=YAML\n*.yml_ linguist-language=YAML\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.130859375,
          "content": "*.js.deps\n*.js.map\n*.pem\n*.swo\n*.swp\n*~\n.buildlog\n.DS_Store\n.idea\n.pub\n.project\n.svn\n/.settings\npackages\npubspec.lock\nwidgets/LICENSE\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.4248046875,
          "content": "# Below is a list of people and organizations that have contributed\n# to the Spark project. Names should be added to the list like so:\n#\n#   Name/Organization <email address>\n\nGoogle Inc.\nAdam Singer <financeCoding@gmail.com>\nSungguk Lim <limasdf@gmail.com>\nAnders Øyvind Urke-Sætre <andersoyvind@gmail.com>\nThomas Stephenson <ovangle@gmail.com>\nGünter Zöchbauer <guenter@gzoechbauer.com>\nMatthew Butler <butler.matthew@gmail.com>\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.443359375,
          "content": "Copyright (c) 2013, Google Inc.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n* Redistributions in binary form must reproduce the above copyright notice, this\n  list of conditions and the following disclaimer in the documentation and/or\n  other materials provided with the distribution.\n* Neither the name of Google Inc. nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "PATENTS",
          "type": "blob",
          "size": 1.275390625,
          "content": "Additional IP Rights Grant (Patents)\n\n\"This implementation\" means the copyrightable works distributed by\nGoogle as part of the Spark Project.\n\nGoogle hereby grants to you a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this\nsection) patent license to make, have made, use, offer to sell, sell,\nimport, transfer, and otherwise run, modify and propagate the contents\nof this implementation of Spark, where such license applies only to\nthose patent claims, both currently owned by Google and acquired in\nthe future, licensable by Google that are necessarily infringed by\nthis implementation of Spark. This grant does not include claims that\nwould be infringed only as a consequence of further modification of\nthis implementation. If you or your agent or exclusive licensee\ninstitute or order or agree to the institution of patent litigation\nagainst any entity (including a cross-claim or counterclaim in a\nlawsuit) alleging that this implementation of Spark or any code\nincorporated within this implementation of Spark constitutes direct or\ncontributory patent infringement, or inducement of patent\ninfringement, then any patent rights granted to you under this License\nfor this implementation of Spark shall terminate as of the date such\nlitigation is filed.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.17578125,
          "content": "## Chrome Dev Editor (NO LONGER IN ACTIVE DEVELOPMENT)\n\nChrome Dev Editor (CDE) is a developer tool for building apps on the Chrome platform - [Chrome Apps](https://developer.chrome.com/apps/about_apps) and Web Apps, in JavaScript or [Dart](https://www.dartlang.org/). CDE is built as a Chrome App written in Dart and uses Polymer. CDE runs on Windows, Mac, Linux, and Chrome OS! CDE supports Git, [Polymer](https://www.polymer-project.org/), and mobile development.\n\n**Note**: Chrome Dev Editor is **no longer** being actively developed. We'll do our best to merge your pull requests.\n\n![Screenshot](https://raw.githubusercontent.com/dart-lang/spark/master/doc/screenshot1.png)\n\n### Get Started\n\nYou can [learn more](doc/GettingStarted.md) about CDE workflows including Chrome Apps (including Mobile), Web Apps (JavaScript and Dart), Polymer and Git.\n\n### Google I/O 2014\n\nCheck out our [I/O talk](https://www.youtube.com/watch?v=NNLnTz6yIc4) about building apps on the Chrome platform and how we built CDE. You can also try out the [I/O codelabs](http://io2014codelabs.appspot.com/static/index.html) that use the Chrome Dev Editor.\n\n### FAQ\n\nRead our [FAQ](doc/FAQ.md) to find out about CDE features. \n"
        },
        {
          "name": "cde-common.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "cde-core.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "cde-messaging.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "cde-polymer-designer.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "cde-workbench.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "chrome-app-net.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "chrome-app-testing.dart",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "ide",
          "type": "tree",
          "content": null
        },
        {
          "name": "mobile",
          "type": "tree",
          "content": null
        },
        {
          "name": "paper",
          "type": "tree",
          "content": null
        },
        {
          "name": "widgets",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}