{
  "metadata": {
    "timestamp": 1736710517172,
    "page": 55,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mxflutter/mxflutter",
      "stars": 2821,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.3525390625,
          "content": "# Miscellaneous\n*.class\n*.lock\n*.log\n*.pyc\n*.swp\n.DS_Store\n.atom/\n.buildlog/\n.history\n.svn/\n\n# IntelliJ related\n*.iml\n*.ipr\n*.iws\n.idea/\n\n# Visual Studio Code related\n.vscode/\n\n# Flutter/Dart/Pub related\n**/doc/api/\n.dart_tool/\n.flutter-plugins\n.packages\n.pub-cache/\n.pub/\nbuild/\n\n# Android related\n**/android/**/gradle-wrapper.jar\n**/android/.gradle\n**/android/captures/\n**/android/gradlew\n**/android/gradlew.bat\n**/android/local.properties\n**/android/**/GeneratedPluginRegistrant.java\n\n# iOS/XCode related\n**/ios/**/*.mode1v3\n**/ios/**/*.mode2v3\n**/ios/**/*.moved-aside\n**/ios/**/*.pbxuser\n**/ios/**/*.perspectivev3\n**/ios/**/*sync/\n**/ios/**/.sconsign.dblite\n**/ios/**/.tags*\n**/ios/**/.vagrant/\n**/ios/**/DerivedData/\n**/ios/**/Icon?\n**/ios/**/Pods/\n**/ios/**/.symlinks/\n**/ios/**/profile\n**/ios/**/xcuserdata\n**/ios/.generated/\n**/ios/Flutter/App.framework\n**/ios/Flutter/Flutter.framework\n**/ios/Flutter/Generated.xcconfig\n**/ios/Flutter/app.flx\n**/ios/Flutter/app.zip\n**/ios/Flutter/flutter_assets/\n**/ios/ServiceDefinitions.json\n**/ios/Runner/GeneratedPluginRegistrant.*\n\n# Exceptions to above rules.\n!**/ios/**/default.mode1v3\n!**/ios/**/default.mode2v3\n!**/ios/**/default.pbxuser\n!**/ios/**/default.perspectivev3\n!/packages/flutter_tools/test/data/dart_dependencies_test/**/.packages\n.flutter-plugins-dependencies\nios/Runner.xcworkspace/xcshareddata/IDEWorkspaceChecks.plist\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 2.9013671875,
          "content": "### 【*New】0.8.0 Beta   2021-1-29 \r\n\n\n#### 工程优化和开发方式变化\n1. 开发语言切换到 TypeScript ：使用TS完整重构框架代码，带来了静态代码检查和代码自动提示。\n2. 完整接入npm生态：重新设计拆分JS层框架模块，使用Monorepo模式组织模块的关联开发及npm发布。业务代码通过npm包引入框架。\n3. 增加工程cli工具：一键创建业务初始工程。内置框架与业务的编译脚本，一键完成业务开发调试与编译打包。\n\n#### 框架逻辑优化\n1. 支持了JS Widget的状态保持\n2. 通过dart:ffi实现小数据量属性同步调用\n3. 支持了异步Widget，同步Widget\n4. 提供了更全面的TS Widget， 支持更多UI效果\n5. 主框架支持更丰富的性能监控指标。首帧、页面刷新、FPS、Crash率等。\n6. 对应 Flutter 1.20.3版本\n\n#### 对v0.8.0版本的js编译器在开发中。\n\n### 0.2.5 Beta   2020-05-18\n\n   MXFlutter 发布 [mxjsbuilder v0.0.2](https://github.com/mxflutter/mxjsbuilder) 编译器,支持编译 Flutter 工程为 mxflutter 可运行的 JS 代码。\n \n### 0.2.1 Beta   2020-05-07\n\n 升级适配 Flutter 1.17.0 ，对应Channel stable tag:v1.17.0\n  \n### 0.2.0 Beta   2020-05-06\n\n   mxflutter 重构为 Flutter 标准 package，大大简化引入流程，三步接入现有工程。\n\n  *   库代码移动到 ./mxflutter ，接入使用 package 的标准方式\n  *   接入示例 mxflutter/example，[接入指南文档](https://github.com/mxflutter/mxflutter/tree/master/mxflutter) \r\n  *   **对应Flutter (Channel stable tag:v1.12.13+hotfix.9) 和 (Channel master tag:v1.16.2)**\r\n  *   支持Packages\r\n      1.   dio\r\n      2.   pull_to_refresh\r\n      3.   cached_network_image\r\n      4.   shared_preferences\r\n  *   支持MessageChannel\r\n  *   性能和稳定性优化，Bug Fix\n  \n###  0.1.2 Beta   2020-04-22\n\n为实现两端功能一致，减少Native层工作量，确定Native层只做通道，JS能力完全由Flutter实现的技术方案。\n\n  *   Android功能对齐iOS\n  *   实现JS和Dart镜像类通用调用模块\n\n### 0.1.1 Beta   2020-04-8\n\n  *   增加性能测试页面\n  *   Android功能完善\n  *   Bug Fix\n  \n### 0.1.0 Beta   2020-03-30 \n\n 性能和稳定性优化，0.1.0版本已在iOS线上使用，Android的支持在开发中。\n\n  *   **API变化：区分MXJSStatefulWidget、MXJSStatelessWidget**\n  *   **Framework目录整理**\n  *   支持Packages\n      1.   dio\n      2.   pull_to_refresh\n      3.   cached_network_image\n      4.   shared_preferences\n  *   支持MessageChannel\n  *   性能和稳定性优化，Bug Fix\n\n\n###  0.0.3 Preview   2020-02-10\n\n  增加示例代码\n  \n  *   丰富Widget使用示例\n  *   丰富动画使用示例\n  *   Bug Fix\n\n###  0.0.2 Preview   2019-10-19\n\n  *   支持android版本\n\n###  0.0.1 Preview   2019-06-25\n\n  MXFlutter第一次发布版本\n  \n  * 使用JavaScript 开发Widget，响应式渲染框架\n  * 知乎Demo\n  * 简单Widget使用示例\n\n"
        },
        {
          "name": "Documentation",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 41.4326171875,
          "content": "Tencent is pleased to support the open source community by making MXFlutter available.\n\nCopyright (C) 2021 THL A29 Limited, a Tencent company.  All rights reserved.\n\nMXFlutter is licensed under the BSD 3-clause license, except for the third-party components listed below.\n\nTerms of the BSD 3-clause license\n--------------------------------------------------------------------\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following\n      disclaimer in the documentation and/or other materials provided\n      with the distribution.\n    * Neither the name of Google Inc. nor the names of its\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nOther dependencies and licenses:\n\nOpen Source Software Licensed under the BSD 3-clause license\n--------------------------------------------------------------------\n1. flutter\nCopyright 2014 The Flutter Authors. All rights reserved.\n\n2. react-native\nCopyright (c) 2015-present, Facebook, Inc. All rights reserved.\n\nTerms of the BSD 3-clause license:\n--------------------------------------------------------------------\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above\n      copyright notice, this list of conditions and the following\n      disclaimer in the documentation and/or other materials provided\n      with the distribution.\n    * Neither the name of Google Inc. nor the names of its\n      contributors may be used to endorse or promote products derived\n      from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nOpen Source Software Licensed under the MIT License\n--------------------------------------------------------------------\n1. embed-js\nCopyright (c) 2014 Ritesh Kumar\n\nTerms of the MIT License:\n--------------------------------------------------------------------\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nOpen Source Software Licensed under the Eclipse Public License 1.0\n--------------------------------------------------------------------\n1. J2V8\nCopyright (c) J2V8 Authors and Contributors. All rights reserved.\n\nTerms of the Eclipse Public License 1.0:\n--------------------------------------------------------------------\nEclipse Public License - v 1.0\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and documentation distributed under this Agreement, and\n\nb) in the case of each subsequent Contributor:\n\ni) changes to the Program, and\n\nii) additions to the Program;\n\nwhere such changes and/or additions to the Program originate from and are distributed by that particular Contributor. A Contribution 'originates' from a Contributor if it was added to the Program by such Contributor itself or anyone acting on such Contributor's behalf. Contributions do not include additions to the Program which: (i) are separate modules of software distributed in conjunction with the Program under their own license agreement, and (ii) are not derivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents\" mean patent claims licensable by a Contributor which are necessarily infringed by the use or sale of its Contribution alone or when combined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement, including all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, distribute and sublicense the Contribution of such Contributor, if any, and such derivative works, in source code and object code form.\n\nb) Subject to the terms of this Agreement, each Contributor hereby grants Recipient a non-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use, sell, offer to sell, import and otherwise transfer the Contribution of such Contributor, if any, in source code and object code form. This patent license shall apply to the combination of the Contribution and the Program if, at the time the Contribution is added by the Contributor, such addition of the Contribution causes such combination to be covered by the Licensed Patents. The patent license shall not apply to any other combinations which include the Contribution. No hardware per se is licensed hereunder.\n\nc) Recipient understands that although each Contributor grants the licenses to its Contributions set forth herein, no assurances are provided by any Contributor that the Program does not infringe the patent or other intellectual property rights of any other entity. Each Contributor disclaims any liability to Recipient for claims brought by any other entity based on infringement of intellectual property rights or otherwise. As a condition to exercising the rights and licenses granted hereunder, each Recipient hereby assumes sole responsibility to secure any other intellectual property rights needed, if any. For example, if a third party patent license is required to allow Recipient to distribute the Program, it is Recipient's responsibility to acquire that license before distributing the Program.\n\nd) Each Contributor represents that to its knowledge it has sufficient copyright rights in its Contribution, if any, to grant the copyright license set forth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under its own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\n\nb) its license agreement:\n\ni) effectively disclaims on behalf of all Contributors all warranties and conditions, express and implied, including warranties or conditions of title and non-infringement, and implied warranties or conditions of merchantability and fitness for a particular purpose;\n\nii) effectively excludes on behalf of all Contributors all liability for damages, including direct, indirect, special, incidental and consequential damages, such as lost profits;\n\niii) states that any provisions which differ from this Agreement are offered by that Contributor alone and not by any other party; and\n\niv) states that source code for the Program is available from such Contributor, and informs licensees how to obtain it in a reasonable manner on or through a medium customarily used for software exchange.\n\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\n\nb) a copy of this Agreement must be included with each copy of the Program.\n\nContributors may not remove or alter any copyright notices contained within the Program.\n\nEach Contributor must identify itself as the originator of its Contribution, if any, in a manner that reasonably allows subsequent Recipients to identify the originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with respect to end users, business partners and the like. While this license is intended to facilitate the commercial use of the Program, the Contributor who includes the Program in a commercial product offering should do so in a manner which does not create potential liability for other Contributors. Therefore, if a Contributor includes the Program in a commercial product offering, such Contributor (\"Commercial Contributor\") hereby agrees to defend and indemnify every other Contributor (\"Indemnified Contributor\") against any losses, damages and costs (collectively \"Losses\") arising from claims, lawsuits and other legal actions brought by a third party against the Indemnified Contributor to the extent caused by the acts or omissions of such Commercial Contributor in connection with its distribution of the Program in a commercial product offering. The obligations in this section do not apply to any claims or Losses relating to any actual or alleged intellectual property infringement. In order to qualify, an Indemnified Contributor must: a) promptly notify the Commercial Contributor in writing of such claim, and b) allow the Commercial Contributor to control, and cooperate with the Commercial Contributor in, the defense and any related settlement negotiations. The Indemnified Contributor may participate in any such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial product offering, Product X. That Contributor is then a Commercial Contributor. If that Commercial Contributor then makes performance claims, or offers warranties related to Product X, those performance claims and warranties are such Commercial Contributor's responsibility alone. Under this section, the Commercial Contributor would have to defend claims against the other Contributors related to those performance claims and warranties, and if a court requires any other Contributor to pay any damages as a result, the Commercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible for determining the appropriateness of using and distributing the Program and assumes all risks associated with its exercise of rights under this Agreement , including but not limited to the risks and costs of program errors, compliance with applicable laws, damage to or loss of data, programs or equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this Agreement, and without further action by the parties hereto, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Program itself (excluding combinations of the Program with other software or hardware) infringes such Recipient's patent(s), then such Recipient's rights granted under Section 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to comply with any of the material terms or conditions of this Agreement and does not cure such failure in a reasonable period of time after becoming aware of such noncompliance. If all Recipient's rights under this Agreement terminate, Recipient agrees to cease use and distribution of the Program as soon as reasonably practicable. However, Recipient's obligations under this Agreement and any licenses granted by Recipient relating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in order to avoid inconsistency the Agreement is copyrighted and may only be modified in the following manner. The Agreement Steward reserves the right to publish new versions (including revisions) of this Agreement from time to time. No one other than the Agreement Steward has the right to modify this Agreement. The Eclipse Foundation is the initial Agreement Steward. The Eclipse Foundation may assign the responsibility to serve as the Agreement Steward to a suitable separate entity. Each new version of the Agreement will be given a distinguishing version number. The Program (including Contributions) may always be distributed subject to the version of the Agreement under which it was received. In addition, after a new version of the Agreement is published, Contributor may elect to distribute the Program (including its Contributions) under the new version. Except as expressly stated in Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to the intellectual property of any Contributor under this Agreement, whether expressly, by implication, estoppel or otherwise. All rights in the Program not expressly granted under this Agreement are reserved.\n\nThis Agreement is governed by the laws of the State of New York and the intellectual property laws of the United States of America. No party to this Agreement will bring a legal action under this Agreement more than one year after the cause of action arose. Each party waives its rights to a jury trial in any resulting litigation.\n\n\nOpen Source Software Licensed under the LGPL and BSD 3-Clause License\n--------------------------------------------------------------------\n1. WebKit\n\nWebKit is open source software with portions licensed under the LGPL and BSD licenses available here.\n\nGNU LIBRARY GENERAL PUBLIC LICENSE\nVersion 2, June 1991\n\nCopyright (C) 1991 Free Software Foundation, Inc.\n51 Franklin St, Fifth Floor, Boston, MA 02110-1301, USA\nEveryone is permitted to copy and distribute verbatim copies\nof this license document, but changing it is not allowed.\n\n(This is the first released version of the library GPL. It is\nnumbered 2 because it goes with version 2 of the ordinary GPL.)\n\nPreamble\nThe licenses for most software are designed to take away your freedom to share and change it. By contrast, the GNU General Public Licenses are intended to guarantee your freedom to share and change free software–to make sure the software is free for all its users.\n\nThis license, the Library General Public License, applies to some specially designated Free Software Foundation software, and to any other libraries whose authors decide to use it. You can use it for your libraries, too.\n\nWhen we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.\n\nTo protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights. These restrictions translate to certain responsibilities for you if you distribute copies of the library, or if you modify it.\n\nFor example, if you distribute copies of the library, whether gratis or for a fee, you must give the recipients all the rights that we gave you. You must make sure that they, too, receive or can get the source code. If you link a program with the library, you must provide complete object files to the recipients so that they can relink them with the library, after making changes to the library and recompiling it. And you must show them these terms so they know their rights.\n\nOur method of protecting your rights has two steps: (1) copyright the library, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the library.\n\nAlso, for each distributor’s protection, we want to make certain that everyone understands that there is no warranty for this free library. If the library is modified by someone else and passed on, we want its recipients to know that what they have is not the original version, so that any problems introduced by others will not reflect on the original authors’ reputations.\n\nFinally, any free program is threatened constantly by software patents. We wish to avoid the danger that companies distributing free software will individually obtain patent licenses, thus in effect transforming the program into proprietary software. To prevent this, we have made it clear that any patent must be licensed for everyone’s free use or not licensed at all.\n\nMost GNU software, including some libraries, is covered by the ordinary GNU General Public License, which was designed for utility programs. This license, the GNU Library General Public License, applies to certain designated libraries. This license is quite different from the ordinary one; be sure to read it in full, and don’t assume that anything in it is the same as in the ordinary license.\n\nThe reason we have a separate public license for some libraries is that they blur the distinction we usually make between modifying or adding to a program and simply using it. Linking a program with a library, without changing the library, is in some sense simply using the library, and is analogous to running a utility program or application program. However, in a textual and legal sense, the linked executable is a combined work, a derivative of the original library, and the ordinary General Public License treats it as such.\n\nBecause of this blurred distinction, using the ordinary General Public License for libraries did not effectively promote software sharing, because most developers did not use the libraries. We concluded that weaker conditions might promote sharing better.\n\nHowever, unrestricted linking of non-free programs would deprive the users of those programs of all benefit from the free status of the libraries themselves. This Library General Public License is intended to permit developers of non-free programs to use free libraries, while preserving your freedom as a user of such programs to change the free libraries that are incorporated in them. (We have not seen how to achieve this as regards changes in header files, but we have achieved it as regards changes in the actual functions of the Library.) The hope is that this will lead to faster development of free libraries.\n\nThe precise terms and conditions for copying, distribution and modification follow. Pay close attention to the difference between a “work based on the library” and a “work that uses the library”. The former contains code derived from the library, while the latter only works together with the library.\n\nNote that it is possible for a library to be covered by the ordinary General Public License rather than by this special one.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n0. This License Agreement applies to any software library which contains a notice placed by the copyright holder or other authorized party saying it may be distributed under the terms of this Library General Public License (also called “this License”). Each licensee is addressed as “you”.\n\nA “library” means a collection of software functions and/or data prepared so as to be conveniently linked with application programs (which use some of those functions and data) to form executables.\n\nThe “Library”, below, refers to any such software library or work which has been distributed under these terms. A “work based on the Library” means either the Library or any derivative work under copyright law: that is to say, a work containing the Library or a portion of it, either verbatim or with modifications and/or translated straightforwardly into another language. (Hereinafter, translation is included without limitation in the term “modification”.)\n\n“Source code” for a work means the preferred form of the work for making modifications to it. For a library, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the library.\n\nActivities other than copying, distribution and modification are not covered by this License; they are outside its scope. The act of running a program using the Library is not restricted, and output from such a program is covered only if its contents constitute a work based on the Library (independent of the use of the Library in a tool for writing it). Whether that is true depends on what the Library does and what the program that uses the Library does.\n\n1. You may copy and distribute verbatim copies of the Library’s complete source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and distribute a copy of this License along with the Library.\n\nYou may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.\n\n2. You may modify your copy or copies of the Library or any portion of it, thus forming a work based on the Library, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:\n\na) The modified work must itself be a software library.\nb) You must cause the files modified to carry prominent notices stating that you changed the files and the date of any change.\nc) You must cause the whole of the work to be licensed at no charge to all third parties under the terms of this License.\nd) If a facility in the modified Library refers to a function or a table of data to be supplied by an application program that uses the facility, other than as an argument passed when the facility is invoked, then you must make a good faith effort to ensure that, in the event an application does not supply such function or table, the facility still operates, and performs whatever part of its purpose remains meaningful. (For example, a function in a library to compute square roots has a purpose that is entirely well-defined independent of the application. Therefore, Subsection 2d requires that any application-supplied function or table used by this function must be optional: if the application does not supply it, the square root function must still compute square roots.)\nThese requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Library, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Library, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Library.\n\nIn addition, mere aggregation of another work not based on the Library with the Library (or with a work based on the Library) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.\n\n3. You may opt to apply the terms of the ordinary GNU General Public License instead of this License to a given copy of the Library. To do this, you must alter all the notices that refer to this License, so that they refer to the ordinary GNU General Public License, version 2, instead of to this License. (If a newer version than version 2 of the ordinary GNU General Public License has appeared, then you can specify that version instead if you wish.) Do not make any other change in these notices.\n\nOnce this change is made in a given copy, it is irreversible for that copy, so the ordinary GNU General Public License applies to all subsequent copies and derivative works made from that copy.\n\nThis option is useful when you wish to copy part of the code of the Library into a program that is not a library.\n\n4. You may copy and distribute the Library (or a portion or derivative of it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange.\n\nIf distribution of object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place satisfies the requirement to distribute the source code, even though third parties are not compelled to copy the source along with the object code.\n\n5. A program that contains no derivative of any portion of the Library, but is designed to work with the Library by being compiled or linked with it, is called a “work that uses the Library”. Such a work, in isolation, is not a derivative work of the Library, and therefore falls outside the scope of this License.\n\nHowever, linking a “work that uses the Library” with the Library creates an executable that is a derivative of the Library (because it contains portions of the Library), rather than a “work that uses the library”. The executable is therefore covered by this License. Section 6 states terms for distribution of such executables.\n\nWhen a “work that uses the Library” uses material from a header file that is part of the Library, the object code for the work may be a derivative work of the Library even though the source code is not. Whether this is true is especially significant if the work can be linked without the Library, or if the work is itself a library. The threshold for this to be true is not precisely defined by law.\n\nIf such an object file uses only numerical parameters, data structure layouts and accessors, and small macros and small inline functions (ten lines or less in length), then the use of the object file is unrestricted, regardless of whether it is legally a derivative work. (Executables containing this object code plus portions of the Library will still fall under Section 6.)\n\nOtherwise, if the work is a derivative of the Library, you may distribute the object code for the work under the terms of Section 6. Any executables containing that work also fall under Section 6, whether or not they are linked directly with the Library itself.\n\n6. As an exception to the Sections above, you may also compile or link a “work that uses the Library” with the Library to produce a work containing portions of the Library, and distribute that work under terms of your choice, provided that the terms permit modification of the work for the customer’s own use and reverse engineering for debugging such modifications.\n\nYou must give prominent notice with each copy of the work that the Library is used in it and that the Library and its use are covered by this License. You must supply a copy of this License. If the work during execution displays copyright notices, you must include the copyright notice for the Library among them, as well as a reference directing the user to the copy of this License. Also, you must do one of these things:\n\na) Accompany the work with the complete corresponding machine-readable source code for the Library including whatever changes were used in the work (which must be distributed under Sections 1 and 2 above); and, if the work is an executable linked with the Library, with the complete machine-readable “work that uses the Library”, as object code and/or source code, so that the user can modify the Library and then relink to produce a modified executable containing the modified Library. (It is understood that the user who changes the contents of definitions files in the Library will not necessarily be able to recompile the application to use the modified definitions.)\nb) Accompany the work with a written offer, valid for at least three years, to give the same user the materials specified in Subsection 6a, above, for a charge no more than the cost of performing this distribution.\nc) If distribution of the work is made by offering access to copy from a designated place, offer equivalent access to copy the above specified materials from the same place.\nd) Verify that the user has already received a copy of these materials or that you have already sent this user a copy.\nFor an executable, the required form of the “work that uses the Library” must include any data and utility programs needed for reproducing the executable from it. However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.\n\nIt may happen that this requirement contradicts the license restrictions of other proprietary libraries that do not normally accompany the operating system. Such a contradiction means you cannot use both them and the Library together in an executable that you distribute.\n\n7. You may place library facilities that are a work based on the Library side-by-side in a single library together with other library facilities not covered by this License, and distribute such a combined library, provided that the separate distribution of the work based on the Library and of the other library facilities is otherwise permitted, and provided that you do these two things:\n\na) Accompany the combined library with a copy of the same work based on the Library, uncombined with any other library facilities. This must be distributed under the terms of the Sections above.\nb) Give prominent notice with the combined library of the fact that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.\n8. You may not copy, modify, sublicense, link with, or distribute the Library except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense, link with, or distribute the Library is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.\n\n9. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to modify or distribute the Library or its derivative works. These actions are prohibited by law if you do not accept this License. Therefore, by modifying or distributing the Library (or any work based on the Library), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Library or works based on it.\n\n10. Each time you redistribute the Library (or any work based on the Library), the recipient automatically receives a license from the original licensor to copy, distribute, link with or modify the Library subject to these terms and conditions. You may not impose any further restrictions on the recipients’ exercise of the rights granted herein. You are not responsible for enforcing compliance by third parties to this License.\n\n11. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Library at all. For example, if a patent license would not permit royalty-free redistribution of the Library by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply, and the section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.\n\nThis section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.\n\n12. If the distribution and/or use of the Library is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Library under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded. In such case, this License incorporates the limitation as if written in the body of this License.\n\n13. The Free Software Foundation may publish revised and/or new versions of the Library General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Library specifies a version number of this License which applies to it and “any later version”, you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation. If the Library does not specify a license version number, you may choose any version ever published by the Free Software Foundation.\n\n14. If you wish to incorporate parts of the Library into other free programs whose distribution conditions are incompatible with these, write to the author to ask for permission. For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this. Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.\n\nNO WARRANTY\n\n15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE LIBRARY “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE LIBRARY IS WITH YOU. SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE LIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS\nHow to Apply These Terms to Your New Libraries\nIf you develop a new library, and you want it to be of the greatest possible use to the public, we recommend making it free software that everyone can redistribute and change. You can do so by permitting redistribution under these terms (or, alternatively, under the terms of the ordinary General Public License).\n\nTo apply these terms, attach the following notices to the library. It is safest to attach them to the start of each source file to most effectively convey the exclusion of warranty; and each file should have at least the “copyright” line and a pointer to where the full notice is found.\n\nWebKit open source web browser engine.\nCopyright (C) 2015 Apple, Inc.\n\nThis library is free software; you can redistribute it and/or\nmodify it under the terms of the GNU Library General Public\nLicense as published by the Free Software Foundation; either\nversion 2 of the License, or (at your option) any later version.\n\nThis library is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\nLibrary General Public License for more details.\n\nYou should have received a copy of the GNU Library General Public\nLicense along with this library; if not, write to the\nFree Software Foundation, Inc., 51 Franklin St, Fifth Floor,\nBoston, MA 02110-1301, USA.\n\n\nBSD License\nCopyright (C) 2009 Apple Inc. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY APPLE INC. AND ITS CONTRIBUTORS “AS IS” AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL APPLE INC. OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.107421875,
          "content": "![](http://pub.idqqimg.com/pc/misc/files/20210319/c54881a48c8847559bc80e1c1500dfe4.png)\r\n----\r\n\r\n\r\n# MXFlutter Beta \r\n\n## 公告\n**MXFlutter 主库的后续更新迁移到Github Tencent帐号下继续开发迭代，v0.9.0以上版本请移步 https://github.com/tencent/mxflutter ，本代码仓库停止更新。感谢各位同学的帮助！**\n\n---\r\n MXFlutter 是一套使用 TypeScript/JavaScript 来开发 Flutter 应用的框架。\n\n框架支持两种开发方式\n1. 基于 mxflutter-js 前端框架，使用  TypeScript 语言，以类似 Flutter 的 Widget 组装方式开发UI，借助前端生态的基础能力，开发App。（前端框架已开源: [github:mxflutter-js](https://github.com/mxflutter/mxflutter-js)）\n2. 不改变现有 Flutter 的开发方式，使用 MXJSCompiler 把现有工程编译为JS，运行在 mxflutter 框架之上。（ MXJSCompiler JS编译工具在开源计划中 ）\n\n\n可以安装 Android的包来体验  [MXFlutter_v0-9-0.apk](https://github.com/mxflutter/awesome_mxflutter/releases/download/v0.9.0/awesome-mxflutter-0-9-0.apk)。\n\n接入的详细步骤，请参阅 [mxflutter 接入指南](Documentation/接入指南.md)\n\n#### 版本对应关系\n\n| [*new v0.9.0](https://github.com/tencent/mxflutter) | Flutter 1.22.3 |\n| --- | --- |\n| [v0.8.0](https://github.com/mxflutter/mxflutter) | Flutter 1.20.3  |\n\n#### 相关代码库\n\n\n| 代码库 | 简介 | 地址 |\n| --- | --- | --- |\n| mxflutter | Flutter Plugin ，使用JS Bundle 渲染页面 | https://github.com/tencent/mxflutter.git |\n| mxflutter-js | TS 前端框架，支撑使用Flutter Widget 组装方式开发UI | https://github.com/mxflutter/mxflutter-js |\n| mxflutter_pkg | mxflutter 第三方Package支持的示例 | https://github.com/mxflutter/mxflutter_pkg |\n| awesome_mxflutter | Flutter 示例工程，演示如何运行JS Bundle | https://github.com/mxflutter/awesome_mxflutter |\n| mxflutter-js-demo | JS 示例工程，演示如何使用TS开发Flutter | https://github.com/mxflutter/mxflutter-js-demo |\n| mx_mirror_builder | 辅助工具，用于生成 TS 类定义和 Mirror 映射 | https://github.com/mxflutter/mx_mirror_builder |\n\n\n\n\n\n\n"
        },
        {
          "name": "android",
          "type": "tree",
          "content": null
        },
        {
          "name": "ios",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "mxflutter",
          "type": "tree",
          "content": null
        },
        {
          "name": "mxflutter_js_bundle",
          "type": "tree",
          "content": null
        },
        {
          "name": "mxflutter_pkg",
          "type": "tree",
          "content": null
        },
        {
          "name": "pubspec.lock",
          "type": "blob",
          "size": 11.6513671875,
          "content": "# Generated by pub\n# See https://dart.dev/tools/pub/glossary#lockfile\npackages:\n  archive:\n    dependency: transitive\n    description:\n      name: archive\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.0.13\"\n  args:\n    dependency: transitive\n    description:\n      name: args\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.6.0\"\n  async:\n    dependency: transitive\n    description:\n      name: async\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.5.0-nullsafety.1\"\n  boolean_selector:\n    dependency: transitive\n    description:\n      name: boolean_selector\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.0-nullsafety.1\"\n  cached_network_image:\n    dependency: transitive\n    description:\n      name: cached_network_image\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.3.3\"\n  characters:\n    dependency: transitive\n    description:\n      name: characters\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.1.0-nullsafety.3\"\n  charcode:\n    dependency: transitive\n    description:\n      name: charcode\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.2.0-nullsafety.1\"\n  clock:\n    dependency: transitive\n    description:\n      name: clock\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.1.0-nullsafety.1\"\n  collection:\n    dependency: transitive\n    description:\n      name: collection\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.15.0-nullsafety.3\"\n  convert:\n    dependency: transitive\n    description:\n      name: convert\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.1\"\n  crypto:\n    dependency: transitive\n    description:\n      name: crypto\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.5\"\n  cupertino_icons:\n    dependency: \"direct main\"\n    description:\n      name: cupertino_icons\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.3\"\n  device_info:\n    dependency: \"direct main\"\n    description:\n      name: device_info\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.0\"\n  device_info_platform_interface:\n    dependency: transitive\n    description:\n      name: device_info_platform_interface\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.1\"\n  dio:\n    dependency: transitive\n    description:\n      name: dio\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"3.0.10\"\n  expressions:\n    dependency: transitive\n    description:\n      name: expressions\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.5\"\n  fake_async:\n    dependency: transitive\n    description:\n      name: fake_async\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.2.0-nullsafety.1\"\n  ffi:\n    dependency: transitive\n    description:\n      name: ffi\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.3\"\n  file:\n    dependency: transitive\n    description:\n      name: file\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"5.2.1\"\n  flutter:\n    dependency: \"direct main\"\n    description: flutter\n    source: sdk\n    version: \"0.0.0\"\n  flutter_blurhash:\n    dependency: transitive\n    description:\n      name: flutter_blurhash\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.5.0\"\n  flutter_cache_manager:\n    dependency: transitive\n    description:\n      name: flutter_cache_manager\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.0.0\"\n  flutter_gallery_assets:\n    dependency: \"direct main\"\n    description:\n      name: flutter_gallery_assets\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.9+2\"\n  flutter_test:\n    dependency: \"direct dev\"\n    description: flutter\n    source: sdk\n    version: \"0.0.0\"\n  flutter_web_plugins:\n    dependency: transitive\n    description: flutter\n    source: sdk\n    version: \"0.0.0\"\n  http:\n    dependency: transitive\n    description:\n      name: http\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.12.2\"\n  http_parser:\n    dependency: transitive\n    description:\n      name: http_parser\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"3.1.4\"\n  intl:\n    dependency: transitive\n    description:\n      name: intl\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.16.1\"\n  matcher:\n    dependency: transitive\n    description:\n      name: matcher\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.12.10-nullsafety.1\"\n  meta:\n    dependency: transitive\n    description:\n      name: meta\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.3.0-nullsafety.3\"\n  mxflutter:\n    dependency: \"direct main\"\n    description:\n      path: mxflutter\n      relative: true\n    source: path\n    version: \"0.8.0\"\n  mxflutter_pkg:\n    dependency: \"direct main\"\n    description:\n      path: mxflutter_pkg\n      relative: true\n    source: path\n    version: \"0.0.1\"\n  octo_image:\n    dependency: transitive\n    description:\n      name: octo_image\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.3.0\"\n  package_info:\n    dependency: transitive\n    description:\n      name: package_info\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.4.3+2\"\n  path:\n    dependency: transitive\n    description:\n      name: path\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.8.0-nullsafety.1\"\n  path_provider:\n    dependency: transitive\n    description:\n      name: path_provider\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.6.24\"\n  path_provider_linux:\n    dependency: transitive\n    description:\n      name: path_provider_linux\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.1+2\"\n  path_provider_macos:\n    dependency: transitive\n    description:\n      name: path_provider_macos\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.4+6\"\n  path_provider_platform_interface:\n    dependency: transitive\n    description:\n      name: path_provider_platform_interface\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.4\"\n  path_provider_windows:\n    dependency: transitive\n    description:\n      name: path_provider_windows\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.4+3\"\n  pedantic:\n    dependency: transitive\n    description:\n      name: pedantic\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.9.0\"\n  permission_handler:\n    dependency: transitive\n    description:\n      name: permission_handler\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"5.0.1+1\"\n  permission_handler_platform_interface:\n    dependency: transitive\n    description:\n      name: permission_handler_platform_interface\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.0.1\"\n  petitparser:\n    dependency: transitive\n    description:\n      name: petitparser\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"3.0.4\"\n  platform:\n    dependency: transitive\n    description:\n      name: platform\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.2.1\"\n  plugin_platform_interface:\n    dependency: transitive\n    description:\n      name: plugin_platform_interface\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.3\"\n  process:\n    dependency: transitive\n    description:\n      name: process\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"3.0.13\"\n  pull_to_refresh:\n    dependency: transitive\n    description:\n      name: pull_to_refresh\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.6.3\"\n  quiver:\n    dependency: transitive\n    description:\n      name: quiver\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.5\"\n  rxdart:\n    dependency: transitive\n    description:\n      name: rxdart\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.24.1\"\n  shared_preferences:\n    dependency: transitive\n    description:\n      name: shared_preferences\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.5.12+4\"\n  shared_preferences_linux:\n    dependency: transitive\n    description:\n      name: shared_preferences_linux\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.2+4\"\n  shared_preferences_macos:\n    dependency: transitive\n    description:\n      name: shared_preferences_macos\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.1+11\"\n  shared_preferences_platform_interface:\n    dependency: transitive\n    description:\n      name: shared_preferences_platform_interface\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.4\"\n  shared_preferences_web:\n    dependency: transitive\n    description:\n      name: shared_preferences_web\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.2+7\"\n  shared_preferences_windows:\n    dependency: transitive\n    description:\n      name: shared_preferences_windows\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.0.1+3\"\n  sky_engine:\n    dependency: transitive\n    description: flutter\n    source: sdk\n    version: \"0.0.99\"\n  source_span:\n    dependency: transitive\n    description:\n      name: source_span\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.8.0-nullsafety.2\"\n  sqflite:\n    dependency: transitive\n    description:\n      name: sqflite\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.3.1+2\"\n  sqflite_common:\n    dependency: transitive\n    description:\n      name: sqflite_common\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.0.2+1\"\n  stack_trace:\n    dependency: transitive\n    description:\n      name: stack_trace\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.10.0-nullsafety.1\"\n  stream_channel:\n    dependency: transitive\n    description:\n      name: stream_channel\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.0-nullsafety.1\"\n  string_scanner:\n    dependency: transitive\n    description:\n      name: string_scanner\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.1.0-nullsafety.1\"\n  synchronized:\n    dependency: transitive\n    description:\n      name: synchronized\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.2.0+2\"\n  term_glyph:\n    dependency: transitive\n    description:\n      name: term_glyph\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.2.0-nullsafety.1\"\n  test_api:\n    dependency: transitive\n    description:\n      name: test_api\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.2.19-nullsafety.2\"\n  typed_data:\n    dependency: transitive\n    description:\n      name: typed_data\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.3.0-nullsafety.3\"\n  uuid:\n    dependency: transitive\n    description:\n      name: uuid\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.2.2\"\n  vector_math:\n    dependency: transitive\n    description:\n      name: vector_math\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"2.1.0-nullsafety.3\"\n  win32:\n    dependency: transitive\n    description:\n      name: win32\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"1.7.4\"\n  xdg_directories:\n    dependency: transitive\n    description:\n      name: xdg_directories\n      url: \"https://pub.flutter-io.cn\"\n    source: hosted\n    version: \"0.1.0\"\nsdks:\n  dart: \">=2.10.0-110 <2.11.0\"\n  flutter: \">=1.20.0 <2.0.0\"\n"
        },
        {
          "name": "pubspec.yaml",
          "type": "blob",
          "size": 5.5673828125,
          "content": "name: mxflutter_demo\ndescription: mxflutter demo App\n\n# The following defines the version and build number for your application.\n# A version number is three numbers separated by dots, like 1.2.43\n# followed by an optional build number separated by a +.\n# Both the version and the builder number may be overridden in flutter\n# build by specifying --build-name and --build-number, respectively.\n# Read more about versioning at semver.org.\nversion: 1.0.0+1\n\nenvironment:\n  sdk: \">=2.0.0-dev.68.0 <3.0.0\"\n\ndependencies:\n  flutter:\n    sdk: flutter\n\n  # The following adds the Cupertino Icons font to your application.\n  # Use with the CupertinoIcons class for iOS style icons.\n  cupertino_icons: ^0.1.2\n  flutter_gallery_assets: 0.1.9+2\n  # mxflutter 库在./mxflutter 目录\n  mxflutter:\n    path: ./mxflutter\n  device_info: ^1.0.0\n  mxflutter_pkg:\n    path: ./mxflutter_pkg\n  \ndev_dependencies:\n  flutter_test:\n    sdk: flutter\n\n\n# For information on the generic Dart part of this file, see the\n# following page: https://www.dartlang.org/tools/pub/pubspec\n\n# The following section is specific to Flutter.\nflutter:\n  assets:\n    #引入 mxflutter_js_bundle 下的JS Bundle 文件资源\n    - mxflutter_js_bundle/\n\n    #mxflutter app demo 使用到的图片资源\n    - packages/flutter_gallery_assets/people/ali_landscape.png\n    - packages/flutter_gallery_assets/logos/flutter_white/logo.png\n    - packages/flutter_gallery_assets/logos/fortnightly/fortnightly_logo.png\n    - packages/flutter_gallery_assets/food/butternut_squash_soup.png\n    - packages/flutter_gallery_assets/food/cherry_pie.png\n    - packages/flutter_gallery_assets/food/chopped_beet_leaves.png\n    - packages/flutter_gallery_assets/food/fruits.png\n    - packages/flutter_gallery_assets/food/pesto_pasta.png\n    - packages/flutter_gallery_assets/food/roasted_chicken.png\n    - packages/flutter_gallery_assets/food/spanakopita.png\n    - packages/flutter_gallery_assets/food/spinach_onion_salad.png\n    - packages/flutter_gallery_assets/food/icons/fish.png\n    - packages/flutter_gallery_assets/food/icons/healthy.png\n    - packages/flutter_gallery_assets/food/icons/main.png\n    - packages/flutter_gallery_assets/food/icons/meat.png\n    - packages/flutter_gallery_assets/food/icons/quick.png\n    - packages/flutter_gallery_assets/food/icons/spicy.png\n    - packages/flutter_gallery_assets/food/icons/veggie.png\n    - packages/flutter_gallery_assets/logos/pesto/logo_small.png\n    - packages/flutter_gallery_assets/products/backpack.png\n    - packages/flutter_gallery_assets/products/belt.png\n    - packages/flutter_gallery_assets/products/cup.png\n    - packages/flutter_gallery_assets/products/deskset.png\n    - packages/flutter_gallery_assets/products/dress.png\n    - packages/flutter_gallery_assets/products/earrings.png\n    - packages/flutter_gallery_assets/products/flatwear.png\n    - packages/flutter_gallery_assets/products/hat.png\n    - packages/flutter_gallery_assets/products/jacket.png\n    - packages/flutter_gallery_assets/products/jumper.png\n    - packages/flutter_gallery_assets/products/kitchen_quattro.png\n    - packages/flutter_gallery_assets/products/napkins.png\n    - packages/flutter_gallery_assets/products/planters.png\n    - packages/flutter_gallery_assets/products/platter.png\n    - packages/flutter_gallery_assets/products/scarf.png\n    - packages/flutter_gallery_assets/products/shirt.png\n    - packages/flutter_gallery_assets/products/sunnies.png\n    - packages/flutter_gallery_assets/products/sweater.png\n    - packages/flutter_gallery_assets/products/sweats.png\n    - packages/flutter_gallery_assets/products/table.png\n    - packages/flutter_gallery_assets/products/teaset.png\n    - packages/flutter_gallery_assets/products/top.png\n    - packages/flutter_gallery_assets/people/square/ali.png\n    - packages/flutter_gallery_assets/people/square/peter.png\n    - packages/flutter_gallery_assets/people/square/sandra.png\n    - packages/flutter_gallery_assets/people/square/stella.png\n    - packages/flutter_gallery_assets/people/square/trevor.png\n\n  fonts:\n    - family: Raleway\n      fonts:\n        - asset: packages/flutter_gallery_assets/fonts/raleway/Raleway-Regular.ttf\n        - asset: packages/flutter_gallery_assets/fonts/raleway/Raleway-Medium.ttf\n          weight: 500\n        - asset: packages/flutter_gallery_assets/fonts/raleway/Raleway-SemiBold.ttf\n          weight: 600\n\n\n  # The following line ensures that the Material Icons font is\n  # included with your application, so that you can use the icons in\n  # the material Icons class.\n  uses-material-design: true\n\n  # To add assets to your application, add an assets section, like this:\n  # assets:\n  #  - images/a_dot_burr.jpeg\n  #  - images/a_dot_ham.jpeg\n\n  # An image asset can refer to one or more resolution-specific \"variants\", see\n  # https://flutter.io/assets-and-images/#resolution-aware.\n\n  # For details regarding adding assets from package dependencies, see\n  # https://flutter.io/assets-and-images/#from-packages\n\n  # To add custom fonts to your application, add a fonts section here,\n  # in this \"flutter\" section. Each entry in this list should have a\n  # \"family\" key with the font family name, and a \"fonts\" key with a\n  # list giving the asset and other descriptors for the font. For\n  # example:\n  # fonts:\n  #   - family: Schyler\n  #     fonts:\n  #       - asset: fonts/Schyler-Regular.ttf\n  #       - asset: fonts/Schyler-Italic.ttf\n  #         style: italic\n  #   - family: Trajan Pro\n  #     fonts:\n  #       - asset: fonts/TrajanPro.ttf\n  #       - asset: fonts/TrajanPro_Bold.ttf\n  #         weight: 700\n  #\n  # For details regarding fonts from package dependencies,\n  # see https://flutter.io/custom-fonts/#from-packages\n"
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}