{
  "metadata": {
    "timestamp": 1736708745755,
    "page": 210,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "gephi/gephi",
      "stars": 5993,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 3.810546875,
          "content": "**/target\n.DS_Store\nkeystore.ks\n/target/\n/modules/AlgorithmsPlugin/target/\n/modules/AttributeColumnPropertyEditor/target/\n/modules/AttributesAPI/target/\n/modules/AttributesImpl/target/\n/modules/ClusteringAPI/target/\n/modules/ClusteringPlugin/target/\n/modules/CollectionUtils/target/\n/modules/DataLaboratoryAPI/target/\n/modules/DataLaboratoryPlugin/target/\n/modules/DesktopClustering/target/\n/modules/DBDrivers/target/\n/modules/DesktopContext/target/\n/modules/DesktopBranding/target/\n/modules/DesktopDataLaboratory/target/\n/modules/DesktopFilters/target/\n/modules/DesktopProgress/target/\n/modules/DesktopExport/target/\n/modules/DesktopGenerate/target/\n/modules/DesktopHierarchy/target/\n/modules/DesktopImport/target/\n/modules/DesktopLayout/target/\n/modules/DesktopPartition/target/\n/modules/DesktopPerspective/target/\n/modules/DesktopPreview/target/\n/modules/DesktopProject/target/\n/modules/DesktopRanking/target/\n/modules/DesktopRecentFiles/target/\n/modules/DesktopSpigot/target/\n/modules/DesktopStatistics/target/\n/modules/DesktopTimeline/target/\n/modules/DesktopTools/target/\n/modules/DHNSGraph/target/\n/modules/DirectoryChooser/target/\n/modules/DynamicAPI/target/\n/modules/DynamicImpl/target/\n/modules/ExportAPI/target/\n/modules/ExportPlugin/target/\n/modules/ExportPluginUI/target/\n/modules/FiltersAPI/target/\n/modules/FiltersImpl/target/\n/modules/FiltersPlugin/target/\n/modules/FiltersPluginUI/target/\n/modules/GeneratorAPI/target/\n/modules/GeneratorPlugin/target/\n/modules/GeneratorPluginUI/target/\n/modules/application/target/\n/modules/branding/target/\n/modules/Gleem/target/\n/modules/GraphAPI/target/\n/modules/ImportAPI/target/\n/modules/ImportPlugin/target/\n/modules/ImportPluginUI/target/\n/modules/LayoutAPI/target/\n/modules/LayoutPlugin/target/\n/modules/LongTaskAPI/target/\n/modules/MostRecentFilesAPI/target/\n/modules/PartitionAPI/target/\n/modules/PartitionPlugin/target/\n/modules/PartitionPluginUI/target/\n/modules/PerspectiveAPI/target/\n/modules/PreviewAPI/target/\n/modules/PreviewExport/target/\n/modules/PreviewExportUI/target/\n/modules/PreviewPlugin/target/\n/modules/ProcessorPlugin/target/\n/modules/ProcessorPluginUI/target/\n/modules/ProjectAPI/target/\n/modules/ProjectUI/target/\n/modules/RankingAPI/target/\n/modules/RankingPlugin/target/\n/modules/RankingPluginUI/target/\n/modules/SettingsUpgrader/target/\n/modules/SpigotPlugin/target/\n/modules/SpigotPluginUI/target/\n/modules/SplineEditor/target/\n/modules/StatisticsAPI/target/\n/modules/StatisticsPlugin/target/\n/modules/StatisticsPluginUI/target/\n/modules/TimelineAPI/target/\n/modules/ToolsAPI/target/\n/modules/ToolsPlugin/target/\n/modules/UIComponents/target/\n/modules/UIUtils/target/\n/modules/Utils/target/\n/modules/ValidationAPI/target/\n/modules/VisualizationAPI/target/\n/modules/VisualizationImpl/target/\n/modules/WelcomeScreen/target/\n/modules/WorkspaceUI/target/\n/modules/JFreeChartWrapper/target/\n/modules/CommonsWrapper/target/\n/modules/CoreLibraryWrapper/target/\n/modules/UILibraryWrapper/target/\n/modules/AppearanceAPI/target/\n/modules/AppearancePlugin/target/\n/modules/AppearancePluginUI/target/\n/modules/DesktopAppearance/target/\n/modules/branding/src/main/nbm-branding/modules/org-netbeans-core-windows.jar/org/netbeans/core/windows/view/ui/Bundle.properties\n/modules/branding/src/main/nbm-branding/core/core.jar/org/netbeans/core/startup/Bundle.properties\n/modules/TestUtils/target\n.java-version\nnb-configuration.xml\n*.args\n*.gpg\ndev_id.cer\n*.p12\n\n*.iml\n.idea/\n*.project\n.settings/**\n**/.settings/**\n**/.classpath\n**/.factorypath\nmodules/DesktopBranding/src/main/nbm-branding/core/core.jar/org/netbeans/core/startup/Bundle.properties\nmodules/DesktopBranding/src/main/nbm-branding/modules/org-netbeans-core-windows.jar/org/netbeans/core/windows/view/\nbuild.sh\n*.asc\n**/keystore/**\nsrc/macosx-launcher/.build\nsrc/macosx-launcher/.swiftpm\nsrc/macosx-launcher/Packages\nsrc/macosx-launcher/*.xcodeproj\nxcuserdata/\nprojects.xml"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.08203125,
          "content": "# Gephi Code of Conduct\n\n## Our Pledge\n\nWe as Gephi contributors and maintainers pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\ncontact@gephi.org.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "COPYING.txt",
          "type": "blob",
          "size": 1.619140625,
          "content": "Gephi main source code is distributed under the dual license CDDL 1.0 and GNU General Public License v3.\n\nCopyright 2012 Gephi Consortium. All rights reserved.\n\nThe contents of this file are subject to the terms of either the GNU General Public License Version 3 only (\"GPL\") or the Common Development and Distribution License(\"CDDL\") (collectively, the \"License\"). You may not use this file except in compliance with the License. You can obtain a copy of the License at http://gephi.org/about/legal/license-notice/ or /cddl-1.0.txt and /gpl-3.0.txt. See the License for the specific language governing permissions and limitations under the License. When distributing the software, include this License Header Notice in each file and include the License files at /cddl-1.0.txt and /gpl-3.0.txt. If applicable, add the following below the License Header, with the fields enclosed by brackets [] replaced by your own identifying information: \"Portions Copyrighted [year] [name of copyright owner]\"\n\nIf you wish your version of this file to be governed by only the CDDL or only the GPL Version 3, indicate your decision by adding \"[Contributor] elects to include this software in this distribution under the [CDDL or GPL Version 3] license.\" If you do not indicate a single choice of license, a recipient has the option to distribute your version of this file under either the CDDL, the GPL Version 3 or to extend the choice of license to its licensees as provided above. However, if you add GPL Version 3 code and therefore, elected the GPL Version 3 license, then the option applies only if the new code is made subject to such option by the copyright holder."
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 34.138671875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\nCopyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\nEveryone is permitted to copy and distribute verbatim copies\nof this license document, but changing it is not allowed.\n\n                            Preamble\n\nThe GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\nThe licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\nWhen we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\nFor example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\nFor the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\nSome devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\nFinally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n0. Definitions.\n\n\"This License\" refers to version 3 of the GNU General Public License.\n\n\"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n\"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\nTo \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\nA \"covered work\" means either the unmodified Program or a work based\non the Program.\n\nTo \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\nTo \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\nAn interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n1. Source Code.\n\nThe \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\nA \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\nThe \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\nThe \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\nThe Corresponding Source for a work in source code form is that\nsame work.\n\n2. Basic Permissions.\n\nAll rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\nNo covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\nWhen you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n4. Conveying Verbatim Copies.\n\nYou may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n5. Conveying Modified Source Versions.\n\nYou may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\nA compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n6. Conveying Non-Source Forms.\n\nYou may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\nA separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\nA \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n\"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\nIf you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\nThe requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\nCorresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n7. Additional Terms.\n\n\"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\nAll other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n8. Termination.\n\nYou may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\nHowever, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\nTermination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n9. Acceptance Not Required for Having Copies.\n\nYou are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n10. Automatic Licensing of Downstream Recipients.\n\nEach time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\nAn \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n11. Patents.\n\nA \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\nA contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\nIn the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\nA patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n12. No Surrender of Others' Freedom.\n\nIf conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n13. Use with the GNU Affero General Public License.\n\nNotwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n14. Revised Versions of this License.\n\nThe Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\nIf the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\nLater license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n15. Disclaimer of Warranty.\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n16. Limitation of Liability.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n17. Interpretation of Sections 15 and 16.\n\nIf the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\nYou should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<https://www.gnu.org/licenses/>.\n\nThe GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<https://www.gnu.org/licenses/why-not-lgpl.html>.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.9716796875,
          "content": "# Gephi - The Open Graph Viz Platform\r\n\r\n[![build](https://github.com/gephi/gephi/actions/workflows/build.yml/badge.svg)](https://github.com/gephi/gephi/actions/workflows/build.yml)\r\n[![Downloads](https://img.shields.io/github/downloads/gephi/gephi/v0.10.1/total.svg)](https://github.com/gephi/gephi/releases/tag/v0.10.1)\r\n[![Downloads](https://img.shields.io/github/downloads/gephi/gephi/total.svg)](https://github.com/gephi/gephi/releases/)\r\n[![Translation progress](https://hosted.weblate.org/widgets/gephi/-/svg-badge.svg)](https://hosted.weblate.org/engage/gephi/?utm_source=widget)\r\n\r\n[Gephi](http://gephi.org) is an award-winning open-source platform for visualizing and manipulating large graphs. It runs on Windows, Mac OS X and Linux. Localization is available in English, French, Spanish, Japanese, Russian, Brazilian Portuguese, Chinese, Czech, German and Romanian.\r\n\r\n- **Fast** Powered by a built-in OpenGL engine, Gephi is able to push the envelope with very large networks. Visualize networks up to a million elements. All actions (e.g. layout, filter, drag) run in real-time.\r\n\r\n- **Simple** Easy to install and [get started](https://gephi.github.io/users/quick-start). An UI that is centered around the visualization. Like Photoshop™ for graphs.\r\n\r\n- **Modular** Extend Gephi with [plug-ins](https://gephi.org/plugins). The architecture is built on top of [Apache Netbeans Platform](https://netbeans.apache.org/tutorials/nbm-quick-start.html) and can be extended or reused easily through well-written APIs.\r\n\r\n[Download Gephi](https://gephi.github.io/users/download) for Windows, Mac OS X and Linux and consult the [release notes](https://github.com/gephi/gephi/releases). Example datasets can be found on our [wiki](https://github.com/gephi/gephi/wiki/Datasets).\r\n\r\n![Gephi](https://gephi.github.io/images/screenshots/select-tool-mini.png)\r\n\r\n## Install and use Gephi\r\n\r\nDownload and [Install](https://gephi.github.io/users/install/) Gephi on your computer. \r\n\r\nGet started with the [Quick Start](https://gephi.github.io/users/quick-start/) and follow the [Tutorials](https://gephi.github.io/users/). Load a sample [dataset](https://github.com/gephi/gephi/wiki/Datasets) and start to play with the data.\r\n\r\nIf you run into any trouble or have questions consult our [discussions](https://github.com/gephi/gephi/discussions).\r\n\r\n## Latest releases\r\n\r\n### Stable\r\n\r\n- Latest stable release on [gephi.org](https://gephi.org/users/download/).\r\n\r\n### Development builds\r\n\r\nDevelopment builds are [generated regularly](https://github.com/gephi/gephi/actions/workflows/release.yml). Current version is 0.11.0-SNAPSHOT\r\n\r\n- [gephi-0.11.0-SNAPSHOT-windows-x64.exe](https://oss.sonatype.org/service/local/artifact/maven/content?r=snapshots&g=org.gephi&a=gephi&v=0.11.0-SNAPSHOT&c=windows-x64&p=exe) (Windows)\r\n\r\n- [gephi-0.11.0-SNAPSHOT-windows-x32.exe](https://oss.sonatype.org/service/local/artifact/maven/content?r=snapshots&g=org.gephi&a=gephi&v=0.11.0-SNAPSHOT&c=windows-x32&p=exe) (Windows x32)\r\n\r\n- [gephi-0.11.0-SNAPSHOT-macos-x64.dmg](https://oss.sonatype.org/service/local/artifact/maven/content?r=snapshots&g=org.gephi&a=gephi&v=0.11.0-SNAPSHOT&c=macos-x64&p=dmg) (Mac OS X)\r\n\r\n- [gephi-0.11.0-SNAPSHOT-macos-aarch64.dmg](https://oss.sonatype.org/service/local/artifact/maven/content?r=snapshots&g=org.gephi&a=gephi&v=0.11.0-SNAPSHOT&c=macos-aarch64&p=dmg) (Mac OS X Silicon)\r\n\r\n- [gephi-0.11.0-SNAPSHOT-linux-x64.tar.gz](https://oss.sonatype.org/service/local/artifact/maven/content?r=snapshots&g=org.gephi&a=gephi&v=0.11.0-SNAPSHOT&c=linux-x64&p=tar.gz) (Linux)\r\n\r\n## Developer Introduction\r\n\r\nGephi is developed in Java and uses OpenGL for its visualization engine. Built on the top of Netbeans Platform, it follows a loosely-coupled, modular architecture philosophy. Gephi is split into modules, which depend on other modules through well-written APIs. Plugins can reuse existing APIs, create new services and even replace a default implementation with a new one.\r\n\r\nConsult the [**Javadoc**](https://javadoc.io/doc/org.gephi/gephi/latest/index.html) for an overview of the APIs.\r\n\r\n### Requirements\r\n\r\n- Java JDK 11 (or later)\r\n\r\n- [Apache Maven](http://maven.apache.org/) version 3.6.3 or later\r\n\r\n### Checkout and Build the sources\r\n\r\n- Fork the repository and clone\r\n\r\n        git clone git@github.com:username/gephi.git\r\n\r\n- Run the following command or [open the project in an IDE](https://github.com/gephi/gephi/wiki/How-to-build-Gephi)\r\n\r\n        mvn -T 4 clean install\r\n\r\n- Once built, one can test running Gephi\r\n\r\n\t\tcd modules/application\r\n\t\tmvn nbm:cluster-app nbm:run-platform\r\n\r\nNote that while Gephi can be built using JDK 11 or later, it currently requires JDK 11 to run.\r\n\r\n### Create Plug-ins\r\n\r\nGephi is extensible and lets developers create plug-ins to add new features, or to modify existing features. For example, you can create a new layout algorithm, add a metric, create a filter or a tool, support a new file format or database, or modify the visualization.\r\n\r\n- [**Plugins Portal**](https://github.com/gephi/gephi/wiki/Plugins)\r\n\r\n- [Plugins Quick Start (5 minutes)](https://github.com/gephi/gephi/wiki/Plugin-Quick-Start)\r\n\r\n- Browse the [plugins](https://gephi.org/plugins) created by the community\r\n\r\n- We've created a [**Plugins Bootcamp**](https://github.com/gephi/gephi-plugins-bootcamp) to learn by examples.\r\n\r\n## Gephi Toolkit\r\n\r\nThe Gephi Toolkit project packages essential Gephi modules (Graph, Layout, Filters, IO…) in a standard Java library which any Java project can use for getting things done. It can be used on a server or command-line tool to do the same things Gephi does but automatically.\r\n\r\n- [Download](https://gephi.org/toolkit/)\r\n\r\n- [GitHub Project](https://github.com/gephi/gephi-toolkit)\r\n\r\n- [Toolkit Portal](https://github.com/gephi/gephi/wiki/Toolkit)\r\n\r\n## Localization\r\n\r\nWe use [Weblate](https://hosted.weblate.org/projects/gephi/) for localization. Follow the guidelines on the [wiki](https://github.com/gephi/gephi/wiki/Localization) for more details how to contribute.\r\n\r\n## Icons\r\n\r\nGephi uses icons from various sources. The icons are licensed under the [CC BY 3.0](https://creativecommons.org/licenses/by/3.0/) license.\r\n\r\nAll icons can be found in the `DesktopIcons` module, organised by module name.\r\n\r\n## License\r\n\r\nGephi main source code is distributed under the dual license [CDDL 1.0](http://www.opensource.org/licenses/CDDL-1.0) and [GNU General Public License v3](http://www.gnu.org/licenses/gpl.html). Read the [Legal FAQs](http://gephi.github.io/legal/faq/)  to learn more.\r\n\t\r\nCopyright 2011 Gephi Consortium. All rights reserved.\r\n\r\nThe contents of this file are subject to the terms of either the GNU\r\nGeneral Public License Version 3 only (\"GPL\") or the Common\r\nDevelopment and Distribution License (\"CDDL\") (collectively, the\r\n\"License\"). You may not use this file except in compliance with the\r\nLicense. You can obtain a copy of the License at\r\nhttp://gephi.github.io/developers/license/\r\nor /cddl-1.0.txt and /gpl-3.0.txt. See the License for the\r\nspecific language governing permissions and limitations under the\r\nLicense.  When distributing the software, include this License Header\r\nNotice in each file and include the License files at\r\n/cddl-1.0.txt and /gpl-3.0.txt. If applicable, add the following below the\r\nLicense Header, with the fields enclosed by brackets [] replaced by\r\nyour own identifying information:\r\n\"Portions Copyrighted [year] [name of copyright owner]\"\r\n\r\nIf you wish your version of this file to be governed by only the CDDL\r\nor only the GPL Version 3, indicate your decision by adding\r\n\"[Contributor] elects to include this software in this distribution\r\nunder the [CDDL or GPL Version 3] license.\" If you do not indicate a\r\nsingle choice of license, a recipient has the option to distribute\r\nyour version of this file under either the CDDL, the GPL Version 3 or\r\nto extend the choice of license to its licensees as provided above.\r\nHowever, if you add GPL Version 3 code and therefore, elected the GPL\r\nVersion 3 license, then the option applies only if the new code is\r\nmade subject to such option by the copyright holder.\r\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 5.48828125,
          "content": "# Security Policy\n\n## Introduction\n\nBefore diving into the details, it's important to note that Gephi is a **desktop software**.\n- It only interacts with local files. It **does NOT connect to the web** or to any networks.\n- Gephi **does NOT have any servers** and **does NOT host any data**.\n\nAll of the data you load into Gephi only resides in your computer's memory and hard drive. As a result, Gephi is much less exposed to security problems compared to web software for instance. Please take that in account while evaluating the policy below.\n\n## Supported Versions\n\nWe monitor security vulnerabilities in the dependencies we use, as well as within the core codebase. In case of a major vulnerability, we would release a new patch version of Gephi to address it.\n\n| Version | Supported          |\n| ------- | ------------------ |\n| 0.10.1   | :white_check_mark: |\n| 0.9.7   | :x:                |\n\n## Code security\n\nGephi's codebase is entirely open-source and [available on GitHub](https://github.com/gephi/gephi/). The project had always restricted commit permissions on its `main` branch and stable contributors. No external organisations are responsible for auditing the codebase.\n\nGephi has numerous dependencies, listed in the projects' `pom.xml` files. It only depends on other open-source projects. There are no dependencies on closed sources. If you're having a hard-time locating the source code of some of our dependencies, don't hesitate to reach out.\n\nIn addition, we have enabled **dependabot** to get informed about security vulnerabilities in our dependencies.\n\n## Contributors\n\nGephi had contributions from many individuals in many countries but the vast majority of the code was written by less than 5 people. We have CLA agreements with all major contributors. The core contributors are from France and Spain.\n\n## Release versions\n\nThe artifacts produced via the Gephi repository are secured. Users can always trust us with the release binaries they download from [gephi.or](https://gephi.org) or [https://github.com/gephi/gephi/releases](https://github.com/gephi/gephi/releases). \n\n**These measures are in place to ensure Gephi artifacts are safe and can't be compromised:**\n- Only the members of the core Gephi team can approve contributions and trigger releases.\n- The release process is [completely automated](https://github.com/gephi/gephi/actions/workflows/release.yml) via GitHub Actions and doesn't require any interactions with a developer's local computer.\n- Binaries are directly uploaded from GitHub Actions to [Maven Central](https://central.sonatype.com/artifact/org.gephi/gephi/overview). Only our project can push artifacts to the `org.gephi` groupId. As you may know, once a file is released on Maven Central, it can't be altered.\n- Digital signatures for the release binaries are also available on Maven Central.\n- The Mac OS app goes through a thorough [notarisation process](https://developer.apple.com/documentation/security/notarizing-macos-software-before-distribution) before being released. This means the package is sent to Apple's servers for verification and only if approved it can be released.\n- The Windows installer is also codesigned using an official certificate.\n\n## Vulnerabilities\n\nHere is a history of security/data vulnerabilities:\n\n| Name | Type | Severity | Description | Reported | Fixed |\n| ---- | ---- | -------- | ----------- | -------- | ----- |\n| PII in Crash Reports | Data privacy | Low | In the application logs it's possible to identify the username. The crash reports are voluntary, but it would be better to anonymize them. | October 2021 | ✅ Yes, in version 0.9.3 [#2340](https://github.com/gephi/gephi/issues/2340) |\n| Log4j vulnerability | Dependency vulnerability | N/A | Gephi doesn't depend on Log4j, we weren't affected. | December 2021 | N/A |\n\n## Reporting a Vulnerability\n\nIn case you find a vulnerability or want to get in touch regarding security, reach out to us at contact [at] gephi.org. Alternatively, you can [directly report via GitHub](https://github.com/gephi/gephi/security/advisories/new).\n\nBased on your analysis, we'll evaluate if there are any risks for our users. In case we decide to release a patched version, you'll be informed.\n\nWe don't offer any rewards. If you provide a PR or a patch with your report, we'll be happy to include you in the release notes (if you desire so).\n\n## Gephi Plugins\n\n[Plugins](https://gephi.org/plugins/#/) are extensions users can install within Gephi to extend its functionalities. Plugins are made available within Gephi via an approval process [detailed here](https://github.com/gephi/gephi-plugins). \n\n**These measures are in place to avoid malicious code from Plugins:**\n- Plugin contributors have to make PRs to the repository we control. Plugins artifacts can only be built from our repository. You can [inspect the codebase](https://github.com/gephi/gephi-plugins/tree/master-forge).\n- Plugin artifacts are hosted on GitHub on [our page](https://github.com/gephi/gephi-plugins/tree/gh-pages/plugins) branch. There is full visibility. These are the plugins files downloaded from Gephi.\n- Plugin packages (i.e. NBM files) are signed.\n- We only accept open-source dependencies in plugins.\n\nThat all said, be aware that Gephi Plugins can pose a risk:\n- Plugins can be packaged and distributed as NBMs files. Only the plugins available via Gephi are officially approved. If you manually install (e.g. via a NBM file you have received), you do that at your own risk.\n- Some Plugins may require network access. We recommend you to review the source code of the plugins you install."
        },
        {
          "name": "cddl-1.0.txt",
          "type": "blob",
          "size": 18.48046875,
          "content": "Unless otherwise noted, all files in this distribution are released\nunder the Common Development and Distribution License (CDDL).\nExceptions are noted within the associated source files.\n\n--------------------------------------------------------------------\n\n\nCOMMON DEVELOPMENT AND DISTRIBUTION LICENSE Version 1.0\n\n1. Definitions.\n\n    1.1. \"Contributor\" means each individual or entity that creates\n         or contributes to the creation of Modifications.\n\n    1.2. \"Contributor Version\" means the combination of the Original\n         Software, prior Modifications used by a Contributor (if any),\n         and the Modifications made by that particular Contributor.\n\n    1.3. \"Covered Software\" means (a) the Original Software, or (b)\n         Modifications, or (c) the combination of files containing\n         Original Software with files containing Modifications, in\n         each case including portions thereof.\n\n    1.4. \"Executable\" means the Covered Software in any form other\n         than Source Code.\n\n    1.5. \"Initial Developer\" means the individual or entity that first\n         makes Original Software available under this License.\n\n    1.6. \"Larger Work\" means a work which combines Covered Software or\n         portions thereof with code not governed by the terms of this\n         License.\n\n    1.7. \"License\" means this document.\n\n    1.8. \"Licensable\" means having the right to grant, to the maximum\n         extent possible, whether at the time of the initial grant or\n         subsequently acquired, any and all of the rights conveyed\n         herein.\n\n    1.9. \"Modifications\" means the Source Code and Executable form of\n         any of the following:\n\n        A. Any file that results from an addition to, deletion from or\n           modification of the contents of a file containing Original\n           Software or previous Modifications;\n\n        B. Any new file that contains any part of the Original\n           Software or previous Modifications; or\n\n        C. Any new file that is contributed or otherwise made\n           available under the terms of this License.\n\n    1.10. \"Original Software\" means the Source Code and Executable\n          form of computer software code that is originally released\n          under this License.\n\n    1.11. \"Patent Claims\" means any patent claim(s), now owned or\n          hereafter acquired, including without limitation, method,\n          process, and apparatus claims, in any patent Licensable by\n          grantor.\n\n    1.12. \"Source Code\" means (a) the common form of computer software\n          code in which modifications are made and (b) associated\n          documentation included in or with such code.\n\n    1.13. \"You\" (or \"Your\") means an individual or a legal entity\n          exercising rights under, and complying with all of the terms\n          of, this License.  For legal entities, \"You\" includes any\n          entity which controls, is controlled by, or is under common\n          control with You.  For purposes of this definition,\n          \"control\" means (a) the power, direct or indirect, to cause\n          the direction or management of such entity, whether by\n          contract or otherwise, or (b) ownership of more than fifty\n          percent (50%) of the outstanding shares or beneficial\n          ownership of such entity.\n\n2. License Grants.\n\n    2.1. The Initial Developer Grant.\n\n    Conditioned upon Your compliance with Section 3.1 below and\n    subject to third party intellectual property claims, the Initial\n    Developer hereby grants You a world-wide, royalty-free,\n    non-exclusive license:\n\n        (a) under intellectual property rights (other than patent or\n            trademark) Licensable by Initial Developer, to use,\n            reproduce, modify, display, perform, sublicense and\n            distribute the Original Software (or portions thereof),\n            with or without Modifications, and/or as part of a Larger\n            Work; and\n\n        (b) under Patent Claims infringed by the making, using or\n            selling of Original Software, to make, have made, use,\n            practice, sell, and offer for sale, and/or otherwise\n            dispose of the Original Software (or portions thereof).\n\n        (c) The licenses granted in Sections 2.1(a) and (b) are\n            effective on the date Initial Developer first distributes\n            or otherwise makes the Original Software available to a\n            third party under the terms of this License.\n\n        (d) Notwithstanding Section 2.1(b) above, no patent license is\n            granted: (1) for code that You delete from the Original\n            Software, or (2) for infringements caused by: (i) the\n            modification of the Original Software, or (ii) the\n            combination of the Original Software with other software\n            or devices.\n\n    2.2. Contributor Grant.\n\n    Conditioned upon Your compliance with Section 3.1 below and\n    subject to third party intellectual property claims, each\n    Contributor hereby grants You a world-wide, royalty-free,\n    non-exclusive license:\n\n        (a) under intellectual property rights (other than patent or\n            trademark) Licensable by Contributor to use, reproduce,\n            modify, display, perform, sublicense and distribute the\n            Modifications created by such Contributor (or portions\n            thereof), either on an unmodified basis, with other\n            Modifications, as Covered Software and/or as part of a\n            Larger Work; and\n\n        (b) under Patent Claims infringed by the making, using, or\n            selling of Modifications made by that Contributor either\n            alone and/or in combination with its Contributor Version\n            (or portions of such combination), to make, use, sell,\n            offer for sale, have made, and/or otherwise dispose of:\n            (1) Modifications made by that Contributor (or portions\n            thereof); and (2) the combination of Modifications made by\n            that Contributor with its Contributor Version (or portions\n            of such combination).\n\n        (c) The licenses granted in Sections 2.2(a) and 2.2(b) are\n            effective on the date Contributor first distributes or\n            otherwise makes the Modifications available to a third\n            party.\n\n        (d) Notwithstanding Section 2.2(b) above, no patent license is\n            granted: (1) for any code that Contributor has deleted\n            from the Contributor Version; (2) for infringements caused\n            by: (i) third party modifications of Contributor Version,\n            or (ii) the combination of Modifications made by that\n            Contributor with other software (except as part of the\n            Contributor Version) or other devices; or (3) under Patent\n            Claims infringed by Covered Software in the absence of\n            Modifications made by that Contributor.\n\n3. Distribution Obligations.\n\n    3.1. Availability of Source Code.\n\n    Any Covered Software that You distribute or otherwise make\n    available in Executable form must also be made available in Source\n    Code form and that Source Code form must be distributed only under\n    the terms of this License.  You must include a copy of this\n    License with every copy of the Source Code form of the Covered\n    Software You distribute or otherwise make available.  You must\n    inform recipients of any such Covered Software in Executable form\n    as to how they can obtain such Covered Software in Source Code\n    form in a reasonable manner on or through a medium customarily\n    used for software exchange.\n\n    3.2. Modifications.\n\n    The Modifications that You create or to which You contribute are\n    governed by the terms of this License.  You represent that You\n    believe Your Modifications are Your original creation(s) and/or\n    You have sufficient rights to grant the rights conveyed by this\n    License.\n\n    3.3. Required Notices.\n\n    You must include a notice in each of Your Modifications that\n    identifies You as the Contributor of the Modification.  You may\n    not remove or alter any copyright, patent or trademark notices\n    contained within the Covered Software, or any notices of licensing\n    or any descriptive text giving attribution to any Contributor or\n    the Initial Developer.\n\n    3.4. Application of Additional Terms.\n\n    You may not offer or impose any terms on any Covered Software in\n    Source Code form that alters or restricts the applicable version\n    of this License or the recipients' rights hereunder.  You may\n    choose to offer, and to charge a fee for, warranty, support,\n    indemnity or liability obligations to one or more recipients of\n    Covered Software.  However, you may do so only on Your own behalf,\n    and not on behalf of the Initial Developer or any Contributor.\n    You must make it absolutely clear that any such warranty, support,\n    indemnity or liability obligation is offered by You alone, and You\n    hereby agree to indemnify the Initial Developer and every\n    Contributor for any liability incurred by the Initial Developer or\n    such Contributor as a result of warranty, support, indemnity or\n    liability terms You offer.\n\n    3.5. Distribution of Executable Versions.\n\n    You may distribute the Executable form of the Covered Software\n    under the terms of this License or under the terms of a license of\n    Your choice, which may contain terms different from this License,\n    provided that You are in compliance with the terms of this License\n    and that the license for the Executable form does not attempt to\n    limit or alter the recipient's rights in the Source Code form from\n    the rights set forth in this License.  If You distribute the\n    Covered Software in Executable form under a different license, You\n    must make it absolutely clear that any terms which differ from\n    this License are offered by You alone, not by the Initial\n    Developer or Contributor.  You hereby agree to indemnify the\n    Initial Developer and every Contributor for any liability incurred\n    by the Initial Developer or such Contributor as a result of any\n    such terms You offer.\n\n    3.6. Larger Works.\n\n    You may create a Larger Work by combining Covered Software with\n    other code not governed by the terms of this License and\n    distribute the Larger Work as a single product.  In such a case,\n    You must make sure the requirements of this License are fulfilled\n    for the Covered Software.\n\n4. Versions of the License.\n\n    4.1. New Versions.\n\n    Sun Microsystems, Inc. is the initial license steward and may\n    publish revised and/or new versions of this License from time to\n    time.  Each version will be given a distinguishing version number.\n    Except as provided in Section 4.3, no one other than the license\n    steward has the right to modify this License.\n\n    4.2. Effect of New Versions.\n\n    You may always continue to use, distribute or otherwise make the\n    Covered Software available under the terms of the version of the\n    License under which You originally received the Covered Software.\n    If the Initial Developer includes a notice in the Original\n    Software prohibiting it from being distributed or otherwise made\n    available under any subsequent version of the License, You must\n    distribute and make the Covered Software available under the terms\n    of the version of the License under which You originally received\n    the Covered Software.  Otherwise, You may also choose to use,\n    distribute or otherwise make the Covered Software available under\n    the terms of any subsequent version of the License published by\n    the license steward.\n\n    4.3. Modified Versions.\n\n    When You are an Initial Developer and You want to create a new\n    license for Your Original Software, You may create and use a\n    modified version of this License if You: (a) rename the license\n    and remove any references to the name of the license steward\n    (except to note that the license differs from this License); and\n    (b) otherwise make it clear that the license contains terms which\n    differ from this License.\n\n5. DISCLAIMER OF WARRANTY.\n\n    COVERED SOFTWARE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\"\n    BASIS, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\n    INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED\n    SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR\n    PURPOSE OR NON-INFRINGING.  THE ENTIRE RISK AS TO THE QUALITY AND\n    PERFORMANCE OF THE COVERED SOFTWARE IS WITH YOU.  SHOULD ANY\n    COVERED SOFTWARE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE\n    INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY\n    NECESSARY SERVICING, REPAIR OR CORRECTION.  THIS DISCLAIMER OF\n    WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE.  NO USE OF\n    ANY COVERED SOFTWARE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS\n    DISCLAIMER.\n\n6. TERMINATION.\n\n    6.1. This License and the rights granted hereunder will terminate\n    automatically if You fail to comply with terms herein and fail to\n    cure such breach within 30 days of becoming aware of the breach.\n    Provisions which, by their nature, must remain in effect beyond\n    the termination of this License shall survive.\n\n    6.2. If You assert a patent infringement claim (excluding\n    declaratory judgment actions) against Initial Developer or a\n    Contributor (the Initial Developer or Contributor against whom You\n    assert such claim is referred to as \"Participant\") alleging that\n    the Participant Software (meaning the Contributor Version where\n    the Participant is a Contributor or the Original Software where\n    the Participant is the Initial Developer) directly or indirectly\n    infringes any patent, then any and all rights granted directly or\n    indirectly to You by such Participant, the Initial Developer (if\n    the Initial Developer is not the Participant) and all Contributors\n    under Sections 2.1 and/or 2.2 of this License shall, upon 60 days\n    notice from Participant terminate prospectively and automatically\n    at the expiration of such 60 day notice period, unless if within\n    such 60 day period You withdraw Your claim with respect to the\n    Participant Software against such Participant either unilaterally\n    or pursuant to a written agreement with Participant.\n\n    6.3. In the event of termination under Sections 6.1 or 6.2 above,\n    all end user licenses that have been validly granted by You or any\n    distributor hereunder prior to termination (excluding licenses\n    granted to You by any distributor) shall survive termination.\n\n7. LIMITATION OF LIABILITY.\n\n    UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT\n    (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL YOU, THE\n    INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\n    COVERED SOFTWARE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE\n    LIABLE TO ANY PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR\n    CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT\n    LIMITATION, DAMAGES FOR LOST PROFITS, LOSS OF GOODWILL, WORK\n    STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER\n    COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN\n    INFORMED OF THE POSSIBILITY OF SUCH DAMAGES.  THIS LIMITATION OF\n    LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL\n    INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT\n    APPLICABLE LAW PROHIBITS SUCH LIMITATION.  SOME JURISDICTIONS DO\n    NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR\n    CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT\n    APPLY TO YOU.\n\n8. U.S. GOVERNMENT END USERS.\n\n    The Covered Software is a \"commercial item,\" as that term is\n    defined in 48 C.F.R. 2.101 (Oct. 1995), consisting of \"commercial\n    computer software\" (as that term is defined at 48\n    C.F.R. 252.227-7014(a)(1)) and \"commercial computer software\n    documentation\" as such terms are used in 48 C.F.R. 12.212\n    (Sept. 1995).  Consistent with 48 C.F.R. 12.212 and 48\n    C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all\n    U.S. Government End Users acquire Covered Software with only those\n    rights set forth herein.  This U.S. Government Rights clause is in\n    lieu of, and supersedes, any other FAR, DFAR, or other clause or\n    provision that addresses Government rights in computer software\n    under this License.\n\n9. MISCELLANEOUS.\n\n    This License represents the complete agreement concerning subject\n    matter hereof.  If any provision of this License is held to be\n    unenforceable, such provision shall be reformed only to the extent\n    necessary to make it enforceable.  This License shall be governed\n    by the law of the jurisdiction specified in a notice contained\n    within the Original Software (except to the extent applicable law,\n    if any, provides otherwise), excluding such jurisdiction's\n    conflict-of-law provisions.  Any litigation relating to this\n    License shall be subject to the jurisdiction of the courts located\n    in the jurisdiction and venue specified in a notice contained\n    within the Original Software, with the losing party responsible\n    for costs, including, without limitation, court costs and\n    reasonable attorneys' fees and expenses.  The application of the\n    United Nations Convention on Contracts for the International Sale\n    of Goods is expressly excluded.  Any law or regulation which\n    provides that the language of a contract shall be construed\n    against the drafter shall not apply to this License.  You agree\n    that You alone are responsible for compliance with the United\n    States export administration regulations (and the export control\n    laws and regulation of any other countries) when You use,\n    distribute or otherwise make available any Covered Software.\n\n10. RESPONSIBILITY FOR CLAIMS.\n\n    As between Initial Developer and the Contributors, each party is\n    responsible for claims and damages arising, directly or\n    indirectly, out of its utilization of rights under this License\n    and You agree to work with Initial Developer and Contributors to\n    distribute such responsibility on an equitable basis.  Nothing\n    herein is intended or shall be deemed to constitute any admission\n    of liability.\n\n--------------------------------------------------------------------\n\nNOTICE PURSUANT TO SECTION 9 OF THE COMMON DEVELOPMENT AND\nDISTRIBUTION LICENSE (CDDL)\n\nFor Covered Software in this distribution, this License shall\nbe governed by the laws of the State of California (excluding\nconflict-of-law provisions).\n\nAny litigation relating to this License shall be subject to the\njurisdiction of the Federal Courts of the Northern District of\nCalifornia and the state courts of the State of California, with\nvenue lying in Santa Clara County, California.\n"
        },
        {
          "name": "checkstyle-suppressions.xml",
          "type": "blob",
          "size": 0.1865234375,
          "content": "<!DOCTYPE suppressions PUBLIC\n        \"-//Checkstyle//DTD SuppressionFilter Configuration 1.2//EN\"\n        \"https://checkstyle.org/dtds/suppressions_1_2.dtd\">\n\n<suppressions>\n\n</suppressions>"
        },
        {
          "name": "checkstyle.xml",
          "type": "blob",
          "size": 19.3671875,
          "content": "<?xml version=\"1.0\"?>\n<!DOCTYPE module PUBLIC\n        \"-//Checkstyle//DTD Checkstyle Configuration 1.3//EN\"\n        \"https://checkstyle.org/dtds/configuration_1_3.dtd\">\n\n<!--\n    This is a slightly customized version of the google checkstyle config\n    Search for \"Gephi\" to see customizations.\n-->\n\n<!--\n    Checkstyle configuration that checks the Google coding conventions from Google Java Style\n    that can be found at https://google.github.io/styleguide/javaguide.html\n\n    Checkstyle is very configurable. Be sure to read the documentation at\n    http://checkstyle.org (or in your downloaded distribution).\n\n    To completely disable a check, just comment it out or delete it from the file.\n    To suppress certain violations please review suppression filters.\n\n    Authors: Max Vetrenko, Ruslan Diachenko, Roman Ivanov.\n -->\n\n<module name = \"Checker\">\n    <property name=\"charset\" value=\"UTF-8\"/>\n\n    <property name=\"severity\" value=\"warning\"/>\n\n    <property name=\"fileExtensions\" value=\"java\"/>\n    <!-- Excludes all 'module-info.java' files              -->\n    <!-- See https://checkstyle.org/config_filefilters.html -->\n    <module name=\"BeforeExecutionExclusionFileFilter\">\n        <property name=\"fileNamePattern\" value=\"module\\-info\\.java$\"/>\n    </module>\n    <!-- https://checkstyle.org/config_filters.html#SuppressionFilter -->\n    <module name=\"SuppressionFilter\">\n        <property name=\"file\" value=\"${org.checkstyle.google.suppressionfilter.config}\"\n                  default=\"checkstyle-suppressions.xml\" />\n        <property name=\"optional\" value=\"true\"/>\n    </module>\n\n    <!-- Checks for whitespace                               -->\n    <!-- See http://checkstyle.org/config_whitespace.html -->\n    <module name=\"FileTabCharacter\">\n        <property name=\"severity\" value=\"error\"/>\n        <property name=\"eachLine\" value=\"true\"/>\n    </module>\n\n    <module name=\"LineLength\">\n        <property name=\"fileExtensions\" value=\"java\"/>\n        <!-- Gephi: changed from 100 -->\n        <property name=\"max\" value=\"120\"/>\n        <property name=\"ignorePattern\" value=\"^package.*|^import.*|a href|href|http://|https://|ftp://\"/>\n    </module>\n\n    <module name=\"TreeWalker\">\n        <module name=\"OuterTypeFilename\"/>\n        <module name=\"IllegalTokenText\">\n            <property name=\"tokens\" value=\"STRING_LITERAL, CHAR_LITERAL\"/>\n            <property name=\"format\"\n                      value=\"\\\\u00(09|0(a|A)|0(c|C)|0(d|D)|22|27|5(C|c))|\\\\(0(10|11|12|14|15|42|47)|134)\"/>\n            <property name=\"message\"\n                      value=\"Consider using special escape sequence instead of octal value or Unicode escaped value.\"/>\n        </module>\n        <module name=\"AvoidEscapedUnicodeCharacters\">\n            <property name=\"allowEscapesForControlCharacters\" value=\"true\"/>\n            <property name=\"allowByTailComment\" value=\"true\"/>\n            <property name=\"allowNonPrintableEscapes\" value=\"true\"/>\n        </module>\n        <module name=\"AvoidStarImport\"/>\n        <module name=\"OneTopLevelClass\"/>\n        <module name=\"NoLineWrap\">\n            <property name=\"tokens\" value=\"PACKAGE_DEF, IMPORT, STATIC_IMPORT\"/>\n        </module>\n        <module name=\"EmptyBlock\">\n            <property name=\"option\" value=\"TEXT\"/>\n            <property name=\"tokens\"\n                      value=\"LITERAL_TRY, LITERAL_FINALLY, LITERAL_IF, LITERAL_ELSE, LITERAL_SWITCH\"/>\n        </module>\n        <module name=\"NeedBraces\">\n            <property name=\"tokens\"\n                      value=\"LITERAL_DO, LITERAL_ELSE, LITERAL_FOR, LITERAL_IF, LITERAL_WHILE\"/>\n        </module>\n        <module name=\"LeftCurly\">\n            <property name=\"tokens\"\n                      value=\"ANNOTATION_DEF, CLASS_DEF, CTOR_DEF, ENUM_CONSTANT_DEF, ENUM_DEF,\n                    INTERFACE_DEF, LAMBDA, LITERAL_CASE, LITERAL_CATCH, LITERAL_DEFAULT,\n                    LITERAL_DO, LITERAL_ELSE, LITERAL_FINALLY, LITERAL_FOR, LITERAL_IF,\n                    LITERAL_SWITCH, LITERAL_SYNCHRONIZED, LITERAL_TRY, LITERAL_WHILE, METHOD_DEF,\n                    OBJBLOCK, STATIC_INIT, RECORD_DEF, COMPACT_CTOR_DEF\"/>\n        </module>\n        <module name=\"RightCurly\">\n            <property name=\"id\" value=\"RightCurlySame\"/>\n            <property name=\"tokens\"\n                      value=\"LITERAL_TRY, LITERAL_CATCH, LITERAL_FINALLY, LITERAL_IF, LITERAL_ELSE,\n                    LITERAL_DO\"/>\n        </module>\n        <module name=\"RightCurly\">\n            <property name=\"id\" value=\"RightCurlyAlone\"/>\n            <property name=\"option\" value=\"alone\"/>\n            <property name=\"tokens\"\n                      value=\"CLASS_DEF, METHOD_DEF, CTOR_DEF, LITERAL_FOR, LITERAL_WHILE, STATIC_INIT,\n                    INSTANCE_INIT, ANNOTATION_DEF, ENUM_DEF, INTERFACE_DEF, RECORD_DEF,\n                    COMPACT_CTOR_DEF\"/>\n        </module>\n        <module name=\"SuppressionXpathSingleFilter\">\n            <!-- suppresion is required till https://github.com/checkstyle/checkstyle/issues/7541 -->\n            <property name=\"id\" value=\"RightCurlyAlone\"/>\n            <property name=\"query\" value=\"//RCURLY[parent::SLIST[count(./*)=1]\n                                     or preceding-sibling::*[last()][self::LCURLY]]\"/>\n        </module>\n        <module name=\"WhitespaceAfter\">\n            <property name=\"tokens\"\n                      value=\"COMMA, SEMI, TYPECAST, LITERAL_IF, LITERAL_ELSE,\n                    LITERAL_WHILE, LITERAL_DO, LITERAL_FOR, DO_WHILE\"/>\n        </module>\n        <module name=\"WhitespaceAround\">\n            <property name=\"allowEmptyConstructors\" value=\"true\"/>\n            <property name=\"allowEmptyLambdas\" value=\"true\"/>\n            <property name=\"allowEmptyMethods\" value=\"true\"/>\n            <property name=\"allowEmptyTypes\" value=\"true\"/>\n            <property name=\"allowEmptyLoops\" value=\"true\"/>\n            <property name=\"ignoreEnhancedForColon\" value=\"false\"/>\n            <property name=\"tokens\"\n                      value=\"ASSIGN, BAND, BAND_ASSIGN, BOR, BOR_ASSIGN, BSR, BSR_ASSIGN, BXOR,\n                    BXOR_ASSIGN, COLON, DIV, DIV_ASSIGN, DO_WHILE, EQUAL, GE, GT, LAMBDA, LAND,\n                    LCURLY, LE, LITERAL_CATCH, LITERAL_DO, LITERAL_ELSE, LITERAL_FINALLY,\n                    LITERAL_FOR, LITERAL_IF, LITERAL_RETURN, LITERAL_SWITCH, LITERAL_SYNCHRONIZED,\n                    LITERAL_TRY, LITERAL_WHILE, LOR, LT, MINUS, MINUS_ASSIGN, MOD, MOD_ASSIGN,\n                    NOT_EQUAL, PLUS, PLUS_ASSIGN, QUESTION, RCURLY, SL, SLIST, SL_ASSIGN, SR,\n                    SR_ASSIGN, STAR, STAR_ASSIGN, LITERAL_ASSERT, TYPE_EXTENSION_AND\"/>\n            <message key=\"ws.notFollowed\"\n                     value=\"WhitespaceAround: ''{0}'' is not followed by whitespace. Empty blocks may only be represented as '{}' when not part of a multi-block statement (4.1.3)\"/>\n            <message key=\"ws.notPreceded\"\n                     value=\"WhitespaceAround: ''{0}'' is not preceded with whitespace.\"/>\n        </module>\n        <module name=\"OneStatementPerLine\"/>\n        <module name=\"MultipleVariableDeclarations\"/>\n        <module name=\"ArrayTypeStyle\"/>\n        <module name=\"MissingSwitchDefault\"/>\n        <module name=\"FallThrough\"/>\n        <module name=\"UpperEll\"/>\n        <module name=\"ModifierOrder\"/>\n        <module name=\"EmptyLineSeparator\">\n            <property name=\"severity\" value=\"error\"/>\n            <property name=\"tokens\"\n                      value=\"PACKAGE_DEF, IMPORT, STATIC_IMPORT, CLASS_DEF, INTERFACE_DEF, ENUM_DEF,\n                    STATIC_INIT, INSTANCE_INIT, METHOD_DEF, CTOR_DEF, VARIABLE_DEF, RECORD_DEF,\n                    COMPACT_CTOR_DEF\"/>\n            <property name=\"allowNoEmptyLineBetweenFields\" value=\"true\"/>\n        </module>\n        <module name=\"SeparatorWrap\">\n            <property name=\"id\" value=\"SeparatorWrapDot\"/>\n            <property name=\"tokens\" value=\"DOT\"/>\n            <property name=\"option\" value=\"nl\"/>\n        </module>\n        <module name=\"SeparatorWrap\">\n            <property name=\"id\" value=\"SeparatorWrapComma\"/>\n            <property name=\"tokens\" value=\"COMMA\"/>\n            <property name=\"option\" value=\"EOL\"/>\n        </module>\n        <module name=\"SeparatorWrap\">\n            <!-- ELLIPSIS is EOL until https://github.com/google/styleguide/issues/259 -->\n            <property name=\"id\" value=\"SeparatorWrapEllipsis\"/>\n            <property name=\"tokens\" value=\"ELLIPSIS\"/>\n            <property name=\"option\" value=\"EOL\"/>\n        </module>\n        <module name=\"SeparatorWrap\">\n            <!-- ARRAY_DECLARATOR is EOL until https://github.com/google/styleguide/issues/258 -->\n            <property name=\"id\" value=\"SeparatorWrapArrayDeclarator\"/>\n            <property name=\"tokens\" value=\"ARRAY_DECLARATOR\"/>\n            <property name=\"option\" value=\"EOL\"/>\n        </module>\n        <module name=\"SeparatorWrap\">\n            <property name=\"id\" value=\"SeparatorWrapMethodRef\"/>\n            <property name=\"tokens\" value=\"METHOD_REF\"/>\n            <property name=\"option\" value=\"nl\"/>\n        </module>\n        <module name=\"PackageName\">\n            <property name=\"format\" value=\"^[a-z]+(\\.[a-z][a-z0-9]*)*$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Package name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"TypeName\">\n            <property name=\"tokens\" value=\"CLASS_DEF, INTERFACE_DEF, ENUM_DEF,\n                    ANNOTATION_DEF, RECORD_DEF\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Type name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"MemberName\">\n            <property name=\"format\" value=\"^[a-z][a-z0-9][a-zA-Z0-9]*$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Member name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"ParameterName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Parameter name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"LambdaParameterName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Lambda parameter name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"CatchParameterName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Catch parameter name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"LocalVariableName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Local variable name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"PatternVariableName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Pattern variable name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"ClassTypeParameterName\">\n            <property name=\"format\" value=\"(^[A-Z][0-9]?)$|([A-Z][a-zA-Z0-9]*[T]$)\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Class type name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"RecordComponentName\">\n            <property name=\"format\" value=\"^[a-z]([a-z0-9][a-zA-Z0-9]*)?$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Record component name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"RecordTypeParameterName\">\n            <property name=\"format\" value=\"(^[A-Z][0-9]?)$|([A-Z][a-zA-Z0-9]*[T]$)\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Record type name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"MethodTypeParameterName\">\n            <property name=\"format\" value=\"(^[A-Z][0-9]?)$|([A-Z][a-zA-Z0-9]*[T]$)\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Method type name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"InterfaceTypeParameterName\">\n            <property name=\"format\" value=\"(^[A-Z][0-9]?)$|([A-Z][a-zA-Z0-9]*[T]$)\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Interface type name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"NoFinalizer\"/>\n        <module name=\"GenericWhitespace\">\n            <message key=\"ws.followed\"\n                     value=\"GenericWhitespace ''{0}'' is followed by whitespace.\"/>\n            <message key=\"ws.preceded\"\n                     value=\"GenericWhitespace ''{0}'' is preceded with whitespace.\"/>\n            <message key=\"ws.illegalFollow\"\n                     value=\"GenericWhitespace ''{0}'' should followed by whitespace.\"/>\n            <message key=\"ws.notPreceded\"\n                     value=\"GenericWhitespace ''{0}'' is not preceded with whitespace.\"/>\n        </module>\n        <!-- Gephi: Adjusted -->\n        <module name=\"Indentation\">\n            <property name=\"basicOffset\" value=\"4\"/>\n            <property name=\"braceAdjustment\" value=\"0\"/>\n            <property name=\"caseIndent\" value=\"4\"/>\n            <property name=\"throwsIndent\" value=\"4\"/>\n            <property name=\"lineWrappingIndentation\" value=\"4\"/>\n            <property name=\"arrayInitIndent\" value=\"4\"/>\n        </module>\n        <module name=\"AbbreviationAsWordInName\">\n            <property name=\"ignoreFinal\" value=\"false\"/>\n            <!-- Gephi: changed from 0 -->\n            <property name=\"allowedAbbreviationLength\" value=\"3\"/>\n            <property name=\"tokens\"\n                      value=\"CLASS_DEF, INTERFACE_DEF, ENUM_DEF, ANNOTATION_DEF, ANNOTATION_FIELD_DEF,\n                    PARAMETER_DEF, VARIABLE_DEF, METHOD_DEF, PATTERN_VARIABLE_DEF, RECORD_DEF,\n                    RECORD_COMPONENT_DEF\"/>\n        </module>\n        <module name=\"NoWhitespaceBeforeCaseDefaultColon\"/>\n        <module name=\"OverloadMethodsDeclarationOrder\"/>\n        <module name=\"VariableDeclarationUsageDistance\"/>\n        <module name=\"CustomImportOrder\">\n            <property name=\"sortImportsInGroupAlphabetically\" value=\"true\"/>\n            <property name=\"separateLineBetweenGroups\" value=\"true\"/>\n            <property name=\"customImportOrderRules\" value=\"STATIC###THIRD_PARTY_PACKAGE\"/>\n            <property name=\"tokens\" value=\"IMPORT, STATIC_IMPORT, PACKAGE_DEF\"/>\n        </module>\n        <module name=\"MethodParamPad\">\n            <property name=\"tokens\"\n                      value=\"CTOR_DEF, LITERAL_NEW, METHOD_CALL, METHOD_DEF,\n                    SUPER_CTOR_CALL, ENUM_CONSTANT_DEF, RECORD_DEF\"/>\n        </module>\n        <module name=\"NoWhitespaceBefore\">\n            <property name=\"tokens\"\n                      value=\"COMMA, SEMI, POST_INC, POST_DEC, DOT,\n                    LABELED_STAT, METHOD_REF\"/>\n            <property name=\"allowLineBreaks\" value=\"true\"/>\n        </module>\n        <module name=\"ParenPad\">\n            <property name=\"tokens\"\n                      value=\"ANNOTATION, ANNOTATION_FIELD_DEF, CTOR_CALL, CTOR_DEF, DOT, ENUM_CONSTANT_DEF,\n                    EXPR, LITERAL_CATCH, LITERAL_DO, LITERAL_FOR, LITERAL_IF, LITERAL_NEW,\n                    LITERAL_SWITCH, LITERAL_SYNCHRONIZED, LITERAL_WHILE, METHOD_CALL,\n                    METHOD_DEF, QUESTION, RESOURCE_SPECIFICATION, SUPER_CTOR_CALL, LAMBDA,\n                    RECORD_DEF\"/>\n        </module>\n        <!-- Gephi: commented out OperatorWrap -->\n        <!-- <module name=\"OperatorWrap\">\n            <property name=\"option\" value=\"NL\"/>\n            <property name=\"tokens\"\n                      value=\"BAND, BOR, BSR, BXOR, DIV, EQUAL, GE, GT, LAND, LE, LITERAL_INSTANCEOF, LOR,\n                    LT, MINUS, MOD, NOT_EQUAL, PLUS, QUESTION, SL, SR, STAR, METHOD_REF,\n                    TYPE_EXTENSION_AND \"/>\n        </module> -->\n        <module name=\"AnnotationLocation\">\n            <property name=\"id\" value=\"AnnotationLocationMostCases\"/>\n            <property name=\"tokens\"\n                      value=\"CLASS_DEF, INTERFACE_DEF, ENUM_DEF, METHOD_DEF, CTOR_DEF,\n                      RECORD_DEF, COMPACT_CTOR_DEF\"/>\n        </module>\n        <module name=\"AnnotationLocation\">\n            <property name=\"id\" value=\"AnnotationLocationVariables\"/>\n            <property name=\"tokens\" value=\"VARIABLE_DEF\"/>\n            <property name=\"allowSamelineMultipleAnnotations\" value=\"true\"/>\n        </module>\n        <module name=\"NonEmptyAtclauseDescription\"/>\n        <module name=\"InvalidJavadocPosition\"/>\n        <module name=\"JavadocTagContinuationIndentation\"/>\n        <!-- Gephi: commented out SummaryJavadoc -->\n        <!-- <module name=\"SummaryJavadoc\">\n            <property name=\"forbiddenSummaryFragments\"\n                      value=\"^@return the *|^This method returns |^A [{]@code [a-zA-Z0-9]+[}]( is a )\"/>\n        </module> -->\n        <!-- Gephi: commented out JavadocParagraph -->\n        <!-- <module name=\"JavadocParagraph\"/> -->\n        <module name=\"RequireEmptyLineBeforeBlockTagGroup\"/>\n        <module name=\"AtclauseOrder\">\n            <property name=\"tagOrder\" value=\"@param, @return, @throws, @deprecated\"/>\n            <property name=\"target\"\n                      value=\"CLASS_DEF, INTERFACE_DEF, ENUM_DEF, METHOD_DEF, CTOR_DEF, VARIABLE_DEF\"/>\n        </module>\n        <module name=\"JavadocMethod\">\n            <property name=\"accessModifiers\" value=\"public\"/>\n            <property name=\"allowMissingParamTags\" value=\"true\"/>\n            <property name=\"allowMissingReturnTag\" value=\"true\"/>\n            <property name=\"allowedAnnotations\" value=\"Override, Test\"/>\n            <property name=\"tokens\" value=\"METHOD_DEF, CTOR_DEF, ANNOTATION_FIELD_DEF, COMPACT_CTOR_DEF\"/>\n        </module>\n        <!-- Gephi: commented out MissingJavadocMethod and MissingJavadocType -->\n        <!-- <module name=\"MissingJavadocMethod\">\n            <property name=\"scope\" value=\"public\"/>\n            <property name=\"minLineCount\" value=\"2\"/>\n            <property name=\"allowedAnnotations\" value=\"Override, Test\"/>\n            <property name=\"tokens\" value=\"METHOD_DEF, CTOR_DEF, ANNOTATION_FIELD_DEF,\n                                   COMPACT_CTOR_DEF\"/>\n        </module>\n        <module name=\"MissingJavadocType\">\n            <property name=\"scope\" value=\"protected\"/>\n            <property name=\"tokens\"\n                      value=\"CLASS_DEF, INTERFACE_DEF, ENUM_DEF,\n                      RECORD_DEF, ANNOTATION_DEF\"/>\n            <property name=\"excludeScope\" value=\"nothing\"/>\n        </module> -->\n        <module name=\"MethodName\">\n            <property name=\"format\" value=\"^[a-z][a-z0-9][a-zA-Z0-9_]*$\"/>\n            <message key=\"name.invalidPattern\"\n                     value=\"Method name ''{0}'' must match pattern ''{1}''.\"/>\n        </module>\n        <module name=\"SingleLineJavadoc\"/>\n        <module name=\"EmptyCatchBlock\">\n            <property name=\"exceptionVariableName\" value=\"expected\"/>\n        </module>\n        <module name=\"CommentsIndentation\">\n            <property name=\"tokens\" value=\"SINGLE_LINE_COMMENT, BLOCK_COMMENT_BEGIN\"/>\n        </module>\n        <!-- https://checkstyle.org/config_filters.html#SuppressionXpathFilter -->\n        <module name=\"SuppressionXpathFilter\">\n            <property name=\"file\" value=\"${org.checkstyle.google.suppressionxpathfilter.config}\"\n                      default=\"checkstyle-xpath-suppressions.xml\" />\n            <property name=\"optional\" value=\"true\"/>\n        </module>\n    </module>\n</module>"
        },
        {
          "name": "flathub",
          "type": "tree",
          "content": null
        },
        {
          "name": "gpl-3.0.txt",
          "type": "blob",
          "size": 34.3232421875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "maven-version-rules.xml",
          "type": "blob",
          "size": 2.1123046875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<ruleset xmlns=\"http://mojo.codehaus.org/versions-maven-plugin/rule/2.0.0\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" comparisonMethod=\"maven\" xsi:schemaLocation=\"http://mojo.codehaus.org/versions-maven-plugin/rule/2.0.0 http://mojo.codehaus.org/versions-maven-plugin/xsd/rule-2.0.0.xsd\">\n    <ignoreVersions>\n        <!-- Ignore Alpha's, Beta's, release candidates and milestones -->\n        <ignoreVersion type=\"regex\">(?i).*alpha.*</ignoreVersion>\n        \n        <ignoreVersion type=\"regex\">(?i).*beta.*</ignoreVersion>\n\t\t <ignoreVersion type=\"regex\">(?i).*preview.*</ignoreVersion>\n\t\t\n        <ignoreVersion type=\"regex\">(?i).*[-.]b([0-9]+)?</ignoreVersion>\n        \n        <ignoreVersion type=\"regex\">(?i).*[-.]rc([0-9]+)?</ignoreVersion>\n        \n        <ignoreVersion type=\"regex\">(?i).*[-.]m([0-9]+)?</ignoreVersion>\n        \n        <ignoreVersion type=\"regex\">(?i).*[-.]pr([0-9]+)?</ignoreVersion>\n        \n        <!-- Ignore Netbeans RCP non-standard versions -->\n        <ignoreVersion type=\"regex\">(?i)RELEASE.*</ignoreVersion>\n        \n        <!-- Ignore old jre specific versions-->\n        <ignoreVersion type=\"regex\">(?i).*[-.]jre[0-9]+</ignoreVersion>\n    </ignoreVersions>\n    <rules>\n        <!-- Obvious mismatches -->\n\t\t<!--\n        <rule groupId=\"commons-collections\" artifactId=\"commons-collections\">\n            <ignoreVersions>\n                <ignoreVersion type=\"regex\">^200.*$</ignoreVersion>\n            </ignoreVersions>\n        </rule>\n        <rule groupId=\"commons-logging\" artifactId=\"commons-logging\">\n            <ignoreVersions>\n                <ignoreVersion>99.0-does-not-exist</ignoreVersion>\n            </ignoreVersions>\n        </rule>\n        <rule groupId=\"org.hamcrest\">\n            <ignoreVersions>\n                <ignoreVersion>1.4-atlassian-1</ignoreVersion>\n            </ignoreVersions>\n        </rule>\n\t\t-->\n    </rules>\n</ruleset>\n\n<!-- This file is used for checking new dependency and plugin versions with mvn versions:display-dependency-updates and mvn versions:display-plugin-updates and ignoring some noisy incorrect versions detected as newer -->"
        },
        {
          "name": "modules",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 63.3671875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n\n    <groupId>org.gephi</groupId>\n    <artifactId>gephi-parent</artifactId>\n    <version>0.11.0-SNAPSHOT</version>\n    <packaging>pom</packaging>\n\n    <name>gephi</name>\n    \n    <!-- Project Metadata -->\n    <url>https://gephi.org</url>\n    <description>Gephi - The Open Graph Viz Platform</description>\n    <organization>\n        <name>Gephi</name>\n        <url>https://gephi.org</url>\n    </organization>\n    <inceptionYear>2007</inceptionYear>\n    \n    <!-- Licenses -->\n    <licenses>\n        <license>\n            <name>CDDL 1.0</name>\n            <url>https://www.opensource.org/licenses/CDDL-1.0</url>\n            <comments>CDDL License 1.0</comments>\n        </license>\n        <license>\n            <name>GPL v3</name>\n            <url>https://www.opensource.org/licenses/GPL-3.0</url>\n            <comments>GPL v3 License</comments>\n        </license>\n    </licenses>\n    \n    <!-- SCM -->\n    <scm>\n        <connection>scm:git:git://github.com/gephi/gephi.git</connection>\n        <developerConnection>scm:git:git@github.com:gephi/gephi.git</developerConnection>\n        <url>https://github.com/gephi/gephi</url>\n    </scm>\n    \n    <!-- Developers -->\n    <developers>\n        <developer>\n            <id>mbastian</id>\n            <name>Mathieu Bastian</name>\n            <email>mathieu.bastian@gephi.org</email>\n        </developer>\n        <developer>\n            <id>eduramiba</id>\n            <name>Eduardo Ramos</name>\n            <email>eduardo.ramos@gephi.org</email>\n        </developer>\n        <developer>\n            <id>jacomyma</id>\n            <name>Mathieu Jacomy</name>\n            <email>mathieu.jacomy@gephi.org</email>\n        </developer>\n        <developer>\n            <id>sheymann</id>\n            <name>Sébastien Heymann</name>\n            <email>sebastien.heymann@gephi.org</email>\n        </developer>\n        <developer>\n            <id>jbilcke</id>\n            <name>Julian Bilcke</name>\n            <email>julian.bilcke@gephi.org</email>\n        </developer>\n        <developer>\n            <id>jersub</id>\n            <name>Jeremy Subtil</name>\n            <email>jeremy.subtil@gephi.org</email>\n        </developer>\n        <developer>\n            <id>cbartosiak</id>\n            <name>Cezary Bartosiak</name>\n            <email>cezary.bartosiak@gephi.org</email>\n        </developer>\n        <developer>\n            <id>megaterik</id>\n            <name>Taras Klaskovsky</name>\n            <email>taras.klaskovsky@gephi.org</email>\n        </developer>\n        <developer>\n            <id>vojtech-bardiovsky</id>\n            <name>Vojtech Bardiovsky</name>\n            <email>vojtech.bardiovsky@gephi.org</email>\n        </developer>\n        <developer>\n            <id>luizribeiro</id>\n            <name>Luiz Ribeiro</name>\n            <email>luiz.ribeiro@gephi.org</email>\n        </developer>\n        <developer>\n            <id>baiacu</id>\n            <name>Helder Suzuki</name>\n            <email>helder.suzuki@gephi.org</email>\n        </developer>\n        <developer>\n            <id>daniel-bernardes</id>\n            <name>Daniel Bernades</name>\n            <email>daniel.bernades@gephi.org</email>\n        </developer>\n        <developer>\n            <id>taynaud</id>\n            <name>Thomas Aynaud</name>\n            <email>thomas.aynaud@gephi.org</email>\n        </developer>\n        <developer>\n            <id>panisson</id>\n            <name>André Panisson</name>\n            <email>andre.panission@gephi.org</email>\n        </developer>\n        <developer>\n            <id>annaalkh</id>\n            <name>Anna Kharitonova</name>\n            <email>anna.kharitonova@gephi.org</email>\n        </developer>\n        <developer>\n            <id>binarycrayon</id>\n            <name>Yudi Xue</name>\n            <email>yudi.xue@gephi.org</email>\n        </developer>\n    </developers>\n\n    <!-- Properties -->\n    <properties>\n        <maven.build.timestamp.format>yyyyMMddHHmm</maven.build.timestamp.format>\n        <gephi.build.timestamp>${maven.build.timestamp}</gephi.build.timestamp>\n        \n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <gephi.maven.requiredVersion>3.6.3</gephi.maven.requiredVersion>\n        <netbeans.run.params.ide/>\n        <netbeans.run.params>${netbeans.run.params.ide}</netbeans.run.params>\n        \n        <!-- Netbeans Platform version -->\n        <netbeans.version>RELEASE220</netbeans.version>\n        \n        <!-- GraphStore version -->\n        <graphstore.version>0.7.1</graphstore.version>\n\n        <!-- Localization ZIP version, from 'http://netbeans.org/project_downloads/nblocalization' -->\n        <gephi.platform.localization.version>1.1-NB80</gephi.platform.localization.version>\n        \n        <!-- Modules specification version, overrides project version -->\n        <gephi.modules.specification.version>${parsedVersion.majorVersion}.${parsedVersion.minorVersion}.${parsedVersion.incrementalVersion}</gephi.modules.specification.version>\n\n        <!-- Gephi's minor version, used for auto update and user directory -->\n        <gephi.minor.version>${parsedVersion.majorVersion}.${parsedVersion.minorVersion}${parsedVersion.qualifier?}</gephi.minor.version>\n\n        <!-- Java compilation settings -->\n        <gephi.javac.release>11</gephi.javac.release>\n        <gephi.javac.xlint>-Xlint:all</gephi.javac.xlint>\n        <gephi.javac.showDeprecation>true</gephi.javac.showDeprecation>\n        <gephi.javac.showWarnings>true</gephi.javac.showWarnings>\n        <gephi.javac.fork>true</gephi.javac.fork>\n        \n        <!-- Testing settings -->\n        <gephi.mockito.version>5.12.0</gephi.mockito.version>\n        <gephi.awaitility.version>4.2.1</gephi.awaitility.version>\n        <gephi.test.maxMemory>768M</gephi.test.maxMemory>\n        <gephi.test.reportsDirectory>${project.build.directory}/surefire-reports/plain</gephi.test.reportsDirectory>\n        \n        <!-- NBM Plugin settings -->\n        <brandingToken>gephi</brandingToken>\n        <all.clusters>${project.build.directory}/${brandingToken}</all.clusters>\n        <gephi.netbeans.useOSGiDependencies>false</gephi.netbeans.useOSGiDependencies>\n        <gephi.app.title>Gephi ${project.version}</gephi.app.title>\n        \n        <!-- Update centers settings -->\n        <gephi.update.center.source>https://repo1.maven.org/maven2</gephi.update.center.source>\n        <gephi.update.center.official.url>https://raw.githubusercontent.com/gephi/gephi/gh-pages/${gephi.minor.version}/autoupdate/updates.xml</gephi.update.center.official.url>\n        <gephi.update.center.thirdparty.url>https://raw.githubusercontent.com/gephi/gephi-plugins/gh-pages/plugins/${gephi.minor.version}/updates.xml</gephi.update.center.thirdparty.url>\n\n        <!-- Architecture, defining which JRE is embedded -->\n        <gephi.bundle.arch>x64</gephi.bundle.arch>\n\n        <!-- JRE locations -->\n        <!-- for more details about the parameters supported by this API, see https://api.adoptium.net/q/swagger-ui/#/Binary/getBinary -->\n        <gephi.bundle.jre.macos>https://api.adoptium.net/v3/binary/latest/${gephi.javac.release}/ga/mac/${gephi.bundle.arch}/jre/hotspot/normal/eclipse?project=jdk</gephi.bundle.jre.macos>\n        <gephi.bundle.jre.windows>https://api.adoptium.net/v3/binary/latest/${gephi.javac.release}/ga/windows/${gephi.bundle.arch}/jre/hotspot/normal/eclipse?project=jdk</gephi.bundle.jre.windows>\n        <gephi.bundle.jre.linux>https://api.adoptium.net/v3/binary/latest/${gephi.javac.release}/ga/linux/${gephi.bundle.arch}/jre/hotspot/normal/eclipse?project=jdk</gephi.bundle.jre.linux>\n\n        <!-- Mac OS X bundle settings -->\n        <gephi.appbundle.name>Gephi</gephi.appbundle.name>\n\n        <!-- Mac OS X signing identity - must match with a verified Apple developer certificate in the keychain -->\n        <gephi.codesign.identity>Developer ID Application</gephi.codesign.identity>\n        \n        <!-- Repository URLs -->\n        <gephi.ossrh.repository.id>ossrh</gephi.ossrh.repository.id>\n        <gephi.ossrh.repository.url>https://oss.sonatype.org/content/repositories/snapshots</gephi.ossrh.repository.url>\n        \n        <!-- SCM -->\n        <gephi.scm>git</gephi.scm>\n        \n        <!-- Installers settings -->\n        <gephi.menu.app.name>Gephi ${project.version}</gephi.menu.app.name>\n        <gephi.innosetup.path>C:/Program Files (x86)/Inno Setup 6</gephi.innosetup.path>\n\n        <!-- Run Maven with '-Dkeystorepassword=' to specify the passphrase -->\n        <keystore.password/>\n\n        <!-- Apple Notarization settings -->\n        <gephi.apple.notarization.username/>\n        <gephi.apple.notarization.password/>\n        <gephi.apple.notarization.teamId/>\n        <gephi.apple.notarization.timeout>10m</gephi.apple.notarization.timeout>\n\n        <!-- Windows signing settings -->\n        <gephi.windows.codesign.keystore>codesign.pfx</gephi.windows.codesign.keystore>\n        <gephi.windows.codesign.password/>\n        \n        <!--==== Dependency Versions ==================================================================================-->\n        \n        <gephi.sentry.version>5.7.3</gephi.sentry.version>\n        \n        <!--==== Plugin Versions ==================================================================================-->\n\n        <gephi.maven-antrun-plugin.version>3.1.0</gephi.maven-antrun-plugin.version>\n\n        <gephi.maven-assembly-plugin.version>3.7.1</gephi.maven-assembly-plugin.version>\n\n        <gephi.maven-clean-plugin.version>3.3.2</gephi.maven-clean-plugin.version>\n\n        <gephi.maven-compiler-plugin.version>3.13.0</gephi.maven-compiler-plugin.version>\n\n        <gephi.maven-dependency-plugin.version>3.6.1</gephi.maven-dependency-plugin.version>\n\n        <gephi.maven-deploy-plugin.version>3.1.2</gephi.maven-deploy-plugin.version>\n\n        <gephi.maven-enforcer-plugin.version>3.5.0</gephi.maven-enforcer-plugin.version>\n\n        <gephi.maven-gpg-plugin.version>3.0.1</gephi.maven-gpg-plugin.version>\n\n        <gephi.maven-install-plugin.version>3.1.2</gephi.maven-install-plugin.version>\n\n        <gephi.maven-jar-plugin.version>3.4.1</gephi.maven-jar-plugin.version>\n\n        <gephi.maven-jarsigner-plugin.version>3.0.0</gephi.maven-jarsigner-plugin.version>\n\n        <gephi.maven-javadoc-plugin.version>3.7.0</gephi.maven-javadoc-plugin.version>\n\n        <gephi.maven-license-plugin.version>2.4.0</gephi.maven-license-plugin.version>\n\n        <gephi.maven-release-plugin.version>3.0.1</gephi.maven-release-plugin.version>\n\n        <gephi.maven-resources-plugin.version>3.3.1</gephi.maven-resources-plugin.version>\n\n        <gephi.maven-site-plugin.version>3.12.1</gephi.maven-site-plugin.version>\n\n        <gephi.maven-source-plugin.version>3.3.1</gephi.maven-source-plugin.version>\n\n        <gephi.maven-surefire-plugin.version>3.2.5</gephi.maven-surefire-plugin.version>\n\n        <gephi.build-helper-maven-plugin.version>3.6.0</gephi.build-helper-maven-plugin.version>\n\n        <gephi.nbm-maven-plugin.version>4.6</gephi.nbm-maven-plugin.version>\n        \n        <gephi.wagon-maven-plugin.version>2.0.2</gephi.wagon-maven-plugin.version>  \n        \n        <gephi.nexus-staging-maven-plugin.version>1.7.0</gephi.nexus-staging-maven-plugin.version>\n        \n        <gephi.scm-publish-plugin.version>3.2.1</gephi.scm-publish-plugin.version>\n        \n        <gephi.versions-maven-plugin.version>2.16.2</gephi.versions-maven-plugin.version>\n\n        <gephi.maven-checkstyle-plugin.version>3.4.0</gephi.maven-checkstyle-plugin.version>\n\n        <gephi.jsign.version>6.0</gephi.jsign.version>\n\n        <gephi.checkstyle.version>10.17.0</gephi.checkstyle.version>\n    </properties>\n    \n    <!-- Maven required version -->\n    <prerequisites>\n        <maven>${gephi.maven.requiredVersion}</maven>\n    </prerequisites>\n \n    <!-- Repositories -->\n    <repositories>\n        <repository>\n            <id>gephi-thirdparty</id>\n            <url>https://raw.github.com/gephi/gephi/mvn-thirdparty-repo/</url>\n            <snapshots>\n                <enabled>false</enabled>\n            </snapshots>\n        </repository>\n    </repositories>\n\n    <!-- Locations of the artifacts published -->\n    <distributionManagement>\n        <snapshotRepository>\n            <id>${gephi.ossrh.repository.id}</id>\n            <url>${gephi.ossrh.repository.url}</url>\n        </snapshotRepository>\n    </distributionManagement>\n    \n    <!-- List all dependencies with versions so it can be used in child POMs \n    without explicit versions -->\n    <dependencyManagement>\n        <!-- Dependencies -->\n        <dependencies>\n            <dependency>\n                <groupId>org.netbeans.cluster</groupId>\n                <artifactId>platform</artifactId>\n                <version>${netbeans.version}</version>\n                <type>pom</type>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-dialogs</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-filesystems</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-util</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-util-ui</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-util-lookup</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-windows</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-modules</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-modules-sendopts</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-api-progress</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-api-progress-nb</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-nodes</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-awt</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-modules-settings</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-modules-options-api</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-swing-outline</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-explorer</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-api-annotations-common</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-swing-tabcontrol</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-openide-io</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.modules</groupId>\n                <artifactId>org-netbeans-core-output2</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.modules</groupId>\n                <artifactId>org-netbeans-core-startup</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.modules</groupId>\n                <artifactId>org-netbeans-modules-masterfs</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-modules-nbjunit</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.netbeans.api</groupId>\n                <artifactId>org-netbeans-modules-autoupdate-services</artifactId>\n                <version>${netbeans.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>graphstore</artifactId>\n                <version>${graphstore.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>utils-longtask</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>project-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-exporter-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>graph-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>preview-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-exporter-preview</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>preview-export-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>utils</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>datalab-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>visualization-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>preview-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>db-drivers</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-importer-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>ui-utils</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>ui-components</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>settings-upgrader</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>statistics-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>statistics-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>statistics-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>timeline-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>tools-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>algorithms-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>mostrecentfiles-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-project</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>visualization</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>tools-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>welcome-screen</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-context</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-branding</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>layout-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-generator-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-generator-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>generator-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-exporter-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-statistics</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>filters-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>layout-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-generate</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>appearance-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-appearance</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-importer-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-datalab</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>filters-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>filters-impl</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>export-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-io-export</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>perspective-api</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>import-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-window</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>filters-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>datalab-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-layout</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-import</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-preview</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>appearance-plugin</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>appearance-plugin-ui</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-tools</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-timeline</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-filters</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>batik-wrapper</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>core-library-wrapper</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>ui-library-wrapper</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-icons</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>desktop-search</artifactId>\n                <version>${project.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.sentry</groupId>\n                <artifactId>sentry</artifactId>\n                <version>${gephi.sentry.version}</version>\n            </dependency>\n\n            <!-- Test -->\n            <dependency>\n                <groupId>org.mockito</groupId>\n                <artifactId>mockito-core</artifactId>\n                <version>${gephi.mockito.version}</version>\n                <scope>test</scope>\n            </dependency>\n            <dependency>\n                <groupId>org.awaitility</groupId>\n                <artifactId>awaitility</artifactId>\n                <version>${gephi.awaitility.version}</version>\n                <scope>test</scope>\n            </dependency>\n\n            <!-- Test JARs -->\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>project-api</artifactId>\n                <version>${project.version}</version>\n                <type>test-jar</type>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>graph-api</artifactId>\n                <version>${project.version}</version>\n                <type>test-jar</type>\n            </dependency>\n            <dependency>\n                <groupId>${project.groupId}</groupId>\n                <artifactId>io-importer-api</artifactId>\n                <version>${project.version}</version>\n                <type>test-jar</type>\n            </dependency>\n        </dependencies>\n    </dependencyManagement>\n\n    <!-- JUnit Test dependency by default -->\n    <dependencies>\n        <dependency>\n            <groupId>org.netbeans.api</groupId>\n            <artifactId>org-netbeans-modules-nbjunit</artifactId>\n            <scope>test</scope>\n        </dependency>\n    </dependencies>\n\n    <build>\n        \n        <!-- Plugins installed with versions -->\n        <pluginManagement>\n            <plugins>\n                <plugin>\n                    <!-- \n                    Check new versions with:\n                    mvn versions:display-property-updates\n                    -->\n                    <groupId>org.codehaus.mojo</groupId>\n                    <artifactId>versions-maven-plugin</artifactId>\n                    <version>${gephi.versions-maven-plugin.version}</version>\n                    <configuration>\n                        <rulesUri>file:///${session.executionRootDirectory}/maven-version-rules.xml</rulesUri>\n                    </configuration>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.netbeans.utilities</groupId>\n                    <artifactId>nbm-maven-plugin</artifactId>\n                    <version>${gephi.nbm-maven-plugin.version}</version>\n                    <extensions>true</extensions>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-compiler-plugin</artifactId>\n                    <version>${gephi.maven-compiler-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-clean-plugin</artifactId>\n                    <version>${gephi.maven-clean-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-jar-plugin</artifactId>\n                    <version>${gephi.maven-jar-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-antrun-plugin</artifactId>\n                    <version>${gephi.maven-antrun-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-deploy-plugin</artifactId>\n                    <version>${gephi.maven-deploy-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-release-plugin</artifactId>\n                    <version>${gephi.maven-release-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-gpg-plugin</artifactId>\n                    <version>${gephi.maven-gpg-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.codehaus.mojo</groupId>\n                    <artifactId>build-helper-maven-plugin</artifactId>\n                    <version>${gephi.build-helper-maven-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-surefire-plugin</artifactId>\n                    <version>${gephi.maven-surefire-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-jarsigner-plugin</artifactId>\n                    <version>${gephi.maven-jarsigner-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-source-plugin</artifactId>\n                    <version>${gephi.maven-source-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-resources-plugin</artifactId> \n                    <version>${gephi.maven-resources-plugin.version}</version> \n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-dependency-plugin</artifactId>\n                    <version>${gephi.maven-dependency-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-install-plugin</artifactId>\n                    <version>${gephi.maven-install-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.codehaus.mojo</groupId>\n                    <artifactId>wagon-maven-plugin</artifactId>\n                    <version>${gephi.wagon-maven-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-javadoc-plugin</artifactId>\n                    <version>${gephi.maven-javadoc-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-assembly-plugin</artifactId>\n                    <version>${gephi.maven-assembly-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-site-plugin</artifactId>\n                    <version>${gephi.maven-site-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.sonatype.plugins</groupId>\n                    <artifactId>nexus-staging-maven-plugin</artifactId>\n                    <version>${gephi.nexus-staging-maven-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-scm-publish-plugin</artifactId>\n                    <version>${gephi.scm-publish-plugin.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.apache.maven.plugins</groupId>\n                    <artifactId>maven-checkstyle-plugin</artifactId>\n                    <version>${gephi.maven-checkstyle-plugin.version}</version>\n                    <dependencies>\n                        <dependency>\n                            <groupId>com.puppycrawl.tools</groupId>\n                            <artifactId>checkstyle</artifactId>\n                            <version>${gephi.checkstyle.version}</version>\n                        </dependency>\n                    </dependencies>\n                </plugin>\n                <plugin>\n                    <groupId>net.jsign</groupId>\n                    <artifactId>jsign-maven-plugin</artifactId>\n                    <version>${gephi.jsign.version}</version>\n                </plugin>\n            </plugins>\n        </pluginManagement>\n        \n        <!-- Plugins configuration ===============================================================-->\n        \n        <plugins>\n\n            <!-- Compiler -->\n            <plugin>\n                <artifactId>maven-compiler-plugin</artifactId>\n                <configuration>\n                    <release>${gephi.javac.release}</release>\n                    <showDeprecation>${gephi.javac.showDeprecation}</showDeprecation>\n                    <showWarnings>${gephi.javac.showWarnings}</showWarnings>\n                    <fork>${gephi.javac.fork}</fork>\n                    <compilerArgument>\n                        ${gephi.javac.xlint}\n                    </compilerArgument>\n                </configuration>\n            </plugin>\n \n            <!-- Skip unit tests in non-deployment or release mode -->\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-surefire-plugin</artifactId>\n                <configuration>\n                    <argLine>--add-opens java.base/java.net=ALL-UNNAMED</argLine>\n                    <skipTests>true</skipTests>\n                    <trimStackTrace>false</trimStackTrace>                                                              \n                </configuration>\n            </plugin>\n            \n            <!-- Copy and apply filtering on manifest.mf file -->\n            <plugin> \n                <artifactId>maven-resources-plugin</artifactId> \n                <executions> \n                    <execution> \n                        <id>generate-modules-xml</id> \n                        <phase>generate-resources</phase> \n                        <goals> \n                            <goal>copy-resources</goal> \n                        </goals> \n                        <configuration>\n                            <outputDirectory>${basedir}/target/</outputDirectory> \n                            <resources> \n                                <resource> \n                                    <directory>src/main/nbm</directory> \n                                    <includes> \n                                        <include>manifest.mf</include>\n                                    </includes> \n                                    <filtering>true</filtering> \n                                </resource> \n                            </resources> \n                        </configuration> \n                    </execution> \n                </executions> \n            </plugin>\n\n            <!-- Extracts detailed version properties -->\n            <plugin>\n                <groupId>org.codehaus.mojo</groupId>\n                <artifactId>build-helper-maven-plugin</artifactId>\n                <executions>\n                    <execution>\n                        <id>parse-version</id>\n                        <goals>\n                            <goal>parse-version</goal>\n                        </goals>\n                    </execution>\n                </executions>\n            </plugin>\n\n            <!-- Jar plugin, required for NBM -->\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-jar-plugin</artifactId>\n                <configuration>\n                    <archive>\n                        <!-- required since nbm-maven-plugin 3.0-->\n                        <manifestFile>${project.build.outputDirectory}/META-INF/MANIFEST.MF</manifestFile>\n                    </archive>\n                </configuration>\n            </plugin>\n            \n            <!-- NBM options -->\n            <plugin>\n                <groupId>org.apache.netbeans.utilities</groupId>\n                <artifactId>nbm-maven-plugin</artifactId>\n                <extensions>true</extensions>\n                <configuration>\n                    <sourceManifestFile>${project.build.directory}/manifest.mf</sourceManifestFile>\n                    <brandingToken>${brandingToken}</brandingToken>\n                    <cluster>${brandingToken}</cluster>\n                    <useOSGiDependencies>${gephi.netbeans.useOSGiDependencies}</useOSGiDependencies>\n                    \n                    <!-- NBM settings -->\n                    <requiresRestart>true</requiresRestart>\n                    <licenseName>CDDL 1.0 and GNU GPL v3</licenseName>\n                    <licenseFile>../../COPYING.txt</licenseFile>\n                    \n                    <!-- Installer settings -->\n                    <templateFile>src/main/app-resources/template.xml</templateFile>\n                    <userSettings>\n                        <nbi.icon.file>${basedir}/src/main/app-resources/gephi48.png</nbi.icon.file>\n                    </userSettings>\n                    <installDirName>${brandingToken}</installDirName>\n                    <installerOsSolaris>false</installerOsSolaris>\n                    <installerOsMacosx>false</installerOsMacosx>\n                </configuration>\n                <executions>\n                    <!-- Disable default-branding as it's only needed for the branding module -->\n                    <execution>\n                        <id>default-branding</id>\n                        <phase>none</phase>\n                    </execution>\n                </executions>\n            </plugin>\n\n            <!-- Override default-site -->\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-site-plugin</artifactId>\n                <executions>\n                    <execution>\n                        <id>default-site</id>\n                        <phase>site</phase>\n                        <goals>\n                            <goal>site</goal>\n                            <goal>stage</goal>\n                        </goals>\n                        <configuration>\n                            <skip>true</skip>\n                        </configuration>\n                    </execution>\n                </executions>\n            </plugin>\n\n            <!-- Checkstyle configuration -->\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-checkstyle-plugin</artifactId>\n                <configuration>\n                    <configLocation>checkstyle.xml</configLocation>\n                    <suppressionsLocation>checkstyle-suppressions.xml</suppressionsLocation>\n                    <encoding>UTF-8</encoding>\n                    <failsOnError>true</failsOnError>\n                    <consoleOutput>false</consoleOutput>\n                    <includeTestSourceDirectory>true</includeTestSourceDirectory>\n                    <!-- Skipped in non-deployment -->\n                    <skip>true</skip>\n                </configuration>\n                <executions>\n                    <execution>\n                        <id>validate</id>\n                        <phase>validate</phase>\n                        <goals>\n                            <goal>check</goal>\n                        </goals>\n                    </execution>\n                </executions>\n            </plugin>\n        </plugins>\n    </build>\n    \n    <!-- Profiles -->\n    <profiles>\n\n        <!-- Profile to enable tests (disabled by default in non-deployment) -->\n        <profile>\n            <id>enableTests</id>\n            \n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-surefire-plugin</artifactId>\n                        <configuration>\n                            <skipTests>false</skipTests>\n                        </configuration>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <!-- Profile to enable checkstyle (disabled by default in non-deployment) -->\n        <profile>\n            <id>enableCheckStyle</id>\n\n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-checkstyle-plugin</artifactId>\n                        <configuration>\n                            <skip>false</skip>\n                        </configuration>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <!-- Enables GPG and NBM signing, to be used alongside deployment profile -->\n        <profile>\n            <id>sign-artifacts</id>\n\n            <build>\n                <plugins>\n                    <!-- NBM Signing -->\n                    <plugin>\n                        <groupId>org.apache.netbeans.utilities</groupId>\n                        <artifactId>nbm-maven-plugin</artifactId>\n                        <extensions>true</extensions>\n                        <configuration>\n                            <!-- Keystore location -->\n                            <keystore>keystore.ks</keystore>\n                            <keystorealias>gephi</keystorealias>\n                            <keystorepassword>${keystore.password}</keystorepassword>\n                        </configuration>\n                    </plugin>\n\n                    <!-- GPG Signed Components -->\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-gpg-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>sign-gpg-artifacts</id>\n                                <phase>verify</phase>\n                                <goals>\n                                    <goal>sign</goal>\n                                </goals>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n        \n        <!-- Profile for nightly builds and releases -->\n        <profile>\n            <id>deployment</id>\n            \n            <!-- Override compile properties to be less verbose -->\n            <properties>\n                <gephi.javac.showDeprecation>false</gephi.javac.showDeprecation>\n                <gephi.javac.showWarnings>false</gephi.javac.showWarnings>\n                <gephi.javac.xlint>-Xlint:none</gephi.javac.xlint>\n            </properties>\n\n            <build>\n                <plugins>\n                    <!-- Enable tests -->\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-surefire-plugin</artifactId>\n                        <configuration>\n                            <skipTests>false</skipTests>\n                        </configuration>\n                    </plugin>\n\n                    <!-- Enable checkstyle -->\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-checkstyle-plugin</artifactId>\n                        <configuration>\n                            <skip>false</skip>\n                        </configuration>\n                    </plugin>\n\t\t\t\t\n                    <!-- Nexus staging, https://oss.sonatype.org/ -->\n                    <plugin>\n                        <groupId>org.sonatype.plugins</groupId>\n                        <artifactId>nexus-staging-maven-plugin</artifactId>\n                        <extensions>true</extensions>\n                        <configuration>\n                            <serverId>ossrh</serverId>\n                            <nexusUrl>https://oss.sonatype.org/</nexusUrl>\n                            <autoReleaseAfterClose>false</autoReleaseAfterClose>\n                            <!-- The create-modules profile overrides this -->\n                            <skipNexusStagingDeployMojo>true</skipNexusStagingDeployMojo>\n                            <skipStagingRepositoryClose>true</skipStagingRepositoryClose>\n                        </configuration>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n        \n        <!-- Profile to create Javadoc -->\n        <profile>\n            <id>create-javadoc</id>\n            <build>\n                <plugins>\n                    <!-- Unpack the graphstore sources dependency -->\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-dependency-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>unpack</id>\n                                <inherited>false</inherited>\n                                <phase>pre-site</phase>\n                                <goals>\n                                    <goal>unpack</goal>\n                                </goals>\n                                <configuration>\n                                    <artifactItems>\n                                        <artifactItem>\n                                            <groupId>org.gephi</groupId>\n                                            <artifactId>graphstore</artifactId>\n                                            <version>${graphstore.version}</version>\n                                            <classifier>sources</classifier>\n                                            <outputDirectory>\n                                                ${project.build.directory}/graphstore-sources\n                                            </outputDirectory>\n                                        </artifactItem>\n                                    </artifactItems>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n\n                    <!-- Javadoc settings -->\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-javadoc-plugin</artifactId>\n                        <configuration>\n                            <show>private</show>\n                            <nohelp>true</nohelp>\n                            <detectLinks>false</detectLinks>\n                            <detectOfflineLinks>true</detectOfflineLinks>   \n                            <quiet>false</quiet>\n                            <doclint>none</doclint>\n                            <source>11</source>\n                        </configuration>\n                        <executions>\n                            <execution> \n                                <id>attach-javadocs</id>\n                                <phase>package</phase>\n                                <goals>\n                                    <goal>jar</goal>\n                                </goals> \n                            </execution>\n                            <!-- Aggregate Javadoc, attached in gephi-app -->\n                            <execution>\n                                <id>aggregate</id>\n                                <phase>site</phase>\n                                <inherited>false</inherited>\n                                <goals>\n                                    <goal>aggregate-jar</goal>\n                                </goals>\n                                <configuration>\n                                    <show>public</show>\n                                    <doctitle>Gephi ${project.version} API Index</doctitle>\n                                    <subpackages>org.gephi.datalab.api:org.gephi.datalab.spi:org.gephi.datalab.spi.columns:org.gephi.datalab.spi.columns.merge:org.gephi.datalab.spi.edges:org.gephi.datalab.spi.general:org.gephi.datalab.spi.nodes:org.gephi.datalab.spi.rows.merge:org.gephi.datalab.spi.values:org.gephi.filters.api:org.gephi.filters.spi:org.gephi.graph.api:org.gephi.graph.api.types:org.gephi.graph.spi:org.gephi.io.exporter.api:org.gephi.io.exporter.spi:org.gephi.io.generator.api:org.gephi.io.generator.spi:org.gephi.io.importer.api:org.gephi.io.importer.spi:org.gephi.io.processor.spi:org.gephi.layout.api:org.gephi.layout.spi:org.gephi.perspective.api:org.gephi.perspective.spi:org.gephi.preview.api:org.gephi.preview.spi:org.gephi.preview.types:org.gephi.project.api:org.gephi.project.spi:org.gephi.appearance.api:org.gephi.appearance.spi:org.gephi.statistics.api:org.gephi.statistics.spi:org.gephi.timeline.api:org.gephi.tools.api:org.gephi.tools.spi:org.gephi.utils.longtask.api:org.gephi.utils.longtask.spi:org.gephi.utils.progress</subpackages>\n                                    <nohelp>true</nohelp>\n                                    <detectLinks>false</detectLinks>\n                                    <detectOfflineLinks>true</detectOfflineLinks>\n                                    <sourcepath>modules/LongTaskAPI/src/main/java;modules/DataLaboratoryAPI/src/main/java;modules/FiltersAPI/src/main/java;modules/GraphAPI/src/main/java;modules/ExportAPI/src/main/java;modules/GeneratorAPI/src/main/java;modules/ImportAPI/src/main/java;modules/LayoutAPI/src/main/java;modules/PerspectiveAPI/src/main/java;modules/PreviewAPI/src/main/java;modules/ProjectAPI/src/main/java;modules/AppearanceAPI/src/main/java;modules/StatisticsAPI/src/main/java;modules/TimelineAPI/src/main/java;modules/ToolsAPI/src/main/java;modules/VisualizationAPI/src/main/java;${project.build.directory}/graphstore-sources</sourcepath>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <!-- Profile activated to create modules' artifacts (jar, nbm) -->\n        <profile>\n            <id>create-modules</id>\n            <build>\n                <plugins>\n                    <!-- Enable artifact deploy -->\n                    <plugin>\n                        <groupId>org.sonatype.plugins</groupId>\n                        <artifactId>nexus-staging-maven-plugin</artifactId>\n                        <configuration>\n                            <skipNexusStagingDeployMojo>false</skipNexusStagingDeployMojo>\n                        </configuration>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <!-- Profile activated to create sources artifact -->\n        <profile>\n            <id>create-sources</id>\n            <build>\n                <plugins>\n                    <!-- Sources plugin -->\n                    <plugin>\n                        <artifactId>maven-source-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>attach-sources</id>\n                                <goals>\n                                    <goal>jar-no-fork</goal>\n                                </goals> \n                            </execution>\n                        </executions>\n                    </plugin>\n\n                    <!-- Assembler to produce final sources artifact -->\n                    <plugin>\n                        <artifactId>maven-assembly-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>source-assembly</id>\n                                <phase>package</phase>\n                                <goals>\n                                    <goal>single</goal>\n                                </goals>\n                                <configuration>\n                                    <tarLongFileMode>gnu</tarLongFileMode>\n                                    <runOnlyAtExecutionRoot>true</runOnlyAtExecutionRoot>\n                                    <finalName>${project.name}-${project.version}</finalName>\n                                    <descriptors>\n                                        <descriptor>src/assemble/sources.xml</descriptor>\n                                    </descriptors>\n                                    <attach>false</attach>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n    </profiles>\n                \n    <!-- List of modules -->\n    <modules>\n        <module>modules/application</module>\n        <module>modules/AlgorithmsPlugin</module>\n        <module>modules/AppearanceAPI</module>\n        <module>modules/AppearancePlugin</module>\n        <module>modules/AppearancePluginUI</module>\n        <module>modules/LongTaskAPI</module>\n        <module>modules/DataLaboratoryAPI</module>\n        <module>modules/DataLaboratoryPlugin</module>\n        <module>modules/DBDrivers</module>\n        <module>modules/DesktopWindow</module>\n        <module>modules/DesktopBranding</module>\n        <module>modules/DesktopContext</module>\n        <module>modules/DesktopDataLaboratory</module>\n        <module>modules/DesktopGenerate</module>\n        <module>modules/DesktopExport</module>\n        <module>modules/DesktopFilters</module>\n        <module>modules/DesktopImport</module>\n        <module>modules/DesktopLayout</module>\n        <module>modules/DesktopAppearance</module>\n        <module>modules/DesktopPreview</module>\n        <module>modules/DesktopProject</module>\n        <module>modules/DesktopStatistics</module>\n        <module>modules/DesktopTools</module>\n        <module>modules/DesktopTimeline</module>\n        <module>modules/ExportAPI</module>\n        <module>modules/ExportPlugin</module>\n        <module>modules/ExportPluginUI</module>\n        <module>modules/FiltersAPI</module>\n        <module>modules/FiltersImpl</module>\n        <module>modules/FiltersPlugin</module>\n        <module>modules/FiltersPluginUI</module>\n        <module>modules/GeneratorAPI</module>\n        <module>modules/GeneratorPlugin</module>\n        <module>modules/GeneratorPluginUI</module>\n        <module>modules/GraphAPI</module>\n        <module>modules/ImportAPI</module>\n        <module>modules/ImportPlugin</module>\n        <module>modules/ImportPluginUI</module>\n        <module>modules/LayoutAPI</module>\n        <module>modules/LayoutPlugin</module>\n        <module>modules/MostRecentFilesAPI</module>\n        <module>modules/PerspectiveAPI</module>\n        <module>modules/PreviewAPI</module>\n        <module>modules/PreviewExport</module>\n        <module>modules/PreviewExportUI</module>\n        <module>modules/PreviewPlugin</module>\n        <module>modules/ProjectAPI</module>\n        <module>modules/SettingsUpgrader</module>\n        <module>modules/StatisticsAPI</module>\n        <module>modules/StatisticsPlugin</module>\n        <module>modules/StatisticsPluginUI</module>\n        <module>modules/TimelineAPI</module>\n        <module>modules/ToolsAPI</module>\n        <module>modules/ToolsPlugin</module>\n        <module>modules/UIComponents</module>\n        <module>modules/UIUtils</module>\n        <module>modules/Utils</module>\n        <module>modules/VisualizationAPI</module>\n        <module>modules/VisualizationImpl</module>\n        <module>modules/WelcomeScreen</module>\n        <module>modules/BatikWrapper</module>\n        <module>modules/CoreLibraryWrapper</module>\n        <module>modules/UILibraryWrapper</module>\n        <module>modules/DesktopIcons</module>\n        <module>modules/DesktopSearch</module>\n    </modules>\n</project>\n"
        },
        {
          "name": "snap",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}