{
  "metadata": {
    "timestamp": 1736708792501,
    "page": 295,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "JanusGraph/janusgraph",
      "stars": 5373,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".backportrc.json",
          "type": "blob",
          "size": 0.2568359375,
          "content": "{\n    \"repoOwner\": \"janusgraph\",\n    \"repoName\": \"janusgraph\",\n    \"targetBranchChoices\": [\"v1.1\"],\n    \"branchLabelMapping\": {\n      \"^backport/(.+)$\": \"$1\"\n    },\n    \"autoMerge\": true,\n    \"autoMergeMethod\": \"rebase\",\n    \"targetPRLabels\": [\"backport/skip\"]\n}\n"
        },
        {
          "name": ".codecov.yml",
          "type": "blob",
          "size": 0.9345703125,
          "content": "# Copyright 2019 JanusGraph Authors\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n\ncodecov:\n  notify:\n    wait_for_ci: yes\n\ncoverage:\n  status:\n    patch:\n      default:\n        threshold: 5\n    project:\n      default:\n        # allow test coverage to drop by 2%, assume that it's typically due to CI problems\n        threshold: 2\n\ncomment: false\n\n# Ignore test files\nignore:\n  - \"**/test/**\"\n  - \"janusgraph-backend-testutils/**\"\n  - \"janusgraph-test/**\"\n"
        },
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 1.0439453125,
          "content": "# Copyright 2020 JanusGraph Authors\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n\n# https://editorconfig.org\n\nroot = true\n\n[*]\ncharset = utf-8\nindent_style = space\nindent_size = 4\n\n[*.{yaml,yml}]\nindent_size = 2\n\n[*.xml]\ninsert_final_newline = false\n\n[*.proto]\ninsert_final_newline = true\n\n[*.java]\ninsert_final_newline = true\nij_java_use_single_class_imports = true\nij_java_class_count_to_use_import_on_demand = 1000\nij_java_names_count_to_use_import_on_demand = 1000\nij_java_imports_layout = *,|,java.**,javax.**,|,$*\nij_java_layout_static_imports_separately = true"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.1875,
          "content": "*.log\ntarget/\n.idea/\n*.iml\n*.DS_Store\n.vscode/\n/_bsp/\n/output/\n# When executing tests in alphabetical order, Maven generates temporary\n# files with names like this:\n#\n#  .surefire-0320969CE4BEF3CC28F07EE3E21C2DCF89CB569C\n#\n# These files appear alongside pom.xml files.  The files are just lists\n# of test names and don't contain any important information.\n/janusgraph-*/.surefire-*\n# Eclipse junk; leading slash makes patterns non-recursive\n# Note that * also can't match slashes\n/.settings/\n/.project\n/.classpath\n/.metadata\n/.recommenders\n/RemoteSystemsTempFiles\n/janusgraph-*/.classpath\n/janusgraph-*/.project\n/janusgraph-*/.settings/\n/janusgraph-*/janusgraph-*/.classpath\n/janusgraph-*/janusgraph-*/.project\n/janusgraph-*/janusgraph-*/.settings/\n/janusgraph-examples/example-*/.classpath\n/janusgraph-examples/example-*/.project\n/janusgraph-examples/example-*/.settings\n# End of Eclipse junk\n# Backup files created by `mvn versions:update-child-modules`\n# http://mojo.codehaus.org/versions-maven-plugin/update-child-modules-mojo.html\njanusgraph-*/pom.xml.versionsBackup\n\n# Emacs file backups\n*~\n# Nano file backups\n*.save\n# Vim file backups\n*.swp\n\n/site/\n\n*.hprof\n.factorypath\n\njanusgraph-benchmark/benchmark.json\n"
        },
        {
          "name": ".remarkrc.yml",
          "type": "blob",
          "size": 0.609375,
          "content": "\n# Copyright 2019 JanusGraph Authors\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n\nplugins:\n  lint-list-item-indent: mixed"
        },
        {
          "name": "APACHE-2.0.txt",
          "type": "blob",
          "size": 11.091796875,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "AUTHORS.txt",
          "type": "blob",
          "size": 0.654296875,
          "content": "# This is the official list of JanusGraph authors for copyright purposes.\n# This file is distinct from the CONTRIBUTORS.txt files.\n# See the latter for an explanation.\n\n# Names should be added to this file as one of\n#     Organization's name\n#     Organization's name <email pattern1> ...\n#     Individual's name <email1>\n#     Individual's name <email1> <email2> <emailN>\n# See CONTRIBUTORS.txt for the meaning of multiple email addresses.\n\n# Please keep the list sorted.\n\nAmazon\nAurelius\nDataStax\nDylan Bethune-Waddell <dylan.bethune.waddell@mail.utoronto.ca>\nExpero\nGoogle\nOrion Health\nIBM\nRafael Fernandes <luizrafael@gmail.com>\nRobert Dale <robdale@gmail.com>\nSeeq\n"
        },
        {
          "name": "BUILDING.md",
          "type": "blob",
          "size": 2.5625,
          "content": "# Building JanusGraph\n\nRequired:\n\n* Java 8\n* Maven 3\n\nTo build without executing tests:\n\n```\nmvn clean install -DskipTests=true\n```\n\nTo build with default tests:\n\n```\nmvn clean install\n```\n\nTo build with default plus TinkerPop tests:\n\n```\nmvn clean install -Dtest.skip.tp=false\n```\n\nTo build with only the TinkerPop tests:\n\n```\nmvn clean install -Dtest.skip.tp=false -DskipTests=true\n```\n\nTo build the distribution archive:\n\n```\nmvn clean install -Pjanusgraph-release -Dgpg.skip=true -DskipTests=true\n```\nThis command generates the distribution archive in `janusgraph-dist/target/janusgraph-$VERSION.zip`.\nFor more details information, please see [here](janusgraph-dist/README.md#building-zip-archives)\n\n## Building Docker Image for JanusGraph Server\n\nWe moved the docker build back into the main repo, see `janusgraph-dist/docker`. You can use the default command to build the distribution archive to also build the docker images.\n```\nmvn clean install -Pjanusgraph-release -Dgpg.skip=true -DskipTests=true\n```\n\n## Building on Eclipse IDE\nNote that this has only been tested on Eclipse Neon.2 Release (4.6.2) with m2e (1.7.0.20160603-1933) and m2e-wtp (1.3.1.20160831-1005) plugin.\n\n\nTo build without executing tests:\n\n1. Right-click on your project -> \"Run As...\" -> \"Run Configurations...\"\n2. On \"Goals\", populate with `install`\n3. Select the options `Update Snapshots` and `Skip Tests`\n4. Before clicking \"Run\", make sure that Eclipse knows where `JAVA_HOME` is. On same window, go to \"Environment\" tab and click \"New\".\n5. Under \"Name:\", add `JAVA_HOME`\n6. Under \"Value:\", add the path where `java` is located\n7. Click \"OK\"\n8. Then click \"Run\"\n\nTo find the Java binary in your environment, run the appropriate command for your operating system:\n* Linux/macOS: `which java`\n* Windows: `for %i in (java.exe) do @echo. %~$PATH:i`\n\n## Building documentation\n\n\n### Updating documentation\nYou have check in the actual version of configuration reference. Therefore, you have to run following command:\n\n```bash\nmvn --quiet clean install -DskipTests=true -pl janusgraph-doc -am\n```\n\n### Required dependencies to build the documentation\nMkDocs need to be installed to build and serve the documentation locally.\n\n1. Install `python3` and `pip3` (newest version of pip) \n    * You can also checkout the installation guide of [material-mkdocs](https://squidfunk.github.io/mkdocs-material/getting-started/)\n2. Install requirements using `pip3 install -r requirements.txt`\n\n### Build and serve documentation\n\n1. To create a test build locally use command `mkdocs build`\n2. To serve the documentation locally use command `mkdocs serve`\n"
        },
        {
          "name": "CC-BY-4.0.txt",
          "type": "blob",
          "size": 18.2138671875,
          "content": "Attribution 4.0 International\n\n=======================================================================\n\nCreative Commons Corporation (\"Creative Commons\") is not a law firm and\ndoes not provide legal services or legal advice. Distribution of\nCreative Commons public licenses does not create a lawyer-client or\nother relationship. Creative Commons makes its licenses and related\ninformation available on an \"as-is\" basis. Creative Commons gives no\nwarranties regarding its licenses, any material licensed under their\nterms and conditions, or any related information. Creative Commons\ndisclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\nUsing Creative Commons Public Licenses\n\nCreative Commons public licenses provide a standard set of terms and\nconditions that creators and other rights holders may use to share\noriginal works of authorship and other material subject to copyright\nand certain other rights specified in the public license below. The\nfollowing considerations are for informational purposes only, are not\nexhaustive, and do not form part of our licenses.\n\n     Considerations for licensors: Our public licenses are\n     intended for use by those authorized to give the public\n     permission to use material in ways otherwise restricted by\n     copyright and certain other rights. Our licenses are\n     irrevocable. Licensors should read and understand the terms\n     and conditions of the license they choose before applying it.\n     Licensors should also secure all rights necessary before\n     applying our licenses so that the public can reuse the\n     material as expected. Licensors should clearly mark any\n     material not subject to the license. This includes other CC-\n     licensed material, or material used under an exception or\n     limitation to copyright. More considerations for licensors:\n\twiki.creativecommons.org/Considerations_for_licensors\n\n     Considerations for the public: By using one of our public\n     licenses, a licensor grants the public permission to use the\n     licensed material under specified terms and conditions. If\n     the licensor's permission is not necessary for any reason--for\n     example, because of any applicable exception or limitation to\n     copyright--then that use is not regulated by the license. Our\n     licenses grant only permissions under copyright and certain\n     other rights that a licensor has authority to grant. Use of\n     the licensed material may still be restricted for other\n     reasons, including because others have copyright or other\n     rights in the material. A licensor may make special requests,\n     such as asking that all changes be marked or described.\n     Although not required by our licenses, you are encouraged to\n     respect those requests where reasonable. More_considerations\n     for the public: \n\twiki.creativecommons.org/Considerations_for_licensees\n\n=======================================================================\n\nCreative Commons Attribution 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree\nto be bound by the terms and conditions of this Creative Commons\nAttribution 4.0 International Public License (\"Public License\"). To the\nextent this Public License may be interpreted as a contract, You are\ngranted the Licensed Rights in consideration of Your acceptance of\nthese terms and conditions, and the Licensor grants You such rights in\nconsideration of benefits the Licensor receives from making the\nLicensed Material available under these terms and conditions.\n\n\nSection 1 -- Definitions.\n\n  a. Adapted Material means material subject to Copyright and Similar\n     Rights that is derived from or based upon the Licensed Material\n     and in which the Licensed Material is translated, altered,\n     arranged, transformed, or otherwise modified in a manner requiring\n     permission under the Copyright and Similar Rights held by the\n     Licensor. For purposes of this Public License, where the Licensed\n     Material is a musical work, performance, or sound recording,\n     Adapted Material is always produced where the Licensed Material is\n     synched in timed relation with a moving image.\n\n  b. Adapter's License means the license You apply to Your Copyright\n     and Similar Rights in Your contributions to Adapted Material in\n     accordance with the terms and conditions of this Public License.\n\n  c. Copyright and Similar Rights means copyright and/or similar rights\n     closely related to copyright including, without limitation,\n     performance, broadcast, sound recording, and Sui Generis Database\n     Rights, without regard to how the rights are labeled or\n     categorized. For purposes of this Public License, the rights\n     specified in Section 2(b)(1)-(2) are not Copyright and Similar\n     Rights.\n\n  d. Effective Technological Measures means those measures that, in the\n     absence of proper authority, may not be circumvented under laws\n     fulfilling obligations under Article 11 of the WIPO Copyright\n     Treaty adopted on December 20, 1996, and/or similar international\n     agreements.\n\n  e. Exceptions and Limitations means fair use, fair dealing, and/or\n     any other exception or limitation to Copyright and Similar Rights\n     that applies to Your use of the Licensed Material.\n\n  f. Licensed Material means the artistic or literary work, database,\n     or other material to which the Licensor applied this Public\n     License.\n\n  g. Licensed Rights means the rights granted to You subject to the\n     terms and conditions of this Public License, which are limited to\n     all Copyright and Similar Rights that apply to Your use of the\n     Licensed Material and that the Licensor has authority to license.\n\n  h. Licensor means the individual(s) or entity(ies) granting rights\n     under this Public License.\n\n  i. Share means to provide material to the public by any means or\n     process that requires permission under the Licensed Rights, such\n     as reproduction, public display, public performance, distribution,\n     dissemination, communication, or importation, and to make material\n     available to the public including in ways that members of the\n     public may access the material from a place and at a time\n     individually chosen by them.\n\n  j. Sui Generis Database Rights means rights other than copyright\n     resulting from Directive 96/9/EC of the European Parliament and of\n     the Council of 11 March 1996 on the legal protection of databases,\n     as amended and/or succeeded, as well as other essentially\n     equivalent rights anywhere in the world.\n\n  k. You means the individual or entity exercising the Licensed Rights\n     under this Public License. Your has a corresponding meaning.\n\n\nSection 2 -- Scope.\n\n  a. License grant.\n\n       1. Subject to the terms and conditions of this Public License,\n          the Licensor hereby grants You a worldwide, royalty-free,\n          non-sublicensable, non-exclusive, irrevocable license to\n          exercise the Licensed Rights in the Licensed Material to:\n\n            a. reproduce and Share the Licensed Material, in whole or\n               in part; and\n\n            b. produce, reproduce, and Share Adapted Material.\n\n       2. Exceptions and Limitations. For the avoidance of doubt, where\n          Exceptions and Limitations apply to Your use, this Public\n          License does not apply, and You do not need to comply with\n          its terms and conditions.\n\n       3. Term. The term of this Public License is specified in Section\n          6(a).\n\n       4. Media and formats; technical modifications allowed. The\n          Licensor authorizes You to exercise the Licensed Rights in\n          all media and formats whether now known or hereafter created,\n          and to make technical modifications necessary to do so. The\n          Licensor waives and/or agrees not to assert any right or\n          authority to forbid You from making technical modifications\n          necessary to exercise the Licensed Rights, including\n          technical modifications necessary to circumvent Effective\n          Technological Measures. For purposes of this Public License,\n          simply making modifications authorized by this Section 2(a)\n          (4) never produces Adapted Material.\n\n       5. Downstream recipients.\n\n            a. Offer from the Licensor -- Licensed Material. Every\n               recipient of the Licensed Material automatically\n               receives an offer from the Licensor to exercise the\n               Licensed Rights under the terms and conditions of this\n               Public License.\n\n            b. No downstream restrictions. You may not offer or impose\n               any additional or different terms or conditions on, or\n               apply any Effective Technological Measures to, the\n               Licensed Material if doing so restricts exercise of the\n               Licensed Rights by any recipient of the Licensed\n               Material.\n\n       6. No endorsement. Nothing in this Public License constitutes or\n          may be construed as permission to assert or imply that You\n          are, or that Your use of the Licensed Material is, connected\n          with, or sponsored, endorsed, or granted official status by,\n          the Licensor or others designated to receive attribution as\n          provided in Section 3(a)(1)(A)(i).\n\n  b. Other rights.\n\n       1. Moral rights, such as the right of integrity, are not\n          licensed under this Public License, nor are publicity,\n          privacy, and/or other similar personality rights; however, to\n          the extent possible, the Licensor waives and/or agrees not to\n          assert any such rights held by the Licensor to the limited\n          extent necessary to allow You to exercise the Licensed\n          Rights, but not otherwise.\n\n       2. Patent and trademark rights are not licensed under this\n          Public License.\n\n       3. To the extent possible, the Licensor waives any right to\n          collect royalties from You for the exercise of the Licensed\n          Rights, whether directly or through a collecting society\n          under any voluntary or waivable statutory or compulsory\n          licensing scheme. In all other cases the Licensor expressly\n          reserves any right to collect such royalties.\n\n\nSection 3 -- License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the\nfollowing conditions.\n\n  a. Attribution.\n\n       1. If You Share the Licensed Material (including in modified\n          form), You must:\n\n            a. retain the following if it is supplied by the Licensor\n               with the Licensed Material:\n\n                 i. identification of the creator(s) of the Licensed\n                    Material and any others designated to receive\n                    attribution, in any reasonable manner requested by\n                    the Licensor (including by pseudonym if\n                    designated);\n\n                ii. a copyright notice;\n\n               iii. a notice that refers to this Public License;\n\n                iv. a notice that refers to the disclaimer of\n                    warranties;\n\n                 v. a URI or hyperlink to the Licensed Material to the\n                    extent reasonably practicable;\n\n            b. indicate if You modified the Licensed Material and\n               retain an indication of any previous modifications; and\n\n            c. indicate the Licensed Material is licensed under this\n               Public License, and include the text of, or the URI or\n               hyperlink to, this Public License.\n\n       2. You may satisfy the conditions in Section 3(a)(1) in any\n          reasonable manner based on the medium, means, and context in\n          which You Share the Licensed Material. For example, it may be\n          reasonable to satisfy the conditions by providing a URI or\n          hyperlink to a resource that includes the required\n          information.\n\n       3. If requested by the Licensor, You must remove any of the\n          information required by Section 3(a)(1)(A) to the extent\n          reasonably practicable.\n\n       4. If You Share Adapted Material You produce, the Adapter's\n          License You apply must not prevent recipients of the Adapted\n          Material from complying with this Public License.\n\n\nSection 4 -- Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that\napply to Your use of the Licensed Material:\n\n  a. for the avoidance of doubt, Section 2(a)(1) grants You the right\n     to extract, reuse, reproduce, and Share all or a substantial\n     portion of the contents of the database;\n\n  b. if You include all or a substantial portion of the database\n     contents in a database in which You have Sui Generis Database\n     Rights, then the database in which You have Sui Generis Database\n     Rights (but not its individual contents) is Adapted Material; and\n\n  c. You must comply with the conditions in Section 3(a) if You Share\n     all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not\nreplace Your obligations under this Public License where the Licensed\nRights include other Copyright and Similar Rights.\n\n\nSection 5 -- Disclaimer of Warranties and Limitation of Liability.\n\n  a. UNLESS OTHERWISE SEPARATELY UNDERTAKEN BY THE LICENSOR, TO THE\n     EXTENT POSSIBLE, THE LICENSOR OFFERS THE LICENSED MATERIAL AS-IS\n     AND AS-AVAILABLE, AND MAKES NO REPRESENTATIONS OR WARRANTIES OF\n     ANY KIND CONCERNING THE LICENSED MATERIAL, WHETHER EXPRESS,\n     IMPLIED, STATUTORY, OR OTHER. THIS INCLUDES, WITHOUT LIMITATION,\n     WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR\n     PURPOSE, NON-INFRINGEMENT, ABSENCE OF LATENT OR OTHER DEFECTS,\n     ACCURACY, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\n     KNOWN OR DISCOVERABLE. WHERE DISCLAIMERS OF WARRANTIES ARE NOT\n     ALLOWED IN FULL OR IN PART, THIS DISCLAIMER MAY NOT APPLY TO YOU.\n\n  b. TO THE EXTENT POSSIBLE, IN NO EVENT WILL THE LICENSOR BE LIABLE\n     TO YOU ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\n     NEGLIGENCE) OR OTHERWISE FOR ANY DIRECT, SPECIAL, INDIRECT,\n     INCIDENTAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY, OR OTHER LOSSES,\n     COSTS, EXPENSES, OR DAMAGES ARISING OUT OF THIS PUBLIC LICENSE OR\n     USE OF THE LICENSED MATERIAL, EVEN IF THE LICENSOR HAS BEEN\n     ADVISED OF THE POSSIBILITY OF SUCH LOSSES, COSTS, EXPENSES, OR\n     DAMAGES. WHERE A LIMITATION OF LIABILITY IS NOT ALLOWED IN FULL OR\n     IN PART, THIS LIMITATION MAY NOT APPLY TO YOU.\n\n  c. The disclaimer of warranties and limitation of liability provided\n     above shall be interpreted in a manner that, to the extent\n     possible, most closely approximates an absolute disclaimer and\n     waiver of all liability.\n\n\nSection 6 -- Term and Termination.\n\n  a. This Public License applies for the term of the Copyright and\n     Similar Rights licensed here. However, if You fail to comply with\n     this Public License, then Your rights under this Public License\n     terminate automatically.\n\n  b. Where Your right to use the Licensed Material has terminated under\n     Section 6(a), it reinstates:\n\n       1. automatically as of the date the violation is cured, provided\n          it is cured within 30 days of Your discovery of the\n          violation; or\n\n       2. upon express reinstatement by the Licensor.\n\n     For the avoidance of doubt, this Section 6(b) does not affect any\n     right the Licensor may have to seek remedies for Your violations\n     of this Public License.\n\n  c. For the avoidance of doubt, the Licensor may also offer the\n     Licensed Material under separate terms or conditions or stop\n     distributing the Licensed Material at any time; however, doing so\n     will not terminate this Public License.\n\n  d. Sections 1, 5, 6, 7, and 8 survive termination of this Public\n     License.\n\n\nSection 7 -- Other Terms and Conditions.\n\n  a. The Licensor shall not be bound by any additional or different\n     terms or conditions communicated by You unless expressly agreed.\n\n  b. Any arrangements, understandings, or agreements regarding the\n     Licensed Material not stated herein are separate from and\n     independent of the terms and conditions of this Public License.\n\n\nSection 8 -- Interpretation.\n\n  a. For the avoidance of doubt, this Public License does not, and\n     shall not be interpreted to, reduce, limit, restrict, or impose\n     conditions on any use of the Licensed Material that could lawfully\n     be made without permission under this Public License.\n\n  b. To the extent possible, if any provision of this Public License is\n     deemed unenforceable, it shall be automatically reformed to the\n     minimum extent necessary to make it enforceable. If the provision\n     cannot be reformed, it shall be severed from this Public License\n     without affecting the enforceability of the remaining terms and\n     conditions.\n\n  c. No term or condition of this Public License will be waived and no\n     failure to comply consented to unless expressly agreed to by the\n     Licensor.\n\n  d. Nothing in this Public License constitutes or may be interpreted\n     as a limitation upon, or waiver of, any privileges and immunities\n     that apply to the Licensor or You, including from the legal\n     processes of any jurisdiction or authority.\n\n\n=======================================================================\n\nCreative Commons is not a party to its public\nlicenses. Notwithstanding, Creative Commons may elect to apply one of\nits public licenses to material it publishes and in those instances\nwill be considered the “Licensor.” The text of the Creative Commons\npublic licenses is dedicated to the public domain under the CC0 Public\nDomain Dedication. Except for the limited purpose of indicating that\nmaterial is shared under a Creative Commons public license or as\notherwise permitted by the Creative Commons policies published at\ncreativecommons.org/policies, Creative Commons does not authorize the\nuse of the trademark \"Creative Commons\" or any other trademark or logo\nof Creative Commons without its prior written consent including,\nwithout limitation, in connection with any unauthorized modifications\nto any of its public licenses or any other arrangements,\nunderstandings, or agreements concerning use of licensed material. For\nthe avoidance of doubt, this paragraph does not form part of the\npublic licenses.\n\nCreative Commons may be contacted at creativecommons.org.\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 0.1328125,
          "content": "# Code of Conduct\n\nAll participants agree to abide by the Code of Conduct available at https://lfprojects.org/policies/code-of-conduct/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 6.744140625,
          "content": "# Contributing to JanusGraph\n\nThank you for your intention to contribute to the JanusGraph project. As an open-source community, we highly appreciate external contributions to our project.\n\nTo make the process smooth for the project *committers* (those who review and accept changes) and *contributors* (those who propose new changes via pull requests), there are a few rules to follow.\n\n## Sign the CLA\n\nBefore you can contribute to JanusGraph, please sign the Contributor License\nAgreement (CLA). This is not a copyright *assignment*, it simply gives the\nJanusGraph project the permission and license to use and redistribute your\ncontributions as part of the project.\n\n* If you are an individual writing original source code and you're sure you own\n  the intellectual property, you will need to follow \n  [individual contributor instructions](https://github.com/swinslow/cla-tool-docs/blob/master/walkthroughs/1-Individual-Contributor.md).\n\n* If you work for a company or another organization that may have claim to\n  intellectual property you may produce, and the organization wants to allow you\n  to contribute your work, then an authorized representative of the organization\n  will need to follow [CLA manager instructions](https://github.com/swinslow/cla-tool-docs/blob/master/walkthroughs/4-CLA-Manager.md). \n  While the contributors should follow [corporate contributor instructions](https://github.com/swinslow/cla-tool-docs/blob/master/walkthroughs/3-Corporate-Contributor-first-for-company.md).\n\n## Fork the repository on GitHub\n\nClick on the [fork](https://github.com/JanusGraph/janusgraph/fork) button at the\nupper-right of the repository to create a fork of the repository in your own\naccount.\n\n## Clone your fork locally\n\nTo fork the repo locally, use one of the following methods:\n\n  * if you have set up and are using [SSH keys](https://help.github.com/articles/generating-an-ssh-key/), run:\n\n    ```bash\n    $ git clone git@github.com:$USER/janusgraph\n    ```\n\n  * otherwise, to use HTTPS transfer, run:\n\n    ```bash\n    $ git clone https://github.com/$USER/janusgraph\n    ```\n\nAdd the original repo to synchronize new changes:\n\n```bash\n$ git remote add upstream git@github.com:JanusGraph/janusgraph\n```\n\nDo not contribute to `master` from our own fork's `master` branch.\n\nAlso, do not push your working, in-progress, or PR branches to\n`JanusGraph/janusgraph`; instead, use your own fork.\n\nYou can avoid pushing to upstream by accident by setting it as follows:\n\n```bash\n$ git remote set-url --push upstream do-not-push\n```\n\n## Configure your repo to match the CLA\n\nBe sure to use the same name and email in your Git commits as in your signed CLA\nto make sure that the automated verification process correctly matches it.\n\nTo configure them, use the following commands\n\n```bash\n$ cd janusgraph\n$ git config user.name \"My Name\"\n$ git config user.email \"my-email@example.com\"\n```\n\n> Note: if you forget to use the right email address the first time, and\n> @janusgraph-bot adds the `[cla: no]` label to your PR, you can fix it in-place\n> while reusing your existing PR as follows:\n>\n> * set your name and email as per above\n> * run the following commands:\n>\n>   ```bash\n>   $ git commit --amend -s --reset-author\n>   $ git push -f\n>   ```\n\n## Create a new branch\n\nDo not develop on a release branch like `master`: feature branches are intended to be\nlight-weight and deleted after being merged to upstream, but you should not\ndelete your release branch, so don't use it for development.\n\nInstead, update your release branch and create a new branch for development:\n\n```bash\n$ git checkout master\n$ git pull --ff-only upstream master\n$ git checkout -b my-new-feature\n```\n\nJanusGraph uses a backporting strategy to ensure that changes can be applied to all release branches that are still\nmaintained.\nThis means that a feature branch should always be created from `master`.\n\n## Develop and test your changes\n\nMake that feature or bugfix awesome!\n\n## Configuration changes\n\nIf you add any configuration or change any configuration, \nyou have to update `docs/configs/janusgraph-cfg.md`. \n\nTo update config reference use following command:\n\n```\nmvn --quiet clean install -DskipTests=true -pl janusgraph-doc -am\n```\n\nOur release branches should always contain the correct configuration documentation,\nthat is enforced by our build pipeline.\n\n## Commit changes and sign the Developer Certificate of Origin\n\nThe Linux Foundation requires that each contributor to its projects signs the\n[Developer Certificate of Origin](https://developercertificate.org), also\navailable in this repo as [`DCO.txt`](DCO.txt). To sign it, just use the `commit\n-s` command:\n\n```bash\n$ git add [...files...]\n$ git commit -s\n```\n\n> Note: if you forget to sign your commit, you can amend it and fix the PR\n> in-place as follows:\n>\n> ```bash\n> $ git commit --amend -s\n> $ git push -f\n> ```\n\nYou can also create a convenient alias to automatically sign each commit in this\nrepository to avoid forgetting it:\n\n```bash\n$ git config alias.ci 'commit -s'\n```\n\nWith this alias, from now on, you can just run:\n\n```bash\n$ git ci\n```\n\nto commit files, and it will automatically append the `-s` switch to ensure that\nyou've signed the contribution.\n\n> Note: as it is an alias, you can still append flags to the command line, e.g.,\n> `git ci -v` will get you a diff of your commit while writing your commit\n> message.\n\n\n## Push your changes to your GitHub fork\n\n```bash\n$ git push\n```\n\nIf this is the first time you are pushing this branch, depending on your\nsettings, `git` may tell you to re-run that command with additional flags and/or\nparameters. If so, copy-paste and run that command.\n\nAfter you do this once for this branch, you can use `git push` to add additional\nchanges.\n\n## Open a Pull Request\n\nGo to the [JanusGraph repository](https://github.com/JanusGraph/janusgraph) and\nyou should see that it will offer you a chance to compare your recently-pushed\nbranch to the current `master` of JanusGraph and submit a PR at the same time.\n\nReview the [PR check list](.github/PULL_REQUEST_TEMPLATE.md) for criteria for acceptable contributions.\n\n## Code review\n\nIf you have signed the CLA, you should pass `EasyCLA` status check.\n\nIf you see that CLA check isn't passed, there will be a comment from `EasyCLA` with the link \nto sign a CLA. Make sure that your CLA and your name, email, and GitHub usernames all match, \nfor all of the commits in your PR.\n\nIf you are not sure what's wrong, reach out to\njanusgraph-cla@googlegroups.com with further questions.\n\n### Code Review\n\nJanusGraph uses [Codacy](https://www.codacy.com) for static analysis pull requests to ensure code\nquality. Codacy creates in-line comments for items which require attention, and can generate a large\nnumber of potentially unwanted emails. Adding codacy-bot to your [blocked users](https://github.com/settings/blocked_users) will stop the notifications.\n"
        },
        {
          "name": "CONTRIBUTORS.txt",
          "type": "blob",
          "size": 3.8017578125,
          "content": "# This is the official list of people who have contributed to JanusGraph,\n# including contributors to Titan.\n#\n# The AUTHORS.txt file lists the copyright holders; this file lists people. For\n# example, employees of an organization who assign copyright to their\n# organization are listed here but not in AUTHORS.txt, because their\n# organization holds the copyright. Similarly, contributors who assigned\n# copyright to a party other than their employer (such as Titan contributors who\n# assigned copyright to DataStax) will appear in this list, but not in\n# AUTHORS.txt file.\n#\n# Note: it's unclear at this time whether contributors to Titan pre-acquisition\n# of Aurelius by DataStax own their contributions, or whether they signed away\n# their copyright as well. This needs further investigation.\n#\n# When adding J Random Contributor's name to this file, either J's name or J's\n# organization's name should be added to the AUTHORS.txt file, depending on\n# whether the individual or corporate CLA was used.\n\n# The original list was generated via:\n#\n#     $ git log --all --format='%aN <%cE>' | sort -u --ignore-case\n#\n# and manual cleanup.\n\n# Names should be added to this file like so:\n#     Individual's name <email1>\n#     Individual's name <email1> <email2> <emailN>\n\n# Please keep the list sorted.\n\nAchintha Gunasekara <achintha@me.com>\nAlexander Patrikalakis <amcp@mit.edu>\nAlexander Vieth <alex@lagoa.com>\nAnderson de Andrade <adeandrade@verticalscope.com>\nAndy Keffalas <akeffala@nearinfinity.com>\nAustin Harris <austin.w.harris@gmail.com>\nAustin Sharp <austin.sharp@seeq.com>\nBlake Eggleston <bdeggleston@gmail.com>\nBobby Norton <bobby@thinkaurelius.com>\nBrad Anderson <brad@sankatygroup.com>\nBrennon York <?>\nBryn Cooke <BrynCooke@gmail.com>\nChristian Bellina <christian.bellina@ef.com>\nCollin Scangarella <spmva@genoprime.com>\nCris Weber <cris.weber@gmail.com>\nDan LaRocque <dalaro@hopcount.org>\nDaniel Kuppitz <daniel_kuppitz@hotmail.com>\nDanny Thomas <dmthomas@gmail.com>\nDave Brosius <dbrosius@mebigfatguy.com>\nDavid Pitera <dpitera@.us.ibm.com>\nDavid Robinson <drobin1437@gmail.com>\ndeiflaender <?>\nDylan Bethune-Waddell <dylan.bethune.waddell@mail.utoronto.ca>\nEric Lubow <eric@lubow.org>\nErick Tryzelaar <erickt@lab41.org>\nFabrice Bellingard <?>\nFrederick Haebin Na <haebin.na@gmail.com>\nHomer Strong <homer.strong@gmail.com>\njanar <janar@yahoo-inc.com>\nJason Plurad <pluradj@us.ibm.com>\nJason Rust <jason.rust@seeq.com>\nJoe Ferner <joe@fernsroth.com>\nJoshua Shinavier <josh@fortytwo.net>\nJustin Corpron <justin.corpron@justinc-677.glassdoor.local>\nKarthik Ramachandran <kramachandran@iqt.com>\nKedar Mhaswade <kedar.mhaswade@gmail.com>\nksenji <ksenji@ebay.com>\nLeifur Halldor Asgeirsson <leifurhauks@gmail.com>\nMark McCraw <mark.mccraw@sas.com>\nMarko A. Rodriguez <okrammarko@gmail.com>\nMatt Pouttu-Clarke <voidpointer101@gmail.com>\nMatthias Broecheler <me@matthiasb.com>\nMichael Klishin <michael@defprotocol.org>\nMike Dias <?>\nMike McMahon <mmcm@comcast.net>\nMisha Brukman <mbrukman@google.com>\nMrKeyholder <fractalf@gmail.com>\nNik Everett <neverett@wikimedia.org>\nPaul Kendall <paul.kendall@orionhealth.com> <pkendall64@gmail.com>\nPavel Yaskevich <pyaskevich@twitter.com> <xedin@apache.org>\nPeter Beaman <pbeaman@akiban.com>\nPetter Aas <aaspet@gmail.com> <petter.aas@fronter.com>\nPieter <pieter@pieter-HP-EliteBook-8570w.(none)>\nPommeVerte <dylan.millikin@gmail.com>\nRafael Fernandes <luizrafael@gmail.com>\nRanger Tsao <cao.zhifu@gmail.com>\nRichard Doll <rdoll@care-view.com>\nRobert Dale <robdale@gmail.com>\nSamant Maharaj <samant.maharaj@orionhealth.com>\nSebastian Good <sebastian@experoinc.com>\nSolon Gordon <solon@knewton.com>\nStephen Mallette <spmallette@gmail.com> <spmva@genoprime.com>\nTed Crossman <tedo@rockmelt.com>\nTed Wilmes <twilmes@gmail.com>\nTim Wu <tim@urx.com>\ntsecheran <tsecheran@yahoo.com>\nWytse Visser <wytsevisser@gmail.com>\nYuhao Bi <byh0831@gmail.com>\n"
        },
        {
          "name": "DCO.txt",
          "type": "blob",
          "size": 1.3876953125,
          "content": "Developer Certificate of Origin\nVersion 1.1\n\nCopyright (C) 2004, 2006 The Linux Foundation and its contributors.\n1 Letterman Drive\nSuite D4700\nSan Francisco, CA, 94129\n\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\n\n\nDeveloper's Certificate of Origin 1.1\n\nBy making a contribution to this project, I certify that:\n\n(a) The contribution was created in whole or in part by me and I\n    have the right to submit it under the open source license\n    indicated in the file; or\n\n(b) The contribution is based upon previous work that, to the best\n    of my knowledge, is covered under an appropriate open source\n    license and I have the right under that license to submit that\n    work with modifications, whether created in whole or in part\n    by me, under the same open source license (unless I am\n    permitted to submit under a different license), as indicated\n    in the file; or\n\n(c) The contribution was provided directly to me by some other\n    person who certified (a), (b) or (c) and I have not modified\n    it.\n\n(d) I understand and agree that this project and the contribution\n    are public and that a record of the contribution (including all\n    personal information I submit with it, including my sign-off) is\n    maintained indefinitely and may be redistributed consistent with\n    this project or the open source license(s) involved.\n"
        },
        {
          "name": "KEYS",
          "type": "blob",
          "size": 28.677734375,
          "content": "This file contains the GPG keys of JanusGraph developers.\n\nUsers:    gpg --import KEYS\n\nDevelopers:\n  Create a key:\n    gpg --full-generate-key\n  Select:\n    RSA and RSA\n    4096 bits\n    no expiration\n\n  Adding your key to this file:\n    (gpg --list-sigs <key id> && gpg --armor --export <key id>) >> this file.\n\n  Publish the key:\n    gpg --keyserver pgp.mit.edu --send-keys <key id>\n\n  Signing another developers key:\n    gpg --keyserver pgp.mit.edu --search-keys <name or email>\n    gpg --keyserver pgp.mit.edu --recv-keys <key id>\n    gpg --sign-key <key id>\n    gpg --keyserver pgp.mit.edu --send-keys <key id>\n\n  Additional Information:\n    http://www.apache.org/dev/openpgp.html#generate-key\n\n********************************* PLEASE NOTE **********************************\n\n  Releases will be signed using one of these keys in this file. This file will\n  be available with the distributed JanusGraph releases.\n\n********************************************************************************\npub   rsa4096 2016-08-24 [SC]\n      D3C95553EE39B05E350D959CA39CC3ADAEAEF36E\nuid           [ultimate] Theodore Ratte Wilmes (CODE SIGNING KEY) <twilmes@apache.org>\nsig 3        A39CC3ADAEAEF36E 2016-08-24  Theodore Ratte Wilmes (CODE SIGNING KEY) <twilmes@apache.org>\nsub   rsa4096 2016-08-24 [E]\nsig          A39CC3ADAEAEF36E 2016-08-24  Theodore Ratte Wilmes (CODE SIGNING KEY) <twilmes@apache.org>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBFe9xPABEADIBxjwRIzpRbqZWx2jigyTGagnl7rcmMnyWU2uxK21Qcoyij66\n9VDxwN+AtPJVkkacs+mN752U2ECBAg9KUK6fRvkcSF5t0hBPQRcplz0dm2lRXqO8\nMDfEiq9EhO3bckFxlXknPUKxMNJQdnqqdNnOUuVTPWbMrasriWdLkfpTG1kFnAWS\nCOdZDv+UXKQl35IXTJGLjDE/TQK1ZmZxpzaoGTOj+T15pSlWuIsAVtvgYHNgZJRB\ns+qaeW7txBbr4Oi1ukDaW1Bd1UArn044LAE/8Ua+sVcTdJsL/Hz2gug+nQHKKffI\nhhUv0LpfWsf7TKKjVmIHUOHnTGRng9+4yly7VDxGKHSOxB1ZUGChkfrYEsE/FmcY\nik+D4ZjFS0Kpd4apxJfvtqOzV/UeV9on6lPGR4y2BX+za0hs8h5jtY32brQ4A7dg\naM/Q6efy8piIkx8CQYrOxfZK/SzRR0ZYo15kqLoUOwyWmyEwSToiHAj7wT3Kr+ti\n66WksEv8X5MSSc+N9HGo/liookSxCvLlZ6MBBK5nFtDn4dFw7PB9qP4H156Eua8n\nb+f1kTaxYZa9aAoQXxH0Er3ZdBB5PNSBkUsfeNpe2iZkqll6jP9Cf8L/pcxL+rQ+\nKZnkgOEKD+rl3z2GSKR7yo8tPGmPCfbs5DDeqU1YaeS3/O4CCdYnOyItZwARAQAB\ntD1UaGVvZG9yZSBSYXR0ZSBXaWxtZXMgKENPREUgU0lHTklORyBLRVkpIDx0d2ls\nbWVzQGFwYWNoZS5vcmc+iQI3BBMBCAAhBQJXvcTwAhsDBQsJCAcCBhUICQoLAgQW\nAgMBAh4BAheAAAoJEKOcw62urvNuTsMQAMSQj58QKSgys3H5QBXV8ZA4dkT601Hg\nCvHCkAKuc2lGs2Ft4wFJJvAHBEP1fFvEJwiF82R1Z9fza5tBstHDziz6hfNufREf\nzh2eM5UBT0gAa5sF78LOIQ4Q0kS5j1BIER98M206P1Ffo+Uwl9raY9VvIwtqp9+i\nlz0YJBxqxlRNK8ojvFA5Rl7D2uYCxPFhvrddQ3kvFoK36xjOX6hYZVRWPQ9NESLB\nPz1Lu/nVtLE3mulqi9OupvWK9+NUEkj/pVWkof2fm+oX5HTB0ou43+svP4c9oOzf\nJMtbIsA4teVYY/t3koDYDrWzTQlfqbx7BpBmgDZ//t9kVxl7dUarIFeSpqwghMRv\nEPikzyEPfCbRFFQZqQvoosI/pA+N9Zd8Y8+ngvNn+q8X1cI2hm3wuMKOponR1ZeM\nYydiduDg45sv6lajCTLS5uvmocjifMFcO1gzkt8A51Gpy9IyAHWbfW4c8QDhtnqj\nSw2UuCg94L+KUDCUMS7kbIF9FtDaKtrnKwcAWOZd08FxSpWERSXHHhKoqR3hT0o4\n7aNvMQPAINq/06iJXWWScxA8ynA6oD/CUNTRaafVlB4upk69EEmfMMzXc3h1DB5/\ncrNsKHJlizZQXGBUQ7tKhJnMvFeGuGfWi0A7xcOpyms5xXpoo0+990rrTBzUe7Mz\nDnx+oo9f6Qb5uQINBFe9xPABEACbih1tSfm4SR3OHJeCGA5GxrxQ8HKoU7wP5REz\n4DTQhLv1MwJ6ThXRvsOM01e2qbJEN/IpEhK9bD3ZhVkqjaallAG9Qg9g2yFWp7N5\nAMJ2V5xvh0Vj2G54BiDTThMpBHRelBE6JQyDLz5JMT03YhxvLhY/UA+2lnVGWzyk\naFHVb+DKt1ShzzgWcl4ehJKP0QifYhkSftl3Jx+RyT7H6WaoEFbmP3IeOejrEAoo\nk68SC22j/1nljkT4UNJhfx4J1ryWqRQVtZz+AxkI0L8u94r6Mbc9tjDT6YjJgwl9\nO6FKVmI4ssuvWzwy2YiFbVJN4T+qS0IasFSBo/3reHcgiOwpJtStolyvgXLa+Hpj\nd3h7mqp2G0OOzwP08Q4P0e0iKY4YifCAdhaP0mAm7+ROOM9YvpU+HUsNhBo1p9KV\n+wGXLuf83KEt7CbzoCVtpqVvc6vJaezdoRW/rJ65rRa0CkFa6SLIwf/+DMYQCTvd\nffJLfL39f+2G/l4nWUcgHIASeGMRddGtn0fz1EIPw6sv8fPJsiXZroIjfQp+B5oJ\nOz0PN+RH4V53z9PEaRIzdqLpzBJnZiVmRao3T7rWvxo6reNgheKO7XodpRhF3lL3\nyhObMbOeoLUjAhOmrdMd2ot4G/aQ47wjJE6vtaMN//uU5DA2wMrFoZT/Db/0h8tT\n2DA71QARAQABiQIfBBgBCAAJBQJXvcTwAhsMAAoJEKOcw62urvNuwH0QAL+m18s7\nSvXdehTNyRz1HwNnXQV9TLHkHkzFEeV3CKTNVujvmSmqmwCUDGOGSqEkJ1a55AGt\n3rHLcDqhIpEqCZbZMoMBQ0uKoVUMiQ8VTXlnMcxa57eq0VQFc5ZXLV0jP3w45Bnm\nMokhJiL9ZfCF2FioqZqXbOgRmZ5f0WfWbdvotmmf6eMqkeOf0LVuKhBgFaYqtjQQ\nzQqpdu0bKYIDGxvptf1iM/ijH24xOB2Mh8x/K3Ul8+YEjC3jmLtHQUbbCIpBzGfe\nGHiENaRaaG7t8RpkjMfp+wLHPtwfbslcx7pL0rga7/eR0lZgQQPbUi9VXl4ezguG\nBd6rKUTrUlQtSlxH4Jf84aHQa4UBaCvkiiw+CeN7U5Viod59TwRbi+ezPlAt5xRk\ns2pkZPv5fZDQsmzlPMsjZSDE+7skBYCHPCDAM1qTkyaVRc4g3r2DAsuiuZHoSJis\npDKvqXNST0e+j9jGMlcUNlggXYG/X/+arXVOR6OWVeJWceHnZ7AQuIPV8nAbYdHZ\nTvDOecWTeRLKm59SlXMYxYx/pd5ewaVRtJO8walrw8sHobzUPJo4PMYDDVmyuf16\nVdIKzxxn890Q0dOya2e2xxzKYF5gga0b7tDWba5FMqD2pGV0761oSILTy37/KTXi\nj54vu/DpmJlQaEPeX62P1NPwA770npVbkHYt\n=LuuE\n-----END PGP PUBLIC KEY BLOCK-----\n\npub   4096R/41802BA8 2017-01-31\nuid                  Jason Plurad (CODE SIGNING KEY) <pluradj@apache.org>\nsig 3        41802BA8 2017-01-31  Jason Plurad (CODE SIGNING KEY) <pluradj@apache.org>\nsub   4096R/19DB679F 2017-01-31\nsig          41802BA8 2017-01-31  Jason Plurad (CODE SIGNING KEY) <pluradj@apache.org>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\nVersion: GnuPG v1\n\nmQINBFiQvg0BEACvW33fA2ru2lJdJVnLqDsJ9LJ5ABgz7pngk3sd6mcCR9rxusZh\nxdd6YoOzI+Nvi0ViECiPafQY55WPuQSEnB4ezoT0VKKW+yZeVybWJ7MqwSkSRQg7\nC8aKjfvnV6ELv9LOgaQs3Yuf1KAahkazJ0L7ps6UyzpyRZR0WDha6dMeub533ovY\nv8W5CNolnL8WelnZOMA+DF4rEbwwcic2kziEb5QOYXeh1rjcLiuELaIFs1AUMujc\nzj99fsB+kZ3jFY/AmEj2nhffGfX+R4HvsuL5PF6G6cBiMub9qTwyblkP2fKHY50U\nFTnE8L4Ll7ztXnWubAcldW8RsXItB6zQRjaIRkSvvO7ACgpNhKdzeGFCxE0MkMvD\ne8RH8kL6iVKWXlpKDbXZ8ntT0kE9tsZvkvv/Ei3T+YWomJLdOg9MwmSK+dzSfKBN\nBamGGZbXeVFnxLOKzvp2mlVharKVKRe1lSz7pgzQimMCuBpg+K3qsDHZ2NgDZ5M9\nm+c0CWzXBGkLaIINv2gGmPz9MUfhlKxnwiZUvKgvQCAZuFngAIPMZLylZKufJMId\nxLKacis8E5KGhZe9je0rPSW8AQDAtGydWUFrtXcTzS45nUN91jDsiWBIJHI21ZsM\n+zbBZxVeSBi3XBUTZe6r0xeMWmi4ckeS6JcfykuxPfodUE+cirQ5kE/7LwARAQAB\ntDRKYXNvbiBQbHVyYWQgKENPREUgU0lHTklORyBLRVkpIDxwbHVyYWRqQGFwYWNo\nZS5vcmc+iQI3BBMBCgAhBQJYkL4NAhsDBQsJCAcDBRUKCQgLBRYCAwEAAh4BAheA\nAAoJEGa4X/FBgCuobJgP/2Yz+XlPqJIjunq1h5f2y6rzoMYgoGWu1qz2yQowizza\ni463a5kxGUCIjr5MgYOrI9A2+9tYgmrVGfS5m84AvJxolhGiZ/bZ5ebNly8ZiPak\nuEOS3EC/2iS0pm9OmvZMBpEU8RMcdF4TLpuK+3PlqMxPbciTYKxVUBcfrP3Rr3kS\nxSZeIK76J2VrxUaSjasRBoCEqvKqouWrPEPXwIStBWFaz7DBcC8J06bWjWQ608UR\nB/1rxPXeLWGdm8sJM7l3jEDulLjQA4OU7R+ONvfJI9EGqpX7Y484Kh9aNH6DpHwZ\ngpHhse40Y8oDehNDmZGuDcjivKnJFQr63MrAiHRSJOEoc1TsUg5H+td+17zrMW9o\nrWXV61qk610bpmq7ZXG1fO34X8AhlgpTg1q3xyXZqOY7BijtdyMxUZFnvNy/pA+H\nvf3C6WfFQUmgllLMZvF6wDu3A1yZJ+b904FDmzgbYRfb4eIAPxEY1sbstdu4Dk2S\n8hoieW7M++VBT3qHjiwP+47i2uXza6owdzwrOmICMNemWjB5saIF92qv+dXNCda/\np9vRl6rtr8dAdD/07tJEwVrzRIPC24WWVf8JXRDX+U3Y0PZOfQ+ksOG6DNX15q+Y\nqPDwWP/p2pgerVa74tm8a4jaTbUSl/wL2Rp+3FT51K1tjJnd0DTNU4RReOrrX8u7\nuQINBFiQvg0BEADkcTeQHK2hKK6wrsfC3ydaefxCUxcGPejN1N9iAP8ZmweePdGP\nwV//NXPBPHuF6tSvnDfW5Bv5m86+m9qX7UXv6W43T9QN9+qZMjWllT/98VcMppm4\nUZe9qFy5jBXnTj/DUV3zB3/iHGeU0cwsshpsxVJMylE/jO+PuraIkRVzF6Ae8Eg7\npyKwc4Ura1G3ZAJileggHqLCFYmaCc75UTeaamuU2te3gt6rzjPsolBprEJCfY6W\n2Cd7fXlshMWDEoCJhhAzmez6VLhfNgLZo+73iD+s9V1UurWnE9j/8WtRj9VlWmhr\nUAXidulazp8UDKJ8uKSYSFcdFK1Yp5UDTDT3BuP+wpLIZ2nZYHoSGLwCU7WAWxQy\n3lvlfQCMTxd7Efs2MuLGwL1xgG4Jmiw/Dygt4RHCjWY4NIJulXE8ezlP0ScW310D\nJd6TaDmp4PZD1PdYXHKng2MkzUqMRsfwcEWpaWiKPcHYm4lI+NrDMju63sQmc9s6\nMMFPMEh/dfl2/qtH7gIqXtnX/jdeF6BMtFCFxzIQHlwmA0+IkMFQz3l5HJUP7qwm\n2f+nL+umGp49OkziXhDlSnsrV+60uJyvj3/iuFuOsoOkRM3ZzgL6cksKYW+ZXmKH\nlVV+J91nslB38TyhiTl+iFWLZ1rx5aBQ11oodpukhqGwZi1xokiuZGk5WwARAQAB\niQIfBBgBCgAJBQJYkL4NAhsMAAoJEGa4X/FBgCuoYU8P/1FcRqC4J14P54vbLAF1\nexdQ++rLqgqdAf3C/ObOWnfPD/gzfA8/lL/wrBL2BKKPsAhVBaSV9zI6fJWtHYuM\nyJeuXvyTKPWzt0ToqnzubXeUNG+uBvFts9A0UDsc9VI8A9qrxD/M/lBhjWKny9bK\nzK4owtsH9pBKv2AGu51GFkunGHTrA3CQDTj1IDvTOr6lASBaXXAI57dFxSOpD+qZ\nr6IveKjk8dlsKUVqp0npaKgoELhXxePlJSgW9nLx5nnroCIXbAQt+yLdscQlnPHX\nG0Ny78N2LELvYxh75qi2XxC6GWopCzGuMLrpCUm3CtTqIdRoMvaNCeDuZ8WgPEnT\n29zdyYcZi3KtFmQuUAO8eCAMJZhlprqOYTY65IV3SjNR/apI31PaqAHHKscwhrcH\nZX9TWHiWMad1RPKCgYNa8ykGzSkPkqBlFyABZLhodNu9eyzkdcXwRTKsGf4nna1v\nx5c+GQ/reRGVmAwinfhee6Q44nmkfW8A2Bs8zve2dudj+7iLV7oGZDKSano1dytR\nMGdzaaKi0RsLfTvtN8RZabnw6PNGHzxC5EETtx8ZNYopxZbC/5Z1ohrJGnEUXN+b\nqMamPSrBvLa+aigdGF2CSLFKHJyOD8WNyABNZ8BWh9Kt9FpcHd6n62Qt/hkbUPwJ\n5wZwrz035uYAQtSPzJiAcjVo\n=z99j\n-----END PGP PUBLIC KEY BLOCK-----\n\npub   rsa4096 2019-05-21 [SC]\n      6151592659A60B2F4A1E7429D5CF9C5A56482E5D\nuid           [ultimate] Chris Hupman (CODE SIGNING KEY) <chris.hupman@gmail.com>\nsig 3        D5CF9C5A56482E5D 2019-05-21  Chris Hupman (CODE SIGNING KEY) <chris.hupman@gmail.com>\nsub   rsa4096 2019-05-21 [E]\nsig          D5CF9C5A56482E5D 2019-05-21  Chris Hupman (CODE SIGNING KEY) <chris.hupman@gmail.com>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBFzkKKABEADMYwoW82P96fAlEJXOoXyd0yNaz5n4JoPdmHFXTSiwC3zS6lFX\nfKrq3zPgMZF08f4q/vfMp0pQGm0wJEYKFj3J6NSOCABvHVkjBt3DhJSK9QQ9fW01\nHNtsq3vABCnzhegDmYR4YVOKeH/RR3PcyXZ0GNLLZMGXANeYb9J5iTlnAcfUrfVn\nDyuNgnXqxs+hT4yPjnpKUdZWm7Y4dlWSwb1lamCzzJHYiI/ZZ4SiUgKDOELXpFyk\n8TMmRL9RyQl1USf5tFO8ZNRuNz+RrlC3FN9HfOeiBSflFR0nPgBsOscEwalLXD9W\nx7fxZ9My5XzeV9XL3y1wOziriQdb0bk7x+jORUEh0W+8w7wxlvVwmaTpKHDcT/c4\nUxsQkj4YD+wvsXwWl2aTGkcMxVhB0l3wu346PuRIrO7AgNBbBM/7rxf/uzzte+Xt\nuwCzFf+N0CK3VXHkWcbJXn6yIoS8BpyZDd3xmja4M01f34EPs73X/ncaOjkcuIma\ndgz1pC87r4QohOP/qJvd3Y1r15pkipqU3jb3fo8UpZ5xIQ+SfB68/ErllvGd/Mff\nXDZOK46GH6EUaFIgszjsmFXaRkyrPCzNZn2xsdLk/81wsF7daO8EImclLDACdnkS\na5Wy6Dt92O592toQBPIgyp0nBTX6k6plnQ6i9MNNakfbvbOv+f2E6LA6kwARAQAB\ntDhDaHJpcyBIdXBtYW4gKENPREUgU0lHTklORyBLRVkpIDxjaHJpcy5odXBtYW5A\nZ21haWwuY29tPokCTgQTAQgAOBYhBGFRWSZZpgsvSh50KdXPnFpWSC5dBQJc5Cig\nAhsDBQsJCAcCBhUKCQgLAgQWAgMBAh4BAheAAAoJENXPnFpWSC5dBr0P/joINHG/\nk7HEIL/5JBFljH041WOVIAzXAFprmRfeWcly80AZwk+eTE/ven2CbdaRwZmd/lxU\nobI0qf1NyTIudhpKRgp4hdKivEuv3B7Uf4BJTQkLcAG3JuW0+wrDrbUsckHAoEHw\nvtAk0Jm+wfeldkm4Ug32KBie+Vq43L3J0Fjf2/ziK7q31MtLfTKOFVbOTfdHC7HU\nKIGfDZJ1MfGffdGFRC2gJnCCCNv2TAucBB4peXPzCIQmriRgdyojbiy02LApE58+\nPXVxzPcjhTvMpeW8j4QUQiVTsMU7pViyBS74kB41GKYPuZ55kCPE2NZSlWFr41kG\nWLoTAY3HNqdVcJ9LaP3uesCzqHIVL0f/SYF/rZGdjjkUW7u9CZsoXfC1fcCRwtTe\nPlNMcmBO5cokmt0NPpbRTn3/UsPY8y+QPrYpct5kdajTXT0PAuY8Yay5x+oCagkU\nX08ZFb0901pOCL0a3GpGuPoD3QA9UUXhNMDuEG7onLUek8WcmwlBDxcIKQreAnBT\nXDvueZMbY25tAkIvO3zTyLxyHMYlzIfzZS7qj1eVqD9jyNLgVohK+qmfjS1MEkdf\npiTlEVdXRuFpiIYxeyQmvOJGxMX5vRGYriq3A4sUnKXV3/OOmWRaUMDU38v6qLjm\n7g3imSn1XusV1hEqiOqJ32RcaClUVhSpVwSHuQINBFzkKKABEADSOYbOMnGSfNNE\nzQsysRiQjCrFe/vDfMWIxf9PdVUhIIOdYuVMHkjuGYcWaf4yJcis8z4ggynCXTxM\nu3JhT82+MN3DJHKBz4v7TX4OMoag9X3sapNMxkV7GX8jtHzTDHMrbUnna+xUpIGi\ntBz8j6p2d/AlUSAkSSexeVBeyDZWxIfuDYnLKHWbBRL/DRiNEmhig5SOBGeUnHw1\nCTtgi9415Weojv/0K+EHtL9q6ug0+AfBjTGgJmOJL5HMDma9MZZ9Jn/+LRdwvwgd\nyYzztZKXLLN3mPVCbhvMLGxjdIvQdu/dat04DFFnCSE4OzDh4VGvyDaynPFKHFsp\n1ROZj1BjUyZstv8bF1399QWTM4Z0finYOnJrogTM6NWM7TQbMG2Zw26Jh1Yaw/VM\nT12oYlIvb112v9jRLa0lTcuo1oWJSMuqB6N+z5YSdOrXI2IGXkHwpK1iUT3LTy2A\nhvrDkxx9v+7Aw1fkdGuBxAAqird4N4yab0UreLcuqSmZ7B7JOExMPt9cxP099lvm\nTK+nYL+M+S9M//KNRN2CWFD4viyAjDrLVfSjJJJQVsjd8CKASC8/eZ2Eggs7BJ9d\nwGzgIOyRfXcf8qvR3ex6PDGeg2Ps2UnMkL9voah65bmQyc9Pi0yRkKLZMOmRZ7JR\nLSj161V9u6fks/leMnust3f2TG/Y+wARAQABiQI2BBgBCAAgFiEEYVFZJlmmCy9K\nHnQp1c+cWlZILl0FAlzkKKACGwwACgkQ1c+cWlZILl15hA/+MUAUs5rHRldTobdE\n+38MYeMzQOGBTPqwiO1LHX/ReBE31bwtSWweVBW8nEJywljj7C6R2pSUg4NS04WH\n2QgNXMi+xGR6A9vPgs95QK8qy2Wswe3hSakTbyg8xtutUmEoUttX3FarRop877ng\nvOpkrp7uEDxVSSMg1QGrJK4BFtzPPuWwfUsMwgRTYNvIllXh+RxYzPSMaO2lGudz\nk2zupVzMWkhfibbs/UDtN7nt9dw2tx8AR0MVUq/VZTjPelN6aQMjSsxT5mEiNZYX\n/NqRen+0W2RStbgqscIZpnKW1/HO3i6DUhhjDZRal4sQgyDgZhg4rraj4ixZXmQF\n6J/8hUCCx8EZx8DM2kKK3uWq6t0rRy06K5inporegLeuSMlqWCqhUBSDnLZUZbsD\nEtfizRskYZ4/lde3V33qSb23bkjaXdKn9rBFbqda64PLc7TdcAy5dtxR1NUv0yQT\nyqykpciXqgaxr6aMeA2y0HMwlbMI+wzQxtUS8JGnwMkInYPQms5+OXw/KkhdR3Ng\n7J4sU6EkjtQAM1lqTXloocG0ReuxEY85E4YA+XwlNrPIenkvO+iGVBjrDlFDmFW4\n/FRtWqDs439EZ4zSGQgsuCu5mCu49Q5KDD1n2p+aAioSpU1V78D3aIXHJIDCFzv1\n/HVm81xsMngXDT5Zkc23yKGAeXk=\n=z7Ab\n-----END PGP PUBLIC KEY BLOCK-----\npub   rsa4096 2019-06-17 [SC]\n      E918E256968990A478CE79F47F87F9BD4D9F71A6\nuid           [ultimate] Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsig 3        7F87F9BD4D9F71A6 2019-06-17  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsub   rsa4096 2019-06-17 [E]\nsig          7F87F9BD4D9F71A6 2019-06-17  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBF0Hg/oBEADm1hB+4azSgXQ62xJooof9+3FgNd9WB5apdHJwda9MD5l8IzMO\nEe5Ulc46HYyot9bxT7o0RBUSqnThPPttwB7tu0dpd5UgjmIY6wqtZ6XBXi8MfBpi\ndwvmAdEZINXayoDjRlCef2dsP+Y5HjIlSg/X9f1OYE54TmrYPXL/Qq30N28DMAH+\nyBHoFEfbIj2/9DRhwEnjwRXUK+DjTAGGIMlx4tdvZV0byLMf92AGrgSMNlFsdAPS\nnKbhqu1QOMoZg0kjcYfbg3+bwyW+MRKRGTJROxdBW8xVtWghQWX33ZBm3Z2/pyYC\n3hHiaoprj3nQZUuAho0WAh1j2q6yXeBVD3uKXYowXBkLe73w4/EgKT9jhGTgY9C5\nJWSCDdSLlXJd1jyLcmASm29Ulji5XFxcMeUtACk0NyqHX1y7fxIx73PXhqH1TUWA\nZmJ5wxjkx317YFUx1vcm8gR8Lc8GJUaftVxeWJ+08Q/NDhNHC4flK77FiahJy9iZ\njyxM2q5bGwHjkrLrZIwTMYrDjymDIbs9OXLQBF8PM+WNPFLAi+OKsm0/fD4LQxXL\nd1C05VUa+8t8+xZRlCRCqJPLyUiomiee4qB8kzPYEA4+roAyVvhvnxre/YbhxwHw\niKpzscR7aAsnJMhXkfbxl49nL4u3jh64BXT7RCwPDNU/nhpK+cddwhjMbwARAQAB\ntEFPbGVrc2FuZHIgUG9ydW5vdiAoQ09ERSBTSUdOSU5HIEtFWSkgPGFsZXhhbmRy\nLnBvcnVub3ZAZ21haWwuY29tPokCTgQTAQgAOBYhBOkY4laWiZCkeM559H+H+b1N\nn3GmBQJdB4P6AhsDBQsJCAcCBhUKCQgLAgQWAgMBAh4BAheAAAoJEH+H+b1Nn3Gm\ngrAP/iuF3Fma69RIkVWer5BfLotdWuR76IMNfepShHRa+iBxNY28teIHWHqgmxBy\nHP93n+rBsZlWJpOXN7M1pyFYZa0fIuAfXR9HfX0NFz3C7SpBPazUIhey7G0s0tk+\nDI+zRDm2+CL/zB1qDuPQNk2wAPThswpD0774hsiao+CvBNwPcr6lGkWljfv9JyLv\n/PQ0IQgqCcFh/Duy0aV4MXjVSkw4EjU4AVsZ1td8BkTjADCZgBDuZrwb1+4qO71K\niUGI68po99xMPUahtWtCCkXBZgt3aMBw6GdbZTiUVn+o1zIYzsj0MNuHwQgbHTpy\n3BvBCux+Pn8qjBv3ibLrh7UhrxM8vZQ5Gt6IgTb4oDc7oLaNzYe7rbDs+Ru0RnC9\noP6jHGvlkwfHt+StCfYr65ELUy3eZIODT5fIzOpFUelBx9kkLGtP1INoXuIA18Kj\n/8vVtIzGUKjbazkV9UJNiuhJ97BF5wxjiCYCO/4rVjPJ8/HqNxraWgp+M64Fre2T\nnY8boFDN5R0aSwDKdealfSTtqzANUdRMKXzUP8YrnKuEYqrVdN7k6oZU9vwIaRUn\nTZyYm2QPWD1N0oiuY/LXxgM0fV8hPMdxLIfgyfR/Ig1rmqXy9UXqRYq4Y+fdPg8A\nAAErKo/UmFt/YIqg4KVDpEhQzwzNqW/pDxcoiI91hjoTHaKCuQINBF0Hg/oBEACn\n+i86M0gqlf4R5TRLy9SsFSd3RpcqcKoMFe9Z3t1vDL/cWk8bjfb03rYLcLqvOOia\nDZn21BWGq1kRx9o5qwVa31reUwFkeNxxl2919E1QJYguufcxY+IsB+lZsmybhq0c\ngf1EQfrFWvU6sXdz7itWMsRjNFUUB/ky5HMemEoabt9WUMGUk+zhi05lBCylAcRd\n8/ETC+szVs/e51XqfFsqHLiQnMm3NYH0yzVP3ucQhXZ2zsO1U/G44ExrCYMSmTjW\n0ksmDA8GDqQ8uUKF51lHl6oeK8vTtVn76hRb0fDWZ7dPnh87Sk8yk3bVDmxHCojN\nPpsmXnBYQ4b7f9ZKCyN2p+Uyp7yvHQEzDfhE+sgei+Ljc+/rWVscgcN6W93/L4KB\nmTstoVIUjcGmtUE/jKp6pkURKyqgQaQcXiX/jyVv5AeFcspZhwKDMpB5XOdd0Ced\nr7qhVmtVdk1aWKUTvO/9z1e3clMU8tiA8caUIQIai3KaggU2jHDpxIxz5qAiC6CN\ncNBWS48RkAYY1nCbMA7HXP1T1OIyfqJHJdND+AnJMa2e1RVJ4AzPOrWG353k+xrL\nX0Y9H2bWFuf/gGFMf1k69/PDnu8UqlPvIpR+vRDZKXk7m00hPq7ttQ4LSU4tDuYj\n8JIq4qrm0eSUO9nMdtOhuhquTxgi2TkHJD+c5++z/wARAQABiQI2BBgBCAAgFiEE\n6RjiVpaJkKR4znn0f4f5vU2fcaYFAl0Hg/oCGwwACgkQf4f5vU2fcabx9hAA113A\nN/7sqfohRKDXDy0GTPtMTRnt1ZkRO4U81aTI8mmTIwkeFsmRBzt4D3zMM4gZ78nU\n0t1IDJWHij6J0uokWP3f4/8C5gywj2tQkmRoTCHjCo+QueOkHCdUFgtLxNcFHxw5\ngOBrjGhbiVb+Q2UnRTHi4I2/4omw/1bqAUeZjkh8vSEwHQB4sXfPaZdLcS1va2Cr\nFoE7TafP778jHkBboQFA2OULy0WiOzElHnKF2RkbN9KZpM7BltD6rvCzIADEJNO9\ndVrL5Swo8c13feWtU3vgwF7K0/sjp5MwSmXFvYRW8GtMJH8V8nIG3M7VC+YORdJz\nj9fMUeWzdDklBT9McTC7sK7myCCVpUsN/HRogjTqZprUL19U3HERt5LUuBrCBYUa\nagsc5GgZf5kilVyF7Y8aV4KzZ2hc952oi8KsvctgiXOxzeXZG3gfz5L34O8Cxgdz\nNV65Hl4wXKAW7+RVp2/1S6oLBZ++Fqfb88jSjEQFFHWsHZSM2dmtBbrnFxS+1Hdh\n4BCvumAtTSSRIswjbyr2pbC9T8u0hy9VDgZbIjaPpXo4Lk/JxcxodjQohHQ7t5eZ\n8hrMchMGDDkWD5wDIvbAWsTD0EBavYhk00YZJOkGhqjooVOinL9mmc0ycSVs6epX\nRaDZ4HbauOnQWmJzOgBV0nQAfAD8HbskCZXnn1M=\n=dIjr\n-----END PGP PUBLIC KEY BLOCK-----\npub   rsa4096 2019-07-01 [SC]\n      27722A92B9E4C2B83448925FE7A15393584CA8AF\nuid           [ultimate] Florian Hockmann (CODE SIGNING KEY) <fh@florian-hockmann.de>\nsig 3        E7A15393584CA8AF 2019-07-01  Florian Hockmann (CODE SIGNING KEY) <fh@florian-hockmann.de>\nsub   rsa4096 2019-07-01 [E]\nsig          E7A15393584CA8AF 2019-07-01  Florian Hockmann (CODE SIGNING KEY) <fh@florian-hockmann.de>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBF0ZvhwBEACg1KaTUWPN6VT9M4lkI481136sBCov5HhGxMQS3ocBDzyqlD/I\n6rcFf+HuX40UipAzHjn+Bk7WIVQMpR04/MnT/TBU4F+f8YGx48AbABoLnhh8HUES\n9ZqqYNZNbJkQRgyfbzoX/2LrRvnFaG4ddq8Qwb7y4mKpWAIA2F/Po6+bbF5W74/o\npJ64TYROi7FrKvwS9mJXuykfkaf964Ta0aHnGZ2KFQFEpW4Xo3moqfHzpQIXQiWw\nsOxsn8vilbz4iOayS21v0H1T3dPeNBtNnxiWasg2f+CWXjwanUHxiR/Qj4F4aslA\nwU2ocdqHVniU0gMcwsrM1ISt9sOmTlZeWEH0lq4ii5IfmNfDoaXZMuruFpMA/kMx\nzoc1fXmex7CfQQhIFAP5xJq2YCuqmw9o5u0XnwomfyH7fgXOCFbvStJxvWj8TlHm\n0s95nYOTjfgGi2QSRfgaaRQ34Zqo5g14aljxCNmLqe0FUnhRQcubpUIuzw8Tos03\ntpWQYNK2Wbe27rJZKDysqtnIcSOiutw/NrlZM5AhApaCFx0p+8SB/anb0WcspYpw\naNqq4m52tcb2lc7Omz+2JNgKc4DqJpvytJb9RLcWcn03ZaBBcx6wwTN5Bw5jWXGm\nsIZA+aAzsT9+FrAKurkkCYUfaojIVwuwoaxdphCcb00ZFNMOrZGAVBVQNwARAQAB\ntDxGbG9yaWFuIEhvY2ttYW5uIChDT0RFIFNJR05JTkcgS0VZKSA8ZmhAZmxvcmlh\nbi1ob2NrbWFubi5kZT6JAk4EEwEKADgWIQQnciqSueTCuDRIkl/noVOTWEyorwUC\nXRm+HAIbAwULCQgHAgYVCgkICwIEFgIDAQIeAQIXgAAKCRDnoVOTWEyorzkOD/9t\nS3n7zsr0wq3POlWCl8c8JaWuJdDg69lTGiSvMRpXHN+kNLqAW9wnOLaMwgBB5qdL\nMl9FKhH5/pzgaiP4bSe+OGb64Yggzhr0cP7HlRSKVCgdSWh/UzGAsVtsxEL0JoUZ\nLwj42nGd+ra+Rjy4/lgqeTvEeiWmFv/u/S+4yTX1jzbTSGgs89ATrDeYqaOYGk9F\n0bB4y3g1u04Om8Q/q6iBueeFnGCG+tf4zoGL/J6dPUc0jCi1PvLyMU2GTpArGfof\nRDHM0TuqK36SbvG00DGgJiuP5P9Uqz75FAqbhudhzN1B+9BoXeL3M9/FcpfxUL2N\nnRI2Yo8iEF+SvnhCOOJdJDjLr2tmZ7gP54/mD6imazcdr7yraD6rgwrJjfMGQLhK\nm8ej1RHTolKtrA6URJjZ4zu1MU2wNKl8lZo0sOsr26WO94+3C0yMxeqdvpuoc+z5\nKTB8avW15Y5NDirIGa9oE3s0I3gUsAqMQFlW3CdnzUvJh30Tyw728kPgjGkAUxSh\noxNbMLruXDWcjqUxDt8rAL0jnOvoAB6PdLY4EGN0qenXHb8jNUSGtsnAk5ad0nNU\nRnb3Trd9YjkDZdiLkxqtscRD9ssqHhByDOzivyvfnC7UqedMBwh9gel1dqkfPnkY\nLvOHuiKVhc1XV4l9LNuSw1BZFFaFHP/hskZVeqzb87kCDQRdGb4cARAApVce5HzP\naQ/eYqCrPJDWCFzuFCD6hbe/bDjf5hR3388HLcOrQypxALlrefdjCEdpouPJ/VF6\nhtd+VzSDRJeAkMZhnTHgOxTaDyW/1utQw6sQ1FV0XR7b3JjrywtxAcjzXeOiwUt4\n1WIHJMUFj2Ub+0CxhtB6a3Svd6gGrzf7rQ3zZuUIFJOJaImSq51UcQdHrBeuZIKM\nRoxGW9kHG7G4qrXvAcK8s1jggNdT7g3+y/EnsZy7FwC9doxKcuPEretfLGHM1lye\n67dW7FUwDv5MGzIqaYCAQbKvkeR06AaMUSVoUnD1OIOche752AQkPlcEuyss2bxB\nGQycE+u/tQGsdiiPkct/++DlvxH90rXpxEZH14rbCcZguHiKJFHCTkv0Orjfozub\n5q8/hethy1GeU8rJVDhlrw3C+ZSYoBRNak5H8XmdypPr7A0hjxyc29i6rGZ2KMw4\n5/nSt1qLE6TL9W0RV6tRLqX70dsVLMtah8cXRX16h5Y70Miq8uSIzmgDeN2eQxsK\nHlmOlbGpOkcOec5/9S1w6Zg9Q13rMfVVObIPvCjMZGhSkR0YT8blIH3ldxHj7Rsw\nxLpszFXPYaVvbxue90o+TAtvKfhi3sFhMmdbaCucvDgdvhwF+nKkeRnsO9nWYAKP\nRKb1KZRbQ0KkHUx6eFaU5kp3ea85jZlnglUAEQEAAYkCNgQYAQoAIBYhBCdyKpK5\n5MK4NEiSX+ehU5NYTKivBQJdGb4cAhsMAAoJEOehU5NYTKivw+4QAJP6VLQXoYm0\nmGm8A+PM0rL/z0Ow0sYEI20nsIxjBMGKr1PD3DqWlPXUTyHgjK1V7Pdn+qToRxuf\ng/kRzbDVmjmSIIUNUpInr0W7gl9x4B85CEEmuPOh+1rpE/5vS/oC2b/Tbc0saQ6N\n9NBX0gJGBN4JrVixj5WNWVpr7oLCtO/8yVCXd4jxzt4u8/H3tdgAG9JBk4lEWCtN\nebLfH4nCeo6mX8xEh3yG6fpkBiXQYRI5nhvVl+2NL2S9bzvySBzxujLz48s061Jv\nhCMTz21E/eFq9QZDHDJwRDVlhZMWTsPPFqYMyPJeuA0EC/rKLb+oRL4+B4eH/zRc\nKp++zQEoytlOnHZjJ7/4eC4PtNxk9AnI2qrjgICZfosemej78ougo+vM0X+dsf1M\nGujXa1z6Xv5BYq1mu9Qc5F8HuDdii/pXTpVDlWcz2wZBRIAyMIqb4G5nIaHUlMH2\nmQWYYZpYFLowcyfMwX4ewNwNp0sZjfVBTZg+hTpjjfz5GV5GJ1Rj8C1G/Soyu6Zd\nOHexaduWwJOLfA3LXIJfrqzoLUYZpGne8V6bA5XkSvz1QM4K3ChGp/d5g6AeUpFV\nfFxraW41wABqtVHj7kVwJtzaIyi0jg6sbAPY3W4jx8DGk+cGlHWHPyL5GrUVi4wT\nQLAC5nfwVxkVxa9xswJ9zBxqVDY39tix\n=y8CY\n-----END PGP PUBLIC KEY BLOCK-----\npub   rsa4096 2020-03-10 [SC]\n      773D0A320875B265AD3DB7F7C2851FA291B09066\nuid           [ultimate] Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsig 3        C2851FA291B09066 2020-03-10  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsub   rsa4096 2020-03-10 [E]\nsig          C2851FA291B09066 2020-03-10  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBF5nJPoBEADQ/Xe1vYEfTfj36n594J6a41JMCbvD8s+m5lqLyVfSSWS8AtuJ\nBVwb6O3cE1EuX46QCIlUrzSUpzwC/63xwaDsUbpAma3JIRtj1Fz72ccNZlmsvp7t\nrM7KFppTp9zgAgtG/YvhE7z62wqSavBKXncJE0omRGVPa6iw8mm/ZUHLAVFK41mX\n0NIw1uNW+hdSouLVWaxZ5E012hxNMekPIWVuv+froNa/clUu9GMEowU54mQOIGeE\ndYkNLNowbU7uT9YMjLixuWs5c18rGpXR6b0+XHNGdJbF0ntMki02RY15hspwm/Kl\nS+8wy2Pyzg9LR37O7jDvwjuCov1rc9DrxIIXFNjI6eReAapuhGbeXdBsajq9tX2j\n2UpMXr+ND7FY6ntr4n/DPzkg4mUbeD8KnJtoF2al5GpJTZJoTnxyXpP9cqTChpOD\nmp7peH1Vqn1O7eb53pd2wy2IaFBTeRONQ2/bbvZFtG5qcA3qKn+34lSesVtOsKK/\n1BTxyvQ2yaNHUmGqMhCtBZDUF7qe7CnVqk44xWrjyEiNGMciKBTsYnHqFSAF3LgY\nUdnUZDlaVnRdJp9t+Ff0Hx8dgUeUxJVVgvl8MUPT8zafI4BL+TgKeZaf+zkigqeh\nfcaP4JHQzGOWlvVMJnjy7ZZYPOWQQnDXetNXNMwfDLeAcAivHy/r9/xAdQARAQAB\ntEFPbGVrc2FuZHIgUG9ydW5vdiAoQ09ERSBTSUdOSU5HIEtFWSkgPGFsZXhhbmRy\nLnBvcnVub3ZAZ21haWwuY29tPokCTgQTAQgAOBYhBHc9CjIIdbJlrT2398KFH6KR\nsJBmBQJeZyT6AhsDBQsJCAcCBhUKCQgLAgQWAgMBAh4BAheAAAoJEMKFH6KRsJBm\n8FYP+wfWP13oBJnaAMUityS9zCU44PYdx92I7mITaGfnFMNTdjc44tobquy+l5Kk\ngVJoWISSnqD1IZri3TjtHvIpFXs4qB9xF/dZVKgObzeX5TYWhJVH0y2b/PxcISjy\noE+FxJzBop5axII33M7aJfPWOe9e67hADju0F78tbIzDJIVxGagluzUzilIU2WSy\nGrNWPXviwbDSEuXmihcFpIcaJ31Spl3nDta8SdG7apSRkzs6bCFjZ1COSJ+8rTSf\nYA3SwEOL2CBRE96+6hcehUAtlllXk97PRTn9e59SzrCPekobdH/d1PzBOe9DxVgN\nH3wRys8kXbrFkADSWwy8bmN7yZ5/RAgoKH7Q11UycB+Yzwj/TGJRCOj7UfqSf1P1\nm3PVVA14gsm4/opwHtAUiNwxWa9bVvGWlSk3L3FRPInNpzdDFdIoy7AIONuISjYg\ndQd5b8OmnrhdaK7f6aqXY4MPSHKAX7DYyCOtaXchZ6vVOW94nbDdRJ1Beh0R+c61\njY5gcAZCQHEljLpcYRlcnPjvJhOjYJE1YWQojJVNdFZsKMNlQwh2VuoCYWTPnx+K\nkPJrvjDPg65BbDvoKdOACWlBzmMIB2d5DzI5dhtsrkh8tBuGyWMe4CutCPktDP/I\nCULi2Wi2eXf3qpFKDO7Y26baFhffa3z8lDU19kljPvVPnH73uQINBF5nJPoBEADS\nctePxWtvJi1S3xx908FVJDgK94JalVBB4XdpaocG8nHO2SDCGzF7GOOdJko0SsjH\nOmdDQRhIqIUUAJQjlZiEiUtxR87GO8TQsm6KUx2FWu+zeeb7NMd1d/4MI9Wa2iOn\ncbBkddDXZB/FO/RyyPgu27UyPowV8tTbhUYRc2SkkR4lk8Vf/17CY+DbR0oBoOhf\ntJbXCTKJXAkV442uaf3vDrSmFhGAMEtzqZ9skfvCcSYJUH00/br4Hl0urqtg3ouv\nuJNTWRJunk+Z/R6xxwfM/+88tRcnTwhQvinJLPSb8VlymArDbC1mwkWmAs4sjfYD\nXqyvq0LUDaEcUnFNNPr2nZzZ3QEtz82uCmnE/LGmSFlZQCnQlMU1t+YQuzQe03uU\nSso32NujYgAKrmtBcPTIbHGxSQVO30C6biM5VIigB4ORFw9L0tjLsJJVG6cWh9WN\n6bqOlwkeKgv2RaWJKH6OJNVIaDBH8ozkh/O1MlTKSK6P+OPUzF5WzlC4qQsWoOcR\n8dg1JvRKeokvCdbECM0VU67bsgzTrwOT8Lb7RHE5qFz1ZUNnSLvUQwANsJp2mIuy\nFGl1xvB8a/Nc9w2uMnfjwAgyWvQxWOBr188MZ06Lg1xsRkuJ+n2AS2OF6IlWnbti\nzvfL3Hi85QJnjvzInYrDZoq9kVtcMDB0vTmKuzj9NQARAQABiQI2BBgBCAAgFiEE\ndz0KMgh1smWtPbf3woUfopGwkGYFAl5nJPoCGwwACgkQwoUfopGwkGbMIBAAy1Nc\nqx2yrs0FQUZmDKE9q6nxwtAuCVA9hYhwesGiLMOZtkafnMp0ZQxOTvsy80ZlG475\n6H842hBbPC1+mKDbBgFquOlsveCbY7fWueTIs608t8PuMtjShwqhdZBAOq91bhlL\nv8G7H8bfsUTGhjnOsPwCwgMhBy3dLtdtQ/QVtfANl11updl7KUif5Yf2mY5/fcZJ\nsQR1/ItsZ1q2Aswh/+5eVDcYUMAwKXxOpcljV1V8jr40g9kOhP5fuXYdn7ns4B1n\ng/p5CcO9LT5H6Xlz6SPvWfVLa5NuGibmvQZEyNzgILtN8jT95k02nzcR82/pk51N\nuvCr6vl/ncPVqyPEZqdYMQ5ThNQqHw+GwhQTUyP9CtkfASJiCvDHa9YUWrT3+I3k\nTIsW2BR8MAGbl9xhg5gAUVY2jXWOTV9X2OaLpnyd4IjDdVzv/3qp/L4qarNR77Qz\n+YTsAupSPpsxUagTaTJYZuR7dKl6tF/TafM4NDv9FSmNI7d36tDeNVLvKf8Rp6oF\n2q8P26WD0Qm/qLulvModxUcgDQyIybpXLrxmFnalR8xoBOX3r9OZiK9EhHRYOWuO\nmn4xoa645X3xQ0OOPvmSInilnMsTpAzk7jdew1Wj4EbQlkMITR4oPKFb7PRQAJ23\nHFAadq3T96CMT1kwUKgc6BW9i0RkxRdlCdR0gQc=\n=j0un\n-----END PGP PUBLIC KEY BLOCK-----\npub   rsa4096 2021-08-28 [SC]\n      C622DB4502F61373A5C112EA6867A372A7742478\nuid           [ultimate] Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsig 3        6867A372A7742478 2021-08-28  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\nsub   rsa4096 2021-08-28 [E]\nsig          6867A372A7742478 2021-08-28  Oleksandr Porunov (CODE SIGNING KEY) <alexandr.porunov@gmail.com>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBGEqlKgBEACx7+nsNEon/9MfcDEsy+zuuN4sDmELMTZ30ceX9ldk3LK/k6mT\nIwxC0A0p/LS0Hpzvy3QPQVtb/SVqtQ52IZ3vWfMkju/veqVugmTefm34kPHqXGqX\nHyBz3XCuoWAVfiJTSFhzS+xv7kxYZCjvdcDwaQJ0hKTAOTgJhRGCkygchOtjucrX\nE6tBvM30wc+NH9kQulFsvuJ4YgMoK2lmoWNWE5Z6hl0ydVAopMVTJ5NMyj8Qcxv5\nWFHrfIZnRUtxMv95G3GuwjeORDMBftOWUXWAPW+SKo9fuQdcH/YtzUL0e0Gi9x8c\nJmcv6oPL3Zd6YnTAG9ny1JA33cf3Lp8uAKJ6zRVwSJAv6id/Gbv9A0vTCWqpxO7A\nTn0y55n+KIjKvkItTamkE+vRAkV9J7S7aTGGLBW2BqcuBoV+WvjeQXylzAKMIilO\nW5LWiYHFkrjVg7z7DnSjvEHRc3d5zK+4vluWiRnDX+5sUvbDV4runIWSp3WadJfu\nbUVM5loBeo0fsxJu/+8diyZw7sQUxmHzTKmy+bGlHaeQCptU+aIQeA9sqgNrph5Y\njkkCoyGKUXBN6GVL9FR82E3Nbjb2v0corVD9khWMQWKsclPzQniW/gPlfoKBHmge\n6Tn1swo27yjirrqd/Z+0yFfdnLPX23p6tIuVvQbDHZhDaJeTqeVam/KHTwARAQAB\ntEFPbGVrc2FuZHIgUG9ydW5vdiAoQ09ERSBTSUdOSU5HIEtFWSkgPGFsZXhhbmRy\nLnBvcnVub3ZAZ21haWwuY29tPokCTgQTAQgAOBYhBMYi20UC9hNzpcES6mhno3Kn\ndCR4BQJhKpSoAhsDBQsJCAcCBhUKCQgLAgQWAgMBAh4BAheAAAoJEGhno3KndCR4\nWiEP/RrkPPPJl2ITVY6Afx1B6VLOf7qvCncFppoKiaPzWs+uBuHUmeKmYPwINSFj\nYoNVesTsRuf67nGNnM2xH75vhrPIMp3i1zXAuFKYRIwtuYApu2PEjD0YSutrsoK6\nReTk5sU3j+5iBGi5GYqYGk/9j72ZNOpxZSHfhm7IrRz0P1h19mZzb5i4xSJ25FD3\n2DKvC+wm8Sk8m3XAcriGcGoTUky2Xx2UzZCt363FWIhHi0vsa1KE5yu8ChOIa7lF\nfEveUCbhLQWmKT99xwfzoJLCpgDLm6PEE/fsqdbaYAz/4u5KA0qScEllKO5WpN+1\njogmfis19mqDjbs3nP7bJMYM4J0I8zmtR8TRtRPAmLAxy7njaIPHIWhrEGm2S57R\njo0v6QhOamJSxd9tKYD+SPTHoYvLKlEgaw0HrN7vjQGh73otw+0BkysxSX3vv1Hp\nu0qSwx08HQLllqT33b2hbjUNIIagNG5rYIHtPw+++bqlT8klGyJuT+yCirJgq8Yw\n8W9S2QEHEXMTwDzwOly2zuEjFd504ipG/GeQORZU1uz2dcGU4XjYMdCUjJqs2I//\nxddazpKuaXBiAAOWFdgovw9G1pd9vDg3xLN+8tM+o7oXu8H3ag0N9cLB4R2RUvWP\nKaDDJ9zbgKcwmTRWEsfzurLfD1L+lAyIDxQReCKEHX2AeJA3uQINBGEqlKgBEADA\nylYQf4TKnsoWSb4jLMHkK7cVQxNmRvTSarwBNFIbkuffNqSp2zpeb2HrEXx1RE5t\nOyhh4Shhqt46s/Mf2Q7DBqrXYXerU0ztB00hG8x1GX/VB6CdsmBy11iluHZXqPGo\nfs9URqlAzqRvuUXH+ydQ6aQGnWjPGYbs8/a7mDN9NVPCqnSYwn4EY1loLixGZd7o\nexUubitt0+L11RoiRN4m2Ou2SwqrrR+A8wSjx8FVRmMm0blzJkAKBFm84pbpL2/d\ny8we6rPZXvbpPOGxeQpoYFHWbP+tcSSXxEOyMjAUSfUvDGeHqNRXaxGQrTDoE/EL\nTK9NbQgmQYGQSK2krCqnn9ny2o7RhX0QyAADQ9C3t43rvkHlhBlQyJuTHzo8WpI+\n+XXyp3h4qfFFjvxCF/JPnHtTjftl8fKZJQujzsBKaCFTX+881foGF8PboTlnBf3g\neALgYf17oWzy/ClNiZd5Q0nWNP0VW8b+L3CrO00+RYHIW3otojmhaSsnzVxtSjtm\nOCzjCJfYh8oBSJoClHasNz+v/n4270WhODEAqQbmu0okVmiHI2+DuDrejAkLCjlS\nJZZN5MFp8ukUjqdQneH/m3yI4+0RCzrv7mPsgef1E0ndUzqbvBAH+eZHYiKHqjnh\nGaIixr2LiLqWN/9VKvCqQHiaF5M2863MxgqKQXA/hwARAQABiQI2BBgBCAAgFiEE\nxiLbRQL2E3OlwRLqaGejcqd0JHgFAmEqlKgCGwwACgkQaGejcqd0JHhPmRAAifwU\nLM/QjsfjOhy4r/AwfhNMQeSc+1tsF0VAktGNKcXLsDSVP6+pJPvgUDhDsz1CiJpj\nIRkrjUrYb14WV8Lkqn9HcCVqZQSpy5Jdk+Usyt5nFPAfVCxRo4yPf696q5o69vKA\n1rP+Eo1ahABt7JOidrZXp2a908WS5R8wXhLfvcMYIzIZ+jwl3igm4lenA70G7UBw\nh1jZNvxaGhVGLfK32kIqj2gsukshPAAZs8XJZHsi35/AcwPhu4z0/lnLNfR9aBm3\neg47huB8Rbv9u31ng4wgDD6v562zWjCMqg43+WMFLY5gv9nKNJva+TzS71eR52pI\n3qvma5xnFErNW0zDJwZ5ogFHnWW/yqbsjXkTgbXas9wT6gkwqUeoZtxakCm/TNbv\nLeg+I7RuJr1s5SOK6/S2PDqm+t74qHu/ReetCOGuS4nAIEiC57D3DXrWcZiLnA9z\nQASgRuIIaaPG6ZizcyRCmjaB8TbD1KixRwyv5cN3YCAe04WooRU/Uyr+EhebJkb6\npN7gWow6P4uPdqinUl/N7b/rFyWE3SeeK+eXmxKP0XfiL6DjsQueSSlKWcMsNZ0Q\noaTL2tXGDMN+JSebrVUplrllXkzhyAccwgVLIV62EKF7MhXAJQ89Dp+augvEvk8v\nR69a1kcLkZTPlJGwcnSoKPR7YaOhUskT5lulWw8=\n=ATZV\n-----END PGP PUBLIC KEY BLOCK-----\npub   rsa4096 2022-01-13 [SC]\n      D0486C3F00F29FDA7745D962639000A892AA34D1\nuid           [ultimate] JanusGraph (CODE SIGNING KEY) <security@janusgraph.org>\nsig 3        639000A892AA34D1 2022-01-13  JanusGraph (CODE SIGNING KEY) <security@janusgraph.org>\nsub   rsa4096 2022-01-13 [E]\nsig          639000A892AA34D1 2022-01-13  JanusGraph (CODE SIGNING KEY) <security@janusgraph.org>\n\n-----BEGIN PGP PUBLIC KEY BLOCK-----\n\nmQINBGHgc78BEADEmZ7x3goKTtYyma0AGAtg3ZRMm+fe3DZLrbgB73IJmT5HS3tL\nYFr0eC7G7OWgLzg3QLzwp4u3HjIFnRKmT3E2LfGAvAAyNCBDgOYJLGDzq9woTbGa\nG0Rdjz5Dr7e7FZCxUzKnCbzemL7qFuViY8aT07HbbXRcJ2AlygcX7X3QJXbrfe/c\nQgmLQ1K/M18vCGV39+pmMWG3I1WmkqEJHXQ7RVlNC55AV0rynCn8LZYwEUZ6HeMZ\nhJIWgyJr+dDXTUEwYHWrxLiV1IGkg1ukGQ0cShT4kSV24miQBpiGmXQ5Bi6LuGO4\n8g9Oc4qjrFRh71IsCWnTHvIqM8sUsjA6MIvTcvp3QvGunr7/ze9r0aFuIgmXIFvF\nGW5PTHAY8OpbPZLHVs/uzFZ5sSBJwlQUkyN/uT+eyFZbZVInpJ9aeznWuyGS2ptt\nsp1x0/eNMyFxIHjitHw7hGD1hJrqi3gLb6o2EAdYQaC2gWOU3qC29Lu3zksNBZoX\nXgBLHFC9ufHGK/+wK/1xt0A8nGQxXkbnOsLZTByYN8tXUoFLALacOIaSI5zWnqIy\nNwMciH0OiTSGpJRm1T6an+3sXtSmmQWN7BUujewUcR4hIUiLiuHzHQtUJ+S1wWdp\nZkDdbQE358Xwno5kuhRjcN//NnSEgalbNYhO24OC/wpkIPQKhrKhlgwnTwARAQAB\ntDdKYW51c0dyYXBoIChDT0RFIFNJR05JTkcgS0VZKSA8c2VjdXJpdHlAamFudXNn\ncmFwaC5vcmc+iQJOBBMBCAA4FiEE0EhsPwDyn9p3RdliY5AAqJKqNNEFAmHgc78C\nGwMFCwkIBwIGFQoJCAsCBBYCAwECHgECF4AACgkQY5AAqJKqNNH+Kw//UXAUv97c\nwRz99SpB6Lfv4NBCMs3rCiW9Da6eMLWLfE5H+HTQV6JQqlIu4rJtzHzsXCrQEwwH\nhZSZwy0Kh8bCNHA20AzId+dBKJQrgN3NqO1Y3MFnO13H9x9aHGMWSKAO0X+/eb7O\ng+M9g3Wg9o8zeWSNBLjiMTJAt4Ub5bN6FOwIbfxiF6gCgXhEXte16QC4Uo32NQ0h\nDFxAXmE4sQqeDMRPKEMPeEDMldkY+SCOE8IvMN2JHroOx4rHQUPbHhaa4daKlYtQ\nZIdjJUKF1vUo4p1DJC0PwpDb6RfpRqIaqT0TdmNIgQDGH/6alDSzzfpBwILOKoZA\nawo6ysoLoeoHq3vZ+927iHb2fEeP3pn59WECkAJVW6G24Hw0Zio/2fDg6FkGMALF\nlmGbfY1+zQV1GI3KOtrwr57uFEsZw/Ka93F4HCU9cC/iqVvLROt3ERXWMyRzm2Ep\nCrqTWKUW6KPcZ7pzSoiFWFqXGn5JCaDoB0+KGiYAwWgF5wzHjI+R6g4Xp8S4T52W\nkYh0xKk9Pub9/NdwT93TtVVWbeRsErAd1k4gcxjTDXWfGsoKBDU0M8lJHwXhnDAL\nVOoAjoUvKnWVo0ghUPwIBxfGgdYnkYb8HnSM5rRyY8YKj6I+RSiMbiTxWevsf2Wb\npVDoAXKscdL3FSt+WhKuq2XnIFumwtdRx/O5Ag0EYeBzvwEQAOj/gPIFYiUWXmri\ntsnAR4N7iyLBA6shu6otJJpON/bmc889R0PLJ2kYGjaDDYXjnWIb2BzxQWQQnYdO\nxuJEE9f2wDPzI3IQm3Fp8S4fv6KBVzvLPVKGtRIwMlkEK+ENmGzfV4dLfUr4ywiV\ndCR29SwVkZy4R+SKkn1L1B3ws8l4MIpIi2o62GyQttTY9eQLsfAbZt1x6gq9BQmb\n1p9M5H8ww/8eQ/JAGfx+2LFTdz14etHKlvFV36DcgR6Yh0gpogQ2U9HlEr31U2JZ\n+JguJjuvAnNkfovyHhiejZM6Fj9uWihGVSq8G+oV10AMTRPPchgrKTODD6zhCoac\nUVuPjMgBzDhhUOrcldyJji1HqHmVxum6IbsYHSaGKyAD8lqn/luzDSbsrZ93CV0F\nhcwjxq3gnZ1pAf2vsI0NOurnJw9vSiJuBMiPXyD1sE7BmoWI/eHycpDXdJL6FT+q\n0qEtBw9a5GVVyH5+UZWEYaPHrEe2HzRcnva81NSol5MA9QVtdl3iVOChOFiDOt9b\nbi83ZAKkcB+NwMMtG5NLN0NXyNgKiB89bP44yitHQ/II3wOuZrf4B4G9uPUxEiH1\n9vOzTdWjJvQ+rVy0vcHIaEL0/tfkBh8F/2towrrGO7LRqqcOMdH4O3jqTY7HnF0a\nLvcKNcLgZpWeMeudQ8gtpbeBV6vBABEBAAGJAjYEGAEIACAWIQTQSGw/APKf2ndF\n2WJjkACokqo00QUCYeBzvwIbDAAKCRBjkACokqo00eGjEAClcI8KfZRYKbs+VRLq\nLRt7gF3piKB3aB0+RgeIgvlk9pq3PSVXtOh3Sqs+huXwackmRHrWDzqzIlgz+py1\nP7EdrwGF7CagM6qkB+gPsI8bogN5YffKTA/gGyRoM1qkx3RW/xQPe+DE4QYRMxWT\n6GrkA8QASgFZSYj7ZPt456rSVN63eGbzx8gDEkuLP27+2LJ4/USwuF7CqjmhonsW\nBb9RGMDyCpblv6gz7EdHnNwnluZUJLJZXXGc/Hq9DcXHAAkoySd3htAxQ6EY2dKc\nOrsMEpGNw/obABP6gAQtCxHHTjiiTLNeKQyd7i7yEarmqcfuHddQ0OQ7Gi5Z+Hu1\njDlG5PLvlaYSac66MvdB9we/DDSQcHNki/CEqsVQ1Rcu+53BhhbHWrSmilgVgWN1\nFH4tu9sZmzb6k+R3SXz4nc6MusH3wCrkSHwaOK5eGIrSxGcXln20mkQs9BifoqL9\nQ/3cS1aggHZiLJfqM55LmkFds3NIU0tKX4l4xVFI+fQXnFBNF37nRgPIUmcqauEh\nmyDOtz5P21DMojGmgOP/8Qdv0eT7w/juTgeUZmajG+aCNdiBkHsM9fDATD50u+P0\n1RI0/Ln17qpQbuDQr4C5dFHqp4tiLlaAtuXZGBQVTJOVqIiPygC/xsHJfd8Z43q1\n4ATgsSmnAWT0iAwetkPRnUOLtQ==\n=NHly\n-----END PGP PUBLIC KEY BLOCK-----\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 30.8203125,
          "content": "The JanusGraph project uses the following two licenses:\n\n* Apache Software License 2.0 (APACHE-2.0), the full terms of which can be found\n  in the file APACHE-2.0.txt in the root of this repository, and included below\n* Creative Commons Attribution 4.0 International (CC-BY-4.0), the full terms of\n  which can be found in the file CC-BY-4.0.txt in the root of this repository,\n  and included below\n\nThe code of JanusGraph is under the APACHE-2.0 license.\n\nThe documentation of JanusGraph is under a combination of licenses:\n\n* APACHE-2.0 license for all documentation contributed prior to the JanusGraph\n  fork (27 Dec 2016), i.e., imported with the initial Titan fork\n* CC-BY-4.0 license for all documentation contributed on or after the JanusGraph\n  fork (27 Dec 2016)\n\nAll new contributions to JanusGraph are accepted under the following licenses:\n\n* APACHE-2.0 license for code contributions, including code samples in docs\n* CC-BY-4.0 license for documentation contributions\n\nFor convenience, copies of APACHE-2.0 and CC-BY-4.0 are included verbatim below.\n\n/==============================================================================\\\n|                                  APACHE-2.0                                  |\n\\==============================================================================/\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n/==============================================================================\\\n|                                  CC-BY-4.0                                   |\n\\==============================================================================/\n\nAttribution 4.0 International\n\n=======================================================================\n\nCreative Commons Corporation (\"Creative Commons\") is not a law firm and\ndoes not provide legal services or legal advice. Distribution of\nCreative Commons public licenses does not create a lawyer-client or\nother relationship. Creative Commons makes its licenses and related\ninformation available on an \"as-is\" basis. Creative Commons gives no\nwarranties regarding its licenses, any material licensed under their\nterms and conditions, or any related information. Creative Commons\ndisclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\nUsing Creative Commons Public Licenses\n\nCreative Commons public licenses provide a standard set of terms and\nconditions that creators and other rights holders may use to share\noriginal works of authorship and other material subject to copyright\nand certain other rights specified in the public license below. The\nfollowing considerations are for informational purposes only, are not\nexhaustive, and do not form part of our licenses.\n\n     Considerations for licensors: Our public licenses are\n     intended for use by those authorized to give the public\n     permission to use material in ways otherwise restricted by\n     copyright and certain other rights. Our licenses are\n     irrevocable. Licensors should read and understand the terms\n     and conditions of the license they choose before applying it.\n     Licensors should also secure all rights necessary before\n     applying our licenses so that the public can reuse the\n     material as expected. Licensors should clearly mark any\n     material not subject to the license. This includes other CC-\n     licensed material, or material used under an exception or\n     limitation to copyright. More considerations for licensors:\n\twiki.creativecommons.org/Considerations_for_licensors\n\n     Considerations for the public: By using one of our public\n     licenses, a licensor grants the public permission to use the\n     licensed material under specified terms and conditions. If\n     the licensor's permission is not necessary for any reason--for\n     example, because of any applicable exception or limitation to\n     copyright--then that use is not regulated by the license. Our\n     licenses grant only permissions under copyright and certain\n     other rights that a licensor has authority to grant. Use of\n     the licensed material may still be restricted for other\n     reasons, including because others have copyright or other\n     rights in the material. A licensor may make special requests,\n     such as asking that all changes be marked or described.\n     Although not required by our licenses, you are encouraged to\n     respect those requests where reasonable. More_considerations\n     for the public: \n\twiki.creativecommons.org/Considerations_for_licensees\n\n=======================================================================\n\nCreative Commons Attribution 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree\nto be bound by the terms and conditions of this Creative Commons\nAttribution 4.0 International Public License (\"Public License\"). To the\nextent this Public License may be interpreted as a contract, You are\ngranted the Licensed Rights in consideration of Your acceptance of\nthese terms and conditions, and the Licensor grants You such rights in\nconsideration of benefits the Licensor receives from making the\nLicensed Material available under these terms and conditions.\n\n\nSection 1 -- Definitions.\n\n  a. Adapted Material means material subject to Copyright and Similar\n     Rights that is derived from or based upon the Licensed Material\n     and in which the Licensed Material is translated, altered,\n     arranged, transformed, or otherwise modified in a manner requiring\n     permission under the Copyright and Similar Rights held by the\n     Licensor. For purposes of this Public License, where the Licensed\n     Material is a musical work, performance, or sound recording,\n     Adapted Material is always produced where the Licensed Material is\n     synched in timed relation with a moving image.\n\n  b. Adapter's License means the license You apply to Your Copyright\n     and Similar Rights in Your contributions to Adapted Material in\n     accordance with the terms and conditions of this Public License.\n\n  c. Copyright and Similar Rights means copyright and/or similar rights\n     closely related to copyright including, without limitation,\n     performance, broadcast, sound recording, and Sui Generis Database\n     Rights, without regard to how the rights are labeled or\n     categorized. For purposes of this Public License, the rights\n     specified in Section 2(b)(1)-(2) are not Copyright and Similar\n     Rights.\n\n  d. Effective Technological Measures means those measures that, in the\n     absence of proper authority, may not be circumvented under laws\n     fulfilling obligations under Article 11 of the WIPO Copyright\n     Treaty adopted on December 20, 1996, and/or similar international\n     agreements.\n\n  e. Exceptions and Limitations means fair use, fair dealing, and/or\n     any other exception or limitation to Copyright and Similar Rights\n     that applies to Your use of the Licensed Material.\n\n  f. Licensed Material means the artistic or literary work, database,\n     or other material to which the Licensor applied this Public\n     License.\n\n  g. Licensed Rights means the rights granted to You subject to the\n     terms and conditions of this Public License, which are limited to\n     all Copyright and Similar Rights that apply to Your use of the\n     Licensed Material and that the Licensor has authority to license.\n\n  h. Licensor means the individual(s) or entity(ies) granting rights\n     under this Public License.\n\n  i. Share means to provide material to the public by any means or\n     process that requires permission under the Licensed Rights, such\n     as reproduction, public display, public performance, distribution,\n     dissemination, communication, or importation, and to make material\n     available to the public including in ways that members of the\n     public may access the material from a place and at a time\n     individually chosen by them.\n\n  j. Sui Generis Database Rights means rights other than copyright\n     resulting from Directive 96/9/EC of the European Parliament and of\n     the Council of 11 March 1996 on the legal protection of databases,\n     as amended and/or succeeded, as well as other essentially\n     equivalent rights anywhere in the world.\n\n  k. You means the individual or entity exercising the Licensed Rights\n     under this Public License. Your has a corresponding meaning.\n\n\nSection 2 -- Scope.\n\n  a. License grant.\n\n       1. Subject to the terms and conditions of this Public License,\n          the Licensor hereby grants You a worldwide, royalty-free,\n          non-sublicensable, non-exclusive, irrevocable license to\n          exercise the Licensed Rights in the Licensed Material to:\n\n            a. reproduce and Share the Licensed Material, in whole or\n               in part; and\n\n            b. produce, reproduce, and Share Adapted Material.\n\n       2. Exceptions and Limitations. For the avoidance of doubt, where\n          Exceptions and Limitations apply to Your use, this Public\n          License does not apply, and You do not need to comply with\n          its terms and conditions.\n\n       3. Term. The term of this Public License is specified in Section\n          6(a).\n\n       4. Media and formats; technical modifications allowed. The\n          Licensor authorizes You to exercise the Licensed Rights in\n          all media and formats whether now known or hereafter created,\n          and to make technical modifications necessary to do so. The\n          Licensor waives and/or agrees not to assert any right or\n          authority to forbid You from making technical modifications\n          necessary to exercise the Licensed Rights, including\n          technical modifications necessary to circumvent Effective\n          Technological Measures. For purposes of this Public License,\n          simply making modifications authorized by this Section 2(a)\n          (4) never produces Adapted Material.\n\n       5. Downstream recipients.\n\n            a. Offer from the Licensor -- Licensed Material. Every\n               recipient of the Licensed Material automatically\n               receives an offer from the Licensor to exercise the\n               Licensed Rights under the terms and conditions of this\n               Public License.\n\n            b. No downstream restrictions. You may not offer or impose\n               any additional or different terms or conditions on, or\n               apply any Effective Technological Measures to, the\n               Licensed Material if doing so restricts exercise of the\n               Licensed Rights by any recipient of the Licensed\n               Material.\n\n       6. No endorsement. Nothing in this Public License constitutes or\n          may be construed as permission to assert or imply that You\n          are, or that Your use of the Licensed Material is, connected\n          with, or sponsored, endorsed, or granted official status by,\n          the Licensor or others designated to receive attribution as\n          provided in Section 3(a)(1)(A)(i).\n\n  b. Other rights.\n\n       1. Moral rights, such as the right of integrity, are not\n          licensed under this Public License, nor are publicity,\n          privacy, and/or other similar personality rights; however, to\n          the extent possible, the Licensor waives and/or agrees not to\n          assert any such rights held by the Licensor to the limited\n          extent necessary to allow You to exercise the Licensed\n          Rights, but not otherwise.\n\n       2. Patent and trademark rights are not licensed under this\n          Public License.\n\n       3. To the extent possible, the Licensor waives any right to\n          collect royalties from You for the exercise of the Licensed\n          Rights, whether directly or through a collecting society\n          under any voluntary or waivable statutory or compulsory\n          licensing scheme. In all other cases the Licensor expressly\n          reserves any right to collect such royalties.\n\n\nSection 3 -- License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the\nfollowing conditions.\n\n  a. Attribution.\n\n       1. If You Share the Licensed Material (including in modified\n          form), You must:\n\n            a. retain the following if it is supplied by the Licensor\n               with the Licensed Material:\n\n                 i. identification of the creator(s) of the Licensed\n                    Material and any others designated to receive\n                    attribution, in any reasonable manner requested by\n                    the Licensor (including by pseudonym if\n                    designated);\n\n                ii. a copyright notice;\n\n               iii. a notice that refers to this Public License;\n\n                iv. a notice that refers to the disclaimer of\n                    warranties;\n\n                 v. a URI or hyperlink to the Licensed Material to the\n                    extent reasonably practicable;\n\n            b. indicate if You modified the Licensed Material and\n               retain an indication of any previous modifications; and\n\n            c. indicate the Licensed Material is licensed under this\n               Public License, and include the text of, or the URI or\n               hyperlink to, this Public License.\n\n       2. You may satisfy the conditions in Section 3(a)(1) in any\n          reasonable manner based on the medium, means, and context in\n          which You Share the Licensed Material. For example, it may be\n          reasonable to satisfy the conditions by providing a URI or\n          hyperlink to a resource that includes the required\n          information.\n\n       3. If requested by the Licensor, You must remove any of the\n          information required by Section 3(a)(1)(A) to the extent\n          reasonably practicable.\n\n       4. If You Share Adapted Material You produce, the Adapter's\n          License You apply must not prevent recipients of the Adapted\n          Material from complying with this Public License.\n\n\nSection 4 -- Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that\napply to Your use of the Licensed Material:\n\n  a. for the avoidance of doubt, Section 2(a)(1) grants You the right\n     to extract, reuse, reproduce, and Share all or a substantial\n     portion of the contents of the database;\n\n  b. if You include all or a substantial portion of the database\n     contents in a database in which You have Sui Generis Database\n     Rights, then the database in which You have Sui Generis Database\n     Rights (but not its individual contents) is Adapted Material; and\n\n  c. You must comply with the conditions in Section 3(a) if You Share\n     all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not\nreplace Your obligations under this Public License where the Licensed\nRights include other Copyright and Similar Rights.\n\n\nSection 5 -- Disclaimer of Warranties and Limitation of Liability.\n\n  a. UNLESS OTHERWISE SEPARATELY UNDERTAKEN BY THE LICENSOR, TO THE\n     EXTENT POSSIBLE, THE LICENSOR OFFERS THE LICENSED MATERIAL AS-IS\n     AND AS-AVAILABLE, AND MAKES NO REPRESENTATIONS OR WARRANTIES OF\n     ANY KIND CONCERNING THE LICENSED MATERIAL, WHETHER EXPRESS,\n     IMPLIED, STATUTORY, OR OTHER. THIS INCLUDES, WITHOUT LIMITATION,\n     WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR\n     PURPOSE, NON-INFRINGEMENT, ABSENCE OF LATENT OR OTHER DEFECTS,\n     ACCURACY, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\n     KNOWN OR DISCOVERABLE. WHERE DISCLAIMERS OF WARRANTIES ARE NOT\n     ALLOWED IN FULL OR IN PART, THIS DISCLAIMER MAY NOT APPLY TO YOU.\n\n  b. TO THE EXTENT POSSIBLE, IN NO EVENT WILL THE LICENSOR BE LIABLE\n     TO YOU ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\n     NEGLIGENCE) OR OTHERWISE FOR ANY DIRECT, SPECIAL, INDIRECT,\n     INCIDENTAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY, OR OTHER LOSSES,\n     COSTS, EXPENSES, OR DAMAGES ARISING OUT OF THIS PUBLIC LICENSE OR\n     USE OF THE LICENSED MATERIAL, EVEN IF THE LICENSOR HAS BEEN\n     ADVISED OF THE POSSIBILITY OF SUCH LOSSES, COSTS, EXPENSES, OR\n     DAMAGES. WHERE A LIMITATION OF LIABILITY IS NOT ALLOWED IN FULL OR\n     IN PART, THIS LIMITATION MAY NOT APPLY TO YOU.\n\n  c. The disclaimer of warranties and limitation of liability provided\n     above shall be interpreted in a manner that, to the extent\n     possible, most closely approximates an absolute disclaimer and\n     waiver of all liability.\n\n\nSection 6 -- Term and Termination.\n\n  a. This Public License applies for the term of the Copyright and\n     Similar Rights licensed here. However, if You fail to comply with\n     this Public License, then Your rights under this Public License\n     terminate automatically.\n\n  b. Where Your right to use the Licensed Material has terminated under\n     Section 6(a), it reinstates:\n\n       1. automatically as of the date the violation is cured, provided\n          it is cured within 30 days of Your discovery of the\n          violation; or\n\n       2. upon express reinstatement by the Licensor.\n\n     For the avoidance of doubt, this Section 6(b) does not affect any\n     right the Licensor may have to seek remedies for Your violations\n     of this Public License.\n\n  c. For the avoidance of doubt, the Licensor may also offer the\n     Licensed Material under separate terms or conditions or stop\n     distributing the Licensed Material at any time; however, doing so\n     will not terminate this Public License.\n\n  d. Sections 1, 5, 6, 7, and 8 survive termination of this Public\n     License.\n\n\nSection 7 -- Other Terms and Conditions.\n\n  a. The Licensor shall not be bound by any additional or different\n     terms or conditions communicated by You unless expressly agreed.\n\n  b. Any arrangements, understandings, or agreements regarding the\n     Licensed Material not stated herein are separate from and\n     independent of the terms and conditions of this Public License.\n\n\nSection 8 -- Interpretation.\n\n  a. For the avoidance of doubt, this Public License does not, and\n     shall not be interpreted to, reduce, limit, restrict, or impose\n     conditions on any use of the Licensed Material that could lawfully\n     be made without permission under this Public License.\n\n  b. To the extent possible, if any provision of this Public License is\n     deemed unenforceable, it shall be automatically reformed to the\n     minimum extent necessary to make it enforceable. If the provision\n     cannot be reformed, it shall be severed from this Public License\n     without affecting the enforceability of the remaining terms and\n     conditions.\n\n  c. No term or condition of this Public License will be waived and no\n     failure to comply consented to unless expressly agreed to by the\n     Licensor.\n\n  d. Nothing in this Public License constitutes or may be interpreted\n     as a limitation upon, or waiver of, any privileges and immunities\n     that apply to the Licensor or You, including from the legal\n     processes of any jurisdiction or authority.\n\n\n=======================================================================\n\nCreative Commons is not a party to its public\nlicenses. Notwithstanding, Creative Commons may elect to apply one of\nits public licenses to material it publishes and in those instances\nwill be considered the “Licensor.” The text of the Creative Commons\npublic licenses is dedicated to the public domain under the CC0 Public\nDomain Dedication. Except for the limited purpose of indicating that\nmaterial is shared under a Creative Commons public license or as\notherwise permitted by the Creative Commons policies published at\ncreativecommons.org/policies, Creative Commons does not authorize the\nuse of the trademark \"Creative Commons\" or any other trademark or logo\nof Creative Commons without its prior written consent including,\nwithout limitation, in connection with any unauthorized modifications\nto any of its public licenses or any other arrangements,\nunderstandings, or agreements concerning use of licensed material. For\nthe avoidance of doubt, this paragraph does not form part of the\npublic licenses.\n\nCreative Commons may be contacted at creativecommons.org.\n"
        },
        {
          "name": "NOTICE.txt",
          "type": "blob",
          "size": 7.5576171875,
          "content": "==============================================================\n JanusGraph: Distributed Graph Database\n Copyright 2012 and onwards JanusGraph Authors\n==============================================================\n\nThis product includes software developed by JanusGraph contributors listed\nin CONTRIBUTORS.txt; JanusGraph copyright holders are listed in AUTHORS.txt.\n\nThis product is based on Titan, originally developed by Aurelius (acquired by\nDataStax) and the following individuals:\n\n * Matthias Broecheler\n * Dan LaRocque\n * Marko A. Rodriguez\n * Stephen Mallette\n * Pavel Yaskevich\n\nIt also includes software from other open source projects including, but not limited to (check pom.xml for complete listing):\n\n * Apache Cassandra [https://cassandra.apache.org/]\n * Apache Commons [https://commons.apache.org/]\n * Apache Groovy [http://groovy-lang.org/]\n * Apache HBase [https://hbase.apache.org/]\n * Apache Hadoop [https://hadoop.apache.org/]\n * Apache Kerby [https://github.com/apache/directory-kerby]\n * Apache Log4j [https://logging.apache.org/log4j]\n * Apache Lucene [https://lucene.apache.org/]\n * Apache Solr [https://lucene.apache.org/solr/]\n * Apache TinkerPop [https://tinkerpop.apache.org/]\n * Astyanax [https://github.com/Netflix/astyanax]\n * DataStax Driver for Apache Cassandra  [https://github.com/datastax/java-driver]\n * EasyMock [http://easymock.org/]\n * Elasticsearch [https://www.elastic.co/]\n * Google Cloud Bigtable [https://github.com/googlecloudplatform/cloud-bigtable-client]\n * Google Guava [https://github.com/google/guava]\n * HPPC [https://labs.carrotsearch.com/hppc.html]\n * JUnit [https://www.junit.org/]\n * Jackson [https://github.com/FasterXML/jackson]\n * Kryo [https://github.com/EsotericSoftware/kryo]\n * Metrics [https://metrics.dropwizard.io]\n * Mockito [https://site.mockito.org/]\n * Noggit [https://github.com/yonik/noggit]\n * OpenRDF [http://rdf4j.org/]\n * Oracle BerkeleyDB Java Edition [https://www.oracle.com/technetwork/products/berkeleydb/] (see license below)\n * Project Lombok [https://projectlombok.org/]\n * Reflections8 [https://github.com/aschoerk/reflections8]\n * SLF4J [https://www.slf4j.org/]\n * Spatial4j [https://github.com/locationtech/spatial4j]\n * Vavr [https://www.vavr.io/]\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\nCopyright (C) 2002, 2016, Oracle  and/or its affiliates. All rights reserved.\n\nLicensed under the Apache License, Version 2.0 (the \"License\") reproduced below or available at:\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\nADDITIONAL THIRD PARTY NOTICES:\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n/***\n * ASM: a very small and fast Java bytecode manipulation framework\n * Copyright (c) 2000-2005 INRIA, France Telecom\n * All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. Neither the name of the copyright holders nor the names of its\n *    contributors may be used to endorse or promote products derived from\n *    this software without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\n * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF\n * THE POSSIBILITY OF SUCH DAMAGE.\n */\n\n------------------------------------------------------------------------\nApache Cassandra\n------------------------------------------------------------------------\nApache Cassandra\nCopyright 2022 The Apache Software Foundation\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/db/SystemKeyspace.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/db/SystemKeyspace.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/cql3/CqlClientHelper.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/cql3/CqlClientHelper.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/cql3/CqlConfigHelper.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/cql3/CqlConfigHelper.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/cql3/CqlInputFormat.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/cql3/CqlInputFormat.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/cql3/CqlRecordReader.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/cql3/CqlRecordReader.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/cql3/LimitedLocalNodeFirstLocalBalancingPolicy.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/cql3/LimitedLocalNodeFirstLocalBalancingPolicy.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/ColumnFamilySplit.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/ColumnFamilySplit.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/ConfigHelper.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/ConfigHelper.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/HadoopCompat.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/HadoopCompat.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/hadoop/ReporterWrapper.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/hadoop/ReporterWrapper.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/schema/SchemaConstants.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/schema/SchemaConstants.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/utils/AbstractIterator.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/utils/AbstractIterator.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/utils/BiMultiValMap.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/utils/BiMultiValMap.java\n\ncassandra-hadoop-util/src/main/java/org/apache/cassandra/utils/Pair.java\nfrom\nhttps://github.com/apache/cassandra/blob/cassandra-4.0.6/src/java/org/apache/cassandra/utils/Pair.java\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.099609375,
          "content": "[![JanusGraph logo](janusgraph.png)](https://janusgraph.org/)\n\nJanusGraph is a highly scalable [graph database](https://en.wikipedia.org/wiki/Graph_database)\noptimized for storing and querying large graphs with billions of vertices and edges\ndistributed across a multi-machine cluster. JanusGraph is a transactional database that\ncan support thousands of concurrent users, complex traversals, and analytic graph queries.\n\n[![Downloads][downloads-shield]][downloads-link]\n[![Docker pulls][docker-pulls-img]][docker-hub-url]\n[![Maven][maven-shield]][maven-link]\n[![Javadoc][javadoc-shield]][javadoc-link]\n[![GitHub Workflow Status][actions-shield]][actions-link]\n[![Codecov][codecov-shield]][codecov-link]\n[![Mentioned in Awesome Bigtable][awesome-shield]][awesome-link]\n[![CII Best Practices][bestpractices-shield]][bestpractices-link]\n[![Codacy Badge][codacy-shield]][codacy-link]\n\n[actions-shield]: https://img.shields.io/github/actions/workflow/status/JanusGraph/janusgraph/ci-core.yml?branch=master\n[actions-link]: https://github.com/JanusGraph/janusgraph/actions\n[awesome-shield]: https://awesome.re/mentioned-badge-flat.svg\n[awesome-link]: https://github.com/zrosenbauer/awesome-bigtable\n[bestpractices-shield]: https://bestpractices.coreinfrastructure.org/projects/5064/badge\n[bestpractices-link]: https://bestpractices.coreinfrastructure.org/projects/5064\n[codacy-shield]: https://app.codacy.com/project/badge/Grade/850c7549ea72424486664ffc4f64f526\n[codacy-link]: https://www.codacy.com/gh/JanusGraph/janusgraph/dashboard?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=JanusGraph/janusgraph&amp;utm_campaign=Badge_Grade\n[maven-shield]: https://img.shields.io/maven-central/v/org.janusgraph/janusgraph-core.svg\n[maven-link]: https://central.sonatype.com/search?q=org.janusgraph\n[javadoc-shield]: https://javadoc.io/badge/org.janusgraph/janusgraph-core.svg?color=blue\n[javadoc-link]: https://javadoc.io/doc/org.janusgraph/janusgraph-core\n[downloads-shield]: https://img.shields.io/github/downloads/JanusGraph/janusgraph/total.svg\n[downloads-link]: https://github.com/JanusGraph/janusgraph/releases\n[codecov-shield]:https://codecov.io/gh/JanusGraph/janusgraph/branch/master/graph/badge.svg\n[codecov-link]:https://codecov.io/gh/JanusGraph/janusgraph\n[docker-pulls-img]: https://img.shields.io/docker/pulls/janusgraph/janusgraph.svg\n[docker-hub-url]: https://hub.docker.com/r/janusgraph/janusgraph\n\n## Learn More\n\nThe [project homepage](https://janusgraph.org) contains more information on JanusGraph and\nprovides links to documentation, getting-started guides and release downloads.\n\n## Visualization\n\nJanusGraph has a web-based graph visualizer located in [janusgraph-visualizer](https://github.com/JanusGraph/janusgraph-visualizer) \nrepository. \n\nIn additional to the web-based graph visualizer, JanusGraph supports a range of third party graph visualizers listed below:\n\n* [Arcade Analytics](https://arcadeanalytics.com/usermanual/#arcade-analytics)\n* [Cytoscape](https://www.cytoscape.org/)\n* [Gephi](https://tinkerpop.apache.org/docs/current/reference/#gephi-plugin)\n  plugin for Apache TinkerPop\n* [Graphexp](https://github.com/bricaud/graphexp)\n* [Graph Explorer](https://github.com/invanalabs/graph-explorer)\n* [Graphlytic](https://graphlytic.com/)\n* [Gremlin-Visualizer](https://github.com/prabushitha/gremlin-visualizer) - the original repository on which [JanusGraph-Visualizer](https://github.com/JanusGraph/janusgraph-visualizer) is based on.\n* [G.V() - Gremlin IDE](https://gdotv.com)\n* [KeyLines by Cambridge Intelligence](https://cambridge-intelligence.com/keylines/janusgraph/)\n* [Ogma by Linkurious](https://doc.linkurious.com/ogma/latest/tutorials/janusgraph/)\n* [ReGraph by Cambridge Intelligence](https://cambridge-intelligence.com/regraph/)\n* [Tom Sawyer Perspectives](https://www.tomsawyer.com/perspectives/)\n\n## Community\n\n* GitHub Discussions: see [`GitHub Discussions`](https://github.com/JanusGraph/janusgraph/discussions)\n  for all general discussions and questions about JanusGraph\n\n* Discord for interactive discussions and questions about JanusGraph: [Join the server](https://discord.gg/5n4fjv4QAf)\n\n* Stack Overflow: see the\n  [`janusgraph`](https://stackoverflow.com/questions/tagged/janusgraph) tag\n\n* Twitter: follow [@JanusGraph](https://twitter.com/JanusGraph) for news and\n  updates\n\n* LinkedIn: follow [JanusGraph](https://www.linkedin.com/company/janusgraph) for news and\n  updates\n\n* Mailing lists:\n\n  * **janusgraph-users (at) lists.lfaidata.foundation**\n    ([archives](https://lists.lfaidata.foundation/g/janusgraph-users/topics))\n    for questions about using JanusGraph, installation, configuration, integrations\n\n    To join with a LF AI & Data account, use the [web\n    UI](https://lists.lfaidata.foundation/g/janusgraph-users/join); to\n    subscribe/unsubscribe with an arbitrary email address, send an email to:\n\n    * janusgraph-users+subscribe (at) lists.lfaidata.foundation\n    * janusgraph-users+unsubscribe (at) lists.lfaidata.foundation\n\n  * **janusgraph-dev (at) lists.lfaidata.foundation**\n    ([archives](https://lists.lfaidata.foundation/g/janusgraph-dev/topics))\n    for internal implementation of JanusGraph itself\n\n    To join with a LF AI & Data account, use the [web\n    UI](https://lists.lfaidata.foundation/g/janusgraph-dev/join); to\n    subscribe/unsubscribe with an arbitrary email address, send an email to:\n\n    * janusgraph-dev+subscribe (at) lists.lfaidata.foundation\n    * janusgraph-dev+unsubscribe (at) lists.lfaidata.foundation\n\n  * **janusgraph-announce (at) lists.lfaidata.foundation**\n    ([archives](https://lists.lfaidata.foundation/g/janusgraph-announce/topics))\n    for new releases and news announcements\n\n    To join with a LF AI & Data account, use the [web\n    UI](https://lists.lfaidata.foundation/g/janusgraph-announce/join); to\n    subscribe/unsubscribe with an arbitrary email address, send an email to:\n\n    * janusgraph-announce+subscribe (at) lists.lfaidata.foundation\n    * janusgraph-announce+unsubscribe (at) lists.lfaidata.foundation\n\n## Contributing\n\nPlease see [`CONTRIBUTING.md`](CONTRIBUTING.md) for more information, including\nCLAs and best practices for working with GitHub.\n\n## Powered by JanusGraph\n\n* [Apache Atlas](https://github.com/apache/atlas) - metadata management for governance ([website](https://atlas.apache.org/))\n* [Eclipse Keti](https://github.com/eclipse/keti) - access control service to protect RESTful APIs ([website](https://projects.eclipse.org/projects/iot.keti))\n* [Exakat](https://github.com/exakat/exakat) - PHP static analysis ([website](https://www.exakat.io/))\n* [Open Network Automation Platform (ONAP)](https://www.onap.org/) - automation and orchestration for Software-Defined Networks\n- [Uber Knowledge Graph](https://www.youtube.com/watch?v=C01Gh0g01JE) ([event info](https://leap.ai/events/2017/08/06/uber_knowledge_graph))\n- [Express-Cassandra](https://github.com/masumsoft/express-cassandra) - Cassandra ORM/ODM/OGM for Node.js with optional support for Elassandra & JanusGraph\n* [Windup](https://github.com/windup/windup) by RedHat - application migration and assessment tool ([website](https://developers.redhat.com/products/rhamt/overview/))\n\n## Users\n\nThe following users have deployed JanusGraph in production.\n\n* [CELUM](https://www.celum.com/)\n* [Crédit Agricole CIB](https://www.ca-cib.com/) - [use case](https://github.com/JanusGraph/janusgraph/discussions/2734)\n* [eBay](https://www.ebay.com/) - [video](https://youtu.be/EtB1BPG00PE)\n* [FiNC](https://finc.com)\n* [G DATA](https://gdatasoftware.com) - [blog post series about malware analysis use case](https://www.gdatasoftware.com/blog/2018/11/31203-malware-analysis-with-a-graph-database)\n* [Netflix](https://www.netflix.com) -\n  [video](https://youtu.be/KSmAdtMJYEo?t=1h2m17s) and\n  [slides](https://www.slideshare.net/RoopaTangirala/polyglot-persistence-netflix-cde-meetup-90955706#86) (graph discussion starts at #86)\n* [Qihoo 360](https://www.360.cn/) ([about](https://en.wikipedia.org/wiki/Qihoo_360))\n* [Red Hat](https://www.redhat.com/) - [application migration and assessment tool](https://developers.redhat.com/products/rhamt/overview/) built on [Windup](https://github.com/windup/windup)\n* [Times Internet](https://timesinternet.in)\n* [Uber](https://uber.com)\n"
        },
        {
          "name": "RELEASING.md",
          "type": "blob",
          "size": 17.111328125,
          "content": "# Releasing JanusGraph\n\nThere are two possible ways of making a JanusGraph release:\n- **Automatic** - Partially automated release via GitHub actions. This is a preferred way of making a release.\n- **Manual** - Fully manual release. This is a deprecated way of making a release. This way should only be used if \nthere is a problem of using GitHub actions, or you need to compile `jar` artifacts via a custom version of Java which\nisn't available in `setup-java` GitHub action.\n\n## General prerequisites: Sonatype account\n\nThe release artifacts will be deployed into Sonatype OSS with the Maven deploy plugin.\nYou must have an account with Sonatype, and it must be associated with the JanusGraph org.\nSee the relevant issue [here.](https://issues.sonatype.org/browse/OSSRH-28274)\n\n# Release Checklist\n\n* [ ] Start up new `[DISCUSS]` thread on janusgraph-dev with suggestions on what should be included in the release and target date\n* [ ] Make sure all PRs and issues added since last release are associated to the milestone\n* [ ] Complete all items associated with milestone or move outstanding items to a new milestone if necessary\n* [ ] Create Pull Requests with version updates\n* [ ] Validate all changes have been merged upstream\n* [ ] Push a release tag\n* [ ] **For Manual release flow only** Run Deploy to create [Sonatype](https://oss.sonatype.org/#welcome) staging repository and Generate artifacts for release page\n* [ ] **For Manual release flow only** Create a draft release and upload artifacts to it\n* [ ] Update release description of draft release\n* [ ] Close the staging repository in [Sonatype](https://oss.sonatype.org/#stagingRepositories)\n* [ ] Convert draft release to a public pre-release\n* [ ] Create `[VOTE]` [janusgraph-dev](https://lists.lfaidata.foundation/g/janusgraph-dev) vote thread and [get required votes of 3 TSC members](https://www.apache.org/foundation/voting.html)\n* [ ] Release the staging repository in Sonatype\n* [ ] Remove pre-release label on the [releases page](https://github.com/JanusGraph/janusgraph/releases/)\n* [ ] Announce the new release\n* [ ] Prepare the next SNAPSHOT release\n* [ ] Document lessons learned\n\n## Prerequisites [for Manual release flow only]\n\n**Skip this entire section if you are using **Automatic** release flow.**\n\nThe release process has only been tested on Linux and macOS.\nThe following tools must be installed.\n\n*   [gpg](https://www.gnupg.org/) - Requires a running agent.\n\n### GPG Signing Key\n\nThe JanusGraph artifacts are signed with a GPG signature.  \nIf you don't already have a GPG signing key included with the `KEYS` file, you will need to create one and update the `KEYS` file.  \nIf you already have your key included into `KEYS` file then skip this step.  \nGo to [releases](https://github.com/JanusGraph/janusgraph/releases) and download the `KEYS` file (which is located in Assets) from the latest release.  \nGenerate your key:\n```Shell\ngpg --full-generate-key\n```\nSelect:\n*   RSA and RSA\n*   4096 bits\n*   no expiration\n*   comment: `CODE SIGNING KEY`\n\nAdd your key to the KEYS file:\n```Shell\n(gpg --list-sigs <key id> && gpg --armor --export <key id>) >> KEYS.\n```\n\nOnce your key has been created and added to the KEYS file it needs to be published to a public key server.\nYou can upload to multiple key servers within the pool or use an alternate if `pgp.mit.edu` is down.\n[Sonatype typically uses](https://central.sonatype.org/publish/requirements/gpg/#distributing-your-public-key) the\nfollowing key servers: `keyserver.ubuntu.com`, `keys.openpgp.org`, `pgp.mit.edu`.\n\n```Shell\ngpg --keyserver <key server> --send-keys <key id>\n```\n\nExample:\n\n```Shell\ngpg --keyserver pgp.mit.edu --send-keys 7F87F9BD4D9F71A6\n```\n\n### Configure Maven for server passwords\n\nThe release artifacts will be uploaded into a staging directory on Sonatype OSS.\nIf you do not configure Maven with your server passwords, the Maven deploy plugin will run into a 401 Unauthorized error.\nSteps below were taken from [this guide.](https://maven.apache.org/guides/mini/guide-encryption.html)\n\n*   Create a master password: `mvn --encrypt-master-password`\n*   Add the master password to `$HOME/.m2/settings-security.xml`\n\n```xml\n<settingsSecurity>\n  <master>{master password}</master>\n</settingsSecurity>\n```\n\n**Notice:** The password and the encapsulating braces `{}` should be placed into the `<master>` tag. Example: `<master>{1234567ABCDEFG}</master>`\n\n*   Once the master password has been added to `$HOME/.m2/settings-security.xml` ,encrypt a server password: `mvn --encrypt-password`\n*   Create `$HOME/.m2/settings.xml` using your Sonatype username and encrypted server password\n\n```xml\n<settings>\n  <servers>\n    <server>\n      <id>ossrh</id>\n      <username>{sonatype username}</username>\n      <password>{encrypted sonatype password}</password>\n    </server>\n  </servers>\n</settings>\n```\n\n### GPG passphrase\n\nYou can pass it as a command line parameter to Maven with `-Dgpg.passphrase=$GPG_PASS`.\nYou can also encrypt the gpg key with `mvn --encrypt-password` and add it to `$HOME/.m2/settings.xml` as shown below.\nYou may still have to enter your GPG passphrase once.\nOtherwise, you will have to type in your gpg passphrase many times when prompted during the build.\n\n```xml\n<settings>\n   <servers>\n    <server>\n      <id>ossrh</id>\n        <username>{sonatype username}</username>\n        <password>{encrypted sonatype password}</password>\n    </server>\n  </servers>\n  <profiles>\n    <profile>\n      <id>gpg</id>\n      <properties>\n        <gpg.executable>gpg</gpg.executable>\n        <gpg.passphrase>{encrypted gpg passphrase}</gpg.passphrase>\n      </properties>\n    </profile>\n  </profiles>\n  <activeProfiles>\n    <activeProfile>gpg</activeProfile>\n  </activeProfiles>\n</settings>\n```\n\n# Release Steps\n\n### Create discussion thread\n\nIt is recommended to use previous releases as a template.\nHere is a [link](https://groups.google.com/d/msg/janusgraph-dev/BGaCCH1cTCE/gR8OGm32AQAJ) to the discussion thread for the 0.2.1 release.\nIt's important to highlight what outstanding work items should make it into the release and to establish a release manager.\n\n### Clean up release tags\n\nGo through all the commits that were added since the previous release and make sure they are correctly tagged with the current release.\nAny issues closed as a result of those commits should be tagged as part of the release as well.\n\n### Finalize all outstanding work items\n\nBefore submitting a pull request with updated version numbers ensure that everything in the [release milestone](https://github.com/JanusGraph/janusgraph/milestones) is closed out.\nAny outstanding pull requests that will need to be re-targeted at future milestone.\n\n### Create Pull Requests with version updates\n\nBefore any artifacts can be generated and vote can be made the version number will need to be updated in the pom.xml files.\n\nMake sure the latest support release version in `.github/workflows/docker-release.yml` is correct.\n\n#### Update configuration reference documentation\n\n```Shell\nmvn --quiet clean install -DskipTests=true -pl janusgraph-doc -am\n```\n\n#### Update release version\n\nThis command will remove `SNAPSHOT` from all versions in `pom` files.\n\n```Shell\nmvn versions:set -DremoveSnapshot=true -DgenerateBackupPoms=false\n```\n\nAfter the version has been set, update the scm tag by opening the main `pom.xml` and changing `<tag>HEAD</tag>` to match the release tag.  \nExample: `<tag>v0.3.2</tag>`\n\n#### Update version-sensitive files\n\nUpdate version-sensitive files in the root and documentation sources in the `docs` subdirectory:\n\n* `docs/changelog.md` - Add / finalize release section\n* `mkdocs.yml` - Update `latest_version` and check all others package versions. \n* `.github/workflows/docker-release-tags.yml` - if you are publishing **latest** minor of major release you should also update `LATEST_RELEASE` in the file (ignoring patch version). This is temporary until the process is automated (see [issue #3905](https://github.com/JanusGraph/janusgraph/issues/3905)).\n\nYou may also need to update the following files in the main repo for any new or updated dependencies:\n\n*   `NOTICE.txt`\n\n#### Create a release commit\n\nCreate a release commit:\n```Shell\ngit commit -m \"JanusGraph release <version> [cql-tests] [tp-tests]\" -s\n```\n\n#### Create the Pull Request\n\nOpen up pull requests for the version updates.\nIt is recommended to add `[tp-tests]` to the commit message so the TinkerPop test suite will run.\nAfter the updates are approved and merged, continue on with the release process.\n\n### Push version related tag\n\nCreate a release tag with the next command:\n```Shell\ngit tag -a <release tag> -m \"\"\n```\nThe release tag should follow the next pattern: **v.\\<major\\>.\\<minor\\>.\\<patch\\>**.\nExample:\n```Shell\ngit tag -a v0.3.2 -m \"\"\n```\nPush tag to JanusGraph remote repository (usually `upstream`):\n```Shell\ngit push upstream <release tag>\n```\n\nIn case of any changes into the release happens after the tag is pushed you will need to remove the tag, associate it \nwith a new commit and push it again. After that proceed from the following step again:\n```Shell\ngit tag --delete <release tag>\ngit push upstream :<release tag>\ngit tag -a <release tag> -m \"\"\ngit push upstream <release tag>\n```\n\n### Build Release Artifacts [for Manual release flow only]\n\n**If you are using Automatic release flow skip this section.**\n\n* Pull down the latest, merged code from GitHub.\n* Stash any uncommitted changes.\n* Delete untracked files and directories.\n\n```Shell\ngit fetch\ngit pull\ngit stash save\ngit clean -fdx\n```\n\n* Deploy all jars (including javadoc and sources) and all signatures for jars to a staging repository on Sonatype. Notice, this step includes 2 separate commands. The first command will clean repository before generating artifacts and the second command will deploy those generated artifacts. You should not change anything in the repository or run `clean` between the first and the second commands.\n```Shell\nmvn clean install -Pjanusgraph-release -DskipTests=true\nmvn deploy -Pjanusgraph-release -DskipTests=true\n```\n\n* Install MkDocs if not installed. It is needed to build documentation.\n1. Install `python3` and `pip3` (the newest version of pip) \n    * You can also checkout the installation guide of [material-mkdocs](https://squidfunk.github.io/mkdocs-material/getting-started/)\n2. Install requirements using `pip3 install -r requirements.txt`\n\n*   Prepare files for GitHub release\n```Shell\nexport JG_VER=\"janusgraph-0.5.0\"\nexport JG_FULL_VER=\"janusgraph-full-0.5.0\"\nmkdir -p ~/jg-staging\ncp janusgraph-dist/target/${JG_VER}.zip* ~/jg-staging/\ncp janusgraph-dist/target/${JG_FULL_VER}.zip* ~/jg-staging/\nmkdocs build\nmv site ${JG_VER}-doc\nzip -r ${JG_VER}-doc.zip ${JG_VER}-doc\ngpg --armor --detach-sign ${JG_VER}-doc.zip\ncp ${JG_VER}-doc.zip* ~/jg-staging/\n```\n\nIf it fails due to Inappropriate ioctl for device error, run:\n```Shell\nexport GPG_TTY=$(tty)\n```\n\n*   Verify signature validity (both commands should show good signature)\n```Shell\ncd ~/jg-staging\ngpg --verify ${JG_VER}.zip.asc ${JG_VER}.zip\ngpg --verify ${JG_FULL_VER}.zip.asc ${JG_FULL_VER}.zip\ngpg --verify ${JG_VER}-doc.zip.asc ${JG_VER}-doc.zip\n```\n\n### Create a Draft Release on GitHub\n\n#### For Automatic release flow\n\nIf you are using Automatic release flow your draft release will be created automatically, \nand it will be populated with all necessary release artifacts. Notice, you will need to wait for the `ci-publish.yml` \naction to be finished after your tag is submitted (Usually it takes about 10-15 minutes for this CI to be finished) for \nthe draft release to be created.  \nYou will need to change the body of the draft release and replace `*MILESTONE_NUMBER*` with the correct milestone number \nassociated to the release. You will also need to add `Notable new features`, `Tested Compatibility`,\n`Installed versions in the Pre-Packaged Distribution`, and `Contributors` to the release body.\nUse the previous releases as a template.\nThe versions can be copied from the changelog.\nYou need to manually determine and mark the first-time contributors.\n\nIt is recommended to keep the release in draft status until you're ready to start a vote.\n\nNotice, if your release is already created due to re-submitting the tag again the body of your release will not be changed.  \nOnly the associated artifacts will be replaced with the new artifacts. You will also need to drop previous Sonatype staging release.  \n\n#### For Manual release flow\n\nWhile logged into GitHub go to the [JanusGraph releases page](https://github.com/JanusGraph/janusgraph/releases/) and click the `Draft a new release` button.\nSupply the tag number, target branch, and title.  \nFor the description use the previous releases as a template and update the tested versions accordingly.  \nAll the artifacts that were created and moved to `~/jg-staging/` in the previous step need to be added to the draft release.  \nBe sure to mark it as `pre-release`.  \nIt is recommended and keep the release in draft until you're ready to start a vote.  \nIn addition to the artifacts in `~/jg-staging/` a `KEYS` file must also be added to the release.  \n\n### Close the staging repository\n\nLog into [Sonatype](https://oss.sonatype.org/#welcome) and select Staging Repositories under Build Promotion.\nIf you recently uploaded you can easily find your staged release by doing a descending sort.\nVerify that the contents look complete and then check the release before clicking close.\n\nThis step will run verification on all the artifacts.\nIn particular, this will verify that all the artifacts have a valid GPG signature.\nIf this step fails, there are changes that must be made before starting the vote.\n\n### Create a `[VOTE]` Thread\nOnce all the artifacts have been upload to the GItHub releases page and the staging repository has been populated and closed it's time to create a `[VOTE]` thread.  \nHere is an example [vote thread from JanusGraph 0.3.1](https://groups.google.com/d/msg/janusgraph-dev/iV8IsUqhcnw/74p3Y7lNAAAJ) that can be used as a template.  \nSimilar to the [Apache release voting policy](https://www.apache.org/foundation/voting.html#ReleaseVotes) a release vote requires 3 TSC members to pass.  \nSee the documentation on the [JanusGraph release policy](https://docs.janusgraph.org/development/#release-policy) for more information.  \n\n### Finalize the Release\n\n*This is the point of no return.* After releasing artifacts to Maven\nCentral and pushing history to the public GitHub repo, the release\ncan't be canceled. \n\n### Release the staging repository\n\nWhen the vote is complete and successful, it is time to finalize the release.  \nLog into Sonatype and select the [staging repository](https://oss.sonatype.org/#stagingRepositories) that was closed previously.  \nOnce the release is selected click `Release`.  \nThe staging directory should be automatically deleted after the release is completed.  \nThe release artifacts will be synched over to Maven Central in about 2 hours.  \n\n### Create a new branch if needed\n\nIn case the release was happening in `master` branch (which is used for `latest` minor or major version), \nyou need to create a new branch in the format `v${major_version}.${minor_version}` (the patch version is ignored).\nAlso, if it's a new major release, ensure the branch is protected by going to [Branch protection rules](https://github.com/JanusGraph/janusgraph/settings/branches) \nand creating the same protection rules as were used for `master` branch.\nThis step is necessary to ensure that the next commit (snapshot restoration commit) triggers documentation build process \nand the new branch name will be added into the documentation's dropdown menu as the latest release. \n\n### Prepare the next snapshot release\n\n```Shell\n mvn versions:set -DnewVersion=0.3.0-SNAPSHOT -DgenerateBackupPoms=false\n```\n\nRestore the `<scm>` to `<tag>HEAD</tag>` in the root `pom.xml` file.\nAlso update `snapshot_version` in the `mkdocs.yml`.\nIf you had created a new branch, ensure you also update `targetBranchChoices` in the `.backportrc.json` and `labels` in `.github/dependabot.yml`.\nThese changes can be pushed with a CTR commit.\n\n### Update from pre-release to release\n\nEdit the release on GitHub and uncheck the box for pre-release.\nVerify that on the release page that the release is now labeled \"Latest Release\".\n\n### Announce the new release\n\nOnce it has been verified that the artifacts have populated in Nexus the release manager should announce the release in [janusgraph-user](https://lists.lfaidata.foundation/g/janusgraph-users), [janusgraph-dev](https://lists.lfaidata.foundation/g/janusgraph-dev) and [janusgraph-announce](https://lists.lfaidata.foundation/g/janusgraph-announce).  \nHere is an [example announcement thread](https://lists.lfaidata.foundation/g/janusgraph-dev/topic/announce_janusgraph_0_6_0/85417137).\n\nAfter announcing the release on our mailing lists, also announce it on Twitter and Discord.\nPast announcements can also be used there as an inspiration.\nMake sure that you *publish* the post in the Discord announcement channel.\nThis will allow other Discord servers to consume our announcements.\n\n### Document lessons learned\n\nIf you find anything incorrect or incomplete in this document during the process of preparing a release it is important to feed that information back into the community.\nFine details should be added to this document, while high level items could merit updates to the [releasing policy.](https://docs.janusgraph.org/development/#release-policy)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.59375,
          "content": "# Security Policy\n\n## Supported Versions\n\n[Currently supported versions](https://docs.janusgraph.org/changelog/#currently-supported) of JanusGraph\ncontinue to receive security updates. If you are using an older version of JanusGraph that is no longer\nsupported, please update to a supported version to continue to receive security updates.\n\n## Reporting a Vulnerability\n\nPlease report security vulnerabilities privately to the JanusGraph Technical Steering Committee (TSC) by sending\nan email to: **security (at) janusgraph.org**  — please do not post security vulnerabilities to the public issue\ntracker.\n"
        },
        {
          "name": "TESTING.md",
          "type": "blob",
          "size": 9.8447265625,
          "content": "# Testing JanusGraph\n\n## Audience of this Document\n\nThis page is written for developers familiar with Java, JanusGraph, and Maven who want information on how to run JanusGraph's test suite.\n\n## Overview\n\nJanusGraph runs all tests using JUnit.  To compile, package, and run the default test suite for JanusGraph, use the standard `mvn clean install` command.\n\nJanusGraph has a specialty tests, disabled by default, intended to generate basic performance metrics or stress its cache structures under memory pressure.  The next section describes how JanusGraph's tests are internally categorized and the Maven options that enabled/disable test categories.\n\n## Continuous Integration\n\nJanusGraph runs continuous integration via Github Actions; see the [dashboard](https://github.com/JanusGraph/janusgraph/actions) for current status.\n\n## JUnit\n\n### JUnit Test Tags\n\nAll of JanusGraph's tests are written for JUnit.  JanusGraph's JUnit tests are annotated with the following [JUnit Tags](https://junit.org/junit5/docs/current/user-guide/#writing-tests-tagging-and-filtering):\n\n\n| Category Name | Maven Property | Default | Comment |\n| ------------- | ------------------- |:------------:| ------- |\n| MEMORY_TESTS | test.skip.mem | true (disabled) | Tests intended to exert memory pressure |\n| PERFORMANCE_TESTS | test.skip.perf | true (disabled) | Tests written as simple speed tests|\n| (No&nbsp;tag) | test.skip.default | false (enabled) | Tests without any Tag annotations |\n\n**Tag Name** above is a Java interface defined in the package [org.janusgraph.testcategory](janusgraph-backend-testutils/src/main/java/org/janusgraph/TestCategory.java).  These interfaces appear as arguments to the JUnit `@Tag(...)` annotation, e.g. `@Tag(TestCategory.MEMORY_TESTS)`.\n\n**Maven Property** above is a boolean-valued pom.xml property that skips the associated test tag when true and executes the associated test tag when false.  The default values defined in pom.xml can be overridden on the command-line in the ordinary Maven way, e.g. `mvn -Dtest.skip.mem=false test`.\n\n*Implementation Note.*  The Maven property naming pattern \"test.skip.x=boolean\" is needlessly verbose, a cardinal sin for command line options.  A more concise alternative would be \"test.x\" with the boolean sense negated.  However, this complicates the pom.xml configuration for the Surefire plugin since it precludes direct use of the Surefire plugin's `<skip>` configuration tag, as in `<skip>${test.skip.perf}</skip>`.  There doesn't seem to be a straightforward way to negate a boolean or otherwise make this easy, at least without resorting to profiles or a custom plugin, though I might be missing something.  Also, the mold is arguably already set by Surefire's \"maven.test.skip\" property, though that has slightly different interpretation semantics than the properties above.\n\n### Marking tests as flaky\n\nIf a test should be marked as flaky, then first [open an issue](https://github.com/JanusGraph/janusgraph/issues/new?assignees=&labels=testing%2Fflaky&projects=&template=flaky-test.md)\nwhere you can add information about the flaky test that could be helpful later to others to understand why the test is\nmarked as flaky and hopefully for fixing it.\nAfterwards, add the annotation to the test and link to the issue you just created:\n\n```java\n// flaky test: https://github.com/JanusGraph/janusgraph/issues/[ISSUE_NUMBER]\n@RepeatedIfExceptionsTest(repeats = 3)\npublic void testFlakyFailsSometimes(){}\n```\n\n### Marking tests to require certain Features from StoreManager\n\nA test can be annotated that a test is only execute, if the StoreManager support this feature.\n\n```java\n@FeatureFlag(feature = JanusGraphFeature.UnorderedScan)\npublic void testRequiresUnorderedScanOnDatabase(){}\n```\n\n| Feature flag  | Required feature                   |\n| ------------- | ---------------------------------- |\n| UnorderedScan | `StoreFeatures.hasUnorderedScan()` |\n| OrderedScan   | `StoreFeatures.hasOrderedScan()`   |\n| CellTtl       | `StoreFeatures.hasCellTtl()`       |\n\n## Running a Single Test via Maven\n\nThe standard maven-surefire-plugin option applies for most tests:\n\n```bash\nmvn test -Dtest=full.or.partial.classname#methodname\n```\n\nHowever, MEMORY_TESTS and PERFORMANCE_TESTS are disabled by default regardless of whatever `-Dtest=...` option might be specified.  When running a single MemoryTest or PerformanceTest, specify `-Dtest.mem=true` or `-Dtest.perf=true` as appropriate for the test in question.\n\nHere's a concrete example.\n\n```bash\n# Executes no tests because the MEMORY_TESTS category is disabled by default\nmvn test -Dtest=BerkeleyJEGraphPerformanceMemoryTest\n# Executes the specified test\nmvn test -Dtest=BerkeleyJEGraphPerformanceMemoryTest -Dtest.skip.mem=false\n```\n\n## Running Solr Tests\n\n**Note** Running Solr tests require Docker.\n\nSolr tests run against an external Solr instance. The default test version will be the same as the Solr client version.\n\n```bash\nmvn clean install -pl janusgraph-solr\n```\n\nAdditional Maven profiles are defined for testing against default versions of other supported major Solr releases.\n(Currently, only Solr 8 are supported.)\n\n```bash\nmvn clean install -pl janusgraph-solr -Psolr8\n```\n\nFinally the `solr.docker.version` property can be used to test against arbitrary Solr versions.\n\n```bash\nmvn clean install -pl janusgraph-solr -Dsolr.docker.version=8.0.0\n```\n\n## Running Elasticsearch Tests\n\n**Note** Running Elasticsearch tests require Docker.\n\nElasticsearch tests run against an external Elasticsearch instance. The default test version will be the same as the Elasticsearch client version.\n\n```bash\nmvn clean install -pl janusgraph-es\n```\n\nAdditional Maven profiles are defined for testing against default versions of other supported major Elasticsearch releases.\n\n```bash\nmvn clean install -pl janusgraph-es -Pelasticsearch5\n```\n\nFinally the `elasticsearch.docker.version` property can be used to test against arbitrary Elasticsearch versions >= `5.0.0`. This is more complicated however because of differences across major versions in required server settings and Docker image names. The examples below illustrate the differences based on the Elasticsearch major version.\n\n```bash\nmvn clean install -pl janusgraph-es -Delasticsearch.docker.version=5.3.2\nmvn clean install -pl janusgraph-es -Delasticsearch.docker.image=elasticsearch\nmvn clean install -pl janusgraph-es -Delasticsearch.docker.version=6.0.0 -Delasticsearch.docker.image=elasticsearch\n```\n\n## Running CQL Tests\n\n**Note** Running CQL tests require Docker.\n\nCQL tests are executed using [testcontainers-java](https://www.testcontainers.org/).\nCQL tests can be executed against a Cassandra 3 using the profile `cassandra3`, or a Scylla 3 using the profile `scylladb`.\n\n```bash\nmvn clean install -pl janusgraph-cql -Pcassandra3-murmur\nmvn clean install -pl janusgraph-cql -Pscylladb\n```\n\n### Special versions of Cassandra\n\nSystem properties to configure CQL test executions:\n\n| Property                                     | Description                                                                                                                                 | Default value |\n|----------------------------------------------|---------------------------------------------------------------------------------------------------------------------------------------------|---------------|\n| `cassandra.docker.image`                     | Docker image to pull and run.                                                                                                               | `cassandra`   |\n| `cassandra.docker.version`                   | Docker image tag to pull and run                                                                                                            | `3.11.10`     |\n| `cassandra.docker.partitioner`               | Set the cassandra partitioner. Supported partitioner are `murmur`, or `byteordered`                                                         | `murmur`      |\n| `cassandra.docker.useSSL`                    | Activate SSL **Note: This property currently only works with the partitioner set to `murmur`.**                                             | `false`       |\n| `cassandra.docker.useDefaultConfigFromImage` | If set to `true` default configs of the image are used. **Note: `cassandra.docker.partitioner` and `cassandra.docker.useSSL` are ignored.** | `false`       |\n\nThe following examples show possible configuration combinations.\n\n```bash\nmvn clean install -pl janusgraph-cql -Dcassandra.docker.version=2.2.14\nmvn clean install -pl janusgraph-cql -Dcassandra.docker.image=cassandra\nmvn clean install -pl janusgraph-cql -Dcassandra.docker.image=cassandra -Dcassandra.docker.version=3.11.2\n```\n\n### TinkerPop tests\n\nThe CQL backend is tested with TinkerPop tests using following command.\n\n**Note: Profiles are not supported during running TinkerPop tests.\nIf you do not want to use the default config, you can set `cassandra.docker.image`,\n`cassandra.docker.version`, or `cassandra.docker.partitioner`.**\n\n```bash\nmvn clean install -Dtest.skip.tp=false -DskipTests=true -pl janusgraph-cql \\\n  -Dcassandra.docker.partitioner=murmur -Dcassandra.docker.version=2.2.14\n```\n\n### Create new configuration files for new Versions of Cassandra\n\nThe file `janusgraph-cql/src/test/resources/docker/docker-compose.yml` can be used to generate new configuration files.\nTherefore, you have to start a Cassandra instance using `docker-compose up`.\nAfterward, you can extract the configuration which is located in the following file `/etc/cassandra/cassandra.yaml`.\n\n## Running hbase tests\n\n**Note** Running HBase tests require Docker.\n\n### Special versions of HBase\n\nSystem properties to configure HBase test executions:\n\n| Property | Description | Default value |\n| -------- | ----------- | ------------- |\n| `hbase.docker.version` | HBase version to be used in the docker image. | `2.6.0` |\n| `hbase.docker.uid` | Uid used to run inside HBase of the container | 1000 |\n| `hbase.docker.gid` | Gid used to run inside HBase of the container | 1000 |\n"
        },
        {
          "name": "cassandra-hadoop-util",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs.Dockerfile",
          "type": "blob",
          "size": 0.7802734375,
          "content": "#\n# Copyright 2019 JanusGraph Authors\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n\nFROM python:3.12\n\nENV PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/root/.local/bin\n\nCOPY requirements.txt /mkdocs/\nWORKDIR /mkdocs\nVOLUME /mkdocs\n\nRUN pip3 install --user -r requirements.txt\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-all",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-backend-testutils",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-benchmark",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-berkeleyje",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-bigtable",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-core",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-cql",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-dist",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-driver",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-es",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-grpc",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-hadoop",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-hbase",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-inmemory",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-lucene",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-mixed-index-utils",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-scylla",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-server",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-solr",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph-test",
          "type": "tree",
          "content": null
        },
        {
          "name": "janusgraph.png",
          "type": "blob",
          "size": 14.103515625,
          "content": null
        },
        {
          "name": "mkdocs.yml",
          "type": "blob",
          "size": 8.388671875,
          "content": "\n# Copyright 2019 JanusGraph Authors\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n\nsite_name: JanusGraph\n\nrepo_name: 'JanusGraph'\nrepo_url: 'https://github.com/janusgraph/janusgraph'\n\ncopyright: 'Copyright &copy; 2023 JanusGraph Authors. All rights reserved.<br> The Linux Foundation has registered trademarks and uses trademarks. For a list of<br> trademarks of The Linux Foundation, please see our <a href=\"https://www.linuxfoundation.org/trademark-usage\">Trademark Usage</a> page.<br> Cassandra, Groovy, HBase, Hadoop, Lucene, Solr, and TinkerPop are trademarks of the Apache Software Foundation.<br> Berkeley DB and Berkeley DB Java Edition are trademarks of Oracle.'\n\nplugins:\n  - search\n  - macros\n  - include-markdown\n  - redirects:\n      redirect_maps:\n        basics/common-questions.md: common-questions.md\n        basics/cache.md: operations/cache.md\n        basics/technical-limitations.md: advanced-topics/technical-limitations.md\n        basics/transaction-log.md: advanced-topics/transaction-log.md\n        basics/configuration.md: configs/index.md\n        basics/schema.md: schema/index.md\n        basics/gremlin.md: getting-started/gremlin.md\n        basics/server.md: operations/server.md\n        basics/deployment.md: operations/deployment.md\n        basics/configured-graph-factory.md: operations/configured-graph-factory.md\n        basics/multi-node.md: operations/dynamic-graphs.md\n        interactions/transactions.md: basics/transactions.md\n        basics/configuration-reference.md: configs/configuration-reference.md\n        basics/example-config.md: configs/example-config.md\n        index-management/index-performance.md: schema/index-management/index-performance.md\n        index-management/index-lifecycle.md: schema/index-management/index-lifecycle.md\n        index-management/index-reindexing.md: schema/index-management/index-reindexing.md\n        index-management/index-removal.md: schema/index-management/index-removal.md\n        index-backend/search-predicates.md: basics/search-predicates.md\n        connecting/index.md: basics/connecting/index.md\n        connecting/java.md: basics/connecting/java.md\n        connecting/python.md: basics/connecting/python.md\n        connecting/dotnet.md: basics/connecting/dotnet.md\n        interactions/search-predicates.md: basics/search-predicates.md\n        interactions/connecting/index.md: basics/connecting/index.md\n        interactions/connecting/java.md: basics/connecting/java.md\n        interactions/connecting/python.md: basics/connecting/python.md\n        interactions/connecting/dotnet.md: basics/connecting/dotnet.md\n        advanced-topics/bulk-loading.md: operations/bulk-loading.md\n        advanced-topics/advschema.md: schema/advschema.md\n        advanced-topics/schema-init-strategies.md: schema/schema-init-strategies.md\n        advanced-topics/monitoring.md: operations/monitoring.md\n        advanced-topics/migrating-titan.md: operations/migrating-titan.md\n        advanced-topics/migrating-thrift.md: operations/migrating-thrift.md\n        advanced-topics/recovery.md: operations/recovery.md\n        appendices.md: operations/management.md\n\ntheme:\n  language: 'en'\n  name: 'material'\n  features:\n    - navigation.footer\n    - navigation.sections\n  palette:\n    primary: 'green'\n    accent: 'teal'\n  font: false\n  logo: 'janusgraph-logomark.svg'\n  favicon: 'favicon.ico'\n\nextra_css:\n  - 'theme/extra.css'\nextra_javascript:\n  - 'theme/js/structor-menu.js'\n\nextra:\n  social:\n    - icon: fontawesome/brands/github\n      link: https://github.com/janusgraph\n    - icon: fontawesome/brands/discord\n      link: https://discord.gg/5n4fjv4QAf\n    - icon: fontawesome/brands/x-twitter\n      link: https://twitter.com/janusgraph\n    - icon: fontawesome/brands/linkedin\n      link: https://www.linkedin.com/company/janusgraph\n    - icon: fontawesome/solid/envelope\n      link: https://lists.lfaidata.foundation/g/janusgraph-users\n    - icon: fontawesome/solid/envelope\n      link: https://lists.lfaidata.foundation/g/janusgraph-dev\n  latest_version: 1.1.0\n  snapshot_version: 1.2.0-SNAPSHOT\n  tinkerpop_version: 3.7.3\n  hadoop_version: 3.3.6\n\nmarkdown_extensions:\n  - pymdownx.superfences\n  - pymdownx.blocks.details\n  - pymdownx.blocks.tab:\n      alternate_style: true\n  - markdown.extensions.admonition\n  - markdown.extensions.codehilite:\n      linenums: True\n  - codehilite\n  - attr_list\n  - def_list\n\nnav:\n  - Introduction: index.md\n  - Getting Started:\n    - Installation: getting-started/installation.md\n    - Basic Usage: getting-started/basic-usage.md\n    - Gremlin Query Language: getting-started/gremlin.md\n    - Architectural Overview: getting-started/architecture.md\n  - JanusGraph Basics:\n    - Transactions: basics/transactions.md\n    - Search Predicates and Mixed Index Data Types: basics/search-predicates.md\n    - Connecting to JanusGraph:\n      - Introduction: basics/connecting/index.md\n      - Using Java: basics/connecting/java.md\n      - Using Python: basics/connecting/python.md\n      - Using .NET: basics/connecting/dotnet.md\n  - Configuration:\n    - Introduction: configs/index.md\n    - Configuration Reference: configs/configuration-reference.md\n    - Config Example: configs/example-config.md\n  - Schema Management:\n    - Schema and Data Modeling: schema/index.md\n    - Advanced Schema: schema/advschema.md\n    - Index Management:\n      - Indexing for Better Performance: schema/index-management/index-performance.md\n      - Index Lifecycle: schema/index-management/index-lifecycle.md\n      - Reindexing: schema/index-management/index-reindexing.md\n      - Removal: schema/index-management/index-removal.md\n    - Schema Initialization: schema/schema-init-strategies.md\n  - Operations:\n    - JanusGraph Server: operations/server.md\n    - Deployment Scenarios: operations/deployment.md\n    - JanusGraph Container: operations/container.md\n    - ConfiguredGraphFactory: operations/configured-graph-factory.md\n    - Dynamic Graphs: operations/dynamic-graphs.md\n    - Batch Processing: operations/batch-processing.md\n    - Bulk Loading: operations/bulk-loading.md\n    - JanusGraph Cache: operations/cache.md\n    - Monitoring: operations/monitoring.md\n    - Migrating from Titan: operations/migrating-titan.md\n    - Migrating from Thrift: operations/migrating-thrift.md\n    - Failure & Recovery: operations/recovery.md\n    - Management System: operations/management.md\n  - Storage Backends:\n    - Introduction: storage-backend/index.md\n    - Apache Cassandra: storage-backend/cassandra.md\n    - Apache HBase: storage-backend/hbase.md\n    - Google Cloud Bigtable: storage-backend/bigtable.md\n    - ScyllaDB: storage-backend/scylladb.md\n    - Oracle Berkeley DB Java Edition: storage-backend/bdb.md\n    - InMemory Storage Backend: storage-backend/inmemorybackend.md\n  - Mixed Index Backends:\n    - Introduction: index-backend/index.md\n    - Index Parameters and Full-Text Search: index-backend/text-search.md\n    - Field Mapping: index-backend/field-mapping.md\n    - Direct Index Query: index-backend/direct-index-query.md\n    - Elasticsearch: index-backend/elasticsearch.md\n    - Apache Solr: index-backend/solr.md\n    - Apache Lucene: index-backend/lucene.md\n  - Advanced Topics:\n    - Eventually-Consistent Storage Backends: advanced-topics/eventual-consistency.md\n    - Custom Vertex ID: advanced-topics/custom-vertex-id.md\n    - Graph Partitioning: advanced-topics/partitioning.md\n    - Datatype and Attribute Serializer Configuration: advanced-topics/serializer.md\n    - JanusGraph with TinkerPop’s Hadoop-Gremlin: advanced-topics/hadoop.md\n    - Transaction Log: advanced-topics/transaction-log.md\n    - JanusGraph Data model: advanced-topics/data-model.md\n    - JanusGraph Bus: advanced-topics/janusgraph-bus.md\n    - ExecutorService: advanced-topics/executor-service.md\n    - Permanent stale index inconsistency: advanced-topics/stale-index.md\n    - Technical Limitations: advanced-topics/technical-limitations.md\n    - Snapshot Releases: advanced-topics/commit-releases.md\n  - Common Questions: common-questions.md\n  - Development: development.md\n  - Changelog: changelog.md\n"
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 79.8154296875,
          "content": "<project xmlns=\"http://maven.apache.org/POM/4.0.0\"\n         xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n         xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n    <groupId>org.janusgraph</groupId>\n    <artifactId>janusgraph</artifactId>\n    <version>1.2.0-SNAPSHOT</version>\n    <packaging>pom</packaging>\n    <prerequisites>\n        <maven>3.2.5</maven>\n    </prerequisites>\n    <name>JanusGraph: Distributed Graph Database</name>\n    <url>https://janusgraph.org</url>\n\n    <description>\n        JanusGraph is a distributed graph database optimized for processing massive-scale graphs represented over a machine\n        cluster.\n        JanusGraph separates the concerns of graph processing and manipulation from storing the graph on disk,\n        delegating that concern to an extensible set of persistence solutions.\n    </description>\n    <developers>\n        <developer>\n            <name>JanusGraph members</name>\n            <email>janusgraph-dev@lists.lfaidata.foundation</email>\n            <url>https://github.com/orgs/JanusGraph/people</url>\n        </developer>\n    </developers>\n    <contributors>\n        <contributor>\n            <name>JanusGraph Contributors</name>\n            <url>https://github.com/JanusGraph/janusgraph/graphs/contributors</url>\n        </contributor>\n    </contributors>\n    <inceptionYear>2012</inceptionYear>\n    <licenses>\n        <license>\n            <name>The Apache Software License, Version 2.0</name>\n            <url>http://www.apache.org/licenses/LICENSE-2.0.txt</url>\n        </license>\n    </licenses>\n    <scm>\n        <connection>scm:git:git@github.com:JanusGraph/janusgraph.git</connection>\n        <developerConnection>scm:git:git@github.com:JanusGraph/janusgraph.git</developerConnection>\n        <url>git@github.com:JanusGraph/janusgraph.git</url>\n        <tag>HEAD</tag>\n    </scm>\n    <distributionManagement>\n        <snapshotRepository>\n            <id>ossrh</id>\n            <url>https://oss.sonatype.org/content/repositories/snapshots</url>\n        </snapshotRepository>\n        <repository>\n            <id>ossrh</id>\n            <url>https://oss.sonatype.org/service/local/staging/deploy/maven2/</url>\n        </repository>\n    </distributionManagement>\n    <properties>\n        <titan.compatible-versions>1.0.0,1.1.0-SNAPSHOT</titan.compatible-versions>\n        <tinkerpop.version>3.7.3</tinkerpop.version>\n        <avro.version>1.11.3</avro.version>\n        <junit-platform.version>1.11.0</junit-platform.version>\n        <junit.version>5.11.0</junit.version>\n        <mockito.version>4.11.0</mockito.version>\n        <jamm.version>0.3.3</jamm.version>\n        <metrics.version>4.2.27</metrics.version>\n        <slf4j.version>1.7.36</slf4j.version>\n        <logback.version>1.2.13</logback.version>\n        <httpcomponents.httpclient.version>4.5.14</httpcomponents.httpclient.version>\n        <httpcomponents.httpcore.version>4.4.16</httpcomponents.httpcore.version>\n        <hadoop.version>3.3.6</hadoop.version>\n        <hbase2.version>2.6.0-hadoop3</hbase2.version>\n        <htrace.version>4.1.7</htrace.version>\n        <bigtable.version>1.24.0</bigtable.version>\n        <!-- align with org.apache.spark:spark-core_2.12 -->\n        <jackson2.version>2.17.2</jackson2.version>\n        <lucene-solr.version>8.11.3</lucene-solr.version>\n        <elasticsearch.version>8.15.3</elasticsearch.version>\n        <commons.beanutils.version>1.9.4</commons.beanutils.version>\n        <commons.collections.version>3.2.2</commons.collections.version>\n        <zookeeper.version>3.9.2</zookeeper.version>\n        <netty4.version>4.1.115.Final</netty4.version>\n        <jna.version>5.14.0</jna.version>\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <project.reporting.outputEncoding>UTF-8</project.reporting.outputEncoding>\n        <janusgraph.testdir>${project.build.directory}/janusgraph-test</janusgraph.testdir>\n        <gpg.skip>false</gpg.skip>\n        <maven.gpg.version>3.2.4</maven.gpg.version>\n        <perf.jvm.opts />\n        <default.test.jvm.opts>-Xms256m -Xmx768m -XX:+HeapDumpOnOutOfMemoryError -ea ${test.extra.jvm.opts}</default.test.jvm.opts>\n        <mem.jvm.opts>-Xms256m -Xmx256m -ea -XX:+HeapDumpOnOutOfMemoryError ${test.extra.jvm.opts}</mem.jvm.opts>\n        <test.extra.jvm.opts />\n        <test.skip.default>false</test.skip.default>\n        <test.skip.tp>true</test.skip.tp>\n        <top.level.basedir>${basedir}</top.level.basedir>\n        <maven.javadoc.version>3.10.0</maven.javadoc.version>\n        <compiler.source>1.8</compiler.source>\n        <compiler.target>1.8</compiler.target>\n        <test.excluded.groups>MEMORY_TESTS,PERFORMANCE_TESTS,BRITTLE_TESTS</test.excluded.groups>\n        <dependency.locations.enabled>false</dependency.locations.enabled>\n        <cassandra.version>3.11.10</cassandra.version>\n        <!-- When this version updated please also update sha256 -->\n        <!-- https://downloads.apache.org/cassandra/4.0.6/apache-cassandra-4.0.6-bin.tar.gz.sha256 -->\n        <cassandra-dist.version>4.0.6</cassandra-dist.version>\n        <cassandra-dist.version.sha256>86d14a8e158e4e8554388b1aab598efcb879ddb09c480edecabb3c350b58fe6b</cassandra-dist.version.sha256>\n        <cassandra-driver.version>4.17.0</cassandra-driver.version>\n        <scylla-driver.version>4.18.0.1</scylla-driver.version>\n        <scylladb.version>6.2.0</scylladb.version>\n        <testcontainers.version>1.20.1</testcontainers.version>\n        <easymock.version>5.4.0</easymock.version>\n        <protobuf.version>3.25.5</protobuf.version>\n        <grpc.version>1.66.0</grpc.version>\n        <protoc.version>3.23.4</protoc.version>\n        <gson.version>2.11.0</gson.version>\n        <jcabi.version>2.1.0</jcabi.version>\n        <jmh.version>1.33</jmh.version>\n        <!-- align with org.apache.solr:solr-solrj -->\n        <jetty.version>9.4.55.v20240627</jetty.version>\n        <log4j2.version>2.23.1</log4j2.version>\n        <graalvm-nativeimage.version>24.0.2</graalvm-nativeimage.version>\n        <caffeine.version>2.9.3</caffeine.version>\n        <checker-qual.version>3.46.0</checker-qual.version>\n        <curator.version>5.7.0</curator.version>\n    </properties>\n    <modules>\n        <module>janusgraph-grpc</module>\n        <module>janusgraph-driver</module>\n        <module>janusgraph-core</module>\n        <module>janusgraph-server</module>\n        <module>janusgraph-backend-testutils</module>\n        <module>janusgraph-test</module>\n        <module>janusgraph-inmemory</module>\n        <module>janusgraph-berkeleyje</module>\n        <module>cassandra-hadoop-util</module>\n        <module>scylla-hadoop-util</module>\n        <module>janusgraph-cql</module>\n        <module>janusgraph-hadoop</module>\n        <module>janusgraph-hbase</module>\n        <module>janusgraph-bigtable</module>\n        <module>janusgraph-es</module>\n        <module>janusgraph-lucene</module>\n        <module>janusgraph-all</module>\n        <module>janusgraph-dist</module>\n        <module>janusgraph-benchmark</module>\n        <module>janusgraph-doc</module>\n        <module>janusgraph-solr</module>\n        <module>janusgraph-examples</module>\n        <module>janusgraph-mixed-index-utils</module>\n        <module>janusgraph-scylla</module>\n    </modules>\n    <repositories>\n        <repository>\n            <id>apache-snapshots</id>\n            <name>repository.apache.org snapshots</name>\n            <url>https://repository.apache.org/content/repositories/snapshots</url>\n            <releases>\n                <enabled>false</enabled>\n            </releases>\n            <snapshots>\n                <enabled>true</enabled>\n            </snapshots>\n        </repository>\n    </repositories>\n    <build>\n        <directory>${basedir}/target</directory>\n        <plugins>\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-enforcer-plugin</artifactId>\n                <version>3.5.0</version>\n                <executions>\n                    <execution>\n                        <id>enforce-dependency-convergence</id>\n                        <goals>\n                            <goal>enforce</goal>\n                        </goals>\n                        <configuration>\n                            <rules>\n                                <requireUpperBoundDeps>\n                                    <excludes>\n                                        <exclude>com.fasterxml.jackson.core:jackson-annotations</exclude>\n                                        <exclude>com.fasterxml.jackson.core:jackson-databind</exclude>\n                                        <exclude>com.fasterxml.jackson.core:jackson-core</exclude>\n                                    </excludes>\n                                </requireUpperBoundDeps>\n                                <DependencyConvergence />\n                            </rules>\n                        </configuration>\n                    </execution>\n                </executions>\n            </plugin>\n            <plugin>\n                <artifactId>maven-release-plugin</artifactId>\n                <configuration>\n                    <!--\n                      Only release:perform uses this configuration\n                      setting; release:prepare doesn't care and always\n                      runs \"clean verify\"\n                    -->\n                    <goals>javadoc:aggregate deploy</goals>\n\n                    <!--\n                      Tell the release plugin to never \"git push\".\n                      When releasing, you have to manually issue \"git\n                      push\" between release:prepare and\n                      release:perform.  You'll have to push both the\n                      branch you're releasing and the tag\n                      release:prepare locally created.\n                    -->\n                    <pushChanges>false</pushChanges>\n\n                    <!--\n                      @{...} is a special variable interpolation\n                      syntax that uses the target release version\n                      instead of the pom's actual version, which is\n                      usually a -SNAPSHOT version when this setting\n                      gets evaluated.\n                    -->\n                    <tagNameFormat>@{project.version}</tagNameFormat>\n\n                    <!--\n                      The release:perform goal activates these\n                      profiles when it invokes maven with the <goals>\n                      listed above.  Release engineering specific to\n                      release:perform and disabled during non-release\n                      operation should be encapsulated with the\n                      profile id listed below.\n                    -->\n                    <releaseProfiles>janusgraph-release</releaseProfiles>\n                    <useReleaseProfile>false</useReleaseProfile>\n\n                    <!-- Keep all submodules at same version as parent -->\n                    <autoVersionSubmodules>true</autoVersionSubmodules>\n\n                    <!-- applies to both release:prepare and :perform -->\n                    <arguments>-DskipTests=true</arguments>\n                </configuration>\n            </plugin>\n            <plugin>\n                <groupId>org.apache.rat</groupId>\n                <artifactId>apache-rat-plugin</artifactId>\n                <version>0.16.1</version>\n                <executions>\n                    <execution>\n                        <id>rat-checks</id>\n                        <phase>validate</phase>\n                        <goals>\n                            <goal>check</goal>\n                        </goals>\n                    </execution>\n                </executions>\n                <configuration>\n                    <excludeSubProjects>false</excludeSubProjects>\n                    <excludes>\n                        <exclude>**/target/**</exclude>\n                        <exclude>**/.classpath</exclude>\n                        <exclude>**/.project</exclude>\n                        <exclude>**/.factorypath</exclude>\n                        <exclude>**/.settings/**</exclude>\n                        <exclude>**/src/main/resources/META-INF/services/**</exclude>\n                        <exclude>**/src/test/resources/META-INF/services/**</exclude>\n                        <exclude>**/*.iml</exclude>\n                        <exclude>**/*.json</exclude>\n                        <exclude>**/*.xml</exclude>\n                        <exclude>**/*.xml.releaseBackup</exclude>\n                        <exclude>docs/**</exclude>\n                        <exclude>**/*.md</exclude>\n                        <exclude>**/*.txt</exclude>\n                        <exclude>**/*.log</exclude>\n                        <exclude>**/*.patch</exclude>\n                        <exclude>**/*.crt</exclude>\n                        <exclude>**/*.key</exclude>\n                        <exclude>**/*.sysconfig</exclude>\n                        <exclude>**/*.csv</exclude>\n                        <exclude>**/*.id</exclude>\n                        <exclude>**/*.gz</exclude>\n                        <exclude>.editorconfig</exclude>\n                        <exclude>.github/dependabot.yml</exclude>\n                        <exclude>CC-BY-4.0.txt</exclude>\n                        <exclude>**/cqlshrc</exclude>\n                        <exclude>**/regionservers</exclude>\n                        <exclude>**/jaas_keytab.conf</exclude>\n                        <exclude>**/src/test/resources/excludes</exclude>\n                        <exclude>**/src/test/resources/longTests1</exclude>\n                        <exclude>**/src/test/resources/longTests2</exclude>\n                        <exclude>**/src/test/resources/mockito-extensions/**</exclude>\n                        <exclude>**/src/test/resources/org/janusgraph/hadoop/formats/edgelist/rdf/**</exclude>\n                    </excludes>\n                </configuration>\n            </plugin>\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-checkstyle-plugin</artifactId>\n                <version>3.4.0</version>\n                <dependencies>\n                    <dependency>\n                        <groupId>com.puppycrawl.tools</groupId>\n                        <artifactId>checkstyle</artifactId>\n                        <version>9.3</version>\n                    </dependency>\n                </dependencies>\n                <configuration>\n                    <consoleOutput>true</consoleOutput>\n                    <failsOnError>true</failsOnError>\n                    <sourceDirectory>${project.build.sourceDirectories}</sourceDirectory>\n                    <includeTestSourceDirectory>true</includeTestSourceDirectory>\n                    <!-- define here because checkstyle and multi module is a PITA -->\n                    <checkstyleRules>\n                        <module name=\"Checker\">\n                            <module name=\"NewlineAtEndOfFile\" />\n                            <module name=\"UniqueProperties\" />\n                            <module name=\"TreeWalker\">\n                                <!-- <property name=\"tabWidth\" value=\"4\"/> -->\n                                <!-- Annotations: https://checkstyle.sourceforge.io/config_annotation.html -->\n                                <module name=\"MissingOverride\" />\n                                <!-- Class Design: https://checkstyle.sourceforge.io/config_design.html -->\n                                <module name=\"OneTopLevelClass\" />\n                                <!-- Coding: https://checkstyle.sourceforge.io/config_coding.html-->\n                                <module name=\"CovariantEquals\" />\n                                <!-- <module name=\"EqualsHashCode\" /> -->\n                                <!-- <module name=\"OneStatementPerLine\" /> -->\n                                <module name=\"PackageDeclaration\" />\n                                <module name=\"SimplifyBooleanExpression\" />\n                                <module name=\"StringLiteralEquality\" />\n                                <module name=\"UnnecessarySemicolonAfterOuterTypeDeclaration\" />\n                                <module name=\"UnnecessarySemicolonAfterTypeMemberDeclaration\" />\n                                <module name=\"UnnecessarySemicolonInEnumeration\" />\n                                <module name=\"UnnecessarySemicolonInTryWithResources\" />\n                                <!-- Imports: https://checkstyle.sourceforge.io/config_imports.html -->\n                                <module name=\"RedundantImport\" />\n                                <module name=\"UnusedImports\" />\n                                <module name=\"AvoidStarImport\" />\n                                <module name=\"CustomImportOrder\">\n                                    <property name=\"customImportOrderRules\"\n                                              value=\"THIRD_PARTY_PACKAGE###STANDARD_JAVA_PACKAGE###STATIC\"/>\n                                </module>\n                                <!-- Miscellaneous: https://checkstyle.sourceforge.io/config_misc.html -->\n                                <module name=\"ArrayTypeStyle\" />\n                                <module name=\"OuterTypeFilename\" />\n                                <module name=\"UpperEll\" />\n                                <!-- Modifiers: https://checkstyle.sourceforge.io/config_modifier.html -->\n                                <module name=\"ModifierOrder\" />\n                                <!-- <module name=\"RedundantModifier\" /> -->\n                            </module>\n                        </module>\n                    </checkstyleRules>\n                </configuration>\n                <executions>\n                    <execution>\n                        <id>validate</id>\n                        <phase>validate</phase>\n                        <goals>\n                            <goal>check</goal>\n                        </goals>\n                    </execution>\n                </executions>\n            </plugin>\n            <plugin>\n                <groupId>org.cyclonedx</groupId>\n                <artifactId>cyclonedx-maven-plugin</artifactId>\n                <version>2.8.1</version>\n                <executions>\n                    <execution>\n                        <phase>package</phase>\n                        <goals>\n                            <goal>makeAggregateBom</goal>\n                        </goals>\n                        <configuration>\n                            <excludeArtifactId>janusgraph-examples,example-common,example-hbase,example-cql,example-berkeleyje,example-remotegraph,example-tinkergraph,janusgraph-test,janusgraph-backend-testutils,janusgraph-benchmark</excludeArtifactId>\n                        </configuration>\n                    </execution>\n                </executions>\n            </plugin>\n        </plugins>\n        <pluginManagement>\n            <plugins>\n                <plugin>\n                    <artifactId>maven-compiler-plugin</artifactId>\n                    <version>3.13.0</version>\n                    <configuration>\n                        <source>${compiler.source}</source>\n                        <target>${compiler.target}</target>\n                        <compilerArguments>\n                            <Xmaxerrs>500</Xmaxerrs>\n                        </compilerArguments>\n                        <compilerArgs>\n                            <arg>-Xlint:unchecked</arg>\n                        </compilerArgs>\n                    </configuration>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-surefire-plugin</artifactId>\n                    <version>3.3.1</version>\n                    <configuration>\n                        <argLine>${default.test.jvm.opts}</argLine>\n                        <runOrder>alphabetical</runOrder>\n                        <failIfNoTests>false</failIfNoTests>\n                        <!-- six hours -->\n                        <forkedProcessTimeoutInSeconds>21600</forkedProcessTimeoutInSeconds>\n                        <reuseForks>false</reuseForks>\n                        <excludes>\n                            <exclude>**/*PerformanceTest.java</exclude>\n                            <exclude>**/*ConcurrentTest.java</exclude>\n                            <exclude>**/*Groovy*Test.java</exclude>\n                            <exclude>**/*ComputerTest.java</exclude>\n                            <exclude>**/*ProcessTest.java</exclude>\n                            <exclude>**/*ProcessPerformanceTest.java</exclude>\n                            <exclude>**/*StructureTest.java</exclude>\n                        </excludes>\n                        <excludedGroups>${test.excluded.groups}</excludedGroups>\n                        <skip>${test.skip.default}</skip>\n                    </configuration>\n                    <executions>\n                        <execution>\n                            <id>tinkerpop-test</id>\n                            <goals>\n                                <goal>test</goal>\n                            </goals>\n                            <phase>test</phase>\n                            <configuration combine.self=\"override\">\n                                <reuseForks>false</reuseForks>\n                                <forkCount>1</forkCount>\n                                <parallel>none</parallel>\n                                <threadCount>1</threadCount>\n                                <perCoreThreadCount>false</perCoreThreadCount>\n                                <includes>\n                                    <include>**/*Groovy*Test.java</include>\n                                    <include>**/*ComputerTest.java</include>\n                                    <include>**/*ProcessTest.java</include>\n                                    <include>**/*ProcessPerformanceTest.java</include>\n                                    <include>**/*StructureTest.java</include>\n                                </includes>\n                                <runOrder>alphabetical</runOrder>\n                                <skipTests>${test.skip.tp}</skipTests>\n                                <systemPropertyVariables>\n                                    <build.dir>${project.build.directory}</build.dir>\n                                    <is.testing>true</is.testing>\n                                </systemPropertyVariables>\n                            </configuration>\n                        </execution>\n                    </executions>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-failsafe-plugin</artifactId>\n                    <version>3.3.1</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-deploy-plugin</artifactId>\n                    <version>3.1.3</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-jar-plugin</artifactId>\n                    <version>3.4.2</version>\n                    <configuration>\n                        <archive>\n                            <manifestEntries>\n                                <janusgraphVersion>${project.version}</janusgraphVersion>\n                                <tinkerpopVersion>${tinkerpop.version}</tinkerpopVersion>\n                                <!-- Gremlin console loads 'version' as gremlin version -->\n                                <version>${tinkerpop.version}</version>\n                            </manifestEntries>\n                        </archive>\n                    </configuration>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-resources-plugin</artifactId>\n                    <version>3.3.1</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-release-plugin</artifactId>\n                    <version>3.1.1</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-javadoc-plugin</artifactId>\n                    <version>${maven.javadoc.version}</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-assembly-plugin</artifactId>\n                    <version>3.7.1</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-source-plugin</artifactId>\n                    <version>3.3.1</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-clean-plugin</artifactId>\n                    <version>3.4.0</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-dependency-plugin</artifactId>\n                    <version>3.8.0</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-gpg-plugin</artifactId>\n                    <version>${maven.gpg.version}</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.codehaus.mojo</groupId>\n                    <artifactId>exec-maven-plugin</artifactId>\n                    <version>3.2.0</version>\n                </plugin>\n                <plugin>\n                    <artifactId>maven-antrun-plugin</artifactId>\n                    <version>3.1.0</version>\n                </plugin>\n                <plugin>\n                    <groupId>org.jacoco</groupId>\n                    <artifactId>jacoco-maven-plugin</artifactId>\n                    <version>0.8.12</version>\n                </plugin>\n            </plugins>\n        </pluginManagement>\n    </build>\n    <dependencyManagement>\n        <dependencies>\n            <!-- Tinkerpop 3.x -->\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-core</artifactId>\n                <version>${tinkerpop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-server</artifactId>\n                <version>${tinkerpop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>com.codahale.metrics</groupId>\n                        <artifactId>metrics-core</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-console</artifactId>\n                <version>${tinkerpop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-groovy</artifactId>\n                <version>${tinkerpop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-driver</artifactId>\n                <version>${tinkerpop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>gremlin-test</artifactId>\n                <version>${tinkerpop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>junit</groupId>\n                        <artifactId>junit</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.kerby</groupId>\n                        <artifactId>kerb-simplekdc</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>tinkergraph-gremlin</artifactId>\n                <version>${tinkerpop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>hadoop-gremlin</artifactId>\n                <version>${tinkerpop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>javax.servlet</groupId>\n                        <artifactId>jsp-api</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>javax.servlet</groupId>\n                        <artifactId>servlet-api</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.commons</groupId>\n                        <artifactId>commons-compress</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>com.google.code.gson</groupId>\n                        <artifactId>gson</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.checkerframework</groupId>\n                        <artifactId>checker-qual</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.tinkerpop</groupId>\n                <artifactId>spark-gremlin</artifactId>\n                <version>${tinkerpop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>javax.annotation</groupId>\n                        <artifactId>javax.annotation-api</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.commons</groupId>\n                        <artifactId>commons-compress</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>com.github.spotbugs</groupId>\n                        <artifactId>spotbugs-annotations</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.slf4j</groupId>\n                        <artifactId>slf4j-log4j12</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.slf4j</groupId>\n                        <artifactId>slf4j-reload4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>log4j</groupId>\n                        <artifactId>log4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.eclipse.jetty.orbit</groupId>\n                        <artifactId>javax.servlet</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>com.thoughtworks.paranamer</groupId>\n                        <artifactId>paranamer</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-configuration2</artifactId>\n                <version>2.10.1</version>\n            </dependency>\n\n            <dependency>\n                <groupId>org.ow2.asm</groupId>\n                <artifactId>asm</artifactId>\n                <version>9.7</version>\n            </dependency>\n            <dependency>\n                <groupId>org.ow2.asm</groupId>\n                <artifactId>asm-commons</artifactId>\n                <version>9.7</version>\n            </dependency>\n\n            <!-- Jackson 2.x -->\n            <dependency>\n                <groupId>com.fasterxml.jackson.core</groupId>\n                <artifactId>jackson-core</artifactId>\n                <version>${jackson2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.jackson.core</groupId>\n                <artifactId>jackson-databind</artifactId>\n                <version>${jackson2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.jackson.datatype</groupId>\n                <artifactId>jackson-datatype-json-org</artifactId>\n                <version>${jackson2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.jackson.core</groupId>\n                <artifactId>jackson-annotations</artifactId>\n                <version>${jackson2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.jackson.module</groupId>\n                <artifactId>jackson-module-scala_2.12</artifactId>\n                <version>${jackson2.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>org.scala-lang</groupId>\n                        <artifactId>scala-library</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.jackson.module</groupId>\n                <artifactId>jackson-module-paranamer</artifactId>\n                <version>${jackson2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.code.findbugs</groupId>\n                <artifactId>jsr305</artifactId>\n                <version>3.0.2</version>\n            </dependency>\n            <dependency>\n                <groupId>javax.validation</groupId>\n                <artifactId>validation-api</artifactId>\n                <version>2.0.1.Final</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-lang3</artifactId>\n                <version>3.16.0</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-configuration</groupId>\n                <artifactId>commons-configuration</artifactId>\n                <version>1.10</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-collections</groupId>\n                <artifactId>commons-collections</artifactId>\n                <version>${commons.collections.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-net</groupId>\n                <artifactId>commons-net</artifactId>\n                <version>3.11.1</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-beanutils</groupId>\n                <artifactId>commons-beanutils</artifactId>\n                <version>${commons.beanutils.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-beanutils</groupId>\n                <artifactId>commons-beanutils-core</artifactId>\n                <version>${commons.beanutils.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-logging</groupId>\n                <artifactId>commons-logging</artifactId>\n                <version>1.3.4</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-math</artifactId>\n                <version>2.2</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-math3</artifactId>\n                <version>3.6.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.yaml</groupId>\n                <artifactId>snakeyaml</artifactId>\n                <version>2.2</version>\n            </dependency>\n            <dependency>\n                <groupId>net.oneandone.reflections8</groupId>\n                <artifactId>reflections8</artifactId>\n                <version>0.11.7</version>\n            </dependency>\n            <dependency>\n                <groupId>xml-apis</groupId>\n                <artifactId>xml-apis</artifactId>\n                <version>2.0.2</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.zookeeper</groupId>\n                <artifactId>zookeeper</artifactId>\n                <version>${zookeeper.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.zookeeper</groupId>\n                <artifactId>zookeeper-jute</artifactId>\n                <version>${zookeeper.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.yetus</groupId>\n                <artifactId>audience-annotations</artifactId>\n                <version>0.13.0</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.avro</groupId>\n                <artifactId>avro</artifactId>\n                <version>${avro.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.slf4j</groupId>\n                <artifactId>slf4j-api</artifactId>\n                <version>${slf4j.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-core</artifactId>\n                <version>${log4j2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-slf4j-impl</artifactId>\n                <version>${log4j2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-1.2-api</artifactId>\n                <version>${log4j2.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>org.apache.velocity</groupId>\n                        <artifactId>velocity</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.logging.log4j</groupId>\n                <artifactId>log4j-api</artifactId>\n                <version>${log4j2.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>ch.qos.logback</groupId>\n                <artifactId>logback-classic</artifactId>\n                <version>${logback.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>ch.qos.logback</groupId>\n                <artifactId>logback-core</artifactId>\n                <version>${logback.version}</version>\n            </dependency>\n            <dependency>\n                <!-- align with org.apache.hbase:hbase -->\n                <groupId>org.mortbay.jetty</groupId>\n                <artifactId>jetty</artifactId>\n                <version>6.1.26</version>\n            </dependency>\n\n            <dependency>\n                <groupId>net.jpountz.lz4</groupId>\n                <artifactId>lz4</artifactId>\n                <version>1.3.0</version>\n            </dependency>\n\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-all</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-handler</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-common</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-resolver</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-codec</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-transport</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-buffer</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-transport-native-epoll</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-transport-native-unix-common</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.objenesis</groupId>\n                <artifactId>objenesis</artifactId>\n                <version>3.4</version>\n            </dependency>\n\n            <dependency>\n                <groupId>org.junit.platform</groupId>\n                <artifactId>junit-platform-launcher</artifactId>\n                <version>${junit-platform.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.platform</groupId>\n                <artifactId>junit-platform-runner</artifactId>\n                <version>${junit-platform.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.jupiter</groupId>\n                <artifactId>junit-jupiter-api</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.jupiter</groupId>\n                <artifactId>junit-jupiter-params</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.jupiter</groupId>\n                <artifactId>junit-jupiter-engine</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.junit.vintage</groupId>\n                <artifactId>junit-vintage-engine</artifactId>\n                <version>${junit.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.mockito</groupId>\n                <artifactId>mockito-core</artifactId>\n                <version>${mockito.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.mockito</groupId>\n                <artifactId>mockito-inline</artifactId>\n                <version>${mockito.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.mockito</groupId>\n                <artifactId>mockito-junit-jupiter</artifactId>\n                <version>${mockito.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>net.bytebuddy</groupId>\n                <artifactId>byte-buddy</artifactId>\n                <version>1.15.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apiguardian</groupId>\n                <artifactId>apiguardian-api</artifactId>\n                <version>1.1.2</version>\n            </dependency>\n            <dependency>\n                <!-- Run the full test suite when changing the Guava version.\n                     The Guava team is deadly serious about their 18 month period from deprecation\n                     to feature deletion, and as a result, at least one of JanusGraph's dependencies is\n                     likely to break whenever the Guava version changes.\n\n                     Example where blithely upgrading Guava introduced a linkage error in the past:\n                     https://issues.apache.org/jira/browse/HBASE-10174\n                -->\n                <groupId>com.google.guava</groupId>\n                <artifactId>guava</artifactId>\n                <version>33.3.0-jre</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.errorprone</groupId>\n                <artifactId>error_prone_annotations</artifactId>\n                <version>2.30.0</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-codec</groupId>\n                <artifactId>commons-codec</artifactId>\n                <version>1.17.1</version>\n            </dependency>\n            <dependency>\n                <groupId>commons-cli</groupId>\n                <artifactId>commons-cli</artifactId>\n                <version>1.9.0</version>\n            </dependency>\n\n            <!-- Spatial4j -->\n            <dependency>\n                <groupId>org.locationtech.spatial4j</groupId>\n                <artifactId>spatial4j</artifactId>\n                <version>0.8</version>\n            </dependency>\n\n            <!-- Java Topology Suite (JTS) -->\n            <dependency>\n                <groupId>org.locationtech.jts</groupId>\n                <artifactId>jts-core</artifactId>\n                <version>1.17.0</version>\n            </dependency>\n\n            <!-- Package prefix is org.apache.commons.httpclient -->\n            <dependency>\n                <groupId>commons-httpclient</groupId>\n                <artifactId>commons-httpclient</artifactId>\n                <version>3.1</version>\n            </dependency>\n\n            <!-- Package prefix is org.apache.http -->\n            <dependency>\n                <groupId>org.apache.httpcomponents</groupId>\n                <artifactId>httpclient</artifactId>\n                <version>${httpcomponents.httpclient.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.httpcomponents</groupId>\n                <artifactId>httpcore</artifactId>\n                <version>${httpcomponents.httpcore.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.httpcomponents</groupId>\n                <artifactId>httpcore-nio</artifactId>\n                <version>${httpcomponents.httpcore.version}</version>\n            </dependency>\n\n            <dependency>\n                <groupId>com.googlecode.json-simple</groupId>\n                <artifactId>json-simple</artifactId>\n                <version>1.1.1</version>\n            </dependency>\n\n            <dependency>\n                <groupId>commons-io</groupId>\n                <artifactId>commons-io</artifactId>\n                <version>2.16.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.jacoco</groupId>\n                <artifactId>org.jacoco.ant</artifactId>\n                <version>0.8.12</version>\n            </dependency>\n            <dependency>\n                <groupId>io.dropwizard.metrics</groupId>\n                <artifactId>metrics-core</artifactId>\n                <version>${metrics.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.dropwizard.metrics</groupId>\n                <artifactId>metrics-jvm</artifactId>\n                <version>${metrics.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.dropwizard.metrics</groupId>\n                <artifactId>metrics-graphite</artifactId>\n                <version>${metrics.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.dropwizard.metrics</groupId>\n                <artifactId>metrics-jmx</artifactId>\n                <version>${metrics.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.jctools</groupId>\n                <artifactId>jctools-core</artifactId>\n                <version>4.0.5</version>\n            </dependency>\n            <dependency>\n                <groupId>com.clearspring.analytics</groupId>\n                <artifactId>stream</artifactId>\n                <version>2.9.8</version>\n            </dependency>\n            <dependency>\n                <groupId>org.javassist</groupId>\n                <artifactId>javassist</artifactId>\n                <version>3.30.2-GA</version>\n            </dependency>\n            <dependency>\n                <groupId>com.carrotsearch</groupId>\n                <artifactId>hppc</artifactId>\n                <version>0.9.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-compress</artifactId>\n                <version>1.26.2</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.protobuf</groupId>\n                <artifactId>protobuf-java</artifactId>\n                <version>${protobuf.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.protobuf</groupId>\n                <artifactId>protobuf-java-util</artifactId>\n                <version>${protobuf.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>com.google.code.gson</groupId>\n                        <artifactId>gson</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>com.google.j2objc</groupId>\n                        <artifactId>j2objc-annotations</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>io.grpc</groupId>\n                <artifactId>grpc-core</artifactId>\n                <version>${grpc.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.grpc</groupId>\n                <artifactId>grpc-protobuf</artifactId>\n                <version>${grpc.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.grpc</groupId>\n                <artifactId>grpc-stub</artifactId>\n                <version>${grpc.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.grpc</groupId>\n                <artifactId>grpc-testing</artifactId>\n                <version>${grpc.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.grpc</groupId>\n                <artifactId>grpc-netty-shaded</artifactId>\n                <version>${grpc.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.google.code.gson</groupId>\n                <artifactId>gson</artifactId>\n                <version>${gson.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.hdrhistogram</groupId>\n                <artifactId>HdrHistogram</artifactId>\n                <version>2.2.2</version>\n            </dependency>\n            <dependency>\n                <groupId>org.elasticsearch.client</groupId>\n                <artifactId>elasticsearch-rest-client</artifactId>\n                <version>${elasticsearch.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.testcontainers</groupId>\n                <artifactId>testcontainers</artifactId>\n                <version>${testcontainers.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>net.java.dev.jna</groupId>\n                        <artifactId>jna</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>junit</groupId>\n                        <artifactId>junit</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.testcontainers</groupId>\n                <artifactId>elasticsearch</artifactId>\n                <version>${testcontainers.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.testcontainers</groupId>\n                <artifactId>cassandra</artifactId>\n                <version>${testcontainers.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>com.datastax.cassandra</groupId>\n                        <artifactId>cassandra-driver-core</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.testcontainers</groupId>\n                <artifactId>solr</artifactId>\n                <version>${testcontainers.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.testcontainers</groupId>\n                <artifactId>junit-jupiter</artifactId>\n                <version>${testcontainers.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.easymock</groupId>\n                <artifactId>easymock</artifactId>\n                <version>${easymock.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>io.github.artsok</groupId>\n                <artifactId>rerunner-jupiter</artifactId>\n                <version>2.1.6</version>\n            </dependency>\n            <dependency>\n                <groupId>org.xerial.snappy</groupId>\n                <artifactId>snappy-java</artifactId>\n                <version>1.1.10.5</version>\n            </dependency>\n            <dependency>\n                <groupId>javax.activation</groupId>\n                <artifactId>activation</artifactId>\n                <version>1.1.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.slf4j</groupId>\n                <artifactId>jcl-over-slf4j</artifactId>\n                <version>${slf4j.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.nimbusds</groupId>\n                <artifactId>nimbus-jose-jwt</artifactId>\n                <version>9.37.3</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.commons</groupId>\n                <artifactId>commons-text</artifactId>\n                <version>1.12.0</version>\n            </dependency>\n            <dependency>\n                <groupId>junit</groupId>\n                <artifactId>junit</artifactId>\n                <version>4.13.2</version>\n            </dependency>\n            <dependency>\n                <groupId>org.projectlombok</groupId>\n                <artifactId>lombok</artifactId>\n                <version>1.18.34</version>\n            </dependency>\n            <dependency>\n                <groupId>org.osgi</groupId>\n                <artifactId>org.osgi.core</artifactId>\n                <version>6.0.0</version>\n            </dependency>\n            <dependency>\n                <groupId>javax.xml.bind</groupId>\n                <artifactId>jaxb-api</artifactId>\n                <version>2.3.1</version>\n            </dependency>\n            <dependency>\n                <groupId>net.java.dev.jna</groupId>\n                <artifactId>jna</artifactId>\n                <version>${jna.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.graalvm.sdk</groupId>\n                <artifactId>graal-sdk</artifactId>\n                <version>${graalvm-nativeimage.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.graalvm.nativeimage</groupId>\n                <artifactId>svm</artifactId>\n                <version>${graalvm-nativeimage.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>javax.servlet</groupId>\n                <artifactId>javax.servlet-api</artifactId>\n                <version>4.0.1</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-servlet</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-server</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-util</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-http</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-io</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.eclipse.jetty</groupId>\n                <artifactId>jetty-client</artifactId>\n                <version>${jetty.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>com.github.ben-manes.caffeine</groupId>\n                <artifactId>caffeine</artifactId>\n                <version>${caffeine.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.checkerframework</groupId>\n                <artifactId>checker-qual</artifactId>\n                <version>${checker-qual.version}</version>\n            </dependency>\n\n            <!-- Hadoop -->\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-annotations</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-auth</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-client</artifactId>\n                <version>${hadoop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>org.slf4j</groupId>\n                        <artifactId>slf4j-reload4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>ch.qos.reload4j</groupId>\n                        <artifactId>reload4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-framework</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-recipes</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-client</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-common</artifactId>\n                <version>${hadoop.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>org.slf4j</groupId>\n                        <artifactId>slf4j-reload4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>ch.qos.reload4j</groupId>\n                        <artifactId>reload4j</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-framework</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-recipes</artifactId>\n                    </exclusion>\n                    <exclusion>\n                        <groupId>org.apache.curator</groupId>\n                        <artifactId>curator-client</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-hdfs</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-hdfs</artifactId>\n                <version>${hadoop.version}</version>\n                <classifier>tests</classifier>\n                <type>test-jar</type>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-mapreduce-client-common</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-mapreduce-client-core</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-mapreduce-client-jobclient</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-mapreduce-client-jobclient</artifactId>\n                <version>${hadoop.version}</version>\n                <classifier>tests</classifier>\n                <type>test-jar</type>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-mapreduce-client-shuffle</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-yarn-api</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-distcp</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-hdfs-client</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-yarn-common</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hadoop</groupId>\n                <artifactId>hadoop-yarn-server-common</artifactId>\n                <version>${hadoop.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.curator</groupId>\n                <artifactId>curator-framework</artifactId>\n                <version>${curator.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.curator</groupId>\n                <artifactId>curator-recipes</artifactId>\n                <version>${curator.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.curator</groupId>\n                <artifactId>curator-client</artifactId>\n                <version>${curator.version}</version>\n                <exclusions>\n                    <exclusion>\n                        <groupId>io.netty</groupId>\n                        <artifactId>netty-transport-native-epoll</artifactId>\n                    </exclusion>\n                </exclusions>\n            </dependency>\n            <dependency>\n                <groupId>io.netty</groupId>\n                <artifactId>netty-transport-native-epoll</artifactId>\n                <version>${netty4.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.codehaus.woodstox</groupId>\n                <artifactId>stax2-api</artifactId>\n                <version>4.2.2</version>\n            </dependency>\n            <dependency>\n                <groupId>com.fasterxml.woodstox</groupId>\n                <artifactId>woodstox-core</artifactId>\n                <version>7.0.0</version>\n            </dependency>\n            <dependency>\n                <groupId>org.apache.hbase.thirdparty</groupId>\n                <artifactId>hbase-noop-htrace</artifactId>\n                <version>${htrace.version}</version>\n            </dependency>\n            <dependency>\n                <groupId>org.json</groupId>\n                <artifactId>json</artifactId>\n                <version>20240303</version>\n            </dependency>\n            <dependency>\n                <groupId>javax.enterprise</groupId>\n                <artifactId>cdi-api</artifactId>\n                <version>2.0</version>\n            </dependency>\n        </dependencies>\n    </dependencyManagement>\n\n    <dependencies>\n        <!-- Logging -->\n        <dependency>\n            <groupId>org.slf4j</groupId>\n            <artifactId>slf4j-api</artifactId>\n        </dependency>\n        <dependency>\n            <groupId>org.apache.logging.log4j</groupId>\n            <artifactId>log4j-slf4j-impl</artifactId>\n            <scope>runtime</scope>\n            <optional>true</optional>\n        </dependency>\n        <dependency>\n            <groupId>org.apache.logging.log4j</groupId>\n            <artifactId>log4j-core</artifactId>\n            <scope>runtime</scope>\n            <optional>true</optional>\n        </dependency>\n    </dependencies>\n\n    <profiles>\n        <profile>\n            <id>java-11</id>\n            <properties>\n                <compiler.source>11</compiler.source>\n                <compiler.target>11</compiler.target>\n            </properties>\n        </profile>\n\n        <profile>\n            <id>janusgraph-release</id>\n            <!--\n              Sign artifacts artifacts only during release:perform\n              when this profile is automatically activated or whenever\n              else it is manually activated.\n\n              Stolen from: https://blog.sonatype.com/people/2010/01/how-to-generate-pgp-signatures-with-maven/\n            -->\n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-source-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>attach-sources</id>\n                                <phase>package</phase>\n                                <goals>\n                                    <goal>jar-no-fork</goal>\n                                </goals>\n                            </execution>\n                        </executions>\n                    </plugin>\n                    <plugin>\n                        <artifactId>maven-javadoc-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>attach-javadocs</id>\n                                <phase>package</phase>\n                                <goals>\n                                    <goal>jar</goal>\n                                </goals>\n                                <configuration>\n                                    <!-- Quiet mode still shows warnings and errors -->\n                                    <quiet>true</quiet>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                    <plugin>\n                        <artifactId>maven-gpg-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>sign-artifacts</id>\n                                <phase>package</phase>\n                                <goals>\n                                    <goal>sign</goal>\n                                </goals>\n                                <configuration>\n                                    <useAgent>true</useAgent>\n                                    <skip>${gpg.skip}</skip>\n                                    <excludes>\n                                        <exclude>*.asc</exclude>\n                                    </excludes>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <profile>\n            <id>janusgraph-commit-release</id>\n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.sonatype.plugins</groupId>\n                        <artifactId>nexus-staging-maven-plugin</artifactId>\n                        <version>1.7.0</version>\n                        <extensions>true</extensions>\n                        <configuration>\n                            <!-- The Base URL of Nexus instance where we want to stage -->\n                            <nexusUrl>https://oss.sonatype.org</nexusUrl>\n                            <!-- The server \"id\" element from settings to use authentication from -->\n                            <serverId>ossrh</serverId>\n                        </configuration>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <profile>\n            <id>coverage</id>\n            <properties>\n                <test.extra.jvm.opts>${jacoco.opts}</test.extra.jvm.opts>\n            </properties>\n            <build>\n                <plugins>\n                    <plugin>\n                        <artifactId>maven-resources-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>copy-sources-for-jacoco</id>\n                                <phase>process-resources</phase>\n                                <goals>\n                                    <goal>copy-resources</goal>\n                                </goals>\n                                <configuration>\n                                    <outputDirectory>${project.build.directory}/jacoco-sources</outputDirectory>\n                                    <resources>\n                                        <resource>\n                                            <directory>${project.basedir}/src/main/java/</directory>\n                                            <filtering>false</filtering>\n                                        </resource>\n                                    </resources>\n                                </configuration>\n                            </execution>\n                            <execution>\n                                <id>copy-classes-for-jacoco</id>\n                                <phase>process-classes</phase>\n                                <goals>\n                                    <goal>copy-resources</goal>\n                                </goals>\n                                <configuration>\n                                    <outputDirectory>${project.build.directory}/jacoco-classes</outputDirectory>\n                                    <resources>\n                                        <resource>\n                                            <directory>${project.build.directory}/classes/</directory>\n                                            <filtering>false</filtering>\n                                        </resource>\n                                    </resources>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                    <plugin>\n                        <artifactId>maven-dependency-plugin</artifactId>\n                        <executions>\n                            <!-- Unpack all dependency class and source files for use by JaCoCo -->\n                            <execution>\n                                <id>unpack-dependency-sources</id>\n                                <phase>generate-resources</phase>\n                                <goals>\n                                    <goal>unpack-dependencies</goal>\n                                </goals>\n                                <configuration>\n                                    <classifier>sources</classifier>\n                                    <outputDirectory>${project.build.directory}/jacoco-sources</outputDirectory>\n                                    <includeGroupIds>${project.groupId}</includeGroupIds>\n                                    <excludeArtifactIds>janusgraph-test</excludeArtifactIds>\n                                </configuration>\n                            </execution>\n                            <execution>\n                                <id>unpack-dependency-classes</id>\n                                <phase>generate-resources</phase>\n                                <goals>\n                                    <goal>unpack-dependencies</goal>\n                                </goals>\n                                <configuration>\n                                    <classifier />\n                                    <!-- empty classifier requests the artifact containing classes -->\n                                    <outputDirectory>${project.build.directory}/jacoco-classes</outputDirectory>\n                                    <includeGroupIds>${project.groupId}</includeGroupIds>\n                                    <excludeArtifactIds>janusgraph-test</excludeArtifactIds>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                    <plugin>\n                        <groupId>org.jacoco</groupId>\n                        <artifactId>jacoco-maven-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>prepare-jacoco-agent</id>\n                                <phase>test-compile</phase>\n                                <goals>\n                                    <goal>prepare-agent</goal>\n                                </goals>\n                                <configuration>\n                                    <destFile>${top.level.basedir}/target/jacoco-combined.exec</destFile>\n                                    <append>true</append>\n                                    <propertyName>jacoco.opts</propertyName>\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                    <plugin>\n                        <!-- The Maven JaCoCo plugin doesn't allow\n                             configuration of sourcefiles and destfiles\n                             directories.  The Ant JaCoCo task does.  That's\n                             why we use antrun here for JaCoCo instead of\n                             JaCoCo's Maven plugin. -->\n                        <artifactId>maven-antrun-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>default-cli</id>\n                                <phase>post-integration-test</phase>\n                                <goals>\n                                    <goal>run</goal>\n                                </goals>\n                                <configuration>\n                                    <target>\n                                        <taskdef name=\"report\" classname=\"org.jacoco.ant.ReportTask\" classpathref=\"maven.plugin.classpath\" />\n                                        <report>\n                                            <executiondata>\n                                                <file file=\"${top.level.basedir}/target/jacoco-combined.exec\" />\n                                            </executiondata>\n                                            <structure name=\"Integration test coverage\">\n                                                <classfiles>\n                                                    <fileset dir=\"${project.build.directory}/jacoco-classes\" />\n                                                </classfiles>\n                                                <sourcefiles encoding=\"UTF-8\">\n                                                    <fileset dir=\"${project.build.directory}/jacoco-sources\" />\n                                                </sourcefiles>\n                                            </structure>\n                                            <html destdir=\"${project.build.directory}/jacoco-report\" />\n                                            <xml destfile=\"${project.build.directory}/jacoco-report/report.xml\" />\n                                        </report>\n                                    </target>\n                                </configuration>\n                            </execution>\n                        </executions>\n                        <dependencies>\n                            <dependency>\n                                <groupId>org.jacoco</groupId>\n                                <artifactId>org.jacoco.ant</artifactId>\n                                <version>0.8.12</version>\n                            </dependency>\n                        </dependencies>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <profile>\n            <id>memory-test</id>\n            <activation>\n                <property>\n                    <name>test.skip.mem</name>\n                    <value>false</value>\n                </property>\n            </activation>\n            <build>\n                <plugins>\n                    <plugin>\n                        <artifactId>maven-surefire-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>memory-test</id>\n                                <goals>\n                                    <goal>test</goal>\n                                </goals>\n                                <phase>test</phase>\n                                <configuration combine.self=\"override\">\n                                    <argLine>${mem.jvm.opts}</argLine>\n                                    <reuseForks>false</reuseForks>\n                                    <forkCount>1</forkCount>\n                                    <parallel>none</parallel>\n                                    <threadCount>1</threadCount>\n                                    <perCoreThreadCount>false</perCoreThreadCount>\n                                    <runOrder>alphabetical</runOrder>\n                                    <groups>MEMORY_TESTS</groups>\n                                    <excludedGroups />\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n\n        <profile>\n            <id>performance-test</id>\n            <activation>\n                <property>\n                    <name>test.skip.perf</name>\n                    <value>false</value>\n                </property>\n            </activation>\n            <build>\n                <plugins>\n                    <plugin>\n                        <artifactId>maven-surefire-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>performance-test</id>\n                                <goals>\n                                    <goal>test</goal>\n                                </goals>\n                                <phase>test</phase>\n                                <configuration combine.self=\"override\">\n                                    <argLine>${default.test.jvm.opts} ${perf.jvm.opts}</argLine>\n                                    <reuseForks>false</reuseForks>\n                                    <forkCount>1</forkCount>\n                                    <parallel>none</parallel>\n                                    <threadCount>1</threadCount>\n                                    <perCoreThreadCount>false</perCoreThreadCount>\n                                    <runOrder>alphabetical</runOrder>\n                                    <groups>PERFORMANCE_TESTS</groups>\n                                    <excludedGroups />\n                                </configuration>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n    </profiles>\n</project>\n"
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 0.193359375,
          "content": "mkdocs==1.5.3\nmkdocs-material==9.4.8\nPygments==2.16.1\npymdown-extensions==10.4\nmarkdown==3.5.1\nmkdocs-include-markdown-plugin==6.0.2\nmkdocs-redirects==1.2.1\njinja2==3.1.4\nmkdocs-macros-plugin==1.0.4"
        },
        {
          "name": "scylla-hadoop-util",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}