{
  "metadata": {
    "timestamp": 1736708689457,
    "page": 107,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjExMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "cabaletta/baritone",
      "stars": 7406,
      "defaultBranch": "1.19.4",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.01171875,
          "content": "* text=auto\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.4853515625,
          "content": ".DS_Store\n**/*.swp\n\nrun/\nautotest/\ndist/\nvolderyarn/\n\n# Gradle\nbuild/\n.gradle/\nclasses/\n*.class\n\n/out\n\n# IntelliJ Files\n.idea/\n*.iml\n*.ipr\n*.iws\n/logs/\n\ntweaker/logs/\ncommon/logs/\n\n# Eclipse Files\n.classpath\n.project\n.settings/\nbaritone_Client.launch\n\n# Copyright Files\n!/.idea/copyright/Baritone.xml\n!/.idea/copyright/profiles_settings.xml\n\n.vscode/launch.json\n.architectury-transformer\n\n\nmapping\n\nlibs/lwjgl-platform-2.9.4-nightly-20150209-natives-osx.jar\nlibs/java-objc-bridge-1.1.jar\n\nmapping\n"
        },
        {
          "name": ".gitlab-ci.yml",
          "type": "blob",
          "size": 0.2021484375,
          "content": "image: java:8\n\nbefore_script:\n  - which java\n  - which javac\n\nbuild:\n  script:\n    - ./gradlew build\n    - ./gradlew build -Pbaritone.forge_build\n  artifacts:\n    paths:\n      - dist/*\n    expire_in: 1 week\n"
        },
        {
          "name": ".gitmessage",
          "type": "blob",
          "size": 1.22265625,
          "content": "<emoji> <title> (<ticket>)\n\n# 📝 Update README.md (WD-1234)\n# ✅ Add unit test for inputs (WD-1234)\n\n# <emoji> can be:\n# 🎨 :art: when improving structure of the code\n# ⚡️ :zap: when improving performance\n# 🔥 :fire: when removing code or files\n# ✨ :sparkles: when introducing new features\n# 🚧 :construction: when work in progress\n# 🔨 :hammer: when refactoring code\n# 📝 :memo: when writing docs\n# 💄 :lipstick: when updating the UI and style files\n# 📈 :chart_with_upwards_trend: when adding analytics or tracking code\n# 🌐 :globe_with_meridians: when adding internationalization and localization\n# ✏️ :pencil2: when fixing typos\n# 🚚 :truck: when moving or renaming files\n# ✅ :white_check_mark: when adding tests\n\n# 👌 :ok_hand: when updating code due to code review changes\n# 🐛 :bug: when fixing a bug\n# 🚑 :ambulance: when doing a critical hotfix\n# 🚨 :rotating_light: when removing linter warnings\n\n# 🔀 :twisted_rightwards_arrows: when merging branches\n# ⬆️ :arrow_up: when upgrading dependencies\n# ⬇️ :arrow_down: when downgrading dependencies\n# 🔧 :wrench: when changing configuration files\n# 🔖 :bookmark: when releasing / version tagging\n# 💚 :green_heart: when fixing the CI build\n"
        },
        {
          "name": ".idea",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.5859375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* No Anime (including uwu's or owo's)\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Giving and gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* Anime\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* ~~Trolling, insulting/derogatory comments, and personal or political attacks~~\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission or consent\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\nProject maintainers have the right and responsibility to immediately remove\nwithout any sort of dispute any issues or pull requests that do not align\nwith their corresponding templates. Absolutely no leniancy shall be accepted\nwith these terms.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at complaints@leijurv.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.1962890625,
          "content": "FROM ubuntu:focal\n\nENV DEBIAN_FRONTEND noninteractive\n\nRUN apt update -y\n\nRUN apt install \\\n          openjdk-17-jdk \\\n\t  git \\\n          --assume-yes\n\nCOPY . /code\n\nWORKDIR /code\n\nRUN ./gradlew build\n"
        },
        {
          "name": "FEATURES.md",
          "type": "blob",
          "size": 6.9365234375,
          "content": "# Pathing features\n- **Long distance pathing and splicing** Baritone calculates paths in segments, and precalculates the next segment when the current one is about to end, so that it's moving towards the goal at all times.\n- **Chunk caching** Baritone simplifies chunks to a compacted internal 2-bit representation (AIR, SOLID, WATER, AVOID) and stores them in RAM for better very-long-distance pathing. There is also an option to save these cached chunks to disk. <a href=\"https://www.youtube.com/watch?v=dyfYKSubhdc\">Example</a>\n- **Block breaking** Baritone considers breaking blocks as part of its path. It also takes into account your current tool set and hot bar. For example, if you have a Eff V diamond pick, it may choose to mine through a stone barrier, while if you only had a wood pick it might be faster to climb over it.\n- **Block placing** Baritone considers placing blocks as part of its path. This includes sneak-back-placing, pillaring, etc. It has a configurable penalty of placing a block (set to 1 second by default), to conserve its resources. The list of acceptable throwaway blocks is also configurable, and is cobble, dirt, or netherrack by default. <a href=\"https://www.youtube.com/watch?v=F6FbI1L9UmU\">Example</a>\n- **Falling** Baritone will fall up to 3 blocks onto solid ground (configurable, if you have Feather Falling and/or don't mind taking a little damage). If you have a water bucket on your hotbar, it will fall up to 23 blocks and place the bucket beneath it. It will fall an unlimited distance into existing still water.\n- **Vines and ladders** Baritone understands how to climb and descend vines and ladders. There is experimental support for more advanced maneuvers, like strafing to a different ladder / vine column in midair (off by default, setting named `allowVines`). Baritone can break its fall by grabbing ladders / vines midair, and understands when that is and isn't possible.\n- **Opening fence gates and doors**\n- **Slabs and stairs**\n- **Falling blocks** Baritone understands the costs of breaking blocks with falling blocks on top, and includes all of their break costs. Additionally, since it avoids breaking any blocks touching a liquid, it won't break the bottom of a gravel stack below a lava lake (anymore).\n- **Avoiding dangerous blocks** Obviously, it knows not to walk through fire or on magma, not to corner over lava (that deals some damage), not to break any blocks touching a liquid (it might drown), etc.\n- **Parkour** Sprint jumping over 1, 2, or 3 block gaps\n- **Parkour place** Sprint jumping over a 3 block gap and placing the block to land on while executing the jump. It's really cool.\n- **Pigs** It can sort of control pigs. I wouldn't rely on it though.\n\n# Pathing method\nBaritone uses A*, with some modifications: \n\n- **Segmented calculation** Traditional A* calculates until the most promising node is in the goal, however in the environment of Minecraft with a limited render distance, we don't know the environment all the way to our goal. Baritone has three possible ways for path calculation to end: finding a path all the way to the goal, running out of time, or getting to the render distance. In the latter two scenarios, the selection of which segment to actually execute falls to the next item (incremental cost backoff). Whenever the path calculation thread finds that the best / most promising node is at the edge of loaded chunks, it increments a counter. If this happens more than 50 times (configurable), path calculation exits early. This happens with very low render distances. Otherwise, calculation continues until the timeout is hit (also configurable) or we find a path all the way to the goal.\n- **Incremental cost backoff** When path calculation exits early without getting all the way to the goal, Baritone it needs to select a segment to execute first (assuming it will calculate the next segment at the end of this one). It uses incremental cost backoff to select the best node by varying metrics, then paths to that node. This is unchanged from MineBot and I made a <a href=\"https://docs.google.com/document/d/1WVHHXKXFdCR1Oz__KtK8sFqyvSwJN_H4lftkHFgmzlc/edit\">write-up</a> that still applies. In essence, it keeps track of the best node by various increasing coefficients, then picks the node with the least coefficient that goes at least 5 blocks from the starting position.\n- **Minimum improvement repropagation** The pathfinder ignores alternate routes that provide minimal improvements (less than 0.01 ticks of improvement), because the calculation cost of repropagating this to all connected nodes is much higher than the half-millisecond path time improvement it would get.\n- **Backtrack cost favoring** While calculating the next segment, Baritone favors backtracking its current segment. The cost is decreased heavily, but is still positive (this won't cause it to backtrack if it doesn't need to). This allows it to splice and jump onto the next segment as early as possible, if the next segment begins with a backtrack of the current one. <a href=\"https://www.youtube.com/watch?v=CGiMcb8-99Y\">Example</a>\n- **Backtrack detection and pausing** While path calculation happens on a separate thread, the main game thread has access to the latest node considered, and the best path so far (those are rendered light blue and dark blue respectively). When the current best path (rendered dark blue) passes through the player's current position on the current path segment, path execution is paused (if it's safe to do so), because there's no point continuing forward if we're about to turn around and go back that same way. Note that the current best path as reported by the path calculation thread takes into account the incremental cost backoff system, so it's accurate to what the path calculation thread will actually pick once it finishes.\n\n# Chat control\n\n- [Baritone chat control usage](USAGE.md)\n\n# Goals\nThe pathing goal can be set to any of these options:\n- **GoalBlock** one specific block that the player should stand inside at foot level\n- **GoalXZ** an X and a Z coordinate, used for long distance pathing\n- **GoalYLevel** a Y coordinate\n- **GoalTwoBlocks** a block position that the player should stand in, either at foot or eye level\n- **GoalGetToBlock** a block position that the player should stand adjacent to, below, or on top of\n- **GoalNear** a block position that the player should get within a certain radius of, used for following entities\n- **GoalAxis** a block position on an axis or diagonal axis (so x=0, z=0, or x=z), and y=120 (configurable)\n\nAnd finally `GoalComposite`. `GoalComposite` is a list of other goals, any one of which satisfies the goal. For example, `mine diamond_ore` creates a `GoalComposite` of `GoalTwoBlocks`s for every diamond ore location it knows of.\n\n\n# Future features\nThings it doesn't have yet\n- Trapdoors\n- Sprint jumping in a 1x2 corridor\n\nSee <a href=\"https://github.com/cabaletta/baritone/issues\">issues</a> for more.\n\nThings it may not ever have, from most likely to least likely =(\n- Boats\n- Horses (2x3 path instead of 1x2)\n- Elytra\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 7.4716796875,
          "content": "                   GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\n  This version of the GNU Lesser General Public License incorporates\nthe terms and conditions of version 3 of the GNU General Public\nLicense, supplemented by the additional permissions listed below.\n\n  0. Additional Definitions.\n\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\nGeneral Public License.\n\n  \"The Library\" refers to a covered work governed by this License,\nother than an Application or a Combined Work as defined below.\n\n  An \"Application\" is any work that makes use of an interface provided\nby the Library, but which is not otherwise based on the Library.\nDefining a subclass of a class defined by the Library is deemed a mode\nof using an interface provided by the Library.\n\n  A \"Combined Work\" is a work produced by combining or linking an\nApplication with the Library.  The particular version of the Library\nwith which the Combined Work was made is also called the \"Linked\nVersion\".\n\n  The \"Minimal Corresponding Source\" for a Combined Work means the\nCorresponding Source for the Combined Work, excluding any source code\nfor portions of the Combined Work that, considered in isolation, are\nbased on the Application, and not on the Linked Version.\n\n  The \"Corresponding Application Code\" for a Combined Work means the\nobject code and/or source code for the Application, including any data\nand utility programs needed for reproducing the Combined Work from the\nApplication, but excluding the System Libraries of the Combined Work.\n\n  1. Exception to Section 3 of the GNU GPL.\n\n  You may convey a covered work under sections 3 and 4 of this License\nwithout being bound by section 3 of the GNU GPL.\n\n  2. Conveying Modified Versions.\n\n  If you modify a copy of the Library, and, in your modifications, a\nfacility refers to a function or data to be supplied by an Application\nthat uses the facility (other than as an argument passed when the\nfacility is invoked), then you may convey a copy of the modified\nversion:\n\n   a) under this License, provided that you make a good faith effort to\n   ensure that, in the event an Application does not supply the\n   function or data, the facility still operates, and performs\n   whatever part of its purpose remains meaningful, or\n\n   b) under the GNU GPL, with none of the additional permissions of\n   this License applicable to that copy.\n\n  3. Object Code Incorporating Material from Library Header Files.\n\n  The object code form of an Application may incorporate material from\na header file that is part of the Library.  You may convey such object\ncode under terms of your choice, provided that, if the incorporated\nmaterial is not limited to numerical parameters, data structure\nlayouts and accessors, or small macros, inline functions and templates\n(ten or fewer lines in length), you do both of the following:\n\n   a) Give prominent notice with each copy of the object code that the\n   Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the object code with a copy of the GNU GPL and this license\n   document.\n\n  4. Combined Works.\n\n  You may convey a Combined Work under terms of your choice that,\ntaken together, effectively do not restrict modification of the\nportions of the Library contained in the Combined Work and reverse\nengineering for debugging such modifications, if you also do each of\nthe following:\n\n   a) Give prominent notice with each copy of the Combined Work that\n   the Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\n   document.\n\n   c) For a Combined Work that displays copyright notices during\n   execution, include the copyright notice for the Library among\n   these notices, as well as a reference directing the user to the\n   copies of the GNU GPL and this license document.\n\n   d) Do one of the following:\n\n       0) Convey the Minimal Corresponding Source under the terms of this\n       License, and the Corresponding Application Code in a form\n       suitable for, and under terms that permit, the user to\n       recombine or relink the Application with a modified version of\n       the Linked Version to produce a modified Combined Work, in the\n       manner specified by section 6 of the GNU GPL for conveying\n       Corresponding Source.\n\n       1) Use a suitable shared library mechanism for linking with the\n       Library.  A suitable mechanism is one that (a) uses at run time\n       a copy of the Library already present on the user's computer\n       system, and (b) will operate properly with a modified version\n       of the Library that is interface-compatible with the Linked\n       Version.\n\n   e) Provide Installation Information, but only if you would otherwise\n   be required to provide such information under section 6 of the\n   GNU GPL, and only to the extent that such information is\n   necessary to install and execute a modified version of the\n   Combined Work produced by recombining or relinking the\n   Application with a modified version of the Linked Version. (If\n   you use option 4d0, the Installation Information must accompany\n   the Minimal Corresponding Source and Corresponding Application\n   Code. If you use option 4d1, you must provide the Installation\n   Information in the manner specified by section 6 of the GNU GPL\n   for conveying Corresponding Source.)\n\n  5. Combined Libraries.\n\n  You may place library facilities that are a work based on the\nLibrary side by side in a single library together with other library\nfacilities that are not Applications and are not covered by this\nLicense, and convey such a combined library under terms of your\nchoice, if you do both of the following:\n\n   a) Accompany the combined library with a copy of the same work based\n   on the Library, uncombined with any other library facilities,\n   conveyed under the terms of this License.\n\n   b) Give prominent notice with the combined library that part of it\n   is a work based on the Library, and explaining where to find the\n   accompanying uncombined form of the same work.\n\n  6. Revised Versions of the GNU Lesser General Public License.\n\n  The Free Software Foundation may publish revised and/or new versions\nof the GNU Lesser General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\n  Each version is given a distinguishing version number. If the\nLibrary as you received it specifies that a certain numbered version\nof the GNU Lesser General Public License \"or any later version\"\napplies to it, you have the option of following the terms and\nconditions either of that published version or of any later version\npublished by the Free Software Foundation. If the Library as you\nreceived it does not specify a version number of the GNU Lesser\nGeneral Public License, you may choose any version of the GNU Lesser\nGeneral Public License ever published by the Free Software Foundation.\n\n  If the Library as you received it specifies that a proxy can decide\nwhether future versions of the GNU Lesser General Public License shall\napply, that proxy's public statement of acceptance of any version is\npermanent authorization for you to choose that version for the\nLibrary."
        },
        {
          "name": "LICENSE-Part-2.jpg",
          "type": "blob",
          "size": 6.673828125,
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.208984375,
          "content": "# Baritone\n<p align=\"center\">\n  <a href=\"https://github.com/cabaletta/baritone/releases/\"><img src=\"https://img.shields.io/github/downloads/cabaletta/baritone/total.svg\" alt=\"GitHub All Releases\"/></a>\n</p>\n\n<p align=\"center\">\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.12.2-brightgreen.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.13.2-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.14.4-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.15.2-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.16.5-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.17.1-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.18.2-yellow.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.19.2-brightgreen.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.19.4-brightgreen.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.20.1-brightgreen.svg\" alt=\"Minecraft\"/></a>\n  <a href=\"#Baritone\"><img src=\"https://img.shields.io/badge/MC-1.21.3-brightgreen.svg\" alt=\"Minecraft\"/></a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://travis-ci.com/cabaletta/baritone/\"><img src=\"https://travis-ci.com/cabaletta/baritone.svg?branch=master\" alt=\"Build Status\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/releases/\"><img src=\"https://img.shields.io/github/release/cabaletta/baritone.svg\" alt=\"Release\"/></a>\n  <a href=\"LICENSE\"><img src=\"https://img.shields.io/badge/license-LGPL--3.0%20with%20anime%20exception-green.svg\" alt=\"License\"/></a>\n  <a href=\"https://www.codacy.com/gh/cabaletta/baritone/dashboard?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=cabaletta/baritone&amp;utm_campaign=Badge_Grade\"><img src=\"https://app.codacy.com/project/badge/Grade/cadab857dab049438b6e28b3cfc5570e\" alt=\"Codacy Badge\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/blob/master/CODE_OF_CONDUCT.md\"><img src=\"https://img.shields.io/badge/%E2%9D%A4-code%20of%20conduct-blue.svg?style=flat\" alt=\"Code of Conduct\"/></a>\n  <a href=\"https://snyk.io/test/github/cabaletta/baritone?targetFile=build.gradle\"><img src=\"https://snyk.io/test/github/cabaletta/baritone/badge.svg?targetFile=build.gradle\" alt=\"Known Vulnerabilities\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/issues/\"><img src=\"https://img.shields.io/badge/contributions-welcome-brightgreen.svg?style=flat\" alt=\"Contributions welcome\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/issues/\"><img src=\"https://img.shields.io/github/issues/cabaletta/baritone.svg\" alt=\"Issues\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/issues?q=is%3Aissue+is%3Aclosed\"><img src=\"https://img.shields.io/github/issues-closed/cabaletta/baritone.svg\" alt=\"GitHub issues-closed\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/pulls/\"><img src=\"https://img.shields.io/github/issues-pr/cabaletta/baritone.svg\" alt=\"Pull Requests\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/graphs/contributors/\"><img src=\"https://img.shields.io/github/contributors/cabaletta/baritone.svg\" alt=\"GitHub contributors\"/></a>\n  <a href=\"https://github.com/cabaletta/baritone/commit/\"><img src=\"https://img.shields.io/github/commits-since/cabaletta/baritone/v1.0.0.svg\" alt=\"GitHub commits\"/></a>\n  <img src=\"https://img.shields.io/github/languages/code-size/cabaletta/baritone.svg\" alt=\"Code size\"/>\n  <img src=\"https://img.shields.io/github/repo-size/cabaletta/baritone.svg\" alt=\"GitHub repo size\"/>\n  <img src=\"https://tokei.rs/b1/github/cabaletta/baritone?category=code&style=flat\" alt=\"Lines of Code\"/>\n  <img src=\"https://img.shields.io/badge/Badges-36-blue.svg\" alt=\"yes\"/>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://impactclient.net/\"><img src=\"https://img.shields.io/badge/Impact%20integration-v1.2.14%20/%20v1.3.8%20/%20v1.4.6%20/%20v1.5.3%20/%20v1.6.3-brightgreen.svg\" alt=\"Impact integration\"/></a>\n  <a href=\"https://github.com/lambda-client/lambda\"><img src=\"https://img.shields.io/badge/Lambda%20integration-v1.2.17-brightgreen.svg\" alt=\"Lambda integration\"/></a>\n  <a href=\"https://github.com/fr1kin/ForgeHax/\"><img src=\"https://img.shields.io/badge/ForgeHax%20%22integration%22-scuffed-yellow.svg\" alt=\"ForgeHax integration\"/></a>\n  <a href=\"https://aristois.net/\"><img src=\"https://img.shields.io/badge/Aristois%20add--on%20integration-v1.6.3-green.svg\" alt=\"Aristois add-on integration\"/></a>\n  <a href=\"https://rootnet.dev/\"><img src=\"https://img.shields.io/badge/rootNET%20integration-v1.2.14-green.svg\" alt=\"rootNET integration\"/></a>\n  <a href=\"https://futureclient.net/\"><img src=\"https://img.shields.io/badge/Future%20integration-v1.2.12%20%2F%20v1.3.6%20%2F%20v1.4.4-red\" alt=\"Future integration\"/></a>\n  <a href=\"https://rusherhack.org/\"><img src=\"https://img.shields.io/badge/RusherHack%20integration-v1.2.14-green\" alt=\"RusherHack integration\"/></a>\n</p>\n\n<p align=\"center\">\n  <a href=\"http://forthebadge.com/\"><img src=\"https://web.archive.org/web/20230604002050/https://forthebadge.com/images/badges/built-with-swag.svg\" alt=\"forthebadge\"/></a>\n  <a href=\"http://forthebadge.com/\"><img src=\"https://web.archive.org/web/20230604002050/https://forthebadge.com/images/badges/mom-made-pizza-rolls.svg\" alt=\"forthebadge\"/></a>\n</p>\n\nA Minecraft pathfinder bot.\n\nBaritone is the pathfinding system used in [Impact](https://impactclient.net/) since 4.4. [Here's](https://www.youtube.com/watch?v=StquF69-_wI) a (very old!) video I made showing off what it can do.\n\n[**Baritone Discord Server**](http://discord.gg/s6fRBAUpmr)\n\n**Quick download links:**\n\n| Forge                                                                                                         | Fabric                                                                                                        |\n|---------------------------------------------------------------------------------------------------------------|---------------------------------------------------------------------------------------------------------------|\n| [1.12.2 Forge](https://github.com/cabaletta/baritone/releases/download/v1.2.19/baritone-api-forge-1.2.19.jar) |                                                                                                               |\n| [1.16.5 Forge](https://github.com/cabaletta/baritone/releases/download/v1.6.5/baritone-api-forge-1.6.5.jar)   | [1.16.5 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.6.5/baritone-api-fabric-1.6.5.jar) |\n| [1.17.1 Forge](https://github.com/cabaletta/baritone/releases/download/v1.7.3/baritone-api-forge-1.7.3.jar)   | [1.17.1 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.7.3/baritone-api-fabric-1.7.3.jar) |\n| [1.18.2 Forge](https://github.com/cabaletta/baritone/releases/download/v1.8.6/baritone-api-forge-1.8.6.jar)   | [1.18.2 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.8.6/baritone-api-fabric-1.8.6.jar) |\n| [1.19.2 Forge](https://github.com/cabaletta/baritone/releases/download/v1.9.4/baritone-api-forge-1.9.4.jar)   | [1.19.2 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.9.4/baritone-api-fabric-1.9.4.jar) |\n| [1.19.3 Forge](https://github.com/cabaletta/baritone/releases/download/v1.9.1/baritone-api-forge-1.9.1.jar)   | [1.19.3 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.9.1/baritone-api-fabric-1.9.1.jar) |\n| [1.19.4 Forge](https://github.com/cabaletta/baritone/releases/download/v1.9.3/baritone-api-forge-1.9.3.jar)   | [1.19.4 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.9.3/baritone-api-fabric-1.9.3.jar) |\n| [1.20.1 Forge](https://github.com/cabaletta/baritone/releases/download/v1.10.1/baritone-api-forge-1.10.1.jar)   | [1.20.1 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.10.1/baritone-api-fabric-1.10.1.jar) |\n| [1.20.3 Forge](https://github.com/cabaletta/baritone/releases/download/v1.10.2/baritone-api-forge-1.10.2.jar)   | [1.20.3 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.10.2/baritone-api-fabric-1.10.2.jar) |\n| [1.20.4 Forge](https://github.com/cabaletta/baritone/releases/download/v1.10.2/baritone-api-forge-1.10.2.jar)   | [1.20.4 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.10.2/baritone-api-fabric-1.10.2.jar) |\n| [1.21.3 Forge](https://github.com/cabaletta/baritone/releases/download/v1.11.1/baritone-api-forge-1.11.1.jar)   | [1.21.3 Fabric](https://github.com/cabaletta/baritone/releases/download/v1.11.1/baritone-api-fabric-1.11.1.jar) |\n\n**Message for 2b2t players looking for 1.19/1.20 Baritone** If you like, please try the beta for Baritone Elytra for 2b2t, find it in #announcements of [the Baritone discord](http://discord.gg/s6fRBAUpmr). It supports 1.19.4 and 1.20.1, Forge or Fabric. If you have to see it to believe it, watch [this YouTube video](https://youtu.be/NnSlQi-68eQ).\n\n**How to immediately get started:** Type `#goto 1000 500` in chat to go to x=1000 z=500. Type `#mine diamond_ore` to mine diamond ore. Type `#stop` to stop. For more, read [the usage page](USAGE.md) and/or watch this [tutorial playlist](https://www.youtube.com/playlist?list=PLnwnJ1qsS7CoQl9Si-RTluuzCo_4Oulpa). Also try `#elytra` for Elytra flying in the Nether using fireworks.\n\nFor other versions of Minecraft or more complicated situations or for development, see [Installation & setup](SETUP.md). Also consider just installing [Impact](https://impactclient.net/), which comes with Baritone and is easier to install than wrangling with version JSONs and zips. For 1.16.5, [click here](https://www.youtube.com/watch?v=_4eVJ9Qz2J8) and see description. Once Baritone is installed, look [here](USAGE.md) for instructions on how to use it. There's a [showcase video](https://youtu.be/CZkLXWo4Fg4) made by @Adovin#6313 on Baritone which I recommend.\n\nThis project is an updated version of [MineBot](https://github.com/leijurv/MineBot/),\nthe original version of the bot for Minecraft 1.8.9, rebuilt for 1.12.2 onwards. Baritone focuses on reliability and particularly performance (it's over [30x faster](https://github.com/cabaletta/baritone/pull/180#issuecomment-423822928) than MineBot at calculating paths).\n\nHave committed at least once a day from Aug 1, 2018, to Aug 1, 2019.\n\n1Leijurv3DWTrGAfmmiTphjhXLvQiHg7K2\n\n# Getting Started\n\nHere are some links to help to get started:\n\n- [Features](FEATURES.md)\n\n- [Installation & setup](SETUP.md)\n\n- [API Javadocs](https://baritone.leijurv.com/)\n\n- [Settings](https://baritone.leijurv.com/baritone/api/Settings.html#field.detail)\n\n- [Usage (chat control)](USAGE.md)\n\n## Stars over time\n\n[![Stargazers over time](https://starchart.cc/cabaletta/baritone.svg)](https://starchart.cc/cabaletta/baritone)\n\n# API\n\nThe API is heavily documented, you can find the Javadocs for the latest release [here](https://baritone.leijurv.com/).\nPlease note that usage of anything located outside of the ``baritone.api`` package is not supported by the API release\njar.\n\nBelow is an example of basic usage for changing some settings, and then pathing to an X/Z goal.\n\n```java\nBaritoneAPI.getSettings().allowSprint.value = true;\nBaritoneAPI.getSettings().primaryTimeoutMS.value = 2000L;\n\nBaritoneAPI.getProvider().getPrimaryBaritone().getCustomGoalProcess().setGoalAndPath(new GoalXZ(10000, 20000));\n```\n\n# FAQ\n\n## Can I use Baritone as a library in my custom utility client?\n\nThat's what it's for, sure! (As long as usage complies with the LGPL 3.0 License)\n\n## How is it so fast?\n\nMagic. (Hours of [leijurv](https://github.com/leijurv/) enduring excruciating pain)\n\n### Additional Special Thanks To:\n\n![YourKit-Logo](https://www.yourkit.com/images/yklogo.png)\n\nYourKit supports open source projects with innovative and intelligent tools for monitoring and profiling Java and .NET applications.\n\nYourKit is the creator of the [YourKit Java Profiler](https://www.yourkit.com/java/profiler/), [YourKit .NET Profiler](https://www.yourkit.com/.net/profiler/), and [YourKit YouMonitor](https://www.yourkit.com/youmonitor/).\n\nWe thank them for granting Baritone an OSS license so that we can make our software the best it can be.\n\n## Why is it called Baritone?\n\nIt's named for FitMC's deep sultry voice.\n"
        },
        {
          "name": "SETUP.md",
          "type": "blob",
          "size": 5.1572265625,
          "content": "# Installation\n\nThe easiest way to install Baritone is to install it as Forge/Neoforge/Fabric mod, but if you know how you can also use with a custom `version.json`\n(Examples: [1.14.4](https://www.dropbox.com/s/rkml3hjokd3qv0m/1.14.4-Baritone.zip?dl=1), [1.15.2](https://www.dropbox.com/s/8rx6f0kts9hvd4f/1.15.2-Baritone.zip?dl=1), [1.16.5](https://www.dropbox.com/s/i6f292o2i7o9acp/1.16.5-Baritone.zip?dl=1)).\n\nOnce Baritone is installed, look [here](USAGE.md) for instructions on how to use it.\n\n## Prebuilt official releases\nReleases are made rarely and are not always up to date with the latest features and bug fixes.\n\nLink to the releases page: [Releases](https://github.com/cabaletta/baritone/releases)\n\nThe mapping between major Minecraft versions and major Baritone versions is as follows\n| Minecraft version | 1.12 | 1.13 | 1.14 | 1.15 | 1.16 | 1.17 | 1.18 | 1.19 | 1.20  | 1.21  |\n|-------------------|------|------|------|------|------|------|------|------|-------|-------|\n| Baritone version  | v1.2 | v1.3 | v1.4 | v1.5 | v1.6 | v1.7 | v1.8 | v1.9 | v1.10 | v1.11 |\n\nAny official release will be GPG signed by leijurv (44A3EA646EADAC6A). Please verify that the hash of the file you download is in `checksums.txt` and that `checksums_signed.asc` is a valid signature by that public keys of `checksums.txt`. \n\nThe build is fully deterministic and reproducible, and you can verify that by running `docker build --no-cache -t cabaletta/baritone .` yourself and comparing the shasum. This works identically on Travis, Mac, and Linux (if you have docker on Windows, I'd be grateful if you could let me know if it works there too).\n\n\n## Artifacts\n\nBuilding Baritone will create the final artifacts in the ``dist`` directory. These are the same as the artifacts created in the [releases](https://github.com/cabaletta/baritone/releases).\n\n**The Forge, NeoForge and Fabric releases can simply be added as a Forge/Neoforge/Fabric mods.**\n\nIf another one of your other mods has a Baritone integration, you want `baritone-api-*-VERSION.jar`.\nIf you want to report a bug and spare us some effort, you want `baritone-unoptimized-*-VERSION.jar`.\nOtherwise, you want `baritone-standalone-*-VERSION.jar`\n\nHere's what the various qualifiers mean\n- **API**: Only the non-api packages are obfuscated. This should be used in environments where other mods would like to use Baritone's features.\n- **Standalone**: Everything is obfuscated. Other mods cannot use Baritone, but you get a bit of extra performance.\n- **Unoptimized**: Nothing is obfuscated. This shouldn't be used in production, but is really helpful for crash reports.\n\n- **No loader**: Loadable as a launchwrapper tweaker against vanilla Minecraft using a custom `version.json`.\n- **Forge/Neoforge/Fabric**: Loadable as a standard mod using the respective loader. The fabric build may or may not work on Quilt.\n\nIf you build from source you will also find mapping files in the `dist` directory. These contain the renamings done by ProGuard and are useful if you want to read obfuscated stack traces.\n\n## Build it yourself\n- Clone or download Baritone\n\n  ![Image](https://i.imgur.com/kbqBtoN.png)\n  - If you choose to download, make sure you download the correct branch and extract the ZIP archive.\n- Follow one of the instruction sets below, based on your preference\n\n## Command Line\nOn Mac OSX and Linux, use `./gradlew` instead of `gradlew`.\n\nThe recommended Java versions by Minecraft version are\n| Minecraft version             | Java version  |\n|-------------------------------|---------------|\n| 1.12.2 - 1.16.5               | 8             |\n| 1.17.1                        | 16            |\n| 1.18.2 - 1.20.4               | 17            |\n| 1.20.5 - 1.21.4               | 21            |\n\nDownload java: https://adoptium.net/\n\nTo check which java version you are using do `java -version` in a command prompt or terminal.\n\n### Building Baritone\n\nThese tasks depend on the minecraft version, but are (for the most part) standard for building mods.\n\nFor more details, see [the build ci action](/.github/workflows/gradle_build.yml) of the branch you want to build.\n\nFor most branches `gradlew build` should build everything, but there are exceptions and this file might be out of date.\n\nMore specifically, on older branches the setup used to be that `gradlew build` builds the tweaker jar\nand `gradlew build -Pbaritone.forge_build` / `gradlew build -Pbaritone.fabric_build` are needed to build\nfor Forge/Fabric instead. And you might have to run `setupDecompWorkspace` first.\n\n## IntelliJ\n- Open the project in IntelliJ as a Gradle project\n- Refresh the Gradle project (or, to be safe, just restart IntelliJ)\n- Depending on the minecraft version, you may need to run `setupDecompWorkspace` or `genIntellijRuns` in order to get everything working\n\n## Github Actions\nMost branches have a CI workflow at `.github/workflows/gradle_build.yml`. If you fork this repository and enable actions for your fork\nyou can push a dummy commit to trigger it and have GitHub build Baritone for you.\n\nIf the commit you want to build is less than 90 days old, you can also find the corresponding workflow run in\n[this list](https://github.com/cabaletta/baritone/actions/workflows/gradle_build.yml) and download the artifacts from there.\n"
        },
        {
          "name": "USAGE.md",
          "type": "blob",
          "size": 8.041015625,
          "content": "(assuming you already have Baritone [set up](SETUP.md))\n\n# Prefix\n\nBaritone's chat control prefix is `#` by default. In Impact, you can also use `.b` as a prefix. (for example, `.b click` instead of `#click`)\n\nBaritone commands can also by default be typed in the chatbox. However if you make a typo, like typing \"gola 10000 10000\" instead of \"goal\" it goes into public chat, which is bad, so using `#` is suggested.\n\nTo disable direct chat control (with no prefix), turn off the `chatControl` setting. To disable chat control with the `#` prefix, turn off the `prefixControl` setting. In Impact, `.b` cannot be disabled. Be careful that you don't leave yourself with all control methods disabled (if you do, reset your settings by deleting the file `minecraft/baritone/settings.txt` and relaunching).\n\n# For Baritone 1.2.10+, 1.3.5+, 1.4.2+\n\nLots of the commands have changed, BUT `#help` is improved vastly (its clickable! commands have tab completion! oh my!).\n\nTry `#help` I promise it won't just send you back here =)\n\n\"wtf where is cleararea\" -> look at `#help sel`\n\n\"wtf where is goto death, goto waypoint\" -> look at `#help wp` \n\njust look at `#help` lmao\n\nWatch this [showcase video](https://youtu.be/CZkLXWo4Fg4)!\n\n# Commands\n\n[Tutorial playlist](https://www.youtube.com/playlist?list=PLnwnJ1qsS7CoQl9Si-RTluuzCo_4Oulpa)\n\n**All** of these commands may need a prefix before them, as above ^.\n\n`help`\n\nTo toggle a boolean setting, just say its name in chat (for example saying `allowBreak` toggles whether Baritone will consider breaking blocks). For a numeric setting, say its name then the new value (like `primaryTimeoutMS 250`). It's case insensitive. To reset a setting to its default value, say `acceptableThrowawayItems reset`. To reset all settings, say `reset`. To see all settings that have been modified from their default values, say `modified`.\n\nCommands in Baritone:\n- `thisway 1000` then `path` to go in the direction you're facing for a thousand blocks\n- `goal x y z` or `goal x z` or `goal y`, then `path` to set a goal to a certain coordinate then path to it\n- `goto x y z` or `goto x z` or `goto y` to go to a certain coordinate (in a single step, starts going immediately)\n- `goal` to set the goal to your player's feet\n- `goal clear` to clear the goal\n- `cancel` or `stop` to stop everything, `forcecancel` is also an option\n- `goto portal` or `goto ender_chest` or `goto block_type` to go to a block. (in Impact, `.goto` is an alias for `.b goto` for the most part)\n- `mine diamond_ore iron_ore` to mine diamond ore or iron ore (turn on the setting `legitMine` to only mine ores that it can actually see. It will explore randomly around y=11 until it finds them.) An amount of blocks can also be specified, for example, `mine 64 diamond_ore`.\n- `click` to click your destination on the screen. Right click path to on top of the block, left click to path into it (either at foot level or eye level), and left click and drag to select an area (`#help sel` to see what you can do with that selection).\n- `follow player playerName` to follow a player. `follow players` to follow any players in range (combine with Kill Aura for a fun time). `follow entities` to follow any entities. `follow entity pig` to follow entities of a specific type.\n- `wp` for waypoints. A \"tag\" is like \"home\" (created automatically on right clicking a bed) or \"death\" (created automatically on death) or \"user\" (has to be created manually). So you might want `#wp save user coolbiome`, then to set the goal `#wp goal coolbiome` then `#path` to path to it. For death, `#wp goal death` will list waypoints under the \"death\" tag (remember stuff is clickable!)\n- `build` to build a schematic. `build blah.schematic` will load `schematics/blah.schematic` and build it with the origin being your player feet. `build blah.schematic x y z` to set the origin. Any of those can be relative to your player (`~ 69 ~-420` would build at x=player x, y=69, z=player z-420).\n- `schematica` to build the schematic that is currently open in schematica\n- `tunnel` to dig and make a tunnel, 1x2. It will only deviate from the straight line if necessary such as to avoid lava. For a dumber tunnel that is really just cleararea, you can `tunnel 3 2 100`, to clear an area 3 high, 2 wide, and 100 deep.\n- `farm` to automatically harvest, replant, or bone meal crops. Use `farm <range>` or `farm <range> <waypoint>` to limit the max distance from the starting point or a waypoint. \n- `axis` to go to an axis or diagonal axis at y=120 (`axisHeight` is a configurable setting, defaults to 120).\n- `explore x z` to explore the world from the origin of x,z. Leave out x and z to default to player feet. This will continually path towards the closest chunk to the origin that it's never seen before. `explorefilter filter.json` with optional invert can be used to load in a list of chunks to load.\n- `invert` to invert the current goal and path. This gets as far away from it as possible, instead of as close as possible. For example, do `goal` then `invert` to run as far as possible from where you're standing at the start.\n- `come` tells Baritone to head towards your camera, useful when freecam doesn't move your player position.\n- `blacklist` will stop baritone from going to the closest block so it won't attempt to get to it.\n- `eta` to get information about the estimated time until the next segment and the goal, be aware that the ETA to your goal is really unprecise.\n- `proc` to view miscellaneous information about the process currently controlling Baritone.\n- `repack` to re-cache the chunks around you.\n- `gc` to call `System.gc()` which may free up some memory.\n- `render` to fix glitched chunk rendering without having to reload all of them.\n- `reloadall` to reload Baritone's world cache or `saveall` to save Baritone's world cache.\n- `find` to search through Baritone's cache and attempt to find the location of the block.\n- `surface` or `top` to tell Baritone to head towards the closest surface-like area, this can be the surface or highest available air space.\n- `version` to get the version of Baritone you're running\n- `damn` daniel\n\nAll the settings and documentation are <a href=\"https://github.com/cabaletta/baritone/blob/master/src/api/java/baritone/api/Settings.java\">here</a>. If you find HTML easier to read than Javadoc, you can look <a href=\"https://baritone.leijurv.com/baritone/api/Settings.html#field.detail\">here</a>.\n\nThere are about a hundred settings, but here are some fun / interesting / important ones that you might want to look at changing in normal usage of Baritone. The documentation for each can be found at the above links.\n- `allowBreak`\n- `allowSprint`\n- `allowPlace`\n- `allowParkour`\n- `allowParkourPlace`\n- `blockPlacementPenalty`\n- `renderCachedChunks` (and `cachedChunksOpacity`) <-- very fun but you need a beefy computer\n- `avoidance` (avoidance of mobs / mob spawners)\n- `legitMine`\n- `followRadius`\n- `backfill` (fill in tunnels behind you)\n- `buildInLayers`\n- `buildRepeatDistance` and `buildRepeatDirection`\n- `worldExploringChunkOffset`\n- `acceptableThrowawayItems`\n- `blocksToAvoidBreaking`\n- `mineScanDroppedItems`\n- `allowDiagonalAscend`\n\n\n\n\n# Troubleshooting / common issues\n\n## Why doesn't Baritone respond to any of my chat commands?\nThis could be one of many things.\n\nFirst, make sure it's actually installed. An easy way to check is seeing if it created the folder `baritone` in your Minecraft folder.\n\nSecond, make sure that you're using the prefix properly, and that chat control is enabled in the way you expect.\n\nFor example, Impact disables direct chat control. (i.e. anything typed in chat without a prefix will be ignored and sent publicly). **This is a saved setting**, so if you run Impact once, `chatControl` will be off from then on, **even in other clients**.\nSo you'll need to use the `#` prefix or edit `baritone/settings.txt` in your Minecraft folder to undo that (specifically, remove the line `chatControl false` then restart your client).\n\n\n## Why can I do `.goto x z` in Impact but nowhere else? Why can I do `-path to x z` in KAMI but nowhere else?\nThese are custom commands that they added; those aren't from Baritone.\nThe equivalent you're looking for is `goto x z`.\n"
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 4.544921875,
          "content": "/*\n * This file is part of Baritone.\n *\n * Baritone is free software: you can redistribute it and/or modify\n * it under the terms of the GNU Lesser General Public License as published by\n * the Free Software Foundation, either version 3 of the License, or\n * (at your option) any later version.\n *\n * Baritone is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * GNU Lesser General Public License for more details.\n *\n * You should have received a copy of the GNU Lesser General Public License\n * along with Baritone.  If not, see <https://www.gnu.org/licenses/>.\n */\n\nallprojects {\n    apply plugin: 'java'\n    apply plugin: \"xyz.wagyourtail.unimined\"\n    apply plugin: \"maven-publish\"\n\n    archivesBaseName = rootProject.archives_base_name\n\n    def vers = \"\"\n    try {\n        vers = 'git describe --always --tags --first-parent --dirty'.execute().text.trim()\n    } catch (Exception e) {\n        println \"Version detection failed: \" + e\n    }\n    if (!vers.startsWith(\"v\")) {\n        println \"using version number: \" + rootProject.mod_version\n        version = rootProject.mod_version\n    } else {\n        version = vers.substring(1)\n        println \"Detected version \" + version\n    }\n    group = rootProject.maven_group\n\n    sourceCompatibility = targetCompatibility = JavaVersion.toVersion(project.java_version)\n    \n    java {\n        toolchain {\n            languageVersion.set(JavaLanguageVersion.of(sourceCompatibility.majorVersion.toInteger()))\n        }\n    }\n\n    repositories {\n        maven {\n            name = 'spongepowered-repo'\n            url = 'https://repo.spongepowered.org/repository/maven-public/'\n        }\n        maven {\n            name = 'fabric-maven'\n            url = 'https://maven.fabricmc.net/'\n        }\n        maven {\n            name = 'impactdevelopment-repo'\n            url = 'https://impactdevelopment.github.io/maven/'\n        }\n        maven {\n            name = \"ldtteam\"\n            url = \"https://maven.parchmentmc.net/\"\n        }\n        // for the newer version of launchwrapper\n        maven {\n            name = \"multimc-maven\"\n            url = \"https://files.multimc.org/maven/\"\n            metadataSources {\n                artifact()\n            }\n        }\n        mavenCentral()\n        maven {\n            name = 'babbaj-repo'\n            url = 'https://babbaj.github.io/maven/'\n        }\n    }\n\n    dependencies {\n        compileOnly \"org.spongepowered:mixin:${project.mixin_version}\"\n        compileOnly \"org.ow2.asm:asm:${project.asm_version}\"\n\n        implementation \"dev.babbaj:nether-pathfinder:${project.nether_pathfinder_version}\"\n    }\n\n    unimined.minecraft(sourceSets.main, true) {\n        version rootProject.minecraft_version\n\n        mappings {\n            intermediary()\n            mojmap()\n            parchment(\"2023.06.26\")\n        }\n    }\n\n    tasks.withType(JavaCompile).configureEach {\n        it.options.encoding = \"UTF-8\"\n\n        def targetVersion = project.java_version.toInteger()\n        if (JavaVersion.current().isJava9Compatible()) {\n            it.options.release = targetVersion\n        }\n    }\n}\n\nunimined.minecraft {\n    runs.off = true\n    defaultRemapJar = false\n}\n\narchivesBaseName = archivesBaseName + \"-common\"\n\nsourceSets {\n    api {\n        compileClasspath += main.compileClasspath\n        runtimeClasspath += main.runtimeClasspath\n    }\n    main {\n        compileClasspath += api.output\n        runtimeClasspath += api.output\n    }\n    test {\n        compileClasspath += main.compileClasspath + main.runtimeClasspath + main.output\n        runtimeClasspath += main.compileClasspath + main.runtimeClasspath + main.output\n    }\n    launch {\n        compileClasspath += main.compileClasspath + main.runtimeClasspath + main.output\n        runtimeClasspath += main.compileClasspath + main.runtimeClasspath + main.output\n    }\n    schematica_api {\n        compileClasspath += main.compileClasspath\n        runtimeClasspath += main.runtimeClasspath\n    }\n    main {\n        compileClasspath += schematica_api.output\n        runtimeClasspath += schematica_api.output\n    }\n}\n\ndependencies {\n    testImplementation 'junit:junit:4.13.2'\n}\n\njar {\n    from sourceSets.main.output, sourceSets.launch.output, sourceSets.api.output\n}\n\njavadoc {\n    options.addStringOption('Xwerror', '-quiet') // makes the build fail on travis when there is a javadoc error\n    options.linkSource true\n    options.encoding \"UTF-8\" // allow emoji in comments :^)\n    source = sourceSets.api.allJava\n    classpath += sourceSets.api.compileClasspath\n}\n"
        },
        {
          "name": "buildSrc",
          "type": "tree",
          "content": null
        },
        {
          "name": "fabric",
          "type": "tree",
          "content": null
        },
        {
          "name": "forge",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 0.3515625,
          "content": "org.gradle.jvmargs=-Xmx4G\n\nmod_version=1.9.3\nmaven_group=baritone\narchives_base_name=baritone\n\njava_version=17\n\nminecraft_version=1.19.4\n\nforge_version=45.0.43\n\nfabric_version=0.14.11\n\nnether_pathfinder_version=1.4.1\n\n// These dependencies are used for common and tweaker\n// while mod loaders usually ship their own version\nmixin_version=0.8.5\nasm_version=9.3\n"
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 5.638671875,
          "content": "#!/usr/bin/env sh\n\n#\n# Copyright 2015 the original author or authors.\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\");\n# you may not use this file except in compliance with the License.\n# You may obtain a copy of the License at\n#\n#      https://www.apache.org/licenses/LICENSE-2.0\n#\n# Unless required by applicable law or agreed to in writing, software\n# distributed under the License is distributed on an \"AS IS\" BASIS,\n# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n# See the License for the specific language governing permissions and\n# limitations under the License.\n#\n\n##############################################################################\n##\n##  Gradle start up script for UN*X\n##\n##############################################################################\n\n# Attempt to set APP_HOME\n# Resolve links: $0 may be a link\nPRG=\"$0\"\n# Need this for relative symlinks.\nwhile [ -h \"$PRG\" ] ; do\n    ls=`ls -ld \"$PRG\"`\n    link=`expr \"$ls\" : '.*-> \\(.*\\)$'`\n    if expr \"$link\" : '/.*' > /dev/null; then\n        PRG=\"$link\"\n    else\n        PRG=`dirname \"$PRG\"`\"/$link\"\n    fi\ndone\nSAVED=\"`pwd`\"\ncd \"`dirname \\\"$PRG\\\"`/\" >/dev/null\nAPP_HOME=\"`pwd -P`\"\ncd \"$SAVED\" >/dev/null\n\nAPP_NAME=\"Gradle\"\nAPP_BASE_NAME=`basename \"$0\"`\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS='\"-Xmx64m\" \"-Xms64m\"'\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=\"maximum\"\n\nwarn () {\n    echo \"$*\"\n}\n\ndie () {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n}\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\nnonstop=false\ncase \"`uname`\" in\n  CYGWIN* )\n    cygwin=true\n    ;;\n  Darwin* )\n    darwin=true\n    ;;\n  MSYS* | MINGW* )\n    msys=true\n    ;;\n  NONSTOP* )\n    nonstop=true\n    ;;\nesac\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=\"$JAVA_HOME/jre/sh/java\"\n    else\n        JAVACMD=\"$JAVA_HOME/bin/java\"\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=\"java\"\n    which java >/dev/null 2>&1 || die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\nfi\n\n# Increase the maximum file descriptors if we can.\nif [ \"$cygwin\" = \"false\" -a \"$darwin\" = \"false\" -a \"$nonstop\" = \"false\" ] ; then\n    MAX_FD_LIMIT=`ulimit -H -n`\n    if [ $? -eq 0 ] ; then\n        if [ \"$MAX_FD\" = \"maximum\" -o \"$MAX_FD\" = \"max\" ] ; then\n            MAX_FD=\"$MAX_FD_LIMIT\"\n        fi\n        ulimit -n $MAX_FD\n        if [ $? -ne 0 ] ; then\n            warn \"Could not set maximum file descriptor limit: $MAX_FD\"\n        fi\n    else\n        warn \"Could not query maximum file descriptor limit: $MAX_FD_LIMIT\"\n    fi\nfi\n\n# For Darwin, add options to specify how the application appears in the dock\nif $darwin; then\n    GRADLE_OPTS=\"$GRADLE_OPTS \\\"-Xdock:name=$APP_NAME\\\" \\\"-Xdock:icon=$APP_HOME/media/gradle.icns\\\"\"\nfi\n\n# For Cygwin or MSYS, switch paths to Windows format before running java\nif [ \"$cygwin\" = \"true\" -o \"$msys\" = \"true\" ] ; then\n    APP_HOME=`cygpath --path --mixed \"$APP_HOME\"`\n    CLASSPATH=`cygpath --path --mixed \"$CLASSPATH\"`\n\n    JAVACMD=`cygpath --unix \"$JAVACMD\"`\n\n    # We build the pattern for arguments to be converted via cygpath\n    ROOTDIRSRAW=`find -L / -maxdepth 1 -mindepth 1 -type d 2>/dev/null`\n    SEP=\"\"\n    for dir in $ROOTDIRSRAW ; do\n        ROOTDIRS=\"$ROOTDIRS$SEP$dir\"\n        SEP=\"|\"\n    done\n    OURCYGPATTERN=\"(^($ROOTDIRS))\"\n    # Add a user-defined pattern to the cygpath arguments\n    if [ \"$GRADLE_CYGPATTERN\" != \"\" ] ; then\n        OURCYGPATTERN=\"$OURCYGPATTERN|($GRADLE_CYGPATTERN)\"\n    fi\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    i=0\n    for arg in \"$@\" ; do\n        CHECK=`echo \"$arg\"|egrep -c \"$OURCYGPATTERN\" -`\n        CHECK2=`echo \"$arg\"|egrep -c \"^-\"`                                 ### Determine if an option\n\n        if [ $CHECK -ne 0 ] && [ $CHECK2 -eq 0 ] ; then                    ### Added a condition\n            eval `echo args$i`=`cygpath --path --ignore --mixed \"$arg\"`\n        else\n            eval `echo args$i`=\"\\\"$arg\\\"\"\n        fi\n        i=`expr $i + 1`\n    done\n    case $i in\n        0) set -- ;;\n        1) set -- \"$args0\" ;;\n        2) set -- \"$args0\" \"$args1\" ;;\n        3) set -- \"$args0\" \"$args1\" \"$args2\" ;;\n        4) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" ;;\n        5) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" ;;\n        6) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" ;;\n        7) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" ;;\n        8) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" ;;\n        9) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" \"$args8\" ;;\n    esac\nfi\n\n# Escape application args\nsave () {\n    for i do printf %s\\\\n \"$i\" | sed \"s/'/'\\\\\\\\''/g;1s/^/'/;\\$s/\\$/' \\\\\\\\/\" ; done\n    echo \" \"\n}\nAPP_ARGS=`save \"$@\"`\n\n# Collect all arguments for the java command, following the shell quoting and substitution rules\neval set -- $DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS \"\\\"-Dorg.gradle.appname=$APP_BASE_NAME\\\"\" -classpath \"\\\"$CLASSPATH\\\"\" org.gradle.wrapper.GradleWrapperMain \"$APP_ARGS\"\n\nexec \"$JAVACMD\" \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.611328125,
          "content": "@rem\n@rem Copyright 2015 the original author or authors.\n@rem\n@rem Licensed under the Apache License, Version 2.0 (the \"License\");\n@rem you may not use this file except in compliance with the License.\n@rem You may obtain a copy of the License at\n@rem\n@rem      https://www.apache.org/licenses/LICENSE-2.0\n@rem\n@rem Unless required by applicable law or agreed to in writing, software\n@rem distributed under the License is distributed on an \"AS IS\" BASIS,\n@rem WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n@rem See the License for the specific language governing permissions and\n@rem limitations under the License.\n@rem\n\n@if \"%DEBUG%\" == \"\" @echo off\n@rem ##########################################################################\n@rem\n@rem  Gradle startup script for Windows\n@rem\n@rem ##########################################################################\n\n@rem Set local scope for the variables with windows NT shell\nif \"%OS%\"==\"Windows_NT\" setlocal\n\nset DIRNAME=%~dp0\nif \"%DIRNAME%\" == \"\" set DIRNAME=.\nset APP_BASE_NAME=%~n0\nset APP_HOME=%DIRNAME%\n\n@rem Resolve any \".\" and \"..\" in APP_HOME to make it shorter.\nfor %%i in (\"%APP_HOME%\") do set APP_HOME=%%~fi\n\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nset DEFAULT_JVM_OPTS=\"-Xmx64m\" \"-Xms64m\"\n\n@rem Find java.exe\nif defined JAVA_HOME goto findJavaFromJavaHome\n\nset JAVA_EXE=java.exe\n%JAVA_EXE% -version >NUL 2>&1\nif \"%ERRORLEVEL%\" == \"0\" goto execute\n\necho.\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:findJavaFromJavaHome\nset JAVA_HOME=%JAVA_HOME:\"=%\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\n\nif exist \"%JAVA_EXE%\" goto execute\n\necho.\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:execute\n@rem Setup the command line\n\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\n\n\n@rem Execute Gradle\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %*\n\n:end\n@rem End local scope for the variables with windows NT shell\nif \"%ERRORLEVEL%\"==\"0\" goto mainEnd\n\n:fail\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\nrem the _cmd.exe /c_ return code!\nif  not \"\" == \"%GRADLE_EXIT_CONSOLE%\" exit 1\nexit /b 1\n\n:mainEnd\nif \"%OS%\"==\"Windows_NT\" endlocal\n\n:omega\n"
        },
        {
          "name": "jitpack.yml",
          "type": "blob",
          "size": 0.1162109375,
          "content": "before_install:\n  - curl -s \"https://get.sdkman.io\" | bash\n  - sdk install java 17.0.5-tem\n  - sdk use java 17.0.5-tem\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 1.51953125,
          "content": "/*\n * This file is part of Baritone.\n *\n * Baritone is free software: you can redistribute it and/or modify\n * it under the terms of the GNU Lesser General Public License as published by\n * the Free Software Foundation, either version 3 of the License, or\n * (at your option) any later version.\n *\n * Baritone is distributed in the hope that it will be useful,\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n * GNU Lesser General Public License for more details.\n *\n * You should have received a copy of the GNU Lesser General Public License\n * along with Baritone.  If not, see <https://www.gnu.org/licenses/>.\n */\n\npluginManagement {\n    repositories {\n        mavenLocal()\n        maven {\n            name = 'WagYourMaven'\n            url = 'https://maven.wagyourtail.xyz/snapshots'\n        }\n        maven {\n            name = 'ForgeMaven'\n            url = 'https://maven.minecraftforge.net/'\n        }\n        maven {\n            name = 'FabricMaven'\n            url = 'https://maven.fabricmc.net/'\n        }\n        mavenCentral()\n        gradlePluginPortal() {\n            content {\n                excludeGroup \"org.apache.logging.log4j\"\n            }\n        }\n    }\n}\n\nrootProject.name = 'baritone'\n\ninclude(\"tweaker\")\nif (System.getProperty(\"Baritone.enabled_platforms\") == null) {\n    System.setProperty(\"Baritone.enabled_platforms\", \"fabric,forge\")\n}\nfor (platform in System.getProperty(\"Baritone.enabled_platforms\").split(\",\")) {\n       include(platform)\n}\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tweaker",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}