{
  "metadata": {
    "timestamp": 1736708674291,
    "page": 76,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "wildfirechat/im-server",
      "stars": 8013,
      "defaultBranch": "wildfirechat",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.2919921875,
          "content": "# EditorConfig is awesome: http://EditorConfig.org\n\n# top-most EditorConfig file\nroot = true\n\n# Unix-style newlines with a newline ending every file\n[*]\nend_of_line = lf\ninsert_final_newline = true\ncharset = utf-8\nindent_style = space\nindent_size = 4\nmax_line_length=120\n\n[*.gradle]\nindent_size = 2\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0556640625,
          "content": "*.cpp linguist-language=java\n*.cc linguist-language=java\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.962890625,
          "content": "/build\n*/build/\n/target/\n/parser/target/\n/benchmarking/target/\n.idea/\n*.iml\nbroker/target/\nclient/target/\nparser_commons/target/\nnetty_parser/target/\nnetty_parser/target/\nparser_commons/target/\ndistribution/target/\nbroker/moquette.log\nbroker/runner\n/bundle/target/\n/bundle/runner/\n/osgi_test/target/\n/perf/target/\n/mapdb_storage/target/\n*~\n*.log*\n.DS_Store\n.settings/\n.project\n.classpath\n/*/bin/\n*.swp\n\n*.class\n\n# Mobile Tools for Java (J2ME)\n.mtj.tmp/\n\n# Package Files #\n*.war\n*.ear\n\n# virtual machine crash logs, see http://www.java.com/en/download/help/error_hotspot.xml\nhs_err_pid*\nbroker/*moquette_store.*\nembedding_moquette/target/\nbroker/nb-configuration.xml\nbroker/nbactions-Server.xml\n\nmaven-metadata.xml\n/.gradle/\n/bin/\nbroker/config/git.properties\ndistribution/src/main/resources/git.properties\nlicense/target\nserver/target\nbroker/h2db\nbroker/media\ncommon/target\nserver/target\nsdk/target\nmoments/target\nmonitor\nwildfire_jmeter\ngit.properties\nwildfirechat.license\nbroker/logs\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.26953125,
          "content": "language: java\njdk:\n  - oraclejdk8\nbefore_cache:\n  - rm -f  $HOME/.gradle/caches/modules-2/modules-2.lock\n  - rm -fr $HOME/.gradle/caches/*/plugin-resolution/\ncache:\n  directories:\n    - $HOME/.gradle/caches/\n    - $HOME/.gradle/wrapper/\n\nscript:\n    - ./gradlew install test\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 16.3642578125,
          "content": "Creative Commons Attribution-NoDerivs 3.0 Unported\n\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS LICENSE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\n\nLicense\n\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n1. Definitions\na. \"Adaptation\" means a work based upon the Work, or upon the Work and other pre-existing works, such as a translation, adaptation, derivative work, arrangement of music or other alterations of a literary or artistic work, or phonogram or performance and includes cinematographic adaptations or any other form in which the Work may be recast, transformed, or adapted including in any form recognizably derived from the original, except that a work that constitutes a Collection will not be considered an Adaptation for the purpose of this License. For the avoidance of doubt, where the Work is a musical work, performance or phonogram, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered an Adaptation for the purpose of this License.\nb. \"Collection\" means a collection of literary or artistic works, such as encyclopedias and anthologies, or performances, phonograms or broadcasts, or other works or subject matter other than works listed in Section 1(f) below, which, by reason of the selection and arrangement of their contents, constitute intellectual creations, in which the Work is included in its entirety in unmodified form along with one or more other contributions, each constituting separate and independent works in themselves, which together are assembled into a collective whole. A work that constitutes a Collection will not be considered an Adaptation (as defined above) for the purposes of this License.\nc. \"Distribute\" means to make available to the public the original and copies of the Work through sale or other transfer of ownership.\nd. \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this License.\ne. \"Original Author\" means, in the case of a literary or artistic work, the individual, individuals, entity or entities who created the Work or if no individual or entity can be identified, the publisher; and in addition (i) in the case of a performance the actors, singers, musicians, dancers, and other persons who act, sing, deliver, declaim, play in, interpret or otherwise perform literary or artistic works or expressions of folklore; (ii) in the case of a phonogram the producer being the person or legal entity who first fixes the sounds of a performance or other sounds; and, (iii) in the case of broadcasts, the organization that transmits the broadcast.\nf. \"Work\" means the literary and/or artistic work offered under the terms of this License including without limitation any production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression including digital form, such as a book, pamphlet and other writing; a lecture, address, sermon or other work of the same nature; a dramatic or dramatico-musical work; a choreographic work or entertainment in dumb show; a musical composition with or without words; a cinematographic work to which are assimilated works expressed by a process analogous to cinematography; a work of drawing, painting, architecture, sculpture, engraving or lithography; a photographic work to which are assimilated works expressed by a process analogous to photography; a work of applied art; an illustration, map, plan, sketch or three-dimensional work relative to geography, topography, architecture or science; a performance; a broadcast; a phonogram; a compilation of data to the extent it is protected as a copyrightable work; or a work performed by a variety or circus performer to the extent it is not otherwise considered a literary or artistic work.\ng. \"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.\nh. \"Publicly Perform\" means to perform public recitations of the Work and to communicate to the public those public recitations, by any means or process, including by wire or wireless means or public digital performances; to make available to the public Works in such a way that members of the public may access these Works from a place and at a place individually chosen by them; to perform the Work to the public by any means or process and the communication to the public of the performances of the Work, including by public digital performance; to broadcast and rebroadcast the Work by any means including signs, sounds or images.\ni. \"Reproduce\" means to make copies of the Work by any means including without limitation by sound or visual recordings and the right of fixation and reproducing fixations of the Work, including storage of a protected performance or phonogram in digital form or other electronic medium.\n2. Fair Dealing Rights. Nothing in this License is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions that are provided for in connection with the copyright protection under copyright law or other applicable laws.\n3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:\na. to Reproduce the Work, to incorporate the Work into one or more Collections, and to Reproduce the Work as incorporated in the Collections; and,\nb. to Distribute and Publicly Perform the Work including as incorporated in Collections.\nc. For the avoidance of doubt:\ni. Non-waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme cannot be waived, the Licensor reserves the exclusive right to collect such royalties for any exercise by You of the rights granted under this License;\nii. Waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme can be waived, the Licensor waives the exclusive right to collect such royalties for any exercise by You of the rights granted under this License; and,\niii. Voluntary License Schemes. The Licensor waives the right to collect royalties, whether individually or, in the event that the Licensor is a member of a collecting society that administers voluntary licensing schemes, via that society, from any exercise by You of the rights granted under this License.\nThe above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats, but otherwise you have no rights to make Adaptations. Subject to Section 8(f), all rights not expressly granted by Licensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:\na. You may Distribute or Publicly Perform the Work only under the terms of this License. You must include a copy of, or the Uniform Resource Identifier (URI) for, this License with every copy of the Work You Distribute or Publicly Perform. You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of the recipient of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties with every copy of the Work You Distribute or Publicly Perform. When You Distribute or Publicly Perform the Work, You may not impose any effective technological measures on the Work that restrict the ability of a recipient of the Work from You to exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as incorporated in a Collection, but this does not require the Collection apart from the Work itself to be made subject to the terms of this License. If You create a Collection, upon notice from any Licensor You must, to the extent practicable, remove from the Collection any credit as required by Section 4(b), as requested.\nb. If You Distribute, or Publicly Perform the Work or Collections, You must, unless a request has been made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or if the Original Author and/or Licensor designate another party or parties (e.g., a sponsor institute, publishing entity, journal) for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the name of such party or parties; (ii) the title of the Work if supplied; (iii) to the extent reasonably practicable, the URI, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work. The credit required by this Section 4(b) may be implemented in any reasonable manner; provided, however, that in the case of a Collection, at a minimum such credit will appear, if a credit for all contributing authors of the Collection appears, then as part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original Author, Licensor and/or Attribution Parties.\nc. Except as otherwise agreed in writing by the Licensor or as may be otherwise permitted by applicable law, if You Reproduce, Distribute or Publicly Perform the Work either by itself or as part of any Collections, You must not distort, mutilate, modify or take other derogatory action in relation to the Work which would be prejudicial to the Original Author's honor or reputation.\n5. Representations, Warranties and Disclaimer\nUNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n7. Termination\na. This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Collections from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.\nb. Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.\n8. Miscellaneous\na. Each time You Distribute or Publicly Perform the Work or a Collection, the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.\nb. If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\nc. No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.\nd. This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.\ne. The rights granted under, and the subject matter referenced, in this License were drafted utilizing the terminology of the Berne Convention for the Protection of Literary and Artistic Works (as amended on September 28, 1979), the Rome Convention of 1961, the WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms Treaty of 1996 and the Universal Copyright Convention (as revised on July 24, 1971). These rights and subject matter take effect in the relevant jurisdiction in which the License terms are sought to be enforced according to the corresponding provisions of the implementation of those treaty provisions in the applicable national law. If the standard suite of rights granted under applicable copyright law includes additional rights not granted under this License, such additional rights are deemed to be included in the License; this License is not intended to restrict the license of any rights under applicable law.\nCreative Commons Notice\n\nCreative Commons is not a party to this License, and makes no warranty whatsoever in connection with the Work. Creative Commons will not be liable to You or any party on any legal theory for any damages whatsoever, including without limitation any general, special, incidental or consequential damages arising in connection to this license. Notwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor hereunder, it shall have all rights and obligations of Licensor.\n\nExcept for the limited purpose of indicating to the public that the Work is licensed under the CCPL, Creative Commons does not authorize the use by either party of the trademark \"Creative Commons\" or any related trademark or logo of Creative Commons without the prior written consent of Creative Commons. Any permitted use will be in compliance with Creative Commons' then-current trademark usage guidelines, as may be published on its website or otherwise made available upon request from time to time. For the avoidance of doubt, this trademark restriction does not form part of this License.\n\nCreative Commons may be contacted at http://creativecommons.org/.\n\n"
        },
        {
          "name": "LICENSE_996",
          "type": "blob",
          "size": 2.5244140625,
          "content": "Copyright (c) <2019> <wildfirechat>\n\nAnti 996 License Version 1.0 (Draft)\n\nPermission is hereby granted to any individual or legal entity\nobtaining a copy of this licensed work (including the source code,\ndocumentation and/or related items, hereinafter collectively referred\nto as the \"licensed work\"), free of charge, to deal with the licensed\nwork for any purpose, including without limitation, the rights to use,\nreproduce, modify, prepare derivative works of, distribute, publish \nand sublicense the licensed work, subject to the following conditions:\n\n1. The individual or the legal entity must conspicuously display,\nwithout modification, this License and the notice on each redistributed \nor derivative copy of the Licensed Work.\n\n2. The individual or the legal entity must strictly comply with all\napplicable laws, regulations, rules and standards of the jurisdiction\nrelating to labor and employment where the individual is physically\nlocated or where the individual was born or naturalized; or where the\nlegal entity is registered or is operating (whichever is stricter). In\ncase that the jurisdiction has no such laws, regulations, rules and\nstandards or its laws, regulations, rules and standards are\nunenforceable, the individual or the legal entity are required to\ncomply with Core International Labor Standards.\n\n3. The individual or the legal entity shall not induce or force its\nemployee(s), whether full-time or part-time, or its independent\ncontractor(s), in any methods, to agree in oral or written form, to\ndirectly or indirectly restrict, weaken or relinquish his or her\nrights or remedies under such laws, regulations, rules and standards\nrelating to labor and employment as mentioned above, no matter whether\nsuch written or oral agreement are enforceable under the laws of the\nsaid jurisdiction, nor shall such individual or the legal entity\nlimit, in any methods, the rights of its employee(s) or independent\ncontractor(s) from reporting or complaining to the copyright holder or\nrelevant authorities monitoring the compliance of the license about\nits violation(s) of the said license.\n\nTHE LICENSED WORK IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM,\nDAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN ANY WAY CONNECTION WITH THE\nLICENSED WORK OR THE USE OR OTHER DEALINGS IN THE LICENSED WORK.\n"
        },
        {
          "name": "LICENSE_mqtt-jmeter",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 16.896484375,
          "content": "# 野火IM解决方案\n野火IM是专业级的即时通讯和实时音视频整体解决方案，由北京野火无限网络科技有限公司维护和支持。\n\n## 功能特性\n* 极致地硬件利用率，IM服务最低128M内存即可运行，上不封顶。\n* 协议先进，采用MQTT+Protobuf组合，流量和性能极致优化。\n* 性能强大，专业版IM服务支持百万在线和集群部署，业内顶尖性能水平，详情参考野火性能报告。\n* 部署运维简单，依赖服务少，稍加配置一键启动。\n* 安全加密。网络连接AES加密。客户端数据库SqlCipher加密。安全无小事。\n* 全平台客户端，支持Android、iOS、鸿蒙、Web、小程序、UniApp、Flutter、Windows、Mac OS、Linux等所有常见平台。\n* 四端同时在线（移动端，pc端，web端和小程序端），数据和状态多端完美同步。\n* 支持国产化。支持国产化操作系统、国产化芯片和国产数据库。支持国密加密。\n* 客户端使用微信[mars](https://github.com/tencent/mars)连接库，野火IM可能是最适应中国网络国情的即时通讯服务。\n* 支持加速点加速，即可用于全球应用，也可用于政企内外双网复杂的网络环境。\n* 支持阅读回执和在线状态功能，适用于办公环境。\n* 音视频多种解决方案，丰俭由人，可自由选择。\n* 高级音视频功能强大，支持9人以上的群组视频通话，支持1080P视频，支持会议模式，支持百人以上会议，支持服务器端录制。\n* 全私有部署，可不依赖任何第三方服务，完全内网部署。\n* 功能齐全，涵盖所有常见即时通讯功能。另外具有强大的可扩展能力。代码开源率高，二次开发简单。\n* 结构设计合理，客户端分功能库、UI库和应用三层。应用成熟完善，开箱即用，也可把SDK嵌入其它应用。\n* 拥有应用开放平台，可以开发和创建自建应用，扩展您的工作台。\n* API丰富，方便与其它服务系统的对接。\n* 拥有机器人和公众号功能，免费的频道（公众号）管理后台。\n* 超级群组功能，可以支持万人大群。\n* 支持多个IM服务组网互通，打破孤岛，适用于集团公司下多个分公司互联互通。\n* 社区版IM服务和移动端免费商用，可以免费构建出完备的移动互联网应用。\n* 收费项目非常便宜，野火独有的试用模式，可以先部署到客户环境试用6个月，试用满意后再购买，避免上当受骗。\n* 技术支持专业高效，***核心研发***及时处理issue和工单，能最快解决用户的技术难题。技术支持不收费，让客户顺利使用是我们最大的愿望。\n\n## 野火开源项目\n主要包括以下项目：\n\n| [GitHub仓库](https://github.com/wildfirechat)      | [码云仓库](https://gitee.com/wfchat)        | 说明                                                                                      \n| ------------------------------------------------------------ | ----------------------------------------------------- | --------------------------------------------------------------------------\n| [im-server](https://github.com/wildfirechat/im-server)       | [im-server](https://gitee.com/wfchat/im-server)          | 野火社区版IM服务，野火IM的核心服务，处理所有IM相关业务。  |\n| [app-server](https://github.com/wildfirechat/app-server)     | [app-server](https://gitee.com/wfchat/app-server)     | Demo应用服务，模拟客户的应用服登陆处理逻辑及部分二次开发示例。 |\n| [robot_server](https://github.com/wildfirechat/robot_server) | [robot_server](https://gitee.com/wfchat/robot_server) | 机器人服务，演示野火机器人对接其它系统的方法。 |\n| [push_server](https://github.com/wildfirechat/push_server)   | [push_server](https://gitee.com/wfchat/push_server)   | 推送服务器，可以对接所有的系统厂商推送服务或者第三方推送服务。 |\n| [wf-minio](https://github.com/wildfirechat/WF-minio)   | [wf-minio](https://gitee.com/wfchat/WF-minio)   | 私有对象存储服务，用来支持野火IM专业版的文件存储。 |\n| [wf-janus](https://github.com/wildfirechat/wf-janus  )   | [wf-janus](https://gitee.com/wfchat/wf-janus  )   | 高级音视频媒体服务。 |\n| [open-platform](https://github.com/wildfirechat/open-platform)   | [open-platform](https://gitee.com/wfchat/open-platform)   | 野火开放平台服务。  |\n| [daily-report](https://github.com/wildfirechat/daily-report)   | [daily-report](https://github.com/wildfirechat/daily-report)   | 野火开放平台日报 demo服务。 |\n| [channel-platform](https://github.com/wildfirechat/channel-platform)   | [channel-platform](https://gitee.com/wfchat/channel-platform)   | 野火频道(公众号)平台服务。  |\n| [organization-platform](https://github.com/wildfirechat/organization-platform)   | [organization-platform](https://gitee.com/wfchat/organization-platform)   | 野火组织通讯录服务。  |\n| [android-chat](https://github.com/wildfirechat/android-chat) | [android-chat](https://gitee.com/wfchat/android-chat) | 野火IM Android SDK源码和App源码。 |\n| [ios-chat](https://github.com/wildfirechat/ios-chat)         | [ios-chat](https://gitee.com/wfchat/ios-chat)         | 野火IM iOS SDK源码和App源码。|\n| [pc-chat](https://github.com/wildfirechat/vue-pc-chat)       | [pc-chat](https://gitee.com/wfchat/vue-pc-chat)       | 基于[Electron](https://electronjs.org/)的PC 端，支持Windows、Mac、Linux（包括国产化linux系统和CPU）。   |\n| [web-chat](https://github.com/wildfirechat/vue-chat)         | [web-chat](https://gitee.com/wfchat/vue-chat)         | 野火IM Web 端, [体验地址](https://web.wildfirechat.cn)。  |\n| [wx-chat](https://github.com/wildfirechat/wx-chat)           | [wx-chat](https://gitee.com/wfchat/wx-chat)           | 小程序平台的Demo(支持微信、百度、阿里、字节、QQ 等小程序平台)。  |\n| [uni-chat](https://github.com/wildfirechat/uni-chat)           | [uni-chat](https://gitee.com/wfchat/uni-chat)           | UniApp平台移动端应用(使用原生插件)。   |\n| [uni-wfc-client](https://github.com/wildfirechat/uni-wfc-client)           | [uni-wfc-client](https://gitee.com/wfchat/uni-wfc-client)           | UniApp平台原生插件。已[商店](https://ext.dcloud.net.cn/plugin?id=7895)上架   |\n| [wfc_flutter_plugins](https://github.com/wildfirechat/wfc_flutter_plugins)           | [flutter_imclient](https://gitee.com/wfchat/wfc_flutter_plugins)           | Flutter平台原生插件，支持IM和音视频通话。   |\n| [docs](https://github.com/wildfirechat/docs)                 | [docs](https://gitee.com/wfchat/docs)                 | 野火IM相关文档，包含设计、概念、开发、使用说明，[在线查看](https://docs.wildfirechat.cn/)。 |\n\n## 野火开发文档\n[在线文档](https://docs.wildfirechat.cn/)\n\n## 野火IM论坛\n[野火IM论坛](https://bbs.wildfirechat.cn)\n\n## 野火性能测试报告及测试方法\n[Github](https://github.com/wildfirechat/Performance_Test), [码云](https://gitee.com/wfchat/Performance_Test)。\n\n## 野火Demo\n请使用微信扫码下载安装体验野火IM移动客户端\n\n![野火IM](http://static.wildfirechat.cn/download_qrcode.png)\n\nWeb客户端点击[这里](https://web.wildfirechat.cn)\n\nPC客户端点[这里](https://github.com/wildfirechat/vue-pc-chat/releases)下载安装。\n\n小程序客户端请用微信扫码\n\n![野火IM](http://static.wildfirechat.net/wx.jpg)\n\n## 快速开始\n可以按照[快速开始](https://docs.wildfirechat.cn/quick_start/)来部署应用服务和IM服务，然后打包移动端，就可以完成聊天和通话功能。\n\n之后再部署开放平台服务、频道（公众号）服务、机器人服务、推送服务、Turn服务（音视频服务）来实现完整的应用功能，详情可以详细阅读文档。\n\n## 联系我们\n商务合作请微信联系：\n\n* 微信1：wildfirechat\n* 微信2：wfchat\n\n## 问题交流\n\n1. 如果大家发现bug，请在GitHub或码云提issue；如果有需求也请给我们提issue。\n2. 其他问题，请到[野火IM论坛](http://bbs.wildfirechat.cn/)进行交流学习\n3. 关注我们的公众号。我们有新版本发布或者有重大更新会通过公众号通知大家，另外我们也会不定期的发布一些关于野火IM的技术介绍。\n\n<img src=\"http://static.wildfirechat.cn/wx_wfc_qrcode.jpg\" width = 50% height = 50% />\n\n我们有核心研发工程师轮流值班处理issue和论坛，会及时处理的，疑难Bug的修改和新需求的开发我们也会尽快解决。\n\n\n## 编译\n```\nmvn clean package\n```\n生成的目标文件在```./distribution/target/distribution-xxxx-bundle-tar.tar.gz```\n\n## 配置\n解压```distribution-xxxx-bundle-tar.tar.gz```，修改解压出来的```config```目录下的```wildfirechat.conf```，可以阅读配置文件注释和文档，对其它配置项进行调整。\n\n## 运行\n在解压```distribution-xxxx-bundle-tar.tar.gz```后的目录下运行如下命令：\n```\n./bin/wildfirechat.sh\n```\n\n## 验证\n1. 在浏览器中输入地址 ```http://${ip}/api/version```可以看到返回一个json文件。\n2. 部署[应用服务](https://github.com/wildfirechat/app-server)，配置和编译[Android客户端](https://github.com/wildfirechat/android-chat)和[iOS客户端](https://github.com/wildfirechat/ios-chat)进行验证。详情可参考[快速开始](https://docs.wildfirechat.cn/quick_start/)。\n\n## 打包RPM格式\n打包会生成Java包和deb安装包，如果需要rpm安装包，请在```distribution/pom.xml```中取消注释生成rpm包的plugin。另外还需要本地安装有rpm，在linux或者mac系统中很容易安装，在windows系统需要安装cygwin并安装rpm，具体信息请百度查询。\n\n修改之后运行编译命令```mvn clean package```，rpm包生成在```distribution/target```目录下。\n\n## Epoll\n在linux系统中打开Epoll开关可以提高性能，默认软件包内打包的是x86_64的epoll native sdk。如果是arm64的机器，可以把[broker pom](./broker/pom.xml)文件中修改如下：\n```xml\n<dependency>\n    <groupId>io.netty</groupId>\n    <artifactId>netty-transport-native-epoll</artifactId>\n    <version>${netty.version}</version>\n<!--    <classifier>linux-x86_64</classifier>-->\n    <classifier>linux-aarch_64</classifier>\n</dependency>\n```\n然后重新打包。专业版IM服务软件包中有arm64架构的sdk，可以直接替换。epoll只支持x86_64和arm64两个架构，其他架构不要把epoll开关打开。\n\n## 升级说明\n1. 从0.42 版本增加了群成员数限制，默认为2000。如果您从之前的版本升级到这个版本或以后，需要注意到群成员数的限制。升级之后超出限制的群不受影响，但不能继续加人，如果您想修改默认值，可以在升级版本之后，修改t_setting表，把默认的大小改为您期望的人数。另外修改t_group表，把已经存在的群组max_member_count改成您期望的，然后重启。\n2. 0.50版本添加了是否允许客户端发送群操作通知的配置。如果您在客户端自定义群通知，需要在服务器端配置允许，没有使用自定义群操作通知的不受影响。***\n3. 0.46和0.47版本升级到0.48及以后版本时，可能会提示flyway migrate 38错误，请执行 [修复脚本](https://github.com/wildfirechat/server/blob/wildfirechat/flyway_repaire_migrate_38.sql) 进行修复。0.46和0.47版本之外的版本不会出现此问题。\n4. 从0.54之前版本升级到0.54及以后版本时，会提示flyway migrate错误。因为0.54版本删除了sql脚本中默认敏感词的内容，flyway checksum失败。请执行```update flyway_schema_history set checksum = 0 where script = 'V17__add_default_sensitive_word.sql';```来修复。\n5. 从0.59之前的版本升级到之后的版本执行数据库升级时间比较长，请耐心等待提示运行成功，避免中途中断。\n6. 0.62/0.63 版本有严重的问题，请使用0.64及以后版本，或者0.61版。\n7. 从0.68 版本起添加了pc在线是否默认手机接收推送的开关，默认为开，与以前版本作用相反，请注意兼容（可以关掉与之前保持一致或者升级客户端）\n8. 从0.78 版本起把MySQL数据库中关键字都改为大小写敏感，另外生成id的方法也做了改变，只生成小写的id，避免出现id重复的问题，建议所有客户都升级\n9. 从0.79 版本起把log4j升级到log4j2，因为log4j已经不再维护而且还有已知的漏洞，建议所有客户都升级，升级时注意更新log4j2的配置文件\n10. 0.97版本更改了启动脚本```wildfirechat.sh```，如果是升级服务，请注意更新启动脚本。\n\n## 维护说明\n野火设计理念当中，IM服务和客户端协议栈构成个管道工具，数据在人和人或者人和服务或者服务和服务之间传递，可以通过Server API和自定义消息来对接和开发业务。业务系统把IM系统当作一个工具来使用，是不需要把任何业务逻辑写在IM服务中的。\n\n如果修改了IM服务可能会引起跟客户端协议栈的不兼容，以后也没有可能从社区版IM服务迁移到专业版IM服务，还有一旦修改就跟我们代码不一样了，如果出了问题我们就无法分析和解决。所以 ***我们强烈不推荐在IM服务修改代码，如果修改过就不再提供任何技术支持和服务了***。除了IM服务以外的所有代码可以任意修改。\n\n现有接口足够对接和二开任何业务了，如果发现无法实现你们的业务需求，可以在[论坛](https://bbs.wildfirechat.cn)来咨询，我们会分析如何实现，如果需要添加新接口，我们会及时免费添加。请切记：***不要修改IM服务的代码!*** ***不要修改IM服务的代码!*** ***不要修改IM服务的代码!***\n\n详细维护说明请参考 [野火维护说明](https://docs.wildfirechat.cn/base_knowledge/maintain.html)。\n\n## 服务对象\n因为野火的使用范围比较广，难免被一些不法分子利用，国内反诈反赌力度很大，所以国内多地警方都跟我们都有过联系。***为了预防我们的产品被用于非法目的，试用及购买只能支持境内法人单位，不接受个人或者境外团体。如果我们发现产品被用于非法目的，我们会立即停止技术支持服务并且报警和配合警方调查。请用于非法目的用户绕行！***\n\n## 常见问题\n请参考文档[常见问题](https://docs.wildfirechat.cn/faq/server.html)\n\n## 应用截图\n登录界面\n\n<img src=\"./screenshots/1_login.png\" width = 50% height = 50% />\n\n会话列表\n\n<img src=\"./screenshots/2_conversation_list.png\" width = 50% height = 50% />\n\n好友列表\n\n<img src=\"./screenshots/3_contacts_list.png\" width = 50% height = 50% />\n\n工作台\n\n<img src=\"./screenshots/4_workplatform.png\" width = 50% height = 50% />\n\n发现\n\n<img src=\"./screenshots/5_discover.png\" width = 50% height = 50% />\n\n我的页面\n\n<img src=\"./screenshots/6_settings.png\" width = 50% height = 50% />\n\n消息聊天\n\n<img src=\"./screenshots/7_conversation.png\" width = 50% height = 50% />\n\n动态表情\n\n<img src=\"./screenshots/8_conversation_sticker.png\" width = 50% height = 50% />\n\n语音消息\n\n<img src=\"./screenshots/9_conversation_voice_msg.png\" width = 50% height = 50% />\n\n位置消息\n\n<img src=\"./screenshots/10_conversation_location.png\" width = 50% height = 50% />\n\n拍摄图片或者小视频\n\n<img src=\"./screenshots/11_conversation_capture.jpeg\" width = 50% height = 50% />\n\n会话设置\n\n<img src=\"./screenshots/13_conversation_settings.png\" width = 50% height = 50% />\n\n朋友圈\n\n<img src=\"./screenshots/14_moments.png\" width = 50% height = 50% />\n\n新好友\n\n<img src=\"./screenshots/15_new_friends.png\" width = 50% height = 50% />\n\n多人视频通话\n\n<img src=\"./screenshots/16_videocall.png\" width = 50% height = 50% />\n\n会议主页\n\n<img src=\"./screenshots/17_conference_home.png\" width = 50% height = 50% />\n\n会议详情\n\n<img src=\"./screenshots/18_conference_info.png\" width = 50% height = 50% />\n\n会议界面\n\n<img src=\"./screenshots/19_conference.png\" width = 50% height = 50% />\n\nPC客户端界面\n\n<img src=\"./screenshots/20_pc.png\"/>\n\n移动客户端、PC客户端和Web客户端三端同框\n\n<img src=\"./screenshots/21_three_platform.png\" />\n\n小程序客户端\n\n<img src=\"./screenshots/22_micro_app.jpeg\" width = 50% height = 50% />\n\n公众号管理后台\n\n<img src=\"./screenshots/23_channel.png\"/>\n\n开放平台管理后台\n\n<img src=\"./screenshots/24_open_platform.png\" />\n\nIM服务管理后台\n\n<img src=\"./screenshots/25_im_admin.png\" />\n\n> 更多详细信息请下载demo进行体验。\n\n## 特别感谢\n1. [moquette](https://github.com/moquette-io/moquette) 本项目是基于此项目二次开发而来，处理MQTT相关业务。\n2. [loServer](https://github.com/looly/loServer) 本项目使用loServer处理HTTP相关业务。\n\n*** 对他们表示诚挚的感谢🙏 ***\n\n## License\n\n1. Under the Creative Commons Attribution-NoDerivs 3.0 Unported license. See the [LICENSE](https://github.com/wildfirechat/server/blob/wildfirechat/LICENSE) file for details.\n"
        },
        {
          "name": "broker",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.sh",
          "type": "blob",
          "size": 0.0380859375,
          "content": "#!/bin/bash\n\nmvn clean compile package\n"
        },
        {
          "name": "checkstyle-suppressions.xml",
          "type": "blob",
          "size": 0.25390625,
          "content": "<?xml version=\"1.0\"?>\n<!DOCTYPE suppressions PUBLIC\n        \"-//Puppy Crawl//DTD Suppressions 1.0//EN\"\n        \"http://www.puppycrawl.com/dtds/suppressions_1_0.dtd\">\n\n<suppressions>\n    <suppress checks=\"[a-zA-Z0-9]*\" files=\".*/resources/.*\"/>\n</suppressions>\n"
        },
        {
          "name": "checkstyle.xml",
          "type": "blob",
          "size": 6.009765625,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<!--\n  ~ Copyright 2012 The Netty Project\n  ~\n  ~ The Netty Project licenses this file to you under the Apache License,\n  ~ version 2.0 (the \"License\"); you may not use this file except in compliance\n  ~ with the License. You may obtain a copy of the License at:\n  ~\n  ~   http://www.apache.org/licenses/LICENSE-2.0\n  ~\n  ~ Unless required by applicable law or agreed to in writing, software\n  ~ distributed under the License is distributed on an \"AS IS\" BASIS, WITHOUT\n  ~ WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the\n  ~ License for the specific language governing permissions and limitations\n  ~ under the License.\n  -->\n<!DOCTYPE module PUBLIC\n  \"-//Puppy Crawl//DTD Check Configuration 1.2//EN\"\n  \"http://www.puppycrawl.com/dtds/configuration_1_2.dtd\">\n<module name=\"Checker\">\n  <property name=\"severity\" value=\"warning\"/>\n\n  <!--\n  <module name=\"SuppressionFilter\">\n    <property name=\"file\" value=\"checkstyle-suppressions.xml\" />\n  </module>\n  <module name=\"io.netty.build.checkstyle.SuppressionFilter\">\n    <property name=\"pattern\" value=\"((LocalTime|WorldClock)Protocol|LinkedTransferQueue|Version|jzlib/.*|chmv8/.*|com/sun/nio/sctp/.*)\\.java\" />\n  </module>\n   -->\n  <module name=\"FileTabCharacter\"/>\n  <!--\n  <module name=\"JavadocPackage\"/>\n  -->\n  <module name=\"NewlineAtEndOfFile\">\n    <property name=\"lineSeparator\" value=\"lf\" />\n  </module>\n  <!-- Copyright headers -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"^(\\s|\\*)*Copyright\\s.*$\"/>\n    <property name=\"minimum\" value=\"1\"/>\n    <property name=\"maximum\" value=\"1\"/>\n    <property name=\"message\" value=\"missing copyright header\"/>\n  </module>\n  <!-- Unmaintainable Javadoc tags -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"(@(author|version)|\\(non-Javadoc\\))\"/>\n    <property name=\"ignoreCase\" value=\"true\"/>\n    <property name=\"message\" value=\"unmaintainable Javadoc tags: @author, @version, or (non-Javadoc)\"/>\n  </module>\n  <!-- IDE-generated comment -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"File \\| Settings \\| File Templates\"/>\n    <property name=\"message\" value=\"IDE-generated comment\"/>\n  </module>\n  <!-- Force UNIX line separator \n  <module name=\"io.netty.build.checkstyle.NewlineCheck\"/>\n  -->\n\n  <!-- Trailing whitespace -->\n  <module name=\"RegexpSingleline\">\n    <property name=\"format\" value=\"\\s+$\"/>\n    <property name=\"message\" value=\"trailing whitespace\"/>\n  </module> \n  <!-- Prohibit consecutive empty lines (except the lines after package/import) -->\n  <module name=\"RegexpMultiline\">\n    <property name=\"format\" value=\"\\n *(?!package )(?!import )[^\\n]+\\n{3,}\"/>\n    <property name=\"message\" value=\"two or more consecutive empty lines\"/>\n  </module>\n  <!-- Prohibit an empty after { or before } -->\n  <module name=\"RegexpMultiline\">\n    <property name=\"format\" value=\"\\n\\n\\s+\\}[^\\n]{0,10}\\n\"/>\n    <property name=\"message\" value=\"an empty line before '}'\"/>\n  </module>\n  <module name=\"RegexpMultiline\">\n    <property name=\"format\" value=\"\\n\\s+[^\\n]{1,8}\\{\\n\\n\"/>\n    <property name=\"message\" value=\"an empty line after a short line that ends with '{'\"/>\n  </module>\n\n  <module name=\"TreeWalker\">\n    <module name=\"LineLength\">\n      <property name=\"max\" value=\"120\"/>\n    </module>\n    <module name=\"WhitespaceAfter\"/>\n    <module name=\"WhitespaceAround\">\n      <property name=\"tokens\" value=\"ASSIGN, BAND, BAND_ASSIGN, BOR, BOR_ASSIGN, BSR, BSR_ASSIGN, BXOR, BXOR_ASSIGN, DIV, DIV_ASSIGN, EQUAL, GE, GT, LAND, LCURLY, LE, LITERAL_ASSERT, LITERAL_CATCH, LITERAL_DO, LITERAL_ELSE, LITERAL_FINALLY, LITERAL_FOR, LITERAL_IF, LITERAL_RETURN, LITERAL_SYNCHRONIZED, LITERAL_TRY, LITERAL_WHILE, LOR, LT, MINUS, MINUS_ASSIGN, MOD, MOD_ASSIGN, NOT_EQUAL, PLUS, PLUS_ASSIGN, RCURLY, SL, SLIST, SL_ASSIGN, SR, SR_ASSIGN, STAR, STAR_ASSIGN, TYPE_EXTENSION_AND\"/>\n    </module>\n    <!-- Commented out due to false positives.\n    <module name=\"MissingDeprecated\"/>\n    -->\n    <module name=\"MissingOverride\"/>\n    <module name=\"PackageAnnotation\"/>\n    <module name=\"EmptyBlock\">\n      <property name=\"option\" value=\"text\"/>\n    </module>\n    <module name=\"LeftCurly\"/>\n    <module name=\"RightCurly\"/>\n    <!--\n    <module name=\"NeedBraces\"/>\n    -->\n    <module name=\"AvoidNestedBlocks\">\n      <property name=\"allowInSwitchCase\" value=\"true\"/>\n    </module>\n    <module name=\"FinalClass\"/>\n    <module name=\"HideUtilityClassConstructor\"/>\n    <module name=\"CovariantEquals\"/>\n    <module name=\"EmptyStatement\"/>\n    <module name=\"EqualsHashCode\"/>\n    <!--\n    <module name=\"FinalLocalVariable\"/>\n    -->\n    <!-- Commented out due to http://jira.codehaus.org/browse/MCHECKSTYLE-111\n    <module name=\"RedundantThrows\">\n      <property name=\"logLoadErrors\" value=\"false\"/>\n      <property name=\"suppressLoadErrors\" value=\"true\"/>\n    </module>\n    -->\n    <module name=\"SimplifyBooleanExpression\"/>\n    <module name=\"SimplifyBooleanReturn\"/>\n    <module name=\"SuperFinalize\"/>\n    <module name=\"PackageDeclaration\"/>\n    <module name=\"ExplicitInitialization\"/>\n    <module name=\"DefaultComesLast\"/>\n    <module name=\"UnnecessaryParentheses\"/>\n    <!--\n    <module name=\"AvoidStarImport\">\n      <property name=\"allowStaticMemberImports\" value=\"true\"/>\n    </module>\n    -->\n    <module name=\"RedundantImport\"/>\n    <!-- Commented out due to false positives.\n    <module name=\"UnusedImports\">\n      <property name=\"processJavadoc\" value=\"true\"/>\n    </module>\n    -->\n    <module name=\"JavadocStyle\">\n      <property name=\"checkFirstSentence\" value=\"false\"/>\n    </module>\n    <module name=\"UpperEll\"/>\n    <module name=\"ArrayTypeStyle\"/>\n    <module name=\"OuterTypeFilename\"/>\n    <module name=\"ModifierOrder\"/>\n    <module name=\"RedundantModifier\"/>\n    <module name=\"GenericWhitespace\"/>\n    <module name=\"EmptyForInitializerPad\"/>\n    <module name=\"EmptyForIteratorPad\"/>\n    <module name=\"MethodParamPad\"/>\n    <module name=\"ParenPad\"/>\n    <module name=\"TypecastParenPad\"/>\n    <module name=\"ParameterName\">\n      <property name=\"format\" value=\"^(?!arg[0-9])[_a-z][_a-zA-Z0-9]*$\" />\n    </module>\n  </module>\n</module>"
        },
        {
          "name": "common",
          "type": "tree",
          "content": null
        },
        {
          "name": "distribution",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "flyway_repaire_migrate_38.sql",
          "type": "blob",
          "size": 1.626953125,
          "content": "--  IM服务在2020.10.6-2020-11.2号之间的版本升级到最新版本时，可能会提示出现如下的错误：\n--  Exception in thread \"main\" org.flywaydb.core.api.FlywayException: Validate failed: Detected resolved migration not applied to database: 38\n--      at org.flywaydb.core.Flyway.doValidate(Flyway.java:1482)\n--      at org.flywaydb.core.Flyway.access$100(Flyway.java:85)\n--      at org.flywaydb.core.Flyway$1.execute(Flyway.java:1364)\n--      at org.flywaydb.core.Flyway$1.execute(Flyway.java:1356)\n--      ...\n--\n--  当出现这个问题后，执行这个sql就可以修复了。\n--\n--\nDROP TABLE IF EXISTS `t_file`;\nCREATE TABLE `t_file` (\n  `_mid` bigint(20) NOT NULL PRIMARY KEY,\n  `_from` varchar(64) NOT NULL,\n  `_type` tinyint NOT NULL DEFAULT 0,\n  `_target` varchar(64) NOT NULL,\n  `_line` int(11) NOT NULL DEFAULT 0,\n  `_name` varchar(128) DEFAULT '',\n  `_url` varchar(1024) NOT NULL DEFAULT '',\n  `_size` int(11) NOT NULL DEFAULT 0,\n  `_download_count` int(11) DEFAULT 0,\n  `_dt` bigint(20) NOT NULL,\n  INDEX `file_conv_index` (`_type`, `_line`, `_target`, `_mid`),\n  INDEX `file_user_index` (`_from`, `_mid`)\n)\nENGINE = InnoDB\nDEFAULT CHARACTER SET = utf8mb4\nCOLLATE = utf8mb4_unicode_ci;\n\n\nalter table `t_group` modify column `_searchable` int(11) NOT NULL DEFAULT 0;\n\nupdate flyway_schema_history set installed_rank = 40 where version = 40;\n\ninsert into flyway_schema_history values (38,'38','alter group searchable column','SQL','V38__alter_group_searchable_column.sql',-524664704,'root','2020-07-21 14:43:50',1126,1),(39,'39','create files table','SQL','V39__create_files_table.sql',1144437159,'root','2020-08-03 03:15:04',503,1);\n"
        },
        {
          "name": "license-eplv10-aslv20.html",
          "type": "blob",
          "size": 29.30859375,
          "content": "<html xmlns:o=\"urn:schemas-microsoft-com:office:office\" xmlns:w=\"urn:schemas-microsoft-com:office:word\" xmlns=\"http://www.w3.org/TR/REC-html40\"><head>\n\n\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=windows-1252\">\n<meta name=\"ProgId\" content=\"Word.Document\">\n<meta name=\"Generator\" content=\"Microsoft Word 9\">\n<meta name=\"Originator\" content=\"Microsoft Word 9\">\n<link rel=\"File-List\" href=\"http://www.eclipse.org/legal/Eclipse%20EPL%202003_11_10%20Final_files/filelist.xml\">\n<title>Eclipse Public License - Version 1.0 / Apache License - Version 2.0</title>\n<!--[if gte mso 9]><xml>\n <o:DocumentProperties>\n  <o:Revision>2</o:Revision>\n  <o:TotalTime>3</o:TotalTime>\n  <o:Created>2004-03-05T23:03:00Z</o:Created>\n  <o:LastSaved>2004-03-05T23:03:00Z</o:LastSaved>\n  <o:Pages>4</o:Pages>\n  <o:Words>1626</o:Words>\n  <o:Characters>9270</o:Characters>\n   <o:Lines>77</o:Lines>\n  <o:Paragraphs>18</o:Paragraphs>\n  <o:CharactersWithSpaces>11384</o:CharactersWithSpaces>\n  <o:Version>9.4402</o:Version>\n </o:DocumentProperties>\n</xml><![endif]--><!--[if gte mso 9]><xml>\n <w:WordDocument>\n  <w:TrackRevisions/>\n </w:WordDocument>\n</xml><![endif]-->\n<style>\n<!--\n /* Font Definitions */\n@font-face\n\t{font-family:Tahoma;\n\tpanose-1:2 11 6 4 3 5 4 4 2 4;\n\tmso-font-charset:0;\n\tmso-generic-font-family:swiss;\n\tmso-font-pitch:variable;\n\tmso-font-signature:553679495 -2147483648 8 0 66047 0;}\n /* Style Definitions */\np.MsoNormal, li.MsoNormal, div.MsoNormal\n\t{mso-style-parent:\"\";\n\tmargin:0in;\n\tmargin-bottom:.0001pt;\n\tmso-pagination:widow-orphan;\n\tfont-size:12.0pt;\n\tfont-family:\"Times New Roman\";\n\tmso-fareast-font-family:\"Times New Roman\";}\np\n\t{margin-right:0in;\n\tmso-margin-top-alt:auto;\n\tmso-margin-bottom-alt:auto;\n\tmargin-left:0in;\n\tmso-pagination:widow-orphan;\n\tfont-size:12.0pt;\n\tfont-family:\"Times New Roman\";\n\tmso-fareast-font-family:\"Times New Roman\";}\np.BalloonText, li.BalloonText, div.BalloonText\n\t{mso-style-name:\"Balloon Text\";\n\tmargin:0in;\n\tmargin-bottom:.0001pt;\n\tmso-pagination:widow-orphan;\n\tfont-size:8.0pt;\n\tfont-family:Tahoma;\n\tmso-fareast-font-family:\"Times New Roman\";}\n@page Section1\n\t{size:8.5in 11.0in;\n\tmargin:1.0in 1.25in 1.0in 1.25in;\n\tmso-header-margin:.5in;\n\tmso-footer-margin:.5in;\n\tmso-paper-source:0;}\ndiv.Section1\n\t{page:Section1;}\n-->\n</style>\n</head><body style=\"\" lang=\"EN-US\">\n\n<div class=\"Section1\">\n\n<p style=\"text-align: center;\" align=\"center\"><b>Eclipse Public License - v 1.0</b>\n</p>\n\n<p><span style=\"font-size: 10pt;\">THE ACCOMPANYING PROGRAM IS PROVIDED UNDER\nTHE TERMS OF THIS ECLIPSE PUBLIC LICENSE (\"AGREEMENT\"). ANY USE,\nREPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE\nOF THIS AGREEMENT.</span> </p>\n\n<p><b><span style=\"font-size: 10pt;\">1. DEFINITIONS</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">\"Contribution\" means:</span> </p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">a)\nin the case of the initial Contributor, the initial code and documentation\ndistributed under this Agreement, and<br clear=\"left\">\nb) in the case of each subsequent Contributor:</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">i)\nchanges to the Program, and</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">ii)\nadditions to the Program;</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">where\nsuch changes and/or additions to the Program originate from and are distributed\nby that particular Contributor. A Contribution 'originates' from a Contributor\nif it was added to the Program by such Contributor itself or anyone acting on\nsuch Contributor's behalf. Contributions do not include additions to the\nProgram which: (i) are separate modules of software distributed in conjunction\nwith the Program under their own license agreement, and (ii) are not derivative\nworks of the Program. </span></p>\n\n<p><span style=\"font-size: 10pt;\">\"Contributor\" means any person or\nentity that distributes the Program.</span> </p>\n\n<p><span style=\"font-size: 10pt;\">\"Licensed Patents \" mean patent\nclaims licensable by a Contributor which are necessarily infringed by the use\nor sale of its Contribution alone or when combined with the Program. </span></p>\n\n<p><span style=\"font-size: 10pt;\">\"Program\" means the Contributions\ndistributed in accordance with this Agreement.</span> </p>\n\n<p><span style=\"font-size: 10pt;\">\"Recipient\" means anyone who\nreceives the Program under this Agreement, including all Contributors.</span> </p>\n\n<p><b><span style=\"font-size: 10pt;\">2. GRANT OF RIGHTS</span></b> </p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">a)\nSubject to the terms of this Agreement, each Contributor hereby grants Recipient\na non-exclusive, worldwide, royalty-free copyright license to<span style=\"color: red;\"> </span>reproduce, prepare derivative works of, publicly\ndisplay, publicly perform, distribute and sublicense the Contribution of such\nContributor, if any, and such derivative works, in source code and object code\nform.</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">b)\nSubject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide,<span style=\"color: green;\"> </span>royalty-free\npatent license under Licensed Patents to make, use, sell, offer to sell, import\nand otherwise transfer the Contribution of such Contributor, if any, in source\ncode and object code form. This patent license shall apply to the combination\nof the Contribution and the Program if, at the time the Contribution is added\nby the Contributor, such addition of the Contribution causes such combination\nto be covered by the Licensed Patents. The patent license shall not apply to\nany other combinations which include the Contribution. No hardware per se is\nlicensed hereunder. </span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">c)\nRecipient understands that although each Contributor grants the licenses to its\nContributions set forth herein, no assurances are provided by any Contributor\nthat the Program does not infringe the patent or other intellectual property\nrights of any other entity. Each Contributor disclaims any liability to Recipient\nfor claims brought by any other entity based on infringement of intellectual\nproperty rights or otherwise. As a condition to exercising the rights and\nlicenses granted hereunder, each Recipient hereby assumes sole responsibility\nto secure any other intellectual property rights needed, if any. For example,\nif a third party patent license is required to allow Recipient to distribute\nthe Program, it is Recipient's responsibility to acquire that license before\ndistributing the Program.</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">d)\nEach Contributor represents that to its knowledge it has sufficient copyright\nrights in its Contribution, if any, to grant the copyright license set forth in\nthis Agreement. </span></p>\n\n<p><b><span style=\"font-size: 10pt;\">3. REQUIREMENTS</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">A Contributor may choose to distribute the\nProgram in object code form under its own license agreement, provided that:</span>\n</p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">a)\nit complies with the terms and conditions of this Agreement; and</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">b)\nits license agreement:</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">i)\neffectively disclaims on behalf of all Contributors all warranties and\nconditions, express and implied, including warranties or conditions of title\nand non-infringement, and implied warranties or conditions of merchantability\nand fitness for a particular purpose; </span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">ii)\neffectively excludes on behalf of all Contributors all liability for damages,\nincluding direct, indirect, special, incidental and consequential damages, such\nas lost profits; </span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">iii)\nstates that any provisions which differ from this Agreement are offered by that\nContributor alone and not by any other party; and</span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">iv)\nstates that source code for the Program is available from such Contributor, and\ninforms licensees how to obtain it in a reasonable manner on or through a\nmedium customarily used for software exchange.<span style=\"color: blue;\"> </span></span></p>\n\n<p><span style=\"font-size: 10pt;\">When the Program is made available in source\ncode form:</span> </p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">a)\nit must be made available under this Agreement; and </span></p>\n\n<p class=\"MsoNormal\" style=\"margin-left: 0.5in;\"><span style=\"font-size: 10pt;\">b) a\ncopy of this Agreement must be included with each copy of the Program. </span></p>\n\n<p><span style=\"font-size: 10pt;\">Contributors may not remove or alter any\ncopyright notices contained within the Program. </span></p>\n\n<p><span style=\"font-size: 10pt;\">Each Contributor must identify itself as the\noriginator of its Contribution, if any, in a manner that reasonably allows\nsubsequent Recipients to identify the originator of the Contribution. </span></p>\n\n<p><b><span style=\"font-size: 10pt;\">4. COMMERCIAL DISTRIBUTION</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">Commercial distributors of software may\naccept certain responsibilities with respect to end users, business partners\nand the like. While this license is intended to facilitate the commercial use\nof the Program, the Contributor who includes the Program in a commercial\nproduct offering should do so in a manner which does not create potential\nliability for other Contributors. Therefore, if a Contributor includes the\nProgram in a commercial product offering, such Contributor (\"Commercial\nContributor\") hereby agrees to defend and indemnify every other\nContributor (\"Indemnified Contributor\") against any losses, damages and\ncosts (collectively \"Losses\") arising from claims, lawsuits and other\nlegal actions brought by a third party against the Indemnified Contributor to\nthe extent caused by the acts or omissions of such Commercial Contributor in\nconnection with its distribution of the Program in a commercial product\noffering. The obligations in this section do not apply to any claims or Losses\nrelating to any actual or alleged intellectual property infringement. In order\nto qualify, an Indemnified Contributor must: a) promptly notify the Commercial\nContributor in writing of such claim, and b) allow the Commercial Contributor\nto control, and cooperate with the Commercial Contributor in, the defense and\nany related settlement negotiations. The Indemnified Contributor may participate\nin any such claim at its own expense.</span> </p>\n\n<p><span style=\"font-size: 10pt;\">For example, a Contributor might include the\nProgram in a commercial product offering, Product X. That Contributor is then a\nCommercial Contributor. If that Commercial Contributor then makes performance\nclaims, or offers warranties related to Product X, those performance claims and\nwarranties are such Commercial Contributor's responsibility alone. Under this\nsection, the Commercial Contributor would have to defend claims against the\nother Contributors related to those performance claims and warranties, and if a\ncourt requires any other Contributor to pay any damages as a result, the\nCommercial Contributor must pay those damages.</span> </p>\n\n<p><b><span style=\"font-size: 10pt;\">5. NO WARRANTY</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">EXCEPT AS EXPRESSLY SET FORTH IN THIS\nAGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT\nWARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING,\nWITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT,\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely\nresponsible for determining the appropriateness of using and distributing the\nProgram and assumes all risks associated with its exercise of rights under this\nAgreement , including but not limited to the risks and costs of program errors,\ncompliance with applicable laws, damage to or loss of data, programs or\nequipment, and unavailability or interruption of operations. </span></p>\n\n<p><b><span style=\"font-size: 10pt;\">6. DISCLAIMER OF LIABILITY</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">EXCEPT AS EXPRESSLY SET FORTH IN THIS\nAGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY LIABILITY FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF\nTHE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGES.</span> </p>\n\n<p><b><span style=\"font-size: 10pt;\">7. GENERAL</span></b> </p>\n\n<p><span style=\"font-size: 10pt;\">If any provision of this Agreement is invalid\nor unenforceable under applicable law, it shall not affect the validity or\nenforceability of the remainder of the terms of this Agreement, and without\nfurther action by the parties hereto, such provision shall be reformed to the\nminimum extent necessary to make such provision valid and enforceable.</span> </p>\n\n<p><span style=\"font-size: 10pt;\">If Recipient institutes patent litigation\nagainst any entity (including a cross-claim or counterclaim in a lawsuit)\nalleging that the Program itself (excluding combinations of the Program with\nother software or hardware) infringes such Recipient's patent(s), then such\nRecipient's rights granted under Section 2(b) shall terminate as of the date\nsuch litigation is filed. </span></p>\n\n<p><span style=\"font-size: 10pt;\">All Recipient's rights under this Agreement\nshall terminate if it fails to comply with any of the material terms or\nconditions of this Agreement and does not cure such failure in a reasonable\nperiod of time after becoming aware of such noncompliance. If all Recipient's\nrights under this Agreement terminate, Recipient agrees to cease use and\ndistribution of the Program as soon as reasonably practicable. However,\nRecipient's obligations under this Agreement and any licenses granted by\nRecipient relating to the Program shall continue and survive. </span></p>\n\n<p><span style=\"font-size: 10pt;\">Everyone is permitted to copy and distribute\ncopies of this Agreement, but in order to avoid inconsistency the Agreement is\ncopyrighted and may only be modified in the following manner. The Agreement\nSteward reserves the right to publish new versions (including revisions) of\nthis Agreement from time to time. No one other than the Agreement Steward has\nthe right to modify this Agreement. The Eclipse Foundation is the initial\nAgreement Steward. The Eclipse Foundation may assign the responsibility to\nserve as the Agreement Steward to a suitable separate entity. Each new version\nof the Agreement will be given a distinguishing version number. The Program\n(including Contributions) may always be distributed subject to the version of\nthe Agreement under which it was received. In addition, after a new version of\nthe Agreement is published, Contributor may elect to distribute the Program\n(including its Contributions) under the new version. Except as expressly stated\nin Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to\nthe intellectual property of any Contributor under this Agreement, whether\nexpressly, by implication, estoppel or otherwise. All rights in the Program not\nexpressly granted under this Agreement are reserved.</span> </p>\n\n<p><span style=\"font-size: 10pt;\">This Agreement is governed by the laws of the\nState of New York and the intellectual property laws of the United States of\nAmerica. No party to this Agreement will bring a legal action under this\nAgreement more than one year after the cause of action arose. Each party waives\nits rights to a jury trial in any resulting litigation.</span> </p>\n\n<p class=\"MsoNormal\"><!--[if !supportEmptyParas]-->&nbsp;<!--[endif]--><o:p></o:p></p>\n\n</div>\n\n<div class=\"Section2\">\n\n<p style=\"text-align: center;\" align=\"center\"><b>Apache License</b></br>\nVersion 2.0, January 2004<br/>\nhttp://www.apache.org/licenses/<br/>\n</p>\n<p><span style=\"font-size: 10pt;\">TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION</spam></p>\n<p><b><span style=\"font-size: 10pt;\">1. Definitions.</span></b> </p>\n<p><span style=\"font-size: 10pt;\">\n    \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"</span></p>\n<p><span style=\"font-size: 10pt;\">\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.</span></p>\n\n<p><b><span style=\"font-size: 10pt;\">2. Grant of Copyright License.</span></b> </p>\n<p><span style=\"font-size: 10pt;\">\nSubject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.</span></p>\n      \n      \n         <p><b><span style=\"font-size: 10pt;\">3. Grant of Patent License.</span></b><p>\n\n<p><span style=\"font-size: 10pt;\">         \n         Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   4. Redistribution. \n      </span></b></p>\n   \n   <p><span style=\"font-size: 10pt;\">You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:</span><p>\n<ul>\n<li><span style=\"font-size: 10pt;\">\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and</span><p>\n</li>\n<li><span style=\"font-size: 10pt;\">\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and</span><p>\n</li>\n</li><span style=\"font-size: 10pt;\">\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and</span><p>\n</li>\n<li><span style=\"font-size: 10pt;\">\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.</span><p>\n</li>\n</ul>\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   5. Submission of Contributions. \n      </span></b></p>\n   \n   <p><span style=\"font-size: 10pt;\">Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   6. Trademarks. \n      </span></b></p>\n   \n   <p><span style=\"font-size: 10pt;\">This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   7. Disclaimer of Warranty. \n      </span></b></p>\n   \n   <p><span style=\"font-size: 10pt;\">Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   8. Limitation of Liability. \n      </span></b></p>\n   \n   <p><span style=\"font-size: 10pt;\">In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n</span></p>\n<p><b><span style=\"font-size: 10pt;\">\n   9. Accepting Warranty or Additional Liability. \n   </span></b></p>\n   <p><span style=\"font-size: 10pt;\">While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n   END OF TERMS AND CONDITIONS\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n   APPENDIX: How to apply the Apache License to your work.\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n   Copyright [yyyy] [name of copyright owner]\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n       http://www.apache.org/licenses/LICENSE-2.0\n</span></p>\n\n<p><span style=\"font-size: 10pt;\">\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n</span></p>\n\n</div>\n</body></html>"
        },
        {
          "name": "license_moquette.txt",
          "type": "blob",
          "size": 11.349609375,
          "content": "\r\n                     Copyright 2012-2013 (c) Andrea Selva\r\n\r\n\r\n                                Apache License\r\n                           Version 2.0, January 2004\r\n                        http://www.apache.org/licenses/\r\n\r\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\r\n\r\n   1. Definitions.\r\n\r\n      \"License\" shall mean the terms and conditions for use, reproduction,\r\n      and distribution as defined by Sections 1 through 9 of this document.\r\n\r\n      \"Licensor\" shall mean the copyright owner or entity authorized by\r\n      the copyright owner that is granting the License.\r\n\r\n      \"Legal Entity\" shall mean the union of the acting entity and all\r\n      other entities that control, are controlled by, or are under common\r\n      control with that entity. For the purposes of this definition,\r\n      \"control\" means (i) the power, direct or indirect, to cause the\r\n      direction or management of such entity, whether by contract or\r\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\r\n      outstanding shares, or (iii) beneficial ownership of such entity.\r\n\r\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\r\n      exercising permissions granted by this License.\r\n\r\n      \"Source\" form shall mean the preferred form for making modifications,\r\n      including but not limited to software source code, documentation\r\n      source, and configuration files.\r\n\r\n      \"Object\" form shall mean any form resulting from mechanical\r\n      transformation or translation of a Source form, including but\r\n      not limited to compiled object code, generated documentation,\r\n      and conversions to other media types.\r\n\r\n      \"Work\" shall mean the work of authorship, whether in Source or\r\n      Object form, made available under the License, as indicated by a\r\n      copyright notice that is included in or attached to the work\r\n      (an example is provided in the Appendix below).\r\n\r\n      \"Derivative Works\" shall mean any work, whether in Source or Object\r\n      form, that is based on (or derived from) the Work and for which the\r\n      editorial revisions, annotations, elaborations, or other modifications\r\n      represent, as a whole, an original work of authorship. For the purposes\r\n      of this License, Derivative Works shall not include works that remain\r\n      separable from, or merely link (or bind by name) to the interfaces of,\r\n      the Work and Derivative Works thereof.\r\n\r\n      \"Contribution\" shall mean any work of authorship, including\r\n      the original version of the Work and any modifications or additions\r\n      to that Work or Derivative Works thereof, that is intentionally\r\n      submitted to Licensor for inclusion in the Work by the copyright owner\r\n      or by an individual or Legal Entity authorized to submit on behalf of\r\n      the copyright owner. For the purposes of this definition, \"submitted\"\r\n      means any form of electronic, verbal, or written communication sent\r\n      to the Licensor or its representatives, including but not limited to\r\n      communication on electronic mailing lists, source code control systems,\r\n      and issue tracking systems that are managed by, or on behalf of, the\r\n      Licensor for the purpose of discussing and improving the Work, but\r\n      excluding communication that is conspicuously marked or otherwise\r\n      designated in writing by the copyright owner as \"Not a Contribution.\"\r\n\r\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\r\n      on behalf of whom a Contribution has been received by Licensor and\r\n      subsequently incorporated within the Work.\r\n\r\n   2. Grant of Copyright License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      copyright license to reproduce, prepare Derivative Works of,\r\n      publicly display, publicly perform, sublicense, and distribute the\r\n      Work and such Derivative Works in Source or Object form.\r\n\r\n   3. Grant of Patent License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      (except as stated in this section) patent license to make, have made,\r\n      use, offer to sell, sell, import, and otherwise transfer the Work,\r\n      where such license applies only to those patent claims licensable\r\n      by such Contributor that are necessarily infringed by their\r\n      Contribution(s) alone or by combination of their Contribution(s)\r\n      with the Work to which such Contribution(s) was submitted. If You\r\n      institute patent litigation against any entity (including a\r\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\r\n      or a Contribution incorporated within the Work constitutes direct\r\n      or contributory patent infringement, then any patent licenses\r\n      granted to You under this License for that Work shall terminate\r\n      as of the date such litigation is filed.\r\n\r\n   4. Redistribution. You may reproduce and distribute copies of the\r\n      Work or Derivative Works thereof in any medium, with or without\r\n      modifications, and in Source or Object form, provided that You\r\n      meet the following conditions:\r\n\r\n      (a) You must give any other recipients of the Work or\r\n          Derivative Works a copy of this License; and\r\n\r\n      (b) You must cause any modified files to carry prominent notices\r\n          stating that You changed the files; and\r\n\r\n      (c) You must retain, in the Source form of any Derivative Works\r\n          that You distribute, all copyright, patent, trademark, and\r\n          attribution notices from the Source form of the Work,\r\n          excluding those notices that do not pertain to any part of\r\n          the Derivative Works; and\r\n\r\n      (d) If the Work includes a \"NOTICE\" text file as part of its\r\n          distribution, then any Derivative Works that You distribute must\r\n          include a readable copy of the attribution notices contained\r\n          within such NOTICE file, excluding those notices that do not\r\n          pertain to any part of the Derivative Works, in at least one\r\n          of the following places: within a NOTICE text file distributed\r\n          as part of the Derivative Works; within the Source form or\r\n          documentation, if provided along with the Derivative Works; or,\r\n          within a display generated by the Derivative Works, if and\r\n          wherever such third-party notices normally appear. The contents\r\n          of the NOTICE file are for informational purposes only and\r\n          do not modify the License. You may add Your own attribution\r\n          notices within Derivative Works that You distribute, alongside\r\n          or as an addendum to the NOTICE text from the Work, provided\r\n          that such additional attribution notices cannot be construed\r\n          as modifying the License.\r\n\r\n      You may add Your own copyright statement to Your modifications and\r\n      may provide additional or different license terms and conditions\r\n      for use, reproduction, or distribution of Your modifications, or\r\n      for any such Derivative Works as a whole, provided Your use,\r\n      reproduction, and distribution of the Work otherwise complies with\r\n      the conditions stated in this License.\r\n\r\n   5. Submission of Contributions. Unless You explicitly state otherwise,\r\n      any Contribution intentionally submitted for inclusion in the Work\r\n      by You to the Licensor shall be under the terms and conditions of\r\n      this License, without any additional terms or conditions.\r\n      Notwithstanding the above, nothing herein shall supersede or modify\r\n      the terms of any separate license agreement you may have executed\r\n      with Licensor regarding such Contributions.\r\n\r\n   6. Trademarks. This License does not grant permission to use the trade\r\n      names, trademarks, service marks, or product names of the Licensor,\r\n      except as required for reasonable and customary use in describing the\r\n      origin of the Work and reproducing the content of the NOTICE file.\r\n\r\n   7. Disclaimer of Warranty. Unless required by applicable law or\r\n      agreed to in writing, Licensor provides the Work (and each\r\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\r\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\r\n      implied, including, without limitation, any warranties or conditions\r\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\r\n      PARTICULAR PURPOSE. You are solely responsible for determining the\r\n      appropriateness of using or redistributing the Work and assume any\r\n      risks associated with Your exercise of permissions under this License.\r\n\r\n   8. Limitation of Liability. In no event and under no legal theory,\r\n      whether in tort (including negligence), contract, or otherwise,\r\n      unless required by applicable law (such as deliberate and grossly\r\n      negligent acts) or agreed to in writing, shall any Contributor be\r\n      liable to You for damages, including any direct, indirect, special,\r\n      incidental, or consequential damages of any character arising as a\r\n      result of this License or out of the use or inability to use the\r\n      Work (including but not limited to damages for loss of goodwill,\r\n      work stoppage, computer failure or malfunction, or any and all\r\n      other commercial damages or losses), even if such Contributor\r\n      has been advised of the possibility of such damages.\r\n\r\n   9. Accepting Warranty or Additional Liability. While redistributing\r\n      the Work or Derivative Works thereof, You may choose to offer,\r\n      and charge a fee for, acceptance of support, warranty, indemnity,\r\n      or other liability obligations and/or rights consistent with this\r\n      License. However, in accepting such obligations, You may act only\r\n      on Your own behalf and on Your sole responsibility, not on behalf\r\n      of any other Contributor, and only if You agree to indemnify,\r\n      defend, and hold each Contributor harmless for any liability\r\n      incurred by, or claims asserted against, such Contributor by reason\r\n      of your accepting any such warranty or additional liability.\r\n\r\n   END OF TERMS AND CONDITIONS\r\n\r\n   APPENDIX: How to apply the Apache License to your work.\r\n\r\n      To apply the Apache License to your work, attach the following\r\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\r\n      replaced with your own identifying information. (Don't include\r\n      the brackets!)  The text should be enclosed in the appropriate\r\n      comment syntax for the file format. We also recommend that a\r\n      file or class name and description of purpose be included on the\r\n      same \"printed page\" as the copyright notice for easier\r\n      identification within third-party archives.\r\n\r\n   Copyright [yyyy] [name of copyright owner]\r\n\r\n   Licensed under the Apache License, Version 2.0 (the \"License\");\r\n   you may not use this file except in compliance with the License.\r\n   You may obtain a copy of the License at\r\n\r\n       http://www.apache.org/licenses/LICENSE-2.0\r\n\r\n   Unless required by applicable law or agreed to in writing, software\r\n   distributed under the License is distributed on an \"AS IS\" BASIS,\r\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\r\n   See the License for the specific language governing permissions and\r\n   limitations under the License.\r\n"
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 3.9130859375,
          "content": "<project xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns=\"http://maven.apache.org/POM/4.0.0\"\n         xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n    <modelVersion>4.0.0</modelVersion>\n    <properties>\n        <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>\n        <netty.version>4.1.68.Final</netty.version>\n        <source.version>1.8</source.version>\n        <target.version>1.8</target.version>\n    </properties>\n\n    <groupId>cn.wildfirechat</groupId>\n    <artifactId>wildfirechat-parent</artifactId>\n\n    <packaging>pom</packaging>\n    <version>1.3.2</version>\n    <name>Wildfire Chat</name>\n    <description>Wildfire Chat Server</description>\n    <inceptionYear>2019</inceptionYear>\n    <url>https://www.wildfirechat.cn</url>\n\n    <licenses>\n        <license>\n            <name>The Apache License, Version 2.0</name>\n            <url>http://www.apache.org/licenses/LICENSE-2.0.txt</url>\n        </license>\n        <license>\n            <name>Eclipse Public License - Version 1.0</name>\n            <url>http://www.eclipse.org/org/documents/epl-v10.php</url>\n        </license>\n    </licenses>\n\n\n    <modules>\n        <module>broker</module>\n        <module>common</module>\n        <module>sdk</module>\n        <module>distribution</module>\n    </modules>\n\n    <build>\n    <pluginManagement>\n        <plugins>\n            <plugin>\n                <groupId>org.apache.maven.plugins</groupId>\n                <artifactId>maven-compiler-plugin</artifactId>\n                <configuration>\n                    <source>${source.version}</source>\n                    <target>${target.version}</target>\n                </configuration>\n            </plugin>\n            <plugin>\n              <groupId>org.apache.maven.plugins</groupId>\n              <artifactId>maven-checkstyle-plugin</artifactId>\n              <version>2.17</version>\n              <configuration>\n                  <configLocation>checkstyle.xml</configLocation>\n                  <suppressionsLocation>checkstyle-suppressions.xml</suppressionsLocation>\n                  <!--\n                     <configLocation>/google_checks.xml</configLocation>\n                   -->\n                  <failOnViolation>true</failOnViolation>\n                  <consoleOutput>true</consoleOutput>\n              </configuration>\n              <executions>\n                <execution>\n                  <phase>validate</phase>\n                  <goals>\n                    <goal>check</goal>\n                  </goals>\n                </execution>\n              </executions>\n            </plugin>\n        </plugins>\n    </pluginManagement>    \n    </build>\n\n    <profiles>\n        <profile>\n            <id>release-sign-artifacts</id>\n            <build>\n                <plugins>\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-source-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>attach-sources</id>\n                                <goals>\n                                    <goal>jar</goal>\n                                </goals>\n                            </execution>\n                        </executions>\n                    </plugin>\n\n                    <plugin>\n                        <groupId>org.apache.maven.plugins</groupId>\n                        <artifactId>maven-javadoc-plugin</artifactId>\n                        <executions>\n                            <execution>\n                                <id>attach-javadocs</id>\n                                <goals>\n                                    <goal>jar</goal>\n                                </goals>\n                            </execution>\n                        </executions>\n                    </plugin>\n                </plugins>\n            </build>\n        </profile>\n    </profiles>\n</project>\n"
        },
        {
          "name": "release_note.md",
          "type": "blob",
          "size": 26.8740234375,
          "content": "# 升级注意事项\n1. *** 0.42 版本增加了群成员数限制，默认为2000。如果您想修改默认值，可以在升级版本之后，修改t_setting表，把默认的大小改为您期望的。另外修改t_group表，把已经存在的群组max_member_count改成您期望的，然后重启。***\n2. *** 0.46和0.47版本升级到0.48及以后版本时，可能会提示flyway migrate 38错误，请执行 [修复脚本](https://github.com/wildfirechat/server/blob/wildfirechat/flyway_repaire_migrate_38.sql) 进行修复。0.46和0.47版本之外的版本不会出现此问题。***\n3. *** 0.50版本添加了是否允许客户端发送群操作通知的配置。如果您在客户端自定义群通知，需要在服务器端配置允许，没有使用自定义群操作通知的不受影响。***\n4. *** 从0.54之前版本升级到0.54及以后版本时，会提示flyway migrate错误。因为0.54版本删除了sql脚本中默认敏感词的内容，flyway checksum失败。请执行```update flyway_schema_history set checksum = 0 where script = 'V17__add_default_sensitive_word.sql';```来修复。***\n5. *** 从0.59之前的版本升级到之后的版本执行数据库升级时间比较长，请耐心等待提示运行成功，避免中途中断。 ***\n6. *** 0.62/0.63 版本有严重的问题，请使用0.64及以后版本，或者0.61版。 ***\n7. *** 从0.68 版本起添加了pc在线是否默认手机接收推送的开关，默认为开，与以前版本作用相反，请注意兼容（可以关掉与之前保持一致或者升级客户端） ***\n8. *** 从0.78 版本起把MySQL数据库中关键字都改为大小写敏感，另外生成id的方法也做了改变，只生成小写的id，避免出现id重复的问题，建议所有客户都升级 ***\n9. *** 从0.79 版本起把log4j升级到log4j2，因为log4j已经不再维护而且还有已知的漏洞，建议所有客户都升级，升级时注意更新log4j2的配置文件 ***\n10. *** 5. 0.97版本更改了启动脚本```wildfirechat.sh```，如果是升级服务，请注意更新启动脚本。***\n\n# 更新记录\n\n--------------\nRelease note 1.3.2:\n1. 机器人Server SDK添加朋友圈相关接口。\n2. Server API添加批量获取用户接口。\n3. 解决聊天室定向消息无效的问题。\n4. 添加配置，可以在禁止私聊时添加例外聊天线路。\n\n--------------\nRelease note 1.3.1:\n1. 透传消息去掉消息ID，减少消息传输大小。\n2. 修改添加好友策略，可以设置禁止加自己好友。\n3. Server API创建群组时，检查是否设置operator。\n4. SDK添加删除广播和组播消息接口\n\n--------------\nRelease note 1.3.0:\n1. 推送信息中添加republish参数，用于标识消息是重新发布的。\n2. 添加好友请求限频功能，在IM服务配置中可以配置每天限制添加的好友数。\n3. 添加配置，是否允许用户发送消息给被拉黑的用户。\n4. 添加鸿蒙回调地址。\n5. 创建群组或者添加群组成员时，群组成员的Extra会放到通知消息的extra中，这样便于业务处理通知消息。\n\n--------------\nRelease note 1.2.9:\n1. 解决server api获取群组信息不全的问题。\n2. 添加配置使用uuid作为用户群组等ID。\n\n--------------\nRelease note 1.2.8:\n1. server api获取被封禁用户时，过滤掉正常用户。\n2. 解决群组标记删除错误。\n3. SDK中添加发送消息的示例。\n4. 群解散后撤回群中的消息应该失败。\n5. 解决某些时候http请求返回信息无法读取问题。\n\n--------------\nRelease note 1.2.7:\n1. 解决搜索频道时某些类型的频道无法被搜索的问题。\n2. 添加频道回调新特性，方便使用。\n3. 解决机器人API修改机器人用户信息客户端没有更新的问题。\n4. Server SDK中关于频道的接口放到ChannelAdmin中。\n5. 添加Mesh功能的SDK。\n\n--------------\nRelease note 1.2.6:\n1. 群主强制被退群时（销毁账号/server api强制退群），调整新群主选择，群管理优先，先加入群组优先。\n2. 拉取远程消息时，过滤掉可能重复的消息。\n3. 退群时添加是否保留消息的参数，可以退群后保留原有消息。\n4. 如果不在群组中，当获取群组信息时不更新数据。\n\n--------------\nRelease note 1.2.5:\n1. Server API添加通过邮箱获取用户信息的接口。\n2. 支持群组标记删除功能。\n3. 添加配置，可以设置在静音时强制推送指定类型消息。\n4. 支持用户设置添加好友是否验证功能\n\n--------------\nRelease note 1.2.4:\n1. 去掉用户的默认密码。\n2. 去掉频道和机器人的默认头像。\n3. 修改在线状态回调数据，返回此用户的所有端状态。\n\n--------------\nRelease note 1.2.3:\n1. 同步专业版IM服务server SDK。\n2. 添加对鸿蒙平台的支持。\n3. 解决server端音视频SDK信令支持问题。\n4. 升级部分依赖，解决漏洞问题\n\n--------------\nRelease note 1.2.2:\n1. 解决搜索特殊字符时的转义问题。\n2. SDK添加流式消息。\n3. 添加配置，是否禁止拉陌生人入群。\n4. 放被拉黑时禁止被拉入群\n5. 群组信息变更回调时加上群组信息\n6. 机器人sdk添加撤回和更新消息接口\n\n--------------\nRelease note 1.2.1:\n1. 添加获取在线用户功能。\n2. 添加获取用户连接session信息的功能。\n3. 优化按照用户id搜索用户的逻辑。\n4. 解决广播消息没有发给未登录用户的问题。\n\n--------------\nRelease note 1.2.0:\n1. 添加配置开关，可以关掉api/version检查接口。\n2. Server SDK会议事件中添加时间戳。\n3. 禁止私聊时，如果一方在允许私聊列表中，允许私聊。\n4. 解决某些特殊情况下获取网卡信息失败导致启动失败的问题。\n5. 支持按照用户ID来搜索用户。\n6. 添加获取某个用户是否在聊天室的接口。\n7. 优化多端加入聊天室的处理。\n\n--------------\nRelease note 1.1.9:\n1. 解决服务器时间误差太大引起的问题。\n2. 添加推送过期配置。\n3. 支持发送好友请求后5分钟之内再次发送。\n4. Server API支持根据群成员类型获取用户群列表。\n5. 添加配置，是否允许群主和群管理员无限制撤回自己的消息。\n\n--------------\nRelease note 1.1.8:\n1. 解决可以把群主设置为管理员的问题。\n2. 发送好友请求之后5分钟内可以再次发送。\n3. 解决撤回消息中原消息二进制内容格式错误问题。\n\n--------------\nRelease note 1.1.7:\n1. 优化用户搜索功能。\n2. 推送消息中使用群备注。\n3. 推送消息中添加发送者和目标头像。\n4. 优化撤回消息流程。\n\n--------------\nRelease note 1.1.6:\n1. 支持用户设置查找自己的方法。\n2. 解决获取用户信息返回type无效的问题。\n3. 添加用户获取频道的功能。\n\n--------------\nRelease note 1.1.5:\n1. 添加获取所有用户的Server API。\n2. 解决添加好友时没有处理黑名单的问题。\n\n--------------\nRelease note 1.1.4:\n1. 添加PC客户端多端登录互踢时没有更新pc在线状态问题。\n2. 添加支持使用AES256加密。\n3. Server API添加获取单个群成员的接口。\n4. 添加配置，添加机器人为好友时是否自动接受。\n\n--------------\nRelease note 1.1.3:\n1. 添加服务器和客户端时间检查功能。\n2. 解决用户被block后session失效的问题。\n3. 添加消息撤回回调。\n4. 优化群组撤回逻辑。\n5. 解决用户离开群组后还能修改群昵称的问题。\n6. 修改server api修改好友关系回调数据错误问题。\n7. 同步超级群组数据库和数据。\n\n--------------\nRelease note 1.1.2:\n1. 会议SDK添加查询会议是否存在的接口\n2. 单聊会话定向消息分发包含发送者\n\n--------------\nRelease note 1.1.1:\n1. 当用户获取群组信息，可以根据返回信息判断是否在群中。\n2. 搜索用户时，过滤掉已删除用户\n3. 支持单聊消息的定向消息\n4. 解决关闭roaming，且message.compensate_time_limit配置为-1时，首次消息无法同步的问题\n5. 解决禁止客户端群操作flag 解析错误\n\n--------------\nRelease note 1.1:\n1. Channel API添加检查用户是否订阅接口\n2. Server API发送消息时添加检查对象是否存在\n3. Channel API添加修改频道菜单接口\n4. 内置对象存储的优化\n\n--------------\nRelease note 1.0:\n1. SDK检查工具添加help命令\n2. 去掉短连接端口被网络爬虫扫描输出的异常日志\n3. API支持创建组织群\n4. 添加配置禁止客户端进行某些群操作\n5. 解决route请求时可能不能正确携带推送类型的问题\n6. 会议成员离开加上离开原因\n7. 添加停止程序的命令\n8. 添加RTP Forward的API\n\n--------------\nRelease note 0.99:\n1. API获取用户信息时，过滤掉已经删除用户。\n2. 消息转发功能支持设置include/exclude功能，支持按区间过滤。\n3. 添加新的群组类型：组织群。组织群适用于公司部门群场景。\n4. 内置对象存储支持绝对路径和相对路径配置\n5. 当开启禁止陌生人聊天时，可以添加例外人员\n6. 解决user setting并发问题\n7. 添加可选的android平台签名验证功能。\n\n--------------\nRelease note 0.98:\n1. 解决linux多端登录错误问题\n2. 添加获取用户群组和共同群组功能\n3. 解决windows下脚本编码错误问题\n\n--------------\nRelease note 0.97:\n1. 升级部分依赖库到最新版本\n2. 添加名片消息默认推送信息\n3. 添加deb和rpm格式软件包\n\n--------------\nRelease note 0.96:\n1. 文章消息添加摘要字段\n2. 单聊消息支持server api只发送给其中一方\n3. Server api添加会议录制/停止录制接口\n\n--------------\nRelease note 0.95:\n1. 添加按照用户删除会话接口\n2. 升级netty版本为4.1.68.Final\n3. 公众号文章添加摘要字段\n\n--------------\nRelease note 0.94:\n1. Server SDK添加删除会话接口\n2. 解决内置对象存储某些类型文件返回content-type错误问题\n3. 添加server api检查是否订阅频道接口\n4. 添加超频检查忽略信令\n5. gson单例化，且关掉html转义。\n\n--------------\nRelease note 0.93:\n1. Server API添加订阅频道功能\n2. 短链接端口添加HEAD方法处理\n3. Server SDK的HTTP Client调整部分参数，解决出现连接错误问题\n4. 添加敏感词回调功能\n\n--------------\nRelease note 0.92:\n1. SDK部分POJO对象添加无参数构造函数解决某些反序列化工具失败问题。\n2. 频道只有在auto属性为1时，才会回调函数及订阅事件。\n3. 添加配置，在关闭消息漫游时，客户端首次登录同步多久时间之内的消息。\n4. 频道添加菜单属性。\n\n---------------\nRelease note 0.91:\n1. 创建群组时检查群组类型的有效性。\n2. 添加配置消息回调时是否带上客户端信息。\n3. 添加群组成员时，检查是否已经在群组中。\n\n---------------\nRelease note 0.90:\n1. mysql-connector-java版本升级到8.0.28\n2. 配置文件中去掉绑定IP的配置，防止误操作\n3. 解决客户端触发限频多调用一次callback的错误。\n\n---------------\nRelease note 0.89:\n1. gson依赖库升级到2.8.9\n2. log4j升级到2.17.2\n3. 解决SDK部分响应反序列化失败的问题\n4. 添加配置允许PC多端\n\n---------------\nRelease note 0.88:\n1. 添加部分数据库表的索引。\n2. 优化频道订阅关系的缓存处理。\n3. 添加支持开放平台的接口。\n4. 机器人和频道回调消息中添加缺失信息。\n5. 频道automic状态为1时，都不发送消息给owner。\n6. 机器人api添加获取机器人信息的接口。\n7. 解决server api撤回单聊消息时发送方无法撤回的问题\n\n---------------\nRelease note 0.87:\n1. 优化pc在线状态逻辑。\n2. 添加配置当删除用户时使用的用户昵称。\n3. 添加获取单条消息接口。\n\n---------------\nRelease note 0.86:\n1. Server SDK获取在线用户结果的变量改成公开\n\n---------------\nRelease note 0.85:\n1. 消息只能撤回一次，不能重复撤回。\n3. gzip压缩避免内存泄漏\n\n---------------\nRelease note 0.84:\n1. 定向消息，如果有多于一个收件人，只保存第一个收件人，避免定向消息被远程消息拉取下来。\n3. 内置文件存储，是否内存避免内存泄漏。\n\n---------------\nRelease note 0.83:\n1. 解决多端登陆时，处理好友请求状态同步问题\n2. SDK会议接口中添加permanent参数，可以创建永久保存会议。\n\n---------------\nRelease note 0.82:\n1. 修正PC在线状态逻辑错误问题\n2. 销毁用户时，清理所有信息\n4. SDK中添加更新消息的接口（仅专业版支持）\n5. SDK中添加获取在线用户数据（仅专业版支持）\n\n---------------\nRelease note 0.81:\n1. 修正PC在线状态某些特殊情况下错误问题\n2. 写入用户信息关系表时带上会话信息\n\n---------------\nRelease note 0.80:\n1. 全局频道或者可以给非订阅用户发送消息的频道允许非订阅用户回复消息\n2. Server API获取群组成员带上群组成员加入时间\n4. 支持平板端接入\n5. 解决有时PC在线状态错误问题\n6. log4j2升级到2.17.1\n\n---------------\nRelease note 0.79:\n1. 频道API发送消息时，如果automic则不发送给频道主\n2. 修改UserSetting表的key字段长度\n3. 敏感词过滤跳过链接，链接内的词语不过滤敏感词\n4. 销毁聊天室时，清理相关数据\n6. 加入聊天室时判断是否聊天室已经清理\n7. 升级log4j到log4j2\n\n---------------\nRelease note 0.78:\n1. 添加是否允许机器人自定义群通知的配置\n2. 修正禁止存储searchablecontent时的错误问题\n3. 解决API修改群组或用户为空时的异常问题\n4. 当用户修改自己信息时，通知其他的更新自己的信息\n5. MySQL数据字段中的关键字改为大小写敏感\n7. 使用新的id生成方法，生成9为数字小写字母组成的id。\n\n---------------\nRelease note 0.77:\n1. Server API添加获取频道信息，销毁频道，销毁机器人功能。\n2. 解决频道API发送中文乱码问题。\n3. 解决频道拉取远程消息错乱问题。\n4. 添加频道无密钥的错误码。\n5. 解决频道和机器人API高压力下错乱问题。\n\n---------------\nRelease note 0.76:\n1. 为聊天室单独添加拉取远程消息开关。\n2. 获取远程消息支持过滤消息类型。\n3. 推送、消息、回调等事件HTTP请求失败打印提示信息。\n\n---------------\nRelease note 0.75:\n1. 修正有时欢迎语排序乱序问题。\n2. 机器人禁止获取IM token。\n\n---------------\nRelease note 0.74:\n1. 发送好友请求时，如果已经是好友了，返回已经是好友的错误码\n2. 修正通过server api修改用户昵称没有通知客户端的问题\n3. 添加限频配置项\n\n---------------\nRelease note 0.73:\n1. 优化客户端断开连接功。\n2. 解决双方同时添加好友，后接受的失败的问题。\n\n---------------\nRelease note 0.72:\n1. 添加提醒消息回调\n2. 优化客户端断开连接功能\n3. 支持客户端lite模式\n\n---------------\nRelease note 0.71:\n1. 添加多端登录被踢下线的错误码\n2. 添加VOIP免打扰功能\n3. 消息撤回推送功能\n4. 推送只有pushData，没有pushContent也要推送\n\n---------------\nRelease note 0.70:\n1. 修改敏感词过滤问题\n2. 添加修改好友附加信息的server api\n\n---------------\nRelease note 0.69:\n1. 完善会议API\n2. 解决配置文件中特殊字符的问题\n3. 添加简单的健康检查API\n\n---------------\nRelease note 0.68:\n1. 去掉脚本中GC日志输出，减少无效日志。\n2. 添加配置是否加密存储消息。\n3. 当接受好友请求时，如果请求原因为空，不发送消息。\n4. 添加开关，当pc/web在线时移动端默认是否接收通知。\n5. 解决文件不存在时的异常日志。\n\n---------------\nRelease note 0.67:\n1. Server API发送好友强制参数错误问题\n2. 添加群组成员附加信息字段\n3. 添加配置，允许加入聊天室不存在时自动创建\n4. 解决Server API创建群组，部分参数无效问题\n5. Server SDK链接复用问题修正\n\n---------------\nRelease note 0.66:\n1. Server SDK支持多个机器人账户\n\n---------------\nRelease note 0.65:\n1. 添加分段更新好友/好友请求/用户设置功能，防止相关数据太大无法更新下来\n2. 同步Server SDK中关于会议的接口\n3. 修正Server API设置好友请求被限制的问题\n\n---------------\nRelease note 0.64:\n1. 修正0.62版本重构引入的短链接错乱问题\n2. 添加server api获取群组信息缺失字段\n3. 添加配置项，可以为内置存储配置远程服务地址\n\n---------------\nRelease note 0.63:\n1. 实现频道权限功能\n2. 配置文件中打开默认开启新好友欢迎语模式\n3. 客户端更新用户设置时，不用再通知当前端\n4. 群成员和好友请求中添加Extra字段\n\n---------------\nRelease note 0.62:\n1. 修改限频逻辑，server API，机器人api，频道api和客户端的限频要分开，避免server api超频导致客户端无法使用。\n2. 添加关闭群主/群管理撤回用户权限的开关。\n3. 对部分代码进行了重构。\n\n---------------\nRelease note 0.61:\n1. 升级缓存Hazelcast版本\n\n---------------\nRelease note 0.60:\n1. 解决server api修改群组信息失败问题\n\n---------------\nRelease note 0.59:\n1. 当server api未签名时，返回未签名的错误码\n2. 当群成员离开群后再次加入群时，修改群成员createTime为最后一次加入时间\n3. 解决自定义群组操作通知无效的问题\n4. 群组修改extra时，发送通知给客户端\n5. server api修改用户信息时添加修改name属性能力\n6. 为user messages表添加会话信息及索引等\n8. 内置测试存储文件上限提升到200MB\n\n---------------\nRelease note 0.58:\n1. 多人音视频添加成员也需要推送消息\n2. 添加禁言时允许发送的消息类型配置\n3. 添加频道相关api\n\n---------------\nRelease note 0.57:\n1. 修正某些情况下群组成员变更无法同步到客户端的问题\n\n---------------\nRelease note 0.56:\n1. 修正同一个设备登录多个用户的问题\n2. 优化启动脚本，可以在bin目录下执行\n\n---------------\nRelease note 0.55\n1. 添加更新用户api接口\n\n---------------\nRelease note 0.54:\n1. 添加对接第三方敏感词处理接口\n2. 添加消息转发类型过滤参数\n3. 去掉对客户端最大版本号的限制，可以兼容未来版本客户端\n4. 去掉默认敏感词\n\n---------------\nRelease note 0.53:\n1. 修正当敏感词策略为忽略时敏感词消息会从历史消息功能中拉取的问题\n2. 修正创建群组时，如果没有把owner加入到群成员列表中，服务器自动加入群成员列表，但count计数时没有加入的问题\n3. 添加获取两个用户之间用户关系的接口\n4. 解决某些情况下群组成员计数不准确的问题\n\n---------------\nRelease note 0.52:\n1. 添加配置是否同步用户信息中敏感信息到客户端\n2. SDK添加会话置顶功能\n3. 屏蔽掉日志中消息内容的打印，防止日志泄漏聊天内容\n4. 添加机器人进行群操作的功能\n5. 添加机器人更改机器人回调地址的接口\n6. 创建群组时，如果群主不在成员列表中自动加入群主\n8. 禁止客户端直接修改自己的电话号码，只能通过server api修改自己的电话号码\n9. 推送接听信息到客户端\n10. 优化客户端被踢下线的逻辑\n11. 内置存储下载时带上content-type字段\n12. 添加历史消息自动清除功能，3年以上的历史消息自动删除\n\n---------------\nRelease note 0.51:\n1. 修改群成员昵称时，发送通知消息\n2. 添加异常报警功能\n3. 修正清除客户端清除掉数据库，无法获取自己发送消息的问题\n4. 解决某些特殊情况下，用户session错误问题\n5. 优化多端客户端被踢下线或者pc被手机踢下线的功能\n\n---------------\nRelease note 0.50:\n1. 解决分页查找用户或者频道，查找翻页错误问题\n2. 添加是否允许客户端发送群操作通知的开关\n3. 添加禁止客户端发送消息类型的配置，可以配置禁止客户端发送特定类型消息\n4. 添加设置群成员昵称接口\n5. 添加配置，当退群或者踢人时是否发送显式通知消息\n\n---------------\nRelease note 0.48\n1. 推送数据中加上用户id\n2. server sdk发送消息接口添加定向用户参数\n3. 状态消息改为可以同步到发送者其它端\n4. 支持jdk15\n5. 添加撤回组播和广播消息接口\n6. 解决用户关系不存在时无法备注的问题\n\n---------------\nRelease note 0.48\n1. 同步专业版数据库\n\n---------------\nRelease note 0.47:\n1. 添加按照时间段免打扰功能\n2. 解决服务器压力过大时消息id可能重复问题\n3. 解决当拉取历史消息时，如果中间几个月没有发过消息无法拉取消息问题\n4. 移除掉无用的fastjson库，避免系统安全警告\n5. 添加群组/用户信息/频道信息变更通知\n\n---------------\nRelease note 0.46:\n1. Server api获取用户好友以好友状态时间排序\n2. 增加Server api发送好友请求的功能\n3. 解决server api删除好友时没有发送通知的问题\n4. 添加PC在线时是否移动端推送的开关\n5. 在频道或机器人没有密钥的情况下禁止使用api\n6. 添加默认文件助手用户\n7. 支持群主或群管理修改群成员昵称的功能\n\n---------------\nRelease note 0.45:\n1. 修正golang server api请求兼容问题。\n2. 修改两个用户互相发送好友请求时，丢失其中一条的问题。\n3. 解决server api删除好友失败的问题。\n\n---------------\nRelease note 0.44:\n1. 解决server api修改群成员昵称不生效的问题\n2. 添加服务器端允许撤回时间最长限制，仅对普通用户有效，系统管理员/server api/群管理员可以任何时候撤回消息\n3. 获取群成员接口检查权限，不在群组中成员无法获取群成员。\n4. 撤回消息的extra中添加更多原始消息内容\n5. 用户在线状态回调接口添加包名\n6. 创建群组时，按照请求列表顺序对成员排序\n7. 修正server SDK中的错误测试例\n9. Server SDK中添加对专业版白名单的支持\n10. 修正server api中设置好友状态不能实时同步到客户端的问题\n11. 修正客户端创建群组时，群主的群成员状态错误问题\n\n---------------\nRelease note 0.43:\n1. 修改撤回消息，extra信息填写错误问题\n2. 修正黑名单设置后无法取消问题\n3. 推送信息添加push_data字段\n4. 消息过期时间问题修正\n5. server api创建群组时，添加更多的可选参数\n6. 修正推送数据中计数不准确问题\n\n> *** 0.42 版本增加了群成员数限制，默认为2000。如果您想修改默认值，可以在升级版本之后，修改t_setting表，把默认的大小改为您期望的。另外修改t_group表，把已经存在的群组max_member_count改成您期望的，然后重启。***\n\n--------------\n\nRelease note 0.42:\n1. 当接受好友请求时，如果已经时好友，返回已经是好友的错误码\n2. 解决SDK中修改群信息缺少自定义通知内容的问题\n3. Server api获取群成员过滤掉已经删除成员信息\n4. SDK增加群内禁言功能（仅专业版支持）\n5. 转发消息带上消息id和时间戳\n6. 对拉黑server api添加参数校验\n7. 群成员添加加入时间属性\n8. 音视频电脑挂掉消息不增加未读消息计数\n9. 添加对群成员最大限制控制，默认为2000\n10. 普通成员可以修改群extra属性。\n12. 修改使用server api操作群时通知错误\n> *** 0.42 版本增加了群成员数限制，默认为2000。如果您想修改默认值，可以在升级版本之后，修改t_setting表，把默认的大小改为您期望的。另外修改t_group表，把已经存在的群组max_member_count改成您期望的，然后重启。***\n\n--------------\n\nRelease note 0.41:\n1. 添加手机控制PC下线功能\n2. 添加是否保存searchable_content字段的配置\n3. 增加移动端退出不清除session且不推送消息操作（现在移动端退出有3个可选参数，断开连接有消息就推送/断开连接清掉服务器session/断开连接不推送且保留session）\n4. SDK添加对物联网设备的支持（物联网接入功能仅专业版有效)\n\n--------------\n\nRelease note 0.40:\n1. 修正拒绝好友错误问题。\n2. 添加聊天室API。\n3. 添加禁止用户搜索和禁止添加好友的配置。\n4. 升级mysql connector到8.0.19版本。\n5. 添加PC在线状态通知。\n6. 在撤回消息中加上被撤回的内容。\n7. 修改设置黑名单失败的问题。\n8. 添加sticker bucket的支持。\n\n--------------\n\nRelease note 0.39:\n1. 修正群内定向消息发送错误问题\n2. 添加好友成功多语言处理\n3. 修正拒绝好友请求的错误问题\n4. 修正内置测试文件服务器部分错误问题\n5. 添加机器人根据电话号码或用户名查询用户接口\n6. 修正Server SDK中的用户关系错误问题\n7. 修改获取用户在线状态错误问题\n8. 修正用户信息中社交字段无法更新问题\n9. 在好友关系中添加extra字段\n10. 给token添加过期时间配置\n11. 添加获取聊天室成员的api\n13. 修改被封禁用户连接失败的错误码\n14. 添加好友请求推送\n\n--------------\n\nRelease note 0.38:\n1. 添加好友请求过期时间配置，可以配置重复发起好友请求时间\n2. 修正黑名单策略为1时发送消息仍失败的错误\n3. 增加sdk中聊天室创建接口，增加sdk聊天室相关测试代码\n4. 修改创建用户时不能指定用户类型的错误\n5. 增加日志默认大小\n6. 修改频道发送消息给指定用户错误问题\n7. 添加检查token是否正确的api\n8.  修正频道创建错误，修正频道发送消息错误\n\n---------------\nRelease note 0.37-1:\n1. 修复聊天室逻辑错误\n\n---------------\nRelease note 0.37\n1. 修正sdk中好友相关接口的错误。\n2. 添加是否运行陌生人聊天的配置。\n3. 增加获取备注的api。\n4. 增加用户在线状态回调功能。\n5. 优化聊天室逻辑，添加用户超时退出聊天室配置和是否发消息自动加入配置。\n6. 禁止发送消息给被封禁用户。\n7. 判断是否devicetoken重复时，加上包名条件。\n8. 添加好友请求相关时间配置。\n9. 添加频道SDK\n\n---------------\nRelease note 0.36\n1. 修正某些特殊情况下群组操作不同步的问题\n2. 优化用户的session管理\n\n---------------\nRelease note 0.35\n1. 修正0.34版本引入的无法拉取消息的严重问题\n2. 修正单条消息大于512K时无法收取消息问题\n3. 修改群主被添加进群状态错误问题\n4. 添加新的搜索类型，新增加按照账户或按照电话号码搜索\n\n---------------\nRelease note 0.34\n1.，添加销毁用户server接口和功能\n2，添加获取用户群组列表接口和功能\n3，添加用户已删除状态\n4，解决IM服务调用推送服务内存泄漏问题\n5，添加服务器为用户缓存消息条数配置\n\n\n--------------\nRelease note 0.33\n\n1. 优化用户session逻辑\n\n--------------\n\nRelease note 0.32:\n1. 排除重复的device token\n2. 添加关闭多端功能。\n\n--------------\n\nRelease note 0.31:\n1，解决了黑名单的同步的问题\n2，解决了黑名单发送消息成功的问题\n\n--------------\n\nRelease note 0.30:\n1，重构了黑名单功能，好友关系和黑名单关系分开\n2，添加敏感词后立即生效\n3，转让群主后，群成员状态问题修复\n4，修改离线消息包大小，从1M改为512K\n"
        },
        {
          "name": "screenshots",
          "type": "tree",
          "content": null
        },
        {
          "name": "sdk",
          "type": "tree",
          "content": null
        },
        {
          "name": "systemd",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}