{
  "metadata": {
    "timestamp": 1736712210812,
    "page": 914,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjkyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "PocketMine/PocketMine-MP",
      "stars": 1253,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.5869140625,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n*.php text eol=lf\n*.sh text eol=lf\n*.txt text eol=lf\n*.properties text eol=lf\n*.bat text eol=crlf\n*.cmd text eol=crlf\n\n# Custom for Visual Studio\n*.cs     diff=csharp\n*.sln    merge=union\n*.csproj merge=union\n*.vbproj merge=union\n*.fsproj merge=union\n*.dbproj merge=union\n\n# Standard to msysgit\n*.doc\t diff=astextplain\n*.DOC\t diff=astextplain\n*.docx diff=astextplain\n*.DOCX diff=astextplain\n*.dot  diff=astextplain\n*.DOT  diff=astextplain\n*.pdf  diff=astextplain\n*.PDF\t diff=astextplain\n*.rtf\t diff=astextplain\n*.RTF\t diff=astextplain\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2919921875,
          "content": "players/*\nworlds/*\nplugins/*\nbin/*\ntimings/*\n*.log\n*.txt\n*.phar\nserver.properties\n/pocketmine.yml\n\n# Common IDEs\n.idea/*\nnbproject/*\n\n# Windows image file caches\nThumbs.db\n\n# Folder config file\nDesktop.ini\n\n# Mac crap\n.DS_Store\n/nbproject/private/\n\n# Sphinx-doc\n/docs/build/\n!/docs/requirements.txt\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.576171875,
          "content": "[submodule \"src/pocketmine/gui\"]\n\tpath = src/pocketmine/gui\n\turl = https://github.com/PocketMine/PocketMine-MP-GUI.git\n\tbranch = master\n[submodule \"src/raklib\"]\n\tpath = src/raklib\n\turl = https://github.com/PocketMine/RakLib.git\n\tbranch = master\n[submodule \"src/spl\"]\n\tpath = src/spl\n\turl = https://github.com/PocketMine/PocketMine-SPL.git\n[submodule \"tests/TesterPlugin\"]\n\tpath = tests/TesterPlugin\n\turl = https://github.com/PocketMine/TesterPlugin.git\n[submodule \"src/pocketmine/lang/locale\"]\n\tpath = src/pocketmine/lang/locale\n\turl = https://github.com/PocketMine/PocketMine-Language.git\n"
        },
        {
          "name": ".mailmap",
          "type": "blob",
          "size": 0.2890625,
          "content": "Shoghi Cervantes <shoghicp@gmail.com>\nShoghi Cervantes <shoghicp@gmail.com> Shoghi Cervantes <shoghicp@pocketmine.net>\nBrandon V <brandon15811@gmail.com>\nMichael Yoo <sekjun9878@gmail.com> Michael Yoo <michael@yoo.id.au>\nMichael Yoo <sekjun9878@gmail.com> Michael Yoo <sekjun9878@sekjun9878.info>"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.484375,
          "content": "language: php\n\nphp:\n - 7.0\n\nbranches:\n - master\n\nbefore_script:\n - mkdir plugins\n - wget -O plugins/DevTools.phar https://github.com/PocketMine/DevTools/releases/download/v1.11.0/DevTools_v1.11.0.phar\n - pecl install channel://pecl.php.net/pthreads-3.1.6\n - pecl install channel://pecl.php.net/weakref-0.3.2\n - echo | pecl install channel://pecl.php.net/yaml-2.0.0RC7\n\nscript:\n - php tests/TravisTest.php\n \nnotifications:\n email: false\n #webhooks: http://n.tkte.ch/h/214/wsNvmG43-ncxUVRrFPwSM-r0\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 8.1533203125,
          "content": "![](http://cdn.pocketmine.net/img/PocketMine-MP-h.png)\n\n# PocketMine-MP Contribution Guidelines\n\nYou must follow these guidelines if you wish to contribute to the PocketMine-MP code base, or participate in issue tracking.\n\n## I have a question\n* For questions, please refer to the _#pocketmine_ or _#mcpedevs_ IRC channel on Freenode. There is a [WebIRC](http://webchat.freenode.net?channels=pocketmine,mcpedevs&uio=d4) if you want.\n* You can ask directly to _[@PocketMine](https://twitter.com/PocketMine)_ in Twitter, but don't expect an immediate reply.\n* You may use our [Forum](http://forums.pocketmine.net) to ask questions.\n* We do not accept questions or support requests in our issue tracker.\n\n## Creating an Issue\n - First, use the [Issue Search](https://github.com/PocketMine/PocketMine-MP/search?ref=cmdform&type=Issues) to check if anyone has reported it.\n - If your issue is related to a plugin, you must contact their original author instead of reporting it here.\n - If your issue is related to a PocketMine official plugin, or our Android application, you must create an issue on that specific repository.\n - **Support requests are not bugs.** Issues such as \"How do I do this\" are not bugs and are closed as soon as a collaborator spots it. They are referred to our Forum to seek assistance.\n - **No generic titles** such as \"Question\", \"Help\", \"Crash Report\" etc. If an issue has a generic title they will either be closed on the spot, or a collaborator will edit it to describe the actual symptom.\n - Information must be provided in the issue body, not in the title. No tags are allowed in the title, and do not change the title if the issue has been solved.\n - Similarly, no generic issue reports. It is the issue submitter's responsibility to provide us an issue that is **trackable, debuggable, reproducible, reported professionally and is an actual bug**. If you do not provide us with a summary or instructions on how to reproduce the issue, it is a support request until the actual bug has been found and therefore the issue is closed.\n - To express appreciation, objection, confusion or other supported reactions on pull requests, issues or comments on them, use GitHub [reactions](https://github.com/blog/2119-add-reactions-to-pull-requests-issues-and-comments) rather than posting an individual comment with an emoji only. This helps keeping the issue/pull rqeuest conversation clean and readable.\n\n## Contributing Code\n* Use the [Pull Request](https://github.com/PocketMine/PocketMine-MP/pull/new) system, your request will be checked and discussed.\n* __Create a single branch for that pull request__\n* Code using the syntax as in PocketMine-MP. See below for an example.\n* The code must be clear and written in English, comments included.\n* Use descriptive commit titles\n* __No merge commits are allowed, or multiple features per pull request__\n\n**Thanks for contributing to PocketMine-MP!**\n\n### Code Syntax\n\nIt is mainly [PSR-2](https://github.com/php-fig/fig-standards/blob/master/accepted/PSR-1-basic-coding-standard.md) with a few exceptions.\n* Opening braces MUST go on the same line, and MUST NOT have spaces before.\n* `else if` MUST be written as `elseif`. _(It is in PSR-2, but using a SHOULD)_\n* Control structure keywords or opening braces MUST NOT have one space before or after them.\n* Code MUST use tabs for indenting.\n* Long arrays MAY be split across multiple lines, where each subsequent line is indented once. \n* Files MUST use only the `<?php` tag.\n* Files MUST NOT have an ending `?>` tag.\n* Code MUST use namespaces.\n* Strings SHOULD use the double quote `\"` except when the single quote is required.\n\n```php\n<?php \n\nnamespace pocketmine\\example;\n\nclass ExampleClass{\n\tconst EXAMPLE_CLASS_CONSTANT = 1;\n\tpublic $examplePublicVariable = \"defaultValue\";\n\tprivate $examplePrivateVariable;\n\t\n\tpublic function __construct($firstArgument, &$secondArgument = null){\n\t\tif($firstArgument === \"exampleValue\"){ //Remember to use === instead == when possible\n\t\t\t//do things\n\t\t}elseif($firstArgument === \"otherValue\"){\n\t\t\t$secondArgument = function(){\n\t\t\t\treturn [\n\t\t\t\t\t0 => \"value1\",\n\t\t\t\t\t1 => \"value2\",\n\t\t\t\t\t2 => \"value3\",\n\t\t\t\t\t3 => \"value4\",\n\t\t\t\t\t4 => \"value5\",\n\t\t\t\t\t5 => \"value6\",\n\t\t\t\t];\n\t\t\t}\n\t\t}\n\t}\n\n}\n```\n\n### RFC and Voting\n* These are big Pull Requests or contributions that change important behavior.\n* RFCs will be tagged with the *PR: RFC* label\n* A vote will be held once the RFC is ready. All users can vote commenting on the Pull Request\n* Comments MUST use \"Yes\" or \"No\" on the FIRST sentence to signify the vote, except when they don't want it to be counted.\n* If your comment is a voting comment, specify the reason of your vote or it won't be counted.\n* After voting has been closed, no further votes will be counted.\n* An RFC will be rejected if less than 50% + 1 (simple majority) has voted Yes.\n* If the RFC is approved, Team Members have the final word on its implementation or rejection.\n* RFCs with complex voting options will specify the vote percentage or other details.\n\n\n## Bug Tracking for Collaborators\n\n### Labels\nTo provide a concise bug tracking environment, prevent the issue tracker from over flowing and to keep support requests out of the bug tracker, PocketMine-MP uses a label scheme a bit different from the default GitHub Issues labels.\n\nPocketMine-MP uses GitHub Issues Labels. There are a total of 12 labels.\n\nNote: For future reference, labels must not be longer than 15 letters.\n\n#### Categories\nCategory labels are prefixed by `C:`. Multiple category labels may be applied to a single issue(but try to keep this to a minimum and do not overuse category labels).\n - C: Core - This label is applied when the bug results in a fatal crash, or is related to neither Gameplay nor Plugin API.\n - C: Gameplay - This label is applied when the bug effects the gameplay.\n - C: API - This label is applied when the bug effects the Plugin API.\n\n#### Pull Requests\nPull Requests are prefixed by `PR:`. Only one label may be applied for a Pull Request.\n - PR: Bug Fix - This label is applied when the Pull Request fixes a bug. \n - PR: Contribution - This label is applied when the Pull Request contributes code to PocketMine-MP such as a new feature or an improvement.\n - PR: RFC - Request for Comments\n\n#### Status\nStatus labels show the status of the issue. Multiple status labels may be applied.\n - Reproduced - This label is applied when the bug has been reproduced, or multiple people are reporting the same issue and symptoms in which case it is automatically assumed that the bug has been reproduced in different environments.\n - Debugged - This label is applied when the cause of the bug has been found.\n - Priority - This label is applied when the bug is easy to fix, or if the scale of the bug is global.\n - Won't Fix - This label is applied if the bug has been decided not be fixed for some reason. e.g. when the bug benefits gameplay. *This label may only be applied to a closed issue.*\n\n#### Miscellaneous\nMiscellaneous labels are labels that show status not related to debugging that bug. The To-Do label and the Mojang label may not be applied to a single issue at the same time.\n - To-Do - This label is applied when the issue is not a bug, but a feature request or a list of features to be implemented that count towards a milestone.\n - Mojang - This label is applied when the issue is suspected of being caused by the Minecraft: Pocket Edition client, but has not been confirmed.\n - Invalid - This label is applied when the issue is reporting a false bug that works as intended, a support request, etc. *This label may only be applied to a closed issue.*\n\n### Closing Issues\nTo keep the bug tracker clear of non-related issues and to prevent it from overflowing, **issues must be closed as soon as possible** (This may sound unethical, but it is MUCH better than having the BUG TRACKER filled with SUPPORT REQUESTS and \"I NEED HELP\").\n\nIf an issue does not conform to the \"Creating an Issue\" guidelines above, the issue should be closed.\n\n### Milestones\nPocketMine-MP uses GitHub Milestones to set a goal for a new release. A milestone is set on the following occasions.\n\n - A new Beta release\n - A new Stable release\n\nA milestone must use the following format:\n```\nAlpha_<version_number> [release_title][release_version]\n```\nFor example:\n```\nAlpha_1.4 beta2\n```\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 7.470703125,
          "content": "                   GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\n  This version of the GNU Lesser General Public License incorporates\nthe terms and conditions of version 3 of the GNU General Public\nLicense, supplemented by the additional permissions listed below.\n\n  0. Additional Definitions.\n\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\nGeneral Public License.\n\n  \"The Library\" refers to a covered work governed by this License,\nother than an Application or a Combined Work as defined below.\n\n  An \"Application\" is any work that makes use of an interface provided\nby the Library, but which is not otherwise based on the Library.\nDefining a subclass of a class defined by the Library is deemed a mode\nof using an interface provided by the Library.\n\n  A \"Combined Work\" is a work produced by combining or linking an\nApplication with the Library.  The particular version of the Library\nwith which the Combined Work was made is also called the \"Linked\nVersion\".\n\n  The \"Minimal Corresponding Source\" for a Combined Work means the\nCorresponding Source for the Combined Work, excluding any source code\nfor portions of the Combined Work that, considered in isolation, are\nbased on the Application, and not on the Linked Version.\n\n  The \"Corresponding Application Code\" for a Combined Work means the\nobject code and/or source code for the Application, including any data\nand utility programs needed for reproducing the Combined Work from the\nApplication, but excluding the System Libraries of the Combined Work.\n\n  1. Exception to Section 3 of the GNU GPL.\n\n  You may convey a covered work under sections 3 and 4 of this License\nwithout being bound by section 3 of the GNU GPL.\n\n  2. Conveying Modified Versions.\n\n  If you modify a copy of the Library, and, in your modifications, a\nfacility refers to a function or data to be supplied by an Application\nthat uses the facility (other than as an argument passed when the\nfacility is invoked), then you may convey a copy of the modified\nversion:\n\n   a) under this License, provided that you make a good faith effort to\n   ensure that, in the event an Application does not supply the\n   function or data, the facility still operates, and performs\n   whatever part of its purpose remains meaningful, or\n\n   b) under the GNU GPL, with none of the additional permissions of\n   this License applicable to that copy.\n\n  3. Object Code Incorporating Material from Library Header Files.\n\n  The object code form of an Application may incorporate material from\na header file that is part of the Library.  You may convey such object\ncode under terms of your choice, provided that, if the incorporated\nmaterial is not limited to numerical parameters, data structure\nlayouts and accessors, or small macros, inline functions and templates\n(ten or fewer lines in length), you do both of the following:\n\n   a) Give prominent notice with each copy of the object code that the\n   Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the object code with a copy of the GNU GPL and this license\n   document.\n\n  4. Combined Works.\n\n  You may convey a Combined Work under terms of your choice that,\ntaken together, effectively do not restrict modification of the\nportions of the Library contained in the Combined Work and reverse\nengineering for debugging such modifications, if you also do each of\nthe following:\n\n   a) Give prominent notice with each copy of the Combined Work that\n   the Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\n   document.\n\n   c) For a Combined Work that displays copyright notices during\n   execution, include the copyright notice for the Library among\n   these notices, as well as a reference directing the user to the\n   copies of the GNU GPL and this license document.\n\n   d) Do one of the following:\n\n       0) Convey the Minimal Corresponding Source under the terms of this\n       License, and the Corresponding Application Code in a form\n       suitable for, and under terms that permit, the user to\n       recombine or relink the Application with a modified version of\n       the Linked Version to produce a modified Combined Work, in the\n       manner specified by section 6 of the GNU GPL for conveying\n       Corresponding Source.\n\n       1) Use a suitable shared library mechanism for linking with the\n       Library.  A suitable mechanism is one that (a) uses at run time\n       a copy of the Library already present on the user's computer\n       system, and (b) will operate properly with a modified version\n       of the Library that is interface-compatible with the Linked\n       Version.\n\n   e) Provide Installation Information, but only if you would otherwise\n   be required to provide such information under section 6 of the\n   GNU GPL, and only to the extent that such information is\n   necessary to install and execute a modified version of the\n   Combined Work produced by recombining or relinking the\n   Application with a modified version of the Linked Version. (If\n   you use option 4d0, the Installation Information must accompany\n   the Minimal Corresponding Source and Corresponding Application\n   Code. If you use option 4d1, you must provide the Installation\n   Information in the manner specified by section 6 of the GNU GPL\n   for conveying Corresponding Source.)\n\n  5. Combined Libraries.\n\n  You may place library facilities that are a work based on the\nLibrary side by side in a single library together with other library\nfacilities that are not Applications and are not covered by this\nLicense, and convey such a combined library under terms of your\nchoice, if you do both of the following:\n\n   a) Accompany the combined library with a copy of the same work based\n   on the Library, uncombined with any other library facilities,\n   conveyed under the terms of this License.\n\n   b) Give prominent notice with the combined library that part of it\n   is a work based on the Library, and explaining where to find the\n   accompanying uncombined form of the same work.\n\n  6. Revised Versions of the GNU Lesser General Public License.\n\n  The Free Software Foundation may publish revised and/or new versions\nof the GNU Lesser General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\n  Each version is given a distinguishing version number. If the\nLibrary as you received it specifies that a certain numbered version\nof the GNU Lesser General Public License \"or any later version\"\napplies to it, you have the option of following the terms and\nconditions either of that published version or of any later version\npublished by the Free Software Foundation. If the Library as you\nreceived it does not specify a version number of the GNU Lesser\nGeneral Public License, you may choose any version of the GNU Lesser\nGeneral Public License ever published by the Free Software Foundation.\n\n  If the Library as you received it specifies that a proxy can decide\nwhether future versions of the GNU Lesser General Public License shall\napply, that proxy's public statement of acceptance of any version is\npermanent authorization for you to choose that version for the\nLibrary."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.091796875,
          "content": "# PocketMine-MP Legacy repository\nThis repository is no longer maintained and is kept for historical purposes only.\nActive development on PocketMine-MP can now be found [here](https://github.com/pmmp/pocketmine-mp).\n\n<!--\n# ![PocketMine-MP](http://cdn.pocketmine.net/img/PocketMine-MP-h.png)\n[![Build Status](https://travis-ci.org/PocketMine/PocketMine-MP.svg?branch=master)](https://travis-ci.org/PocketMine/PocketMine-MP)\n\n\n\tThis program is free software: you can redistribute it and/or modify\n\tit under the terms of the GNU Lesser General Public License as published by\n\tthe Free Software Foundation, either version 3 of the License, or\n\t(at your option) any later version.\n\n\tThis program is distributed in the hope that it will be useful,\n\tbut WITHOUT ANY WARRANTY; without even the implied warranty of\n\tMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n\tGNU Lesser General Public License for more details.\n\n\tYou should have received a copy of the GNU Lesser General Public License\n\talong with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n\n__PocketMine-MP is a free, open-source software that creates Minecraft: Pocket Edition servers and allows extending its functionalities__\n\n### [Homepage](http://www.pocketmine.net/)\n\n### [Forums](http://forums.pocketmine.net/)\n\n### [Documentation](http://pocketmine-mp.readthedocs.org/)\n\n### [Plugin Repository](http://plugins.pocketmine.net/)\n-->\n<!--## [FAQ: Frequently Asked Questions](https://github.com/PocketMine/PocketMine-MP/wiki/Frequently-Asked-Questions)-->\n<!--\n### [Official Jenkins server](http://jenkins.pocketmine.net/)\n\n### API Documentation\n * [Official Doxygen-generated documentation](http://docs.pocketmine.net/)\n * [Latest Doxygen generated from development](http://jenkins.pocketmine.net/job/PocketMine-MP-doc/doxygen/)\n\n### [Twitter @PocketMine](https://twitter.com/PocketMine)\n\n### IRC Chat #pocketmine (or #mcpedevs) @ irc.freenode.net\n[#pocketmine + #mcpedevs channel WebIRC](http://webchat.freenode.net/?channels=pocketmine,mcpedevs)\n\n### Want to contribute?\n* Check the [Contributing Guidelines](CONTRIBUTING.md)\n\n\n## Third-party Libraries/Protocols Used\n* __[PHP Sockets](http://php.net/manual/en/book.sockets.php)__\n* __[PHP mbstring](http://php.net/manual/en/book.mbstring.php)__\n* __[PHP SQLite3](http://php.net/manual/en/book.sqlite3.php)__\n* __[PHP BCMath](http://php.net/manual/en/book.bc.php)__\n* __[PHP pthreads](http://pthreads.org/)__ by _[krakjoe](https://github.com/krakjoe)_: Threading for PHP - Share Nothing, Do Everything.\n* __[PHP YAML](https://code.google.com/p/php-yaml/)__ by _Bryan Davis_: The Yaml PHP Extension provides a wrapper to the LibYAML library.\n* __[LibYAML](http://pyyaml.org/wiki/LibYAML)__ by _Kirill Simonov_: A YAML 1.1 parser and emitter written in C.\n* __[cURL](http://curl.haxx.se/)__: cURL is a command line tool for transferring data with URL syntax\n* __[Zlib](http://www.zlib.net/)__: A Massively Spiffy Yet Delicately Unobtrusive Compression Library\n* __[Source RCON Protocol](https://developer.valvesoftware.com/wiki/Source_RCON_Protocol)__\n* __[UT3 Query Protocol](http://wiki.unrealadmin.org/UT3_query_protocol)__\n-->\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "start.cmd",
          "type": "blob",
          "size": 0.9052734375,
          "content": "@echo off\nTITLE PocketMine-MP server software for Minecraft: Pocket Edition\ncd /d %~dp0\n\nif exist bin\\php\\php.exe (\n\tset PHPRC=\"\"\n\tset PHP_BINARY=bin\\php\\php.exe\n) else (\n\tset PHP_BINARY=php\n)\n\nif exist PocketMine-MP.phar (\n\tset POCKETMINE_FILE=PocketMine-MP.phar\n) else (\n\tif exist src\\pocketmine\\PocketMine.php (\n\t\tset POCKETMINE_FILE=src\\pocketmine\\PocketMine.php\n\t) else (\n\t\techo \"Couldn't find a valid PocketMine-MP installation\"\n\t\tpause\n\t\texit 1\n\t)\n)\n\nREM if exist bin\\php\\php_wxwidgets.dll (\nREM \t%PHP_BINARY% %POCKETMINE_FILE% --enable-gui %*\nREM ) else (\n\tif exist bin\\mintty.exe (\n\t\tstart \"\" bin\\mintty.exe -o Columns=88 -o Rows=32 -o AllowBlinking=0 -o FontQuality=3 -o Font=\"DejaVu Sans Mono\" -o FontHeight=10 -o CursorType=0 -o CursorBlinks=1 -h error -t \"PocketMine-MP\" -i bin/pocketmine.ico -w max %PHP_BINARY% %POCKETMINE_FILE% --enable-ansi %*\n\t) else (\n\t\t%PHP_BINARY% -c bin\\php %POCKETMINE_FILE% %*\n\t)\nREM )\n"
        },
        {
          "name": "start.sh",
          "type": "blob",
          "size": 1.12890625,
          "content": "#!/bin/bash\nDIR=\"$(cd -P \"$( dirname \"${BASH_SOURCE[0]}\" )\" && pwd)\"\ncd \"$DIR\"\n\nDO_LOOP=\"no\"\n\nwhile getopts \"p:f:l\" OPTION 2> /dev/null; do\n\tcase ${OPTION} in\n\t\tp)\n\t\t\tPHP_BINARY=\"$OPTARG\"\n\t\t\t;;\n\t\tf)\n\t\t\tPOCKETMINE_FILE=\"$OPTARG\"\n\t\t\t;;\n\t\tl)\n\t\t\tDO_LOOP=\"yes\"\n\t\t\t;;\n\t\t\\?)\n\t\t\tbreak\n\t\t\t;;\n\tesac\ndone\n\nif [ \"$PHP_BINARY\" == \"\" ]; then\n\tif [ -f ./bin/php7/bin/php ]; then\n\t\texport PHPRC=\"\"\n\t\tPHP_BINARY=\"./bin/php7/bin/php\"\n\telif [ type php 2>/dev/null ]; then\n\t\tPHP_BINARY=$(type -p php)\n\telse\n\t\techo \"Couldn't find a working PHP 7 binary, please use the installer.\"\n\t\texit 1\n\tfi\nfi\n\nif [ \"$POCKETMINE_FILE\" == \"\" ]; then\n\tif [ -f ./PocketMine-MP.phar ]; then\n\t\tPOCKETMINE_FILE=\"./PocketMine-MP.phar\"\n\telif [ -f ./src/pocketmine/PocketMine.php ]; then\n\t\tPOCKETMINE_FILE=\"./src/pocketmine/PocketMine.php\"\n\telse\n\t\techo \"Couldn't find a valid PocketMine-MP installation\"\n\t\texit 1\n\tfi\nfi\n\nLOOPS=0\n\nset +e\nwhile [ \"$LOOPS\" -eq 0 ] || [ \"$DO_LOOP\" == \"yes\" ]; do\n\tif [ \"$DO_LOOP\" == \"yes\" ]; then\n\t\t\"$PHP_BINARY\" \"$POCKETMINE_FILE\" $@\n\telse\n\t\texec \"$PHP_BINARY\" \"$POCKETMINE_FILE\" $@\n\tfi\n\t((LOOPS++))\ndone\n\nif [ ${LOOPS} -gt 1 ]; then\n\techo \"Restarted $LOOPS times\"\nfi\n"
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}