{
  "metadata": {
    "timestamp": 1736712036837,
    "page": 551,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "WhichBrowser/Parser-PHP",
      "stars": 1813,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".coveralls.yml",
          "type": "blob",
          "size": 0.1025390625,
          "content": "service_name: github-actions\n\ncoverage_clover: \n  - runner.xml\n  - phpunit.xml\n\njson_path: coveralls.json"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.1533203125,
          "content": "/tests export-ignore\n/.coveralls.yml export-ignore\n/.gitattributes export-ignore\n/.gitignore export-ignore\n/.github export-ignore\n/phpunit.xml export-ignore\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1552734375,
          "content": "runner.log\nrunner.xml\ncomposer.lock\npackage-lock.json\nvendor/*\npackage.json\nGruntfile.js\nnode_modules/*\nhumbug*\nbuild/*\n.vscode\n.DS_Store\n.phpunit.result.cache"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 5.37890625,
          "content": "\n# Pull requests\n\nThis project does continuous integration with [Travis](https://travis-ci.org/WhichBrowser/Parser-PHP/) and [Coveralls](https://coveralls.io/github/WhichBrowser/Parser-PHP). This means that every pull request must have the proper PSR-2 code standards and working unit tests. Please make sure your pull request passes all tests before submitting it.\n\nTo test your coding style run:\n\n```\nvendor/bin/phpcs --standard=PSR1,PSR2 src/\n```\n\nThen try the PHPunit unit tests:\n\n```\nvendor/bin/phpunit\n```\n\nAnd finally to test the WhichBrowser analyser:\n\n```\nphp bin/runner.php check --show\n```\n\n# Unit tests\n\nThis project uses both unit tests for the public API and it's own testing tool for testing if the analyser properly works. \n\nIf you contribute to the public API, please add revelant tests. The API currently has 100% code coverage and any PR should maintain this number. The tests can be found in the `tests/unit/Model/` directory and are checked using PHPunit. This should be fairly simple.\n\nTo run the unit tests:\n\n```\nvendor/bin/phpunit\n```\n\nThe data for the analyser can be found in the `tests/data/` directories. These are Yaml files containing an entry for every single test that is executed. Currently these directories contain 5000 different tests resulting in almost 100% code coverage. Every entries contains a number of keys, which represent the different parameters of the Parser object and an extra key which contains the result. If you add a new test, you should not provide the result yourself, but instead just provide the parameters and let the testing framework generate the result.\n\nA very simple test entry looks like this:\n\n```\n-\n    headers: 'User-Agent: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0; Xbox)'\n\n```\n\nOnce the results if generated by it will look like this:\n\n```\n-\n    headers: 'User-Agent: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0; Xbox)'\n    result: { browser: { name: 'Internet Explorer', version: '9.0' }, engine: { name: Trident, version: '5.0' }, device: { type: gaming, subtype: console, manufacturer: Microsoft, model: 'Xbox 360' } }\n```\n\nTo run the tests:\n\n```\nphp bin/runner.php check --show\n```\n\nAnd to rebase the tests to generate the new results:\n\n```\nphp bin/runner.php rebase\n```\n\n# Data files\n\nA large part of the device model information is maintained in the data files. You can find these files in the `data/` directory. The files are little more than just arrays with the model number as key and another array a the value for each entry. The value contains a manufacturer, a model name and optionally the device type. If no device type is provided we assume it is a mobile phone. The device types that you are allowed to use are defined in the `src/Contstants/DeviceType.php` file.\n\n```\nDeviceModels::$ANDROID_MODELS = [\n    'LG-L30L'                                   => [ 'LG', 'F70' ]\n];\n```\n\nIn the example above, the model number is `LG-L30L`, the manufacturer is LG and the model name is F70. And because no device type is provided, it is a mobile phone.\n\nThings can get a bit more complicated, because the key of the array can also be a regular expression. To mark this, the final character of the key must be an exclamation mark. \n\n```\nDeviceModels::$ANDROID_MODELS = [\n    'LG-H8(10|11|12|15|18|19)!'                 => [ 'LG', 'G4' ]\n];\n```\n\nBecause the G4 uses multiple model numbers, like LG-H810, LG-H811, LG-H812 and so on, we do not want to include a seperate line for every single permutation. So we match all different model numbers with just a single regular expression.\n\nThe actual regular expression that is executed will look like this: `/^LG-H8(10|11|12|15|18|19)/iu`. \n\nAs an optimalisation it is also possible to use subsets. One regular expression will be tested to see if the whole subset must be skipped or looked at. A subset is marked by two exclamation marks.\n\n```\nDeviceModels::$ANDROID_MODELS = [\n    'LG-F[0-9]{3,3}!!' => [\n        'LG-F320!'                                  => [ 'LG', 'G2' ],\n        'LG-F340!'                                  => [ 'LG', 'G Flex' ]\n    ]\n];\n```\n\nAnd finally, it is also possible to use backreferences to match multiple models at the same time:\n\n```\nDeviceModels::$ANDROID_MODELS = [\n    'Aspire ([0-9]{4,4}[A-Z]?)!'                => [ 'Acer', 'Aspire $1', DeviceType::DESKTOP ]\n];\n```\n\nThis will both match the \"Aspire 5750G\", the \"Aspire 4738G\" and many more similar models.\n\n\nOn more thing you need to be aware of, all of the keys are not tested against the raw value extracted from the useragent string, but instead is pre-processed. The code for this can be found in the `DeviceModels::cleanup()` function in the `src/Data/DeviceModels.php` file.\n\nIndices\n-------\n\nIn order to reduce the time needed for model lookups, WhichBrowser uses an index. These files are located in the `data/indices/` directory and are automatically generated by the `update-indices.php` script. This script will evaluate every single regular expression and will try to create a key for every single possible value that matches the regular expression. If the regular expression is too complicated or has too many possible values it will place it in a secondary list of *difficult* regular expressions. \n\nAfter making a change to the data files you **need** to regenerate the indices, otherwise the new device model will not be picked up by WhichBrowser. \n\nTo update the indices of all relevant data files:\n\n```\nphp bin/update-indices.php --all\n```\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0380859375,
          "content": "Copyright (c) 2010-2017 Niels Leenheer\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 18.3994140625,
          "content": "<img src=\"https://api.whichbrowser.net/whichbrowser.svg\" width=\"400\">\n\nThis is an extremely complicated and almost completely useless browser sniffing library. Useless because you shouldn't use browser sniffing. So stop right now and go read something about feature detecting instead. I'm serious. Go away. You'll thank me later.\n\n\nWhichBrowser/Parser-PHP\n=======================\n\nThe PHP version of WhichBrowser for use on a server. Fully compatible with PHP 7.0 or higher, including PHP 8.\n\n![Build](https://github.com/WhichBrowser/Parser-PHP/workflows/Build/badge.svg)\n[![Coverage Status](https://coveralls.io/repos/WhichBrowser/Parser-PHP/badge.svg?branch=master&service=github)](https://coveralls.io/github/WhichBrowser/Parser-PHP?branch=master)\n[![License](https://poser.pugx.org/whichbrowser/parser/license)](https://packagist.org/packages/whichbrowser/parser)\n[![Latest Stable Version](https://poser.pugx.org/whichbrowser/parser/v/stable)](https://packagist.org/packages/whichbrowser/parser)\n\n[![Twitter Follow](https://img.shields.io/twitter/follow/whichbrowserlib.svg?style=social)](https://twitter.com/whichbrowserlib)\n\nAlso available:\n\n- [WhichBrowser/Parser-JavaScript](https://github.com/WhichBrowser/Parser-JavaScript)<br>\n  A JavaScript version of WhichBrowser for use with Node.js on the server\n\n- [WhichBrowser/Server](https://github.com/WhichBrowser/Server)<br>\n  A server written in PHP that provides a JavaScript API for use in the browser\n\n---\n\n\nAbout WhichBrowser\n------------------\n\n**But why *almost completely useless* and not completely useless?**\nWell, there is always an exception to the rule. There are valid reasons to do browser sniffing: to improve the user experience or to gather intelligence about which browsers are used on your website. My website is html5test.com and I wanted to know which score belongs to which browser. And to do that you need a browser sniffing library.\n\n**Why is it extremely complicated?**  \nBecause everybody lies. Seriously, there is not a single browser that is completely truthful. Almost all browsers say they are Netscape 5 and almost all WebKit browsers say they are based on Gecko. Even Internet Explorer 11 now no longer claims to be IE at all, but instead an unnamed browser that is like Gecko. And it gets worse. That is why it is complicated.\n\n**What kind of information does it give?**\nYou get a nice object which has information about the browser, rendering engine, os and device. It gives you names and versions and even device manufacturer and model. And WhichBrowser is pretty tenacious. It gives you info that others don't. For example:\n\n    JUC (Linux; U; 2.3.6; zh-cn; GT-I8150; 480*800) UCWEB8.7.4.225/145/800  \n    UC Browser 8.7 on a Samsung Galaxy W running Android 2.3.6\n\nAndroid is never mentioned\n\n    Mozilla/5.0 (Series40; Nokia501/10.0.2; Profile/MIDP-2.1 Configuration/CLDC-1.1) Gecko/20100401 S40OviBrowser/3.0.0.0.73  \n    Nokia Xpress 3.0.0 on a Nokia Asha 501 running Nokia Asha Platform\n\nDespite the useragent header claiming to be a Series40 device, we know it's actually running the Asha Platform and we also know that OviBrowser has been renamed to Nokia Xpress.\n\n    Opera/9.80 (X11; Linux zvav; U; zh) Presto/2.8.119 Version/11.10  \n    Opera Mini on a Nokia 5230 running Series60 5.0\n\nThe useragent header looks like Opera 11.10 on Linux, but we know it's Opera Mini. We can even figure out the real operating system and device model from other headers.\n\n\n\nRequirements\n-----------------\n\nWhichBrowser requires with PHP 7.0 or higher and supports PHP 8. WhichBrowser is compatible with the PSR-4 autoloading standard and follows PSR-1 and PSR-2 coding style.\n\n\nHow to install it\n-----------------\n\nYou can install WhichBrowser by using Composer - the standard package manager for PHP. The package is called `whichbrowser/parser`.\n\n    composer require whichbrowser/parser\n\nYou can easily update WhichBrowser by running a simple command.\n\n    composer update whichbrowser/parser\n\nYou should run this command as often as possible. You might even want to consider setting up a cron job for this purpose.\n\n\n\n\nHow to use it\n-------------\n\nThe first step require the Composer autoloader:\n\n```php\n<?php\n\n    require 'vendor/autoload.php';\n```\n\nThe second step is to create a new `WhichBrowser\\Parser` object. This object will contain all the information the library could find about the browser. The object has a required parameter, either the headers send by the browser, or a useragent string. Using the headers is preferable, because it will allow a better detection, but if you have just the useragent string, this will also work.\n\nFor example:\n\n```php\n$result = new WhichBrowser\\Parser(getallheaders());\n```\n\nor:\n\n```php\n$result = new WhichBrowser\\Parser($_SERVER['HTTP_USER_AGENT']);\n```\n\n\nThe variable `$result` now contains an object which you can query for information. There are various ways to access the information.\n\n\nFirst of all, you can call to `toString()` function to get a human readable identification:\n\n```php\n\"You are using \" . $result->toString();\n// You are using Chrome 27 on OS X Mountain Lion 10.8\n```\n\nAnother possiblity is to query the object:\n\n```php\n$result->isType('desktop');\n// true\n\n$result->isType('mobile', 'tablet', 'media', 'gaming:portable');\n// false\n\n$result->isBrowser('Maxthon', '<', '4.0.5');\n// false\n\n$result->isOs('iOS', '>=', '8');\n// false\n\n$result->isOs('OS X');\n// true\n\n$result->isEngine('Blink');\n// true\n```\n\nYou can also access these properties directly:\n\n```php\n$result->browser->toString();\n// Chrome 27  \n\n$result->engine->toString();\n// Blink\n\n$result->os->toString();\n// OS X Mountain Lion 10.8\n```\n\nOr access parts of these properties directly:\n\n```php\n$result->browser->name;\n// Chrome\n\n$result->browser->name . ' ' . $result->browser->version->toString();\n// Chrome 27\n\n$result->browser->version->value;\n// 27.0.1453.110\n\n$result->engine->name;\n// Blink\n```\n\nFinally you can also query versions directly:\n\n```php\n$result->browser->version->is('>', 26);\n// true\n\n$result->os->version->is('<', '10.7.4');\n// false\n```\n\nOptions\n-------\n\nIt is possible to set additional options by passing an array as the second parameter when creating the `Parser` object.\n\n### Disabling detection of bots\n\nIn some cases you may want to disable the detection of bots. This allows the bot the deliberately fool WhichBrowser, so you can pick up the identity of useragent what the bot tries to mimic. This is especially handy when you want to use WhichBrowser to switch between different variants of your website and want to make sure crawlers see the right variant of the website. For example, a bot that mimics a mobile device will see the mobile variant of you site.\n\n```php\n$result = new WhichBrowser\\Parser(getallheaders(), [ 'detectBots' => false ]);\n```\n\nEnable result caching\n---------------------\n\nWhichBrowser supports PSR-6 compatible cache adapters for caching results between requests. Using a cache is especially useful if you use WhichBrowser on every page of your website and a user visits multiple pages. During the first visit the headers will be parsed and the result will be cached. Upon further visits, the cached results will be used, which is much faster than having to parse the headers again and again.\n\nThere are adapters available for other types of caches, such as APC, Doctrine, Memcached, MongoDB, Redis and many more. The configuration of these adapters all differ from each other, but once configured, all you have to do is pass it as an option when creating the `Parser` object, or use the `setCache()` function to set it afterwards. WhichBrowser has been tested to work with the adapters provided by [PHP Cache](http://php-cache.readthedocs.org/en/latest/). For a list of other packages that provide adapters see [Packagist](https://packagist.org/providers/psr/cache-implementation).\n\nFor example, if you want to enable a memcached based cache you need to install an extra composer package:\n\n    composer require cache/memcached-adapter\n\nAnd change the call to WhichBrowser/Parser as follows:\n\n```php\n$client = new \\Memcached();\n$client->addServer('localhost', 11211);\n\n$pool = new \\Cache\\Adapter\\Memcached\\MemcachedCachePool($client);\n\n$result = new WhichBrowser\\Parser(getallheaders(), [ 'cache' => $pool ]);\n```\n\nor\n\n```php\n$client = new \\Memcached();\n$client->addServer('localhost', 11211);\n\n$pool = new \\Cache\\Adapter\\Memcached\\MemcachedCachePool($client);\n\n$result = new WhichBrowser\\Parser();\n$result->setCache($pool);\n$result->analyse(getallheaders());\n```\n\nYou can also specify after how many seconds a cached result should be discarded. The default value is 900 seconds or 15 minutes. If you think WhichBrowser uses too much memory for caching, you should lower this value. You can do this by setting the `cacheExpires` option or passing it as a second parameter to the `setCache()` function.\n\n\nAPI reference\n-------------\n\n### The Parser object\n\nAfter a new `WhichBrowser\\Parser` object is created, it contains a number of properties and functions. All of these properties are guaranteed to be present.\n\n**Properties:**\n\n* `browser`  \n  an object that contains information about the browser itself\n* `engine`  \n  an object that contains information about the rendering engine\n* `os`  \n  an object that contains information about the operating system\n* `device`  \n  an object that contains information about the device\n\n**Functions:**\n\n`getType()`  \nReturns the `type` and `subtype` property of the `device` object. If a subtype is present it is concatenated to the type and seperated by a semicolor, for example: `mobile:smart` or `gaming:portable`. If the subtype is not applicable, it just return the type, for example: `desktop` or `ereader`.\n\n`isType($type [,$type [,$type [,$type]]])`  \nIf a single argument is used, the function returns `true` if the argument matches the `type` propery of `device` object. The argument can optionally also provide a subtype by concatenating it to the type and seperating it with a semicolon. It can use multiple arguments in which case the function returns `true` if one of the arguments matches. If none of the arguments matches, it returns `false`\n\n`isMobile()`  \nReturn `true` if the browser is a mobile device, like a phone, tablet, ereader, camera, portable media player, watch or portable gaming console. Otherwise it returns `false`.\n\n`isBrowser($name [, $comparison, $version])`  \nIs used to query the `name` and `version` property of the `browser` object. The funcion can contain a single argument to a simple comparison based on `name`, or three arguments to compare both `name` and `version`. The first argument always contains the name of the browser. The second arguments is a string that can container either `<`, `<=`, `=`, `=>` or `>`. The third is an integer, float or string that contains the version. You can use versions like `10`, `10.7` or `'10.7.4'`. For more information about how version comparisons are performed, please see the `is()` function of the `Version` object.\n\n`isEngine($name [, $comparison, $version])`  \nIs used to query the `name` and `version` property of the `engine` object. This function works in exactly the same way as `isBrowser`.\n\n`isOs($name [, $comparison, $version])`  \nIs used to query the `name` and `version` property of the `os` object. This function works in exactly the same way as `isBrowser`.\n\n`isDetected()`  \nIs there actually some browser detected, or did we fail to detect anything?\n\n`toString()`  \nGet a human readable representation of the detected browser, including operating system and device information.\n\n\n### The browser object\n\nAn object of the `WhichBrowser\\Model\\Browser` class is used for the `browser` property of the main `WhichBrowser\\Parser` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `name`  \n  a string containing the name of the browser\n* `alias`  \n  a string containing an alternative name of the browser\n* `version`  \n  a version object containing information about the version of the browser\n* `stock`  \n  a boolean, true if the browser is the default browser of the operating system, false otherwise\n* `channel`  \n  a string containing the distribution channel, ie. 'Nightly' or 'Next'.\n* `mode`  \n  a string that can contain the operating mode of the browser, ie. 'proxy'.\n* `hidden`  \n  a boolean that is true if the browser does not have a name and is the default of the operating system.\n* `family`  \n  an object that contains information about to which family this browser belongs\n* `using`  \n  an object that contains information about to which kind of webview this browser uses\n\n**Functions:**\n\n`isFamily($name)`  \nDoes the family of this browser have this name, or does the browser itself have this name.\n\n`isUsing($name)`  \nIs the browser using a webview using with the provided name.\n\n`getName()`  \nGet the name of the browser\n\n`getVersion()`  \nGet the version of the browser\n\n`toString()`  \nGet a human readable representation of the detected browser\n\n\n### The engine object\n\nAn object of the `WhichBrowser\\Model\\Engine` class is used for the `engine` property of the main `WhichBrowser\\Parser` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `name`  \n  a string containing the name of the rendering engine\n* `version`  \n  a version object containing information about the version of the rendering engine\n\n**Functions:**\n\n`getName()`  \nGet the name of the rendering engine\n\n`getVersion()`  \nGet the version of the rendering engine\n\n`toString()`  \nGet a human readable representation of the detected rendering engine\n\n\n### The os object\n\nAn object of the `WhichBrowser\\Model\\Os` class is used for the `os` property of the main `WhichBrowser\\Parser` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `name`  \n  a string containing the name of the operating system\n* `version`  \n  a version object containing information about the version of the operating system\n* `family`  \n  an object that contains information about to which family this operating system belongs\n\n**Functions:**\n\n`isFamily($name)`  \nDoes the family of this operating system have this name, or does the operating system itself have this name.\n\n`getName()`  \nGet the name of the operating system\n\n`getVersion()`  \nGet the version of the operating system\n\n`toString()`  \nGet a human readable representation of the detected operating system\n\n\n### The device object\n\nAn object of the `WhichBrowser\\Model\\Device` class is used for the `device` property of the main `WhichBrowser\\Parser` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `type`  \n  a string containing the type of the browser.\n* `subtype`  \n  a string containing the subtype of the browser.\n* `identified`  \n  a boolean that is true if the device has been positively identified.\n* `manufacturer`  \n  a string containing the manufacturer of the device, ie. 'Apple' or 'Samsung'.\n* `model`  \n  as string containing the model of the device, ie. 'iPhone' or 'Galaxy S4'.\n\nThe `type` property can contain any value from the following list:\n\n* desktop\n* mobile\n* pda\n* dect\n* tablet\n* gaming\n* ereader\n* media\n* headset\n* watch\n* emulator\n* television\n* monitor\n* camera\n* printer\n* signage\n* whiteboard\n* devboard\n* inflight\n* appliance\n* gps\n* car\n* pos\n* bot\n* projector\n\nIf the `type` is \"mobile\", the `subtype` property can contain any value from the following list:\n\n* feature\n* smart\n\nIf the `type` is \"gaming\", the `subtype` property can contain any value from the following list:\n\n* console\n* portable\n\n**Functions:**\n\n`getManufacturer()`  \nGet the name of the manufacturer\n\n`getModel()`  \nGet the name of the model\n\n`toString()`  \nGet a human readable representation of the detected device\n\n\n### The family object\n\nAn object of the `WhichBrowser\\Model\\Family` class is used for the `family` property of the `WhichBrowser\\Model\\Browser` and `WhichBrowser\\Model\\Os` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `name`  \n  a string containing the name of the family\n* `version`  \n  a version object containing information about the version of the family\n\n**Functions:**\n\n`getName()`  \nGet the name of the family\n\n`getVersion()`  \nGet the version of the family\n\n`toString()`  \nGet a human readable representation of the family\n\n\n### The using object\n\nAn object of the `WhichBrowser\\Model\\Using` class is used for the `using` property of the `WhichBrowser\\Model\\Browser` object and contains a number of properties. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `name`  \n  a string containing the name of the webview\n* `version`  \n  a version object containing information about the version of the webview\n\n**Functions:**\n\n`getName()`  \nGet the name of the webview\n\n`getVersion()`  \nGet the version of the webview\n\n`toString()`  \nGet a human readable representation of the webview\n\n\n### The version object\n\nAn object of the `WhichBrowser\\Model\\Version` class is used for the `version` property of the `browser`, `engine` and `os` object and contains a number of properties and functions. If a property is not applicable in this situation it will be null or undefined.\n\n**Properties:**\n\n* `value`  \n  a string containing the original version number.\n* `alias`  \n  a string containing an alias for the version number, ie. 'XP' for Windows '5.1'.\n* `nickname`  \n  a string containing a nickname for the version number, ie. 'Mojave' for OS X '10.14'.\n* `details`  \n  an integer containing the number of digits of the version number that should be printed.\n\n**Functions:**\n\n`is($version)` or `is($comparison, $version)`  \nUsing this function it is easy to compare a version to another version. If you specify only one argument, this function will return if the versions are the same. You can also specify two arguments, in that case the first argument contains the comparison operator, such as `<`, `<=`, `=`, `=>` or `>`. The second argument is the version you want to compare it to. You can use versions like `10`, `10.7` or `'10.7.4'`, but be aware that `10` is not the same as `10.0`. For example if our OS version is `10.7.4`:\n\n```php\n$result->os->version->is('10.7.4');\n// true\n\n$result->os->version->is('10.7');\n// true\n\n$result->os->version->is('10');\n// true\n\n$result->os->version->is('10.0');\n// false\n\n$result->os->version->is('>', '10');\n// false\n\n$result->os->version->is('>', '10.7');\n// false\n\n$result->os->version->is('>', '10.7.3');\n// true\n```\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "bootstrap.php",
          "type": "blob",
          "size": 0.8193359375,
          "content": "<?php\n\nspl_autoload_register(function ($class) {\n\n    // project-specific namespace prefix\n    $prefix = 'WhichBrowser\\\\';\n\n    // base directory for the namespace prefix\n    $base_dir = __DIR__ . '/src/';\n\n    // does the class use the namespace prefix?\n    $len = strlen($prefix);\n    if (strncmp($prefix, $class, $len) !== 0) {\n        // no, move to the next registered autoloader\n        return;\n    }\n\n    // get the relative class name\n    $relative_class = substr($class, $len);\n\n    // replace the namespace prefix with the base directory, replace namespace\n    // separators with directory separators in the relative class name, append\n    // with .php\n    $file = $base_dir . str_replace('\\\\', '/', $relative_class) . '.php';\n\n    // if the file exists, require it\n    if (file_exists($file)) {\n        require $file;\n    }\n});\n"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 1.1904296875,
          "content": "{\n    \"name\": \"whichbrowser/parser\",\n\n    \"description\": \"Useragent sniffing library for PHP\",\n    \"keywords\": [\"useragent\",\"browser\",\"sniffing\", \"ua\"],\n    \"homepage\": \"http://whichbrowser.net\",\n    \"license\": \"MIT\",\n    \"authors\": [\n        {\n            \"name\": \"Niels Leenheer\",\n            \"email\": \"niels@leenheer.nl\",\n            \"role\": \"Developer\"\n        }\n    ],\n\n    \"require\": {\n        \"php\": \">=5.4.0\",\n        \"psr/cache\": \"^1.0 || ^2.0 || ^3.0\"\n    },\n\n    \"autoload\": {\n        \"psr-4\": {\n            \"WhichBrowser\\\\\": [ \"src/\" ]\n        }\n    },\n\n    \"suggest\": {\n        \"cache/array-adapter\": \"Allows testing of the caching functionality\"\n    },\n\n    \"require-dev\": {\n        \"symfony/yaml\": \"~3.4 || ~4.0\",\n        \"phpunit/php-code-coverage\": \"^5.0 || ^7.0\",\n        \"phpunit/phpunit\": \"^6.0 || ^8.0\",\n        \"php-coveralls/php-coveralls\": \"^2.0\",\n        \"icomefromthenet/reverse-regex\" : \"0.0.6.3\",\n        \"squizlabs/php_codesniffer\": \"^3.5\",\n        \"cache/array-adapter\": \"^1.1\"\n    },\n\n    \"autoload-dev\": {\n       \"psr-4\": {\n            \"WhichBrowserTest\\\\\":  \"tests/unit\",\n            \"WhichBrowser\\\\\": [ \"tests/src/\" ]\n        },\n\n        \"files\": [ \"tests/src/polyfills.php\" ]\n    }\n}\n"
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "phpunit.xml",
          "type": "blob",
          "size": 0.849609375,
          "content": "<phpunit\n    bootstrap=\"tests/src/bootstrap.php\"\n    colors=\"false\"\n    convertErrorsToExceptions=\"true\"\n    convertNoticesToExceptions=\"true\"\n    convertWarningsToExceptions=\"true\"\n    verbose=\"true\"\n    stopOnFailure=\"false\"\n    processIsolation=\"false\"\n    backupGlobals=\"false\"\n>\n    <testsuites>\n        <testsuite name=\"WhichBrowser tests\">\n            <directory suffix=\"Test.php\">tests/unit</directory>\n        </testsuite>\n    </testsuites>\n\n    <filter>\n       <whitelist addUncoveredFilesFromWhitelist=\"true\">\n            <directory suffix=\".php\">src/Model</directory>\n            <file>src/Parser.php</file>\n            <file>src/Analyser.php</file>\n            <file>src/Cache.php</file>\n        </whitelist>\n    </filter>\n\n    <logging>\n        <log type=\"coverage-html\" target=\"./build\" lowUpperBound=\"35\" highLowerBound=\"70\"/>\n    </logging>\n\n</phpunit>\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}