{
  "metadata": {
    "timestamp": 1736712079876,
    "page": 634,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "aws/aws-sdk-php-laravel",
      "stars": 1665,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2470703125,
          "content": ".gitattributes export-ignore\n.github export-ignore\n.gitignore export-ignore\n.travis.yml export-ignore\nCHANGELOG.md export-ignore\nCONTRIBUTING.md export-ignore\nMakefile export-ignore\nREADME.md export-ignore\nphpunit.xml export-ignore\ntests/ export-ignore\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0703125,
          "content": "composer.lock\ncomposer.phar\nvendor\n.idea\n.DS_Store\n.phpunit.result.cache"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 2.751953125,
          "content": "# CHANGELOG\n\n## 3.7.0 - 2022-03-08\n\n* Adds support for Laravel 9.0\n* Moves Travis CI tests to GitHub actions\n\n## 3.6.0 - 2020-09-14\n\n* Adds support for Laravel 8.0\n\n## 3.5.0 - 2020-03-11\n\n* Adds support for Laravel 7.0\n* Travis CI configuration updates\n\n## 3.4.0 - 2019-09-09\n\n* Adds support for Laravel 6.0\n* Travis CI configuration updates\n\n## 3.3.2 - 2019-03-15\n\n* Align with suggested Laravel configuration practices\n* Travis CI updated with PHP 7.3 and dependency resolution fixes\n\n## 3.3.1 - 2018-12-3\n\n*  Modify service provider to use different config for publishing and default usage\n\n## 3.3.0 - 2018-11-12\n\n* Adds AWS credentials to published service provider configuration by default \n\n## 3.2.1 - 2018-10-19\n\n* Update Travis CI with later PHP versions\n* Fix composer dependency resolution issue for Travis & PHP 5.5.9\n* Updated location of aws config file in README.md\n* Update README.md\n\n## 3.2.0 - 2018-09-28\n\n* Added --provider option for vendor:publish command\n* Added support for Laravel Auto-Discovery\n\n## 3.1.0 - 2016-01-17\n\n* Added support for Lumen.\n\n## 3.0.3 - 2015-09-18\n\n* Added support for configuring credentials with environmental variables, a ini\n  file at `~/.aws/credentials`, or with Ec2 instance profiles instead of\n  requiring their inclusion in the `aws.php` config file.\n\n## 3.0.3 - 2015-08-10\n\n* Removed usage of a dev dependency\n\n## 3.0.1 - 2015-08-05\n\n* Provide version information to SDK user agent\n\n## 3.0.0 - 2015-06-10\n\n* Service provider is now compatible with Laravel 5.1 and Version 3 of the AWS\n  SDK for PHP.\n\n## 2.0.1 - 2015-06-10\n\n* Service provider is now compatible with Lumen\n\n## 2.0.0 - 2015-03-12\n\n* Updated the service provider to work with Laravel 5.\n\n## 1.1.2 - 2015-02-13\n\n* Added alias to support DI from container.\n\n## 1.1.1 - 2014-05-12\n\n* Updated default module config file to make it more compatible with environment\n  credentials\n\n## 1.1.0 - 2013-09-03\n\n* Added package-level config that can be published with Artisan\n* Updated config loading logic to support package-level config\n* Updated config loading logic to support AWS SDK for PHP config files via the\n  `config_file` key\n* Updated code, tests, and the README to support the config refactoring\n* This module is now following [semver](http://semver.org/)\n\n## 1.0.4 - 2013-06-20\n\n* Added support for the AWS facade\n* Updated `composer.json` to require only specific components of Laravel\n* Updated `composer.json` to require version 2.2+ of the AWS SDK for PHP\n\n## 1.0.3 - 2013-04-25\n\n* Update Composer dependencies to work with newer version of the AWS SDK for PHP\n  and Laravel\n\n## 1.0.2 - 2013-03-11\n\n* Fixed an issue with config retrieval\n\n## 1.0.1 - 2013-03-07\n\n* Improved usage instructions in the README\n* Fixed logic for retrieving Laravel version\n\n## 1.0.0 - 2013-02-13\n\n* Initial release.\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 0.302734375,
          "content": "## Code of Conduct\nThis project has adopted the [Amazon Open Source Code of Conduct](https://aws.github.io/code-of-conduct). \nFor more information see the [Code of Conduct FAQ](https://aws.github.io/code-of-conduct-faq) or contact \nopensource-codeofconduct@amazon.com with any additional questions or comments."
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 5.8544921875,
          "content": "# Contributing to the AWS Service Provider for Laravel\n\nThank you for your interest in contributing to the AWS Service Provider for Laravel! \nWe work hard to provide a high-quality and useful SDK for our AWS services, and \nwe greatly value feedback and contributions from our community. Whether it's a \nnew feature, correction, or additional documentation, we welcome your pull requests. \nPlease submit your [issues][] or [pull requests][pull-requests] through GitHub.\n\nJump To:\n\n* [Bug Reports](_#Bug-Reports_)\n* [Feature Requests](_#Feature-Requests_)\n* [Code Contributions](_#Code-Contributions_)\n\n## How to contribute\n\n*Before you send us a pull request, please be sure that:*\n\n1. You're working from the latest source on the master branch.\n2. You check existing open, and recently closed, pull requests to be sure that \n   someone else hasn't already addressed the problem.\n3. You create an issue before working on a contribution that will take a significant \n   amount of your time.\n\n*Creating a Pull Request*\n\n1. Fork the repository.\n2. In your fork, make your change in a branch that's based on this repo's master branch.\n3. Commit the change to your fork, using a clear and descriptive commit message.\n4. Create a pull request, answering any questions in the pull request form.\n\nFor contributions that will take a significant amount of time, open a new issue to pitch \nyour idea before you get started. Explain the problem and describe the content you want to \nsee added to the documentation. Let us know if you'll write it yourself or if you'd like us \nto help. We'll discuss your proposal with you and let you know whether we're likely to \naccept it.   \n\n## Bug Reports\n\nBug reports are accepted through the [Issues][] page.\n\nBefore Submitting:\n\n* Do a search through the existing issues to make sure it has not already been reported. \n   If it has, comment your experience or +1 so we prioritize it.\n* If possible, upgrade to the latest release of the SDK. It's possible the bug has \n   already been fixed in the latest version.\n\nWriting the Bug Report:\n\nPlease ensure that your bug report has the following:\n\n* A short, descriptive title. Ideally, other community members should be able to get a \n   good idea of the issue just from reading the title.\n* A detailed description of the problem you're experiencing. This should include:\n    * Expected behavior of the SDK and the actual behavior exhibited.\n    * Any details of your application environment that may be relevant.\n    * Debug information, stack trace or logs.\n*  If you are able to create one, include a Minimal Working Example that reproduces the issue.\n* Use Markdown to make the report easier to read; i.e. use code blocks when pasting a \n   code snippet.\n\n## Feature Requests\n\nOpen an [issue][issues] with the following:\n\n* A short, descriptive title. Ideally, other community members should be able to get a \n   good idea of the feature just from reading the title.\n* A detailed description of the the proposed feature. \n    * Why it should be added to the SDK.\n    *  If possible, example code to illustrate how it should work.\n* Use Markdown to make the request easier to read;\n* If you intend to implement this feature, indicate that you'd like to the issue to be\n   assigned to you.\n\n\n## Code Contributions\n\nCode contributions to the SDK are done through [Pull Requests][pull-requests]. The list below are guidelines to use when submitting pull requests. These are the \nsame set of guidelines that the core contributors use when submitting changes, and \nwe ask the same of all community contributions as well:\n\n1. The SDK is released under the [Apache license][license]. Any code you submit\n   will be released under that license. For substantial contributions, we may\n   ask you to sign a [Contributor License Agreement (CLA)][cla].\n2. We follow all of the relevant PSR recommendations from the [PHP Framework\n   Interop Group][php-fig]. Please submit code that follows these standards.\n   The [PHP CS Fixer][cs-fixer] tool can be helpful for formatting your code.\n3. We maintain a high percentage of code coverage in our unit tests. If you make\n   changes to the code, please add, update, and/or remove tests as appropriate.\n4. Static code analysis with [PHPStan][phpstan] is automatically run on the `src` \n   directory for submitted pull requests. If there is a case that needs to be\n   ignored by static analysis, please update the `ignoreErrors` section in the\n   `phpstan.neon` config file in your PR, and point out why this case warrants\n   ignoring.\n5. If your code does not conform to the PSR standards, does not include adequate\n   tests, or does not contain a changelog document, we may ask you to update\n   your pull requests before we accept them. We also reserve the right to deny\n   any pull requests that do not align with our standards or goals.\n6. If you would like to implement support for a significant feature that is not\n   yet available in the SDK, please talk to us beforehand to avoid any\n   duplication of effort.\n7. We greatly appreciate contributions to our User Guide. The docs are written\n   as a [Sphinx][] website formatted with [reStructuredText][] (very similar to\n   Markdown). The User Guide is located in another repository. Please go to the \n   [awsdocs/aws-php-developers-guide](https://github.com/awsdocs/aws-php-developers-guide/).  \n   repository to suggest edits for the User Guide.\n8. If you are working on the SDK, make sure to check out the `Makefile` for some\n   of the common tasks that we have to do.\n\n\n[issues]: https://github.com/aws/aws-sdk-php-laravel/issues\n[pull-requests]: https://github.com/aws/aws-sdk-php-laravel/pulls\n[license]: http://aws.amazon.com/apache2.0/\n[cla]: https://github.com/aws/aws-cla/blob/master/amazon-single-contribution-license.txt\n[php-fig]: http://php-fig.org\n[cs-fixer]: http://cs.sensiolabs.org/\n[phpstan]: https://github.com/phpstan/phpstan\n[sphinx]: http://sphinx-doc.org/\n[restructuredtext]: http://sphinx-doc.org/rest.html\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 8.986328125,
          "content": "# Apache License\nVersion 2.0, January 2004\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n## 1. Definitions.\n\n\"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1\nthrough 9 of this document.\n\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the\nLicense.\n\n\"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled\nby, or are under common control with that entity. For the purposes of this definition, \"control\" means\n(i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract\nor otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial\nownership of such entity.\n\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n\"Source\" form shall mean the preferred form for making modifications, including but not limited to software\nsource code, documentation source, and configuration files.\n\n\"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form,\nincluding but not limited to compiled object code, generated documentation, and conversions to other media\ntypes.\n\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License,\nas indicated by a copyright notice that is included in or attached to the work (an example is provided in the\nAppendix below).\n\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from)\nthe Work and for which the editorial revisions, annotations, elaborations, or other modifications represent,\nas a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not\ninclude works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work\nand Derivative Works thereof.\n\n\"Contribution\" shall mean any work of authorship, including the original version of the Work and any\nmodifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to\nLicensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to\nsubmit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of\nelectronic, verbal, or written communication sent to the Licensor or its representatives, including but not\nlimited to communication on electronic mailing lists, source code control systems, and issue tracking systems\nthat are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but\nexcluding communication that is conspicuously marked or otherwise designated in writing by the copyright\nowner as \"Not a Contribution.\"\n\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been\nreceived by Licensor and subsequently incorporated within the Work.\n\n## 2. Grant of Copyright License.\n\nSubject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare\nDerivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such\nDerivative Works in Source or Object form.\n\n## 3. Grant of Patent License.\n\nSubject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent\nlicense to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such\nlicense applies only to those patent claims licensable by such Contributor that are necessarily infringed by\ntheir Contribution(s) alone or by combination of their Contribution(s) with the Work to which such\nContribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim\nor counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work\nconstitutes direct or contributory patent infringement, then any patent licenses granted to You under this\nLicense for that Work shall terminate as of the date such litigation is filed.\n\n## 4. Redistribution.\n\nYou may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without\nmodifications, and in Source or Object form, provided that You meet the following conditions:\n\n   1. You must give any other recipients of the Work or Derivative Works a copy of this License; and\n\n   2. You must cause any modified files to carry prominent notices stating that You changed the files; and\n\n   3. You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent,\n\t  trademark, and attribution notices from the Source form of the Work, excluding those notices that do\n\t  not pertain to any part of the Derivative Works; and\n\n   4. If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that\n\t  You distribute must include a readable copy of the attribution notices contained within such NOTICE\n\t  file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one\n\t  of the following places: within a NOTICE text file distributed as part of the Derivative Works; within\n\t  the Source form or documentation, if provided along with the Derivative Works; or, within a display\n\t  generated by the Derivative Works, if and wherever such third-party notices normally appear. The\n\t  contents of the NOTICE file are for informational purposes only and do not modify the License. You may\n\t  add Your own attribution notices within Derivative Works that You distribute, alongside or as an\n\t  addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be\n\t  construed as modifying the License.\n\nYou may add Your own copyright statement to Your modifications and may provide additional or different license\nterms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative\nWorks as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the\nconditions stated in this License.\n\n## 5. Submission of Contributions.\n\nUnless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by\nYou to the Licensor shall be under the terms and conditions of this License, without any additional terms or\nconditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate\nlicense agreement you may have executed with Licensor regarding such Contributions.\n\n## 6. Trademarks.\n\nThis License does not grant permission to use the trade names, trademarks, service marks, or product names of\nthe Licensor, except as required for reasonable and customary use in describing the origin of the Work and\nreproducing the content of the NOTICE file.\n\n## 7. Disclaimer of Warranty.\n\nUnless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor\nprovides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\nor implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT,\nMERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Work and assume any risks associated with Your exercise of\npermissions under this License.\n\n## 8. Limitation of Liability.\n\nIn no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless\nrequired by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any\nContributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential\ndamages of any character arising as a result of this License or out of the use or inability to use the Work\n(including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or\nany and all other commercial damages or losses), even if such Contributor has been advised of the possibility\nof such damages.\n\n## 9. Accepting Warranty or Additional Liability.\n\nWhile redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for,\nacceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this\nLicense. However, in accepting such obligations, You may act only on Your own behalf and on Your sole\nresponsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold\neach Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason\nof your accepting any such warranty or additional liability.\n\nEND OF TERMS AND CONDITIONS\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 1.2802734375,
          "content": "test: remove-deps\n\tmake test-laravel\n\tmake test-lumen\n\ntest-laravel:\n\tcomposer require laravel/framework\n\tvendor/bin/phpunit\n\tmake uninstall-laravel\n\ntest-lumen:\n\tcomposer require laravel/lumen-framework\n\tvendor/bin/phpunit\n\tmake uninstall-lumen\n\nremove-deps:\n\trm -rf vendor\n\trm composer.lock\n\nuninstall-laravel:\n\tmake remove-deps\n\tcomposer remove laravel/framework\n\tmake remove-deps\n\nuninstall-lumen:\n\tmake remove-deps\n\tcomposer remove laravel/lumen-framework\n\tmake remove-deps\n\n# Ensures that the TAG variable was passed to the make command\ncheck-tag:\n\t$(if $(TAG),,$(error TAG is not defined. Pass via \"make tag TAG=4.2.1\"))\n\n# Creates a release but does not push it. This task updates the changelog\n# with the TAG environment variable, replaces the VERSION constant, ensures\n# that the source is still valid after updating, commits the changelog and\n# updated VERSION constant, creates an annotated git tag using chag, and\n# prints out a diff of the last commit.\ntag: check-tag\n\t@echo Tagging $(TAG)\n\tchag update $(TAG)\n\tsed -i '' -e \"s/VERSION = '.*'/VERSION = '$(TAG)'/\" src/AwsServiceProvider.php\n\tphp -l src/AwsServiceProvider.php\n\tgit commit -a -m '$(TAG) release'\n\tchag tag\n\t@echo \"Release has been created. Push using 'make release'\"\n\t@echo \"Changes made in the release commit\"\n\tgit diff HEAD~1 HEAD\n"
        },
        {
          "name": "NOTICE.md",
          "type": "blob",
          "size": 0.6083984375,
          "content": "# AWS Service Provider for Laravel\n\n<https://github.com/aws/aws-sdk-php-laravel>\n\nCopyright 2013 Amazon.com, Inc. or its affiliates. All Rights Reserved.\n\nLicensed under the Apache License, Version 2.0 (the \"License\").\nYou may not use this file except in compliance with the License.\nA copy of the License is located at\n\n<http://aws.amazon.com/apache2.0>\n\nor in the \"license\" file accompanying this file. This file is distributed\non an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either\nexpress or implied. See the License for the specific language governing\npermissions and limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.0751953125,
          "content": "# AWS Service Provider for Laravel 5 - 11\n\n[![Latest Stable Version](https://img.shields.io/packagist/v/aws/aws-sdk-php-laravel.svg)](https://packagist.org/packages/aws/aws-sdk-php-laravel)\n[![Total Downloads](https://img.shields.io/packagist/dt/aws/aws-sdk-php-laravel.svg)](https://packagist.org/packages/aws/aws-sdk-php-laravel)\n[![Gitter](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/aws/aws-sdk-php?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge)\n\nThis is a simple [Laravel](http://laravel.com/) service provider for making it easy to include the official\n[AWS SDK for PHP](https://github.com/aws/aws-sdk-php) in your Laravel and Lumen applications.\n\nThis README is for version 3.x of the service provider, which is implemented to work with Version 3 of the AWS SDK for\nPHP and Laravel 5.1.\n\n**Major Versions:**\n\n* **3.x** (YOU ARE HERE) - For `laravel/framework:6.0|7.0|8.0|9.0|10.0|11.0` and `aws/aws-sdk-php:^3.279.0`\n* **2.x** ([2.0 branch](https://github.com/aws/aws-sdk-php-laravel/tree/2.0)) - For `laravel/framework:5.0.*` and `aws/aws-sdk-php:~2.4`\n* **1.x** ([1.0 branch](https://github.com/aws/aws-sdk-php-laravel/tree/1.0)) - For `laravel/framework:4.*` and `aws/aws-sdk-php:~2.4`\n\nJump To:\n* [Getting Started](#Getting-Started)\n* [Getting Help](#Getting-Help)\n* [Contributing](#Contributing)\n* [More Resources](#Resources)\n\n## Getting Started\n\n### Installation\nThe AWS Service Provider can be installed via [Composer](http://getcomposer.org) by requiring the\n`aws/aws-sdk-php-laravel` package in your project's `composer.json`.\n\n```json\n{\n    \"require\": {\n        \"aws/aws-sdk-php-laravel\": \"~3.0\"\n    }\n}\n```\n\nThen run a composer update\n```sh\nphp composer.phar update\n```\n\nTo use the AWS Service Provider, you must register the provider when bootstrapping your application.\n\n\n#### Lumen\nIn Lumen find the `Register Service Providers` in your `bootstrap/app.php` and register the AWS Service Provider.\n\n```php\n    $app->register(Aws\\Laravel\\AwsServiceProvider::class);\n```\n\n#### Laravel\nIn Laravel find the `providers` key in your `config/app.php` and register the AWS Service Provider.\n\n```php\n    'providers' => array(\n        // ...\n        Aws\\Laravel\\AwsServiceProvider::class,\n    )\n```\n\nFind the `aliases` key in your `config/app.php` and add the AWS facade alias.\n\n```php\n    'aliases' => array(\n        // ...\n        'AWS' => Aws\\Laravel\\AwsFacade::class,\n    )\n```\n\n### Configuration\n\nBy default, the package uses the following environment variables to auto-configure the plugin without modification:\n```\nAWS_ACCESS_KEY_ID\nAWS_SECRET_ACCESS_KEY\nAWS_REGION (default = us-east-1)\n```\n\nTo customize the configuration file, publish the package configuration using Artisan.\n\n```sh\nphp artisan vendor:publish  --provider=\"Aws\\Laravel\\AwsServiceProvider\"\n```\n\nThe settings can be found in the generated `config/aws.php` configuration file. By default, the credentials and region settings will pull from your `.env` file.\n\n```php\nreturn [\n    'credentials' => [\n        'key'    => env('AWS_ACCESS_KEY_ID', ''),\n        'secret' => env('AWS_SECRET_ACCESS_KEY', ''),\n    ],\n    'region' => env('AWS_REGION', 'us-east-1'),\n    'version' => 'latest',\n    // You can override settings for specific services\n    'Ses' => [\n        'region' => 'us-east-1',\n    ],\n];\n```\n\nNote that you can always delete the `credentials` line from this file if you'd like to use the [default SDK Configuration Provider chain](https://docs.aws.amazon.com/sdk-for-php/v3/developer-guide/guide_credentials.html#default-credential-chain) instead.\n\nReferring Laravel 5.2.0 [Upgrade guide](https://laravel.com/docs/5.2/upgrade#upgrade-5.2.0), you must using config\nfile instead of environment variable option if using php artisan `config:cache`.\n\nLearn more about [configuring the SDK](http://docs.aws.amazon.com/aws-sdk-php/v3/guide/guide/configuration.html) on\nthe SDK's User Guide.\n\n### Usage\n\nIn order to use the AWS SDK for PHP within your app, you need to retrieve it from the [Laravel Service\nContainer](https://laravel.com/docs/container#binding). The following example uses the Amazon S3 client to upload a file.\n\n```php\n$s3 = App::make('aws')->createClient('s3');\n$s3->putObject(array(\n    'Bucket'     => 'YOUR_BUCKET',\n    'Key'        => 'YOUR_OBJECT_KEY',\n    'SourceFile' => '/the/path/to/the/file/you/are/uploading.ext',\n));\n```\n\nIf the AWS facade is registered within the `aliases` section of the application configuration, you can also use the\nfollowing technique.\n\n```php\n$s3 = AWS::createClient('s3');\n$s3->putObject(array(\n    'Bucket'     => 'YOUR_BUCKET',\n    'Key'        => 'YOUR_OBJECT_KEY',\n    'SourceFile' => '/the/path/to/the/file/you/are/uploading.ext',\n));\n```\n\nTo use in Lumen, you need to retrieve it from the service container a bit differently:\n\n```php\n$s3 = app('aws')->createClient('s3');\n$s3->putObject(array(\n    'Bucket'     => 'YOUR_BUCKET',\n    'Key'        => 'YOUR_OBJECT_KEY',\n    'SourceFile' => '/the/path/to/the/file/you/are/uploading.ext',\n));\n```\n\n## Getting Help\n\nPlease use these community resources for getting help. We use the GitHub issues for tracking bugs and feature requests and have limited bandwidth to address them.\n\n* Ask a question on [StackOverflow](https://stackoverflow.com/) and tag it with [`aws-php-sdk`](http://stackoverflow.com/questions/tagged/aws-php-sdk)\n* Come join the AWS SDK for PHP [gitter](https://gitter.im/aws/aws-sdk-php)\n* Open a support ticket with [AWS Support](https://console.aws.amazon.com/support/home/)\n* If it turns out that you may have found a bug, please [open an issue](https://github.com/aws/aws-sdk-php-laravel/issues/new/choose)\n\nThis SDK implements AWS service APIs. For general issues regarding the AWS services and their limitations, you may also take a look at the [Amazon Web Services Discussion Forums](https://forums.aws.amazon.com/).\n\n### Opening Issues\n\nIf you encounter a bug with `aws-sdk-php-laravel` we would like to hear about it. Search the existing issues and try to make sure your problem doesn’t already exist before opening a new issue. It’s helpful if you include the version of `aws-sdk-php-laravel`, PHP version and OS you’re using. Please include a stack trace and reduced repro case when appropriate, too.\n\nThe GitHub issues are intended for bug reports and feature requests. For help and questions with using `aws-sdk-php` please make use of the resources listed in the Getting Help section. There are limited resources available for handling issues and by keeping the list of open issues lean we can respond in a timely manner.\n\n## Contributing\n\nWe work hard to provide a high-quality and useful SDK for our AWS services, and we greatly value feedback and contributions from our community. Please review our [contributing guidelines](./CONTRIBUTING.md) before submitting any issues or pull requests to ensure we have all the necessary information to effectively respond to your bug report or contribution.\n\n## Resources\n\n* [AWS SDK for PHP on Github](http://github.com/aws/aws-sdk-php/)\n* [AWS SDK for PHP website](http://aws.amazon.com/sdkforphp/)\n* [AWS on Packagist](https://packagist.org/packages/aws/)\n* [License](http://aws.amazon.com/apache2.0/)\n* [Laravel website](http://laravel.com/)\n"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 1.39453125,
          "content": "{\n    \"name\": \"aws/aws-sdk-php-laravel\",\n    \"homepage\": \"https://aws.amazon.com/sdk-for-php/\",\n    \"description\": \"A simple Laravel 6/7/8/9/10/11 service provider for including the AWS SDK for PHP.\",\n    \"keywords\": [\"laravel\", \"laravel 6\", \"laravel 7\", \"laravel 8\", \"laravel 9\", \"laravel 10\", \"laravel 11\", \"aws\", \"amazon\", \"sdk\", \"s3\", \"ec2\", \"dynamodb\"],\n    \"type\":\"library\",\n    \"license\":\"Apache-2.0\",\n    \"authors\":[\n        {\n            \"name\":\"Amazon Web Services\",\n            \"homepage\":\"http://aws.amazon.com\"\n        }\n    ],\n    \"require\": {\n        \"php\": \">=7.2.5\",\n        \"aws/aws-sdk-php\": \"^3.279.0\",\n        \"illuminate/support\": \"^6.0 || ^7.0 || ^8.0 || ^9.0 || ^10.0 || ^11.0\"\n    },\n    \"require-dev\": {\n        \"phpunit/phpunit\": \"^8.0 || ^9.0\",\n        \"vlucas/phpdotenv\": \"^1.0 || ^2.0 || ^3.0 || ^4.0 || ^5.0\",\n        \"yoast/phpunit-polyfills\": \"^1.0\"\n    },\n    \"suggest\": {\n        \"laravel/framework\": \"To test the Laravel bindings\",\n        \"laravel/lumen-framework\": \"To test the Lumen bindings\"\n    },\n    \"autoload\": {\n        \"psr-4\": { \"Aws\\\\Laravel\\\\\": \"src/\" }\n    },\n    \"autoload-dev\": {\n        \"psr-4\": { \"Aws\\\\Laravel\\\\Test\\\\\": \"tests/\" }\n    },\n    \"extra\": {\n        \"laravel\": {\n            \"providers\": [\n                \"Aws\\\\Laravel\\\\AwsServiceProvider\"\n            ],\n            \"aliases\": {\n                \"AWS\": \"Aws\\\\Laravel\\\\AwsFacade\"\n            }\n        }\n    }\n}\n"
        },
        {
          "name": "config",
          "type": "tree",
          "content": null
        },
        {
          "name": "phpunit.xml",
          "type": "blob",
          "size": 0.91015625,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<phpunit backupGlobals=\"false\"\n         backupStaticAttributes=\"false\"\n         bootstrap=\"./vendor/autoload.php\"\n         colors=\"false\"\n         convertErrorsToExceptions=\"true\"\n         convertNoticesToExceptions=\"true\"\n         convertWarningsToExceptions=\"true\"\n         processIsolation=\"false\"\n         stopOnFailure=\"false\">\n\n    <testsuites>\n        <testsuite name=\"AwsServiceProvider Test Suite\">\n            <directory>./tests/</directory>\n        </testsuite>\n    </testsuites>\n\n    <php>\n        <env name=\"AWS_ACCESS_KEY_ID\" value=\"foo\"/>\n        <env name=\"AWS_SECRET_ACCESS_KEY\" value=\"bar\"/>\n        <env name=\"AWS_REGION\" value=\"baz\"/>\n    </php>\n\n    <coverage>\n        <include>\n            <directory suffix=\".php\">src</directory>\n        </include>\n        <exclude>\n            <directory suffix=\".php\">vendor</directory>\n        </exclude>\n    </coverage>\n\n</phpunit>\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}