{
  "metadata": {
    "timestamp": 1736712248833,
    "page": 987,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjk5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "FOGProject/fogproject",
      "stars": 1171,
      "defaultBranch": "stable",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0439453125,
          "content": "text=auto\n*.sh text eol=lf\n*.php text eol=lf\n"
        },
        {
          "name": ".githooks",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.29296875,
          "content": "# Compiled source #\n###################\n*.com\n*.class\n*.dll\n*.exe\n*.o\n*.so\n\n# Packages #\n############\n# it's better to unpack these files and commit the raw source\n# git has its own built in compression methods\n*.7z\n*.dmg\n*.gz\n*.iso\n*.jar\n*.rar\n*.tar\n*.zip\n\n# Logs and databases #\n######################\n*.log\n*.sql\n*.sqlite\n\n# OS generated files #\n######################\n.DS_Store\n.DS_Store?\n._*\n.Spotlight-V100\n.Trashes\nehthumbs.db\nThumbs.db\n*~\n*#\n.vscode/settings.json\n\n# Video #\n#########\n*.wmv\n*.mpg\n*.mpeg\n*.mp4\n*.mov\n*.flv\n*.avi\n*.ogv\n*.ogg\n*.webm\n\n# Imported Images #\n###################\npackages/web/management/other/*\npackages/web/management/languages/*\n!packages/web/management/other/index.php\n!packages/web/management/other/gpl-3.0.txt\n\n# Config file #\n###############\n*config.class.php\n*.well-known\npackages/web/fog\npackages/web/.vscode\n\n# Erroneous Packages #\n######################\npackages/FOGService.msi\npackages/web/client/FOGService.msi\npackages/web/management/bower_components\npackages/web/management/dist\npackages/web/management/plugins\npackages/web/service/ipxe/bzImage*\npackages/web/service/ipxe/init*.xz\npackages/web/service/ipxe/*.sha256\nrpttmp\ntmp/*\n\n# Local Scripts #\n#################\npackages/web/status/injectHosts.php\npackages/web/lib/plugins/hostext\n\n# kernel images\n*Image*\n*.cache*\n*.idea*\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 7.2119140625,
          "content": "# Contributing to the FOG project\n\nIt's great you check out this document and think about taking the time to contribute! You are very weclome to got ahead.\n\nFind some detailed information on how the FOG project is structured and how to contribute to it. These are mostly guidelines, not rules. Use your best judgment, and feel free to propose changes to this document and the whole project.\n\n#### Table Of Contents\n\n[Code of Conduct](#code-of-conduct)\n\n[Just allow me one question](#just-allow-ne-one-question)\n\n[Before you get started](#before-you-get-started)\n  * [Repos, languages and foo](#repos-languages-and-foo)\n  * [Versions and branches](#versions-and-branches)\n\n[How to contribute?](#how-to-contribute)\n  * [Reporting Bugs](#reporting-bugs)\n  * [Suggesting Enhancements](#suggesting-enhancements)\n  * [Your First Code Contribution](#your-first-code-contribution)\n  * [Pull Requests](#pull-requests)\n\n[Styleguides](#styleguides)\n  * [Git Commit Messages](#git-commit-messages)\n  * [JavaScript Styleguide](#javascript-styleguide)\n  * [CoffeeScript Styleguide](#coffeescript-styleguide)\n  * [Specs Styleguide](#specs-styleguide)\n  * [Documentation Styleguide](#documentation-styleguide)\n\n[Additional Notes](#additional-notes)\n  * [Issue and Pull Request Labels](#issue-and-pull-request-labels)\n  * [Attribution](#attribution)\n\n\n\n\n\n## Code of Conduct\n\n### Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, caste, color, religion, or sexual\nidentity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n<details><summary>Click here for further details</summary>\n\n### Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the overall\n  community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or advances of\n  any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email address,\n  without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n### Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n### Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n### Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\n[INSERT CONTACT METHOD].\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n### Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n#### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n#### 2. Warning\n\n**Community Impact**: A violation through a single incident or series of\nactions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or permanent\nban.\n\n#### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n#### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior, harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within the\ncommunity.\n\n### CoC Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.1, available at\n[https://www.contributor-covenant.org/version/2/1/code_of_conduct.html][v2.1].\n\nFor answers to common questions about this code of conduct, see the FAQ at\n[https://www.contributor-covenant.org/faq][FAQ]. Translations are available at\n[https://www.contributor-covenant.org/translations][translations].\n\n[homepage]: https://www.contributor-covenant.org\n</details>\n\n\n### Reporting Bugs\n\n - https://github.com/FOGProject/fogproject/issues\n - https://forums.fogproject.org/category/17/bug-reports\n\n\n\n\n## Pull Requests\n\n1. Always create a pull request towards the latest development version. Currently this is `dev-branch`.\n\n2. Increase the version number in [system.class.php](https://github.com/FOGProject/fogproject/blob/10950be7694313df66409e459658e2a1d5e52d10/packages/web/lib/fog/system.class.php#L56) to the new version that this pull request would represent. The versioning scheme we use is [SemVer](https://semver.org/).\n\n\n\n\n## Attribution\n\nThe initial draft is based on the [Atom project's contribution document](https://github.com/atom/atom/blob/master/CONTRIBUTING.md) as well as [Mozilla ScienceLab's information](https://mozillascience.github.io/working-open-workshop/contributing/) on this topic.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 34.318359375,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    {one line to give the program's name and a brief idea of what it does.}\n    Copyright (C) {year}  {name of author}\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    {project}  Copyright (C) {year}  {fullname}\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>. \n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.041015625,
          "content": "# FOGProject starting point\n\n## Introduction\n\n FOG is a free open-source cloning/imaging/rescue suite/inventory management system. FOG can be used to image Windows XP, Vista, Windows 7, Window 8/8.1, and Windows 10, Windows 11 PCs using PXE, PartClone, and a Web GUI to tie it together. Includes features like memory and disk test, disk wipe, av scan, task scheduling, inventory management, remote deployment of OS's, and remote installation of software packages. Features can be triggered through the web GUI, once the client machine has been registered with FOG.\n\n## Versioning and branches\n\nFOG uses a versioning schema that follows the general principles of semantic versioning with some adjustments to fit the development lifecycle. You can find the automatic release workflows in the [fog-workflows repo](https://github.com/FOGProject/fog-workflows) [![Stable Release](https://github.com/FOGProject/fog-workflows/actions/workflows/stable-releases.yml/badge.svg)](https://github.com/FOGProject/fog-workflows/actions/workflows/stable-releases.yml)\n\n* The default branch of `stable` will always have the latest patch release, for most users this is where you want to install from.\n* The `master` branch has the baseline of the latest Minor release. You should not typically install from here as it won't include security patches released since the baseline was set.\n* `dev-branch` is where the latest patch release changes are staged and tested. You can install from dev-branch to help test bug-fixes, security-fixes, and minor feature enhancements on a more frequent cadence.\n* `working-*` and `feature-named` branches are where work on the next Major or Minor release take place. They can be used to install and test the current beta version or specific working features.\n\nThis gives us a Production, Staging, and Dev branches to follow standard devops practices.\n\n| Dev Cycle Stage  | Branches                                                                                                              | Version Property Associated |\n|------------------|-----------------------------------------------------------------------------------------------------------------------| ----------------------------|\n| Production       | stable, master                                                                                                        | Minor and Patch\n| Staging          | dev-branch                                                                                                            | Patch\n| Dev              | working-*, {feature-name}                                                                                             | Major, Minor\n\n\n### Version Format\n\nOur versions are formatted in a x.x.x.x format like so:\n\n`{CodeBaseMajor}.{Major}.{Minor}.{Patch}`\n\n| Version Property | Description                                                                                                           | Example |\n|------------------|-----------------------------------------------------------------------------------------------------------------------|-----------|\n| CodeBaseMajor    | Major code baseline changes and API breaking changes, requires formal release                                         | 1.x.x.x   |\n| Major            | Major feature additions and UI changes, potential breaking changes within the same code base, requires formal release | 1.5.x.x   |\n| Minor            | Non-breaking major feature enhancements, requires formal release                                                      | 1.5.10.x  |\n| Patch            | On-going Bug and security fixes and feature enhancements, automated releases                                          | 1.5.10.41 |\n\n\n## Install stable version\n\n0. Install and update your linux server distro\n\n1. Download the installation file(s)\n\n* All that is needed to start installation is to download the files to perform the install. Choose one of the following methods you prefer;\n\n  * **ZIP archive** `wget https://github.com/FOGProject/fogproject/archive/stable.zip; unzip stable.zip`\n\n  * **TAR/GZ archive** `wget https://github.com/FOGProject/fogproject/archive/stable.tar.gz; tar xzf stable.tar.gz`\n\n  * **git** `git clone https://github.com/fogproject/fogproject.git fogproject-stable`\n\n2. Run the install script **as root** and follow all prompts accordingly\n\n```\nsudo -i\ncd /path/to/fogproject-stable/bin\n./installfog.sh\n```\n\n3. You should now be ready to use FOG\n\n## Install latest development version\n\n0. Install and update your linux server distro\n\n1. Download the installation file(s)\n\n* All that is needed to start the installation is to download the files to perform the install. Choose one of the following methods you prefer;\n\n  * **git** `git clone https://github.com/fogproject/fogproject.git fogproject-dev-branch; cd fogproject-dev-branch; git checkout dev-branch` (**recommended if you want to keep up with current developments!**\n\n  * **ZIP archive** `wget https://github.com/FOGProject/fogproject/archive/dev-branch.zip; unzip dev-branch.zip`\n\n  * **TAR/GZ archive** `wget https://github.com/FOGProject/fogproject/archive/dev-branch.tar.gz; tar xzf dev-branch.tar.gz`\n\n2. Run the install script **as root** and follow all prompts accordingly\n\n```\nsudo -i\ncd /path/to/fogproject-dev-branch/bin\n./installfog.sh\n```\n3. You should now be ready to use FOG\n\nAll should now be installed and you can start configuring and registering systems. Please see: http://fogproject.org/wiki/index.php/Managing_FOG to assist you in setting up further.\n\nThere are many resources for assistance.\n - **docs:** https://docs.fogproject.org for documentation. (New docs, under construction)\n - **Wiki:** http://fogproject.org/wiki for any information. (Legacy docs)\n - **Forum:** http://fogproject.org/forum.\n - **Email:** A Developer directly. If a dev permits a change, they can have themselves added on the wiki/Credits page.\n\n## Development\n\n Download the source with git and checkout the branch `dev-branch` for the latest code or a more specific feature branch you would like to help work on.\n\n For further details please check out the [information on contributing to the project](CONTRIBUTING.md).\n"
        },
        {
          "name": "Release Notes.MD",
          "type": "blob",
          "size": 20.54296875,
          "content": "FOG Project Release Notes\n=========================\n\n* [FOG 1.5.10](#fog-1510)\n* [FOG 1.5.10 revisions](##fog-1510-revisions)\n* [FOG 1.5.9](#fog-159)\n* [FOG 1.5.8](#fog-158)\n\n# FOG 1.5.10\n\n## FOG 1.5.10 revisions\n\n### FOG 1.5.10.48\n\nhttps://github.com/FOGProject/fogproject/releases/tag/1.5.10.48\n\n### FOG 1.5.10.41\n\nhttps://github.com/FOGProject/fogproject/releases/tag/1.5.10.41\n\n## FOG 1.5.10 overview\n\nFOG 1.5.10 officially released: https://news.fogproject.org/fog-1-5-10-officially-released/\n\nBelow is a summary of the many fixes and improvements introduced over the last 2.5 years since the last official release.\nWe have squashed bugs, further hardened the security of the system, and introduced new features, improvements, and support for new operating systems.\n\nSome highlights include:\n\n* PHP 8 support\n* Windows 11 support\n* More customizable printer configurations\n* More security checks to prevent users from accessing administrative functions accidentally or maliciously\n* Added and improved pxe boot menu options\n* Support for recent Linux OS's and an improved installer experience\n* Improved internationalization support\n* And so much more!\n\nThank you to all that have reported issues and feature requests in the forums and github requests and to all our developers, contributors, and users. \nWe couldn't do this without you!\n\nThis version was re-released (re-tagged) not long after the initial release to patch issues with the location plugin that would cause trouble when updating from an earlier version.\n\n## FOG Web UI and Services\n\nTo view the full list of commits with the code changes introducing these fixes and features, see the [dev branch commit history](https://github.com/FOGProject/fogproject/commits/dev-branch)\n\n### Security Fixes\n\n* Hide function parameters for ldap connection call to not print out username and password information to log files (#445).\n* Add authentication check in getfiles to prevent file enumeration, thanks @cla\n* Add security checks to default pxe boot options like delete, change windows key, and join multicast domain, thanks @skyrider223\n* Do not prepend filename to kernel information, thanks @wayneworkman\n* Remove replication of ssl files and directories\n* Update select JS and CSS library to latest version 4.0.13\n* Prevent leak of AD password when applying default AD infos in host\n* Remove header not posing much of security as mentioned in #473, thanks @djohle\n* Add query for >=MariaDB 10.4 mysql.global_privs table\n* Check download URL and destination filename to prevent from malicious use, thanks @sml\n* Added web login logging\n* Add changes to firewall and SELinux checks\n* Added a defined [security policy](https://github.com/FOGProject/fogproject/blob/8ce090ba82ce22208daa0a20bc5018364e20949a/SECURITY.md)\n\n### Improvements\n\n* PHP 8 Support\n* Allow adjustment of timeout between all partitions to be set, thanks @Magelfik\n* Windows 11 compatibility added to notes and docs\n* Updated Readme for various things\n* Updated contribution guidelines\n* Update udpcast to version 20200328\n* Improved client downloader in web gui\n* Repair host listing icons for Linux systems\n* Try to find information of machines currently reporting empty OS name\n* Allow for replication of sub directories, e.g. /images/drivers/video \n* Add kernel parameter for udpcast maximum wait time\n* Improve groupmanager.log output a fair bit\n* Ignore parent directory entry in file size calculation\n* Improved logging of various systems\n* Add keymap (keyboard layout) setting to our iPXE binaries\n* Update iPXE to the latest pull\n* Add REBOOT menu to Host Bios Exit Type and Host EFI Exit Type\n* Add kernel information to reporting script\n* Leave 7 percent space when shrinking partitions with resizable image\n* Allow hostname regex for printers as well as IP addresses\n* Add ability to specify additional TFTP server command line options\n* Switch default database engine from MyISAM to InnoDB\n* Point FOG web UI kernel update page to the kernel repo on github.\n* Switch to snponly.efi for UEFI systems as default\n* Save resources by only enabling systemd tftp.socket\n* Move from xinetd to systemd for TFTP connection handling on redhat\n* Change internet connection check to better suit corporate networks\n* Add hint on image data files not being deleted through multi delete\n* Updated Internationalization support (multiple languages)\n* Installer support for more operating systems\n* Attempt https and http for WakeOnLAN\n* Separate the scheduled tasks from the Power Management tasks\n* More verbose Logging in various locations\n* Installer pre-req check improvements and other general installer improvements\n* Improved db table sorting\n* Improved backup functions in installer\n* Added image start, end, and duration to email notifications for imaging \n\n\n### Bug Fixes\n\n* Fix problem when updating to 1.5.10 with location plugin enabled (#561)\n* Add missing protocol in the URL on snapin download with location plugin (#562)\n* Fix location based snapin download (#371)\n* Fix group cron style task scheduling (#544)\n* Fix incorrect array index name in location plugin code.\n* Do not install sysv-rc-conf on Debian or Ubuntu, thanks @stevemoca\n* Allow -U parameter to work as expected in installer, thanks to @lukebarone \n* Prevent from installing package dhcp* when not selected by installer\n* Fixed behavioral issues of replication services\n* Prevent from saving the whole snapin object when only associations need saving\n* Silence warnings when upgrading a FOG install with services being enabled\n* Remove inconsistent excess kernel reporting information, thanks @wayneworkman\n* Make MulticastTask getAllMulticastTasks() function non static as call \n* Fixes for several parts of the iPXE boot menu like delete and approve hosts\n* Repair installer for RedHat, Alma, Rocky and CentOS\n* Fix snapin deletion causing an undefined variable exception with PHP 8\n* Fix display of name for capone plugin within FOG configuration page\n* Fix issue where filename got corrupted when uploading a new snapin file\n* Fix bug in iPXE embedded scripts which prevents drive boot method EXIT \n* Prevent AD fields from being overwritten with default settings even if fields are not empty \n* Fix typo in snapinjob call that was preventing snapins to run\n* Remove bootfilename from installer and .fogsettings as it's not in use \n* Silence the output in case xinetd is not installed at all \n* Set image size on server to zero when directory is not found\n* Added missing openssl package dependency\n* Fix installer password character check\n* Correct option domain-name-servers on dhcpd.conf generation when empty\n* Fix host edit page load issue when snapin history has entries set to 0000-00-00 00:00:00 timestamp\n\n## fog-client\n\nfog-client 0.13.0 is included with FOG 1.5.10\n\nTo view the full list of commits with the code changes introducing these fixes and features, see \n\n* [fog client commit history](https://github.com/FOGProject/fog-client/commits/master)\n* [fog zazzles commit history](https://github.com/FOGProject/zazzles/commits/master)\n\n### Security Fixes\n\n* Add a break to logging and authentication attempts when the fog client fails to authenticate after 5 attempts, thanks to @Iri5s\n* Update external library SharpZipLib to v1.3.3 to fix security issues\n* Update external library Newtonsoft.Json to v13.0.1\n* Allow using certificate files from local filesystem\n* Update timestamp server list and use new signing cert\n* Run authenticity check in mac and linux os clients\n* Add check for TLS versions, enable secure TLS versions and disable deprecated versions\n\n### Improvements\n\n* Added ability to use custom PrintUI parameters, thanks to @Iri5s\n* Update Zazzles library to the latest version build\n* Updated internationalization support\n* Update copyright information in all source files and assembly to 2023\n* Change logging of the installer for a more clear output on the console \n* Add XML schema that came with Quartz.NET last version update\n\n### Bug Fixes\n\n* Fix applying of printer settings through PrintUI, thanks @tatanas.\n* Removed unused dlls\n* Print CA cert subject name instead of friendly name\n\n## FOS (FOG Operating System)\n\nFOS is the linux based OS that is booted into from pxe and is used to perform imaging and other tasks.\n\nWe have upgraded the versions of its main dependencies, added many improvements and features and squashed some common and not so common bugs.\n\n### Improvements\n\n* Add support for wiping NVMe drives using nvme format, thanks @rluzuriaga\n* Add server disk space check for mounted share when capturing an image\n* Github Actions workflow for creating new releases, thanks @rluzuriaga\n* Update Buildroot to v2022.02.9\n* Update Linux kernel to v5.15.93\n* Update partclone to v0.3.20\n* Update gptfdisk to 1.0.8\n* Add support for F2FS imaging and expanding F2FS on deployments, thanks @JlnWntr\n* Add patch capability when building filesystem, thanks to @rluzuriaga\n* Add feature to specify disk serial as host primary disk setting to make setups with identical sized NVMe drives work as well\n* Change AWK script to handle awkward name and attrs fields in partition layouts we created ourselves\n* Add tag name and ID to log output\n* Add upload success check and silence curl calls\n* Allow raw/dd image type capture without any partition on disk\n* Add firmware file bnx2x-e2-7.13.15.0.fw for HP Blade\n* Add feature to move partitions in GPT layouts forward when shrinking a partition would leave a gap if there is another partition after it. The subsequent partition often prevents from being able to deploy the image to a smaller size disk and so we try to get rid of that gap which is only possible in UEFI setups (GPT layout) where boot loaders don't reference to a sector on disk.\n* Add potential capability for BTRFS resizing\n* Add sysserial to the autoreg item to allow dynamic name setting\n* Add some network drivers to the ARM64 kernel that were missed\n* Remove kernel features power management, ACPI battery & AC, CPU idle driver\n* Add firmware blob for Realtek 8125 based NICs\n* Add feature to specify host primary disk via size instead of device name\n* Enable USB type C support\n* Add kernel modules for LUKS encryption\n* Disable networking stuff like IPSec protocols: AH, ESP, PF_KEY, IPComp, XFRM and socket monitoring\n* Enable access to /proc/config.gz, disable SWAP\n\n### Bug Fixes\n\n* Make the init boot up so it doesn't wait indefinitly on network error\n* Removed deprecated methods from readme\n* Modify build.sh to check needed packages on Ubuntu, thanks @rluzuriaga\n* Fixed typo in tmpEBRFileName function, thanks to @Piotr86PL  \n* Repair package dependency check on Debian where checks fail on dual installed libraries (32 and 64 bit)\n* Add libelf depency to the build script, thanks @JlnWntr\n* Change mount commands to fix exFAT-FS errors on BTRFS mounts, thanks @Piotr86PL\n* Fixing a typo in the calculate_float function and adding a couple of messages to the resizing functions, thanks to @Piotr86PL\n* Change mount commands to fix exFAT-FS errors\n* Enclose artifact search query as bash globbing on * causes problems when files exist in the dist path.\n* Add checksum check to release script just to be sure the binaries are ok\n* Repair disk enumeration for image type MPA (all disks)\n* Remove support for module loading from the kernel as we don't use modules \n\n# FOG 1.5.9\n\nThis release mainly focuses on bug fixes for FOG.\n\nhttps://news.fogproject.org/fog-1-5-9-officially-released/\n\nComparison of 1.5.8 to 1.5.9: https://github.com/FOGProject/fogproject/compare/1.5.8...1.5.9\n\n## FOG Web UI and Services\n\n### Improvements\n\n* Enhance error message when root environment is not properly loaded\n* Get rid of trim on array warning when canceling a multicast task\n* Add back reset of image size on client and update numbers only on capture\n* Update description of Normal wipe (thanks to @abulhol)\n* Change default global setting on compression format\n* Fix two typos in ipxescripts (thanks to @bchr)\n\n### Bug Fixes\n\n* Add installer check to see if compiling iPXE binaries is needed\n* Fix exec command line in systemd FOGSnapinReplicator file\n* Force re-compile of rootcert.c in iPXE to prevent from issues when CA changes\n* Update compile check scripts to latest versions on Raspberry Pi\n* Fix IP/interface check on service startup\n* Properly query multicast session id to be able to retrieve image info\n* Repair product key decoding on call to hostinfo.php\n* Improve input check on aesdecrypt in case of unencrypted passwords with pipe characters\n* Handle DB root password more conservative to not lock out people with newer MariaDB versions\n* Re-work the checks and setting up of DB security\n* Prevent FOGMulticastManager from completing a task too early\n* Fix some bugs in Sites plugin (thanks to Fernando Gietz)\n* Switch to libcurl4 for Raspbian 10 as well\n* Fix Image Manager to consider global setting on image creation\n* Fix installer prompting for DB root password\n* Force correct PHP version on Debian and remove old PHP when found to be still installed\n* Improve check on fogstorage account access granted\n* Prevent FOG services from filling up memory on hook events array\n* Fix interface enumeration on systems with DHCP enabled\n* Using PHP 7.4 on Ubuntu 20.04 as they moved just before the official release\n* Fix installer issue with PPP that is not using a via gateway route\n* Correct snapin list view column showing if it's a pack or not\n\n## fog-client\n\nfog-client 0.12.0 is included with FOG 1.5.9\n\n### Improvements\n\n* Move to .Net Framework 4.5.2\n* Update Quartz to 3.0.7 and ZipLib to 1.2.0\n* Add Romanian and Polish language support\n\n### Bug Fixes\n\n* Repair hang on Linux systems when shutting down FOGService (issue #93)\n* Fix unzipping subdirectories on Linux/Unix systems (issue #122)\n\n## FOS (FOG Operating System)\n\nFOS is the linux based OS that is booted into from pxe and is used to perform imaging and other tasks.\n\n### Improvements\n\n* Switch to using shred instead of dd for normal wipe to make it faster\n* Update Kernel (4.19.118) and Buildroot (2020.02.1)\n\n# FOG 1.5.8\n\nFOG 1.5.8 officially released: https://news.fogproject.org/fog-1-5-8-officially-released/\n\nhttps://github.com/FOGProject/fogproject/compare/1.5.7...1.5.8\n\n## FOG Web UI and Services\n\n### Bug Fixes\n\n* Use URL encoded parameter for password in CURL calls (587a25f, 79f94bd)\n* Handle VLAN network interface names like eth0@if56 properly when enumerating interfaces (a2fc95e2)\n* Fix LDAP port in plugin code (97b57ac, 403d1d1)\n* Repair installer to work on all current Ubuntu versions (28debc9, 9233067, 4d61492, 79388ae)\n* Rearange compile parameters as iPXE fails on SSL with CERT/TRUST not being last (e424b04)\n* Change type of alternative subject name information as modern browsers check those strictly (7fdb3f6)\n* Use SSLCACertificateFile instead as SSLCertificateChainFile which is obsolete since Apache 2.4.8 (6f7d462)\n* Make sure we wait until an interface with our known IP is up #268 (69b4c44)\n* Only ask for PHP/apache reinstall if PHP 5 was found installed (70078be)\n* Repair building of iPXE binaries for HTTPS setups (296877d, 831d8ea)\n* Fix typo in snapin class (6314aa4 thanks to Quazz)\n* Repair version query in FOG configuration web view (8c69efc, fcfe759)\n* Fix storage group failure on task finish updating (3c28f7b)\n* Prevent from setting a MAC address that is in use by another host (88e10d8)\n* Fix issue with double pipes in ad password field (9e70bc2)\n* Fix download of snapins from wrong FOG server in location setups (d0162c8)\n* Prevent from adding group associations with zero host or group ID (cf01c7e, c0d8509)\n* Fix interface selection on systems where more than one NICs are up (ca3c2fa)\n* Fix API call to editing host object, #329 (54beb9b)\n* Prevent from migrating to MariaDB on Ubuntu installs to not cause trouble (29af4df)\n* Do not reset the image size on client value on client checkin (9ff8776)\n* Fix reports to work without groups and add search field (dde4d9d, b1f21c3, 7a6dc13)\n* Correct package list update for Debian 10 buster upgrades (3f3b237)\n\n\n### Improvements\n\n* Update README with current information on downloading and installing FOG (0922112)\n* Add username substitution to email field for deployment notification (7f80368)\n* Re-try querying size and hash information via HTTPS (0fd7913, 2e55ba9)\n* Make sure we don't ask for HTTPS again if parameter is given (ac08798)\n* Improve check on fogproject account existing (8af5b3e)\n* Add separate download for ARM platform binary archive and compilation of iPXE (d67a620, 30c4200, 6b1b260, 91fc00a)\n* Remove old pxelinux stuff and ltsp config so people don't use it anymore (50e2995)\n* Change default image definitions to Windows 10 and Zstd compression (45ec9fa)\n* Add Ubuntu 20.xx support - tested on daily build currently PHP 7.3 (91f7cb0)\n* Add installer question on enabling HTTPS (755cbc4)\n* Switch to auto colors for bandwith graph (0ffd39f)\n* Present storage node settings to the user more clearly (4226527)\n* Improve database security by using less privileged account and force users to set a DB root password #355 (490cb3b, cc71a32)\n* Add check for proper root environemnt within the installer (3c2d492)\n* Add kernel parameter to disable problematic power saving for NVMe drives (e67ce75)\n* Remove feature to add a changed primary MAC as additional MAC (8c820e2)\n* Update installer to work on Ubuntu 19.xx (ab61ce0)\n* Hide/mask AD password from users eyes, #337 (72b0de0)\n* Improve firewall check to make it work for CentOS 8 as well (a039fd4)\n* Update installer to work on CentOS 8 (3e125db, 5ff4c8b)\n* Add sanity checking in the remote file hash and size response (933d7c3, bee5419 thanks to @mjrider)\n* Only test the availability of the remote nodes once (b511e16 thanks to @mjrider)\n* Add hints on image type setting including a link to the wiki article (2c17837)\n* Add check for snapin file upload size to print appropriate warning to the user (1f4ad45)\n* Re-add code for ARM based bootloaders (PR #327, thanks to parkerberb-nfv)\n* Add iPXE AXGE native binary for ASIX AX88179 USB 3.0 (156001f)\n* Ensure we download the latest hashsum to check the binaries against (9235729)\n* Added possibilty to queue multicast task when the is not any slot free on the storage node (PR #310, bdbaf33 thanks to @Fernando Gietz)\n\n\n## FOS (FOG Operating System)\n\n### Bug Fixes\n\n* Repair issues with partclone.imager that were introduced with version 0.3.12 (7faf4b6, 8b60ec0)\n* Update awk cmd lines to no longer escape unncessarily (6f2f46a, 80e959a, 5f0e7b5 thanks to @Quazz)\n* Get NVMe device names right (e0202be, 276b22d)\n* Fix swap fs creation if capture and deploy use different disk technologies - SATA/SSD vs. NVMe vs. mmcblk (07fee1a)\n* Make reize way more unreliable by adding flock to sfdisk calls (fd3daf2 also backported to 1.5.7)\n\n### Improvements\n\n* Update Linux Kernel (4.19.90) and Buildroot (2019.04.8)\n* Update various packages: Partclone (0.3.13), Zstd (1.4.4), Testdisk & Photorec (7.1) - many thanks to @Quazz\n* Add NVME cli utility (a6b7d24 thanks to @Quazz)\n* Add error output when an error happens on partition layout restore (0e893c1)\n* Improve algorithm to match destinations in multi disk setups (4439247)\n* Allow for higher CPU core numbers and add Intel idle driver to fix #31 (fe58b6a)\n* Prevent from adding partitions to fixed list twice and sort the list\n* Add support for APFS filesystem (e151e67, 6c01ce6)\n* Add rsyncable options when calling partclone (3cc47ca)\n\n# FOG 1.x.y\n\nFOG 1.x.y officially released: https://news.fogproject.org/...\n\nBelow is a summary of the many fixes and improvements introduced. \nWe have squashed bugs, further hardened the security of the system, and introduced new features, improvements, and support for new operating systems.\n\nSome highlights include:\n\n* tbd\n\nThank you to all that have reported issues and feature requests in the forums and github requests and to all our developers, contributors, and users. \nWe couldn't do this without you!\n\n## FOG Web UI and Services\n\nTo view the full list of commits with the code changes introducing these fixes and features, see the [dev branch commit history](https://github.com/FOGProject/fogproject/commits/dev-branch)\n\n### Security Fixes\n\n* tbd\n\n### Improvements\n\n* tbd\n\n### Bug Fixes\n\n* tbd\n\n## fog-client\n\nfog-client 0.a.b is included with FOG 1.x.y\n\nTo view the full list of commits with the code changes introducing these fixes and features, see \n\n* [fog client commit history](https://github.com/FOGProject/fog-client/commits/master)\n* [fog zazzles commit history](https://github.com/FOGProject/zazzles/commits/master)\n\n### Security Fixes\n\n* tbd\n\n### Improvements\n\n* tbd\n\n### Bug Fixes\n\n* tbd\n\n## FOS (FOG Operating System)\n\nFOS is the linux based OS that is booted into from pxe and is used to perform imaging and other tasks.\n\nWe have upgraded the versions of its main dependencies, added many improvements and features and squashed some common and not so common bugs.\n\n### Security Fixes\n\n* tbd\n\n### Improvements\n\n* tbd\n\n### Bug Fixes\n\n* tbd\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 8.0966796875,
          "content": "# Security Policy\n\n## Security Release Process\nDeploy and manage any desktop operating system, anywhere. FOG Project can \ncapture, deploy, and manage Windows, Mac OSX, and various Linux distributions. \nThe community has adopted this security disclosure and response policy to \nensure responsibe handle of critical issues.\n\n## Supported Versions\n\nUse this section to tell people about which versions of your project are \ncurrently being supported with security updates.\n\n| Version  | Supported  |\n| -------- | ---------- |\n| 1.5.10   | yes        |\n| <1.5.10  | no         |\n\n## Reporting a Vulnerability - Private Disclosure Process\nSecurity is of high importance and all security vulnerabilities or suspected \nsecurity vulnerabilities should be reported to FOG Project privately, to \nminimize attacks against current users of FOG Project before they are fixed. \nVulnerabilities will be investigated and patched on the next patch (or minor) \nrelease as soon as possible.\n\nIf you know of a publicly disclosed security vulnerability for FOG Project, \nplease open a **private security advisory** to inform the FOG Project Security\nTeam: https://github.com/FOGProject/fogproject/security/advisories/new\n \n**IMPORTANT: Do not file public issues on GitHub for security \nvulnerabilities**\n\nThe request will be handled by the FOG Project Security Team. Requests will be \naddressed within 7 business days, including a detailed plan to investigate \nthe issue and any potential workarounds to perform in the meantime.\n\nDo not report non-security-impacting bugs through this channel. Use \n[GitHub issues](https://github.com/FOGProject/fogproject/issues/new/choose) \ninstead.\n\n### Proposed Content\nProvide a descriptive subject line and in the body of the email include the \nfollowing information:\n* Basic identity information, such as your name and your affiliation or \ncompany.\n* Detailed steps to reproduce the vulnerability  (POC scripts, screenshots, \nand compressed packet captures are all helpful to us).\n* Description of the effects of the vulnerability on FOG Project and the \nrelated hardware and software configurations, so that the FOG Project \nSecurity Team can reproduce it.\n* How the vulnerability affects FOG Project usage and an estimation of the \nattack surface, if there is one.\n* List other projects or dependencies that were used in conjunction with \nFOG Project to produce the vulnerability.\n \n## When to report a vulnerability\n* When you think FOG Project has a potential security vulnerability.\n* When you suspect a potential vulnerability but you are unsure that it \nimpacts FOG Project.\n* When you know of or suspect a potential vulnerability on another project \nthat is used by FOG Project. For example FOG Project has a dependency on \nPHP, MariaDB/MySQL, Apache, Linux kernel, buildroot, etc.\n  \n## Patch, Release, and Disclosure\nThe FOG Project Security Team will respond to vulnerability reports as \nfollows:\n \n1.  The Security Team will investigate the vulnerability and determine \nits effects and criticality.\n2.  If the issue is not deemed to be a vulnerability, the Security Team \nwill follow up with a detailed reason for rejection.\n3.  The Security Team will initiate a conversation with the reporter \nwithin 7 business days.\n4.  If a vulnerability is acknowledged and the timeline for a fix is \ndetermined, the Security Team will work on a plan to communicate with the \nappropriate community, including identifying mitigating steps that \naffected users can take to protect themselves until the fix is rolled out.\n5.  The Security Team will also create a \n[CVSS](https://www.first.org/cvss/specification-document) using the \n[CVSS Calculator](https://www.first.org/cvss/calculator/3.0). The Security \nTeam makes the final call on the calculated CVSS; it is better to move \nquickly than making the CVSS perfect. Issues may also be reported to \n[Mitre](https://cve.mitre.org/) using this \n[scoring calculator](https://nvd.nist.gov/vuln-metrics/cvss/v3-calculator). \nThe CVE will initially be set to private.\n6.  The Security Team will work on fixing the vulnerability and perform \ninternal testing before preparing to roll out the fix.\n7.  A public disclosure date is negotiated by the FOG Project Security \nTeam, the bug submitter, and the distributors list. We prefer to fully \ndisclose the bug as soon as possible once a user mitigation or patch is \navailable. It is reasonable to delay disclosure when the bug or the fix \nis not yet fully understood, the solution is not well-tested, or for \ndistributor coordination. The timeframe for disclosure is from immediate \n(especially if its already publicly known) to a few weeks. For a \ncritical vulnerability with a straightforward mitigation, we expect \nreport date to public disclosure date to be on the order of 14 business \ndays. The FOG Project Security Team holds the final say when setting a \npublic disclosure date.\n8.  Once the fix is confirmed, the Security Team will patch the \nvulnerability in the next patch or minor release, and backport a patch \nrelease into all earlier supported releases. Upon release of the patched \nversion of FOG Project, we will follow the **Public Disclosure Process**.\n\n### Public Disclosure Process\nThe Security Team publishes a public \n[advisory](https://github.com/FOGProject/fogproject/security/advisories) \nto the FOG Project community via GitHub. In most cases, additional \ncommunication via forums, website and other channels will assist in \neducating FOG Project users and rolling out the patched release to \naffected users. \n\nThe Security Team will also publish any mitigating steps users can take \nuntil the fix can be applied to their FOG Project instances. FOG Project \ndistributors will handle creating and publishing their own security \nadvisories.\n \n**The terms and conditions of the Embargo Policy apply to all members \nof this mailing list. A request for membership represents your \nacceptance to the terms and conditions of the Embargo Policy**\n\n### Embargo Policy\nThe information that members receive on noreply@fogproject.org must not \nbe made public, shared, or even hinted at anywhere beyond those who need \nto know within your specific team, unless you receive explicit approval \nto do so from the FOG Project Security Team. This remains true until the \npublic disclosure date/time agreed upon by the list. Members of the list \nand others cannot use the information for any reason other than to get \nthe issue fixed for your respective distribution's users.\nBefore you share any information from the list with members of your team \nwho are required to fix the issue, these team members must agree to the \nsame terms, and only be provided with information on a need-to-know basis.\n\nIn the unfortunate event that you share information beyond what is \npermitted by this policy, you must urgently inform the \nnoreply@fogproject.org mailing list of exactly what information was leaked \nand to whom. If you continue to leak information and break the policy \noutlined here, you will be permanently removed from the list.\n \n### Requesting to Join\nSend new membership requests to security@fogproject.org.\nIn the body of your request please specify how you qualify for membership \nand fulfill each criterion listed in the Membership Criteria section above.\n\n## Confidentiality, integrity and availability\nWe consider vulnerabilities leading to the compromise of data \nconfidentiality, elevation of privilege, or integrity to be our highest \npriority concerns. Availability, in particular in areas relating to DoS \nand resource exhaustion, is also a serious security concern. The FOG \nProject Security Team takes all vulnerabilities, potential \nvulnerabilities, and suspected vulnerabilities seriously and will \ninvestigate them in an urgent and expeditious manner.\n\nNote that we do not currently consider the default settings for FOG \nProject to be secure-by-default. It is necessary for operators to \nexplicitly configure settings, role based access control, and other \nresource related features in FOG Project to provide a hardened FOG \nProject environment. We will not act on any security disclosure that \nrelates to a lack of safe defaults. Over time, we will work towards \nimproved safe-by-default configuration, taking into account backwards \ncompatibility.\n"
        },
        {
          "name": "SELinux",
          "type": "tree",
          "content": null
        },
        {
          "name": "authors.txt",
          "type": "blob",
          "size": 0.0498046875,
          "content": "masterzune = Tom Elliott <tommygunsster@gmail.com>\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "utils",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}