{
  "metadata": {
    "timestamp": 1736712056884,
    "page": 591,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "pinguo/php-msf",
      "stars": 1742,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2265625,
          "content": "src/Helpers/Common.php diff\n/test export-ignore\n/vendor export-ignore\n.coveralls.yml export-ignore\n.gitattributes export-ignore\n.gitignore export-ignore\n.travis.yml export-ignore\n.php_cs export-ignore\nphpunit.xml.dist export-ignore\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1474609375,
          "content": ".buildpath\n.DS_Store\n.idea\n.project\n.settings/\n.*.sw*\n.*.un~\nnbproject\ntmp/\n.docker\n\nclover.xml\ncomposer.lock\ncoveralls-upload.json\nphpunit.xml\nvendor\n"
        },
        {
          "name": ".php_cs",
          "type": "blob",
          "size": 1.087890625,
          "content": "<?php\n$finder = Symfony\\CS\\Finder\\DefaultFinder::create()\n    ->in('src')\n    ->in('test')\n    ->notPath('TestAsset')\n    ->notPath('_files')\n    ->filter(function (SplFileInfo $file) {\n        if (strstr($file->getPath(), 'compatibility')) {\n            return false;\n        }\n    });\n$config = Symfony\\CS\\Config\\Config::create();\n$config->level(null);\n$config->fixers(\n    array(\n        'braces',\n        'duplicate_semicolon',\n        'elseif',\n        'empty_return',\n        'encoding',\n        'eof_ending',\n        'function_call_space',\n        'function_declaration',\n        'indentation',\n        'join_function',\n        'line_after_namespace',\n        'linefeed',\n        'lowercase_keywords',\n        'parenthesis',\n        'multiple_use',\n        'method_argument_space',\n        'object_operator',\n        'php_closing_tag',\n        'remove_lines_between_uses',\n        'short_array_syntax',\n        'short_tag',\n        'standardize_not_equal',\n        'trailing_spaces',\n        'unused_use',\n        'visibility',\n        'whitespacy_lines',\n    )\n);\n$config->finder($finder);\nreturn $config;\n"
        },
        {
          "name": ".phpstorm.meta.php",
          "type": "blob",
          "size": 0.0810546875,
          "content": "<?php\nnamespace PHPSTORM_META {\n    override( \\PG\\AOP\\MI::getObject(0), type(0));\n}"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 1.15234375,
          "content": "sudo: false\n\nlanguage: php\n\nbranches:\n  except:\n    - /^release-.*$/\n    - /^ghgfk-.*$/\n\ncache:\n  directories:\n    - $HOME/.composer/cache\n\nmatrix:\n  fast_finish: true\n  include:\n    - php: 5.5\n      env:\n        - EXECUTE_CS_CHECK=true\n    - php: 5.6\n      env:\n        - EXECUTE_TEST_COVERALLS=true\n    - php: 7\n    - php: hhvm \n  allow_failures:\n    - php: 7\n    - php: hhvm\n\nnotifications:\n  irc: \"irc.freenode.org#zftalk.dev\"\n  email: false\n\nbefore_install:\n  - if [[ $EXECUTE_TEST_COVERALLS != 'true' ]]; then phpenv config-rm xdebug.ini || return 0 ; fi\n  - composer self-update\n  - if [[ $EXECUTE_TEST_COVERALLS == 'true' ]]; then composer require --dev --no-update satooshi/php-coveralls ; fi\n\ninstall:\n  - travis_retry composer install --no-interaction --ignore-platform-reqs\n\nscript:\n  - if [[ $EXECUTE_TEST_COVERALLS == 'true' ]]; then ./vendor/bin/phpunit --coverage-clover clover.xml ; fi\n  - if [[ $EXECUTE_TEST_COVERALLS != 'true' ]]; then ./vendor/bin/phpunit ; fi\n  - if [[ $EXECUTE_CS_CHECK == 'true' ]]; then ./vendor/bin/php-cs-fixer fix -v --diff --dry-run ; fi\n\nafter_script:\n  - if [[ $EXECUTE_TEST_COVERALLS == 'true' ]]; then ./vendor/bin/coveralls ; fi\n"
        },
        {
          "name": "CREDITS",
          "type": "blob",
          "size": 0.125,
          "content": "Phpboy (xudianyang@phpboy.net)\nLeandre (leandre.china@gmail.com)\nSyyong (syyong.x@gmail.com)\n\nChengdu pinguo Technology Co.,Ltd."
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.6689453125,
          "content": "\n                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.666015625,
          "content": "<p align=\"center\">\n<img src=\"./php-msf.png\"/>\n</p>\n\n<p align=\"center\">\n<img class=\"latest_stable_version_img\" src=\"https://poser.pugx.org/pinguo/php-msf/version\">\n<img class=\"total_img\" src=\"https://poser.pugx.org/pinguo/php-msf/downloads\">\n<img class=\"latest_unstable_version_img\" src=\"https://poser.pugx.org/pinguo/php-msf/v/unstable\">\n<img class=\"license_img\" src=\"https://poser.pugx.org/pinguo/php-msf/license\">\n<img class=\"composer_img\" src=\"https://poser.pugx.org/pinguo/php-msf/composerlock\">\n<p/>\n\n# Micro Service Framework For PHP\n\nPHP微服务框架即“Micro Service Framework For PHP”，是[Camera360](https://www.camera360.com)社区服务器端团队基于[Swoole](http://www.swoole.com)自主研发现代化的PHP协程服务框架，简称msf或者php-msf，是[Swoole](http://www.swoole.com)的工程级企业应用框架，经受了Camera360亿级用户高并发大流量的考验。php-msf由[Camera360](https://www.camera360.com)服务器团队主导研发，会持续更新与维护，也希望有更多优秀的[Swoole](http://www.swoole.com)应用实践开发者加入。php-msf核心设计思想是采用协程、异步、并行的创新技术手段提高系统的单机吞吐能力，降低整体服务器成本。\n\n## 主要特性\n\n* 精简版的MVC框架\n* IO密集性业务的单机处理能力提升5-10倍\n* 代码常驻内存\n* 支持对象池\n* 支持Redis连接池、MySQL连接池（异步与同步）\n* 内置Redis Proxy，支持分布式、master-slave集群（故障自动failover与recovery）\n* 内置MySQL Proxy，master-slave集群（读写分离、事务）\n* 支持异步、并行\n* 基于PHP Yield实现协程\n* 内建http/redis/mysql/mongodb/task等协程客户端\n* 纯异步的Http Server\n* RPC Server/Client\n* 支持命令行模式\n* 支持独立进程的定时器\n* 支持独立配置进程\n* 支持sendfile静态文件(需配置root目录)\n\n## 环境要求\n\n- Linux，FreeBSD，MacOS(有兼容问题)\n- Linux内核版本2.3.32以上(支持epoll)\n- PHP-7.0及以上版本（生产环境建议使用PHP-7.1）\n- gcc-4.4以上版本\n- [swoole-1.9.15](https://github.com/swoole/swoole-src/archive/v1.9.15.tar.gz)及以上版本（暂不支持Swoole-2.0）\n- [hiredis-0.13.3](https://github.com/redis/hiredis/archive/v0.13.3.tar.gz)\n- [yac](https://github.com/laruence/yac/archive/yac-2.0.2.tar.gz)\n- [phpredis](http://pecl.php.net/get/redis-3.1.2.tgz)\n- composer\n\n## 文档\n\n框架手册(Gitbook): [PHP-MSF开发手册](https://pinguo.gitbooks.io/php-msf-docs/)\n\nAPI Document(Rawgit): [类文档](https://cdn.rawgit.com/pinguo/php-msf-docs/4e0ed09d/api-document/index.html)\n\n示例DEMO项目: [PHP-MSF DEMO](https://github.com/pinguo/php-msf-demo)\n\n帮助完善文档: [https://github.com/pinguo/php-msf-docs](https://github.com/pinguo/php-msf-docs)，请提交PR。\n\n## 交流与反馈\n\nPHP-MSF#1群(QQ): 614054288\n\n## 快速起步\n\n```bash\n$>php -r \"copy('https://raw.githubusercontent.com/pinguo/php-msf-docker/master/installer.php', 'installer.php');include('installer.php');\" && source ~/.bashrc\n```\n\n`installer.php`会检查运行环境，根据你的自定义配置，自动创建项目模板，composer安装依赖，启动服务。如果`cdn.rawgit.com`无法访问，可以直接克隆或者下载[php-msf-docker](https://github.com/pinguo/php-msf-docker)，提取`installer.php`，然后直接运行`php installer.php`\n\n如果一切顺利，运行到最后你将看到如下的输出：\n\n```bash\n[2017-09-06 16:08:34] Run composer install success\n[2017-09-06 16:08:34] Congratulations, all are installed successfully!\n[2017-09-06 16:08:34] You can, visit http://127.0.0.1:8990/Welcome for test\n      _______                               ____\n________  / /_  ____        ____ ___  _____/ __/\n___/ __ \\/ __ \\/ __ \\______/ __ `__ \\/ ___/ /_\n__/ /_/ / / / / /_/ /_____/ / / / / (__  ) __/\n_/ .___/_/ /_/ .___/     /_/ /_/ /_/____/_/\n/_/         /_/         Camera360 Open Source TM\n[2017-09-06 16:08:34] Swoole  Version: 1.9.18\n[2017-09-06 16:08:34] PHP     Version: 7.1.8\n[2017-09-06 16:08:34] Application ENV: docker\n[2017-09-06 16:08:34] Listen     Addr: 0.0.0.0\n[2017-09-06 16:08:34] Listen     Port: 8990\n```\n\n访问测试：\n\n```bash\n$>curl http://127.0.0.1:8990/Welcome\nhello world!\n```\n\n注意端口，如果你不是8990，你需要修改，然后访问测试。\n\n## 标准应用结构\n\n```\n├── app // PHP业务代码\n│   ├── AppServer.php // 应用server类，可根据需求自定义\n│   ├── Controllers // 控制器类目录\n│   ├── Lib // 特殊逻辑处理类目录\n│   ├── Models // Model类目录\n│   ├── Route // 特殊路由规则类目录\n│   ├── Tasks // Task类目录\n│   └── Views // 视图文件目录\n├── build.sh // 构建脚本（拉取docker镜像，启动容器）\n├── checkstyle.sh // 代码检查脚本\n├── composer.json // composer包依赖配置文件\n├── config // 配置目录\n├── server.php // server启动脚本\n├── console.php // 命令行脚本\n├── test // 单元测试目录\n```\n\n上述为基于php-msf的标准应用结构，一键安装程序installer.php会自动生成目录，用户可以根据需求创建一些自定义目录，只要符合psr4标准即可自动加载。\n\n## 服务启动\n\n调试模式\n\n```bash\n$>./server.php start\n```\n\nDaemon模式\n\n```bash\n$>./server.php start -d\n```\n\n\n停止服务\n\n```bash\n$>./server.php stop\n```\n\n重启服务\n\n```bash\n$>./server.php restart\n```\n\n## Docker\n\n我们制作了Docker镜像，方便Docker用户快速的安装环境，运行[PHP-MSF DEMO](https://github.com/pinguo/php-msf-demo)工程。另外期望在开发环境修改代码实时预览效果，建议使用Docker for [Mac](https://download.docker.com/mac/stable/Docker.dmg)/[Windows](https://download.docker.com/win/stable/InstallDocker.msi)桌面版。\n\n如果是升级Docker，它会自动迁移原有的镜像和容器，请耐心等待，千万不能中途kill掉Docker进程，否则再想迁移就难了。\n\nDocker Registry(阿里云):\n\n- 公网地址: `docker pull registry.cn-hangzhou.aliyuncs.com/pinguo-ops/php-msf-docker:latest`\n- 经典内网: `docker pull registry-internal.cn-hangzhou.aliyuncs.com/pinguo-ops/php-msf-docker:latest`\n- VPC网络: `docker pull registry-vpc.cn-hangzhou.aliyuncs.com/pinguo-ops/php-msf-docker:latest`\n- DockerHub(国外): `docker pull pinguoops/php-msf-docker`\n\n\n\n## 框架定位\n\n我们专注打造稳定高性能纯异步基于HTTP的微服务框架，作为nginx+php-fpm的替代技术栈实现架构的微服务化;而Tcp/WebSocket Server将作为插件的形势支持，或者作为其他独立的开源项目。\n\n对于小型团队或者业务系统我们建议还是采用传统的nginx+php-fpm技术栈，对于成本和性能来说没有瓶颈，也就完全没有必要引入全新的技术栈。\n\n对于大中型团队或者业务系统，处在服务治理或者服务化演进的重要阶段，php-msf是可选方案之一。\n\n对于庞大的PHP应用集群，想要大幅节约服务器成本，提升服务性能，php-msf是可选方案之一。\n\n对于聚合服务，比如大型的网站首页，想要通过服务器端聚合内容整合数据，php-msf是可选方案之一。\n\n## 手工安装\n\n推荐安装方式，通过编辑项目`composer.json`加入依赖`pinguo/php-msf`\n\n```json\n{\n    \"require\": {\n        \"pinguo/php-msf\": \">=3.0.0\"\n    },\n    \"minimum-stability\": \"dev\"\n}\n```\n\n`\"minimum-stability\": \"dev\"`这个配置选项必须加上，因为日志组件依赖`\"monolog/monolog\": \"2.0.x-dev\"`，并且`monolog/monolog`无2.0的release包，不过我们在生产环境已经验证其稳定性。\n\n## 项目原则\n\n### 稳定\n\nphp-msf经受了[Camera360](https://www.camera360.com)社区服务大流量、高并发的洗礼，稳定性得到充分验证。稳定性是我们花了大量时间、精力去解决的最重要问题，是三大原则的最重要原则。\n\n### 高性能\n\nIO密集性业务的单机处理能力提升5-10倍，这是生产环境中得出的真实数据，如Camera360社区某聚合服务在流量高峰需要40台服务器抗住流量，而采用php-msf重构之后只需要4台相同配置的服务器就可以抗住所有流量。\n\n### 简单\n\n由于Swoole复杂的进程模型，并且有同步阻塞和异步非阻塞之分，所以在运行相同代码逻辑时，可能在调用方式、传递参数都不一致，从而直线拉高了学习成本，我们为了屏蔽低层的差异，做了大量的工作，实现和传统MVC框架的唯一区别在于添加“yield”关键字。我们参考了Yii2框架的部分代码实践，我们期望无缝的从Yii2开发切换过来。\n\n上述三大原则，是我们在新增特性、功能实现时，投票或者合并代码的依据，任何影响这些原则的PR也将会被拒绝。\n\n## 关于协程\n\n目前社区有几个PHP开源项目支持协程，它们大多采用Generator+Yield来实现，但是实现的细微差别会导致性能相差甚远，我们应该认识到协程能够以同步的代码书写方式而运行异步逻辑，故协程调度器的性能一定要足够的高，php-msf的协程调度性能是原生异步回调方式的80%，也就是说某个API采用原生异步回调写法QPS为10000，通过php-msf协程调度器调度QPS为8000。\n\n## 为什么是微服务框架？\n\n目前php-msf还在起步阶段，我们花了大量的时间和精力解决稳定性、高性能、内存问题，因为我们认为“基石”是“万丈高楼”的最基本的保障，只有基础打得牢，才能将“大楼”建设得“更高”。3.0版本是我们开源的起始版本，是我们迈出的重要一步，接下来我们重点会是分布式微服务框架的打磨。\n\n另外，由于基于PHP常驻进程，并直接解析HTTP或者TCP请求，这是服务化最重要的支撑，基于此我们可以做很多原来不敢去实现的想法，总之想像空间很大。\n\n## 感谢\n\nphp-msf最开始基于[SwooleDistributed-1.7.x](https://github.com/tmtbe/SwooleDistributed/)开发，而此次开源版本中，连接池主要采用了SD的实现。由于我们框架定位、解决的业务场景、稳定性的要求、代码风格等差异太大，因此我们决定自主研发微服务框架，每个框架都有自己的特色和优点，选择合适自己公司和业务场景的框架最重要，同时在此也感谢[白猫](https://github.com/tmtbe)；另外，在研发php-msf框架及生产环境应用过程中，遇到很多底层问题，不过都一一解决，而这些问题能够解决最重要就是[Swoole](http://www.swoole.com)开源项目创始人[韩天峰-Rango](https://github.com/matyhtf)的大力支持，在此深表感谢。\n\n## License\n\nGNU General Public License, version 2 see [https://www.gnu.org/licenses/gpl-2.0.html](https://www.gnu.org/licenses/gpl-2.0.html)\n"
        },
        {
          "name": "ascii.ui",
          "type": "blob",
          "size": 0.27734375,
          "content": "      _______                               ____\n________  / /_  ____        ____ ___  _____/ __/\n___/ __ \\/ __ \\/ __ \\______/ __ `__ \\/ ___/ /_\n__/ /_/ / / / / /_/ /_____/ / / / / (__  ) __/\n_/ .___/_/ /_/ .___/     /_/ /_/ /_/____/_/\n/_/         /_/         Camera360 Open Source TM"
        },
        {
          "name": "changes.txt",
          "type": "blob",
          "size": 7.537109375,
          "content": "3.0.5 ==================================================================================================================\nbd01803 - xudianyang           * 修复break()方法，协程调度返回值错乱的问题\n9dd01ac - xudianyang           * 修复协程异常捕获逻辑漏洞\n40a03f0 - niulingyun           * redis cluster random模式不支持eval的bug修复\nf8f0fd7 - zhanglu              + add setnx in redis proxy\n96fd14c - niulingyun           + 异步协程shell_exec\n73b210a - xudianyang           * 修复yield $cor场景，当$cor抛出异常未能正常捕获的问题\n321161e - xudianyang           + 支持Not Found Controller To Default Controller/Action, Http/Client Support All HTTP METHOD\n16c1735 - xudianyang           + 关闭服务onShutdown事件支持\nbc20c6a - xudianyang           * 修复Timer进程内存泄露的问题\n643f011 - xudianyang           * 修复事务sql出错时的bug\n9064491 - xudianyang           - 移出tidPidTable\n252675c - niulingyun           + session support,but only support file adapter now\n22b7d76 - niulingyun           + 添加Redis Session支持\nd174e4b - xudianyang           * 修复默认路由的bug（Cannot declare class App\\Controllers\\Index, because the\n622b0e0 - shellvon             + 支持beanstalkd\n1ca5344 - xudianyang           * 日志时间精度提升\na00a90e - niulingyun           + timer支持多进程模式\nb750744 - niulingyun           + task日志的写入比例可控\nbcde590 - zhanglu              + 通过配置自定义Input类和Output类\n061359f - niulingyun           * 重构GET参数兼容逻辑\n780681a - xudianyang           * 修复goConcurrent Get请求的查询参数为string的报错\nff9b8a8 - xudianyang           * 优化连接池，提供max_conn,max_time,min_conn选项\n8b4acc9 - xudianyang           * fixed dump array value null\n\n3.0.4 ==================================================================================================================\n3cb4d61 - niulingyun           + 增加队列支持，目前支持redis、rabbitMQ、kafka\n32fc570 - niulingyun           + http client 支持keep-alive缓存\n7a37e9d - niulingyun           + http client 支持gzip\nb6bcbfd - shellvon             + 增加对MySQL字段和表名的转义\n009477c - xudianyang           * 路由路径问题修复\n10024c7 - xudianyang           * 修复打印数组的bug，同时去掉只打印100个元素的限制\n2e02052 - niulingyun           * 调整获取ip的顺序,修复负载器后获取ip的bug\n095b746 - shellvon             * 模版渲染引擎调整为使用官方\n1b50d2f - niulingyun           * 修复RPC重复unpack参数bug\n1575443 - xudianyang           * 优化协程异常捕获逻辑\n5e9ac71 - niulingyun           * 修复两处redis的bug\nbf743cc - niulingyun           * 修复 task 构造函数传参问题和mysql删除操作的bug\nf5d3068 - zhangguangjia        * checkRedisProxy新增redis密码授权\nd93e727 - xudianyang           * 修复Post传递Query参数的问题\n43dffd1 - niulingyun           * 支持直接在url之后带参数形式的GET请求\n7bc5bbb - zhanglu              * 修改input:getAllPostGet返回get+post的参数\n\n3.0.3 ==================================================================================================================\n9a31436 - xudianyang           * 调整processType标识\n4b7df57 - niulingyun           * 异步redis set过期时间增加EX标识\n8e8eb58 - xudianyang           + Timer进程支持多个定时器\n1de66b5 - xudianyang           + Timer进程支持协程调度\ne313c9a - xudianyang           * 重构Request ID\n\n3.0.2 ==================================================================================================================\n9d6e003 - xudianyang           * 修复请求链log_id的问题\n5614caa - xudianyang           + 异常规范、HTTP Access日志\n8b3d8c6 - syyongx              * Fix Restful bug\n28ca9b2 - xudianyang           * 规范Task异常时的日志\ne5793aa - 闫帅兵                * 优化inotify，完美支持文件或者目录的修改、删除、新增\n430c4fa - xudianyang           * 优化MySQL连接池，更简单，更容易使用\n76cc105 - xudianyang           + MySQL Proxy（主从结构、读写分离、支持事务）\n0aa72ec - xudianyang           + HTTP SEND FILE 静态文件（支持域名绑定）\n445e2bb - xudianyang           + 完善和优化MySQL同步模式，和异步模式接口一致\n24524b2 - niulingyun           + 新增异步协程毫秒级sleep,功能同php的sleep函数\n\n3.0.1 ==================================================================================================================\ncfdb0b4 - niulingyun           * 修复controller自动重置public属性\n\n3.0.0 ==================================================================================================================\n508380b - pinguo-xudianyang:   * 调整controller::destroy策略\n3b4c199 - pinguo-xudianyang:   * 修复监控端口的问题\n550757c - pinguo-xudianyang:   * 修复MSFCli模式的报错\nc125044 - pinguo-xudianyang:   + 添加Macro::PROCESS_WORKER,Macro::PROCESS_TASKER,Macro::PROCESS_USER进程标识宏\n85eef20 - pinguo-xudianyang:   * TaskProxy兼容用户自定义进程\n2630446 - pinguo-xudianyang:   + worker exit统计\na23c91b - pinguo-xudianyang:   + monitor writeln\n02ae54b - pinguo-xudianyang:   * 修复TaskProxy的类名问题\n2874a3c - pinguo-xudianyang:   * 控制台日志优化\nb9e571c - pinguo-xudianyang:   * 调整RestRoute类位置\n128acda - pinguo-xudianyang:   * 控制器销毁逻辑策略调整\n42cdeaa - pinguo-xudianyang:   * 控制台日志标准优化及修复CLI模式进程无法退出的问题\n13e5d4f - pinguo-xudianyang:   * HttpServer dump输出到控制台\nf4289a1 - pinguo-xudianyang:   * 调整协程调度器命名\n5aeebf6 - pinguo-niulingyun:   * uni console output\n1b3ff26 - pinguo-xudianyang:   * 修复TaskProxy的支持问题\n53aa785 - pinguo-xudianyang:   * 修复HTTP协程请求失败时日志记录失败的问题\n4e15178 - pinguo-xudianyang:   * 调整协程调度器命名\n28dbbc3 - pinguo-xudianyang:   * 修复Pool::setCurrentObjParent bug\n4e136cd - pinguo-xudianyang:   * 完善RPC\nfdfab09 - pinguo-xudianyang:   * 重构RPC\n73538b0 - pinguo-xudianyang:   * 内置Pack打包器\n926dea0 - pinguo-zengzhiqiang: + 文件头统一\n9d973b2 - pinguo-lipengcheng:  * add license md\n9b32741 - pinguo-xudianyang:   * 连接池前缀，删除独立进程连接池的支持\n17ea068 - pinguo-lipengcheng:  + add CREDITS\n4b27ad6 - pinguo-xudianyang:   * Server运行状态监控重构\n89e40a0 - pinguo-xudianyang:   * 对象池构造方法传参方式修改为数组 \n89e40a0 - pinguo-xudianyang:   * 销毁对象支持自定义级别(DS_PUBLIC,DS_PROTECTED,DS_PRIVATE)\n5eb1bed - pinguo-xudianyang:   * 修复Http协程类型判断的问题\naadbc77 - pinguo-xudianyang:   * 完善连接池\neefce11 - pinguo-xudianyang:   * MySQL协程实现\n3222e0d - pinguo-xudianyang:   * 统一Tasker进程内的对象加载方式 \n3222e0d - pinguo-xudianyang:   * 文件头统一 \n3222e0d - pinguo-xudianyang:   * 所有类方法或者函数的参数注释\n3222e0d - pinguo-xudianyang:   - 去掉TCP（专注HTTP）\n7049260 - pinguo-xudianyang:   * 任何内建对象都可以采用通用对象池创建 \n7049260 - pinguo-xudianyang:   * 所有协程方法使用go关键字作为前缀\n7049260 - pinguo-xudianyang:   * Controller使用通用对象池加载\nc09367f - pinguo-xudianyang:   * 统一普通对象、Model、Task的加载\nc09367f - pinguo-xudianyang:   * 对象池支持构造方法 \nc09367f - pinguo-xudianyang:   * 调用Task方法简化为两步\nc09367f - pinguo-xudianyang:   * 所有框架内核依赖的成员变量及方法以__打头"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 0.88671875,
          "content": "{\n  \"name\": \"pinguo/php-msf\",\n  \"description\": \"Pinguo Micro Service Framework For PHP\",\n  \"license\": \"GPL\",\n  \"type\": \"library\",\n  \"homepage\": \"https://github.com/pinguo/php-msf\",\n  \"require\": {\n    \"php\": \">=7.0\",\n    \"ext-swoole\": \">=1.9.15\",\n    \"pinguo/php-log\": \">=1.0.2\",\n    \"pinguo/php-context\": \">=1.0.2\",\n    \"pinguo/php-aop\": \"1.0.0\",\n    \"league/plates\": \"3.3.0\",\n    \"hassankhan/config\": \"~0.10\",\n    \"flexihash/flexihash\": \"^2.0.0\"\n  },\n  \"suggest\": {\n    \"alcaeus/mongo-php-adapter\": \"^1.0\",\n    \"ext-amqp\": \">=1.8.0\",\n    \"pda/pheanstalk\": \"PHP client for beanstalkd queue\",\n    \"kwn/php-rdkafka-stubs\": \"for kafka support\"\n  },\n  \"autoload\": {\n    \"psr-4\": {\n      \"PG\\\\MSF\\\\\": \"src/\"\n    },\n    \"files\": [\n      \"src/Helpers/Common.php\",\n      \"src/Macro.php\"\n    ]\n  },\n  \"minimum-stability\": \"dev\",\n  \"prefer-stable\": true,\n  \"extra\": {\n  },\n  \"config\": {\n    \"secure-http\": false\n  }\n}\n"
        },
        {
          "name": "php-msf.png",
          "type": "blob",
          "size": 8.8544921875,
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}