{
  "metadata": {
    "timestamp": 1736711772435,
    "page": 27,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Qloapps/QloApps",
      "stars": 4616,
      "defaultBranch": "develop",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 5.0498046875,
          "content": "\n# Editors, tools and OS's\n\n.buildpath\n/.htaccess\n.project\n.settings\n.idea\n.svn\n.DS_Store\n.sass-cache\nconfig.codekit\n*.sublime-project\n*.sublime-workspace\nnbproject\nbower_components\ncomposer.lock\n\n# Cache, temp and personal files\n\n/cache/**\n!/cache/cacert.pem\n!/cache/index.php\n\n!/cache/cachefs/\n!/cache/cachefs/index.php\n\n!/cache/purifier/\n!/cache/purifier/index.php\n\n!/cache/push/\n!/cache/push/activity\n!/cache/push/index.php\n!/cache/push/trends\n\n!/cache/sandbox/\n!/cache/sandbox/index.php\n!/cache/smarty/\n\n!/cache/smarty/cache/\n!/cache/smarty/cache/index.php\n!/cache/smarty/compile/\n!/cache/smarty/compile/index.php\n!/cache/smarty/index.php\n\n!/cache/tcpdf/\n!/cache/tcpdf/index.php\n\n\n/download/*\n!/download/.htaccess\n!/download/index.php\n\nimg/**\n!/img/404.gif\n!/img/.htaccess\n!/img/admin/\n!/img/admin/*.gif\n!/img/admin/*.png\n!/img/admin/*.jpg\n!/img/admin/index.php\n!/img/bg_500.png\n!/img/bg_loader.png\n!/img/c/\n!/img/c/index.php\n!/img/cms/\n!/img/cms/.htaccess\n!/img/cms/cms-img.jpg\n!/img/cms/index.php\n!/img/co/\n!/img/co/index.php\n!/img/favicon.ico\n!/img/genders/\n!/img/genders/Unknown.jpg\n!/img/genders/index.php\n!/img/hotel_header_image.jpg\n!/img/index.php\n!/img/jquery-ui/\n!/img/jquery-ui/*.png\n!/img/jquery-ui/index.php\n!/img/l/\n!/img/l/index.php\n!/img/l/none.jpg\n!/img/loader.gif\n!/img/loadingAnimation.gif\n!/img/logo.jpg\n!/img/logo_invoice.jpg\n!/img/logo_mail.jpg\n!/img/logo_stores.gif\n!/img/logo_stores.png\n!/img/m/\n!/img/m/index.php\n!/img/macFFBgHack.png\n!/img/os/\n!/img/os/index.php\n!/img/p/\n!/img/p/index.php\n!/img/prestashop-avatar.png\n!/img/qloapps@2x.png\n!/img/qloapps-login@2x.png\n!/img/qloapps-login-wink@2x.png\n!/img/questionmark.png\n!/img/rf/\n!/img/rf/index.php\n!/img/s/\n!/img/s/index.php\n!/img/scenes/\n!/img/scenes/index.php\n!/img/scenes/thumbs/\n!/img/scenes/thumbs/index.php\n!/img/st/\n!/img/st/index.php\n!/img/su/\n!/img/su/index.php\n!/img/t/\n!/img/t/*.gif\n!/img/t/index.php\n!/img/tmp/\n!/img/tmp/index.php\n\n/log/*\n!/log/.htaccess\n!/log/index.php\n\n/upload/*\n!/upload/.htaccess\n!/upload/index.php\n\n/admin/backups/*\n!/admin/backups/.htaccess\n!/admin/backups/index.php\n\n/admin/import/*\n!/admin/import/.htaccess\n!/admin/import/index.php\n\n/themes/*/cache/*\n!/themes/*/cache/index.php\n\n/admin/themes/*/cache/*\n!/admin/themes/*/cache/index.php\n\n# Config\n\n/config/settings.inc.php\n/config/settings.old.php\n\n/config/xml/**\n!/config/xml/.htaccess\n!/config/xml/index.php\n!/config/xml/qlo_mod_list.xml\n!config/xml/themes/\n!config/xml/themes/default.xml\n!config/xml/themes/index.php\n\n# Themes, modules and overrides\n\n# modules/*\n/modules/*/config.xml\n/modules/*/translations/*\n\n/override/*\n!/override/.htaccess\n!/override/index.php\n!/override/readme_override.txt\n\n!/override/classes/\n!/override/classes/index.php\n!/override/classes/cache/\n!/override/classes/cache/index.php\n!/override/classes/checkoutProcess/\n!/override/classes/checkoutProcess/index.php\n!/override/classes/controller/\n!/override/classes/controller/index.php\n!/override/classes/db/\n!/override/classes/db/index.php\n!/override/classes/exception/\n!/override/classes/exception/index.php\n!/override/classes/helper/\n!/override/classes/helper/index.php\n!/override/classes/log/\n!/override/classes/log/index.php\n!/override/classes/module/\n!/override/classes/module/index.php\n!/override/classes/order/\n!/override/classes/order/index.php\n!/override/classes/pdf/\n!/override/classes/pdf/index.php\n!/override/classes/range/\n!/override/classes/range/index.php\n!/override/classes/shop/\n!/override/classes/shop/index.php\n!/override/classes/stock/\n!/override/classes/stock/index.php\n!/override/classes/tax/\n!/override/classes/tax/index.php\n!/override/classes/tree/\n!/override/classes/tree/index.php\n!/override/classes/webservice/\n!/override/classes/webservice/index.php\n\n!/override/controllers/\n!/override/controllers/index.php\n!/override/controllers/admin/\n!/override/controllers/admin/index.php\n!/override/controllers/admin/templates/\n!/override/controllers/admin/templates/index.php\n!/override/controllers/front\n\n!/override/modules/\n!/override/modules/index.php\n\n\nadmin/themes/default/sass/ie.sass\nadmin/themes/default/sass/print.sass\nadmin/themes/default/sass/screen.sass\n\nadmin/themes/default/css/ie.css\nadmin/themes/default/css/print.css\nadmin/themes/default/css/screen.css\n\n# Translations and emails templates\n\n/translations/**\n!/translations/index.php\n!/translations/en.gzip\n\n!/translations/export/\n!/translations/export/index.php\n\n/mails/*\n!/mails/.htaccess\n!/mails/index.php\n!/mails/en/\n\n/themes/hotel-reservation-theme/cache/*\n!/themes/hotel-reservation-theme/cache/\n!/themes/hotel-reservation-theme/cache/index.php\n\n/themes/hotel-reservation-theme/lang/*\n!/themes/hotel-reservation-theme/lang/index.php\n!/themes/hotel-reservation-theme/lang/en.php\n\n/themes/hotel-reservation-theme/modules/*/translations/*.php\n!/themes/hotel-reservation-theme/modules/*/translations/index.php\n\n/themes/hotel-reservation-theme/mails/*\n!/themes/hotel-reservation-theme/mails/index.php\n!/themes/hotel-reservation-theme/mails/en/\n\n/themes/hotel-reservation-theme/modules/*/mails/*\n!/themes/hotel-reservation-theme/modules/*/mails/index.php\n!/themes/hotel-reservation-theme/modules/*/mails/en\n\n# MISC\n\n**sitemap.xml\nrobots.txt"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.8466796875,
          "content": "language : php\naddons:\n  chrome: stable\n  apt:\n    packages:\n      - apache2\n      - postfix\n      - libapache2-mod-fastcgi\n      - libappindicator1\n      - fonts-liberation\nsudo: required\ndist: trusty\n\nphp:\n  - 5.6\n  - 7.2\n\nbefore_script:\n  - sudo cp -f tests/travis-ci-apache-vhost /etc/apache2/sites-available/default\n  - sudo cp -Rf . /var/www/qloapps.unit.test\n  - sudo chmod 777 -R /var/www/\n  - sudo service apache2 restart\n\nscript:\n  - cd /var/www/qloapps.unit.test/tests && bash getcomposer.sh && php composer.phar install && php vendor/bin/phpunit -c .\n\nafter_script:\n  - sudo cat /var/log/apache2/error.log\n\nafter_failure:\n  - curl -L http://localhost/\n  - cat /etc/apache2/envvars\n  - cat /etc/apache2/sites-available/000-default.conf\n  - sudo cat /var/log/php-fpm.log\n  - sudo ls -l /var/log/apache2\n  - sudo cat /var/log/apache2/other_vhosts_access.log\n"
        },
        {
          "name": "Adapter",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.txt",
          "type": "blob",
          "size": 99.1884765625,
          "content": "####################################\n# V1.6.1\n####################################\n\n## Added Features:\n  - #941: Admin can add custom prices for facilities and services while editing order.\n  - #890: Service products can now be assigned to a room type from room type edit page at back office.\n  - #881: Address is not required in booking/order flow\n  - #784: Admin can add partial order payment when creating a new booking.\n  - #901: Added upgrade/degrade of rooms while reallocation and also fixed reallocation and swapping issues.\n  - #833: Added 'Show at front office' option to enable/disable booking from front office.\n  - #877: Added new module for extra service and facilities statistics.\n  - #830: Added option to disable backdate order from superadmin and employees.\n  - #896: Added configuration for showing prices in Order list in (Default currency or Payment Currency).\n  - #1105: Added option for modules to manipulate KPI data.\n  - #918: New design of order detail page of the customer\n  - #918: New design of order detail page of the admin in back-office\n  - #870: New design for KPIs in back-office\n  - #1080: Added option 'Maximum Login Attempts' on Preferences > Maintenance page to allow certain number of employee login attempts.\n  - #947: Added KPIs on orders list page in back-office.\n  - #1124: Added new KPIs in order view page in the Back-office.\n  - #1264: Added Seo fields in manage hotel controller in the back-office\n  - #850: Added language dropdown on maintenance page.\n  - #1108: Added email template for Partial payment received status.\n  - #1164: Added option to add/edit customer address from order detail page of Back office.\n  - #819: Added configuration to show or hide 'Date of Birth' field in customer registration and customer information form at front office.\n  - #1065: Added Option to view frequent customer in back office customer page.\n  - #1094: Added Admin can set voucher expiry along with voucher when managing refund request.\n  - #1167: Added Confirmation modal when deleting cart rules and while changing credit slip status.\n  - #1204: Added option to show page loader in back office.\n  - #1191: Added webservice for bookings management.\n  - #1170: Added date wise breakdown in Availability and rates search API\n  - #776: Added breadcrumbs on my account pages at front office.\n  - #894: Added process to allow modules to override module admin and front controllers.\n  - #1168: Added hotel description in room type page in front office.\n  - #1092: Added new sorting option \"recommended\" in search result page.\n  - #775: Added demo service products for categories Meals and Transfers.\n  - #962: Added new categories in demo data.\n  - #882: Added links of Suggested Modules and Themes during installation.\n  - #1195: Added process for smarty template overriding.\n  - #937: Added hotel wise restriction on the customer messages belonging to an order.\n  - #1028: Added hotel wise restrictions on the order notifications for the employee.\n  - #1138: Added parameters in PatmentModule::validateOrder() function to prevent the emails on the order validation process.\n  - #883: Added 'Save and stay' button on missing pages at back office.\n  - Added new hooks in #938, #880, #928, #935, #1121, #1132, #1197, #812, #887, #1197, #1271\n\n## Back Office:\n- Improvements:\n    - #891: Updated design of back office page toolbar\n    - #1031: Updated tab wise permission restriction on the hotel feature delete process.\n    - #1188: Updated hotel features assigning process in the back office.\n    - #965: Improved AdminImportController to handle the csv files required in managing PMS.\n    - #1241: Updated condition to assign default category on the AdminCustomNavigationLinkSettingController in the back-office.\n    - #1185: Updated the tab menu list of the hotel reservation system in the back office.\n    - #1067: Updated the icon for the invoice in search list in the back office\n    - #1064: Updated room type position update field alert message in back office\n    - #1186: Added `Add new order` button on the admin orders list page.\n    - #1025: Added hotel name and room type name in the list in the hotel room block module, added hotel search option while creating new room block.\n    - #1187: Added feature in tree to select all children node when parent node is selected and fixed some text issue\n    - #1119: Added check-all and uncheck-all option in the tree for normal products and scroll bar for the rendered tree.\n    - #1267: Added validations for backoffice list filters for text fields.\n    - #826: Updated filter by Places panel removed and added advanced filters and room type positioning on Manage Room Types page at back office\n    - #808: Updated move Week Days list in a new row on Advanced Price Rule form at back office\n    - #884: Added breadcrumbs for Hotel Booking and Reservation System module controllers under Hotel Reservation System > Settings.\n    - #944: Added Accurate page name display in \"Visitors online\" statistics.\n    - #736: Updated display voucher table only if needed on Order view at back office\n    - #811: Updated code commented for Pagination panel on Preferences > Room Types page at back office\n    - #1291: Updated validation for 'Consider guest as child below age' in the back-office and removed child ages from occupancy fields in case 'Maximum children' for a room type is 0 from front-office.\n    - #801: Updated code for unused addons login feature at the back office has been commented\n    - #799: Removed subtabs Search Engines and Referers from Stats tab at back office\n    - #1158: Updated the trademark of the head tag of the admin login page\n    - #1068: Added validation for the social name in the admin genders controller and changed the neutral gender to the other.\n    - #1149: Updated preparation time to minimum booking offset and its definition in the admin order preferences controller.\n    - #1088: Updated customer deletion and ban process and added filters for the admin to view the banned customers.\n    - #888: Updated default listing order of rooms on admin book now page to ascending order of room database ID.\n    - #1042: Updated created different block for the customer general and customer KPI configuration in the customer preferences in the admin office.\n    - #1039: Updated abandoned cart Filter and the Abandoned cart KPI in the admin carts controller.\n    - #939: Updated optimized search results in the admin search page.\n    - #873: Removed decimal values from admin stats graph axis where not required\n    - #815: Updated added Rooms filter and added suggestions for Hotel and Room type filter inputs on admin orders list page\n    - #807: Added Warning for maximum quantity of service products in Extra Services popup when creating or editing a booking at back office.\n    - #789: Updated set default occupancy chosen on search results, room type detail and admin book now pages\n    - #1169: Updated info for convenience fees products and taxes breakup in admin order detail page.\n    - #771: Updated design of 'Delete voucher' button has been changed to button instead of text on admin Order detail page\n    - #770: Updated disable cart popup button on admin Book Now page if cart is empty\n    - #987: Improved Statstics data in admin stats page\n    - #926: Updated renamed tab Configure to Rooms on Catalog > Manage Room Types page\n    - #863: Updated \"stats dashboard\" page conversion graph design\n    - #835: Updated make Customer Groups inaccessible if option Customer Groups is disabled on Advanced Parameters > Performance page\n    - #827: Updated use Chosen plugin to select hotel on Catalog > Add Room Type page\n    - #748: Updated latest logs created will be displayed at the top on Advanced Parameters > Logs page\n    - #798: Updated move navbar Customer Support contact settings to Hotel Reservation System > Settings > General Settings page\n    - #1268: Updated error message for cart rule validation\n    - #1176: Updated the disabled dates interface, add and update process.\n    - #1165: Displayed image Upload Sizes for Hotel Amenities and Interior Blocks\n    - #1139: Updated the validation for the city name.\n    - #1135: Updated order Return states names changes and Translations added\n    - #1103: Updated validations of order status changes while changing order status using bulk action\n    - #1101: Updated order edit validations for refunded or cancelled bookings\n    - #980: Updated room type pre-tax operating cost validation message\n    - #967: Updated display Helper list filters above list table using new list header option\n    - #865: Updated stats are now shown according to employee hotel access\n    - #851: Updated same day room checkin - checkout and select time along with checkin - checkout\n    - #841: Updated prevent room deletion and room status update to inactive when room has future booking\n    - #1145: Updated empty dropdown will appear if no options are available and empty message is not set.\n    - #1070: Updated validations for Hotel address when add a new hotel\n    - #837: Updated resolve multiple specific price visible for a single catalog rule\n    - #1146: Udpated Text of column 'tax' to 'Tax rule' in both 'Additional Facilities' & 'Service Products' tab of room type detail page\n    - #1041: Added 'Show at front' column and updated display of 'Advanced payment' column in the room type list in back office.\n    - #1237: Removed Save and stay button for the new voucher popup on the Book Now page in the back-office.\n    - #898: Removed association tab from back office room type page\n    - #1134: Removed the gender icon from customer information in the AdminCartsController\n    - #1059: Removed order Currency filter was added multiple time in admin orders page\n    - #930: Removed hotel wise access restriction for the employees on AdminCustomerController\n    - #875: Removed information block for 'Save global page views' from admin stats where not required\n    - #869: Removed custom scrollbar design for badges on admin dashboard\n    - #1115: Removed retail price field with tax from manage service product panel\n    - #932: Removed hotel wise access for the employees on the customers addresses\n    - #769: Removed delivery related fields from Orders > Statuses list page and new Order State form\n    - #726: Removed country Options section from Localization > Countries page\n    - #1016: Added display global max order date and global preparation time in the restriction tab in manage hotels.\n\n- Bugs Fixed:\n    - #866:  Fixed Arrangement of row and column in csv files.\n    - #1284: Fixed getting fatal error on AdminHotelRoomsBookingController when an employee adds an invalid date in the search booking form in back-office.\n    - #1257: Fixed available fields column of one tab is reset from another tab in backoffice\n    - #1251: Fixed occupancy selection panel design issue in Backoffice book now page\n    - #1248: Fixed wrong process for the hotel name for 'most viewed' room types for dashboard in the back-office.\n    - #1243: Fixed wrong addresses search and hotel access wise Service products search results in AdminSearchController in the back-office.\n    - #1240: Fixed the design issues with the pop up in the search form in Book Now page in back-office.\n    - #1239: Fixed hotel wise restriction not working in AdminCustomersThreadsController in back-office.\n    - #1233: Fixed getting Fatal error while trying to use filter in the AdminTabsController in the back-office.\n    - #1231: Fixed wrong values selected in Select type filter when submitting with empty value in all render-list filters in the back-office.\n    - #1230: Fixed the add new button disappears when the controller display type is not empty in admin controllers in the back-office.\n    - #1228: Fixed information alert for 'Max quantity allow' field does not hide if 'Allow ordering of multiple quantities' is disabled while adding/editing service products in back-office\n    - #1214: Fixed wrong value of the Messages KPI in AdminOrdersController in back-office.\n    - #1213: Fixed wrong value of Gender percentage in Customers KPI in the AdminCustomerController in the back-office\n    - #1212: Fixed wrong total number of customers in the render-list in the AdminCustomerController in the back-office\n    - #1159: Fixed total count for the service products is incorrect in the list in back office.\n    - #1125: Fixed invoice data is not correct when multiple invoices created in an order from back-office\n    - #1122: Fixed currency conversion issue in order if default currency is changed while creating booking from back-office\n    - #1106: Fixed refund amount not converted while changing the currency of the Order in back office\n    - #1102: Fixed unable to add discount coupon of 100% on order detail page from back-office\n    - #1063: Fixed order prices decimal value not shown according to configuration when booking from back office\n    - #1049: Fixed warnings for invalid IMAP configuration after saving the default message in the contact in the back office.\n    - #1046: Fixed getting errors in the back office if the id in the URL is updated manually to an invalid one.\n    - #1045: Fixed the email selection process while creating new address for the customer and back button for the AdminAddressController.\n    - #1043: Fixed the customer page in the back office showing non required information.\n    - #1030: Fixed the errors not being displayed in the AdminThemesController in the back office.\n    - #1023: Fixed backoffice design issue in RTL language\n    - #1004: Fixed issues in the process of booking creation from back office\n    - #997: Fixed getting fatal error on order detail page if entered invalid order ID in URL in back-office\n    - #996: Fixed name of the guest user is not present on order detail page in back-office while guest checkout\n    - #986: Fixed tax price is not calculated according to zip code in backoffice controllers\n    - #963: Fixed warning in the Back-office header when update information is not available\n    - #889: Fixed new hotel category gets created instead of updating previous one on hotel name update at back office\n    - #856: Fixed price conversion issues while changing currency in order detail page in back office\n    - #854: Fixed errors shown on order detail page in back office when booked hotel is deleted\n    - #825: Fixed auto added services is not visible at back office add order and view order page\n    - #822: Fixed service products are displayed when searching for room types at back office\n    - #817: Fixed php warning when using non-numeric value for Position filter in renderLists at back office\n    - #814: Fixed voucher of one customer can be applied to another customer at back office\n    - #813: Fixed success message is not displayed for bulk status updates in a list at back office\n    - #806: Fixed new cart getting created even if there are no active hotels for booking at back office Book Now page\n    - #805: Fixed 'Controller not found' alert when clicking on Hotel Reservation System breadcrumb at back office\n    - #803: Fixed php notice for function get_magic_quotes_gpc() on Configuration Information page at back office\n    - #802: Fixed blank space displayed in Customer panel of order detail page in the back-office when customer has deleted\n    - #792: Fixed warnings displayed after deleting all booked rooms from the orders detail page in back-office\n    - #777: Fixed employee can search for inaccessible Service Products using search box at back office\n    - #750: Fixed deleted customers are displayed when searching customer while creating a new order from back office\n    - #738: Fixed Time picker not available in payment block on order detail page at back office\n    - #730: Fixed PHP warning on Booking Carts > View page at back office if address of the cart customer is deleted\n    - #725: Fixed Pre-populate form values after invalid form submission of hotel form at back office\n    - #1270: Fixed console errors in admin room type and service form when only view permission is provided\n    - #1225: Fixed javascript files are included multiple times in admin login page\n    - #1150: Fixed design issue in order page and kpi when printing admin pages\n    - #1143: Fixed error on AdminTranslationController while translating modules, also optimized the translation process for the modules.\n    - #1128: Fixed admin is able to create account using 0 as email\n    - #1120: Fixed incorrect prices show in admin refund request controller\n    - #1118: Fixed admin was able to create new account using the banned account email.\n    - #1114: Fixed admin cannot create different Advance price rule for different group for same date ranges\n    - #1093: Fixed unable to save hotel if admin makes some fields required in address\n    - #1085: Fixed issues in admin cart rule controller.\n    - #1074: Fixed online column on admin Booking Carts page\n    - #1069: Fixed while creating an account from the book now tab, the admin was able to select visitor and guest groups after submitting the ajax form once with errors.\n    - #1056: Fixed issues if admin tries to add discount having values equals or greater to the order total or due amount.\n    - #1048: Fixed the warning for invalid price shown on the Admin products controller if there is any error.\n    - #1047: Fixed the modules list filter shows all modules in admin office.\n    - #1044: Fixed the issues in catalog price rule (AdminSpecificPriceRuleController).\n    - #1033: Fixed filter issue on Admin refund request page\n    - #1019: Fixed empty copywrite year range in the footer incase the admin does not provide the website launch year.\n    - #1001: Fixed should not allow admin to add rooms if order status is already canceled or refunded.\n    - #1000: Fixed validation messages should be present on the view page on admin order detail page for Document Notes.\n    - #995: Fixed getting a fatal error if the admin reduces(in negative amount) more from the booking than the paid amount.\n    - #989: Fixed same Order ID is displayed multiple times on admin Booking Carts listing page\n    - #983: Fixed number of associated room types are not shown according to hotel permission in admin service product page\n    - #969: Fixed empty cart is creted when KPI visibility is updated in Admin carts page\n    - #958: Fixed admin was able to update the booking dates of a room in an order to the disabled dates of that room.\n    - #957: Fixed room types and service products were not displayed in the search result in the admin search controller.\n    - #940: Fixed employee was able to download invoice for all hotels from Admin Invoice controller\n    - #936: Fixed date selection corrections at different places in admin controllers.\n    - #933: Fixed admin is able to add/update the quantity of auto added services from the AdminOrdersController, while updating any order.\n    - #929: Fixed AdminOrdersRefundRequestsController showing exception to all employees except the super admin.\n    - #920: Fixed super admin profile id is used instead of SuperAdmin employees ids while sending Order-Confirmation and Refund emails\n    - #916: Fixed auto added services price not showing in cart summary in admin book now page\n    - #913: Fixed added auto add services to the rooms added to the order by admin on edit order from the admin panel\n    - #907: Fixed room reallocation process on AdminHotelRoomsBooking controller caused by space in the name of the room.\n    - #893: Fixed invalid security token issue on admin Customers form page\n    - #876: Fixed currency conversion in admin stats page\n    - #874: Fixed incorrect forcast data in \"stats Dasboard\" tab in admin stats page\n    - #859: Fixed admin login page opens in recommendations popup\n    - #840: Fixed calendar tooltips reappear on admin book now page after adding or removing rooms from cart\n    - #836: Fixed employee form language memorization (Administration > Employees) not working for some forms\n    - #831: Fixed admin is unable to set empty birthday for a customer during update\n    - #791: Fixed getting PS exception when admin sends `<script>` in the Message from admin order detail page\n    - #790: Fixed rooms stats issue on admin Book Now page when adding or removing rooms from cart\n    - #742: Fixed unable to delete room types from cart if admin visits book now page just after booking creation and before order confirmation\n    - #733: Fixed admin can not set refund amount to 0 when creating refund rules\n    - #723: Fixed PHP warning on Administration > Menus page when changing positions of Menus\n    - #755: Fixed Social title is not displayed on Customers > Groups > View page customer list\n    - #1184: Fixed Issue occurs while deleting room booking line, If there is no refund requests created for the booking\n    - #1129: Fixed Dashboard issues on different sections\n    - #1091: Fixed fatal error when adding negative price with an absolute numeric value equal to or less than the paid amount but a greater currency value\n    - #1081: Fixed render list filter values are saved without validation\n    - #1076: Fixed php warning on order detail page if all rooms from order are deleted\n    - #1071: Fixed sort by price in module catelog page\n    - #1053: Fixed available Fields for render list are not working if there is only one item present in the list.\n    - #1029: Fixed hotel configuration options in settings only visible in default language\n    - #1012: Fixed creation of two separate HotelAdvancedPayment objects for a newly created room type from two separate tabs\n    - #1007: Fixed maximum occupancy, length of stay and specific prices are not duplicating correctly while duplicating a room type.\n    - #1002: Fixed unable to edit the price of the room on order detail page, if price becomes with decimals more than valid limit in calculation\n    - #994: Fixed unable to delete rooms from the Free order\n    - #991: Fixed need to arrange the options in correct order at order list page in mobile view.\n    - #982: Fixed advance price rule created during booking are visible in room type price tab\n    - #976: Fixed design issue in new list header design\n    - #925: Fixed multiple Advance Price Rule can be created with same conditions\n    - #923: Fixed service product price and quantity was added incorrectly in order on edit/update\n    - #919: Fixed issue while saving hotel with name starts with numeric values\n    - #900: Fixed dashboard stats issues and also improved the view of the dashboard\n    - #824: Fixed allotment Type selection in partial available rooms in book now page\n    - #793: Fixed order status submitted even on clicking Cancel button while changing status from Bulk actions in orders list\n    - #779: Fixed module zip validation on Module upload on Modules and Services page\n    - #774: Fixed HelperForm input type 'group' submit name can not be changed\n    - #764: Fixed 'Add new webservice key' button gets hidden on saving Webservice options\n    - #763: Fixed Hote Reservation System tab icon breaks randomly\n    - #754: Fixed 'Add a new module' button is displayed even if current employee is not allowed to install modules\n    - #753: Fixed All file types are available for selection when choosing images for hotel and room type\n    - #751: Fixed Groups selection is removed for Advanced Price Rule when status is changed\n    - #749: Fixed Abandoned Carts filter is not working on Booking Carts page\n    - #741: Fixed PHP notice on Catalog Price Rules page due to invalid input\n    - #731: Fixed Filter reset button is not displayed when clicking on 'Disabled Room Types' on Manage Room Types page\n    - #729: Fixed Hotel permissions are not saved when a hotel is created\n    - #727: Fixed refund Rules for multiple hotels for same cancellation days can not be created\n    - #1210: Fixed invalid argument supplied for foreach AdminStatsController\n    - #915: Fixed translated text not visible on admin controllers\n\n## Front Office:\n- Improvements:\n    - #970: Updated service product updation process on the front in the product controller\n    - #844: Updated front office room type page show default date according to LOS\n    - #781: Improved room search user experience at front office\n    - #1201: Updated cart total summary on checkout page\n    - #847: Updated page not found (Error 404) page\n    - #1133: Updated original price will now be displayed with discounted amount.\n    - #762: Updated search Results Page Filters options have been moved to module wkhotelfilterblock\n    - #758: Updated redirect to Page not found for invalid search results page URL\n    - #757: Updated redirect customer to order confirmation page after free order validation instead of order history page\n    - #735: Updated open room type detail page in same tab from Our Rooms block on landing page\n    - #724: Updated bankwire and cheque payment details on order confirmation page\n    - #782: Updated make Our Rooms images on landing page clickable to open room type detail page\n    - #959: Updated design for the our room block\n    - #1017: Updated error message for guest account while transforming to customer account\n    - #839: Added error message for maximum occupancy in room occupancy dropdown.\n    - #1058: Added hotel rating is now visible with the hotel name on the room type page.\n    - #966: Added done button in the occupancy popup in the front office.\n\n- Bugs Fixed:\n    - #1292: Fixed design issues on the order-opc page and growl notifications in RTL mode in the front-office.\n    - #1263: Fixed responsive design issue in front office search block\n    - #1249: Fixed translation issues and removed slashes in the error message from cart validation process in the front-office.\n    - #1242: Fixed the default date ranges in the booking form are not correct in case los and minimum booking offset is applied on the room type in the front-office.\n    - #1236: Fixed cart rule without code is not being applied automatically to the cart in the front-office.\n    - #1234: Fixed the price breakdown was incorrect with tax when a voucher was applied to an order, affecting invoices, emails, front-office, and back-office displays.\n    - #1179: Fixed the price tooltip and updated the design for the booked services and demands popup on the order confirmation page in front office.\n    - #1171: Fixed the RTL languages design issues on the front office.\n    - #1144: Fixed the design for the 'Subscribe' button on the order-detail page in front-office\n    - #1113: Fixed no validation for length of characters in traveller detail fields in Front and Back office\n    - #1020: Fixed a room type shows multiple times in customer message section in front office order detail if admin adds a room from back office.\n    - #1013: Fixed notice on room type page in the front office caused by selecting 'no tax' as a tax rule option.\n    - #934: Fixed if advance price rule discount is applied on a room type having auto add service with \"Add price in room price\", discounted price is not displayed on room block section in front office.\n    - #924: Fixed incorrect room price and final price when admin remove service product or update room price from admin end and proceed for payment at front office\n    - #860: Fixed front office 'hotel-reservation-theme' RTL compatibility\n    - #849: Fixed security Vulnerability: XSS for back and email_create parameters while registration in front office\n    - #838: Fixed services image legend not visible on front office room type page\n    - #834: Fixed buttons positioning issue on search results page at front office due to long length of button texts in certain languages\n    - #816: Fixed customer is logged in automatically after password reset at front office\n    - #795: Fixed 'Add Room' button is displayed on occupancy popup even if no more rooms are available at front office\n    - #788: Fixed error when updating address from customer acccount which has been used to create an order at front office\n    - #786: Fixed php warning on removing room from cart dropdown at front office\n    - #785: Fixed custom price set for a room type in an order at back office is also reflected at front office for same customer\n    - #737: Fixed voucher description usage in front office\n    - #1272: Fixed order confirmation and Guest tracking flow issues and order emails are improved\n    - #1086: Fixed the customer messages sent from the contact page updates the previous message even if the subject (contact) selected is different.\n    - #988: Fixed unable to send customer request mail from contact us page\n    - #981: Fixed wrong voucher amount in different currencies on customer my vouchers page\n    - #740: Fixed customer/Guest account form on checkout page is not submitting on pressing Enter key\n    - #1089: Fixed error on order confirmation page when order status is updated\n    - #977: Fixed search panel issue on room type page when hotel is disabled\n    - #968: Fixed display issue with the amenity block in page load/reload in the home page\n    - #917: Fixed order currency symbol changes on currency change event on order confirmation page.\n    - #886: Fixed if amenities are not present then amenity filter at search results page should not be visible\n    - #845: Fixed address issue on voucher deletion from cart dropdown on checkout page\n    - #800: Fixed wrong Amenities block height on landing page in mobile view\n    - #787: Fixed if searched order reference has multiple orders then same rooms are displayed for each order on guest history page\n    - #773: Fixed PHP warning for key 'id_country' on search results page\n    - #772: Fixed phone number can not be edited during guest checkout\n    - #746: Fixed PHP warning due to occupancy query parameter in URL when generating canonical redirect URL\n\n## Core:\n- Improvements:\n    - #1142: Optimized the flow of the blocknewsletter module\n    - #1194: Updated optimized dataForFrontSearch function\n    - #1217: Added changes in core algo for managing booking for hourly basis\n    - #1173: Updated the Meta data for the index page on install, and also updated some non translated text for some languages.\n    - #1021: Improvement in the block navigation link module regarding CMS pages.\n    - #960: Updated installation page design changes.\n    - #1200: Updated price Rounding process improved in entire QloApps system\n    - #1174: Updated helper tree | Created a new helper tree class for generating tree\n    - #1161: Updated id_address_delivery is now set as 0 by default\n    - #1156: Updated the demo data added to the database for the QloApps on installation.\n    - #1141: Updated default invoice will be shown even in case of b2b invoice\n    - #1140: Updated the hero image and its upload process.\n    - #1111: Updated installation Assistant translations\n    - #1109: Updated decimal digits maximum limit is removed from price validation by Validate::isPrice()\n    - #1098: Updated validations for the occupancy of the room type for max occupancy of guest\n    - #1084: The google maps will now display the map icon for the hotel locations.\n    - #1079: Updated positions of Installer Assistant footer buttons\n    - #951: Added values for columns 'price_calculation_method' and 'price_addition_type' for demo service products.\n    - #1062: Updated htaccess files comptible with apache 2.2 and 2.4\n    - #1040: Updated Qloapps cleaner | Added hook for data cleaning in other module and fixed incorrect data being deleted.\n    - #972: Improved Algo for response data and format\n    - #950: Updated get localization pack details from qloapps api\n    - #949: Updated version request while downloading language pack\n    - #892: Updated use different prefixes for demo room numbers belonging to different room types\n    - #885: Updated address country of demo customer 'pub@qloapps.com' changed to website default country\n    - #871: Updated tax of room type will be applied to auto add services having price added to room price\n    - #842: Updated invoice tax panel content\n    - #862: Updated order cancelation successful mail content\n    - #861: Updated when translating text in QloApps only update the fields that are changed\n    - #858: Updated recommendation section update process\n    - #768: Updated change cookie key prefix to QloApps\n    - #783: Updated do not create multiple guest acounts with the same email, use previous one if available\n    - #780: Updated replace 'shop' and 'shopping' with 'website' and 'booking' in email templates\n    - #778: Updated add India to top countries in list of countries during installation\n    - #759: Updated function call corrected for room type price calculations\n    - #1221: Reuse existing HotelBookingDetail instance to avoid redundant object creation\n    - #1005: Renamed Partial payment accepted to Partial payment received.\n    - #908: Improved Order Status changes, Refund issues resolved and order and cancellation process improved\n    - #823: Updated text changes\n    - #821: Removed Password field from new account email sent to customer on registration\n    - #810: Updated Use datepicker plugin to format dates using $.datepicker.parseDate() wherever applicable\n    - #804: Updated flow of blocknewsletter module\n    - #744: Updated set default customer group to Customer when transforming Guest account\n    - #1193: Updated hr.xml\n    - #1131: Removed non required emails from the order status template list\n    - #728: Removed unused module folders from themes/hotel-reservation-theme/\n\n- Bugs Fixed:\n    - #717: Fixed DataForFrontSearch to dataForFrontSearch\n    - #1260: Fixed jquery chosen, select and tinymce plugins used images not visible in different admin theme\n    - #1255: Fixed Localization pack not updating from correct resource during QloApps installation\n    - #1253: Fixed admin is able to select empty country during QloApps installation\n    - #1250: Fixed Categories for demo service products are not created correctly on installation.\n    - #1148: Fixed welcome voucher is available for every customer and also for guest user\n    - #1090: Fixed cart rule restricted to a single customer is accessable to all customer when group restriction is applied\n    - #867: Fixed when customer age is not available then it is considered 60+ age as default\n    - #820: Fixed errors set from hook 'actionBeforeAuthentication' are not checked before logging in a customer\n    - #765: Fixed same voucher code is generated for same customer when auto-generating voucher\n    - #1205: Fixed the undefined variable issue in payment module.\n    - #1203: Fixed invalid auto-added service prices when multiple rooms are added in cart or service is disabled or removed from catalog.\n    - #1202: Fixed service not visible in booking when service is deleted from catalog after order\n    - #1190: Fixed trying to access array offset on value of type bool in cacheMainDomainForShop() in ShopUrl.php\n    - #1162: Fixed hotel permission are not being created for new hotels.\n    - #1153: Fixed partial cart rule not creating when using multiple coupons in a single cart\n    - #1147: Fixed unable to find correct files for translating pdf and mail files\n    - #1136: Fixed cancelled room service is visible when same room is added again in order\n    - #1107: Fixed cookie not saving in browser when '+', '&', ')', '(' characters exists in Base URL\n    - #1104: Fixed order-opc page not opening when installed QloApps in Čeština (Czech) language\n    - #1100: Fixed calendar opens for pervious month of max order date is for current month\n    - #1097: Fixed issues in Refund management flow and Improved Order cancellation flow\n    - #1095: Fixed multiple coupons gets removed from cart when currency is changed\n    - #1054: Fixed when Order status set as cancelled the rooms are not set is_cancelled=1 in the htl_booking_detail table\n    - #1027: Fixed cart rule does not show under available coupons when cart rule is created from refund request\n    - #1018: Fixed notices and display issue when there is no rooms and no hotel available.\n    - #964: Fixed room type categories were not updated when hotel name or location is updated\n    - #945: Fixed data changes are not reflected when using the QloApps cache option\n    - #931: Fixed js issue due to map if Google Maps API key is set and hotel location is not set\n    - #921: Fixed pricing issue in order confirmation email\n    - #909: Fixed missing translation from the templates of the modules.\n    - #906: Fixed when no tax is applies on room extra services, service tax column is shown empty in invoice\n    - #903: Fixed smarty index.php in smarty cache and compile directory gets deleted when clearing cache\n    - #895: Fixed overbooking issues in QloApps and added new configurations for overbooking handling\n    - #872: Fixed invalid tax details in invoice and credit slips\n    - #857: Fixed exception while order crteation when country sent from API is not active in QloApps\n    - #848: Fixed wrong prices entered in order_detail table when \"Round Type\" setting is \"Round on each item\"\n    - #843: Fixed friendly URL for search results page can not be changed\n    - #1181: Fixed missing error message for OpenSSL extension during install system check step\n    - #756: Fixed cancellation charge amount is incorrect if order currency is other than default currency\n    - #752: Fixed file '/cache/smarty/compile/index.php' gets deleted when clearing cache causing warning on Configuration Information page\n    - #745: Fixed link::getMediaLink() not used for invoice logo\n    - #734: Fixed new voucher does not create for the remaining amount of the voucher even when Partial Use option is enabled\n    - #732: Fixed Fatal error: Uncaught Error: Class 'HTMLPurifier_Config' not found when enabling HTMLPurifier library\n    - #1220: Fixed apple-mobile-web-app-capable deprecated\n    - #722: Fixed Fatal error when set Awaiting Payment order status as logable and creating partial payment\n\n## Web Services:\n- Improvement:\n    - #1198: Optimized Hotel Room Type Availability and rates search webservice\n    - #1247: Added Phone number field in the customer API.\n\n- Bugs Fixed:\n    - #1175: Fixed issues in the Webservices.\n    - #855: Fixed issues in getting(GET), creating(POST) and updating(PUT) hotel by hotel API\n    - #720: Fixed issues in response of Availability & Rates search API for partial available rooms\n\n\n####################################\n# V1.6.0\n####################################\n\n- Added Features:\n  - #538: Added Feature service products\n  - #516: Added \"Channel Manager Connector\" module to QloApps\n  - #643: Add module Dashboard Insights to admin dashboard\n  - #475: Added occupancy wise search and occupancy wise booking\n  - #449: Added Modules catalog page\n  - #370: Added PayPal Payment in QloApps\n  - #370: Added Autoupgrade addon: Upgrade QloApps to latest available version\n  - #463: Add 'Operations Today' section on admin dashboard\n  - #435: Minimum and Maximum Length of stay restriction for room types\n  - #449: Added smart addons recomendation section\n  - #531: Admin can upload check-in documents\n  - #456: Admin can add or remove new links on Hotel Reservation System > Settings page\n  - #343: Employee can access the site in maintenance mode\n  - #459: Security update: Allow admin to configure the SameSite cookie attribute\n  - #589: Added cancellation policy section on admin order view page\n  - #479: Added preparation time for bookings\n  - #454: Customer can now create booking for someone else.\n  - #593: Guest transformation to customer during registration at front office\n  - #490: Added \"Hotel Availability and Rates search API\" to QloApps\n  - #375: QloApps can now be installed without demo data\n\n\n- Back Office:\n  - Improvements:\n    - #351: Add hotel address selection on map using marker at back office\n    - #449: updated dashboard\n    - #337: Removed delivery column and added full name to customer column on order list page at back office\n    - #345: Add room type duplication feature\n    - #346: Remove unused room status from room type edit page\n    - #347: Improve back office logos\n    - #354: Remove Google Maps api from order detail page at back office\n    - #355: Added upper limit of PHP for QloApps installation\n    - #357: Remove module config links from Hotel Reservation System > Settings page\n    - #376: Remove global price option when not needed from additional facilities…\n    - #380: Add error messages for missing tests on Configuration Information page\n    - #383: Remove Catalog > Tags page and Tags field from room type edit page\n    - #388: Removed unused field minimum quantity from Specific price\n    - #395: Load KPIs data using ajax on page load at back office\n    - #405: \"BO: Fix datepicker issues, calendar improvement and update admin theme sass files\n    - #409: Change Feature Price name to Advanced Price Rule\n    - #423: Improvement: Booking carts controller in Back-office\n    - #451: Improve statistics at back office\n    - #453: Remove Booking Information tab from room type edit page at back office\n    - #453: Remove Booking Information tab from room type edit page at back office\n    - #464: Implement Additional Facilities tab in AdminProductsController instead of using hotelreservationsystem module hook\n    - #471: Move filter options to Preferences > Room Types page\n    - #478: Update admin book now page design | added fullcalender\n    - #485: Update default checkout date on order view page at back office\n    - #509: Added: SQL_MODE for allow invalid dates in db backup\n    - #515: Optimize: Module suggestion listing process\n    - #522: Updated: Book now page calender view\n    - #526: Update refund option and orders state mangement\n    - #551: Updated best selling rooms and most viewed rooms statistics\n    - #555: Removed: unused category KPIs\n    - #563: Change Geolocation data file link at back office\n    - #571: Remove Order Restrict link from Hotel Reservation System > Settings page\n    - #580: Updated: removed unused configuration options from admin catagory tab\n    - #581: \"Updated admin service product configuration in SEO, Prices and association tabs\n    - #582: Removed selected extra services list from current cart in backoffice book now\n    - #586: Update Dashavailability graph\n    - #594: Remove unused fields from Catalog Price rule\n    - #607: Updated: Service products pop-up modal in admin order view page\n    - #611: Updated: added complete booking info in admin booking carts tab\n    - #623: Added: access restriction according to hotel in admin search page\n    - #629: Enable custom handler for backoffice.\n    - #632: Update disable dates selection for a room at back office\n    - #633: Update hotel review view page at back office\n    - #639: Update refund request view page at back office\n    - #653: Updated: Additional facilities panel in admin room type page\n    - #655: Updated: compiled admin theme css from sass\n    - #674: Add label for Length of Stay graph on dashboard\n    - #678: Removed: \"go to payment page\" option from admin order create page when creating order for backdate\n    - #535: Added : autocomplete parameter to date and datetime options in admin render form\n    - #429: Price modification while new order creation at back office\n    - #696: Updated: Manage room type default configuration and advance payment form options\n    - #697: Removed: In the manage category page removed description column from list\n    - #704: Updated: Data in admin refund request, corrected data in rooms refund detail table.\n\n  - Bugs Fixed:\n    - #314: Resolve HelperList filter issue\n    - #340: Resolved a fatal error when forwarding a discussion to another employee on the Customer Service page.\n    - #358: Resolve order total invoice issue on backoffice orders page.\n    - #359: Resolve 'Revenue' amount issue on admin dashboard\n    - #360: Resolve specific price list issue on room type edit page\n    - #361: Correct outgoing search links on search page at back office\n    - #368: Resolved issue when preview template in backoffice order status page\n    - #369: Resolved customer thread not forwarding to another employee from backoffice customer service\n    - #378: Fix ConfigurationKPI values issue when adding a new language\n    - #379: Fix controller access denied page design\n    - #382: Resolve undefined index issue on Order Restrict update form\n    - #389: Prevent Admin or employee from adding rooms in order other than rooms of current hotel in order\n    - #391: Updated dashboard structure | Fixed dashboard widget\n    - #396: Fix PHP notice issue when accessing unavailable objects on admin controller\n    - #407: Fix loading of unnecessary media files on Manage Room Types page\n    - #408: Fix tpl path issue on Manage Room Types page\n    - #411: Fix admin login page design issue\n    - #412: Resolve dashboard design issues\n    - #413: Fix date formats at back office\n    - #421: Fix rooms addition to a room type issues at back office\n    - #428: Fix PHP notice issue for key `stage_name` on order view page at back office\n    - #434: Fix employee avatar not showing at back office\n    - #439: Fix module reset options popup issue on Modules & Services page\n    - #444: Fix undefined variable issue at Hotel Interior Block settings page at back office\n    - #455: Fix Book Now page at back office\n    - #461: Fix currency update issue on order creation page at back office\n    - #466: Resolve issue when total order paid amont is in negative\n    - #473: Fix database exception issue on Book Now page at back office when multiple QloApps installations are present on the same domain\n    - #481: Fixes module not installing from new catalog page\n    - #486: Fix undefined variable issue on admin dashboard\n    - #495: Added: missing re-allocation pop-up and improved design in book now page\n    - #496: Fix warning when tab_modules_list is empty\n    - #502: Fix Division by zero\n    - #510: escape: unsupported type: UTF-8 - returning unmodified string\n    - #513: Fixed Undefined property: $toolbar_btn\n    - #523: Fixed: incorrect payment amount adding from addOrderPaymentDetail\n    - #525: Fixed: Download module error showing when checking for update on manage module page\n    - #537: Fix bug in order refund request process at front office\n    - #540: Fixed: totalAvailableRooms warning issue resolved on room detail page\n    - #542: Resolved: advance price rules validation issue\n    - #544: Resolved: bad sql query issue when assigning features to the hotel\n    - #547: Resolved: Db exception on qlocleaner integrity check\n    - #549: Resolved: issue on free order and room reallocation\n    - #554: Resolved: room status update issue from active to inactive.\n    - #554: Resolved: room status update issue from active to inactive.\n    - #560: Fix guests count in Operations Today panel of Dashboard\n    - #564: Fix Stats > Stats page issues\n    - #565: Fix incorrect value of Purchased References KPI\n    - #566: Fix Unknown customer age on Stats > Stats page\n    - #567: Fix Direct Revenue Ratio (DRR) on dashboard\n    - #568: Fix room add/edit issue on order from back office\n    - #573: Change catalog evaluation module and fix stats issues\n    - #574: Fix: Services price not including in cancelation charges.\n    - #575: Resolved: Issue while adding room in order for deleted customer\n    - #577: Resolved: Backoffice ajax loader does not stop after closing dashboard recommendation\n    - #578: Fix Customers KPI on Customers page\n    - #579: Resolved: Exception on admin book now page after cleaning cart data\n    - #587: Update guests count in Operations Today on dashboard\n    - #588: Resolved: Issue while exporting service products and booking carts\n    - #591: Fix can not create order from Customers > Booking Carts page\n    - #597: Fix filter issues on Assign Hotel Features page at back office\n    - #599: Fix js errors on admin book now page\n    - #602: Fix Add new buttons display issue at back office\n    - #612: Resolved: hotel tagline and short description wrong format\n    - #616: Resolved: Mulitple hotel cover image created when uploading multiple images\n    - #625: Fixed: book now page calender does not show searched date month\n    - #628: Fixed: Inconsistent price for facilitiy in room row and pop-up modal in admin orders view page\n    - #640: Fix order room dates edit issue at back office\n    - #641: Fix ajax error on login page at front office\n    - #642: Fix: Admin is able to add rooms in order without selecting occupancy\n    - #647: Fix order creation without address at back office\n    - #662: Fix: Module update error when uploading zip without db changes\n    - #666: Fixed: backoffice header toolbar buttons not visible on some pages\n    - #667: Fix: Syntax issus on admin import page.\n    - #670: Updated: Admin room type services and facilities panel text issues and undefined index issue\n    - #671: Fix dashinsights comparison graphs issue\n    - #675: Fix Average Occupancy Rate issue on dashboard\n    - #676: Fix 'Best hotels' and 'Best-selling room types' issues on Stats > Stats page\n    - #681: Fixed: Incorrect price of room when admin adds room in order and room have auto add services\n    - #694: Resolve: errors while adding new hotel\n    - #695: Fixed: dashboard  graphs errors when data set is empty\n    - #701: Resolve: Address not updating on admin address and order page.\n\n\n- Front Office:\n  - Improvements:\n    - #336: Remove order history link for guest account holders on order confirmation page\n    - #367: Updated meta generator tag to QloApps\n    - #377: Add check-in and check-out time on room type detail page\n    - #385: Improve front office header\n    - #387: Add nav bar and move language and currency selector at top at front office\n    - #400: Updated booking form on room type detail page\n    - #403: Add maps to search results and room type detail pages\n    - #410: Add hotel images under room information on room type detail page\n    - #474: Remove unwanted js and fix room search issues on room type detail page\n    - #484: Reviews module: Show updated helpful count when marking a review helpful\n    - #505: Updated tax view in cart popup\n    - #536: Remove address deletion code from front office\n    - #545: Added: check in - check out label on room type page\n    - #548: Updated search result page booking option view\n    - #550: Updated QloApps search panel design\n    - #596: Remove refund ID column on refunds list page at front office\n    - #624: Fix: Dropdown displaces on search result page when adding children in room\n    - #630: Update navigation menu at front office\n    - #631: Added: Missing vat number field in customer address form.\n    - #634: Show room maximum occupancy on search and room type page\n    - #635: Update: datepicker dates background color for dates between date-from and date-to\n    - #664: Improved occupancy dropdown on search result page\n    - #682: Updated: order summary in block cart popup and dropdown\n    - #687: Add default contact phone and email at front office nav bar\n    - #698: Fixed: occupancy dropdown input not alligned with adjacent input\n    - #699: Fix: service product quantity getting updated incorrectly from order OPC page\n    - #705: Replaced: view voucher and credit slip button with voucher code and id credit slip\n    - #706: Added: address update success message\n\n  - Bugs Fixed:\n    - #348: Resolve auto page scroll issue on order history page\n    - #362: Resolve room type name font issue at room type detail page\n    - #373: Fix wrong search results page url causing SQL error\n    - #390: Resolve rooms left count issue on cart update on room type detail page\n    - #397: Fix PHP notice issue on room type detail page\n    - #414: Fix guest can not edit personal info on checkout page issue\n    - #417: Resolved address issue on contact page for list and map\n    - #419: Fix hero image cache issue\n    - #482: Fix PHP error on passing wrong dates in URL\n    - #483: Resolved: logo visible bigger than recomended size in default theme\n    - #504: Fix ajax page not found issue on room type detail page\n    - #518: Fixed: User input in location field in search panel get replaced by hotel location\n    - #541: Resolved: hotel image issue on room type page\n    - #552: Resolved: guest order detail page issue\n    - #553: Resolved: PHP warnings on the refund request\n    - #556: Resolved: service product url issue\n    - #558: Fix order cancel request issue\n    - #570: Fix maps issue on room type detail page\n    - #576: Fix cart rule applied icon issue on checkout page\n    - #598: Fix PHP issue on front pages\n    - #603: Fix children age selection error with occupancy booking at front office\n    - #605: Resolved: Service producs all images not visible in front office\n    - #606: Updated: Hide service product prices in catalog mode.\n    - #615: Resolved: Order restrict error is displayed multiple time on checkout page\n    - #617: Resolved: unable to create refund request\n    - #626: Fixes: Unable to view or save customer address from front office\n    - #638: Close occupancy dropdown on clicking book now button\n    - #649: Fix: Occupancy panel does not close when clicking on add to cart button\n    - #651: Fix: imgaes index not defined for services on room type page in front office\n    - #652: Fix: Booking form does not get update when occupancy is not provided\n    - #654: Fix: Booking form refresh when occupancy dropdown is opened\n    - #663: Fixed: Errors on guest tracking page\n    - #668: Fixed: Error on search result page when updating invalid occupancy in URL\n    - #672: Updated: Disable option to add services when rooms are unavailable\n    - #677: Fix image display issue on homepage\n    - #679: Resolved: Error on landing page when updating page view count using data mining module\n    - #680: Fixed: Datepicker not initializing on initial load of room type page with preperation time\n    - #683: Updated: Fixed chekcout page auto add service breakdown tooltip incorrect content\n    - #685: Update default number of rooms on room type detail page to 1\n    - #700: Fix: quantity does not change on room type page booking form\n    - #703: Resolved: booking details message block issue\n\n\n- Core\n  - Improvements\n    - #372: Add hooks actionSubmitIdentityBefore and displayCartRoomImageAfter\n    - #418: Add hooks displayAdminAddHotelFormTab and displayAdminAddHotelFormTabContent\n    - #332: Updated demo link in readme file\n    - #334: Remove install.sql files from modules\n    - #338: Replace booking type integer values with class constants\n    - #353: Remove smarty modifiers json_encode and json_decode | change in deprecation message\n    - #356: \"Moved hotelreservationsystem \"\"actionvalidateorder\"\" to core function \"\"validateorder\"\"\n    - #364: Remove theme 'default-bootstrap'\n    - #365: \"Update Readme - PHP, MySQL and Required PHP extenstions\n    - #366: Updated core upgrade files and modules upgrade files\n    - #371: \"Updated tax flow, Taxes are now calculated based on hotel address\n    - #381: Change demo city name from DefCity to Demo City\n    - #401: Remove unused modules\n    - #402: Change module category for modules graphnvd3 and hotelreservationsystem\n    - #404: Update PaymentModule.php\n    - #415: Removed qlo_mod_list.xml\n    - #420: Remove unused code and data from module hotelreservationsystem\n    - #426: Replace _PS_MODULE_DIR_ with $this->_path in 'wkroomsearchblock' module\n    - #430: Updated QloApps order statuses\n    - #432: Updated Language pack resource will be downloaded from QloApps\n    - #443: Remove Google+ URL from blocksocial module\n    - #447: Improvement of cart rule applied on orders and room types\n    - #458: Replace module 'productcomments' with 'qlohotelreview'\n    - #460: Remove characters limit of 128 for hotel fields 'map_formated_address' and 'map_input_text'\n    - #467: Removed multiple address option\n    - #468: Update image generation method for hotel and default modules\n    - #469: Enable Re-display cart at login by default\n    - #476: Use object methods save() and delete() for classes HotelCartBookingData and HotelBookingDetail\n    - #477: Update api endpoint and request data\n    - #500: Improve order refund flow\n    - #519: Improved: Enable ssl configuration during installation\n    - #521: Updated occupancy dropdown\n    - #527: Fix CLI install issues\n    - #528: Update licenses\n    - #532: Change demo content for CMS page Legal Notice\n    - #657: Allow checkout process classes to be overridden\n    - #669: Updated: text translations call variable assigned to javascript\n    - #688: Update CONTRIBUTING.md\n    - #689: Update SECURITY.md\n    - #690: Update README.md\n    - #431: Added gitignore file\n    - #692: Updated: Recomendation section update and render process\n    - #342, #363, #436, #462, #470, #480, #543, #546, #561, #562, #569, #595, #618, #644, #658, #673, #686: Text related changes throughout QloApps\n\n  - Bugs Fixed\n    - #329: PHP Version issue in Install of QloApps 1.5.2\n    - #394: Fix hotel city access method as introduced in tax flow changes\n    - #416: Resolved wrong address while creating new booking\n    - #425: Fix owl-carousel plugin loading issue for 'wktestimonialblock' module\n    - #433: Fix Webservice count() issue\n    - #438: Fix page scroll issues at order history and order view page\n    - #448: Resolve multiple hotel room booking from single cart\n    - #452: Fixed: count() function use issue in WebserviceOutputJSON.php\n    - #514: Resolve: Occupancy wise search feature issues\n    - #520: Fix order confirmation email issue\n    - #534: Fix installation issue of missing data\n    - #557: Fix js minification issue for file 'js/daterangepicker/moment.min.js'\n    - #559: Change link in credit slip email\n    - #583: Resolved: Unable to add room in cart from front and backoffice\n    - #584: Resolve: Inactive auto add service price still gets added to room price\n    - #585: Updated: depricated call for array_key_exists to property_exists for object\n    - #592: Resolved: Incorrect advance payment amount when discount is greater than advance payment\n    - #604: Resolved: service products can still be added multiple times when configuration is disbled\n    - #608: Fix: Unable to remove disabled services from cart\n    - #609: Resolved: Cannot create booking with srevice produsts in cart\n    - #610: Resolved: price not defined of service product when multiple rooms are bought in order detail page\n    - #614: Resolved: Specific price does not apply base on priority\n    - #621: Resolved: Catalog discount is not visible when auto add service is attached to room type\n    - #627: Fixed: Order summary in order confirmation page and order confirmation e-mail\n    - #659: Prevent required categories deletion by data cleaner module\n    - #660: Fix: cover image index not defined while generating invoice\n    - #665: Fix: Qlocleaner \"fix integrity constraint\" deletes valid additional facilites\n    - #684: Fix PHP warning issue in catalog mode\n    - #645: Added: checkoutProcess directory in override/classes\n    - #693: Fix: hotel not getting added in hotel profile access table\n    - #702: Update: Order invoice pdf, changed totals summary details.\n    - #715: Fix PHP warning on order checkout page at front office\n\n\n- Web Services:\n    - Improvement:\n      - #529: Fixed: API issues in order creation from webservice request\n\n    - Bugs Fixed:\n      - #517: Fixed: Incorrect id_guest in cookie after login\n      - #452: Fixed: count() function use issue in WebserviceOutputJSON.php\n\n\n####################################\n# V1.5.2\n####################################\n\n## Added Features:\n- #264: Added SECURITY.md file.\n- #313: Update for module upgrade and suggestion\n\n\n## Improvements:\n- core\n  - #240: Updated TCPDF library\n  - #242: Changes for PHP7 compatibility\n  - #243: Removed pclzip library\n  - #244: Removed pear JSON lib instead use PHP JSON library\n  - #245: Updated swift mailer\n  - #246: Updated htmlpurifier\n  - #247: Updated Smarty library\n  - #249: Updated Sql Parser Library\n  - #250: Updated Pear and Archive tar library\n  - #267: Removed mysql support, pdomysql now required\n  - #269: Replaced mcrypt with openssl\n  - #272: Changed default DB prefix to qlo_\n  - #276: Paypal and PaypalUSA module removed\n  - #290: Updated path for including css and js in modules | Moved plugins to core js folder\n  - #299: Added composer.json file\n\n- Front Office:\n  - #296: Improved Social Sharing module\n  - #316: Display Room Capacity on room type detail page\n\n- Back Office\n  - #297: Changed import button icon on Localization page\n  - #310: Dashboard improvement\n  - #327: Resolved QloApps dashboard issues\n\n\n## Bug Fixed:\n- core:\n  - #238: Update date format in invoice according to format provided in language\n  - #253: Using room status as constants instead in values\n  - #270: Using room availability status as constants instead in values\n  - #273: Fixed date format for additional facilities in invoice\n  - #281: Resolved smarty html comments issue.\n  - #283: Invalid value inserted in 'special_days' field in htl_room_type_feature_pricing table through API\n  - #284: Resolved: No validation for the fields in 'hotel_refund_rules' API for add and update.\n  - #285: Resolved: No validation for the fields in 'hotel_features' API for add and update\n  - #286: Validations added for 'password' and 'email' fields for the 'employees' API.\n  - #287: Resolved fatal error while generating class index file\n  - #288: Resolved: No validation for field 'id_parent in' in 'categories' API.\n  - #289: Validations added to the fields of \"bookings\" API for POST / PUT API requests\n  - #307: Cart and Order API Issues resolved\n  - #312: Text issues solved\n  - #321: Fixed QloApps installation issues\n  - #324: Resolved compatibility issue with php5.6\n\n- Back Office:\n  - #255: Fixed filter by Due amount results in \"Bad SQL query\"\n  - #259: Fixed room reallocation availability list for temporary unavailable rooms\n  - #256: Fixed Swap rooms leads to reservations duplications\n  - #251: Removed unused options from images controller\n  - #271: Fixed syntax issue in admin information cont\n  - #275: Resolve order total update issue on additional facilities update\n  - #282: Order refund states 'Refunded' and 'Denied' should not enabled together from render list\n  - #293: Add profile access restriction when adding room types\n  - #294: Resolve order edit issues, Added hooks in order edit process\n  - #303: In 'Manage Hotel' Controller, validation added for 'check-out time must be before check in'\n  - #304, #315: Text change.\n  - #318: Resolve multiple rooms addition issue on AdminOrdersController\n  - #320: Resolved new room features automatically mapping to all the room types\n\n- Front Office:\n  - #252: Update function getRoomBookingData\n  - #268: Update blockrss module\n  - #277: In _DB_PREFIX__orders table column advance_paid_amount value is wrong\n  - #280: Wrong amount displayed in Order confirmation page in the payment gateways PaymentReturn Hook\n  - #291: Resolved: Wrong price return by advance payment functions in HotelAdvancedPayment class\n  - #295: Resolve DNI field issue during guest checkout\n  - #298, #274: QloApps text changes\n  - #300: Room amenities name shown with feature icon in room type details page\n  - #301: Unused CSS file htl-reservation-general.css and its classes are removed\n  - #302: Resolved: On translating page checking and checkout dates are changed to NaN-NaN-NaN\n  - #305: Resolve tab design issue on room type detail page\n  - #317: Resolve jQZoom issue on room type detail page\n  - #319: Resolved smarty minify HTML issue\n\n\n####################################\n# V1.5.1\n####################################\n\n## Added Features:\n- Core:\n  - #208: \"Catalog Mode\" option added by which user can view room details but not abe to create booking\n\n\n## Improvements:\n- Back Office:\n  - #206: Removed Other Modules setting from admin Hotel Reservation System -> Settings\n  - #200: Removed shipping option from car rule condition.\n  - #199: Removed \"Display suppliers and manufacturers\" and \"Display best sellers\" options from Admin Preferences controller\n  - #193: Removed Payment Modules setting from admin Hotel Reservation System -> Settings\n  - #189: Moved hotel selection from configuration tab to information tab\n  - #179: Added hotel column in room type feature pricing list\n  - #177: Removed multishop option\n  - #149: Removed carrier column from Booking Carts Controller\n  - #183: Added hotel name along with room name when adding filter of room type for cart rule\n  - #204, #196, #182: Text Changes\n  - #110, #111: Code Optimization\n\n- Core:\n  - #223: getHotelCartBookingData() : function multiplication optimized\n  - #225: HotelRoomTypeFeaturePricing.php optimized (Removed unused variables, removed static values assigned)\n  - #218: Added hotel name column in order confirmation mail and invoice.\n  - #210: CMS page Delivery is not valid for hotel industry. So changed it to Policies page\n  - #205: Prevent deleting profile which is used by at least one employee\n  - #214: blockcart module :: Removed unused hooks displayLeftColumn and displayrightColumn\n  - #180: license file name changed from LICENSES to LICENSE\n  - #181: Readme file improvements with more information and links\n  - #221: dataforfrontsearch() function now calculate and provide \"feature_price_diff\" value in response\n  - #175: Changed QloApps versioning system (Ex: X.X.X.X)\n  - #175: Updated module compatibility check with QloApps version\n  - #215: \"hotelreservationsystem.php\" code optimization in hook \"actionValidateOrder\"\n  - #117, #118, #119, #120, #121, #122, #134, #137, #138, #139: Changes for PHP7 compatibility\n  - #178: Text Changes\n  - #198, #226: Multiple hooks are added in the different QloApps core files\n  - #217: `auto_generated` column in `address` table added to track address creation source\n  - #207: New order states 'Partial payment accepted' and 'Awaiting partial payment' added for the partial payment\n\n- Front Office:\n  - #222: Disabled mobile keyboard pop up when using date-picker in home search\n  - #208: Room type listing on search result page moved to different template \"room_type_listing.tpl\"\n  - #185: Replaced star rating plugin with jquery Raty in Product Comments module\n  - #156: \"product.js\" code multiplication optimized\n  - #215: \"ajax-cart.js\" add validation\n  - #125, #127, #141, #142: Changes for PHP7 compatibility\n  - #187: Display voucher name along with voucher code on order page\n\n\n## Bug Fixed:\n- Back Office:\n  - #211: Errors on cart rule page when add room type, which is not assigned to hotel, selected in room type condition\n  - #197: wrong theme information is displayed at Preferences -> Themes admin controller\n  - #195: Filter by position in the render lists of admin controllers\n  - #194: Entering wrong discount while Group creation, page redirects to list page\n  - #192: Using filter in customer Group list, page redirects to previous list\n  - #189: Room Type associations with its hotel parent category\n  - #176: Birthday input field width in Helper Form\n  - #173: Undefined varaible issue Manage Order Refund Request Controller\n  - #171: Multiple request on single click in Helper List\n  - #160: \"Access Denied\" issue when an employee other than super admin create a new room.\n  - #168: Room number not updating after room reallocation and swap\n  - #162: Additional facility price changes for room type after saving\n  - #147: Creating order status without entering \"status name\", page redirects to blank page\n  - #148: Creating order refund status without entering \"status name\", page redirects to list page\n  - #229: Resolved undefined variable error in Manage Order Refund Request Controller\n\n- Front Office:\n  - #212: Design issue of select in the ADDITIONAL FACILITIES if text exceeds from block in the product detail page\n  - #209: Errors on the search result page: If new group is created and only this group is assigned to the customer\n  - #203: Guest is unable to submit Refund Request again after entering invalid Refund Reason once\n  - #158: Hotel selection in search panel for mobile devices\n  - #169: Wrong price displayed when booking from 1 march to 30 march\n  - #151: Room search check-in && check-out don't change when friendly URL is disabled.\n\n- Core:\n  - #186: Links in mail for my-account, guest tracking and my orders pages are now localized to customer language.\n  - #109: updated invalid varaible \"pshone_mobile\" to \"phone_mobile\"\n  - #202: \"global.css\" added missing class for aligning images left and right in discription\n\n\n####################################\n# V1.5.0\n####################################\n\n## Added Features:\n\n[+] CO : QloApps APIs are created (Prestashop APIs are modified as per hotel QloApps changes)\n[+] CO : `is_advance_payment` column is added in the 'cart' table.\n[+] CO : `is_advance_payment`, `advance_paid_amount` columns are added in the 'orders' table.\n[+] CO : `id_transaction`, `payment_mode`, `refunded_amount`, `by_admin` columns are added in the 'order_return' table.\n[+] CO : `id_order_return_detail`, `id_htl_booking`, `refunded_amount` columns are added in the 'order_return_detail' table.\n[+] CO : `send_email_to_customer`, `send_email_to_superadmin`, `send_email_to_employee`, `send_email_to_hotelier`, denied`, `refunded`, `module_name` columns are added in the 'order_return_state' table.\n[+] CO : `customer_template`, `admin_template` columns are added in the 'order_return_state_lang' table.\n[+] CO : `id_htl_booking` column is added in the 'order_slip_detail' table.\n[+] CO : Refund emails will be sent to the customer as per return state setting\n[+] CO : All images link are now generated dynamically\n\n[+] FO : Room type refund policies in the policies tab is shown in the room type details page.\n[+] FO : A controller will be there for the customer which will show his refund requests info\n\n[+] BO : Admin can enable/disable refund for the hotel\n[+] BO : Refund Process:: Order return statuses improved for order refund statuses.\n[+] BO : Admin can select rules for the hotel [checkboxes]\n[+] BO : Admin can initiate refund if refund is enable for the system\n[+] BO : Admin can select which state is considered as refunded complete in the return state.\n[+] BO : Admin can select which state is considered as refunded denied in the return state.\n[+] BO : Admin can select whcih email will be sent to customer and admin for the return state.\n\n[+] BO : Feature Price Rule: Groups wise Condition in feature price rules is added.\n[+] BO : Global refund policies cms page can be selected from refund rules controller.\n[+] BO : Refund can be enabled/disabled globally from refund rules controller.\n[+] BO : Payment mode and transaction id can be saved for the refund.\n[+] BO : Voucher slip can be generated for refund.\n[+] BO : Credit slip can be generated for refund.\n[+] BO : Additional facilities can be edited at the time of order editing.\n[+] BO : Room type features images are used as jpg images in place of png images.\n\n\n## Improved/changed features:\n\n[*] BO : Refund Process:: Order return statuses improved for order refund statuses.\n[*] BO : In Additional Facilities list no price will be shown if facility have advance options.\n[*] BO : Admin will be able to select a checkout date while changing status of the room from order details page.\n[*] BO : Hotel category will be selected Default room type category.\n[*] BO : In Room type renderlist hotel(instead of category), city, number rooms, adults, Childs columns added.\n[*] BO : Merchandise Return tab is removed.\n[*] BO : Room type ids now start room type id from 1 in room type render list.\n[*] BO : Prestashop warning pop up will nt be shown during module installation for Webkul modules.\n[*] BO : Updated addons link from store to addon's page\n[*] BO : Added recomended image size for room type images for appropriate view on front end.\n\n[*] FO : Calendar Design is improved of date from and date to in QloApps.\n[*] FO : 'Proceed' button during checkout will be disabled in case of errors while checkout.\n[*] FO : Search panel is improved on all pages.\n[*] FO : Cart warning text changed\n[*] FO : Refund request proocess is improved for the customer. Designed is also improved.\n\n[*] CO : paypal adaptive module (by webkul) Removed completely from qloapps\n[*] CO : All the irrelevant data creation from the installation process is removed Which is not related to Qloapps but Prestashop. e.g  carriers, stores, suppliers, manufacturers...... etc. Order data will not be populated now.\n\n[*] CO : For refund request \"order_return\" and \"order_return_detail\" tables are used.\n[*] CO : For order refund states \"order_return_states\" table is used.\n\n\n## Bug/Issues Resolved:\n\n[-] BO : FIXED : Room does not free even after room status set to checkout.\n[-] BO : FIXED : Room does not free while order status is changed to Refunded, Cancelled or Payment Error.\n[-] BO : FIXED : Additional facilities price id not managed while deleting a booking from admin order details page.\n\n[-] FO : FIXED: when using advance payment option, discount voucher (amount) get applied to advance payment amount along with total order cost\n[-] FO : FIXED : If all rows are disabled then also blocks (Interior, Rooms, Features, Testimonials) are visible on home page.\n[-] FO : FIXED : Zip code error while making the guest check.\n[-] FO : FIXED : Issue while creating a customer/guest from checkout page on firefox browser.\n[-] FO : FIXED : Check-out date same as check-in date when current data is more than max order date for hotel\n[-] FO : FIXED : customer able to process booking for inactive rooms\n[-] FO : FIXED : Image strech issue on product page.\n[-] FO : FIXED : Cart page not update when delete from from cart dropdown\n[-] FO : FIXED : While making the guest check out the system shows zip code error in some countries.\n\n[-] CO : FIXED : Fatal error: Uncaught exception 'ImagickException' while creating invoice.\n[-] CO : FIXED : warning while creating invoice (total demands variable issue)\n\n\n####################################\n# V1.4.1\n####################################\n\n## Added Features:\n\n[+] BO : Hotel wise employee permission management is added. now admin can give permission to his employees according to the specific hotel selections\n\n[+] BO : Additional facility : functionality is added at backoffice order creation process also.\n[+] BO : Additional facility : Tax can be applied on additional facilities.\n[+] BO : Additional facility : Per day price calculation option is added.[Price will be calculated on per day basis of the booking or for entire date range of the booking]\n[+] BO : Order Confirmation Email : Now admin can set to whom order confirmation email will be sent from Preferences -> orders tab.\n[+] CO : displayNavigationBottomHook hook added \"hotelcommerce/modules/blockuserinfo/nav-xs.tpl\".\n\n## Improved/changed features:\n\n[*] FO : Address details on Order details page is changed. Only details (name, email and mobile number) will be shown which we are showing to the customer at checkout page\n[*] FO : Address will not be shown to the customer while checkout process. edit link also removed from \"Guest Information\" section at checkout page.\n\n[*] BO : Option to delete one room in two default created rows in while saving rooms of the room type.\n[*] BO : unit price fields removed from backoffice room type creation page.\n\n[*] CO : blocknavigationmenu : Navigaion menu improved. All links are dynamic now.\n[*] CO : wkfooterexploreblock module is removed. All functionalities are merged with blocknavigationmenu module.\n[*] CO : Orders will be splitted now hotelwise. A new order will be created for each hotel.\n[*] CO : Trademark and powered by changed to webkul (from presatshop).\n[*] CO : Correct single quotes and double quotes of Class HotelBookingDetail.php\n[*] CO : Installed paypal module by prestashop by default while QloApps installation.\n[*] CO : Translations are improved.\n\n## Bug/Issues Resolved:\n\n[-] BO : Resolved : Room does not free even after room status set to checkout.\n[-] BO : Resolved : Infinite loop on Room type page while loading Booking Information tab.\n[-] BO : Resolved : Book now page showing error when current date is last date of the month.\n[-] BO : Resolved : Image is not showing while feature update (Catalog->features) and issue while updating feature.\n\n[-] CO : Resolved : As theme name was \"hotel-theme\". So on saving theme translations a new theme directory \"hotel-theme\" is created and translations are saved in this directory. now \"hotel-theme\" is replaced with \"hotel-reservation-theme\".\n[-] CO : Resolved : Feature price plans not working. [ Create two plans one for sunday and other for saturday. At the moment it's only showing the change/increase on Saturdays not Sundays. If I unable Saturdays it is showing the price change on Sundays and not Saturdays.\n[-] CO : Resolved : Order status is 'Payment Error' if payment is done by advance payment with real payment gateways.\n\n[-] FO : Resolved : blockcart and blocknavigationmenu modules swaps randomly at displayTop hook.\n[-] FO : Resolved : Disable dates of last room will be saved for all previous rooms while saving rooms of a room type.\n[-] FO : Resolved : Rooms are not visible when changing minimum price in filter by price.\n[-] FO : Resolved : Null quantity issue when check-in date and check-out dates are the same. When the date_from and the date_to passed in the URL parameter are identical they are accepted in the entries (Check-In Date & Check-out Date) on the room type detail page. Once we click on Book now pop up with \"Null quantity\" message appears.\n\n\n####################################\n# V1.4.0\n####################################\n\n## Added Features:\n\n[+] CO : Additional facilities functionality is added.\n[+] CO : Almost all updates added to QloApps till the prestashop version 1.6.1.23.\n\n\n## Improved/changed features:\n\n[*] CO : Tools::generateHtaccess() improved\n[*] CO : ($round = true) parameter added in Tools::convertPriceFull()\n[*] CO : Localization updated\n[*] CO : mails/en/product_download.txt bug resolved\n[*] CO : swiftMailer version updated to 5.2.2\n[*] CO : translations updated\n[*] CO : config/config.inc.php improved (smarty early inclusion)\n[*] CO : config/smarty.config.inc.php improved (smartyHook() return improved)\n[*] CO : Security: Use Mcrypt’s CBC mode instead of the ECB mode.\n\n[*] CO : Almost all improvements/changes features added to QloApps till the prestashop version 1.6.1.23.\n[*] BO : All Stats Module compatible with QloApps\n\n[*] FO : Room type details Page Design improved\n\n## Bug/Issues Resolved:\n\n[-] CO : Almost all bugs resolved in QloApps till the prestashop version 1.6.1.23.\n[-] CO : Resolved :: QloApps Compatible with MySQL 5.7\n\n\n####################################\n# V1.3.2\n####################################\n\n## Added Features:\n\n[+] CO : pscleaner module is added for cleaning demo data from QloApps.\n\n[+] FO : Option for Guest checkout is given at Preferences->Orders tab. So Guest Checkout is enabled.\n\n[+] FO : Option for Shorter registration/address form is given at Preferences->Customers tab. (In this case address will be created from customer chosen room type's hotel address automatically).\n\n[+] CO : wkfooterexploreblock :: Admin can add custom explore links to show at footer explore block and navigation menu also. table  'htl_custom_explore_link' added with multilang.\n\n## Improved/changed features:\n\n[-] BO : New category option from \"quick access\" links is removed.\n[+] FO : Checkout page design has been changed.\n[+] CO : Images validation improved.\n\n\n## Bug/Issues Resolved:\n\n[-] CO : 56% Installation issue.\n\n[-] BO : Dashboard graphs not loading issues on php 7.2\n[-] BO : feature update issue on not selecting image while updating the feature.\n[-] BO : Category bug resolve (Should not be created updated deleted from anywhere). Will be handled from hotel creation/updation/deletion.\n\n\n####################################\n# V1.3.1\n####################################\n\n## Added Features:\n\n[+] BO : All already compatible Stats module are installed to the qloapps now.\n\n\n## Improved/changed features:\n\n[+] BO : Hotel name is shown in the Room Type Booking list and Room Type booking status tables.\n[+] FO : Hotel name is shown in the Customer shopping list, Order confirmation and order details booking lists.\n\n\n## Bug/Issues Resolved:\n\n[-] CO : Resolved :: When set up the new install, the upload_max_filesize value in the php.ini file less than 16M, but the error message is displaying for memory_limit.\n\n\n####################################\n# V1.3.0\n####################################\n\n## Added Features:\n\n[+] CO : Qloapps is compatible with php 7.x.x .\n\n\n## Improved/changed features:\n\n[+] CO : \"create demo data or not\" option improved for Qloapps demo data .\n[+] CO : System compatibility check for Qloapps installation improved .\n\n\n\n####################################\n# V1.2.0\n####################################\n\n## Added Features:\n\n[+] CO : Qloapps is now GDPR compatible (changes are made in Qloapps according to Qloapps GDPR module).\n[+] CO : wkfooterpaymentblock :: Created a controller where admin will be able to create payment Blocks.\n[+] CO : wkfooterpaymentblock :: Admin will be able to enter Name , image and status of the payment block.\n[+] CO : wkfooterpaymentblock :: Admin will be able to position the payment blocks and payment image blocks will be shown to the customer as per their positions.\n[+] CO : Qloapps version compliancy code added for modules' installation\n\n[+] FO : On contact us page, design is changed.\n[+] FO : On contact us page contact header, contact content, global address are now dynamic. Enter values from AdminGeneralSettingsController.\n\n[+] BO : Configuration to show/hide only one active hotel is added in location search panel in Hotel General Settings.\n\n\n## Improved/changed features:\n\n[+] CO : Missing multilang fields added where needed in Qloapps.\n[+] CO : Tax name will be shown in the invoices now. (For GST purposes) - (enable tax breakdown is mandatory)\n[+] CO : logo.gif needed in the modules (module author:webkul)\n[+] CO : Removed prestashop from all the pages and emails of Qloapps.\n[+] CO : Changed all links of Qloapps according to the qloapps.com.\n[+] CO : Stopped sending info to prestashop while installation.\n\n[+] BO : Seperate configuration panel is made for location search panel in Hotel General Settings.\n\n\n## Bug/Issues Resolved:\n\n[-] CO : Resolved :: Theme compilation issue on ajax while Qloapps installation\n[-] CO : Resolved :: Notice on Calls to functions Product::getProducts() in wkhoteleoom and Product::getSimpleProducts() in HotelHelper.php while installation of Qloapps.[Trying to get property of non-object]\n\n[-] CO : Resolved :: hotelreservationsystem - Parent:: replaced with parent:: in classes/hotelHotelBranchInformation.php which was creating problems in installation.\n\n[-] CO : Resolved :: RecursiveDirectoryIterator::__construct(/var/www/html/themes/hotel-reservation-theme/): failed to open dir While installation.\n\n[-] BO : Resolved :: hotelreservationsystem:: Hotel images not saved while saving hotel details.\n[-] BO : Resolved :: hotelreservationsystem - $max_phone_digit is undefined issue resolved on hotel creation form.\n[-] BO : Resolved :: hotelreservationsystem:: HotelBookingDetail.php : phone number sent as string '0987654321'from 0987654321. Giving error while installing Qloapps with php7.0.0 .\n\n[-] BO : Resolved :: wktestimonialblock:: Error while saving or updating testimonials by admin.\n[-] BO : Resolved :: array_column is removed from AdminProductController [php version compatibility issue].\n\n[-] FO : Resolved :: Undefined index: total_rooms_in_cart at blockcart.tpl.\n\n\n####################################\n# V1.1.1\n####################################\n\n## Added Features:\n\n[+] FO : FrontController.php - Breadcrump code added for front end controllers.\n[+] FO : FrontController.php - timepicker/jquery-ui-timepicker-addon.js')) added for timepicker on front end.\n[+] FO : FrontController.php - growl plugin added for growl notifications on front end.\n\n[+] FO : global.css - text-danger, text-warning..... color css added.\n[+] FO : global.css - Css added for growl notification.\n[+] FO : global.css - a:hover, a:focus css added at line no. : 265 Text invisible on hover, focus.\n[+] FO : global.css - Css for different Badges added.\n\n[+] FO : global.js - showSuccessMessage(), showErrorMessage(), showNoticeMessage() added for growl Notification in front end.\n[+] FO : global.js - showSuccessMessage(), showErrorMessage(), showNoticeMessage() added for growl Notification in front end.\n\n\n\n## Improved/changed features:\n\n[+] CO : displayCustomerAccountAfterTabs hook added at my-account.tpl .\n[+] CO : actionPackageListGenerateOrder hook added at PaymentModule.php .\n[+] CO : changes for the hotel search panel(id_hotel sent in the ajax request) in product.tpl\n[+] CO : getAllOrdersByCartId() added Order.php\n[+] CO : initContent() changes for seller wise split order feature in OrderConfirmationController.php\n[+] CO : changes for seller wise split order feature in Order_confirmation.tpl\n[+] CO : Automatic module upgradation is now disabled.\n\n[*] MO : hotelreservationsystem.php : hookActionProductDelete()  updated.\n[*] MO : hotelreservationsystem.php : hookActionValidateOrder()  updated for seller wise split changes.\n[*] MO : hotelreservationsystem->HotelBranchInformation.php : update()  overrided.\n[*] MO : hotelreservationsystem->HotelBranchInformation.php : delete()  overrided.\n[*] MO : hotelreservationsystem->HotelBranchInformation.php : addCategory() function moved from controllers.\n[*] MO : hotelreservationsystem->HotelImage.php : validateImage, validAddHotelOtherImage, uploadOtherImages, uploadMainImage, randomImageName functions removed.\n[*] MO : hotelreservationsystem->HotelAdvancedPayment.php : getOrderMinAdvPaymentAmount($id_order) added.\n[*] MO : hotelreservationsystem->HotelCustomerAdvancedPayment.php : getClientAdvPaymentDtl() and getOrderTotal changed for make compatible for sellerwise split order.\n[*] MO : hotelreservationsystem->HotelImage.php : uploadHotelImages() is added.\n[*] MO : hotelreservationsystem->HotelRoomInformation.php : getIdProductByHotelId() is added.\n[*] MO : hotelreservationsystem->HotelRoomInformation.php : getHotelCategoryTree() is updated.\n[*] MO : hotelreservationsystem->HotelRoomInformation.php : Overrided delete() function and added a new function which will run at the time of delete function execute.\n[*] MO : hotelreservationsystem->HotelRoomDisableDates.php : validateDisableDateRange() is added.\n[*] MO : hotelreservationsystem->HotelBookingDetails.php : UpdateHotelCartHotelOrderOnOrderEdit() is added changes in getOnlyOrderBookingData()\n[*] MO : hotelreservationsystem->HotelCustomerAdvancedPayment.php : updateAdvancePaymentInfoOnOrderEdit() is added.\n[*] MO : hotelreservationsystem->HotelRoomInformation.php : commented code is removed.\n[*] MO : hotelreservationsystem->HotelRoomTypeFeaturePricing.php :deleteFeaturePriceByIdProduct(),  getFeaturePriceInfo() are added.\n[*] MO : hotelreservationsystem->HotelBookingDetails.php : getBookingData() ..... $room_type = 0 (default value of room_type added)\n\n[+] CO : hotelreservationsystem::AdminAddHotelController.php - addCategory() is moved at HotelBranchInformation.php and image save changes.\n[+] CO : hotelreservationsystem::AdminProductsController.php - ajaxProcessDeleteHotelRoom() changed.\n[+] CO : hotelreservationsystem::AdminHotelRoomsBookingController.php - renderView() changes for booking data is null.\n[+] CO : hotelreservationsystem::AdminHotelFeaturePricesSettings.php - Below code is removed because impact price can be greater then 100% : if ($priceImpactType == 1) {\n    if ($impactValue > 100) {\n        $this->errors[] = $this->l('Invalid value of impact percentage.');\n    }\n}\n\n[+] CO : wkroomsearchblock::autocompletesearch.php - changes for the hotel search panel(id_hotel sent in the ajax request).\n\n[+] CO : bankwire::bankwire.php - hookPaymentReturn() changed (seller wise order split).\n[+] CO : cheque::cheque.php - hookPaymentReturn() changed (seller wise order split).\n\n[+] CO : hotelreservationsystem - double codes remove in form.tpl(modules/hotelreservationsystem/views/templates/ admin/ hotel_feature_prices_settings/helpers/form/form.tpl)\n[+] CO : hotelreservationsystem::AdminHotelRoomsBookingController: form.tpl - renderView() changes for booking data is null.\n[+] CO : hotelreservationsystem::from.tpl :: AdminAddHotelController.php - Changes for tabs (hotel information and images tabs)\n[+] CO : hotelreservationsystem::roomSearchWrapper.tpl - changes for the hotel  search panel (id_hotel sent in the ajax request)\n[+] CO : htlfiltersearchblock::htlfiltersearchblock.tpl - changes for the hotel  search panel (id_hotel sent in the ajax request)\n\n\n[+] CO : hotelreservationsystem::HotelReservationAdmin.css - css added For images save and delete\n\n\n[+] CO : hotelreservationsystem::HotelReservationAdmin.js - js added For images save and delete changes\n[+] CO : hotelreservationsystem::HotelReservationAdmin.js - For booking Calendar and datepicker changes when booking data is null\n[+] CO : hotelreservationsystem::roomSearchBlock.js - changes for the hotel  search panel (id_hotel sent in the ajax request)\n\n\n## Bug/Issues Resolved:\n\n[-] BO : Resolved :: submitHandler: function(form) removed at line 257 (admin/themes/default/template/controllers/product/form/form.tpl) o resolve Room Type not always saved while saving fron the backoffice.\n\n[+] CO : wkhotelroom::WkHotelRoomDisplay.php - deleteRoomByIdProduct() function is turned to static becuase at the time of product delete this function is throwing error.\n\n\n####################################\n# V1.1.0\n####################################\n\n## Added Features:\n\n[+] Project : `source` column is added in the `order` table to show the source of the booking.\n\n[+] Project : Everywhere now prices are shown according to the feature prices.\n\n[+] Project : Everywhere prestashop logo is replaced with Qloapps logo\n\n[+] BO : Feature price plans functionality has been added.\n[+] BO : Funnctionality to disable rooms for many dates is added.\n[+] BO : processConfiguration(), initFormConfiguration() are modified and validateDisableDateRanges() is added for disabled dated functionality in AdminProductsController.\n[+] BO : AdminOrdersController is modified for feature price funtionality. renderview and renderform functions also modified to display according to feature prices.\n\n[+] FO : OrderConfirmationController, OrderOpcController, OrderDetailsController and ProductControler are modified for feature price functionality. display files of the controllers also modified.\n\n[+] CO : hotelreservationsystem : ChannelManagerServices.php is added.\n[+] CO : hotelreservationsystem : ChannelOrderPayment.php is added.\n[+] CO : hotelreservationsystem : HotelCustomerAdvancedProductPayment.php is added.\n[+] CO : hotelreservationsystem : HotelRoomDisableDates.php is added.\n[+] CO : hotelreservationsystem : QloWebservice.php is added.\n[+] CO : hotelreservationsystem : WebserviceSpecificManagementQlo.php is added.\n\n[+] CO : hotelreservationsystem : ChannelManagerServices.php is added.\n[+] CO : hotelreservationsystem : HotelRoomTypeFeaturePricing.php is added.\n[+] CO : hotelreservationsystem : ChannelOrderPayment.php is added.\n[+] CO : hotelreservationsystem : getRoomMinAdvPaymentAmount() is added in HotelAdvancedPayment.php.\n[+] CO : hotelreservationsystem : createQloAppsBookingByChannels(), createQloCustomerChannelCustomerInfo(), \t\t\t\t\t\t\t\t\tcreateQloCustomerAddressByChannelCustomerInfo(), createQloCartForBookingFromChannel(), ProcessCreateQloOrderForChannelBooking() \t\tare added for Qloapps Api need  in HotelBookingDetails.php.\n[+] CO : hotelreservationsystem : 'total_price_tax_excl' and 'total_price_tax_incl' columns are added in `htl_booking_detail` table to \t\t\t\t\t\t\t\t\t\tstore the booking time price.\n[+] CO : hotelreservationsystem : getProductFeaturePricePlanByDateByPriority(), getHotelCartBookingData() are added in \t\t\t\t\t\t\t\t\t\t\t\t\tHotelCartBookingData.php.\n[+] CO : hotelreservationsystem : 'disabled_dates' column is added in the table `htl_room_information`.\n[+] CO : hotelreservationsystem : getRoomTypeAvailableRoomsForDateRange(), getRoomTypeDisabledRoomsForDateRange(), \t\t\t\t\t\t\t\t\t\t\t\t\t\tgetRoomTypeBookedRoomsForDateRange() are added in HotelRoomInformation.php.\n[+] CO : hotelreservationsystem : room status 'Hold For Maintenance is replace with 'Temporary incative';\n[+] CO : hotelreservationsystem : AdminHotelRoomsBookingController.php and AdminOrderRefundRequestsController.php are changed to make \t\t\t\t\t\t\t\t\t\tcompatible with feature price functionality.\n\n## Improved/changed features:\n\n[*] MO : wkhotelroom : price of the room types are shown at home page according to feature price plans.\n[*] FO : price of the room types are shown at home page according to feature price plans.\n\n\n## Bug/Issues Resolved:\n\n[-] FO : Resolved :: issue on saving Room type information at admin product information. On saving product sometimes redirecting to renderlist.\n[-] FO : Resolved :: If admin left the 'max global date field' to be blank,then invalid dates are shown in check in-checkout fields at frontend.\n[-] FO : Resolved :: On submitting the total order cancellation request,Popup with \"Parser error text\" is shown. (If submit request for single room first and then for all the rooms in the order).\n[-] BO : Resolved :: Some validation issues on manage order refund rules page.\n[-] BO : Resolved :: Room type column  added on manage order refund request -> view page. (#158)\n[-] BO : Resolved :: Advance paid amount on \"manage order refund request view page\" is shown for the single room.(#150)\n[-] BO : Resolved :: If admin deleted the room from \"order detail page\",then errors are shown on the \"customer order detail page\".(#137)\n[-] BO : Resolved :: While reallocating the rooms,sometimes the JSON is getting breakable,due to which no room is shown for swapping & reallocation.(#133)\n[-] FO : Resolved :: While placing an order,if customer signed out on \"order summary page\",then error is shown. (#119)\n[-] FO : Resolved :: If filtered with any parameter on category page,then on clicking the 'Book now button',page is redirecting to the category page itself.(#118)\n[-] FO : Resolved :: On clicking to the 'add new icon',the page is redirecting to the 'assign features page' rather than 'add new features page'.(#106)\n[-] BO : Resolved :: While adding the hotel features,no success message is shown on add new features-> manage hotel features page. (#105)\n[-] BO : Resolved :: hotel interior heading and description are not changing on saving new ones.(#87)\n[-] BO : Resolved :: PlayPal..Php curl issue on installation. needs curl to be installed on server for istallation (#89)\n[-] BO : Resolved :: Many Order Edit issues resolved.\n\n\n####################################\n# V1.0.1\n####################################\n\n## Improved/changed features:\n\n[+] Project : Theme has been improved.\n\n[*] FO : After selecting checkIn and checkout dates these dates are highlighted in the datepicker.\n[*] FO : contact Number and email were hard coded on contact page now will dinamically come from entered values from Admin General Configuration.\n[*] FO : Font-family in order summary page in synced with the theme fonts now.\n\n[*] BO : Bacorder setting option is removed from Settings->General Settings.\n\n## Fixed bugs:\n\n[-] MO : hotelreservationsystem : Fixed Google map issue on contact page.\n[-] BO : Fixed showing wrong way of payment on refund request page.\n[-] BO : Fixed showing wrong cancellation charges on refund request page.\n[-] MO : wkabouthotel : Fixed interior heading and description does not change on changing from Setting->Hotel interior Block Setting.\n\n\n# Change Log previous version to V1.0.0:\n\n## Added Features:\n\n[+] Project : Theme has been improved.\n\n[+] FO : Order summary page design improved in case of advance payment\n\n[+] BO : Order Edit functionality is added.\n[+] BO : Order Restrict functionality is added.\n[+] BO : Order Edit id added.\n\n[+] CO : wkpaypaladaptive : Added Feature Admin can refund full transaction.\n[+] CO : wkpaypaladaptive : Order is created by IPN.\n[+] CO : Added wkhotelroom\n[+] CO : Added wkfooteraboutblock\n[+] CO : Added wkfooterexploreblock\n[+] CO : Added wkfooternotificationblock\n[+] CO : Added wkfooterpaymentblock\n[+] CO : hotelreservationsystem : Added Settings tab to centralize all configurations.\n\n\n## Improved/changed features:\n\n[+] Project : Theme has been improved.\n\n[*] FO : Fixed partial amount calculation issues in case of advance payment at order summary page.\n[*] FO : Room details page design has been improved.\n[*] FO : Room search results page design has been improved.\n[*] FO : Home page design has been improved.\n[*] FO : Contact page design has been improved.\n[*] FO : All pages design has been changed according to new theme.\n[*] FO : Theme Footer design has been improved. more modules are added to improve the view.\n\n[*] BO : Quantity tab from Catalog->products removed.\n[*] BO : Tab Catalog->Attachments removed.\n[*] BO : Tab Cart Rules is improved to make compatible for a hotel reservation system.\n[*] BO : Gift product functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n[*] BO : Carrier selection functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n[*] BO : Compatibility with other cart rules functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n[*] BO : Product selection functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n[*] BO : Free shipping functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n[*] BO : Free shipping functionality is removed from Cart Rules to make compatible for a hotel reservation system.\n\n[*] MO : wkpaypaladaptive : Order is created by IPN.\n[*] MO : wkpaypaladaptive : Improved exception handling.\n[*] MO : wkpaypaladaptive : Configuration of the module moved to Hotel Reservation System -> Settings Tab.\n[*] MO : wkhotelfeaturesblock : Configuration of the module moved to Hotel Reservation System -> Settings Tab.\n[*] MO : wktestimonialblock : Configuration of the module moved to Hotel Reservation System -> Settings Tab.\n[*] MO : wkhotelfilterblock : Configuration of the module moved to Hotel Reservation System -> Settings Tab.\n[*] MO : wkroomsearchblock : design changed on home page.\n\n\n\n## Fixed bugs:\n\n[-] PROJECT : Fixed anonymous object creation issue on php version lower than 5.4 (feature does not support before php version 5.4).\n\n[-] Installer : Fixed changed mails for qloapps converted into prestashop default mails while installing the software.\n\n[-] FO : Fixed if 'Product Comment' module is uninstalled then showing error on each page at frontend where rating is shown.\n[-] FO : Fixed bug search is not working on iphones.\n[-] FO : Reservations of dates before today's date does not remove from Cart.\n[-] FO : Fixed bug search is not working on iphones.\n[-] FO : Fixed 'Total Order Cancellation' & 'Refund Request' button does not work on order confirmation page on some servers.\n[-] FO : Fixed in case when hotel is disabled and its rooms are enabled then showing error on room detail page.\n[-] FO : Fixed Contact us page at frontend is not working.\n[-] FO : Fixed link creation functions by creating them with objects created by sending id_lang also to their constructor.\n\n\n[-] BO : Fixed wrong \"way of payment\" issue regarding advance payment On Hotel Reservation System->Manage Order Refund Requests.\n[-] BO : Fixed wrong \"way of payment\" issue regarding advance payment On Hotel Reservation System->Manage Order Refund Requests.\n[-] BO : Fixed bug Cancellation charge is accepting the -ve value so the refund amount becomes more than total amount.\n[-] BO : Fixed view option is coming twice on manage order refund requests-> view page.\n[-] BO : Fixed Showing error 'Order->id_customer is empty' on admin order detail page after completing the order from backoffice.\n[-] BO : Fixed bug how number of times admin clicks add to cart button,same no. of times the room gets added into the cart from Hotel Reservation System->Book Now tab.\n[-] BO : Fixed issue if Tax is applied on the order even then Tax is shown 0 in admin order detail page.\n[-] BO : Fixed error if enter numeric data in child feature field while adding the new hotel feature on 'Manage Hotel Features' page.\n[-] BO : Fixed all filters on 'Manage hotel features page' are showing errors.\n[-] BO : Fixed all filters on Manage hotel page showing error.\n[-] BO : Fixed if deleting the hotels through 'bulk actions dropdown' then showing error.\n[-] BO : Fixed If set 'disable for 'enable hotel' option while adding the hotel showing error page.\n[-] BO : Fixed bug if update Order's room status(checking, allotted or checkout) all rooms status changed with same room number of same room type.\n[-] BO : Fixed bug if update Order's room status(checking, allotted or checkout) all rooms status changed with same room number of same room type.\n\n\n[-] MO : wktestimonialblock : Fixed while adding the image in valid format on configuration page then showing error page.\n[-] MO : wkpaypaladaptive : Fixed paypal is not working because paypal api has been changed.\n[-] MO : wkpaypaladaptive : Fixed fopen issues fixed, done by CURL.\n[-] MO : wkpaypaladaptive : Fixed payment negative value bug fixed.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.244140625,
          "content": "# Contribute to QloApps\n\nQloApps is an open-source software and we all know that community contributions lie at the heart of any open-source software. It is the essence of an open-source that a diverse group of individuals collaborate and innovate the best possible solutions.\n\nHere are the ways you can contribute to the QloApps project.\n\n## Code Enhancements\n\nAs a PHP developer, if you have command on not only PHP but also MySQL and also know how to use Git and GitHub efficiently you can contribute to code enhancements via [pull requests on GitHub](https://github.com/webkul/hotelcommerce/pulls).\n\n### Current Feature Enhancement\n\nIf you feel there is a scope for improvement in any current feature of the system then just send us the pull request with your enhanced codes. The team will review it and if everything is up to the mark then it will be merged with the main branch.\n\nIn QloApps we follow a modular approach to bring functionalities into the system. The system has its native modules for different features.\n\nYou can also improve these modules besides the core features to improve the features of the system.\n\n### Addition Of A New Feature\n\nAny system can never have all the features that satisfy the needs of every business out there. And we all have different mindsets.\nSo you can always think of a feature that is not there in the system.\n\nAgain we will need your pull requests on GitHub. And if everything is fine we will merge your request into the main branch.\n\n### Bug Fixing\n\nThe beauty of being an open-source software is that anyone who knows to code can improve your code.\n\nWe always try that keep the system as bug-free as we can. But still, if there is anything left and you have resolved it then send it to us.\n\nYou have to follow the GitHub PR system for bug fixings also.\n\n### Optimization\n\nIf you have an idea to make the system more optimized and you can make the system work better then it's time to make a pull request at the [QloApps Github repository](https://github.com/webkul/hotelcommerce).\n\nThe better-written code the better the software performance.\n\n### Report Security Issues\n\nQloApps values the contributions of the security research community, and we look forward to working with you to minimize risk to QloApps users.\n\nIf you have found a security issue in QloApps, please do not use the issue tracker and don't publish it publicly. Instead, report the security issue to [support@qloapps.com](mailto:support@qloapps.com) or contact [QloApps Support](https://webkul.uvdesk.com/en/customer/create-ticket/). So that we can act on it immediately to avoid as much damage as we can.\n\n\n## Testing\n\n### Bug Reporting\n\nBugless development is impossible, we can just try to leave as minimum bugs in the system as we can. At QloApps also we try our best to make the system free of bugs.\n\nEvery release goes through a process of quality analysis before reaching you. But as we know it is a huge software with a lot of code files, so there is a possibility that there is any bug left.\n\nSo we need you to report any bug you find in the system to our QA Team. Our team will check the bug and find the best possible solution to resolve it.\n\nYou can report a bug either on our GitHub [Issues](https://github.com/webkul/hotelcommerce/issues) or on our [Forum](http://forums.qloapps.com/).\n"
        },
        {
          "name": "Core",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 10.1220703125,
          "content": "\nOpen Software License (\"OSL\") v. 3.0\n\nThis Open Software License (the \"License\") applies to any original work of authorship (the \"Original Work\") whose owner (the \"Licensor\") has placed the following licensing notice adjacent to the copyright notice for the Original Work:\n\nLicensed under the Open Software License version 3.0\n\n   1. Grant of Copyright License. Licensor grants You a worldwide, royalty-free, non-exclusive, sublicensable license, for the duration of the copyright, to do the following:\n\n         1. to reproduce the Original Work in copies, either alone or as part of a collective work;\n\n         2. to translate, adapt, alter, transform, modify, or arrange the Original Work, thereby creating derivative works (\"Derivative Works\") based upon the Original Work;\n\n         3. to distribute or communicate copies of the Original Work and Derivative Works to the public, with the proviso that copies of Original Work or Derivative Works that You distribute or communicate shall be licensed under this Open Software License;\n\n         4. to perform the Original Work publicly; and\n\n         5. to display the Original Work publicly. \n\n   2. Grant of Patent License. Licensor grants You a worldwide, royalty-free, non-exclusive, sublicensable license, under patent claims owned or controlled by the Licensor that are embodied in the Original Work as furnished by the Licensor, for the duration of the patents, to make, use, sell, offer for sale, have made, and import the Original Work and Derivative Works.\n\n   3. Grant of Source Code License. The term \"Source Code\" means the preferred form of the Original Work for making modifications to it and all available documentation describing how to modify the Original Work. Licensor agrees to provide a machine-readable copy of the Source Code of the Original Work along with each copy of the Original Work that Licensor distributes. Licensor reserves the right to satisfy this obligation by placing a machine-readable copy of the Source Code in an information repository reasonably calculated to permit inexpensive and convenient access by You for as long as Licensor continues to distribute the Original Work.\n\n   4. Exclusions From License Grant. Neither the names of Licensor, nor the names of any contributors to the Original Work, nor any of their trademarks or service marks, may be used to endorse or promote products derived from this Original Work without express prior permission of the Licensor. Except as expressly stated herein, nothing in this License grants any license to Licensor's trademarks, copyrights, patents, trade secrets or any other intellectual property. No patent license is granted to make, use, sell, offer for sale, have made, or import embodiments of any patent claims other than the licensed claims defined in Section 2. No license is granted to the trademarks of Licensor even if such marks are included in the Original Work. Nothing in this License shall be interpreted to prohibit Licensor from licensing under terms different from this License any Original Work that Licensor otherwise would have a right to license.\n\n   5. External Deployment. The term \"External Deployment\" means the use, distribution, or communication of the Original Work or Derivative Works in any way such that the Original Work or Derivative Works may be used by anyone other than You, whether those works are distributed or communicated to those persons or made available as an application intended for use over a network. As an express condition for the grants of license hereunder, You must treat any External Deployment by You of the Original Work or a Derivative Work as a distribution under section 1(c).\n\n   6. Attribution Rights. You must retain, in the Source Code of any Derivative Works that You create, all copyright, patent, or trademark notices from the Source Code of the Original Work, as well as any notices of licensing and any descriptive text identified therein as an \"Attribution Notice.\" You must cause the Source Code for any Derivative Works that You create to carry a prominent Attribution Notice reasonably calculated to inform recipients that You have modified the Original Work.\n\n   7. Warranty of Provenance and Disclaimer of Warranty. Licensor warrants that the copyright in and to the Original Work and the patent rights granted herein by Licensor are owned by the Licensor or are sublicensed to You under the terms of this License with the permission of the contributor(s) of those copyrights and patent rights. Except as expressly stated in the immediately preceding sentence, the Original Work is provided under this License on an \"AS IS\" BASIS and WITHOUT WARRANTY, either express or implied, including, without limitation, the warranties of non-infringement, merchantability or fitness for a particular purpose. THE ENTIRE RISK AS TO THE QUALITY OF THE ORIGINAL WORK IS WITH YOU. This DISCLAIMER OF WARRANTY constitutes an essential part of this License. No license to the Original Work is granted by this License except under this disclaimer.\n\n   8. Limitation of Liability. Under no circumstances and under no legal theory, whether in tort (including negligence), contract, or otherwise, shall the Licensor be liable to anyone for any indirect, special, incidental, or consequential damages of any character arising as a result of this License or the use of the Original Work including, without limitation, damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses. This limitation of liability shall not apply to the extent applicable law prohibits such limitation.\n\n   9. Acceptance and Termination. If, at any time, You expressly assented to this License, that assent indicates your clear and irrevocable acceptance of this License and all of its terms and conditions. If You distribute or communicate copies of the Original Work or a Derivative Work, You must make a reasonable effort under the circumstances to obtain the express assent of recipients to the terms of this License. This License conditions your rights to undertake the activities listed in Section 1, including your right to create Derivative Works based upon the Original Work, and doing so without honoring these terms and conditions is prohibited by copyright law and international treaty. Nothing in this License is intended to affect copyright exceptions and limitations (including 'fair use' or 'fair dealing'). This License shall terminate immediately and You may no longer exercise any of the rights granted to You by this License upon your failure to honor the conditions in Section 1(c).\n\n  10. Termination for Patent Action. This License shall terminate automatically and You may no longer exercise any of the rights granted to You by this License as of the date You commence an action, including a cross-claim or counterclaim, against Licensor or any licensee alleging that the Original Work infringes a patent. This termination provision shall not apply for an action alleging patent infringement by combinations of the Original Work with other software or hardware.\n\n  11. Jurisdiction, Venue and Governing Law. Any action or suit relating to this License may be brought only in the courts of a jurisdiction wherein the Licensor resides or in which Licensor conducts its primary business, and under the laws of that jurisdiction excluding its conflict-of-law provisions. The application of the United Nations Convention on Contracts for the International Sale of Goods is expressly excluded. Any use of the Original Work outside the scope of this License or after its termination shall be subject to the requirements and penalties of copyright or patent law in the appropriate jurisdiction. This section shall survive the termination of this License.\n\n  12. Attorneys' Fees. In any action to enforce the terms of this License or seeking damages relating thereto, the prevailing party shall be entitled to recover its costs and expenses, including, without limitation, reasonable attorneys' fees and costs incurred in connection with such action, including any appeal of such action. This section shall survive the termination of this License.\n\n  13. Miscellaneous. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.\n\n  14. Definition of \"You\" in This License. \"You\" throughout this License, whether in upper or lower case, means an individual or a legal entity exercising rights under, and complying with all of the terms of, this License. For legal entities, \"You\" includes any entity that controls, is controlled by, or is under common control with you. For purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n  15. Right to Use. You may use the Original Work in all ways not otherwise restricted or conditioned by this License or by law, and Licensor promises not to interfere with or be responsible for such uses by You.\n\n  16. Modification of This License. This License is Copyright (C) 2005 Lawrence Rosen. Permission is granted to copy, distribute, or communicate this License without modification. Nothing in this License permits You to modify this License as applied to the Original Work or to Derivative Works. However, You may modify the text of this License and copy, distribute or communicate your modified version (the \"Modified License\") and apply it to other original works of authorship subject to the following conditions: (i) You may not indicate in any way that your Modified License is the \"Open Software License\" or \"OSL\" and you may not use those names in the name of your Modified License; (ii) You must replace the notice specified in the first paragraph above with the notice \"Licensed under <insert your license name here>\" or with a notice of your own that is not confusingly similar to the notice in this License; and (iii) You may not claim that your original works are open source software unless your Modified License has been approved by Open Source Initiative (OSI) and You comply with its license review and certification process.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.244140625,
          "content": "<div align=\"center\">\n\t<a href=\"https://www.qloapps.com\"><img src=\"https://forums.qloapps.com/assets/uploads/system/site-logo.png?v=hkl8e1230fo\" alt=\"QloApps\"></a>\n\t<br>\n\t<p>\n\t\t<b>QloApps - An open source and free platform to launch your own hotel booking website</b>\n\t</p>\n</div>\n\n<p align=\"center\">\n\t<a href=\"https://qloapps.com/download/\"><img src=\"https://img.shields.io/badge/Download-Download%20QloApps%20-brightgreen\" alt=\"Download\"></a>\n\t<a href=\"https://qloapps.com/qlo-reservation-system/\"><img src=\"https://img.shields.io/badge/Documentation-Blog-yellowgreen\" alt=\"Documentation\"></a>\n\t<a href=\"https://forums.qloapps.com/\"><img src=\"https://img.shields.io/badge/Forum-Help%2FSupport-green\" alt=\"Forum\"></a>\n\t<a href=\"https://qloapps.com/addons/\"><img src=\"https://img.shields.io/badge/Addons-Plugins-blueviolet\" alt=\"Addons\"></a>\n\t<a href=\"https://qloapps.com/contact/\"><img src=\"https://img.shields.io/badge/Contact-Get%20In%20Touch-blue\" alt=\"Contact us\"></a>\n\t<a href=\"/LICENSE.md\"><img src=\"https://img.shields.io/badge/License-OSL%20V3-green\" alt=\"License\"></a>\n</p>\n\n## Topics\n- [Topics](#topics)\n\t- [Introduction](#introduction)\n\t- [Requirements](#requirements)\n\t\t- [Hosted Server Configurations](#hosted-server-configurations)\n\t\t- [Local Server Configurations](#local-server-configurations)\n\t- [Installation and Configuration](#installation-and-configuration)\n\t- [License](#license)\n\t- [Security Vulnerabilities](#security-vulnerabilities)\n\t- [Documentation & Demo](#documentation--demo)\n\t\t- [QloApps Documentation](#qloapps-documentation)\n\t\t- [QloApps Demo](#qloapps-demo)\n\t- [Contribute](#contribute)\n\t- [Credits](#credits)\n\n\n### Introduction\n\nQloApps is one kind of a true open-source hotel reservation system and a booking engine. The system is dedicated to channeling the power of the open-source community to serve the hospitality industry.\n\nFrom small independent hotels to big hotel chains, QloApps is a one-stop solution for all your hotel business needs.\n\nYou will be able to launch your hotel website, showcase your property and take and manage bookings.\n\n### Requirements\n\nIn order to install QloApps you will need the following server configurations for hosted and local serves.\nThe system compatibility will also be checked by the system with installation and if the server is not compatible then the installation will not move ahead.\n\n#### Hosted Server Configurations\n\n* **Web server**: Apache 1.3, Apache 2.x, Nginx or Microsoft IIS\n* **PHP  version**: PHP 5.6+ to PHP 7.4\n* **MySQL version**:  5.1+ to 5.7 installed with a database created\n* SSH or FTP access (ask your hosting service for your credentials)\n* In the PHP configuration ask your provider to set memory_limit to \"128M\", upload_max_filesize to \"16M\" ,    max_execution_time to \"500\" and allow_url_fopen \"on\"\n* SSL certificate if you plan to process payments internally (not using PayPal for instance)\n* **Required PHP extensions**: PDO_MySQL, cURL, OpenSSL, SOAP, GD, SimpleXML, DOM, Zip, Phar\n\n#### Local Server Configurations\n\n* **Supported operating system**: Windows, Mac, and Linux\n* **A prepared package**: WampServer (for Windows), Xampp (for Windows and Mac) or EasyPHP (for Windows)\n* **Web server**: Apache 1.3, Apache 2.x, Nginx or Microsoft IIS\n* **PHP**: PHP 5.6+ to PHP 7.4\n* **MySQL** 5.1+ to 5.7 installed with a database created\n* In the PHP configuration, set memory_limit to \"128M\", upload_max_filesize to \"16M\" and max_execution_time to \"500\"\n* **Required PHP extensions**: PDO_MySQL, cURL, OpenSSL, SOAP, GD, SimpleXML, DOM, Zip, Phar\n\n### Installation and Configuration\n\n**1.** You can install QloApps easily after downloading QloApps. There are easy steps for the installation process. Please visit [QloApps Installation Guide](https://qloapps.com/install-qloapps/) and follow the steps for the successful installation.\n\n**2.** Or you can install QloApps with docker image. For the docker image of QloApps, please visit [Dockerize image of QloApps](https://hub.docker.com/r/webkul/qloapps_docker) <br>\n* Docker pull command\n~~~\ndocker pull webkul/qloapps_docker\n~~~\n\n### License\n\nQloApps Core is licensed under OSL-3.0 and Modules authored by Webkul have their applicable license, LICENSE.md, kept inside their root directories, while other modules are licensed under AFL-3.0.\n\nThe online copy of OSL-3.0 can be found at [https://opensource.org/licenses/OSL-3.0](https://opensource.org/licenses/OSL-3.0).\n\nThe online copy of AFL-3.0 can be found at [https://opensource.org/licenses/AFL-3.0](https://opensource.org/licenses/AFL-3.0).\n\n### Security Vulnerabilities\n\nPlease don't disclose security vulnerabilities publicly. If you find any security vulnerability in QloApps then please email us: mailto:support@qloapps.com.\n\n### Documentation & Demo\n\n#### QloApps Documentation \n[https://qloapps.com/qlo-reservation-system](https://qloapps.com/qlo-reservation-system)\n#### QloApps Demo\n**Link** : https://demo.qloapps.com </br>\n**username** : demo@demo.com </br>\n**Password** : demodemo </br>\n\n### Contribute\nAs a PHP developer who has command on PHP and MySQL and also knows how to use Git or GitHub efficiently, can contribute to code enhancements via pull requests.<br>\nFor more information about the contribution process please check **[Contribute to QloApps](/CONTRIBUTING.md)**\n\n### Credits\nCrafted with :heart: at [Webkul](https://webkul.com)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.45703125,
          "content": "# Security Policy\n\nQloApps values the contributions of the security research community, and we look forward to working with you to minimize risk to QloApps users.\n\n\n## Reporting a Security Issue\n\nIf you have found a security issue in QloApps, please do not use the issue tracker and don't publish it publicly. Instead, report the security issue to support@qloapps.com or contact QloApps Support. So that we can act on it immediately to avoid as much damage as we can.\n"
        },
        {
          "name": "admin",
          "type": "tree",
          "content": null
        },
        {
          "name": "cache",
          "type": "tree",
          "content": null
        },
        {
          "name": "classes",
          "type": "tree",
          "content": null
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 0.642578125,
          "content": "{\n    \"require\": {\n        \"php\": \">=5.4 <8.0\",\n        \"ext-simplexml\": \"*\",\n        \"ext-curl\": \"*\",\n        \"ext-gd\": \"*\",\n        \"ext-zip\": \"*\",\n        \"ext-soap\": \"*\"\n    },\n    \"name\": \"webkul/qloapps\",\n    \"description\": \"QloApps is an Open-source and Free hotel reservation system and booking engine. With the help of QloApps, you can launch your hotel booking website without any cost and take & manage online bookings.\",\n    \"type\": \"project\",\n    \"license\": \"OSL-3.0\",\n    \"authors\": [\n        {\n            \"name\": \"webkul\",\n            \"email\": \"support@qloapps.com\"\n        }\n    ],\n    \"minimum-stability\": \"dev\",\n    \"prefer-stable\": true\n}"
        },
        {
          "name": "config",
          "type": "tree",
          "content": null
        },
        {
          "name": "controllers",
          "type": "tree",
          "content": null
        },
        {
          "name": "css",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "download",
          "type": "tree",
          "content": null
        },
        {
          "name": "error500.html",
          "type": "blob",
          "size": 2.392578125,
          "content": "<!DOCTYPE html>\n<html lang=\"en\">\n    <head>\n\t\t<meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\n\t\t<meta name=\"description\" content=\"This store is powered by Webkul\" />\n        <style>\n            ::-moz-selection {\n                background: #b3d4fc;\n                text-shadow: none;\n            }\n\n            ::selection {\n                background: #b3d4fc;\n                text-shadow: none;\n            }\n\n            html {\n                padding: 30px 10px;\n                font-size: 16px;\n                line-height: 1.4;\n                color: #737373;\n                background: #f0f0f0;\n                -webkit-text-size-adjust: 100%;\n                -ms-text-size-adjust: 100%;\n            }\n\n            html,\n            input {\n                font-family: \"Helvetica Neue\", Helvetica, Arial, sans-serif;\n            }\n\n            body {\n                max-width:600px;\n                _width: 600px;\n                padding: 30px 20px 50px;\n                border: 1px solid #b3b3b3;\n                border-radius: 4px;\n                margin: 0 auto;\n                box-shadow: 0 1px 10px #a7a7a7, inset 0 1px 0 #fff;\n                background: #fcfcfc;\n            }\n\n            h1 {\n                margin: 0 10px;\n                font-size: 50px;\n                text-align: center;\n            }\n\n            h1 span {\n                color: #bbb;\n            }\n            h2 {\n                color: #D35780;\n                margin: 0 10px;\n                font-size: 40px;\n                text-align: center;\n            }\n\n            h2 span {\n                color: #bbb;\n                font-size: 60px;\n            }\n\n            h3 {\n                margin: 1.5em 0 0.5em;\n            }\n\n            p {\n                margin: 1em 0;\n            }\n\n            ul {\n                padding: 0 0 0 40px;\n                margin: 1em 0;\n            }\n\n            .container {\n                max-width: 380px;\n                _width: 380px;\n                margin: 0 auto;\n            }\n\n            input::-moz-focus-inner {\n                padding: 0;\n                border: 0;\n            }\n        </style>\n    </head>\n    <body>\n        <div class=\"container\">\n            <h2><span>500</span> Server Error</h2>\n            <p>Oops, something went wrong.<br /><br />Try to refresh this page or feel free to contact us if the problem persists.</p>\n        </div>\n    </body>\n</html>\n"
        },
        {
          "name": "footer.php",
          "type": "blob",
          "size": 1.189453125,
          "content": "<?php\n/*\n* 2007-2017 PrestaShop\n*\n* NOTICE OF LICENSE\n*\n* This source file is subject to the Open Software License (OSL 3.0)\n* that is bundled with this package in the file LICENSE.txt.\n* It is also available through the world-wide-web at this URL:\n* http://opensource.org/licenses/osl-3.0.php\n* If you did not receive a copy of the license and are unable to\n* obtain it through the world-wide-web, please send an email\n* to license@prestashop.com so we can send you a copy immediately.\n*\n* DISCLAIMER\n*\n* Do not edit or add to this file if you wish to upgrade PrestaShop to newer\n* versions in the future. If you wish to customize PrestaShop for your\n* needs please refer to http://www.prestashop.com for more information.\n*\n*  @author PrestaShop SA <contact@prestashop.com>\n*  @copyright  2007-2017 PrestaShop SA\n*  @license    http://opensource.org/licenses/osl-3.0.php  Open Software License (OSL 3.0)\n*  International Registered Trademark & Property of PrestaShop SA\n*/\n\nif (isset(Context::getContext()->controller)) {\n    $controller = Context::getContext()->controller;\n} else {\n    $controller = new FrontController();\n    $controller->init();\n}\nTools::displayFileAsDeprecated();\n$controller->displayFooter();\n"
        },
        {
          "name": "header.php",
          "type": "blob",
          "size": 1.2177734375,
          "content": "<?php\n/*\n* 2007-2017 PrestaShop\n*\n* NOTICE OF LICENSE\n*\n* This source file is subject to the Open Software License (OSL 3.0)\n* that is bundled with this package in the file LICENSE.txt.\n* It is also available through the world-wide-web at this URL:\n* http://opensource.org/licenses/osl-3.0.php\n* If you did not receive a copy of the license and are unable to\n* obtain it through the world-wide-web, please send an email\n* to license@prestashop.com so we can send you a copy immediately.\n*\n* DISCLAIMER\n*\n* Do not edit or add to this file if you wish to upgrade PrestaShop to newer\n* versions in the future. If you wish to customize PrestaShop for your\n* needs please refer to http://www.prestashop.com for more information.\n*\n*  @author PrestaShop SA <contact@prestashop.com>\n*  @copyright  2007-2017 PrestaShop SA\n*  @license    http://opensource.org/licenses/osl-3.0.php  Open Software License (OSL 3.0)\n*  International Registered Trademark & Property of PrestaShop SA\n*/\n\nif (isset(Context::getContext()->controller)) {\n    $controller = Context::getContext()->controller;\n} else {\n    $controller = new FrontController();\n    $controller->init();\n    $controller->setMedia();\n}\nTools::displayFileAsDeprecated();\n$controller->displayHeader();\n"
        },
        {
          "name": "img",
          "type": "tree",
          "content": null
        },
        {
          "name": "index.php",
          "type": "blob",
          "size": 1.04296875,
          "content": "<?php\n/*\n* 2007-2017 PrestaShop\n*\n* NOTICE OF LICENSE\n*\n* This source file is subject to the Open Software License (OSL 3.0)\n* that is bundled with this package in the file LICENSE.txt.\n* It is also available through the world-wide-web at this URL:\n* http://opensource.org/licenses/osl-3.0.php\n* If you did not receive a copy of the license and are unable to\n* obtain it through the world-wide-web, please send an email\n* to license@prestashop.com so we can send you a copy immediately.\n*\n* DISCLAIMER\n*\n* Do not edit or add to this file if you wish to upgrade PrestaShop to newer\n* versions in the future. If you wish to customize PrestaShop for your\n* needs please refer to http://www.prestashop.com for more information.\n*\n*  @author PrestaShop SA <contact@prestashop.com>\n*  @copyright  2007-2017 PrestaShop SA\n*  @license    http://opensource.org/licenses/osl-3.0.php  Open Software License (OSL 3.0)\n*  International Registered Trademark & Property of PrestaShop SA\n*/\n\nrequire(dirname(__FILE__).'/config/config.inc.php');\nDispatcher::getInstance()->dispatch();\n"
        },
        {
          "name": "init.php",
          "type": "blob",
          "size": 1.126953125,
          "content": "<?php\n/*\n* 2007-2017 PrestaShop\n*\n* NOTICE OF LICENSE\n*\n* This source file is subject to the Open Software License (OSL 3.0)\n* that is bundled with this package in the file LICENSE.txt.\n* It is also available through the world-wide-web at this URL:\n* http://opensource.org/licenses/osl-3.0.php\n* If you did not receive a copy of the license and are unable to\n* obtain it through the world-wide-web, please send an email\n* to license@prestashop.com so we can send you a copy immediately.\n*\n* DISCLAIMER\n*\n* Do not edit or add to this file if you wish to upgrade PrestaShop to newer\n* versions in the future. If you wish to customize PrestaShop for your\n* needs please refer to http://www.prestashop.com for more information.\n*\n*  @author PrestaShop SA <contact@prestashop.com>\n*  @copyright  2007-2017 PrestaShop SA\n*  @license    http://opensource.org/licenses/osl-3.0.php  Open Software License (OSL 3.0)\n*  International Registered Trademark & Property of PrestaShop SA\n*/\n\nif (isset(Context::getContext()->controller)) {\n    $controller = Context::getContext()->controller;\n} else {\n    $controller = new FrontController();\n    $controller->init();\n}\n"
        },
        {
          "name": "install",
          "type": "tree",
          "content": null
        },
        {
          "name": "js",
          "type": "tree",
          "content": null
        },
        {
          "name": "localization",
          "type": "tree",
          "content": null
        },
        {
          "name": "log",
          "type": "tree",
          "content": null
        },
        {
          "name": "mails",
          "type": "tree",
          "content": null
        },
        {
          "name": "modules",
          "type": "tree",
          "content": null
        },
        {
          "name": "override",
          "type": "tree",
          "content": null
        },
        {
          "name": "pdf",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "themes",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "translations",
          "type": "tree",
          "content": null
        },
        {
          "name": "upload",
          "type": "tree",
          "content": null
        },
        {
          "name": "webservice",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}