{
  "metadata": {
    "timestamp": 1736711844048,
    "page": 162,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "osTicket/osTicket",
      "stars": 3300,
      "defaultBranch": "develop",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2998046875,
          "content": ".htaccess\nphp53.cgi\ninclude/ost-config.php\nsetup/cli/modules/importer\n*.sw[a-z]\n.DS_Store\n.vagrant\n._.DS_Store\nVagrantfile\n\n# Staging directory used for packaging script\nstage\n\n# Ignore packaged plugins and language packs\n*.phar\n\n# Ignore mPDF temp files\ninclude/mpdf/ttfontdata\ninclude/mpdf/tmp\nnbproject/\n"
        },
        {
          "name": "ISSUE_TEMPLATE.md",
          "type": "blob",
          "size": 0.9619140625,
          "content": "### Prerequisites\n\n* [ ] Can you reproduce the problem in a fresh installation of the \"develop\" branch?\n* [ ] Do you have any errors in the PHP error log, or javascript console?\n* [ ] Did you check the [osTicket forums](https://forum.osticket.com/)?\n* [ ] Did you [perform a cursory search](https://github.com/osTicket/osTicket/issues) to see if your bug or enhancement is already reported?\n\nFor more information on how to write a good [bug report](https://github.com/osTicket/osTicket/wiki/Github-Issues-Guidelines)\n\n### Description\n\n[Description of the bug or feature]\n\n### Steps to Reproduce\n\n1. [First Step]\n2. [Second Step]\n3. [and so on...]\n\n**Expected behavior:** [What you expected to happen]\n\n**Actual behavior:** [What actually happened]\n\n### Versions\n\nAdmin panel -> Dashboard -> Information which also additionally gives you information about your server.\n\nAlso, please include the OS and what version of the OS you're running. As well as your browser and browser version.\n"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 14.86328125,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0419921875,
          "content": "osTicket\n========\n<a href=\"https://osticket.com\"><img height=\"80px\" width=\"80px\" src=\"images/favicon.png\"\nalign=\"left\" hspace=\"10\" vspace=\"6\"></a>\n\n**osTicket** is a widely-used open source support ticket system. It seamlessly\nintegrates inquiries created via email, phone and web-based forms into a\nsimple easy-to-use multi-user web interface. Manage, organize and archive\nall your support requests and responses in one place while providing your\ncustomers with accountability and responsiveness they deserve.\n\nHow osTicket works for you\n--------------------------\n  1. Users create tickets via your website, email, or phone\n  1. Incoming tickets are saved and assigned to agents\n  1. Agents help your users resolve their issues\n\nosTicket is an attractive alternative to higher-cost and complex customer\nsupport systems; simple, lightweight, reliable, open source, web-based and\neasy to setup and use. The best part is, it's completely free.\n\nRequirements\n------------\n  * HTTP server running Microsoft® IIS or Apache\n  * PHP version 8.1 - 8.2 (8.2 recommended)\n  * mysqli extension for PHP\n  * MySQL database version 5.5 (or greater)\n\n### Recommendations\n  * fileinfo, gd, gettext, imap, intl, json, mbstring, Zend OPcache, phar,\n    xml, xml-dom, and zip extensions for PHP\n  * APCu module enabled and configured for PHP\n\nDeployment\n----------\nosTicket now supports bleeding-edge installations. The easiest way to\ninstall the software and track updates is to clone the public repository.\nCreate a folder on you web server (using whatever method makes sense for\nyou) and cd into it. Then clone the repository (the folder must be empty!):\n\n    git clone https://github.com/osTicket/osTicket\n\nAnd deploy the code into somewhere in your server's www root folder, for\ninstance\n\n    cd osTicket\n    php manage.php deploy --setup /var/www/htdocs/osticket/\n\nThen you can configure your server if necessary to serve that folder, and\nvisit the page and install osTicket as usual. Go ahead and even delete\nsetup/ folder out of the deployment location when you’re finished. Then,\nlater, you can fetch updates and deploy them (from the folder where you\ncloned the git repo into)\n\n    git pull\n    php manage.php deploy -v /var/www/htdocs/osticket/\n\nUpgrading\n---------\nosTicket supports upgrading from 1.6-rc1 and later versions. As with any\nupgrade, strongly consider a backup of your attachment files, database, and\nosTicket codebase before embarking on an upgrade. Please review our [Upgrade\nGuide](https://docs.osticket.com/en/latest/Getting%20Started/Upgrade%20and%20Migration.html)\nor the [UPGRADING.txt file](UPGRADING.txt) for upgrade instructions.\n\nHelp\n----\nVisit the [Documentation](https://docs.osticket.com/) or the\n[forum](https://forum.osticket.com/). And if you'd like professional help\nmanaging your osTicket installation,\n[commercial support](https://osticket.com/support/) is available.\n\nContributing\n------------\nCreate your own fork of the project and use\n[git-flow](https://github.com/nvie/gitflow) to create a new feature. Once\nthe feature is published in your fork, send a pull request to begin the\nconversation of integrating your new feature into osTicket.\n\n### Localization\n[![Crowdin](https://badges.crowdin.net/osticket-official/localized.svg)](https://crowdin.com/project/osticket-official)\n\nThe interface for osTicket is now completely translatable. Language packs\nare available on the [download page](https://osticket.com/download). If you\ndo not see your language there, join the [Crowdin](https://crowdin.com/project/osticket-official)\nproject and request to have your language added. Languages which reach 100%\ntranslated are are significantly reviewed will be made available on the\nosTicket download page.\n\nThe software can also be translated in place in our [JIPT site](http://jipt.i18n.osticket.com).\nOnce you have a Crowdin account, login and translate the software in your browser!\n\nLocalizing strings in new code requires usage of a [few rules](setup/doc/i18n.md).\n\nLicense\n-------\nosTicket is released under the GPL2 license. See the included LICENSE.txt\nfile for the gory details of the General Public License.\n\nosTicket is supported by several magical open source projects including:\n\n  * [Font-Awesome](https://fontawesome.com/)\n  * [HTMLawed](https://www.bioinformatics.org/phplabware/internal_utilities/htmLawed)\n  * [jQuery dropdown](https://labs.abeautifulsite.net/jquery-dropdown/) (Project Deleted)\n  * [jsTimezoneDetect](https://pellepim.bitbucket.org/jstz/)\n  * [laminas-mail](https://github.com/laminas/laminas-mail)\n  * [mPDF](https://github.com/mpdf/mpdf)\n  * [PasswordHash](https://www.openwall.com/phpass/)\n  * [PEAR](https://pear.php.net/package/PEAR)\n  * [PEAR/Auth_SASL](https://pear.php.net/package/Auth_SASL)\n  * [PEAR/Mail](https://pear.php.net/package/mail)\n  * [PEAR/Net_SMTP](https://pear.php.net/package/Net_SMTP)\n  * [PEAR/Net_Socket](https://pear.php.net/package/Net_Socket)\n  * [PEAR/Serivces_JSON](https://pear.php.net/package/Services_JSON)\n  * [php-gettext](https://launchpad.net/php-gettext/)\n  * [phpseclib](https://phpseclib.sourceforge.net/)\n  * [Spyc](https://github.com/mustangostang/spyc)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.1005859375,
          "content": "# Security Policy\n\n## Reporting a Vulnerability\n\nPlease send all POCs to security[at]osticket[dot]com.\n"
        },
        {
          "name": "UPGRADING.txt",
          "type": "blob",
          "size": 4.5107421875,
          "content": "Upgrading osTicket\n==================\nosTicket supports upgrading from 1.6-rc1 and later versions. As with any\nupgrade, strongly consider a backup of your attachment files, database, and\nosTicket codebase before embarking on an upgrade.\n\nTo trigger the update process, fetch the osTicket tarball from either\nthe osTicket [GitHub](https://github.com/osTicket/osTicket/releases) page\nor from the [osTicket website](https://osticket.com/download). Extract the tarball\ninto the folder of your osTicket codebase. This can also be accomplished\nwith the zip file, and a FTP client can of course be used to upload the new\nsource code to your server.\n\nAny way you choose your adventure, when you have your codebase upgraded,\nvisit the /scp page of you ticketing system. The upgrader will\nbe presented and will walk you through the rest of the process. (The couple\nclicks needed to go through the process are pretty boring to describe).\n\n### Upgrading from v1.6\n**WARNING**: If you are upgrading from osTicket 1.6, please ensure that all\n    your files in your upload folder are both readable and writable to your\n    http server software. Unreadable files will not be migrated to the\n    database during the upgrade and will be effectively lost.\n\nAfter upgrading, we recommend migrating your attachments to the database or\nto the new filesystem plugin. Use the `file` command-line applet to perform\nthe migration.\n\n    php manage.php file migrate --backend=6 --to=D\n\nSome tasks are better left to a system administrator rather than a mindless\nupgrade script. These are those remaining things that we'd rather you take\ncare of:\n\n  * Verify that your attachments have been successfully migrated to the\n    database and removed from your server's filesystem. Once you're\n    comfortable that they're all migrated, and that the remaining files are\n    all failed uploads or orphans from deleted tickets, remove the folder\n    where attachments were uploaded to.\n\n  * Remove codebase files no longer utilized in osTicket 1.7. If you have\n    console access to your server, a codebase-cleanup.sh script is provided\n    for you in the setup/ folder to help you automatically take care of this.\n    Otherwise, you may safely remove the following files from your codebase if\n    they exist:\n\n    * Removed in osTicket-1.6-rc5\n      ostconfig.php\n\n    * Removed in osTicket-1.6.0\n      images/button.jpg\n      images/logo.jpg\n      images/new_ticket_title.jpg\n      images/ticket_status_title.jpg\n      include/settings.php\n\n    * Removed in osTicket-1.7.0\n      images/bg.gif\n      images/fibres.png\n      images/home.gif\n      images/icons\n      images/lipsum.png\n      images/logo2.jpg\n      images/logout.gif\n      images/my_tickets.gif\n      images/new_ticket.gif\n      images/new_ticket_icon.jpg\n      images/poweredby.jpg\n      images/rainbow.png\n      images/refresh_btn.gif\n      images/ticket_status.gif\n      images/ticket_status_icon.jpg\n      images/verticalbar.jpg\n      images/view_closed_btn.gif\n      images/view_open_btn.gif\n      include/class.msgtpl.php\n      include/class.sys.php\n      include/client/index.php\n      include/client/viewticket.inc.php\n      include/ost-config.sameple.php\n      include/staff/api.inc.php\n      include/staff/changepasswd.inc.php\n      include/staff/dept.inc.php\n      include/staff/depts.inc.php\n      include/staff/editticket.inc.php\n      include/staff/mypref.inc.php\n      include/staff/myprofile.inc.php\n      include/staff/newticket.inc.php\n      include/staff/premade.inc.php\n      include/staff/reply.inc.php\n      include/staff/smtp.inc.php\n      include/staff/viewticket.inc.php\n      scp/css/autosuggest_inquisitor.css\n      scp/css/datepicker.css\n      scp/css/main.css\n      scp/css/style.css\n      scp/css/tabs.css\n      scp/images/alert.png\n      scp/images/bg-login-box.gif\n      scp/images/icons/email_settings.gif\n      scp/images/logo-support.gif\n      scp/images/minus.gif\n      scp/images/ostlogo.jpg\n      scp/images/pagebg.jpg\n      scp/images/plus.gif\n      scp/images/refresh.gif\n      scp/images/tab.jpg\n      scp/images/view_closed.gif\n      scp/images/view_open.gif\n      scp/js/ajax.js\n      scp/js/autolock.js\n      scp/js/bsn.AutoSuggest_2.1.3.js\n      scp/js/calendar.js\n      scp/js/datepicker.js\n      scp/js/tabber.js\n\n    * Removed in v1.7.1\n      include/class.mcrypt.php\n      include/client/thankyou.inc.php\n      include/upgrader/sql/*\n\n    * Removed in v1.7.2\n      include/pear/Crypt/Random.php\n\n    * Removed in v1.7.3\n      include/index.html\n\n  * Remove the setup/ folder. This contains code you won't need for a live\n    ticketing system.\n"
        },
        {
          "name": "WHATSNEW.md",
          "type": "blob",
          "size": 120.357421875,
          "content": "osTicket v1.18.1\n================\n### Improvements\n* Update upgrade.php (9fd83eba)\n* Update upgrade.inc.php (8c8a7fd1)\n* update: PHP Requirements 1.18.x (1c0c670b)\n* CLI: Make sure manage util can be executed via CLI (0caf5864)\n* Update raphael-min.js to 2.3.0 (d4aeada1)\n\nosTicket v1.18\n==============\n### Enhancements\n* update: Laminas-Mail (66fa10af, bb45d37a)\n\n### Improvements\n* Database: Change Plugin Name to varchar(255) (aac546d0)\n* update: MAJOR_VERSION (3eac42e5)\n\nosTicket v1.17.5\n================\n### Improvements\n* update: README.md PHP & Laminas (4baf9dc8, 555c4a74, 88294e2d, 30a4a6e9)\n* issue: putenv() Disabled (3c0d5f47)\n* i18n: Update Signing (98706274, 776c0f27)\n* i18n: Flags Position & Codes (3ee11112, 45f5b5b4)\n* mailer: Undefined SmtpAccount::getName() (560a4f1d)\n* issue: SystemSessionHandler (7e17daa6)\n* issue: Status List Overflow (1deee342)\n* faq: Category Notes Images (ccca0f59)\n* patches: Latest 10/03/2023 (65e12297, 48e8501d, a8d42a9d, 4475e03e, bd034712, 64b8c81d, 070eefcb, 1775ce75)\n* mail: NoValidateCert (d3c140ce)\n* issue: Choice/Selection Field Searches (00e22fad)\n* stubs: Add stubs to pass lint test (895c7236)\n* issue: Canned Response Inline Images (a503c160)\n* format: Viewable Images Bug (2a412883)\n\n### Security\n* issue: CSP Headers (6228f640)\n* security: Latest Vulns 09/2023 (04f4e611, 88a87a33, c4ad48de, 37cf8350)\n* issue: User Account Creation (777e6f0b)\n\nosTicket v1.17.4\n================\n### Improvements\n* issue: Thread Entry Actions z-index (215a0ce2)\n* oauth2: Strict Matching Bug (e014ffd2)\n* Make string translatable (1105cde7)\n* issue: Inline-Images Canned Responses (4493b126)\n* issue: Remove Old Login Code (e17ad463)\n* issue: i18n Audit Exports (45dd7c4f)\n* Bug: Custom File Upload Field Config (6371269a, 7283ac81, 902b5d35)\n* issue: Duplicate User Copy/Paste Import (b304cdb)\n* issue: Relocate Typeahead JS/CSS Files (62cd406)\n* issue: strftime() Deprecation (3fe132c4)\n* jquery: Update To 3.7.0 (ffa23da)\n* issue: glob() Empty Array (c64a2611)\n* issue: Email Only Attachment (9e45f3fa)\n* installer: Change Email (a11aee29)\n\n### Security\n* security: Latest Vulns 06/2023 (86c2ba02, 69244175, 73b997a, ae37925, e4bfb00)\n\nosTicket v1.17.3\n================\n### Enhancements\n* oauth2: Strict Matching (7275d67b, b7718be4, ca913ba2, cb3625e8, f531718a, c0cd8b16)\n* OAuth2 Resource Owner (5c239adb)\n\n### Improvements\n* session: Regenerate Session Id (d5853245)\n* fetcher: Mail Fetcher / Parser Error Handling (d4d9c424, 0a4498b2)\n* mysql: Support Sidecar Database Proxies (246aaa4d)\n* Misc. Fixes (e6beeb9b, 24fd5075, eac9960a, 10af29a5)\n* fetcher: Default Department (f410d4ec)\n* issue: LDAP Multi-Instance Fatal Error (f6486044)\n* issue: TicketDenied errno (6de7cf4c)\n* session: User Logged Out (00d409d3)\n* Uncaught Error: Call to a member function getId() on bool (af83896d)\n* Mailer: Inline Images (7efbdfd2, 8815d087, 64a8abf3)\n\nosTicket v1.17.2\n================\n### Improvements\n* Fix old reference to SessionData (cf8b8ce7)\n* Email Misc. Fixes (de620fe6, c19a5f03)\n* session: Memcache Max TTL (ea3e03d2)\n* mailer: Use Namespaced Mailer (133585f8)\n\nosTicket v1.17.1\n================\n### Enhancements\n* mail: Add plain:// encryption scheme hint (7c1b97b3, 39d76258)\n\n### Improvements\n* mailer: Make Headers Valid Again (c08a8a8a, aaee6b0f, 00981554, 2223877c, 020fa0d3, 60c8c884)\n* POP3 Configration can not saved (b84547b0, ccd8445e)\n* fetcher: Errors Handling & Logging (384aad13, 22edf2b4, c92006e6)\n* upgrader: Email Account Status (aee25d69)\n* issue: Plugin Config Item Exists (fdf9e412)\n* mailer: Improvements & Enhancements (845e5008, 23a80592, 977cf9aa)\n* smtp: Use proper name when saying What's Up (HELO/EHLO) (b0e5ac83)\n* email: Make sure Email Account is Active 4realz! (5efd9f14, a9b57496)\n* Session++ (ced0ef4d, b943a955, b6b63c99, f58e1c5d, 47df2b44, e2e6c0f4, 9ab5b4f1, da667366, f2c01840, c2be4ebf, db913bd3)\n* setup: Use Bootstrap:ini() to initialize setup dir sessions (48e436f0)\n* issue: Plugin Config Item Exists (fdf9e412)\n* upgrader: Email Account Status (aee25d69)\n* fetcher: Errors Handling & Logging (384aad13, 22edf2b4, c92006e6)\n* fetcher: Mail Fetch Order (f1639d41, 24338c2b)\n* SMTP: Dont send 'QUIT' on __destruct() (dbeae227)\n* issue: MTA Typo (03eeb8e2)\n* sendmail: Strip \"To\" and \"Subject\" headers (ac3855a4)\n* Mail Parse Error Handling (320981df, 75c5cfe9, a4e36d39, ba2d31cd, 30ad9cd4, 678098d8, 46b7899b, f85f9036)\n* Issue/session revisited (49d91b05, 4fc5f5cc)\n\nosTicket v1.17\n==============\n### Enhancements\n* email: Set Default Email Message Encoding to UTF-8 (4656cf4c, 8954f05b)\n* plugins: Multi-Instance Blacklist (56077516)\n* mailer: Reset FROM Address when SMTP fails (75605a3f)\n* Issue: File Storage Plugins Blacklist (1ba8d37a)\n* mail: Catch Possible Exceptions and Errors (81d5cb35)\n\n### Improvements\n* Update class.mail.php (d5545b4e)\n* Mail Fetcher Fixes (1eebcd66, 3decbe78)\n* 1.17.x Bug Fixes (6c2ecad2, 5d799ecd, 21e3a407)\n* plugins: Make Plugins Upgradeable Again! (80bcc191)\n* mailer: Skip Invalid Email Recipients (046f4327, 551f7864, d7d37c4c)\n* issue: Wrong Variable Order (12a4cb09)\n* mailer: Skip Missing Attachment Files (2218aaca)\n* fetcher: TicketDenied Exception + Throwable (58f64e65, 79209144, e027dcc4, be178da5)\n* files: Catch possible Storage Backends Errors (e685636e)\n* fetcher: Fail Safely on Email Parse Error (459520e8)\n* forms: Add getNotice func. to DynamicFormEntry (6e54e810)\n* bug: Users Password Policy (ebfc1d89)\n* v1.17 Misc. Fixes (d149ea0d)\n* plugins: Make Plugin Base Class Play Nice (7b26f665, 5787f9ae, 3163972b)\n\nosTicket v1.17-rc4\n==================\n### Enhancements\n* v1.17: Bug Fixes & Enhancements (bd300c44, ab9a8101, 3024d7f5, e705ff0f, 681bea08, bc154434, 246c1445, e4f594c2, 76bf7725, 4ee44d48, a7068668, 5e53b1a1, 481a0475, 2fa077ae, 13888292)\n\n### Improvements\n* mail: Mixed Mime Message with mixed multiparts (6de79a0b, c71ddade)\n* 2fa: Fix 2FA Backend Registry (f8f5d3dd, 2318714e)\n* issue: Dispatcher include_once (dab490dc)\n* plugins: Audit enable() (7796d60c)\n* issue: AuthenticationBackend getBkId() (29f01c09)\n\nosTicket v1.17-rc3\n==================\n### Improvements\n* Oauth2 / Modern Email Auth Latest Fixes (fdc5b0fa, d9b41f4e, fa8dc24d, 265065c1)\n\nosTicket v1.17-rc2\n==================\n### Improvements\n* Oauth2 / Modern Email Auth Latest Fixes (4da6fb07, 90ed880b, 72b2a249, 8a8c1a16, fa6cc040, 97a9b0af)\n\nosTicket v1.17-rc1\n==================\n### Enhancements\n* Oauth2 / Modern Email Authentication Support (d99ff6e1-163c28b5)\n\nosTicket v1.16.6\n================\n### Improvements\n* session: Collab View Ticket (6afe0efa)\n* issue: Static forTask() (1079011f)\n* issue: Featured FAQs (8df09581)\n* print: Hidden Thread Events (f63fc67d)\n* issue: Does Not Have A Value (d47fc2b1)\n* issue: Disabled Queues Run Counts (3ff3ce93)\n* issue: Queue Counts Incorrect (2428cc58)\n* jquery: Update jQueryUI 1.13.2 (b896f70d)\n* issue: Department Export (5418cf20)\n* jquery: Update To 3.6.3 (8d39a4cc)\n* i18n: make-pot (74274b5c)\n* update: README PHP Version (6087bc55)\n* issue: mPDF Font Files (427a8aa6)\n* issue: FileUpload False (8dd2ab61)\n* Add translation for \"last resort\" standard column labels (cb528044)\n* add translation for task status (46c005a0)\n* issue: getRealPath() Stub (32a229aa)\n\n### Security\n* security: Latest Security Patches 03/2023 (86f9693d, 091ddba9, ec604393, daee20fd, 9fb01bc1, 619ce0f6, 343a2b47, 8a55c29f, e2c8f799, ee7ce3d9, 263f71a3)\n\nosTicket v1.16.5\n================\n### Improvements\n* Fix trusted proxy wildcard check (04c0bb3a)\n* issue: Html Typo (50dfe931)\n* mailparse: Parse filenames with complex format (c8067212)\n* validator: Email Domain Verification (3c4a20a8)\n* user: Make sure User has a valid Email on create (55fbfcb5)\n\nosTicket v1.16.4\n================\n### Enhancements\n* i18n: Default Ticket Queue (7a5dd0eb)\n* mailparse: thread_entry_recipients to (a82af698)\n* issue: Unique Variable Names (0dc5a02e)\n* php: 8.1 Support (22b599e3, c24ee575, dd2b9a43)\n* issue: Session Cookie Refresh (1630459a)\n\n### Improvements\n* oops: jQuery UI Images (822a05fe)\n* issue: Manually Sorted Topics (a80db8a7)\n* issue: Queue Export Headings (47449758)\n* installer: Checking Existing Install (a3f2e246)\n* Catch storage error when mailing ticket response (ca5932ac)\n* issue: Staff Ticket Open Session (4f3d3cff)\n* issue: External Auth Regenerate Session (83252260)\n* issue: Searching Numbers (e00003f6)\n* Replace hacky way with ReflectionClass (55f61390)\n* Issue: Installer YAML (6780f29e)\n* issue: Fix Upgrader Session Issues (311089a6)\n* issue: Undefined Variable ORM (4009881a)\n* v1.16: Misc Bug Fixes (4c0341e2)\n* issue: User/Agent Password Reset (d3de1599)\n* issue: imagesx Boolean (5d06ee46)\n* file: Possible Key Collision (21c71c6e)\n* cli: User Import (4c43e46f)\n* issue: Miscellaneous Fixes (50bc1a21, 5002bef9, e036fd9a, 35684189, 9c280b49, c2a15b64, 5e970061)\n* issue: urldecode Dispatcher (c00b8e87)\n* issue: Information and SectionBreak Fields On Edit (7b60c576)\n* issue: Favicons Login Headers (61655ec6)\n* issue: Schedules stops_on (e2dcbb69)\n* Issue: Agent Permission to Assign Tickets (b4732b05)\n* issue: File Upload Size (45f554ad)\n\n### Security\n* security: Username XSS (5213ff13)\n* security: Refresh URL (3702a4fb)\n\nosTicket v1.16.3\n================\n### Improvements\n* installer: Help Topic Disabled Fields (81e99fe4)\n* Do not autocomplete new access fields of the (another) user (02633694)\n* issue: mPDF Table Print (38c0979e)\n* Make string localizable (4cc509b1, 612183ce)\n\n### Security\n* mpdf: Unregister PHAR (57721def)\n* issue: Form Elements & Attribute (45b6cf2e)\n* Security: Session Fixation (85a76f40)\n* security: Unvalidated Password Change (01a378f6)\n* xss: System Logs (334934ec)\n* xss: Agent Directory (a5c4d931)\n\nosTicket v1.16.2\n================\n### Improvements\n* Issue: Topic->getHelpTopics() don't return localized names when $allData = true (a078a0f)\n* class.email: allow empty smtp_passwd when existing (0d0d8a1)\n* Fixes permission issue when registration mode ist disabled (dee6a13)\n* email: use correct e-mail formatting (7692637)\n* Fix HTML syntax in thread view (84913f5)\n* Fix slugify regex (f72691c)\n* issue: preg_match Pass By Reference (148a2e7)\n* issue: php_analyze each() (f627a5e)\n* issue: Deprecated Required Parameter (0d0ab46)\n* tests: UninitializedVars (60f6ad7)\n* tests: Validation Checks (91e7d30)\n* issue: QueueSort (92e820c)\n* issue: Task Export (baa46d3)\n* issue: PEAR Mail parseAddressList() (7130056)\n* issue: Filter Events (8c9b392)\n* issue: Last Message Data Source (d185e50)\n* issue: Undefined Constant GLOB_BRACE (0499b97)\n* Update edit.inc.php (8b5ea64)\n* Update ticket-preview.tmpl.php (e6f437c)\n* Update ticket-view.inc.php (84c4eb8)\n* issue: Nullable date() Timestamp (a77158b)\n\nosTicket v1.16.1\n================\n### Improvements\n* issue: Remaining Deprecated each() (69db3a7)\n* issue: User sendUnlockEmail (13652db)\n* issue: Auth_SASL Non-Static (4378f77)\n* issue: Banlist Non-Static (96995e1)\n* issue: PHP Version Requirements 1.16.x (fdc0445)\n* issue: Email Templates Static (fb0b075)\n* issue: Status List getSortModes() (6d4650d)\n\nosTicket v1.16\n==============\n### Enhancements\n* PHP8: Static Method Lint Test (958a748)\n* Update MPDF (59dc587)\n\n### Improvements\n* prereqs: Update README.md (2767ad4)\n* upgrader: v1.16 Release (57347ab)\n* release: Prep Release (0905e7b)\n* php8: Temporarily Suppress Warnings (0afe2b2)\n* issue: PEAR each() (1eafd98)\n* issue: Further Fixes (03d203b)\n* issue: EmailDataParser (c4fc76c)\n* issue: Even More Fixes (998cd7d)\n* issue: Misc. Fixes (ec9c09d)\n* issue: Static to Non-Static (3bb36ff)\n* issue: create_function() (7668b71)\n* issue: Unparenthesized (64076e2)\n* issue: Undefined Key, Var, Prop (6974734)\n* issue: Undefined Function each() (e261a5f)\n* issue: Calling Non-Static Statically (a4ab19d)\n* Fix first problems with PHP 8 (ab77c0a, 29dcbd9, 6b3c7f9, 4d972b5, e63998e)\n\nosTicket v1.15.8\n================\n### Enhancements\n* issue: Check User Status (3a2f072d)\n* jquery: Update jQueryUI 1.13.1 (ed958d98)\n\n### Improvements\n* issue: Redactor Freezing (42525aca)\n\n### Security\n* mpdf: Unregister PHAR (57721def)\n* issue: Form Elements & Attribute (45b6cf2e)\n* Security: Session Fixation (85a76f40)\n* security: Unvalidated Password Change (01a378f6)\n* xss: System Logs (334934ec)\n* xss: Agent Directory (a5c4d931)\n\nosTicket v1.15.7\n================\n### Enhancements\n* i18n: Bosnian Flag CSS (94f5e95)\n* i18n: Translatable Tooltip (e2be9e7)\n* i18n: No Tasks String (01016db)\n\n### Improvements\n* Use HTTPS version of Crowdin project (d52cc40, da1309a)\n* fix staff login redirect loop when system is offline (38b8f53)\n* oops: Banlist Created (f0ae76f)\n* issue: MaxLength Attribute (225eb7a)\n* Update ticket-tasks.inc.php (b063504)\n* Issue: Disabled/Archived Primary Dept (0b7c9c2)\n* issue: Sweden Capitalization (3cb05ad)\n* typo: Emtpy To Empty (9c858b8)\n* issue: Fixes Test Errors (34cf2f2)\n\nosTicket v1.15.6\n================\n### Enhancements\n* i18n: Missing translations for the action buttons (823b5fb)\n\n### Improvements\n* issue: Required Custom Field User Registration (f4e693e)\n\nosTicket v1.15.5\n================\n### Enhancements\n* redactor: Upgrade to version 3.5.2 (4e4f82e)\n* auth: Allow AuthBackends to auto-register Users (6836b17)\n\n### Improvements\n* issue: Khmer Language Flag (f878f14)\n* issue: Assignee Item Property (3cde88a)\n* issue: CDATA Rebuild Issue (9da3b5e)\n* issue: Plus Symbol (b0f143e)\n* issue: Plain-Text Canned Responses (19c03ca)\n* issue: Improved Validation for Variable Names (35c8ca8)\n* Revert \"issue: List Item Properties On Mouseover\" (5c91f64)\n\nosTicket v1.15.4\n================\n### Enhancements\n* Feature: Log Event For Filters (7d48735, 1fd2b6b, 99ec09a)\n\n### Improvements\n* Issue: Delete Referrals (790c0e6)\n* Show \"-Empty-\" value for empty due dates in ticket view (64712eb)\n* Issue: Audit Closed Ticket Events (311a600)\n\n### Security\n* security: PwReset Username and Username Discoverability (e282910, 86165c2)\n* security: SSRF External Images (1c6f98e)\n* xss: Stored XSS/Domain Whitelist Bypass (4b4da5b)\n* security: Recipient Injection via User's Name (7c5c584)\n* xss: Advanced Search (4a8d3c8)\n* xss: Tasks (b01c6a2)\n\nosTicket v1.15.3.1\n==================\n### Improvements\n* Auth: Service Name (da05573)\n\nosTicket v1.15.3\n================\n### Enhancements\n* Enhancement: S3 Plugin Folder Capability (ae4ed63)\n\n### Improvements\n* Auth: Service Name on Client Portal (b755b99)\n* CDATA: Rebuild Cdata tables post Install (4409dbd)\n* Issue: Deleted Forms on Help Topics (4494bf4)\n* Issue: Saving Priority Field (56c50b8)\n* CDATA: Dynamic Forms Views (4ab3602)\n* CDATA: Check Cdata Tables on Cron (b758c14, 3397987, aba5970)\n* CDATA: DynamicFormField Update (678decc, 9f01ee1)\n* Issue: Filter Email Variables (3a36727)\n* status: Localize Status Names (6173a73)\n* Issue: Queue Columns Custom Fields (bd4cfb4)\n* Issue: Custom Dept/Custom Assignee Exports (8140d4b)\n* Issue: 'Open' heading don't get translated (6065715)\n* Make Max-Age consistent across backends (292df94)\n* Zip Export: Include Custom File Upload Files (1328bd7)\n* Issue: Spaces in List Items (ef6c949)\n* Issue: Class PageNate had problems with total value as string (573ab33)\n* Tweak PersonsName->getShort() and getShortFormal() (fa64ad4, ad91e66, 8671a68)\n\n### Security\n* xss: SVG Image (68dcaa2)\n* security: open.php Refresh (b8603c7)\n* xss: Client-Side i18n (fd560df)\n* session: Verify UserAgent String (f71c954)\n\nosTicket v1.15.2\n================\n### Enhancements\n* Issue: Visibility Permissions (8da9da3)\n* Depts Visibility (fe37ae2)\n* Issue: Task Inline Transfer (e43d6bf)\n\n### Improvements\n* Make word count error match the actual limit (3e177bb)\n* Mute warning when Every Minute is selected. (2a56da7)\n* Remove extra selection - Choice Field handles prompt. (b564ce3)\n* Fail gracefully when supported matches return null (4550b65)\n* Create variable before passing it by reference (858649c)\n* FAQ: Check for lookup failures (edd1feb)\n* 2fa: use isset to check checkbox (7f68060)\n* Session: Regenerate session id before closing it. (14e9fb2)\n* Issue: Unlinking Tickets (98efec5)\n* Issue: Agents/Depts in Queue Cols (d8f6ef6)\n* Issue: Revise getDepartments (71f4c0c)\n* Issue: Visibility Permissions (3ee5941)\n* issue: getDefaultDeptId() On Null (38a09e6)\n* issue: Dashboard Export Date Range (db79149)\n* Issue: Echoing Default Dept Status (fe31575)\n* issue: Export Memory Limit (3a5e5c9)\n* Use PageNate->showing() for Users and Orgs in SCP (63f0ae8)\n* Don't capitalize Queue menu items (2348850)\n* Issue: Disabled Dept on Email (b1397a3)\n* issue: Assign To Sort Alphabetically (77c7a12)\n* Update class.plugin.php (4a3451f)\n\n### Security\n* xss: FormAction Attribute (8d956e0)\n* xss: onerror Property (25e6d12)\n\nosTicket v1.15.1\n================\n### Improvements\n* readme: Update PHP Version (a4c85d7)\n* placeholder: Quote and encode html chars (0056d14)\n\nosTicket v1.14.8\n================\n### Improvements\n* issue: Auto-Assign Comments Var (c3171c3)\n* issue: List Item Properties On Mouseover (a6a7192)\n* issue: def_assn_role (6ad568f)\n* search: Child Thread Relation (08785f9)\n\n### Security\n* security: PwReset Username and Username Discoverability (e282910, 86165c2)\n* security: SSRF External Images (1c6f98e)\n* xss: Stored XSS/Domain Whitelist Bypass (4b4da5b)\n* security: Recipient Injection via User's Name (7c5c584)\n* xss: Advanced Search (4a8d3c8)\n* xss: Tasks (b01c6a2)\n\nosTicket v1.14.7\n================\n### Enhancements\n* redactor: Upgrade to version 3.5.1 (2617f53)\n\n### Improvements\n* issue: Setup Admin Password Heltip Verbiage (7866a72)\n* issue: getDBVersion() SQL Errors (43210e3)\n* issue: Missing Thread On Referral Check (1359d91)\n* readme: Update PHP Version (a1cf24f)\n* typo: Default Sorting (89c322b)\n* issue: Choices Field Sanitization (07526af)\n* issue: \"New Task Alert\" email template typo (8178b4d)\n* issue: Edit Entry Dropped Attachments (a9a64ed)\n* issue: EmailTest Draft (27259e1)\n* issue: Release Notes Links (e9a2155)\n* Role: Handle null perms (4211952)\n* Issue: Missing null check in Staff->updatePerms() (f9626f8)\n* Banlist sorting by Updated (15ccc71)\n* issue: ticket.dept.sla Variable sla_id (bf15d6f)\n\n### Security\n* xss: SVG Image (68dcaa2)\n* security: open.php Refresh (b8603c7)\n* xss: Client-Side i18n (fd560df)\n* session: Verify UserAgent String (f71c954)\n\nosTicket v1.14.6\n================\n### Enhancements\n* redactor: Upgrade to version 3.4.9 (ab40f97)\n\n### Improvements\n* issue: markAs Popup Manager (No Access) (8d1d623)\n* issue: Task last_update Var (08cd762)\n* issue: SCP Login Redirect (9b12a54)\n* issue: Client-Side Reply Draft Saving (996cd9e)\n\n### Security\n* xss: FormAction Attribute (8d956e0)\n* xss: onerror Property (25e6d12)\n\nosTicket v1.14.5\n================\n### Enhancements\n* typo: Change User Confirmation Popup (79e6513)\n* redactor: Upgrade to version 3.4.6 (5c77b0d)\n\n### Improvements\n* issue: MailFetch Inline Disposition (fbf0c7d)\n* issue: Editor Spacing (a6cbc5c)\n* Issue: Collaborator Adding New Collabs (a4ab6b6)\n* mail: Reply to Ticket Owner Only (a4bb20a)\n* dept: Dept Deletion Bug (7cba73d)\n* issue: Task From Ticket (4b48456)\n\n### Security\n* security: Parent Ticket Access (Client) (5972fe8)\n\nosTicket v1.15\n==============\n### Enhancements\n* Change dept_id and priority_id fron tinyint to int (e54f6f3)\n* csrf: Add ability to rotate token (36e614c)\n* Feature: Agent/Department Visibility (5fbd762, e4346d2, 4ad7e95, 49b2f1b, 46033d1, 3a8ea4b, 6eae7e6, f306ce8, 6fdc111, 4489b2f, 7f0602a, 484023d, 3722fc5, 6425146, 9902ac2, 07b2373, ca81176, 4e86313)\n* db: Latest Indexes (da2fd37, 2731074, c359d12, ea09373, 4c9968b)\n* SLA Plan Search Field (0fd63b4)\n* 2FA Backends (5dd0a34, 4ef752c, cff12f7, ea86103, 4b6bc73, a1b7826, 3f08e62, 9d46c84, 8f4fe18)\n* Password Policy Revisited (e1aba7c, 744676b)\n\n### Improvements\n* Issue: Missing Events (38232f2)\n* Issue: 2FA Upgrade (0065c3b)\n* Ticket From Email (f02edd9)\n* Issue: User Custom Dept Field (52825f0)\n* Staff: Password Change (7527ea7)\n* oops: Indexes Patch Schema (709b55f)\n* CsvImporter: Skip Byte Order Mark (BOM) if present (bfd5da8)\n* Oops: Method Inheritance Compatibility (cb13b82)\n* issue: Form Instructions Translation (4f7d23c)\n\nosTicket v1.14.4\n================\n### Enhancements\n* forms: Pseudo-random name for Dynamicforms on POST (077d26f)\n* Authcode: Ticket Access Link (043c3fe)\n* redactor: Upgrade to version 3.4.5 (e593c5c, 9102240, e471132)\n* Auth: Client Create Request (c3c01d3, 43e07c2)\n\n### Improvements\n* Issue: Event YAML (52c7211)\n* issue: Missing Description On New Task (949acc6)\n* issue: Draft Save (f2c5c5a)\n* mpdf: Logo Overlap (5012ccc)\n* Issue: Viewing Email Templates (817cdee)\n* Issue: Topics on Install (bfaad5b)\n* Partially revert commit 077d26f6d0bb15 (d554c2b)\n* Issue: Prevent Deleting All Topics (8d2b8c6)\n* Issue: Sub Queues (8e3a6c6)\n* authtoken: Add ticket link when recipient is ticket owner (2be608c)\n* redactor: Improper Formatting When Double Spacing (fe26123)\n* forms: Add SECRET_SALT to field name hash (4eeb4b5, 133362d)\n* issue: Better URL Parsing For External Inline Images (50eed90)\n* Issue: Default Delimiter (f302503)\n* issue: Update Autocomplete (d3245b1)\n* Fix incorrrect compare locked staff at Ticket Preview (e8f0c58)\n* Don't use a default comment on ticket assignment (433e62d)\n* Issue: Ticket Export Delimiters (38dbe73)\n* CsvImporter: Skip Byte Order Mark (BOM) if present (9e1dfef)\n* Drop nested table from open new ticket (fb0164b)\n* issue: New Message Alert Recipients (ea9cd56)\n* issue: Custom REGEX Failure (4850b2a)\n* Issue: Ticket From Thread Attachments (1de3f6a)\n* cli: Manage.php Errors (239b9ba)\n* issue: Assignee Field (3c89117)\n* issue: Agent Password Reset With No Existing Password (101ebea)\n* More modern, cleaner DocBlock (84195ec)\n* issue: Ticket Merge Select2 (bffac98)\n\nosTicket v1.14.3\n================\n### Enhancements\n* select2: Update To 4.0.13 (b67c75b)\n* jquery: Update To 3.5.1 (121ab41)\n* redactor: Upgrade to version 3.4.2 (384fe27)\n* Issue: Template Variables in Ticket Filter (8ef505d, 8a82d1e)\n* issue: Get Team Members For Alerts (d88e384)\n* Issue: Topic Help Tip (66fc808)\n* Create SECURITY.md (165cf18, 0ecfceb)\n* redactor: Upgrade to version 3.4.1 (8f08a09)\n* inline: RichText Fields View First (d8ff946, a97ddba)\n* print: Update Icons and Add Titles (be18e46)\n* issue: Update Print Options Icons/Text/Title (b4cd46a)\n* refactor: Help Topic Status Refresh (2dee16b)\n* Adding translation to the dashboard plot labels. (ebfd68b)\n* Issue: Language Verification (a1e9342)\n\n### Improvements\n* oops: Local Inline Images (f6cd8c4)\n* Issue: Ticket Edit Save (3281e74)\n* Revert Topic Saving Fixes (0ff87f3)\n* issue: NOTLS For IMAP/POP Without SSL (7506937)\n* Update dynamic-field-config.tmpl.php (e847ddb)\n* Ticket Merge Translation Improvement (ba389a6)\n* oops: Task Missing Parentheses (b7684ad)\n* Issue: Create Task File Upload (87f5006)\n* issue: Delete Users With Tickets (9d2e1da)\n* DynamicField Update (c21452b)\n* issue: Form Field Help Text Not Null (e295c52)\n* export: Duplicate Results (b415baf)\n* issue: Email Template Internal Notes (8d6b9aa)\n* oops: Change lastupdate To updated For Tasks (03bedc5)\n* i18n: Redactor Files Not Included (f91308a)\n* Issue: Ticket Task Print (7b6ba94)\n* Issue: Topic Fields on Ticket Edit (f79a28a)\n* issue: Activity Notice getLastRespondent() (07024fc)\n* Issue: Create Team With Members (6f50e91)\n* i18n: Don't Store Files Under Branch Name (31dfc6e)\n* template: Add Ticket ID To Var Scope (351f8ec)\n* Issue: Topic and Department Columns (36778cc)\n* sla: Force Intval For Scientific Floats (9ea2e4d)\n* oops: JS Method Typo (58e559d)\n* issue: Signature Box No Longer Expands (5d68847)\n* install: Add Mark As Answered To All Access (0765571)\n* print: Client Print Not Respecting Identity Masking (5db5a72)\n* templates: %{ticket.thread.complete} Not Respecting Identity Masking (faec1a7)\n* issue: Filter Action Add Button (adc46ae)\n* install: Embedded Domain Whitelist (e0b5d81)\n* install: Schedule, SLA, and Help Tip Updates (88dd0aa, e589c1b, 1860db4)\n* Issue: Ticket Number Search (61443ef)\n* issue: PHP 7.4 Warnings (1aafa42, d93379e, 90f5985)\n* issue: Flush Model Cache (db5eb07)\n* Issue: PHP Warning (4997780)\n* issue: MySQL 8.0 {min,max} Value Error (bb54dea)\n* issue: Mass Delete Help Topics Warning (52fd884)\n* issue: Org Added Collabs (0ee25b8)\n* issue: Attachment Upload Configuration (2540350)\n\n### Performance and Security\n* security: Reported Vulns July-August 2020 (fb57082, d2491c1, d98c2d0, 518de22)\n* xss: FAQ Category On Errors (292e7dd)\n\nosTicket v1.14.2\n================\n### Enhancements\n* Task Inline Edit (ad04c05, 027c8d2, 7209b03, 2b8a6dc, 79b69aa, 49aba87, 1179d60, cc8d64e)\n* feature: Configurable Agents As Collaborators (5f5403d, bdcaeea, 9426e67, 4ed30c5)\n* Ticket Merge Modal Improvements (d31a0c7)\n* redactor: Double Spacing Optional (fa418e6)\n* inline: Set Help Topic Refresh Statuses (be4e01e)\n* lint: updateEstDueDate (a8fe0bd)\n* Ticket Merge Parent Status (bebc724)\n* Schedule Entry - getOccurrences algo. (0184473)\n* Queue Query Optimization (8c07c17)\n\n### Improvements\n* Issue: Merge Child Status (34af390)\n* 1.14 Misc. Fixes (869d117)\n* Issue: Filter Actions for Deleted Objects (b918e2d)\n* ui: improve action buttons (b25c66b, a11f882)\n* Misc. Fixes (e8acf81, f5d1664, aed5d6f, ac5f93e, 77577df, e397f03,\n* bfa7b57, 3c0dd3d, 5955c3a, c2b99ab, c9cc1e2, 51b5839)\n* Issue: Class AuditEntry Not Found (8023ba9)\n* oopsie: Revert errant delete by commit 027c8d29 (f16cd79)\n* lint: oopsie on undefined variable (4f19924)\n* issue: Move Owner Check to Ticket Collabs (7d44262)\n* oops: Update Schedule No Description (774d5f7)\n* revert: Agent Added Agent Collabs (cc7deda)\n* issue: AuditEntry Not Found (9e3ca8c)\n* issue: Collab Pass By Reference (a3a1d45)\n* Add AnnotatedField interface to  TicketTasksCountField (fbc1b11)\n* Audit Plugin Modal Fix (a883f90)\n* Issue: Duplicate Thread Entry Merge Records (ef6b7da)\n* export: User/Org Tickets (0cd4168)\n* i18n: Help Text Translate Button (cc2d0ab)\n* install: Task Title/Description Field Flags (6727ebb)\n* issue: Trailing Whitespaces Number Lookups (d8cb1e8)\n* issue: Duplicate Tickets in Lookup (95f9b83)\n* issue: BooleanField Inline Edit Value (23a463c)\n* issue: BooleanField Cannot Be Unchecked (1556242)\n* Issue: Managing Child Ticket Threads (7f85946)\n* Oops: Set Child Ticket Status (c216a72)\n* feature: Force HTTPS (1de9b4c)\n* Issue: Close Child Ticket Without Help Topic (2fb81aa)\n* Issue: Inline Edit Long Answer (608044d)\n* Issue: Ticket Link/Merge (bb0f9bd)\n* dept: Disable Auto Claim (3684879)\n* redactor: Cancel Button (3bab103)\n* issue: Redactor z-index (19cc9a0)\n* Issue: Overwriting thisstaff on Assign (77065f5)\n* Schedule Entry - Initial Occurrence Scope (3a41b09, 3da5bd7)\n* issue: mPDF Print Tables (2bd464f)\n* Clear Overdue Flag 4realz (057c817)\n* Ticket Merge/Link Defaults (3f93cd9)\n* User Audit Issue (97a55a4, 613b4ab)\n\n### Performance and Security\n* upgrade: Redactor 3.3.5 (4634a86)\n\nosTicket v1.12.6\n================\n### Enhancements\n* issue: Edit User Popup Perm (c73877d)\n* format: Strip PUA (Plane 16) (caeda93)\n* issue: New Task Alert (5dd123e, 3283050)\n* lint: Minified JS Warnings (0443715)\n* support: IE Discontinued (699728f)\n* issue: Shared Mailbox Auth (7bb9fd8)\n* plugins: Add Version Column (f86c93e, 5b0f1ce)\n* Issue: User Imports Headers (787417f)\n* Support message/rfc822 as attachments (af1c4a6)\n* tooltip: Email Username (edd1fc3)\n* Issue: Ticket Search Typeahead (9b9a56f)\n* Issue: Ticket Open URL (f2e2403)\n* Inline Edit Fields With Data Integrity (6015d04)\n\n### Improvements\n* issue: Show Custom Validation Message (ca6ad5c)\n* SLA Grace Period (b373b8f)\n* issue: DynamicForm i18n Instructions Decode (56d3d67)\n* issue: Information Field Help Text Decode (abb9799)\n* i18n: Help Text Formatting (6b8cc9b)\n* issue: ThreadEntryField Help Text (6370484)\n* issue: Department Parent (3f29845)\n* Add support for sub-query based constraints. (c069def, 6579cf4, f61748c, 0eeec7e)\n* Update class.filter.php (#5320) (f42f2baf)\n* Allow external UserAuthenticationBackend … (ffb179f)\n* Issue: New Agent Extended Access and Teams (d4b8b3a)\n* issue: Mass Process Add Users To Organization (6cc7c69)\n* i18n: TextareaField Placeholder (fa9df2b)\n* issue: Confirm Popup Promise (b1f881b)\n* Remove unnecessary PHP Notice in ORM (Fix #5432) (5dac549, 03e25a8)\n* session: Destroy Warning PHP 7.3 (e6f0483)\n* oops: is_numeric Soft Fail (7c9ed61)\n* Oops: User Import Fix (40b40f8)\n* validate: Validation Error Messages From Source (9e21dfd)\n* issue: PasswordField Validation (9cc5cb6)\n* issue: Multiple Choice Export (3005d42)\n* lint: Uninitialized Matches (7873c5b)\n* issue: PDF Global $ost (07878f5)\n* Spelling correction function name (44cbc30)\n* issue: Quotes In User Name (ea6fc44)\n* issue: Add Remote Collaborator (c60e2f3)\n* emoji: Strip From Subject (e3547ea, e24c78c)\n* Issue: DB Error #1054 (18c9311)\n* install: Forum and Docs Links (dddfede)\n* queue: Inherit Columns Option (2e146ad)\n* Issue: Help Topic Number Format (52c9c59)\n* issue: User Manage Org Name (7a6b85c)\n* issue: Require Client Login (5136198)\n* Fix confusing sentence (4e7d12c)\n* issue: Update Staff checkPassword() (0659338)\n* validate: Number Field Edit Zero (e6e4e90)\n* issue: New Agent Welcome Email (1949d4f)\n* queue: Inherit Columns Option (38df2c8, 1a32e2a, 4434a93)\n* Issue: Remove Referrals (2acf9aa)\n* mail: Mail_Parse::getAttachments () (d310740)\n* Issue: Blank Date Time (60ccbb7)\n* Issue: Thread Events for File Field Changes (4d43adf)\n* Issue: New Custom Fields (9591411)\n* Oops: Variable Overwrite (c048768)\n* session: Destroy Warning (8c69891)\n* Issue: DB Error #1064 Queue Counts (f26ce60)\n* notes: Confirm Deletion (0d86e7f)\n\n### Performance and Security\n* xss: All Reported Vulns (f705001, de41aeb, fc4c860, d54cca0, 6c724ea, 601fdcd)\n\nosTicket v1.14.1\n================\n### Improvements\n* Revert commit cedd6121 (7dd7bfa)\n* Clear Overdue On Reopen (6dc0b74)\n* Allow Repeatable Once Entries (cb9bb2f)\n\nosTicket v1.12.5\n================\n### Performance and Security\n* Hotfix: File data callback (d3e643d)\n\nosTicket v1.14\n==============\n### Enhancements\n* php: 5.6 Support (5e7497d, 5f3a8f4)\n* Oops: Lint Fixes (c5b15d6)\n* Update index.php (e7779e2)\n* Overdue oopsie (de7271d)\n* Ticket Task count (b4fca25)\n* Visibility: Move getJsComparator to Widget class (d3f46bf)\n* i18n spelling  oopsies (36b44f7)\n\n### Improvements\n* Require Between Date Entries (1aaee58)\n* Add Ticket Reference to Tasks (af97900)\n* Disabled SLA (2fe5370)\n* Queues:  Agents with no team assignment (a00cee9)\n* Ticket Merge Upgrade Patch (38fada0)\n* ticket-view: Add ZIP export option (5e5b6b8)\n* issue: Check $cfg iFrame (a6b8200)\n* feature: Separate SMTP Credentials (edb8ac6, d2cb614, 9d4bcb5, 093984b,\n* b6d13a2)\n* feature: Fetch From Mail Folder (d70dfc1, 901d30a)\n* feature: Configurable iFrame Whitelist (44200e5, 2330f47)\n* Ticket Merge: Close Children (6fef208)\n* Audit Log Plugin (9b80889, 8e3fd4d, bb3d092, 46a764f, 72974c8, 27cfd65,\n* 69da645, 349c982, 7cfc062, a4bd53b, e0ca7e2, d942b16, 2aacbd1, ff90638,\n* 40771ea, 30eeaf9, 2c350f3, f261283, 205b3ae, 5c91dc1, ac1e99c, 59e5d71,\n* 203c716, 54a175a, 5ba9e89, 419a478)\n* Issue: Organization Update (7b6bd90)\n* issue: Redactor Reset Buttons (8078d4d)\n\nosTicket v1.12.4\n================\n### Enhancements\n* issue: Spaces In Username (7c8f557)\n* i18n: KnowledgeBase JS (bce8296)\n* i18n: KnowledgeBase Category (5646e7c)\n* i18n: OpenSSL Error (af6f0e9)\n* Message Variable - %{message} (315c4e7)\n* Datatimepicker: Time format (f0fccbc)\n\n### Improvements\n* Highlight tab with error(s) (b81b703)\n* format: Clickable URLs (4f7569d)\n* Queue Pages Default (dff8bc1, 5105250)\n* Add Time boundaries to Between date range (cbc89b3, 31c97cf)\n* Clear Overdue Flag on Due Date Change (8c76d70)\n* db: System Time Zone (76087fc, d8adf85)\n* Modify Reopen Assignment (d50ebbb)\n* issue: Format File Name (bd427cd)\n* issue: DB Error #1062 (27c925c)\n* Issue: Edit Task Fields (05cbb75)\n* issue: In-Reply-To Header (8849c19)\n* orm: Refetch Failure (eb4bda8)\n* issue: Delete Org Session Failure (bbd0c25)\n* Feature: Mark as Answered permission option (2fcc664, 52aaa0b)\n* issue: Umlauts In Subject (cccdb15)\n* issue: Umlauts In Sender's Name (e3f42c3)\n* Fix use of possibly uninitialised $_SERVER['HTTPS'] (8e9b150)\n* issue: ACL Oopsie (4d774bc)\n* issue: Revert  fefed14 (c9be2e0)\n\n### Performance and Security\n* Arbitrary Method Invocation (4dfb77c)\n* Auth: Authentication Token Bypass (a9834d8)\n* mPDF: Remote Code Execution Vulnerability (6e039ab)\n* issue: Attachment Filter (9f4fbc2)\n\nosTicket v1.14-rc2\n==================\n### Enhancements\n* Oops: Lint Fixes (e76c64e)\n* Draft Saving in New Redactor (644da1b)\n* Cache Children Tickets (a0a58e4)\n* Make getChildrenTickets Static (42339c2)\n* Lint Fixes (98f4b37, 3eabaa1)\n\n### Improvements\n* Issue: Task Drafts (3e8bce4)\n* Lint Fixes (3eabaa1)\n* Issue: Task Collaborator Display (d1790f1)\n* Fix Link Sort (3a41a8a)\n* Issue: Unlinking From Child Ticket (c76cb21)\n* issue: Redactor QuickNotes (7251bcf)\n* Delete Thread Merge Conflict (d4b6ab6)\n* Custom Queue default sort selection (bbd2e80)\n* issue: Staff/User Email Length (b969407)\n* Queue Sort Options (d2611b5)\n* Default for Choice Fields (d85ede8)\n* Show list of nested help topics on edit (423c915)\n* Upgrader Issue: Ticket Flags (e0298f2)\n* issue: Ticket Filter Assignment Event (606993e)\n* Don't Delete Child Threads (24b220d)\n\nosTicket v1.12.3\n================\n### Enhancements\n* Datetime Formats (4709824)\n* issue: Revert 453e815 (ddde34b)\n* Revert \"issue: Advanced Search Default Sorting\" (d4befcd)\n* feature: Expanded Print View (b2bd45f)\n* i18n: Register Include (9b18dd6)\n* Lint Fix (68f11e1)\n* Update osTicket Requirements (a6a18ee)\n* Update osTicket Requirements (27f1578)\n* issue: Update Installer PHP Requirements (15d678b)\n* issue: Update Outdated Links (25bf88f)\n\n### Improvements\n* issue: Mbstring Extension Requirement (5a96884)\n* Instantiate  StaffDeptAccess (390ec3e)\n* issue: Complete Thread Var Padding (Outlook) (d96285f)\n* Issue: Empty Due Date (30f3b55)\n* issue: PHP 7.3 New Agent Set Password (1bcd0e2)\n* European Date Format Issue (df7306f)\n* issue: CSV Patch Adv. Search Error (6ea7526)\n* Issue: Annul Closed Events (8029b1b)\n* issue: Department Referral Email (26d2990)\n* Date Range Period Timezone (0f06f85)\n* Issue: Undefined Constant Warning (c2ca730)\n* issue: Support Exchange Shared Mailbox Auth (ac9ea5b)\n* Issue: Inline Ticket Assignment (b757ec4)\n* issue: Dashboard No Help Error (ab0cdc6)\n* Organization Update (1588344)\n* issue: Advanced Search Default Sorting (dda483e)\n* issue: Image Attachment View (eb1a4ea)\n* issue: Reset Role Permissions (0c2cecb)\n* issue: Error On QueueSort Config (1b1e742)\n* Required Short Answer Field = '0' (c58916b)\n* Fix Admin Alert (5f6bd42)\n* issue: Set Staff Password On Creation (d9108b1)\n* issue: THIS_VERSION Utilize MAJOR_VERSION (5b4c512)\n* Issue: Reopen Assignment (e73e881)\n\nosTicket v1.14-rc1\n==================\n### Major New Features\n* Feature: Merge/Link Tickets (a8a4dec…c870df0)\n* Introducing Schedules / Business Hours for SLAs (54e06e9…39771f8)\n* Export Revisited (19ac222…045f6a6)\n\n### Enhancements\n* Ticket Merge Code Fixes (06faacb)\n* Custom Priority Field Blank (f7ea1f6)\n* Field Length Truncate (4d6de40)\n* Formatting cleanup (d0de290)\n* issue: Fix Patch Issue (8a8167e)\n* Code Cleanup (6ff4491)\n* Add thread_type Patch (9f9292f)\n* Modify Draft Saving (e06fb46)\n* Don't require refresh for inline edit (1071d10)\n* ORM Parentheses Patch (fff2e29)\n* Delete Threads/Entries of Deleted Tickets (a39c115)\n* issue: Form Field Flags (94e770a)\n* issue: User/Org Ticket Export (25153ed)\n* Add thread_type Patch (15ed4b1)\n* queue: Add Filtering To Queues (cedd612)\n* issue: Default Queue Sorting (6db9507)\n* Fix Saving For Fields: (c3eaec1)\n* Issue: Queue with Teams in Criteria (d8b61e8)\n\nosTicket v1.12.2\n================\n### Enhancements\n* issue: v1.12 Git MAJOR_VERSION (3f80266)\n\n### Improvements\n* issue: README.md osTicket Logo (7121043)\n* issue: README.md Image Size (8b90010)\n* issue: DatetimeField Remove Unused Vars / Use parseDateTime() (d9aa91b)\n\nosTicket v1.12.1\n================\n### Enhancements\n* issue: Queue Sort Title No Validation Error (029b0f2)\n* Issue: Tickets Visibility (60aa7b8)\n* task: Implement edit of task thread (394ddee)\n* Reformat Incorrect Reply-To Headers (e9dda94)\n* DatetimeField: Add jquery-ui-timepicker-addon (dbff3b2)\n* Add/Remove Collaborators Without Refresh (5a5044a)\n\n### Improvements\n* issue: API Unexpected Data Warnings (4f68eb9)\n* Double semicolon removed (bacd836)\n* Empty extra in list_items (1309a6c)\n* Issue: Ticket Alerts vs Dept Recipients (581f1f9)\n* issue: iFrame Single Quotes (4b59b4f)\n* issue: PDF Squares Instead Of Text (69c5095)\n* issue: Class Format Disposition Misspelling (1d3f1a3)\n\n### Performance and Security\n* Remove File Type Override (539d343)\n* Validate integrity of uploads (eba6fb9)\n* issue: Rogue Closing div Breaks HTML Thread Tree (3bb4c0a)\n* xss: Install Form (c3ba5b7)\n* security: CSV Formula Injection (9981848)\n* security: HTML File Browser Execution (Windows: Firefox/IE) (33ed106)\n\nosTicket v1.10.7\n================\n### Enhancements\n* Lint Fixes (8c878db)\n* cli: Package Better Wording (bf20bdd)\n\n### Improvements\n* queues: Fix compatibility issues with newer jQuery (c54372f)\n* FAQ Issues (ce3d69a)\n* cli: Package No File Permissions (25e6c6e)\n* oops: .eml/.msg Missing Not Operator (ce8aadf)\n* issue: Retained Deleted ListItem Errors (a3297a2)\n* issue: Account Registration Throws Errors (a720507)\n* issue: ISO-8859-8-i Charset Issues (4da0324)\n* issue: Search Reindexing Thread Entries (bbf1010)\n* issue: is_formula Dotall Mode (992e904)\n\n### Performance and Security\n* Remove File Type Override (539d343)\n* Validate integrity of uploads (eba6fb9)\n* issue: Rogue Closing div Breaks HTML Thread Tree (3bb4c0a)\n* xss: Install Form (c3ba5b7)\n* security: CSV Formula Injection (9981848)\n* security: HTML File Browser Execution (Windows: Firefox/IE) (33ed106)\n\nosTicket v1.12\n==============\n### Enhancements\n* issue: Upgrader Wrong Guide Link (#4739)\n* iframe: Allow Multiple iFrame Domains (#4781)\n* variable: Complete Thread ASC or DESC (#4737)\n* issue: Strip Emoticons (#4523)\n* feature: ACL (Access Control List) (#4841)\n\n### Improvements\n* issue: Maxfilesize Comma Crash (#4340)\n* issue: System Ban List (#4706)\n* queues: Fix compatibility issues with newer jQuery (#4698)\n* filedrop: Fix file drag and drop (#4719)\n* issue: PHP 7.2 Plugin Delete (#4722)\n* issue: Local Avatar Annotation (#4721)\n* Selected Navigation Item (#4724)\n* Issue: Attachments on Information Fields (#4730)\n* issue: No Save Button On Quicknotes (#4706)\n* Issue: Duplicate Tickets in Closed Queue (#4736)\n* issue: APC CLI (#4731)\n* users: Fix seaching of users (#4741)\n* issue: Custom Column Org Link (#4755)\n* issue: Internal Note Ignored (#4745)\n* issue: PHP 7.2 Ticket Status (#4758)\n* issue: Canned Response Variables (#4759)\n* issue: FAQ Search Results (#4771)\n* issue: FAQ Return Errors (#4772)\n* Queue Columns (#4785)\n* issue: Duplicate Form Titles (#4788)\n* Issue: Exporting Tickets (#4790)\n* issue: Organizations Users Sort (#4806)\n* issue: Multilingual FAQ Category w/ Parent (#4812)\n* issue: Task Print PDF (#4814)\n* Issue: MPDF Export PHP < 7.0 (#4815)\n* Quick Filter Fixes: (#4728)\n* Assignment Restriction Issue (#4744)\n* Issue: Saving Checkbox Values (#4798)\n* Issue: Choosing Fields to Export (#4797)\n* oops: Thread Variable Fatal Error (#4820)\n* oops: Emojis Strip Korean (#4823)\n* issue: iFrame On Install (#4824)\n* Issue: Ticket Export Headers (#4796)\n* issue: Organization Ticket Export No Filename (#4825)\n* MPDF Issues (#4827)\n* issue: sendAccessLink On NULL (#4828)\n* issue: sendAccessLink On NULL v1.11 (#4829)\n* Update README.md (eccc57a, e5f4180)\n* issue: iFrame Single Quotes (#4844)\n* issue: Choice Validation Accept Punctuation (#4847)\n* issue: ACL Move To Inc Files (#4848)\n* Issues since v1.11 release (#4850)\n* PJAX: Increase default timeout (#4855)\n* Mime Decode - Encoded char (#4851)\n* MPDF Tasks (#4856)\n* issue: .eml/.msg Attachments (#4857)\n* issue: Task EstDueDate (#4862)\n* Bug fixes and enhancements for v1.11 (#4863)\n* Mailer: Allow for ability to pass -f option as from_address (#4864)\n* Ticket Link: Always return a link (#4865)\n* Minor Fixes (e628373)\n\n### Performance and Security\n* xss: XSS To LFI Vulnerability (#4869)\n* jquery: Update Again (#4858)\n\nosTicket v1.10.6\n================\n### Enhancements\n* issue: Upgrader Wrong Guide Link (#4739)\n* iframe: Allow Multiple iFrame Domains (#4781)\n* issue: Strip Emoticons (#4523)\n\n### Improvements\n* issue: Maxfilesize Comma Crash (#4340)\n* issue: No Save Button On Quicknotes (#4706)\n* issue: PHP 7.2 Ticket Status (#4758)\n* issue: Canned Response Variables (#4759)\n* issue: FAQ Search Results (#4771)\n* issue: FAQ Return Errors (#4772)\n* issue: Duplicate Form Titles (#4788)\n* issue: Organizations Users Sort (#4806)\n* oops: Emojis Strip Korean (#4823)\n* issue: iFrame On Install (#4824)\n* issue: sendAccessLink On NULL (#4828)\n* Update README.md (eccc57a, e5f4180)\n* issue: iFrame Single Quotes (#4844)\n* issue: .eml/.msg Attachments (#4857)\n\n### Performance and Security\n* xss: XSS To LFI Vulnerability (#4869)\n* jquery: Update Again (#4858)\n\nosTicket 1.11\n=============\n## Major New Features\n* Release Ticket Assignment (d354e095)\n* Require Help Topic To Close Ticket (#4400)\n* Disable Collaborators On Reply (#4420)\n* Complete Thread Variable (#4613)\n* Public Mark As Answered/Unanswered (#4612)\n\n###Enhancements\n* Canned Response Select2 (#4311)\n* filters: Move to the ORM (3c1bc3d9)\n* oops: New sessions require non-null data (0d58a28a)\n* issue: IE White Screen Of Death (#4346)\n* Recipients Icon  View Email Recipients for Users (8c707b5d)\n* Collaborator Fixes: (a4de3514)\n* Collaborator Thread Event for Web Portal: (0b34753c)\n* Collaborator Tickets Visibility Fix: (98dc5d9b)\n* thread: getId On Non-Object (e3b333ed)\n* Email Recipients Revisited Corrections (731c9fe9)\n* Ticket-View Collaborator Collapsible Fix: (7be98ee7)\n* mailer: EmailAddress Object as Array (#4368)\n* collab: @localhost Mailer Error (#4380)\n* SavedSearch Fixup (eadccc2a)\n* Help Topic Inline Save Fix: (00a3be21)\n* Email Name Format: (#4396, #4500)\n* issue: Saved Searches Flags (#4395)\n* queue: Improve queries necessary for rendering (#4342)\n* status: Allow Reopen (#4411)\n* Agent Default Queue: (#4412)\n* Referral Assignment Issue: (#4414)\n* Team Referral Check (#4415)\n* Implement 'Select Active Collaborators': (#4420)\n* Upgrader: Old search criteria (#4421)\n* Advanced Search: TicketStatus / Status Name (#4423)\n* Search All Tickets Setting (#4424)\n* queues: Column Conditions Overwrite (#4445)\n* queues: Row Conditions (#4444)\n* issue: Multiple File Display (#4427)\n* Staff Profile Updates: (#4462)\n* Charset: Add generic transcode php_user_filter (#4469)\n* issue: Image CID Attributes (#4477)\n* Filter Action Saving Fix: (#4475)\n* issue: Session form-data Files (#4482)\n* issue: Default Help Topic Issue Summary (#4484)\n* Implement Referral Internal Notes (#4486)\n* issue: Existing User Registration (#4488)\n* Adjust Filter Saving (49edbb3e)\n* oops: Selection Search Bug (#4495)\n* Filter Action Send an Email Issue (#4502)\n* Optimize Upgrade: Remove ThreadEvent 'state' Enum (ebca2f9a)\n* Creating Tickets with Attachments (47920c49)\n* issue: Duplicate Personal Queues (#4503)\n* issue: Newly Added Queues (#4504)\n* Help Topic: Ignore invalid help topics (d93bb51b)\n* footer: htmlchars company name (f6687f0f)\n* Thread Entry: Chucked body (aff9bcb6)\n* Filters: Cleanup filter actions on delete (6372b9c)\n* orm: Add route to merge InstrumentedList (4a793a9)\n* Search: Add duedate to base fields (b8bdd27)\n* DateTimeFilter: Support empty value (95856cd)\n* Export: Make Export Fast Again (#4479)\n* DatetimeField: Format (8623ed60)\n* Oops: Creating Tickets with Attachments (#4508)\n* Column Annotation (2f7e3a01)\n* Add NumericField (af829e82)\n* Add Queue Columns Annotation as Fields. (aa0924a8)\n* Retain Help Topics for Emails (#4512)\n* export: Field Display (8adbd37d)\n* Filter Action Validation Fixes (#4513)\n* Advanced Search Column Conditions (#4514)\n* Update Thread Events in Batches (bea99ae3)\n* Update Fresh Install Process (fce25fbc)\n* View All Tickets for User (#4528)\n* Ticket Sources (#4534)\n* Add period to DateTimeField (#4535)\n* Form Attachment Issues (#4539)\n* Attachment Names Issue (#4540)\n* File Disposition (0c6e9acc)\n* Primary Queues Buckets (#4538)\n* Saving Changes to Filters (5f5951d2)\n* Event Migration Optimization (#4561)\n* Add new API headers to whitelist (#4563)\n* upgrade: Actually re-fetch the config from database (#4564)\n* issue: Export Event State Error (#4569)\n* issue: Delete User Error (#4570)\n* Dashboard Statistics Issue (#4574, #4585)\n* issue: ticket_link Fatal Error (#4575)\n* Queue Counts (#4572)\n* issue: Queue sort_id (#4577)\n* FileUploadField Validation (#4581)\n* Status Column: Fix display and sorting (#4582)\n* queue: Top-Level Ticket Counts (#4580)\n* Deleting the Default Queue (#4576)\n* issue: Email Default Dept (#4588)\n* issue: create_date Variable (#4589)\n* issue: FAQ/Page Attachments (#4595)\n* Forms: Field Permissions (#4593)\n* Field: Help Topic Forms (#4601)\n* Task Collaborators (#4640)\n* Issue: Edit Export Column Heading (#4649)\n* Clarify User Import Instructions (#4651)\n* Issue: Duplicate Search Results (#4630)\n* Issue: DynamicFormEntry render (26ebcae0)\n* Issue: Filters (#4655)\n* issue: Task Response With Collaborators (#4661)\n* issue: Scrollable Quickfilters (#4663)\n* profile: Reply Redirect (#4656)\n* Oops: Modify 0 in Short Answer Field Fix (#4670)\n* Issue: Mass Assign (#4671)\n* issue: SubQueues Hide PersonalQueues (#4682)\n* issue: New Ticket Field Permissions (#4683)\n* issue: Remove Referral Borked (#4684)\n* Fix crashes compiling language packs on PHP 7 (#4688)\n\n###Performance and Security\n* PHP v5.6-v7.2 Support (#4680)\n* Latest jQuery Upgrade (#4672)\n* Update To Latest mPDF (460b445)\n\nosTicket 1.11.0-rc.1\n====================\n## Major New Features\n* Create Ticket or Task from Thread Entry\n* Custom Columns/Custom Queues\n* Inline Edit\n* Ticket Referral\n* CC/BCC\n* Export Agent CSV\n* Department Access CSV\n* Archive Help Topics/Departments\n* Nested Knowledgebase Categories\n\n### Enhancements\n* Fix Custom Department Field (#3976)\n* Remove Future Search/Filter Criteria if Invalid\n* Dashboard Statistics\n* Fix Vimeo iFrames\n* Fix randNumber()\n* Section Break Hint\n* List & Choice Searching (#3703, #3493, #2625)\n* Adds osTicket Favicons (#4112)\n* Fix Most Redactor Issues (#3849)\n* Send Login Errors Still Sends (#4073)\n* Private FAQs In Sidebar Search\n* User Password Reset (#4030)\n* Disabled & Private Help Topic (#3538)\n* Helpdesk Status Help Tip\n* Local Names In Validation Errors\n* User Registration Form (#4043)\n* Organization User List Pages Link (#4116)\n* Ticket Edit Internal Note (#4028)\n* Disable Canned Responses On New Ticket (#3971)\n* Canned Response Margin\n* Ticket Preview Custom Fields\n* Help Topic SLA (#3979)\n* Fix Agent Identity Masking (#2955, #3524)\n* Force Keys For Choice Field Options (#4071)\n* Check Missing Required Fields\n* Task Action Button Styling\n* Add Fullscreen To Embedded Videos\n* Fix Serbian Flag Icon (#3952)\n* Optimize Lock Table\n* Fix Outdated Alerts Link (#3935)\n* Fix Default Dept. Private Error (#3934)\n* Mailto TLD Length (#4063)\n* Remove Primary Contacts (#3903)\n* Fix Reset Button(s) (#3670)\n* Newsletter Link\n* Offline Page Images (#3869)\n* User Login Page Translation (#3860)\n* Translate Special Characters (#3842)\n* Custom Form Deletion (#3542, #4059)\n* Client Side Long FAQ Title (#3380)\n* Client FAQ Last Updated Time (#3475)\n* Email Banlist Sorting (#3452)\n* Fix New Ticket Cancel Button (#2624, #2881)\n* SQL Error Unknown column 'relevance' (#2655)\n* Fixes issue with last_update ticket variable\n* Ticket Notice Alert\n* Fix CSRF fail + shake effect (#3928, #3546)\n* Issue/ticket preview collabs\n* Allowing translation of copyrights in footers\n* User/Organization are not translated (#3650)\n* Fix DatePicker on client side (#3625, #3817, #3804, 0fbc09a)\n* Add Custom Forms to Ticket Filter Data\n* Fix for LDAP/AD auth plugin (#4198, #3460, #3544, #3549)\n\nosTicket v1.10.5\n================\n### Enhancements\n* issue: Translation Flags Not Clickable (#4687)\n* issue: Hide Task Loading Overlay (#4660)\n* Issue: Tasks Within Tickets (#4653)\n* issue: Dashboard Export Period (#4650)\n* Improve the Staff login (#4629)\n* oops: Remove DST From User Update (#4599)\n* issue: Dupe Page Requests Fix (#4568)\n* change old wiki urls to new doc urls (#4517)\n* oops: Class GenericAttachment Not Found (#4481)\n* issue: Duplicate Page Requests (#4472)\n* forms: Render Instructions (#4494)\n* accessibility: Screen Readable Actions (#4490)\n* forms: Disabled By Help Topic Users (#4476)\n* issue: CDATA Phone Contains (#4471)\n* Tasks: Task visibility (#4467)\n* issue: mPDF SetAutoFont RTL (#4466)\n* issue: SelectionField nset (#4465)\n* cron: Clean Expired Passwd Resets (#4451)\n* sessions: Clear On Password Set/Reset (#4450)\n* Make getFiles() return files (#4410)\n* issue: mPDF Arabic Fonts (#4455)\n* issue: Task Term Search (#4453)\n* Relative Time Fixes: (#4452)\n* perms: Alphabetize Role/Staff Permissions (#4439)\n* issue: Ticket Filter Does Not Match Regex (#4443)\n* Task Assigned Team Issue: (#4437)\n* issue: FAQ & Canned Attachments Dropping (#4428)\n* issue: Wrong Attachment Names (#4426, #4425)\n* issue: Featured FAQs On Disable (#4416)\n* issue: Deleted Field Thread Events (#4394)\n* issue: Custom File Upload Dropping (#4406)\n* issue: Priority Field Template Variable (#4390)\n* issue: Client Side Thread Entries (#4383)\n* Web Portal Fixes: (#4369)\n* issue: jQuery Sortable Redactor (#4381)\n* issue: CLI Deploy Missing Bootstrap Fix (#4363)\n* issue: Client Side Column Sorting (#4362)\n* issue: ChoiceField Template Variable (#4359)\n* issue: TextThreadEntryBody Sanitize (#4355)\n* issue: Installer Footer Copyright (#4351)\n\n### Performance and Security\n* Latest jQuery Upgrade (#4672)\n\nosTicket v1.10.4\n================\n### Enhancements\n* issue: Auto-Assignment Log (#4316)\n* issue: Language Pack Locale Mismatch (#4326)\n* issue: CLI Deploy Missing Bootstrap (#4332)\n* issue: User Import No Email (#4330)\n* issue: Ticket Lock On Disable (#4335)\n\n### Performance and Security\n* security: Fix Multiple XSS Vulnerabilities (#4331)\n* department: Error Feedback (#4331)\n\nosTicket v1.10.3\n================\n### Enhancements\n* issue: Org. User Account Status (#4219)\n* upgrader: Flush Cache On Upgrade (#4227)\n* issue: Outlook _MailEndCompose (#4206)\n* issue: Files - deleteOrphans() (#4253)\n* issue: Fix imap_open Disable Authenticator (#4195)\n* Check permissions before displaying Close Task (#4177)\n\n### Performance and Security\n* issue: Information Page Performance (#4275)\n* issue: Prevent Click Jacking (#4266)\n* orm: queryset: Fix circular reference error (#4247)\n\n\nosTicket v1.10.2\n================\n### Performance and Security\n* Prevent Account Takeover (be0133b)\n* Prevent Agent Directory XSS (36651b9)\n* Httponly Cookies (5b2dfce)\n* File Upload Bypass (3eb1614)\n* Only allow image attachments to be opened in the browser window (4c79ff8)\n* Fix randNumber() (5b8b95a)\n* CSRF in users.inc.php URL (285a292)\n* AJAX Reflected XSS (e919d8a)\n\nosTicket v1.10.1\n================\n### Enhancements\n* Users: Support search by phone number\n* i18n: Fix getPrimaryLanguage() on non-object (#3799)\n* Add TimezoneField (#3786)\n* Chunk long text body (#3757, 7b68c994)\n* Spyc: convert hex strings to INTs under PHP 7 (#3621)\n* forms: Proper Field Deletion\n* Move orphaned tasks on department deletion to the default department (42e2c55a)\n* List: Save List Item Abbreviation (8513f137)\n\n### Performance and Security\n* XSS: Encode html entities of advanced search title (#3919)\n* XSS: Encode html entities of cached form data (#3960, bcd58e8)\n* ORM: Addresses an SQL injection vulnerability in ORM lookup function (#3959, 1eaa6910)\n\n\nosTicket v1.10\n==============\n### Enhancements\n * Support Passive Email Threading (#3276)\n * Account for agents name format setting when sorting agents (#3274, 5c548c7)\n * Ticket Filters: Support Lookup By Name (#3274, ef9b743)\n * Enable preloaded canned responses by default (#3274, 7267531)\n\n### Improvements\n * Task: Missing Description on create (#3274, 865db9)\n * Save task due date on create (#3438)\n * Show overlay on forms submit (#3426, #3391)\n * upgrader: Fix crash on SequenceLoader (#3421)\n * upgrader: Fix undefined js function when upgrading due to stale JS file (#3424)\n * Use help topic as the subject line when issue summary is disabled (#3274, 74bdc02)\n * PEAR: Turn off peer name verification by default (SMTP) (#3274, 4f68aeb)\n * Cast orm objects to string when doing db_real_escape (#3274, e63ba58)\n * Save department on __create (#3274, c664c93)\n * Limit records to be indexed per cron run to 500 (#3274, 9174bab)\n\n### Performance and Security\n * Fix memory leak when applying 'Use Reply-To Email' ticket filter action (#3437, 84f085d)\n * XSS: Sanitize and validate HTTP_X_FORWARDED_FOR header (#3439, b794c599)\n * XSS: Encode html chars on help desk title/name (#3439, a57de770)\n\nosTicket v1.10-rc.3\n===================\n### Enhancements\n  * Compatibility with PHP7 (#2828)\n  * Share tickets among organization members (#2405)\n  * Add lock semantics compatible with v1.9 (lock on view) (f826189)\n  * Staff login backdrop is customizable (#2468)\n  * Add advanced search for closed date, thread last message, thread last\n    response (#2444)\n  * Disable auto-claim by department (#2591)\n  * Properly flag SYSTEM thread postings (#2702)\n  * Add option to use dept/agent name on replies (#2700)\n  * Add a preference option to set the sort order of the thread entries in DESC\n    or ASC order (#2700)\n  * Thread dates can be shown as relative or absolute timestamps (#2700)\n  * Make Avatars optional on thread view (#2701)\n  * Make Authentication Tokens Optional (auto-login links in emails) (#2714)\n  * Use icons for ticket and task actions (#2760)\n  * role: Add option to use primary role on assignment (#2832)\n\n### Improvements\n  * All improvements cited in v1.9.12 and v1.9.13\n  * Fix deleting of custom logos (#2433)\n  * Fix assignment setting on new tasks (#2452)\n  * Fix subject display of non-short-answer fields on ticket view and ticket\n    queue (#2463)\n  * Fix advanced search of ticket source (#2479)\n  * Forbid adding deleted forms via \"Manage Forms\" (#2483)\n  * Use horizontal tabs for translatable article content rather than the left\n    tabs in a table (#2484)\n  * Fix lock expiration time if PHP and database have different time zones\n    (#2533)\n  * Fix user class and ID matching from email headers (#2549)\n  * Fix emission of `Content-Language` header in client portal for multiple\n    system languages, thanks @t-oster (#2555)\n  * Fix deployment of fresh git repo or download on PHP 5.6 (#2571)\n  * Fix handling of abbreviated database timezones like `CDT` (#2570)\n  * Fix incorrect height display of avatars (#2580, #2609)\n  * Sort help topic names case insensitively, thanks @jdelhome3578 (#2530)\n  * Fix detection of looped emails (f2cac64)\n  * Fix crash in ticket preview (popout) if ticket has no thread (bd9e9c5)\n  * Fix javascript crash adding new ticket filter (d2af0eb)\n  * Fix crash if the `name` field of a user is a drop-down (ec0b2c5)\n  * Fix incorrect SQL query removing departments (cf6cd81)\n  * Properly fallback to database file storage if system is misconfigured (1580136)\n  * Fix crash handling fields with `__` in the name in the VisibilityConstraint\n    class (b3d09b6)\n  * Remove staff-dept records when removing an agent (ecf6931)\n  * Avoid crashing processing ORM records with NULL select_related models (#2589)\n  * Fix several full-text search related issues (#2588, #2603)\n  * Fix crash sending registration link for a guest user (#2552)\n  * Avoid showing lock icon for expired locks on ticket listing (#2617)\n  * Fix incorrect redirect from SSO authentication, thanks @kevinoconnor7\n    (#2641)\n  * Fix vertical overflow of uploaded image preview (#2616)\n  * Fix unnecessary dropping of CDATA table on MySQL 5.6 (#2638)\n  * Fix several issues on user directory ticket listing (#2626)\n  * Fix encoding of attachment filenames in emails (#2586)\n  * Fix warning rendering advanced search dialog, thanks @t-oster (#2594)\n  * Fix bounce message loop for message alert to a bad agent email address\n    (#2639)\n  * Make fulltext search optional on user lookup (#2657)\n  * Add the [claim] feature again (#2681)\n  * Fix agent's Signature & Timezone dropped on update (#2720)\n  * Fix crash in user CSV import (#2708)\n  * Fix crash in user ajax lookup (#2600)\n  * Send Reference and In-Reply-To headers only for thread items pertinent to\n    the receiving user (#2723)\n  * Properly clean HTML custom fields (#2736)\n  * Fix changing/saving properties on internal ticket statuses, with the\n    exception of the state (#2767)\n  * Fix CSV list import (#2738)\n  * Fix late redirect header for single ticket typeahead result (#2830)\n  * Add sortable column headers in the ticket and task queues (#2761)\n  * Fix several issues with the file CLI app (#2808)\n  * Fix config crash on install (#2827, #2844)\n  * Set due date based on user's timezone (#2812, #2981)\n  * Fix crash rendering some email addresses to string (#2844)\n  * Fix crash rendering thread with invalid timestamps (#2844)\n  * Log assignment note (comments), if any, when staff created ticket is\n    assigned (#2944)\n  * Change transient SLA, on transfer,  if target department has a valid SLA\n    (#2944)\n  * Fix typo on task transfer modal dialog (#2944)\n  * Fix ticket source on ticket edit (#2944)\n  * Convert user time to database time when querying stats (#2944)\n  * Fix date picker clearing input on invalid date format (#2944)\n  * Show topic-specific thank-you page (#2915)\n  * Department manager can be excluded from the new ticket alert (#2974)\n  * Do not scrub iframe `@src` attribute (#2940)\n\n### Performance and Security\n  * Use full-text search for quick-search typeahead boxes (#2479)\n  * Speed up a few slow and noisy queries (5c68eb3, 340fee7, 208fcc3)\n  * Lower memory requirements processing attachments (#2491, #2492)\n  * Ensure agent still has access when reopening a ticket (#2768)\n  * Always perform validation server-side for ajax uploads (#2844)\n  * Protect access to files shown in the FileUpload field (#2618)\n  * Decode entities prior to HTML scrubbing (#2940)\n\n### Known Issues\n  * Uploading multiple files simultaneous (via drag and drop) will cause some\n    files to be dropped\n\nosTicket v1.10-rc.2\n===================\n### Enhancements\n  * Lazy locking system for ticket locking (#2325, #2351, 37cdf25, de92ec5,\n    37a0676)\n  * Add settings for avatars and local \"Oscar's A-Team\" avatars (#2334)\n  * Several UI tweaks (7436195, #2426)\n  * Add transfer and assign mass actions to tickets (#2375)\n  * Import agents from the command line (#2323)\n  * User select dialog can be opened after closing in new ticket by staff\n    (605c313)\n  * Deadband new message alert and autoresponse to once per five minutes per\n    user per thread (598dedc)\n  * [Add Rule] button to add many new rules at one to a ticket filter (c03279d)\n\n### Improvements\n  * Fix several install and upgrade-related issues (fc10dcb, e1ca975, b709139,\n    abc8619, #2411, 832ea94, abb9a08, e3bb6c2, 8e373d4)\n  * Fix database timezone detection on Windows (#2297)\n  * Fix several tasks related issues (#2311, #2344, #2376, #2400, #2421, c3d48a9)\n  * Fix hiding of department-specific canned responses (#2315)\n  * Fix add and edit of ticket status list items (#2314)\n  * Fix incorrect definition of some ORM tables (#2324, 69839af)\n  * Fix crash rendering a closed ticket (#2328)\n  * Fix case-insensitive sorting of help topics (#2357)\n  * Fix several advanced search related issues (#2317, 3d4313f, ce3ceae,\n    b5e6d4e, 5a935ca)\n  * Fix incorrect SQL deleting a department (#2359)\n  * Fix incorrect array usage of department members for alerts (#2356)\n  * Add missing perm for view all agents' stats (#2358)\n  * Fix missing thread inline images from redactor image manager (be77da4)\n  * Fix updating configuration for file upload fields (2f4f9c1)\n  * Fix crash creating tickets with canned attachments (a156bba)\n  * Fix missing inline images in mailouts (84c9b54)\n  * Prefer submitted text over last-saved draft (46ab79b)\n  * Fix incorrect FAQ link in front-page sidebar (ea9dd5f)\n  * Fix missing assignee selection on new ticket by staff (7865eee)\n  * Fix issue details showing up on ticket edit (a183a98, 7fbd0f6)\n  * Fix inability to change SLA on some tickets (#2392)\n  * Fix auto-claim on new ticket by staff if a filter added a canned reply (c2ce2e9)\n  * Fix Dept::getMembersForAlerts() missing primary members (abc93efd)\n  * Fix inability to create tickets if missing the ASSIGN permission on all\n    depts (0c49e62)\n  * Fix inability as staff to reset a user's password (0006dd8)\n  * Render fields marked !visible and !editable, but required on the client\n    portal (7f55a0b)\n  * Fix sorting of help topics (a7cc49f, 08a32a4)\n  * Fix new message alert to a random staff member (d3685a9)\n  * Fix saving abbreviations on new list items (538087b)\n  * Fix parsing of some multi-part MIME messages (c57c22a)\n  * Fix numerous crashes\n\n### Performance and Security\n  * Improve performance loading the ticket view (6bba226, 4b12d54)\n  * Improve performance loading queue statistics (0a89510, 6b76402)\n  * Dramatically improve full-text search performance (167287d)\n\nosTicket 1.10\n==================\n## Major New Features\n\n### Internationalization, Phase III\n![screen shot 2014-10-18 at 11 40 38 pm](https://cloud.githubusercontent.com/assets/672074/4692086/b16b1474-574a-11e4-89e7-b871ff591802.png)\n\nPhase III of the internationalization project is the next major advancement of\nosTicket language support. The greatest improvement is that all\nadministratively customizable content. While this is a great last mile for many\nmultilingual support teams, we've also revisited the client interface main\npages as well as the knowledge base on both the client and staff panels.\n\n  * Elect primary and secondary languages\n    * Any language can be the primary, any number of languages can be secondary\n    * English-US can be disabled\n    * Order of secondary languages is sortable and controls flag order\n  * All content is translatable to secondary languages\n      * Help Topics\n        * Alphabetic sorting happens after translation\n      * SLA Plans\n      * Departments\n      * Custom Forms (and all configurations such as placeholders)\n      * Custom Lists\n        * Items\n        * Properties and configurations\n      * Site Pages\n      * FAQ Categories\n      * FAQ Articles\n        * Common attachments (available for all translations)\n        * Per-language attachments\n      * Content such as welcome emails and password-reset emails\n  * Olson timezones are used instead of GMT offset\n    * Auto-detect support for agent and client timezone\n  * Time and date formats can be automatic by locale preference now.\n    * Locale preference is the default\n    * Locale preference with forced 24-hour time is also an option\n    * Advanced format is also possible using the intl library and `sprintf` as a backup\n    * Formats including the day of the week are localized\n    * Chinese and Arabic formats using alternate day, month, and year digits and separators are now automatic.\n  * Client portal has HTML headers indicate search engine links to pages of other\n    languages, as well as the Content-Header HTTP header to indicate the intended\n    audience\n  * Spell check in text boxes, textareas and rich text editors should respect the\n    language of the content being edited\n\n### Tasks\n![screen shot 2015-05-06 at 12 36 14 pm](https://cloud.githubusercontent.com/assets/672074/7616658/c5147c68-f96b-11e4-85b7-e74a3482bb4f.png)\n\nTasks are sub-tickets which can be created and attached to tickets as well as\ncreated separately. Tasks have their own assignees, department routing and\nvisibility, due date, and custom data. Tasks have their own threads and can\nhave a list of collaborators. All in all, tasks may very well be the greatest\nadvancement of osTicket since the advent of the ticket itself.\n\n### New Advanced Search\n![screen shot 2015-05-13 at 12 35 15 pm](https://cloud.githubusercontent.com/assets/672074/7616759/94616a1c-f96c-11e4-8c19-ae1ca26a85c0.png)\n\nThe advanced search feature is rewritten to address several  shortcomings of\nthe original feature as well as a host of new features including\n  * Search by any field, built-in or custom\n  * Save your searches\n  * Advanced search is shown as a new queue\n  * Current advanced search criteria is maintained between searches\n  * Sorting options are relevant to queue and preference remains after navigation between queues\n\n## Minor New Features\n\n### Thread editing\n![screen shot 2015-03-20 at 6 56 10 pm](https://cloud.githubusercontent.com/assets/672074/6762680/ce4e78a0-cf32-11e4-9316-c0a969e9c70a.png)\n\nThread items can now be edited. The original entries are preserved and are\naccessible via a thread item's \"History\". Items can be resent with or without\nediting them, and a signature selection is available when resending.\n\n### Roles, and custom extended access\n![screen shot 2015-05-03 at 9 05 12 pm](https://cloud.githubusercontent.com/assets/672074/7448163/257ce586-f1d8-11e4-8ed8-a11324d13027.png)\n\nThe group permissions component has been offloaded to a new component, named\n\"Roles\". Roles allow for naming a set of permissions. Agents now have a\n\"Primary Role\" which defines their access to global things like the user\ndirectory and their access for their primary department. Each department\ngranted via \"Groups\" is allows to be linked to a distinct \"Role\". This allows\ngranting Read-Only access to some departments, for instance.\n\n### Improved knowledge base interface\n![screen shot 2014-10-18 at 11 55 58 pm](https://cloud.githubusercontent.com/assets/672074/4692123/5ec01038-574c-11e4-80a7-7e8a8efe3963.png)\n  * \"Featured\" articles show on the front page\n  * Knowledge base search on front page\n  * Translatable content\n  * Locale-specific attachments\n\n### Multiple forms and disable individual fields for Help Topics\nHelp Topic configuration has a new super feature. Multiple forms can now be\nassociated with each help topic, and the order the forms should appear for new\ntickets and editing tickets is configurable. Previously, the custom forms were\nalways rendered above the \"Ticket Details\" form; but now it's completely\ncustomizable. What's more is that individual fields **including the issue\ndetails** can be disabled for any help topic.\n\n### Department hierarchy\nDepartments are now nestable. All departments can have a parent department, and\nthe hierarchy is arbitrarily nestable. Access is cascaded so that access to a\nparent department automatically extends access to all descendent departments.\n\n### Image annotation\n![screen shot 2015-05-04 at 9 07 38 pm](https://cloud.githubusercontent.com/assets/672074/7466027/ac34575c-f2a1-11e4-9335-417960f89334.png)\n\nImages can be annotated to add simple shapes like ovals, boxes, arrows and\ntext. Annotates can be committed, and a new image is created from the\nannotations; however, annotations can still be edited before the thread post is\nsubmitted. Annotations are supported for both clients and agents, and the\nimages can be selected from the ticket thread, so images already posted can be\neasily marked up.\n\n### Variable context type-ahead\n![screen shot 2015-04-20 at 4 32 58 pm](https://cloud.githubusercontent.com/assets/672074/7240963/ee930d8c-e77a-11e4-8928-26240274db13.png)\n\nWhen editing content which uses variables, such as a thank-you page or an email\ntemplate, variable placeholders now use a type-ahead feature. This new pop out\nsignificantly improves the connection between which variables are available in\nwhich templates. It also allows for adding significantly to the variable\nlibrary without relying on exhaustive documentation to convey this information.\nSome new variables include\n  * User lists, such as department members, team members, and collaborator lists\n  * Lists can be rendered as names, emails, or both\n  * Dates are format-able to time, short, full, and long\n  * Dates can be humanized to something like *in about an hour*\n  * Dates can be auto localized and formatted to the recipients locale and time\n    zone selection\n  * Attachments to thread items and custom fields can be attached via variable\n    (e.g. `%{message.files}`)\n\n### Redesigned list management\n![Simplified, tabular, paginated view of list items, with mass actions](https://cloud.githubusercontent.com/assets/672074/5881786/3040d162-a309-11e4-9529-8ae51d358f81.png)\n\nThe list management feature has a significant overhaul to accommodate larger\nlists. It also provides a heads display of list item properties as well as AJAX\nupdates. CSV import and pagination have also been added as well as mass enable,\ndisable, and delete.\n\n### Pluggable filter actions\n![screen shot 2015-05-04 at 8 59 32 pm](https://cloud.githubusercontent.com/assets/672074/7465977/801b4cbc-f2a0-11e4-9598-95dd52e79e82.png)\n\nFilter actions are now far more flexible allowing for more elaborate and\ncreative filter actions to be created. A new filter action has been added as an\nexample of future possibilities: send an email. The new feature allows for\nticket filter actions to be defined without modification to internal table\nstructures, and even allows actions to be created via plugins!\n\nActions are also sortable and performed in the order specified, which allows\ndoing something like sending an email before rejecting the ticket.\n\n### Other Improvements\n#### Custom Data\n* Fields have more granular access configuration. View, edit, and requirement\n  can be enabled individually for both agents and end users\n* Fields can be marked for required for closed. Therefore they can inhibit\n  closure of a ticket without a valid value.\n\n#### Export\nThe agent's locale is considered when exporting CSV and semicolon separators\nare used where necessary\n\n#### User Interface\nThe subject line and many other text fields around the system are truncated by\nthe browser, which fixes early truncation for some language with long Unicode\nbyte stream, such as Chinese.\n\n#### Improved lock system\nThe ticket lock system uses a code now which is rotated when updates to tickets\nare submitted. This helps prevent unwanted extra posts to tickets. A new\nannoying popup is displayed when viewing the ticket and the lock is about to\nexpire.\n\n#### Draft system\nThe draft system has been rewritten to reduce the number of requests to the\nbackend and to reduce the dreaded \"Unable to save draft\" popup\n\n#### ORM\nThe database query system is being redesigned to use an object relational\nmapper (ORM) instead of SQL queries. This will eventually lead to fewer\ndatabase queries to use the system, cleaner code, and will allow the use of\ndatabase engines other than MySQL. The ORM was originally introduced in\nosTicket v1.8.0, but has seen the greatest boost in capability in this release.\nAbout 47% of the SQL queries are removed between v1.9.7 and v1.10\n\nosTicket v1.9.12\n================\n### Improvements\n  * Fix missing search box adding user to organization (#2431)\n  * Fix incorrect update time on FAQ view in staff portal (194f890)\n  * Fix incorrect parsing of some multi-part MIME messages (fe62226)\n  * Fix auto-claim for new ticket by staff if a filter added a canned response\n    (eca531f)\n  * Fix malformed results on remote user search when adding users (#2335)\n  * Fix search by ticket number on client portal (#2294)\n  * Fix association of user email without a domain to an organization without\n    an email domain setting (#2293)\n\n### Performance and Security\n  * Revert poor performing ticket stats query (#2318)\n\nosTicket v1.9.11\n================\n*We skipped v1.9.10 to avoid confusion with v1.10 (the major release coming out at the same time)*\n\n### Enhancements\n  * Log to syslog on php mail() error (#2128)\n  * Full path of help topics shown in filter management (3d98dff)\n  * Auto rebuild the search index if %_search table is dropped (#2250)\n  * New version available message in system information (0cca608)\n\n### Improvements\n  * Fix appearance of ` <div>` in user names (*regression in v1.9.9*) (be2f138)\n  * Out-of-office notification does not clear closing agent (#2181)\n  * Fix check for departments limiting assignees to members only (#2143)\n  * Fix signal data pass by reference (#2195)\n  * Fix template variables not rendering in href attributes (#2223)\n  * Fix missing custom data for new users (#2203)\n  * Fix incorrect cli option expansion (#2199)\n  * Properly encode `To` header for php mail() sends (857dd22)\n  * Fix incorrect message body when fetching TNEF emails (0ec7cf6)\n  * Fix layout of some tables in PDF export (cef3dd3)\n\n### Performance and Security\n  * Fix XSS issue on choices field type (#2271)\n\nosTicket v1.9.9\n===============\n### Enhancements\n  * Properly balance stripped and invalid HTML (#2145)\n  * Add MANIFEST file to deployment process and retire duplicate code for packaging (#2052)\n\n### Improvements\n  * Fix inability to configure LDAP and S3 plugins (*regression*) (59337b3)\n  * Fix incorrect whitespace in search indexed HTML content (#2111)\n  * Add support for invalid `multipart/relative` content type (aaf1b74)\n  * Force line breaks for very long HTML lines (56cc709)\n\n### Performance and Security\n  * Fix slow query for ticket counts for large datasets (c4ace2d)\n  * Fix slow thread load query (thanks @torohill) (7b7e855)\n\nosTicket v1.9.8.1\n=================\n### Enhancements\n  * Add option to disable email address verification\n\n### Improvements\n  * Fix crash upgrading from osTicket v1.6\n\nosTicket v1.9.8\n===============\n### Enhancements\n  * Update user information for existing users when importing CSV (#1993)\n  * Agent names are consistently formatted and sorted throughout the system (#1972)\n  * Memcache session backend support. (See `include/ost-sampleconfig.php`) (#2031)\n  * Email domain validation includes DNS record verification (#2042)\n  * Make ticket queue selection sticky (aa2dc85)\n\n### Improvements\n  * Fix incorrect mapping of ISO charsets to ISO-8859-1, thanks @nerull7\n  * Fix unnecessary drop of ticket CDATA table because of update to deleted\n    field (#1932)\n  * Fix inability to create or update organization custom data (#1942)\n  * Fix inability to update some fields of user custom data (#1942)\n  * Fix filtering user custom data for email tickets (#1943)\n  * Fix missing email headers resulting in incorrectly threaded emails when\n    delivered (#1947)\n  * Cleanup file data when removing custom file uploads (#1942)\n  * Fix crash when exporting PDF and PHAR extension is not enabled\n  * Fix crash processing some TNEF documents (89f3ed7, #1956)\n  * Fix handling of GBK charset when gb2312 is advertised (#2000)\n  * Fix link to client ticket listing when logged in, thanks @neewy (#1952)\n  * Disambiguate staff and collaborators when processing a some emails (#1983)\n  * Fix several i18n phrase and layout issues (#1958, #1962, #2039)\n  * Improve detection of some bounce notices with alternative content (#1994)\n  * Fix image URL rewrite when pasting existing images, from a KB article for\n    instance (#1960)\n  * Preserve internal note formatting on new ticket by staff if HTML is\n    disabled (#2001)\n  * Touch organization `updated` timestamp on custom data update (#2007)\n  * Fix deployment on Windows® platforms, thanks @yadimon (#2033)\n  * Fix upgrade crash if retrying an old, failed upgrade from v1.6 (#1995)\n  * Fix corruption of some html content (9ae01bf)\n\nosTicket v1.9.7\n===============\n### Enhancements\n  * Remote IP is logged for staff replies (#1846)\n  * Add option to require client login to view knowledge base (#1851)\n  * Internal activity alert, replacing the internal note alert, includes alerts\n    of responses made by other agents (#1865)\n  * Email system now uses LF instead of CRLF as the default (#1909)\n  * Mass actions for user directory (#1924)\n  * Unassign tickets on transfer if current assignee is not a member of the new\n    department and the department has \"Restrict assignment to members\" enabled\n    (#1923)\n\n### Improvements\n  * Clear overdue flag when a ticket is closed, thanks @A-Lawrence (#1739)\n  * Clear attached file listing on client post (regression) (#1845)\n  * Delete ticket custom data on delete (#1840)\n  * Trim whitespace from filter match data on update (#1844)\n  * Fix dropping of custom data on API post (#1839)\n  * Fix advanced search on create date (#1848)\n  * Fix initial load and pagination of dashboard page (#1856)\n  * Fix incorrect internal/public category setting in drop down for new FAQ\n    (#1867)\n  * Add UTF-8 BOM to CSV export for correct Unicode detection (#1869)\n  * Fix not considering the setting for alert assigned on new message (#1850)\n  * Skip new activity notice if collaborator(s) included in email To or Cc\n    header (#1871)\n  * Fix inability to uncheck a custom data checkbox (#1866)\n  * Fix advanced search for unassigned tickets (#1857)\n  * Fix navigation warning if not using the lock feature (#1898)\n  * Fix detection of message of some bounce notices (#1914)\n  * Fix SQL alert with multiple Message-ID headers (#1920)\n  * Add a warning if attempting to configure archiving for POP accounts (#1921)\n  * Fix missing UTF-8 output encoding header for staff control panel (#1918)\n  * Fix z-index issue between popup previews and modal dialogs (#1919)\n  * Record imported file backend when importing files (f1e31ba)\n\n### Performance and Security\n  * Fix XSS vulnerability in sequence management (88bedbd)\n  * Defer loading of thread email header information when loading ticket thread\n    (#1900)\n\nosTicket v1.9.6\n===============\n### Enhancements\n  * New Message-Id system allowing for better threading in mail clients (#1549,\n    #1730)\n  * Fix forced session expiration after 24 hours (#1677)\n  * Staff panel logo is customizable (#1718)\n  * Priority fields have a selectable default (instead of system default) (#1732)\n  * Import/Export support for file contents via cli (#1661)\n\n### Improvements\n  * Fix broken links in documentation, thanks @Chefkeks (#1675)\n  * Fix handling of some Redmond-specific character set encoding names (#1698)\n  * Include the users name in the \"To\" field of outbound email (#1549)\n  * Delete collaborators when deleting tickets (#1709)\n  * Fix regression preventing auto-responses for staff new tickets (#1712)\n  * Fix empty export if ticket details form has multiple priority fields (#1732)\n  * Fix filtering by list item properties in ticket filters (#1741)\n  * Fix missing icon for \"add new filter\", thanks @Chefkeks (#1735)\n  * Support Firefox v6 - v12 on the file drop widget (#1776)\n  * Show update errors on access templates (#1778)\n  * Allow empty staff login banner on update (#1778)\n  * Fix corruption of text thread bodies for third-party collaborator email\n    posts (#1794)\n  * Add some hidden template variables to pop out content (#1781)\n  * Fix missing validation for user name and email address (#1816, eb8858e)\n  * Turn off search indexing when complete, disable incorrectly implemented\n    work breaking, squelch error 1062 email from search backend (afa9692)\n  * Fix possible out of memory crash in custom forms (#1707, 0440111)\n\n### Performance and Security\n  * Fix generation of random data on Windows® platforms (#1672)\n  * Fix possible DoS and brute force on login pages (#1727)\n  * Fix possible redirect away from HTTPS on client login page, thanks @ldrumm\n    (#1782)\n\nosTicket v1.9.5.1\n=================\n### Improvements\n  * Fix file.php to serve files added to system before osTicket v1.9.1\n  * Fix file.php to serve files if client panel or system is offline\n  * Fix popover download of inline images\n  * Avoid de-duplicating zero-length files\n  * Send new message alert to team members if not assigned to an agent\n  * Fix import of users to organization not setting the organization\n  * Fix redactor toolbar showing over the date picker (#1450, thanks @Chefkeks)\n\n### Performance and Security\n  * Fix XSS vulnerability in client language selection\n\nosTicket v1.9.5\n===============\n### Enhancements\n  * Add support for organization vars in templates\n    (`%{ticket.user.organization...}`) (#1561)\n  * Canned responses feature can now be disabled (#1562)\n  * Drop link redirection through l.php (#1640)\n  * Use unified file download script (#1641). Links can now be shared with\n    external users and accessed without authenticating.\n  * Ticket filters support matching and banning based on the Reply-To user\n    information (#1645)\n\n### Improvements\n  * Remove custom data when users are deleted (#1492)\n  * Fix matching of ticket number in subject (regression in v1.9.4) (#1486)\n  * Several minor translatable strings (#1441, #1489, #1560), thanks @Chefkeks\n  * Fix invalid UTF-8 chars PDF error for empty thread title (regression in\n    v1.9.4) (#1512)\n  * Consider auto response checkbox and department setting for new ticket by\n    staff (#1509)\n  * Fix PHP crash if `finfo` extension is missing (#1437)\n  * Fix export of choice field items (#1436)\n  * Properly handle alert and auto response flags from API (#1435), thanks\n    @stevepacker\n  * Fix current value of choice fields if set to boolean false (#1466)\n  * Do not reopen tickets for automated responses (#1529)\n  * Properly handle uppercase file extensions in file field configuration\n    (#1549)\n  * Fix release of ticket lock when navigating away from ticket view (#1552)\n  * Display FAQ article consistently on client portal (#1553)\n  * Avoid wrapping password reset URLs on text emails (#1558)\n  * Fix field requirement for clients when only required for agents (#1559)\n  * Fix language selection for new email template group (#1563)\n  * Fix incorrect status of new ticket if opened as `closed` and assigning to\n    an agent (#1565)\n  * Forbid disabling the only active administrator (#1569)\n  * Searching for tickets searches to midnight of the end date (#1572), thanks\n    @grintor\n  * Fix rejection of tickets by filter, even if a previous matching filter\n    would stop on match (#1644)\n  * Fix matching of `User / Email Address` in ticket filters (#1644)\n  * Properly HTML escape thread bodies when quoting (#1637)\n  * Use department email for agent alerts (#1555)\n  * Skip team assignment alert on new ticket if assigned to an agent (fddb3c7)\n  * Use custom form name as the page title when editing (#1646)\n\n### Performance and Security\n  * Fix possible XSS vulnerability in sortable table view pages (#1639)\n\nosTicket v1.9.4\n===============\n### Major New Features\n  * New ticket states (resolved, archived, and deleted) (#1094, #1159)\n  * Custom ticket statuses (#1159)\n  * Custom ticket number formats (#1128)\n  * Full text search capabilities (*beta*)\n  * Multiselect for choice fields and custom list selections\n  * Phase II Multi-Lingual Support (User Interface) (see\n    http://i18n.osticket.com and http://jipt.i18n.osticket.com) (#1096)\n    * Active interface translations of 46 languages currently\n    * Popup help tip documentation in all languages\n    * Flags displayed on client portal for manual switch of UI language by\n      EndUsers\n    * Automatic detection of enduser and agent language preference as\n      advertised by the browser\n    * Improved PDF ticket printing support, including greater support for\n      eastern characters such as Thai, Korean, Chinese, and Japanese\n    * Proper support for searching, including breaking words for languages\n      which do not use word breaks, such as Japanese\n    * Proper user interface layout for right-to-left languages such as Hebrew,\n      Arabic, and Farsi\n    * Right-to-Left support for the HTML text editor, regardless of the viewing\n      user’s current language setting\n    * Proper handling of bidirectional text in PDF output and in the ticket\n      view\n\n### Enhancements\n  * Plugins can have custom configurations (#1156)\n  * Upgrade to mPDF to v5.7.3 (#1356)\n  * Add support for PDF fonts in language packs (#1356)\n  * Advanced search improved to support multiple selections, custom status and flags\n\n### Improvements\n  * Fix display of text thread entries with HTML characters (`<`) (#1360)\n  * Fix crash creating new ticket if organization custom data has a selection field (#1361)\n  * Fix footer disappearance on PJAX navigation (#1366)\n  * Fix User Directory not sortable by user status (#1375)\n  * Fix loss of enduser or agent priority selection on new ticket (#1365)\n  * Add validation error if setting EndUser username to an email address (#1368)\n  * Fix skipped validation of some fields (#1369) (*regression from rc4*)\n  * Fix detection of inline attachments from rich text inputs (#1357)\n  * Fix dropping attachments when updating canned responses (#1357)\n  * Fix PJAX navigation crash in some browsers (#1378)\n  * Fix searching for tickets in the client portal (#1379) (*regression from rc4*)\n  * Fix crash submitting new ticket as agent with validation errors (#1380)\n  * Fix display of unanswered tickets in open queue (#1384)\n  * Fix incorrect statistics on dashboard page (#1345)\n  * Fix sorting by ticket number if using sequential numbers\n  * Fix threading if HTML is enabled and QR is disabled (#1197)\n  * Export ticket `created` date (#1201)\n  * Fix duplicate email where a collaborator would receive a confirmation\n    for his own message (#1235)\n  * Fix multi-line display of checkbox descriptions (#1160)\n  * Fix API validation failure for custom list selections (#1238)\n  * Fix crash adding a new user with a selection field custom data\n  * Fix failed user identification from email headers if `References` header\n    is sorted differently be mail client (#1263)\n  * Fix deletion of inline images on pages if draft was not saved (#1288)\n  * Fix corruption of custom date time fields on client portal if using non\n    US date format (#1320)\n  * Fix corruption of email mailbox if improperly encoded as ISO-8859-1\n    without RFC 2047 charset hint (#1332)\n  * Fix occasional MySQL Commands OOS error from ORM (#1334)\n\n### Performance and Security\n  * Fix possible XSS vulnerability in email template management (#1163)\n\nosTicket v1.9.3\n===============\n### Enhancements\n  * Redactor link dialog has a few common links selectable (#1135)\n\n### Improvements\n  * Fix missing `%{recipient}` variable used in canned reply (filters) (#1047)\n  * Fix `%{ticket.close_date}` variable in email message templates (#1090)\n  * Fix timezone offset used in time drop down (#1103)\n  * Fix premature session expiration (#1111)\n  * Correctly tag emails with source `email` (#1104)\n  * Correctly handle custom data for help topics (#1105)\n  * Fix validation and display issues for email mailboxes with system default priority and department (#1114)\n  * Fix crash when rendering custom list drop-downs with retired list items (#1113)\n  * Avoid system alert notices bouncing and creating tickets (#1115)\n  * Redactor no longer shortens URLs (#1135)\n\n### Performance and Security\n  * Fix XSS vulnerability in user name (#1108, #1131)\n\nosTicket v1.9.2\n===============\n### Enhancements\n  * Help topics have super powers (#974)\n    * They can be arbitrarily nested\n    * They can be manually sorted\n    * Admins can select a system default help topic\n    * They can inherit the form from a parent\n  * Form data entered to custom forms is preserved when switching help topics\n  * Update to Redactor 9.2.4 (http://imperavi.com/redactor/log/)\n  * Using canned responses no longer requires [Append] click (#973)\n  * Guests can sign out (#1000)\n  * Filter by custom list item properties (#1024)\n  * Time selection is based on admin configured time format (#1036)\n  * (Optionally) clients can access tickets without clicking email link (#999)\n  * Introduction of signals for mail filter plugins (#952)\n\n### Improvements\n  * Fix a few glitches on site page management (#986)\n  * Fix saving department alert recipients (#985)\n  * Fix assignment to account manager regardless of setting (#1013)\n  * Fix dialog boxes on some PJAX navigations (#1034)\n  * Help topics are properly sorted in FAQ management (#1035)\n  * Fix MySQL commands out-of-sync triggered by the ORM (#1012)\n  * Clients can follow email links from multiple tickets (#1001)\n  * Workaround for PHP variable corruption issue (#917, #969)\n  * All other improvements cited in v1.8.3\n\n### Performance and Security\n  * Fix XSS vulnerability in phone number widget (#1025)\n  * Fix several XSS vulnerabilities in client and staff interfaces (#1024, #1025)\n\nosTicket v1.8.4\n===============\n### Improvements\n  * Fix misleading and incorrect custom form management pages (#919)\n  * Fix linked external image tag corruption (#936)\n  * Fix multiple [Show Images] button for external images in client interface (e4b721c)\n  * Properly handle email address personal names with commas (#940)\n  * Organizations can define a website now (13312dd)\n  * Correctly handle email headers with leading tabs (RFC 2047) (#895, #953)\n  * Implement `%{ticket.user.x}` for email templates and canned responses (#966)\n  * Handle shameful `X-AMAZON-MAIL-RELAY-TYPE` invented by Amazon\n  * Issue summary field type must have associated data (#987)\n  * Fix `%{recipient.ticket_link}` for new message auto response (#989)\n  * Fix corruption of `%{company.name}` on new ticket notice (#1002)\n  * Fix signal data byref (#1037)\n  * Correctly handle email priority headers (#491)\n  * Fix mail header newline corruption with the Suhosin extension (#442)\n\n### Performance and Security\n  * Fix XSS vulnerability in the phone number widget (#1025)\n  * Fix several XSS vulnerabilities (#1025)\n\nosTicket v1.9.1\n===============\n### Enhancements\n  * [Draft Saved] box does not show if nothing entered yet (be38e8b)\n  * `Your Information` is now translatable (b189b86)\n  * Canceling new ticket also deletes drafts (2695dce)\n  * A users organization can be updated (#955)\n  * Users can be removed from an organization (#957)\n\n### Bugs\n  * Fix confusing form view after adding a new form (#923)\n  * Fix whitespace munging in emails if HTML ticket thread is disabled (#924)\n  * Fix [loading] popup on form save (#925)\n  * Fix URLs in emails linking through l.php (#929)\n  * Fix crash on custom list view if there no properties defined (#935)\n  * Fix handling of encoded email mailboxes with commas (#940)\n  * Fix display of link, external images in the ticket thread (99e719d)\n  * Fix crash submitting a new ticket with organization collaborators (7335525)\n  * Fix handling of custom date and time fields (#944)\n  * Fix PJAX detection of new deployment (a18bf0c)\n  * Fix continual release of ticket locks after navigation (30a3d2)\n  * Fix logout if following link from client email (bda2e42)\n  * Fix un-editable organization website (13312dd)\n  * Fix incorrect constant usage in User object (#958)\n\nosTicket v1.9\n=============\n### Client Login and Registration\nSetup flexible user registration policy for your help desk to match your\nneeds. Users can register for accounts via the client portal and can now\nlogin with a username and password instead of email and ticket number. We\nalso have a forgot-my-password link and several other new minor adjustments\nto the user profile.\n\n### External Authentication Support\nUse third-party SSO to authenticate your users and staff. Initial support\ninclude OAuth2 and LDAP (v0.5 of the LDAP plugin is required)\n\n### User Directory\nSearch, view, and manage, even delete! contact information from the users\nfrom whom you receive tickets. Staff can also manually register users and\neven set an initial password. Users can also be imported and exported via\nCSV data.\n\n### Organizations\nOrganize your users together into organizations. Organizations can have\ninternal owners (\"Account Manager\") and external owners (\"Primary Contact\").\nThe Account Manager can receive new ticket and new message alerts.\nOrganization Primary Contacts and members can be automatically added to\ntickets as collaborators.\n\n### User and Organization Notes\nQuickly view, edit, add and remove pertinent notes on your users and\norganizations\n\n### Form Management\nStaff members can now add, delete, and sort forms attached to tickets, users\nand organizations as well as remove stale data where fields have been\nretired from active forms.\n\n### Custom Properties for Lists\nAdd properties to your list items and use it in your email templates and\npages. For example create an address property to a list of locations. List\nitems can also be disabled now, which causes them to be hidden from\nselection.\n\n### PJAX page loading\nFor browsers supporting PJAX, navigating around the system will see a\nperformance improvement as javascript and css files are not re-parsed for\neach page load.\n\n### Redactor 9.2\nSeveral new features including a floating editor bar as well better support\nfor non-US keyboards\n\n### Minor Enhancements\n  * Agent selection for assignment can be limited to the current department\n  * Complete help tip documentation for the Admin panel\n  * Email addresses can have an associated Help Topic\n  * Alerts and Notices can be disabled per Department\n  * Agent portal can have a login banner\n  * Inline images are not displayed with the attachments in the ticket view\n  * Original thread content format is saved (html or text)\n  * Alerts and Notices support quoted response removal\n\nosTicket v1.8.3\n=================\n### Enhancements\n  * Support filtering based on help topic (#728)\n  * Embedded images ([rfc2397](http://www.ietf.org/rfc/rfc2397.txt)) are correctly supported (#740)\n  * Allow regular staff members to show assigned open tickets on open queue (#751)\n  * Support [rfc1892](http://www.ietf.org/rfc/rfc1892.txt) style bounce notices (#871)\n  * Disable autocomplete on CAPTCHA fields (#821)\n  * Show `closed` date on the closed ticket queue (#865)\n  * Departments support assignment to members only (#862)\n  * Department email selection is optional (#862)\n\n### Bugs\n  * Fix error output on some systems if the `i18n` folder is not readable (#714)\n  * Fix possible crash if an email has no body (#707)\n  * Fix errors in download hash generation (#743)\n  * Support two-character file extensions (#719)\n  * Fix inline images with an invalid content id (#708)\n  * Remove confusing false-positive banner and admin email for client login (#763, #765)\n  * Fix detection of inline images without a `cid:` URL scheme (#779)\n  * Fix crash sending fatal alert email (bdfb2f1)\n  * Fix partial corruption of HTML @style attributes (#784)\n  * Fix several CSS styles for the staff interface (#785)\n  * Properly clear department selection from other settings on deletion (#792)\n  * Users with ticket-edit rights can see the \"Change Owner\" option in the more drop-down (#799)\n  * Links to new osTicket site are now correct (#808)\n  * Fix incorrect ticket count on simple ticket search (#809)\n  * Fix attachment size detection on systems with `mbstring.func_overload` set (#811)\n  * Fix horribly incorrect TNEF stream parsing (#825)\n  * Fix incorrect SQL query searching staff directory (91d65d9)\n  * Properly trim user input for ban list entries (#837)\n  * Ticket assignment alert can be disabled (#839)\n  * Preserve newlines in long answer form fields (with HTML disabled) (a04c5e7)\n  * Fix javascript error on form submission with empty date picker field (0013b40)\n  * Fix images in message portion of the new ticket notice to end user (#842)\n  * Send new internal note alert to assigned team members (#858)\n  * Properly strip leading and trailing whitespace from text/plain emails (fa7a025)\n  * Fix incorrect default template for ticket auto responses (97d6e25)\n  * Canned responses can be disabled (120d90b)\n  * Don't corrupt filters with selected, disabled teams, SLAs (120d90b)\n  * Fix crash sending some alert emails (efa7311)\n  * Fix HTML scrubbing with some content-ids (efa7311, eb5861f)\n  * Squelch E_WARN from ContentAjaxAPI::getSignature (ed33d06)\n  * `@localhost` is *not* a valid email address (f40c018)\n  * Fix `web.config` for newly patched IIS setups (78a47c2)\n  * Honor disabled assignment alerts for teams (#894)\n  * Send out internal note alerts to assigned staff (and Team) if Agent closes the ticket with the note (#903)\n\n### Performance and Security\n  * Fix cross site scripting (XSS) vulnerability in thread entry widget (9916214)\n  * Mail parsing uses significantly less memory (#861)\n\n\nosTicket v1.8.1.2\n=================\n* All fixes and enhancements from v1.8.0.4, plus *\n\n### Enhancements\n  * Better detection of email loops (#584, #684)\n\n### Bugs\n  * Fix selection of the auto-response email for a department (#666)\n  * Don't require current password when resetting (#671)\n  * Fix incorrect matchup of collaborators to users (#676)\n\nosTicket v1.8.1.1\n=================\n* All fixes and enahncements from v1.8.0.4, plus *\n\n### Enhancements\n  * Add signature to activity notice for staff replies (#605)\n  * Show company name in the copyright footer (#586)\n  * Signature is displayed below the staff response box (#609)\n\n### Bugs\n  * Fix footnotes generated in html2text for same link text but different URLs (5e2f58d)\n  * Fix processing of emails for existing users (#588)\n  * Avoid adding an aliased system email address as a collaborator (#604, #627)\n  * Show current staff / user names where possible (#608)\n  * Fix display of _forgot my password_ link (#611)\n  * Export the value of custom fields (not the ID number) (#610)\n  * Fix saving the backend with file metadata (#595)\n  * Use the database as a failsafe attachment backend (#594)\n  * Avoid a crash when sending some mails (#589)\n  * Fix migrating attachments when upgrading from osTicket 1.6 (#614)\n  * Email templates ship with the ticket number in the subject line (#644)\n  * If inline images are stripped from the email, they are not considered attachments (#649, bcbebd0, 35a23be)\n  * Fix incorrect Content-Id headers generated for inline images (23ce0a0, e37ec74)\n  * New installs have the `Staff` group enabled (c7130c5)\n  * Always show the ticket thread when following an email link (17725ca)\n\n### Security and Performance\n  * Staff can only see closed tickets if they have access via group or primary department (#623, #655)\n  * Fix incorrect honoring of ban list and over limit settings (#660)\n  * Keep existing session after login (c4bfb69)\n  * Fix password reset system (dfaca0d, #664)\n\nosTicket v1.8.0.4\n=================\n### Enhancements\n  * Departments can have a department if there are no members (#618)\n  * Any valid email address can be used throughout the system (#673, e3adfaa)\n\n### Bugs\n  * Preserve inline image floating in ticket thread (#612)\n  * Recover from crash when creating new user accounts (#617)\n  * Fix SQL error for some variable names on custom fields (#620)\n  * Fix canned append in non-HTML mode (#621)\n  * Fix stripping of leading zeros from phone numbers (#622)\n  * Strip `<?xml ... >` processing instructions from html email (#628)\n  * Disable error_reporting for releases (#630)\n  * Fix crash during PDF generation for some PHP installations (#631)\n  * Clicking away from popup tips closes them (#645)\n  * FAQ last-modified time can be something other than midnight (#647)\n  * Fix creeping widget sizes in create-user dialog (#648)\n  * Usernames can have Unicode characters (#650)\n  * If Auto-claim tickets is disabled, reopen tickets unassigned (#651)\n  * New SLA's default to have alerts enabled (#654)\n  * Fix creating ticket by staff without required contact-information fields (#656)\n  * Fix crash viewing ticket in the client portal if no departments are public (#658)\n  * Fix crash for some custom field configurations (#659)\n  * Allow manual update of SLA to a transient SLA (#663, e37ec74)\n  * Fix upgrade crash from some osTicket 1.6 installations (#687)\n  * Fix over-stripping of some HTML element sections (#686)\n  * Better detection of email loops (#584, #684)\n  * Fix attachments from new ticket by staff to be associated with the response (#688)\n\n### Geeky Stuff\n  * Persistent database connections are supported (#693)\n  * Regression testing now tests for JS syntax errors (#669)\n  * Add git version to the deployment script (#630)\n\n### Performance and Security\n  * Staff can only see closed tickets if they have access via group or primary department (#623, #655)\n\nosTicket v1.8.1\n===============\n*All fixes and enhancements from v1.8.0.3, plus*\n\n### Enhancements\n  * Ticket filters support matching on email To and Cc fields (#529)\n  * Popup summary and collaborator list on ticket queue page (#521)\n\n### Bugs\n  * New ticket by staff adds `recipient` and `staff` context to email templates (#527)\n  * Forbid password reset for non-local users (#570)\n  * Allow an administrator to lift the force password change flag (#570)\n  * Locks are released on logout (#522)\n  * Text email footnotes are written as [title][#] (7ccbf0c)\n  * Fix several issues with display and download of attachments (#530)\n  * Fix sending a reply email if requested not to (#531)\n  * Only consider collaborators if the receiving system email is identified (#537)\n  * Do not consider `delivered-to` addresses as collaborators (#544)\n  * Assume `iso-8859-1` MIME body encoding if not specified (#551)\n  * Add new features to the storage API to implement Amazon S3 (#515)\n\n### Performance and Security\n  * Support auditing login attempts (#559)\n  * Avoid auth strikeouts when not attempting a login (#559, #523)\n\nosTicket v1.8.0.3\n=================\n### Enhancements\n  * Much better email bounce detection (#461, #474)\n  * Microsoft® TNEF emails are supported (#555, 0890481, #567)\n  * Handle messages forwarded as `message/rfc822` content type (#482)\n  * [Esc] key cancels popup dialogs (#465)\n  * New ticket by staff workflow is simplified (#543)\n  * Support regex matches in ticket filter (584465c)\n\n### Bugs\n  * 'Priority' column is included in the ticket queue export (#451)\n  * Retry queries on MySQL error 1213 (#493)\n  * Client login email is not case-sensitive (398cbc7)\n  * Drop silly border on text emails if HTML ticket thread is disabled (439a32a)\n  * Fix ticket submission error if client is already logged in (#469)\n  * Fix fetching from more than 10 mail accounts (#468)\n  * Fix clickable links ending with punctuation (#497)\n  * Fix whitespace mangling of Unicode text with non-breaking-spaces (#502)\n  * Fix image size set to zero when images are added to drafts (#504)\n  * Correctly detect php-dom extension (#503)\n  * Fix delivery issue of emails delivered to group mailboxes (#510)\n  * Fix E_STRICT annoyance from class.config.php (#518)\n  * Fix dashboard report timeframe for non-US date formats (#520)\n  * Fix dashboard report ending \"period\" (#520)\n  * Fixup Message-Id and Delivered-To for encapsulated messages (#528)\n  * Much better compatibility implementation of the `mbstring` module (#517)\n  * Consider the `delivered-to` header in finding the system email (#535)\n  * Ticket variables are available in templates regardless of case (#545)\n  * Allow advanced search on any priority *regression* (#547)\n  * Fix email address list parsing on bad MIME headers (#560)\n  * Automatically detect file MIME type if not specified (ac42e62)\n  * Fix login issue when upgrading from osTicket 1.6 (#571)\n  * Fix attachment corruption on some documents like PDFs (#576)\n\n### Performance and Security\n  * Reuse SMTP connections where possible (#462)\n  * Enforce max file size for attachments sent via API (#568)\n\nosTicket v1.8.1-rc1\n===================\n### Enhancements\n  * Much better email bounce detection (#461, #474)\n  * Handle messages forwarded as `message/rfc822` content type (#482)\n  * [Esc] key cancels popup dialogs (#465)\n  * Support regex matches in ticket filter (584465c)\n\n### Bugs\n  * 'Priority' column is included in the ticket queue export (#451)\n  * Retry queries on MySQL error 1213 (#493)\n  * Client login email is not case-sensitive (398cbc7)\n  * Drop silly border on text emails if HTML ticket thread is disabled (439a32a)\n  * Fix ticket submission error if client is already logged in (#469)\n  * Fix fetching from more than 10 mail accounts (#468)\n  * Fix `deploy` command-line application (#450)\n  * Fix error email on upgrade (#452)\n  * Ship with a `plugins/` folder (90b0a65)\n  * Fix file key not replaced in thread body correctly for de-duplicated files (#492)\n  * Better handling of text and html thread posts (#508)\n  * Fix clickable links ending with punctuation (#497)\n  * Fix whitespace mangling of Unicode text with non-breaking-spaces (#502)\n  * Fix image size set to zero when images are added to drafts (#504)\n  * Correctly detect php-dom extension (#503)\n  * Fix delivery issue of emails delivered to group mailboxes (#510)\n\n### Merged from v1.8.0.2\n  * Log entry for password reset attempts (#435)\n\nosTicket v1.8.1 (Preview)\n=========================\n### Collaborator Support (CC)\nIn addition to the ticket owner, other end users can be collaborators on a\nticket. Responses received from them are integrated automatically into the\nticket thread, and emails are sent to all collaborators when new messages and\nresponses arrive into the system. All collaborators have access to the ticket\nvia the client portal and are able to log new messages.\n\n### Plugin management system\nosTicket supports plugins via a (currently undocumented) simple plugin API and\ninterface. Plugins can be written and distributed as files or unpacked via ZIP\narchives, or distributed via PHP PHAR files. The plugin system is developed in\nhopes of adding extensibility to osTicket without significant overhead.\nInitially, two \"classes\" of plugins are supported: authentication, and file\nstorage.\n\n### Pluggable authentication\nStaff members can now be authenticated against a backend other than the\nosTicket internal database. Available immediately is integration with LDAP\n(RFC-2307) and Microsoft® Active Directory. The initial authentication system\nalso support user lookups, so when browsing for new users when creating\ntickets, your directory server will be queried for users and email addresses.\n\n### Pluggable attachment storage\nAttachments can live outside the database again. You can now write or install a\nplugin to store your attachments somewhere other than in your database, and\nosTicket will use the backend to store and retrieve (or redirect to) your\nattachments. We've initially made a plugin available to store attachments on\nthe filesystem and plan on adding an Amazon S3 plugin very soon.\n\n### Internationalization, Phase 1\nSelect your default data on installation, and select the language preference,\nas a staff member, for the help tips. You can also now select the language of\nthe email templates when creating a new template. The templates for that\nlanguage will be used instead of the English ones where translated versions are\navailable.\n\n### Minor Enhancements\n  * Clients can update their profile information on the web portal\n  * Clients can update ticket details (if enabled)\n  * Custom ticket-details fields are included in ticket queue exports\n\nosTicket v1.8.0.2\n=================\n### Enhancements\n  * HTML editor has an underline button (#377)\n  * New ticket form pre-selects default priority (#400)\n  * Help topics do not require an associated priority (#397)\n  * Extra fields associated with help topics are shown above the ticket-details form (#398)\n  * Auto-complete is supported on email address fields (#401)\n  * Choice fields allow specification of a prompt and default value (#427)\n  * Email template page makes templates easier to manage (#417)\n  * New ticket user-lookup popup supports cancel (#434)\n\n### Bugs\n  * Ticket locks are correctly released (#335)\n  * Pages show inline images correctly (8a1f4e6)\n  * Internet Explorer compatibility view is disabled for the scp (#368)\n  * *regression* Staff no longer receive attachments on alerts (#379)\n  * Emails correctly differentiate HTML and text versions (#212, #384)\n  * Ticket queue counts are correct for limited users (#298, #389)\n  * Phone number field might be a text box (#390)\n  * Fix incorrect ticket rejection for new ticket by staff (#425)\n  * Fix crash of cron executions on some platforms (#421)\n  * `realpath` may fail on some Windows® platforms (#424, cff8db8)\n  * Fix incorrect handling of typeahead list fields with leading numeric chars (#422)\n\n### Performance and Security\n  * Ticket queue has significantly better performance (#357, #388, #413, a03dec5, 31bb4ac, e9a3b98)\n  * Remove several unnecessary queries (#415)\n  * Password reset attempts are logged (#435)\n  * Handle garbage username input for password reset (344c95f)\n\n### Upstream 1.7 Commits\n  * Database hostname supports local socket specified as localhost:/path/to/socket (osTicket/osTicket-1.7#864)\n  * Upgrader correct upgrades the ban list from 1.6. Migrator corrects incorrect upgrade (osTicket/osTicket-1.7#869)\n  * Ticket number is detected in subject line without brackets (osTicket/osTicket-1.7#873, 358cdeb)\n  * Fixup redirect headers for modern IIS servers (osTicket/osTicket-1.7#874)\n  * Correctly support PHP 5.5 (5e8e233)\n  * Fix missing parameter to TicketLock::lookup (osTicket/osTicket-1.7#878)\n\nosTicket v1.8.0.1\n=================\n### Enhancements\n  * Allow edit of user on the ticket open page (#291)\n  * Display complete contact information to lookup dialog (07ec37d)\n  * Clarify `mysqli` extension requirement on install and upgrade pages (#309,\n    334461e)\n  * Add option to display unprocessed name (original) (#323)\n\n### Bugfixes\n  * Fix parser error for PHP < 5.3 on upgrade and install (1ff1540)\n  * Remove dependency on mbstring (for real this time) (50d3d70)\n  * Fix incorrect advanced search hits on some custom fields (#290)\n  * Custom forms require a title (otherwise you cannot click on them to edit)\n    (#293)\n  * Update client phone number on ticket view page after update (#292)\n  * Fix regression where validation errors were not shown on new ticket form\n    (#303)\n  * Fix bug where client name and email were not filterable for web submissions\n    (#319)\n  * Fix various autocorrect annoyances (#321)\n\n### Performance and Security\n  * Improve performance of ticket filtering on some configurations (#301)\n  * Fix possible cross site scripting (XSS) vulnerability on display of contact\n    information values (#297)\n\nosTicket v1.8.0\n=============\n### Enhancements\n  * Rich text ticket thread (#5)\n  * Custom forms and fields (#2)\n  * Translatable initial data *almost*\n\n### Rich Text Ticket Thread\nAs an option, enabled by default, osTicket can now process HTML email and\nallows for rich text markup in most long-answer boxes across the system,\nincluding staff replies and internal notes posted to the ticket thread. To keep\nthe feature consistent throughout, canned responses and email templates also\nsport an HTML theme now.\n\n### Custom Forms and Fields\nThe data collected from your users when they fill out the ticket form is now\ncustomizable. You can now ask any information relevant to your business\npractice, and can customize the type of input show from the user. Currently,\nshort and long answer fields, drop-down lists, checkboxes, date and time, and\nphone number fields are available. Each field is configurable and can be setup\naccording to your liking. Fields can also be marked as required, whose input is\nrequired to submit the ticket, and internal, whose input is not visible to the\nend user.\n\nosTicket v1.7.3\n===============\n### Enhancements\n  * Ticket thread items are now available for email templates (#790)\n  * Support MySQL servers on a non-standard port number, which is also not set\n    in the `php.ini` file (#775)\n\n### Bugfixes\n  * Fix email handling where the character set advertised is `us-ascii` but\n    `iso-8859-1` was intended (#770)\n  * Ticket source is now editable (#772, #777)\n  * Email parsing would crash if `Reply-To` header was not found (#780)\n  * CSRF token creation would fail on some Windows installations (#771, #776)\n  * Tickets without an SLA set would never go overdue (#757, #767)\n  * FAQ search now hits category names (#781)\n  * FAQ search hits are sorted by article title now (#786)\n  * Email replies with nothing before the quoted response marker should remain\n    as is (#787)\n  * CAPTCHA responses are now considered case-insensitive (#823)\n  * `References` email header how includes the parent email `Message-Id` (#825)\n  * Email attachment parsing would crash if the `Content-Disposition` header\n    had no parameters (#828)\n  * Date format on the jQuery-UI datepicker is admin configurable now (#829)\n\n### Performance\n  * Scanning deleting orphaned files is much faster (#773, #778)\n\nosTicket v1.7.2\n===============\n### Enhancements\n  * The ticket number is no longer required in the subject line and staff can\n    reply to emails and create an internal note (*released in v1.7.1.2*)\n  * Show customized site logo on PDF output (#763)\n  * Support deployment for initial install with cli deploy script (#750)\n  * Require complete regression test pass before packaging new release (#751)\n  * Die with HTTP/500 for misconfiguration or database connect failure (#762)\n\n### Bug fixes\n  * Detect and import inline attachments without a Content-Disposition header\n    (#737)\n  * Show correct template description *again* (#742, #743)\n  * Import attachments from emails continuing a ticket thread (*regression\n    introduced in v1.7.1.2*) (#745)\n  * Support UTF-8 encoded filenames for fetched emails (#738)\n  * Disable Kerberos and NTLM authentication in mail fetching (#739)\n  * Forbid empty reply-separator setting (#752)\n  * Only email administrators for log messages that would be written to the\n    database (#754)\n  * Emails fetched and rejected by a ticket filter that are not deleted or\n    moved to a folder will not be re-fetched and re-rejected (#755)\n  * Workaround for some mail clients' inability to properly decode\n    quoted-printable encoded emails (#760)\n  * Inline text bodies are incorrectly detected as attachments without a\n    filename (#761)\n  * Properly decode and display some international chars in PDF printing (#765)\n  * Do not double encode XML entities in ticket thread titles (#718, #567)\n  * Display correct template description on edit (#724, #727)\n  * Fix download of attachments with commas (',') in the filename (#702)\n  * Fix incorrect content-type header for CAPTCHA (#699)\n\n### Security\n  * Require email address match if ticket number is matched in subject line and\n    neither references or in-reply-to headers match an existing ticket thread\n    item (*regression introduced in v1.7.1.2*) (#748)\n\n### Performance\n  * Address database performance issue scanning for orphaned file_chunk records\n    (#764)\n\nosTicket v1.7.1\n===============\n### Bugfixes\n  * Properly reject attachments submitted via the API (#668)\n  * Correctly support the \"Use Reply-To\" in ticket filters (#669)\n  * Don't log users out after changing username or email address (#684)\n  * Don't leak private FAQ article titles (#683)\n\nosTicket v1.7.1-rc1\n===================\n### Enhancements\n  * Custom logos and site pages (#604, #632, #616)\n  * Password reset link (#638)\n  * Export and import feature. Useful for migrations and backups. (#626)\n  * Use your email address as your username for logins (#631)\n  * SLA's can be marked *transient*. Tickets with a transient SLA will\n    change to the SLA of the new department or help-topic when transferred\n    or edited.\n  * Support installation on MySQL and MariaDB clusters. Use default storage\n    engine and don't assume predictable auto-increment values (#568, #621)\n\n### Geeky Stuff\n  * mysqli support for PHP5+\n  * SSL support for database connections\n  * Namespaced configuration. This greatly simplifies the process of adding\n  * new configurable item (#564)\n  * Add signals API. A simple event hooking mechanism to allow for\n  * extensibility (#577)\n  * Add deployment command-line script (#586)\n  * Allow XHTML editing in the nicEditor (#615)\n  * Allow parallel database migration streams (#563) -- paves the way for\n    *extensions*\n  * Use row-based email templates (#604) -- simplifies the process of adding\n    new email message templates (think *extensions*)\n  * Support fetching from email boxes with aliased email addresses (#663)\n  * Introduce new crypto library that provides failsafe encryption for email\n    passwords (#651)\n\n### Bugfixes\n  * Several typos in code and messages (#617, #618, #644, #660)\n  * Fix several upgrader bugs (#548, #619)\n  * Fix install fail on some Windows platforms (#570)\n  * Fix several issues in the command-line management (#580)\n  * Make room for command-line installation of osTicket (#581)\n  * *regression* Fix corrupted attachment downloads (#579, #583)\n  * Fix truncated attachment downloads when `zlib.output_compression` is\n    enabled (#596)\n  * Disable cron activities when upgrade is pending (#594)\n  * Provide failsafe encoding for improperly-formatted emails (#601)\n  * Fix corrupted email attachments processed via `pipe.php` (#607)\n  * Fix discarding of poorly encoded base64 emails (#624)\n  * Support MariaDB 10.0+ (#630)\n  * Properly trim ticket email and name fields (#600)\n  * Fix truncated text from text/plain emails and web interface posts (#652)\n  * Add **Assigned To** and other fields to ticket view export (#646)\n  * *regression* Fix attachment migration (#648)\n  * Display correct staff notes (#588)\n  * Display correct auto-response email for departments (#575)\n  * Fix login form (\"Authentication Required\") loop (#653)\n  * Ensure email message-id is fetched correctly (#664)\n  * Ensure X-Forwarded-For header does not have leading or trailing\n    whitespace (#665)\n\n### Performance\n  * Only fetch configuration for multifile upload if necessary (#637)\n  * Don't use sessions on the API (#623)\n  * *regression* Avoid an extra query per request to fetch schema signature\n    (#658)\n\nNew stuff in 1.7.0\n====================\n   * Bug fixes from rc6\n\nNew stuff in 1.7-rc6\n====================\n  * Bug fixes and enhancements from rc5\n\nNew stuff in 1.7-rc5\n====================\n  * Bug fixes from rc4\n\nNew stuff in 1.7-rc4\n====================\n  * Bug fixes from rc3\n\nNew stuff in 1.7-rc3\n====================\n  * Bug fixes from rc2\n  * Canned auto-reply template\n  * Modal dialogs\n  * PEAR packages upgrade\n  * Email encoding\n\nNew stuff in 1.7-rc2\n====================\n  * Bug fixes from rc1\n  * Nested help topics support\n\nNew stuff in 1.7-rc1\n====================\n  * Upgrade support for osTicket 1.6-rc1 and later\n  * Multi-file upload support -- more than one file (configurable) can be\n    uploaded with new messages, replies, and internal notes via the web\n    interface\n  * Department/Group access feature allowing members of a group access to a\n    department. Staff members are members of a (primary) group, and that\n    group can be granted access to one or more departments, granting the\n    associated staff access to departments other than their primary\n    department.\n  * Email filters can specify a canned auto-response\n  * Support inline attachments for fetched email\n\nNew stuff in 1.7-dpr4\n======================\n  * Dashboard reports for ticket system activity and statistics\n  * PDF print / export for tickets (staff pages only)\n\nNew stuff in 1.7-dpr3\n======================\n  * Advanced search on tickets page\n  * Ticket thread -- revised ticket message storage model for greater\n    flexability\n  * New database upgrade system allowing for continuous updates to the\n    database model. This will greatly simplify the process of making\n    modifications to the osTicket database.\n\nNew stuff in 1.7-dpr2\n======================\n  * Autocomplete for ticket search box (emails and ticket numbers typeahead)\n  * Redesigned staff login page\n  * Warning when leaving unsaved changes in admin and staff settings pages\n  * Auto change admin settings pages when selecting a new page from the\n    drop-down list\n  * Create a ticket in one click from the staff panel\n  * Preview ticket from the search results\n  * Export tickets to CSV file\n\nNew Features in 1.7\n===================\nVersion 1.7 includes several new features\n\nTicket Filters\n-------------\nAs an upgrade from email banning (which is still supported), ticket filters\nallow for matching incoming email in the subject line and message body. For\nmatching emails, the administrator has the ability to automatically route\ntickets:\n\n  * To a specific department, staff member, and/or team\n  * Automatically assign ticket priority and/or service-level-agreement\n  * Disable ticket auto-responses\n  * Send automatic canned responses\n\nTickets filters are also applied to tickets submitted via all ticket\ninterfaces, including the API, email, staff and client web interfaces. And,\nas a bonus, the filters can be configured to target only a single interface.\nSo an administrator could, for instance, target tickets received via email\nfrom a particular domain.\n\nCanned Attachments\n------------------\nAttach files to your canned responses. These attachments are automatically\nattached to the ticket thread along with the canned response. The\nattachments are not duplicated in the database and therefore use virtually\nno space.\n\nDatabase-backed Attachments\n---------------------------\nNo more crazy security-related configuration to your host server in order to\nsupport attachments. Attachments are now quietly stored in the database. The\nupgrade migration will automatically port attachments from the previous\nlocations into the database.\n\nService Level Agreements\n------------------------\nService level agreements allow for a configurable grace period based on the\ndepartment or help topic associated with the ticket. A default SLA is\nprovided, and a due date can be set to override the grace period of the SLA\nfor a ticket.\n\nClient-side Knowledgebase\n-------------------------\nManage a searchable help document portal for your users\n\nDashboard Reports\n-----------------\nFlashy reports of ticket system activity as well as exportable ticket system\nstatistics, allowing for easy report generation from office spreadsheet\napplications.\n\nTicket Export\n-------------\nConvert the ticket thread to a printed format for long term storage. The\nticket view page now supports a print feature, which will render the ticket\nas a PDF document.\n\nAPI\n---\nInterface with osTicket via HTTP requests. Starting with version 1.7,\ntickets are createable by submitting an HTTP POST request to either\n\n    /api/tickets.xml\n    /api/tickets.json\n\nThe API can also be used to pipe emails into the osTicket system. Use the\nincluded `automail.php` or `automail.pl` script to pipe emails to the\nsystem, or post raw email messages directly to\n\n    /api/tickets.email\n\nUse of the API requires an API key, which can be created and configured in\nthe admin panel of the support system.\n\nFor technical details, please refer to [API Docs] (setup/doc/api.md).\n\nGeeky New Features\n==================\n\nUnicode\n-------\nBetter and more consistent international text handling\n\nFlexible Template Variables\n---------------------------\nTemplate variables have been redesigned to be more flexible. They have been\nintegrated into the respective object classes so that an object as well as\nits properties can be represented in template variables. For instance\n%{ticket.staff.name}\n"
        },
        {
          "name": "account.php",
          "type": "blob",
          "size": 5.3125,
          "content": "<?php\n/*********************************************************************\n    profile.php\n\n    Manage client profile. This will allow a logged-in user to manage\n    his/her own public (non-internal) information\n\n    Peter Rotich <peter@osticket.com>\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n    $Id: $\n**********************************************************************/\nrequire 'client.inc.php';\n\n$inc = 'register.inc.php';\n\n$errors = array();\n\nif (!$cfg || !$cfg->isClientRegistrationEnabled()) {\n    Http::redirect('index.php');\n}\n\nelseif ($thisclient) {\n    // Guest registering for an account\n    if ($thisclient->isGuest()) {\n        foreach ($thisclient->getForms() as $f) {\n            if ($f->get('object_type') == 'U') {\n                $user_form = $f;\n                $user_form->getField('email')->configure('disabled', true);\n            }\n        }\n    }\n    // Existing client (with an account) updating profile\n    else {\n        $user = User::lookup($thisclient->getId());\n        $content = Page::lookupByType('registration-thanks');\n        $inc = isset($_GET['confirmed'])\n            ? 'register.confirmed.inc.php' : 'profile.inc.php';\n    }\n}\n\nif ($user && $_POST) {\n    if ($acct = $thisclient->getAccount()) {\n       $acct->update($_POST, $errors);\n    }\n    if (!$errors && $user->updateInfo($_POST, $errors))\n        Http::redirect('tickets.php');\n}\nelseif ($_POST) {\n    $user_form = UserForm::getUserForm()->getForm($_POST);\n    if ($thisclient) {\n        $user_form->getField('email')->configure('disabled', true);\n        $user_form->getField('email')->value = $thisclient->getEmail();\n        $_POST['email'] = $thisclient->getEmail();\n    }\n\n    if (!$user_form->isValid(function($f) { return $f->isVisibleToUsers(); }))\n        $errors['err'] = __('Incomplete client information');\n    elseif (!$_POST['backend'] && !$_POST['passwd1'])\n        $errors['passwd1'] = __('New password is required');\n    elseif (!$_POST['backend'] && $_POST['passwd2'] != $_POST['passwd1'])\n        $errors['passwd1'] = __('Passwords do not match');\n    else {\n        try {\n            UserAccount::checkPassword($_POST['passwd1']);\n        } catch (BadPassword $ex) {\n             $errors['passwd1'] = $ex->getMessage();\n        }\n    }\n\n    if ($errors)\n        $errors['err'] = $errors['err'] ?: __('Unable to register account. See messages below');\n    // XXX: The email will always be in use already if a guest is logged in\n    // and is registering for an account. Instead,\n    elseif (($addr = $user_form->getField('email')->getClean())\n            && ClientAccount::lookupByUsername($addr)) {\n        $user_form->getField('email')->addError(\n            sprintf(__('Email already registered. Would you like to %1$s sign in %2$s?'),\n            '<a href=\"login.php?e='.urlencode($addr).'\" style=\"color:inherit\"><strong>',\n            '</strong></a>'));\n        $errors['err'] = __('Unable to register account. See messages below');\n    }\n    elseif (!$addr)\n        $errors['email'] = sprintf(__('%s is a required field'), $user_form->getField('email')->getLocal('label'));\n    elseif (!$user_form->getField('name')->getClean())\n        $errors['name'] = sprintf(__('%s is a required field'), $user_form->getField('name')->getLocal('label'));\n    // Registration for existing users\n    elseif ($addr && ($user = User::lookupByEmail($addr)) && !$user->updateInfo($_POST, $errors))\n      $errors['err'] = __('Unable to register account. See messages below');\n    // Users created from ClientCreateRequest\n    elseif (isset($_POST['backend']) && !($user = User::fromVars($user_form->getClean())))\n        $errors['err'] = __('Unable to create local account. See messages below');\n    // New users and users registering from a ticket access link\n    elseif (!$user && !($user = $thisclient ?: User::fromForm($user_form)))\n        $errors['err'] = __('Unable to register account. See messages below');\n    else {\n        if (!($acct = ClientAccount::createForUser($user)))\n            $errors['err'] = __('Unable to create new account.')\n                .' '.__('Internal error occurred');\n        elseif (!$acct->update($_POST, $errors))\n            $errors['err'] = __('Errors configuring your profile. See messages below');\n    }\n\n    if (!$errors) {\n        switch ($_POST['do']) {\n        case 'create':\n            $content = Page::lookupByType('registration-confirm');\n            $inc = 'register.confirm.inc.php';\n            $acct->sendConfirmEmail();\n            break;\n        case 'import':\n            if ($bk = UserAuthenticationBackend::getBackend($_POST['backend'])) {\n                $cl = new ClientSession(new EndUser($user));\n                if (!$bk->supportsInteractiveAuthentication())\n                    $acct->set('backend', null);\n                $acct->confirm();\n                if ($user = $bk->login($cl, $bk))\n                    Http::redirect('tickets.php');\n            }\n            break;\n        }\n        // Rotate CSRF on successful POST\n        $ost->getCSRF()->rotate();\n    }\n\n    if ($errors && $user && $user != $thisclient)\n        $user->delete();\n}\n\ninclude(CLIENTINC_DIR.'header.inc.php');\ninclude(CLIENTINC_DIR.$inc);\ninclude(CLIENTINC_DIR.'footer.inc.php');\n"
        },
        {
          "name": "ajax.php",
          "type": "blob",
          "size": 1.876953125,
          "content": "<?php\n/*********************************************************************\n    ajax.php\n\n    Ajax utils for client interface.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\n\nfunction clientLoginPage($msg='Unauthorized') {\n    Http::response(403,'Must login: '.Format::htmlchars($msg));\n    exit;\n}\n\nrequire('client.inc.php');\n\nif(!defined('INCLUDE_DIR'))\tHttp::response(500, 'Server configuration error');\nrequire_once INCLUDE_DIR.'/class.dispatcher.php';\nrequire_once INCLUDE_DIR.'/class.ajax.php';\n\n$dispatcher = patterns('',\n    url('^/config/', patterns('ajax.config.php:ConfigAjaxAPI',\n        url_get('^client$', 'client')\n    )),\n    url('^/draft/', patterns('ajax.draft.php:DraftAjaxAPI',\n        url_post('^(?P<id>\\d+)$', 'updateDraftClient'),\n        url_delete('^(?P<id>\\d+)$', 'deleteDraftClient'),\n        url_post('^(?P<id>\\d+)/attach$', 'uploadInlineImageClient'),\n        url_post('^(?P<namespace>[\\w.]+)/attach$', 'uploadInlineImageEarlyClient'),\n        url_get('^(?P<namespace>[\\w.]+)$', 'getDraftClient'),\n        url_post('^(?P<namespace>[\\w.]+)$', 'createDraftClient')\n    )),\n    url('^/form/', patterns('ajax.forms.php:DynamicFormsAjaxAPI',\n        url_get('^help-topic/(?P<id>\\d+)$', 'getClientFormsForHelpTopic'),\n        url_post('^upload/(\\d+)?$', 'upload'),\n        url_post('^upload/(\\w+)?$', 'attach'),\n        url_post('^upload/(?P<object>ticket|task)/(\\w+)$', 'attach')\n    )),\n    url('^/i18n/(?P<lang>[\\w_]+)/', patterns('ajax.i18n.php:i18nAjaxAPI',\n        url_get('(?P<tag>\\w+)$', 'getLanguageFile')\n    ))\n);\nSignal::send('ajax.client', $dispatcher);\nprint $dispatcher->resolve(Osticket::get_path_info());\n?>\n"
        },
        {
          "name": "api",
          "type": "tree",
          "content": null
        },
        {
          "name": "apps",
          "type": "tree",
          "content": null
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "avatar.php",
          "type": "blob",
          "size": 1.060546875,
          "content": "<?php\n/*********************************************************************\n    avatar.php\n\n    Simple download utility for internally-generated avatars\n\n    Peter Rotich <peter@osticket.com>\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2014 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire('client.inc.php');\n\nif (!isset($_GET['uid']) || !isset($_GET['mode']))\n    Http::response(400, '`uid` and `mode` parameters are required');\n\nrequire_once INCLUDE_DIR . 'class.avatar.php';\n\ntry {\n    $ra = new RandomAvatar($_GET['mode']);\n    $avatar = $ra->makeAvatar($_GET['uid'], $_GET['size']);\n\n    Http::response(200, false, 'image/png', false);\n    Http::cacheable($_GET['uid'], false, 86400);\n    imagepng($avatar, null, 1);\n    imagedestroy($avatar);\n    exit;\n}\ncatch (InvalidArgumentException $ex) {\n    Http::response(422, 'No such avatar image set');\n}\n"
        },
        {
          "name": "bootstrap.php",
          "type": "blob",
          "size": 15.873046875,
          "content": "<?php\n\nclass Bootstrap {\n\n    static function init() {\n        #Disable Globals if enabled....before loading config info\n        if(ini_get('register_globals')) {\n           ini_set('register_globals',0);\n           foreach($_REQUEST as $key=>$val)\n               if(isset($$key))\n                   unset($$key);\n        }\n\n        #Disable url fopen && url include\n        ini_set('allow_url_fopen', 0);\n        ini_set('allow_url_include', 0);\n\n        #Disable session ids on url.\n        ini_set('session.use_trans_sid', 0);\n        #No cache\n        session_cache_limiter('nocache');\n\n        #Error reporting...Good idea to ENABLE error reporting to a file. i.e display_errors should be set to false\n        $error_reporting = E_ALL & ~E_NOTICE & ~E_WARNING;\n        if (defined('E_STRICT')) # 5.4.0\n            $error_reporting &= ~E_STRICT;\n        if (defined('E_DEPRECATED')) # 5.3.0\n            $error_reporting &= ~(E_DEPRECATED | E_USER_DEPRECATED);\n        error_reporting($error_reporting); //Respect whatever is set in php.ini (sysadmin knows better??)\n\n        #Don't display errors\n        ini_set('display_errors', 1);\n        ini_set('display_startup_errors', 1);\n\n        //Default timezone\n        if (!ini_get('date.timezone')) {\n            if(function_exists('date_default_timezone_set')) {\n                if(@date_default_timezone_get()) //Let PHP determine the timezone.\n                    @date_default_timezone_set(@date_default_timezone_get());\n                else //Default to EST - if PHP can't figure it out.\n                    date_default_timezone_set('America/New_York');\n            } else { //Default when all fails. PHP < 5.\n                ini_set('date.timezone', 'America/New_York');\n            }\n        }\n        date_default_timezone_set('UTC');\n\n        if (!function_exists('exif_imagetype')) {\n            function exif_imagetype ($filename) {\n                if ((list($width,$height,$type,) = getimagesize($filename)) !== false)\n                    return $type;\n\n                return false;\n            }\n        }\n\n        if (!function_exists('exif_imagetype')) {\n            function exif_imagetype ($filename) {\n                if ((list($width,$height,$type,) = getimagesize($filename)) !== false)\n                    return $type;\n\n                return false;\n            }\n        }\n\n        if (!isset($_SERVER['REMOTE_ADDR']))\n            $_SERVER['REMOTE_ADDR'] = '';\n    }\n\n    static function https() {\n       return osTicket::is_https();\n    }\n\n    static function defineTables($prefix) {\n        #Tables being used sytem wide\n        define('SYSLOG_TABLE',$prefix.'syslog');\n        define('SESSION_TABLE',$prefix.'session');\n        define('CONFIG_TABLE',$prefix.'config');\n\n        define('CANNED_TABLE',$prefix.'canned_response');\n        define('PAGE_TABLE', $prefix.'content');\n        define('FILE_TABLE',$prefix.'file');\n        define('FILE_CHUNK_TABLE',$prefix.'file_chunk');\n\n        define('ATTACHMENT_TABLE',$prefix.'attachment');\n\n        define('USER_TABLE',$prefix.'user');\n        define('USER_CDATA_TABLE', $prefix.'user__cdata');\n        define('USER_EMAIL_TABLE',$prefix.'user_email');\n        define('USER_ACCOUNT_TABLE',$prefix.'user_account');\n\n        define('ORGANIZATION_TABLE', $prefix.'organization');\n        define('ORGANIZATION_CDATA_TABLE', $prefix.'organization__cdata');\n\n        define('NOTE_TABLE', $prefix.'note');\n\n        define('STAFF_TABLE',$prefix.'staff');\n        define('TEAM_TABLE',$prefix.'team');\n        define('TEAM_MEMBER_TABLE',$prefix.'team_member');\n        define('DEPT_TABLE',$prefix.'department');\n        define('STAFF_DEPT_TABLE', $prefix.'staff_dept_access');\n        define('ROLE_TABLE', $prefix.'role');\n\n        define('FAQ_TABLE',$prefix.'faq');\n        define('FAQ_TOPIC_TABLE',$prefix.'faq_topic');\n        define('FAQ_CATEGORY_TABLE',$prefix.'faq_category');\n\n        define('DRAFT_TABLE',$prefix.'draft');\n\n        define('THREAD_TABLE', $prefix.'thread');\n        define('THREAD_ENTRY_TABLE', $prefix.'thread_entry');\n        define('THREAD_ENTRY_EMAIL_TABLE', $prefix.'thread_entry_email');\n        define('THREAD_ENTRY_MERGE_TABLE', $prefix.'thread_entry_merge');\n\n        define('LOCK_TABLE',$prefix.'lock');\n\n        define('TICKET_TABLE',$prefix.'ticket');\n        define('TICKET_CDATA_TABLE', $prefix.'ticket__cdata');\n        define('THREAD_EVENT_TABLE',$prefix.'thread_event');\n        define('THREAD_REFERRAL_TABLE',$prefix.'thread_referral');\n        define('THREAD_COLLABORATOR_TABLE', $prefix.'thread_collaborator');\n        define('TICKET_STATUS_TABLE', $prefix.'ticket_status');\n        define('TICKET_PRIORITY_TABLE',$prefix.'ticket_priority');\n        define('EVENT_TABLE',$prefix.'event');\n\n        define('TASK_TABLE', $prefix.'task');\n        define('TASK_CDATA_TABLE', $prefix.'task__cdata');\n\n        define('PRIORITY_TABLE',TICKET_PRIORITY_TABLE);\n\n\n        define('FORM_SEC_TABLE',$prefix.'form');\n        define('FORM_FIELD_TABLE',$prefix.'form_field');\n\n        define('LIST_TABLE',$prefix.'list');\n        define('LIST_ITEM_TABLE',$prefix.'list_items');\n\n        define('FORM_ENTRY_TABLE',$prefix.'form_entry');\n        define('FORM_ANSWER_TABLE',$prefix.'form_entry_values');\n\n        define('TOPIC_TABLE',$prefix.'help_topic');\n        define('TOPIC_FORM_TABLE',$prefix.'help_topic_form');\n        define('SLA_TABLE', $prefix.'sla');\n\n        define('EMAIL_TABLE',$prefix.'email');\n        define('EMAIL_ACCOUNT_TABLE', $prefix.'email_account');\n        define('EMAIL_TEMPLATE_GRP_TABLE',$prefix.'email_template_group');\n        define('EMAIL_TEMPLATE_TABLE',$prefix.'email_template');\n\n        define('FILTER_TABLE', $prefix.'filter');\n        define('FILTER_RULE_TABLE', $prefix.'filter_rule');\n        define('FILTER_ACTION_TABLE', $prefix.'filter_action');\n\n        define('PLUGIN_TABLE', $prefix.'plugin');\n        define('PLUGIN_INSTANCE_TABLE', $prefix.'plugin_instance');\n        define('SEQUENCE_TABLE', $prefix.'sequence');\n        define('TRANSLATION_TABLE', $prefix.'translation');\n        define('QUEUE_TABLE', $prefix.'queue');\n        define('COLUMN_TABLE', $prefix.'queue_column');\n        define('QUEUE_COLUMN_TABLE', $prefix.'queue_columns');\n        define('QUEUE_SORT_TABLE', $prefix.'queue_sort');\n        define('QUEUE_SORTING_TABLE', $prefix.'queue_sorts');\n        define('QUEUE_EXPORT_TABLE', $prefix.'queue_export');\n        define('QUEUE_CONFIG_TABLE', $prefix.'queue_config');\n\n        define('SCHEDULE_TABLE', $prefix.'schedule');\n        define('SCHEDULE_ENTRY_TABLE', $prefix.'schedule_entry');\n\n        define('API_KEY_TABLE',$prefix.'api_key');\n        define('TIMEZONE_TABLE',$prefix.'timezone');\n    }\n\n    static function loadConfig() {\n        #load config info\n        $configfile='';\n        if(file_exists(INCLUDE_DIR.'ost-config.php')) //NEW config file v 1.6 stable ++\n            $configfile=INCLUDE_DIR.'ost-config.php';\n        elseif(file_exists(ROOT_DIR.'ostconfig.php')) //Old installs prior to v 1.6 RC5\n            $configfile=ROOT_DIR.'ostconfig.php';\n        elseif(file_exists(INCLUDE_DIR.'settings.php')) { //OLD config file.. v 1.6 RC5\n            $configfile=INCLUDE_DIR.'settings.php';\n            //Die gracefully on upgraded v1.6 RC5 installation - otherwise script dies with confusing message.\n            if(!strcasecmp(basename($_SERVER['SCRIPT_NAME']), 'settings.php'))\n                Http::response(500,\n                    'Please rename config file include/settings.php to include/ost-config.php to continue!');\n        } elseif(file_exists(ROOT_DIR.'setup/'))\n            Http::redirect(ROOT_PATH.'setup/');\n\n        if(!$configfile || !file_exists($configfile))\n            Http::response(500,'<b>Error loading settings. Contact admin.</b>');\n\n        require($configfile);\n        define('CONFIG_FILE',$configfile); //used in admin.php to check perm.\n\n        # This is to support old installations. with no secret salt.\n        if (!defined('SECRET_SALT'))\n            define('SECRET_SALT',md5(TABLE_PREFIX.ADMIN_EMAIL));\n        #Session related\n        define('SESSION_SECRET', MD5(SECRET_SALT)); //Not that useful anymore...\n        define('SESSION_TTL', 86400); // Default 24 hours\n    }\n\n    static function connect() {\n        #Connect to the DB && get configuration from database\n        $ferror=null;\n        $options = array();\n        if (defined('DBSSLCA'))\n            $options['ssl'] = array(\n                'ca' => DBSSLCA,\n                'cert' => DBSSLCERT,\n                'key' => DBSSLKEY\n            );\n\n        $hosts = explode(',', DBHOST);\n        foreach ($hosts as $host) {\n            $ferror  = null;\n            if (!db_connect($host, DBUSER, DBPASS, $options)) {\n                $ferror = sprintf('Unable to connect to the database — %s',\n                        db_connect_error());\n            }elseif(!db_select_database(DBNAME)) {\n                $ferror = sprintf('Unknown or invalid database: %s',\n                        DBNAME);\n           }\n           // break if no error\n           if (!$ferror) break;\n        }\n\n        if ($ferror) //Fatal error\n            self::croak($ferror);\n    }\n\n    static function loadCode() {\n        #include required files\n        require_once INCLUDE_DIR.'class.util.php';\n        include_once INCLUDE_DIR.'class.controller.php';\n        require_once INCLUDE_DIR.'class.translation.php';\n        require_once(INCLUDE_DIR.'class.signal.php');\n        require(INCLUDE_DIR.'class.model.php');\n        require(INCLUDE_DIR.'class.user.php');\n        require(INCLUDE_DIR.'class.auth.php');\n        require(INCLUDE_DIR.'class.pagenate.php'); //Pagenate helper!\n        require(INCLUDE_DIR.'class.log.php');\n        require(INCLUDE_DIR.'class.crypto.php');\n        require(INCLUDE_DIR.'class.page.php');\n        require_once(INCLUDE_DIR.'class.format.php'); //format helpers\n        require_once(INCLUDE_DIR.'class.validator.php');\n        require_once INCLUDE_DIR.'mysqli.php';\n        require_once INCLUDE_DIR.'class.i18n.php';\n        require_once INCLUDE_DIR.'class.queue.php';\n    }\n\n    static function i18n_prep() {\n        ini_set('default_charset', 'utf-8');\n        ini_set('output_encoding', 'utf-8');\n\n        // MPDF requires mbstring functions\n        if (!extension_loaded('mbstring')) {\n            if (function_exists('iconv')) {\n                function mb_strpos($a, $b) { return iconv_strpos($a, $b); }\n                function mb_strlen($str) { return iconv_strlen($str); }\n                function mb_substr($a, $b, $c=null) {\n                    return iconv_substr($a, $b, $c); }\n                function mb_convert_encoding($str, $to, $from='utf-8') {\n                    return iconv($from, $to, $str); }\n            }\n            else {\n                function mb_strpos($a, $b) {\n                    $c = preg_replace('/^(\\X*)'.preg_quote($b).'.*$/us', '$1', $a);\n                    return ($c===$a) ? false : mb_strlen($c);\n                }\n                function mb_strlen($str) {\n                    $a = array();\n                    return preg_match_all('/\\X/u', $str, $a);\n                }\n                function mb_substr($a, $b, $c=null) {\n                    return preg_replace(\n                        \"/^\\X{{$b}}(\\X\".($c ? \"{{$c}}\" : \"*\").\").*/us\",'$1',$a);\n                }\n                function mb_convert_encoding($str, $to, $from='utf-8') {\n                    if (strcasecmp($to, $from) == 0)\n                        return $str;\n                    elseif (in_array(strtolower($to), array(\n                            'us-ascii','latin-1','iso-8859-1'))\n                            && function_exists('utf8_encode'))\n                        return utf8_encode($str);\n                    else\n                        return $str;\n                }\n            }\n            define('LATIN1_UC_CHARS', 'ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖØÙÚÛÜÝ');\n            define('LATIN1_LC_CHARS', 'àáâãäåæçèéêëìíîïðñòóôõöøùúûüý');\n            function mb_strtoupper($str) {\n                if (is_array($str)) $str = $str[0];\n                return strtoupper(strtr($str, LATIN1_LC_CHARS, LATIN1_UC_CHARS));\n            }\n            function mb_strtolower($str) {\n                if (is_array($str)) $str = $str[0];\n                return strtolower(strtr($str, LATIN1_UC_CHARS, LATIN1_LC_CHARS));\n            }\n            define('MB_CASE_LOWER', 1);\n            define('MB_CASE_UPPER', 2);\n            define('MB_CASE_TITLE', 3);\n            function mb_convert_case($str, $mode) {\n                // XXX: Techincally the calls to strto...() will fail if the\n                //      char is not a single-byte char\n                switch ($mode) {\n                case MB_CASE_LOWER:\n                    return preg_replace_callback('/\\p{Lu}+/u', 'mb_strtolower', $str);\n                case MB_CASE_UPPER:\n                    return preg_replace_callback('/\\p{Ll}+/u', 'mb_strtoupper', $str);\n                case MB_CASE_TITLE:\n                    return preg_replace_callback('/\\b\\p{Ll}/u', 'mb_strtoupper', $str);\n                }\n            }\n            function mb_internal_encoding($encoding) { return 'UTF-8'; }\n            function mb_regex_encoding($encoding) { return 'UTF-8'; }\n            function mb_substr_count($haystack, $needle) {\n                $matches = array();\n                return preg_match_all('`'.preg_quote($needle).'`u', $haystack,\n                    $matches);\n            }\n        }\n        else {\n            // Use UTF-8 for all multi-byte string encoding\n            mb_internal_encoding('utf-8');\n        }\n        if (extension_loaded('iconv'))\n            iconv_set_encoding('internal_encoding', 'UTF-8');\n\n        if (intval(phpversion()) < 7) {\n            function random_int($a, $b) {\n                return rand($a, $b);\n            }\n        }\n\n        function mb_str_wc($str) {\n            return count(preg_split('~[^\\p{L}\\p{N}\\'].+~u', trim($str)));\n        }\n    }\n\n    static function croak($message) {\n        $msg = $message.\"\\n\\n\".THISPAGE;\n        osTicket\\Mail\\Mailer::sendmail(ADMIN_EMAIL, 'osTicket Fatal Error', $msg,\n            sprintf('\"osTicket Alerts\"<%s>', ADMIN_EMAIL));\n        //Display generic error to the user\n        Http::response(500, \"<b>Fatal Error:</b> Contact system administrator.\");\n    }\n}\n\n#Get real path for root dir ---linux and windows\n$here = dirname(__FILE__);\n$here = ($h = realpath($here)) ? $h : $here;\ndefine('ROOT_DIR',str_replace('\\\\', '/', $here.'/'));\nunset($here); unset($h);\n\ndefine('INCLUDE_DIR',ROOT_DIR.'include/'); //Change this if include is moved outside the web path.\ndefine('PEAR_DIR',INCLUDE_DIR.'pear/');\ndefine('SETUP_DIR',ROOT_DIR.'setup/');\n\ndefine('CLIENTINC_DIR',INCLUDE_DIR.'client/');\ndefine('STAFFINC_DIR',INCLUDE_DIR.'staff/');\n\ndefine('UPGRADE_DIR', INCLUDE_DIR.'upgrader/');\ndefine('I18N_DIR', INCLUDE_DIR.'i18n/');\ndefine('CLI_DIR', INCLUDE_DIR.'cli/');\n\n/*############## Do NOT monkey with anything else beyond this point UNLESS you really know what you are doing ##############*/\n\n#Current version && schema signature (Changes from version to version)\ndefine('GIT_VERSION','$git');\ndefine('MAJOR_VERSION', '1.18');\ndefine('THIS_VERSION', MAJOR_VERSION.'-git'); //Shown on admin panel\n//Path separator\nif(!defined('PATH_SEPARATOR')){\n    if(strpos($_ENV['OS'],'Win')!==false || !strcasecmp(substr(PHP_OS, 0, 3),'WIN'))\n        define('PATH_SEPARATOR', ';' ); //Windows\n    else\n        define('PATH_SEPARATOR',':'); //Linux\n}\n\n//Set include paths. Overwrite the default paths.\nini_set('include_path', './'.PATH_SEPARATOR.INCLUDE_DIR.PATH_SEPARATOR.PEAR_DIR);\n\nrequire(INCLUDE_DIR.'class.osticket.php');\nrequire(INCLUDE_DIR.'class.misc.php');\nrequire(INCLUDE_DIR.'class.http.php');\nrequire(INCLUDE_DIR.'class.validator.php');\n\n// Determine the path in the URI used as the base of the osTicket\n// installation\nif (!defined('ROOT_PATH') && ($rp = osTicket::get_root_path(dirname(__file__))))\n    define('ROOT_PATH', rtrim($rp, '/').'/');\n\nBootstrap::init();\n\n#CURRENT EXECUTING SCRIPT.\ndefine('THISPAGE', Http::url());\n\ndefine('DEFAULT_MAX_FILE_UPLOADS', ini_get('max_file_uploads') ?: 5);\ndefine('DEFAULT_PRIORITY_ID', 1);\n\n?>\n"
        },
        {
          "name": "captcha.php",
          "type": "blob",
          "size": 0.5966796875,
          "content": "<?php\n/*********************************************************************\n    captcha.php\n\n    Simply returns captcha image.\n    \n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire_once('main.inc.php');\nrequire(INCLUDE_DIR.'class.captcha.php');\n$captcha = new Captcha(5,12,ROOT_DIR.'images/captcha/');\necho $captcha->getImage();\n?>\n"
        },
        {
          "name": "client.inc.php",
          "type": "blob",
          "size": 2.9990234375,
          "content": "<?php\n/*********************************************************************\n    client.inc.php\n\n    File included on every client page\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nif(!strcasecmp(basename($_SERVER['SCRIPT_NAME']),basename(__FILE__))) die('kwaheri rafiki!');\n\n$thisdir=str_replace('\\\\', '/', dirname(__FILE__)).'/';\nif(!file_exists($thisdir.'main.inc.php')) die('Fatal Error.');\n\nrequire_once($thisdir.'main.inc.php');\n\nif(!defined('INCLUDE_DIR')) die('Fatal error');\n\n// Enforce ACL (if applicable)\nif (!Validator::check_acl('client'))\n    die(__('Access Denied'));\n\n/*Some more include defines specific to client only */\ndefine('CLIENTINC_DIR',INCLUDE_DIR.'client/');\ndefine('OSTCLIENTINC',TRUE);\n\ndefine('ASSETS_PATH',ROOT_PATH.'assets/default/');\n\n//Check the status of the HelpDesk.\nif (!in_array(strtolower(basename($_SERVER['SCRIPT_NAME'])), array('logo.php','file.php'))\n        && !(is_object($ost) && $ost->isSystemOnline())) {\n    include(ROOT_DIR.'offline.php');\n    exit;\n}\n\n/* include what is needed on client stuff */\nrequire_once(INCLUDE_DIR.'class.client.php');\nrequire_once(INCLUDE_DIR.'class.ticket.php');\nrequire_once(INCLUDE_DIR.'class.dept.php');\n\n//clear some vars\n$errors=array();\n$msg='';\n$nav=null;\n//Make sure the user is valid..before doing anything else.\n$thisclient = UserAuthenticationBackend::getUser();\n\nif (isset($_GET['lang']) && $_GET['lang']) {\n    Internationalization::setCurrentLanguage($_GET['lang']);\n}\n\n// Bootstrap gettext translations as early as possible, but after attempting\n// to sign on the agent\nTextDomain::configureForUser($thisclient);\n\n//is the user logged in?\nif($thisclient && $thisclient->getId() && $thisclient->isValid()){\n     $thisclient->refreshSession();\n} else {\n    $thisclient = null;\n}\n\n/******* CSRF Protectin *************/\n// Enforce CSRF protection for POSTS\nif ($_POST  && !$ost->checkCSRFToken()) {\n    Http::redirect('index.php');\n    //just incase redirect fails\n    die('Action denied (400)!');\n}\n\n//Add token to the header - used on ajax calls [DO NOT CHANGE THE NAME]\n$ost->addExtraHeader('<meta name=\"csrf_token\" content=\"'.$ost->getCSRFToken().'\" />');\n\n/* Client specific defaults */\ndefine('PAGE_LIMIT', DEFAULT_PAGE_LIMIT);\ndefine('SESSION_MAXLIFE', $thisclient ? $thisclient->getMaxIdleTime() :\n        SESSION_TTL);\n\nrequire(INCLUDE_DIR.'class.nav.php');\n$nav = new UserNav($thisclient, 'home');\n\n$exempt = in_array(basename($_SERVER['SCRIPT_NAME']), array('logout.php', 'ajax.php', 'logs.php', 'upgrade.php'));\n\nif (!$exempt && $thisclient && ($acct = $thisclient->getAccount())\n        && $acct->isPasswdResetForced()) {\n    $warn = __('Password change required to continue');\n    require('profile.php'); //profile.php must request this file as require_once to avoid problems.\n    exit;\n}\n?>\n"
        },
        {
          "name": "css",
          "type": "tree",
          "content": null
        },
        {
          "name": "file.php",
          "type": "blob",
          "size": 2.2978515625,
          "content": "<?php\n/*********************************************************************\n    file.php\n\n    File download facilitator for clients\n\n    Peter Rotich <peter@osticket.com>\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2014 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire('client.inc.php');\nrequire_once(INCLUDE_DIR.'class.file.php');\n\n//Basic checks\nif (!$_GET['key']\n    || !$_GET['signature']\n    || !$_GET['expires']\n    || !($file = AttachmentFile::lookupByHash($_GET['key']))\n) {\n    Http::response(404, __('Unknown or invalid file'));\n}\n\n// Get the object type the file is attached to\n$type = '';\n$attachment = null;\nif ($_GET['id']\n        && ($attachment=$file->attachments->findFirst(array(\n                    'id' => $_GET['id']))))\n    $type = $attachment->type;\n\n// Enforce security settings if enabled.\nif ($cfg->isAuthRequiredForFiles()\n        // FAQ & Page files allowed without login.\n        && !in_array($type, ['P', 'F'])\n        // Check user login\n        && !$thisuser\n        // Check staff login\n        && !StaffAuthenticationBackend::getUser()\n        ) {\n\n    // Try and determine if an agent is viewing the page / file\n    if (strpos($_SERVER['HTTP_REFERRER'], ROOT_PATH .  'scp/') !== false) {\n        $_SESSION['_staff']['auth']['dest'] = Http::refresh_url();\n        Http::redirect(ROOT_PATH.'scp/login.php');\n    } else {\n        require 'secure.inc.php';\n    }\n}\n\n\n// Validate session access hash - we want to make sure the link is FRESH!\n// and the user has access to the parent ticket!!\nif ($file->verifySignature($_GET['signature'], $_GET['expires'])) {\n    try {\n        if (($s = @$_GET['s']) && strpos($file->getType(), 'image/') === 0)\n            return $file->display($s);\n\n        // Download the file..\n        $filename = $attachment ? $attachment->name : $file->getName();\n        $disposition = @$_GET['disposition'] ?: false;\n        $file->download($filename, $disposition, @$_GET['expires']);\n    }\n    catch (Exception $ex) {\n        Http::response(500, 'Unable to find that file: '.$ex->getMessage());\n    }\n}\n// else\nHttp::response(404, __('Unknown or invalid file'));\n"
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "include",
          "type": "tree",
          "content": null
        },
        {
          "name": "index.php",
          "type": "blob",
          "size": 2.28125,
          "content": "<?php\n/*********************************************************************\n    index.php\n\n    Helpdesk landing page. Please customize it to fit your needs.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire('client.inc.php');\n\nrequire_once INCLUDE_DIR . 'class.page.php';\n\n$section = 'home';\nrequire(CLIENTINC_DIR.'header.inc.php');\n?>\n<div id=\"landing_page\">\n<?php include CLIENTINC_DIR.'templates/sidebar.tmpl.php'; ?>\n<div class=\"main-content\">\n<?php\nif ($cfg && $cfg->isKnowledgebaseEnabled()) { ?>\n<div class=\"search-form\">\n    <form method=\"get\" action=\"kb/faq.php\">\n    <input type=\"hidden\" name=\"a\" value=\"search\"/>\n    <input type=\"text\" name=\"q\" class=\"search\" placeholder=\"<?php echo __('Search our knowledge base'); ?>\"/>\n    <button type=\"submit\" class=\"green button\"><?php echo __('Search'); ?></button>\n    </form>\n</div>\n<?php } ?>\n<div class=\"thread-body\">\n<?php\n    if($cfg && ($page = $cfg->getLandingPage()))\n        echo $page->getBodyWithImages();\n    else\n        echo  '<h1>'.__('Welcome to the Support Center').'</h1>';\n    ?>\n    </div>\n</div>\n<div class=\"clear\"></div>\n\n<div>\n<?php\nif($cfg && $cfg->isKnowledgebaseEnabled()){\n    //FIXME: provide ability to feature or select random FAQs ??\n?>\n<br/><br/>\n<?php\n$cats = Category::getFeatured();\nif ($cats->all()) { ?>\n<h1><?php echo __('Featured Knowledge Base Articles'); ?></h1>\n<?php\n}\n\n    foreach ($cats as $C) { ?>\n    <div class=\"featured-category front-page\">\n        <i class=\"icon-folder-open icon-2x\"></i>\n        <div class=\"category-name\">\n            <?php echo $C->getName(); ?>\n        </div>\n<?php foreach ($C->getTopArticles() as $F) { ?>\n        <div class=\"article-headline\">\n            <div class=\"article-title\"><a href=\"<?php echo ROOT_PATH;\n                ?>kb/faq.php?id=<?php echo $F->getId(); ?>\"><?php\n                echo $F->getQuestion(); ?></a></div>\n            <div class=\"article-teaser\"><?php echo $F->getTeaser(); ?></div>\n        </div>\n<?php } ?>\n    </div>\n<?php\n    }\n}\n?>\n</div>\n</div>\n\n<?php require(CLIENTINC_DIR.'footer.inc.php'); ?>\n"
        },
        {
          "name": "js",
          "type": "tree",
          "content": null
        },
        {
          "name": "kb",
          "type": "tree",
          "content": null
        },
        {
          "name": "login.php",
          "type": "blob",
          "size": 5.6298828125,
          "content": "<?php\n/*********************************************************************\n    login.php\n\n    User access link recovery\n\n    TODO: This is a temp. fix to allow for collaboration in lieu of real\n    username and password coming in 1.8.2\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire_once('client.inc.php');\nif(!defined('INCLUDE_DIR')) die('Fatal Error');\ndefine('CLIENTINC_DIR',INCLUDE_DIR.'client/');\ndefine('OSTCLIENTINC',TRUE); //make includes happy\n\nrequire_once(INCLUDE_DIR.'class.client.php');\nrequire_once(INCLUDE_DIR.'class.ticket.php');\n\nif ($cfg->getClientRegistrationMode() == 'disabled'\n        || isset($_POST['lticket']))\n    $inc = 'accesslink.inc.php';\nelse\n    $inc = 'login.inc.php';\n\n$suggest_pwreset = false;\n\n// Check the CSRF token, and ensure that future requests will have to use a\n// different CSRF token. This will help ward off both parallel and serial\n// brute force attacks, because new tokens will have to be requested for\n// each attempt.\nif ($_POST) {\n    // Check CSRF token\n    if (!$ost->checkCSRFToken())\n        Http::response(400, __('Valid CSRF Token Required'));\n\n    // Rotate the CSRF token (original cannot be reused)\n    $ost->getCSRF()->rotate();\n}\n\nif ($_POST && isset($_POST['luser'])) {\n    if (!$_POST['luser'])\n        $errors['err'] = __('Valid username or email address is required');\n    elseif (($user = UserAuthenticationBackend::process(trim($_POST['luser']),\n            substr($_POST['lpasswd'], 0, 128), $errors))) {\n        if ($user instanceof ClientCreateRequest) {\n            if ($cfg && $cfg->isClientRegistrationEnabled()) {\n                // Attempt to automatically register\n                if ($user->attemptAutoRegister())\n                    Http::redirect('tickets.php');\n\n                // Auto-registration failed. Show the user the info we have\n                $inc = 'register.inc.php';\n                $user_form = UserForm::getUserForm()->getForm($user->getInfo());\n            }\n            else {\n                $errors['err'] = __('Access Denied. Contact your help desk administrator to have an account registered for you');\n                // fall through to show login page again\n            }\n        }\n        else {\n            Http::redirect($_SESSION['_client']['auth']['dest']\n                ?: 'tickets.php');\n        }\n    } elseif(!$errors['err']) {\n        $errors['err'] = sprintf('%s - %s', __('Invalid username or password'), __('Please try again!'));\n    }\n    $suggest_pwreset = true;\n}\nelseif ($_POST && isset($_POST['lticket'])) {\n    if (!Validator::is_email($_POST['lemail']))\n        $errors['err'] = __('Valid email address and ticket number required');\n    elseif (($user = UserAuthenticationBackend::process($_POST['lemail'],\n            $_POST['lticket'], $errors))) {\n\n        // If email address verification is not required, then provide\n        // immediate access to the ticket!\n        if (!$cfg->isClientEmailVerificationRequired())\n            Http::redirect('tickets.php');\n\n        // This will succeed as it is checked in the authentication backend\n        $ticket = Ticket::lookupByNumber($_POST['lticket'], $_POST['lemail']);\n\n        // We're using authentication backend so we can guard aganist brute\n        // force attempts (which doesn't buy much since the link is emailed)\n        if ($ticket) {\n            $ticket->sendAccessLink($user);\n            $msg = sprintf(__(\"%s - access link sent to your email!\"),\n                Format::htmlchars($user->getName()->getFirst()));\n            $_POST = null;\n        } else {\n            $errors['err'] = sprintf('%s - %s',\n                __('Invalid email or ticket number'),\n                __('Please try again!'));\n        }\n    } elseif(!$errors['err']) {\n        $errors['err'] = sprintf('%s - %s', __('Invalid email or ticket number'), __('Please try again!'));\n    }\n}\nelseif (isset($_GET['do'])) {\n    switch($_GET['do']) {\n    case 'ext':\n        // Lookup external backend\n        if ($bk = UserAuthenticationBackend::getBackend($_GET['bk'])) {\n            $result = $bk->triggerAuth();\n            if ($result instanceof AccessDenied) {\n                $errors['err'] = $result->getMessage();\n            }\n        }\n    }\n}\nelseif ($user = UserAuthenticationBackend::processSignOn($errors, false)) {\n    // Users from the ticket access link\n    if ($user && $user instanceof TicketUser && $user->getTicketId())\n        Http::redirect('tickets.php?id='.$user->getTicketId());\n    // Users imported from an external auth backend\n    elseif ($user instanceof ClientCreateRequest) {\n        if ($cfg && $cfg->isClientRegistrationEnabled()) {\n            // Attempt to automatically register\n            if ($user->attemptAutoRegister())\n                Http::redirect('tickets.php');\n\n            // Unable to auto-register. Fill in what we have and let the\n            // user complete the info\n            $inc = 'register.inc.php';\n        }\n        else {\n            $errors['err'] = __('Access Denied. Contact your help desk administrator to have an account registered for you');\n            // fall through to show login page again\n        }\n    }\n    elseif ($user instanceof AuthenticatedUser) {\n        Http::redirect($_SESSION['_client']['auth']['dest']\n                ?: 'tickets.php');\n    }\n}\n\nif (!$nav) {\n    $nav = new UserNav();\n    $nav->setActiveNav('status');\n}\n\nrequire CLIENTINC_DIR.'header.inc.php';\nrequire CLIENTINC_DIR.$inc;\nrequire CLIENTINC_DIR.'footer.inc.php';\n?>\n"
        },
        {
          "name": "logo.php",
          "type": "blob",
          "size": 0.9033203125,
          "content": "<?php\n/*********************************************************************\n    logo.php\n\n    Simple logo to facilitate serving a customized client-side logo from\n    osTicet. The logo is configurable in Admin Panel -> Settings -> Pages\n\n    Peter Rotich <peter@osticket.com>\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\n// Use Noop Session Handler\ndefine('NOOP_SESSION', true);\nrequire('client.inc.php');\n$ttl = 86400; // max-age\nif (($logo = $ost->getConfig()->getClientLogo())) {\n    $logo->display(false, $ttl);\n}\n\nheader(\"Cache-Control: private, max-age=$ttl\");\nheader('Pragma: private');\nheader('Location: '.ASSETS_PATH.'images/logo.png');\n?>\n"
        },
        {
          "name": "logout.php",
          "type": "blob",
          "size": 0.71484375,
          "content": "<?php\n/*********************************************************************\n    logout.php\n\n    Destroy clients session.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\n\nrequire('client.inc.php');\n//Check token: Make sure the user actually clicked on the link to logout.\nif ($thisclient && $_GET['auth'] && $ost->validateLinkToken($_GET['auth']))\n   $thisclient->logOut();\n\nosTicketSession::destroyCookie();\nsession_destroy();\nHttp::redirect('index.php');\n?>\n"
        },
        {
          "name": "main.inc.php",
          "type": "blob",
          "size": 1.984375,
          "content": "<?php\n/*********************************************************************\nmain.inc.php\n\nMaster include file which must be included at the start of every file.\nThe brain of the whole sytem. Don't monkey with it.\n\nPeter Rotich <peter@osticket.com>\nCopyright (c)  2006-2013 osTicket\nhttp://www.osticket.com\n\nReleased under the GNU General Public License WITHOUT ANY WARRANTY.\nSee LICENSE.TXT for details.\n\nvim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\n\n#Disable direct access.\nif(isset($_SERVER['SCRIPT_NAME'])\n        && !strcasecmp(basename($_SERVER['SCRIPT_NAME']),basename(__FILE__)))\n    die('kwaheri rafiki!');\n\nrequire('bootstrap.php');\nBootstrap::loadConfig();\nBootstrap::defineTables(TABLE_PREFIX);\nBootstrap::i18n_prep();\nBootstrap::loadCode();\nBootstrap::connect();\n\n# Global Override when behind a proxy\n$_SERVER['REMOTE_ADDR'] = osTicket::get_client_ip();\n$_SERVER['SERVER_PORT'] = osTicket::get_client_port();\n\nif(!($ost=osTicket::start()) || !($cfg = $ost->getConfig()))\nBootstrap::croak(__('Unable to load config info from DB.').' '.__('Get technical help!'));\n\nif ($cfg && $cfg->forceHttps()\n        && !osTicket::is_cli()\n        && !osTicket::is_https()) {\n    if ($_SERVER['REQUEST_METHOD'] !== 'GET')\n        Http::response(400, 'HTTPS Protocol Required');\n\n    Http::redirect('https://'.$_SERVER['HTTP_HOST'].$_SERVER['REQUEST_URI']);\n}\n\n//Init\n$session = $ost->getSession();\n\n//System defaults we might want to make global//\n#pagenation default - user can override it!\ndefine('DEFAULT_PAGE_LIMIT', $cfg->getPageSize()?$cfg->getPageSize():25);\n\n#Cleanup magic quotes crap.\nif(function_exists('get_magic_quotes_gpc') && get_magic_quotes_gpc()) {\n$_POST=Format::strip_slashes($_POST);\n$_GET=Format::strip_slashes($_GET);\n$_REQUEST=Format::strip_slashes($_REQUEST);\n}\n\n// extract system messages\n$errors = array();\n$msg=$warn=$sysnotice='';\nif (isset($_SESSION['::sysmsgs'])) {\n    extract($_SESSION['::sysmsgs']);\n    unset($_SESSION['::sysmsgs']);\n}\n?>\n"
        },
        {
          "name": "manage.php",
          "type": "blob",
          "size": 2.283203125,
          "content": "#!/usr/bin/env php\n<?php\n/*********************************************************************\n    manage.php\n\n    CLI (command line interface) for osTicket management. Use\n\n    php manage.php --help\n\n    for detailed and updated getting started information.\n\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2015 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire_once 'bootstrap.php';\n\n// Make sure the script is executed via CLI\nif (!osTicket::is_cli())\n    die(\"Management only supported from command-line\\n\");\n\nrequire_once CLI_DIR . 'cli.inc.php';\nclass Manager extends Module {\n    var $prologue =\n        \"Manage one or more osTicket installations\";\n\n    var $arguments = array(\n        'action' => \"Action to be managed\"\n    );\n\n    var $usage = '$script action [options] [arguments]';\n\n    var $autohelp = false;\n\n    function showHelp() {\n        foreach (glob(CLI_DIR.'modules/*.php') as $script)\n            include_once $script;\n\n        global $registered_modules;\n        $this->epilog =\n            \"Currently available modules follow. Use 'manage.php <module>\n            --help' for usage regarding each respective module:\";\n\n        parent::showHelp();\n\n        echo \"\\n\";\n        ksort($registered_modules);\n        $width = max(array_map('strlen', array_keys($registered_modules)));\n        foreach ($registered_modules as $name=>$mod)\n            echo str_pad($name, $width + 2) . $mod->prologue . \"\\n\";\n    }\n\n    function run($args, $options) {\n        if ($options['help'] && !$args['action'])\n            $this->showHelp();\n\n        else {\n            $action = $args['action'];\n\n            global $argv;\n            foreach ($argv as $idx=>$val)\n                if ($val == $action)\n                    unset($argv[$idx]);\n\n            require_once CLI_DIR . \"modules/{$args['action']}.php\";\n            if (($module = Module::getInstance($action)))\n                return $module->_run($args['action']);\n\n            $this->stderr->write(\"Unknown action given\\n\");\n            $this->showHelp();\n        }\n    }\n}\n\n$manager = new Manager();\n$manager->_run(basename(__file__), false);\n"
        },
        {
          "name": "offline.php",
          "type": "blob",
          "size": 0.91796875,
          "content": "<?php\n/*********************************************************************\n    offline.php\n\n    Offline page...modify to fit your needs.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire_once('client.inc.php');\nif(is_object($ost) && $ost->isSystemOnline()) {\n    @header('Location: index.php'); //Redirect if the system is online.\n    include('index.php');\n    exit;\n}\n$nav=null;\nrequire(CLIENTINC_DIR.'header.inc.php');\n?>\n<div id=\"landing_page\">\n<?php\nif(($page=$cfg->getOfflinePage())) {\n    echo $page->getBodyWithImages();\n} else {\n    echo '<h1>'.__('Support Ticket System Offline').'</h1>';\n}\n?>\n</div>\n<?php require(CLIENTINC_DIR.'footer.inc.php'); ?>\n"
        },
        {
          "name": "open.php",
          "type": "blob",
          "size": 3.1005859375,
          "content": "<?php\n/*********************************************************************\n    open.php\n\n    New tickets handle.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nrequire('client.inc.php');\ndefine('SOURCE','Web'); //Ticket source.\n$ticket = null;\n$errors=array();\nif ($_POST) {\n    $vars = $_POST;\n    $vars['deptId']=$vars['emailId']=0; //Just Making sure we don't accept crap...only topicId is expected.\n    if ($thisclient) {\n        $vars['uid']=$thisclient->getId();\n    } elseif($cfg->isCaptchaEnabled()) {\n        if(!$_POST['captcha'])\n            $errors['captcha']=__('Enter text shown on the image');\n        elseif(strcmp($_SESSION['captcha'], md5(strtoupper($_POST['captcha']))))\n            $errors['captcha']=sprintf('%s - %s', __('Invalid'), __('Please try again!'));\n    }\n\n    $tform = TicketForm::objects()->one()->getForm($vars);\n    $messageField = $tform->getField('message');\n    $attachments = $messageField->getWidget()->getAttachments();\n    if (!$errors) {\n        $vars['message'] = $messageField->getClean();\n        if ($messageField->isAttachmentsEnabled())\n            $vars['files'] = $attachments->getFiles();\n    }\n\n    // Drop the draft.. If there are validation errors, the content\n    // submitted will be displayed back to the user\n    Draft::deleteForNamespace('ticket.client.'.substr(session_id(), -12));\n    //Ticket::create...checks for errors..\n    if(($ticket=Ticket::create($vars, $errors, SOURCE))){\n        $msg=__('Support ticket request created');\n        // Drop session-backed form data\n        unset($_SESSION[':form-data']);\n        //Logged in...simply view the newly created ticket.\n        if ($thisclient && $thisclient->isValid()) {\n            // Regenerate session id\n            $thisclient->regenerateSession();\n            @header('Location: tickets.php?id='.$ticket->getId());\n        } else\n            $ost->getCSRF()->rotate();\n    }else{\n        $errors['err'] = $errors['err'] ?: sprintf('%s %s',\n            __('Unable to create a ticket.'),\n            __('Correct any errors below and try again.'));\n    }\n}\n\n//page\n$nav->setActiveNav('new');\nif ($cfg->isClientLoginRequired()) {\n    if ($cfg->getClientRegistrationMode() == 'disabled') {\n        Http::redirect('view.php');\n    }\n    elseif (!$thisclient) {\n        require_once 'secure.inc.php';\n    }\n    elseif ($thisclient->isGuest()) {\n        require_once 'login.php';\n        exit();\n    }\n}\n\nrequire(CLIENTINC_DIR.'header.inc.php');\nif ($ticket\n    && (\n        (($topic = $ticket->getTopic()) && ($page = $topic->getPage()))\n        || ($page = $cfg->getThankYouPage())\n    )\n) {\n    // Thank the user and promise speedy resolution!\n    echo Format::viewableImages(\n        $ticket->replaceVars(\n            $page->getLocalBody()\n        ),\n        ['type' => 'P']\n    );\n}\nelse {\n    require(CLIENTINC_DIR.'open.inc.php');\n}\nrequire(CLIENTINC_DIR.'footer.inc.php');\n?>\n"
        },
        {
          "name": "pages",
          "type": "tree",
          "content": null
        },
        {
          "name": "profile.php",
          "type": "blob",
          "size": 1.1962890625,
          "content": "<?php\n/*********************************************************************\n    profile.php\n\n    Manage client profile. This will allow a logged-in user to manage\n    his/her own public (non-internal) information\n\n    Peter Rotich <peter@osticket.com>\n    Jared Hancock <jared@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n    $Id: $\n**********************************************************************/\nrequire 'secure.inc.php';\n\nrequire_once 'class.user.php';\n\n// Check if User is Guest. If so, redirect them back to ticket page to\n// prevent Account Takeover.\nif ($thisclient->isGuest())\n    Http::redirect('tickets.php');\n\n$user = User::lookup($thisclient->getId());\n\nif ($user && $_POST) {\n    $errors = array();\n    if ($acct = $thisclient->getAccount()) {\n       $acct->update($_POST, $errors);\n    }\n    if (!$errors && $user->updateInfo($_POST, $errors))\n        Http::redirect('tickets.php');\n}\n\n$inc = 'profile.inc.php';\n\ninclude(CLIENTINC_DIR.'header.inc.php');\ninclude(CLIENTINC_DIR.$inc);\ninclude(CLIENTINC_DIR.'footer.inc.php');\n\n"
        },
        {
          "name": "pwreset.php",
          "type": "blob",
          "size": 3.1650390625,
          "content": "<?php\n\nrequire_once('client.inc.php');\nif(!defined('INCLUDE_DIR')) die('Fatal Error');\ndefine('CLIENTINC_DIR',INCLUDE_DIR.'client/');\ndefine('OSTCLIENTINC',TRUE); //make includes happy\n\nrequire_once(INCLUDE_DIR.'class.client.php');\n\n$inc = 'pwreset.request.php';\nif($_POST) {\n    if (!$ost->checkCSRFToken()) {\n        Http::response(400, __('Valid CSRF Token Required'));\n        exit;\n    }\n    switch ($_POST['do']) {\n        case 'sendmail':\n            $userid = (string) $_POST['userid'];\n            if (Validator::is_userid($userid)\n                    && ($acct=ClientAccount::lookupByUsername($userid))) {\n                if (!$acct->isPasswdResetEnabled()) {\n                    $banner = __('Password reset is not enabled for your account. Contact your administrator');\n                }\n                elseif (!$acct->hasPassword()\n                        || (($bk=$acct->backend) && ($bk !== 'local')))\n                    $banner = __('Unable to reset password. Contact your administrator');\n                elseif ($acct->sendResetEmail()) {\n                    $inc = 'pwreset.sent.php';\n                }\n                else\n                    $banner = __('Unable to send reset email.')\n                        .' '.__('Internal error occurred');\n            }\n            else\n                $inc = 'pwreset.sent.php';\n\n            break;\n        case 'reset':\n            $inc = 'pwreset.login.php';\n            $errors = array();\n            if ($client = UserAuthenticationBackend::processSignOn($errors)) {\n                Http::redirect('index.php');\n            }\n            elseif (isset($errors['msg'])) {\n                $banner = $errors['msg'];\n            }\n            break;\n    }\n}\nelseif ($_GET['token']) {\n    $banner = __('Re-enter your username or email');\n    $inc = 'pwreset.login.php';\n    $_config = new Config('pwreset');\n    if (($id = $_config->get($_GET['token']))\n            && ($acct = ClientAccount::lookup(array('user_id'=>substr($id,1))))) {\n        if (!$acct->isConfirmed()) {\n            $inc = 'register.confirmed.inc.php';\n            $acct->confirm();\n            // FIXME: The account has to be uncached in order for the lookup\n            // in the ::processSignOn to detect the confirmation\n            ModelInstanceManager::uncache($acct);\n            // Log the user in\n            if ($client = UserAuthenticationBackend::processSignOn($errors)) {\n                if ($acct->hasPassword() && !$acct->get('backend')) {\n                    $acct->cancelResetTokens();\n                }\n                // No password setup yet -- force one to be created\n                else {\n                    $_SESSION['_client']['reset-token'] = $_GET['token'];\n                    $acct->forcePasswdReset();\n                }\n                Http::redirect('account.php?confirmed');\n            }\n        }\n    }\n    elseif ($id && ($user = User::lookup($id)))\n        $inc = 'pwreset.create.php';\n    else\n        Http::redirect('index.php');\n}\nelse {\n    $banner = __('Enter your username or email address below');\n}\n\n$nav = new UserNav();\n$nav->setActiveNav('status');\nrequire CLIENTINC_DIR.'header.inc.php';\nrequire CLIENTINC_DIR.$inc;\nrequire CLIENTINC_DIR.'footer.inc.php';\n?>\n"
        },
        {
          "name": "scp",
          "type": "tree",
          "content": null
        },
        {
          "name": "secure.inc.php",
          "type": "blob",
          "size": 1.1357421875,
          "content": "<?php\n/*********************************************************************\n    secure.inc.php\n\n    File included on every client's \"secure\" pages\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2013 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n**********************************************************************/\nif(!strcasecmp(basename($_SERVER['SCRIPT_NAME']),basename(__FILE__))) die('Kwaheri!');\nif(!file_exists('client.inc.php')) die('Fatal Error.');\nrequire_once('client.inc.php');\n\n//Client Login page: Ajax interface can pre-declare the function to trap logins.\nif(!function_exists('clientLoginPage')) {\n    function clientLoginPage($msg ='') {\n        global $ost, $cfg, $nav;\n        $_SESSION['_client']['auth']['dest'] =\n            '/' . ltrim($_SERVER['REQUEST_URI'], '/');\n        require('./login.php');\n        exit;\n    }\n}\n\n//User must be logged in!\nif(!$thisclient || !$thisclient->getId() || !$thisclient->isValid()){\n    clientLoginPage();\n    exit;\n}\n$thisclient->refreshSession();\n?>\n"
        },
        {
          "name": "setup",
          "type": "tree",
          "content": null
        },
        {
          "name": "tickets.php",
          "type": "blob",
          "size": 5.6572265625,
          "content": "<?php\r\n/*********************************************************************\r\n    tickets.php\r\n\r\n    Main client/user interface.\r\n    Note that we are using external ID. The real (local) ids are hidden from user.\r\n\r\n    Peter Rotich <peter@osticket.com>\r\n    Copyright (c)  2006-2013 osTicket\r\n    http://www.osticket.com\r\n\r\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\r\n    See LICENSE.TXT for details.\r\n\r\n    vim: expandtab sw=4 ts=4 sts=4:\r\n**********************************************************************/\r\nrequire('secure.inc.php');\r\nif(!is_object($thisclient) || !$thisclient->isValid()) die('Access denied'); //Double check again.\r\n\r\nif ($thisclient->isGuest())\r\n    $_REQUEST['id'] = $thisclient->getTicketId();\r\n\r\nrequire_once(INCLUDE_DIR.'class.ticket.php');\r\nrequire_once(INCLUDE_DIR.'class.json.php');\r\n$ticket=null;\r\nif($_REQUEST['id']) {\r\n    if (!($ticket = Ticket::lookup($_REQUEST['id']))) {\r\n        $errors['err']=__('Unknown or invalid ticket ID.');\r\n    } elseif(!$ticket->checkUserAccess($thisclient)) {\r\n        $errors['err']=__('Unknown or invalid ticket ID.'); //Using generic message on purpose!\r\n        $ticket=null;\r\n    }\r\n}\r\n\r\nif (!$ticket && $thisclient->isGuest())\r\n    Http::redirect('view.php');\r\n\r\n$tform = TicketForm::objects()->one()->getForm();\r\n$messageField = $tform->getField('message');\r\n$attachments = $messageField->getWidget()->getAttachments();\r\n\r\n//Process post...depends on $ticket object above.\r\nif ($_POST && is_object($ticket) && $ticket->getId()) {\r\n    $errors=array();\r\n    switch(strtolower($_POST['a'])){\r\n    case 'edit':\r\n        if(!$ticket->checkUserAccess($thisclient) //double check perm again!\r\n                || $thisclient->getId() != $ticket->getUserId())\r\n            $errors['err']=__('Access Denied. Possibly invalid ticket ID');\r\n        else {\r\n            $forms=DynamicFormEntry::forTicket($ticket->getId());\r\n            $changes = array();\r\n            foreach ($forms as $form) {\r\n                $form->filterFields(function($f) { return !$f->isStorable(); });\r\n                $form->setSource($_POST);\r\n                if (!$form->isValidForClient(true))\r\n                    $errors = array_merge($errors, $form->errors());\r\n            }\r\n        }\r\n        if (!$errors) {\r\n            foreach ($forms as $form) {\r\n                $changes += $form->getChanges();\r\n                $form->saveAnswers(function ($f) {\n                        return $f->isVisibleToUsers()\n                         && $f->isEditableToUsers(); });\n\n            }\r\n            if ($changes) {\r\n              $user = User::lookup($thisclient->getId());\r\n              $ticket->logEvent('edited', array('fields' => $changes), $user);\r\n            }\r\n            $_REQUEST['a'] = null; //Clear edit action - going back to view.\r\n        }\r\n        break;\r\n    case 'reply':\r\n        if(!$ticket->checkUserAccess($thisclient)) //double check perm again!\r\n            $errors['err']=__('Access Denied. Possibly invalid ticket ID');\r\n\r\n        $_POST['message'] = ThreadEntryBody::clean($_POST[$messageField->getFormName()]);\n        if (!$_POST['message'])\r\n            $errors['message'] = __('Message required');\r\n\r\n        if(!$errors) {\r\n            //Everything checked out...do the magic.\r\n            $vars = array(\r\n                    'userId' => $thisclient->getId(),\r\n                    'poster' => (string) $thisclient->getName(),\r\n                    'message' => $_POST['message']\r\n                    );\r\n            $vars['files'] = $attachments->getFiles();\r\n            if (isset($_POST['draft_id']))\r\n                $vars['draft_id'] = $_POST['draft_id'];\r\n\r\n            if(($msgid=$ticket->postMessage($vars, 'Web'))) {\r\n                $msg=__('Message Posted Successfully');\r\n                // Cleanup drafts for the ticket. If not closed, only clean\r\n                // for this staff. Else clean all drafts for the ticket.\r\n                Draft::deleteForNamespace('ticket.client.' . $ticket->getId());\r\n                // Drop attachments\r\n                $attachments->reset();\r\n                $attachments->getForm()->setSource(array());\r\n            } else {\r\n                $errors['err'] = sprintf('%s %s',\r\n                    __('Unable to post the message.'),\r\n                    __('Correct any errors below and try again.'));\r\n            }\r\n\r\n        } elseif(!$errors['err']) {\r\n            $errors['err'] = __('Correct any errors below and try again.');\r\n        }\r\n        break;\r\n    default:\r\n        $errors['err']=__('Unknown action');\r\n    }\r\n}\r\nelseif (is_object($ticket) && $ticket->getId()) {\r\n    switch(strtolower($_REQUEST['a'])) {\r\n    case 'print':\r\n        if (!$ticket || !$ticket->pdfExport($_REQUEST['psize']))\r\n            $errors['err'] = __('Unable to print to PDF.')\n                .' '.__('Internal error occurred');\n        break;\r\n    }\r\n}\r\n\r\n$nav->setActiveNav('tickets');\r\nif($ticket && $ticket->checkUserAccess($thisclient)) {\r\n    if (isset($_REQUEST['a']) && $_REQUEST['a'] == 'edit'\r\n            && $ticket->hasClientEditableFields()) {\r\n        $inc = 'edit.inc.php';\r\n        if (!$forms) $forms=DynamicFormEntry::forTicket($ticket->getId());\r\n        // Auto add new fields to the entries\r\n        foreach ($forms as $form) {\r\n            $form->filterFields(function($f) { return !$f->isStorable(); });\r\n            $form->addMissingFields();\r\n        }\r\n    }\r\n    else\r\n        $inc='view.inc.php';\r\n} elseif($thisclient->getNumTickets($thisclient->canSeeOrgTickets())) {\r\n    $inc='tickets.inc.php';\r\n} else {\r\n    $nav->setActiveNav('new');\r\n    $inc='open.inc.php';\r\n}\r\ninclude(CLIENTINC_DIR.'header.inc.php');\r\ninclude(CLIENTINC_DIR.$inc);\r\nprint $tform->getMedia();\r\ninclude(CLIENTINC_DIR.'footer.inc.php');\r\n?>\r\n"
        },
        {
          "name": "view.php",
          "type": "blob",
          "size": 1.6689453125,
          "content": "<?php\n/*********************************************************************\n    view.php\n\n    Ticket View.\n\n    Peter Rotich <peter@osticket.com>\n    Copyright (c)  2006-2010 osTicket\n    http://www.osticket.com\n\n    Released under the GNU General Public License WITHOUT ANY WARRANTY.\n    See LICENSE.TXT for details.\n\n    vim: expandtab sw=4 ts=4 sts=4:\n    $Id: $\n**********************************************************************/\nrequire_once('client.inc.php');\n\n$errors = array();\n// Check if the client is already signed in. Don't corrupt their session!\nif ($_GET['auth']\n        && $thisclient\n        && ($u = TicketUser::lookupByToken($_GET['auth']))\n        && ($u->getUserId() == $thisclient->getId())\n) {\n    // Switch auth keys ? (Otherwise the user can never use links for two\n    // different tickets)\n    if (($bk = $thisclient->getAuthBackend()) instanceof AuthTokenAuthentication) {\n        $bk->setAuthKey($u, $bk);\n    }\n    Http::redirect('tickets.php?id='.$u->getTicketId());\n}\n// Try autologin the user\n// Authenticated user can be of type ticket owner or collaborator\nelseif (isset($_GET['auth']) || isset($_GET['t'])) {\n    // TODO: Consider receiving an AccessDenied object\n    $user =  UserAuthenticationBackend::processSignOn($errors, false);\n}\n\nif (@$user && is_object($user) && $user->getTicketId())\n    Http::redirect('tickets.php?id='.$user->getTicketId());\nelseif ($thisclient && isset($_GET['id']) && is_numeric($_GET['t']))\n    Http::redirect('tickets.php?id='.$_GET['id']);\n\n$nav = new UserNav();\n$nav->setActiveNav('status');\n\n$inc = 'accesslink.inc.php';\nrequire CLIENTINC_DIR.'header.inc.php';\nrequire CLIENTINC_DIR.$inc;\nrequire CLIENTINC_DIR.'footer.inc.php';\n?>\n"
        },
        {
          "name": "web.config",
          "type": "blob",
          "size": 2.1455078125,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<configuration>\n\n    <system.webServer>\n        <directoryBrowse enabled=\"false\" />\n        <rewrite>\n            <rules>\n                <rule name=\"HTTP api\" stopProcessing=\"true\">\n                    <match url=\"^(.*/)?api/(.*)$\" ignoreCase=\"true\"/>\n                    <conditions>\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsFile\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsDirectory\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                    </conditions>\n                    <action type=\"Rewrite\" url=\"{R:1}api/http.php/{R:2}\"/>\n                </rule>\n                <rule name=\"Site pages\" stopProcessing=\"true\">\n                    <match url=\"^(.*/)?pages/(.*)$\" ignoreCase=\"true\"/>\n                    <conditions>\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsFile\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsDirectory\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                    </conditions>\n                    <action type=\"Rewrite\" url=\"{R:1}pages/index.php/{R:2}\"/>\n                </rule>\n                <rule name=\"Staff applications\" stopProcessing=\"true\">\n                    <match url=\"^(.*/)?scp/apps/(.*)$\" ignoreCase=\"true\"/>\n                    <conditions>\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsFile\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                        <add input=\"{REQUEST_FILENAME}\" matchType=\"IsDirectory\"\n                            ignoreCase=\"false\" negate=\"true\" />\n                    </conditions>\n                    <action type=\"Rewrite\" url=\"{R:1}scp/apps/dispatcher.php/{R:2}\"/>\n                </rule>\n            </rules>\n        </rewrite>\n        <defaultDocument>\n            <files>\n                <remove value=\"index.php\" />\n                <add value=\"index.php\" />\n            </files>\n        </defaultDocument>\n    </system.webServer>\n\n</configuration>\n"
        }
      ]
    }
  ]
}