{
  "metadata": {
    "timestamp": 1736712002112,
    "page": 498,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "FrozenNode/Laravel-Administrator",
      "stars": 1938,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0859375,
          "content": "/vendor\n/vendor_alt\ncomposer.phar\ncomposer.lock\n.DS_Store\n/nbproject/private/\nnbproject\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.1943359375,
          "content": "language: php\n\nphp:\n  - 5.4\n  - 5.5\n  - 5.6\n\nbranches:\n  except:\n    - 3.3.2\n    - v5\n\nbefore_script:\n  - curl -s http://getcomposer.org/installer | php\n  - php composer.phar install\n\nscript: phpunit"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.765625,
          "content": "# Contributing To Administrator\n\n> **NOTE**: Submit all pull requests to the `dev` branch!\n\n- [Introduction](#introduction)\n- [Bugs, Questions, and Feature Requests](#issues)\n- [Pull Requests](#pull-requests)\n- [Style Guide](#style-guide)\n- [CSS Build](#css-build)\n\n<a name=\"introduction\"></a>\n## Introduction\n\nAdministrator's source is hosted on [GitHub](https://github.com/FrozenNode/Laravel-Administrator). It's distributed under the MIT license, so you are free to fork it and do whatever you like with it. If you're doing something awesome with Administrator, we'd love to hear about it!\n\n<a name=\"issues\"></a>\n## Bugs, Questions, and Feature Requests\n\nIf you've found a bug with Administrator, if you have a question, or if you have a feature request, the best way to get our attention is to post an issue on the [GitHub issue tracker](https://github.com/FrozenNode/Laravel-Administrator/issues). A significant portion of Administrator's features have been developed because someone asked if it could be included. So don't be afraid to ask away!\n\n<a name=\"pull-requests\"></a>\n## Pull Requests\n\nWe love it when people submit pull requests. They don't always get merged into the core, but they almost always make us think about what is possible with Administrator and whether or not our current approach is adequate. If you'd like to submit a pull request, there are a few things that you should do in order to ensure a timely response:\n\n- Fork from the `dev` branch. Also submit your PR to the `dev` branch. PRs that are submitted to the `master` branch will be closed immediately.\n\n- Merge the latest changes from the `dev` branch before you submit the pull request. If you have a request that can't be automatically merged, you may be asked to marge the latest changes and resubmit it.\n\n- Add documentation for your changes to the relevant section in the `/docs` directory.\n\n- Add any necessary unit tests\n\n- Follow the [style guide](/docs/style-guide)!\n\n<a name=\"style-guide\"></a>\n## Style Guide\n\nPlease see the [style guide](/docs/style-guide) page for more information about the style guide.\n\n<a name=\"css-build\"></a>\n## CSS Build\n\nAdministrator currently uses [LESS](http://lesscss.org/) to build its CSS. In particular, it uses the [lessphp](https://github.com/leafo/lessphp) library. If put this in your composer.json:\n\n\t\"leafo/lessphp\": \"dev-master\"\n\nAnd then if you're building administrator from the workbench, you would run:\n\n\t$less = new lessc();\n\t$adminPath = base_path() . '/workbench/frozennode/administrator/public';\n\n\t//compile the less\n\t$compiled = $less->compileFile($adminPath . '/css/main.less');\n\tFile::put($adminPath . '/css/main.css', $compiled);\n\nIn the future, Administrator will move to [SASS](http://sass-lang.com/) and use [Grunt](http://gruntjs.com/) to automatically build both CSS and JS files."
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0673828125,
          "content": "MIT License\n\nCopyright (c) <2012> <Jan Hartigan> <jan@frozennode.com>\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of\nthe Software, and to permit persons to whom the Software is furnished to do so,\nsubject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR\nCOPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER\nIN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE."
        },
        {
          "name": "changelog.md",
          "type": "blob",
          "size": 21.029296875,
          "content": "## Changelog\n\n### 5.0.12\n- Bugfix: Added the table name to the constraint query\n- Bugfix: Russian translate in knockout.php\n- Bugfix: Update settings.php for `Request::url()` instead of using `url()`\n\n### 5.0.11\n- Bugfix: Had to make the middleware additon backwards compatable\n- Docs: Added doc updates\n\n### 5.0.10\n- Bugfix: L5.2 changed the way url() works so added url('/') instead\n- Added: Support for middleware additions to the Admin routes via the administrator config\n- Testfix: Fixed failing tests\n\n### 5.0.9\n- Bugfx: Fix for datetimepicker partially being covered by top menu  \n\n### 5.0.8\n- Bugfix: Rename Bool class to Boolean to fix PHP 7 \n- Bugfix: added missing custom attribute field\n\n### 5.0.7\n- Bugfix: Fixed boolean true bug \n- Bugfix: Fixes a bug where soft deletes are not being properly detected in L5\n\n### 5.0.6\n- Added: Support for custom domains in the admin routes\n- Added: Ability to access the model from withinthe column output renderer\n- Added: Dynamic Form Request Validation\n\n### 5.0.5\n- Added: Added password field to the settings view\n- Added: Romanian Language\n- Added: Basic HasMany Implementation along with re-ordering support\n- Bugfix: Autocomplete working with default value\n- Bugfix: Adding missing session to Admin Controller\n- Bugfix: Fixed improper handling of filter value 0 for Enum/Text field\n- Docfix: Simplified the composer command in the install docs to match the packagist.org instuctions\n- Docfix: Changed the type definition for global_rows_per_page to int instead of Null|nt since Null causes divide by 0 error\n\n### 5.0.4\n- Testfix: fixing tests and js for gulp\n\n### 5.0.3\n- Cherry Picking v4.16.7\n\n### 5.0.2\n- Cherry Picking v4.16.6\n\n### 5.0.1\n- Bugfix: Fixing csrf token mismatches for some requests\n\n### 5.0.0\n- Upgraded to Laravel 5\n- New translations (az)\n\n### 4.16.7\n- Bugfix: Taking out model level validation errors if model update fails sine it was ardent only\n\n### 4.16.6\n- Bugfix: Resetting a date/datime to null\n- Bugfix: Added model level validation errors if model update fails\n\n### 4.16.5\n- Bugfix: Another strange old bug where multiple search fields would do a where and instead of a where or\n\n### 4.16.4\n- Bugfix: Strange old bug when using only a setter field on a model\n\n### 4.16.3\n- Bugfix: Adding validateString back into Admin validator to avoid issues with old versions of Laravel\n\n### 4.16.2\n- Bugfix: New Illuminate validateString method did the same thing as the Administrator method of the same name\n\n### 4.16.1\n- Bugfix: Previous update broke temporary upload paths\n\n### 4.16.0\n- It's now possible to use the raw value of a file/image field to help with storing files on remote servers.\n\n### 4.15.0\n- New uneditable states for color, password, enum, and wysiwyg fields for when the editable option resolves to false\n- New translations (sk)\n- Bugfix: Editable fields are now also verified on the back end\n- Bugfix: Setting a string image length would fail uploads\n- Bugfix: Basic validation for relationship fields wasn't working\n- Bugfix: \"Characters left\" text was sitting unnecessarily outside the \"editable\" conditional\n- Bugfix: Some missing image-related translations\n- Bugfix: Editable option wasn't working for some fields\n\n### 4.14.2\n- Bugfix: Query clauses in the newQuery method for models was throwing errors if bindings were involved\n\n### 4.14.1\n- Bugfix: when validating all rules against all attributes for existing models, \"exists\" and \"unique\" rules would cause problems\n\n### 4.14.0\n- New translations (hr, nb)\n- Bugfix: The Spanish translation had an issue with noun genders\n- Bugfix: Visible option wasn't previously working with filters\n- Bugfix: The front-end form should now resize to its correct height at all times\n- Bugfix: If relationships defined an alternate primary key on the foreign table, Administrator would always just grab the model's primary key name\n\n### 4.13.0\n- Field descriptions can now be provided in addition to the labels\n- Bugfix: There were some styling issues due to applying styles at the body level\n- Bugfix: Dates in time fields before 1902 were previously not possible\n- Bugfix: MS opacity declaration was making it impossible to build the LESS\n- Bugfix: Hungarian and Serbian languages had some errors\n- Bugfix: It should now be possible to use custom validation rules and messages\n- Bugfix: Model validation would previously only check the dirty attributes of existing models. It now checks everything.\n- Bugfix: When setting the database.fetch config as PDO::FETCH_ASSOC, administrator would incorrectly try to access the count query results as an object\n\n### 4.12.1\n- Bugfix: Revert Merge #601 and adds back in select2 for filter booleans due to 3 needed options True, False, Both\n- Bugfix: Fix Js for non numeric ids\n\n### 4.12.0\n- Added CKEditor to composer to keep updated\n- Added Scrollable Data Table rather than dropping the columns\n- Added the use of checkboxes for boolean filters\n- Added the ability to create select2 translation files\n- Added Arabic Translation files\n- Added Bulgarian Translation files\n- Added Finnish Translation files\n- Added Turkish Translation files\n- Added Danish timepicker translation file\n- Bugfix: Fixed the routing order for File routes\n- BugFix: Fixed the German Translation file\n- Bugfix: Freeze actions while image uploading is in progress added to keep people from clicking off the page while image is uploading\n- Bugfix: Call resizePage() after getting ajax response to fix with the page sizing and not being able to see the full datatable\n- Bugfix: Replace isSoftDeleting with issset(...->runSoftDelete) for Laravel 4.2 support\n\n### 4.11.2\n- Bugfix: Strange legacy issue that was never caught with passing a no-op to array_get\n\n### 4.11.1\n- Bugfix: There was a routing issue with the new non-numeric model ids\n\n### 4.11.0\n- Model ids no longer have to be numeric\n- New translations (vi)\n\n### 4.10.0\n- It's now possible to customize the \"back to site\" link at the top right of admin pages\n- Closures can now be passed into the output option for columns\n- New translations (se, si, uk)\n- Bugfix: When navigating away from an item edit route and then hitting the back button, the browser would cache the dynamic json response. Proper headers have now been set to avoid this.\n- Bugfix: When missing a rules option in a settings config file, an error would be thrown despite there being no explicit requirement for one\n- Bugfix: The administrator base controller was being instantiated multiple times during unit tests in laravel 4.1\n\n### 4.9.0\n- Laravel 4.1 support\n- New translations (ja, pt)\n- Bugfix: There was a PSR-0 filename/classname disagreement in on of the relatively unused classes (Fields\\Relationships\\HasOne)\n\n### 4.8.0\n- Anonymous functions can now be passed for custom action title, confirmation, and messages options\n- It is now possible to return a redirect from custom actions\n- Selecting an item now scrolls the browser to the top of the page\n- It is now possible to return accessor values into the edit form\n- Default values can now be set for edit fields\n- Bugfix: Custom dashboards no longer include unnecessary js files\n- Bugfix: Updated to latest jQuery timepicker addon to fix some legacy jQuery UI bugs\n- Bugfix: The detach() method is now used to remove related items instead of delete()\n- Bugfix: The bool filter field wasn't properly grabbing results\n\n### 4.7.2\n- Bugfix: New Laravel setRules method in validator was throwing Administrator's setRules typehinting off\n- Bugfix: Redirection was always pointing at the admin dashboard instead of the current page\n\n### 4.7.1\n- Bugfix: IoC resolution of the 'session.store' instance was being called as 'session'\n\n### 4.7.0\n- Custom pages are now available with the 'page.{path}.{to}.{view}' menu syntax\n- New translations (ca)\n- Bugfix: Autocomplete relationship fields weren't respecting prefixed table names\n\n### 4.6.1\n- Bugfix: Call to App::make('itemconfig') in the header would cause an error on dashboard pages\n- Bugfix: Fonts are now loaded locally which should no longer cause hanging issues when you have no internet connection\n- Bugfix: <=IE9 was having issues with the dropdown menu\n\n### 4.6.0\n- Support for smaller screens and mobile devices\n- Visible option for columns that accepts either a boolean or closure\n- Relationship constraints now work with hasMany and hasOne fields\n- There is now an `options_filter` option for relationship fields that lets you modify the query before getting the relationship options\n- Custom actions and saves now rebuild the supplied config file after performing the action\n- The `editable` property now accepts a closure and is passed the current page's data object\n- New translations (da, it)\n- Bugfix: Constraint fields no longer make multiple requests at a single time\n- Bugfix: The key field is no longer set on models. This would cause some bugs on some setups\n\n### 4.5.0\n- You can now provide `value`, `min_value`, and `max_value` options in filter fields to set default values\n- It is now possible to specify as many submenus in the `menus` array as you want\n- The examples directory is now properly adjusted for L4\n- Bugfix: The CKEditor in WYSIWYG fields no longer jumps around and removes text selection on blur\n- Bugfix: Soft deleted values from a related table no longer get included in relationship columns\n- Bugfix: Relationship where clauses now work when you pre-specify the table name\n- Bugfix: Time fields weren't saving properly\n\n### 4.4.1\n- Bugfix: Removed reliance on MySQL-specific backticks in queries\n- Bugfix: New validateArray method in Laravel core Validator class was messing with custom version in Administrator's Validator\n- Bugfix: In relationship where clauses, there would be issues with values defined on the pivot table\n\n### 4.4.0\n- You can now provide custom actions to a \"global_actions\" option in model configs. These actions are passed the current filtered query object and can be used to perform table-wide actions.\n- There is now a query_filter option for model configs that lets you filter a model's results query before it's constructed\n- Relationship columns now respect WHERE filters in your Eloquent model\n- New translations (ru)\n- Bugfix: Enum fields were having issues on settings pages\n- Bugfix: Submenu titles weren't properly translating in the presence of multiple locales\n- Bugfix: BelongsToMany filters now work with table prefixes\n- Bugfix: Non-string name_fields and search_fields no longer break select2\n\n### 4.3.0\n- Unit testing\n- A fourth basic action permission is now available: 'view'. This dictates whether or not the admin user can click an item to open it\n- There is now an optional 'rules' property in model configuration files which works just like the $rules static property in Eloquent models\n- You can now define where the raw settings data is stored by providing a 'storage_path' option to settings configs\n- You can now supply a 'confirmation' string option to your custom actions which will require a confirmation from the admin user before the action can go through\n- The active item now updates itself when you perform a custom action or when you save an item\n- You can now specify an options_sort_field and an options_sort_direction for relationship fields that use accessors as name fields, and as such require ordering on something other than the name_field\n- 'logout_path' option is now available in the main config. By default this is false, but if you provide a string value it will show a logout button and link the user to that path if clicked\n- Bugfix: Tons of other bugs that I caught while creating the unit tests :D\n- Bugfix: The model results no longer require an ajax load on pageload\n- Bugfix: Table prefixes are now taken into consideration\n- Bugfix: Number fields would take two tries to clear\n- Bugfix: Saving empty number field would result in 0\n- Bugfix: Using an accessor for a name_field in a relationship field would previously cause SQL errors\n\n### 4.2.0\n- The action permissions are now passed the relevant model so you can determine which actions are available for certain items in your database\n- The 'visible' option for edit fields can now be passed a boolean or a callback that returns a boolean depending on the specific model being viewed\n- Password fields are now available in the edit fields array\n- Setter fields are now available in the edit fields array\n- Bugfix: Unsetting belongsTo relationships weren't nullifying the value in the database\n- Bugfix: Some missing language keys were causing translation bugs in some languages\n- Bugfix: CKEditor wasn't properly loading up data after it had been cleared\n\n### 4.1.0\n- If you select multiple BelongsToMany relationship filter options, the list will search for items that have all the selected relationships. Previously this was an OR\n- Bugfix: Formatted date filters were not being properly sent to SQL\n- Bugfix: Null values for unrequired relationships weren't resetting field\n- Bugfix: Stray old \"Admin\\\\Libraries\" sitting in the Column model was causing issues with relationship fields\n- Bugfix: Column objects weren't indexing properly when a column was simply a string value\n- Bugfix: BelongsTo edit fields weren't setting due to overwriting with an empty array\n- Bugfix: Custom actions in settings weren't working properly\n- Bugfix: relationship saving was causing overload issue in php 5.4\n\n### 4.0.1\n- Bugfix: \"languages\" array from L3 replaced by administrator config's \"locales\"\n- New language: Chinese (zh-CN)\n\n### 4.0.0\n- Updated to Laravel 4 / Composer\n\n### 3.3.2\n- Bugfix: Error with 3.3.1 bugfix\n\n### 3.3.1\n- Bugfix: HMABT column had a php5.3 error\n\n### 3.3.0\n- You can now define your custom action's permissions in the model config's action_permissions option\n- Returning Response or Redirect objects is now possible for admin and model configs\n- New language: Brazilian Portuguese (pt-BR)\n- Bugfix: Self-relationships weren't updating properly since the move to select2\n- Bugfix: Columns for HasMany, HasOne, and HMABT relationships now work\n\n\n### 3.2.0\n- Added support for a file field\n- You can now choose to provide a custom dashboard or a default home page from your menu\n- Settings pages are now available\n- It is now possible to set a sort_field on HMABT relationships for inline reordering of related values\n- You can now select nested belongs_to relationships in the columns array\n- Primary key fields are now hidden by default in the edit window unless you put them in your edit array\n- New languages: Spanish (es), Basque (eu), French (fr), Dutch (nl), Polish (pl), Serbian (sr)\n- Moved from Chosen select boxes to Select2\n- The item link now uses the single name of the model instead of \"item\"\n- Bugfix: Constraints on autocomplete fields now constrain the autocomplete search\n- Bugfix: Multiple constraints now work properly\n- Bugfix: Character limits on text fields no longer limit the string on every keystroke\n- Bugfix: Relationship options now sort by the name field\n- Bugfix: Getter columns now visibly show if they're being sorted\n- Bugfix: Fixed some issues with the page not resizing properly\n- Bugfix: WYSIWYG editor now resets properly after saving and then creating a new item\n\n### 3.1.0\n- Localization support. Big thanks to [Andrew Dworn](https://github.com/andrewdworn) for all the work he put into this\n- New editable option for most edit fields lets you disable field editing\n- Image field originals can now be stored in any location (not just the public directory)\n- Bugfix: If a relationship has no value for a field, the previously-selected item's relationships will be cleared out\n- Bugfix: Bool field now doesn't revert back to false on edit if checked\n- Bugfix: CKEditor no longer has funny cursor behavior when editing\n- Bugfix: BelongsTo edit fields now load even if they aren't specified in the columns list\n- Bugfix: HasOne and HasMany relationship columns weren't being constructed properly\n\n### 3.0.0\n- Model configuration must now be done in model config files instead of in an Eloquent model\n- Revamped the docs to make it more accessible/readable\n- You can now group together models into menu groups\n- New 'color' field type\n- New 'image' field type\n- Custom column outputs\n- Admin users can now set a custom number of rows in each model's interface\n- You can now add custom action buttons in the $actions property of a model\n- You can now apply per-model permissions for creating, saving, and deleting items\n- Renamed 'permission_check' and 'auth_check' to the uniform 'permission'\n- Renamed 'global_per_page' to 'global_rows_per_page'\n- The $edit property is now the 'edit_fields' option in the model config\n- The $filters property is now the 'filters' option in the model config\n- The $sortOptions property is now the 'sort' option in the model config\n- The $expand property is now the 'form_width' option in the model config\n- The create_link() method is now the 'link' option in the model config\n- Removed the before_delete() method. This can be handled by using the \"eloquent.delete: {{classname}}\" event\n- Migrated from the old string-based jQuery template engine to the faster, smarter Knockout comment bindings\n- Bugfix: BelongsTo filter no longer does a LIKE search (since it's an explicit key)\n\n### 2.3.0\n- Relationship constraints are now possible if you want to limit one relationship field's options by its relation to another relationship field (only applies when those two fields themselves have a pivot table)\n- You can now hit the enter key on text/textarea fields to submit the create/edit form\n- Self-relationships are now possible\n- Bugfix: Bool field now works properly with SQLite (or any database that returns ints as strings)\n- Bugfix: History.js now recognizes base URIs other than '/'\n- Bugfix: In PostgreSQL there was an issue with using boolean false to pull back no results on an integer column\n- Bugfix: If you are on some high page number and you filter the set such that that page number is now outside the range of the filtered set, you will be brought back to the last page of the set instead of staying on that page\n- Bugfix: Adding real-time viewModel updates to the wysiwyg field. Sometimes if you hit \"save\" fast enough it wouldn't write the changes back to the viewModel from the CKEditor\n- Bugfix: There was an array index error when not providing a name_field or when only providing one of the sort options\n\n### 2.2.0\n- There is now an autocomplete option for relationships that could have a lot of potential values\n- You can now set the $expand property for a model to boolean true or any integer above 285 (i.e. pixels) to get more room for the edit form\n- Model config now allows for a 'single' name. Example: Film model would be 'film'. BoxOffice model would be 'take'. i.e. New film, New take\n- New 'bool' field type\n- New 'enum' field type\n- New 'wysiwyg' field type\n- New 'textarea' field type\n- New 'markdown' field type\n- Added 'limit' option for text/textarea/markdown field types\n- Added 'height' option for textarea/markdown field types (pixels as an integer)\n- You can now provide a create_link method in your model that should return the URL of the string of the item's front-end page\n- You can now optionally provide a 'permission_check' closure for each model in the config. This works just like auth_check but on a per-model basis. If provided, and if it evaluates to false, the user will be redirected back to the admin dashboard.\n- Bugfix: Multiple commas in number fields were messing up the values\n- Bugfix: The custom binding for the number field now uses the user-supplied fields like decimals, thousands_separator, and decimal_separator.\n- Bugfix: Various animation bugs in the UI\n\n### 2.1.0\n- You can no longer use has_one or has_many fields in the $edit property. This is because those relationships require a new item to be created on the other table.\n- The number field now formats nicely in the interface\n- Added the first tutorial video to the README and added the code from that video to the examples/application directory\n- Bugfix: There was a case sensitivity issue with the libraries folder because of the namespaces I was using. Quickfixed this by changing libraries to Libraries.\n- Bugfix: Getting model rows was calling 'SELECT * FROM [whatever_relationship_table]' multiple times. This should alleviate some performance issues.\n\n### 2.0.1\n- Bugfix: related to grouping functions in the 'select' option\n- Bugfix: related to the model title showing up\n\n### 2.0.0\n- Reorganized the libraries\n- title_field is now name_field\n- relation is now relationship\n- currency is now number and non-currency number types are now supported\n- $edit and $filters arrays no longer have default values. You must supply them or they won't show up\n- $column now accepts a 'select' option for any field to allow for proper sorting\n- Temporarily found a work around for a major bug with Laravel paginate() method where it wouldn't properly count the rows when using a grouping (will be fixed in L4)\n- Innumerable bugfixes (with plenty more to come)\n\n### 1.2.0\n- Added all field types to filters\n- Currency (and soon all numbers), date, datetime, and time filters are now a min/max range\n- Assorted improvements to make it easier to add field types\n\n### 1.1.0\n- Sorting getter columns\n- Sorting relational columns with custom select statements\n- Fixed several bugs related to sorting\n- Fixed several bugs related to using getters as columns\n\n### 1.0.1\n- 'id' filter type now works\n- Getter values now show up in the result set\n\n### 1.0.0\n- Initial release.\n"
        },
        {
          "name": "composer.json",
          "type": "blob",
          "size": 1.01171875,
          "content": "{\n\t\"name\": \"frozennode/administrator\",\n\t\"description\": \"A database interface package for Laravel\",\n\t\"homepage\": \"http://administrator.frozennode.com\",\n\t\"keywords\": [\"administrator\", \"admin\", \"database\", \"laravel-administrator\", \"laravel\", \"cms\"],\n\t\"license\": \"MIT\",\n\t\"authors\": [\n\t\t{\n\t\t\t\"name\": \"Jan Hartigan\",\n\t\t\t\"email\": \"jan@frozennode.com\"\n\t\t}\n\t],\n\t\"support\": {\n\t\t\"issues\": \"https://github.com/FrozenNode/Laravel-Administrator/issues\"\n\t},\n\t\"require\": {\n\t\t\"php\": \">=5.4.0\",\n\t\t\"laravel/framework\": \"5.*\",\n\t\t\"ckeditor/ckeditor\": \"4.*\"\n\t},\n\t\"require-dev\": {\n\t\t\"mockery/mockery\": \"~0.9\"\n\t},\n\t\"autoload\": {\n\t\t\"classmap\": [\n\t\t\t\"src/controllers\"\n\t\t],\n\t\t\"psr-0\": {\n\t\t\t\"Frozennode\\\\Administrator\": \"src/\"\n\t\t}\n\t},\n\t\"scripts\": {\n\t\t\"post-update-cmd\": [\n\t\t\t\"if [ -d \\\"public/js/ckeditor/\\\" ] \\nthen \\nrm -R public/js/ckeditor/ \\nfi \",\n\t\t\t\"if [ -d \\\"vendor/ckeditor/ckeditor/\\\" ] \\nthen \\nmv vendor/ckeditor/ckeditor/ public/js/  \\nfi\",\n\t\t\t\"if [ -d \\\"vendor/ckeditor/\\\" ] \\nthen \\nrm -R vendor/ckeditor/ \\nfi\"\n\t\t]\n\t},\n\t\"minimum-stability\": \"dev\"\n}"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "phpunit.xml",
          "type": "blob",
          "size": 0.5546875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<phpunit backupGlobals=\"false\"\n         backupStaticAttributes=\"false\"\n         bootstrap=\"vendor/autoload.php\"\n         colors=\"true\"\n         convertErrorsToExceptions=\"true\"\n         convertNoticesToExceptions=\"true\"\n         convertWarningsToExceptions=\"true\"\n         processIsolation=\"false\"\n         stopOnFailure=\"true\"\n         syntaxCheck=\"false\"\n>\n    <testsuites>\n        <testsuite name=\"Package Test Suite\">\n            <directory suffix=\".php\">./tests/</directory>\n        </testsuite>\n    </testsuites>\n</phpunit>"
        },
        {
          "name": "public",
          "type": "tree",
          "content": null
        },
        {
          "name": "readme.md",
          "type": "blob",
          "size": 4.5302734375,
          "content": "# Laravel Administrator\n\n## Project Abandoned\nWARNING: This project is no longer being maintained.\n\nAdministrator is an administrative interface builder for [Laravel](http://laravel.com). With Administrator you can visually manage your Eloquent models and their relations, and also create stand-alone settings pages for storing site data and performing site tasks.\n\n- **Author:** Jan Hartigan\n- **Website:** [http://frozennode.com](http://administrator.frozennode.com/)\n- **Version:** 5.0.12\n\n[![Build Status](https://travis-ci.org/FrozenNode/Laravel-Administrator.png?branch=master)](https://travis-ci.org/FrozenNode/Laravel-Administrator)\n\n<img src=\"https://raw.github.com/FrozenNode/Laravel-Administrator/master/examples/images/overview.jpg\" />\n\n## Composer\n\nTo install Administrator as a Composer package to be used with Laravel 5, simply run:\n\n```sh\ncomposer require \"frozennode/administrator: 5.*\"\n```\n\nOnce it's installed, you can register the service provider in `config/app.php` in the `providers` array:\n\n```php\n'providers' => [\n\t'Frozennode\\Administrator\\AdministratorServiceProvider',\n]\n```\n\nThen publish Administrator's assets with `php artisan vendor:publish`. This will add the file `config/administrator.php`. This [config file](http://administrator.frozennode.com/docs/configuration) is the primary way you interact with Administrator. This command will also publish all of the assets, views, and translation files.\n\n### Laravel 4\n\nIf you want to use Administrator with Laravel 4, you need to resolve to Administrator 4:\n\n```json\n\"frozennode/administrator\": \"4.*\"\n```\n\nThen publish the config file with `php artisan config:publish frozennode/administrator`. This will add the file `app/config/packages/frozennode/administrator/administrator.php`.\n\nThen finally you need to publish the package's assets with the `php artisan asset:publish frozennode/administrator` command.\n\n### Laravel 3\n\nSince Administrator has switched over to Composer, you can no longer use `php artisan bundle:install administrator` or `php artisan bundle:upgrade administrator`. If you want to use Administrator with Laravel 3, you must switch to the [3.3.2 branch](https://github.com/FrozenNode/Laravel-Administrator/tree/3.3.2), download it, and add it in the `/bundles/administrator` directory and add this to your bundles.php file:\n\n```php\n'administrator' => array(\n\t'handles' => 'admin', //this determines what URI this bundle will use\n\t'auto' => true,\n),\n```\n\n## Documentation\n\nThe complete docs for Administrator can be found at http://administrator.frozennode.com. You can also find the docs in the `/src/docs` directory.\n\n\n## Copyright and License\nAdministrator was written by Jan Hartigan of Frozen Node for the Laravel framework.\nAdministrator is released under the MIT License. See the LICENSE file for details.\n\n\n## Recent Changelog\n\n### 5.0.12\n- Bugfix: Added the table name to the constraint query\n- Bugfix: Russian translate in knockout.php\n- Bugfix: Update settings.php for `Request::url()` instead of using `url()`\n\n### 5.0.11\n- Bugfix: Had to make the middleware additon backwards compatable\n- Docs: Added doc updates\n\n### 5.0.10\n- Bugfix: L5.2 changed the way url() works so added url('/') instead\n- Added: Support for middleware additions to the Admin routes via the administrator config\n- Testfix: Fixed failing tests\n\n### 5.0.9\n- Bugfix: Fix for datetimepicker partially being covered by top menu  \n\n### 5.0.8\n- Bugfix: Rename Bool class to Boolean to fix PHP 7 \n- Bugfix: added missing custom attribute field\n\n### 5.0.7\n- Bugfix: Fixed boolean true bug \n- Bugfix: Fixes a bug where soft deletes are not being properly detected in L5\n\n### 5.0.6\n- Added: Support for custom domains in the admin routes\n- Added: Ability to access the model from withinthe column output renderer\n- Added: Dynamic Form Request Validation\n\n### 5.0.5\n- Added: Added password field to the settings view\n- Added: Romanian Language\n- Added: Basic HasMany Implementation along with re-ordering support\n- Bugfix: Autocomplete working with default value\n- Bugfix: Adding missing session to Admin Controller\n- Bugfix: Fixed improper handling of filter value 0 for Enum/Text field\n- Docfix: Simplified the composer command in the install docs to match the packagist.org instuctions\n- Docfix: Changed the type definition for global_rows_per_page to int instead of Null|nt since Null causes divide by 0 error\n\n### 5.0.4\n- Testfix: fixing tests and js for gulp\n\n### 5.0.3\n- Cherry Picking v4.16.7\n\n### 5.0.2\n- Cherry Picking v4.16.6\n\n### 5.0.1\n- Bugfix: Fixing csrf token mismatches for some requests\n\n### 5.0.0\n- Upgraded to Laravel 5\n- New translations (az)\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}