{
  "metadata": {
    "timestamp": 1736568867783,
    "page": 66,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "sstephenson/bats",
      "stars": 7122,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0400390625,
          "content": "* text=auto\n*.sh eol=lf\nlibexec/* eol=lf\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.083984375,
          "content": "language: c\nscript: bin/bats --tap test\nnotifications:\n  email:\n    on_success: never\n"
        },
        {
          "name": "CONDUCT.md",
          "type": "blob",
          "size": 3.2216796875,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, gender identity and expression, level of experience,\nnationality, personal appearance, race, religion, or sexual identity and\norientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\nadvances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting one of the project maintainers listed below. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Project Maintainers\n\n* Sam Stephenson <<sstephenson@gmail.com>>\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at [http://contributor-covenant.org/version/1/4][version]\n\n[homepage]: http://contributor-covenant.org\n[version]: http://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.033203125,
          "content": "Copyright (c) 2014 Sam Stephenson\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\nLIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\nOF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\nWITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.4912109375,
          "content": "# Bats: Bash Automated Testing System\n\nBats is a [TAP](http://testanything.org)-compliant testing framework\nfor Bash. It provides a simple way to verify that the UNIX programs\nyou write behave as expected.\n\nA Bats test file is a Bash script with special syntax for defining\ntest cases. Under the hood, each test case is just a function with a\ndescription.\n\n```bash\n#!/usr/bin/env bats\n\n@test \"addition using bc\" {\n  result=\"$(echo 2+2 | bc)\"\n  [ \"$result\" -eq 4 ]\n}\n\n@test \"addition using dc\" {\n  result=\"$(echo 2 2+p | dc)\"\n  [ \"$result\" -eq 4 ]\n}\n```\n\nBats is most useful when testing software written in Bash, but you can\nuse it to test any UNIX program.\n\nTest cases consist of standard shell commands. Bats makes use of\nBash's `errexit` (`set -e`) option when running test cases. If every\ncommand in the test case exits with a `0` status code (success), the\ntest passes. In this way, each line is an assertion of truth.\n\n\n## Running tests\n\nTo run your tests, invoke the `bats` interpreter with a path to a test\nfile. The file's test cases are run sequentially and in isolation. If\nall the test cases pass, `bats` exits with a `0` status code. If there\nare any failures, `bats` exits with a `1` status code.\n\nWhen you run Bats from a terminal, you'll see output as each test is\nperformed, with a check-mark next to the test's name if it passes or\nan \"X\" if it fails.\n\n    $ bats addition.bats\n     ✓ addition using bc\n     ✓ addition using dc\n\n    2 tests, 0 failures\n\nIf Bats is not connected to a terminal—in other words, if you\nrun it from a continuous integration system, or redirect its output to\na file—the results are displayed in human-readable, machine-parsable\n[TAP format](http://testanything.org).\n\nYou can force TAP output from a terminal by invoking Bats with the\n`--tap` option.\n\n    $ bats --tap addition.bats\n    1..2\n    ok 1 addition using bc\n    ok 2 addition using dc\n\n### Test suites\n\nYou can invoke the `bats` interpreter with multiple test file\narguments, or with a path to a directory containing multiple `.bats`\nfiles. Bats will run each test file individually and aggregate the\nresults. If any test case fails, `bats` exits with a `1` status code.\n\n\n## Writing tests\n\nEach Bats test file is evaluated _n+1_ times, where _n_ is the number of\ntest cases in the file. The first run counts the number of test cases,\nthen iterates over the test cases and executes each one in its own\nprocess.\n\nFor more details about how Bats evaluates test files, see \n[Bats Evaluation Process](https://github.com/sstephenson/bats/wiki/Bats-Evaluation-Process)\non the wiki.\n\n### `run`: Test other commands\n\nMany Bats tests need to run a command and then make assertions about\nits exit status and output. Bats includes a `run` helper that invokes\nits arguments as a command, saves the exit status and output into\nspecial global variables, and then returns with a `0` status code so\nyou can continue to make assertions in your test case.\n\nFor example, let's say you're testing that the `foo` command, when\npassed a nonexistent filename, exits with a `1` status code and prints\nan error message.\n\n```bash\n@test \"invoking foo with a nonexistent file prints an error\" {\n  run foo nonexistent_filename\n  [ \"$status\" -eq 1 ]\n  [ \"$output\" = \"foo: no such file 'nonexistent_filename'\" ]\n}\n```\n\nThe `$status` variable contains the status code of the command, and\nthe `$output` variable contains the combined contents of the command's\nstandard output and standard error streams.\n\nA third special variable, the `$lines` array, is available for easily\naccessing individual lines of output. For example, if you want to test\nthat invoking `foo` without any arguments prints usage information on\nthe first line:\n\n```bash\n@test \"invoking foo without arguments prints usage\" {\n  run foo\n  [ \"$status\" -eq 1 ]\n  [ \"${lines[0]}\" = \"usage: foo <filename>\" ]\n}\n```\n\n### `load`: Share common code\n\nYou may want to share common code across multiple test files. Bats\nincludes a convenient `load` command for sourcing a Bash source file\nrelative to the location of the current test file. For example, if you\nhave a Bats test in `test/foo.bats`, the command\n\n```bash\nload test_helper\n```\n\nwill source the script `test/test_helper.bash` in your test file. This\ncan be useful for sharing functions to set up your environment or load\nfixtures.\n\n### `skip`: Easily skip tests\n\nTests can be skipped by using the `skip` command at the point in a\ntest you wish to skip.\n\n```bash\n@test \"A test I don't want to execute for now\" {\n  skip\n  run foo\n  [ \"$status\" -eq 0 ]\n}\n```\n\nOptionally, you may include a reason for skipping:\n\n```bash\n@test \"A test I don't want to execute for now\" {\n  skip \"This command will return zero soon, but not now\"\n  run foo\n  [ \"$status\" -eq 0 ]\n}\n```\n\nOr you can skip conditionally:\n\n```bash\n@test \"A test which should run\" {\n  if [ foo != bar ]; then\n    skip \"foo isn't bar\"\n  fi\n\n  run foo\n  [ \"$status\" -eq 0 ]\n}\n```\n\n### `setup` and `teardown`: Pre- and post-test hooks\n\nYou can define special `setup` and `teardown` functions, which run\nbefore and after each test case, respectively. Use these to load\nfixtures, set up your environment, and clean up when you're done.\n\n### Code outside of test cases\n\nYou can include code in your test file outside of `@test` functions.\nFor example, this may be useful if you want to check for dependencies\nand fail immediately if they're not present. However, any output that\nyou print in code outside of `@test`, `setup` or `teardown` functions\nmust be redirected to `stderr` (`>&2`). Otherwise, the output may\ncause Bats to fail by polluting the TAP stream on `stdout`.\n\n### Special variables\n\nThere are several global variables you can use to introspect on Bats\ntests:\n\n* `$BATS_TEST_FILENAME` is the fully expanded path to the Bats test\nfile.\n* `$BATS_TEST_DIRNAME` is the directory in which the Bats test file is\nlocated.\n* `$BATS_TEST_NAMES` is an array of function names for each test case.\n* `$BATS_TEST_NAME` is the name of the function containing the current\ntest case.\n* `$BATS_TEST_DESCRIPTION` is the description of the current test\ncase.\n* `$BATS_TEST_NUMBER` is the (1-based) index of the current test case\nin the test file.\n* `$BATS_TMPDIR` is the location to a directory that may be used to\nstore temporary files.\n\n\n## Installing Bats from source\n\nCheck out a copy of the Bats repository. Then, either add the Bats\n`bin` directory to your `$PATH`, or run the provided `install.sh`\ncommand with the location to the prefix in which you want to install\nBats. For example, to install Bats into `/usr/local`,\n\n    $ git clone https://github.com/sstephenson/bats.git\n    $ cd bats\n    $ ./install.sh /usr/local\n\nNote that you may need to run `install.sh` with `sudo` if you do not\nhave permission to write to the installation prefix.\n\n\n## Support\n\nThe Bats source code repository is [hosted on\nGitHub](https://github.com/sstephenson/bats). There you can file bugs\non the issue tracker or submit tested pull requests for review.\n\nFor real-world examples from open-source projects using Bats, see\n[Projects Using Bats](https://github.com/sstephenson/bats/wiki/Projects-Using-Bats)\non the wiki.\n\nTo learn how to set up your editor for Bats syntax highlighting, see\n[Syntax Highlighting](https://github.com/sstephenson/bats/wiki/Syntax-Highlighting)\non the wiki.\n\n\n## Version history\n\n*0.4.0* (August 13, 2014)\n\n* Improved the display of failing test cases. Bats now shows the\n  source code of failing test lines, along with full stack traces\n  including function names, filenames, and line numbers.\n* Improved the display of the pretty-printed test summary line to\n  include the number of skipped tests, if any.\n* Improved the speed of the preprocessor, dramatically shortening test\n  and suite startup times.\n* Added support for absolute pathnames to the `load` helper.\n* Added support for single-line `@test` definitions.\n* Added bats(1) and bats(7) manual pages.\n* Modified the `bats` command to default to TAP output when the `$CI`\n  variable is set, to better support environments such as Travis CI.\n\n*0.3.1* (October 28, 2013)\n\n* Fixed an incompatibility with the pretty formatter in certain\n  environments such as tmux.\n* Fixed a bug where the pretty formatter would crash if the first line\n  of a test file's output was invalid TAP.\n\n*0.3.0* (October 21, 2013)\n\n* Improved formatting for tests run from a terminal. Failing tests\n  are now colored in red, and the total number of failing tests is\n  displayed at the end of the test run. When Bats is not connected to\n  a terminal (e.g. in CI runs), or when invoked with the `--tap` flag,\n  output is displayed in standard TAP format.\n* Added the ability to skip tests using the `skip` command.\n* Added a message to failing test case output indicating the file and\n  line number of the statement that caused the test to fail.\n* Added \"ad-hoc\" test suite support. You can now invoke `bats` with\n  multiple filename or directory arguments to run all the specified\n  tests in aggregate.\n* Added support for test files with Windows line endings.\n* Fixed regular expression warnings from certain versions of Bash.\n* Fixed a bug running tests containing lines that begin with `-e`.\n\n*0.2.0* (November 16, 2012)\n\n* Added test suite support. The `bats` command accepts a directory\n  name containing multiple test files to be run in aggregate.\n* Added the ability to count the number of test cases in a file or\n  suite by passing the `-c` flag to `bats`.\n* Preprocessed sources are cached between test case runs in the same\n  file for better performance.\n\n*0.1.0* (December 30, 2011)\n\n* Initial public release.\n\n---\n\n© 2014 Sam Stephenson. Bats is released under an MIT-style license;\nsee `LICENSE` for details.\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "install.sh",
          "type": "blob",
          "size": 0.71484375,
          "content": "#!/usr/bin/env bash\nset -e\n\nresolve_link() {\n  $(type -p greadlink readlink | head -1) \"$1\"\n}\n\nabs_dirname() {\n  local cwd=\"$(pwd)\"\n  local path=\"$1\"\n\n  while [ -n \"$path\" ]; do\n    cd \"${path%/*}\"\n    local name=\"${path##*/}\"\n    path=\"$(resolve_link \"$name\" || true)\"\n  done\n\n  pwd\n  cd \"$cwd\"\n}\n\nPREFIX=\"$1\"\nif [ -z \"$1\" ]; then\n  { echo \"usage: $0 <prefix>\"\n    echo \"  e.g. $0 /usr/local\"\n  } >&2\n  exit 1\nfi\n\nBATS_ROOT=\"$(abs_dirname \"$0\")\"\nmkdir -p \"$PREFIX\"/{bin,libexec,share/man/man{1,7}}\ncp -R \"$BATS_ROOT\"/bin/* \"$PREFIX\"/bin\ncp -R \"$BATS_ROOT\"/libexec/* \"$PREFIX\"/libexec\ncp \"$BATS_ROOT\"/man/bats.1 \"$PREFIX\"/share/man/man1\ncp \"$BATS_ROOT\"/man/bats.7 \"$PREFIX\"/share/man/man7\n\necho \"Installed Bats to $PREFIX/bin/bats\"\n"
        },
        {
          "name": "libexec",
          "type": "tree",
          "content": null
        },
        {
          "name": "man",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.2978515625,
          "content": "{\n  \"name\": \"bats\",\n  \"version\": \"v0.4.0\",\n  \"description\": \"Bash Automated Testing System\",\n  \"install\": \"./install.sh ${PREFIX:-/usr/local}\",\n  \"scripts\": [ \"libexec/bats\", \"libexec/bats-exec-suite\", \"libexec/bats-exec-test\", \"libexec/bats-format-tap-stream\", \"libexec/bats-preprocess\", \"bin/bats\" ]\n}\n\n"
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}