{
  "metadata": {
    "timestamp": 1736568879278,
    "page": 80,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "oracle/docker-images",
      "stars": 6633,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.04296875,
          "content": "*.sh eol=lf\n*.conf eol=lf\nChecksum.* eol=lf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.072265625,
          "content": "**/*.rpm\n**/*.jar\n**/*.zip\n**/*.tar.gz\n**/*.bin\n.idea/\n.DS_Store\n.vscode/\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "Archive",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODEOWNERS",
          "type": "blob",
          "size": 1.3017578125,
          "content": "# The last matching pattern has the most precedence, so the file goes from least\n# specific to most specific file path to assign code ownership.\n#\n*                          @Djelibeybi @gvenzl @mriccell @rjeberhard\n/.github/                  @Djelibeybi\n/.github/workflows         @Djelibeybi @AmedeeBulle\n/GraalVM/                  @mzachh\n/NoSQL/                    @dario-vega @mikebrey\n/OracleAccessManagement/   @manjunathdhegde-2910\n/OracleBI/                 @sjvp\n/OracleCoherence/          @thegridman\n/OracleDatabase/           @gvenzl\n/OracleDatabase/RAC/       @psaini79\n/OracleFMWInfrastructure/  @mriccell\n/OracleGoldenGate/         @sbalousek\n/OracleHTTPServer/         @Prabhat-Kishore\n/OracleIdentityGovernance/ @rishiagarwal-oracle\n/OracleInstantClient/      @cjbj\n/OracleInternetDirectory/  @manjunathdhegde-2910 @kuldeepbshah\n/OracleJava/               @aureliogrb\n/OracleLinuxDevelopers/    @Djelibeybi @AmedeeBulle\n/OracleRestDataServices/   @gvenzl\n/OracleSOASuite/           @knvijay @rdas0405\n/OracleUnifiedDirectory/   @kuldeepbshah\n/OracleUnifiedDirectorySM/ @kuldeepbshah\n/OracleVeridata/           @arnabnandioracle\n/OracleWebCenterContent/   @deboghos @pjadam\n/OracleWebCenterPortal/    @dgothe\n/OracleWebLogic/           @mriccell\n/OracleManagementAgent/    @drupanchal @ChaitanyaKulkarni28 @niravg75\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.2802734375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at opensource_ww_grp@oracle.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 10.8876953125,
          "content": "# Contribution guidelines\n\n<!-- markdownlint-disable MD036 -->\n*Last updated: March 2023*\n\nOracle welcomes contributions to this repository from anyone.\n\nIf you want to submit a pull request to fix a bug or enhance an existing\n`Dockerfile`, please open an issue first and link to that issue when you\nsubmit your pull request.\n\nIf you have any questions about a possible submission, we encourage you to start\na discussion about the contribution to get feedback from other users.\n\n## Contributing code\n\nAll contributors are expected to adhere to our [code of conduct](CODE_OF_CONDUCT.md).\n\nExternal contributions are only accepted from contributors who have signed the\n[the Oracle Contributor Agreement](https://oca.opensource.oracle.com/) (OCA).\nThe [OCA Bot](https://github.com/apps/oracle-contributor-agreement) automatically\nchecks every pull request and will provide a link for you to follow to sign\nthe agreement if it can't find one for you.\n\n## Oracle product ownership and responsibility\n\nFor any new product content, *you must obtain internal Oracle approvals for the\ndistribution of this content prior to submitting a pull request*. If you are\nunfamiliar with the approval process to submit code to an existing GitHub\nrepository, please contact the [Oracle Open Source team](mailto:opensource_ww_grp@oracle.com)\nfor details.\n\nThe GitHub user who submits the initial pull request to add a new product image\nshould add themselves to the [code owner](./CODEOWNERS) file in that same\nrequest. This will flag the user as the owner of the content and any future pull\nrequests that affect the content will need to be approved by this user.\n\nThe code owner will also be assigned to any issues relating to their content.\n\nYou must ensure that you check the [issues](https://github.com/oracle/docker-images/issues)\non at least a weekly basis, though daily is preferred.\n\nIf you wish to nominate additional or alternative users, they must be a visible\nmember of the [Oracle GitHub Organisation](https://github.com/orgs/oracle/people/).\n\nContact [Avi Miller](https://github.com/Djelibeybi) for more information.\n\n## Opening issues\n\nFor bugs or enhancement requests, please file a GitHub issue unless it's\nsecurity related. When filing a bug remember that the better written the bug is,\nthe more likely it is to be fixed. If you think you've found a security\nvulnerability, do not raise a GitHub issue and follow the instructions in our\n[security policy](./SECURITY.md).\n\n## Pull request process\n\n1. Fork this repository\n1. Create a branch in your fork to implement the changes. We recommend using\nthe issue number as part of your branch name, e.g. `1234-fixes`\n1. Ensure that any documentation is updated with the changes that are required\nby your fix.\n1. Ensure that any samples are updated if the base image has been changed.\n1. Submit a pull request. *Do not leave the pull request blank*. Explain exactly\nwhat your changes are meant to do and provide simple steps on how to validate\nyour changes. Ensure that you reference the issue you created as well.\nWe will assign the pull request to 2-3 people for review before it is merged.\n\n## Guidelines for contributions\n\nAll contributions must meet the following quality and style guidelines, regardless of whether\nthey are made by an Oracle employee or not.\n\nOracle employees must ensure their membership of the Oracle GitHub Organization\nand their Oracle email address are publicly visible on their profile. This will\nallow the OCA Bot to properly identify you.\n\n### Code and documentation quality and style requirements\n\nAll pull requests are checked by the following linters to ensure your contribution\nmeets the default quality, style and formatting guidelines of each language:\n\n| Language     | Linter                                           |\n| ------------ | ------------------------------------------------ |\n| Dockerfiles | [hadolint](https://github.com/hadolint/hadolint) |\n| GitHub Actions | [actionlint](https://github.com/rhysd/actionlint) |\n| Markdown files | [markdownlint](https://github.com/igorshubovych/markdownlint-cli)\n| Shell scripts | [ShellCheck](https://github.com/koalaman/shellcheck) / [shfmt](https://github.com/mvdan/sh)\n\nYou can use the provided [`lint`](./scripts/lint) script to run the linters\nlocally before submitting a pull request. The script will scan all files from\nthe current directory and below, so `cd` to a subdirectory before running the\nscript to only scan a subset of files.\n\n### Base image rules\n\n1. Extend an existing product image wherever possible. For example, if your\n   product requires WebLogic, then extend the WebLogic image instead of creating\n   your own WebLogic installation.\n1. If you can't extend an existing product image, your image must use either the\n   `oraclelinux:8` (preferred) or `oraclelinux:8-slim` base image as these images are\n   specifically designed to be the smallest possible install size. Both images are\n   also updated whenever a security-related errata is published.\n1. No new product images based on `oraclelinux:7` or `oraclelinux:7-slim` will be\n   accepted.\n1. Re-use existing scripts wherever possible. If a particular base image or\n   script doesn't have the functionality you need, open an issue and work with\n   the image owner to implement it.\n1. Specify only the major version of the base in the `FROM` directive, i.e. use\n   `FROM oraclelinux:8` or `FROM java/serverjre:8`.\n1. All images must provide a `CMD` or `ENTRYPOINT`. If your image is designed\n   to be extended, then this should output documentation on how to extend the\n   image to be useful.\n1. Use `LABEL` instructions for additional information such as ports and volumes.\n   The following are common label instructions that should be present in all\n   images where applicable:\n\nAdditional product-specific labels are listed below:\n\n| Label   | Value | Applicability |\n| -------- | ----- | ------------- |\n| `provider` | `Oracle` | All images |\n| `issues` | `https://github.com/oracle/docker-images/issues` | All images |\n| `maintainer` | Name of the maintainer | At the discretion of the author. |\n| `volume[.purpose]` | See below | Mandatory for any image with persistent storage\n| `port[.purpose]` | See below | Mandatory for all images with port mappings |\n\n### Volume labels\n\nUse `volume` labels to describe the purpose of each volume available to\ncontainers that are created using your image.\n\nIf your image provides multiple volumes, use qualified names to specify the\npurpose of each volume, e.g. `volume.data` would be for data created by the\ncontainer while `volume.setup.scripts` would be the location of scripts used\nby the container during its setup process.\n\nUse hierarchical nesting for multiple volumes of the same type, for example:\n\n* `volume.data.dir1`\n* `volume.data.dir2`\n\n### Port labels\n\nUse `port` labels to describe the required port mappings needed when running\na container based on your image.\n\nIf your images uses multiple ports, use qualified names to specify the purpose of\neach port, e.g. `port.http` to specify the HTTP port on which your application is\nreachable.\n\n Use hierarchical nesting for multiple ports of the same type:\n\n* `port.app.http`\n* `port.app.https`\n\nThe Oracle Database XE image provides a good example of how to specify labels\neffectively:\n\n```dockerfile\nLABEL \"provider\"=\"Oracle\"                                   \\\n      \"issues\"=\"https://github.com/oracle/docker-images/issues\"         \\\n      \"volume.data\"=\"/opt/oracle/oradata\"                               \\\n      \"volume.setup.location1\"=\"/opt/oracle/scripts/setup\"              \\\n      \"volume.setup.location2\"=\"/docker-entrypoint-initdb.d/setup\"      \\\n      \"volume.startup.location1\"=\"/opt/oracle/scripts/startup\"          \\\n      \"volume.startup.location2\"=\"/docker-entrypoint-initdb.d/startup\"  \\\n      \"port.listener\"=\"1521\"                                            \\\n      \"port.oemexpress\"=\"5500\"                                          \\\n      \"port.apex\"=\"8080\"\n```\n\n### Security-related rules\n\n1. **No hard-coded passwords.** If passwords are required, generate them\n   on container startup using `openssl rand` or accept a password argument during\n   container startup (via `-e`).\n1. **No world-writeable directories or files.** Limit read and write to file\n   owners if possible, or groups at most. Do not allow anyone to write to files.\n1. Do not require the use of the `--privileged` flag when running a container.\n1. Do not run an SSH daemon (`sshd`) inside a container.\n1. Do not use host networking mode (`--net=host`) for a container.\n\n### Documentation rules\n\n1. No Oracle host or domain names should be included in any code or examples.\n   If an example domain name is required, use `example.com`.\n1. All documentation including `README.md` files must meet Oracle\n   documentation standards. For content submitted by internal Oracle teams,\n   it is recommended that your documentation team either write or at least\n   review this content. Externally submitted documentation will be reviewed\n   during the PR process.\n1. Docker and Podman are product names and trademarks and should only be used\n   when referring to those products specifically and both should be capitalised,\n   except when used in monospaced formatted command-line examples.\n1. All build or usage examples should be based on [Podman](https://docs.oracle.com/en/operating-systems/oracle-linux/podman/)\n   running on Oracle Linux 8 or Oracle Linux 9.\n\n### Guidelines and recommendations\n\nThe following are some guidelines that will not prevent an image from being\nmerged, but are generally frowned upon if breached.\n\n* Always aim to produce the smallest possible image. This means using multi-stage\n  builds with a final stage using the least amount of layers possible. Combine\n  as much as possible within a single directive and be sure to remove any\n  cache created by `dnf` or `yum` or other tools.\n* Don't install all possible required RPMs, even if the product\n  documentation says so. Some RPMs aren't applicable inside a container, e.g\n  filesystem utilities (`btrfs-progs`, `ocfs2-tools`, `nfs-utils`).\n* Don't install any interactive/user tools, e.g. things like `vim`, `less` or\n  `man`. Debugging should be done prior to the image submission.\n* Don't install `wget` as the base images already include `curl`.\n* Always remember to run `rm -rf /var/cache/yum` or `dnf clean all` in the same\n  `RUN` directive as any `yum` or `dnf` command so that the metadata is not\n  stored in the layer.\n* Always document any inputs (via `--build-arg` or `-e`) required by\n  `docker build` or `docker run`. This documentation should also clearly state\n  any defaults that are used if no input is provided.\n* If a custom value must be provided by the end-user, the build or run should\n  gracefully fail if that value is not provided.\n\n## Code of conduct\n\nFollow the [Golden Rule](https://en.wikipedia.org/wiki/Golden_Rule). If you'd\nlike more specific guidelines, see the [Contributor Covenant Code of Conduct][COC].\n\n[COC]: https://www.contributor-covenant.org/version/1/4/code-of-conduct/\n\nCopyright (c) 2017, 2023 Oracle and/or its affiliates.\n"
        },
        {
          "name": "Contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "GraalVM",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 1.8017578125,
          "content": "Copyright (c) 2019, 2023 Oracle and/or its affiliates.\n\nThe Universal Permissive License (UPL), Version 1.0\n\nSubject to the condition set forth below, permission is hereby granted to any\nperson obtaining a copy of this software, associated documentation and/or data\n(collectively the \"Software\"), free of charge and under any and all copyright\nrights in the Software, and any and all patent rights owned or freely\nlicensable by each licensor hereunder covering either (i) the unmodified\nSoftware as contributed to or provided by such licensor, or (ii) the Larger\nWorks (as defined below), to deal in both\n\n(a) the Software, and\n(b) any piece of software and/or hardware listed in the lrgrwrks.txt file if\none is included with the Software (each a \"Larger Work\" to which the Software\nis contributed by such licensors),\n\nwithout restriction, including without limitation the rights to copy, create\nderivative works of, display, perform, and distribute the Software and make,\nuse, sell, offer for sale, import, export, have made, and have sold the\nSoftware and the Larger Work(s), and to sublicense the foregoing rights on\neither these or other terms.\n\nThis license is subject to the following condition:\nThe above copyright notice and either this complete permission notice or at\na minimum a reference to the UPL must be included in all copies or\nsubstantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "NoSQL",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleAccessManagement",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleAnalytics",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleBI",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleCloudInfrastructure",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleCoherence",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleDatabase",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleEssbase",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleFMWInfrastructure",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleGoldenGate",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleHTTPServer",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleIdentityGovernance",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleInstantClient",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleJava",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleLinuxDevelopers",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleManagementAgent",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleOpenJDK",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleRestDataServices",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleSOASuite",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleTuxedo",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleUnifiedDirectory",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleUnifiedDirectorySM",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleVeridata",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleWebCenterContent",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleWebCenterPortal",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleWebCenterSites",
          "type": "tree",
          "content": null
        },
        {
          "name": "OracleWebLogic",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.501953125,
          "content": "# Docker Images from Oracle\n\nThis repository contains [Dockerfiles](https://docs.docker.com/engine/reference/builder/)\nand samples to build [Docker](https://www.docker.com/what-docker) images for\nOracle commercial products and [Oracle sponsored open source projects](https://opensource.oracle.com).\n\n## Container Images on GitHub\n\nThese images will require you to download any required Oracle commercial\nsoftware before installation. If you want commercial software downloaded for you,\n view [Pre-Built Images with Commercial Software](#pre-built-images-with-commercial-software).\n\n### Oracle Commercial Products\n\n- [Oracle Access Management](/OracleAccessManagement)\n- [Oracle BI](/OracleBI)\n- [Oracle Cloud Infrastructure Tools](/OracleCloudInfrastructure)\n- [Oracle Coherence](/OracleCoherence)\n- [Oracle Database](/OracleDatabase)\n- [Oracle Essbase](/OracleEssbase)\n- [Oracle FMW Infrastructure](/OracleFMWInfrastructure)\n- [Oracle GoldenGate](/OracleGoldenGate)\n- [Oracle HTTP Server](/OracleHTTPServer)\n- [Oracle Identity Governance](/OracleIdentityGovernance)\n- [Oracle Instant Client](/OracleInstantClient) (Basic, SDK and SQL*Plus)\n- [Oracle Java](/OracleJava)\n- [Oracle Rest Data Services](OracleRestDataServices) (ORDS)\n- [Oracle SOA Suite](/OracleSOASuite)\n- [Oracle Tuxedo](/OracleTuxedo)\n- [Oracle Unified Directory](/OracleUnifiedDirectory)\n- [Oracle Unified Directory Service Manager](/OracleUnifiedDirectorySM)\n- [Oracle WebLogic Server](/OracleWebLogic)\n- [Oracle WebCenter Content](/OracleWebCenterContent)\n- [Oracle WebCenter Portal](/OracleWebCenterPortal)\n- [Oracle WebCenter Sites](/OracleWebCenterSites)\n\n### Oracle Sponsored Open Source Projects\n\n- [GraalVM CE](https://github.com/graalvm/container/tree/master/community)\n- [MySQL](https://github.com/mysql/mysql-docker)\n- [Oracle OpenJDK](/OracleOpenJDK)\n- [Oracle NoSQL Database](/NoSQL)\n- [Oracle Linux](https://github.com/oracle/container-images)\n\n### Community Contributions\n\n- [Oracle Forms and Reports](https://github.com/oracle/docker-images/issues/212)\n- [Oracle Unified Directory](Contrib/OracleUnifiedDirectory/)\n\n### Archived Projects\n\n- [ContainerCloud](/Archive/ContainerCloud)\n- [Oracle Data Integrator](/Archive/OracleDataIntegrator)\n- [Oracle Enterprise Data Quality](/Archive/OracleEDQ)\n- [Oracle TSAM Plus](/Archive/OracleTuxedo/tsam)\n\n## Pre-Built Images with Commercial Software\n\nThese sources already contain Oracle commercial software and require license\nacceptance prior to download:\n\n- [Oracle Container Registry](https://container-registry.oracle.com)\n\n## Support\n\nFor support and certification information, please consult the documentation\nfor each product.\n\nFor support, bug reporting and feedback about the provided Dockerfiles, please\nopen an [issue on GitHub](https://github.com/oracle/docker-images/issues).\n\nIf you need general support with running containers on Oracle Linux, you can submit\na question under the [Containers and Orchestration](https://community.oracle.com/tech/apps-infra/categories/containers-and-orchestration)\ncategory of the Applications and Infrastructure Community of Oracle Communities.\n\n## Contributing\n\nThis project welcomes contributions from the community. Before submitting a pull request, please [review our contribution guide](./CONTRIBUTING.md)\n\n## Security\n\nPlease consult the [security guide](./SECURITY.md) for our responsible security vulnerability disclosure process\n\n## License\n\nCopyright (c) 2019, 2023 Oracle and/or its affiliates.\n\nReleased under the Universal Permissive License v1.0 as shown at\n<https://oss.oracle.com/licenses/upl/>.\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.7666015625,
          "content": "# Reporting security vulnerabilities\n\nOracle values the independent security research community and believes that\nresponsible disclosure of security vulnerabilities helps us ensure the security\nand privacy of all our users.\n\nPlease do NOT raise a GitHub Issue to report a security vulnerability. If you\nbelieve you have found a security vulnerability, please submit a report to\n[secalert_us@oracle.com][1] preferably with a proof of concept. Please review\nsome additional information on [how to report security vulnerabilities to Oracle][2].\nWe encourage people who contact Oracle Security to use email encryption using\n[our encryption key][3].\n\nWe ask that you do not use other channels or contact the project maintainers\ndirectly.\n\nNon-vulnerability related security issues including ideas for new or improved\nsecurity features are welcome on GitHub Issues.\n\n## Security updates, alerts and bulletins\n\nSecurity updates will be released on a regular cadence. Many of our projects\nwill typically release security fixes in conjunction with the\n[Oracle Critical Patch Update][4] program. Additional\ninformation, including past advisories, is available on our [security alerts][5]\npage.\n\n## Security-related information\n\nWe will provide security related information such as a threat model, considerations\nfor secure use, or any known security issues in our documentation. Please note\nthat labs and sample code are intended to demonstrate a concept and may not be\nsufficiently hardened for production use.\n\n[1]: mailto:secalert_us@oracle.com\n[2]: https://www.oracle.com/corporate/security-practices/assurance/vulnerability/reporting.html\n[3]: https://www.oracle.com/security-alerts/encryptionkey.html\n[4]: https://www.oracle.com/security-alerts/#CriticalPatchUpdates\n[5]: https://www.oracle.com/security-alerts/\n\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}