{
  "metadata": {
    "timestamp": 1736566748201,
    "page": 300,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "google/codesearch",
      "stars": 3703,
      "defaultBranch": "master",
      "files": [
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.142578125,
          "content": "# This source code is copyright \"The Go Authors\",\n# as defined by the AUTHORS file in the root of the Go tree.\n#\n# http://tip.golang.org/AUTHORS.\n"
        },
        {
          "name": "CONTRIBUTORS",
          "type": "blob",
          "size": 0.20703125,
          "content": "# The official list of people who can contribute code to the repository\n# is maintained in the standard Go repository as the CONTRIBUTORS\n# file in the root of the Go tree.\n#\n# http://tip.golang.org/CONTRIBUTORS\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.4443359375,
          "content": "Copyright (c) 2011 The Go Authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README",
          "type": "blob",
          "size": 0.4013671875,
          "content": "Code Search is a tool for indexing and then performing\nregular expression searches over large bodies of source code.\nIt is a set of command-line programs written in Go.\n\nFor background and an overview of the commands,\nsee http://swtch.com/~rsc/regexp/regexp4.html.\n\nTo install:\n\n\tgo get github.com/google/codesearch/cmd/...\n\nUse \"go get -u\" to update an existing installation.\n\nRuss Cox\nrsc@swtch.com\nJune 2015\n"
        },
        {
          "name": "cmd",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.0439453125,
          "content": "module github.com/google/codesearch\n\ngo 1.23\n"
        },
        {
          "name": "index",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "regexp",
          "type": "tree",
          "content": null
        },
        {
          "name": "sparse",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}