{
  "metadata": {
    "timestamp": 1736566604904,
    "page": 159,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "google/go-cmp",
      "stars": 4274,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.9462890625,
          "content": "# How to Contribute\n\nWe'd love to accept your patches and contributions to this project. There are\njust a few small guidelines you need to follow.\n\n## Contributor License Agreement\n\nContributions to this project must be accompanied by a Contributor License\nAgreement. You (or your employer) retain the copyright to your contribution,\nthis simply gives us permission to use and redistribute your contributions as\npart of the project. Head over to <https://cla.developers.google.com/> to see\nyour current agreements on file or to sign a new one.\n\nYou generally only need to submit a CLA once, so if you've already submitted one\n(even if it was for a different project), you probably don't need to do it\nagain.\n\n## Code reviews\n\nAll submissions, including submissions by project members, require review. We\nuse GitHub pull requests for this purpose. Consult\n[GitHub Help](https://help.github.com/articles/about-pull-requests/) for more\ninformation on using pull requests.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.4443359375,
          "content": "Copyright (c) 2017 The Go Authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.650390625,
          "content": "# Package for equality of Go values\n\n[![GoDev](https://img.shields.io/static/v1?label=godev&message=reference&color=00add8)][godev]\n[![Build Status](https://github.com/google/go-cmp/actions/workflows/test.yml/badge.svg?branch=master)][actions]\n\nThis package is intended to be a more powerful and safer alternative to\n`reflect.DeepEqual` for comparing whether two values are semantically equal.\n\nThe primary features of `cmp` are:\n\n* When the default behavior of equality does not suit the needs of the test,\n  custom equality functions can override the equality operation.\n  For example, an equality function may report floats as equal so long as they\n  are within some tolerance of each other.\n\n* Types that have an `Equal` method may use that method to determine equality.\n  This allows package authors to determine the equality operation for the types\n  that they define.\n\n* If no custom equality functions are used and no `Equal` method is defined,\n  equality is determined by recursively comparing the primitive kinds on both\n  values, much like `reflect.DeepEqual`. Unlike `reflect.DeepEqual`, unexported\n  fields are not compared by default; they result in panics unless suppressed\n  by using an `Ignore` option (see `cmpopts.IgnoreUnexported`) or explicitly\n  compared using the `AllowUnexported` option.\n\nSee the [documentation][godev] for more information.\n\nThis is not an official Google product.\n\n[godev]: https://pkg.go.dev/github.com/google/go-cmp/cmp\n[actions]: https://github.com/google/go-cmp/actions\n\n## Install\n\n```\ngo get -u github.com/google/go-cmp/cmp\n```\n\n## License\n\nBSD - See [LICENSE][license] file\n\n[license]: https://github.com/google/go-cmp/blob/master/LICENSE\n"
        },
        {
          "name": "cmp",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.0400390625,
          "content": "module github.com/google/go-cmp\n\ngo 1.21\n"
        }
      ]
    }
  ]
}