{
  "metadata": {
    "timestamp": 1736566961519,
    "page": 544,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "jetify-com/typeid",
      "stars": 3005,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0048828125,
          "content": "dist/"
        },
        {
          "name": ".goreleaser.yaml",
          "type": "blob",
          "size": 0.85546875,
          "content": "project_name: typeid\n\nbefore:\n  hooks:\n    - go mod tidy\n\nbuilds:\n  - main: ./main.go\n    binary: typeid\n    flags:\n      - -trimpath\n    mod_timestamp: \"{{ .CommitTimestamp }}\" # For reproducible builds\n    ldflags:\n      - -s -w # Strip debug symbols\n    env:\n      - CGO_ENABLED=0\n      - GO111MODULE=on\n    goos:\n      - darwin\n      - linux\n      - windows\n    goarch:\n      - \"386\"\n      - amd64\n      - arm\n      - arm64\n    ignore:\n      - goos: darwin\n        goarch: \"386\"\n\narchives:\n  - files:\n      - no-files-will-match-* # Glob that does not match to create archive with only binaries.\n    name_template: \"{{ .ProjectName }}_{{ .Tag }}_{{ .Os }}_{{ .Arch }}\"\n\nchecksum:\n  name_template: \"checksums.txt\"\n  algorithm: sha256\n\nrelease:\n  prerelease: auto\n  draft: true\n  github:\n    owner: jetify-com\n    name: typeid\n\nsnapshot:\n  name_template: \"{{ .Tag }}-devel\"\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.4052734375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, caste, color, religion, or sexual\nidentity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n- Demonstrating empathy and kindness toward other people\n- Being respectful of differing opinions, viewpoints, and experiences\n- Giving and gracefully accepting constructive feedback\n- Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n- Focusing on what is best not just for us as individuals, but for the overall\n  community\n\nExamples of unacceptable behavior include:\n\n- The use of sexualized language or imagery, and sexual attention or advances of\n  any kind\n- Trolling, insulting or derogatory comments, and personal or political attacks\n- Public or private harassment\n- Publishing others' private information, such as a physical or email address,\n  without their explicit permission\n- Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement. Use the\n\"Report to repository admins\" functionality on GitHub to report.\n\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series of\nactions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or permanent\nban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior, harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within the\ncommunity.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.1, available at\n[https://www.contributor-covenant.org/version/2/1/code_of_conduct.html][v2.1].\n\nCommunity Impact Guidelines were inspired by\n[Mozilla's code of conduct enforcement ladder][mozilla coc].\n\nFor answers to common questions about this code of conduct, see the FAQ at\n[https://www.contributor-covenant.org/faq][faq]. Translations are available at\n[https://www.contributor-covenant.org/translations][translations].\n\n[homepage]: https://www.contributor-covenant.org\n[v2.1]: https://www.contributor-covenant.org/version/2/1/code_of_conduct.html\n[mozilla coc]: https://github.com/mozilla/diversity\n[faq]: https://www.contributor-covenant.org/faq\n[translations]: https://www.contributor-covenant.org/translations\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.87890625,
          "content": "# Contributing\n\nWhen contributing to this repository, please describe the change you wish to make via a related issue, or a pull request.\n\nPlease note we have a [code of conduct](CODE_OF_CONDUCT.md), please follow it in all your interactions with the project.\n\n## Opening a Pull Request\n\nThis project is published as a standalone repo from our [opensource monorepo](https://github.com/jetify-com/opensource).\nPull requests should be sent to the monorepo instead, and they will automatically be published\nto this repo when merged.\n\n## Developer Certificate of Origin\n\nBy contributing to this project you agree to the [Developer Certificate of Origin](https://developercertificate.org/) (DCO) which was created by the Linux Foundation and is a simple statement that you, as a contributor, have the legal right to make the contribution. See the DCO description for details below:\n\n> By making a contribution to this project, I certify that:\n>\n> a. The contribution was created in whole or in part by me and I have the right to submit it under the open source license indicated in the file; or\n>\n> b. The contribution is based upon previous work that, to the best of my knowledge, is covered under an appropriate open source license and I have the right under that license to submit that work with modifications, whether created in whole or in part by me, under the same open source license (unless I am permitted to submit under a different license), as indicated in the file; or\n>\n> c. The contribution was provided directly to me by some other person who certified (a), (b) or (c) and I have not modified it.\n>\n> d. I understand and agree that this project and the contribution are public and that a record of the contribution (including all personal information I submit with it, including my sign-off) is maintained indefinitely and may be redistributed consistent with this project or the open source license(s) involved.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.08984375,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.640625,
          "content": "# TypeID\n\n### A type-safe, K-sortable, globally unique identifier inspired by Stripe IDs\n\n![License: Apache 2.0](https://img.shields.io/github/license/jetify-com/typeid) [![Join Discord](https://img.shields.io/discord/903306922852245526?color=7389D8&label=discord&logo=discord&logoColor=ffffff)](https://discord.gg/jetify) [![Built with Devbox](https://www.jetify.com/img/devbox/shield_galaxy.svg)](https://www.jetify.com/devbox/)\n\n## What is it?\n\nTypeIDs are a modern, type-safe extension of UUIDv7. Inspired by a similar use of prefixes\nin Stripe's APIs.\n\nTypeIDs are canonically encoded as lowercase strings consisting of three parts:\n\n1. A type prefix (at most 63 characters in all lowercase snake_case ASCII [a-z_]).\n2. An underscore '\\_' separator\n3. A 128-bit UUIDv7 encoded as a 26-character string using a modified base32 encoding.\n\nHere's an example of a TypeID of type `user`:\n\n```\n  user_2x4y6z8a0b1c2d3e4f5g6h7j8k\n  └──┘ └────────────────────────┘\n  type    uuid suffix (base32)\n```\n\nA [formal specification](./spec) defines the encoding in more detail.\n\n## Online Converter\n\nYou can try converting UUID to TypeID and back using Jetify's TypeID Converter. Paste your TypeID string to convert to UUID or put your prefix and UUID in this format: `prefix:UUID` to convert to TypeID.\n\n### [jetify.com/typeid](https://www.jetify.com/typeid)\n\n## Benefits\n\n- **Type-safe:** you can't accidentally use a `user` ID where a `post` ID is expected. When debugging, you can\n  immediately understand what type of entity a TypeID refers to thanks to the type prefix.\n- **Compatible with UUIDs:** TypeIDs are a superset of UUIDs. They are based on the upcoming [UUIDv7 standard](https://www.ietf.org/archive/id/draft-peabody-dispatch-new-uuid-format-04.html#name-uuid-version-7). If you decode the TypeID and remove the type information, you get a valid UUIDv7.\n- **K-Sortable**: TypeIDs are K-sortable and can be used as the primary key in a database while ensuring good\n  locality. Compare to entirely random global ids, like UUIDv4, that generally suffer from poor database locality.\n- **Thoughtful encoding**: the base32 encoding is URL safe, case-insensitive, avoids ambiguous characters, can be\n  selected for copy-pasting by double-clicking, and is a more compact encoding than the traditional hex encoding used by UUIDs (26 characters vs 36 characters).\n\n## Implementations\n\nImplementations should adhere to the formal [specification](./spec).\n\nLatest spec version: v0.3.0\n\n### Official Implementations by `jetify`\n\n| Language                                              | Status        | Spec Version |\n| ----------------------------------------------------- | ------------- | ------------ |\n| [Go](https://github.com/jetify-com/typeid-go)         | ✓ Implemented | v0.3         |\n| [SQL](https://github.com/jetify-com/typeid-sql)       | ✓ Implemented | v0.2         |\n| [TypeScript](https://github.com/jetify-com/typeid-js) | ✓ Implemented | v0.3         |\n\n### Community Provided Implementations\n\n| Language                                                      | Author                                                                                    | Spec Version                                                               |\n|---------------------------------------------------------------|-------------------------------------------------------------------------------------------|----------------------------------------------------------------------------|\n| [C# (.Net)](https://github.com/TenCoKaciStromy/typeid-dotnet) | [@TenCoKaciStromy](https://github.com/TenCoKaciStromy)                                    | v0.2 on 2023-06-30                                                         |\n| [C# (.Net Standard 2.1)](https://github.com/cbuctok/typeId)   | [@cbuctok](https://github.com/cbuctok)                                                    | v0.2 on 2023-07-03                                                         |\n| [C# (.NET)](https://github.com/firenero/TypeId)               | [@firenero](https://github.com/firenero)                                                  | v0.3 on 2024-04-15                                                         |\n| [Dart](https://github.com/TBD54566975/typeid-dart)            | [@mistermoe](https://github.com/mistermoe) [@tbd54566975](https://github.com/tbd54566975) | [v0.3 on 2024-07-02](https://github.com/TBD54566975/typeid-dart/actions/runs/9755701869/job/26924658060#step:6:10)                                                         |\n| [Elixir](https://github.com/sloanelybutsurely/typeid-elixir)  | [@sloanelybutsurely](https://github.com/sloanelybutsurely)                                | v0.3 on 2024-04-22                                                         |\n| [Elixir](https://github.com/xinz/elixir_typeid)               | [@xinz](https://github.com/xinz)                                                          | v0.1 on 2024-06-03                                                         |\n| [Erlang](https://github.com/eproxus/keysmith)                 | [@eproxus](https://github.com/eproxus)                                                    | v0.3 on 2024-09-25                                                         |\n| [Haskell](https://github.com/MMZK1526/mmzk-typeid)            | [@MMZK1526](https://github.com/MMZK1526)                                                  | v0.3 on 2024-04-19                                                         |\n| [Java](https://github.com/fxlae/typeid-java)                  | [@fxlae](https://github.com/fxlae)                                                        | v0.3 on 2024-04-14                                                         |\n| [Java](https://github.com/softprops/typeid-java)              | [@softprops](https://github.com/softprops)                                                | v0.2 on 2023-07-04                                                         |\n| [Kotlin](https://github.com/aleris/typeid-kotlin)             | [@aleris](https://github.com/aleris)                                                      | v0.3 on 2024-05-18                                                         |\n| [OCaml](https://github.com/titouancreach/typeid-ocaml)        | [@titouancreach](https://github.com/titouancreach)                                        | v0.3 on 2024-04-22                                                         |\n| [PHP](https://github.com/basecodeoy/typeid)                | [@BaseCodeOy](https://github.com/basecodeoy)                                        | v0.3 on 2024-12-06                                                         |\n| [Postgres](https://github.com/blitss/typeid-postgres)         | [@blitss](https://github.com/blitss)                                                      | [v0.3 on 2024-06-24](https://github.com/blitss/typeid-postgres/actions/runs/9637303320/job/26576304134#step:11:288)                                                                                                                                                                            |\n| [Python](https://github.com/akhundMurad/typeid-python)        | [@akhundMurad](https://github.com/akhundMurad)                                            | [v0.3 on 2024-04-19](https://github.com/akhundMurad/typeid-python/releases/tag/v0.3.0)                                                       |\n| [Ruby](https://github.com/broothie/typeid-ruby)               | [@broothie](https://github.com/broothie)                                                  | [v0.3 on 2024-04-13](https://github.com/broothie/typeid-ruby/pull/17)      |\n| [Rust](https://github.com/conradludgate/type-safe-id)         | [@conradludgate](https://github.com/conradludgate)                                        | [v0.3 on 2024-04-12](https://github.com/conradludgate/type-safe-id/pull/1) |\n| [Rust](https://github.com/johnnynotsolucky/strong_id)         | [@johnnynotsolucky](https://github.com/johnnynotsolucky)                                  | [v0.3 on 2024-05-17](https://github.com/johnnynotsolucky/strong_id/commit/10aa50487bbdd851c58a2ed73071a50452441370) |\n| [Rust](https://github.com/Govcraft/mti)                       | [@Govcraft](https://github.com/Govcraft)                                                  | [v0.3 on 2024-07-15](https://github.com/Govcraft/mti/actions/runs/9945923733) |\n| [Scala](https://github.com/ant8e/uuid4cats-effect)            | [@ant8e](https://github.com/ant8e)                                                        | v0.3 on 2024-04-19                                                         |\n| [Scala](https://github.com/guizmaii-opensource/zio-uuid)      | [@guizmaii](https://github.com/guizmaii)                                                  | Not validated yet                                                          |\n| [Swift](https://github.com/Frizlab/swift-typeid)              | [@Frizlab](https://github.com/Frizlab)                                                    | v0.3 on 2024-04-19                                                         |\n| [T-SQL](https://github.com/uniteeio/typeid_tsql)              | [@uniteeio](https://github.com/uniteeio)                                                  | v0.2 on 2023-08-25                                                         |\n| [TypeScript](https://github.com/ongteckwu/typeid-ts)          | [@ongteckwu](https://github.com/ongteckwu)                                                | v0.2 on 2023-06-30                                                         |\n| [Zig](https://github.com/nikoksr/typeid-zig)                | [@nikoksr](https://github.com/nikoksr)                                                | v0.3 on 2024-12-29                                                         |\n\nWe are looking for community contributions to implement TypeIDs in other languages.\n\n## Command-line Tool\n\nThis repo includes a command-line tool for generating TypeIDs. To install it, run:\n\n```bash\ncurl -fsSL https://get.jetify.com/typeid | bash\n```\n\nTo generate a new TypeID, run:\n\n```console\n$ typeid new prefix\nprefix_01h2xcejqtf2nbrexx3vqjhp41\n```\n\nTo decode an existing TypeID into a UUID run:\n\n```console\n$ typeid decode prefix_01h2xcejqtf2nbrexx3vqjhp41\ntype: prefix\nuuid: 0188bac7-4afa-78aa-bc3b-bd1eef28d881\n```\n\nAnd to encode an existing UUID into a TypeID run:\n\n```console\n$ typeid encode prefix 0188bac7-4afa-78aa-bc3b-bd1eef28d881\nprefix_01h2xcejqtf2nbrexx3vqjhp41\n```\n\n## Related Work\n\n- [UUIDv7](https://www.ietf.org/archive/id/draft-peabody-dispatch-new-uuid-format-04.html#name-uuid-version-7) - The upcoming UUID standard that TypeIDs are based on.\n\nAlternatives to UUIDv7 that are also worth considering (but not type-safe like TypeIDs):\n\n- [xid](https://github.com/rs/xid)\n- [ulid](https://github.com/ulid)\n- [ksuid](https://github.com/segmentio/ksuid)\n"
        },
        {
          "name": "cli",
          "type": "tree",
          "content": null
        },
        {
          "name": "devbox.json",
          "type": "blob",
          "size": 0.30859375,
          "content": "{\n  \"packages\": [\n    \"go@1.20\",\n    \"golangci-lint@latest\"\n  ],\n  \"shell\": {\n    \"init_hook\": [\n      \"export \\\"GOROOT=$(go env GOROOT)\\\"\"\n    ],\n    \"scripts\": {\n      \"build\": \"go build -o dist/typeid\",\n      \"lint\": \"golangci-lint run -c ../.golangci.yml\",\n      \"test\": \"go test -race -cover ./...\"\n    }\n  }\n}\n"
        },
        {
          "name": "devbox.lock",
          "type": "blob",
          "size": 2.314453125,
          "content": "{\n  \"lockfile_version\": \"1\",\n  \"packages\": {\n    \"go@1.20\": {\n      \"last_modified\": \"2024-03-08T13:51:52Z\",\n      \"resolved\": \"github:NixOS/nixpkgs/a343533bccc62400e8a9560423486a3b6c11a23b#go_1_20\",\n      \"source\": \"devbox-search\",\n      \"version\": \"1.20.14\",\n      \"systems\": {\n        \"aarch64-darwin\": {\n          \"outputs\": [\n            {\n              \"name\": \"out\",\n              \"path\": \"/nix/store/xkwl1ycwwnq6b1ga5lxkqhjxlpd7f2sj-go-1.20.14\",\n              \"default\": true\n            }\n          ],\n          \"store_path\": \"/nix/store/xkwl1ycwwnq6b1ga5lxkqhjxlpd7f2sj-go-1.20.14\"\n        },\n        \"aarch64-linux\": {\n          \"outputs\": [\n            {\n              \"name\": \"out\",\n              \"path\": \"/nix/store/5i47jls8m0vjf141x3b3pz2i6q1si54w-go-1.20.14\",\n              \"default\": true\n            }\n          ],\n          \"store_path\": \"/nix/store/5i47jls8m0vjf141x3b3pz2i6q1si54w-go-1.20.14\"\n        },\n        \"x86_64-darwin\": {\n          \"outputs\": [\n            {\n              \"name\": \"out\",\n              \"path\": \"/nix/store/n2lj7bl7sg5viva3vxpkgi3mq8jbiyb5-go-1.20.14\",\n              \"default\": true\n            }\n          ],\n          \"store_path\": \"/nix/store/n2lj7bl7sg5viva3vxpkgi3mq8jbiyb5-go-1.20.14\"\n        },\n        \"x86_64-linux\": {\n          \"outputs\": [\n            {\n              \"name\": \"out\",\n              \"path\": \"/nix/store/850gdv8mcrh5bckigj16hzm6kmas5g92-go-1.20.14\",\n              \"default\": true\n            }\n          ],\n          \"store_path\": \"/nix/store/850gdv8mcrh5bckigj16hzm6kmas5g92-go-1.20.14\"\n        }\n      }\n    },\n    \"golangci-lint@latest\": {\n      \"last_modified\": \"2023-11-17T14:14:56Z\",\n      \"resolved\": \"github:NixOS/nixpkgs/a71323f68d4377d12c04a5410e214495ec598d4c#golangci-lint\",\n      \"source\": \"devbox-search\",\n      \"version\": \"1.55.2\",\n      \"systems\": {\n        \"aarch64-darwin\": {\n          \"store_path\": \"/nix/store/ggfyqw5kl0dy7l6nhajcyayiw05wzrb1-golangci-lint-1.55.2\"\n        },\n        \"aarch64-linux\": {\n          \"store_path\": \"/nix/store/ak3wnmbc43wqgg9zky98i44nazxvklqg-golangci-lint-1.55.2\"\n        },\n        \"x86_64-darwin\": {\n          \"store_path\": \"/nix/store/xckmcrd22nij4xwzdiw8ydc4z00rgcd2-golangci-lint-1.55.2\"\n        },\n        \"x86_64-linux\": {\n          \"store_path\": \"/nix/store/xiy36g6w9qcgzkyifi9hf7ayj2drap9k-golangci-lint-1.55.2\"\n        }\n      }\n    }\n  }\n}\n"
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.314453125,
          "content": "module go.jetpack.io/typeid-cli\n\ngo 1.21\n\ntoolchain go1.22.1\n\nrequire (\n\tgithub.com/spf13/cobra v1.8.0\n\tgo.jetify.com/typeid v1.3.1-0.20241211224430-39758d55f188\n)\n\nrequire (\n\tgithub.com/gofrs/uuid/v5 v5.3.0 // indirect\n\tgithub.com/inconshreveable/mousetrap v1.1.0 // indirect\n\tgithub.com/spf13/pflag v1.0.5 // indirect\n)\n"
        },
        {
          "name": "go.sum",
          "type": "blob",
          "size": 1.978515625,
          "content": "github.com/cpuguy83/go-md2man/v2 v2.0.3/go.mod h1:tgQtvFlXSQOSOSIRvRPT7W67SCa46tRHOmNcaadrF8o=\ngithub.com/davecgh/go-spew v1.1.1 h1:vj9j/u1bqnvCEfJOwUhtlOARqs3+rkHYY13jYWTU97c=\ngithub.com/davecgh/go-spew v1.1.1/go.mod h1:J7Y8YcW2NihsgmVo/mv3lAwl/skON4iLHjSsI+c5H38=\ngithub.com/gofrs/uuid/v5 v5.3.0 h1:m0mUMr+oVYUdxpMLgSYCZiXe7PuVPnI94+OMeVBNedk=\ngithub.com/gofrs/uuid/v5 v5.3.0/go.mod h1:CDOjlDMVAtN56jqyRUZh58JT31Tiw7/oQyEXZV+9bD8=\ngithub.com/inconshreveable/mousetrap v1.1.0 h1:wN+x4NVGpMsO7ErUn/mUI3vEoE6Jt13X2s0bqwp9tc8=\ngithub.com/inconshreveable/mousetrap v1.1.0/go.mod h1:vpF70FUmC8bwa3OWnCshd2FqLfsEA9PFc4w1p2J65bw=\ngithub.com/pmezard/go-difflib v1.0.0 h1:4DBwDE0NGyQoBHbLQYPwSUPoCMWR5BEzIk/f1lZbAQM=\ngithub.com/pmezard/go-difflib v1.0.0/go.mod h1:iKH77koFhYxTK1pcRnkKkqfTogsbg7gZNVY4sRDYZ/4=\ngithub.com/russross/blackfriday/v2 v2.1.0/go.mod h1:+Rmxgy9KzJVeS9/2gXHxylqXiyQDYRxCVz55jmeOWTM=\ngithub.com/spf13/cobra v1.8.0 h1:7aJaZx1B85qltLMc546zn58BxxfZdR/W22ej9CFoEf0=\ngithub.com/spf13/cobra v1.8.0/go.mod h1:WXLWApfZ71AjXPya3WOlMsY9yMs7YeiHhFVlvLyhcho=\ngithub.com/spf13/pflag v1.0.5 h1:iy+VFUOCP1a+8yFto/drg2CJ5u0yRoB7fZw3DKv/JXA=\ngithub.com/spf13/pflag v1.0.5/go.mod h1:McXfInJRrz4CZXVZOBLb0bTZqETkiAhM9Iw0y3An2Bg=\ngithub.com/stretchr/testify v1.9.0 h1:HtqpIVDClZ4nwg75+f6Lvsy/wHu+3BoSGCbBAcpTsTg=\ngithub.com/stretchr/testify v1.9.0/go.mod h1:r2ic/lqez/lEtzL7wO/rwa5dbSLXVDPFyf8C91i36aY=\ngo.jetify.com/typeid v1.3.1-0.20241211224430-39758d55f188 h1:gLbyaE7KA2/qqUSw5j9RweZ2tZvM4nSVOCFXrWSPo7c=\ngo.jetify.com/typeid v1.3.1-0.20241211224430-39758d55f188/go.mod h1:Qlbkqu/YQVknz7AhsKUnDJDmOfKR6G/YUiEbxt12PXY=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405/go.mod h1:Co6ibVJAznAaIkqp8huTwlJQCZ016jof/cbN4VW5Yz0=\ngopkg.in/yaml.v2 v2.4.0 h1:D8xgwECY7CYvx+Y2n4sBz93Jn9JRvxdiyyo8CTfuKaY=\ngopkg.in/yaml.v2 v2.4.0/go.mod h1:RDklbk79AGWmwhnvt/jBztapEOGDOx6ZbXqjP6csGnQ=\ngopkg.in/yaml.v3 v3.0.1 h1:fxVm/GzAzEWqLHuvctI91KS9hhNmmWOoWu0XTYJS7CA=\ngopkg.in/yaml.v3 v3.0.1/go.mod h1:K4uyk7z7BCEPqu6E+C64Yfv1cQ7kz7rIZviUmN+EgEM=\n"
        },
        {
          "name": "main.go",
          "type": "blob",
          "size": 0.0791015625,
          "content": "package main\n\nimport \"go.jetpack.io/typeid-cli/cli\"\n\nfunc main() {\n\tcli.Main()\n}\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "spec",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}