{
  "metadata": {
    "timestamp": 1736567088844,
    "page": 680,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "cyclops-ui/cyclops",
      "stars": 2698,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".devcontainer",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0712890625,
          "content": ".idea\n.DS_Store\n\ndist/\ncyclops-ui/src/**/*.js.map\ncyclops-ui/src/**/*.js\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.0986328125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\ninfo@cyclops-ui.com.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 5.8056640625,
          "content": "# Contributing to Cyclops\n\nWelcome, glad to see you here!\n\nIf you are up to the challenge of contributing to Cyclops, this document will help guide you on your journey. And if you want to talk to us directly, join our [Discord](https://discord.com/invite/8ErnK3qDb3) where we have a `looking-to-contribute` channel.\n\nPlease note we have a [code of conduct](./CODE_OF_CONDUCT.md); follow it in all your interactions with the project.\n\n## How to contribute\n\n- Pick an issue [here](https://github.com/cyclops-ui/cyclops/issues). If you have already contributed, we encourage you not to pick issues labeled with `good first issue` since those are useful to first-time contributors to onboard\n- Let us know you would like to solve the issue by leaving a comment on the issue or reaching out to us on Discord or some other way\n- [Fork the repository](https://github.com/cyclops-ui/cyclops/fork) and clone it locally\n- Create a new branch\n- Make your changes\n- Create a pull request back to the upstream repository (_Please make sure that your PR is up-to-date with the latest changes in main_)\n- Wait for a review and address any comments\n\n> ⚠️ **_IMPORTANT_** ⚠️\n>\n> It is highly discouraged to pick multiple issues at once. Resolving one issue at a time allows more people to contribute to the project and helps maintainers review your code.\n> \n> If you want to pick another issue, let us know, and we will unassign you from your current issue and assign you to another.\n> \n> The only exception here is if multiple issues are related and you think it would be easier to resolve them in a single PR. \n\n## The components that make Cyclops\n\nCyclops is a mono-repo that contains both the frontend (`UI`) and the backend (`controller`) of the platform, as well as the code for our website and documentation (`web`).\n\n![Cyclops architecture](./web/static/img/cyclops-arch.png)\n\n- **controller**\n\n  - `/cyclops-ctrl`\n  - REST API serving data about Cyclops modules (modules CRUD)\n  - listens for module changes and creates all needed resources from the template\n  - Go, [kubebuilder](https://book.kubebuilder.io/)\n\n- **UI**\n\n  - `/cyclops-ui`\n  - shows info about modules\n  - renders form based on the module template\n  - Typescript, React, [Ant Design](https://ant.design/)\n\n- **docs**\n\n  - `/web`\n  - website with the Cyclops documentation\n  - [docusaurus](https://docusaurus.io/)\n\n## Where to start\n\n- If you are new to the project, please check out the [good first issue](https://github.com/cyclops-ui/cyclops/issues?q=is:open+is:issue+label:%22good+first+issue%22) label.\n- If you are looking for something to work on, check out our open issues.\n- If you have an idea for a new feature, please open an issue, and we can discuss it.\n- If you think the documentation on our website was unclear or you found a broken link, please feel free to fix it\n- We are also happy to help you find something to work on. Just reach out to us on [Discord](https://discord.com/invite/8ErnK3qDb3).\n\n## Running services\n\nBefore you start contributing, getting a feel of the project and trying it out locally is a good idea. The next chapter will go through how to run each mentioned component.\n\nBut before you can start running the components, you need to set up your dev environment. If you already have a Kubernetes cluster you can use, you can skip this step. If not, don't worry, this won't take long.\n\n## Cluster setup\n\n### **Minikube**\n\nTo run the controller, you will need a Kubernetes cluster to connect it to. For the sake of development, you can use [minikube](https://minikube.sigs.k8s.io/docs/).\nYou can install minikube and run it using `minikube start`. It will set up a Kubernetes cluster locally and configure your kubeconfig file to point to the minikube cluster.\n\n### `cyclops` namespace\n\nYou will need to create a new namespace for Cyclops resources\n```zsh\nkubectl create namespace cyclops\n```\n\n### Cyclops CRDs\n\nCyclops has its own [custom resource](https://kubernetes.io/docs/concepts/extend-kubernetes/api-extension/custom-resources/) which you need to install into your cluster before trying to run Cyclops.\nYou can install it using the command below:\n\n```zsh\nkubectl apply -f https://raw.githubusercontent.com/cyclops-ui/cyclops/main/cyclops-ctrl/config/crd/bases/cyclops-ui.com_modules.yaml \\\n  -f https://raw.githubusercontent.com/cyclops-ui/cyclops/main/cyclops-ctrl/config/crd/bases/cyclops-ui.com_templateauthrules.yaml \\\n  -f https://raw.githubusercontent.com/cyclops-ui/cyclops/main/cyclops-ctrl/config/crd/bases/cyclops-ui.com_templatestores.yaml\n```\n\n## **Controller** `/cyclops-ctrl`\n\nYou can run the controller inside the cluster deployed as a Kubernetes deployment, described [here](https://github.com/cyclops-ui/cyclops/blob/a4d21a48648e79fe27e51600f5489ae0d36175a7/install/cyclops-install.yaml#L259),\nor you can run it outside of the cluster.\n\nAfter you have your cluster up and running and you have installed the CRD into it, position yourself in `cyclops-ctrl` and run the command below from the terminal to start the controller.\n\n```zsh\nmake start\n```\n\n> 📌 **_NOTE_** 📌\n>\n> The default port of the REST API is 8080. If you would like to change the port of the REST API, you can do it by setting the env var in the [.env](https://github.com/cyclops-ui/cyclops/blob/main/cyclops-ctrl/.env) file in the `/cyclops-ctrl`\n\n\n## **UI** `/cyclops-ui`\n\nUI depends on the controller API. Again, you can run inside the cluster as well as outside. To run it, position yourself\nin `cyclops-ui`. After that, you will need to install all the dependencies using\n\n```zsh\nyarn install\n```\n\nOnce dependencies are installed, you can run the UI\n\n```zsh\nyarn start\n```\n\n> 📌 **_NOTE_** 📌\n>\n> If you changed the port of the REST API, you will need to update it in the UI as well.\n\n## **Documentation** `/web`\n\nYou can run our page locally by installing the dependencies\n\n```zsh\nnpm i -f\n```\n\nand running the app\n\n```zsh\nnpm start\n```\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.6484375,
          "content": "[![CNCF Badge](https://img.shields.io/badge/CNCF%20Landscape-5699C6?style=flat-square&color=5699C6)](https://landscape.cncf.io/?item=app-definition-and-development--application-definition-image-build--cyclops)\n[![Docker Pulls](https://img.shields.io/docker/pulls/cyclopsui/cyclops-ctrl?style=flat-square&logo=docker&color=%230db7ed)](https://hub.docker.com/repository/docker/cyclopsui/cyclops-ctrl/general)\n[![Go Report Card](https://goreportcard.com/badge/github.com/cyclops-ui/cyclops/cyclops-ctrl?style=flat-square)](https://goreportcard.com/report/github.com/cyclops-ui/cyclops/cyclops-ctrl)\n[![GitHub Actions CI](https://img.shields.io/github/actions/workflow/status/cyclops-ui/cyclops/ci.yml?style=flat-square&logo=github&logoColor=white&label=cyclops%20build)](https://github.com/cyclops-ui/cyclops/actions/workflows/ci.yml)\n[![GitHub Actions web](https://img.shields.io/github/actions/workflow/status/cyclops-ui/cyclops/web.yaml?style=flat-square&logo=github&logoColor=white&label=GitHub%20pages%20build)](https://github.com/cyclops-ui/cyclops/actions/workflows/web.yaml)\n[![GitHub License](https://img.shields.io/github/license/cyclops-ui/cyclops?style=flat-square&link=https%3A%2F%2Fgithub.com%2Fcyclops-ui%2Fcyclops%2Fblob%2Fmain%2FLICENSE)](https://github.com/cyclops-ui/cyclops/blob/main/LICENSE)\n[![Discord](https://img.shields.io/discord/1103010228884209824?style=flat-square&logo=Discord&logoColor=white&label=Discord&color=%237289da)](https://discord.com/invite/8ErnK3qDb3)\n\n<p align=\"center\" width=\"100%\">\n    <img width=\"75%\" src=\"./web/static/img/cyclops-simplistic.png\">\n<p/>\n<h3 align=\"center\">Developer Friendly Kubernetes</h3>\n<p align=\"center\">\n    <a href=\"https://cyclops-ui.com\">Webpage</a>\n -\n    <a href=\"https://discord.com/invite/8ErnK3qDb3\">Discord</a>\n -\n    <a href=\"https://x.com/CyclopsUI\">X</a>\n -\n    <a href=\"https://www.linkedin.com/company/cyclops-ui\">LinkedIn</a>\n</p>\n\n## 🟠 What is Cyclops?\n\nCyclops is an open-source dev tool that simplifies Kubernetes with an easy-to-use UI, making it less intimidating. Instead of creating and configuring your Kubernetes manifests with YAML, use Cyclops to painlessly configure and deploy your applications - validations included!\n\nThanks to the templates system, Cyclops's UI is highly customizable when defining configurations. Our templates turn hours and days of configuring applications into a few clicks.\n\n<p align= \"center\">\n    <img src=\"https://github.com/user-attachments/assets/4c1e3fff-7106-4afb-9c29-e0aef7d7dd86\"/>\n</p>\n\n## 💡 How it works?\n\nCyclops is a platform that allows DevOps teams to quickly and without coding create custom UIs for developers, QA teams, product managers, and other team members who do not necessarily have experience working with Kubernetes.\n\n**But don’t worry! If you do not have a DevOps team with you, Cyclops comes with a bunch of predefined templates to get you started!**\n\nUnder the hood, Cyclops uses Helm charts to create your desired UIs. This means you can try Cyclops with any of your existing Helm charts or any public Helm charts you can find!\n\nRead more about it [here](#-templates)\n\n## ⚙️ Install\n\n> _⚠️ Before installing Cyclops, make sure you have all the [prerequisites](https://cyclops-ui.com/docs/installation/prerequisites) ⚠️_\n\nCyclops can either be installed manually by applying the latest manifest, by using [cyctl](#cyctl), or with the [Glasskube Kubernetes Package Manager](https://github.com/glasskube/glasskube/).\n\nTo install Cyclops using `kubectl` into your cluster, run the commands below:\n\n```bash\nkubectl apply -f https://raw.githubusercontent.com/cyclops-ui/cyclops/v0.15.4/install/cyclops-install.yaml && kubectl apply -f https://raw.githubusercontent.com/cyclops-ui/cyclops/v0.15.4/install/demo-templates.yaml\n```\n\nIt will create a new namespace called `cyclops` and deploy everything you need for your Cyclops instance to run.\n\nNow, all that is left is to expose the Cyclops server outside the cluster:\n\n```bash\nkubectl port-forward svc/cyclops-ui 3000:3000 -n cyclops\n```\n\nYou can now access Cyclops in your browser on [http://localhost:3000](http://localhost:3000).\n\n## 💾 Templates\n\nEvery Cyclops instance comes with a couple of predefined templates. Feel free to use and abuse them!\n\nHelm charts used for these templates can be found [here](https://github.com/cyclops-ui/templates). You can use this repo as a guide to create your own templates. More information on making your own can be found on our [web](https://cyclops-ui.com/docs/templates/).\n\n## 🚧 `cyctl`\n\nThe Cyclops command line interface! You can install it with [Homebrew](https://formulae.brew.sh/formula/cyctl#default):\n\n```bash\nbrew install cyctl\n```\n\n**What are you able to do with `cyctl`?**\n\nBesides the basic commands like getting all modules or templates, you can integrate it with GitHub actions to automate some of the Cyclops processes.\n\nFor example, once you create a template and publish it on GitHub, GitHub actions could automatically connect the template to your Cyclops instance using our CLI. This would **allow your developers instant access to each new template or any update the template receives**.\n\n## 💪 Contributing\n\nCyclops is **open-source** and open to external contributors. There are plenty of ways you can contribute to the Cyclops project - with code, feedback, content and GitHub stars⭐\n\nStart your contributing journey at our [CONTRIBUTING.md](./CONTRIBUTING.md) and join our wall of fame 👐\n\n<p align=\"center\">\n    <a href=\"https://github.com/cyclops-ui/cyclops/graphs/contributors\">\n        <img src=\"https://contrib.rocks/image?repo=cyclops-ui/cyclops&columns=10\" />\n    </a>\n</p>\n\n## 🧭 Roadmap\n\n> _⚠️ This is not set in stone and may change in the future ⚠️_\n\n- ~~**Support for private GitHub repos** -> access templates saved on your private repositories~~ ✅\n- **Authentification** -> secure login\n- **Role-based access control** -> limit the resources your devs have access to\n- **GitOps** -> integrate with GitOps tools\n- **Support for Kustomize** -> currently, only Helm is supported for creating templates\n- **`cyctl` for Windows** -> Chocolatey\n- **Customizable Module details page** -> create custom views of resources that your module uses\n\n## 👁️ Share your feedback\n\n**Are you using Cyclops at your company?** We'd love to hear directly from you about how you're using (or planning to use) Cyclops! Chat with us for **30 minutes** about your use case and we'll send you a **50$ Amazon Gift Card** as a thank-you for your time. Please fill in this [form](https://forms.gle/Phu3R1i2gTBM1iAm8), and we will get in touch with you!\n\nYour input will directly influence the direction of Cyclops, and we appreciate every bit of feedback. Thank you for helping us build something great! 🧡\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.689453125,
          "content": "# Security Policy\n\n## Reporting Security Issues\n\nIf you discover a security vulnerability in this project, please follow these steps to report it to us:\n\n**DO NOT** open a public GitHub issue. Security issues must be reported privately via email.\n\n1. Email us at [info@cyclops-ui.com](mailto:info@cyclops-ui.com) with a detailed description of the vulnerability.\n2. Include information about how the vulnerability can be reproduced or exploited.\n3. Provide any relevant documentation, code snippets, or steps to help us understand and reproduce the issue.\n\nOur team will acknowledge your email within [time frame] and will work with you to address the issue. We appreciate your responsible disclosure and will keep you informed about the progress of fixing the vulnerability.\n\n## Supported Versions\n\nSince we currently don't have any official releases, we do not have specific versioning to provide support for. However, security issues reported will be addressed in the latest development code.\n\n## Security Measures\n\nWhile we are actively working on developing our project, we are committed to maintaining security best practices:\n\n- Regular code reviews by our development team.\n- Integration of automated testing to catch common vulnerabilities.\n- Continuous monitoring of dependencies for security updates.\n\n## Security Updates\n\nAs we start releasing official versions, we will include security updates and advisories in our release notes. Until then, any security-related updates will be communicated directly to anyone who has reported a security issue.\n\nWe appreciate your understanding as we work to improve the security of our project.\n\nThank you for your support and cooperation in helping to make our project secure.\n\n"
        },
        {
          "name": "cyclops-ctrl",
          "type": "tree",
          "content": null
        },
        {
          "name": "cyclops-ui",
          "type": "tree",
          "content": null
        },
        {
          "name": "cyctl",
          "type": "tree",
          "content": null
        },
        {
          "name": "install",
          "type": "tree",
          "content": null
        },
        {
          "name": "web",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}