{
  "metadata": {
    "timestamp": 1736567199443,
    "page": 798,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "uber-go/mock",
      "stars": 2458,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.23828125,
          "content": "# Object files and binaries from go.\n*.[568]\n\n# Library files.\n*.a\n\n# Any file prefixed by an underscore.\n*/_*\n\n# System\n.*.swp\n.DS_Store\n\n# The mockgen binary.\nmockgen/mockgen\n\n# Editors\n.vscode\n.idea\n\n# vendor directory used for IDEs\n/vendor\n"
        },
        {
          "name": ".goreleaser.yml",
          "type": "blob",
          "size": 0.7548828125,
          "content": "# Release automation via GoReleaser (goreleaser.com)\n# Requires a valid GITHUB_TOKEN envar prior to running `goreleaser`\n# See https://goreleaser.com/environment/ for more info\n---\nrelease:\n  github:\n    owner: uber-go\n    name: mock\n\nbuilds:\n  - binary: mockgen\n    goos:\n      - darwin\n      - windows\n      - linux\n    goarch:\n      - amd64\n      - arm64\n      - 386\n    env:\n      - CGO_ENABLED=0\n      - GO111MODULE=on\n      - GOPROXY=https://proxy.golang.org\n      - GOSUMDB=sum.golang.org\n    main: ./mockgen/\n\narchives:\n - format: tar.gz\n   wrap_in_directory: true\n   files:\n     - LICENSE\n     - README.md\n\nchecksum:\nsnapshot:\n  name_template: \"snap-{{ .Commit }}\"\n\nchangelog:\n  sort: asc\n  filters:\n    exclude:\n      - '^docs:'\n      - '^test:'\n      - 'README'\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.3623046875,
          "content": "# This is the official list of GoMock authors for copyright purposes.\n# This file is distinct from the CONTRIBUTORS files.\n# See the latter for an explanation.\n\n# Names should be added to this file as\n#\tName or Organization <email address>\n# The email address is not required for organizations.\n\n# Please keep the list sorted.\n\nAlex Reece <awreece@gmail.com>\nGoogle Inc.\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 4.5869140625,
          "content": "# Changelog\nAll notable changes to this project will be documented in this file.\n\nThis project adheres to [Semantic Versioning](http://semver.org/spec/v2.0.0.html).\n\n## Unreleased\n- No changes yet.\n\n## 0.5.0 (15 Oct 2024)\n### Added\n- [#153][]: Add `--write_command_comment` flag to specify whether to include\n  `Generated by this command` comment.\n- [#191][]: Add `--build_constraint` flag to add `//go:build` directives\n  to generated mocks\n- [#214][]: Add gob mode to support custom package loading techniques in place\n  of --exec_only\n\n### Changed\n- [#181][]: Made mockgen faster by changing flags passed to `go list`.\n- [#183][]: Made `Cond` matcher generic.\n- [#204][]: Removed `ISGOMOCK()` from generated mocks.\n- [#207][]: Deprecated reflect mode and replaced it with the new package mode.\n\n### Fixed\n- [#144][]: Fix a deadlock that can happen when mocking an interface that\n  matches `fmt.Stringer`.\n- [#168][]: Fix an issue where the \"generated by\" comment was being included\n  in the package comment of generated mocks.\n\n[#144]: https://github.com/uber-go/mock/pull/144\n[#153]: https://github.com/uber-go/mock/pull/153\n[#168]: https://github.com/uber-go/mock/pull/168\n[#181]: https://github.com/uber-go/mock/pull/181\n[#183]: https://github.com/uber-go/mock/pull/183\n[#191]: https://github.com/uber-go/mock/pull/191\n[#204]: https://github.com/uber-go/mock/pull/204\n[#207]: https://github.com/uber-go/mock/pull/207\n[#214]: https://github.com/uber-go/mock/pull/214\n\nThanks to @tulzke @JacobOaks @ARR4N @sashamelentyev @sywhang @fasmat\n@eyasy1217 @ghouscht @tie @Neo2308 @carson-brill @alexandear @sodul\n@nbgraham for their contributions this release.\n\n\n## 0.4.0 (20 Dec 2023)\n### Added\n- [#63][]: `AnyOf` matcher for values that satisfy at least one matcher.\n- [#114][]: `Regex` matcher.\n\n### Fixed\n- [#93][]: Ignore interfaces that contain type constraints.\n- [#101][]: Fix race condition on Controller.Satisfied.\n- [#121][]: Fix paths for windows.\n- [#127][]: Propagate -mock_names to Recorder and ReturnCall types.\n- [#132][]: Sanitize \"any\" package names.\n\n[#63]: https://github.com/uber-go/mock/pull/63\n[#93]: https://github.com/uber-go/mock/pull/93\n[#101]: https://github.com/uber-go/mock/pull/101\n[#114]: https://github.com/uber-go/mock/pull/114\n[#121]: https://github.com/uber-go/mock/pull/121\n[#127]: https://github.com/uber-go/mock/pull/127\n[#132]: https://github.com/uber-go/mock/pull/132\n\nThanks to @favonia @hoonmin @pshopper @davidharrigan @dlsniper @merrett010\n@craig65535 @chemidy @tulzke @UnAfraid @JacobOaks @sywhang for their\ncontributions this release.\n\n## 0.3.0 (15 Sep 2023)\n### Added\n- [#13][]: Support for embedded generic interfaces.\n- [#33][]: `-write_source_comment` for writing the original file or interface names\n  in the generated code.\n- [#46][]: `-write-generate-directive` for generating go:generate directives into\n  the generated mock.\n- [#60][]: `Cond` matcher for specifying a conditional matcher as the result of a\n  given function.\n- [#72][]: `exclude_interfaces` flag for specifying list of interfaces to exclude\n  from mock generation.\n\n### Fixed\n- [#41][]: A bug with specifying local import name with `-imports` flag.\n- [#52][]: A panic that occurs in `gob.Register` when used in conjunction with\n  golang/mock.\n- [#78][]: `InOrder` can be used with type-safe mocks generated with `-typed` flag.\n\n[#13]: https://github.com/uber-go/mock/pull/13\n[#33]: https://github.com/uber-go/mock/pull/33\n[#41]: https://github.com/uber-go/mock/pull/41\n[#46]: https://github.com/uber-go/mock/pull/46\n[#52]: https://github.com/uber-go/mock/pull/52\n[#60]: https://github.com/uber-go/mock/pull/60\n[#72]: https://github.com/uber-go/mock/pull/72\n[#78]: https://github.com/uber-go/mock/pull/78\n\nThanks to @alexandear, @bcho, @deathiop, @sivchari, @k3forx, @n0trace,\n@utgwkk, @ErfanMomeniii, @bcho, @damianopetrungaro, @Tulzke,\nand @EstebanOlmedo for their contributions to this release.\n\n## 0.2.0 (06 Jul 2023)\n### Added\n- `Controller.Satisfied` that lets you check whether all expected calls\n  bound to a Controller have been satisfied.\n- `NewController` now takes optional `ControllerOption` parameter.\n- `WithOverridableExpectations` is a `ControllerOption` that configures\n  Controller to override existing expectations upon a new EXPECT().\n- `-typed` flag for generating type-safe methods in the generated mock.\n\n## 0.1.0 (29 Jun 2023)\n\nThis is a minor version that mirrors the original golang/mock\nproject that this project originates from.\n\nAny users on golang/mock project should be able to migrate to\nthis project as-is, and expect exact same set of features (apart\nfrom supported Go versions. See [README](README.md#supported-go-versions)\nfor more details.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.8310546875,
          "content": "# Contributing\n\nFirst off, thank you for taking an interest to contribute to this project!\n\n> **Tip:** You'll need to sign [Uber's CLA](https://cla-assistant.io/uber-go/mock)\n> before we can accept any of your contributions.\n> If necessary, a bot will remind\n> you to accept the CLA when you open your pull request.\n\n## Opening issues\n\nWhen opening a [new issue](https://github.com/uber-go/mock/issues/new/choose)\nplease:\n\n1. Make sure there are no other open/closed issues asking/reporting/requesting\n   the same thing.\n1. Choose one of our provided templates and fill out as much information as\n   possible.\n\n## Opening a Pull Requests\n\nWe gladly accept contributions from the community. Before opening a pull request\nplease make sure to create an issue for discussion first. This helps us decide\nwhat action should be taken in regard to the issue.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.091796875,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "MAINTAINERS",
          "type": "blob",
          "size": 0.169921875,
          "content": "# This is the current list of maintainers to Uber's fork of gomock repository.\n\nSung Yoon Whang <sungyoon@uber.com>\nRyan Hang <rhang@uber.com>\nZhongpeng Lin <zplin@uber.com>\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.0654296875,
          "content": "# gomock\n\n[![Build Status][ci-badge]][ci-runs] [![Go Reference][reference-badge]][reference]\n\ngomock is a mocking framework for the [Go programming language][golang]. It\nintegrates well with Go's built-in `testing` package, but can be used in other\ncontexts too.\n\nThis project originates from Google's `golang/mock` repo. Unfortunately, Google\nno longer maintains this project, and given the heavy usage of gomock project\nwithin Uber, we've decided to fork and maintain this going forward at Uber.\n\n[Contributions](./CONTRIBUTING.md) are welcome in the form of GitHub issue or PR!\n\n## Supported Go Versions\n\ngo.uber.org/mock supports all Go versions supported by the official\n[Go Release Policy](https://go.dev/doc/devel/release#policy). That is,\nthe two most recent releases of Go.\n\n## Installation\n\nInstall the `mockgen` tool.\n\n```\ngo install go.uber.org/mock/mockgen@latest\n```\n\nTo ensure it was installed correctly, use:\n\n```\nmockgen -version\n```\n\nIf that fails, make sure your GOPATH/bin is in your PATH. You can add it with:\n\n```\nexport PATH=$PATH:$(go env GOPATH)/bin\n```\n\n## Running mockgen\n\n`mockgen` has two modes of operation: source and package.\n\n### Source mode\n\nSource mode generates mock interfaces from a source file.\nIt is enabled by using the -source flag. Other flags that\nmay be useful in this mode are -imports and -aux_files.\n\nExample:\n\n```bash\nmockgen -source=foo.go [other options]\n```\n\n### Package mode\n\nPackage mode works by specifying the package and interface names.\nIt is enabled by passing two non-flag arguments: an import path, and a\ncomma-separated list of symbols.\n\nYou can use \".\" to refer to the current path's package.\n\nExample:\n\n```bash\nmockgen database/sql/driver Conn,Driver\n\n# Convenient for `go:generate`.\nmockgen . Conn,Driver\n```\n\n### Flags\n\nThe `mockgen` command is used to generate source code for a mock\nclass given a Go source file containing interfaces to be mocked.\nIt supports the following flags:\n\n- `-source`: A file containing interfaces to be mocked.\n\n- `-destination`: A file to which to write the resulting source code. If you\n  don't set this, the code is printed to standard output.\n\n- `-package`: The package to use for the resulting mock class\n  source code. If you don't set this, the package name is `mock_` concatenated\n  with the package of the input file.\n\n- `-imports`: A list of explicit imports that should be used in the resulting\n  source code, specified as a comma-separated list of elements of the form\n  `foo=bar/baz`, where `bar/baz` is the package being imported and `foo` is\n  the identifier to use for the package in the generated source code.\n\n- `-aux_files`: A list of additional files that should be consulted to\n  resolve e.g. embedded interfaces defined in a different file. This is\n  specified as a comma-separated list of elements of the form\n  `foo=bar/baz.go`, where `bar/baz.go` is the source file and `foo` is the\n  package name of that file used by the -source file.\n\n- `-build_flags`: (package mode only) Flags passed verbatim to `go list`.\n\n- `-mock_names`: A list of custom names for generated mocks. This is specified\n  as a comma-separated list of elements of the form\n  `Repository=MockSensorRepository,Endpoint=MockSensorEndpoint`, where\n  `Repository` is the interface name and `MockSensorRepository` is the desired\n  mock name (mock factory method and mock recorder will be named after the mock).\n  If one of the interfaces has no custom name specified, then default naming\n  convention will be used.\n\n- `-self_package`: The full package import path for the generated code. The\n  purpose of this flag is to prevent import cycles in the generated code by\n  trying to include its own package. This can happen if the mock's package is\n  set to one of its inputs (usually the main one) and the output is stdio so\n  mockgen cannot detect the final output package. Setting this flag will then\n  tell mockgen which import to exclude.\n\n- `-copyright_file`: Copyright file used to add copyright header to the resulting source code.\n\n- `-debug_parser`: Print out parser results only.\n\n- `-write_package_comment`: Writes package documentation comment (godoc) if true. (default true)\n\n- `-write_generate_directive`: Add //go:generate directive to regenerate the mock. (default false)\n\n- `-write_source_comment`: Writes original file (source mode) or interface names (package mode) comment if true. (default true)\n\n- `-typed`: Generate Type-safe 'Return', 'Do', 'DoAndReturn' function. (default false)\n\n- `-exclude_interfaces`: Comma-separated names of interfaces to be excluded\n\nFor an example of the use of `mockgen`, see the `sample/` directory. In simple\ncases, you will need only the `-source` flag.\n\n## Building Mocks\n\n```go\ntype Foo interface {\n  Bar(x int) int\n}\n\nfunc SUT(f Foo) {\n // ...\n}\n\n```\n\n```go\nfunc TestFoo(t *testing.T) {\n  ctrl := gomock.NewController(t)\n\n  m := NewMockFoo(ctrl)\n\n  // Asserts that the first and only call to Bar() is passed 99.\n  // Anything else will fail.\n  m.\n    EXPECT().\n    Bar(gomock.Eq(99)).\n    Return(101)\n\n  SUT(m)\n}\n```\n\n## Building Stubs\n\n```go\ntype Foo interface {\n  Bar(x int) int\n}\n\nfunc SUT(f Foo) {\n // ...\n}\n\n```\n\n```go\nfunc TestFoo(t *testing.T) {\n  ctrl := gomock.NewController(t)\n\n  m := NewMockFoo(ctrl)\n\n  // Does not make any assertions. Executes the anonymous functions and returns\n  // its result when Bar is invoked with 99.\n  m.\n    EXPECT().\n    Bar(gomock.Eq(99)).\n    DoAndReturn(func(_ int) int {\n      time.Sleep(1*time.Second)\n      return 101\n    }).\n    AnyTimes()\n\n  // Does not make any assertions. Returns 103 when Bar is invoked with 101.\n  m.\n    EXPECT().\n    Bar(gomock.Eq(101)).\n    Return(103).\n    AnyTimes()\n\n  SUT(m)\n}\n```\n\n## Modifying Failure Messages\n\nWhen a matcher reports a failure, it prints the received (`Got`) vs the\nexpected (`Want`) value.\n\n```shell\nGot: [3]\nWant: is equal to 2\nExpected call at user_test.go:33 doesn't match the argument at index 1.\nGot: [0 1 1 2 3]\nWant: is equal to 1\n```\n\n### Modifying `Want`\n\nThe `Want` value comes from the matcher's `String()` method. If the matcher's\ndefault output doesn't meet your needs, then it can be modified as follows:\n\n```go\ngomock.WantFormatter(\n  gomock.StringerFunc(func() string { return \"is equal to fifteen\" }),\n  gomock.Eq(15),\n)\n```\n\nThis modifies the `gomock.Eq(15)` matcher's output for `Want:` from `is equal\nto 15` to `is equal to fifteen`.\n\n### Modifying `Got`\n\nThe `Got` value comes from the object's `String()` method if it is available.\nIn some cases the output of an object is difficult to read (e.g., `[]byte`) and\nit would be helpful for the test to print it differently. The following\nmodifies how the `Got` value is formatted:\n\n```go\ngomock.GotFormatterAdapter(\n  gomock.GotFormatterFunc(func(i any) string {\n    // Leading 0s\n    return fmt.Sprintf(\"%02d\", i)\n  }),\n  gomock.Eq(15),\n)\n```\n\nIf the received value is `3`, then it will be printed as `03`.\n\n[golang]:              http://go.dev/\n[ci-badge]:            https://github.com/uber-go/mock/actions/workflows/test.yaml/badge.svg\n[ci-runs]:             https://github.com/uber-go/mock/actions\n[reference-badge]:     https://pkg.go.dev/badge/go.uber.org/mock.svg\n[reference]:           https://pkg.go.dev/go.uber.org/mock\n"
        },
        {
          "name": "ci",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.3583984375,
          "content": "module go.uber.org/mock\n\ngo 1.22\n\nrequire (\n\tgithub.com/stretchr/testify v1.9.0\n\tgolang.org/x/mod v0.18.0\n\tgolang.org/x/tools v0.22.0\n)\n\nrequire (\n\tgithub.com/davecgh/go-spew v1.1.1 // indirect\n\tgithub.com/pmezard/go-difflib v1.0.0 // indirect\n\tgithub.com/yuin/goldmark v1.4.13 // indirect\n\tgolang.org/x/sync v0.7.0 // indirect\n\tgopkg.in/yaml.v3 v3.0.1 // indirect\n)\n"
        },
        {
          "name": "go.sum",
          "type": "blob",
          "size": 1.4775390625,
          "content": "github.com/davecgh/go-spew v1.1.1 h1:vj9j/u1bqnvCEfJOwUhtlOARqs3+rkHYY13jYWTU97c=\ngithub.com/davecgh/go-spew v1.1.1/go.mod h1:J7Y8YcW2NihsgmVo/mv3lAwl/skON4iLHjSsI+c5H38=\ngithub.com/pmezard/go-difflib v1.0.0 h1:4DBwDE0NGyQoBHbLQYPwSUPoCMWR5BEzIk/f1lZbAQM=\ngithub.com/pmezard/go-difflib v1.0.0/go.mod h1:iKH77koFhYxTK1pcRnkKkqfTogsbg7gZNVY4sRDYZ/4=\ngithub.com/stretchr/testify v1.9.0 h1:HtqpIVDClZ4nwg75+f6Lvsy/wHu+3BoSGCbBAcpTsTg=\ngithub.com/stretchr/testify v1.9.0/go.mod h1:r2ic/lqez/lEtzL7wO/rwa5dbSLXVDPFyf8C91i36aY=\ngithub.com/yuin/goldmark v1.4.13 h1:fVcFKWvrslecOb/tg+Cc05dkeYx540o0FuFt3nUVDoE=\ngithub.com/yuin/goldmark v1.4.13/go.mod h1:6yULJ656Px+3vBD8DxQVa3kxgyrAnzto9xy5taEt/CY=\ngolang.org/x/mod v0.18.0 h1:5+9lSbEzPSdWkH32vYPBwEpX8KwDbM52Ud9xBUvNlb0=\ngolang.org/x/mod v0.18.0/go.mod h1:hTbmBsO62+eylJbnUtE2MGJUyE7QWk4xUqPFrRgJ+7c=\ngolang.org/x/sync v0.7.0 h1:YsImfSBoP9QPYL0xyKJPq0gcaJdG3rInoqxTWbfQu9M=\ngolang.org/x/sync v0.7.0/go.mod h1:Czt+wKu1gCyEFDUtn0jG5QVvpJ6rzVqr5aXyt9drQfk=\ngolang.org/x/tools v0.22.0 h1:gqSGLZqv+AI9lIQzniJ0nZDRG5GBPsSi+DRNHWNz6yA=\ngolang.org/x/tools v0.22.0/go.mod h1:aCwcsjqvq7Yqt6TNyX7QMU2enbQ/Gt0bo6krSeEri+c=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405 h1:yhCVgyC4o1eVCa2tZl7eS0r+SDo693bJlVdllGtEeKM=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405/go.mod h1:Co6ibVJAznAaIkqp8huTwlJQCZ016jof/cbN4VW5Yz0=\ngopkg.in/yaml.v3 v3.0.1 h1:fxVm/GzAzEWqLHuvctI91KS9hhNmmWOoWu0XTYJS7CA=\ngopkg.in/yaml.v3 v3.0.1/go.mod h1:K4uyk7z7BCEPqu6E+C64Yfv1cQ7kz7rIZviUmN+EgEM=\n"
        },
        {
          "name": "gomock",
          "type": "tree",
          "content": null
        },
        {
          "name": "mockgen",
          "type": "tree",
          "content": null
        },
        {
          "name": "sample",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}