{
  "metadata": {
    "timestamp": 1736567154267,
    "page": 751,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjc2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "awslabs/amazon-ecr-credential-helper",
      "stars": 2531,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".codebuild",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0341796875,
          "content": "/bin/\nGITCOMMIT_SHA\n*.tar.gz\n*.tar\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 3.9287109375,
          "content": "# 0.9.0\n* Enhancement - Added support for environment variable `AWS_ECR_IGNORE_CREDS_STORAGE=true` to ignore ADD and DELETE requests. This makes tools that try to `docker login` work with registries managed the amazon-ecr-credential-helper. ([#102](https://github.com/awslabs/amazon-ecr-credential-helper/issues/102) and [#847](https://github.com/awslabs/amazon-ecr-credential-helper/pull/847))\n* Enhancement - Updated ECR pattern for new isolated regions. ([#850](https://github.com/awslabs/amazon-ecr-credential-helper/pull/850))\n* Upgraded dependencies.\n\n# 0.8.0\n* Enhancement - Updated ECR pattern to match C2S environments. ([#433](https://github.com/awslabs/amazon-ecr-credential-helper/issues/433))\n* Feature (Experimental) - Added support for building Windows ARM credential helper binaries. ([#795](https://github.com/awslabs/amazon-ecr-credential-helper/issues/795))\n\n# 0.7.1\n\n**Note: v0.7.1 is functionally equivalent to v0.7.0. We have decided to create a duplicate release to reflect a more accurate changelog, since our v0.7.0 release did not contain\nany direct/indirect security patches.**\n\n* Feature - Allow callers to set log output. ([#309](https://github.com/awslabs/amazon-ecr-credential-helper/pull/309) and [#312](https://github.com/awslabs/amazon-ecr-credential-helper/pull/312))\n* Upgrade dependencies for bug fixes.\n  \n# 0.7.0\n\n* Feature - Allow callers to set log output. ([#309](https://github.com/awslabs/amazon-ecr-credential-helper/pull/309) and [#312](https://github.com/awslabs/amazon-ecr-credential-helper/pull/312))\n* Upgrade dependencies for bug fixes and security patches. \n\n# 0.6.0\n\n* Feature - Added support for [AWS SSO](https://aws.amazon.com/single-sign-on/) ([#229](https://github.com/awslabs/amazon-ecr-credential-helper/issues/229))\n* Feature - Added support to assume roles via EC2 instance metadata. ([#282](https://github.com/awslabs/amazon-ecr-credential-helper/issues/282))\n* Feature - Added support for [Apple Silicon](https://go.dev/doc/go1.16#darwin) ([#291](https://github.com/awslabs/amazon-ecr-credential-helper/pull/291))\n* Enhancement - The AWS shared config file (`~/.aws/config`) is now always enabled. (`AWS_SDK_LOAD_CONFIG` environment variable is no longer supported) ([#282](https://github.com/awslabs/amazon-ecr-credential-helper/issues/282))\n\n# 0.5.0\n\n* Feature - Added support for [ECR Public](https://gallery.ecr.aws) ([#253](https://github.com/awslabs/amazon-ecr-credential-helper/pull/253))\n* Feature - Added support for [EC2 IMDSv2](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/configuring-instance-metadata-service.html) ([#240](https://github.com/awslabs/amazon-ecr-credential-helper/pull/240))\n* Enhancement - The AWS shared config file (`~/.aws/config`) is now enabled by default.  This can be disabled by setting the environment variable `AWS_SDK_LOAD_CONFIG` to `false` ([#201](https://github.com/awslabs/amazon-ecr-credential-helper/pull/201))\n* Bug - Fixed an issue where output from a `credential_process` was sometimes too big for the default buffer ([#240](https://github.com/awslabs/amazon-ecr-credential-helper/pull/240))\n\n# 0.4.0\n\n* Feature - Added support for chaining assumed roles in the shared config file (`~/.aws/config`) defined by `source_profile` and `credential_source` ([#177](https://github.com/awslabs/amazon-ecr-credential-helper/pull/177))\n* Feature - Added support for Web Identities and [IAM Roles for Service Accounts (IRSA)](https://docs.aws.amazon.com/eks/latest/userguide/iam-roles-for-service-accounts.html) with Kubernetes ([#183](https://github.com/awslabs/amazon-ecr-credential-helper/pull/183))\n* Bug - Fixed the `make docker` target when the credential helper git repository is used as a git submodule ([#184](https://github.com/awslabs/amazon-ecr-credential-helper/issues/184))\n\n# 0.3.1\n\n* Bug - Log directory is now automatically created when the helper runs\n\n# 0.3.0\n\n* Feature - Added support for PrivateLink endpoints\n\n# 0.2.0\n\n* Feature - Added support for FIPS endpoints\n\n# 0.1.0\n\nInitial release\n\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 0.3037109375,
          "content": "## Code of Conduct\nThis project has adopted the [Amazon Open Source Code of Conduct](https://aws.github.io/code-of-conduct). \nFor more information see the [Code of Conduct FAQ](https://aws.github.io/code-of-conduct-faq) or contact \nopensource-codeofconduct@amazon.com with any additional questions or comments.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.5537109375,
          "content": "# Contributing Guidelines\n\nThank you for your interest in contributing to our project. Whether it's a bug report, new feature, correction, or additional \ndocumentation, we greatly value feedback and contributions from our community.\n\nPlease read through this document before submitting any issues or pull requests to ensure we have all the necessary \ninformation to effectively respond to your bug report or contribution.\n\n\n## Reporting Bugs/Feature Requests\n\nWe welcome you to use the GitHub issue tracker to report bugs or suggest features.\n\nWhen filing an issue, please check [existing open](https://github.com/awslabs/amazon-ecr-credential-helper/issues), or [recently closed](https://github.com/awslabs/amazon-ecr-credential-helper/issues?utf8=%E2%9C%93&q=is%3Aissue%20is%3Aclosed%20), issues to make sure somebody else hasn't already \nreported the issue. Please try to include as much information as you can. Details like these are incredibly useful:\n\n* A reproducible test case or series of steps\n* The version of our code being used\n* Any modifications you've made relevant to the bug\n* Anything unusual about your environment or deployment\n\n\n## Contributing via Pull Requests\nContributions via pull requests are much appreciated. Before sending us a pull request, please ensure that:\n\n1. You are working against the latest source on the *master* branch.\n2. You check existing open, and recently merged, pull requests to make sure someone else hasn't addressed the problem already.\n3. You open an issue to discuss any significant work - we would hate for your time to be wasted.\n\nTo send us a pull request, please:\n\n1. Fork the repository.\n2. Modify the source; please focus on the specific change you are contributing. If you also reformat all the code, it will be hard for us to focus on your change.\n3. Ensure local tests pass.\n4. Commit to your fork using clear commit messages.\n5. Send us a pull request, answering any default questions in the pull request interface.\n6. Pay attention to any automated CI failures reported in the pull request, and stay involved in the conversation.\n\nGitHub provides additional document on [forking a repository](https://help.github.com/articles/fork-a-repo/) and \n[creating a pull request](https://help.github.com/articles/creating-a-pull-request/).\n\n\n## Finding contributions to work on\nLooking at the existing issues is a great way to find something to contribute on. As our projects, by default, use the default GitHub issue labels ((enhancement/bug/duplicate/help wanted/invalid/question/wontfix), looking at any ['help wanted'](https://github.com/awslabs/amazon-ecr-credential-helper/labels/help%20wanted) issues is a great place to start. \n\n\n## Code of Conduct\nThis project has adopted the [Amazon Open Source Code of Conduct](https://aws.github.io/code-of-conduct). \nFor more information see the [Code of Conduct FAQ](https://aws.github.io/code-of-conduct-faq) or contact \nopensource-codeofconduct@amazon.com with any additional questions or comments.\n\n\n## Security issue notifications\nIf you discover a potential security issue in this project we ask that you notify AWS/Amazon Security via our [vulnerability reporting page](http://aws.amazon.com/security/vulnerability-reporting/). Please do **not** create a public github issue.\n\n\n## Licensing\n\nSee the [LICENSE](https://github.com/awslabs/amazon-ecr-credential-helper/blob/master/LICENSE) file for our project's licensing. We will ask you to confirm the licensing of your contribution.\n\nWe may ask you to sign a [Contributor License Agreement (CLA)](http://en.wikipedia.org/wiki/Contributor_License_Agreement) for larger changes.\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.7490234375,
          "content": "# Copyright Amazon.com, Inc. or its affiliates. All Rights Reserved.\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\"). You\n# may not use this file except in compliance with the License. A copy of\n# the License is located at\n#\n# \thttp://aws.amazon.com/apache2.0/\n#\n# or in the \"license\" file accompanying this file. This file is\n# distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF\n# ANY KIND, either express or implied. See the License for the specific\n# language governing permissions and limitations under the License.\n\nFROM public.ecr.aws/docker/library/golang:1.23-alpine\n\nWORKDIR /go/src/github.com/awslabs/amazon-ecr-credential-helper\n\nCOPY ./scripts/container_init.sh /setup/container_init.sh\n\nRUN /setup/container_init.sh\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 10.298828125,
          "content": "Apache License\n\nVersion 2.0, January 2004\n\nhttp://www.apache.org/licenses/\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n1. Definitions.\n\"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.\n\"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.\n\"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.\n\"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\n\"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.\n2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.\n3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.\n4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:\n1. You must give any other recipients of the Work or Derivative Works a copy of this License; and\n2. You must cause any modified files to carry prominent notices stating that You changed the files; and\n3. You must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and\n4. If the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.\n\nYou may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License. \n5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.\n7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.\n8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.\n9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.\nEND OF TERMS AND CONDITIONS\nAPPENDIX: How to apply the Apache License to your work\nTo apply the Apache License to your work, attach the following boilerplate notice, with the fields enclosed by brackets \"[]\" replaced with your own identifying information. (Don't include the brackets!) The text should be enclosed in the appropriate comment syntax for the file format. We also recommend that a file or class name and description of purpose be included on the same \"printed page\" as the copyright notice for easier identification within third-party archives.\nCopyright [yyyy] [name of copyright owner]\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n***\n\nNote: Other license terms may apply to certain, identified software files contained within or distributed with the accompanying software if such terms are included in the directory containing the accompanying software. Such other license terms will then apply in lieu of the terms of the software license above.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 4.0615234375,
          "content": "# Copyright Amazon.com, Inc. or its affiliates. All Rights Reserved.\n#\n# Licensed under the Apache License, Version 2.0 (the \"License\"). You\n# may not use this file except in compliance with the License. A copy of\n# the License is located at\n#\n# \thttp://aws.amazon.com/apache2.0/\n#\n# or in the \"license\" file accompanying this file. This file is\n# distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF\n# ANY KIND, either express or implied. See the License for the specific\n# language governing permissions and limitations under the License.\n\nROOT := $(shell pwd)\n\nall: build\n\nSOURCEDIR=./ecr-login\nSOURCES := $(shell find $(SOURCEDIR) -name '*.go')\nVERSION := $(shell cat VERSION)\nGITFILES := $(shell test -d .git && find \".git/\" -type f)\nUID:=$(shell id -u)\nGID:=$(shell id -g)\n\nBINPATH:=$(abspath ./bin)\nBINARY_NAME=docker-credential-ecr-login\nLOCAL_BINARY=$(BINPATH)/local/$(BINARY_NAME)\n\nLINUX_AMD64_BINARY=$(BINPATH)/linux-amd64/$(BINARY_NAME)\nLINUX_ARM64_BINARY=$(BINPATH)/linux-arm64/$(BINARY_NAME)\nDARWIN_AMD64_BINARY=$(BINPATH)/darwin-amd64/$(BINARY_NAME)\nDARWIN_ARM64_BINARY=$(BINPATH)/darwin-arm64/$(BINARY_NAME)\nWINDOWS_AMD64_BINARY=$(BINPATH)/windows-amd64/$(BINARY_NAME).exe\nWINDOWS_ARM64_BINARY=$(BINPATH)/windows-arm64/$(BINARY_NAME).exe\n\n.PHONY: docker\ndocker: build-in-docker\n\n%-in-docker: GITCOMMIT_SHA\n\tdocker run --rm \\\n\t\t--user $(UID):$(GID) \\\n\t\t--env TARGET_GOOS=$(TARGET_GOOS) \\\n\t\t--env TARGET_GOARCH=$(TARGET_GOARCH) \\\n\t\t--volume $(ROOT):/go/src/github.com/awslabs/amazon-ecr-credential-helper \\\n\t\t$(shell docker build -q .) \\\n\t\tmake $(subst -in-docker,,$@)\n\n.PHONY: build\nbuild: $(LOCAL_BINARY)\n\n$(LOCAL_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_binary.sh $(BINPATH)/local $(VERSION) $(shell cat GITCOMMIT_SHA)\n\t@echo \"Built ecr-login\"\n\n.PHONY: test\ntest:\n\tcd $(SOURCEDIR) && go test -v -timeout 30s -short -cover ./...\n\n.PHONY: all-variants\nall-variants: linux-amd64 linux-arm64 darwin-amd64 darwin-arm64 windows-amd64 windows-arm64\n\n.PHONY: linux-amd64\nlinux-amd64: $(LINUX_AMD64_BINARY)\n$(LINUX_AMD64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh linux amd64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\n.PHONY: linux-arm64\nlinux-arm64: $(LINUX_ARM64_BINARY)\n$(LINUX_ARM64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh linux arm64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\n.PHONY: darwin-amd64\ndarwin-amd64: $(DARWIN_AMD64_BINARY)\n$(DARWIN_AMD64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh darwin amd64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\n.PHONY: darwin-arm64\ndarwin-arm64: $(DARWIN_ARM64_BINARY)\n$(DARWIN_ARM64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh darwin arm64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\n.PHONY: windows-amd64\nwindows-amd64: $(WINDOWS_AMD64_BINARY)\n$(WINDOWS_AMD64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh windows amd64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\t@mv $(BINPATH)/windows-amd64/$(BINARY_NAME) $(WINDOWS_AMD64_BINARY)\n\n.PHONY: windows-arm64\nwindows-arm64: $(WINDOWS_ARM64_BINARY)\n$(WINDOWS_ARM64_BINARY): $(SOURCES) GITCOMMIT_SHA\n\t./scripts/build_variant.sh windows arm64 $(VERSION) $(shell cat GITCOMMIT_SHA)\n\t@mv $(BINPATH)/windows-arm64/$(BINARY_NAME) $(WINDOWS_ARM64_BINARY)\n\nGITCOMMIT_SHA: $(GITFILES)\n\tgit rev-parse --short=7 HEAD > GITCOMMIT_SHA\n\nrelease.tar: GITCOMMIT_SHA\n\tgit archive -o release.tar HEAD\n\ttar -f release.tar --append GITCOMMIT_SHA --owner 0 --group 0\n\n.PHONY: release-tarball\nrelease-tarball: release.tar.gz\nrelease.tar.gz: release.tar\n\tgzip release.tar\n\n.PHONY: release-tarball-no-vendor\nrelease-tarball-no-vendor: release-novendor.tar.gz\nrelease-novendor.tar.gz: release.tar\n\tmv release.tar release-novendor.tar\n\ttar -f release-novendor.tar --wildcards --delete 'ecr-login/vendor/*'\n\tgzip release-novendor.tar\n\n.PHONY: gogenerate\ngogenerate:\n\t./scripts/gogenerate\n\n.PHONY: get-deps\nget-deps:\n\tgo install golang.org/x/tools/cmd/goimports@698251aaa532d49ac69d2c416b0241afb2f65ea5\n\n.PHONY: licenses\nlicenses:\n\t./scripts/build_third_party_licenses.sh\n\n.PHONY: clean\nclean:\n\t- rm -rf ./bin\n\t- rm -f GITCOMMIT_SHA\n\t- rm -f release.tar.gz\n\t- rm -f release-novendor.tar.gz\n"
        },
        {
          "name": "NOTICE",
          "type": "blob",
          "size": 0.0947265625,
          "content": "Amazon ECR Credential Helper\nCopyright Amazon.com, Inc. or its affiliates. All Rights Reserved. \n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 14.7294921875,
          "content": "# Amazon ECR Docker Credential Helper\n\n![Amazon ECR logo](docs/ecr.png \"Amazon ECR\")\n\n[![Build](https://github.com/awslabs/amazon-ecr-credential-helper/actions/workflows/build.yaml/badge.svg)](https://github.com/awslabs/amazon-ecr-credential-helper/actions/workflows/build.yaml)\n[![Go Report Card](https://goreportcard.com/badge/github.com/awslabs/amazon-ecr-credential-helper)](https://goreportcard.com/report/github.com/awslabs/amazon-ecr-credential-helper)\n[![latest packaged version(s)](https://repology.org/badge/latest-versions/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n\nThe Amazon ECR Docker Credential Helper is a\n[credential helper](https://github.com/docker/docker-credential-helpers)\nfor the Docker daemon that makes it easier to use\n[Amazon Elastic Container Registry](https://aws.amazon.com/ecr/).\n\n## Table of Contents\n  * [Prerequisites](#prerequisites)\n  * [Installing](#installing)\n    + [Amazon Linux 2023 (AL2023)](#amazon-linux-2023-al2023)\n    + [Amazon Linux 2 (AL2)](#amazon-linux-2-al2)\n    + [Mac OS](#mac-os)\n    + [Debian Buster (and future versions)](#debian-buster-and-future-versions)\n    + [Ubuntu 19.04 Disco Dingo and newer](#ubuntu-1904-disco-dingo-and-newer)\n    + [Arch Linux](#arch-linux)\n    + [Alpine Linux](#alpine-linux)\n    + [Windows](#windows)\n    + [From Source](#from-source)\n  * [Configuration](#configuration)\n    + [Docker](#docker)\n    + [AWS credentials](#aws-credentials)\n    + [Amazon ECR Docker Credential Helper](#amazon-ecr-docker-credential-helper-1)\n  * [Usage](#usage)\n  * [Troubleshooting](#troubleshooting)\n  * [Security disclosures](#security-disclosures)\n  * [License](#license)\n\n## Prerequisites\n\nYou must have at least Docker 1.11 installed on your system.\n\nYou also must have AWS credentials available.  See the [AWS credentials section](#aws-credentials) for details on how to\nuse different AWS credentials.\n\n## Installing\n\n### Amazon Linux 2023 (AL2023)\nYou can install the Amazon ECR Credential Helper from the Amazon Linux 2023 repositories.\n\n```bash\n$ sudo dnf install -y amazon-ecr-credential-helper\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Amazon Linux 2 (AL2)\nYou can install the Amazon ECR Credential Helper from the [`docker` or `ecs`\nextras](https://docs.aws.amazon.com/linux/al2/ug/al2-extras.html).\n\n```bash\n$ sudo amazon-linux-extras enable docker\n$ sudo yum install amazon-ecr-credential-helper\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Mac OS\nA community-maintained Homebrew formula is available in the core tap.\n\n[![Homebrew package](https://repology.org/badge/version-for-repo/homebrew/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n\n```bash\n$ brew install docker-credential-helper-ecr\n```\n\nOn macOS, another community-maintained installation method is to use MacPorts.\n\n[![MacPorts package](https://repology.org/badge/version-for-repo/macports/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n\n```bash\n$ sudo port install docker-credential-helper-ecr\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Debian Buster (and future versions)\nYou can install the Amazon ECR Credential Helper from the Debian Buster\narchives.  This package will also be included in future releases of Debian.\n\n[![Debian 10 package](https://repology.org/badge/version-for-repo/debian_10/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n[![Debian 11 package](https://repology.org/badge/version-for-repo/debian_11/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n[![Debian 12 package](https://repology.org/badge/version-for-repo/debian_12/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n[![Debian Unstable package](https://repology.org/badge/version-for-repo/debian_unstable/amazon-ecr-credential-helper.svg)](https://repology.org/metapackage/amazon-ecr-credential-helper/versions)\n\n```bash\n$ sudo apt update\n$ sudo apt install amazon-ecr-credential-helper\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Ubuntu 19.04 Disco Dingo and newer\nYou can install the Amazon ECR Credential Helper from the Ubuntu 19.04 Disco\nDingo (and newer) archives.\n\n[![Ubuntu 20.04 package](https://repology.org/badge/version-for-repo/ubuntu_20_04/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n[![Ubuntu 22.04 package](https://repology.org/badge/version-for-repo/ubuntu_22_04/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n\n```bash\n$ sudo apt update\n$ sudo apt install amazon-ecr-credential-helper\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Arch Linux\nA community-maintained package is available in the Arch User Repository.\n\n[![AUR package](https://repology.org/badge/version-for-repo/aur/amazon-ecr-credential-helper.svg)](https://repology.org/metapackage/amazon-ecr-credential-helper/versions)\n\n```bash\n$ git clone https://aur.archlinux.org/amazon-ecr-credential-helper.git\n$ cd amazon-ecr-credential-helper\n$ makepkg -si\n```\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Alpine Linux\nA community-maintained package is available in the [Alpine Linux aports Repository](https://pkgs.alpinelinux.org/packages?name=docker-credential-ecr-login).\n\n[![Alpine Linux Edge package](https://repology.org/badge/version-for-repo/alpine_edge/amazon-ecr-credential-helper.svg)](https://repology.org/project/amazon-ecr-credential-helper/versions)\n\n```bash\n$ apk add docker-credential-ecr-login\n```\n> [!NOTE] \n> Badge only shows edge, check [repository](https://pkgs.alpinelinux.org/packages?name=docker-credential-ecr-login) for stable releases or add `--repository=http://dl-cdn.alpinelinux.org/alpine/edge/community`\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n### Windows\nWindows executables are available via [GitHub releases](https://github.com/awslabs/amazon-ecr-credential-helper/releases).\n\n> [!NOTE]\n> Windows ARM support is considered [experimental](#experimental-features).\n>\n> See https://github.com/awslabs/amazon-ecr-credential-helper/issues/795\n\n### From Source\nTo build and install the Amazon ECR Docker Credential Helper, we suggest Go\n1.19 or later, `git` and `make` installed on your system.\n\nIf you just installed Go, make sure you also have added it to your PATH or\nEnvironment Vars (Windows). For example:\n\n```\n$ export GOPATH=$HOME/go\n$ export PATH=$PATH:$GOPATH/bin\n```\n\nOr in Windows:\n\n```\nsetx GOPATH %USERPROFILE%\\go\n<your existing PATH definitions>;%USERPROFILE%\\go\\bin\n```\n\nIf you haven't defined the PATH, the command below will fail silently, and\nrunning `docker-credential-ecr-login` will output: `command not found`\n\nYou can install this via the `go` command line tool.\n\nTo install run:\n\n```\ngo install github.com/awslabs/amazon-ecr-credential-helper/ecr-login/cli/docker-credential-ecr-login@latest\n```\n\n> [!WARNING]\n> Disclaimer: the [Dockerfile](./Dockerfile) in this repository is used to test cross-compilation of the\n> Amazon ECR credential helper binaries in GitHub Actions CI and as a developer utility for building locally from source.\n> It is a reference implementation and not security hardened for building and running production containers.\n\nIf you already have Docker environment, just clone this repository anywhere\nand run `make build-in-docker`. This command builds the binary with Go inside the Docker\ncontainer and output it to local directory.\n\nWith `TARGET_GOOS` environment variable, you can also cross compile the binary.\n\nOnce you have installed the credential helper, see the\n[Configuration section](#configuration) for instructions on how to configure\nDocker to work with the helper.\n\n## Configuration\n\n### Docker\n\nThere is no need to use `docker login` or `docker logout`.\n\nPlace the `docker-credential-ecr-login` binary on your `PATH` and set the\ncontents of your `~/.docker/config.json` file to be:\n\n```json\n{\n\t\"credsStore\": \"ecr-login\"\n}\n```\nThis configures the Docker daemon to use the credential helper for all Amazon\nECR registries.\n\nWith Docker 1.13.0 or greater, you can configure Docker to use different\ncredential helpers for different ECR registries. To use this credential helper for\na specific ECR registry, create a `credHelpers` section with the URI of your\nECR registry:\n\n```json\n{\n\t\"credHelpers\": {\n\t\t\"public.ecr.aws\": \"ecr-login\",\n\t\t\"<aws_account_id>.dkr.ecr.<region>.amazonaws.com\": \"ecr-login\"\n\t}\n}\n```\n\nThis is useful if you use `docker` to operate on registries that use different\nauthentication credentials.\n\nIf you need to authenticate with multiple registries, including non-ECR registries, you can combine credHelpers with auths. For example:\n```json\n{\n  \"credHelpers\": {\n    \"<aws_account_id>.dkr.ecr.<region>.amazonaws.com\": \"ecr-login\"\n  },\n  \"auths\": {\n      \"ghcr.io\": {\n        \"auth\": [GITHUB_PERSONAL_ACCESS_TOKEN]\n      },\n      \"https://index.docker.io/v1/\": {\n        \"auth\": [docker.io-auth-token]\n      },\n      \"registry.gitlab.com\": {\n        \"auth\": [gitlab-auth-token]\n      }\n\t}\n}\n```\n\n### AWS credentials\n\nThe Amazon ECR Docker Credential Helper allows you to use AWS credentials stored in different locations.  Standard ones\ninclude:\n\n* The shared credentials file (`~/.aws/credentials`)\n* The `AWS_ACCESS_KEY_ID` and `AWS_SECRET_ACCESS_KEY` environment variables\n* An [IAM role for an Amazon ECS task](https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-iam-roles.html)\n* An [IAM role for Amazon EC2](http://docs.aws.amazon.com/AWSEC2/latest/UserGuide/iam-roles-for-amazon-ec2.html)\n\nTo use credentials associated with a different named profile in the shared credentials file (`~/.aws/credentials`), you\nmay set the `AWS_PROFILE` environment variable.\n\nThe Amazon ECR Docker Credential Helper reads and supports some configuration options specified in the AWS\nshared configuration file (`~/.aws/config`).  To disable these options, you must set the `AWS_SDK_LOAD_CONFIG` environment\nvariable to `false`.  The supported options include:\n\n* Assumed roles specified with `role_arn` and `source_profile`\n* External credential processes specified with `credential_process`\n* Web Identities like [IAM Roles for Service Accounts in\n  Kubernetes](https://docs.aws.amazon.com/eks/latest/userguide/iam-roles-for-service-accounts.html) (*Note: Kubernetes\n  users using containers with a non-root user may encounter permission issues described in [this\n  bug](https://github.com/kubernetes-sigs/external-dns/pull/1185) and may need to employ a workaround adjusting the\n  Kubernetes `securityContext`.*)\n\nThe Amazon ECR Docker Credential Helper uses the same credentials as the AWS\nCLI and the AWS SDKs. For more information about configuring AWS credentials,\nsee\n[Configuration and Credential Files](http://docs.aws.amazon.com/cli/latest/userguide/cli-configure-files.html)\nin the *AWS Command Line Interface User Guide*.\n\nThe credentials must have a policy applied that\n[allows access to Amazon ECR](https://docs.aws.amazon.com/AmazonECR/latest/userguide/security-iam-awsmanpol.html).\n\n### Amazon ECR Docker Credential Helper\n\n| Environment Variable         | Sample Value  | Description                                                        |\n| ---------------------------- | ------------- | ------------------------------------------------------------------ |\n| AWS_ECR_DISABLE_CACHE        | true          | Disables the local file auth cache if set to a non-empty value     |\n| AWS_ECR_CACHE_DIR            | ~/.ecr        | Specifies the local file auth cache directory location             |\n| AWS_ECR_IGNORE_CREDS_STORAGE | true          | Ignore calls to docker login or logout and pretend they succeeded  |\n\n## Usage\n\n`docker pull 123456789012.dkr.ecr.us-west-2.amazonaws.com/my-repository:my-tag`\n\n`docker push 123456789012.dkr.ecr.us-west-2.amazonaws.com/my-repository:my-tag`\n\n`docker pull public.ecr.aws/amazonlinux/amazonlinux:latest`\n\nIf you have configured additional profiles for use with the AWS CLI, you can use\nthose profiles by specifying the `AWS_PROFILE` environment variable when invoking `docker`.\nFor example:\n\n`AWS_PROFILE=myprofile docker pull 123456789012.dkr.ecr.us-west-2.amazonaws.com/my-repository:my-tag`\n\nThere is no need to use `docker login` or `docker logout`.\n\n## Troubleshooting\n\nIf you have previously authenticated with an ECR repository by using the `docker login` command manually\nthen Docker may have stored an auth token which has since expired.\nDocker will continue to attempt to use that cached auth token\ninstead of utilizing the credential helper. You must explicitly remove the previously cached expired\ntoken using `docker logout 123456789012.dkr.ecr.us-west-2.amazonaws.com/my-repository`. After that\nDocker will start utilizing the ECR credential helper to fetch fresh credentials, and you will no longer\nneed to use `docker login` or `docker logout`.\n\nLogs from the Amazon ECR Docker Credential Helper are stored in `~/.ecr/log`.\n\nFor more information about Amazon ECR, see the the\n[Amazon Elastic Container Registry User Guide](http://docs.aws.amazon.com/AmazonECR/latest/userguide/what-is-ecr.html).\n\n## Experimental features\n\nFeatures marked as experimental are optionally made available to users to test and provide feedback.\n\nIf you test any experimental feaures, you can give feedback via the feature's tracking issue regarding:\n* Your experience with the feature\n* Issues or problems\n* Suggested improvements\n\nExperimental features are incomplete in design and implementation. Backwards incompatible\nchanges may be introduced at any time or support dropped entirely. Therefore experimental \nfeatures are **not recommended** for use in production environments.\n\n## Security disclosures\n\nIf you think you’ve found a potential security issue, please do not post it in the Issues.  Instead, please follow the instructions [here](https://aws.amazon.com/security/vulnerability-reporting/) or [email AWS security directly](mailto:aws-security@amazon.com).\n\n## License\n\nThe Amazon ECR Docker Credential Helper is licensed under the Apache 2.0\nLicense.\n"
        },
        {
          "name": "THIRD-PARTY-LICENSES",
          "type": "blob",
          "size": 28.3388671875,
          "content": "** github.com/aws/aws-sdk-go-v2; version v1.30.5 - https://github.com/aws/aws-sdk-go-v2/blob/v1.30.5/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/config; version v1.27.33 - https://github.com/aws/aws-sdk-go-v2/blob/config/v1.27.33/config/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/credentials; version v1.17.32 - https://github.com/aws/aws-sdk-go-v2/blob/credentials/v1.17.32/credentials/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/feature/ec2/imds; version v1.16.13 - https://github.com/aws/aws-sdk-go-v2/blob/feature/ec2/imds/v1.16.13/feature/ec2/imds/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/internal/configsources; version v1.3.17 - https://github.com/aws/aws-sdk-go-v2/blob/internal/configsources/v1.3.17/internal/configsources/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/internal/endpoints/v2; version v2.6.17 - https://github.com/aws/aws-sdk-go-v2/blob/internal/endpoints/v2.6.17/internal/endpoints/v2/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/internal/ini; version v1.8.1 - https://github.com/aws/aws-sdk-go-v2/blob/internal/ini/v1.8.1/internal/ini/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/ecr; version v1.32.4 - https://github.com/aws/aws-sdk-go-v2/blob/service/ecr/v1.32.4/service/ecr/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/ecrpublic; version v1.25.6 - https://github.com/aws/aws-sdk-go-v2/blob/service/ecrpublic/v1.25.6/service/ecrpublic/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/internal/accept-encoding; version v1.11.4 - https://github.com/aws/aws-sdk-go-v2/blob/service/internal/accept-encoding/v1.11.4/service/internal/accept-encoding/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/internal/presigned-url; version v1.11.19 - https://github.com/aws/aws-sdk-go-v2/blob/service/internal/presigned-url/v1.11.19/service/internal/presigned-url/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/sso; version v1.22.7 - https://github.com/aws/aws-sdk-go-v2/blob/service/sso/v1.22.7/service/sso/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/ssooidc; version v1.26.7 - https://github.com/aws/aws-sdk-go-v2/blob/service/ssooidc/v1.26.7/service/ssooidc/LICENSE.txt\n** github.com/aws/aws-sdk-go-v2/service/sts; version v1.30.7 - https://github.com/aws/aws-sdk-go-v2/blob/service/sts/v1.30.7/service/sts/LICENSE.txt\n** github.com/aws/smithy-go; version v1.20.4 - https://github.com/aws/smithy-go/blob/v1.20.4/LICENSE\n** github.com/jmespath/go-jmespath; version v0.4.0 - https://github.com/jmespath/go-jmespath/blob/v0.4.0/LICENSE\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n--------------------------------------------------------------------------------\n** github.com/aws/aws-sdk-go-v2/internal/sync/singleflight; version v1.30.5 - https://github.com/aws/aws-sdk-go-v2/blob/v1.30.5/internal/sync/singleflight/LICENSE\n\nCopyright (c) 2009 The Go Authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n\n--------------------------------------------------------------------------------\n** github.com/aws/smithy-go/internal/sync/singleflight; version v1.20.4 - https://github.com/aws/smithy-go/blob/v1.20.4/internal/sync/singleflight/LICENSE\n\nCopyright (c) 2009 The Go Authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n\n--------------------------------------------------------------------------------\n** github.com/davecgh/go-spew/spew; version v1.1.1 - https://github.com/davecgh/go-spew/blob/v1.1.1/LICENSE\n\nISC License\n\nCopyright (c) 2012-2016 Dave Collins <dave@davec.name>\n\nPermission to use, copy, modify, and/or distribute this software for any\npurpose with or without fee is hereby granted, provided that the above\ncopyright notice and this permission notice appear in all copies.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\" AND THE AUTHOR DISCLAIMS ALL WARRANTIES\nWITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\nANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF\nOR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n\n--------------------------------------------------------------------------------\n** github.com/docker/docker-credential-helpers/credentials; version v0.8.2 - https://github.com/docker/docker-credential-helpers/blob/v0.8.2/LICENSE\n\nCopyright (c) 2016 David Calavera\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\n--------------------------------------------------------------------------------\n** github.com/mitchellh/go-homedir; version v1.1.0 - https://github.com/mitchellh/go-homedir/blob/v1.1.0/LICENSE\n\nThe MIT License (MIT)\n\nCopyright (c) 2013 Mitchell Hashimoto\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n\n\n--------------------------------------------------------------------------------\n** github.com/pmezard/go-difflib/difflib; version v1.0.0 - https://github.com/pmezard/go-difflib/blob/v1.0.0/LICENSE\n\nCopyright (c) 2013, Patrick Mezard\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n    Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n    Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n    The names of its contributors may not be used to endorse or promote\nproducts derived from this software without specific prior written\npermission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\nIS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\nPARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nHOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\nTO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n--------------------------------------------------------------------------------\n** github.com/sirupsen/logrus; version v1.9.3 - https://github.com/sirupsen/logrus/blob/v1.9.3/LICENSE\n\nThe MIT License (MIT)\n\nCopyright (c) 2014 Simon Eskildsen\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n\n\n--------------------------------------------------------------------------------\n** github.com/stretchr/testify/assert; version v1.9.0 - https://github.com/stretchr/testify/blob/v1.9.0/LICENSE\n\nMIT License\n\nCopyright (c) 2012-2020 Mat Ryer, Tyler Bunnell and contributors.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\n--------------------------------------------------------------------------------\n** golang.org/x/sys/unix; version v0.15.0 - https://cs.opensource.google/go/x/sys/+/v0.15.0:LICENSE\n\nCopyright (c) 2009 The Go Authors. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n--------------------------------------------------------------------------------\n** gopkg.in/yaml.v3; version v3.0.1 - https://github.com/go-yaml/yaml/blob/v3.0.1/LICENSE\n\n\nThis project is covered by two different licenses: MIT and Apache.\n\n#### MIT License ####\n\nThe following files were ported to Go from C files of libyaml, and thus\nare still covered by their original MIT license, with the additional\ncopyright staring in 2011 when the project was ported over:\n\n    apic.go emitterc.go parserc.go readerc.go scannerc.go\n    writerc.go yamlh.go yamlprivateh.go\n\nCopyright (c) 2006-2010 Kirill Simonov\nCopyright (c) 2006-2011 Kirill Simonov\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies\nof the Software, and to permit persons to whom the Software is furnished to do\nso, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n### Apache License ###\n\nAll the remaining project files are covered by the Apache license:\n\nCopyright (c) 2011-2019 Canonical Ltd\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\n"
        },
        {
          "name": "VERSION",
          "type": "blob",
          "size": 0.005859375,
          "content": "0.9.0\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "ecr-login",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}