{
  "metadata": {
    "timestamp": 1736567200760,
    "page": 800,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "pksunkara/alpaca",
      "stars": 2454,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.173828125,
          "content": "alpaca/back-templates.rice-box.go\nexamples/*/php\nexamples/*/node\nexamples/*/ruby\nexamples/*/python\ntests\n*.pyc\nnode_modules\nvendor\ncomposer.*\n.goxc.local.json\ncoverage.out\nbuild\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.0810546875,
          "content": "language: go\n\ngo:\n  - 1.9.x\n  - 1.10.x\n  - 1.11.x\n\ninstall: make\nscript: make test\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 0.9287109375,
          "content": "## 0.2.1\n\nUsing Mozilla 2.0 license from now on.\n\nFeatures:\n\n - Support `authorization.header_prefix` for authorization headers (#6)\n - Can now make authentication compulsory using `authorizaiton.need_auth`\n - Default value is `false` for `response.formats.html`\n - Default value is `false` for `request.formats.form`\n - Allow API `base_url` to be an argument (#30)\n - Parameters needed for method URL can be defined in the method\n\nBugfixes:\n\n - Helpful error when missing language specific fields in `pkg.json`\n - Better building of binary (#22)\n - Python style fixes (#26)\n - Comments in generated code are now params/args aware\n - Fix bug with JSON parsing response in node.js\n - Ruby style fixes\n\n## 0.2.0\n\nFeatures:\n\n - Added Makefile (#7)\n - Added support for `no_verify_ssl` in **api.json** (#10)\n - Made `params` in **api.json** into an array of hashes (#12)\n\nBugfixes:\n\n - MakeStringArrayInterface and ArrayStringInterface supports nil (#14)\n"
        },
        {
          "name": "Godeps",
          "type": "blob",
          "size": 0.380859375,
          "content": "bitbucket.org/pkg/inflect            8961c3750a47b8c0b3e118d52513b97adf85a7e8\ngithub.com/kardianos/osext           efacde03154693404c65e7aa7d461ac9014acd0c\ngithub.com/GeertJohan/go.rice/rice   b4a18af231435326dd7995d2dd0f3ee31b81f212\ngithub.com/daaku/go.zipexe           a5fe2436ffcb3236e175e5149162b41cd28bd27d\ngithub.com/jessevdk/go-flags         5e118789801496c93ba210d34ef1f2ce5a9173bd\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 15.5478515625,
          "content": "Mozilla Public License, version 2.0\n\n1. Definitions\n\n1.1. \"Contributor\"\n\n     means each individual or legal entity that creates, contributes to the\n     creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n\n     means the combination of the Contributions of others (if any) used by a\n     Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n\n     means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n\n     means Source Code Form to which the initial Contributor has attached the\n     notice in Exhibit A, the Executable Form of such Source Code Form, and\n     Modifications of such Source Code Form, in each case including portions\n     thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n     means\n\n     a. that the initial Contributor has attached the notice described in\n        Exhibit B to the Covered Software; or\n\n     b. that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the terms of\n        a Secondary License.\n\n1.6. \"Executable Form\"\n\n     means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n\n     means a work that combines Covered Software with other material, in a\n     separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n\n     means this document.\n\n1.9. \"Licensable\"\n\n     means having the right to grant, to the maximum extent possible, whether\n     at the time of the initial grant or subsequently, any and all of the\n     rights conveyed by this License.\n\n1.10. \"Modifications\"\n\n     means any of the following:\n\n     a. any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered Software; or\n\n     b. any new file in Source Code Form that contains any Covered Software.\n\n1.11. \"Patent Claims\" of a Contributor\n\n      means any patent claim(s), including without limitation, method,\n      process, and apparatus claims, in any patent Licensable by such\n      Contributor that would be infringed, but for the grant of the License,\n      by the making, using, selling, offering for sale, having made, import,\n      or transfer of either its Contributions or its Contributor Version.\n\n1.12. \"Secondary License\"\n\n      means either the GNU General Public License, Version 2.0, the GNU Lesser\n      General Public License, Version 2.1, the GNU Affero General Public\n      License, Version 3.0, or any later versions of those licenses.\n\n1.13. \"Source Code Form\"\n\n      means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n\n      means an individual or a legal entity exercising rights under this\n      License. For legal entities, \"You\" includes any entity that controls, is\n      controlled by, or is under common control with You. For purposes of this\n      definition, \"control\" means (a) the power, direct or indirect, to cause\n      the direction or management of such entity, whether by contract or\n      otherwise, or (b) ownership of more than fifty percent (50%) of the\n      outstanding shares or beneficial ownership of such entity.\n\n\n2. License Grants and Conditions\n\n2.1. Grants\n\n     Each Contributor hereby grants You a world-wide, royalty-free,\n     non-exclusive license:\n\n     a. under intellectual property rights (other than patent or trademark)\n        Licensable by such Contributor to use, reproduce, make available,\n        modify, display, perform, distribute, and otherwise exploit its\n        Contributions, either on an unmodified basis, with Modifications, or\n        as part of a Larger Work; and\n\n     b. under Patent Claims of such Contributor to make, use, sell, offer for\n        sale, have made, import, and otherwise transfer either its\n        Contributions or its Contributor Version.\n\n2.2. Effective Date\n\n     The licenses granted in Section 2.1 with respect to any Contribution\n     become effective for each Contribution on the date the Contributor first\n     distributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\n     The licenses granted in this Section 2 are the only rights granted under\n     this License. No additional rights or licenses will be implied from the\n     distribution or licensing of Covered Software under this License.\n     Notwithstanding Section 2.1(b) above, no patent license is granted by a\n     Contributor:\n\n     a. for any code that a Contributor has removed from Covered Software; or\n\n     b. for infringements caused by: (i) Your and any other third party's\n        modifications of Covered Software, or (ii) the combination of its\n        Contributions with other software (except as part of its Contributor\n        Version); or\n\n     c. under Patent Claims infringed by Covered Software in the absence of\n        its Contributions.\n\n     This License does not grant any rights in the trademarks, service marks,\n     or logos of any Contributor (except as may be necessary to comply with\n     the notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\n     No Contributor makes additional grants as a result of Your choice to\n     distribute the Covered Software under a subsequent version of this\n     License (see Section 10.2) or under the terms of a Secondary License (if\n     permitted under the terms of Section 3.3).\n\n2.5. Representation\n\n     Each Contributor represents that the Contributor believes its\n     Contributions are its original creation(s) or it has sufficient rights to\n     grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\n     This License is not intended to limit any rights You have under\n     applicable copyright doctrines of fair use, fair dealing, or other\n     equivalents.\n\n2.7. Conditions\n\n     Sections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in\n     Section 2.1.\n\n\n3. Responsibilities\n\n3.1. Distribution of Source Form\n\n     All distribution of Covered Software in Source Code Form, including any\n     Modifications that You create or to which You contribute, must be under\n     the terms of this License. You must inform recipients that the Source\n     Code Form of the Covered Software is governed by the terms of this\n     License, and how they can obtain a copy of this License. You may not\n     attempt to alter or restrict the recipients' rights in the Source Code\n     Form.\n\n3.2. Distribution of Executable Form\n\n     If You distribute Covered Software in Executable Form then:\n\n     a. such Covered Software must also be made available in Source Code Form,\n        as described in Section 3.1, and You must inform recipients of the\n        Executable Form how they can obtain a copy of such Source Code Form by\n        reasonable means in a timely manner, at a charge no more than the cost\n        of distribution to the recipient; and\n\n     b. You may distribute such Executable Form under the terms of this\n        License, or sublicense it under different terms, provided that the\n        license for the Executable Form does not attempt to limit or alter the\n        recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\n     You may create and distribute a Larger Work under terms of Your choice,\n     provided that You also comply with the requirements of this License for\n     the Covered Software. If the Larger Work is a combination of Covered\n     Software with a work governed by one or more Secondary Licenses, and the\n     Covered Software is not Incompatible With Secondary Licenses, this\n     License permits You to additionally distribute such Covered Software\n     under the terms of such Secondary License(s), so that the recipient of\n     the Larger Work may, at their option, further distribute the Covered\n     Software under the terms of either this License or such Secondary\n     License(s).\n\n3.4. Notices\n\n     You may not remove or alter the substance of any license notices\n     (including copyright notices, patent notices, disclaimers of warranty, or\n     limitations of liability) contained within the Source Code Form of the\n     Covered Software, except that You may alter any license notices to the\n     extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\n     You may choose to offer, and to charge a fee for, warranty, support,\n     indemnity or liability obligations to one or more recipients of Covered\n     Software. However, You may do so only on Your own behalf, and not on\n     behalf of any Contributor. You must make it absolutely clear that any\n     such warranty, support, indemnity, or liability obligation is offered by\n     You alone, and You hereby agree to indemnify every Contributor for any\n     liability incurred by such Contributor as a result of warranty, support,\n     indemnity or liability terms You offer. You may include additional\n     disclaimers of warranty and limitations of liability specific to any\n     jurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n\n   If it is impossible for You to comply with any of the terms of this License\n   with respect to some or all of the Covered Software due to statute,\n   judicial order, or regulation then You must: (a) comply with the terms of\n   this License to the maximum extent possible; and (b) describe the\n   limitations and the code they affect. Such description must be placed in a\n   text file included with all distributions of the Covered Software under\n   this License. Except to the extent prohibited by statute or regulation,\n   such description must be sufficiently detailed for a recipient of ordinary\n   skill to be able to understand it.\n\n5. Termination\n\n5.1. The rights granted under this License will terminate automatically if You\n     fail to comply with any of its terms. However, if You become compliant,\n     then the rights granted under this License from a particular Contributor\n     are reinstated (a) provisionally, unless and until such Contributor\n     explicitly and finally terminates Your grants, and (b) on an ongoing\n     basis, if such Contributor fails to notify You of the non-compliance by\n     some reasonable means prior to 60 days after You have come back into\n     compliance. Moreover, Your grants from a particular Contributor are\n     reinstated on an ongoing basis if such Contributor notifies You of the\n     non-compliance by some reasonable means, this is the first time You have\n     received notice of non-compliance with this License from such\n     Contributor, and You become compliant prior to 30 days after Your receipt\n     of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\n     infringement claim (excluding declaratory judgment actions,\n     counter-claims, and cross-claims) alleging that a Contributor Version\n     directly or indirectly infringes any patent, then the rights granted to\n     You by any and all Contributors for the Covered Software under Section\n     2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all end user\n     license agreements (excluding distributors and resellers) which have been\n     validly granted by You or Your distributors under this License prior to\n     termination shall survive termination.\n\n6. Disclaimer of Warranty\n\n   Covered Software is provided under this License on an \"as is\" basis,\n   without warranty of any kind, either expressed, implied, or statutory,\n   including, without limitation, warranties that the Covered Software is free\n   of defects, merchantable, fit for a particular purpose or non-infringing.\n   The entire risk as to the quality and performance of the Covered Software\n   is with You. Should any Covered Software prove defective in any respect,\n   You (not any Contributor) assume the cost of any necessary servicing,\n   repair, or correction. This disclaimer of warranty constitutes an essential\n   part of this License. No use of  any Covered Software is authorized under\n   this License except under this disclaimer.\n\n7. Limitation of Liability\n\n   Under no circumstances and under no legal theory, whether tort (including\n   negligence), contract, or otherwise, shall any Contributor, or anyone who\n   distributes Covered Software as permitted above, be liable to You for any\n   direct, indirect, special, incidental, or consequential damages of any\n   character including, without limitation, damages for lost profits, loss of\n   goodwill, work stoppage, computer failure or malfunction, or any and all\n   other commercial damages or losses, even if such party shall have been\n   informed of the possibility of such damages. This limitation of liability\n   shall not apply to liability for death or personal injury resulting from\n   such party's negligence to the extent applicable law prohibits such\n   limitation. Some jurisdictions do not allow the exclusion or limitation of\n   incidental or consequential damages, so this exclusion and limitation may\n   not apply to You.\n\n8. Litigation\n\n   Any litigation relating to this License may be brought only in the courts\n   of a jurisdiction where the defendant maintains its principal place of\n   business and such litigation shall be governed by laws of that\n   jurisdiction, without reference to its conflict-of-law provisions. Nothing\n   in this Section shall prevent a party's ability to bring cross-claims or\n   counter-claims.\n\n9. Miscellaneous\n\n   This License represents the complete agreement concerning the subject\n   matter hereof. If any provision of this License is held to be\n   unenforceable, such provision shall be reformed only to the extent\n   necessary to make it enforceable. Any law or regulation which provides that\n   the language of a contract shall be construed against the drafter shall not\n   be used to construe this License against a Contributor.\n\n\n10. Versions of the License\n\n10.1. New Versions\n\n      Mozilla Foundation is the license steward. Except as provided in Section\n      10.3, no one other than the license steward has the right to modify or\n      publish new versions of this License. Each version will be given a\n      distinguishing version number.\n\n10.2. Effect of New Versions\n\n      You may distribute the Covered Software under the terms of the version\n      of the License under which You originally received the Covered Software,\n      or under the terms of any subsequent version published by the license\n      steward.\n\n10.3. Modified Versions\n\n      If you create software not governed by this License, and you want to\n      create a new license for such software, you may create and use a\n      modified version of this License if you rename the license and remove\n      any references to the name of the license steward (except to note that\n      such modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\n      Licenses If You choose to distribute Source Code Form that is\n      Incompatible With Secondary Licenses under the terms of this version of\n      the License, the notice described in Exhibit B of this License must be\n      attached.\n\nExhibit A - Source Code Form License Notice\n\n      This Source Code Form is subject to the\n      terms of the Mozilla Public License, v.\n      2.0. If a copy of the MPL was not\n      distributed with this file, You can\n      obtain one at\n      http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular file,\nthen You may include the notice in a location (such as a LICENSE file in a\nrelevant directory) where a recipient would be likely to look for such a\nnotice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n\n      This Source Code Form is \"Incompatible\n      With Secondary Licenses\", as defined by\n      the Mozilla Public License, v. 2.0.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 1.1015625,
          "content": "VERSION = 0.2.1\n\nGO_RICE = rice\nGO_FMT = gofmt -w\nGO_XC = goxc\n\nGOXC_FILE = .goxc.local.json\n\nDEPS = \\\n\tgithub.com/GeertJohan/go.rice/rice \\\n\tgithub.com/robertkrimen/terst \\\n\tgithub.com/jessevdk/go-flags \\\n\tgithub.com/kardianos/osext \\\n\tbitbucket.org/pkg/inflect\n\nall:deps templates\n\ntemplates:clean\n\t$(GO_RICE) --import-path github.com/pksunkara/alpaca/alpaca embed\n\ncompile:templates goxc\n\ngoxc:\n\t$(shell echo '{\\n \"ArtifactsDest\": \"build\",\\n \"ConfigVersion\": \"0.9\",' > $(GOXC_FILE))\n\t$(shell echo ' \"PackageVersion\": \"$(VERSION)\",\\n \"TaskSettings\": {' >> $(GOXC_FILE))\n\t$(shell echo '  \"bintray\": {\\n   \"apikey\": \"\",\\n   \"package\": \"alpaca\",' >> $(GOXC_FILE))\n\t$(shell echo '   \"repository\": \"utils\",\\n   \"subject\": \"pksunkara\"' >> $(GOXC_FILE))\n\t$(shell echo '  }\\n }\\n}' >> $(GOXC_FILE))\n\t$(GO_XC)\n\nbintray:\n\t$(GO_XC) bintray\n\ntest:\n\tgo test -v ./...\n\ntest-cover:\n\tgo test -coverprofile=coverage.out github.com/pksunkara/alpaca/alpaca\n\tgo tool cover -html=coverage.out\n\ninstall:\n\tgo install -a github.com/pksunkara/alpaca\n\ndeps:\n\tgo get -u $(DEPS)\n\nclean:\n\t$(GO_RICE) --import-path github.com/pksunkara/alpaca/alpaca clean\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.27734375,
          "content": "# alpaca [![Build Status](https://travis-ci.org/pksunkara/alpaca.svg?branch=master)](https://travis-ci.org/pksunkara/alpaca) [![Gitter chat](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/pksunkara/alpaca)\n\nApi Libraries Powered And Created by Alpaca\n\n---\n\nTired of maintaining API libraries in different languages for your website API? _This is for you_\n\nYou have an API for your website but no API libraries for whatever reason? _This is for you_\n\nYou are planning to build an API for your website and develop API libraries? _This is for you_\n\n---\n\nYou define your API according to the format given below, __alpaca__ builds the API libraries along with their documentation. All you have to do is publishing them to their respective package managers.\n\nJoin us at [gitter](https://gitter.im/pksunkara/alpaca) if you need any help.\n\n## Installation\n\nYou can download the binaries (v0.2.1)\n\n * Architecture i386 [ [linux](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_linux_386.tar.gz?direct) / [windows](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_windows_386.zip?direct) / [darwin](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_darwin_386.zip?direct) / [freebsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_freebsd_386.zip?direct) / [openbsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_openbsd_386.zip?direct) / [netbsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_netbsd_386.zip?direct) / [plan9](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_plan9_386.zip?direct) ]\n * Architecture amd64 [ [linux](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_linux_amd64.tar.gz?direct) / [windows](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_windows_amd64.zip?direct) / [darwin](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_darwin_amd64.zip?direct) / [freebsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_freebsd_amd64.zip?direct) / [openbsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_openbsd_amd64.zip?direct) / [netbsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_netbsd_amd64.zip?direct) ]\n * Architecture arm [ [linux](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_linux_arm.tar.gz?direct) / [freebsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_freebsd_arm.zip?direct) / [netbsd](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_netbsd_arm.zip?direct) ]\n\nOr by using deb packages (v0.2.1)\n\n * [ [i386](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_i386.deb?direct) / [amd64](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_amd64.deb?direct) / [armhf](https://dl.bintray.com//content/pksunkara/utils/alpaca_0.2.1_armhf.deb?direct) ]\n\nOr by using golang (v1.2)\n\n```bash\n# Clone the project into your golang workspace\n$ git clone git://github.com/pksunkara/alpaca\n$ cd alpaca\n\n# Install program\n$ make && make install\n```\n\n## Examples\n\nYou can find some api definitions in the [examples](https://github.com/pksunkara/alpaca/tree/master/examples) directory. The api libraries generated are at [https://github.com/alpaca-api](https://github.com/alpaca-api)\n\nCompleted api definitions are [buffer](https://github.com/pksunkara/alpaca/tree/master/examples/buffer).\n\n## Usage\n\n```bash\n$ alpaca </path/to/dir>\n```\n\nThe path here should be a directory with `api.json`, `pkg.json`, `doc.json`\n\n```\nUsage:\n  alpaca [options] <dir>\n\nApplication Options:\n  -v, --version    Show version information\n\nLanguage Options:\n      --no-php     Do not write php library\n      --no-python  Do not write python library\n      --no-ruby    Do not write ruby library\n      --no-node    Do not write node library\n\nHelp Options:\n  -h, --help       Show this help message\n```\n\n_Please remove the comments when actually using these json files_\n\n#### pkg.json\n\nAll the following fields are required unless mentioned.\n\n```js\n{\n  \"name\": \"Example\", // Name of the api (also used as class name for the library)\n  \"package\": \"example-alpaca\", // Name of the package\n  \"version\": \"0.1.0\", // Version of the package\n  \"url\": \"https://exampleapp.com\", // URL of the api\n  \"keywords\": [\"alpaca\", \"exampleapp\", \"api\"], // Keywords for the package\n  \"official\": false, // Are the api libraries official?\n  \"author\": {\n    \"name\": \"Pavan Kumar Sunkara\", // Name of the package author\n    \"email\": \"pavan.sss1991@gmail.com\", // Email of the package author\n    \"url\": \"http://github.com/pksunkara\" // URL of the package author\n  },\n  \"git\": { // Used in the package definition\n    \"site\": \"github.com\", // Name of the git website\n    \"user\": \"alpaca-api\", // Username of the git website\n    \"name\": \"buffer\" // Namespace of the git repositories\n  },\n  \"license\": \"MIT\", // License of the package\n  \"php\": { // Required only if creating php api lib\n    \"vendor\": \"pksunkara\" // Packagist vendor name for the package\n  },\n  \"python\": { // Required only if creating python api lib\n    \"license\": \"MIT License\" // Classifier of the license used for the module\n  }\n}\n```\n\n#### api.json\n\nAll the following fields are required unless mentioned.\n\n```js\n{\n  \"base\": \"https://exampleapp.com\", // Base URL of the api\n  \"base_as_arg\": true, // Force Base URL to be an argument in generated clients [optional] (default: false)\n  \"version\": \"v1\", // Default version for the api (https://api.example.com{/version}/users) [optional]\n  \"no_verify_ssl\": true, // Do not verify SSL cert [optional] (default: false)\n  \"authorization\": { // Authorization strategies\n    \"need_auth\": true, // Authentication is compulsory [optional] (default: false)\n    \"basic\" : true, // Basic authentication [optional] (default: false)\n    \"header\": true, // Token in authorization header [optional] (default: false)\n    \"header_prefix\": \"oompaloompa\", // The first word in header if using token auth header [optional] (default: token)\n    \"oauth\" : true // OAUTH authorization [optional] (default: false)\n  },\n  \"request\": { // Settings for requests to the api\n    \"formats\": { // Format of the request body\n      \"default\": \"form\", // Default format for the request body [optional] (default: raw)\n      \"form\": true, // Support form-url-encoded? [optional] (default: false)\n      \"json\": true // Support json? [optional] (default: false)\n    }\n  },\n  \"response\": { // Settings for responses from the api\n    \"suffix\": true, // Should the urls be suffixed with response format? [optional] (default: false)\n    \"formats\": { // Format of the response body\n      \"default\": \"json\", // Default response format. Used when 'suffix' is 'true'\n      \"html\": true, // Support html? [optional] (default: false)\n      \"json\": true // Support json? [optional] (default: false)\n    }\n  },\n  \"error\": { // Required if response format is 'json'\n    \"message\": \"error\" // The field to be used from the response body for error message\n  },\n  \"class\": { // The classes for the api\n    \"users\": { // Name of a class of the api\n      \"args\": [\"login\"], // Arguments required for the api class [optional]\n      \"profile\": { // Name of a method of the api\n        \"path\": \"/users/:login/:type\", // URL of the api method\n        \"method\": \"post\", // HTTP method of the api method [optional] (default: get)\n        \"params\": [ // Parameters for the api method [optional]\n          {\n            \"name\": \"type\", // Name of the parameter\n            \"required\": true, // The parameter will become an argument of api method [optional] (default: false)\n            \"url_use\": true // This parameter is only used to build url [optional] (default: false)\n          },\n          {\n            \"name\": \"bio\",\n            \"required\": true\n          }\n        ]\n      }\n    }\n  }\n}\n```\n\n#### doc.json\n\nThe following is filled according to the entries in `api.json`\n\n```js\n{\n  \"users\": { // Name of a class of the api\n    \"title\": \"Users\", // Title of the api class\n    \"desc\": \"Returns user api instance\", // Description of the api class\n    \"args\": { // Arguments of the api class\n      \"login\": { // Name of the argument\n        \"desc\": \"Username of the user\", // Description of the argument\n        \"value\": \"pksunkara\" // Value of the argument in docs\n      }\n    },\n    \"profile\": { // Name of a method of the api\n      \"title\": \"Edit profile\", // Title of the api method\n      \"desc\": \"Edit the user's profile\", // Description of the api method\n      \"params\": { // Parameter of the api class\n        \"bio\": { // Name of the parameter\n          \"desc\": \"Short bio in profile\", // Description of the parameter\n          \"value\": \"I am awesome!\" // Value of the parameter in docs\n        },\n        \"type\": {\n          \"desc\": \"Circle of the profile\",\n          \"value\": \"friends\"\n        }\n      }\n    }\n  }\n}\n```\n\n### Request formats\n\nSupported request formats are `raw`, `form`, `json`. The format `raw` is always true.\n\nThis means, the `body` set in the options when calling an API method will be able to be encoded according to the respective `request_type`\n\n__If set to `raw`, body is not modified at all__\n\n### Response formats\n\nSupported response formats are `html`, `json`.\n\n### Authorization strategies\n\nSupported are `basic`, `header`, `oauth`\n\n### Language Versions\n\nSupported programming language versions are:\n\n| Language |   V   |   E   |   R   |   S   |   I   |   O   |   N   |\n|----------|:-----:|:-----:|:-----:|:-----:|:-----:|:-----:|:-----:|\n| node     | 0.8   | 0.9   | 0.10  | 0.11  | 0.12  |       |       |\n| php      | 5.4   | 5.5   |       |       |       |       |       |\n| python   | 2.6   | 2.7   | 3.2   | 3.3   |       |       |       |\n| ruby     | 1.8.7 | 1.9.1 | 1.9.2 | 1.9.3 | 2.0.0 | 2.1.0 | 2.1.1 |\n\n### Package Managers\n\n| Language | Package Manager                                    |\n|----------|----------------------------------------------------|\n| node     | [https://npmjs.org](https://npmjs.org)             |\n| php      | [https://packagist.org](https://packagist.org)     |\n| python   | [https://pypi.python.org](https://pypi.python.org) |\n| ruby     | [https://rubygems.org](https://rubygems.org)       |\n\n## Testing\n\nCheck [here](https://github.com/pksunkara/alpaca/tree/testing) to learn about testing.\n\n## Contributors\n\nHere is a list of [Contributors](https://github.com/pksunkara/alpaca/contributors)\n\n__I accept pull requests and guarantee a reply back within a day__\n\n### TODO\n\nYou get internet points for pull requesting the following features.\n\n##### Responses\n\n * [Add support for XML](https://github.com/pksunkara/alpaca/issues/36)\n * [Add support for CSV](https://github.com/pksunkara/alpaca/issues/36)\n\n##### Requests\n\n * HTTP Method Overloading\n * What about file uploads?\n\n##### API\n\n * Check returned status code\n * Special case for 204:true and 404:false\n\n##### Libraries\n\n * Pagination support\n * Classes inside classes (so on..)\n * Validations for params/body in api methods\n * Allow customization of errors\n * Tests for libraries (lots and lots of tests)\n\n##### Readme\n\n * [Optional params available](https://github.com/pksunkara/alpaca/issues/57)\n * Return types of api calls\n\n##### Comments\n\n * The descriptions should be wrapped\n * Align @param descriptions\n\n##### Formats\n\n * [Support YAML](https://github.com/pksunkara/alpaca/issues/63)\n * [Support API blueprint](https://github.com/pksunkara/alpaca/issues/56)\n * [Support Swagger](https://github.com/pksunkara/alpaca/issues/61)\n * [Support WADL](https://github.com/pksunkara/alpaca/issues/13)\n * [Support JSON Schema](https://github.com/pksunkara/alpaca/issues/17)\n * [Support RAML](https://github.com/pksunkara/alpaca/issues/54)\n\n##### Languages\n\n * [Support Java](https://github.com/pksunkara/alpaca/issues/11)\n * [Support Go](https://github.com/pksunkara/alpaca/issues/9)\n * [Support Clojure](https://github.com/pksunkara/alpaca/issues/49)\n * [Support Rust](https://github.com/pksunkara/alpaca/issues/62)\n * [Support Swift](https://github.com/pksunkara/alpaca/issues/64)\n * Support C, C++, Perl, Scala, C#, Erlang, Lua, Haskell, D, Julia, Groovy\n * Build cli tool for APIs (bash? python? go?)\n\n### Support Projects\n\nAlternatively, you can write your own converter from `alpaca.json` to the following\n\n* Convert into API Blueprint\n* Convert into Swagger\n\n## License\n\nMIT/X11\n\n## Bug Reports\n\nReport [here](http://github.com/pksunkara/alpaca/issues). __Guaranteed reply within a day__.\n\n## Contact\n\nPavan Kumar Sunkara (pavan.sss1991@gmail.com)\n\nFollow me on [github](https://github.com/users/follow?target=pksunkara), [twitter](http://twitter.com/pksunkara)\n"
        },
        {
          "name": "alpaca",
          "type": "tree",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "main.go",
          "type": "blob",
          "size": 0.9345703125,
          "content": "package main\n\nimport (\n\t\"fmt\"\n\t\"github.com/jessevdk/go-flags\"\n\t\"github.com/pksunkara/alpaca/alpaca\"\n\t\"os\"\n)\n\nfunc main() {\n\n\t// Options for flags package\n\tvar opts struct {\n\t\tVersion bool `short:\"v\" long:\"version\" description:\"Show version information\"`\n\n\t\tFormat string `short:\"f\" long:\"format\" description:\"API description format\" value-name:\"FORMAT\"`\n\n\t\tLangs alpaca.LanguageOptions `group:\"Language Options\"`\n\t}\n\n\t// Build the parser\n\tparser := flags.NewParser(&opts, flags.Default)\n\n\t// Set usage string\n\tparser.Usage = \"[options] <dir>\"\n\n\t// Parse the arguments\n\targs, err := parser.Parse()\n\n\tif err != nil {\n\t\tos.Exit(0)\n\t}\n\n\t// Print version and exit\n\tif opts.Version {\n\t\tfmt.Println(alpaca.Version)\n\t\tos.Exit(0)\n\t}\n\n\t// If no argument is given\n\tif len(args) == 0 {\n\t\tparser.WriteHelp(os.Stdout)\n\t\tos.Exit(0)\n\t}\n\n\talpaca.LoadLibraryPath(args[0])\n\n\tif opts.Format != \"\" {\n\t\talpaca.ConvertFormat(opts.Format)\n\t}\n\n\talpaca.WriteLibraries(&opts.Langs)\n}\n"
        },
        {
          "name": "templates",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}