{
  "metadata": {
    "timestamp": 1736567365159,
    "page": 971,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjk4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "V4NSH4J/discord-mass-DM-GO",
      "stars": 2177,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.064453125,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1943359375,
          "content": "# Binaries for programs and plugins\n*.exe\n*.exe~\n*.dll\n*.so\n*.dylib\n\n# Test binary, build with `go test -c`\n*.test\n\n# Output of the go coverage tool, specifically when used with LiteIDE\n*.out\n\ndist/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.5634765625,
          "content": "1. No small spelling changes (unless you are already a contributor)\n> This is to keep contributors seen as a respected role, which you get from helping DMDGO, not correcting the spelling.\n\n2. Additions must not interrupt the flow of the average user.\n> Don't add things which would interrupt the average Mass DMer.\n\n3. Additions must be relevent to mass dming.\n> Features like raiding aren't relevent to DMDGO's core purpose, so they shouldn't be added.\n\n4. Explain how your pull request will improve the program.\n> It helps me be able to review and understand your PR easier.\n"
        },
        {
          "name": "ISSUE_TEMPLATE.md",
          "type": "blob",
          "size": 0.404296875,
          "content": "### Put the following in the title of your Issue:\n\n`[Question]` for a general question.\n> Be specific, people can't help you if we don't know what you are talking about\n\n`[Bug]` for unexpected error/behavior on the program.\n> Please include your:\n> - DMDGO version (shown on title screen)\n> - Whether you built from source or downloaded a release\n> - Your operating system.\n\n\n## Explain your question/bug below:\n\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 33.6943359375,
          "content": "GNU AFFERO GENERAL PUBLIC LICENSE\n                       Version 3, 19 November 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published\n    by the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<https://www.gnu.org/licenses/>.\n"
        },
        {
          "name": "PULL_REQUEST_TEMPLATE.md",
          "type": "blob",
          "size": 0.431640625,
          "content": "## Checklist:\n\n- [ ] My pull request doesn't just contain spelling corrections.\n- [ ] My pull request doesn't interrupt the flow of the average user.\n- [ ] My pull request is relevent to Mass DMing.\n- [ ] I have explained how my pull request will improve the program.\n\n(replace the spaces with an `x` to tick it)\n\n## Changes made:\n\n(explain what changes you have made to DMDGO)\n\n## Why I've done these changes:\n\n(how does this improve DMDGO)\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 32.8271484375,
          "content": "<p align=\"center\">\n  <img src=\"https://i.imgur.com/z8ig6eN.png\">\n  <img src=\"https://img.shields.io/github/license/V4NSH4J/discord-mass-DM-GO?style=for-the-badge&logo=appveyor\">\n  <img src=\"https://img.shields.io/github/downloads/V4NSH4J/discord-mass-DM-GO/total?style=for-the-badge&logo=appveyor\">\n  <img src=\"https://goreportcard.com/badge/github.com/V4NSH4J/discord-mass-dm-GO?style=for-the-badge&logo=appveyor\">\n  <img src=\"https://img.shields.io/github/stars/V4NSH4J/discord-mass-DM-GO?style=for-the-badge&logo=appveyor\">\n  <img src=\"https://img.shields.io/github/forks/V4NSH4J/discord-mass-DM-GO?style=for-the-badge&logo=appveyor\">\n  </p>\n\n# Discord Mass DM GO\n**DMDGO** is a Multi-threaded Discord Self-Bot primarily used for mass messaging users on Discord. It has numerous other quality features to enhance the user experience and allowing the user to target the most users. \n\n## Community \n\n[Telegram Server for Support](https://t.me/tosviolators)\n\nOld Discord Server link removed as it was terminated. Someone claimed the vanity to promote a Scam on DMDGO's name. DMDGO does not have any Paid products and does not offer any subscriptions. Anyone using DMDGO name or V4NSH4J's name to promote anything is a scam. I do not have an official Discord anymore, my only telegram is @campingarunner and my email is v4nsh4j@proton.me \nPlease always make sure you are not dealing with an imposter, value your time and money. \n\n\n## **Features** :\n### Token Utilities\n- Avatar Changer\n- Username Changer\n- Hypesquad Changer\n- Bio Changer\n- Token Changer\n- Invite joiner (Single/Multi modes)\n- Guild Leaver\n- Token Onliner \n- Token Format Changer\n- Token Checker\n- Reaction Adder\n- Server Checker\n### Mass Messaging\n- Mass DM Advertisement \n- Single DM Spam\n- DM on React\n### Scraping Utilities\n- Opcode 14 Scraper (Memberlist scraper)\n- Opcode 8 Scraper (Bruteforce Scraper)\n- Reaction Scraper\n### Other Features\n- Multiple Captcha APIs supported\n- Supports token & email:pass:token formats\n- Compatible with all major OS and Architectures\n- Proxyless \n- Supports HTTP(s), SOCKS5 and SOCKS4 proxies\n- Free & Open source\n- Emulates Discord's requests to a very high accuracy to prevent detection\n- Highly Documented\n- Multi-threaded using Light-weight Goroutines supporting thousands of concurrent accounts\n- Can Receieve messages during mass DM\n- Can ping user\n- Can send embeds using 3rd Party APIs\n- Supports multiple messages\n### Preview\n<p align=\"center\">\n  <img src=\"https://i.imgur.com/rpa7CnG.png\">\n</p>\n\n## Disclaimer \n The automation of User Discord accounts also known as self-bots is a violation of Discord Terms of Service & Community guidelines and will result in your account(s) being terminated. Discretion is adviced. I will not be responsible for your actions. Read about Discord [Terms Of service](https://discord.com/terms) and [Community Guidelines](https://discord.com/guidelines)\n \nDiscord Mass DM GO (DMDGO) was written as a proof of concept that Discord accounts can be automated and can perform actions beyond the scope of regular Discord Users like sending Embeds so that Discord can make changes. The DMDGO authors are released of any liabilities which your usage may entail. \n\n## Tutorial / Showcase Video\n### DMDGO v1.7.0\n[![Youtube - Click to play](https://i.imgur.com/Jx4gk54.png)](https://youtu.be/9HX64DHJYWI)\nClick to play\n\n### DMDGO v1.5.0\n[![Youtube - Click to play](https://img.youtube.com/vi/3m56RTbThbg/maxresdefault.jpg)](https://www.youtube.com/watch?v=3m56RTbThbg&t=174s)\nClick to play\n\n \n## Basic Usage\n1) [Build from source](https://github.com/V4NSH4J/discord-mass-DM-GO#building-from-source-) or download a pre-built version for your OS & Arch from [releases](https://github.com/V4NSH4J/discord-mass-DM-GO/releases)\n2) Run the program via the binary. \n3) Set your [Config](https://github.com/V4NSH4J/discord-mass-DM-GO#configuration) by modifying the `config.yml` file. \n4) If you already have memberids to DM, put them in `\\input\\memberids.txt` or obtain them from [Scraping]()\n5) Put HTTP(s) Proxies in `\\input\\proxies.txt` if you enabled proxies in config. The format is IP:Port or User:pass@IP:Port if your proxies have a user-pass authentication. \n6) Enter your message(s) in `message.json` file. You can use [this](https://glitchii.github.io/embedbuilder/?editor=json) website to easily make JSON objects. However, if you do not want to/ are unable to format the file properly, you will have an option to input a simple message before mass DM-ing. Writing \"\\<user\\>\" without quotes anywhere in message content will ping the user to whom you're sending a message. Please make sure to use \\n to change lines. You may pick an [example]() message.json and build from it.\n\n## Building from source\n1) Download and install [Golang](https://go.dev/) and verify your installation\n2) Open a terminal window/ command prompt in the directory of the source code and type `go build`\n3) A binary compatible with your OS/Arch should be made. If there are some problems on MacOS/Linux with executing the binary as a program. You can run this command `chmod +x ./discord-mass-dm-GO` or go to properties -> permissions -> Allow executing file as program. \n\n\n## How to get help? \nRead this documentation, try using `Ctrl + F` to find what you're looking for. Watch the tutorial video on YouTube. Other than that, feel free to make an [issue](https://github.com/V4NSH4J/discord-mass-DM-GO/issues) or try asking on our [Telegram Server](https://t.me/tosviolators)\n\n## Configuration\n\n| Name | Type | Description | \n| ---  | ---  | ---         |\n| `direct_message_options` | DirectMessage | Contains settings related to sending Direct messages to discord users.\n| `proxy_settings` | ProxySettings | Contains settings related to proxies. \n| `scraper_settings` | ScraperSettings | Contains settings related to scraping menu. \n| `captcha_settings` | CaptchaSettings | Contains settings related to captchas. \n| `other_settings` | OtherSettings | Contains miscellaneous settings and options. \n| `suspicion_avoidance` | SuspicionAvoidance| Contains settings related to appearing like an actual user.\n| `dm_on_react` | DMonreact | Contains settings for DM on react option. \n### DirectMessage Object\n| Name | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`individual_delay` |int |90 | Duration in seconds between 2 consecutive Direct messages by one instance.\n|`rate_limit_delay` |int |60 | Duration in seconds instance sleeps for when Discord says \"You're opening new direct messages too fast\"\n|`offset` |int |1000 | uration in Milliseconds (1/1000th of a second) that the program waits in between of starting 2 instances. Perhaps one of the most important settings which is why it has it's [own section](). Recommended offset is (60/number of tokens) * 1000 but it does not matter with a few tokens and can be set to any small value.\n|`skip_completed` |bool |true | Skip members who have already been DM'd from the input/completed.txt file \n|`call` |bool |false | Call users after DM (Token needs to be friended to Ring)\n|`remove_dead_tokens` |bool |true | Remove tokens which have died from input/tokens.txt once DMs are completed.\n|`remove_completed_members` |bool |true | Remove members who have been DM'd from input/memberids.txt once DMs are completed\n|`stop_dead_tokens` |bool |true | Stop using tokens which have been locked/disabled. \n|`check_mutual` |bool |false | Check mutual servers and Username \n|`friend_before_DM` |bool |false | Friend user before sending DM (Requires Check Mutual to get username and discriminator)\n|`online_tokens` |bool |false | Websocket tokens and set their status to online while mass DMing \n|`max_dms_per_token` |int |0 | Stop tokens at a particular number of DMs. 0 for unlimited.\n|`receive_messages` |bool |false | Receieve messages from the people your tokens are sending DMs to. They get saved to input/received.txt (Requires Online Tokens)\n|`skip_failed` |bool |true | Skip members who have already been attempted to be DM'd but failed from the input/failed.txt file\n|`block_after_dm` |bool |false | Block user after sending DM\n|`close_dm_after_message` |bool |false | Close DM (Presses the X in front of the DM) after sending a message\n\n### ProxySettings Object\n Name | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`proxy`|string|\"\"|Using rotating proxy in config like in DMDGO v1.6.0 and earlier. (Depracated, see `proxy_from_file`)|\n|`proxy_from_file`|bool|true|Load proxies from /input/proxies.txt and use them globally throughout the program. A proxy is binded to each instance at the beginning of any function and sticks with it throughout the process. There is no in-built proxy checker and it does not rotate proxies on it's own. Always use high quality static checked proxies.|\n|`proxy_for_captcha`|bool|false|Send proxy to captcha service to ensure that captcha is solved on the same IP address as the action taken on Discord (like joining server) to avoid detection. Each service has it's own documentation on what proxy is acceptable for them. Usually they don't support IP Authorization and disallow hostnames. You can ping your proxy hostname to resolve it's IP Address and use that|\n|`proxy_protocol`|string|\"http\"|Proxy protocol of your proxies, used for actions on Discord and sent to captcha APIs as well|\n|`gateway_proxy`| bool | false | use proxy for websocket functions. Same proxy is used as the one for other actions on Discord. |\n|`timeout`| int | 60 | Maximum time to wait before timing out incase of slow proxies or incase a proxy does not connect. |\n\n### ScraperSettings Object\nName | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`online_scraper_delay` | int | 1000-2000 | Delay in milliseconds to sleep between 2 scrape requests in Opcode 8 and Opcode 14 Scrapers.|\n|`scrape_usernames`| bool | false | Scrape usernames and output them to input/names.txt while using Opcode 8 Scraper.|\n|`scrape_avatars`| bool | false | Scrape avatars and output them to input/pfps/ while using Opcode 8 Scraper. |\n\n### CaptchaSettings Object\nName | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`captcha_api_key`| string | \"your_captcha_key\" | Your authentication key for the captcha solving service you set. if user authenticated then enter username and password in format user:pass or just put the key. |\n|`captcha_api`| string | \"anti-captcha.com\" | The captcha service you're using. Always check which ones are compatible before using one! Might need to use a different captcha provider if you're getting flagged or invalid solutions | \n|`mac_captcha_wait`| int | 120 | Maximum time to wait for the solution after submitting the captcha before cancelling the action and moving forward|\n|`max_captcha_retry_dm`| int | 0 | Maximum times to retry solving captcha if an unacceptable solution is returned (Implemented so people don't wipe out their balances) Keep 0 for unlimited|\n|`max_captcha_retry_invite`| int | 3 | Maximum times to retry joining server if met with captcha |\n\n### OtherSettings \nName | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`disable_keep_alives`| bool | false | Open a new underlying TCP connection for each request. Highly detectable. Always keep false. But helps to rotate a rotating proxy's IP on each request when set in environment using the depracated `proxy` field in ProxySettings object| \n\n## SuspicionAvoidance Object \nName | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`random_individual_delay`| int | 0 | Random amount of time in seconds to be added to each individual delay|\n|`random_rate_limit_delay`| int | 0 | Random amount of time in seconds to be added to each rate limit delay| \n|`random_delay_before_dm`| int | 0 | Random amount of time in seconds to wait in between of opening a DM and sending a DM|\n|`typing`| bool | false | Show user as typing before sending a message|\n|`typing_variation`| int | 250 | random delay added in typing | \n|`typing_speed`| int | 300 | Speed in which the message is typed (Affects the overall time it takes to send the message, shorter messages will be sent quicker)|\n|`typing_base`| int | 100 | base delay in typing |\n\n## DMonReact Object \nName | Type | Recommended Value | Description |\n| -----|------|-------------------|-------------|\n|`observer_token`| string | \"your token\" | A token which is present in the server where yo want to sniff reactions and send DMs. This token is only used for looking at the reacts, it's never used to send DMs. |\n|`change_name`| bool | true | An instance token changes name before sending DMs to people approved by observer token. Requires tokens in format email:pass:token|\n|`change_avatar`| bool | true | An instance token changes avatar before sending DMs to people apporved by observer token. |\n|`invite`| string | \"invite_to_server\" | Invite to the server where you're running DM on react, to join instances when they're needed so they don't get kicked. If not specified, the bot will assume the tokens are already present in the server |\n|`server_id`| string | \"server_id\" | Server ID where you're running the DM on react. If not specified, instances will try to send to every reaction sniffed by observer token. This is required for other things like checking if Token is in server or not, it's highly recommended you specify this field. | \n|`channel_id`| string | \"your_channelId\" | Channel ID where you want to send messages to reactions. If left blank, bot will send DMs to reacts in all channels in the server. |\n|`message_id`| string | \"your_messageId\" | Message ID of the message on which you want to send people DMs who react. If left blank, would send DMs to all messages in the channel. |\n|`emoji`| string | \"emojiname:id\" | The emoji when reacted with the message will be sent. Unicode emojis have to be entered just as the emoji. Example: \"\" (Don't worry if it appears as boxes on your machine) And for custom/nitro emojis you have to put emoji_name:emoji_id which you can get from the emoji's URL. If left blank, messages will be sent to every reaction on the message. |\n|`rotate_tokens`| bool | true | Re-uses tokens from a pool. Suppose if token was rate limited, it would be switched but later be returned to to be reused. |\n|`max_anti_raid_queue`| int | 20 |To ensure someone does not spam reactions to jam your bot and lock your instances, you can set the maximum queue size. Any reactions above this would be discarded. This will easily help bypass mass emoji reacts breaking the bot. |\n|`max_dms_per_token`| int | 0 | Maximum DMs you want your tokens to send. Set to 0 for unlimited.\n\n\n\n\n\n\n\n\n\n\n### Offset \nOffset is a duration in milliseconds. As the name suggests this offsets or displaces the goroutines (threads) by a short period of time to ensure that all accounts don't start at the exact same second. What is the recommended offset? If you have less than 100 tokens or are using short individual delays, it does not matter. You can put any offset like 50-300. But if you are running a large number of tokens, you should set your individual and rate limit delays to 60 each or higher. Your offset will come with this formula - (individual delay/number of tokens) * 1000 This ensures your tokens start evenly spread out throughout the individual delay period. \nYou can do more interesting things with offset. Normally to bypass Anti-Raid bots like Beemo or Wick, you'd have to join your tokens with high delays then wait for all of them to join to start DMing. Now with Offset you can make it so that one account joins and starts DMing, 30 seconds or any duration of your choice later the second account joins and start DMing so you save A LOT of time. How to do this? Set your offset to the duration you want your accounts to join in, like 30,000 - 60,000 (Remember offset is in milliseconds) and don't join your accounts to the server. Before Mass DMing, you'd get an option for advanced settings. Enter the server invite and serverid there. Use multiple proxies/ rotating proxies to prevent Discord server IP bans by the Anti-Raid bots. This won't work while Proxyless. \n\n## Using Captcha APIs\nCaptcha Solving APIs were introduced to DMDGO on 8th February 2022 when Discord mandated Captchas for joining servers on some tokens they deemed untrustworthy. The supported Captcha APIs right now are capmonster.cloud and anti-captcha.com \nYou can register an account there, load some balance and copy your Captcha API Key to config. Make sure to specify the service you're using as well. It is extremely inexpensive and can join thousands of accounts in a couple USD. If there is an error with the captcha APIs, You will get an error code. You can look it up on their documentation [here](https://anti-captcha.com/apidoc/errors)\n\n### Example configuration\n```json\n{\n    \"individual_delay\": 60,\n    \"rate_limit_delay\": 60,\n    \"offset\": 100,\n    \"skip_completed\": true,\n    \"skip_failed\": true,\n    \"remove_dead_tokens\": true,\n    \"remove_completed_members\": true,\n    \"stop_dead_tokens\": true,\n    \"check_mutual\": false,\n    \"friend_before_DM\": false,\n    \"online_tokens\": false,\n    \"online_scraper_delay\": 2000,\n    \"call\": false,\n    \"proxy_from_file\": false,\n    \"max_dms_per_token\": 0,\n    \"receive_messages\": true,\n    \"use_proxy_for_gateway\": false,\n    \"timeout\": 60,\n    \"captcha_api\": \"capmonster.cloud\",\n    \"captcha_api_key\": \"your_captcha_api_key\",\n    \"max_attempt_invite_rejoin\": 4,\n    \"disable_keep_alives\": false\n}\n```\nThis is the config I'd use, with ofcourse the offset calculated accordingly. \n\n## Message in file\nThe `input/message.json` is an array of messages from which one is chosen at random to be sent before each DM. Message.json is an array of messages. Find the examples below to add multiple messages. You can use the \"get message\" option to get messages from discord as well. Be sure to have the [] around the whole message. The only way to change lines is adding `\\n`. After discord update on 22nd January 2022; Embed support was removed from DMDGO V1.7.5 and higher as discord removed the capibility to send embeds completely from userbots\n\n### Example message 1 : Single Message, No Embed\n```json\n[\n  {\n    \"content\": \"Hi <user> join my telegram server https://t.me/tosviolators\"\n  }\n]\n```\n\n### Example message 2: Multiple messages, No Embeds. \n```json\n[\n  {\n    \"content\": \"Hi <user> join my telegram server https://t.me/tosviolators\"\n  },\n  {\n    \"content\": \"We had a discord but it got terminated\"\n  },\n  {\n    \"content\": \"We might make one again but too lazy to do so\"\n  }\n]\n```\n\n## How to Debug problems with Mass DMing / Message \nFor problems with setting the JSON files. Read this document very carefully and try understanding a bit of JSON. You can use [JSON Lint](https://jsonlint.com/) or similar to validate your JSON files and fix errors. The structure for all files is clearly defined here. \nFor problems with sending DMs/ Any other function, the best way to diagnose is logging into the token and see what's going on. I highly recommend not to use email:password to login as it might trigger the New Login Location prompt. It's better to login via tokens. [Click here](https://gist.github.com/m-Phoenix852/d63d869f16e40dac623c9aa347e8641a) for a simple and fast token login script by @m-Pheonix852\nOnce logged into the token, you can see if it's still in the server / diagnose other problems with channel veriifcation levels, etc. You may also read the FAQs. Always keep in mind, when using self-bots you can only do actions that normal users can do. If you try DMing someone with no mutuals or friends, you can't DM them. Similarly, this self-bot can't either. \n\n## Scraping [Experimental Menu as of DMDGO v1.7.0]\nThe Scraping menu is a new functionality introduced in DMDGO V1.7.0 Before that, DMDGO recommended the use of [Discum's Scraper](https://gist.github.com/V4NSH4J/06c452f32ceb5f6387b66abd8ccedd74) \nThis menu is still unstable and needs a lot of improvement. For stability, you can use the Discum Scraper. But if you do decide to use the scraper from DMDGO, It's explained here. \n- *Online Scraper (Opcode 14)* : Scrapes members from the member list visible on the right hand side of a discord server. This is usually only online members in case of larger servers as the offline member list usually gets hidden when servers are larger than 1000 members. \n\n- *Scrape from Reactions*: Does not use websocket, incase you see a reaction with a large number of reacts from which you'd like to get users, you can use this option. The one downside to this is that it would also scrape reacts from users who may have already left the server. \n\n- *Offline Scraper* (Opcode 8) : Scrapes members using OP8 websocket requests. This is what goes on behind the screens when you search for members in the search bar or by using @ in chat. This is usually slow with 1 account as it's bruteforcing which is why this mode supports multiple tokens for faster scrapes. It can't get all the users because of limitations described in [Discum's Docs](https://github.com/Merubokkusu/Discord-S.C.U.M/blob/master/docs/using/fetchingGuildMembers.md) but it gets a substantial number more users than the Opcode 14 scraper. You'll have to press ENTER to start and stop this scraper as it has the potential to go on for a very long time. Recommended to use multiple tokens and they need to be in the server before you start scraping. This function was slowed down on purpose to avoid any sort of rate limits. It will save IDs automatically to memberids.txt and you'll have to stop it manually when it's no longer getting IDs.\n<p align=\"center\">\n  <img src=\"https://i.imgur.com/cMscRo5.png\">\n</p>\n\n\n## Token Functionality [Updated: 14th January 2022]\nThe number of DMs you get per token depends on your token's quality and it's verification status. Unverified tokens (No email, No Phone number) get around 5 DMs. Email Verified tokens get around 50 DMs and Phone verifieds have the potential to go more than 50. \nThese are ofcourse the *maximum/ideal* number of DMs as they were tested on botted servers where every DM was open. In a real-DMing scenerio, this number can be lesser. \nWhenever you buy tokens from a new seller, buy less tokens first to test out their quality. You can do this by manually sending DMs. Discord often flags the domains on which tokens are made, when this happens your tokens will struggle to even get 1 DM. Sometimes the phone number on the accounts is flagged as well. So always check before buying. \nAged tokens have the potential to do thousands of DMs without ever getting disabled. But the type of tokens you want to use would depend on the servers you want to target and the cost efficiency. The mean DM price from DM-services is $0.01. The cost of an email verified token is $0.03 on average right now. Which would make the cost of DMs if you use email verifieds around $0.0006 - $ 0.001 which is more than 10 times cheaper. \nIf you're new to this and want to try out your hand, I recommend going for cheap email verifieds to test. Other than that, it is upto you to narrow your targets and find your cost efficiency. \n\n## Mass DMing\nBefore you start Mass DMing, You will have an option for Advanced Settings. You may set a Serverid and invite code there. If the token is not in the server, the token will stop sending messages or try to rejoin the server. \nFor best efficiency, use the recommended setting for delays. \nIf you get spammed with errors \"Cannot send messages to this user\", make sure you're using the right memberids and that your tokens are in the server. \nIf you get the error \"Channel verification too high\", this could be because you're trying to use email verified tokens on a server which requires phone verification or because the server has a 10 minute timer which you'd need to wait out before sending messages (Can be confirmed by loggin in with a token)\nSometimes, servers have anti-raid bots which detect suspicious patterns in joining like a lot of accounts with similar recent dates of registeration, no profile picture and random names joining within a certain time period. They may kick/ban the accounts, in such an event, you will not be able to send messages. Check out the method described [here]() or use high delays while joining such servers\n\n## Proxies, Tokens and the Discord Self-Bot market in general\nDMDGO was tested using Proxiware's Static Proxies and Iproyal's Rotating proxies. It may or may not work properly with free proxies from proxiscrape. Those are the worst proxies you can find on the internet. Using a proxies with gateway functions is not recommended.\nTokens are Discord accounts, they will be sending DMs for you. There are few ways to get them, the simplest being to buy them. Whenever you buy tokens, please check the quality and only buy more if they're good. Or you can buy/make/find a token generator. \nThe Discord-Self bot market is very risky. A word of advice, don't purchase from unreputed people and use middlemen on reputed forums for large transactions. You will get scammed most of the times otherwise. The market is full of highly elaborate scammers like [Exordium](https://www.youtube.com/watch?v=uw7wjBxNK-4&ab_channel=Exordium) targetting people with his purchased channel and botted impressions. He will take your money and block you. And the owners of Anonix who will hapilly sell you open source code. \nExit scams happen here all the time. Take recent incident of one of the MassDN partners Certex who exit scammed $60,000+ by ratting their customers. This is not to scare you to make purchases, this is just to warn you that you are likely to get scammed especially as a newcomer so stay vigilant. I decided to include this in the readme because everyday I see several people getting scammed.\n\n## Support my Journey!\nLeave a star on the repository, helps out intensively! You can also buy me a cookie on these addresses if I helped you out in any way. DMDGO was made with <3 over a period of 3 months and 184 cans of Redbull which doesn't come cheap :)\n\n- *ETH*: 0xE01118C55963fA92174802Dae87E1C6DE1dADC07\n\n- *BTC*: bc1qs9069mdegedmv7w0wtwap0qfa2h9j8d403jfej\n\n- *SOL*: 8QyA9dCetgVMxU2AjzfM3DrY1i3mXuE8nsgLkvAX1hTe\n\n- *LTC*: LN5UPbL31TcPzpBKFbsNKZ5BxwUzKcyi1F\n\n## Contact\nThere are a lot of impersonators, please make sure you're dealing with the correct username. \n\nTelegram: https://t.me/campingarunner (This is my only Telegram)\n\nMail: v4nsh4j@protonmail.com (For Business Enquiries)\n\n\n## Credits\nDMDGO has not been a One man show! I would like to thank everyone for their contributions and my patreons. Special thanks to my lads -> \n- [The author of Dankgrinder](https://github.com/dankgrinder) and [OsOmE1](https://github.com/OsOmE1) for helping out numerous times since the time I started writing code! Also for the websocket code taken from [dankgrinder](https://github.com/dankgrinder/dankgrinder)\n- [Sympthey](https://github.com/Zenoryne) for allowing use of his Websocket code from [DiscSpam](https://github.com/Zenoryne/DiscSpam) helping me to understand the protocol!\n- Arandomnewaccount and [Dolfies](https://github.com/dolfies) Contributors on Python Libraries for Discord Selfbots like [Discum](https://github.com/Merubokkusu/Discord-S.C.U.M) and [Discord.py-Self](https://github.com/dolfies/discord.py-self) for helping with the op8 and op14 scrapers and their amazing [docs](https://arandomnewaccount.gitlab.io/discord-unofficial-docs/lazy_guilds.html)\n- Woen for providing the configuration for the initial HTTP client which did not really solve the problem but gave me the right direction!\n- [Bytixo](https://github.com/bytixo) for providing the code used for obtaining the current stable build number\n- My friend [Siegfried](https://github.com/siegfriedjohnsons) for helping out with the community servers and many functions of DMDGO since even before it existed.\n\n\n## FAQs\n\n#### Q: I can't find the EXE file?\nA: Download a pre-built version for your OS/Architecture from the release section or build from source.\n\n#### Q: How to install Discum to use their scraper?\nA: Run the following on your command prompt: \n`pip install discum`\n\n#### Q: Pip does not work for me? \nA: Add python to path, watch a tutorial on it. \n\n#### Q: Index error on discum script / Any other non-websocket error: \nA: Make sure you have correctly entered your Token, channel ID and Server ID in the script and that the token is present in the server you're trying to scrape. For more assistance, please reach out to discum. \n\n#### Q: Where do I get tokens? \nA: Purchase a token generator, proxies, 2captcha and a hosting and generate your own tokens 24x7 or just buy tokens directly. Always ask for a token to try before purchasing to ensure it's of superior quality. \n\n#### Q: \"DLL load failed while importing _brotli: The specified module could not be found\" while using Discum\n\nA: [Download](https://docs.microsoft.com/en-GB/cpp/windows/latest-supported-vc-redist?view=msvc-170) this for your OS/Arch\n\n#### Q: My program closes instantly\nA: Open up a command prompt, drag and drop the exe to it and try to run. This way it will show you the error before exiting\n\n#### Q: Error 400\nA: Error 400 is a malformed request and is a fault at your end. Either the channel IDs are wrong / the token is trying to DM itself. Or your message is empty (Empty messages can't be sent on discord) stuff like that. \n \n#### Q: Error 400 [Code: 40001 Message: Unauthorized]\n A: Your token has never been connected to a websocket before. Use token onliner in DMDGO v1.0.7 and above.\n\n#### Q: Error 405/403/401\nA: Error 403 stands for \"Forbidden\" and Error 405 stands for \"Method not allowed\", 403 arrises due to several reasons - You're blocked by the Receiver, you don't share a mutual server with them, you're phone locked, you're email locked, You haven't completed member screening, Receiver's DMs are closed, etc. Meanwhile Error 405 usually happens when you try to do something that can't be done normally on discord, based on how the program works, this might arise if your tokens get locked/ disabled. Error 401 stands for \"Unauthorized\" and may mean that your token is invalid/locked. You may also get Error 403 if you try to DM users in a phone verification required server with email verified tokens.\n\n#### Q: What is rate limit delay? \nA: Discord limits the speed with which you can send New DMs. As of November 2021, this limit is 10 new DMs every 10 minutes. Once the token gets rate limited, it will wait out the duration mentioned in config in front of rate limit delay. This is not bypassable, if anyone/ any other program claims it can bypass it, it's a lie. \n\n#### Q: What kind of tokens are recommended? \nA: Fully verified tokens with a valid email and phone number\n\n#### Q: Do I need to keep discord open? \nA: No, you only need to keep this program open to send messages.\n\n#### Q: My OS/Arch is not listed in releases?\nA: Build it yourself, it is explained in the readme file.\n\n#### Q: Discum is auto-exiting\nA: Make sure you've made a file `users.txt` in the same directory as the script if you're using the version of Discum from my readme. Also run Discum in CMD and not by double clicking.\n\n#### Q: Should I use proxies? If yes which ones? \nA: It is totally upto you, I personally don't see the need for proxies yet using this. But some people like it as it does seem more believeable. If you intend to use proxies with this, you'd need HTTPs rotating proxies.\n \n#### Q: What is the proxy format? \nA: The proxy format is username:password@hostname:port\n\n#### Q: Error 429/ I can't join servers?\nA: Your IP is softbanned / you are rate limited, use a VPN. It will be fixed.\n\n#### Q: What is membership screening/ minimum security of servers preventing me from DMing? \nA: It looks something like this: \n \n \n![Membership Screening](https://media.discordapp.net/attachments/905121020430659597/908460971171909662/sdgsdg.PNG)\n \nYou need to be past this in order to send any DMs to members in that server.\n\n#### Q: How to better debug what's going wrong? \nA: Login into your token and try to understand what's going wrong. I recommend this [script](https://gist.github.com/m-Phoenix852/d63d869f16e40dac623c9aa347e8641a) .\n\n#### Q: I put in my tokens, memberIDs, config and message but it can't find them? \nA: Make sure you've compiled and are running the binary. Doing `go run main.go` does not work as the program finds the above mentioned files using the relative path to the exe. Doing `go run main.go` makes a temporary exe somewhere. \n\n#### Q: Will you mass DM for me? \nA: I will not, this program is just a Proof of Concept. Using it to actually launch DM advertisement campaigns & spamming is a violation of Discord TOS & Community guidelines. This is only for documenting & researching.\n\n#### Q: Channel verification too high?\nA: This happens in a few scenerios. You're trying to use unverified tokens to DM in a server which needs Phone/Email verification OR you're trying to use email verified tokens in a server which requires phone verification. This may also happen if the server has a 10 minute wait time before you can interact in it, to verify, login into a token and see. It may also happen if for some reason, DMDGO failed to bypass the token which it does automatically.\n\n#### Q: Invalid character `e` looking for beginning of value error code: 1015 \nA: Cloudflare Error 1015 is an IP Based Rate limit. You have to use proxies/ VPN to get around it\n\n\n"
        },
        {
          "name": "client",
          "type": "tree",
          "content": null
        },
        {
          "name": "config.yml",
          "type": "blob",
          "size": 2.3955078125,
          "content": "\ndirect_message_settings:\n  individual_delay: 60\n  rate_limit_delay: 650\n  offset: 100\n  max_dms_per_token: 0\n  skip_completed: true\n  call: false\n  remove_dead_tokens: true \n  remove_completed_members: true \n  stop_dead_tokens: true \n  check_mutual: false\n  friend_before_DM: false\n  online_tokens: false\n  receive_messages: false\n  skip_failed: false\n  block_after_dm: false\n  close_dm_after_message: false\n  multiple_message: false\n  delay_between_multiple_messages: 10\n\nproxy_settings:\n  proxy_from_file: true\n  proxy_for_captcha: true\n  use_proxy_for_gateway: false\n  timeout: 60\n\nscraper_settings:\n  scraper_delay: 3000\n  scrape_usernames: false\n  scrape_avatars: false\n  query_brute_extra_chars: \"\"\n\ncaptcha_settings:\n  captcha_api_key: \"\"\n  captcha_api: \"invisifox.com\"\n  max_captcha_wait: 60\n  max_captcha_retry_dm: 0\n  max_captcha_retry_invite: 3\n\nother_settings: \n  disable_keep_alives: false\n  constant_cookies: true\n  censor_token: false\n  logs: false\n  gateway_status: 4\n  ja3: \"771,4865-4866-4867-49195-49199-49196-49200-52393-52392-49171-49172-156-157-47-53,0-23-65281-10-11-35-16-5-13-18-51-45-43-27-17513,29-23-24,0\"\n  useragent: \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/104.0.0.0 Safari/537.36\"\n  x_super_properties: \"eyJvcyI6Ik1hYyBPUyBYIiwiYnJvd3NlciI6IkNocm9tZSIsImRldmljZSI6IiIsInN5c3RlbV9sb2NhbGUiOiJlbi1HQiIsImJyb3dzZXJfdXNlcl9hZ2VudCI6Ik1vemlsbGEvNS4wIChNYWNpbnRvc2g7IEludGVsIE1hYyBPUyBYIDEwXzE1XzcpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIENocm9tZS8xMDQuMC4wLjAgU2FmYXJpLzUzNy4zNiIsImJyb3dzZXJfdmVyc2lvbiI6IjEwNC4wLjAuMCIsIm9zX3ZlcnNpb24iOiIxMC4xNS43IiwicmVmZXJyZXIiOiJodHRwczovL3d3dy5nb29nbGUuY29tLyIsInJlZmVycmluZ19kb21haW4iOiJ3d3cuZ29vZ2xlLmNvbSIsInNlYXJjaF9lbmdpbmUiOiJnb29nbGUiLCJyZWZlcnJlcl9jdXJyZW50IjoiIiwicmVmZXJyaW5nX2RvbWFpbl9jdXJyZW50IjoiIiwicmVsZWFzZV9jaGFubmVsIjoic3RhYmxlIiwiY2xpZW50X2J1aWxkX251bWJlciI6MTQwNTc1LCJjbGllbnRfZXZlbnRfc291cmNlIjpudWxsfQ==\"\n\n\nsuspicion_avoidance:\n  random_individual_delay: 1\n  random_rate_limit_delay: 1\n  random_delay_before_dm: 1\n  typing: false\n  typing_variation: 250\n  typing_speed: 450\n  typing_base: 200\n\ndm_on_react:\n  observer_token: \"\"\n  change_name: true\n  change_avatar: true \n  invite: \"\"\n  server_id: \"\"\n  channel_id: \"\"\n  message_id: \"\"\n  emoji: \"\"\n  skip_completed: true \n  skip_failed: true \n  leave_token_on_ratelimit: true \n  rotate_tokens: true\n  max_anti_raid_queue: 20\n  max_dms_per_token: 10\n"
        },
        {
          "name": "discord",
          "type": "tree",
          "content": null
        },
        {
          "name": "embed.json",
          "type": "blob",
          "size": 0.9619140625,
          "content": "{\r\n    \"title\": \"Edit me! This will be the blue text on the embed\",\r\n    \"description\": \"This is the main place to put all your info.\\nYou can also create new lines.\\n\\nNote: User's will not be able to click links in the description. Also, you are limited with the amount of lines you can use.\",\r\n    \"redirect\": \"https://example.com/0\",\r\n    \"color\": \"#7289da\",\r\n    \"author\":{\r\n        \"name\": \"This text is the same as the 'author' text on an embed, except you can click on it.\",\r\n        \"url\": \"https://example.com/1\"\r\n    },\r\n    \"provider\": {\r\n        \"name\": \"This will be very small text and gray. It will also be at the top of the embed.\",\r\n        \"url\": \"https://discock.shop/2\"\r\n    },\r\n    \"image\": {\r\n        \"thumbnail\": false,\r\n        \"url\": \"https://i.imgur.com/pN1GR7Q.png\",\r\n        \r\n        \"info\": \"'thumbnail' means whether the image is small and on the right side of the embed, or large on the bottom of the embed. Feel free to remove this after.\"\r\n    }\r\n}\r\n"
        },
        {
          "name": "fingerprints.json",
          "type": "blob",
          "size": 2.7685546875,
          "content": "[\n    {\n        \"ja3\": \"771,4865-4866-4867-49195-49199-49196-49200-52393-52392-49171-49172-156-157-47-53,0-23-65281-10-11-35-16-5-13-18-51-45-43-27-17513,29-23-24,0\",\n        \"useragent\": \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/104.0.5112.81 Safari/537.36\",\n        \"x-super-properties\": \"eyJvcyI6Ik1hYyBPUyBYIiwiYnJvd3NlciI6IkNocm9tZSIsImRldmljZSI6IiIsInN5c3RlbV9sb2NhbGUiOiJlbi1HQiIsImJyb3dzZXJfdXNlcl9hZ2VudCI6Ik1vemlsbGEvNS4wIChNYWNpbnRvc2g7IEludGVsIE1hYyBPUyBYIDEwXzE1XzcpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIENocm9tZS8xMDQuMC4wLjAgU2FmYXJpLzUzNy4zNiIsImJyb3dzZXJfdmVyc2lvbiI6IjEwNC4wLjAuMCIsIm9zX3ZlcnNpb24iOiIxMC4xNS43IiwicmVmZXJyZXIiOiJodHRwczovL3d3dy5nb29nbGUuY29tLyIsInJlZmVycmluZ19kb21haW4iOiJ3d3cuZ29vZ2xlLmNvbSIsInNlYXJjaF9lbmdpbmUiOiJnb29nbGUiLCJyZWZlcnJlcl9jdXJyZW50IjoiIiwicmVmZXJyaW5nX2RvbWFpbl9jdXJyZW50IjoiIiwicmVsZWFzZV9jaGFubmVsIjoic3RhYmxlIiwiY2xpZW50X2J1aWxkX251bWJlciI6MTQwNTc1LCJjbGllbnRfZXZlbnRfc291cmNlIjpudWxsfQ==\"\n    },\n    {\n        \"ja3\": \"771,4865-4867-4866-49195-49199-52393-52392-49196-49200-49162-49161-49171-49172-156-157-47-53,0-23-65281-10-11-35-16-5-51-43-13-45-28-65037,29-23-24-25-256-257,0\",\n        \"useragent\": \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10.15; rv:103.0) Gecko/20100101 Firefox/103.0\",\n        \"x-super-properties\": \"eyJvcyI6Ik1hYyBPUyBYIiwiYnJvd3NlciI6IkZpcmVmb3giLCJkZXZpY2UiOiIiLCJzeXN0ZW1fbG9jYWxlIjoiZW4tVVMiLCJicm93c2VyX3VzZXJfYWdlbnQiOiJNb3ppbGxhLzUuMCAoTWFjaW50b3NoOyBJbnRlbCBNYWMgT1MgWCAxMC4xNTsgcnY6MTAzLjApIEdlY2tvLzIwMTAwMTAxIEZpcmVmb3gvMTAzLjAiLCJicm93c2VyX3ZlcnNpb24iOiIxMDMuMCIsIm9zX3ZlcnNpb24iOiIxMC4xNSIsInJlZmVycmVyIjoiIiwicmVmZXJyaW5nX2RvbWFpbiI6IiIsInJlZmVycmVyX2N1cnJlbnQiOiIiLCJyZWZlcnJpbmdfZG9tYWluX2N1cnJlbnQiOiIiLCJyZWxlYXNlX2NoYW5uZWwiOiJzdGFibGUiLCJjbGllbnRfYnVpbGRfbnVtYmVyIjoxNDI4NjgsImNsaWVudF9ldmVudF9zb3VyY2UiOm51bGx9\"\n    },\n    {\n        \"ja3\": \"771,4865-4866-4867-49195-49199-49196-49200-52393-52392-49171-49172-156-157-47-53,0-23-65281-10-11-35-16-5-13-18-51-45-43-27-17513,29-23-24,0\",\n        \"useragent\": \"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/104.0.5112.81 Safari/537.36\",\n        \"x-super-properties\": \"eyJvcyI6Ik1hYyBPUyBYIiwiYnJvd3NlciI6IkNocm9tZSIsImRldmljZSI6IiIsInN5c3RlbV9sb2NhbGUiOiJlbi1HQiIsImJyb3dzZXJfdXNlcl9hZ2VudCI6Ik1vemlsbGEvNS4wIChNYWNpbnRvc2g7IEludGVsIE1hYyBPUyBYIDEwXzE1XzcpIEFwcGxlV2ViS2l0LzUzNy4zNiAoS0hUTUwsIGxpa2UgR2Vja28pIENocm9tZS8xMDQuMC41MTEyLjgxIFNhZmFyaS81MzcuMzYgIiwiYnJvd3Nlcl92ZXJzaW9uIjoiMTA0LjAuNTExMi44MSIsIm9zX3ZlcnNpb24iOiIxMC4xNS43IiwicmVmZXJyZXIiOiIiLCJyZWZlcnJpbmdfZG9tYWluIjoiIiwicmVmZXJyZXJfY3VycmVudCI6IiIsInJlZmVycmluZ19kb21haW5fY3VycmVudCI6IiIsInJlbGVhc2VfY2hhbm5lbCI6InN0YWJsZSIsImNsaWVudF9idWlsZF9udW1iZXIiOjE0Mjg2OCwiY2xpZW50X2V2ZW50X3NvdXJjZSI6bnVsbH0=\"\n    }\n]\n"
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 1.25,
          "content": "module github.com/V4NSH4J/discord-mass-dm-GO\n\ngo 1.18\n\nrequire (\n\tgithub.com/andybalholm/brotli v1.0.4\n\tgithub.com/chromedp/cdproto v0.0.0-20220428002153-285dfb42699c\n\tgithub.com/chromedp/chromedp v0.8.1\n\tgithub.com/gookit/color v1.5.0\n\tgithub.com/gorilla/websocket v1.5.0 // direct\n\tgithub.com/zenthangplus/goccm v0.0.0-20211005163543-2f2e522aca15\n\tgopkg.in/yaml.v3 v3.0.0-20210107192922-496545a6307b\n)\n\nrequire (\n\tgithub.com/Masterminds/semver v1.5.0\n\tgithub.com/chromedp/sysutil v1.0.0 // indirect\n\tgithub.com/gobwas/httphead v0.1.0 // indirect\n\tgithub.com/gobwas/pool v0.2.1 // indirect\n\tgithub.com/gobwas/ws v1.1.0 // indirect\n\tgithub.com/josharian/intern v1.0.0 // indirect\n\tgithub.com/mailru/easyjson v0.7.7 // indirect\n\tgithub.com/xo/terminfo v0.0.0-20210125001918-ca9a967f8778 // indirect\n\tgolang.org/x/sys v0.0.0-20220722155257-8c9f86f7a55f // indirect\n)\n\nrequire golang.org/x/crypto v0.0.0-20220525230936-793ad666bf5e // indirect\n\nrequire golang.org/x/net v0.0.0-20220726230323-06994584191e\n\nrequire (\n\tgithub.com/Danny-Dasilva/fhttp v0.0.0-20220524230104-f801520157d6\n\tgithub.com/Danny-Dasilva/utls v0.0.0-20220604023528-30cb107b834e\n\tgithub.com/dsnet/compress v0.0.1 // indirect\n\tgithub.com/stretchr/testify v1.7.1 // indirect\n\tgolang.org/x/text v0.3.7 // indirect\n)\n"
        },
        {
          "name": "go.sum",
          "type": "blob",
          "size": 7.6318359375,
          "content": "github.com/Danny-Dasilva/fhttp v0.0.0-20220524230104-f801520157d6 h1:Wzbitazy0HugGNRACX7ZB1En21LT/TiVF6YbxoTTqN8=\ngithub.com/Danny-Dasilva/fhttp v0.0.0-20220524230104-f801520157d6/go.mod h1:2IT2IFG+d+zzFuj3+ksGtVytcCBsF402zMNWHsWhD2U=\ngithub.com/Danny-Dasilva/utls v0.0.0-20220418175931-f38e470e04f2/go.mod h1:A2g8gPTJWDD3Y4iCTNon2vG3VcjdTBcgWBlZtopfNxU=\ngithub.com/Danny-Dasilva/utls v0.0.0-20220604023528-30cb107b834e h1:tqiguW0yAcIwQBQtD+d2rjBnboqB7CwG1OZ12F8avX8=\ngithub.com/Danny-Dasilva/utls v0.0.0-20220604023528-30cb107b834e/go.mod h1:ssfbVNUfWJVRfW41RTpedOUlGXSq3J6aLmirUVkDgJk=\ngithub.com/Masterminds/semver v1.5.0 h1:H65muMkzWKEuNDnfl9d70GUjFniHKHRbFPGBuZ3QEww=\ngithub.com/Masterminds/semver v1.5.0/go.mod h1:MB6lktGJrhw8PrUyiEoblNEGEQ+RzHPF078ddwwvV3Y=\ngithub.com/andybalholm/brotli v1.0.4 h1:V7DdXeJtZscaqfNuAdSRuRFzuiKlHSC/Zh3zl9qY3JY=\ngithub.com/andybalholm/brotli v1.0.4/go.mod h1:fO7iG3H7G2nSZ7m0zPUDn85XEX2GTukHGRSepvi9Eig=\ngithub.com/chromedp/cdproto v0.0.0-20220428002153-285dfb42699c h1:9VfguIWKAk161/xCyWLV23cJQmL3pDXKJHUSySQxT3s=\ngithub.com/chromedp/cdproto v0.0.0-20220428002153-285dfb42699c/go.mod h1:5Y4sD/eXpwrChIuxhSr/G20n9CdbCmoerOHnuAf0Zr0=\ngithub.com/chromedp/chromedp v0.8.1 h1:tZT0PNV9War7z6y3TS15NgBsP3J0AJcVRjABmdaBCmc=\ngithub.com/chromedp/chromedp v0.8.1/go.mod h1:qGzgSh6g5c2HYHwK5UMEA+1LIV/EKheZNALSDBcg4ag=\ngithub.com/chromedp/sysutil v1.0.0 h1:+ZxhTpfpZlmchB58ih/LBHX52ky7w2VhQVKQMucy3Ic=\ngithub.com/chromedp/sysutil v1.0.0/go.mod h1:kgWmDdq8fTzXYcKIBqIYvRRTnYb9aNS9moAV0xufSww=\ngithub.com/davecgh/go-spew v1.1.0 h1:ZDRjVQ15GmhC3fiQ8ni8+OwkZQO4DARzQgrnXU1Liz8=\ngithub.com/davecgh/go-spew v1.1.0/go.mod h1:J7Y8YcW2NihsgmVo/mv3lAwl/skON4iLHjSsI+c5H38=\ngithub.com/dsnet/compress v0.0.1 h1:PlZu0n3Tuv04TzpfPbrnI0HW/YwodEXDS+oPKahKF0Q=\ngithub.com/dsnet/compress v0.0.1/go.mod h1:Aw8dCMJ7RioblQeTqt88akK31OvO8Dhf5JflhBbQEHo=\ngithub.com/dsnet/golib v0.0.0-20171103203638-1ea166775780/go.mod h1:Lj+Z9rebOhdfkVLjJ8T6VcRQv3SXugXy999NBtR9aFY=\ngithub.com/gobwas/httphead v0.1.0 h1:exrUm0f4YX0L7EBwZHuCF4GDp8aJfVeBrlLQrs6NqWU=\ngithub.com/gobwas/httphead v0.1.0/go.mod h1:O/RXo79gxV8G+RqlR/otEwx4Q36zl9rqC5u12GKvMCM=\ngithub.com/gobwas/pool v0.2.1 h1:xfeeEhW7pwmX8nuLVlqbzVc7udMDrwetjEv+TZIz1og=\ngithub.com/gobwas/pool v0.2.1/go.mod h1:q8bcK0KcYlCgd9e7WYLm9LpyS+YeLd8JVDW6WezmKEw=\ngithub.com/gobwas/ws v1.1.0 h1:7RFti/xnNkMJnrK7D1yQ/iCIB5OrrY/54/H930kIbHA=\ngithub.com/gobwas/ws v1.1.0/go.mod h1:nzvNcVha5eUziGrbxFCo6qFIojQHjJV5cLYIbezhfL0=\ngithub.com/gookit/color v1.5.0 h1:1Opow3+BWDwqor78DcJkJCIwnkviFi+rrOANki9BUFw=\ngithub.com/gookit/color v1.5.0/go.mod h1:43aQb+Zerm/BWh2GnrgOQm7ffz7tvQXEKV6BFMl7wAo=\ngithub.com/gorilla/websocket v1.5.0 h1:PPwGk2jz7EePpoHN/+ClbZu8SPxiqlu12wZP/3sWmnc=\ngithub.com/gorilla/websocket v1.5.0/go.mod h1:YR8l580nyteQvAITg2hZ9XVh4b55+EU/adAjf1fMHhE=\ngithub.com/josharian/intern v1.0.0 h1:vlS4z54oSdjm0bgjRigI+G1HpF+tI+9rE5LLzOg8HmY=\ngithub.com/josharian/intern v1.0.0/go.mod h1:5DoeVV0s6jJacbCEi61lwdGj/aVlrQvzHFFd8Hwg//Y=\ngithub.com/klauspost/compress v1.4.1/go.mod h1:RyIbtBH6LamlWaDj8nUwkbUhJ87Yi3uG0guNDohfE1A=\ngithub.com/klauspost/cpuid v1.2.0/go.mod h1:Pj4uuM528wm8OyEC2QMXAi2YiTZ96dNQPGgoMS4s3ek=\ngithub.com/mailru/easyjson v0.7.7 h1:UGYAvKxe3sBsEDzO8ZeWOSlIQfWFlxbzLZe7hwFURr0=\ngithub.com/mailru/easyjson v0.7.7/go.mod h1:xzfreul335JAWq5oZzymOObrkdz5UnU4kGfJJLY9Nlc=\ngithub.com/orisano/pixelmatch v0.0.0-20210112091706-4fa4c7ba91d5 h1:1SoBaSPudixRecmlHXb/GxmaD3fLMtHIDN13QujwQuc=\ngithub.com/pmezard/go-difflib v1.0.0 h1:4DBwDE0NGyQoBHbLQYPwSUPoCMWR5BEzIk/f1lZbAQM=\ngithub.com/pmezard/go-difflib v1.0.0/go.mod h1:iKH77koFhYxTK1pcRnkKkqfTogsbg7gZNVY4sRDYZ/4=\ngithub.com/stretchr/objx v0.1.0/go.mod h1:HFkY916IF+rwdDfMAkV7OtwuqBVzrE8GR6GFx+wExME=\ngithub.com/stretchr/testify v1.7.0/go.mod h1:6Fq8oRcR53rry900zMqJjRRixrwX3KX962/h/Wwjteg=\ngithub.com/stretchr/testify v1.7.1 h1:5TQK59W5E3v0r2duFAb7P95B6hEeOyEnHRa8MjYSMTY=\ngithub.com/stretchr/testify v1.7.1/go.mod h1:6Fq8oRcR53rry900zMqJjRRixrwX3KX962/h/Wwjteg=\ngithub.com/ulikunitz/xz v0.5.6/go.mod h1:2bypXElzHzzJZwzH67Y6wb67pO62Rzfn7BSiF4ABRW8=\ngithub.com/xo/terminfo v0.0.0-20210125001918-ca9a967f8778 h1:QldyIu/L63oPpyvQmHgvgickp1Yw510KJOqX7H24mg8=\ngithub.com/xo/terminfo v0.0.0-20210125001918-ca9a967f8778/go.mod h1:2MuV+tbUrU1zIOPMxZ5EncGwgmMJsa+9ucAQZXxsObs=\ngithub.com/zenthangplus/goccm v0.0.0-20211005163543-2f2e522aca15 h1:0UwX38TojH86Dl0n4OwPMNYy8hNs2NhtzwY4RlvANlA=\ngithub.com/zenthangplus/goccm v0.0.0-20211005163543-2f2e522aca15/go.mod h1:DUzu/BC4TkgUfXP8J1P6Md73Djt+0l0CHq001Pt4weA=\ngitlab.com/yawning/bsaes.git v0.0.0-20190805113838-0a714cd429ec/go.mod h1:BZ1RAoRPbCxum9Grlv5aeksu2H8BiKehBYooU2LFiOQ=\ngolang.org/x/crypto v0.0.0-20190308221718-c2843e01d9a2/go.mod h1:djNgcEr1/C05ACkg1iLfiJU5Ep61QUkGW8qpdssI0+w=\ngolang.org/x/crypto v0.0.0-20190325154230-a5d413f7728c/go.mod h1:djNgcEr1/C05ACkg1iLfiJU5Ep61QUkGW8qpdssI0+w=\ngolang.org/x/crypto v0.0.0-20220411220226-7b82a4e95df4/go.mod h1:IxCIyHEi3zRg3s0A5j5BB6A9Jmi73HwBIUl50j+osU4=\ngolang.org/x/crypto v0.0.0-20220525230936-793ad666bf5e h1:T8NU3HyQ8ClP4SEE+KbFlg6n0NhuTsN4MyznaarGsZM=\ngolang.org/x/crypto v0.0.0-20220525230936-793ad666bf5e/go.mod h1:IxCIyHEi3zRg3s0A5j5BB6A9Jmi73HwBIUl50j+osU4=\ngolang.org/x/net v0.0.0-20190328230028-74de082e2cca/go.mod h1:t9HGtf8HONx5eT2rtn7q6eTqICYqUVnKs3thJo3Qplg=\ngolang.org/x/net v0.0.0-20211112202133-69e39bad7dc2/go.mod h1:9nx3DQGgdP8bBQD5qxJ1jj9UTztislL4KSBs9R2vV5Y=\ngolang.org/x/net v0.0.0-20220726230323-06994584191e h1:wOQNKh1uuDGRnmgF0jDxh7ctgGy/3P4rYWQRVJD4/Yg=\ngolang.org/x/net v0.0.0-20220726230323-06994584191e/go.mod h1:AaygXjzTFtRAg2ttMY5RMuhpJ3cNnI0XpyFJD1iQRSM=\ngolang.org/x/sys v0.0.0-20190215142949-d0b11bdaac8a/go.mod h1:STP8DvDyc/dI5b8T5hshtkjS+E42TnysNCUPdjciGhY=\ngolang.org/x/sys v0.0.0-20190804053845-51ab0e2deafa/go.mod h1:h1NjWce9XRLGQEsW7wpKNCjG9DtNlClVuFLEZdDNbEs=\ngolang.org/x/sys v0.0.0-20201119102817-f84b799fce68/go.mod h1:h1NjWce9XRLGQEsW7wpKNCjG9DtNlClVuFLEZdDNbEs=\ngolang.org/x/sys v0.0.0-20201207223542-d4d67f95c62d/go.mod h1:h1NjWce9XRLGQEsW7wpKNCjG9DtNlClVuFLEZdDNbEs=\ngolang.org/x/sys v0.0.0-20210330210617-4fbd30eecc44/go.mod h1:h1NjWce9XRLGQEsW7wpKNCjG9DtNlClVuFLEZdDNbEs=\ngolang.org/x/sys v0.0.0-20210423082822-04245dca01da/go.mod h1:h1NjWce9XRLGQEsW7wpKNCjG9DtNlClVuFLEZdDNbEs=\ngolang.org/x/sys v0.0.0-20210615035016-665e8c7367d1/go.mod h1:oPkhp1MJrh7nUepCBck5+mAzfO9JrbApNNgaTdGDITg=\ngolang.org/x/sys v0.0.0-20220412211240-33da011f77ad/go.mod h1:oPkhp1MJrh7nUepCBck5+mAzfO9JrbApNNgaTdGDITg=\ngolang.org/x/sys v0.0.0-20220722155257-8c9f86f7a55f h1:v4INt8xihDGvnrfjMDVXGxw9wrfxYyCjk0KbXjhR55s=\ngolang.org/x/sys v0.0.0-20220722155257-8c9f86f7a55f/go.mod h1:oPkhp1MJrh7nUepCBck5+mAzfO9JrbApNNgaTdGDITg=\ngolang.org/x/term v0.0.0-20201126162022-7de9c90e9dd1/go.mod h1:bj7SfCRtBDWHUb9snDiAeCFNEtKQo2Wmx5Cou7ajbmo=\ngolang.org/x/term v0.0.0-20210615171337-6886f2dfbf5b/go.mod h1:jbD1KX2456YbFQfuXm/mYQcufACuNUgVhRMnK/tPxf8=\ngolang.org/x/text v0.3.0/go.mod h1:NqM8EUOU14njkJ3fqMW+pc6Ldnwhi/IjpwHt7yyuwOQ=\ngolang.org/x/text v0.3.6/go.mod h1:5Zoc/QRtKVWzQhOtBMvqHzDpF6irO9z98xDceosuGiQ=\ngolang.org/x/text v0.3.7 h1:olpwvP2KacW1ZWvsR7uQhoyTYvKAupfQrRGBFM352Gk=\ngolang.org/x/text v0.3.7/go.mod h1:u+2+/6zg+i71rQMx5EYifcz6MCKuco9NR6JIITiCfzQ=\ngolang.org/x/tools v0.0.0-20180917221912-90fa682c2a6e/go.mod h1:n7NCudcB/nEzxVGmLbDWY5pfWTLqBcC2KZ6jyYvM4mQ=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405 h1:yhCVgyC4o1eVCa2tZl7eS0r+SDo693bJlVdllGtEeKM=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405/go.mod h1:Co6ibVJAznAaIkqp8huTwlJQCZ016jof/cbN4VW5Yz0=\ngopkg.in/yaml.v3 v3.0.0-20200313102051-9f266ea9e77c/go.mod h1:K4uyk7z7BCEPqu6E+C64Yfv1cQ7kz7rIZviUmN+EgEM=\ngopkg.in/yaml.v3 v3.0.0-20210107192922-496545a6307b h1:h8qDotaEPuJATrMmW04NCwg7v22aHH28wwpauUhK9Oo=\ngopkg.in/yaml.v3 v3.0.0-20210107192922-496545a6307b/go.mod h1:K4uyk7z7BCEPqu6E+C64Yfv1cQ7kz7rIZviUmN+EgEM=\n"
        },
        {
          "name": "input",
          "type": "tree",
          "content": null
        },
        {
          "name": "instance",
          "type": "tree",
          "content": null
        },
        {
          "name": "main.go",
          "type": "blob",
          "size": 4.880859375,
          "content": "// Copyright (C) 2021 github.com/V4NSH4J\n//\n// This source code has been released under the GNU Affero General Public\n// License v3.0. A copy of this license is available at\n// https://www.gnu.org/licenses/agpl-3.0.en.html\n\npackage main\n\nimport (\n\t\"math/rand\"\n\t\"os\"\n\t\"time\"\n\n\t\"github.com/V4NSH4J/discord-mass-dm-GO/discord\"\n\t\"github.com/V4NSH4J/discord-mass-dm-GO/utilities\"\n\t\"github.com/gookit/color\"\n)\n\nfunc main() {\n\tversion := \"1.11.2\"\n\trand.Seed(time.Now().UTC().UnixNano())\n\tcolor.Blue.Printf(logo + \" v\" + version + \"\\n\")\n\tcolor.Green.Printf(\"Made by https://github.com/V4NSH4J\\nStar repository on github for updates!\\n\")\n\tutilities.VersionCheck(version)\n\tOptions()\n}\n\n// Options menu\nfunc Options() {\n\tutilities.PrintMenu([]string{\"Invite Joiner\", \"Mass DM\", \"Single DM\", \"Reaction Adder\", \"Email:Password:Token to Token\", \"Token Checker\", \"Guild Leaver\", \"Token Onliner\", \"Scraping Menu\", \"Name Changer\", \"Avatar Changer\", \"Token Server Checker\", \"Bio Changer\", \"DM on Reaction\", \"Hypesquad Changer\", \"Token Password Changer\", \"Embed Maker\", \"Login into Token\", \"Token Nuker\", \"Button Presser\", \"Server Nickname Changer\", \"Friend Request Spammer\", \"Friends Mass DM\", \"New Mass DM [ALPHA]\",\"Credits & Help\", \"Exit\"})\n\tchoice := utilities.UserInputInteger(\"Enter your choice!\")\n\tswitch choice {\n\tdefault:\n\t\tcolor.Red.Printf(\"Invalid choice!\\n\")\n\t\tOptions()\n\tcase 1:\n\t\tcolor.Cyan.Printf(\"Invite Joiner\\n\")\n\t\tdiscord.LaunchinviteJoiner()\n\tcase 2:\n\t\tcolor.Cyan.Printf(\"Mass DM advertiser\\n\")\n\t\tdiscord.LaunchMassDM()\n\tcase 3:\n\t\tcolor.Cyan.Printf(\"Single DM spam\\n\")\n\t\tdiscord.LaunchSingleDM()\n\tcase 4:\n\t\tcolor.Cyan.Printf(\"Reaction Adder\\n\")\n\t\tdiscord.LaunchReactionAdder()\n\tcase 5:\n\t\tcolor.Cyan.Printf(\"Email:Pass:Token to Token\\n\")\n\t\tdiscord.LaunchTokenFormatter()\n\tcase 6:\n\t\tcolor.Cyan.Printf(\"Token Checker\\n\")\n\t\tdiscord.LaunchTokenChecker()\n\tcase 7:\n\t\tcolor.Cyan.Printf(\"Guild Leaver\\n\")\n\t\tdiscord.LaunchGuildLeaver()\n\tcase 8:\n\t\tcolor.Cyan.Printf(\"Token Onliner\\n\")\n\t\tdiscord.LaunchTokenOnliner()\n\tcase 9:\n\t\tcolor.Cyan.Printf(\"Scraping Menu\\n\")\n\t\tdiscord.LaunchScraperMenu()\n\tcase 10:\n\t\tcolor.Cyan.Printf(\"Name Changer\\n\")\n\t\tdiscord.LaunchNameChanger()\n\tcase 11:\n\t\tcolor.Cyan.Printf(\"Profile Picture Changer\\n\")\n\t\tdiscord.LaunchAvatarChanger()\n\tcase 12:\n\t\tcolor.Cyan.Printf(\"Token Servers Check\\n\")\n\t\tdiscord.LaunchServerChecker()\n\tcase 13:\n\t\tcolor.Cyan.Printf(\"Bio Changer\\n\")\n\t\tdiscord.LaunchBioChanger()\n\tcase 14:\n\t\tcolor.Cyan.Printf(\"DM on React\\n\")\n\t\tdiscord.LaunchDMReact()\n\tcase 15:\n\t\tcolor.Cyan.Printf(\"Hypesquad Changer\\n\")\n\t\tdiscord.LaunchHypeSquadChanger()\n\tcase 16:\n\t\tcolor.Cyan.Printf(\"Mass token changer\\n\")\n\t\tdiscord.LaunchTokenChanger()\n\tcase 17:\n\t\tcolor.Cyan.Printf(\"Create Embed\\n\")\n\t\tdiscord.LanuchEmbed()\n\tcase 18:\n\t\tcolor.Cyan.Printf(\"Login into Token\\n\")\n\t\tdiscord.LaunchTokenLogin()\n\tcase 19:\n\t\tcolor.Cyan.Printf(\"Token Nuker\\n\")\n\t\tdiscord.LaunchTokenNuker()\n\tcase 20:\n\t\tcolor.Cyan.Printf(\"Button Press\\n\")\n\t\tdiscord.LaunchButtonClicker()\n\tcase 21:\n\t\tcolor.Cyan.Printf(\"Server Nickname Changer\\n\")\n\t\tdiscord.LaunchServerNicknameChanger()\n\tcase 22:\n\t\tcolor.Cyan.Printf(\"Friend Request Spammer\\n\")\n\t\tdiscord.LaunchFriendRequestSpammer()\n\tcase 23:\n\t\tcolor.Cyan.Printf(\"Friends Mass DM\\n\")\n\t\tdiscord.LaunchFriendSpammer()\n\tcase 24:\n\t\tcolor.Cyan.Printf(\"New Mass DM\\n\")\n\t\tdiscord.LaunchAntiAntiRaidMode()\n\tcase 25:\n\t\tcolor.Blue.Printf(\"Made with <3 by github.com/V4NSH4J - Check out the github page for detailed documentation\\n\")\n\tcase 26:\n\t\tos.Exit(0)\n\t}\n\ttime.Sleep(1 * time.Second)\n\tOptions()\n\n}\n\nconst logo = \"\\r\\n\\r\\n\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2557 \\u2588\\u2588\\u2588\\u2557   \\u2588\\u2588\\u2588\\u2557\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2557  \\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2557  \\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2557 \\r\\n\\u2588\\u2588\\u2554\\u2550\\u2550\\u2588\\u2588\\u2557\\u2588\\u2588\\u2588\\u2588\\u2557 \\u2588\\u2588\\u2588\\u2588\\u2551\\u2588\\u2588\\u2554\\u2550\\u2550\\u2588\\u2588\\u2557\\u2588\\u2588\\u2554\\u2550\\u2550\\u2550\\u2550\\u255D \\u2588\\u2588\\u2554\\u2550\\u2550\\u2550\\u2588\\u2588\\u2557\\r\\n\\u2588\\u2588\\u2551  \\u2588\\u2588\\u2551\\u2588\\u2588\\u2554\\u2588\\u2588\\u2588\\u2588\\u2554\\u2588\\u2588\\u2551\\u2588\\u2588\\u2551  \\u2588\\u2588\\u2551\\u2588\\u2588\\u2551  \\u2588\\u2588\\u2588\\u2557\\u2588\\u2588\\u2551   \\u2588\\u2588\\u2551\\r\\n\\u2588\\u2588\\u2551  \\u2588\\u2588\\u2551\\u2588\\u2588\\u2551\\u255A\\u2588\\u2588\\u2554\\u255D\\u2588\\u2588\\u2551\\u2588\\u2588\\u2551  \\u2588\\u2588\\u2551\\u2588\\u2588\\u2551   \\u2588\\u2588\\u2551\\u2588\\u2588\\u2551   \\u2588\\u2588\\u2551\\r\\n\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2554\\u255D\\u2588\\u2588\\u2551 \\u255A\\u2550\\u255D \\u2588\\u2588\\u2551\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2554\\u255D\\u255A\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2554\\u255D\\u255A\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2554\\u255D\\r\\n\\u255A\\u2550\\u2550\\u2550\\u2550\\u2550\\u255D \\u255A\\u2550\\u255D     \\u255A\\u2550\\u255D\\u255A\\u2550\\u2550\\u2550\\u2550\\u2550\\u255D  \\u255A\\u2550\\u2550\\u2550\\u2550\\u2550\\u255D  \\u255A\\u2550\\u2550\\u2550\\u2550\\u2550\\u255D \\r\\nDISCORD MASS DM GO\"\n"
        },
        {
          "name": "message.json",
          "type": "blob",
          "size": 0.0859375,
          "content": "[\n  {\n    \"content\": \"Hi <user> join my telegram server https://t.me/tosviolators\"\n  }\n]"
        },
        {
          "name": "tokenLogin.js",
          "type": "blob",
          "size": 0.4296875,
          "content": "// Code taken from https://gist.github.com/m-Phoenix852/b47fffb0fd579bc210420cedbda30b61\n// Complete credits to original creator (https://github.com/m-Phoenix852)\n\nlet token = \"asdfgh\";\n\nfunction login(token) {\n    setInterval(() => {\n      document.body.appendChild(document.createElement `iframe`).contentWindow.localStorage.token = `\"${token}\"`\n    }, 50);\n    setTimeout(() => {\n      location.reload();\n    }, 2500);\n  }\n\nlogin(token);"
        },
        {
          "name": "utilities",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}