{
  "metadata": {
    "timestamp": 1736564412121,
    "page": 12,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "openreplay/openreplay",
      "stars": 9708,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0712890625,
          "content": "public\n.cache\nnode_modules\n*DS_Store\n*.env\n*.log\n**/*.envrc\n.idea\n*.mob*\n"
        },
        {
          "name": ".pre-commit-config.yaml",
          "type": "blob",
          "size": 0.1611328125,
          "content": "repos:\n  - repo: https://github.com/gitguardian/ggshield\n    rev: v1.14.5\n    hooks:\n      - id: ggshield\n        language_version: python3\n        stages: [commit]\n"
        },
        {
          "name": "CLA.md",
          "type": "blob",
          "size": 10.3232421875,
          "content": "## Individual and Entity Contributor License Agreement (CLA)\n\nThank you for your interest in contributing to software projects managed by Asayer, Inc. (“We” or “Us”). This Contributor License Agreement (“Agreement”) documents the rights granted by contributors to Us. This Agreement is for your protection as a contributor as well as for our protection; it does not change your rights to use your own Contributions for any other purpose. To make this document effective, please read the Agreement carefully and then sign it. By signing this Agreement (including by clicking “I agree” or \"Sign in with GitHub to agree\" and submitting it to us electronically), You are creating a legally binding contract which becomes effective upon your signature or agreement. If You are less than eighteen years old, please have Your parents or guardian sign the Agreement. This Agreement covers your present, and all future, Contributions from You, and may cover more than one software project managed by Us.\n\n### 1. Definitions\n\n“Affiliates” means any Legal Entities that control, are controlled by, or under common control with another Legal Entity. For the purposes of this definition, “control” means (i) the power, direct or indirect, to cause the direction or management of such Legal Entity, whether by contract or otherwise, (ii) ownership of fifty percent (50%) or more of the outstanding shares or securities which vote to elect the management or other persons who direct such Legal Entity or (iii) beneficial ownership of such entity. \n\n“Contribution” means any work of authorship that is Submitted by You to Us in which You own or assert ownership of the Copyright. If You do not own the Copyright in the entire work of authorship, please contact us before Submitting the Contribution.\n\n“Copyright” means all rights protecting works of authorship owned or controlled by You or your Affiliates (as may be applicable), including copyright, moral and related (or neighboring) rights, as appropriate, for the full term of their existence, including any extensions by You.\n\n“Legal Entity” means an entity which is not a natural person. \n\n“Media” means any portion of a Contribution which is not software. \n\n“Submit” means any form of electronic or written communication, or recorded verbal communication, sent to Us or our representatives at a destination (including websites) that we own or control or that is otherwise registered to us, including but not limited to electronic mailing lists, source code control systems, instant messages or similar communications, and issue tracking systems that are managed by, or on behalf of, Us for the purpose of discussing and improving the Work, but excluding any communication that is conspicuously marked or otherwise designated in writing by You as “Not a Contribution.”\n\n“Work” means any of the products or projects owned or managed by Us, and any work of authorship which is made available by Us to third parties. When this Agreement covers more than one software project, Work means the work of authorship to which your Contribution was Submitted. After You Submit the Contribution, it may be included in the Work.\n\n“You” means (i) the individual who Submits a Contribution to Us, if You are an individual acting on your own behalf, or (ii) the Legal Entity on behalf of whom you Submit a Contribution to Us if you are are Submitting any Contribution on behalf of any entity.\n\n### 2. Grant of Rights\n\n#### 2.1 Copyright License\n\n(a) Except for the license granted to Us in this Agreement, You reserve all right, title, and interest in and to Your Contributions. That means that you can keep doing whatever you want with your Contribution, and you can license it to anyone you want under any terms you want.\n\n(b) To the maximum extent permitted by the relevant law, You grant to Us a perpetual, worldwide, non-exclusive, transferable, no charge and royalty-free, irrevocable license under the Copyright covering the Contribution, with the right to sublicense such rights through multiple tiers of sublicensees, to reproduce, modify, display, perform, sublicense and distribute the Contribution as part of the Work; provided that this license is conditioned upon compliance with Section 2.3.\n\n#### 2.2 Patent License\n\nFor patent claims, including without limitation method, process, and apparatus claims which You (or Your Affiliates, as may be applicable) own, control or have the right to grant, now or in the future, You grant to Us, and to recipients of software distributed by the Us, a perpetual, worldwide, non-exclusive, transferable, no charge and royalty-free, irrevocable patent license, with the right to sublicense these rights to multiple tiers of sublicensees, to make, have made, use, sell, offer for sale, import and otherwise transfer the Contribution (and the Contribution in combination with the Work, and portions of such combination). This license is granted only to the extent that the exercise of the licensed rights infringes such patent claims; and provided that this license is conditioned upon compliance with Section 2.3. If any person or entity institutes patent litigation against Contributor or any other entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Contributions, or the Work to which the Contributions were submitted, constitutes direct or contributory patent infringement, then any patent licenses granted under this Agreement for that Contribution to the person or entity instituting the litigation, or the Work to which the Contributions were submitted, shall terminate as of the date such litigation is filed.\n\n#### 2.3 Outbound License\n\nBased on the grant of rights in Sections 2.1 (meaning, no matter what, you can keep licensing your Contribution to others however you want) and 2.2, if We include Your Contribution in any Work, and if We determine that it is appropriate for the purpose of commercializing any Work or any project under Our control, we may license the Contribution under any license, including copyleft, permissive, commercial, or proprietary licenses. As a condition on the exercise of this right, We agree to also use reasonable efforts to continue to license Your Contribution (in the same or other projects or Works) under the terms of the license or licenses under which you Submitted Your Contribution.\n\n#### 2.4 Moral Rights\n\nWe agree to comply with applicable laws regarding your Contribution, including copyright laws and law related to moral rights. If moral rights apply to the Contribution, to the maximum extent permitted by law, You waive and agree not to assert such moral rights against Us or our successors in interest, or any of our licensees, either direct or indirect.\n\n#### 2.5 Our Rights\n\nYou acknowledge that We are not obligated to use Your Contribution as part of any Work, and that we and may decide to include any Contribution We consider appropriate.\n\n#### 2.6 Reservation of Rights\n\nAny rights in Your Contribution not expressly licensed under this Agreement are expressly reserved by You.\n\n### 3. Representations\n\nYou represent (promise) that You are legally entitled to grant the above licenses. If Your employer(s) has rights to intellectual property that you create that includes your Contributions, You represent that You have received permission to make Contributions on behalf of that employer, that Your employer has waived such rights for your Contributions to Us, or that Your employer has executed a separate Corporate Contributor License Agreement with Us.\n\nYou further represent that each of Your Contributions is Your original creation. You represent that Your Contribution submissions include complete details of any third-party license or other restriction (including, but not limited to, related patents and trademarks) of which you are personally aware and which are associated with any part of Your Contributions.\n\nYou agree to notify Us of any facts or circumstances of which you become aware that would make these representations inaccurate in any respect.\n\n### 4. Disclaimer\n\nEXCEPT FOR THE EXPRESS WARRANTIES IN SECTION 3, YOUR CONTRIBUTION IS PROVIDED \"AS IS\". YOU EXPRESSLY DISCLAIM ALL OTHER EXPRESS WARRANTIES AND ALL IMPLIED WARRANTIES. TO THE EXTENT THAT ANY SUCH WARRANTIES CANNOT BE DISCLAIMED, SUCH WARRANTY IS LIMITED IN DURATION TO THE MINIMUM PERIOD PERMITTED BY LAW.\n\n### 5. Miscellaneous\n\n5.1 This Agreement will be governed by and construed in accordance with the laws of the State of Delaware, without regard to conflicts of law provisions. If any provision of this Agreement shall be adjudged by any court of competent jurisdiction to be unenforceable or invalid, that provision shall be limited or eliminated to the minimum extent necessary so that this Agreement shall otherwise remain in full force and effect and enforceable. The sole venue for all disputes relating to this Agreement shall be in the New Castle County, Delaware (USA). The rights and obligations of the parties under this Agreement shall not be governed by the 1980 U.N. Convention on Contracts for the International Sale of Goods.\n\n5.2 This Agreement may be amended only by a written document signed by the party against whom enforcement is sought.\n\n5.3 The failure of either party to require performance by the other party of any provision of this Agreement in one situation shall not affect the right of a party to require such performance at any time in the future. A waiver of performance under a provision in one situation shall not be considered a waiver of the performance of the provision in the future or a waiver of the provision in its entirety.\n\n5.4 If any provision of this Agreement is found void and unenforceable, such provision will be replaced to the extent possible with a provision that comes closest to the meaning of the original provision and which is enforceable. The terms and conditions set forth in this Agreement shall apply notwithstanding any failure of essential purpose of this Agreement or any limited remedy to the maximum extent possible under law.\n\n**This Agreement contains the entire understanding of the parties regarding the subject matter of this Agreement and supersedes all prior and contemporaneous negotiations and agreements, whether written or oral, between the parties with respect to the subject matter of this Agreement.**\n\nBy signing this agreement, Contributor accepts and agrees to the preceding terms and conditions for Contributor’s present and future Contributions submitted to Us. \n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.09375,
          "content": "## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as contributors and maintainers pledge to making participation in our project and our community a harassment-free experience for everyone, regardless of age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment include:\n- Using welcoming and inclusive language\n- Being respectful of differing viewpoints and experiences\n- Gracefully accepting constructive criticism\n- Focusing on what is best for the community\n- Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n- The use of sexualized language or imagery and unwelcome sexual attention or advances\n- Trolling, insulting/derogatory comments, and personal or political attacks\n- Public or private harassment\n- Publishing others' private information, such as a physical or electronic address, without explicit permission\n- Other conduct which could reasonably be considered inappropriate in a professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces when an individual is representing the project or its community. Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event. Representation of a project may be further defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team at [hey@openreplay.com](mailto:hey@openreplay.com). The project team will review and investigate all complaints, and will respond in a way that it deems appropriate to the circumstances. The project team is obligated to maintain confidentiality with regard to the reporter of an incident. Further details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant](https://contributor-covenant.org/), version 1.4, available at [https://contributor-covenant.org/version/1/4](https://contributor-covenant.org/version/1/4/)\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.681640625,
          "content": "We're glad you're considering contributing to OpenReplay. Each and every contribution is highly appreciated. Don't worry if you're not sure how to get things started. Although we don't want a wall of rules to stand in the way of your contribution, this document should give a bit more guidance on the best way to proceed. If you still have questions, reach out for help.\n\n## Code of Conduct\n\nBy participating in this project, you are expected to uphold our [Code of Conduct](CODE_OF_CONDUCT.md).\n\n## First-time Contributors\n\nWe appreciate all contributions, especially those coming from first time contributors. Good first issues is the best way start. If you're not sure how to help, feel free to reach out anytime for assistance via [email](mailto:hey@openreplay.com) or [Slack](https://slack.openreplay.com). All contributors must approve our [Contributor License Agreement](https://cla-assistant.io/openreplay/openreplay).\n\n## Areas for Contributing\n\n### Documentation\n\nWe want to keep our docs comprehensive, concise and updated. We are grateful for any kind of contribution in this area:\n- Report missing sections\n- Fix errors in the existing docs\n- Add content to the docs\n\n### Community Content\n\nWe're happy about contributions that participate in educating our community, such as:\n- Writing technical blog post\n- Adding new user guides\n- Organizing a workshop\n- Speaking at an event\n\nWe have a repo dedicated to community content. Feel free to submit a pull request in this repo, if you have something to add even if it's not related to what's mentioned above.\n\n### OpenReplay Core\n\nWe have some issues on core components that are suitable for open source contributions. If you know Go or JavaScript, check out our issue list.\n\n## Ways to Contribute\n\n### Writing Code\n\nWe love all code contributions, big or small. A few things to keep in mind:\n\n- Please make sure there is an issue associated with what you're working on\n- If you're tackling an issue, please comment on that to prevent duplicate work by others\n- We follow the [fork-and-branch](https://blog.scottlowe.org/2015/01/27/using-fork-branch-git-workflow/) approach\n- Squash your commits and refer to the issue using `fix #<issue-no>` in the commit message\n- Rebase master with your branch before submitting a pull request.\n\nIf you're planning to work on a bigger feature that is not on the list of issues, please raise an issue first so we can check whether it makes sense for OpenReplay as a whole.\n\nCheck our Review Process below.\n\n### Reporting Bugs\n\nBug reports help us make OpenReplay better for everyone. Before raising a new issue:\n- Search within the list of reported bugs so you're not dealing with a duplicate\n- Make sure you test against the last released version (we may have fixed it already)\n- Provide clear steps to reproduce the issue and attach logs if relevant\n\n### Reporting Security Flaws\n\nPlease do not create a public GitHub issue. If you find a security flaw, please email us directly at [security@openreplay.com](mailto:security@openreplay.com) instead of raising an issue.\n\n### Upvoting Issues and Requesting Features\n\nUpvoting issues and requesting new features is the best way to tell us what you'd like us to build and helps prioritize our efforts. Don't refrain from doing that but make sure to watch out for duplicates by looking at the feature-request list.\n\n## Review Process\n\nWe try to answer the below questions when reviewing a PR:\n- Does the PR fix the issue?\n- Does the proposed solution makes sense?\n- How will it perform with millions of sessions and users events?\n- Has it been tested?\n- Is it introducing any security flaws?\n- Did the contributor approve our CLA?\n\nOnce your PR passes, we will merge it. Otherwise, we'll politely ask you to make a change.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 35.66015625,
          "content": "Copyright (c) 2021-2024 Asayer, Inc dba OpenReplay\n\nOpenReplay monorepo uses multiple licenses. Portions of this software are licensed as follows:\n- All content that resides under the \"ee/\" directory of this repository, is licensed under the license defined in \"ee/LICENSE\".\n- All third party components incorporated into the OpenReplay Software are licensed under the original license provided by the owner of the applicable component.\n- Some directories are licensed under the \"MIT\" license, as defined below.\n- Content outside of the above mentioned directories or restrictions defaults to the \"GNU Affero General Public License Version 3 (AGPL v3)\" license, as defined below.\n\nReach out (license@openreplay.com) if you have any questions regarding licenses.\n\n--------------------------------------------------------------------------------\n                              MIT LICENSE\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--------------------------------------------------------------------------------\n                    GNU AFFERO GENERAL PUBLIC LICENSE\n                       Version 3, 19 November 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<https://www.gnu.org/licenses/>.\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.6806640625,
          "content": "<p align=\"center\">\n  <a href=\"/README_FR.md\">Français</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_ESP.md\">Español</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">Русский</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_AR.md\">العربية</a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://openreplay.com/#gh-light-mode-only\">\n    <img src=\"static/openreplay-git-banner-light.png\" width=\"100%\">\n  </a>\n    <a href=\"https://openreplay.com/#gh-dark-mode-only\">\n    <img src=\"static/openreplay-git-banner-dark.png\" width=\"100%\">\n  </a>\n</p>\n\n<h3 align=\"center\">Session replay for developers</h3>\n<p align=\"center\">The most advanced session replay for building delightful web apps.</p>\n\n<p align=\"center\">\n  <a href=\"https://docs.openreplay.com/deployment/deploy-aws\">\n    <img src=\"static/btn-deploy-aws.svg\" height=\"40\"/>\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-gcp\">\n    <img src=\"static/btn-deploy-google-cloud.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-azure\">\n    <img src=\"static/btn-deploy-azure.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-digitalocean\">\n    <img src=\"static/btn-deploy-digital-ocean.svg\" height=\"40\" />\n  </a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/openreplay/openreplay\">\n    <img src=\"static/openreplay-git-hero.svg\">\n  </a>\n</p>\n\nOpenReplay is an open-source session replay suite you can host yourself, that lets you see what users do on your web app, helping you troubleshoot issues faster.\n\n- **Session replay.** OpenReplay replays what users do, but not only. It also shows you what went under the hood, how your website or app behaves by capturing network activity, console logs, JS errors, store actions/state, page speed metrics, cpu/memory usage and much more.\n- **Low footprint**. With a ~26KB (.br) tracker that asynchronously sends minimal data for a very limited impact on performance.\n- **Self-hosted**. No more security compliance checks, 3rd-parties processing user data. Everything OpenReplay captures stays in your cloud for a complete control over your data.\n- **Privacy controls**. Fine-grained security features for sanitizing user data.\n- **Easy deploy**. With support of major public cloud providers (AWS, GCP, Azure, DigitalOcean).\n\n## Features\n\n- **Session replay:** Lets you relive your users' experience, see where they struggle and how it affects their behavior. Each session replay is automatically analyzed based on heuristics, for easy triage.\n- **Spot:** A Chrome extension that lets record bugs directly from your browser — each recording includes all the technical details developers need to fix them.\n- **DevTools:** It's like debugging in your own browser. OpenReplay provides you with the full context (network activity, JS errors, store actions/state and 40+ metrics) so you can instantly reproduce bugs and understand performance issues.\n- **Assist:** Helps you support your users by seeing their live screen and instantly hopping on call (WebRTC) with them without requiring any 3rd-party screen sharing software.\n- **Omni-search:** Search and filter by almost any user action/criteria, session attribute or technical event, so you can answer any question. No instrumentation required.\n- **Analytics:** For surfacing the most impactful issues causing conversion and revenue loss.\n- **Fine-grained privacy controls:** Choose what to capture, what to obscure or what to ignore so user data doesn't even reach your servers.\n- **Plugins oriented:** Get to the root cause even faster by tracking application state (Redux, VueX, MobX, NgRx, Pinia and Zustand) and logging GraphQL queries (Apollo, Relay) and Fetch/Axios requests.\n- **Integrations:** Sync your backend logs with your session replays and see what happened front-to-back. OpenReplay supports Sentry, Datadog, CloudWatch, Stackdriver, Elastic and more.\n\n## Deployment Options\n\nOpenReplay can be deployed anywhere. Follow our step-by-step guides for deploying it on major public clouds:\n\n- [AWS](https://docs.openreplay.com/deployment/deploy-aws)\n- [Google Cloud](https://docs.openreplay.com/deployment/deploy-gcp)\n- [Azure](https://docs.openreplay.com/deployment/deploy-azure)\n- [Digital Ocean](https://docs.openreplay.com/deployment/deploy-digitalocean)\n- [Scaleway](https://docs.openreplay.com/deployment/deploy-scaleway)\n- [OVHcloud](https://docs.openreplay.com/deployment/deploy-ovhcloud)\n- [Kubernetes](https://docs.openreplay.com/deployment/deploy-kubernetes)\n\n## OpenReplay Cloud\n\nFor those who want to simply use OpenReplay as a service, [sign up](https://app.openreplay.com/signup) for a free account on our cloud offering.\n\n## Community Support\n\nPlease refer to the [official OpenReplay documentation](https://docs.openreplay.com/). That should help you troubleshoot common issues. For additional help, you can reach out to us on one of these channels:\n\n- [Slack](https://slack.openreplay.com) (Connect with our engineers and community)\n- [GitHub](https://github.com/openreplay/openreplay/issues) (Bug and issue reports)\n- [Twitter](https://twitter.com/OpenReplayHQ) (Product updates, Great content)\n- [YouTube](https://www.youtube.com/channel/UCcnWlW-5wEuuPAwjTR1Ydxw) (How-to tutorials, past Community Calls)\n- [Website chat](https://openreplay.com) (Talk to us)\n\n## Contributing\n\nWe're always on the lookout for contributions to OpenReplay, and we're glad you're considering it! Not sure where to start? Look for open issues, preferably those marked as good first issues.\n\nSee our [Contributing Guide](CONTRIBUTING.md) for more details.\n\nAlso, feel free to join our [Slack](https://slack.openreplay.com) to ask questions, discuss ideas or connect with our  contributors.\n\n## License\n\nThis monorepo uses several licenses. See [LICENSE](/LICENSE) for more details.\n"
        },
        {
          "name": "README_AR.md",
          "type": "blob",
          "size": 8.1455078125,
          "content": "<p align=\"center\">\n  <a href=\"/README_FR.md\">Français</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_ESP.md\">Español</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">Русский</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README.md\">English</a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://openreplay.com/#gh-light-mode-only\">\n    <img src=\"static/openreplay-git-banner-light.png\" width=\"100%\">\n  </a>\n  <a href=\"https://openreplay.com/#gh-dark-mode-only\">\n    <img src=\"static/openreplay-git-banner-dark.png\" width=\"100%\">\n  </a>\n</p>\n\n<h3 align=\"center\">إعادة تشغيل الجلسة للمطورين</h3>\n<p align=\"center\">إعادة تشغيل الجلسة الأكثر تقدمًا لإنشاء تطبيقات ويب رائعة</p>\n\n<p align=\"center\">\n  <a href=\"https://docs.openreplay.com/deployment/deploy-aws\">\n    <img src=\"static/btn-deploy-aws.svg\" height=\"40\"/>\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-gcp\">\n    <img src=\"static/btn-deploy-google-cloud.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-azure\">\n    <img src=\"static/btn-deploy-azure.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-digitalocean\">\n    <img src=\"static/btn-deploy-digital-ocean.svg\" height=\"40\" />\n  </a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/openreplay/openreplay\">\n    <img src=\"static/openreplay-git-hero.svg\">\n  </a>\n</p>\n\nOpenReplay هو مجموعة إعادة تشغيل الجلسة التي يمكنك استضافتها بنفسك، والتي تتيح لك رؤية ما يقوم به المستخدمون على تطبيق الويب الخاص بك، مما يساعدك على حل المشكلات بشكل أسرع.\n\n- **إعادة تشغيل الجلسة.** يقوم OpenReplay بإعادة تشغيل ما يقوم به المستخدمون، وكيف يتصرف موقع الويب الخاص بك أو التطبيق من خلال التقاط النشاط على الشبكة، وسجلات وحدة التحكم، وأخطاء JavaScript، وإجراءات/حالة التخزين، وقياسات سرعة الصفحة، واستخدام وحدة المعالجة المركزية/الذاكرة، وأكثر من ذلك بكثير.\n- **بصمة منخفضة**. مع متتبع بحجم حوالي 26 كيلوبايت (نوع .br) الذي يرسل بيانات دقيقة بشكل غير متزامن لتأثير محدود جدًا على الأداء.\n- **مضيف بواسطتك.** لا مزيد من فحوص الامتثال الأمني، ومعالجة بيانات المستخدمين من قبل جهات خارجية. كل ما يتم التقاطه بواسطة OpenReplay يبقى في سحابتك للتحكم الكامل في بياناتك.\n- **ضوابط الخصوصية.** ميزات أمان دقيقة لتنقية بيانات المستخدم.\n- **نشر سهل.** بدعم من مزودي الخدمة السحابية العامة الرئيسيين (AWS، GCP، Azure، DigitalOcean).\n\n## الميزات\n\n- **إعادة تشغيل الجلسة:** تتيح لك إعادة تشغيل الجلسة إعادة عيش تجربة مستخدميك، ورؤية أين يواجهون صعوبة وكيف يؤثر ذلك على سلوكهم. يتم تحليل كل إعادة تشغيل للجلسة تلقائيًا بناءً على الأساليب الاستدلالية، لسهولة التقييم.\n- **أدوات التطوير (DevTools):** إنها مثل التصحيح في متصفحك الخاص. يوفر لك OpenReplay السياق الكامل (نشاط الشبكة، أخطاء JavaScript، إجراءات/حالة التخزين وأكثر من 40 مقياسًا) حتى تتمكن من إعادة إنتاج الأخطاء فورًا وفهم مشكلات الأداء.\n- **المساعدة (Assist):** تساعدك في دعم مستخدميك من خلال رؤية شاشتهم مباشرة والانضمام فورًا إلى مكالمة (WebRTC) معهم دون الحاجة إلى برامج مشاركة الشاشة من جهات خارجية.\n- **البحث الشامل (Omni-search):** ابحث وفرز حسب أي عملية/معيار للمستخدم تقريبًا، أو سمة الجلسة أو الحدث التقني، حتى تتمكن من الرد على أي سؤال. لا يلزم تجهيز.\n- **الأنفاق (Funnels):** للكشف عن المشكلات الأكثر تأثيرًا التي تسبب في فقدان التحويل والإيرادات.\n- **ضوابط الخصوصية الدقيقة:** اختر ماذا تريد التقاطه، ماذا تريد أن تخفي أو تجاهل حتى لا تصل بيانات المستخدم حتى إلى خوادمك.\n- **موجهة للمكونات الإضافية (Plugins oriented):** تصل إلى السبب الجذري بشكل أسرع عن طريق تتبع حالة التطبيق (Redux، VueX، MobX، NgRx، Pinia، وZustand) وتسجيل استعلامات GraphQL (Apollo، Relay) وطلبات Fetch/Axios.\n- **التكاملات (Integrations):** مزامنة سجلات الخادم الخلفي مع إعادات التشغيل للجلسات ورؤية ما حدث من الأمام إلى الخلف. يدعم OpenReplay Sentry وDatadog وCloudWatch وStackdriver وElastic والمزيد.\n\n## خيارات النشر\n\nيمكن نشر OpenReplay في أي مكان. اتبع دليلنا الخطوة بالخطوة لنشره على خدمات السحابة العامة الرئيسية:\n\n- [AWS](https://docs.openreplay.com/deployment/deploy-aws)\n- [Google Cloud](https://docs.openreplay.com/deployment/deploy-gcp)\n- [Azure](https://docs.openreplay.com/deployment/deploy-azure)\n- [Digital Ocean](https://docs.openreplay.com/deployment/deploy-digitalocean)\n- [Scaleway](https://docs.openreplay.com/deployment/deploy-scaleway)\n- [OVHcloud](https://docs.openreplay.com/deployment/deploy-ovhcloud)\n- [Kubernetes](https://docs.openreplay.com/deployment/deploy-kubernetes)\n\n## سحابة OpenReplay\n\nلأولئك الذين يرغبون في استخدام OpenReplay كخدمة، [قم بالتسجيل](https://app.openreplay.com/signup) للحصول على حساب مجاني على عرض السحابة لدينا.\n\n## دعم المجتمع\n\nيرجى الرجوع إلى [الوثائق الرسمية لـ OpenReplay](https://docs.openreplay.com/). سيساعدك ذلك في حل المشكلات الشائعة. للحصول على مساعدة إضافية، يمكنك الاتصال بنا عبر أحد هذه القنوات:\n\n- [Slack](https://slack.openreplay.com) (الاتصال مع مهندسينا والمجتمع)\n- [GitHub](https://github.com/openreplay/openreplay/issues) (تقارير الأخطاء والمشكلات)\n- [Twitter](https://twitter.com/OpenReplayHQ) (تحديثات المنتج، محتوى رائع)\n- [YouTube](https://www.youtube.com/channel/UCcnWlW-5wEuuPAwjTR1Ydxw) (دروس حول كيفية الاستخدام، مكالمات مجتمع سابقة)\n- [دردشة الموقع الإلكتروني](https://openreplay.com) (تحدث معنا)\n\n## المساهمة\n\nنحن دائمًا في انتظار المساهمات في OpenReplay، ونحن سعداء بأنك تفكر في ذلك! غير متأكد من أين تبدأ؟ ابحث عن المشاكل المفتوحة، وخاصة تلك المُميزة بأنها مناسبة للمبتدئين.\n\nانظر دليل المساهمة لدينا [دليل المساهمة](CONTRIBUTING.md) لمزيد من التفاصيل.\n\nكما توجد حرية الانضمام إلى Slack لدينا [Slack](https://slack.openreplay.com) لطرح الأسئلة، مناقشة الأفكار أو التواصل مع مساهمينا.\n\n## الخارطة الزمنية\n\nتحقق من [الخارطة الزمنية لدينا](https://www.notion.so/openreplay/Roadmap-889d2c3d968b4786ab9b281ab2394a94) وابق على اطلاع على ما سيأتي لاحقًا. لديك حرية [تقديم أفكار جديدة](https://github.com/openreplay/openreplay/issues/new) والتصويت على الميزات.\n\n## الترخيص\n\nيستخدم هذا المستودع المتعدد التراخيص. انظر إلى [LICENSE](/LICENSE) لمزيد من التفاصيل.\n"
        },
        {
          "name": "README_ESP.md",
          "type": "blob",
          "size": 6.7138671875,
          "content": "<p align=\"center\">\n  <a href=\"/README_FR.md\">Français</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README.md\">English</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">Русский</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">العربية</a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://openreplay.com/#gh-light-mode-only\">\n    <img src=\"static/openreplay-git-banner-light.png\" width=\"100%\">\n  </a>\n  <a href=\"https://openreplay.com/#gh-dark-mode-only\">\n    <img src=\"static/openreplay-git-banner-dark.png\" width=\"100%\">\n  </a>\n</p>\n\n<h3 align=\"center\">Reproducción de sesiones para desarrolladores</h3>\n<p align=\"center\">La reproducción de sesiones más avanzada para crear aplicaciones web encantadoras.</p>\n\n<p align=\"center\">\n  <a href=\"https://docs.openreplay.com/deployment/deploy-aws\">\n    <img src=\"static/btn-deploy-aws.svg\" height=\"40\"/>\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-gcp\">\n    <img src=\"static/btn-deploy-google-cloud.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-azure\">\n    <img src=\"static/btn-deploy-azure.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-digitalocean\">\n    <img src=\"static/btn-deploy-digital-ocean.svg\" height=\"40\" />\n  </a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/openreplay/openreplay\">\n    <img src=\"static/openreplay-git-hero.svg\">\n  </a>\n</p>\n\nOpenReplay es una suite de retransmisión de sesiones que puedes alojar tú mismo, lo que te permite ver lo que hacen los usuarios en tu aplicación web y ayudarte a solucionar problemas más rápido.\n\n- **Reproducción de sesiones.** OpenReplay reproduce lo que hacen los usuarios, pero no solo eso. También te muestra lo que ocurre bajo el capó, cómo se comporta tu sitio web o aplicación al capturar la actividad de la red, registros de la consola, errores de JavaScript, acciones/estado del almacén, métricas de velocidad de la página, uso de CPU/memoria y mucho más.\n- **Huella reducida.** Con un rastreador de aproximadamente 26 KB (.br) que envía datos mínimos de forma asíncrona, lo que tiene un impacto muy limitado en el rendimiento.\n- **Auto-alojado.** No más verificaciones de cumplimiento de seguridad, procesamiento de datos de usuario por terceros. Todo lo que OpenReplay captura se queda en tu nube para un control completo sobre tus datos.\n- **Controles de privacidad.** Funciones de seguridad detalladas para desinfectar los datos de usuario.\n- **Despliegue sencillo.** Con el soporte de los principales proveedores de nube pública (AWS, GCP, Azure, DigitalOcean).\n\n## Características\n\n- **Reproducción de sesiones:** Te permite revivir la experiencia de tus usuarios, ver dónde encuentran dificultades y cómo afecta su comportamiento. Cada reproducción de sesión se analiza automáticamente en función de heurísticas, para un triaje sencillo.\n- **Herramientas de desarrollo (DevTools):** Es como depurar en tu propio navegador. OpenReplay te proporciona el contexto completo (actividad de red, errores de JavaScript, acciones/estado del almacén y más de 40 métricas) para que puedas reproducir instantáneamente errores y entender problemas de rendimiento.\n- **Asistencia (Assist):** Te ayuda a brindar soporte a tus usuarios al ver su pantalla en tiempo real y unirte instantáneamente a una llamada (WebRTC) con ellos, sin necesidad de software de uso compartido de pantalla de terceros.\n- **Búsqueda universal (Omni-search):** Busca y filtra por casi cualquier acción/criterio de usuario, atributo de sesión o evento técnico, para que puedas responder a cualquier pregunta. No se requiere instrumentación.\n- **Embudos (Funnels):** Para resaltar los problemas más impactantes que causan la conversión y la pérdida de ingresos.\n- **Controles de privacidad detallados:** Elige qué capturar, qué ocultar o qué ignorar para que los datos de usuario ni siquiera lleguen a tus servidores.\n- **Orientado a complementos (Plugins oriented):** Llega más rápido a la causa raíz siguiendo el estado de la aplicación (Redux, VueX, MobX, NgRx, Pinia y Zustand) y registrando consultas GraphQL (Apollo, Relay) y solicitudes Fetch/Axios.\n- **Integraciones:** Sincroniza tus registros del servidor con tus repeticiones de sesiones y observa lo que sucedió de principio a fin. OpenReplay es compatible con Sentry, Datadog, CloudWatch, Stackdriver, Elastic y más.\n\n## Opciones de implementación\n\nOpenReplay se puede implementar en cualquier lugar. Sigue nuestras guías paso a paso para implementarlo en los principales servicios de nube pública:\n\n- [AWS](https://docs.openreplay.com/deployment/deploy-aws)\n- [Google Cloud](https://docs.openreplay.com/deployment/deploy-gcp)\n- [Azure](https://docs.openreplay.com/deployment/deploy-azure)\n- [Digital Ocean](https://docs.openreplay.com/deployment/deploy-digitalocean)\n- [Scaleway](https://docs.openreplay.com/deployment/deploy-scaleway)\n- [OVHcloud](https://docs.openreplay.com/deployment/deploy-ovhcloud)\n- [Kubernetes](https://docs.openreplay.com/deployment/deploy-kubernetes)\n\n## OpenReplay Cloud\n\nPara aquellos que desean usar OpenReplay como un servicio, [regístrate](https://app.openreplay.com/signup) para obtener una cuenta gratuita en nuestra oferta en la nube.\n\n## Soporte de la comunidad\n\nConsulta la [documentación oficial de OpenReplay](https://docs.openreplay.com/). Eso debería ayudarte a solucionar problemas comunes. Para obtener ayuda adicional, puedes contactarnos a través de uno de estos canales:\n\n- [Slack](https://slack.openreplay.com) (Conéctate con nuestros ingenieros y la comunidad)\n- [GitHub](https://github.com/openreplay/openreplay/issues) (Informes de errores y problemas)\n- [Twitter](https://twitter.com/OpenReplayHQ) (Actualizaciones del producto, contenido excelente)\n- [YouTube](https://www.youtube.com/channel/UCcnWlW-5wEuuPAwjTR1Ydxw) (Tutoriales, reuniones comunitarias anteriores)\n- [Chat en el sitio web](https://openreplay.com) (Háblanos)\n\n## Contribución\n\nSiempre estamos buscando contribuciones para OpenReplay, ¡y nos alegra que lo estés considerando! ¿No estás seguro por dónde empezar? Busca problemas abiertos, preferiblemente aquellos marcados como \"buenas primeras contribuciones\".\n\nConsulta nuestra [Guía de Contribución](CONTRIBUTING.md) para obtener más detalles.\n\nAdemás, no dudes en unirte a nuestro [Slack](https://slack.openreplay.com) para hacer preguntas, discutir ideas o conectarte con nuestros colaboradores.\n\n## Hoja de ruta\n\nConsulta nuestra [hoja de ruta](https://www.notion.so/openreplay/Roadmap-889d2c3d968b4786ab9b281ab2394a94) y mantente atento a lo que viene a continuación. Eres libre de [enviar](https://github.com/openreplay/openreplay/issues/new) nuevas ideas y votar por funciones.\n\n## Licencia\n\nEste monorepo utiliza varias licencias. Consulta [LICENSE](/LICENSE) para obtener más detalles.\n"
        },
        {
          "name": "README_FR.md",
          "type": "blob",
          "size": 7.130859375,
          "content": "<p align=\"center\">\n  <a href=\"/README.md\">English</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_ESP.md\">Español</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">Русский</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">العربية</a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://openreplay.com/#gh-light-mode-only\">\n    <img src=\"static/openreplay-git-banner-light.png\" width=\"100%\">\n  </a>\n  <a href=\"https://openreplay.com/#gh-dark-mode-only\">\n    <img src=\"static/openreplay-git-banner-dark.png\" width=\"100%\">\n  </a>\n</p>\n\n<h3 align=\"center\">Relecture de session pour développeurs</h3>\n<p align=\"center\">La relecture de session la plus avancée sur le marché pour des applications perfectionnées.</p>\n\n<p align=\"center\">\n  <a href=\"https://docs.openreplay.com/deployment/deploy-aws\">\n    <img src=\"static/btn-deploy-aws.svg\" height=\"40\"/>\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-gcp\">\n    <img src=\"static/btn-deploy-google-cloud.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-azure\">\n    <img src=\"static/btn-deploy-azure.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-digitalocean\">\n    <img src=\"static/btn-deploy-digital-ocean.svg\" height=\"40\" />\n  </a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/openreplay/openreplay\">\n    <img src=\"static/openreplay-git-hero.svg\">\n  </a>\n</p>\n\nOpenReplay est une suite d'outils de relecture (appelée aussi \"replay\") de sessions que vous pouvez héberger vous-même, vous permettant de voir ce que les utilisateurs font sur une application web, vous aidant ainsi à résoudre différents types de problèmes plus rapidement.\n\n- **Relecture de session.** OpenReplay rejoue ce que les utilisateurs font, mais pas seulement. Il vous montre également ce qui se passe en coulisse, comment votre site web ou votre application se comporte en capturant l'activité réseau, les journaux de console, les erreurs JS, les actions/états du store, les métriques de chargement des pages, l'utilisation du CPU/mémoire, et bien plus encore.\n- **Faible empreinte**. Avec un traqueur d'environ 26 Ko (.br) qui envoie de manière asynchrone des données minimales, ce qui a un impact très limité sur les performances.\n- **Auto-hébergé**. Plus de vérifications de conformité en matière de sécurité, plus de traitement des données des utilisateurs par des tiers. Tout ce qu'OpenReplay capture reste dans votre cloud pour un contrôle complet sur vos données.\n- **Contrôles de confidentialité**. Fonctionnalités de sécurité détaillées pour la désinfection des données utilisateur.\n- **Déploiement facile**. Avec le support des principaux fournisseurs de cloud public (AWS, GCP, Azure, DigitalOcean).\n\n## Fonctionnalités\n\n- **Relecture de session :** Vous permet de revivre l'expérience de vos utilisateurs, de voir où ils rencontrent des problèmes et comment cela affecte leur comportement. Chaque relecture de session est automatiquement analysée en se basant sur des heuristiques, pour un triage plus facile des problèmes en fonction de l'impact.\n- **Outils de développement (DevTools) :** C'est comme déboguer dans votre propre navigateur. OpenReplay vous fournit le contexte complet (activité réseau, erreurs JS, actions/états du store et plus de 40 métriques) pour que vous puissiez instantanément reproduire les bugs et comprendre les problèmes de performance.\n- **Assistance (Assist) :** Vous aide à soutenir vos utilisateurs en voyant leur écran en direct et en vous connectant instantanément avec eux via appel/vidéo (WebRTC), sans nécessiter de logiciel tiers de partage d'écran.\n- **Recherche universelle (Omni-search) :** Recherchez et filtrez presque n'importe quelle action/critère utilisateur, attribut de session ou événement technique, afin de pouvoir répondre à n'importe quelle question. Aucune instrumentation requise.\n- **Entonnoirs (Funnels) :** Pour mettre en évidence les problèmes les plus impactants entraînant une conversion et une perte de revenus.\n- **Contrôles de confidentialité détaillés :** Choisissez ce que vous voulez capturer, ce que vous voulez obscurcir ou ignorer, de sorte que les données utilisateur n'atteignent même pas vos serveurs.\n- **Orienté vers les plugins :** Corrigez plus rapidement les bogues en suivant l'état de l'application (Redux, VueX, MobX, NgRx, Pinia et Zustand) et enregistrant les requêtes GraphQL (Apollo, Relay) et les requêtes Fetch/Axios.\n- **Intégrations :** Synchronisez vos journaux backend avec vos relectures de sessions et voyez ce qui s'est passé du début à la fin. OpenReplay prend en charge Sentry, Datadog, CloudWatch, Stackdriver, Elastic et bien d'autres.\n\n## Options de déploiement\n\nOpenReplay peut être déployé n'importe où. Suivez nos guides détaillés pour le déployer sur les principaux clouds publics :\n\n- [AWS](https://docs.openreplay.com/deployment/deploy-aws)\n- [Google Cloud](https://docs.openreplay.com/deployment/deploy-gcp)\n- [Azure](https://docs.openreplay.com/deployment/deploy-azure)\n- [Digital Ocean](https://docs.openreplay.com/deployment/deploy-digitalocean)\n- [Scaleway](https://docs.openreplay.com/deployment/deploy-scaleway)\n- [OVHcloud](https://docs.openreplay.com/deployment/deploy-ovhcloud)\n- [Kubernetes](https://docs.openreplay.com/deployment/deploy-kubernetes)\n\n## OpenReplay Cloud\n\nPour ceux qui veulent simplement utiliser OpenReplay en tant que service, [inscrivez-vous](https://app.openreplay.com/signup) pour un compte gratuit sur notre offre cloud.\n\n## Support de la communauté\n\nVeuillez vous référer à la [documentation officielle d'OpenReplay](https://docs.openreplay.com/). Cela devrait vous aider à résoudre les problèmes courants. Pour toute aide ou question supplémentaire, vous pouvez nous contacter sur l'un des canaux suivants :\n\n- [Slack](https://slack.openreplay.com) (Connectez-vous avec nos ingénieurs et notre communauté)\n- [GitHub](https://github.com/openreplay/openreplay/issues) (Rapports de bogues et problèmes)\n- [Twitter](https://twitter.com/OpenReplayHQ) (Mises à jour du produit, articles techniques et autres annonces)\n- [YouTube](https://www.youtube.com/channel/UCcnWlW-5wEuuPAwjTR1Ydxw) (Tutoriels)\n- [Chat sur le site Web](https://openreplay.com) (Nous contacter)\n\n## Contribution\n\nNous sommes toujours à la recherche de contributions pour rendre OpenReplay meilleur. Vous ne savez pas par où commencer ? Recherchez dans notre \"GitHub Issues\" pour trouver des tickets ouverts, de préférence ceux marqués comme \"bonnes premières contributions\".\n\nConsultez notre [Guide de contribution](CONTRIBUTING.md) pour plus de détails.\n\nN'hésitez pas à rejoindre notre [Slack](https://slack.openreplay.com) pour poser des questions, discuter vos idées ou simplement pour vous connecter avec nos contributeurs.\n\n## Feuille de route\n\nConsultez notre [feuille de route](https://www.notion.so/openreplay/Roadmap-889d2c3d968b4786ab9b281ab2394a94) et gardez un œil sur ce qui arrive prochainement. Vous êtes libre de [proposer](https://github.com/openreplay/openreplay/issues/new) de nouvelles idées et de voter pour des fonctionnalités.\n\n## Licence\n\nCe monorepo utilise plusieurs licences. Consultez [LICENSE](/LICENSE) pour plus de détails.\n"
        },
        {
          "name": "README_RU.md",
          "type": "blob",
          "size": 9.681640625,
          "content": "<p align=\"center\">\n  <a href=\"/README_FR.md\">Français</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_ESP.md\">Español</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README.md\">English</a>\n  &nbsp;|&nbsp;\n  <a href=\"/README_RU.md\">العربية</a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://openreplay.com/#gh-light-mode-only\">\n    <img src=\"static/openreplay-git-banner-light.png\" width=\"100%\">\n  </a>\n  <a href=\"https://openreplay.com/#gh-dark-mode-only\">\n    <img src=\"static/openreplay-git-banner-dark.png\" width=\"100%\">\n  </a>\n</p>\n\n<h3 align=\"center\">Реплей сессий для разработчиков</h3>\n<p align=\"center\">Самое продвинутое решение для воспроизведения сессий с открытым исходным кодом для создания восхитительных веб-приложений.</p>\n\n<p align=\"center\">\n  <a href=\"https://docs.openreplay.com/deployment/deploy-aws\">\n    <img src=\"static/btn-deploy-aws.svg\" height=\"40\"/>\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-gcp\">\n    <img src=\"static/btn-deploy-google-cloud.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-azure\">\n    <img src=\"static/btn-deploy-azure.svg\" height=\"40\" />\n  </a>\n\n  <a href=\"https://docs.openreplay.com/deployment/deploy-digitalocean\">\n    <img src=\"static/btn-deploy-digital-ocean.svg\" height=\"40\" />\n  </a>\n</p>\n\n<p align=\"center\">\n  <a href=\"https://github.com/openreplay/openreplay\">\n    <img src=\"static/openreplay-git-hero.svg\">\n  </a>\n</p>\n\nOpenReplay - это набор инструментов для воспроизведения пользовательских сессий, позволяющий увидеть действия пользователи в вашем веб-приложении, который вы можете разместить в своем облаке или на серверах.\n\n- **Воспроизведение сессий.** OpenReplay не только воспроизводит действия пользователей, но и показывает, что происходит под капотом сессии, как ведет себя ваш сайт или приложение, фиксируя сетевую активность, логи консоли, JS-ошибки, действия/состояние стейт менеджеров, показатели скорости страницы, использование процессора/памяти и многое другое.\n- **Компактность**. Размером всего в ~26 КБ (.br), трекер асинхронно отправляет минимальное количество данных, оказывая очень незначительное влияние на производительность вашего приложения.\n- **Self-hosted**. Больше никаких проверок на соответствие требованиям безопасности или обработки данных ваших пользователей третьими сторонами. Все, что фиксирует OpenReplay, остается в вашем облаке, что обеспечивает полный контроль над вашими данными.\n- **Контроль над приватностью**. Тонкие настройки приватности позволяют записывать только действительно необходимые данные.\n- **Легкая установка**. Мы поддерживаем всех крупных поставщиков облачных услуг (AWS, GCP, Azure, DigitalOcean).\n\n## Особенности\n\n- **Session Replay:** Позволяет повторить опыт пользователей, увидеть, где они испытывают трудности и как это влияет на конверсию. Каждый реплей автоматически анализируется на наличие ошибок и аномалий, что значительно облегчает сортировку и поиск проблемных сессий.\n- **DevTools:** Прямо как отладка в вашем собственном браузере. OpenReplay предоставляет вам полный контекст (сетевая активность, JS ошибки, действия/состояние стейт менеджеров и более 40 метрик), чтобы вы могли мгновенно воспроизвести ошибки и найти проблемы с производительностью.\n- **Assist:** Позволяет вам помочь вашим пользователям, наблюдая их экран в настоящем времени и мгновенно переходя на звонок (WebRTC) с ними, не требуя стороннего программного обеспечения для совместного просмотра экрана.\n- **Omni-search:** Поиск и фильтрация практически любого действия пользователя/критерия, атрибута сессии или технического события, чтобы вы могли ответить на любой вопрос.\n- **Воронки:** Для выявления наиболее влияющих на конверсию мест.\n- **Тонкая настройка приватности:** Выбирайте, что записывать, а что игнорировать, чтобы данные пользователя даже не отправлялись на ваши сервера.\n- **Ориентирован на плагины:** С помощью плагинов можно отслеживать состояние приложения (Redux, VueX, MobX, NgRx, Pinia, и Zustand), регистрировать запросы GraphQL (Apollo, Relay) и многое другое.\n- **Интеграции:** OpenReplay поддерживает интеграции с Sentry, Datadog, CloudWatch, Stackdriver, Elastic и другими провайдерами, позволяя получать еще больше информации о пользовательской сессии.\n\n## Варианты развертывания\n\nOpenReplay можно развернуть где угодно. Следуйте нашим пошаговым руководствам по развертыванию на основных публичных облаках:\n\n- [AWS](https://docs.openreplay.com/deployment/deploy-aws)\n- [Google Cloud](https://docs.openreplay.com/deployment/deploy-gcp)\n- [Azure](https://docs.openreplay.com/deployment/deploy-azure)\n- [Digital Ocean](https://docs.openreplay.com/deployment/deploy-digitalocean)\n- [Scaleway](https://docs.openreplay.com/deployment/deploy-scaleway)\n- [OVHcloud](https://docs.openreplay.com/deployment/deploy-ovhcloud)\n- [Kubernetes](https://docs.openreplay.com/deployment/deploy-kubernetes)\n\n## OpenReplay Cloud\n\nДля тех, кто просто хочет использовать OpenReplay как сервис, [зарегистрируйте](https://app.openreplay.com/signup) бесплатную учетную запись в нашем приложении.\n\n## Поддержка сообщества\n\nВ случае возникновения проблем, вы можете обратиться к [официальной документации OpenReplay](https://docs.openreplay.com/). Это поможет вам решить наиболее распространенные проблемы.\nДля дополнительной помощи, вы можете связаться с нами через один из этих каналов:\n\n- [Slack](https://slack.openreplay.com) (Свяжитесь с нашими инженерами и сообществом)\n- [GitHub](https://github.com/openreplay/openreplay/issues) (Отчеты о багах и проблемах)\n- [Twitter](https://twitter.com/OpenReplayHQ) (Обновления продукта)\n- [YouTube](https://www.youtube.com/channel/UCcnWlW-5wEuuPAwjTR1Ydxw) (Учебные пособия, прошлые комьюнити-звонки)\n- [Чат на веб-сайте](https://openreplay.com) (Общайтесь с нами)\n\n## Содействие\n\nМы всегда рады любой помощи в создании OpenReplay, и готовы услышать ваши идеи. Не уверены, с чего начать? Ищите открытые задачи, особенно те, которые отмечены как \"good first issue\".\n\nСмотрите наше [руководство по содействию](CONTRIBUTING.md) для более подробной информации.\n\nТакже не стесняйтесь присоединиться к нашему [Slack](https://slack.openreplay.com), чтобы задавать вопросы, обсуждать идеи или связываться с нашими участниками.\n\n## План развития\n\nОзнакомьтесь с нашим [планом развития](https://www.notion.so/openreplay/Roadmap-889d2c3d968b4786ab9b281ab2394a94) и следите за тем, что будет далее. Вы можете свободно [предложить](https://github.com/openreplay/openreplay/issues/new) новые идеи и голосовать за функции.\n\n## Лицензия\n\nВ этом монорепозитории используются разные лицензии. См. [LICENSE](/LICENSE) для получения более подробной информации.\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.8896484375,
          "content": "## Reporting Vulnerabilities\n\nWe're extremely grateful to those who report vulnerabilities to the OpenReplay Community. All security issues should be directly addressed to us at [security@openreplay.com](mailto:security@openreplay.com) with the necessary details.\nDon't hesitate to submit potential vulnerabilities you discovered in OpenReplay, or in any of its dependencies. If also better to do so even if you're not sure how the issue affects OpenReplay.\n\n## Security Vulnerability Response\n\nEvery report is thoroughly investigated by our community volunteers and the OpenReplay team.\nYou will receive a response from us within 3 working days. If the issue is confirmed, we will release a patch as soon as we can depending on the mitigation complexity. We will you keep you updated during the entirety of the process. The bug will be publicly disclosed right after the solution is available and well tested.\n"
        },
        {
          "name": "api",
          "type": "tree",
          "content": null
        },
        {
          "name": "assist-stats",
          "type": "tree",
          "content": null
        },
        {
          "name": "assist",
          "type": "tree",
          "content": null
        },
        {
          "name": "backend",
          "type": "tree",
          "content": null
        },
        {
          "name": "codecov.yml",
          "type": "blob",
          "size": 0.279296875,
          "content": "ignore:\n  - \"**/*/*.gen.ts\"\n  - \"**/*/coverage.xml\"\n  - \"**/*/coverage-final.json\"\n  - \"**/*/coverage/**\"\n  - \"**/*/node_modules/**\"\n  - \"**/*/dist/**\"\n  - \"**/*/build/**\"\n  - \"**/*/.test.*\"\n  - \"**/*/version.ts\"\nreview:\n  poem: false\n  review_status: false\n  collapse_walkthrough: true"
        },
        {
          "name": "ee",
          "type": "tree",
          "content": null
        },
        {
          "name": "frontend",
          "type": "tree",
          "content": null
        },
        {
          "name": "lefthook.yml",
          "type": "blob",
          "size": 0.830078125,
          "content": "# EXAMPLE USAGE:\n#\n#   Refer for explanation to following link:\n#   https://github.com/evilmartians/lefthook/blob/master/docs/configuration.md\n#\n# pre-push:\n#   commands:\n#     packages-audit:\n#       tags: frontend security\n#       run: yarn audit\n#     gems-audit:\n#       tags: backend security\n#       run: bundle audit\n#\n# pre-commit:\n#   parallel: true\n#   commands:\n#     eslint:\n#       glob: \"*.{js,ts,jsx,tsx}\"\n#       run: yarn eslint {staged_files}\n#     rubocop:\n#       tags: backend style\n#       glob: \"*.rb\"\n#       exclude: '(^|/)(application|routes)\\.rb$'\n#       run: bundle exec rubocop --force-exclusion {all_files}\n#     govet:\n#       tags: backend style\n#       files: git ls-files -m\n#       glob: \"*.go\"\n#       run: go vet {files}\n#   scripts:\n#     \"hello.js\":\n#       runner: node\n#     \"any.go\":\n#       runner: go run\n"
        },
        {
          "name": "mobs",
          "type": "tree",
          "content": null
        },
        {
          "name": "networkProxy",
          "type": "tree",
          "content": null
        },
        {
          "name": "peers",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "snippet",
          "type": "tree",
          "content": null
        },
        {
          "name": "sourcemap-uploader",
          "type": "tree",
          "content": null
        },
        {
          "name": "sourcemapreader",
          "type": "tree",
          "content": null
        },
        {
          "name": "spot",
          "type": "tree",
          "content": null
        },
        {
          "name": "static",
          "type": "tree",
          "content": null
        },
        {
          "name": "third-party.md",
          "type": "blob",
          "size": 8.2841796875,
          "content": "## Licenses (as of Aug, 28 2024)\n\nBelow is the list of dependencies used in OpenReplay software. Licenses may change between versions, so please keep this\nup to date with every new library you use.\n\n| Library                    | License          | Scope            |\n|----------------------------|------------------|------------------|\n| btcutil                    | IST              | Go               |\n| confluent-kafka-go         | Apache2          | Go               |\n| compress                   | Apache2          | Go               |\n| uuid                       | BSD3             | Go               |\n| mux                        | BSD3             | Go               |\n| lib/pq                     | MIT              | Go               |\n| pgconn                     | MIT              | Go               |\n| pgx                        | MIT              | Go               |\n| go-redis                   | BSD2             | Go               |\n| pgerrcode                  | MIT              | Go               |\n| pgzip                      | MIT              | Go               |\n| maxminddb-golang           | IST              | Go               |\n| realip                     | MIT              | Go               |\n| uap-go                     | Apache2          | Go               |\n| clickhouse-go              | MIT              | Go               |\n| aws-sdk-go                 | Apache2          | Go               |\n| logging                    | Apache2          | Go               |\n| squirrel                   | MIT              | Go               |\n| go-elasticsearch           | Apache2          | Go               |\n| gorilla/websocket          | BSD2             | Go               |\n| radix                      | MIT              | Go               |\n| api                        | BSD3             | Go               |\n| urllib3                    | MIT              | Python           |\n| boto3                      | Apache2          | Python           |\n| requests                   | Apache2          | Python           |\n| pyjwt                      | MIT              | Python           |\n| jsbeautifier               | MIT              | Python           |\n| psycopg2-binary            | LGPL             | Python           |\n| fastapi                    | MIT              | Python           |\n| uvicorn                    | BSD              | Python           |\n| python-decouple            | MIT              | Python           |\n| pydantic                   | MIT              | Python           |\n| apscheduler                | MIT              | Python           |\n| python-multipart           | Apache           | Python           |\n| elasticsearch-py           | Apache2          | Python           |\n| jira                       | BSD2             | Python           |\n| redis-py                   | MIT              | Python           |\n| clickhouse-driver          | MIT              | Python           |\n| python3-saml               | MIT              | Python           |\n| kubernetes                 | Apache2          | Python           |\n| chalice                    | Apache2          | Python           |\n| pandas                     | BSD3             | Python           |\n| numpy                      | BSD3             | Python           |\n| scikit-learn               | BSD3             | Python           |\n| apache-airflow             | Apache2          | Python           |\n| airflow-code-editor        | Apache2          | Python           |\n| mlflow                     | Apache2          | Python           |\n| sqlalchemy                 | MIT              | Python           |\n| pandas-redshift            | MIT              | Python           |\n| confluent-kafka            | Apache2          | Python           |\n| cachetools                 | MIT                | Python         |\n| amplitude-js               | MIT              | JavaScript       |\n| classnames                 | MIT              | JavaScript       |\n| codemirror                 | MIT              | JavaScript       |\n| copy-to-clipboard          | MIT              | JavaScript       |\n| jsonwebtoken               | MIT              | JavaScript       |\n| datamaps                   | MIT              | JavaScript       |\n| microdiff                  | MIT              | JavaScript       |\n| immutable                  | MIT              | JavaScript       |\n| jshint                     | MIT              | JavaScript       |\n| luxon                      | MIT              | JavaScript       |\n| mobx                       | MIT              | JavaScript       |\n| mobx-react-lite            | MIT              | JavaScript       |\n| optimal-select             | MIT              | JavaScript       |\n| rc-time-picker             | MIT              | JavaScript       |\n| snabbdom                   | MIT              | JavaScript       |\n| react                      | MIT              | JavaScript       |\n| react-codemirror2          | MIT              | JavaScript       |\n| react-confirm              | MIT              | JavaScript       |\n| react-datepicker           | MIT              | JavaScript       |\n| react-daterange-picker     | Apache2          | JavaScript       |\n| react-dnd                  | MIT              | JavaScript       |\n| react-dnd-html5-backend    | MIT              | JavaScript       |\n| react-dom                  | MIT              | JavaScript       |\n| react-google-recaptcha     | MIT              | JavaScript       |\n| react-json-view            | MIT              | JavaScript       |\n| react-redux                | MIT              | JavaScript       |\n| react-router               | MIT              | JavaScript       |\n| react-router-dom           | MIT              | JavaScript       |\n| react-stripe-elements      | MIT              | JavaScript       |\n| react-toastify             | MIT              | JavaScript       |\n| recharts                   | MIT              | JavaScript       |\n| redux                      | MIT              | JavaScript       |\n| redux-immutable            | BSD3             | JavaScript       |\n| redux-thunk                | MIT              | JavaScript       |\n| socket.io                  | MIT              | JavaScript       |\n| socket.io-client           | MIT              | JavaScript       |\n| uWebSockets.js             | Apache2          | JavaScript       |\n| aws-sdk                    | Apache2          | JavaScript       |\n| serverless                 | MIT              | JavaScript       |\n| peerjs                     | MIT              | JavaScript       |\n| geoip-lite                 | Apache2          | JavaScript       |\n| ua-parser-js               | MIT              | JavaScript       |\n| express                    | MIT              | JavaScript       |\n| jspdf                      | MIT              | JavaScript       |\n| html-to-image              | MIT              | JavaScript       |\n| kafka                      | Apache2          | Infrastructure   |\n| stern                      | Apache2          | Infrastructure   |\n| k9s                        | Apache2          | Infrastructure   |\n| minio                      | AGPLv3           | Infrastructure   |\n| postgreSQL                 | PostgreSQL License | Infrastructure   |\n| k3s                        | Apache2          | Infrastructure   |\n| nginx                      | BSD2             | Infrastructure   |\n| clickhouse                 | Apache2          | Infrastructure   |\n| redis                      | BSD3             | Infrastructure   |\n| yq                         | MIT              | Infrastructure   |\n| html2canvas                | MIT              | JavaScript       |\n| eget                       | MIT              | Infrastructure   |\n| @medv/finder               | MIT              | JavaScript       |\n| fflate                     | MIT              | JavaScript       |\n| fzstd                      | MIT              | JavaScript       |\n| prom-client                | Apache2          | JavaScript       |\n| winston                    | MIT              | JavaScript       |\n| @wojtekmaj/react-daterange-picker | MIT              | JavaScript       |\n| prismjs                   | MIT              | JavaScript       |\n| virtua                   | MIT              | JavaScript       |\n| babel-plugin-prismjs     | MIT              | JavaScript       |\n| react-intersection-observer | MIT              | JavaScript       |"
        },
        {
          "name": "tracker",
          "type": "tree",
          "content": null
        },
        {
          "name": "yarn.lock",
          "type": "blob",
          "size": 0.083984375,
          "content": "# THIS IS AN AUTOGENERATED FILE. DO NOT EDIT THIS FILE DIRECTLY.\n# yarn lockfile v1\n\n\n"
        }
      ]
    }
  ]
}