{
  "metadata": {
    "timestamp": 1736564574419,
    "page": 213,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mobxjs/mobx-state-tree",
      "stars": 7004,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".circleci",
          "type": "tree",
          "content": null
        },
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0205078125,
          "content": "*/node_modules\n*.log\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.064453125,
          "content": "* text=auto\n\n*.ts text eol=lf\n*.json text eol=lf\n*.md text eol=lf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1640625,
          "content": "node_modules\n*.log\nlib\ndist\ncoverage\n.nyc_output\n.idea\npackage-lock.json\n.prettierignore\n.vscode\n.editorconfig\n/test-results/**/*.xml\n/website/build\n.DS_Store\njunit.xml"
        },
        {
          "name": ".husky",
          "type": "tree",
          "content": null
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 4.9697265625,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n-   Demonstrating empathy and kindness toward other people\n-   Being respectful of differing opinions, viewpoints, and experiences\n-   Giving and gracefully accepting constructive feedback\n-   Accepting responsibility and apologizing to those affected by our mistakes,\n    and learning from the experience\n-   Focusing on what is best not just for us as individuals, but for the\n    overall community\n\nExamples of unacceptable behavior include:\n\n-   The use of sexualized language or imagery, and sexual attention or\n    advances of any kind\n-   Trolling, insulting or derogatory comments, and personal or political attacks\n-   Public or private harassment\n-   Publishing others' private information, such as a physical or email\n    address, without their explicit permission\n-   Other conduct which could reasonably be considered inappropriate in a\n    professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior, harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 6.0205078125,
          "content": "# Contributing to MobX-State-Tree\n\nWelcome to MobX-State-Tree! We're stoked that you want to contribute to our open-source project. Our community is essential in maintaining and improving the stability, test coverage, and documentation of MST. We really appreciate your time and interest in pitching in. Overall, we want to build useful software and have fun doing it - we hope you'll be able to join us!\n\n## Table of Contents\n\n1. [Getting Started](#getting-started)\n2. [Contributing Guidelines](#contributing-guidelines)\n3. [Reporting Bugs](#reporting-bugs)\n4. [Code of Conduct](#code-of-conduct)\n\n## Getting Started\n\nBefore you start contributing, please make sure you have:\n\n- [Bun](https://bun.sh/) installed on your local machine.\n- A [GitHub](https://github.com/) account, as you'll need it to create issues and submit pull requests.\n\nMost of the documentation and community assumes some amount of familiarity with:\n\n1. JavaScript\n2. TypeScript\n3. git\n4. Using the command line\n5. Experience with state management libraries (typically on the frontend, although there are plenty of applications using MST in other contexts).\n\nIf you don't feel comfortable with these concepts, we'd be happy to help you get started, but you may want to consider brushing up on them before digging into the codebase. Reach out in the [discussions section of our GitHub repository](https://github.com/mobxjs/mobx-state-tree/discussions) if you'd like pointers about where to start.\n\n## Contributing Guidelines\n\n### Prioritizing Stability Over New Features\n\nThe existing API for MobX-State-Tree is [already quite extensive](https://mobx-state-tree.js.org/intro/welcome). As such, issues and PRs about new features may take lower priority than bug fixes, improving existing features, and performance/TypeScript improvements. If you're looking to augment MST with new functionality, we encourage you to consider building your own third-party library around our project, or perhaps [contributing to the mst-middlewares package](https://github.com/coolsoftwaretyler/mst-middlewares). We'd be happy to help faciliate that work, especially if it keeps our API from expanding much further.\n\n### Tests\n\nTo maintain our library's stability, we are always striving to improve test coverage, even where more tests might be redundant. Every PR is _required to add at least one test that directly exercises your code change_, even if that test may be duplicative of existing tests. If you do not include tests with your PR, we will ask you to do so before reviewing. If you open a PR and are unwilling to write tests, we may either write tests on your behalf, or close the PR. If you are uncomfortable writing tests or working with Jest (our current testing library), we would be happy to guide you. This requirement is not intended as a barrier to entry, but as a way for us to enforce and improve the stability of our long-lived library here. It also serves as a way to externally communicate how your change will (or perhaps how it will not) modify the behavior of MST. There's no documentation quite as good as a comprehensive test suite!\n\n### Documentation Changes\n\nGood documentation is crucial for our users. If your contribution involves changes to the library's behavior, please update the documentation accordingly. Not every PR is necessarily going to require documentation updates, but we encourage you to consider touching up documentation related to your code changes. If you're unsure about where to make changes, feel free to reach out to us, and we'll be happy to guide you.\n\n### Submitting a Pull Request\n\n1. Fork the MobX-State-Tree repository on GitHub to your own GitHub account.\n2. Clone your fork to your local machine.\n3. Create a new branch for your changes: `git checkout -b my-feature`.\n4. Before starting, it's not a bad idea to `bun install && bun run build && bun run test:all` to check that your machine can run the full test suite to start.\n5. Make your changes and ensure that all tests pass (including any new tests you have added).\n6. Update the documentation if necessary.\n7. Commit your changes: `git commit -m \"Add my feature\"`. Please consider [following conventional commit formatting](https://www.conventionalcommits.org/en/v1.0.0/).\n8. Push your changes to your fork: `git push origin my-feature`.\n9. Create a pull request on the MobX-State-Tree repository. We have a pull request template. If you fill that out and include examples of your changes, links to any issue(s) you're working on, and a good description of your PR, that would help us out a lot. If you skip those steps, we may ask you for clarification before reviewing your work.\n\nOur team will review your pull request as soon as possible and provide feedback. Please be patient, as it may take some time to review and merge your contribution.\n\n## Reporting Bugs\n\nIf you encounter a bug while using MobX-State-Tree, please help us by reporting it. To report a bug:\n\n1. Check if the bug has already been reported by searching our [issue tracker](https://github.com/mobxjs/mobx-state-tree/issues).\n2. If not, create a new issue, including as much detail as possible about the bug and steps to reproduce it. We have issue templates that will ask specific questions for you to help us understand the problem.\n\n## Bigger PRs\n\nIf you want to contribute a large or significant change to MST, we'd love to connect with you ahead of time to make sure it fits in with our overall road map, meets our stability requirements, and make sure you are set up for success. Please consider [asking around in the discussion forum](https://github.com/mobxjs/mobx-state-tree/discussions) if you have a big idea you want to implement, or if you want to work on some existing big ideas out therein the communit.\n\n## Code of Conduct\n\nWe strive to maintain a friendly and welcoming community. Please read and adhere to our [Code of Conduct](CODE_OF_CONDUCT.md) in all interactions within the MobX-State-Tree project.\n\nThank you for considering contributing to MobX-State-Tree. Your contributions help us make our library better for everyone. We appreciate your support and look forward to collaborating with you!\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.14453125,
          "content": "FROM node:8.11.4\n\nWORKDIR /app/website\n\nEXPOSE 3000 35729\nCOPY ./docs /app/docs\nCOPY ./website /app/website\nRUN yarn install\n\nCMD [\"yarn\", \"start\"]\n"
        },
        {
          "name": "ISSUE_TEMPLATE.md",
          "type": "blob",
          "size": 0.158203125,
          "content": "**If your issue isn't a bug report, please consider using discussion threads instead of opening an issue: https://github.com/mobxjs/mobx-state-tree/discussions**\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.048828125,
          "content": "MIT License\n\nCopyright (c) 2016 Michel Weststrate\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.3359375,
          "content": "<img src=\"website/static/img/mobx-state-tree-logo-gradient.png\" alt=\"logo\" height=\"120\" align=\"right\" />\n\n# mobx-state-tree\n\n[![npm version](https://badge.fury.io/js/mobx-state-tree.svg)](https://badge.fury.io/js/mobx-state-tree)\n[![CircleCI](https://circleci.com/gh/mobxjs/mobx-state-tree.svg?style=svg)](https://circleci.com/gh/mobxjs/mobx-state-tree)\n[![Have a question? Ask on GitHub Discussions!](https://img.shields.io/badge/Have%20a%20question%3F-Ask%20on%20GitHub%20Discussions!-blue)](https://github.com/mobxjs/mobx-state-tree/discussions)\n\n## What is mobx-state-tree?\n\nTechnically speaking, mobx-state-tree (also known as MST) is a state container system built on [MobX](https://github.com/mobxjs/mobx), a functional reactive state library.\n\nThis may not mean much to you, and that’s okay. I’ll explain it like this: **MobX is a state management \"engine\", and MobX-State-Tree gives it structure and common tools you need for your app.** MST is valuable in a large team but also useful in smaller applications when you expect your code to scale rapidly. And if we compare it to Redux, MST offers better performance and much less boilerplate code than Redux!\n\nMobX is [one of the most popular Redux alternatives](https://2019.stateofjs.com/data-layer/mobx/) and is used (along with MobX-State-Tree) by companies worldwide. MST plays very well with TypeScript, React, and React Native, especially when paired with [mobx-react-lite](https://github.com/mobxjs/mobx/tree/main/packages/mobx-react-lite). It supports multiple stores, async actions and side effects, enables extremely targeted re-renders for React apps, and much more -- all in a package with _zero dependencies_ other than MobX itself.\n\n_Note: you don't need to know how to use MobX in order to use MST._\n\n# Getting started\n\nSee the [Getting started](https://mobx-state-tree.js.org/intro/getting-started) tutorial or follow the free [egghead.io course](https://egghead.io/courses/manage-application-state-with-mobx-state-tree).\n\n👉 Official docs can be found at [http://mobx-state-tree.js.org/](http://mobx-state-tree.js.org/)\n\n## Quick Code Example\n\nThere's nothing quite like looking at some code to get a feel for a library. Check out this small example of an author and list of tweets by that author.\n\n```js\nimport { types } from \"mobx-state-tree\" // alternatively: import { t } from \"mobx-state-tree\"\n\n// Define a couple models\nconst Author = types.model({\n  id: types.identifier,\n  firstName: types.string,\n  lastName: types.string\n})\nconst Tweet = types.model({\n  id: types.identifier,\n  author: types.reference(Author), // stores just the `id` reference!\n  body: types.string,\n  timestamp: types.number\n})\n\n// Define a store just like a model\nconst RootStore = types.model({\n  authors: types.array(Author),\n  tweets: types.array(Tweet)\n})\n\n// Instantiate a couple model instances\nconst jamon = Author.create({\n  id: \"jamon\",\n  firstName: \"Jamon\",\n  lastName: \"Holmgren\"\n})\n\nconst tweet = Tweet.create({\n  id: \"1\",\n  author: jamon.id, // just the ID needed here\n  body: \"Hello world!\",\n  timestamp: Date.now()\n})\n\n// Now instantiate the store!\nconst rootStore = RootStore.create({\n  authors: [jamon],\n  tweets: [tweet]\n})\n\n// Ready to use in a React component, if that's your target.\nimport { observer } from \"mobx-react-lite\"\nconst MyComponent = observer((props) => {\n  return <div>Hello, {rootStore.authors[0].firstName}!</div>\n})\n\n// Note: since this component is \"observed\", any changes to rootStore.authors[0].firstName\n// will result in a re-render! If you're not using React, you can also \"listen\" to changes\n// using `onSnapshot`: https://mobx-state-tree.js.org/concepts/snapshots\n```\n\n## Thanks!\n\n- [Michel Weststrate](https://twitter.com/mweststrate) for creating MobX, MobX-State-Tree, and MobX-React.\n- [Infinite Red](https://infinite.red) for supporting ongoing maintenance on MST.\n- [Mendix](https://mendix.com) for sponsoring and providing the opportunity to work on exploratory projects like MST.\n- [Dan Abramov](https://twitter.com/dan_abramov)'s work on [Redux](http://redux.js.org) has strongly influenced the idea of snapshots and transactional actions in MST.\n- [Giulio Canti](https://twitter.com/GiulioCanti)'s work on [tcomb](http://github.com/gcanti/tcomb) and type systems in general has strongly influenced the type system of MST.\n- All the early adopters encouraging to pursue this whole idea and proving it is something feasible.\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.1884765625,
          "content": "## Security contact information\n\nTo report a security vulnerability, please use the\n[Tidelift security contact](https://tidelift.com/security).\nTidelift will coordinate the fix and disclosure.\n"
        },
        {
          "name": "__tests__",
          "type": "tree",
          "content": null
        },
        {
          "name": "bun.lockb",
          "type": "blob",
          "size": 300.0107421875,
          "content": null
        },
        {
          "name": "bunfig.toml",
          "type": "blob",
          "size": 0.0615234375,
          "content": "[test]\nroot = \"./__tests__\"\npreload = [\"./__tests__/setup.ts\"]\n"
        },
        {
          "name": "changelog.md",
          "type": "blob",
          "size": 52.33984375,
          "content": "The manually-updated changelog has been discontinued. For versions > 4.0.0, go here to view changes:\n\n[https://github.com/mobxjs/mobx-state-tree/releases](https://github.com/mobxjs/mobx-state-tree/releases)\n\n# 4.0.0\n\n[BREAKING CHANGE] MST 4.0 requires MobX 6\n\n# 3.17.3\n\nAdd onValidated support to safeReference [#1540 by @orlovcs](https://github.com/mobxjs/mobx-state-tree/pull/1540)\n\n# 3.17.2\n\nFix incorrect access to global `fail` symbol [#1549](https://github.com/mobxjs/mobx-state-tree/pull/1549)\n\n# 3.17.1\n\nRe-release 3.17.0\n\n# 3.17.0\n\n-   Added experimental helpers toGenerator and toGeneratorFunction. [#1543](https://github.com/mobxjs/mobx-state-tree/pull/1543) by [@fruitraccoon](https://github.com/fruitraccoon)\n\n# 3.16.0\n\n-   Added search field to the docs\n-   Custom types can now receive environments as second argument of the `fromSnapshot` option. [#1410](https://github.com/mobxjs/mobx-state-tree/pull/1410) by [@k-g-a](https://github.com/k-g-a)\n-   Added option `maxHistoryLength` to the `UndoManager`, implements [#1417](https://github.com/mobxjs/mobx-state-tree/issues/1417) through [#1426](https://github.com/mobxjs/mobx-state-tree/pull/1426) by [@tibotiber](https://github.com/tibotiber).\n-   Improved TypeScript typings of `flow`, fixes [#1378](https://github.com/mobxjs/mobx-state-tree/pull/1378) through [#1409](https://github.com/mobxjs/mobx-state-tree/pull/1409) by [@nulladdict](https://github.com/nulladdict)\n-   Fixed that calling `createObservableInstanceIfNeeded` would execute an action, even if the function immediately returned. (significant since the extraneous actions would pollute the mobx dev-tools on mere accesses, eg. by ComplexType.prototype.getValue) Fixes [#1421](https://github.com/mobxjs/mobx-state-tree/issues/1421) trough [#1422](https://github.com/mobxjs/mobx-state-tree/pull/1422) by [@Venryx](https://github.com/Venryx)\n-   Fix issue where `snapshotProcessor.is` does not correctly handle model instances. Fixes [#1494](https://github.com/mobxjs/mobx-state-tree/issues/1494) through [#1495](https://github.com/mobxjs/mobx-state-tree/pull/1495) by [@KevinSjoberg](https://github.com/KevinSjoberg)\n-   Make sure that MST no longer requires `setImmediate` to be present, but fallback to other solutions. [#1501](https://github.com/mobxjs/mobx-state-tree/pull/1501) by [@isaachinman](https://github.com/isaachinman)\n\n# 3.15.0\n\n-   Fix for flow typings. This means that now using flows requires at least TypeScript v3.6 and that `castFlowReturn` becomes deprecated.\n-   Fix for empty models / models with all properties set to optional being able to take any value in TypeScript through [#1269](https://github.com/mobxjs/mobx-state-tree/pull/1269) by [@xaviergonz](https://github.com/xaviergonz).\n\n# 3.14.1\n\n-   Made it possible to force full run-time type-checking (for better error messages) in production builds by setting `ENABLE_TYPE_CHECK=true` as environment variable. Fixes [#1332](https://github.com/mobxjs/mobx-state-tree/pull/1332) through [#1337](https://github.com/mobxjs/mobx-state-tree/pull/1337) by [@OverseePublic](https://github.com/OverseePublic)\n-   Fixed an issue where `Type.is` doesn't behave correctly for types that has snapshot processors. Fixes [#1321](https://github.com/mobxjs/mobx-state-tree/issues/1321) through [#1323](https://github.com/mobxjs/mobx-state-tree/pull/1323) by [@Tucker-Eric](https://github.com/Tucker-Eric)\n-   Changed the implementation of the internal `STNValue` type, to fix TS 3.5.3 compatibility. If somebody notices regressions in the TypeScript integration, please report. Fixes [#1343](https://github.com/mobxjs/mobx-state-tree/issues/1343), [#1307](https://github.com/mobxjs/mobx-state-tree/issues/1307)\n-   Added `acceptsUndefined` as option for `safeReference` so it is more suitable to be used inside arrays/maps, through [#1245](https://github.com/mobxjs/mobx-state-tree/pull/1245) by [@xaviergonz](https://github.com/xaviergonz).\n\n# 3.14.0\n\n-   Fixed a regression with `atomic` middleware with async flows [#1250](https://github.com/mobxjs/mobx-state-tree/issues/1250).\n-   Added filter function to `recordActions` to filter out recording some actions. Also added `recording` and `resume` methods.\n-   Added `getRunningActionContext()` to get the currently executing MST action context (if any). Also added the action context helper functions `isActionContextChildOf()` and `isActionContextThisOrChildOf`.\n-   Reduced type nesting to avoid Typescript 3.4 errors about infinite types. Sadly due to this change `types.create` is no longer smart enough in TS to know if skipping the snapshot parameter is valid or not. Through [#1251](https://github.com/mobxjs/mobx-state-tree/pull/1251) by [@xaviergonz](https://github.com/xaviergonz).\n\n# 3.13.0\n\n-   Fixed `Instance<typeof variable>` not giving the proper type in Typescript when the type included both objects and primitives.\n-   Through PR [#1196](https://github.com/mobxjs/mobx-state-tree/pull/1196) by [@xaviergonz](https://github.com/xaviergonz)\n    -   Added `createActionTrackerMiddleware2`, a more easy to use version of the first one, which makes creating middlewares for both sync and async actions more universal.\n    -   Added an optional filter to `recordPatches` to be able to skip recording certain patches.\n    -   `atomic` now uses the new `createActionTrackerMiddleware2`.\n    -   `UndoManager` fixes and improvements:\n        -   Uses the new `createActionTrackerMiddleware2`.\n        -   Added `clearUndo` and `clearRedo` to only clear those.\n        -   Added `undoLevels` and `redoLevels` to know how many undo/redo actions are available.\n        -   Made undo manager actions atomic, so they won't actually do any partial changes if for some reason they fail.\n        -   Fix for `withoutUndo` so it will only skip recording what is inside, not the whole action - fixes [#1195](https://github.com/mobxjs/mobx-state-tree/issues/1195).\n\n# 3.12.2\n\n-   Added more output formats for the library (common-js minified version and umd minified version). Note that now the umd version will be the development version while the new umd.min version will be the production version. This change is to keep it in sync with the parent mobx package. Also the npm package is now leaner since it mistakenly included separatedly compiled js files and source maps.\n\n# 3.12.1\n\n-   Fixed a regression with `getEnv` sometimes not returning the proper environment.\n-   Fixed an issue where `map.put` would not work with snapshots of types with an optional id [#1131](https://github.com/mobxjs/mobx-state-tree/issues/1131) through [#1226](https://github.com/mobxjs/mobx-state-tree/pull/1226) by [@xaviergonz](https://github.com/xaviergonz).\n\n# 3.12.0\n\n-   Added `TypeOfValue<typeof variable>` to extract the type of a complex (non primitive) variable in Typescript.\n-   Fixed some Typescript issues with optional arrays [#1218](https://github.com/mobxjs/mobx-state-tree/issues/1218) through [#1229](https://github.com/mobxjs/mobx-state-tree/pull/1229) by [@xaviergonz](https://github.com/xaviergonz)\n-   Added `getNodeId` to get the internal unique node id for an instance [#1168](https://github.com/mobxjs/mobx-state-tree/issues/1168) through [#1225](https://github.com/mobxjs/mobx-state-tree/pull/1225) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fixed nodes being `pop`/`shift`/`splice` from an array not getting properly destroyed through [#1205](https://github.com/mobxjs/mobx-state-tree/pull/1205) by [@xaviergonz](https://github.com/xaviergonz). Not that this means that in order to access the returned dead nodes data without getting a liveliness error/warning then the returned dead nodes have to be either cloned (`clone`) or their snapshots (`getSnapshot`) have to be used first.\n\n# 3.11.0\n\n-   Added an optional third argument to `types.optional` that allows to set alternative optional values other than just `undefined` through [#1192](https://github.com/mobxjs/mobx-state-tree/pull/1192) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fixed detaching arrays/maps killing their children [#1173](https://github.com/mobxjs/mobx-state-tree/issues/1173) through [#1175](https://github.com/mobxjs/mobx-state-tree/pull/1175) by [@xaviergonz](https://github.com/xaviergonz)\n-   Added `types.snapshotProcessor` [#947](https://github.com/mobxjs/mobx-state-tree/issues/947) through [#1165](https://github.com/mobxjs/mobx-state-tree/pull/1165) by [@xaviergonz](https://github.com/xaviergonz). This feature will eventually deprecate `postProcessSnapshot` and `preProcessSnapshot` from models in a next major version.\n-   Performance improvement for event handlers so they consume less RAM through [#1160](https://github.com/mobxjs/mobx-state-tree/pull/1160) by [@xaviergonz](https://github.com/xaviergonz)\n-   Make liveliness errors give more info to trace their cause [#1142](https://github.com/mobxjs/mobx-state-tree/issues/1142) through [#1147](https://github.com/mobxjs/mobx-state-tree/pull/1147) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.10.2\n\n-   Fixed a regression regarding json paths not being correctly rooted to the base [#1128](https://github.com/mobxjs/mobx-state-tree/issues/1128) through [#1146](https://github.com/mobxjs/mobx-state-tree/pull/1146) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.10.1\n\n-   Fixed mobx 5.9.0 compatibility [#1143](https://github.com/mobxjs/mobx-state-tree/issues/1143) through [#1144](https://github.com/mobxjs/mobx-state-tree/pull/1144) by [@xaviergonz](https://github.com/xaviergonz)\n-   Made liveliness checking in warn mode log an error so the stack trace can be seen [#1142](https://github.com/mobxjs/mobx-state-tree/issues/1142) through [#1145](https://github.com/mobxjs/mobx-state-tree/pull/1145) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fixed JSON path escaping, where '/' and '~' were incorrectly being encoded/decoded as '~0' and '~1' rather than '~1' and '~0'. Also fixed empty keys not being handled correctly by JSON patches [#1128](https://github.com/mobxjs/mobx-state-tree/issues/1128). Fixed through [#1129](https://github.com/mobxjs/mobx-state-tree/pull/1129) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.10.0\n\n-   Fix for safeReference doesn't work when multiple nodes reference a single reference that gets deleted [#1115](https://github.com/mobxjs/mobx-state-tree/issues/1115) through [#1121](https://github.com/mobxjs/mobx-state-tree/pull/1121) by [@xaviergonz](https://github.com/xaviergonz)\n-   Little fix for `castFlowReturn` not typecasting the promise to its actual result.\n-   Made `isAlive(node)` reactive, so it can be reacted upon through [#1100](https://github.com/mobxjs/mobx-state-tree/pull/1100) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for unaccessed nodes not unregistering their identifiers [#1112](https://github.com/mobxjs/mobx-state-tree/issues/1112) through [#1113](https://github.com/mobxjs/mobx-state-tree/pull/1113) by [@xaviergonz](https://github.com/xaviergonz)\n-   Added `clear()` to `UndoManager` middleware through [#1118](https://github.com/mobxjs/mobx-state-tree/pull/1118) by [@chemitaxis](https://github.com/chemitaxis)\n\n# 3.9.0\n\n-   TypeScript 3.0 or later is now required when using TypeScript. This brings some improvements:\n    -   `flow` arguments and return types are now correctly inferred automatically. One exception is when the last return of a `flow` is a `Promise`. In these cases `castFlowReturn(somePromise)` needs to be used so the return type can be inferred properly.\n    -   `create` method is now smart enough to warn when no snapshot argument is provided on types that have some mandatory properties.\n-   Added `setLivelinessChecking` and `getLivelinessChecking`, the old `setLivelynessChecking` will eventually be deprecated.\n-   Added `onInvalidated` option for references and `types.safeReference` (see readme) through [#1091](https://github.com/mobxjs/mobx-state-tree/pull/1091) by [@xaviergonz](https://github.com/xaviergonz)\n-   Added `tryReference` and `isValidReference` to use references that might be no longer pointing to any nodes in a safe way through [#1087](https://github.com/mobxjs/mobx-state-tree/pull/1087) by [@xaviergonz](https://github.com/xaviergonz)\n-   Readded `IComplexType` for backwards compatibility.\n\n# 3.8.1\n\n-   Fixed non-initialized nodes not being destroyed [#1080](https://github.com/mobxjs/mobx-state-tree/issues/1080) through [#1082](https://github.com/mobxjs/mobx-state-tree/pull/1082) by [@k-g-a](https://github.com/k-g-a)\n-   Fixed a memory leak in createActionTrackingMiddleware when using flow [#1083](https://github.com/mobxjs/mobx-state-tree/issues/1083) through [#1084](https://github.com/mobxjs/mobx-state-tree/pull/1084) by [@robinfehr](https://github.com/robinfehr)\n\n# 3.8.0\n\n-   Added castToSnapshot/castToReferenceSnapshot methods for TypeScript and fixed some TypeScript typings not being properly detected when using SnapshotIn types through [#1074](https://github.com/mobxjs/mobx-state-tree/pull/1074) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fixed redux middleware throwing an error when a flow is called before it is connected [#1065](https://github.com/mobxjs/mobx-state-tree/issues/1065) through [#1079](https://github.com/mobxjs/mobx-state-tree/pull/1079) by [@mkramb](https://github.com/mkramb) and [@xaviergonz](https://github.com/xaviergonz)\n-   Made `addDisposer` return the passed disposer through [#1059](https://github.com/mobxjs/mobx-state-tree/pull/1059) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.7.1\n\n-   Fixed references to nodes being broken after the node was replaced [#1052](https://github.com/mobxjs/mobx-state-tree/issues/1052), plus speed up of reference resolving when using IDs through [#1053](https://github.com/mobxjs/mobx-state-tree/pull/1053) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.7.0\n\n-   Middleware events now also contain `allParentIds` (chain of causing ids, from root until (excluding) current)\n-   Improved redux dev tools integration, now supporting flows and showing action chains through [#1035](https://github.com/mobxjs/mobx-state-tree/pull/1035) based on a fix by [@bourquep](https://github.com/bourquep)\n\n# 3.6.0\n\n-   Made type Typescript compilation when 'declarations' is set to true + type completion faster thanks to some type optimizations through [#1043](https://github.com/mobxjs/mobx-state-tree/pull/1043) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for array reconciliation of union types with ids [#1045](https://github.com/mobxjs/mobx-state-tree/issues/1045) through [#1047](https://github.com/mobxjs/mobx-state-tree/pull/1047) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fixed bug where the eager option for the union type defaulted to true when no options argument was passed but false when it was passed. Now they both default to true when not specified. Fixed through [#1046](https://github.com/mobxjs/mobx-state-tree/pull/1046) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.5.0\n\n-   Fix for afterCreate/afterAttach sometimes throwing an exception when a node was created as part of a view/computed property [#967](https://github.com/mobxjs/mobx-state-tree/issues/967) through [#1026](https://github.com/mobxjs/mobx-state-tree/pull/1026) by [@xaviergonz](https://github.com/xaviergonz). Note that this fix will only work if your installed peer mobx version is >= 4.5.0 or >= 5.5.0\n-   Fix for cast method being broken in Typescript 3.1.1 through [#1028](https://github.com/mobxjs/mobx-state-tree/pull/1028) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.4.0\n\n-   Added getPropertyMembers(typeOrNode) through [#1016](https://github.com/mobxjs/mobx-state-tree/pull/1016) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for preProcessSnapshot not copied on compose [#613](https://github.com/mobxjs/mobx-state-tree/issues/613) through [#1013](https://github.com/mobxjs/mobx-state-tree/pull/1013) by [@theRealScoobaSteve](https://github.com/theRealScoobaSteve)\n-   Fix for actions sometimes failing to resolve this to self through [#1014](https://github.com/mobxjs/mobx-state-tree/pull/1014) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for preProcessSnapshot not copied on compose [#613](https://github.com/mobxjs/mobx-state-tree/issues/613) through [#1013](https://github.com/mobxjs/mobx-state-tree/pull/1013) by [@theRealScoobaSteve](https://github.com/theRealScoobaSteve)\n-   Improvements to the bookshop example through [#1009](https://github.com/mobxjs/mobx-state-tree/pull/1009) by [@programmer4web](https://github.com/programmer4web)\n-   Fix for a regression with optional identifiers [#1019](https://github.com/mobxjs/mobx-state-tree/issues/1019) through [#1020](https://github.com/mobxjs/mobx-state-tree/pull/1020) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.3.0\n\n-   Fix for references sometimes not intializing its parents [#993](https://github.com/mobxjs/mobx-state-tree/issues/993) through [#997](https://github.com/mobxjs/mobx-state-tree/pull/997) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for TS3 issues with reference type [#994](https://github.com/mobxjs/mobx-state-tree/issues/994) through [#995](https://github.com/mobxjs/mobx-state-tree/pull/995) by [@xaviergonz](https://github.com/xaviergonz)\n-   types.optional will now throw if an instance is directly passed as default value [#1002](https://github.com/mobxjs/mobx-state-tree/issues/1002) through [#1003](https://github.com/mobxjs/mobx-state-tree/pull/1003) by [@xaviergonz](https://github.com/xaviergonz)\n-   Doc fixes and improvements by [@AjaxSolutions](https://github.com/AjaxSolutions) and [@agilgur5](https://github.com/agilgur5)\n\n# 3.2.4\n\n-   Further improvements for Typescript support for enumeration by [@xaviergonz](https://github.com/xaviergonz)\n-   Smaller generated .d.ts files through [#990](https://github.com/mobxjs/mobx-state-tree/pull/990) by [@xaviergonz](https://github.com/xaviergonz)\n-   Fix for exception when destroying children of types.maybe through [#985](https://github.com/mobxjs/mobx-state-tree/pull/985) by [@dsabanin](https://github.com/dsabanin)\n\n# 3.2.3\n\n-   Fixed incorrect typing generation for mst-middlewares [#979](https://github.com/mobxjs/mobx-state-tree/issues/979)\n\n# 3.2.2\n\n-   Fixes for the reconciliation algorithm of arrays [#928](https://github.com/mobxjs/mobx-state-tree/issues/928) through [#960](https://github.com/mobxjs/mobx-state-tree/pull/960) by [@liuqiang1357](https://github.com/liuqiang1357)\n-   Better Typescript support for enumeration, compose, union, literal and references by [@xaviergonz](https://github.com/xaviergonz)\n-   Updated dependencies to latest versions by [@xaviergonz](https://github.com/xaviergonz)\n-   [Internal] Cleanup 'createNode' and related codepaths through [#962](https://github.com/mobxjs/mobx-state-tree/pull/962) by [@k-g-a](https://github.com/k-g-a)\n\n# 3.2.1\n\n-   Fix for wrong generated TS import [#968](https://github.com/mobxjs/mobx-state-tree/issues/968) through [#969](https://github.com/mobxjs/mobx-state-tree/pull/969) by [@k-g-a](https://github.com/k-g-a)\n\n# 3.2.0\n\n-   Made the internal CreationType/SnapshotType/Type official via the new [`SnapshotIn`, `SnapshotOut`, `Instance` and `SnapshotOrInstance<typeof X>`](README.md#typeScript-and-mst) by [@xaviergonz](https://github.com/xaviergonz)\n-   A new [`cast` method](README.md#snapshots-can-be-used-to-write-values) that makes automatic casts from instances/input snapshots for assignments by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.1.1\n\n-   Fixed typings of `getParent` and `getRoot`. Fixes [#951](https://github.com/mobxjs/mobx-state-tree/issues/951) through [#953](https://github.com/mobxjs/mobx-state-tree/pull/953) by [@xaviergonz](https://github.com/xaviergonz)\n\n# 3.1.0\n\n-   Fixed issue where snapshot post-processors where not always applied. Fixes [#926](https://github.com/mobxjs/mobx-state-tree/issues/926), [#961](https://github.com/mobxjs/mobx-state-tree/issues/961), through [#959](https://github.com/mobxjs/mobx-state-tree/pull/959) by [@k-g-a](https://github.com/k-g-a)\n\n# 3.0.3\n\n-   Fixed re-adding the same objects to an array. Fixes [#928](https://github.com/mobxjs/mobx-state-tree/issues/928) through [#949](https://github.com/mobxjs/mobx-state-tree/pull/949) by [@Krivega](https://github.com/Krivega)\n\n# 3.0.2\n\n-   Introduced `types.integer`! By [@jayarjo](https://github.com/jayarjo) through [#935](https://github.com/mobxjs/mobx-state-tree/pull/935)\n-   Improved typescript typings, several fixes to the type system. Awesome contribution by [@xaviergonz](https://github.com/xaviergonz) through [#937](https://github.com/mobxjs/mobx-state-tree/pull/937) and [#945](https://github.com/mobxjs/mobx-state-tree/pull/945). Fixes [#922](https://github.com/mobxjs/mobx-state-tree/issues/922), [#930](https://github.com/mobxjs/mobx-state-tree/issues/930), [#932](https://github.com/mobxjs/mobx-state-tree/issues/932), [#923](https://github.com/mobxjs/mobx-state-tree/issues/923)\n-   Improved handling of `types.late`\n\n# 3.0.1 (retracted)\n\n# 3.0.0\n\nWelcome to MobX-state-tree! This version introduces some breaking changes, but nonetheless is an recommended upgrade as all changes should be pretty straight forward and there is no reason anymore to maintain the 2.x range (3.0 is still compatible with MobX 4)\n\n## Most important changes\n\nMST 3 is twice as fast in initializing trees with half the memory consumption compared to version 2:\n\nRunning `yarn speedtest` on Node 9.3:\n\n|                 | MST 2  | MST 3  |\n| --------------- | ------ | ------ |\n| Time            | 24sec  | 12 sec |\n| Mem             | 315MB  | 168MB  |\n| Size (min+gzip) | 14.1KB | 15.0KB |\n\nBeyond that, MST 3 uses TypeScript 2.8, which results in more accurate TypeScript support.\n\nThe type system has been simplified and improved in several areas. Several open issues around maps and (numeric) keys have been resolved. The `frozen` type can now be fully typed. See below for the full details.\n\nAlso, the 'object has died' exception can be suppressed now. One should still address it, but at least it won't be a show-stopper from now on.\n\n## Changes in the type system\n\n-   **[BREAKING]** `types.identifier` can no longer be parameterized with either `types.string` or `types.number`. So instead of `types.identifier()` use `types.identifier`. Identifiers are now always normalized to strings. This reflects what was already happening internally and solves a lot of edge cases. To use numbers as identifiers, `types.identifierNumber` (instead of `types.identifier(types.number)`) can be used, which serializes it's snapshot to a number, but will internally work like a string based identifier\n-   **[BREAKING]** `types.maybe` now serializes to / from `undefined` by default, as it is more and more the common best practice to don't use `null` at all and MST follows this practice. Use `types.maybeNull` for the old behavior (see [#830](https://github.com/mobxjs/mobx-state-tree/issues/830))\n-   **[BREAKING]** `types.frozen` is now a function, and can now be invoked in a few different ways:\n    1.  `types.frozen()` - behaves the same as `types.frozen` in MST 2.\n    2.  `types.frozen(SubType)` - provide a valid MST type and frozen will check if the provided data conforms the snapshot for that type. Note that the type will not actually be instantiated, so it can only be used to check the _shape_ of the data. Adding views or actions to `SubType` would be pointless.\n    3.  `types.frozen(someDefaultValue)` - provide a primitive value, object or array, and MST will infer the type from that object, and also make it the default value for the field\n    4.  `types.frozen<TypeScriptType>()` - provide a typescript type, to help in strongly typing the field (design time only)\n-   It is no longer necessary to wrap `types.map` or `types.array` in `types.optional` when used in a `model` type, `map` and `array` are now optional by default when used as property type. See [#906](https://github.com/mobxjs/mobx-state-tree/issues/906)\n-   **[BREAKING]** `postProcessSnapshot` can no longer be declared as action, but, like `preProcessSnapshot`, needs to be defined on the type rather than on the instance.\n-   **[BREAKING]** `types.union` is now eager, which means that if multiple valid types for a value are encountered, the first valid type is picked, rather then throwing. #907 / #804, `dispatcher` param => option,\n\n## Other improvements\n\n-   **[BREAKING]** MobX-state-tree now requires at least TypeScript 2.8 when using MST with typescript. The type system has been revamped, and should now be a lot more accurate, especially concerning snapshot types.\n-   **[BREAKING]** `map.put` will now return the inserted node, rather than the map itself. This makes it easier to find objects for which the identifier is not known upfront. See [#766](https://github.com/mobxjs/mobx-state-tree/issues/766) by [k-g-a](https://github.com/k-g-a)\n-   **[BREAKING]** The order of firing hooks when instantiating has slighlty changed, as the `afterCreate` hook will now only be fired upon instantiation of the tree node, which now happens lazily (on first read / action). The internal order in which hooks are fired within a single node has remained the same. See [#845](https://github.com/mobxjs/mobx-state-tree/issues/845) for details\n-   Significantly improved the performance of constructing MST trees. Significantly reduced the memory footprint of MST. Big shoutout to the relentless effort by [k-g-a](https://github.com/k-g-a) to optimize all the things! See [#845](https://github.com/mobxjs/mobx-state-tree/issues/845) for details.\n-   Introduced `setLivelynessChecking(\"warn\" | \"ignore\" | \"error\")`, this can be used to customize how MST should act when one tries to read or write to a node that has already been removed from the tree. The default behavior is `warn`.\n-   Improved the overloads of `model.compose`, see [#892](https://github.com/mobxjs/mobx-state-tree/pull/892) by [t49tran](https://github.com/t49tran)\n-   Fixed issue where computed properties based on `getPath` could return stale results, fixes [#917](https://github.com/mobxjs/mobx-state-tree/issues/917)\n-   Fixed issue where onAction middleware threw on dead nodes when attachAfter option was used\n-   Fixed several issues with maps and numeric identifiers, such as [#884](https://github.com/mobxjs/mobx-state-tree/issues/884) and [#826](https://github.com/mobxjs/mobx-state-tree/issues/826)\n\n## TL,DR Migration guide\n\n-   `types.identifier(types.number)` => `types.identifierNumber`\n-   `types.identifier()` and `types.identifier(types.string)` =>`types.identifier`\n-   `types.frozen` => `types.frozen()`\n-   `types.maybe(x)` => `types.maybeNull(x)`\n-   `postProcessSnapshot` should now be declared on the type instead of as action\n\n# 2.2.0\n\n-   Added support for MobX 5. Initiative by [@jeffberry](https://github.com/jeffberry) through [#868](https://github.com/mobxjs/mobx-state-tree/pull/868/files). Please note that there are JavaScript engine restrictions for MobX 5 (no Internet Explorer, or React Native Android). If you need to target those versions please keep using MobX 4 as peer dependency (MST is compatible with both)\n-   Reduced memory footprint with ~10-20%, by [k-g-a](https://github.com/k-g-a) through [#872](https://github.com/mobxjs/mobx-state-tree/pull/872)\n-   Fixed issue where undo manager was not working correctly for non-root stores, by [marcofugaro](https://github.com/marcofugaro) trough [#875](https://github.com/mobxjs/mobx-state-tree/pull/875)\n\n# 2.1.0\n\n-   Fixed issue where default values of `types.frozen` where not applied correctly after apply snapshot. [#842](https://github.com/mobxjs/mobx-state-tree/pull/842) by [SirbyAlive](https://github.com/SirbyAlive). Fixes [#643](https://github.com/mobxjs/mobx-state-tree/issues/634)\n-   Fixed issue where empty patch sets resulted in in unnecessary history items. [#838](https://github.com/mobxjs/mobx-state-tree/pull/838) by [chemitaxis](https://github.com/chemitaxis). Fixes [#837](https://github.com/mobxjs/mobx-state-tree/issues/837)\n-   `flow`s of destroyed nodes can no 'safely' resume. [#798](https://github.com/mobxjs/mobx-state-tree/pull/798/files) by [Bnaya](https://github.com/Bnaya). Fixes [#792](https://github.com/mobxjs/mobx-state-tree/issues/792)\n-   Made sure the type `Snapshot` is exposed. [#821](https://github.com/mobxjs/mobx-state-tree/pull/821) by [dsabanin](https://github.com/dsabanin)\n-   Fix: the function parameter was incorrectly typed as non-optional. [#851](https://github.com/mobxjs/mobx-state-tree/pull/851) by [abruzzihraig](https://github.com/abruzzihraig)\n\n# 2.0.5\n\n-   It is now possible to get the snapshot of a node without triggering the `postProcessSnapshot` hook. See [#745](https://github.com/mobxjs/mobx-state-tree/pull/745) for details. By @robinfehr\n-   Introduced `getParentOfType` and `hasParentOfType`. See [#767](https://github.com/mobxjs/mobx-state-tree/pull/767) by @k-g-a\n-   Fixed issue where running `typeCheck` accidentally logged typecheck errors to the console. Fixes [#781](https://github.com/mobxjs/mobx-state-tree/issues/781)\n\n# 2.0.4\n\n-   Removed accidental dependency on mobx\n\n# 2.0.3\n\n-   Fixed issue where middleware that changed arguments wasn't properly picked up. See [#732](https://github.com/mobxjs/mobx-state-tree/pull/732) by @robinfehr. Fixes [#731](https://github.com/mobxjs/mobx-state-tree/issues/731)\n-   Fixed reassigning to a custom type from a different type in a union silently failing. See [#737](https://github.com/mobxjs/mobx-state-tree/pull/737) by @univerio. Fixes [#736](https://github.com/mobxjs/mobx-state-tree/issues/736)\n-   Fixed typings issue with TypeScript 2.8. See [#740](https://github.com/mobxjs/mobx-state-tree/pull/740) by @bnaya.\n-   Fixed undo manager apply grouped patches in the wrong order. See [#755](https://github.com/mobxjs/mobx-state-tree/pull/755) by @robinfehr. Fixes [#754](https://github.com/mobxjs/mobx-state-tree/issues/754)\n\n# 2.0.2\n\n-   Fixed bidirectional references from nodes to nodes, see [#728](https://github.com/mobxjs/mobx-state-tree/pull/728) by @robinfehr\n-   `joinJsonPath` and `splitJsonPath` are now exposed as utilities, see [#724](https://github.com/mobxjs/mobx-state-tree/pull/724) by @jjrv\n-   Several documentation and example fixes\n\n# 2.0.1\n\n-   Fixed typings for maps of maps [#704](https://github.com/mobxjs/mobx-state-tree/pull/704) by @xaviergonz\n-   Fixed dependency issue in `mst-middlewares` package\n\n# 2.0.0\n\n**Breaking changes**\n\n-   MobX-state-tree now requires MobX 4.0 or higher\n-   Identifiers are now internally always normalized to strings. This also means that adding an object with an number identifier to an observable map, it should still be requested back as string. In general, we recommend to always use string based identifiers to avoid confusion.\n-   Due to the changes in Mobx 4.0, `types.map(subType).keys()` will return `Iterator` instead of `ObservableArrays`. In order to address this issue, wrap the keys with `Array.from()`.\n\n# 1.4.0\n\n**Features**\n\n-   It is now possible to create [custom primitive(like) types](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/API/README.md#custom)! Implements [#673](https://github.com/mobxjs/mobx-state-tree/issues/673) through [#689](https://github.com/mobxjs/mobx-state-tree/pull/689)\n-   [`getIdentifier`](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/API/README.md#getidentifier) is now exposed as function, to get the identifier of a model instance (if any). Fixes [#674](https://github.com/mobxjs/mobx-state-tree/issues/674) through [#678](https://github.com/mobxjs/mobx-state-tree/pull/678) by TimHollies\n-   Writing [middleware](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/middleware.md) has slightly changed, to make it less error prone and more explicit whether a middleware chain should be aborted. For details, see [#675](https://github.com/mobxjs/mobx-state-tree/pull/675) by Robin Fehr\n-   It is now possible to configure whether [attached middleware](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/API/README.md#addmiddleware) should be triggered for the built-in hooks / operations. [#653](https://github.com/mobxjs/mobx-state-tree/pull/653) by Robin Fehr\n-   We exposed an [api](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/API/README.md#getmembers) to perform reflection on model instances. [#649](https://github.com/mobxjs/mobx-state-tree/pull/649) by Robin Fehr\n\n**Fixes**\n\n-   Fixed a bug where items in maps where not properly reconciled when the `put` operation was used. Fixed [#683](https://github.com/mobxjs/mobx-state-tree/issues/683) and [#672](https://github.com/mobxjs/mobx-state-tree/issues/672) through [#693](https://github.com/mobxjs/mobx-state-tree/pull/693)\n-   Fixed issue where trying to resolve a path would throw exceptions. Fixed [#686](https://github.com/mobxjs/mobx-state-tree/issues/686) through [#692](https://github.com/mobxjs/mobx-state-tree/pull/692)\n-   In non production builds actions and views on models can now be replaced, to simplify mocking. Fixes [#646](https://github.com/mobxjs/mobx-state-tree/issues/646) through [#690](https://github.com/mobxjs/mobx-state-tree/pull/690)\n-   Fixed bug where `tryResolve` could leave a node in a corrupt state. [#668](https://github.com/mobxjs/mobx-state-tree/pull/668) by dnakov\n-   Fixed typings for TypeScript 2.7, through [#667](https://github.com/mobxjs/mobx-state-tree/pull/667) by Javier Gonzalez\n-   Several improvements to error messages\n\n# 1.3.1\n\n-   Fixed bug where `flows` didn't properly batch their next ticks properly in actions, significantly slowing processes down. Fixes [#563](<[#563](https://github.com/mobxjs/mobx-state-tree/issues/563)>)\n\n# 1.3.0\n\n-   Significantly improved the undo/redo manager. The undo manager now supports groups. See [#504](https://github.com/mobxjs/mobx-state-tree/pull/504) by @robinfehr! See the [updated docs](https://github.com/mobxjs/mobx-state-tree/blob/master/packages/mst-middlewares/README.md#undomanager) for more details.\n-   Significantly improved performance, improvements of 20% could be expected, but changes of course per case. See [#553](https://github.com/mobxjs/mobx-state-tree/pull/553)\n-   Implemented `actionLogger` middleware, which logs most events for async actions\n-   Slightly changed the order in which life cycle hooks are fired. `afterAttach` will no fire first on the parent, then on the children. So, unlike `afterCreate`, in `afterAttach` one can assume in `afterAttach that the parent has completely initialized.\n\n# 1.2.1\n\n-   1.2.0 didn't seem to be released correctly...\n\n# 1.2.0\n\n-   Introduced customizable reference types. See the [reference and identifiers](https://github.com/mobxjs/mobx-state-tree#references-and-identifiers) section.\n-   Introduced `model.volatile` to more easily declare and reuse volatile instance state. Volatile state can contain arbitrary data, is shallowly observable and, like props, cannot be modified without actions. See [`model.volatile`](https://github.com/mobxjs/mobx-state-tree#model-volatile) for more details.\n\n# 1.1.1\n\n### Improvements\n\n-   Fixed an issue where nodes where not always created correctly, see #534. Should fix #513 and #531.\n-   All tests are now run in both PROD and non PROD configurations, after running into some bugs that only occurred in production builds.\n-   Some internal optimizations have been applied (and many more will follow). Like having internal leaner node for immutable data. See #474\n-   A lot of minor improvements on the docs\n\n# 1.1.0\n\n### Improvements\n\n-   The concept of process (asynchronous actions) has been renamed to flows. (Mainly to avoid issues with bundlers)\n-   We changed to a lerna setup which allows separately distributing middleware and testing examples with more ease\n-   Every MST middleware is now shipped in a separate package named `mst-middlewares`. They are now written in TypeScript and fully transpiled to ES5 to avoid problems with uglifyjs in create-react-app bundling.\n-   Introduced `createActionTrackingMiddleware`, this significantly simplifies writing middleware for common scenarios. Especially middleware that deals with asynchronous actions (flows)\n-   Renamed `process` to `flow`. Deprecated `process`.\n-   **BREAKING** As a result some middleware event names have also been changed. If you have custom middlewares this change might affect you. Rename middleware event type prefixes starting with `process` to now start with `flow`.\n\n### Fixes\n\n-   Fixed nested maps + environments not working correctly, [#447](https://github.com/mobxjs/mobx-state-tree/pull/447) by @xaviergonz\n-   Improved typescript typings for enumerations, up to 50 values are now supported [#424](https://github.com/mobxjs/mobx-state-tree/pull/447) by @danielduwaer\n\n# 1.0.2\n\n-   Introduced `modelType.extend` which allows creating views and actions with shared state.\n\n# 1.0.1\n\n### Features\n\n-   Added the middlewares `atomic` and types `TimeTraveller`, `UndoManager`. Check out the [docs](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/middleware.md)!\n-   Introduced `createActionTrackingMiddleware` to simplify the creation of middleware that support complex async processes\n-   exposed `typecheck(type, value)` as public api (will ignore environment flags)\n\n### Improvements\n\n-   `getEnv` will return an empty object instead of throwing when a tree was initialized without environment\n-   Fixed issue where patches generated for nested maps were incorrect (#396)\n-   Fixed the escaping of (back)slashes in JSON paths (#405)\n-   Improved the algorithm that reconcile items in an array (#384)\n-   Assigning a node that has an environment to a parent is now allowed, as long as the environment is strictly the same (#387)\n-   Many minor documentation improvements. Thanks everybody who created a PR!\n\n# 1.0.0\n\nNo changes\n\n# 0.12.0\n\n-   **BREAKING** The redux utilities are no longer part of the core package, but need to be imported from `mobx-state-tree/middleware/redux`.\n\n# 0.11.0\n\n### Breaking changes\n\n-   **BREAKING** `onAction` middleware no longer throws when encountering unserializable arguments. Rather, it serializes a struct like `{ $MST_UNSERIALIZABLE: true, type: \"someType\" }`. MST Nodes are no longer automatically serialized. Rather, one should either pass 1: an id, 2: a (relative) path, 3: a snapshot\n-   **BREAKING** `revertPatch` has been dropped. `IReversableJsonPatch` is no longer exposed, instead use the inverse patches generated by `onPatch`\n-   **BREAKING** some middleware events have been renamed: `process_yield` -> `process_resume`, `process_yield_error` -> `process_resume_error`, to make it less confusing how these events relate to `yield` statements.\n-   **BREAKING** patchRecorder's field `patches` has been renamed to `rawPatches,`cleanPatches`to`patches`, and`inversePatches` was added.\n\n### New features\n\n-   Introduced `decorate(middleware, action)` to easily attach middleware to a specific action\n-   Handlers passed to `onPatch(handler: (patch, inversePatch) => void)` now receive as second argument the inverse patch of the emitted patch\n-   `onAction` lister now supports an `attachAfter` parameter\n-   Middleware events now also contain `parentId` (id of the causing action, `0` if none) and `tree` (the root of context)\n\n### Fixes\n\n-   ReduxDevTools connection is no longer one step behind [#287](https://github.com/mobxjs/mobx-state-tree/issues/287)\n-   Middleware is no longer run as part of the transaction of the targeted action\n-   Fixed representation of `union` types in error messages\n\n# 0.10.3\n\n-   **BREAKISH** Redefining lifecycle hooks will now automatically compose them, implements [#252](https://github.com/mobxjs/mobx-state-tree/issues/252)\n-   Added dev-only checks, typecheck will be performed only in dev-mode and top-level API-calls will be checked.\n-   The internal types `IMiddleWareEvent`, `IMiddlewareEventType`, `ISerializedActionCall` are now exposed (fixes [#315](https://github.com/mobxjs/mobx-state-tree/issues/315))\n\n# 0.10.2\n\n-   Object model instances no longer share a prototype.\n\n# 0.10.1\n\n-   Removed accidental dependency on the codemod\n\n# 0.10.0\n\n-   **BREAKING** the syntax to define model types has been updated. See the [updated docs](https://github.com/mobxjs/mobx-state-tree#creating-models) or the original proposal:[#282](https://github.com/mobxjs/mobx-state-tree/pull/286), but no worries, theres a codemod! :D\n-   **BREAKING** `preProcessSnapshot` hook is no longer a normal hook that can be defined as action. Instead, it should be defined on the type using `types.model(...).preProcessSnapshot(value => value)`\n-   **BREAKING** Asynchronous process should now be defined using `process`. See this [example](https://github.com/mobxjs/mobx-state-tree/blob/adba1943af263898678fe148a80d3d2b9f8dbe63/examples/bookshop/src/stores/BookStore.js#L25) or the [asynchronous action docs](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/async-actions.md).\n\n**How to run the codemod?**\n\nThe codemod is provided as npm package command line tool. It has been written using the TypeScript parser, so it will successfully support either TS or regular JavaScript source files.\n\nTo run the codemod, you need to first install it globally by `npm install -g mst-codemod-to-0.10`.\nAfter that, the `mst-codemod-to-0.10` command will be available in your command line.\n\nTo perform the codemod, you need to call in your command line `mst-codemod-to-0.10` followed by the filename you want to codemod. A `.bak` file with the original source will be created for backup purposes, and the file you provided will be updated to the new syntax! Have fun!\n\nPS: You could also use `npx` instead of installing the codemod globally! :)\n\n# 0.9.5\n\n-   Asynchronous actions are now a first class concept in mobx-state-tree. See the [docs](https://github.com/mobxjs/mobx-state-tree/blob/master/docs/async-actions.md)\n\n# 0.9.4\n\n-   Introduced `types.null` and `types.undefined`\n-   Introduced `types.enumeration(name?, options)`\n\n# 0.9.3\n\n-   Fix `note that a snapshot is compatible` when assigning a type to an optional version of itself\n-   Fix error when deleting a non existing item from a map [#255](https://github.com/mobxjs/mobx-state-tree/issues/255)\n-   Now all required TypeScript interfaces are exported in the main mobx-state-tree package [#256](https://github.com/mobxjs/mobx-state-tree/issues/256)\n\n# 0.9.2\n\nIntroduced the concept of reverse patches, see [#231](https://github.com/mobxjs/mobx-state-tree/pull/231/)\n\n-   Introduced the `revertPatch` operation, that takes a patch or list of patches, and reverse applies it to the target.\n-   `onPatch` now takes a second argument, `includeOldValue`, defaulting to `false`, which, if set to true, includes in the patch any value that is being overwritten as result of the patch. Setting this option to true produces patches that can be used with `revertPatch`\n-   `patchRecorder` now introduces additional fields / methods to be able to reverse apply changes: `patchRecorder.cleanPatches`, `patchRecorder.undo`\n\n# 0.9.1\n\n-   Applying a snapshot or patches will now emit an action as well. The name of the emitted action will be `@APPLY_PATCHES`resp `@APPLY_SNAPSHOT`. See [#107](https://github.com/mobxjs/mobx-state-tree/issues/107)\n-   Fixed issue where same Date instance could'nt be used two times in the same state tree [#229](https://github.com/mobxjs/mobx-state-tree/issues/229)\n-   Fixed issue with reapplying snapshots to Date field resulting in snapshot typecheck error[#233](https://github.com/mobxjs/mobx-state-tree/issues/233)\n-   Declaring `types.maybe(types.frozen)` will now result into an error [#224](https://github.com/mobxjs/mobx-state-tree/issues/224)\n-   Added support for Mobx observable arrays in type checks [#221](https://github.com/mobxjs/mobx-state-tree/issues/221) (from [alessioscalici](https://github.com/alessioscalici))\n\n# 0.9.0\n\n-   **BREAKING** Removed `applyPatches` and `applyActions`. Use `applyPatch` resp. `applyAction`, as both will now also accept an array as argument\n-   **BREAKING** `unprotect` and `protect` can only be applied at root nodes to avoid confusing scenarios Fixed [#180](https://github.com/mobxjs/mobx-state-tree/issues/180)\n-   Fixed [#141](https://github.com/mobxjs/mobx-state-tree/issues/141), actions / views are no longer wrapped in dynamically generated functions for a better debugging experience\n-   Small improvements to typings, fixed compilation issues with TypeScript 2.4.1.\n-   Fixed issues where `compose` couldn't overwrite getters. [#209](https://github.com/mobxjs/mobx-state-tree/issues/209), by @homura\n-   Fixed CDN links in readme\n-   Added TodoMVC to the examples section\n\n# 0.8.2\n\n-   Fixed issue in rollup module bundle\n\n# 0.8.1\n\n-   Fixed issue in release script, rendering 0.8.0 useless\n\n# 0.8.0\n\n-   **BREAKING** Dropped `types.extend` in favor of `types.compose`. See [#192](https://github.com/mobxjs/mobx-state-tree/issues/192)\n-   Introduced the lifecycle hooks `preProcessSnapshot` and `postProcessSnapshot`. See [#203](https://github.com/mobxjs/mobx-state-tree/pull/203) / [#100](https://github.com/mobxjs/mobx-state-tree/issues/100)\n-   Use rollup as bundler [#196](https://github.com/mobxjs/mobx-state-tree/pull/196)\n\n# 0.7.3\n\n-   Introduced the concept of volatile / local state in models. See [#168](https://github.com/mobxjs/mobx-state-tree/issues/168), or [docs](https://github.com/mobxjs/mobx-state-tree/tree/master#volatile-state)\n-   Fixed issue with types.map() with types.identifier(types.number) [#191](https://github.com/mobxjs/mobx-state-tree/issues/191) reported by @boatkorachal\n-   Fixed issue with reconciler that affected types.map when node already existed at that key reported by @boatkorachal [#191](https://github.com/mobxjs/mobx-state-tree/issues/191)\n\n# 0.7.2\n\n-   Fixed `cannot read property resolve of undefined` thanks to @cpunion for reporting, now value of dead nodes will be undefined. [#186](https://github.com/mobxjs/mobx-state-tree/issues/186)\n-   Fixed `[LateType] is not defined` thanks to @amir-arad for reporting, when using late as model property type [#187](https://github.com/mobxjs/mobx-state-tree/issues/187)\n-   Fixed `Object.freeze can only be called on Object` thanks to @ds300 for reporting, when using MST on a ReactNative environment [#189](https://github.com/mobxjs/mobx-state-tree/issues/189)\n-   Now the entire codebase is prettier! :D [#187](https://github.com/mobxjs/mobx-state-tree/issues/187)\n\n# 0.7.1\n\n-   Fixed `array.remove` not working\n\n# 0.7.0\n\nThe type system and internal administration has been refactoring, making the internals both simpler and more flexible.\nThings like references and identifiers are now first class types, making them much better composable. [#152](https://github.com/mobxjs/mobx-state-tree/issues/152)\n\n-   **BREAKING** References with a predefined lookup path are no longer supported. Instead of that, identifiers are now looked up in the entire tree. For that reasons identifiers now have to be unique in the entire tree, per type.\n-   **BREAKING** `resolve` is renamed to `resolvePath`\n-   Introduced `resolveIdentifier(type, tree, identifier)` to find objects by identifier\n-   **BREAKING** `types.reference` is by default non-nullable. For nullable identifiers, use `types.maybe(types.reference(X))`\n-   Many, many improvements. Related open issues will be updated.\n-   **BREAKING** `isMST` is renamed to `isStateTreeNode`\n\n# 0.6.3\n\n-   Fixed issue with array/maps of union types @abruzzihraig [#151](https://github.com/mobxjs/mobx-state-tree/issues/151)\n-   Make types.extend support computed attributes @cpunion [#169](https://github.com/mobxjs/mobx-state-tree/issues/169)\n-   Fixed issue with map of primitive types and applySnapshot @pioh [#155](https://github.com/mobxjs/mobx-state-tree/issues/155)\n-   Better type declarations for union, up to 10 supported types\n\n# 0.6.2\n\n-   Fixed issue where arrays where not properly serialized as action argument\n\n# 0.6.1\n\n-   Improved reporting of Type.is(), now it returns a fine grained report of why the provided value is not applicable.\n\n```\n[mobx-state-tree] Error while converting [{}] to AnonymousModel[]:\nat path \"/name\" snapshot undefined is not assignable to type: string.\nat path \"/quantity\" snapshot undefined is not assignable to type: number.\n```\n\n-   Fixed support for `types.reference` in combination with `types.late`, by @robinfehr\n\n# 0.6.0\n\n-   **BREAKING** `types.withDefault` has been renamed to `types.optional`\n-   **BREAKING** Array and map types can no longer be left out of snapshots by default. Use `optional` to make them optional in the snapshot\n-   **BREAKING** Literals no longer have a default value by default (use optional + literal instead)\n-   **BREAKING** Disabled inlining type.model definitions as introduced in 0.5.1; to many subtle issues\n-   Improved identifier support, they are no properly propagated through utility types like `maybe`, `union` etc\n-   Fixed issue where fields where not referred back to default when a partial snapshot was provided\n-   Fixed #122: `types.identifier` now also accepts a subtype to override the default string type; e.g. `types.identifier(types.number)`\n\n# 0.5.1\n\n-   Introduced support for lazy evaluating values in `withDefault`, useful to generate UUID's, timestamps or non-primitive default values\n-   ~~It is now possible to define something like~~ Removed in 0.6.0\n\n```javascript\nconst Box = types.model({\n    point: {\n        x: 10,\n        y: 10\n    }\n}\n```\n\nWhere the type of `point` property is inferred to `point: types.withDefault(types.model({ x: 10, y: 10}), () => ({ x: 10, y: 10 }))`\n\n# 0.5.0\n\n-   ** BREAKING ** protection is now enabled by default (#101)\n-   ** BREAKING ** it is no longer possible to read values from a dead object. Except through `getSnapshot` or `clone` (#102)\n-   ** BREAKING ** `types.recursive` has been removed in favor of `types.late`\n-   Introduced `unprotect`, to disable protection mode for a certain instance. Useful in `afterCreate` hooks\n-   Introduced `types.late`. Usage: `types.late(() => typeDefinition)`. Can be used for circular / recursive type definitions, even across files. See `test/circular(1|2).ts` for an example (#74)\n\n# 0.4.0\n\n**BREAKING** `types.model` no requires 2 parameters to define a model. The first parameter defines the properties, derived values and view functions. The second argument is used to define the actions. For example:\n\n```javascript\nconst Todo = types.model(\"Todo\", {\n    done: types.boolean,\n    toggle() {\n        this.done = !this.done\n    }\n})\n```\n\nNow should be defined as:\n\n```javascript\nconst Todo = types.model(\n    \"Todo\",\n    {\n        done: types.boolean\n    },\n    {\n        toggle() {\n            this.done = !this.done\n        }\n    }\n)\n```\n\nIt is still possible to define functions on the first object. However, those functions are not considered to be actions, but views. They are not allowed to modify values, but instead should produce a new value themselves.\n\n# 0.3.3\n\n-   Introduced lifecycle hooks `afterCreate`, `afterAttach`, `beforeDetach`, `beforeDestroy`, implements #76\n-   Introduced the convenience method `addDisposer(this, cb)` that can be used to easily destruct reactions etc. which are set up in `afterCreate`. See #76\n\n# 0.3.2\n\n-   Fix: actions where not bound automatically\n-   Improved and simplified the reconciliation mechanism, fixed many edge cases\n-   Improved the reference mechanism, fixed many edge cases\n-   Improved performance\n\n# 0.3.1\n\n-   (re) introduced the concept of environments, which can be passed as second argument to `.create`, and picked up using `getEnv`\n\n# 0.3.0\n\n-   Removed `primitive` type, use a more specific type instead\n-   Improved typescript typings of snapshots\n-   Added `depth` parameter to `getParent` and `hasParent`\n-   Separated the concepts of middleware and serializable actions. It is now possible to intercept, modify actions etc through `addMiddleWare`. `onAction` now uses middleware, if it is used, all parameters of actions should be serializable!\n\n# 0.2.2\n\n-   Introduced the concept of liveliness; if nodes are removed from the the tree because they are replaced by some other value, they will be marked as \"died\". This should help to early signal when people hold on to references that are not part of the tree anymore. To explicitly remove an node from a tree, with the intent to spawn a new state tree from it, use `detach`.\n-   Introduced the convenience method `destroy` to remove a model from it's parent and mark it as dead.\n-   Introduced the concept of protected trees. If a tree is protected using `protect`, it can only be modified through action, and not by mutating it directly anymore.\n\n# 0.2.1\n\n-   Introduced .Type and .SnapshotType to be used with TypeScript to get the type for a model\n\n# 0.2.0\n\n-   Renamed `createFactory` to `types.model` (breaking!)\n-   Renamed `composeFactory` to `types.extend` (breaking!)\n-   Actions should now be declared as `name(params) { body }`, instead of `name: action(function (params) { body})` (breaking!)\n-   Models are no longer constructed by invoking the factory as function, but by calling `factory.create` (breaking!)\n-   Introduced `identifier`\n-   Introduced / improved `reference`\n-   Greatly improved typescript support, type inference etc. However there are still limitations as the full typesystem of MST cannot be expressed in TypeScript. Especially concerning the type of snapshots and the possibility to use snapshots as first class value.\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 0.4853515625,
          "content": "version: \"3\"\n\nservices:\n  docusaurus:\n    build: .\n    ports:\n      - 3000:3000\n      - 35729:35729\n    volumes:\n      - ./docs:/app/docs\n      - ./website/blog:/app/website/blog\n      - ./website/core:/app/website/core\n      - ./website/i18n:/app/website/i18n\n      - ./website/pages:/app/website/pages\n      - ./website/static:/app/website/static\n      - ./website/sidebars.json:/app/website/sidebars.json\n      - ./website/siteConfig.js:/app/website/siteConfig.js\n    working_dir: /app/website\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "jest.config.js",
          "type": "blob",
          "size": 0.3134765625,
          "content": "module.exports = {\n  displayName: \"test\",\n  testEnvironment: \"node\",\n  transform: {\n    \"^.+\\\\.tsx?$\": \"ts-jest\"\n  },\n  testRegex: \".*\\\\.test\\\\.tsx?$\",\n  moduleFileExtensions: [\"ts\", \"tsx\", \"js\"],\n  globals: {\n    \"ts-jest\": {\n      tsConfig: \"__tests__/tsconfig.json\"\n    }\n  },\n  reporters: [\"default\", \"jest-junit\"]\n}\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 4.08984375,
          "content": "{\n    \"name\": \"mobx-state-tree\",\n    \"version\": \"7.0.1\",\n    \"description\": \"Opinionated, transactional, MobX powered state container\",\n    \"main\": \"dist/mobx-state-tree.js\",\n    \"umd:main\": \"dist/mobx-state-tree.umd.js\",\n    \"module\": \"dist/mobx-state-tree.module.js\",\n    \"browser\": {\n        \"./dist/mobx-state-tree.js\": \"./dist/mobx-state-tree.js\",\n        \"./dist/mobx-state-tree.module.js\": \"./dist/mobx-state-tree.module.js\"\n    },\n    \"unpkg\": \"dist/mobx-state-tree.umd.min.js\",\n    \"jsnext:main\": \"dist/mobx-state-tree.module.js\",\n    \"react-native\": \"dist/mobx-state-tree.module.js\",\n    \"typings\": \"dist/index.d.ts\",\n    \"sideEffects\": false,\n    \"scripts\": {\n        \"clean\": \"shx rm -rf dist lib\",\n        \"build\": \"bun run clean && tsc && cpr lib/src dist --filter=\\\\.js$ && rollup -c\",\n        \"test:dev\": \"NODE_ENV=development bun test\",\n        \"test:prod\": \"MST_TESTING=1 NODE_ENV=production bun test\",\n        \"test:all\": \"bun run test:dev && bun run test:prod && bun run size\",\n        \"test:perf\": \"bun test ./__tests__/perf/\",\n        \"test:perf:compiled\": \"bun run build && bun run jest:perf && TS_NODE_COMPILER_OPTIONS='{\\\"module\\\": \\\"commonjs\\\"}' /usr/bin/time node --expose-gc --require ts-node/register __tests__/perf/report.ts\",\n        \"typecheck\": \"tsc --noEmit\",\n        \"size\": \"size-limit\",\n        \"tag-new-version\": \"yarn version && git push --tags\",\n        \"build-docs\": \"bun run fix-typedoc && shx rm -rf ./docs/API && typedoc --options ./typedocconfig.js\",\n        \"publish-docs\": \"bun run build-docs && cd ./website && GIT_USER=jamonholmgren USE_SSH=true bun run publish-gh-pages\",\n        \"start\": \"cd website && bun run start\",\n        \"prepare\": \"husky install\",\n        \"lint\": \"tslint -c ./tslint.json 'src/**/*.ts'\",\n        \"fix-typedoc\": \"shx rm -rf ./node_modules/typedoc/node_modules/typescript\",\n        \"prettier:list\": \"prettier --list-different \\\"src/**/*.ts\\\" \\\"__tests__/**/*.ts\\\"\",\n        \"prettier:check\": \"prettier --check \\\"src/**/*.ts\\\" \\\"__tests__/**/*.ts\\\"\",\n        \"prettier:write\": \"prettier --write \\\"src/**/*.ts\\\" \\\"__tests__/**/*.ts\\\"\"\n    },\n    \"lint-staged\": {\n        \"*.{ts,tsx,js,jsx}\": [\n            \"prettier --write\"\n        ]\n    },\n    \"repository\": {\n        \"type\": \"git\",\n        \"url\": \"https://github.com/mobxjs/mobx-state-tree.git\"\n    },\n    \"author\": \"Michel Weststrate\",\n    \"license\": \"MIT\",\n    \"bugs\": {\n        \"url\": \"https://github.com/mobxjs/mobx-state-tree/issues\"\n    },\n    \"files\": [\n        \"dist/\"\n    ],\n    \"devDependencies\": {\n        \"@size-limit/preset-big-lib\": \"^5.0.3\",\n        \"@types/bun\": \"^1.0.6\",\n        \"@types/node\": \"^12.0.2\",\n        \"concat\": \"^1.0.3\",\n        \"coveralls\": \"^3.1.0\",\n        \"cpr\": \"^3.0.1\",\n        \"husky\": \"^7.0.0\",\n        \"lint-staged\": \"^11.1.2\",\n        \"mobx\": \"^6.13.1\",\n        \"prettier\": \"3.4.1\",\n        \"rollup\": \"^2.18.1\",\n        \"rollup-plugin-commonjs\": \"^10.0.0\",\n        \"rollup-plugin-filesize\": \"^9.0.1\",\n        \"rollup-plugin-node-resolve\": \"^5.0.0\",\n        \"rollup-plugin-replace\": \"^2.1.0\",\n        \"rollup-plugin-terser\": \"^6.1.0\",\n        \"shx\": \"^0.3.2\",\n        \"size-limit\": \"^5.0.3\",\n        \"ts-essentials\": \"^9.4.1\",\n        \"ts-node\": \"^8.10.2\",\n        \"tslib\": \"^2.0.0\",\n        \"tslint\": \"^6.1.3\",\n        \"tslint-config-prettier\": \"^1.18.0\",\n        \"typedoc\": \"0.15.8\",\n        \"typedoc-plugin-markdown\": \"2.2.11\",\n        \"typescript\": \"^5.3.3\",\n        \"yarn-deduplicate\": \"^3.1.0\"\n    },\n    \"peerDependencies\": {\n        \"mobx\": \"^6.3.0\"\n    },\n    \"keywords\": [\n        \"mobx\",\n        \"mobx-state-tree\",\n        \"promise\",\n        \"reactive\",\n        \"frp\",\n        \"functional-reactive-programming\",\n        \"state management\"\n    ],\n    \"gitHead\": \"27ec7ac0b0743a367fb01a7f40192f3042bd91f2\",\n    \"prettier\": {\n        \"printWidth\": 100,\n        \"semi\": false,\n        \"tabWidth\": 4,\n        \"singleQuote\": false,\n        \"trailingComma\": \"none\",\n        \"arrowParens\": \"avoid\",\n        \"useTabs\": false\n    },\n    \"size-limit\": [\n        {\n            \"path\": \"./dist/mobx-state-tree.min.js\",\n            \"limit\": \"25 KB\",\n            \"webpack\": false,\n            \"running\": false\n        }\n    ]\n}\n"
        },
        {
          "name": "rollup.config.js",
          "type": "blob",
          "size": 1.2958984375,
          "content": "import * as path from \"path\"\nimport filesize from \"rollup-plugin-filesize\"\nimport resolve from \"rollup-plugin-node-resolve\"\nimport { terser } from \"rollup-plugin-terser\"\nimport replace from \"rollup-plugin-replace\"\n\nconst devPlugins = () => [resolve(), filesize()]\n\n// For umd builds, set process.env.NODE_ENV to \"development\" since 'process' is not available in the browser\nconst devPluginsUmd = () => [\n  resolve(),\n  replace({ \"process.env.NODE_ENV\": JSON.stringify(\"development\") }),\n  filesize()\n]\n\nconst prodPlugins = () => [\n  resolve(),\n  replace({ \"process.env.NODE_ENV\": JSON.stringify(\"production\") }),\n  terser(),\n  filesize()\n]\n\nconst config = (outFile, format, mode) => ({\n  input: \"./lib/src/index.js\",\n  output: {\n    file: path.join(\"./dist\", outFile),\n    format: format,\n    globals: {\n      mobx: \"mobx\"\n    },\n    name: format === \"umd\" ? \"mobxStateTree\" : undefined\n  },\n  external: [\"mobx\"],\n  plugins: mode === \"production\" ? prodPlugins() : format === \"umd\" ? devPluginsUmd() : devPlugins()\n})\n\nexport default [\n  config(\"mobx-state-tree.js\", \"cjs\", \"development\"),\n  config(\"mobx-state-tree.min.js\", \"cjs\", \"production\"),\n  config(\"mobx-state-tree.umd.js\", \"umd\", \"development\"),\n  config(\"mobx-state-tree.umd.min.js\", \"umd\", \"production\"),\n  config(\"mobx-state-tree.module.js\", \"es\", \"development\")\n]\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test-results",
          "type": "tree",
          "content": null
        },
        {
          "name": "tsconfig.json",
          "type": "blob",
          "size": 0.6708984375,
          "content": "{\n  \"compilerOptions\": {\n    \"outDir\": \"lib/\",\n    \"target\": \"es5\",\n    \"sourceMap\": false,\n    \"declaration\": true,\n    \"module\": \"es2015\",\n    \"removeComments\": false,\n    \"moduleResolution\": \"node\",\n    \"experimentalDecorators\": true,\n    \"strict\": true,\n    \"strictNullChecks\": true,\n    \"strictFunctionTypes\": true,\n    \"noImplicitAny\": true,\n    \"noFallthroughCasesInSwitch\": true,\n    \"noImplicitReturns\": true,\n    \"noImplicitThis\": true,\n    \"importHelpers\": true,\n    \"stripInternal\": true,\n    \"downlevelIteration\": true,\n    \"lib\": [\"es6\"],\n    \"useDefineForClassFields\": true,\n    \"isolatedModules\": true,\n    \"skipLibCheck\": true\n  },\n  \"include\": [\"**/*.js\", \"**/*.ts\"]\n}\n"
        },
        {
          "name": "tslint.json",
          "type": "blob",
          "size": 0.8310546875,
          "content": "{\n    \"extends\": [\"tslint-config-prettier\"],\n    \"rules\": {\n        \"class-name\": true,\n        \"comment-format\": [true, \"check-space\"],\n        \"curly\": false,\n        \"indent\": [true, \"spaces\"],\n        \"interface-name\": false,\n        \"jsdoc-format\": true,\n        \"no-consecutive-blank-lines\": true,\n        \"no-debugger\": true,\n        \"no-duplicate-variable\": true,\n        \"no-eval\": true,\n        \"no-internal-module\": true,\n        \"no-shadowed-variable\": true,\n        \"no-switch-case-fall-through\": true,\n        \"no-unused-expression\": true,\n        \"no-use-before-declare\": false,\n        \"no-var-keyword\": true,\n        \"one-line\": [true, \"check-open-brace\", \"check-whitespace\", \"check-catch\"],\n        \"trailing-comma\": false,\n        \"triple-equals\": [true, \"allow-null-check\"],\n        \"variable-name\": [true, \"ban-keywords\"]\n    }\n}\n"
        },
        {
          "name": "typedocconfig.js",
          "type": "blob",
          "size": 0.2998046875,
          "content": "module.exports = {\n  src: [\"src/index.ts\"],\n  module: \"commonjs\",\n  excludeNotExported: true,\n  excludePrivate: true,\n  excludeProtected: true,\n  mode: \"file\",\n  readme: \"none\",\n  out: \"./docs/API\",\n  theme: \"docusaurus\",\n  tsconfig: \"tsconfig.json\",\n  listInvalidSymbolLinks: true,\n  mdHideSources: true\n}\n"
        },
        {
          "name": "website",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}