{
  "metadata": {
    "timestamp": 1736564512990,
    "page": 133,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "getumbrel/umbrel",
      "stars": 7932,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.361328125,
          "content": "# On Windows, Git defaults to checkout Windows-style and commit Unix-style.\r\n# As such, line endings of bash scripts are converted from LF to CRLF, with\r\n# the effect that when mounting the checkout into a Linux container, the\r\n# bash scripts can't execute because bash does not handle CR. To mitigate,\r\n# conservatively force ALL line endings to be retained.\r\n* -text\r\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.6533203125,
          "content": "# Ignore node_modules anywhere they may be\n\nnode_modules\n\n# Ignore all the bash stuff\n\n.bash_history\n.bash_logout\n.bashrc\n.profile\n.ssh\n.viminfo\n.DS_Store\n\n# Python bytecode\n__pycache__\n*.py[cod]\n\n# umbrel-dev\ndocker-compose.override.yml\n\n# Files and data directories created by services\n# that we shouldn't accidently commit\n\n*.dat\n*.log\n*.cookie\n*.pid\n*.env\nbitcoin/*\ndb/*\nelectrs/*\nnginx/*\nevents/signals/*\nlnd/*\nlogs/*\nstatuses/*\ntor/*\napp-data/*\ndata/\n\n# Commit these files\n\n!statuses/update-status.json\n\n# Commit these empty directories\n\n!db/.gitkeep\n!events/signals/.gitkeep\n!lnd/.gitkeep\n!logs/.gitkeep\n!tor/data/.gitkeep\n!tor/run/.gitkeep\n.umbrel-dev\njwt\n./bin"
        },
        {
          "name": ".prettierrc.js",
          "type": "blob",
          "size": 0.2177734375,
          "content": "/**\n * @type {import('prettier').Config}\n */\nexport default {\n  \"printWidth\": 120,\n  \"semi\": false,\n  \"useTabs\": true,\n  \"trailingComma\": \"all\",\n  \"singleQuote\": true,\n  \"bracketSpacing\": false,\n  \"jsxSingleQuote\": true,\n}\n"
        },
        {
          "name": ".umbrel",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.84765625,
          "content": "Contributing to Umbrel\n======================\n\nUmbrel is an open project and we love to receive contributions from our community! There are many ways to contribute, from writing tutorials or blog posts, improving the documentation, submitting bug reports and feature requests or writing code which can be incorporated into Umbrel itself.\n\nBug reports\n-----------\n\nIf you think you have found a bug in Umbrel, first make sure that you are on the [latest version of Umbrel](https://github.com/getumbrel/umbrel/releases/latest) because your issue may already have been fixed. If not, search our [issues list](https://github.com/getumbrel/umbrel/issues) on GitHub in case a similar issue has already been opened.\n\nIf there's no existing issue, please open a new issue and provide us as much information about the bug as you can. It would be very helpful if you can list down the steps for us to reproduce the bug, because the easier it is for us to recreate the bug, the faster it is likely to be fixed.\n\nFeature requests\n----------------\n\nIf you find yourself wishing for a feature that doesn't exist in Umbrel, you are probably not alone. There are bound to be others out there with similar needs. Please search our [issues list](https://github.com/getumbrel/umbrel/issues) on GitHub and our [community forum](https://community.getumbrel.com). If you can't find an existing feature request, please open a new topic on the [community forum](https://community.getumbrel.com) with your feature request.\n\nContributing code and documentation changes\n-------------------------------------------\n\nIf you would like to contribute a new feature or a bugfix, please discuss your idea first on a GitHub issue. If there is no existing GitHub issue for your idea, please open one. There are often a number of ways to fix a problem and it is important to find the right approach before spending time on a PR that cannot be merged. So we request you to only start the work on implementing a feature once you received a green light from one of our maintainers on your idea and its implementation.\n\nWe add the [help wanted](https://github.com/getumbrel/umbrel/labels/help%20wanted) label to existing GitHub issues for which community contributions are particularly welcome, and we use the [good first issue](https://github.com/getumbrel/umbrel/labels/good%20first%20issue) label to mark issues that we think will be suitable for new contributors.\n\nThe process for contributing to any of the [Umbrel repositories](https://github.com/getumbrel/) is similar.\n\n### Contributor License\n\nBy submitting your contribution, you agree that all of your present and past contributions to us are licensed from you under the MIT license (text below) and do not require us to include your copyright notice. However, if you want to be on our contributor list, please leave us a message [here](https://keybase.io/team/getumbrel).\n\n```\nPermission is hereby granted, free of charge, to any \nperson obtaining a copy of this software and associated \ndocumentation files (the \"Software\"), to deal in the \nSoftware without restriction, including without limitation \nthe rights to use, copy, modify, merge, publish, distribute, \nsublicense, and/or sell copies of the Software, and to \npermit persons to whom the Software is furnished to do so, \nsubject to the following conditions:\n\nThe above copyright notice and this permission notice shall\nbe included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, \nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES \nOF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND \nNONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT \nHOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, \nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, \nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER \nDEALINGS IN THE SOFTWARE.\n```\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 4.685546875,
          "content": "> Umbrel is licensed under the PolyForm Noncommercial License 1.0.0. Please refer to our [License FAQ](https://github.com/getumbrel/umbrel/wiki/License-FAQ) if you have any questions or reach out to us directly at help@getumbrel.com.\n\n# PolyForm Noncommercial License 1.0.0\n\n<https://polyformproject.org/licenses/noncommercial/1.0.0>\n\n## Acceptance\n\nIn order to get any license under these terms, you must agree\nto them as both strict obligations and conditions to all\nyour licenses.\n\n## Copyright License\n\nThe licensor grants you a copyright license for the\nsoftware to do everything you might do with the software\nthat would otherwise infringe the licensor's copyright\nin it for any permitted purpose.  However, you may\nonly distribute the software according to [Distribution\nLicense](#distribution-license) and make changes or new works\nbased on the software according to [Changes and New Works\nLicense](#changes-and-new-works-license).\n\n## Distribution License\n\nThe licensor grants you an additional copyright license\nto distribute copies of the software.  Your license\nto distribute covers distributing the software with\nchanges and new works permitted by [Changes and New Works\nLicense](#changes-and-new-works-license).\n\n## Notices\n\nYou must ensure that anyone who gets a copy of any part of\nthe software from you also gets a copy of these terms or the\nURL for them above, as well as copies of any plain-text lines\nbeginning with `Required Notice:` that the licensor provided\nwith the software.  For example:\n\n> Required Notice: Copyright Yoyodyne, Inc. (http://example.com)\n\n## Changes and New Works License\n\nThe licensor grants you an additional copyright license to\nmake changes and new works based on the software for any\npermitted purpose.\n\n## Patent License\n\nThe licensor grants you a patent license for the software that\ncovers patent claims the licensor can license, or becomes able\nto license, that you would infringe by using the software.\n\n## Noncommercial Purposes\n\nAny noncommercial purpose is a permitted purpose.\n\n## Personal Uses\n\nPersonal use for research, experiment, and testing for\nthe benefit of public knowledge, personal study, private\nentertainment, hobby projects, amateur pursuits, or religious\nobservance, without any anticipated commercial application,\nis use for a permitted purpose.\n\n## Noncommercial Organizations\n\nUse by any charitable organization, educational institution,\npublic research organization, public safety or health\norganization, environmental protection organization,\nor government institution is use for a permitted purpose\nregardless of the source of funding or obligations resulting\nfrom the funding.\n\n## Fair Use\n\nYou may have \"fair use\" rights for the software under the\nlaw. These terms do not limit them.\n\n## No Other Rights\n\nThese terms do not allow you to sublicense or transfer any of\nyour licenses to anyone else, or prevent the licensor from\ngranting licenses to anyone else.  These terms do not imply\nany other licenses.\n\n## Patent Defense\n\nIf you make any written claim that the software infringes or\ncontributes to infringement of any patent, your patent license\nfor the software granted under these terms ends immediately. If\nyour company makes such a claim, your patent license ends\nimmediately for work on behalf of your company.\n\n## Violations\n\nThe first time you are notified in writing that you have\nviolated any of these terms, or done anything with the software\nnot covered by your licenses, your licenses can nonetheless\ncontinue if you come into full compliance with these terms,\nand take practical steps to correct past violations, within\n32 days of receiving notice.  Otherwise, all your licenses\nend immediately.\n\n## No Liability\n\n***As far as the law allows, the software comes as is, without\nany warranty or condition, and the licensor will not be liable\nto you for any damages arising out of these terms or the use\nor nature of the software, under any kind of legal claim.***\n\n## Definitions\n\nThe **licensor** is the individual or entity offering these\nterms, and the **software** is the software the licensor makes\navailable under these terms.\n\n**You** refers to the individual or entity agreeing to these\nterms.\n\n**Your company** is any legal entity, sole proprietorship,\nor other kind of organization that you work for, plus all\norganizations that have control over, are under the control of,\nor are under common control with that organization.  **Control**\nmeans ownership of substantially all the assets of an entity,\nor the power to direct its management and policies by vote,\ncontract, or otherwise.  Control can be direct or indirect.\n\n**Your licenses** are all the licenses granted to you for the\nsoftware under these terms.\n\n**Use** means anything you do with the software requiring one\nof your licenses.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.1240234375,
          "content": "[![umbrelOS](https://github.com/getumbrel/umbrel/assets/10330103/56be7b95-0c24-4dee-ad3a-e5947bc2ee07)](https://umbrel.com/umbrelos)\n\n<p align=\"center\">\n  <h1 align=\"center\">umbrelOS</h1>\n  <p align=\"center\">\n    A beautiful home server OS for self-hosting\n    <br />\n    <a href=\"https://umbrel.com\"><strong>umbrel.com »</strong></a>\n    <br />\n    <br />\n    Buy an <a href=\"https://umbrel.com/umbrel-home\">Umbrel Home</a> or install on a <a href=\"https://github.com/getumbrel/umbrel/wiki/Install-umbrelOS-on-a-Raspberry-Pi-5\">Raspberry Pi 5</a> or <a href=\"https://github.com/getumbrel/umbrel/wiki/Install-umbrelOS-on-x86-systems\">any x86 system</a>.\n    <br />\n    <br />\n    <a href=\"https://twitter.com/umbrel\">\n      <img src=\"https://img.shields.io/twitter/follow/umbrel?style=social\" />\n    </a>\n    <a href=\"https://t.me/getumbrel\">\n      <img src=\"https://img.shields.io/badge/community-chat-%235351FB\">\n    </a>\n    <a href=\"https://reddit.com/r/getumbrel\">\n      <img src=\"https://img.shields.io/reddit/subreddit-subscribers/getumbrel?style=social\">\n    </a>\n    <a href=\"https://community.getumbrel.com\">\n      <img src=\"https://img.shields.io/badge/community-forum-%235351FB\">\n    </a>\n  </p>\n</p>\n\n<br />\n\n<p align=\"center\">\nAt Umbrel, we believe that everyone should be able to enjoy the convenience and benefits of the cloud, without giving up ownership and control of their data.\n</p>\n\n<p align=\"center\">\nTo achieve our vision, we're building a new kind of a home server OS. Instead of paying ransoms for storing your data on someone else's computer while they auction it off to advertisers — you can now easily spin up a server and self-host your data and services at home.\n</p>\n\n<p align=\"center\">\nJust like the cloud, but one that you own and control.\n</p>\n\n<br />\n\n<br />\n\n## Installing umbrelOS\n\n- [Install umbrelOS on a Raspberry Pi 5](https://github.com/getumbrel/umbrel/wiki/Install-umbrelOS-on-a-Raspberry-Pi-5)\n- [Install umbrelOS on any x86 system](https://github.com/getumbrel/umbrel/wiki/Install-umbrelOS-on-x86-Systems)\n- [Install umbrelOS in a VM](https://github.com/getumbrel/umbrel/wiki/Install-umbrelOS-on-a-Linux-VM)\n\n\n## Umbrel App Store\n\n<br />\n\nHere are some of the apps available in the Umbrel App Store. For the complete list of apps, visit [apps.umbrel.com](https://apps.umbrel.com/).\n\n#### Files & Productivity\n\n- [Calibre Web](https://apps.umbrel.com/app/calibre-web) — A clean web app for your eBooks\n- [Nextcloud](https://apps.umbrel.com/app/nextcloud) — Productivity platform that keeps you in control\n- [Immich](https://apps.umbrel.com/app/immich) - High performance photo and video backup solution\n- [PhotoPrism](https://apps.umbrel.com/app/photoprism) — Self-host your photo and video library\n- [SyncThing](https://apps.umbrel.com/app/syncthing) — Peer-to-peer file synchronization between your devices\n- [Vaultwarden](https://apps.umbrel.com/app/vaultwarden) — Unofficial Bitwarden® compatible server\n\n#### Media\n\n- [Jellyfin](https://apps.umbrel.com/app/jellyfin) — The Free Software Media System\n- [Lidarr](https://apps.umbrel.com/app/lidarr) — Looks and smells like Sonarr but made for music\n- [Plex](https://apps.umbrel.com/app/plex) — Stream Movies & TV Shows\n- [Prowlarr](https://apps.umbrel.com/app/prowlarr) — Indexer manager/proxy for Sonarr, Radarr, and Lidarr\n- [Radarr](https://apps.umbrel.com/app/radarr) — Your movie collection manager\n- [Sonarr](https://apps.umbrel.com/app/sonarr) — Smart PVR for newsgroup and bittorrent users\n\n#### Bitcoin & Finance\n\n- [Bitcoin Node](https://apps.umbrel.com/app/bitcoin) — Run your personal node powered by Bitcoin Core\n- [Electrs](https://apps.umbrel.com/app/electrs) — A simple and efficient Electrum Server\n- [Mempool](https://apps.umbrel.com/app/mempool) — A self-hosted explorer for the Bitcoin community\n- [Bitfeed](https://apps.umbrel.com/app/bitfeed) — A beautiful mempool visualizer and block explorer\n- [BTCPay Server](https://apps.umbrel.com/app/btcpay-server) — Accept Bitcoin payments with zero fees & no 3rd party\n- [RoboSats](https://apps.umbrel.com/app/robosats) — Simple and Private Bitcoin P2P Exchange\n- [Jam](https://apps.umbrel.com/app/jam) — Your sats. Your privacy. Your profit.\n- [Samourai Server](https://apps.umbrel.com/app/samourai-server) — Your private backing server for Samourai Wallet\n- [Lightning Node](https://apps.umbrel.com/app/lightning) — Run your personal Lightning Network node\n- [Core Lightning](https://apps.umbrel.com/app/core-lightning) — Run your personal Core Lightning node\n- [Lightning Terminal](https://apps.umbrel.com/app/lightning-terminal) — The easiest way to manage channel liquidity\n- [LNBits](https://apps.umbrel.com/app/lnbits) — Multi-user wallet management system\n- [Ride The Lightning](https://apps.umbrel.com/app/ride-the-lightning) — A powerful dashboard for the Lightning Network\n- [ThunderHub](https://apps.umbrel.com/app/thunderhub) — Take full control of your Lightning node\n- [Invoice Ninja](https://apps.umbrel.com/app/invoice-ninja) - We'll help with the invoicing\n\n#### AI\n\n- [LlamaGPT](https://apps.umbrel.com/app/llama-gpt) - Self-hosted, offline ChatGPT-like chatbot powered by Llama 2\n- [ChatBot UI](https://apps.umbrel.com/app/chatbot-ui) - ChatGPT but better\n- [Chatpad AI](https://apps.umbrel.com/app/chatpad-ai) - Premium quality UI for ChatGPT\n\n#### Networking\n\n- [Pi-hole](https://apps.umbrel.com/app/pi-hole) — Block ads on your entire network\n- [Tailscale](https://apps.umbrel.com/app/tailscale) — Zero config VPN to access your Umbrel from anywhere\n- [Transmission](https://apps.umbrel.com/app/transmission) — A fast, easy and free BitTorrent client\n- [Uptime Kuma](https://apps.umbrel.com/app/uptime-kuma) — Self-hosted uptime monitoring tool\n- [Urbit](https://apps.umbrel.com/app/urbit) — Run Urbit on your Umbrel\n- [Whoogle Search](https://apps.umbrel.com/app/whoogle-search) — A self-hosted, ad-free, privacy-respecting metasearch engine\n\n#### Social\n\n- [Element](https://apps.umbrel.com/app/element) — A glossy Matrix client compatible with Synapse\n- [Invidious](https://apps.umbrel.com/app/invidious) — Browse YouTube without tracking or ads\n- [LibReddit](https://apps.umbrel.com/app/libreddit) — An alternative private front-end to Reddit\n- [Nitter](https://apps.umbrel.com/app/nitter) — Browse Twitter without tracking or ads\n- [Nostr Relay](https://apps.umbrel.com/app/nostr-relay) - Backup all your Nostr activity with your private relay\n- [Synapse](https://apps.umbrel.com/app/synapse) — Matrix reference homeserver\n\n#### Automation\n\n- [Home Assistant](https://apps.umbrel.com/app/home-assistant) — Home automation that puts local control & privacy first\n- [n8n](https://apps.umbrel.com/app/n8n) - Build complex workflows, really fast\n- [Node-RED](https://apps.umbrel.com/app/node-red-standalone) — Wire together the Internet of Things\n\n#### Developer Tools\n\n- [Code Server](https://apps.umbrel.com/app/code-server) — Run VS Code on your Umbrel\n- [Gitea](https://apps.umbrel.com/app/gitea) — A painless self-hosted Git service\n\n> If an app you're looking for isn't available on our app store yet, feel free to open an issue on the [umbrel-apps](https://github.com/getumbrel/umbrel-apps) respository to request it.\n\n## Building apps for umbrelOS\n\nIf you're interested in building an app for umbrelOS or packaging an existing one, please refer to the [Umbrel App Framework documentation](https://github.com/getumbrel/umbrel-apps/blob/master/README.md).\n\n## Setting up a development environment\n\nWith the release of umbrelOS 1.0, a lot of the underlying architecture of the project has changed. This section will be re-written with up-to-date development instructions.\n\n## License\n\numbrelOS is licensed under the PolyForm Noncommercial 1.0.0 license. TL;DR — You're free to use, fork, modify, and redistribute Umbrel for personal and nonprofit use under the same license. If you're interested in using umbrelOS for commercial purposes, such as selling plug-and-play home servers with umbrelOS, etc — please reach out to us at partner@umbrel.com.\n\n[![License](https://img.shields.io/badge/license-PolyForm%20Noncommercial%201.0.0-%235351FB)](https://github.com/getumbrel/umbrel/blob/master/LICENSE.md)\n\n[umbrel.com](https://umbrel.com)\n"
        },
        {
          "name": "containers",
          "type": "tree",
          "content": null
        },
        {
          "name": "info.json",
          "type": "blob",
          "size": 1.6767578125,
          "content": "{\n  \"NOTE\": \"We must keep this file here forever to allow old umbrelOS 0.5.x Umbrel Homes to find the 1.0.0 update and bootstrap themselves into the new mender based update system.\",\n  \"version\": \"1.0.0\",\n  \"name\": \"umbrelOS 1.0\",\n  \"requires\": \">=0.5.3\",\n  \"notes\": \"umbrelOS 1.0 brings a ground-up rebuild with a host of new features, a completely revamped architecture, and a brand new interface.\\n\\nLearn more: https://link.umbrel.com/os\\n\\n- Raspberry Pi users: Please follow the instructions at https://link.umbrel.com/pi-update to update to umbrelOS 1.0.\\n\\n- Umbrel Home users: You're ready to update now by clicking the 'Install Now' button below.\\n\\n- Linux users: Your update is on the horizon and will be available in April 2024: https://link.umbrel.com/linux-update.\\n\\nNote: Updates may overwrite any custom CLI scripts, files, packages, or settings (eg. WiFi) that you've manually installed or modified via command-line (SSH).\\n\\nWhat's new:\\n\\n- New UI: A visually stunning environment with seamless navigation, intuitive interactions, and a home screen you can personalize with widgets\\n\\n- Search (⌘K / Ctrl + K): Instantly find system settings, apps, or initiate actions with a simple keyboard shortcut.\\n\\n- Quick Actions: Interact with apps and system settings faster than ever with right-click shortcuts.\\n\\n- Architectural Overhaul: Re-engineered system for better stability, speed, and simplicity. umbrelOS 1.0 now sends device type information during the update check to ensure customized updates for different devices.\\n\\n- Live Usage: Stay informed with live updates on your device's storage, memory, and CPU usage.\\n\\n- Multilingual Support: Choose from 8 different system languages.\"\n}\n"
        },
        {
          "name": "package-lock.json",
          "type": "blob",
          "size": 0.0908203125,
          "content": "{\n    \"name\": \"umbrel\",\n    \"lockfileVersion\": 3,\n    \"requires\": true,\n    \"packages\": {}\n}\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.1103515625,
          "content": "{\n  \"type\": \"module\",\n  \"scripts\": {\n    \"dev\": \"./scripts/umbrel-dev\",\n    \"dev:help\": \"npm run dev help\"\n  }\n}\n"
        },
        {
          "name": "packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}