{
  "metadata": {
    "timestamp": 1736564060023,
    "page": 609,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "adamcohenhillel/ADeus",
      "stars": 2978,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.0107421875,
          "content": "# See https://help.github.com/articles/ignoring-files/ for more about ignoring files.\n\n# dependencies\n/node_modules\n/.pnp\n.pnp.js\n\n# testing\n/coverage\n/cypress/videos\ncypress.env.json\n\n# next.js\n/.next/\n/out/\n\ntsconfig.tsbuildinfo\n\n# production\n/build\n\n# misc\n.DS_Store\n*.pem\n*.pepk\nAuthKey_*.p8\n\n# debug\nnpm-debug.log*\nyarn-debug.log*\nyarn-error.log*\n.pnpm-debug.log*\nui-debug.log*\n\n# local env files\n.sqlite3\n.venv*\n.env\nout\n.env.local\n.env*.local\n.vscode\npackage-lock.json*\n\n# vercel\n.vercel\n\n# apple deployment config\nios/App/fastlane/Appfile\n\n\n# pycache:\n__pycache__/\n\n# Not sure what a .gitignore is?\n# See: https://git-scm.com/docs/gitignore\n\n# These are directly copied from Jekyll's first-party docs on `.gitignore` files:\n# https://jekyllrb.com/tutorials/using-jekyll-with-bundler/#commit-to-source-control\n\n# Ignore the default location of the built site, and caches and metadata generated by Jekyll\n_site/\n.sass-cache/\n.jekyll-cache/\n.jekyll-metadata\n\n# Ignore folders generated by Bundler\n.bundle/\nvendor/\n\nvenv/\n\n**/build"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.267578125,
          "content": "[submodule \"devices/coralai/coralmicro\"]\n\tpath = devices/coralai/coralmicro\n\turl = https://github.com/google-coral/coralmicro\n[submodule \"devices/esp32-c3/components/arduino\"]\n\tpath = devices/esp32-c3/components/arduino\n\turl = https://github.com/espressif/arduino-esp32.git\n"
        },
        {
          "name": ".prettierignore",
          "type": "blob",
          "size": 0.2119140625,
          "content": "node_modules\n.pnp\n.pnp.js\ncoverage\n\n.changeset\n.github\n\n.next/\n**/next-env.d.ts\nout/\nbuild\n\n.DS_Store\n*.pem\n\nnpm-debug.log*\nyarn-debug.log*\nyarn-error.log*\n.pnpm-debug.log*\n\n.turbo\n\ndist\n.solid\ndocs/\n*.yaml\n*.yml\n*.md"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.037109375,
          "content": "# Attribution-NonCommercial-NoDerivatives 4.0 International\n\n> _Creative Commons Corporation (“Creative Commons”) is not a law firm and does not provide legal services or legal advice. Distribution of Creative Commons public licenses does not create a lawyer-client or other relationship. Creative Commons makes its licenses and related information available on an “as-is” basis. Creative Commons gives no warranties regarding its licenses, any material licensed under their terms and conditions, or any related information. Creative Commons disclaims all liability for damages resulting from their use to the fullest extent possible._\n>\n> ### Using Creative Commons Public Licenses\n>\n> Creative Commons public licenses provide a standard set of terms and conditions that creators and other rights holders may use to share original works of authorship and other material subject to copyright and certain other rights specified in the public license below. The following considerations are for informational purposes only, are not exhaustive, and do not form part of our licenses.\n>\n> - **Considerations for licensors:** Our public licenses are intended for use by those authorized to give the public permission to use material in ways otherwise restricted by copyright and certain other rights. Our licenses are irrevocable. Licensors should read and understand the terms and conditions of the license they choose before applying it. Licensors should also secure all rights necessary before applying our licenses so that the public can reuse the material as expected. Licensors should clearly mark any material not subject to the license. This includes other CC-licensed material, or material used under an exception or limitation to copyright. [More considerations for licensors](http://wiki.creativecommons.org/Considerations_for_licensors_and_licensees#Considerations_for_licensors).\n>\n> - **Considerations for the public:** By using one of our public licenses, a licensor grants the public permission to use the licensed material under specified terms and conditions. If the licensor’s permission is not necessary for any reason–for example, because of any applicable exception or limitation to copyright–then that use is not regulated by the license. Our licenses grant only permissions under copyright and certain other rights that a licensor has authority to grant. Use of the licensed material may still be restricted for other reasons, including because others have copyright or other rights in the material. A licensor may make special requests, such as asking that all changes be marked or described. Although not required by our licenses, you are encouraged to respect those requests where reasonable. [More considerations for the public](http://wiki.creativecommons.org/Considerations_for_licensors_and_licensees#Considerations_for_licensees).\n\n## Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and conditions of this Creative Commons Attribution-NonCommercial-NoDerivatives 4.0 International Public License (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the Licensor grants You such rights in consideration of benefits the Licensor receives from making the Licensed Material available under these terms and conditions.\n\n### Section 1 – Definitions.\n\na. **Adapted Material** means material subject to Copyright and Similar Rights that is derived from or based upon the Licensed Material and in which the Licensed Material is translated, altered, arranged, transformed, or otherwise modified in a manner requiring permission under the Copyright and Similar Rights held by the Licensor. For purposes of this Public License, where the Licensed Material is a musical work, performance, or sound recording, Adapted Material is always produced where the Licensed Material is synched in timed relation with a moving image.\n\nb. **Copyright and Similar Rights** means copyright and/or similar rights closely related to copyright including, without limitation, performance, broadcast, sound recording, and Sui Generis Database Rights, without regard to how the rights are labeled or categorized. For purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not Copyright and Similar Rights.\n\ne. **Effective Technological Measures** means those measures that, in the absence of proper authority, may not be circumvented under laws fulfilling obligations under Article 11 of the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international agreements.\n\nf. **Exceptions and Limitations** means fair use, fair dealing, and/or any other exception or limitation to Copyright and Similar Rights that applies to Your use of the Licensed Material.\n\nh. **Licensed Material** means the artistic or literary work, database, or other material to which the Licensor applied this Public License.\n\ni. **Licensed Rights** means the rights granted to You subject to the terms and conditions of this Public License, which are limited to all Copyright and Similar Rights that apply to Your use of the Licensed Material and that the Licensor has authority to license.\n\nh. **Licensor** means the individual(s) or entity(ies) granting rights under this Public License.\n\ni. **NonCommercial** means not primarily intended for or directed towards commercial advantage or monetary compensation. For purposes of this Public License, the exchange of the Licensed Material for other material subject to Copyright and Similar Rights by digital file-sharing or similar means is NonCommercial provided there is no payment of monetary compensation in connection with the exchange.\n\nj. **Share** means to provide material to the public by any means or process that requires permission under the Licensed Rights, such as reproduction, public display, public performance, distribution, dissemination, communication, or importation, and to make material available to the public including in ways that members of the public may access the material from a place and at a time individually chosen by them.\n\nk. **Sui Generis Database Rights** means rights other than copyright resulting from Directive 96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal protection of databases, as amended and/or succeeded, as well as other essentially equivalent rights anywhere in the world.\n\nl. **You** means the individual or entity exercising the Licensed Rights under this Public License. Your has a corresponding meaning.\n\n### Section 2 – Scope.\n\na. **_License grant._**\n\n1.  Subject to the terms and conditions of this Public License, the Licensor hereby grants You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license to exercise the Licensed Rights in the Licensed Material to:\n\n    A. reproduce and Share the Licensed Material, in whole or in part, for NonCommercial purposes only; and\n\n    B. produce and reproduce, but not Share, Adapted Material for NonCommercial purposes only.\n\n2.  **Exceptions and Limitations.** For the avoidance of doubt, where Exceptions and Limitations apply to Your use, this Public License does not apply, and You do not need to comply with its terms and conditions.\n\n3.  **Term.** The term of this Public License is specified in Section 6(a).\n\n4.  **Media and formats; technical modifications allowed.** The Licensor authorizes You to exercise the Licensed Rights in all media and formats whether now known or hereafter created, and to make technical modifications necessary to do so. The Licensor waives and/or agrees not to assert any right or authority to forbid You from making technical modifications necessary to exercise the Licensed Rights, including technical modifications necessary to circumvent Effective Technological Measures. For purposes of this Public License, simply making modifications authorized by this Section 2(a)(4) never produces Adapted Material.\n\n5.  **Downstream recipients.**\n\n    A. **Offer from the Licensor – Licensed Material.** Every recipient of the Licensed Material automatically receives an offer from the Licensor to exercise the Licensed Rights under the terms and conditions of this Public License.\n\n    B. **No downstream restrictions.** You may not offer or impose any additional or different terms or conditions on, or apply any Effective Technological Measures to, the Licensed Material if doing so restricts exercise of the Licensed Rights by any recipient of the Licensed Material.\n\n6.  **No endorsement.** Nothing in this Public License constitutes or may be construed as permission to assert or imply that You are, or that Your use of the Licensed Material is, connected with, or sponsored, endorsed, or granted official status by, the Licensor or others designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\nb. **_Other rights._**\n\n1.  Moral rights, such as the right of integrity, are not licensed under this Public License, nor are publicity, privacy, and/or other similar personality rights; however, to the extent possible, the Licensor waives and/or agrees not to assert any such rights held by the Licensor to the limited extent necessary to allow You to exercise the Licensed Rights, but not otherwise.\n\n2.  Patent and trademark rights are not licensed under this Public License.\n\n3.  To the extent possible, the Licensor waives any right to collect royalties from You for the exercise of the Licensed Rights, whether directly or through a collecting society under any voluntary or waivable statutory or compulsory licensing scheme. In all other cases the Licensor expressly reserves any right to collect such royalties, including when the Licensed Material is used other than for NonCommercial purposes.\n\n### Section 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\na. **_Attribution._**\n\n1.  If You Share the Licensed Material, You must:\n\n    A. retain the following if it is supplied by the Licensor with the Licensed Material:\n\n    i. identification of the creator(s) of the Licensed Material and any others designated to receive attribution, in any reasonable manner requested by the Licensor (including by pseudonym if designated);\n\n    ii. a copyright notice;\n\n    iii. a notice that refers to this Public License;\n\n    iv. a notice that refers to the disclaimer of warranties;\n\n    v. a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n\n    B. indicate if You modified the Licensed Material and retain an indication of any previous modifications; and\n\n    C. indicate the Licensed Material is licensed under this Public License, and include the text of, or the URI or hyperlink to, this Public License.\n\n    For the avoidance of doubt, You do not have permission under this Public License to Share Adapted Material.\n\n2.  You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the medium, means, and context in which You Share the Licensed Material. For example, it may be reasonable to satisfy the conditions by providing a URI or hyperlink to a resource that includes the required information.\n\n3.  If requested by the Licensor, You must remove any of the information required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\n### Section 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your use of the Licensed Material:\n\na. for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse, reproduce, and Share all or a substantial portion of the contents of the database for NonCommercial purposes only and provided You do not Share Adapted Material;\n\nb. if You include all or a substantial portion of the database contents in a database in which You have Sui Generis Database Rights, then the database in which You have Sui Generis Database Rights (but not its individual contents) is Adapted Material; and\n\nc. You must comply with the conditions in Section 3(a) if You Share all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your obligations under this Public License where the Licensed Rights include other Copyright and Similar Rights.\n\n### Section 5 – Disclaimer of Warranties and Limitation of Liability.\n\na. **Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor offers the Licensed Material as-is and as-available, and makes no representations or warranties of any kind concerning the Licensed Material, whether express, implied, statutory, or other. This includes, without limitation, warranties of title, merchantability, fitness for a particular purpose, non-infringement, absence of latent or other defects, accuracy, or the presence or absence of errors, whether or not known or discoverable. Where disclaimers of warranties are not allowed in full or in part, this disclaimer may not apply to You.**\n\nb. **To the extent possible, in no event will the Licensor be liable to You on any legal theory (including, without limitation, negligence) or otherwise for any direct, special, indirect, incidental, consequential, punitive, exemplary, or other losses, costs, expenses, or damages arising out of this Public License or use of the Licensed Material, even if the Licensor has been advised of the possibility of such losses, costs, expenses, or damages. Where a limitation of liability is not allowed in full or in part, this limitation may not apply to You.**\n\nc. The disclaimer of warranties and limitation of liability provided above shall be interpreted in a manner that, to the extent possible, most closely approximates an absolute disclaimer and waiver of all liability.\n\n### Section 6 – Term and Termination.\n\na. This Public License applies for the term of the Copyright and Similar Rights licensed here. However, if You fail to comply with this Public License, then Your rights under this Public License terminate automatically.\n\nb. Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n\n1.  automatically as of the date the violation is cured, provided it is cured within 30 days of Your discovery of the violation; or\n\n2.  upon express reinstatement by the Licensor.\n\nFor the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have to seek remedies for Your violations of this Public License.\n\nc. For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate terms or conditions or stop distributing the Licensed Material at any time; however, doing so will not terminate this Public License.\n\nd. Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\n### Section 7 – Other Terms and Conditions.\n\na. The Licensor shall not be bound by any additional or different terms or conditions communicated by You unless expressly agreed.\n\nb. Any arrangements, understandings, or agreements regarding the Licensed Material not stated herein are separate from and independent of the terms and conditions of this Public License.\n\n### Section 8 – Interpretation.\n\na. For the avoidance of doubt, this Public License does not, and shall not be interpreted to, reduce, limit, restrict, or impose conditions on any use of the Licensed Material that could lawfully be made without permission under this Public License.\n\nb. To the extent possible, if any provision of this Public License is deemed unenforceable, it shall be automatically reformed to the minimum extent necessary to make it enforceable. If the provision cannot be reformed, it shall be severed from this Public License without affecting the enforceability of the remaining terms and conditions.\n\nc. No term or condition of this Public License will be waived and no failure to comply consented to unless expressly agreed to by the Licensor.\n\nd. Nothing in this Public License constitutes or may be interpreted as a limitation upon, or waiver of, any privileges and immunities that apply to the Licensor or You, including from the legal processes of any jurisdiction or authority.\n\n> Creative Commons is not a party to its public licenses. Notwithstanding, Creative Commons may elect to apply one of its public licenses to material it publishes and in those instances will be considered the “Licensor.” Except for the limited purpose of indicating that material is shared under a Creative Commons public license or as otherwise permitted by the Creative Commons policies published at [creativecommons.org/policies](http://creativecommons.org/policies), Creative Commons does not authorize the use of the trademark “Creative Commons” or any other trademark or logo of Creative Commons without its prior written consent including, without limitation, in connection with any unauthorized modifications to any of its public licenses or any other arrangements, understandings, or agreements concerning use of licensed material. For the avoidance of doubt, this paragraph does not form part of the public licenses.\n>\n> Creative Commons may be contacted at [creativecommons.org](http://creativecommons.org).\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.2392578125,
          "content": "<div align=\"center\">\n\nℹ️ 🔴 Active development of Open Source AI Wearable can be found @ [Friend Repo](https://github.com/BasedHardware/Friend), and [Discord Community](https://discord.gg/kEXXsnb5b3)\n\n# **Adeus**\n\nOpen-Source AI Wearable Device, the future depends on it!\n\n![ADeus v0.1](docs/images/adeus_01.jpeg)\n\n<h3>\n\n[Homepage](https://www.adeus.ai/) | [Documentation](https://docs.adeus.ai/) | [Discord](https://discord.gg/kEXXsnb5b3)\n\n</h3>\n\n[![GitHub Repo stars](https://img.shields.io/github/stars/adamcohenhillel/ADeus)](https://github.com/adamcohenhillel/ADeus)\n\nAdeus is a wearable device that captures what you say and hear in the real world and then transcribes and stores it on your own server. You can then chat with Adeus using the app, and it will have all the right context about what you want or need to talk about - **a truly personalized, personal AI.**\n\n</div>\n\n## Table of contents\n\n- [Why Adeus?](#why-adeus)\n- [How Adeus is built](#how-adeus-is-built)\n- [Documentation](#documentation)\n  - [Getting Started](https://docs.adeus.ai/getting_started.html)\n  - [How to Contribute](https://docs.adeus.ai/#how-to-contribute)\n\n## Why Adeus?\n\nIn the upcoming world, Personal AI will become an integrated part of our daily lives, they will be with us all the time, and will know much about us as our closest friends - and therefore, with Adeus, we are making sure it is completely open-source, and that you can **own** your own data.\n\n## How Adeus is built\n\nAdeus consists of 3 parts:\n\n1. **A mobile / web app:**\n   An interface that allows the user to interact with their Personal AI and data through chat.\n\n2. **Hardware device:** The wearable device that will record everything the user say or hear, and send it to the backend to be processed.\n\n3. **Supabase :** The backend and database, where we will process and store data, and interact with LLMs.\n\n![ADeus diagram](docs/images/adeus_diagram.png)\n\n## Documentation:\n\n- [Getting Started Guide](https://docs.adeus.ai/getting_started.html#1-backend-supabase)\n- [How to Contribute?](https://docs.adeus.ai/#how-to-contribute)\n\n\n\n#### Made by the Community, with -❤️-:\n\n<a href=\"https://github.com/adamcohenhillel/ADeus/graphs/contributors\">\n  <img src=\"https://contrib.rocks/image?repo=adamcohenhillel/ADeus\" />\n</a>\n"
        },
        {
          "name": "TODO.md",
          "type": "blob",
          "size": 2.0322265625,
          "content": "- [ ] An easy setup script / deploy my own Ollama server to replace OpenAI [ticket #6](https://github.com/adamcohenhillel/AdDeus/issues/6)\n- [ ] Add How-to for Ollama setup ([ticket #9](https://github.com/adamcohenhillel/AdDeus/issues/9))\n\n### Known Bugs:\n\n- [ ] Whisper tends to generate YouTube-like text when the audio is unclear, so you can get noise data in the database like \"Thank you for watching\", and \"See you in the next video,\" even though it has nothing to do with the audio ([ticket #7](https://github.com/adamcohenhillel/AdDeus/issues/7))\n\n- [ ] Currently it is using Wi-Fi, which makes it not-so mobile. An alternative approach would either be: ([ticket #8](https://github.com/adamcohenhillel/AdDeus/issues/8))\n\n  - Bluetooth, pairing with the mobile device\n  - Sdd a 4G card that will allow it to be completly independent\n\n- [ ] Sometimes when loading from scratch, it takes some time (2-3 curl requests) until it resolves the DNS of the Supabase instance ([ticket #8](https://github.com/adamcohenhillel/AdDeus/issues/12))\n\n#### Backend:\n\n- The RAG (Retrieval-Augmented Generation) can be extremely improved:\n  - [ ] Need to process the audio not only into \"embeddings\" but also run an LLM on it to generate some context ([ticket #1](https://github.com/adamcohenhillel/AdDeus/issues/1))\n  - [ ] Need to query the RAG more efficiently, maybe with timestamp as well, etc. - not only embeddings (relates to the processing part) ([ticket #2](https://github.com/adamcohenhillel/AdDeus/issues/2))\n- [ ] Improve security - currently I didn't spent too much time making the Supabase RLS really work (for writing data) ([ticket #3](https://github.com/adamcohenhillel/AdDeus/issues/3))\n\n#### Hardware / On-device:\n\n- [ ] Run on a Rasberry Pi Pico / Zero, as it is much much cheaper, and should do the work too ([ticket #4](https://github.com/adamcohenhillel/AdDeus/issues/4))\n- [ ] Currently the setup is without battery, need to find the easiest way to add this as part of the setup ([ticket #5](https://github.com/adamcohenhillel/AdDeus/issues/5))\n\n#### UX and Onboarding\n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "devices",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "prettier.config.cjs",
          "type": "blob",
          "size": 0.2734375,
          "content": "// prettier.config.js, .prettierrc.js, prettier.config.cjs, or .prettierrc.cjs\n\n/** @type {import(\"prettier\").Options} */\nconst config = {\nsingleQuote: true,\ntrailingComma: 'es5',\ntabWidth: 2,\nsemi: true,\nplugins: ['prettier-plugin-organize-imports'],\n};\n\nmodule.exports = config;"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "supabase",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}