{
  "metadata": {
    "timestamp": 1736563783780,
    "page": 289,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "redpanda-data/console",
      "stars": 3884,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".git-hooks",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2216796875,
          "content": "# Misc\n.DS_Store\nnotes.md\nfixname.sh\n\n# IDEs\n**/.vscode\n**/.idea\n**/*.code-workspace\n\n# Helper Scripts\nrun-docker.sh\nrun-backend.sh\nrequests.txt\n\n# Local Formatting\n.prettierrc\n\n# Local build tools installed via Taskfiles\nbuild"
        },
        {
          "name": ".taskversion",
          "type": "blob",
          "size": 0.0078125,
          "content": "v3.34.1\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 25.2626953125,
          "content": "# Changelog\n\n## v2.8.2 / 2025-01-10\n\n- [SECURITY] Update `github.com/go-git/go-git/v5` to fix security issue [CVE-2025-21614](https://nvd.nist.gov/vuln/detail/CVE-2025-21614).\n\n## v2.8.1 / 2024-12-18\n\n- [SECURITY] Built with Go 1.23.4 to fix [CVE-2024-45337](https://nvd.nist.gov/vuln/detail/CVE-2024-45337).\n- [IMPROVEMENT] Add \"Try Again\" button if debug bundle creation failed.\n- [BUFGIX] Properly handle paths that require escaping in environments that use URL rewriting [1526](https://github.com/redpanda-data/console/pull/1526). \n\n## v2.8.0 / 2024-12-03\n\n- [FEATURE] Add debug bundle support, enabling Console to now generate cluster wide debug bundles on Redpanda clusters.\n- [IMPROVEMENT] Add support for CBOR payload deserialization.\n- [IMPROVEMENT] Make git max clone depth configurable.\n- [IMPROVEMENT] Redpanda Connect in Cloud functionality and usability improvements.\n- [IMPROVEMENT] Relax regex restriction to allow greater set of characters for Role names.\n- [CHANGE] Ability to upload Redpanda enterprise licenses via Console, as well as loading licenses from a Redpanda cluster.\n- [BUFGIX] Fix the grammar in the partition error message\n- [BUFGIX] Fix a rendering error if schemaVersion is requested but not supported.\n- [BUFGIX] Fix a bug with topic creation under certain scenarios.\n- [BUFGIX] Fix topic list sorting to use partition count.\n- [SECURITY] Update elliptic package in frontend.\n\n## v2.7.2 / 2024-09-06\n\n- [SECURITY] Built with Go 1.23.1 which comes with secure CipherSuites by default.\n- [IMPROVEMENT] Minor visual improvements (e.g. padding on the loading spinner in the breadcrumb).\n- [BUGFIX] When updating or creating ACLs in some cases the Update/Create button remained disabled due to invalid form validation.\n- [BUGFIX] Fix resize loop of the Monacco editor in Safari.\n- [BUGFIX] Editing a consumer group by timestamp wasn't possible due to a z-index issue with the datepicker.\n\n## v2.7.1 / 2024-08-12\n\n- [IMPROVEMENT] Improve descriptions and columns on Users, ACLs, Roles and Permissions List tab on the security page.\n- [BUGFIX] List all ACL and role permissions in user details page. It used to be permissions inherited via roles only.\n- [BUGFIX] Selecting a specific deserializer shows a proper error message if it fails.\n- [BUGFIX] Fix deserializer for the `__consumer_offsets` topic.\n\n## v2.7.0 / 2024-08-01\n\n- [FEATURE] Add support for managing data transforms in Redpanda.\n- [IMPROVEMENT] Reworked message viewer UX to streamline inspecting Kafka records and also fit well for smaller screen sizes.\n- [IMPROVEMENT] Improved statistics bar on topics details page.\n- [IMPROVEMENT] Better handling for very long resource names such as topic names across all pages.\n- [IMPROVEMENT] Add support for mapping protobuf types to topic names in a more flexible fashion using regex.\n- [IMPROVEMENT] Add hint that the message count is just an estimate and not guaranteed to be accurate.\n- [IMPROVEMENT] Still render the schema registry pages when Console is running with a schema registry that does not support the /types endpoint.\n- [IMPROVEMENT] Add support for submodules when using Git as a source for protobuf schemas.\n- [IMPROVEMENT] Seperate users and ACLs in the security pages to avoid confusion between users and principals.\n- [CHANGE] Remove external news / links from the resources section on the overview page.\n- [BUGFIX] Refresh AWS credentials after token expiration when using MSK IAM Auth.\n- [BUGFIX] Fix size calculation for log dirs when using shared storages such as S3 / GCS. Applies to topic sizes and broker log dir sizes.\n- [BUGFIX] In rare cases decoding Avro records caused a panic. This was fixed by updating the Avro library.\n- [BUGFIX] The frontend application used to request a non-existent schema with id: 0 causing an unnecessary backend request.\n- [BUGFIX] On the create schema page the Create button was sometimes not disabled even though required field input was not yet provided.\n- [BUGFIX] Exponentionally backoff Redpanda adminapi requests if the API is unreachable.\n- [BUGFIX] Fix datepicker conversion between UTC and Local times for listing messages and editing group offsets by timestamp.\n- [BUGFIX] Schema validation errors were not surfaced in the UI.\n\n## v2.6.1 / 2024-07-10\n\n- [SECURITY] update gorilla/schema to address CVE-2024-37298.\n- [SECURITY] update grpc to v1.65.0 to avoid OSV:GHSA-XR7Q-JX4M-X55M.\n- [SECURITY] new build to address CVE-2024-6387.\n\n## v2.6.0 / 2024-05-30\n\n- [FEATURE] Add Redpanda Connect management.\n\n## v2.5.2 / 2024-04-30\n\n- [CHANGE] Update dependencies.\n\n## v2.5.1 / 2024-04-26\n\n- [SECURITY] Update Go to version 1.22.2.\n\n## v2.5.0 / 2024-04-26\n\n- [FEATURE] Add Redpanda Role management.\n\n## v2.4.7 / 2024-04-23\n\n- [CHANGE] Update dependencies.\n- [BUGFIX] Allow `ListMessages` and `PublishMessage` calls in non-Cloud deployments.\n\n## v2.4.6 / 2024-04-09\n\n- [SECURITY] Update Go to v1.22.2 to address [CVE-2023-45288]([https://nvd.nist.gov/vuln/detail](https://nvd.nist.gov/vuln/detail)/CVE-2023-45288)\n- [SECURITY] Authenticated Console users with assigned viewer permissions were able to successfully perform operations that would require admin permissions (e.g. creating ACLs). This does not affect users in Redpanda Cloud.\n- [BUGFIX] Fix empty toast feedback when reassigning partitions in the UI.\n- [IMPROVEMENT] Surface dynamic broker error messages in the UI if operations such as creating topics failed.\n\n## v2.4.5 / 2024-03-06\n\n- [SECURITY] Update Go to v1.22.1 to address multiple [CVEs](https://groups.google.com/g/golang-announce/c/5pwGVUPoMbg).\n- [IMPROVEMENT] Wrap long topic names instead of truncating them in the topics list [#1159](https://github.com/redpanda-data/console/pull/1159).\n\n## v2.4.4 / 2024-03-04\n\n- [BUGFIX] Fix for glob patterns for adapting the preview in the list messages table [#1116](https://github.com/redpanda-data/console/pull/1116).\n- [BUGFIX] Show last available page in paginated search results to avoid blank page content [#1121](https://github.com/redpanda-data/console/pull/1121).\n- [BUGFIX] Send heartbeats in HTTP stream to load messages to avoid idle timeouts from LoadBalancers and reverse proxies [#1109](https://github.com/redpanda-data/console/pull/1109).\n- [IMPROVEMENT] Better handling for long resource names (e.g. topic names) in the UI [#1124](https://github.com/redpanda-data/console/pull/1124).\n- [IMPROVEMENT] Add option to download messages that are too large to be displayed by default [#1129](https://github.com/redpanda-data/console/pull/1129).\n- [IMPROVEMENT] Add `offset.lag.max` option to advanced configuration in the MirrorMaker2 connector setup [#1131](https://github.com/redpanda-data/console/pull/1131).\n\n## v2.4.3 / 2024-02-08\n\n- [BUGFIX] Persist pagination settings in local storage [#1095](https://github.com/redpanda-data/console/pull/1095).\n- [BUGFIX] Re-add search bar to filter connectors by their name [#1094](https://github.com/redpanda-data/console/pull/1094).\n- [BUGFIX] Only update the custom offset in the message search if it's a number [#1092](https://github.com/redpanda-data/console/pull/1092).\n- [BUGFIX] Pushdown filters no longer failed to match when plain strings in key or value were used [#1093](https://github.com/redpanda-data/console/pull/1093).\n- [IMPROVEMENT] Cache custom offset input in message search [#1092](https://github.com/redpanda-data/console/pull/1092).\n\n## v2.4.2 / 2024-02-06\n\n- [BUGFIX] Fix pagination issue in frontend.\n- [BUGFIX] Fix regex filtering issue in ACL screen in frontend [#1080](https://github.com/redpanda-data/console/issues/1080).\n- [BUGFIX] Fix inconsistent filtering issue with list messages API when using pushdown filters [#1073](https://github.com/redpanda-data/console/issues/1073).\n- [IMPROVEMENT] Optimize schema registry protobuf refresh to reduce memory usage [#1040](https://github.com/redpanda-data/console/pull/1040).\n\n## v2.4.1 / 2024-02-02\n\n- [BUGFIX] Fix bug in schema registry URL paths for subject names that used escaping characters (i.e. %2F)\n- [BUGFIX] The pagination component to select different pages always shows up now [#1034](https://github.com/redpanda-data/console/issues/1032)\n- [BUGFIX] When sorting the Kafka topics by size the order was off, the column ordering is fixed now\n- [BUGFIX] Using the \"copy value\" action for a Kafka record no longer includes the payload property multiple times [#1054](https://github.com/redpanda-data/console/issues/1054)\n- [BUGFIX] Selecting the \"size\" column as the only column to show in the table settings used to throw an exception [#1051](https://github.com/redpanda-data/console/issues/1051)\n- [BUGFIX] Fix decoding for msgpack encoded payloads [#1034](https://github.com/redpanda-data/console/issues/1034)\n- [BUGFIX] Under certain circumstances the download messages button downloaded an empty JSON array instead of the shown records [#1031](https://github.com/redpanda-data/console/issues/1031)\n- [BUGFIX] Searching for topics in the topicslist' quicksearch box using a regex did no longer work [#1026](https://github.com/redpanda-data/console/issues/1026)\n- [IMPROVEMENT] Document new `console.maxDeserializationPayloadSize` config to control max message size that is still shown in the frontend\n\n## v2.3.10 / 2024-01-29\n\n- [BUGFIX] Fix bug in schema registry URL paths.\n- [CHANGE] Add better error logging for websocket upgrade.\n\n## v2.4.0 / 2024-01-23\n\n- [FEATURE] Specify strategy (e.g. INT8) for decoding messages\n- [FEATURE] Show summary of each failed decoding strategy when auto decoding messages fails\n- [FEATURE] Full schema management (create, update, delete, compare versions)\n- [IMPROVEMENT] Add button to copy password to clipboard after creating a new user\n- [IMPROVEMENT] Deprecate Websockets in favour of HTTP streaming for streaming messages\n- [IMPROVEMENT] Align UI with Redpanda theme by migrating frontend components from AntD to Redpanda's UI library\n- [IMPROVEMENT] Several improvements for existing and new connectors in the Kafka Connect setup wizard\n\n## v2.3.9 / 2024-01-15\n\n- [SECURITY] Update update github.com/go-git/go-git/v5 to address CVE-2023-4956.\n\n## v2.3.8 / 2023-12-06\n\n- [SECURITY] Update a dependency that may allow to run a DoS attack\n\n## v2.3.7 / 2023-11-17\n\n- [SECURITY] Build new Docker image running with the latest openssl/libcrypto3 lib which addresses CVE-2023-5363. The previous v2.3.6 did in fact not fix this CVE.\n\n## v2.3.6 / 2023-11-16\n\n- [SECURITY] ~~Build new Docker image running with the latest openssl/libcrypto3 lib which addresses CVE-2023-5363~~\n\n## v2.3.5 / 2023-10-16\n\n- [BUGFIX] Add commonly pre-registered protobuf types to support automatic deserialization.\n\n## v2.3.4 / 2023-10-10\n\n- [BUGFIX] Build with latest Alpine image to address CVE-2023-38039.\n\n## v2.3.3 / 2023-09-14\n\n- [BUGFIX] Get all schemas for protobuf compilation in order to support records of multiple versions of same schema.\n- [IMPROVEMENT] Add numeric values to the deserializer. Console will attempt to deserialize payloads as big endian uints.\n\n## v2.3.2 / 2023-09-05\n\n- [BUGFIX] Fix base64 decoding of 'utf8WithControlChars' in frontend\n- [ENHANCEMENT] Update Avro dependency\n\n## v2.3.1 / 2023-08-01\n\n- [BUGFIX] Fix regression with Avro deserialization\n\n## v2.3.0 / 2023-07-21\n\n- [FEATURE] New Kafka connect setup & edit experience\n- [ENHANCEMENT] Support for serving Console on HTTPS / TLS Termination\n- [ENHANCEMENT] Support deserializing Avro payloads with schema references (by @igormq)\n- [ENHANCEMENT] Configurable Kafka connection retry parameters (new config block: `kafka.startup`)\n- [BUGFIX] Show correct controllerId on the overview page\n- [CHANGE] Run docker container as non-root user\n- [CHANGE] Don't log expected error messages for context cancellation on message search\n\n**Enterprise changelog**\n\n- [FEATURE] Support Keycloak as identity provider\n- [FEATURE] Support AzureAD as identity provider\n- [BUGFIX] Report license expiry time correctly\n\n## v2.2.5 / 2023-07-11\n\n- [SECURITY] Build new Docker image running on latest 3.17 Alpine which addresses CVE-2023-28531\n  \n## v2.2.4 / 2023-05-03\n\n- [ENHANCEMENT] Set `USER` instruction to `redpandaconsole` in Dockerfile.\n\n## v2.2.3 / 2023-03-22\n\n- [ENHANCEMENT] Build with CGO disabled.\n- [ENHANCEMENT] Various improvements to authorization.\n\n## v2.2.2 / 2023-03-03\n\n- [ENHANCEMENT] Report license expiry time.\n\n## v2.2.1 / 2023-03-03\n\n- [ENHANCEMENT] Build with Go v1.20\n- [BUGFIX] Show guessed Kafka version on new overview page\n- [BUGFIX] Reduce number of properties shown in stats bar topics & consumer groups page to minimize required browser width\n- [BUGFIX] Escape all URL & query parameters. Consumer groups or Kafka connectors with special characters will no longer fail in Console\n\n## v2.2.0 / 2023-02-17\n\n- [FEATURE] Editing topic configurations\n- [FEATURE] Rework brokers page into a new overview page\n- [ENHANCEMENT] Visual update towards a new Redpanda UI theme\n- [CHANGE] We removed the support for using encrypted PEM certificates as specified in RFC 1423 because it's insecure by design and should not be used by anyone\n- [BUGFIX] Enforce CORS-checks on websocket connection. Defaults to a same-site policy. Allowed origins are configurable via `server.allowedOrigins`\n- [BUGFIX] Emit Protobuf default values when viewing the JSON-rendered records in the message viewer\n- [BUGFIX] The `server.basePath` option to host Console under a different sub-path was malfunctioning and has been fixed\n- [BUGFIX] The schema registry and redpanda admin api client were not using the system's cert pool by default, this has been changed\n\n**Enterprise changelog**\n\n- [FEATURE] We added a new login provider (plain) for username-password authentication\n- [BUGFIX] Fix issues with generic OIDC provider when using self-signed or mutual TLS certificates\n\n## v2.1.1 / 2022-12-01\n\n- [ENHANCEMENT] Auto refresh capability in the frontend (via https://github.com/redpanda-data/console/pull/536 by @victorgawk)\n- [BUGFIX] Some Avro serialized messages failed to deserialize. We replaced LinkedIn's go-avro library with [hamba/avro](https://github.com/hamba/avro) which supports more types\n\n**Enterprise changelog:**\n\n- [ENHANCEMENT] Add possibility to chunk session cookie into multiple cookies in order to store more data inside of Cookies. Must be enabled via `login.useCookieChunking`\n- [BUGFIX] Only refresh session tokens if they are actually about to expire \n\n## 2.1.0 / 2022-11-15\n\n- [FEATURE] ACL management (create/update/delete ACLs)\n- [FEATURE] User management (create/update/delete SASL SCRAM & Redpanda users)\n- [FEATURE] Add checkbox to show/hide internal Kafka topics\n- [ENHANCEMENT] Improve Kafka connect dialog for MM2 connectors\n- [ENHANCEMENT] Show all byte sizes in IEC units such as KiB, MiB etc. (binary prefix)\n- [ENHANCEMENT] Split all Kafka connect options in Basic & Advanced properties\n- [ENHANCEMENT] Add anonymous usage stats (you can opt out by setting `analytics.enabled` to `false`)\n- [ENHANCEMENT] Use separate Kafka API (`DeleteGroups`) to delete consumer groups rather than deleting all its group offsets\n- [BUGFIX] Remove default blanklines from editor when producing Kafka records\n\n**Enterprise changelog:**\n\n- [FEATURE] Add support for hot-reloading RBAC role bindings\n- [ENHANCEMENT] Support for self-signed TLS certificates when connecting to an OIDC endpoint\n- [ENHANCEMENT] Print decoded OIDC token claims if the claim key could not be found for an authenticated user\n\n## 2.0.0 / 2022-08-10\n\n- [CHANGE] We provide a single build for Redpanda Console & Redpanda Console Enterprise, so that you can upgrade versions by just setting a license key.\n- [FEATURE] Rebrand Kowl to Redpanda Console\n- [FEATURE] Create Topics\n- [FEATURE] Publish Kafka records (JSON, Text & Hex/Binary as of today, no schema registry support yet)\n- [FEATURE] Add Quotas pages that lists all kinds of configured Kafka Quotas (requires Kafka v2.6+)\n- [FEATURE] Add single-binary build, linux packages, ARM-builds for Docker images\n- [ENHANCEMENT] Retry connecting if initial bootstrap connection fails with a backoff timer\n- [CHANGE] Rename `owl` config property to `console` (breaking change)\n- [BUGFIX] Configurations with camel cased YAML properties can now be specified via environment variables as well\n\n**Enterprise changelog:**\n\n- [CHANGE] Breaking changes on the configuration (see documentation for new config structure around RBAC & Login)\n- [FEATURE] Introduce support for a generic OpenID Connect provider interface\n\n**Note:** The documentation for Redpanda Console has been moved to Redpanda. You can find the docs here:\n\n- Installation: https://docs.redpanda.com/docs/platform/quickstart/console-installation/\n- Configuration: https://docs.redpanda.com/docs/platform/console/\n\n## 1.5.0 / 2021-11-10\n\n- [FEATURE] Add support for deleting topics\n- [FEATURE] Add support for deleting records within topics (only possible on topics with cleanup.policy=delete due to limitations in Kafka)\n- [FEATURE] Add support for managing multiple Kafka connect clusters via Kowl\n- [FEATURE] Create new Kafka connectors via a setup wizard\n- [ENHANCEMENT] Highlight leader broker for each partition in the topic's partition table\n- [ENHANCEMENT] Embed quicksearch on topic list into table headers (experimental)\n- [ENHANCEMENT] List respective ACLs on topic & consumer group detail page\n- [ENHANCEMENT] Add Kafka 3.0 support\n- [ENHANCEMENT] Broker lists (for example in a topic's 'Partitions' tab) now show which broker is leading the partition\n- [ENHANCEMENT] You can now configure the `baseDirectory` for all Git file providers (e.g. topic docs or protobuf source)\n- [BUGFIX] Broker page does no longer show an error if a broker failed to respond to a DescribeConfigs request\n\n## 1.4.0 / 2021-05-27\n\n- [FEATURE] Proto files can now be provided via the local file system as well\n- [FEATURE] Schema registry support for Protobuf (including auto deserialization)\n- [FEATURE] Consumer group offsets can now be edited (copy offsets from other group, set to start/end/timestamp) or deleted\n- [ENHANCEMENT] Add two new Kafka SASL Mechanisms: OAuthBearer and AWS MSK IAM\n- [ENHANCEMENT] Preview tags in the message viewer can now be named\n- [ENHANCEMENT] Maximum string length in JSON viewer has been increased from 40 to 200 characters\n- [ENHANCEMENT] CTRL + Click on values in JSON viewer will copy the value into the clipboard\n- [ENHANCEMENT] Menu redesigned (profile info for Kowl Business moved to menu bar)\n- [ENHANCEMENT] Rework broker & topic config pages; Shows config sources and all inherited config settings with their value\n- [ENHANCEMENT] Custom TLS config for schema registry\n- [ENHANCEMENT] Estimate topic log dir size if partition replicas are down (if size is estimated a warning is shown in the frontend)\n- [ENHANCEMENT] Messages can now be expanded/collapsed by double-clicking a row\n- [ENHANCEMENT] Group details page: 'Topics' view now has a 'View Topic' button, and the topic names in the 'Members' view are now clickable (both navigate to the topic details page)\n- [BUGFIX] Topicname is now selectable in consumer group details page\n- [BUGFIX] Relative timestamp now updates live in message table\n\n## 1.3.0 / 2021-04-13\n\n- [CHANGE] We removed the Kafka library and replaced it with [franz-go](https://github.com/twmb/franz-go). This allows us to add a lot more features in the future.\n- [CHANGE] Configuration for the topic documentation feature has changed\n- [CHANGE] When the root \"value\" of a message has 0 bytes, it is now correctly deserialized to `nil` instead of `\"\"`. If you use filters in the frontend to filter tombstones you probably used `value != \"\"` before, but with this change you'll have to use `value != null`.\n- [FEATURE] Support setting the listen adress of the webserver (config entry: `server.http.listen-address`, or flag: `listenAddress`). [#150](https://github.com/cloudhut/kowl/issues/150) \n- **[FEATURE] Add Protobuf support**\n- **[FEATURE] Preview Tags has been reworked. Now supports nested tags and autocomplete. Tags can be editted and reordered.**\n- **[FEATURE] You can now save messages by clicking the 'Save Messages' button below the message list, or save a single message from its context menu (right-most column of a message row, visible on hover)**\n- **[FEATURE] Reassign partitions via setup wizard. Use it to balance partition count, disk usage, move replicas to new brokers or decomission brokers**\n- [FEATURE] Add rackId config option to consume from brokers that reside in the same rack if possible (rack aware consuming)\n- [FEATURE] Add MessagePack support in deserializer\n- [FEATURE] You can now select a date/time as the \"start offset\" when searching for messages.\n- [ENHANCEMENT] Show rebalance protocol and coordinator id in consumer group pages\n- [ENHANCEMENT] Kowl can now be configured using environment variables as well\n- [ENHANCEMENT] Show Kafka version in Brokers page\n- [ENHANCEMENT] Add support for decoding messages in the `__consumer_offsets` topic\n- [ENHANCEMENT] Support schema registry with thousands of subjects by reducing the number of information in the schema registry overview page\n- [BUGFIX] Deserialize messages with Avro with a higher priority than UTF-8 messages, so that Avro serialized messages will always be recognized correctly\n- [BUGFIX] Fix deadlock where schema registry requests against older Schema Registries would time out due to the missing /mode endpoint.\n- [BUGFIX] ResourcePatternType is now correctly shown in the ACLs list.\n\n\n## 1.2.2 / 2020-11-23\n- [ENHANCEMENT] Schema registry page has been slightly redesigned so that very complex schemas are more comfortable to inspect\n- [BUGFIX] Fixed rendering errors in schema registry page\n\n## 1.2.1 / 2020-11-16\n- [ENHANCEMENT] Message headers can be expanded/collapsed now\n- [BUGFIX] Kowl now handles message headers containing structured data (JSON) correctly\n\n## 1.2.0 / 2020-11-14\n\n- **[FEATURE] Embed topic documentation using Markdown files from Git repositories ([/docs/features/topic-documentation.md](/docs/features/topic-documentation.md))**\n- **[FEATURE] Support for message headers**\n- **[FEATURE] UI for schema registry (list all registered schemas including schema history)**\n- **[FEATURE] Avro support for deserializing messages**\n- [FEATURE] List all Kafka ACLs\n- [FEATURE] Business: Support for Okta as an identity provider\n- [FEATURE] Support for hosting Kowl under a sub-path ([#107](https://github.com/cloudhut/kowl/issues/107) and [#117](https://github.com/cloudhut/kowl/issues/117))\n- [ENHANCEMENT] Possibility to hide the statistics bar\n- [ENHANCEMENT] Support custom certificates for schema registry client\n- [ENHANCEMENT] Show elapsed time and consumed bytes after filtered message consumption is done\n- [BUGFIX] Kowl now shows the error reported by a login provider (should the login fail)\n- [BUGFIX] Better handling for broker restarts on consumer groups and topics page\n- [BUGFIX] Allow all UTF-8 characters in JavaScript filter code\n- [BUGFIX] Inform user about missing clipboard access instead of silent fails on message copy\n\n## 1.1.0 / 2020-08-06\n\n- [CHANGE] Business: Reworked groups syncing (Google + GitHub)\n- [CHANGE] Business: GitHub team sync uses uses personal access tokens instead of GitHub apps (better support for multi organization environments)\n- [CHANGE] Business: Groups/Teams sync config has changed, see https://github.com/cloudhut/kowl/commit/0f22cd7b18268ecb3be88fe2bc3de8ac9e8febed\n- **[FEATURE] Search messages with an arbitrary JavaScript filter (https://github.com/cloudhut/kowl/issues/48)**\n- **[FEATURE] Get Kafka messages as they arrive (live tail)**\n- [ENHANCEMENT] Message table: You can now select the visible columns and their order (https://github.com/cloudhut/kowl/issues/52)\n- [ENHANCEMENT] Message table: The desired timestamp format can be configured (Only date, only time, unix timestamp, relative) (https://github.com/cloudhut/kowl/issues/52)\n- [ENHANCEMENT] Message table: The no key icon now shows a tooltip to explain the icon's meaning (https://github.com/cloudhut/kowl/issues/52)\n- [ENHANCEMENT] Add endpoint for startup probes (https://github.com/cloudhut/kowl/issues/101)\n- [BUGFIX] After clicking the refresh button it didn't always change the state to \"Refreshing\" (https://github.com/cloudhut/kowl/issues/75)\n\n## 1.0.0 / 2020-06-24\n\n- [CHANGE] Tabs in a topic detail view have been reordered, and the messages tab is now selected by default\n- [CHANGE] Deselecting the input field in the \"Preview Settings\" dialog (or closing the dialog) will be considered as a confirmation now (instead of cancelling the tag that is being added)\n- [FEATURE] Additional filter options (case sensitivity and multi results) for field previews\n- [ENHANCEMENT] In the message table, long keys will now be truncated (>45 chars). Click on a key to show a dialog containing the full key\n- [ENHANCEMENT] Statistics elements will now reduce their size on smaller screens ![image](https://i.imgur.com/18YqrgY.png)\n- [ENHANCEMENT] If you are missing some permissions for a topic (for example: can't view config, or can't view messages), there's now an icon that will be shown for that topic in the topic list. Hovering over it will show the permission details.\n- [ENHANCEMENT] The 'state' (icon + text) of a consumer-groups now also has a popover that - when hovering over the state - shows a table listing all possible states along with some descriptions. ![image](https://i.imgur.com/OEYwqnN.png)\n- [ENHANCEMENT] Topic statistics won't show `retention.bytes`/`retention.ms` for compact topics\n- [BUGFIX] Fixed issues with page sizes and column sorting in tables\n- [BUGFIX] Fixed the calculation of replicated and total partitions\n- [BUGFIX] Preview Tags: properties shown are now in the correct casing (as they are defined in the object)\n\n## 1.0.0-beta1 / 2020-05-24\n\nThis is the initial release which comes with all the currently known features.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 13.337890625,
          "content": "# Contributing to Redpanda Console\n\nWelcome! This guide is intended to help developers that are new to the community\nnavigate the process of making contributions to Redpanda Console. Please be\nsure to also checkout our [code of conduct](https://github.com/redpanda-data/redpanda/blob/dev/CODE_OF_CONDUCT.md).\nWe work hard to make this a welcoming community for all, and we're excited that \nyou are here!\n\nThe basics:\n\n* Use the [Issue Tracker](https://github.com/redpanda-data/console/issues) to\n  report bugs, crashes, performance issues, etc... Please include as much detail\n  as possible.\n\n* We ask that developers sign our [contributor license\n  agreement](https://github.com/redpanda-data/redpanda/tree/dev/licenses). The\n  process of signing the CLA is automated, and you'll be prompted instructions\n  the first time you submit a pull request to the project.\n\n## Recommended Steps to contribute\n\n1. Read this contributing guide\n2. Setup local dev environment\n3. If you want to work on a new feature, coordinate with the maintainers first\n4. Submit changes\n\n### Setup local dev environment\n\nPrerequisites that should be installed before proceeding:\n\n- Latest Node.js v18 & npm v8\n- Latest Go version\n- Docker (required to start a local redpanda cluster)\n\nRedpanda Console consists of two components:\n\n1. React single page application for the frontend\n2. Go backend, which hosts the HTTP / RESTish API\n\nAfter cloning the repository, we need to start them both separately as follows:\n\n**Frontend:**\n- Open a terminal tab and go to the /frontend directory\n- Run `npm install` to install the required frontend dependencies\n- Run `npm start` to start the React proxy that will serve the frontend\n\nThe frontend should be accessible under http://localhost:3000 now. However,\nit is expected that an error is returned because the frontend has no\nAPI to talk to yet. If the frontend is started via npm, errors will be rendered\ndifferently and provide more options that shall help during development.\n\n**Backend:**\n- Browse to /docs/local directory\n- Run `docker compose up -d` to start docker containers (skip this step if you want to use a remotely running Redpanda/Kafka clusters)\n- Change directory to /backend\n- Run `KAFKA_BROKERS=localhost:9092 SERVEFRONTEND=false SERVER_LISTENPORT=9090 go run cmd/api/main.go`\n\nIf you plan to develop on the backend it makes sense to start the go binary with\nyour IDE so that you can attach your debugger on startup as well.\n\n## Submitting changes\n\nWe use a standard GitHub fork + pull request model for merging and reviewing\nchanges. New pull requests should be made against the upstream `master` branch.\nAfter a pull request is opened it will be reviewed, and merged after\npassing continuous integration tests and being accepted by a project or\nsub-system maintainer.\n\n### Review process\n\nIn addition to the content of the changes being made, reviews will consider\nthree additional properties:\n\n1. Formatting of code and documentation\n2. Composition of commit history\n3. Content of commit messages\n\nWe care a great deal about the hygiene of the patches that are merged into the\nproject, and we've designed our review process and standards to reflect that.\nHowever, we're always trying to improve, and welcome any suggestions and\nfeedback.\n\n### Formatting & linting\n\nAll mainstream editors and IDEs should  provide support (either natively \nor through a plugin) for integrating with code formatting tools that can\nconsume the project property files. Configuring your editor to do this is \nhighly recommended.\n\nStyling rules are enforced at the granularity of the pull request, rather than on\neach commit. This is important because occasionally a small change may cause a large\nreformatting, which makes reviewing changes difficult. In this case it would be\nappropriate to split the code change and formatting into separate commits. This is\nusually unnecessary.\n\nBefore submitting your commits, please validate them against the existing linter\nrules. This repository uses a task runner in order to install the required\ndependencies (build tools, linters, formatters) as well as linting and formatting\ncode. In order to use them:\n\n1. Install [task](https://taskfile.dev/installation/) on your machine\n2. In the repository root run: `task backend:fmt`\n3. If you run `task backend:lint` in the repository root the output will highlight\n   linting issues.\n\n### Tests\n\nWhether you are fixing an issue or adding a new feature, it is recommended that new\ntests are added to cover the new functionality. Tests can be run from command line.\n\n**Frontend:**\n- Open a terminal tab and go to the /frontend directory\n- Run `npm test` to run all tests\n\n**Backend:**\n- Some integration tests require a running Docker instance\n- In the repository root run `task backend:test-unit` to run the unit tests\n- Run `task backend:test-integration` to run the unit and integration tests\n- Run `task backend:cover` to run the unit and integration tests with code coverage report\n- Run `task backend:verify` to run the linter and all tests\n\n### Commit history\n\nThe ordering and structure of commits in a pull request is very important. This\nis because the way in which a large change is broken down into individual\ncommits has a significant impact on the review process and later on the ability\nto efficiently find certain types of regressions. A good rule of thumb is that\na set of changes is in good shape when the following properties hold:\n\n1. Each commit introduces a single logical change\n2. Each commit represents a tree that builds without errors\n\nCombined, these two properties tend to produce a history with changes that are\neasier to review (smaller, focused commits), and ensure that tools like `git\nbisect` are able to be applied to the tree.\n\nHere is an example of commits in a hypothetical pull request:\n\n```\nb9f49db32 credits: opening sequence\nb3032f211 scene: morty and summer enter the garage\n60a49a8b9 scene: dog robots build space laser\na34b3eaa0 scene: morty turns into a glass jar\n187547195 credit: closing sequence\n```\n\nAfter receiving feedback, it may be the case that the following additional\nchanges are made:\n\n```\nb9f49db32 credits: opening sequence\nb3032f211 scene: morty and summer enter the garage\n60a49a8b9 scene: dog robots build space laser\na34b3eaa0 scene: morty turns into a glass jar\n187547195 credit: closing sequence\n\n// extra commits\n20929ab22 add extra joke to garage scene\n330fff211 add a new scene in living room\nb0329aaa1 morty glass jar should also levitate\n```\n\nBefore merging we expect that the extra commits be folded back into any previous\ncommits that they modify, resulting in concise commit history that doesn't\nreflect the intermediate changes made based on feedback. In this example, the\nfollowing is a reasonable final set of commits:\n\n```\ncbff210db Merge pull request #123 from rick/morty\nb9f49db32 credits: opening sequence\nb3032f211 scene: morty and summer enter the garage\n60a49a8b9 scene: dog robots build space laser\na34b3eaa0 scene: morty turns into a glass jar\n330fff211 scene: summer and snuffles watching tv\n187547195 credit: closing sequence\n```\n\nIt is common to force push to the pull request branch with the modified history.\nIn this case it can be useful to use the `--keep-base` option to `git rebase`\nwhich will ensure a minimal change set for reviewers.  However, depending on the\nnature of pull request and feedback it may be useful to push extra commits and\nclean up the history as a last step.\n\n### Commit messages\n\nIn addition to code formatting and commit history discussed above, the commit\nmessages themselves (both the format and content being communicated) are also\nimportant.  First let's take a look at formatting.\n\nIt may be surprising that we consider commit message formatting to be important\nenough to have its own section in the contributors guide. There are a couple\nreasons for this.  First, in our experience we have found that adopting a\nstandard for issues related to style and formatting help reduce cognitive load\nwhen consuming content like code or technical writing. But from a practical\nstand point, many developers use terminal based editors with restrictions on\nline width which is the primary dimension to the formatting guidelines of commit\nmessages.\n\nHere is a sample commit message and below we'll discuss formatting guidelines in\nthe context of this message:\n\n```\nserver: display redpanda logo in log when starting\n\nWhen redpanda starts it logs lots of important messages like the active\nconfiguration and details about the system resources. However, it fails\nto do anything fun. This patch resolves this shortcoming by displaying\nthe following redpanda ascii art logo when the system starts.\n                                                                                                                      \n       ___           ___                         ___         ___           ___                         ___         \n      /\\  \\         /\\__\\         _____         /\\  \\       /\\  \\         /\\  \\         _____         /\\  \\        \n     /::\\  \\       /:/ _/_       /::\\  \\       /::\\  \\     /::\\  \\        \\:\\  \\       /::\\  \\       /::\\  \\       \n    /:/\\:\\__\\     /:/ /\\__\\     /:/\\:\\  \\     /:/\\:\\__\\   /:/\\:\\  \\        \\:\\  \\     /:/\\:\\  \\     /:/\\:\\  \\      \n   /:/ /:/  /    /:/ /:/ _/_   /:/  \\:\\__\\   /:/ /:/  /  /:/ /::\\  \\   _____\\:\\  \\   /:/  \\:\\__\\   /:/ /::\\  \\     \n  /:/_/:/__/___ /:/_/:/ /\\__\\ /:/__/ \\:|__| /:/_/:/  /  /:/_/:/\\:\\__\\ /::::::::\\__\\ /:/__/ \\:|__| /:/_/:/\\:\\__\\    \n  \\:\\/:::::/  / \\:\\/:/ /:/  / \\:\\  \\ /:/  / \\:\\/:/  /   \\:\\/:/  \\/__/ \\:\\~~\\~~\\/__/ \\:\\  \\ /:/  / \\:\\/:/  \\/__/    \n   \\::/~~/~~~~   \\::/_/:/  /   \\:\\  /:/  /   \\::/__/     \\::/__/       \\:\\  \\        \\:\\  /:/  /   \\::/__/         \n    \\:\\~~\\        \\:\\/:/  /     \\:\\/:/  /     \\:\\  \\      \\:\\  \\        \\:\\  \\        \\:\\/:/  /     \\:\\  \\         \n     \\:\\__\\        \\::/  /       \\::/  /       \\:\\__\\      \\:\\__\\        \\:\\__\\        \\::/  /       \\:\\__\\        \n      \\/__/         \\/__/         \\/__/         \\/__/       \\/__/         \\/__/         \\/__/         \\/__/        \n         \n\nThe logo is printed to standard out on start-up and when logging to a\nnormal log file. It is not displayed when logging to journald as the\nformatting is not particularly nice.\n\nThe ascii art string literal is annotated with a compiler directive to\nindicate that this string is rarely used and can be stored in a location\noptimized for such data.\n```\n\nThe format of the subject is `area[/detail]: short description` and the entire\nline should be no more than 50 characters in length. The `prefix:` is helpful\nfor readers to quickly identify the relevant subsystem. We recommend taking\na look at recent Git history for examples of common `prefix:` choices.\n\nThere is no restriction on the length of the body, but lines should\nwrap at 72 characters. The exception to this rule is text that should be\nformatted verbatim like log messages, stack traces, and redpanda ascii art.\n\n#### Content\n\nWhile there is no algorithm for writing the perfect commit message, we've found\nthat working towards the following three goals is often a positive signal that\na commit message is in good shape:\n\n1. Explain why the change is being made (the before, and after)\n2. Describe important / non-obvious technical details\n3. Require no extra context to understand\n\nGood technical communication takes a lot of practice, and what makes sense to\none person isn't always optimal for another reader. So our suggestion is to\nerror on the side of more detail, and not stress about making it perfect. Read\non below if you are curious for more details about these bullet points.\n\n#### Explanation and advice\n\nWhen composing a commit message it is important to consider that the content\nserves two distinct goals: optimizing for reviewer time and precision, and\nproviding a historical narrative of changes. In the short term a commit message\nwill be the first thing a reviewer consumes, and can have a dramatic impact on\nthe review process, even for small changes which might require a lot of context\nto understand.\n\nAn important property of a commit message is that it is understandable when read\nin the future by developers that did not participate in the original design and\nreview process. In complex systems like Redpanda it is not uncommon to review\nhistorical changes to sub-systems while debugging an issue or investigating\nregressions. But stumbling upon what looks like a critical change with no\nexplanation can make this process slow and arduous. Since the chance of any one\ncommit being the bottleneck in such a process are tiny, the only robust solution\nis to treat each commit as being likely involved in such a process.\n\nA good rule of thumb is one paragraph for describing why the change is being\nmade. This should generally stand independent of the physical change being made,\nand describe the state of the system being transitioned _away from_, why that\nstate no longer desirable, and how the new state addresses those shortcomings.\n\nIt is much harder to decide what technical details are important or non-obvious.\nBut, if you happened to think one aspect of the changes were interesting or\nchallenging, reviewers and future debuggers will probably have the same--but\nmagnified--reaction.\n\nFinally, the commit message should stand on its own. This means that it should\nlargely not depend on or refer to other commits in a series (e.g. \"in the\nprevious commit...\" or \"and in a later commit this will be implemented\"), nor\nshould it refer to out-of-band conversations (e.g. \"in last week's meeting\").\nRefer to high-level context in the pull request description.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.5234375,
          "content": "# Redpanda Console – A UI for Data Streaming\n\n![GitHub release (latest SemVer)](https://img.shields.io/github/v/release/redpanda-data/console?sort=semver)\n[![Docker Repository](https://img.shields.io/badge/docker%20image-ready-green \"Docker Repository\")](https://hub.docker.com/r/redpandadata/console/tags)\n\nRedpanda Console (previously known as Kowl) is a web application that helps you manage and debug your Kafka/Redpanda workloads effortlessly.\n\nhttps://user-images.githubusercontent.com/23424570/220130537-7b0b8596-0a06-4132-90a5-1be3c169e4f4.mp4\n\n## Features\n\n- **Message viewer:** Explore your topics' messages in our message viewer through ad-hoc queries and dynamic filters. Find any message you want using JavaScript functions to filter messages. Supported encodings are: JSON, Avro, Protobuf, CBOR, XML, MessagePack, Text and Binary (hex view). The used encoding (except Protobuf and CBOR) is recognized automatically.\n- **Consumer groups:** List all your active consumer groups along with their active group offsets, edit group offsets (by group, topic or partition) or delete a consumer group.\n- **Topic overview:** Browse through the list of your Kafka topics, check their configuration, space usage, list all consumers who consume a single topic or watch partition details (such as low and high water marks, message count, ...), embed topic documentation from a git repository and more.\n- **Cluster overview:** List vailable brokers, their space usage, rack id, health, configuration and other information to get a high level overview of your brokers in your cluster.\n- **Security**: Create, list or edit Kafka ACLs and SASL-SCRAM users.\n- **Schema Registry:** List and manage all aspects of your Avro, Protobuf or JSON schemas within your schema registry.\n- **Kafka connect:** Manage connectors from multiple connect clusters, patch configs, view their current state or restart tasks.\n- **Redpanda Transforms:** Manage and monitor data transforms deployed in your Redpanda cluster.  \n\n## Getting Started\n\n### Prerequisites\n\n- Redpanda or any Kafka deployment (v1.0.0+) compatible\n- A web browser to access the Console, which can be deployed using Docker builds or as a single binary across all platforms (amd64 / arm64)\n\n### Installing\n\nWe offer pre built docker images for RP Console, binary builds and a Helm chart to make the installation as comfortable as possible for you. Please take a look at our dedicated [Installation documentation](https://docs.redpanda.com/current/get-started/quick-start/).\n\n### Quick Start\n\nDo you just want to test RP Console against one of your Kafka clusters without spending too much time on the test setup? Here are some docker commands that allow you to run it locally against an existing Redpanda or Kafka cluster:\n\n#### Redpanda/Kafka is running locally\n\nSince Console runs in its own container (which has its own network scope), we have to use host.docker.internal as a bootstrap server. That DNS resolves to the host system's ip address. However since the brokers send a list of all brokers' DNS when a client has connected, you have to make sure your advertised listener is connected accordingly, e.g.: `PLAINTEXT://host.docker.internal:9092`\n\n```shell\ndocker run -p 8080:8080 -e KAFKA_BROKERS=host.docker.internal:9092 docker.redpanda.com/redpandadata/console:latest\n```\n\nDocker supports the `--network=host` option only on Linux. So Linux users use `localhost:9092` as an advertised listener and use the host network namespace instead. Console will then be run as it would be executed on the host machine.\n\n```shell\ndocker run --network=host -p 8080:8080 -e KAFKA_BROKERS=localhost:9092 docker.redpanda.com/redpandadata/console:latest\n```\n\n#### Kafka is running remotely\n\nProtected via SASL_SSL and trusted certificates (e.g. Confluent Cloud):\n\n```shell\ndocker run -p 8080:8080 -e KAFKA_BROKERS=pkc-4r000.europe-west1.gcp.confluent.cloud:9092 -e KAFKA_TLS_ENABLED=true -e KAFKA_SASL_ENABLED=true -e KAFKA_SASL_USERNAME=xxx -e KAFKA_SASL_PASSWORD=xxx docker.redpanda.com/redpandadata/console:latest\n```\n\n#### I don't have a running Kafka cluster to test against\n\nWe maintain a docker-compose file that launches Redpanda and Console: [/docs/local](./docs/local).\n\n# Community\n\n[Slack](https://redpanda.com/slack) is the main way the community interacts with one another in real time :)\n\n[GitHub Issues](https://github.com/redpanda-data/console/issues) can be used for issues, questions and feature requests.\n\n[Code of conduct](https://github.com/redpanda-data/redpanda/blob/dev/CODE_OF_CONDUCT.md) code of conduct for the community\n\n[Contributing docs](./CONTRIBUTING.md)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.05859375,
          "content": "# Redpanda Console Security and Disclosure Information\n\nAs with any complex system, it is certain that bugs will be found, some of them security-relevant.\nIf you find a _security bug_ please report it privately via email to security@redpanda.com. We will fix the issue as soon\nas possible and coordinate a release date with you. You will be able to choose if you want public acknowledgement of\nyour effort and if you want to be mentioned by name.\n\n## Public Disclosure Timing\n\nThe public disclosure date is agreed between the Redpanda Console Team and the bug submitter.\nWe prefer to fully disclose the bug as soon as possible, but only after a mitigation or fix is available.\nWe will ask for delay if the bug or the fix is not yet fully understood or the solution is not tested to our standards\nyet. While there is no fixed time frame for fix & disclosure, we will try our best to be quick and do not expect to need\nthe usual 90 days most companies ask or. For a vulnerability with a straightforward mitigation, we expect report date to\ndisclosure date to be on the order of 7 days.\n"
        },
        {
          "name": "Taskfile.yaml",
          "type": "blob",
          "size": 0.5537109375,
          "content": "version: 3\n\nvars:\n  GO_VERSION: 1.23.4\n  BUILD_ROOT: \"{{ .ROOT_DIR }}/build\"\n  GO_BUILD_ROOT: '{{.BUILD_ROOT}}/go/{{.GO_VERSION}}'\n  PATH_PREFIX: PATH={{.BUILD_ROOT}}/bin:{{.GO_BUILD_ROOT}}/bin:{{.BUILD_ROOT}}/bin/go:$PATH GOBIN={{ .BUILD_ROOT }}/bin/go GOROOT=\n  BACKEND_ROOT: \"{{ .ROOT_DIR }}/backend\"\n  FRONTEND_ROOT: \"{{ .ROOT_DIR }}/frontend\"\n  BRANCH_SLUG:\n    sh: git rev-parse --abbrev-ref HEAD | sed -e 's/[^[:alnum:]]/-/g' | tr -s '-' | tr A-Z a-z\n\nincludes:\n  backend: taskfiles/backend.yaml\n  proto: taskfiles/proto.yaml\n  connect: taskfiles/connect.yaml\n"
        },
        {
          "name": "backend",
          "type": "tree",
          "content": null
        },
        {
          "name": "biome.json",
          "type": "blob",
          "size": 0.9462890625,
          "content": "{\n  \"$schema\": \"https://biomejs.dev/schemas/1.9.4/schema.json\",\n  \"vcs\": {\n    \"enabled\": false,\n    \"clientKind\": \"git\",\n    \"useIgnoreFile\": false\n  },\n  \"files\": {\n    \"ignoreUnknown\": false,\n    \"ignore\": [\"protogen\"]\n  },\n  \"formatter\": {\n    \"enabled\": true,\n    \"indentStyle\": \"space\",\n    \"lineWidth\": 120\n  },\n  \"organizeImports\": {\n    \"enabled\": true\n  },\n  \"linter\": {\n    \"enabled\": true,\n    \"rules\": {\n      \"recommended\": true,\n      \"suspicious\": {\n        \"noExplicitAny\": \"off\",\n        \"noArrayIndexKey\": \"off\",\n        \"noAssignInExpressions\": \"off\"\n      },\n      \"a11y\": {\n        \"useKeyWithClickEvents\": \"off\",\n        \"useSemanticElements\": \"off\"\n      },\n      \"style\": {\n        \"useNodejsImportProtocol\": \"off\",\n        \"noParameterAssign\": \"off\"\n      },\n      \"complexity\": {\n        \"noBannedTypes\": \"off\"\n      }\n    }\n  },\n  \"javascript\": {\n    \"formatter\": {\n      \"quoteStyle\": \"single\"\n    },\n    \"jsxRuntime\": \"reactClassic\"\n  }\n}\n"
        },
        {
          "name": "buf.gen.yaml",
          "type": "blob",
          "size": 0.767578125,
          "content": "version: v1\nmanaged:\n  enabled: true\n  go_package_prefix:\n    default: github.com/redpanda-data/console/backend/pkg/protogen\n    except:\n      - buf.build/googleapis/googleapis\n      - buf.build/bufbuild/protovalidate\nplugins:\n  # Go Plugins\n  - plugin: buf.build/protocolbuffers/go:v1.35.2\n    opt: paths=source_relative\n    out: backend/pkg/protogen\n\n  - plugin: buf.build/connectrpc/go:v1.17.0\n    opt:\n      - paths=source_relative\n      - require_unimplemented_servers=false\n    out: backend/pkg/protogen\n\n  # Typescript plugins\n  - plugin: buf.build/bufbuild/es:v1.6.0\n    opt:\n      - target=ts\n      - import_extension=\n    out: frontend/src/protogen\n\n  - plugin: buf.build/connectrpc/es:v1.2.0\n    opt:\n      - target=ts\n      - import_extension=\n    out: frontend/src/protogen"
        },
        {
          "name": "buf.work.yaml",
          "type": "blob",
          "size": 0.0341796875,
          "content": "version: v1\ndirectories:\n  - proto\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "frontend",
          "type": "tree",
          "content": null
        },
        {
          "name": "licenses",
          "type": "tree",
          "content": null
        },
        {
          "name": "package-lock.json",
          "type": "blob",
          "size": 0.083984375,
          "content": "{\n  \"name\": \"console\",\n  \"lockfileVersion\": 3,\n  \"requires\": true,\n  \"packages\": {}\n}\n"
        },
        {
          "name": "proto",
          "type": "tree",
          "content": null
        },
        {
          "name": "taskfiles",
          "type": "tree",
          "content": null
        },
        {
          "name": "taskw",
          "type": "blob",
          "size": 0.7587890625,
          "content": "#!/usr/bin/env bash\nset -eu\n\nSCRIPT_DIR=\"$( cd \"$( dirname \"${BASH_SOURCE[0]}\" )\" && pwd )\";\n\ntest -f \"${SCRIPT_DIR}/.taskversion\"\n\nVERSION=$(cat \"${SCRIPT_DIR}/.taskversion\")\nTASK_DIR=\"${SCRIPT_DIR}/build/bin\"\nTASK=\"${TASK_DIR}/task\"\n\nmkdir -p \"$TASK_DIR\"\n\nif [[ ! -x $TASK ]] || [[ $($TASK --version | awk '{print $3}') != \"${VERSION}\" ]]; then\n  echo \"--- updating task to ${VERSION}\"\n  sh -c \"$(curl --retry 5 --retry-delay 0 --retry-max-time 60 --location https://raw.githubusercontent.com/go-task/task/${VERSION}/docs/static/install.sh)\" -- -d -b \"${TASK_DIR}\" \"${VERSION}\"\nfi\n\nif ! command -v realpath &>/dev/null; then\n  echo \"--- realpath command not found. Please install 'coreutils' package for your OS to continue. Exiting\"\n  exit 1\nfi\n\n$TASK -d \"$SCRIPT_DIR\" \"$@\"\n"
        }
      ]
    }
  ]
}