{
  "metadata": {
    "timestamp": 1736564115946,
    "page": 679,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "steel-dev/steel-browser",
      "stars": 2819,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0712890625,
          "content": "node_modules/\nbuild/\n**/.env\n**/.env.local\nDockerfile\ndocker-compose.yml\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.046875,
          "content": "* text=auto\n*.sh text eol=lf\n*.conf text eol=lf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.291015625,
          "content": "node_modules\n.pnp\n.pnp.js\ncoverage\n.DS_Store\n*.pem\nnpm-debug.log*\nyarn-debug.log*\nyarn-error.log*\n.pnpm-debug.log*\n.env\n.env.local\n.env.development.local\n.test.env.local\n.env.production.local\n!.env.example\nproduction.env\n.turbo\nbuild\ndb/data\n*.tsbuildinfo\nout\n.idea\n*.env\ndist\n.aider*\nextensions/*\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.65234375,
          "content": "<br />\n<p align=\"center\">\n<a href=\"https://steel.dev\">\n  <img src=\"images/steel_header_logo.png\" alt=\"Steel Logo\" width=\"100\">\n</a>\n</p>\n\n\n\n<h3 align=\"center\"><b>Steel</b></h3>\n<p align=\"center\">\n    <b>The open-source browser API for AI agents & apps.</b> <br />\n    The best way to build live web agents and browser automation tools.\n</p>\n\n<div align=\"center\">\n  \n[![Commit Activity](https://img.shields.io/github/commit-activity/m/steel-dev/steel-browser?color=yellow)](https://github.com/steel-dev/steel-browser/commits/main)\n[![License](https://img.shields.io/github/license/steel-dev/steel-browser?color=yellow)](https://github.com/steel-dev/steel-browser/blob/main/LICENSE)\n[![Discord](https://img.shields.io/discord/1285696350117167226?label=discord)](https://discord.gg/steel-dev)\n[![Twitter Follow](https://img.shields.io/twitter/follow/steeldotdev)](https://twitter.com/steeldotdev)\n[![GitHub stars](https://img.shields.io/github/stars/steel-dev/steel-browser)](https://github.com/steel-dev/steel-browser)\n\n</div>\n\n<h4 align=\"center\">\n    <a href=\"https://app.steel.dev/sign-up\" target=\"_blank\">\n      Get Started\n  </a>  ·\n    <a href=\"https://docs.steel.dev/\" target=\"_blank\">\n      Documentation\n  </a>  ·\n  <a href=\"https://steel.dev/\" target=\"_blank\">\n      Website\n  </a> ·\n  <a href=\"https://github.com/steel-dev/steel-cookbook\" target=\"_blank\">\n      Cookbook\n  </a>\n</h4>\n\n<p align=\"center\">\n  <img src=\"images/demo.gif\" alt=\"Steel Demo\" width=\"600\">\n</p>\n\n[Steel.dev](https://steel.dev) is an open-source browser API that makes it easy to build AI apps and agents that interact with the web. Instead of building automation infrastructure from scratch, you can focus on your AI application while Steel handles the complexity.\n\n**This repo is the core building block behind Steel - a production-ready, containerized browser sandbox that you can deploy anywhere.** It includes built-in stealth capabilities, text-to-markdown session management, UI to view/debug sessions, and full browser control through standard automation frameworks like Puppeteer, Playwright, and Selenium 🔥\n\n> Steel is in public beta and evolving every day. Your suggestions, ideas, and reported bugs help us immensely. Do not hesitate to join in the conversation on [Discord](https://discord.gg/steel-dev) or raise a GitHub issue. We read everything, respond to most, and love you.\n\nIf you love open-source, AI, and dev tools, [we're hiring across the stack](https://steel-dev.notion.site/jobs-at-steel?pvs=74)!\n\n## ⚡ Installation\n\nThe easiest way to get started with Steel is by creating a [Steel Cloud](https://app.steel.dev) account.\n\n\n\n| Installation methods | Link                                                                                                                                          |\n| -------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| Run locally with GHCR | [![Deploy with Github Container Redistry](https://img.shields.io/badge/GHCR-478CFF?style=for-the-badge&labelColor=478CFF&logo=github&logoColor=white)](https://github.com/steel-dev/steel-browser/pkgs/container/steel-browser) |\n| 1-click deploy to Railway | [![Deploy on Railway](https://img.shields.io/badge/Railway-B039CB?style=for-the-badge&labelColor=B039CB&logo=railway&logoColor=white)](https://railway.app/template/FQG9Ca) |\n| 1-click deploy to Render | [![Deploy to Render](https://img.shields.io/badge/Render-8A05FF?style=for-the-badge&labelColor=8A05FF&logo=render&logoColor=white)](https://render.com/deploy?repo=https://github.com/steel-dev/steel-browser) |\n\n\n\n## ✨ Highlights \n\nThe `steel-browser` provides a REST API to control, run, and manage a production-ready browser environment. Under the hood, it manages browser instances, sessions, and pages, allowing you to perform complex browsing tasks programmatically without any of the headaches:\n- **Full Browser Control**: Uses Puppeteer and CDP for complete control over Chrome instances -- allowing you to connect using Puppeteer, Playwright, or Selenium.\n- **Session Management**: Maintains browser state, cookies, and local storage across requests\n- **Proxy Support**: Built-in proxy chain management for IP rotation\n- **Extension Support**: Load custom Chrome extensions for enhanced functionality\n- **Debugging Tools**: Built-in request logging and session recording capabilities\n- **Anti-Detection**: Includes stealth plugins and fingerprint management\n- **Resource Management**: Automatic cleanup and browser lifecycle management\n- **Browser Tools**: Exposes APIs to quick convert pages to markdown, readability, screenshots, or PDFs.\n\n\nFor detailed API documentation and examples, check out our [API reference](https://docs.steel.dev/api-reference) or explore the Swagger UI directly at `http://0.0.0.0:3000/documentation`.\n\n\n### Make sure to give us a star ⭐\n\n<img width=\"200\" alt=\"Start us on Github!\" src=\"images/star_img.png\">\n\n\n\n## Getting Started\n\nThe fastest way to get started is to build and run the Docker image:\n\n```bash\n# Clone and build the Docker image\ngit clone https://github.com/steel-dev/steel-browser\ncd steel-browser\ndocker compose up\n```\n\nAlternatively, if you have Node.js and Chrome installed, you can run the server directly:\n\n```bash\nnpm run install\nnpm run dev\n```\n\nThis will start the Steel server on port 3000.\n\nMake sure you have the Chrome executable installed and in one of these paths:\n\n\n- **Linux**:\n  `/usr/bin/google-chrome`\n\n- **MacOS**:\n  `/Applications/Google Chrome.app/Contents/MacOS/Google Chrome`\n\n- **Windows**:\n  - `C:\\Program Files\\Google\\Chrome\\Application\\chrome.exe` OR\n  - `C:\\Program Files (x86)\\Google\\Chrome\\Application\\chrome.exe`\n\nFor more details on where this is checked look at [`api/src/utils/browser.ts`](./api/src/utils/browser.ts).\n\n## Usage\nThe Steel browser provides a REST API to control a headless browser powered by Puppeteer. Under the hood, it manages browser instances, sessions, and pages, allowing you to perform complex browsing tasks programmatically.\n\nThe full REST API documentation can be found on your Steel instance at `/documentation` (e.g., `http://0.0.0.0:3000/documentation`).\n\nSteel provides three main ways to let your agents do browser automation:\n\n### Quick Actions API\nThe `/scrape`, `/screenshot`, and `/pdf` endpoints let you quickly extract clean, well-formatted data from any webpage using the running Steel server. Ideal for simple, read-only, on-demand jobs:\n\n#### Scrape a Web Page\nExtract the HTML content of a web page.\n```bash\n# Example using the Actions API\ncurl -X POST http://0.0.0.0:3000/v1/scrape \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n    \"url\": \"https://example.com\",\n    \"waitFor\": 1000\n  }'\n```\n\n### Take a Screenshot\nTake a screenshot of a web page.\n```bash\n# Example using the Actions API\ncurl -X POST http://0.0.0.0:3000/v1/screenshot \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n    \"url\": \"https://example.com\",\n    \"fullPage\": true\n  }' --output screenshot.png\n```\n\n### Browser Sessions API\nThe Browser Sessions API lets you relaunch the browser with custom options or extensions (e.g. with a custom proxy) and also reset the browser state. Perfect for complex, stateful workflows that need fine-grained control:\n\n```bash\n# Launch a new browser session\ncurl -X POST http://0.0.0.0:3000/v1/sessions \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n    \"options\": {\n      \"proxy\": \"user:pass@host:port\",\n      // Custom launch options\n    }\n  }'\n```\n\n### Selenium Integration\n>**Note:** This integration does not support all the features of the CDP-based browser sessions API.\n\nFor teams with existing Selenium workflows, the Steel browser provides a drop-in replacement that adds enhanced features while maintaining compatibility:\n\n```bash\n# Launch a Selenium session\ncurl -X POST http://0.0.0.0:3000/v1/selenium/launch \\\n  -H \"Content-Type: application/json\" \\\n  -d '{\n    \"options\": {\n      // Selenium-compatible options\n    }\n  }'\n```\n\nThe Selenium API is fully compatible with Selenium's WebDriver protocol, so you can use any existing Selenium clients to connect to the Steel browser.\n\n```typescript\n// Example using the Selenium API\nconst builder = new Builder()\n      .forBrowser(\"chrome\")\n      .usingServer(\n        `http://0.0.0.0:3000/selenium`\n      );\n\nconst driver = await builder.build();\n\nconsole.log(\"Navigating to Google\");\nawait driver.get(\"https://www.google.com\");\n\n// The rest of your Selenium code here...\n```\n\n## Get involved\nThe Steel browser is an open-source project, and we welcome contributions!\n- Questions/ideas/feedback? Come hangout on [Discord](https://discord.gg/steel-dev)\n- Found a bug? Open an issue on [GitHub](https://github.com/steel-dev/steel-browser/issues)\n\n## License\n[Apache 2.0](./LICENSE)\n"
        },
        {
          "name": "api",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 0.6171875,
          "content": "services:\n  api:\n    platform: linux/amd64\n    build:\n      context: ./api\n      dockerfile: Dockerfile\n      args:\n        NODE_VERSION: 22.13.0\n    ports:\n      - \"3000:3000\"\n      - \"9223:9223\"\n    volumes:\n      - ./.cache:/app/.cache\n    networks:\n      - steel-network\n\n  ui:\n    build:\n      context: ./ui\n      dockerfile: Dockerfile\n    ports:\n      - \"5173:5173\"\n    environment:\n      - VITE_API_URL=http://api:3000\n      - VITE_WS_URL=ws://api:3000\n      - VITE_OPENAPI_URL=http://api:3000/documentation/json\n    depends_on:\n      - api\n    networks:\n      - steel-network\n\nnetworks:\n  steel-network:\n    driver: bridge\n"
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "nginx.conf",
          "type": "blob",
          "size": 0.34765625,
          "content": "events {\n    worker_connections 1024;\n}\n\nhttp {\n    server {\n        listen 9223;\n        \n        location / {\n            proxy_pass http://127.0.0.1:9222;\n            proxy_http_version 1.1;\n            proxy_set_header Upgrade $http_upgrade;\n            proxy_set_header Connection \"upgrade\";\n            proxy_set_header Host $host;\n        }\n    }\n} "
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.708984375,
          "content": "{\n  \"name\": \"steel\",\n  \"version\": \"1.0.0\",\n  \"private\": true,\n  \"license\": \"ISC\",\n  \"author\": \"\",\n  \"scripts\": {\n    \"install\": \"npm run install:api && npm run install:ui\",\n    \"install:api\": \"cd api && npm install\",\n    \"install:ui\": \"cd ui && npm install\",\n    \"build\": \"npm run build:api && npm run build:ui\",\n    \"build:api\": \"cd api && npm run build\",\n    \"build:ui\": \"cd ui && npm run build\",\n    \"dev\": \"concurrently \\\"npm run dev:api\\\" \\\"npm run dev:ui\\\"\",\n    \"dev:api\": \"cd api && npm run dev\",\n    \"dev:ui\": \"cd ui && npm run dev\",\n    \"serve\": \"npm run serve:api\",\n    \"serve:api\": \"cd api && npm run start\"\n  },\n  \"devDependencies\": {\n    \"concurrently\": \"^8.2.0\"\n  },\n  \"engines\": {\n    \"node\": \">=18.12.0\"\n  }\n}"
        },
        {
          "name": "render.yaml",
          "type": "blob",
          "size": 0.255859375,
          "content": "services:\n  - type: web\n    name: steel-browser\n    env: docker\n    dockerfilePath: ./Dockerfile\n    healthCheckPath: /v1/health\n    envVars:\n      - key: NODE_ENV\n        value: production\n    disk:\n      name: cache\n      mountPath: /app/.cache\n      sizeGB: 1"
        },
        {
          "name": "ui",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}