{
  "metadata": {
    "timestamp": 1736563548614,
    "page": 14,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "openkraken/kraken",
      "stars": 4929,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.2880859375,
          "content": "# EditorConfig is awesome: http://EditorConfig.org\n\n# top-most EditorConfig file\nroot = true\n\n# Unix-style newlines with a newline ending every file\n[*]\nend_of_line = lf\ninsert_final_newline = true\nindent_style = space\nindent_size = 2\ntrim_trailing_whitespace = true\n\n[*.gradle]\nindent_size = 4\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.7373046875,
          "content": ".vscode\n.history\n*.log\n*.apk\n*.ap_\n*.aab\n*.dex\n*.class\n.gradle/\nlocal.properties\n\n# IntelliJ\n.idea/workspace.xml\n.idea/tasks.xml\n.idea/gradle.xml\n.idea/assetWizardSettings.xml\n.idea/dictionaries\n.idea/libraries\n.idea/caches\n.idea\n\n# External native build folder generated in Android Studio 2.2 and later\n.externalNativeBuild\n\n# OS-specific files\n.DS_Store\n.DS_Store?\n._*\n.Spotlight-V100\n.Trashes\nehthumbs.db\nThumbs.db\n\n# cquery\ncompile_commands.json\n\n# Gradle files\n.gradle/\nbuild/\n\n# Android Studio\n/*/build/\n/*/local.properties\n/*/out\n/*/*/build\n/*/*/production\n*.ipr\n*~\n*.swp\n\n# NDK\nobj/\nyarn.lock\nnode_modules\n\n# cmake\ncmake-build-debug\ncmake-build-release\ncmake-build-macos\n\n# Node.js\npackage-lock.json\n\nPodfile.lock\n.cxx\n\ntemp\ncoverage\npubspec.lock\n"
        },
        {
          "name": "AUTHORS.txt",
          "type": "blob",
          "size": 0.701171875,
          "content": "Airing <airing@ursb.me>\nairingdeng <airingdeng@tencent.com>\nanjihang <anjihang@zhuanzhuan.com>\nboiawang <zhengwang.z@alibaba-inc.com>\nhaonan.whn <haonan.whn@alibaba-inc.com>\njiangzhou <baijiangzhou@zhihu.com>\nlzl <lei.lzl@alibaba-inc.com>\nqinxuliang <qinxuliang@alibaba-inc.com>\nranmo.cy <answershuto@gmail.com>\nsuyulin <suyulingxm@163.com>\ntylorvan.fzm <tylorvan.fzm@alibaba-inc.com>\nxiaolun.zxl <xiaolun.zxl@alibaba-inc.com>\nZeroLing <i@zeroling.com>\nzhanwen.zw <zhanwen.zw@alibaba-inc.com>\n不求圣剑 <suyulingxm@hotmail.com>\n任跃兵 <cnryb@live.cn>\n元彦 <yuanyan.cao@gmail.com>\n史胜龙 <sl.shi@tuya.com>\n清扬陌客 <qingyangmoke@qq.com>\n苏昱霖 <suyulin@orvibo.com>\n董天成 <dongtiangche@outlook.com>"
        },
        {
          "name": "GOVERNANCE.md",
          "type": "blob",
          "size": 9.1396484375,
          "content": "# OpenKraken Project Governance\n\n<!-- TOC -->\n\n* [Collaborators](#collaborators)\n  * [Collaborator activities](#collaborator-activities)\n  * [Collaborator nominations](#collaborator-nominations)\n* [Technical steering committee](#technical-steering-committee)\n  * [Establishment TSC](#establishment-tsc)\n  * [TSC elections](#tsc-elections)\n  * [TSC meetings](#tsc-meetings)\n  * [TSC voting](#tsc-voting)\n\n<!-- /TOC -->\n\n## Collaborators\n\nOpenKraken Core Collaborators maintain the [openkraken/kraken][] GitHub repository.\nThe GitHub team for OpenKraken Core Collaborators is @openkraken/collaborators.\nCollaborators have:\n\n* Commit access to the [openkraken/kraken][] repository\n* Access to the OpenKraken continuous integration (CI) jobs\n\nBoth Collaborators and non-Collaborators may propose changes to the OpenKraken\nsource code. The mechanism to propose such a change is a GitHub pull request.\nCollaborators review and merge (_land_) pull requests.\n\nTwo Collaborators must approve a pull request before the pull request can land.\n(One Collaborator approval is enough if the pull request has been open for more\nthan 7 days.) Approving a pull request indicates that the Collaborator accepts\nresponsibility for the change. Approval must be from Collaborators who are not\nauthors of the change.\n\nIf a Collaborator opposes a proposed change, then the change cannot land. The\nexception is if the TSC votes to approve the change despite the opposition.\nUsually, involving the TSC is unnecessary. Often, discussions or further changes\nresult in Collaborators removing their opposition.\n\n### Collaborator activities\n\n* Helping users and novice contributors\n* Contributing code and documentation changes that improve the project\n* Reviewing and commenting on issues and pull requests\n* Participation in working groups\n* Merging pull requests\n\nThe TSC can remove inactive Collaborators or provide them with _Emeritus_\nstatus. Emeriti may request that the TSC restore them to active status.\n\n### Collaborator nominations\n\nExisting Collaborators can nominate someone to become a Collaborator. Nominees should have significant and valuable contributions across the OpenKraken organization.\n\nTo nominate a new Collaborator, open an issue in the [openkraken/kraken][] repository. Provide a summary of the nominee's contributions. For example:\n\n* Commits in the [openkraken/kraken][] repository\n  * Use the link `https://github.com/openkraken/kraken/commits?author=GITHUB_ID`\n* Pull requests and issues opened in the [openkraken/kraken][] repository\n  * Use the link `https://github.com/openkraken/kraken/issues?q=author:GITHUB_ID`\n* Comments on pull requests and issues in the [openkraken/kraken][] repository\n  * Use the link `https://github.com/openkraken/kraken/issues?q=commenter:GITHUB_ID`\n* Reviews on pull requests in the [openkraken/kraken][] repository\n  * Use the link `https://github.com/openkraken/kraken/pulls?q=reviewed-by:GITHUB_ID`\n* Pull requests and issues opened throughout the OpenKraken organization\n  * Use the link  `https://github.com/search?q=author:GITHUB_ID+org:openkraken`\n* Comments on pull requests and issues throughout the OpenKraken organization\n  * Use the link `https://github.com/search?q=commenter:GITHUB_ID+org:openkraken`\n* Help provided to end-users and novice contributors\n* Participation in other projects, teams, and working groups of the OpenKraken organization\n\nMention @openkraken/collaborators in the issue to notify other Collaborators about the nomination.\nThe nomination passes if no Collaborators oppose it after one week. Otherwise, the nomination fails.\n\n## Technical Steering Committee\n\nA subset of the Collaborators forms the Technical Steering Committee (TSC). The TSC is responsible for all technical development within the OpenKraken project, including:\n\n* Setting release dates.\n* Release quality standards.\n* Technical direction.\n* Project governance and process (including this policy).\n* GitHub repository hosting.\n* Conduct guidelines.\n* Maintaining the list of additional Collaborators.\n* Development process and any coding standards.\n* Mediating technical conflicts between Collaborators projects.\n* The TSC will define OpenKraken project’s release vehicles.\n\n### Establishment TSC\n\nThe TSC members will elect from Collaborators. TSC memberships are not time-limited. There is no maximum size of the TSC. The size is expected to vary in order to ensure adequate coverage of important areas of expertise, balanced with the ability to make decisions efficiently. The TSC must have at least three members.\n\nThere is no specific set of requirements or qualifications for TSC membership beyond these rules. The TSC may add additional members to the TSC by a standard TSC motion and vote. A TSC member may be removed from the TSC by voluntary resignation, by a standard TSC motion, or in accordance to the participation rules described below.\n\nChanges to TSC membership should be posted in the agenda, and may be suggested as any other agenda item.\n\nTSC members are expected to regularly participate in TSC activities. If a TSC member does not attend any meeting within three months, the TSC membership will automatically become invalid and removed.\n\n### TSC elections\n\nLeadership roles in the OpenKraken project will be peer elected representatives of the community.\n\nThe TSC will elect from amongst voting TSC members a TSC Chairperson to work on building an agenda for TSC meetings.\nThe TSC shall hold annual elections to select a TSC Chairperson and\nthere are no limits on the number of terms a TSC Chairperson.\n\nThe TSC will elect from amongst voting TSC members a TSC Chairperson to work\non building an agenda for TSC meetings.\nThe TSC shall hold annual elections to select a TSC Chairperson and\nthere are no limits on the number of terms a TSC Chairperson.\n\nFor election of persons (such as the TSC Chairperson), a multiple-candidate\nmethod should be used, such as:\n\n* [Condorcet][] or\n* [Single Transferable Vote][]\n\nMultiple-candidate methods may be reduced to simple election by plurality\nwhen there are only two candidates for one position to be filled. No\nelection is required if there is only one candidate and no objections to\nthe candidate's election. Elections shall be done within the projects by\nthe Collaborators active in the project.\n\n### TSC meetings\n\nThe TSC shall meet regularly using tools that enable participation by the community (e.g. weekly on a DingTalk online conference\n, or through any other appropriate means selected by the TSC). The meeting shall be directed by the TSC Chairperson. Responsibility for directing individual meetings may be delegated by the TSC Chairperson to any other TSC member. Minutes or an appropriate recording shall be taken and made available to the community through accessible public postings.\n\nThe TSC agenda includes issues that are at an impasse. The intention of the\nagenda is not to review or approve all patches. Collaborators review and approve\npatches on GitHub.\n\nAny community member can create a GitHub issue asking that the TSC review\nsomething. If consensus-seeking fails for an issue, a Collaborator may apply the\n`tsc-agenda` label. That will add it to the TSC meeting agenda.\n\nBefore each TSC meeting, the meeting chair will share the agenda with members of\nthe TSC. TSC members can also add items to the agenda at the beginning of each\nmeeting. The meeting chair and the TSC cannot veto or remove items.\n\nThe TSC may invite people to take part in a non-voting capacity.\n\nDuring the meeting, the TSC chair ensures that someone takes minutes. After the\nmeeting, the TSC chair ensures that someone opens a pull request with the\nminutes.\n\nThe TSC seeks to resolve as many issues as possible outside meetings using\n[the TSC issue tracker](https://github.com/openkraken/TSC/issues). The process in\nthe issue tracker is:\n\n* A TSC member opens an issue explaining the proposal/issue and @-mentions\n  @openkraken/tsc.\n* The proposal passes if, after 72 hours, there are two or more TSC approvals\n  and no TSC opposition.\n* If there is an extended impasse, a TSC member may make a motion for a vote.\n\n### TSC voting\n\nFor internal project decisions, Collaborators shall operate under [Lazy Consensus][].\nThe TSC shall establish appropriate guidelines for implementing Lazy Consensus\n(e.g. expected notification and review time periods) within the development process.\n\nThe TSC follows a [Consensus Seeking][] decision making model. When an agenda \nitem has appeared to reach a consensus the moderator will ask \"Does anyone object?\"\nas a final call for dissent from the consensus.\n\nIf an agenda item cannot reach a consensus a TSC member can call for either a\nclosing vote or a vote to table the issue to the next meeting.\nThe call for a vote must be seconded by a majority of the TSC or else the discussion will continue.\n\nFor all votes, a simple majority of all TSC members for, or against, the issue wins.\nA TSC member may choose to participate in any vote through abstention.\n\n\n[openkraken/kraken]: https://github.com/openkraken/kraken\n[Lazy Consensus]: https://community.apache.org/committers/lazyConsensus.html\n[Consensus Seeking]: https://en.wikipedia.org/wiki/Consensus-seeking_decision-making\n[Condorcet]: https://en.wikipedia.org/wiki/Condorcet_method\n[Single Transferable Vote]: https://en.wikipedia.org/wiki/Single_transferable_vote\n"
        },
        {
          "name": "GOVERNANCE.zh-CN.md",
          "type": "blob",
          "size": 7.1640625,
          "content": "# OpenKraken 项目协同\n\n<!-- 目录 -->\n\n* [协作者](#协作者)\n   * [协作者职责](#协作者职责)\n   * [协作者提名](#协作者提名)\n* [技术委员会](#技术委员会)\n   * [组建委员会](#组建委员会)\n   * [委员会选举](#委员会选举)\n   * [委员会会议](#委员会会议)\n   * [委员会投票](#委员会投票)\n\n<!-- 目录 -->\n\n## 协作者\n\nOpenKraken 的协作者将共同维护 [openkraken/kraken] 仓库，协作者在 GitHub 上的小组名称为 @openkraken/collaborators。\n\n协作者拥有以下权限：\n\n* [openkraken/kraken] 仓库的 Commit 权限\n* OpenKraken 持续集成（CI）任务的权限\n\n无论协作者还是非协作者都可以提交 OpenKraken 的更改，提交更改的机制是通过 Pull Request (PR)。\n\nPR 至少两个协作者 Review 通过后才能 Merge，但如果 PR 已经打开超过 7 天，则获得一个协作者的 Review 通过就可以 Merge。\n\n协作者同意该 PR 表示该协作者接受和承担变更所导致的风险与责任，同时协作者不能同意通过自己提交的 PR。\n\n任何协作者都可反对任何 PR 中的改动，一旦发生，则该 PR 暂时无法 Merge，可以通过讨论或进一步的修改让反对的协作者同意该 PR 中的改动。当僵持无法达成共识时，可以通过在技术委员会里使用 投票的机制来决定。\n\n### 协作者职责\n\n* 帮助新手贡献者\n* 贡献代码和更新文档\n* 审查和评论 Issue 并提交 Pull Request \n* 参加工作组\n* 合并 Pull Request\n\n技术委员会可以移除不活跃的协作者或将他们转移到**荣誉组**，荣誉组成员可以让技术委员会将他们恢复为协作者。\n\n### 协作者提名\n\n现有的协作者可以提名某人成为协作者，被提名人应当是在整个 OpenKraken 生态上做出贡献的组织或个人。\n\n要提名新的协作者，需要到 [openkraken/kraken][] 仓库中提出一个 Issue，并提供被提名人相关贡献的概述。例如：\n\n* 在 [openkraken/kraken][] 仓库中的 Commits\n  * 链接格式 `https://github.com/openkraken/kraken/commits?author=GITHUB_ID`\n* 在 [openkraken/kraken][] 仓库中提交的 Pull requests 和 Issues\n  * 链接格式 `https://github.com/openkraken/kraken/issues?q=author:GITHUB_ID`\n* 在 [openkraken/kraken][] 仓库中对 Pull requests 和 Issues 的评论\n  * 链接格式 `https://github.com/openkraken/kraken/issues?q=commenter:GITHUB_ID`\n* 在 [openkraken/kraken][] 仓库中的 Reviews\n  * 链接格式 `https://github.com/openkraken/kraken/pulls?q=reviewed-by:GITHUB_ID`\n* 在整个 OpenKraken 组织下提交的 Pull requests 和 Issues\n  * 链接格式 `https://github.com/search?q=author:GITHUB_ID + org:openkraken`\n* 在整个 OpenKraken 组织下对 Pull requests 和 Issues 的评论\n  * 链接格式 `https:////github.com/search?q=commenter:GITHUB_ID + org:openkraken`\n* 向 OpenKraken 用户和新手贡献者提供的帮助\n* 参加 OpenKraken 的其他项目，团队、工作组或组织\n\n在 Issue 中 `@openkraken/collaborators` 以通知其他协作者。如果一周后没有任何协作者反对，则提名通过，否则提名失败。\n\n## 技术委员会\n\n一部分协作者组成了技术委员会（TSC），以下简称委员会。委员会为 OpenKraken 项目内的所有技术开发行为负责，其职责包括：\n\n* 设置发布日期\n* 发布质量标准\n* 引导技术方向\n* 项目管理和流程（包括本政策）\n* 管理代码仓库\n* 进行技术指导\n* 维护协作者列表\n* 维护开发过程和任何编码标准\n* 协调技术冲突\n* 委员会将提供 OpenKraken 项目的发布工具\n\n### 组建委员会\n\n委员会成员将从协作者中选出，委员会成员的任期、人数没有上限。为了保证投票公平，以及覆盖更多专业领域，委员会至少包含 3 名成员。\n\n委员会成员可以通过发起议题或投票的方式进行扩充，也可以自愿退出委员会。\n\n任何委员会成员的变动都应该被记录在委员会会议议程中，并且和其它议程一样，允许对其提出建议和意见。\n\n委员会应当定期参与委员会活动，如果委员会成员三个月内未参加任何会议，则视为自愿退出委员会。\n\n### 委员会选举\n\n委员会将从委员会成员中选出委员会主席，以制定委员会会议议程。委员会将举行年度选举以选举委员会主席，并且委员会主席的任期没有限制。\n\n对于选举人由多名候选人组成，投票机制可以选择的方法有：\n* [孔多塞投票法](https://zh.wikipedia.org/wiki/%E5%AD%94%E5%A4%9A%E5%A1%9E%E6%8A%95%E7%A5%A8%E6%B3%95)\n* [可转移单票制](https://zh.wikipedia.org/wiki/%E5%8F%AF%E8%BD%89%E7%A7%BB%E5%96%AE%E7%A5%A8%E5%88%B6)\n\n当只有两个候选人匹配一个职位时，可以将多个候选人的方法简化为简单的选举。如果只有一名候选人，并且对该候选人没有异议，则无需选举。选举应由活跃于项目中的协作者中进行。\n\n### 委员会会议\n\n委员会主席召开在线会议与主持会议。委员会议程通常会讨论陷入僵局的 Issue，议程的目的不是 Review 所有 PR，这些 PR 应该由协作者 Review 与 Approve。\n\n任何社区成员都可以创建一个 Issue 请求委员会 Review 内容。如果对于一个 Issue 无法达成共识，则协作者可以增加 `tsc-agenda` 标签，这会将这个问题添加到委员会会议议程中。\n\n在每次委员会会议之前，会议主席将与委员会成员共同制定议程。委员会成员还可以在每次会议开始时将需要讨论的议题添加到议程中。会议主席和其他委员会成员都无法否决或删除讨论的议题。\n\n委员会可以邀请协作者与社区成员参加无投票权的活动。\n\n在会议期间，委员会主席需要确保有人在记录会议纪要。在会议结束后，委员会主席需要保证会议纪要被上传。\n\n委员会可以使用[委员会问题跟踪区](https://github.com/openkraken/TSC/issues) 在会议之外解决尽可能多的问题。 问题跟踪区的运行机制是：\n\n* 委员会成员打开一个问题，解释提案/问题和 @提及\n  @openkraken/tsc\n* 如果 72 小时后获得两个或更多委员会成员批准，且没有委员会成员的反对，则提案通过\n* 如果不能够达成共识，委员会成员可以提出发起投票\n\n### 委员会投票\n\n对于内部项目决策，协作者应在 [Lazy Consensus][] 下进行操作。委员会同时需建立在开发过程中实施 [Lazy Consensus][] 的指南，例如预期的通知和 Review 时间段。\n\n委员会遵循寻 [Consensus Seeking][] 的决策模型。当议程接近达成共识时，主持人会问 “有人反对吗？” 作为对提出异议的最终询问。\n\n如果某个议题暂时无法达成共识，则委员会成员可以要求结束投票表决或将问题搁置到下次会议进行，但如果多数委员会成员反对，则投票将继续进行。\n\n对于所有投票，绝大多数委员会成员同意则该提议通过，委员会成员也可以选择放弃投票。\n\n[openkraken/kraken]: https://github.com/openkraken/kraken\n[Lazy Consensus]: https://community.apache.org/committers/lazyConsensus.html\n[Consensus Seeking]: https://en.wikipedia.org/wiki/Consensus-seeking_decision-making\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.07421875,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright 2021 OpenKraken\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.38671875,
          "content": "![kraken Post](https://user-images.githubusercontent.com/677114/101163298-6264ae80-366e-11eb-9151-f560d18c2ceb.png)\n\n> ⭐️ If your project uses Flutter 3.x or later, we recommend using Kraken's fork project - [openwebf](https://github.com/openwebf/webf).  \n> \n> ⭐️ 如果你的项目使用的 Flutter 3.x 以上版本，我们推荐使用 Kraken 的 fork 项目 —— [openwebf](https://github.com/openwebf/webf)。\n\n# [Kraken](https://openkraken.com/) [![pub package](https://img.shields.io/pub/v/kraken.svg)](https://pub.dev/packages/kraken) [![Integration Test WorkFlow](https://github.com/openkraken/kraken/actions/workflows/integration_test.yml/badge.svg?branch=main)](https://github.com/openkraken/kraken/actions/workflows/integration_test.yml)\n\n## 💁 Have a try\n\n1. Install Kraken CLI (macOS, Linux only currently)\n\n    ```shell\n    $ npm i @openkraken/cli -g\n    ```\n\n2. Open with kraken\n\n    ```shell\n    $ kraken run https://raw.githubusercontent.com/openkraken/kraken/master/kraken/example/assets/bundle.js\n    ```\n\n## 💌 Why kraken\n\n* Quick development 🎉\n\n  Compatibility with web standards means you don't have to change your stack.\n  ```js\n  const text = document.createTextNode('Hello World!');\n  document.body.appendChild(text);\n  ```\n\n* Cross platform ⚛️\n\n  [Seamless integration with Flutter](https://pub.dev/packages/kraken), supports web, mobile (iOS, Android) and desktop (MacOS, Linux, Windows).\n\n* Fast performance 🚀\n\n  Provide native-like performance such as navigation, animation and infinite list scrolling.\n\n## Flutter version scope\n\nOnly flutter stable released version are fully tested.\n\n| Kraken  | Flutter |\n| ------------- | ------------- |\n| >= 0.7.0 < 0.8.0 | 1.22.0 ~ 1.22.6 |\n| >= 0.8.0 < 0.10.0  | 2.2.0 ~ 2.2.3 |\n| >= 0.10.0 < 0.11.0 | 2.5.0 ~ 2.5.3 |\n| >= 0.11.0 | 2.8.0 ~ 2.8.1 |\n\n\n## 👏 Contributing [![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg?style=flat-square)](https://makeapullrequest.com)\n\nBy contributing to Kraken, you agree that your contributions will be licensed under its Apache-2.0 License.\n\nRead our [contributing guide](https://github.com/openkraken/kraken/blob/main/.github/CONTRIBUTING.md) and let's build a better kraken project together.\n\nThank you to all the people who already contributed to Kraken!\n\n![CONTRIBUTORS](https://andycall.oss-cn-beijing.aliyuncs.com/CONTRIBUTORS.svg)\n\nCopyright (c) 2019-present, The Kraken authors.\n\n"
        },
        {
          "name": "bridge",
          "type": "tree",
          "content": null
        },
        {
          "name": "integration_tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "kraken",
          "type": "tree",
          "content": null
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 2.33984375,
          "content": "{\n  \"private\": true,\n  \"scripts\": {\n    \"build:bridge:macos\": \"node scripts/build_darwin_dylib\",\n    \"build:bridge:macos:release\": \"KRAKEN_BUILD=Release node scripts/build_darwin_dylib\",\n    \"build:bridge:macos:profile\": \"ENABLE_PROFILE=true npm run build:bridge:macos:release\",\n    \"build:bridge:android\": \"node scripts/build_android_so\",\n    \"build:bridge:android:release\": \"KRAKEN_BUILD=Release node scripts/build_android_so\",\n    \"build:bridge:linux\": \"node scripts/build_linux\",\n    \"build:bridge:linux:release\": \"KRAKEN_BUILD=Release node scripts/build_linux\",\n    \"build:bridge:linux:profile\": \"ENABLE_PROFILE=true node scripts/build_linux\",\n    \"build:bridge:android:profile\": \"ENABLE_PROFILE=true npm run build:bridge:android:release\",\n    \"build:bridge:ios\": \"node scripts/build_ios_framework\",\n    \"build:bridge:ios:release\": \"KRAKEN_BUILD=Release node scripts/build_ios_framework\",\n    \"build:bridge:ios:profile\": \"ENABLE_PROFILE=true npm run build:bridge:ios:release\",\n    \"build:bridge:all\": \"node scripts/prepare_kraken_release_binary\",\n    \"build:bridge:all:release\": \"KRAKEN_BUILD=Release node scripts/prepare_kraken_release_binary\",\n    \"build_bridge:all:profile\": \"ENABLE_PROFILE=true npm run build:bridge:all:release\",\n    \"build:android:sdk\": \"KRAKEN_BUILD=Release node scripts/build_android_sdk\",\n    \"build:ios:sdk\": \"KRAKEN_BUILD=Release node scripts/build_ios_sdk\",\n    \"pretest\": \"npm install && ENABLE_ASAN=true node scripts/build_darwin_dylib\",\n    \"posttest\": \"npm run lint\",\n    \"benchmark\": \"npm install && ENABLE_PROFILE=true KRAKEN_BUILD=Release node scripts/run_benchmark.js\",\n    \"start\": \"cd kraken/example && flutter run\",\n    \"test\": \"node scripts/run_test.js\",\n    \"plugin_test\": \"node scripts/run_plugin_test.js\",\n    \"lint\": \"cd kraken && flutter pub get && flutter analyze\",\n    \"format\": \"cd kraken && flutter format . --line-length=120\",\n    \"ci\": \"npm install && npm run lint\",\n    \"test:unit:report\": \"lcov-summary kraken/coverage/lcov.info\"\n  },\n  \"devDependencies\": {\n    \"ali-oss\": \"^6.13.2\",\n    \"archiver\": \"^5.3.0\",\n    \"chalk\": \"^3.0.0\",\n    \"commander\": \"^5.1.0\",\n    \"del\": \"^5.1.0\",\n    \"gulp\": \"^4.0.2\",\n    \"lcov-summary\": \"^1.0.1\",\n    \"minimist\": \"^1.2.4\",\n    \"mkdirp\": \"^0.5.1\",\n    \"rimraf\": \"^3.0.2\",\n    \"uuid\": \"^8.3.2\",\n    \"ws\": \"^7.3.0\",\n    \"http-server\": \"^14.1.0\"\n  },\n  \"dependencies\": {\n    \"prepend-file\": \"^2.0.1\"\n  }\n}\n"
        },
        {
          "name": "performance_tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "plugins",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "sdk",
          "type": "tree",
          "content": null
        },
        {
          "name": "third_party",
          "type": "blob",
          "size": 0.01953125,
          "content": "./bridge/third_party"
        }
      ]
    }
  ]
}