{
  "metadata": {
    "timestamp": 1736564253467,
    "page": 837,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "DeborahK/Angular-GettingStarted",
      "stars": 2558,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.12109375,
          "content": "typings\n**/app/**/*.js\n**/app/**/*.map\nnode_modules\njspm_packages\nbower_components\n\n.vs\n**/*.sou\n**/*.user\nbin\nobj\npackages\n"
        },
        {
          "name": "APM-Final-v16",
          "type": "tree",
          "content": null
        },
        {
          "name": "APM-Final",
          "type": "tree",
          "content": null
        },
        {
          "name": "APM-Start",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 4.4560546875,
          "content": "# Changes made to the course since its release:\n- July 6, 2022 - The course had a few changes for Angular v14 and RxJS 7.5. For details on the list of course changes, see [\"Angular: Getting Started Course Update for version 14\"](https://docs.google.com/document/d/1aYMEhgd-R3yOHr8UvOb_-7dvwvUcL13iXSWwKrLMmuE/edit?usp=sharing)\n\n- June 9, 2021 - The course had a few changes for Angular v12 and Bootstrap 5. For details on the list of course changes, see [\"Angular: Getting Started Course Update for version 12\"](https://docs.google.com/document/d/17nBp_ucfuqdUnzje9RyrrDF81dIv7JojxgutSntbjwg/edit?usp=sharing)\n\n- March 22, 2021 - Extensive updates to the course including an upgrade of the capture resolution to 1920 x1080, simplified the terminology in several areas based on learner feedback, enhanced several topics based on learner feedback, and \"live typed\" more of the code in the demos. For details on the list of course changes, see [\"Angular: Getting Started Course Update for version 11\"](https://docs.google.com/document/d/1m_YB-O1pe5y3KVZdetAIQu6UcgvrUYQ1dL08-VXcX7k/edit?usp=sharing)\n\n- August 6, 2020 - The course had a few changes for Angular v10. For details on the list of course changes, see: [\"Angular: Getting Started Course Update for version 10\"](https://docs.google.com/document/d/14s_d-gmkyj2B4xK7AHwpe5nLVhWg7kp4IgGzNsqPwuE/edit?usp=sharing)\n\n- April 21, 2020 - The course had a few changes for Angular v9. For details on the list of course changes, see: [\"Angular: Getting Started Course Update for version 9\"](https://docs.google.com/document/d/11LgSHiBhszzplXZkL9q9NEX4pi3uIO24WMeBUM0oZg0/edit?usp=sharing)\n\n- August 14, 2019 - The course had a few minor changes for Angular v8 and to provide a local set of images. For details on the list of course changes, see: [\"Angular: Getting Started Course Update for version 8\"](https://docs.google.com/document/d/1MZd2D2zeNusKAwl_NYZbWDLzvUlvYicKfYMpFnlOxSs/edit?usp=sharing)\n\n- November 8, 2018 - The course had a few very minor changes for Angular v7, primarily for the Angular CLI prompts. For details on the list of course changes, see: https://blogs.msmvps.com/deborahk/angular-getting-started-course-update-for-v7/\n\n- July 11, 2018 - The course was updated to Angular v6. Also updated to Bootstrap 4 with Font Awesome and RxJS 6. For details on the list of course changes, see: https://blogs.msmvps.com/deborahk/angular-getting-started-course-update-for-v6/\n\n- August 10, 2017 - The course was updated to incorporate the Angular CLI, use the new v4.3 HttpClient, plus more. For details on the list of course changes, see: https://blogs.msmvps.com/deborahk/angular-getting-started-course-update-for-v4-3/\n\n- October 18, 2016 - The course was updated for Angular 2 Final. For details on the list of course changes, see: https://blogs.msmvps.com/deborahk/angular-2-getting-started-course-update/\n\n# Changes made to the project files since its release:\n- May 24, 2023 - Added a folder for Angular v16. NOTE: The code in this folder does *NOT* match the code as shown in the course. The code in this folder includes: standalone components, standalone bootstrapping, computed signals.\n\n- July 6, 2022 - The code was replaced with new start and final folders for Angular v14 and RxJS v7.5.\n\n- June 9, 2021 - The code was replaced with new start and final folders for Angular v12 and Bootstrap 5.\n\n- March 22, 2020 - The code was replaced with new start and final folders for Angular v11. Added unsubscribing of our Observable. Also added TypeScript strict mode and made a few minor coding changes to support that change.\n\n- August 6, 2020 - The code was replaced with new start and final folders for Angular v10.\n\n- April 21, 2020 - The code was replaced with new start and final folders for Angular v9.\n\n- August 14, 2019 - The code was replaced with new start and final folders for Angular v8.\n\n- July 11, 2018 - The code was replaced with new start and final folders for Angular v6, Angular CLI 6, RxJS 6, Bootstrap 4, and Font Awesome.\n\n- August 10, 2017 - The code was all replaced with new start and final folders that leverage the Angular CLI.\n\n- June 21, 2017 - APM-CLI-Start was added. This is a copy of the starter files set up to work with the Angular CLI.\n\n- March 24, 2017 - APM-Start-Updated and APM-Final-Updated were added. These are updates to the sample code for Angular version 4. Note that the changes include modifications to the boilerplate files and the addition of an src folder to make these files compatible with the current version of the Angular Quick Start files.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0556640625,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2016 Deborah Kurata\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0888671875,
          "content": "# Angular-Getting Started\nMaterials for the [\"Angular: Getting Started\"](http://bit.ly/Angular-GettingStarted) course on Pluralsight.\n\n`APM-Start`: The starter files set up for this course. **Use this to code along with the course**. (Updated for <i>Angular version 14</i>)\n\n`APM-Final`: The completed files. Use this to see the completed solution from the course. (Updated for <i>Angular version 14 </i>)\n\n`APM-Final-v16`: The completed files upgraded to Angular v16. *NOTE: This code does NOT match the code along from the course. Use it only for reference.*\n\nSee the `README.md` file under each folder for details on installing and running the application.\n\nIf you have any problems installing or running this code, please post to the [discussion board for the course](https://app.pluralsight.com/library/courses/angular-2-getting-started-update/discussion)\n\nNOTE: The installation was tested using node v16.15.1 and npm 8.11.0.\n\n## LINKS\nHere are some links to additional useful materials on YouTube:\n\n[Gentle Introduction to GitHub](https://youtu.be/pICJdbC7j0Q): You'll learn the purpose of Git and GitHub and what a repository is. You'll create a repository, then try out GitHub Desktop and VS Code Git integration to clone, commit, and sync. You'll work with branches, and create pull requests to merge those branches. You'll then publish a website with GitHub Pages.\n\n[Gentle Introduction to HTML](https://youtu.be/6tBnZ-T4uDE): You'll learn about HTML elements and attributes, how to structure a page, and use semantic elements to organize your content. You'll see how to build a list and table, add images and navigation, and create a data entry form.\n\n[Gentle Introduction to CSS](https://youtu.be/3DAFg7tY4gE): You'll learn about CSS, where to define styles, CSS syntax, selectors, and the CSS box module. You'll try out CSS layout features and explore how styles cascade. Throughout this course, you'll style a web page.\n\n[Gentle Introduction to Bootstrap 5](https://youtu.be/Yjs4PKmgPi0): You'll learn the Bootstrap styling framework and its benefits. You'll try out Bootstrap containers and utility classes. Then  walk through how to style a menu and a table, explore Bootstrap's grid system for layout, and how to style a data entry form.\n\n[Gentle Introduction to JavaScript](https://youtu.be/jJLn5XxyXWc): You'll learn where and how to write JavaScript code. You'll examine JavaScript syntax including variables, statements, functions, and objects. You'll discover how to respond to actions, such as button clicks, add content to a web page and change element styles ... all with JavaScript. \n\n## INSTALLING THE CODE\n\nThe following are detailed instructions for installing the code so you can code along with the course.\n\n0) Ensure you have node installed.\n\n   At a command prompt, type `node -v` to ensure you have version `14.15.0` or higher before proceeding.\n\n1) Download or clone the code from this repository.\n\n   If you download as a zip file, be sure to unzip it.\n\n2) Navigate to the APM-Start folder (or APM folder if you renamed it).\n\n   There should be a package.json file in this folder.\n\n3) In a command window (or the Command prompt in VS Code), type `npm install`.\n\n   This creates a node_modules folder and installs all packages from the package.json file into that folder. You may see a few warnings during this process, but you should not see any errors.\n   \n4) In the same command window (or the Command property in VS Code), type `npm start`.\n\n   The application should then compile and launch in your default browser.\n   \nIf these steps don't work for you, see STACKBLITZ below.\n\n## STACKBLITZ\n\nIf you want to work through the course without downloading npm or any of the libraries, try the course with Stackblitz by following this link: https://stackblitz.com/github/DeborahK/Angular-GettingStarted/tree/master/APM-Start\n\nStackblitz does not support reading json files from a folder defined in the angular.json file. Rather, you need to copy the products folder from the api folder to the assets folder. Then modify the productUrl to look in the assets folder: private productUrl = 'assets/products/products.json';\n\nTo install packages in Stackblitz, such as bootstrap and font-awesome, you need to use the DEPENDENCIES branch in the Project hierarchy to the left of the code in Stackblitz:\n1) Open the DEPENDENCIES node. (You should see the list of existing dependencies such as @angular/common\n2) Below the list of dependencies is an input box with the text \"enter package name\"\n3) Enter bootstrap there and press enter.\n4) If it asks you to install missing dependencies, click \"INSTALL MISSING DEPENDENCIES\"\n5) Repeat step 3 with font-awesome\n\nStackbliz has the Angular CLI commands built in. Instead of installing the Angular CLI to your system, right-click on a folder in Stackblitz and you'll see an \"Angular Generator\" option. Under that menu you'll find the Angular CLI commands.\n\n## FAQ\n\nI'm using `thead` to change the color of the heading and it doesn't work. Why?\n\nCode:\n```\nthead {\ncolor: #337AB7;\n}\n```\n\nFor some reason, the thead no longer seems to work. Use `th` instead. (This is a CSS issue, not an Angular issue.)\n\nCode:\n```\nth {\ncolor: #337AB7;\n}\n```\n"
        },
        {
          "name": "links.md",
          "type": "blob",
          "size": 3.5615234375,
          "content": "### Useful Links\n\nHere are some useful links that are referenced in or supplement this course:\n\n| Name | Description | Link |\n| ---- | ----------- | ---- |\n| Github Repo | Code for the course | https://github.com/DeborahK/Angular-GettingStarted\n| Course | Pluralsight course | https://app.pluralsight.com/library/courses/angular-2-getting-started-update\n| Course discussion | Discussion page for the course | https://app.pluralsight.com/library/courses/angular-2-getting-started-update/discussion\n| Angular documentation | Official Angular documentation | https://angular.io/\n| Angular Update Guide | Instructions to update from one Angular version to another | https://update.angular.io/\n| Angular Errors List | Official Angular documentation | https://angular.io/errors\n| Angular: Getting Started Problem Solver | Blog post that identifies common issues you may run into when using the sample code in this course, along with solutions. | http://blogs.msmvps.com/deborahk/angular-2-getting-started-problem-solver/\n| Stackblitz | Try out Angular in your browser without downloading anything | https://stackblitz.com/github/DeborahK/Angular-GettingStarted/tree/master/APM-Start\n| Angular DevTools | Chrome extension for Angular debugging and profiling | https://chrome.google.com/webstore/detail/angular-devtools/ienfalfjdbdpebioblfackkekamfmbnh\n| Angular ESLint | Enabling ESLint in Angular projects | https://github.com/angular-eslint/angular-eslint\n| Angular npm packages | List of Angular npm packages | https://www.npmjs.com/~angular\n| Bootstrap | Style library used in the course | https://getbootstrap.com/\n| Font Awesome | Font library used in the course | https://fontawesome.com\n| JavaScript Array filter function | JavaScript documentation for the filter function | https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Array/filter\n| node/npm | Download node and npm | https://nodejs.org/en/download\n| TypeScript Playground | Try out TypeScript code in your browser | https://www.typescriptlang.org/play\n| VS Code | Recommended code editor | https://code.visualstudio.com/\n| Web event docs | JavaScript documentation for Web events | https://developer.mozilla.org/en-US/docs/Web/Events\n\n### Additional Suggested Pluralsight Courses\n\n| Name |  Link |\n| ---- | ----- |\n| Angular: Reactive Forms | https://app.pluralsight.com/library/courses/angular-2-reactive-forms\n| Angular Routing | https://app.pluralsight.com/library/courses/angular-routing\n| Angular Component Communication | https://app.pluralsight.com/library/courses/angular-component-communication\n| RxJS in Angular: Reactive Development | https://app.pluralsight.com/library/courses/rxjs-angular-reactive-development\n| Angular NgRx: Getting Started | https://app.pluralsight.com/library/courses/angular-ngrx-getting-started\n| Angular CLI | https://app.pluralsight.com/library/courses/angular-cli\n| Play by Play: Angular 2/RxJS/HTTP and RESTful Services with John Papa and Dan Wahlin | https://app.pluralsight.com/library/courses/play-by-play-angular-2-rxjs-http-restful-services-john-papa-dan-wahlin\n| Angular Forms | https://app.pluralsight.com/library/courses/angular-forms\n| Angular Fundamentals | https://app.pluralsight.com/library/courses/angular-fundamentals\n| Angular HTTP Communication | https://app.pluralsight.com/library/courses/angular-http-communication\n| TypeScript: Getting Started | https://app.pluralsight.com/library/courses/getting-started-typescript\n| Unit Testing in Angular | https://app.pluralsight.com/library/courses/unit-testing-angular\n| Visual Studio Code | https://app.pluralsight.com/library/courses/visual-studio-code\n"
        }
      ]
    }
  ]
}