{
  "metadata": {
    "timestamp": 1736710875233,
    "page": 438,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQ0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "MicrosoftLearning/AZ-204-DevelopingSolutionsforMicrosoftAzure",
      "stars": 2292,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "Allfiles",
          "type": "tree",
          "content": null
        },
        {
          "name": "Instructions",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0400390625,
          "content": "MIT License\n\nCopyright (c) 2020 Microsoft\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE."
        },
        {
          "name": "_build.yml",
          "type": "blob",
          "size": 1.2578125,
          "content": "name: '$(Date:yyyyMMdd)$(Rev:.rr)'\njobs:\n  - job: build_markdown_content\n    displayName: 'Build Markdown Content'\n    workspace:\n      clean: all\n    pool:\n      vmImage: 'ubuntu-latest'\n    container:\n      image: 'microsoftlearning/markdown-build:latest'\n    steps:\n      - task: Bash@3\n        displayName: 'Build Content'\n        inputs:\n          targetType: inline\n          script: |\n            cp /{attribution.md,template.docx,package.json,package.js} .\n            npm install\n            node package.js --version $(Build.BuildNumber)\n      - task: GitHubRelease@0\n        displayName: 'Create GitHub Release'\n        inputs:\n          gitHubConnection: 'github-microsoftlearning-organization'\n          repositoryName: '$(Build.Repository.Name)'\n          tagSource: manual\n          tag: 'v$(Build.BuildNumber)'\n          title: 'Version $(Build.BuildNumber)'\n          releaseNotesSource: input\n          releaseNotes: '# Version $(Build.BuildNumber) Release'\n          assets: '$(Build.SourcesDirectory)/out/*.zip'\n          assetUploadMode: replace\n          isPreRelease: false\n      - task: PublishBuildArtifacts@1\n        displayName: 'Publish Output Files'\n        inputs:\n          pathtoPublish: '$(Build.SourcesDirectory)/out/'\n          artifactName: 'Lab Files'"
        },
        {
          "name": "_config.yml",
          "type": "blob",
          "size": 0.38671875,
          "content": "title: 'AZ-204: Developing solutions for Microsoft Azure'\nremote_theme: MicrosoftLearning/Jekyll-Theme\nexclude:\n  - readme.md\n  - .github/\nheader_pages:\n  - index.html\nauthor: Microsoft Learning\ntwitter_username: mslearning\ngithub_username:  MicrosoftLearning\nplugins:\n  - jekyll-sitemap\n  - jekyll-mentions\n  - jemoji\nmarkdown: kramdown\nkramdown:\n   syntax_highlighter_opts:\n      disable : true"
        },
        {
          "name": "index.md",
          "type": "blob",
          "size": 0.4658203125,
          "content": "---\ntitle: Online Hosted Instructions\npermalink: index.html\nlayout: home\n---\n\n## Content Directory\n\nHyperlinks to each of the labs are listed below.\n\n## Labs\n\n{% assign labs = site.pages | where_exp: \"page\", \"page.url contains '/Instructions/Labs'\" %}\n| Module | Lab |\n| --- | --- |\n{% for activity in labs  %}{% if activity.lab.az204Module %}| {{ activity.lab.az204Module }} | [{{ activity.lab.az204Title }}]({{ site.github.url }}{{ activity.url }}) |\n{% endif %}{% endfor %}\n"
        },
        {
          "name": "readme.md",
          "type": "blob",
          "size": 3.6806640625,
          "content": "# AZ-204: Developing solutions for Microsoft Azure\n\n**The lab instructions, downloadable code, and the VM were updated on 8/5/2022 to .NET 6. We are monitoring issues related to this update and are working with our lab hosting providers to to try and get any issues resolved as quickly as we can.**\n\n> **Note**: Students should be directed to sync the repository if they aren't being provided the AllFiles through the lab hosting provider. \n\n- **Direct students** to [https://aka.ms/az204labs](https://aka.ms/az204labs) for an easy-to-use list of lab instructions.\n- **Are you a MCT?** - Have a look at our [GitHub User Guide for MCTs](https://microsoftlearning.github.io/MCT-User-Guide/)\n- **Need to manually build the lab instructions?** - Instructions are available in the [MicrosoftLearning/Docker-Build](https://github.com/MicrosoftLearning/Docker-Build) repository \n\n## Security Issue - February 2022\n\nSome Azure training labs instruct the student to use a specific user name and password. Bad actors constantly scan virtual machines and try to log in using those credentials.\nOnce they login they use the machines for crypto-mining, and could potentially use them for other activities.\n\n**Remediation**: Students should be instructed to use a password of their own choosing. Students should not use the password in the lab instructions. The lab steps will be updated this week to remove the password. \n\n## What are we doing?\n\n- To support this course, we will need to make frequent updates to the course content to keep it current with the Azure services used in the course.  We are publishing the lab instructions and lab files on GitHub to allow for open contributions between the course authors and MCTs to keep the content current with changes in the Azure platform.\n\n- We hope that this brings a sense of collaboration to the labs like we've never had before - when Azure changes and you find it first during a live delivery, go ahead and make an enhancement right in the lab source. \n\n## How should I use these files relative to the released MOC files?\n\n- The instructor handbook and PowerPoints are still going to be your primary source for teaching the course content.\n\n- These files on GitHub are designed to be used in conjunction with the student handbook, but are in GitHub as a central repository so MCTs and course authors can have a shared source for the latest lab files.\n\n- It will be recommended that for every delivery, trainers check GitHub for any changes that may have been made to support the latest Azure services, and get the latest files for their delivery.\n\n## What about changes to the student handbook?\n\n- We will review the student handbook on a quarterly basis and update through the normal MOC release channels as needed.\n\n## How do I contribute?\n\n- Any MCT can submit a pull request to the code or content in the GitHub repro, Microsoft and the course author will triage and include content and lab code changes as needed.\n\n- You can submit bugs, changes, improvement and ideas.  Find a new Azure feature before we have?  Submit a new demo!\n\n## Notes\n\n### Classroom Materials\n\nIt is strongly recommended that MCTs and Partners access these materials and in turn, provide them separately to students.  Pointing students directly to GitHub to access Lab steps as part of an ongoing class will require them to access yet another UI as part of the course, contributing to a confusing experience for the student. An explanation to the student regarding why they are receiving separate Lab instructions can highlight the nature of an always-changing cloud-based interface and platform. Microsoft Learning support for accessing files on GitHub and support for navigation of the GitHub site is limited to MCTs teaching this course only.\n"
        }
      ]
    }
  ]
}