{
  "metadata": {
    "timestamp": 1736710778112,
    "page": 245,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "zeromq/netmq",
      "stars": 2991,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.4716796875,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n\n# Custom for Visual Studio\n*.cs     diff=csharp\n*.sln    merge=union\n*.csproj merge=union\n*.vbproj merge=union\n*.fsproj merge=union\n*.dbproj merge=union\n\n# Standard to msysgit\n*.doc\t diff=astextplain\n*.DOC\t diff=astextplain\n*.docx diff=astextplain\n*.DOCX diff=astextplain\n*.dot  diff=astextplain\n*.DOT  diff=astextplain\n*.pdf  diff=astextplain\n*.PDF\t diff=astextplain\n*.rtf\t diff=astextplain\n*.RTF\t diff=astextplain\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.4716796875,
          "content": "# Ignore Windows thumbnails\nThumbs.db\n\n# Ignore Visual Studio files\n*.obj\n*.exe\n*.pdb\n*.nupkg\n*.user\n*.aps\n*.pch\n*.vspscc\n*_i.c\n*_p.c\n*.ncb\n*.suo\n*.tlb\n*.tlh\n*.bak\n*.cache\n*.ilk\n*.log\n*.orig\n[Bb]in\n[Dd]ebug*/\n*.lib\n*.sbr\nobj/\n[Rr]elease*/\n_ReSharper*/\n*.DotSettings\n[Tt]est[Rr]esult*\n\n# Ignore MonoDevelop files\n*.userprefs\n\n# Ignore NUnit project files\n*.nunit\n\n# Ignore NuGet Packages\n/src/packages/\n\n#Ignore VS files\n.vs/\n\n#Ignore lock files\n*.lock.json\n.idea/\n/src/*.DotSettings\n"
        },
        {
          "name": ".readthedocs.yml",
          "type": "blob",
          "size": 0.2978515625,
          "content": "# Read the Docs configuration file for MkDocs projects\n# See https://docs.readthedocs.io/en/stable/config-file/v2.html for details\n\n# Required\nversion: 2\n\n# Set the version of Python and other tools you might need\nbuild:\n  os: ubuntu-22.04\n  tools:\n    python: \"3.12\"\n\nmkdocs:\n  configuration: mkdocs.yml\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.4033203125,
          "content": "language: csharp\nmono: none\ndotnet: 3.1\n\naddons:\n  apt:\n    packages:\n      - dotnet-sdk-2.2\n\n\nscript:\n  - dotnet restore src/NetMQ.sln\n  - dotnet build -v q -f netstandard2.0 src/NetMQ/NetMQ.csproj\n  - dotnet test -v n --logger \"Console;noprogress=true\" -p:ParallelizeTestCollections=false -f netcoreapp2.1 --filter Category!=Beacon src/NetMQ.Tests/NetMQ.Tests.csproj -- RunConfiguration.ReporterSwitch=verbose\n\n"
        },
        {
          "name": "AUTHORS.md",
          "type": "blob",
          "size": 1.6806640625,
          "content": "Contributors\n===\n\n* Alexey Yakovlev &mdash; [@yallie](https://github.com/yallie)\n* Charlie Friedemann &mdash; [@charliebone](https://github.com/charliebone)\n* Christophe Juniet &mdash; [@cjuniet](https://github.com/cjuniet)\n* Dan de Zille &mdash; [@dandezille](https://github.com/dandezille)\n* Doron Somech &mdash; [@somdoron](https://github.com/somdoron)\n* Drew Noakes &mdash; [@drewnoakes](https://github.com/drewnoakes)\n* Eugen Dück &mdash; [@EugenDueck](https://github.com/EugenDueck)\n* Grant Birchmeier &mdash; [@gbirchmeier](https://github.com/gbirchmeier)\n* Ilya Loginov &mdash; [@iloginov](https://github.com/iloginov)\n* James Hurst &mdash; [@JamesWhurst](https://github.com/JamesWhurst)\n* Jay Shelton &mdash; [@jayshelton](https://github.com/jayshelton)\n* Miguel Angel Jimenez &mdash; [@majimenezp](https://github.com/majimenezp)\n* Nicolas Dextraze &mdash; [@ndextraze-pbp](https://github.com/ndextraze-pbp)\n* Peter H. Merkel &mdash; [@mph911](https://github.com/mph911)\n* Robert Horvick &mdash; [@bubbafat](https://github.com/bubbafat)\n* Sacha Barber &mdash; [@sachabarber](https://github.com/sachabarber)\n* Tobias Behr &mdash; [@tobi-tobsen](https://github.com/tobi-tobsen)\n* Tom Robinson &mdash; [@tjrobinson](https://github.com/tjrobinson)\n* Victor Baybekov &mdash; [@buybackoff](https://github.com/buybackoff)\n* Tobias Böhm &mdash; [@tobiasb](https://github.com/tobiasb)\n* Dale Brubaker &mdash; [@dalebrubaker](https://github.com/dalebrubaker)\n* Calin Pirtea &mdash; [@pcalin](https://github.com/pcalin)\n* Osiris Pedroso &mdash; [@opedroso](https://github.com/opedroso)\n* Mike Miller &mdash; [@mikepmiller](https://github.com/mikepmiller)\n* Miguel Labayen &mdash; [@milabtom](https://github.com/milabtom)\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 0.666015625,
          "content": "### Contributing to NetMQ\n\n* The contributors are listed in [AUTHORS.md](https://github.com/zeromq/netmq/blob/master/AUTHORS.md) (add yourself).\n\n* This project uses a modified version of the LGPL v3 license, see \n[COPYING.LESSER](https://github.com/zeromq/netmq/blob/master/COPYING.LESSER).\n\n* We use the [C4.1 (Collective Code Construction Contract)](http://rfc.zeromq.org/spec:22) process for contributions.\nPlease read this if you are unfamiliar with it.\n\n* Please maintain the existing code style. \n\n* Please try to keep your commits small and focussed.\n\n* If the project diverges from your branch, please rebase instead of merging. This makes the commit graph easier to read.\n"
        },
        {
          "name": "COPYING.LESSER",
          "type": "blob",
          "size": 8.1669921875,
          "content": "  \t         GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\n  This version of the GNU Lesser General Public License incorporates\nthe terms and conditions of version 3 of the GNU General Public\nLicense, supplemented by the additional permissions listed below.\n\n  0. Additional Definitions. \n\n  As used herein, \"this License\" refers to version 3 of the GNU Lesser\nGeneral Public License, and the \"GNU GPL\" refers to version 3 of the GNU\nGeneral Public License.\n\n  \"The Library\" refers to a covered work governed by this License,\nother than an Application or a Combined Work as defined below.\n\n  An \"Application\" is any work that makes use of an interface provided\nby the Library, but which is not otherwise based on the Library.\nDefining a subclass of a class defined by the Library is deemed a mode\nof using an interface provided by the Library.\n\n  A \"Combined Work\" is a work produced by combining or linking an\nApplication with the Library.  The particular version of the Library\nwith which the Combined Work was made is also called the \"Linked\nVersion\".\n\n  The \"Minimal Corresponding Source\" for a Combined Work means the\nCorresponding Source for the Combined Work, excluding any source code\nfor portions of the Combined Work that, considered in isolation, are\nbased on the Application, and not on the Linked Version.\n\n  The \"Corresponding Application Code\" for a Combined Work means the\nobject code and/or source code for the Application, including any data\nand utility programs needed for reproducing the Combined Work from the\nApplication, but excluding the System Libraries of the Combined Work.\n\n  1. Exception to Section 3 of the GNU GPL.\n\n  You may convey a covered work under sections 3 and 4 of this License\nwithout being bound by section 3 of the GNU GPL.\n\n  2. Conveying Modified Versions.\n\n  If you modify a copy of the Library, and, in your modifications, a\nfacility refers to a function or data to be supplied by an Application\nthat uses the facility (other than as an argument passed when the\nfacility is invoked), then you may convey a copy of the modified\nversion:\n\n   a) under this License, provided that you make a good faith effort to\n   ensure that, in the event an Application does not supply the\n   function or data, the facility still operates, and performs\n   whatever part of its purpose remains meaningful, or\n\n   b) under the GNU GPL, with none of the additional permissions of\n   this License applicable to that copy.\n\n  3. Object Code Incorporating Material from Library Header Files.\n\n  The object code form of an Application may incorporate material from\na header file that is part of the Library.  You may convey such object\ncode under terms of your choice, provided that, if the incorporated\nmaterial is not limited to numerical parameters, data structure\nlayouts and accessors, or small macros, inline functions and templates\n(ten or fewer lines in length), you do both of the following:\n\n   a) Give prominent notice with each copy of the object code that the\n   Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the object code with a copy of the GNU GPL and this license\n   document.\n\n  4. Combined Works.\n\n  You may convey a Combined Work under terms of your choice that,\ntaken together, effectively do not restrict modification of the\nportions of the Library contained in the Combined Work and reverse\nengineering for debugging such modifications, if you also do each of\nthe following:\n\n   a) Give prominent notice with each copy of the Combined Work that\n   the Library is used in it and that the Library and its use are\n   covered by this License.\n\n   b) Accompany the Combined Work with a copy of the GNU GPL and this license\n   document.\n\n   c) For a Combined Work that displays copyright notices during\n   execution, include the copyright notice for the Library among\n   these notices, as well as a reference directing the user to the\n   copies of the GNU GPL and this license document.\n\n   d) Do one of the following:\n\n       0) Convey the Minimal Corresponding Source under the terms of this\n       License, and the Corresponding Application Code in a form\n       suitable for, and under terms that permit, the user to\n       recombine or relink the Application with a modified version of\n       the Linked Version to produce a modified Combined Work, in the\n       manner specified by section 6 of the GNU GPL for conveying\n       Corresponding Source.\n\n       1) Use a suitable shared library mechanism for linking with the\n       Library.  A suitable mechanism is one that (a) uses at run time\n       a copy of the Library already present on the user's computer\n       system, and (b) will operate properly with a modified version\n       of the Library that is interface-compatible with the Linked\n       Version. \n\n   e) Provide Installation Information, but only if you would otherwise\n   be required to provide such information under section 6 of the\n   GNU GPL, and only to the extent that such information is\n   necessary to install and execute a modified version of the\n   Combined Work produced by recombining or relinking the\n   Application with a modified version of the Linked Version. (If\n   you use option 4d0, the Installation Information must accompany\n   the Minimal Corresponding Source and Corresponding Application\n   Code. If you use option 4d1, you must provide the Installation\n   Information in the manner specified by section 6 of the GNU GPL\n   for conveying Corresponding Source.)\n\n  5. Combined Libraries.\n\n  You may place library facilities that are a work based on the\nLibrary side by side in a single library together with other library\nfacilities that are not Applications and are not covered by this\nLicense, and convey such a combined library under terms of your\nchoice, if you do both of the following:\n\n   a) Accompany the combined library with a copy of the same work based\n   on the Library, uncombined with any other library facilities,\n   conveyed under the terms of this License.\n\n   b) Give prominent notice with the combined library that part of it\n   is a work based on the Library, and explaining where to find the\n   accompanying uncombined form of the same work.\n\n  6. Revised Versions of the GNU Lesser General Public License.\n\n  The Free Software Foundation may publish revised and/or new versions\nof the GNU Lesser General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\n  Each version is given a distinguishing version number. If the\nLibrary as you received it specifies that a certain numbered version\nof the GNU Lesser General Public License \"or any later version\"\napplies to it, you have the option of following the terms and\nconditions either of that published version or of any later version\npublished by the Free Software Foundation. If the Library as you\nreceived it does not specify a version number of the GNU Lesser\nGeneral Public License, you may choose any version of the GNU Lesser\nGeneral Public License ever published by the Free Software Foundation.\n\n  If the Library as you received it specifies that a proxy can decide\nwhether future versions of the GNU Lesser General Public License shall\napply, that proxy's public statement of acceptance of any version is\npermanent authorization for you to choose that version for the\nLibrary.\n\n--------------------------------------------------------------------------------\n\n           SPECIAL EXCEPTION GRANTED BY COPYRIGHT HOLDERS\n\nAs a special exception, copyright holders give you permission to link this\nlibrary with independent modules to produce an executable, regardless of\nthe license terms of these independent modules, and to copy and distribute\nthe resulting executable under terms of your choice, provided that you also\nmeet, for each linked independent module, the terms and conditions of\nthe license of that module. An independent module is a module which is not\nderived from or based on this library. If you modify this library, you must\nextend this exception to your version of the library.\n\n"
        },
        {
          "name": "NuGet.Config",
          "type": "blob",
          "size": 0.2587890625,
          "content": "﻿<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<configuration>\n  <packageSources>\n    <add key=\"NuGet.org\" value=\"https://api.nuget.org/v3/index.json\" />\n    <add key=\"xunit\" value=\"https://www.myget.org/F/xunit/api/v3/index.json\" />\n  </packageSources>\n</configuration>"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.275390625,
          "content": "<img src=\"https://cdn.rawgit.com/zeromq/netmq/master/img/NetMQLogo.svg\" width=\"350\" />\n\n[![GitHub Actions CI](https://github.com/zeromq/netmq/actions/workflows/CI.yml/badge.svg)](https://github.com/zeromq/netmq/actions/workflows/CI.yml)\n[![NetMQ NuGet version](https://img.shields.io/nuget/v/NetMQ.svg)](https://www.nuget.org/packages/NetMQ/)\n\nNetMQ is a 100% native C# port of the lightweight messaging library ZeroMQ.\n\nNetMQ extends the\nstandard socket interfaces with features traditionally provided by\nspecialised messaging middleware products. NetMQ sockets provide an\nabstraction of asynchronous message queues, multiple messaging patterns,\nmessage filtering (subscriptions), seamless access to multiple transport\nprotocols, and more.\n\n## Installation\n\nYou can download NetMQ via [NuGet](https://nuget.org/packages/NetMQ/).\n\n## Versions\n\nCurrently two versions are maintained \nVersion 3 which is the stable version of NetMQ and version 4, version 4 is same as version 3 without obsolete code.\nYou can find both version on Nuget, for more information read the [Migrating-to-v4](https://github.com/zeromq/netmq/wiki/Migrating-to-v4).\n\nThis repository is for version 4, for version 3 go to: https://github.com/NetMQ/NetMQ3-x.\n\n## Using / Documentation\n\nBefore using NetMQ, make sure to read the [ZeroMQ Guide](http://zguide.zeromq.org/).\n\nThe NetMQ documentation can be found at [netmq.readthedocs.org](http://netmq.readthedocs.org/en/latest/). Thanks to [Sacha Barber](http://www.codeproject.com/Members/Sacha-Barber) who agreed to do the documentation.\n\nYou can find NetMQ samples contributed by various users here: https://github.com/NetMQ/Samples\n\nThere are also a few blog posts available, which you can read about here:\n\n+ [Somdoron's blog](http://somdoron.com/category/netmq/)\n+ [Hello World](http://sachabarbs.wordpress.com/2014/08/19/zeromq-1-introduction/)\n+ [The Socket Types](http://sachabarbs.wordpress.com/2014/08/21/zeromq-2-the-socket-types-2/)\n+ [Socket Options/Identity and SendMore](http://sachabarbs.wordpress.com/2014/08/26/zeromq-3-socket-optionsidentity-and-sendmore/)\n+ [Multiple Socket Polling](http://sachabarbs.wordpress.com/2014/08/27/zeromq-4-multiple-sockets-polling/)\n+ [Sending From Multiple Sockets](https://sachabarbs.wordpress.com/2014/08/30/zeromq-sending-from-multiple-sockets/)\n+ [Divide And Conquer](http://sachabarbs.wordpress.com/2014/09/01/zeromq-6-divide-and-conquer/)\n\n\nHere is a simple example:\n\n```csharp\nusing (var server = new ResponseSocket(\"@tcp://localhost:5556\")) // bind\nusing (var client = new RequestSocket(\">tcp://localhost:5556\"))  // connect\n{\n    // Send a message from the client socket\n    client.SendFrame(\"Hello\");\n\n    // Receive the message from the server socket\n    string m1 = server.ReceiveFrameString();\n    Console.WriteLine(\"From Client: {0}\", m1);\n\n    // Send a response back from the server\n    server.SendFrame(\"Hi Back\");\n\n    // Receive the response from the client socket\n    string m2 = client.ReceiveFrameString();\n    Console.WriteLine(\"From Server: {0}\", m2);\n}\n```\n\n## Contributing\n\nWe need help, so if you have good knowledge of C# and ZeroMQ just grab one of the issues and add a pull request.\nWe are using [C4.1 process](http://rfc.zeromq.org/spec:22), so make sure you read this before.\n\nRegarding coding standards, we are using C# coding styles, to be a little more specific: we are using `camelCase` for variables and fields (with `m_` prefix for instance members and `s_` for static fields) and `PascalCase` for methods, classes and constants. Make sure you are using 'Insert Spaces' and 4 for tab and indent size.\n\nYou can also help us by:\n\n* Joining our [mailing list](https://groups.google.com/d/forum/netmq-dev?hl=en) and be an active member\n* Writing tutorials in the github wiki\n* Writing about the project in your blog (and add a pull request with a link to your blog at the bottom of this page)\n\n## Consulting and Support\nName | Email | Website | Info\n-----|-------|---------|-----\nDoron Somech | somdoron@gmail.com | http://somdoron.com | Founder and maintainer of NetMQ, expertise in Fintech and high performance scalable systems.\n\nIf you are providing support and consulting for NetMQ please make a pull request and add yourself to the list.\n\n## Important note on backward compatibility \n\nSince version 3.3.07 NetMQ changed the number serialization from Little Endian to Big Endian to be compatible with ZeroMQ.\nAny NetMQ version prior to 3.3.0.7 is not compatible with the new version. To support older versions you can set Endian option on a NetMQ socket to Little Endian,\nhowever doing so will make it incompatible with ZeroMQ.\n\nWe recommend to update to the latest version and use Big Endian which is now the default behavior.\n\n## Mailing list\n\nYou can join our mailing list [here](https://groups.google.com/d/forum/netmq-dev?hl=en). \n\n## Who owns NetMQ?\n\nNetMQ is owned by all its authors and contributors. \nThis is an open source project licensed under the LGPLv3. \nTo contribute to NetMQ please read the [C4.1 process](http://rfc.zeromq.org/spec:22), it's what we use.\nThere are open issues in the issues tab that still need to be taken care of, feel free to pick one up and submit a patch to the project.\n\n## Build Server\n\n![Code Better](http://www.jetbrains.com/img/banners/Codebetter300x250.png)\n\n[YouTrack by JetBrains - keyboard-centric bug tracker](http://www.jetbrains.com/youtrack)\n"
        },
        {
          "name": "appveyor.yml",
          "type": "blob",
          "size": 1.212890625,
          "content": "version: 4.0.0.{build}\nskip_tags: true\nimage: Visual Studio 2019\nconfiguration: Release\n\nbefore_build:\n  - choco install opencover.portable\n  - choco install codecov\n\nbuild_script:\n  - dotnet restore src/NetMQ.sln\n  - dotnet build src/NetMQ.sln /p:Configuration=Release /p:PackageVersion=%APPVEYOR_BUILD_VERSION%-pre /p:Version=%APPVEYOR_BUILD_VERSION% /p:ContinuousIntegrationBuild=true /verbosity:minimal\n  - dotnet pack src/NetMQ/NetMQ.csproj -c Release --no-build /p:PackageVersion=%APPVEYOR_BUILD_VERSION%-pre /p:Version=%APPVEYOR_BUILD_VERSION%\n\ntest_script:\n  - dotnet test -v n -p:ParallelizeTestCollections=false --configuration Release --no-build -f netcoreapp2.1 src\\NetMQ.Tests\\NetMQ.Tests.csproj\n  - dotnet test -v n -p:ParallelizeTestCollections=false --configuration Release --no-build -f net47 src\\NetMQ.Tests\\NetMQ.Tests.csproj\n  - OpenCover.Console.exe -register:user -target:\"C:\\Program Files\\dotnet\\dotnet.exe\" -targetargs:\"test --no-build --configuration Release -f netcoreapp2.1 --logger:trx;LogFileName=results.trx /p:DebugType=full src\\NetMQ.Tests\\NetMQ.Tests.csproj\" -filter:\"+[NetMQ*]* -[NetMQ.Tests*]*\" -output:\".\\NetMQ_coverage.xml\" -oldStyle\n  - codecov -f \"NetMQ_coverage.xml\"\n\nartifacts:\n  - path: '**\\*.nupkg'\n"
        },
        {
          "name": "codecov.yml",
          "type": "blob",
          "size": 0.181640625,
          "content": "coverage:\n  range: 65..95\n  status:\n    project:\n      default:\n        target: auto\n        threshold: 0.5%\n        base: auto\n\ncomment:\n  require_changes: true\n  layout: \"diff, files\"\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "img",
          "type": "tree",
          "content": null
        },
        {
          "name": "mkdocs.yml",
          "type": "blob",
          "size": 0.640625,
          "content": "site_name: NetMQ\n\npages:\n- Home: index.md\n- Introduction: introduction.md\n- Concepts:\n  - Receiving and Sending: receiving-sending.md\n  - Async/Await: async-await.md\n  - Messages: message.md\n  - Transports: transports.md\n  - Cleanup: cleanup.md\n- Components:\n  - Poller: poller.md\n  - Actor: actor.md\n  - Beacon: beacon.md\n  - Timer: timer.md\n  - Queue: queue.md\n  - Proactor: proactor.md\n- Patterns:\n  - Request-Response: request-response.md\n  - Pub-Sub: pub-sub.md\n  - Push-Pull: push-pull.md\n  - Router-Dealer: router-dealer.md\n  - XSub-XPub: xpub-xsub.md\n\ntheme: readthedocs\nrepo_url: https://github.com/zeromq/netmq/\nmarkdown_extensions: [codehilite]\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}