{
  "metadata": {
    "timestamp": 1736710873556,
    "page": 434,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQ0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "lgsvl/simulator",
      "stars": 2305,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 1.7119140625,
          "content": "*.tga filter=lfs diff=lfs merge=lfs -text\n*.TGA filter=lfs diff=lfs merge=lfs -text\n*.bmp filter=lfs diff=lfs merge=lfs -text\n*.BMP filter=lfs diff=lfs merge=lfs -text\n*.png filter=lfs diff=lfs merge=lfs -text\n*.PNG filter=lfs diff=lfs merge=lfs -text\n*.jpg filter=lfs diff=lfs merge=lfs -text\n*.JPG filter=lfs diff=lfs merge=lfs -text\n*.tiff filter=lfs diff=lfs merge=lfs -text\n*.TIFF filter=lfs diff=lfs merge=lfs -text\n*.aiff filter=lfs diff=lfs merge=lfs -text\n*.AIFF filter=lfs diff=lfs merge=lfs -text\n*.fbx filter=lfs diff=lfs merge=lfs -text\n*.FBX filter=lfs diff=lfs merge=lfs -text\n*.tga filter=lfs diff=lfs merge=lfs -text\n*.TGA filter=lfs diff=lfs merge=lfs -text\n*.tif filter=lfs diff=lfs merge=lfs -text\n*.TIF filter=lfs diff=lfs merge=lfs -text\n*.obj filter=lfs diff=lfs merge=lfs -text\n*.OBJ filter=lfs diff=lfs merge=lfs -text\n*.wav filter=lfs diff=lfs merge=lfs -text\n*.WAV filter=lfs diff=lfs merge=lfs -text\n*.mp3 filter=lfs diff=lfs merge=lfs -text\n*.MP3 filter=lfs diff=lfs merge=lfs -text\n*.st filter=lfs diff=lfs merge=lfs -text\n*.ST filter=lfs diff=lfs merge=lfs -text\n*.bank filter=lfs diff=lfs merge=lfs -text\n*.BANK filter=lfs diff=lfs merge=lfs -text\n*.tif filter=lfs diff=lfs merge=lfs -text\n*.TIF filter=lfs diff=lfs merge=lfs -text\n*.hdr filter=lfs diff=lfs merge=lfs -text\n*.unity filter=lfs diff=lfs merge=lfs -text\n*.unitypackage filter=lfs diff=lfs merge=lfs -text\n*.exe filter=lfs diff=lfs merge=lfs -text\n*.dll filter=lfs diff=lfs merge=lfs -text\n*.so filter=lfs diff=lfs merge=lfs -text\n*.psd filter=lfs diff=lfs merge=lfs -text\n*.exr filter=lfs diff=lfs merge=lfs -text\nffmpeg filter=lfs diff=lfs merge=lfs -text\nLICENSE text eol=crlf\nLICENSE-3RD-PARTY text eol=crlf\nPRIVACY text eol=crlf\nREADME.md text eol=crlf\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.0126953125,
          "content": "# Unity Specific folders\n/Library/\n/Temp/\n/obj/\n/Logs/\n\n# Autogenerated VS/MD solution and project files\n/.vs/\n/.vscode/\n\n*.csproj\n*.unityproj\n*.sln\n*.suo\n*.tmp\n*.swp\n*.user\n*.userprefs\n*.pidb\n*.booproj\n*.DotSettings\n*.swatch\n\n*.vsconfig\n\n# OSX\n.DS_Store\n.AppleDouble\n.LSOverride\n\n# Project specific\n/AssetBundles/\n/Assets/External/Environments/\n/Assets/External/Vehicles/\n/Assets/External/Sensors/\n/Assets/External/Controllables/\n/Assets/External/NPCs/\n/Assets/External/Pedestrians/\n/Assets/External/Restricted/\n/Assets/External/Restricted.meta\n/Assets/External/Tests/\n/Assets/External/Tests.meta\n/Assets/External/Bridges/\n/Assets/Resources/BuildInfo.asset*\n/Assets/Resources/Database/default*\n/WebUI/node_modules/\n/WebUI/dist/\n/config.yml\n/Assets/Resources/Editor/DeveloperSettings.asset*\n/svlsimulator-test*.xml\n/svlsimulator-check*.html\n/svlsimulator-bundles*.html\n/svlsimulator-*.zip\n/UserSettings/EditorUserSettings.asset*\n\n# Houdini Engine Unity\n/heu_session.txt\n/heu_settings.ini\n**/HoudiniEngineUnity/\n**/HoudiniEngineUnity.meta"
        },
        {
          "name": ".gitlab",
          "type": "tree",
          "content": null
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "Assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "Docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "Docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "Jenkins",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.177734375,
          "content": "SIMULATOR SOFTWARE LICENSE AGREEMENT\n\nDO NOT DOWNLOAD, INSTALL ACCESS, COPY, OR USE ANY PORTION OF THE LICENSED MATERIALS (DEFINED BELOW) UNTIL YOU HAVE READ AND ACCEPTED THE TERMS OF THIS AGREEMENT.  BY INSTALLING, COPYING, ACCESSING, OR USING THE LICENSED MATERIALS, YOU ACCEPT AND AGREE TO BE LEGALLY BOUND BY THE TERMS AND CONDITIONS OF THIS AGREEMENT.  If You do not agree to be bound by, or the entity for whose benefit You act has not authorized You to accept these terms and conditions, do not install, access, copy, or use the LG Simulator Software and destroy all copies in your possession.\n\nThis Software License Agreement (“Agreement”), effective upon your acceptance of this Agreement (“Effective Date”), is between Zenith Electronics, LLC with offices located at 5150 Great America Parkway, Santa Clara, CA 95054 (“LG”) and \"You.\" “You” or “Your” refers to you or your employer or other entity for whose benefit you act, as applicable.  \n\n\n1\tPURPOSE; LICENSE GRANT AND RESTRICTIONS. \n\n1.1\tPurpose.  This Agreement governs the use of the LG Simulator Software and any accompanying documentation, code, content owned or provided by LG (“LG Content”) and related materials (collectively, the “Licensed Material”) described in more detail in Exhibit A, made available to You by LG.  \n\n1.2\tLicense Grant.  Subject to the terms and conditions of this Agreement, LG grants You a nonexclusive, sublicensable as permitted herein, royalty-free, worldwide, perpetual, irrevocable license for software development and related purposes (the “Purpose”).  Any permitted sublicense must be on the same terms and conditions as contained herein.  \n\n1.3\tRestrictions.  You may not: (a) reverse engineer, decompile, or disassemble the executable or binary builds of Licensed Material, or otherwise attempt to defeat, avoid, by-pass, remove, deactivate or otherwise circumvent any software protection mechanisms in or included with the binary builds of Licensed Material including, without limitation, any such mechanism used to restrict or control the functionality of the binary builds of Licensed Material; (b) use or reproduce the Licensed Material for any reason other than the Purpose; (c) sell or otherwise transfer or make available the Licensed Material, any copies of the Licensed Material, or any information derived from the Licensed Material in any form to any third parties for commercial purposes; or (d) remove or alter any proprietary notices or marks on the Licensed Material.\n\n1.4\tDerivative Works.  You may modify or create derivative works of the Licensed Materials (“Derivatives”).  Any Derivatives created shall have the same restrictions and limitations as listed in Sections 1.2, 1.3, 1.4 and 4.1 herein. Your use of Derivatives outside the scope of this Agreement shall require a separate license agreement.  Derivatives do not include LG Content, or other content or data bundled with, created by or otherwise displayed as a result of using the Licensed Materials (“Simulator Content”).\n\n1.5\tLimitations.  \tYou may not use Licensed Materials and Derivatives as software-as-a-service, platform-as-a-service, infrastructure-as-a-service or other similar online service for commercial purposes.  Commercial purposes include, but are not limited to activities of sale, rent, or transfer for charge or other consideration received, directly or indirectly, to a third party in connection with a business or endeavor intended for profit.\n\n\n2\tUPDATES.\nYou acknowledge that LG may update or modify the Licensed Material from time to time and that such updates and modifications may adversely affect the manner in which You access or communicate with the Licensed Material.  \n\n\n3\tTERM; TERMINATION.  \n\n3.1\tTerm.  This Agreement will be effective as of the Effective Date and will remain effective until terminated as set forth below in Section 3.2.  \n\n3.2\tTermination.  This Agreement will be terminated immediately by LG at any time, by providing written notice to You (such notice may be via email) upon breach of any term or condition of this Agreement.  Upon termination, You and any sublicensees will cease access to the Licensed Material, and destroy all copies of the Licensed Material (including all derivatives thereof) You have obtained or created.  Sections 4-8 will survive the termination of this Agreement.  \n\n\n4\tOWNERSHIP; FEEDBACK. \n\n4.1\tOwnership.  As between You and LG, LG owns all right, title and interest in and to the Licensed Material (and any LG modifications or enhancements thereof), including but not limited to all intellectual property rights therein. Any rights not expressly granted herein are withheld.  As between You and LG, You (or the third party content provider) own all right, title and interest in and to the Simulator Content.  Simulator Content includes but is not limited to vehicle models, high definition maps, sensor parameters, and 3D environments.  Simulator Content does not include LG Content.\n\n4.2\tFeedback.  You agree to provide LG with comments concerning the Licensed Material and Your evaluation and use thereof, including bug reports, evaluations, proposed product integrations (and associated metrics and learned knowledge) (“Feedback”).  You agree that LG and its designees will be free to copy, modify, create derivative works, publicly display, disclose, distribute, license and sublicense, incorporate and otherwise use the Feedback, including derivative works thereto, for any and all commercial and non-commercial purposes with no obligation of any kind to You. \n\n4.3\tOpen Source.  You hereby acknowledge that the Licensed Materials may contain Open Source Software.  “Open Source Software” means any software or software component, module or package that contains, or is derived in any manner (in whole or in part) from, any software that is distributed as free software, open source software or similar licensing or distribution models.  To the extent any such license requires that LG provide You the rights to copy, modify, distribute or otherwise use any Open Source Software that are inconsistent with the limited rights granted to You in this Agreement, then such rights in the applicable Open Source Software license shall take precedence over the rights and restrictions granted in this Agreement, but solely with respect to such Open Source Software.  You agree to review any documentation that accompanies the Licensed Materials or is identified in a link provided in the documentation for the Licensed Materials in order to determine which portions of the Licensed Materials are Open Source Software and are licensed under an Open Source Software license.  You acknowledge that the Open Source Software license is solely between You and the applicable licensor of the Open Source Software.  You shall comply with the terms of all applicable Open Source Software licenses, if any.\n\n\n5\tREPRESENTATIONS AND WARRANTIES; DISCLAIMER. \n\n5.1\tRepresentations and Warranties.  You represent and warrant that: (a) the performance of Your obligations will not constitute a breach or otherwise violate any other agreement or the rights of any third party arising therefrom; and (b) You will maintain throughout the Term all rights and licenses that are required with respect to use of the Licensed Material, and Your use does and will continue to comply with all applicable foreign, federal, state, and local laws, rules and regulations.\n\n5.2\tDisclaimer. THE LICENSED MATERIAL AND ANY OTHER LG PRODUCTS AND SERVICES PROVIDED HEREUNDER ARE PROVIDED “AS IS” AND WITHOUT WARRANTY OF ANY KIND.   LG DISCLAIMS ALL WARRANTIES, WHETHER EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING WITHOUT LIMITATION WARRANTIES OF MERCHANTABILITY, NONINFRINGEMENT, FITNESS FOR A PARTICULAR PURPOSE, AND ANY WARRANTIES OR CONDITIONS ARISING OUT OF COURSE OF DEALING OR USAGE OF TRADE.  LG DOES NOT WARRANT THAT THE LICENSED MATERIAL AND ANY OTHER LG PRODUCTS AND SERVICES PROVIDED HEREUNDER WILL MEET ALL OF YOUR REQUIREMENTS OR EXPECTATIONS, OR THAT USE OF SUCH LICENSED MATERIAL BE ERROR-FREE, UNINTERRUPTED, VIRUS-FREE, OR SECURE. \n\n\n6\tLIMITATION OF LIABILITY. \n\nIN NO EVENT SHALL LG BE LIABLE TO YOU OR YOUR SUBLICENSEES FOR ANY SPECIAL, INCIDENTAL, EXEMPLARY, PUNITIVE OR CONSEQUENTIAL DAMAGES (INCLUDING LOSS OF USE, DATA, BUSINESS OR PROFITS) ARISING OUT OF OR IN CONNECTION WITH THIS AGREEMENT, WHETHER SUCH LIABILITY ARISES FROM ANY CLAIM BASED UPON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT LIABILITY OR OTHERWISE, AND WHETHER OR NOT LG HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGE.  THE FOREGOING LIMITATIONS WILL SURVIVE AND APPLY EVEN IF ANY LIMITED REMEDY SPECIFIED IN THIS AGREEMENT IS FOUND TO HAVE FAILED OF ITS ESSENTIAL PURPOSE. IN ANY CASE, LG’S AGGREGATE LIABILITY UNDER THIS AGREEMENT WILL NOT EXCEED THE FEE, IF ANY, THAT YOU PAID LG FOR USE OF THE LICENSED MATERIAL.\n\n\n7\tINDEMNIFICATION.  \n\nYou will indemnify, defend, or at its option settle and hold LG, its subsidiaries, affiliates, officers and employees, harmless from any and all claims, damages, losses, liabilities, actions, judgments, costs and expenses (including reasonable attorneys’ fees) brought by a third party arising out of or in connection with: (a) any intentionally tortious or negligent act or omission by You in connection with Your use of the Licensed Material; (b) Your use of the Licensed Material other than as expressly allowed by this Agreement; (c) any claims that Derivatives or Simulator Content have infringed third party intellectual property rights; or (d) Your breach or alleged breach of any of the terms, restrictions, obligations or representations under this Agreement.\n\n\n8\tMISCELLANEOUS.  \nThis Agreement constitutes the entire agreement among the parties with respect to the subject matter and supersedes and merges all prior proposals, understandings and contemporaneous communications.  Any modification to this Agreement must be in a writing duly authorized by LG or pursuant to Section 2 (Updates).  You may not assign any of the rights or obligations granted hereunder, voluntarily or by operation of law (including without limitation in connection with a merger, acquisition, or sale of assets) except with the express written consent of LG, and any attempted assignment in violation of this paragraph is void.  This Agreement does not create or imply any partnership, agency or joint venture.  This Agreement will be governed by and construed in accordance with the laws of the State of California, without regard to or application of conflicts of law rules or principles. Any controversy arising out of this Agreement shall be heard exclusively in the federal or state courts located in Santa Clara County, CA and You agree to submit to jurisdiction thereof.  No waiver by LG of any covenant or right under this Agreement will be effective unless memorialized in a writing duly authorized by LG.  If any part of this Agreement is determined to be invalid or unenforceable by a court of competent jurisdiction, that provision will be enforced to the maximum extent permissible and the remaining provisions of this Agreement will remain in full force and effect.\n\n\n\n \nEXHIBIT A\n\nLicensed Material:\nSource code\nShaders\nBuild scripts\nPre-built components\nDocumentation\nIcons\nProject settings\n\n\nLG Content:\n3D environments\nVehicle models\nHD maps\nSensor configurations\nConfiguration files\n"
        },
        {
          "name": "LICENSE-3RD-PARTY",
          "type": "blob",
          "size": 58.34375,
          "content": "THIRD PARTY LICENSES\n\n\n-----------------------------------------------------------------------------\n                                GNU LESSER GENERAL PUBLIC LICENSE\n                                    Version 2.1, February 1999\n        applies to:\n        - LASzip, Copyright (C) 1991, 1999 Free Software Foundation, Inc. 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA. \n        The original source code for this software can be found at https://github.com/LASzip/LASzip. \n        - FFmpeg, Copyright (C) 1991, 1999 Free Software Foundation, Inc. 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA.\n        The original source code for this software can be found at https://github.com/FFmpeg/FFmpeg\n-----------------------------------------------------------------------------\n\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n[This is the first released version of the Lesser GPL.  It also counts\n as the successor of the GNU Library Public License, version 2, hence\n the version number 2.1.]\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicenses are intended to guarantee your freedom to share and change\nfree software--to make sure the software is free for all its users.\n\n  This license, the Lesser General Public License, applies to some\nspecially designated software packages--typically libraries--of the\nFree Software Foundation and other authors who decide to use it.  You\ncan use it too, but we suggest you first think carefully about whether\nthis license or the ordinary General Public License is the better\nstrategy to use in any particular case, based on the explanations below.\n\n  When we speak of free software, we are referring to freedom of use,\nnot price.  Our General Public Licenses are designed to make sure that\nyou have the freedom to distribute copies of free software (and charge\nfor this service if you wish); that you receive source code or can get\nit if you want it; that you can change the software and use pieces of\nit in new free programs; and that you are informed that you can do\nthese things.\n\n  To protect your rights, we need to make restrictions that forbid\ndistributors to deny you these rights or to ask you to surrender these\nrights.  These restrictions translate to certain responsibilities for\nyou if you distribute copies of the library or if you modify it.\n\n  For example, if you distribute copies of the library, whether gratis\nor for a fee, you must give the recipients all the rights that we gave\nyou.  You must make sure that they, too, receive or can get the source\ncode.  If you link other code with the library, you must provide\ncomplete object files to the recipients, so that they can relink them\nwith the library after making changes to the library and recompiling\nit.  And you must show them these terms so they know their rights.\n\n  We protect your rights with a two-step method: (1) we copyright the\nlibrary, and (2) we offer you this license, which gives you legal\npermission to copy, distribute and/or modify the library.\n\n  To protect each distributor, we want to make it very clear that\nthere is no warranty for the free library.  Also, if the library is\nmodified by someone else and passed on, the recipients should know\nthat what they have is not the original version, so that the original\nauthor's reputation will not be affected by problems that might be\nintroduced by others.\n\n\n  Finally, software patents pose a constant threat to the existence of\nany free program.  We wish to make sure that a company cannot\neffectively restrict the users of a free program by obtaining a\nrestrictive license from a patent holder.  Therefore, we insist that\nany patent license obtained for a version of the library must be\nconsistent with the full freedom of use specified in this license.\n\n  Most GNU software, including some libraries, is covered by the\nordinary GNU General Public License.  This license, the GNU Lesser\nGeneral Public License, applies to certain designated libraries, and\nis quite different from the ordinary General Public License.  We use\nthis license for certain libraries in order to permit linking those\nlibraries into non-free programs.\n\n  When a program is linked with a library, whether statically or using\na shared library, the combination of the two is legally speaking a\ncombined work, a derivative of the original library.  The ordinary\nGeneral Public License therefore permits such linking only if the\nentire combination fits its criteria of freedom.  The Lesser General\nPublic License permits more lax criteria for linking other code with\nthe library.\n\n  We call this license the \"Lesser\" General Public License because it\ndoes Less to protect the user's freedom than the ordinary General\nPublic License.  It also provides other free software developers Less\nof an advantage over competing non-free programs.  These disadvantages\nare the reason we use the ordinary General Public License for many\nlibraries.  However, the Lesser license provides advantages in certain\nspecial circumstances.\n\n  For example, on rare occasions, there may be a special need to\nencourage the widest possible use of a certain library, so that it becomes\na de-facto standard.  To achieve this, non-free programs must be\nallowed to use the library.  A more frequent case is that a free\nlibrary does the same job as widely used non-free libraries.  In this\ncase, there is little to gain by limiting the free library to free\nsoftware only, so we use the Lesser General Public License.\n\n  In other cases, permission to use a particular library in non-free\nprograms enables a greater number of people to use a large body of\nfree software.  For example, permission to use the GNU C Library in\nnon-free programs enables many more people to use the whole GNU\noperating system, as well as its variant, the GNU/Linux operating\nsystem.\n\n  Although the Lesser General Public License is Less protective of the\nusers' freedom, it does ensure that the user of a program that is\nlinked with the Library has the freedom and the wherewithal to run\nthat program using a modified version of the Library.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.  Pay close attention to the difference between a\n\"work based on the library\" and a \"work that uses the library\".  The\nformer contains code derived from the library, whereas the latter must\nbe combined with the library in order to run.\n\n\n                  GNU LESSER GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License Agreement applies to any software library or other\nprogram which contains a notice placed by the copyright holder or\nother authorized party saying it may be distributed under the terms of\nthis Lesser General Public License (also called \"this License\").\nEach licensee is addressed as \"you\".\n\n  A \"library\" means a collection of software functions and/or data\nprepared so as to be conveniently linked with application programs\n(which use some of those functions and data) to form executables.\n\n  The \"Library\", below, refers to any such software library or work\nwhich has been distributed under these terms.  A \"work based on the\nLibrary\" means either the Library or any derivative work under\ncopyright law: that is to say, a work containing the Library or a\nportion of it, either verbatim or with modifications and/or translated\nstraightforwardly into another language.  (Hereinafter, translation is\nincluded without limitation in the term \"modification\".)\n\n  \"Source code\" for a work means the preferred form of the work for\nmaking modifications to it.  For a library, complete source code means\nall the source code for all modules it contains, plus any associated\ninterface definition files, plus the scripts used to control compilation\nand installation of the library.\n\n  Activities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning a program using the Library is not restricted, and output from\nsuch a program is covered only if its contents constitute a work based\non the Library (independent of the use of the Library in a tool for\nwriting it).  Whether that is true depends on what the Library does\nand what the program that uses the Library does.\n\n  1. You may copy and distribute verbatim copies of the Library's\ncomplete source code as you receive it, in any medium, provided that\nyou conspicuously and appropriately publish on each copy an\nappropriate copyright notice and disclaimer of warranty; keep intact\nall the notices that refer to this License and to the absence of any\nwarranty; and distribute a copy of this License along with the\nLibrary.\n\n  You may charge a fee for the physical act of transferring a copy,\nand you may at your option offer warranty protection in exchange for a\nfee.\n\n\n  2. You may modify your copy or copies of the Library or any portion\nof it, thus forming a work based on the Library, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) The modified work must itself be a software library.\n\n    b) You must cause the files modified to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    c) You must cause the whole of the work to be licensed at no\n    charge to all third parties under the terms of this License.\n\n    d) If a facility in the modified Library refers to a function or a\n    table of data to be supplied by an application program that uses\n    the facility, other than as an argument passed when the facility\n    is invoked, then you must make a good faith effort to ensure that,\n    in the event an application does not supply such function or\n    table, the facility still operates, and performs whatever part of\n    its purpose remains meaningful.\n\n    (For example, a function in a library to compute square roots has\n    a purpose that is entirely well-defined independent of the\n    application.  Therefore, Subsection 2d requires that any\n    application-supplied function or table used by this function must\n    be optional: if the application does not supply it, the square\n    root function must still compute square roots.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Library,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Library, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote\nit.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Library.\n\nIn addition, mere aggregation of another work not based on the Library\nwith the Library (or with a work based on the Library) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may opt to apply the terms of the ordinary GNU General Public\nLicense instead of this License to a given copy of the Library.  To do\nthis, you must alter all the notices that refer to this License, so\nthat they refer to the ordinary GNU General Public License, version 2,\ninstead of to this License.  (If a newer version than version 2 of the\nordinary GNU General Public License has appeared, then you can specify\nthat version instead if you wish.)  Do not make any other change in\nthese notices.\n\n\n  Once this change is made in a given copy, it is irreversible for\nthat copy, so the ordinary GNU General Public License applies to all\nsubsequent copies and derivative works made from that copy.\n\n  This option is useful when you wish to copy part of the code of\nthe Library into a program that is not a library.\n\n  4. You may copy and distribute the Library (or a portion or\nderivative of it, under Section 2) in object code or executable form\nunder the terms of Sections 1 and 2 above provided that you accompany\nit with the complete corresponding machine-readable source code, which\nmust be distributed under the terms of Sections 1 and 2 above on a\nmedium customarily used for software interchange.\n\n  If distribution of object code is made by offering access to copy\nfrom a designated place, then offering equivalent access to copy the\nsource code from the same place satisfies the requirement to\ndistribute the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  5. A program that contains no derivative of any portion of the\nLibrary, but is designed to work with the Library by being compiled or\nlinked with it, is called a \"work that uses the Library\".  Such a\nwork, in isolation, is not a derivative work of the Library, and\ntherefore falls outside the scope of this License.\n\n  However, linking a \"work that uses the Library\" with the Library\ncreates an executable that is a derivative of the Library (because it\ncontains portions of the Library), rather than a \"work that uses the\nlibrary\".  The executable is therefore covered by this License.\nSection 6 states terms for distribution of such executables.\n\n  When a \"work that uses the Library\" uses material from a header file\nthat is part of the Library, the object code for the work may be a\nderivative work of the Library even though the source code is not.\nWhether this is true is especially significant if the work can be\nlinked without the Library, or if the work is itself a library.  The\nthreshold for this to be true is not precisely defined by law.\n\n  If such an object file uses only numerical parameters, data\nstructure layouts and accessors, and small macros and small inline\nfunctions (ten lines or less in length), then the use of the object\nfile is unrestricted, regardless of whether it is legally a derivative\nwork.  (Executables containing this object code plus portions of the\nLibrary will still fall under Section 6.)\n\n  Otherwise, if the work is a derivative of the Library, you may\ndistribute the object code for the work under the terms of Section 6.\nAny executables containing that work also fall under Section 6,\nwhether or not they are linked directly with the Library itself.\n\n\n  6. As an exception to the Sections above, you may also combine or\nlink a \"work that uses the Library\" with the Library to produce a\nwork containing portions of the Library, and distribute that work\nunder terms of your choice, provided that the terms permit\nmodification of the work for the customer's own use and reverse\nengineering for debugging such modifications.\n\n  You must give prominent notice with each copy of the work that the\nLibrary is used in it and that the Library and its use are covered by\nthis License.  You must supply a copy of this License.  If the work\nduring execution displays copyright notices, you must include the\ncopyright notice for the Library among them, as well as a reference\ndirecting the user to the copy of this License.  Also, you must do one\nof these things:\n\n    a) Accompany the work with the complete corresponding\n    machine-readable source code for the Library including whatever\n    changes were used in the work (which must be distributed under\n    Sections 1 and 2 above); and, if the work is an executable linked\n    with the Library, with the complete machine-readable \"work that\n    uses the Library\", as object code and/or source code, so that the\n    user can modify the Library and then relink to produce a modified\n    executable containing the modified Library.  (It is understood\n    that the user who changes the contents of definitions files in the\n    Library will not necessarily be able to recompile the application\n    to use the modified definitions.)\n\n    b) Use a suitable shared library mechanism for linking with the\n    Library.  A suitable mechanism is one that (1) uses at run time a\n    copy of the library already present on the user's computer system,\n    rather than copying library functions into the executable, and (2)\n    will operate properly with a modified version of the library, if\n    the user installs one, as long as the modified version is\n    interface-compatible with the version that the work was made with.\n\n    c) Accompany the work with a written offer, valid for at\n    least three years, to give the same user the materials\n    specified in Subsection 6a, above, for a charge no more\n    than the cost of performing this distribution.\n\n    d) If distribution of the work is made by offering access to copy\n    from a designated place, offer equivalent access to copy the above\n    specified materials from the same place.\n\n    e) Verify that the user has already received a copy of these\n    materials or that you have already sent this user a copy.\n\n  For an executable, the required form of the \"work that uses the\nLibrary\" must include any data and utility programs needed for\nreproducing the executable from it.  However, as a special exception,\nthe materials to be distributed need not include anything that is\nnormally distributed (in either source or binary form) with the major\ncomponents (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, unless that component itself accompanies\nthe executable.\n\n  It may happen that this requirement contradicts the license\nrestrictions of other proprietary libraries that do not normally\naccompany the operating system.  Such a contradiction means you cannot\nuse both them and the Library together in an executable that you\ndistribute.\n\n\n  7. You may place library facilities that are a work based on the\nLibrary side-by-side in a single library together with other library\nfacilities not covered by this License, and distribute such a combined\nlibrary, provided that the separate distribution of the work based on\nthe Library and of the other library facilities is otherwise\npermitted, and provided that you do these two things:\n\n    a) Accompany the combined library with a copy of the same work\n    based on the Library, uncombined with any other library\n    facilities.  This must be distributed under the terms of the\n    Sections above.\n\n    b) Give prominent notice with the combined library of the fact\n    that part of it is a work based on the Library, and explaining\n    where to find the accompanying uncombined form of the same work.\n\n  8. You may not copy, modify, sublicense, link with, or distribute\nthe Library except as expressly provided under this License.  Any\nattempt otherwise to copy, modify, sublicense, link with, or\ndistribute the Library is void, and will automatically terminate your\nrights under this License.  However, parties who have received copies,\nor rights, from you under this License will not have their licenses\nterminated so long as such parties remain in full compliance.\n\n  9. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Library or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Library (or any work based on the\nLibrary), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Library or works based on it.\n\n  10. Each time you redistribute the Library (or any work based on the\nLibrary), the recipient automatically receives a license from the\noriginal licensor to copy, distribute, link with or modify the Library\nsubject to these terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties with\nthis License.\n\n\n  11. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Library at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Library by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply,\nand the section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  12. If the distribution and/or use of the Library is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Library under this License may add\nan explicit geographical distribution limitation excluding those countries,\nso that distribution is permitted only in or among countries not thus\nexcluded.  In such case, this License incorporates the limitation as if\nwritten in the body of this License.\n\n  13. The Free Software Foundation may publish revised and/or new\nversions of the Lesser General Public License from time to time.\nSuch new versions will be similar in spirit to the present version,\nbut may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Library\nspecifies a version number of this License which applies to it and\n\"any later version\", you have the option of following the terms and\nconditions either of that version or of any later version published by\nthe Free Software Foundation.  If the Library does not specify a\nlicense version number, you may choose any version ever published by\nthe Free Software Foundation.\n\n\n  14. If you wish to incorporate parts of the Library into other free\nprograms whose distribution conditions are incompatible with these,\nwrite to the author to ask for permission.  For software which is\ncopyrighted by the Free Software Foundation, write to the Free\nSoftware Foundation; we sometimes make exceptions for this.  Our\ndecision will be guided by the two goals of preserving the free status\nof all derivatives of our free software and of promoting the sharing\nand reuse of software generally.\n\n                            NO WARRANTY\n\n  15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO\nWARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR\nOTHER PARTIES PROVIDE THE LIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nLIBRARY IS WITH YOU.  SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY\nAND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU\nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nLIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\n\n-----------------------------------------------------------------------------\n                               Mozilla Public License, Version 2.0\n\n        applies to: \n        - Assets/Scripts/Components/VehicleDynamics.cs, Copyright (C) 2016, Jaguar Land Rover. Copyright (c) 2019 LG Electronics, Inc. \n-----------------------------------------------------------------------------\n\n                                        Mozilla Public License\n                                        Version 2.0\n1. Definitions\n1.1. “Contributor”\nmeans each individual or legal entity that creates, contributes to the creation of, or owns Covered Software.\n\n1.2. “Contributor Version”\nmeans the combination of the Contributions of others (if any) used by a Contributor and that particular Contributor’s Contribution.\n\n1.3. “Contribution”\nmeans Covered Software of a particular Contributor.\n\n1.4. “Covered Software”\nmeans Source Code Form to which the initial Contributor has attached the notice in Exhibit A, the Executable Form of such Source Code Form, and Modifications of such Source Code Form, in each case including portions thereof.\n\n1.5. “Incompatible With Secondary Licenses”\nmeans\n\nthat the initial Contributor has attached the notice described in Exhibit B to the Covered Software; or\n\nthat the Covered Software was made available under the terms of version 1.1 or earlier of the License, but not also under the terms of a Secondary License.\n\n1.6. “Executable Form”\nmeans any form of the work other than Source Code Form.\n\n1.7. “Larger Work”\nmeans a work that combines Covered Software with other material, in a separate file or files, that is not Covered Software.\n\n1.8. “License”\nmeans this document.\n\n1.9. “Licensable”\nmeans having the right to grant, to the maximum extent possible, whether at the time of the initial grant or subsequently, any and all of the rights conveyed by this License.\n\n1.10. “Modifications”\nmeans any of the following:\n\nany file in Source Code Form that results from an addition to, deletion from, or modification of the contents of Covered Software; or\n\nany new file in Source Code Form that contains any Covered Software.\n\n1.11. “Patent Claims” of a Contributor\nmeans any patent claim(s), including without limitation, method, process, and apparatus claims, in any patent Licensable by such Contributor that would be infringed, but for the grant of the License, by the making, using, selling, offering for sale, having made, import, or transfer of either its Contributions or its Contributor Version.\n\n1.12. “Secondary License”\nmeans either the GNU General Public License, Version 2.0, the GNU Lesser General Public License, Version 2.1, the GNU Affero General Public License, Version 3.0, or any later versions of those licenses.\n\n1.13. “Source Code Form”\nmeans the form of the work preferred for making modifications.\n\n1.14. “You” (or “Your”)\nmeans an individual or a legal entity exercising rights under this License. For legal entities, “You” includes any entity that controls, is controlled by, or is under common control with You. For purposes of this definition, “control” means (a) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (b) ownership of more than fifty percent (50%) of the outstanding shares or beneficial ownership of such entity.\n\n2. License Grants and Conditions\n2.1. Grants\nEach Contributor hereby grants You a world-wide, royalty-free, non-exclusive license:\n\nunder intellectual property rights (other than patent or trademark) Licensable by such Contributor to use, reproduce, make available, modify, display, perform, distribute, and otherwise exploit its Contributions, either on an unmodified basis, with Modifications, or as part of a Larger Work; and\n\nunder Patent Claims of such Contributor to make, use, sell, offer for sale, have made, import, and otherwise transfer either its Contributions or its Contributor Version.\n\n2.2. Effective Date\nThe licenses granted in Section 2.1 with respect to any Contribution become effective for each Contribution on the date the Contributor first distributes such Contribution.\n\n2.3. Limitations on Grant Scope\nThe licenses granted in this Section 2 are the only rights granted under this License. No additional rights or licenses will be implied from the distribution or licensing of Covered Software under this License. Notwithstanding Section 2.1(b) above, no patent license is granted by a Contributor:\n\nfor any code that a Contributor has removed from Covered Software; or\n\nfor infringements caused by: (i) Your and any other third party’s modifications of Covered Software, or (ii) the combination of its Contributions with other software (except as part of its Contributor Version); or\n\nunder Patent Claims infringed by Covered Software in the absence of its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks, or logos of any Contributor (except as may be necessary to comply with the notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\nNo Contributor makes additional grants as a result of Your choice to distribute the Covered Software under a subsequent version of this License (see Section 10.2) or under the terms of a Secondary License (if permitted under the terms of Section 3.3).\n\n2.5. Representation\nEach Contributor represents that the Contributor believes its Contributions are its original creation(s) or it has sufficient rights to grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\nThis License is not intended to limit any rights You have under applicable copyright doctrines of fair use, fair dealing, or other equivalents.\n\n2.7. Conditions\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in Section 2.1.\n\n3. Responsibilities\n3.1. Distribution of Source Form\nAll distribution of Covered Software in Source Code Form, including any Modifications that You create or to which You contribute, must be under the terms of this License. You must inform recipients that the Source Code Form of the Covered Software is governed by the terms of this License, and how they can obtain a copy of this License. You may not attempt to alter or restrict the recipients’ rights in the Source Code Form.\n\n3.2. Distribution of Executable Form\nIf You distribute Covered Software in Executable Form then:\n\nsuch Covered Software must also be made available in Source Code Form, as described in Section 3.1, and You must inform recipients of the Executable Form how they can obtain a copy of such Source Code Form by reasonable means in a timely manner, at a charge no more than the cost of distribution to the recipient; and\n\nYou may distribute such Executable Form under the terms of this License, or sublicense it under different terms, provided that the license for the Executable Form does not attempt to limit or alter the recipients’ rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\nYou may create and distribute a Larger Work under terms of Your choice, provided that You also comply with the requirements of this License for the Covered Software. If the Larger Work is a combination of Covered Software with a work governed by one or more Secondary Licenses, and the Covered Software is not Incompatible With Secondary Licenses, this License permits You to additionally distribute such Covered Software under the terms of such Secondary License(s), so that the recipient of the Larger Work may, at their option, further distribute the Covered Software under the terms of either this License or such Secondary License(s).\n\n3.4. Notices\nYou may not remove or alter the substance of any license notices (including copyright notices, patent notices, disclaimers of warranty, or limitations of liability) contained within the Source Code Form of the Covered Software, except that You may alter any license notices to the extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\nYou may choose to offer, and to charge a fee for, warranty, support, indemnity or liability obligations to one or more recipients of Covered Software. However, You may do so only on Your own behalf, and not on behalf of any Contributor. You must make it absolutely clear that any such warranty, support, indemnity, or liability obligation is offered by You alone, and You hereby agree to indemnify every Contributor for any liability incurred by such Contributor as a result of warranty, support, indemnity or liability terms You offer. You may include additional disclaimers of warranty and limitations of liability specific to any jurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\nIf it is impossible for You to comply with any of the terms of this License with respect to some or all of the Covered Software due to statute, judicial order, or regulation then You must: (a) comply with the terms of this License to the maximum extent possible; and (b) describe the limitations and the code they affect. Such description must be placed in a text file included with all distributions of the Covered Software under this License. Except to the extent prohibited by statute or regulation, such description must be sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n\n5. Termination\n5.1. The rights granted under this License will terminate automatically if You fail to comply with any of its terms. However, if You become compliant, then the rights granted under this License from a particular Contributor are reinstated (a) provisionally, unless and until such Contributor explicitly and finally terminates Your grants, and (b) on an ongoing basis, if such Contributor fails to notify You of the non-compliance by some reasonable means prior to 60 days after You have come back into compliance. Moreover, Your grants from a particular Contributor are reinstated on an ongoing basis if such Contributor notifies You of the non-compliance by some reasonable means, this is the first time You have received notice of non-compliance with this License from such Contributor, and You become compliant prior to 30 days after Your receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent infringement claim (excluding declaratory judgment actions, counter-claims, and cross-claims) alleging that a Contributor Version directly or indirectly infringes any patent, then the rights granted to You by any and all Contributors for the Covered Software under Section 2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all end user license agreements (excluding distributors and resellers) which have been validly granted by You or Your distributors under this License prior to termination shall survive termination.\n\n6. Disclaimer of Warranty\nCovered Software is provided under this License on an “as is” basis, without warranty of any kind, either expressed, implied, or statutory, including, without limitation, warranties that the Covered Software is free of defects, merchantable, fit for a particular purpose or non-infringing. The entire risk as to the quality and performance of the Covered Software is with You. Should any Covered Software prove defective in any respect, You (not any Contributor) assume the cost of any necessary servicing, repair, or correction. This disclaimer of warranty constitutes an essential part of this License. No use of any Covered Software is authorized under this License except under this disclaimer.\n\n7. Limitation of Liability\nUnder no circumstances and under no legal theory, whether tort (including negligence), contract, or otherwise, shall any Contributor, or anyone who distributes Covered Software as permitted above, be liable to You for any direct, indirect, special, incidental, or consequential damages of any character including, without limitation, damages for lost profits, loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses, even if such party shall have been informed of the possibility of such damages. This limitation of liability shall not apply to liability for death or personal injury resulting from such party’s negligence to the extent applicable law prohibits such limitation. Some jurisdictions do not allow the exclusion or limitation of incidental or consequential damages, so this exclusion and limitation may not apply to You.\n\n8. Litigation\nAny litigation relating to this License may be brought only in the courts of a jurisdiction where the defendant maintains its principal place of business and such litigation shall be governed by laws of that jurisdiction, without reference to its conflict-of-law provisions. Nothing in this Section shall prevent a party’s ability to bring cross-claims or counter-claims.\n\n9. Miscellaneous\nThis License represents the complete agreement concerning the subject matter hereof. If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable. Any law or regulation which provides that the language of a contract shall be construed against the drafter shall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n10.1. New Versions\nMozilla Foundation is the license steward. Except as provided in Section 10.3, no one other than the license steward has the right to modify or publish new versions of this License. Each version will be given a distinguishing version number.\n\n10.2. Effect of New Versions\nYou may distribute the Covered Software under the terms of the version of the License under which You originally received the Covered Software, or under the terms of any subsequent version published by the license steward.\n\n10.3. Modified Versions\nIf you create software not governed by this License, and you want to create a new license for such software, you may create and use a modified version of this License if you rename the license and remove any references to the name of the license steward (except to note that such modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary Licenses\nIf You choose to distribute Source Code Form that is Incompatible With Secondary Licenses under the terms of this version of the License, the notice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\nThis Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL was not distributed with this file, You can obtain one at https://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular file, then You may include the notice in a location (such as a LICENSE file in a relevant directory) where a recipient would be likely to look for such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - “Incompatible With Secondary Licenses” Notice\nThis Source Code Form is “Incompatible With Secondary Licenses”, as defined by the Mozilla Public License, v. 2.0.\n\n\n-----------------------------------------------------------------------------\n                               Modified BSD License\n        applies to: \n        - libjpeg-turbo, Copyright (C)2009-2019 D. R. Commander. All Rights Reserved. Copyright (C)2015 Viktor Szathmáry. All Rights Reserved.\n        - Moq, Copyright (c) 2007, Clarius Consulting, Manas Technology Solutions, InSTEDD. All rights reserved.\n        - FMI, Copyright (c) 2018, Dassault Systemes. All rights reserved.\n        - FBX2GLTF, Copyright (c) Facebook, Inc. and its affiliates. All rights reserved.\n\n\t\t\n-----------------------------------------------------------------------------\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\n-----------------------------------------------------------------------------\n                               License\n        applies to:\n\t\t- KinoGlitch, Copyright (C) 2015 Keijiro Takahashi.\n\n\t\t\n-----------------------------------------------------------------------------\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\n-----------------------------------------------------------------------------\n                        Independent JPEG Group License, Clause 2\n        applies to: \n        - libjpeg-turbo\n-----------------------------------------------------------------------------\n\nThis software is based in part on the work of the Independent JPEG\nGroup.\n\n\n-----------------------------------------------------------------------------\n                        The Apache License\n        applies to:\n        - Petapoco, Copyright (c) 2011-2011 Topten Software (contact@toptensoftware.com)\n        - Protobuf .NET implementation, Copyright (c) 2008 Marc Gravell\n        - Google Analytics Plugin for Unity (beta), Copyright (c) 2014 Google Inc. All rights reserved.\n        - OdrSpiral.cs, Copyright 2010 VIRES Simulationstechnologie GmbH\n        - xviz, Copyright 2019 Uber Technologies, Inc.\n-----------------------------------------------------------------------------\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n\n-----------------------------------------------------------------------------\n                        The MIT License (MIT)\n        applies to: \n        - Nancy, Copyright (c) 2010 Andreas Håkansson, Steven Robbins and contributors\n        - OsmSharp, Copyright (c) 2017 Ben Abelshausen\n        - SimpleJSON, Copyright (c) 2012-2017 Markus Göbel (Bunny83)\n        - Websocket, Copyright (c) 2010-2019 sta.blockhead\n        - YamlDotNet Copyright (c) 2008, 2009, 2010, 2011, 2012, 2013, 2014 Antoine Aubry and contributors\n        - LiteNetLib, Copyright (c) 2019 Ruslan Pyrch\n        - SharpZipLib, Copyright (c) 2010-2018 SharpZipLib Contributors\n        - JsonDotNet, Copyright (c) 2007 James Newton-King\n        - streetscape.gl, Copyright (c) 2019 Uber Technologies, Inc.\n        - STL Importer (pb_Stl), Copyright (c) 2016 Karl Henkel\n        - Docker.DotNet, Copyright (c) .NET Foundation and Contributors\n        - websocket-sharp, Copyright (c) 2010-2021 sta.blockhead\n\n-----------------------------------------------------------------------------\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\n-----------------------------------------------------------------------------\n                  Boost Software License - Version 1.0\n        applies to: \n        - Clipper, Copyright (c) 2010-2014 Angus Johnson\n-----------------------------------------------------------------------------\n\nBoost Software License - Version 1.0 - August 17th, 2003\n\nPermission is hereby granted, free of charge, to any person or organization\nobtaining a copy of the software and accompanying documentation covered by\nthis license (the \"Software\") to use, reproduce, display, distribute,\nexecute, and transmit the Software, and to prepare derivative works of the\nSoftware, and to permit third-parties to whom the Software is furnished to\ndo so, all subject to the following:\n\nThe copyright notices in the Software and this entire statement, including\nthe above license grant, this restriction and the following disclaimer,\nmust be included in all copies of the Software, in whole or in part, and\nall derivative works of the Software, unless such copies or derivative\nworks are solely in the form of machine-executable object code generated by\na source language processor.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT\nSHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE\nFOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.\n"
        },
        {
          "name": "PRIVACY",
          "type": "blob",
          "size": 17.1572265625,
          "content": "PRIVACY POLICY\n\nWelcome to the Privacy Policy of SVL Simulator (“SVL”). For purposes of this Privacy Policy, “We” or “Us” refers to SVL Simulator and “You” and “Your” refer to You, the individual accessing, browsing, or registering to use the Simulator Services or website (https://www.svlsimulator.com), or Your employer or other entity for whose benefit You act, as applicable (collectively “User”). This Privacy Policy sets forth SVL’s policy with respect to information collected, used, and disclosed about You. This page also informs You about the choices You have with respect to Your information. Simulator Services is not defined in our Privacy Policy and shall have the same meaning as ascribed in the Terms of Use. \nYour use of the Simulator Services is also subject to the Terms of Use https://www.svlsimulator.com/terms.\n\n\n1.\tWhat Personal Data We Collect About You\n\nWe collect Personal Data from visitors to the website and when You register for the Simulator Services Personal Data is information that identifies, relates to, describes, is capable of being associated with, or could reasonably be linked, directly or indirectly, to You personally or Your household. SVL collects and stores the Personal Data that You have provided to Us voluntarily. We also collect Personal Data automatically via the website. If You provide Personal Data to our website You acknowledge and agree that such Personal Data may be transferred to the office and servers of SVL and its subsidiaries, direct and indirect parent, and affiliates located in the United States and the Republic of Korea. We collect the following Personal Data via the website including:\n - \tFirst and last name.\n -\tEmail address. \n -\tCompany or Organization.\n -\tRole in Company. \n -\tLocation information.\n -\tDemographics.\n -\tUsage statistics that include but are not limited to customizations to maps, vehicles, environments, and other assets, time and duration of executing program, information about third party content brought in by You to the Simulator Services.\n -\tInternet Protocol (IP) address – Your IP address is a number that lets computers attached to the Internet know where to send Your data – such as the webpages You view or SVL Simulator You run on Your computer.\n -\tCookies – “cookie” is a small text file that may be used to collect information about Your activity on the website. For example, when someone visits a page within the website, a cookie is placed on the user’s machine (if the user accepts cookies) or is read if the user has visited the website previously. Please see Section 5 below for additional information regarding our use of Cookies. \n\nWe also collect information that does not identify you personally, such as aggregated data, demographic information, statistical information, age, location, gender or interests. If We combine this information with Personal Data, We will treat the resulting data as Personal Data.\n\n\n2.\tHow We Use Personal Data We Collect About You\n\nWe use Your Personal Data that is collected on this website and through the Simulator Services primarily for the following purposes:\n -\tTo deliver our services;\n -\tTo ensure the website is relevant to Your needs;\n -\tTo ensure our website is functioning properly and prevent technical issues;\n -\tTo help Us create and publish content most relevant to You;\n -\tTo collect analytics information pertaining to use of the website, including traffic, usage, and download trends\n -\tTo notify You about a material change to this Privacy Policy or the Terms of Use Agreement, if necessary;\n -\tTo track and analyze aggregate usage and volume statistical information from our visitors and customers to gather analysis or valuable information so that We can improve our services and products;\n -\tTo monitor the usage of our website and Simulator Services;\n -\tTo provide You with news, offers, and general information about our Simulator Services and related products, with your consent where required;\n -\tTo contact You in response to inquiries;\n -\tTo maintain the accuracy of our records;\n -\tAs otherwise permitted by applicable law.\n -\tTo share data As Permitted by this Agreement\n\n\n3.\tHow We Retain Your Personal Data\n\nSVL keeps Your Personal Data for as long as appropriate to maintain Your account, fulfill Your requests, for legal compliance and enforcement purposes, to resolve disputes, and prevent fraud. Actual retention periods will depend on the product or service being used, Users control over the information they voluntarily provide, and the type and sensitivity of the Personal Data. \nWhen we delete electronic data files, we employ technical methods to destroy such files so that the data cannot be restored or reconstructed. For hard copies and paper documents, we destroy them through shredding.\n\n\n4.\tHow We Share Your Data\n\nSVL may share Your Personal Data with third parties outside SVL such as its affiliates (subsidiaries, indirect or direct parents, and corporate affiliates), and third-party analytics platforms in the course of providing You with services that have been requested by You, or so that We can ensure our services and products are meeting Your needs. SVL is responsible for the management of your Personal Data shared with affiliates and other third-parties described in this section. Where required by applicable law, you can obtain a list of third-parties processing your Personal Data by contacting us at contact@svlsimulator.com. See Section 8(A) below. For example: \n - \tIn some instances SVL may be required to transfer Your Personal Data to our parent company in the Republic of Korea to provide You with a service requested by You. \n -\tWe may also share data such as cookies and log files with third-party analytics platforms for purposes described in “How We Use Personal Data Collected About You.” We may also send aggregate and anonymized data to these entities for the purposes described above. \n - \tWe may be required to share Your Personal Data where We are required to do so by law or subpoena or if We believe is necessary to (a) conform to the requirements of law or comply with legal process served on Us; (b) protect and defend our rights or property, including the rights and property of SVL; (c) and/or act in urgent circumstances to protect the personal safety of our end users.\n\n\n5.\tCookies and Other Similar Technologies\n\nWe, and third-parties We allow, use cookies on our website. We may use session cookies or persistent cookies. Session cookies only last for the specific duration of Your visit and are deleted when You close Your browser. Persistent cookies remain on Your device’s hard drive until You delete them or they expire. Cookies may be used to track users across the web. Different cookies are used to perform different functions, which we explain below:\n - \tEssential. Some cookies are essential in order to enable You to move around our website and use its features, such as accessing secure areas of our website. Without these cookies, We cannot enable appropriate content based on the type of device You are using.\n -\tBrowsing and Functionality. These cookies remember choices You make on our website. For example, when You return to our website, these cookies help remember Your preferences.\n -\tAnalytics. These cookies collect information about how You use our website, for instance which pages You go to most often, and if You get any error messages. \n \nYou can set Your browser not to accept cookies. Additionally, You can disable or delete similar data used by browser add-ons, such as Flash cookies, by changing the add-on's settings or visiting the web site of its manufacturer. Because cookies allow You to take advantage of some of our essential features, we recommend that You leave them turned on. However, if You opt out of cookies, some of our website features may not function as a result. \n\n\n6.\tCalifornia Privacy Rights\n\nThis section supplements the terms of this Privacy Policy. We adopt this section to comply with the California Consumer Privacy Act of 2018 (“CCPA”). As of January 1, 2020 California residents have specific rights regarding their Personal Data. California residents are entitled to the following rights:\n\nThe right of access and data portability – You have the right to request that We disclose certain information to You about our collection and use of Your Personal Data over the past twelve (12) months. You also have the right to request information about our sale or disclosure for business purposes of Your Personal Data to third parties.\n\nThe right to request deletion of data – You have the right to request that We delete any Personal Data We have collected from You and retained, subject to certain exceptions. If You wish to exercise this right, please email your consumer request to contact@svlsimulator.com. We may request additional information from you to verify your request. Please note that this does not ensure complete removal of Your Personal Data if the information is necessary to provide You with the Simulator Services or required by law or subpoena.\n\nOnly You or a person registered with the California Secretary of State authorized to act on Your behalf may send a consumer request. You may also make a consumer request on behalf of Your minor child. You may only make two consumer request for access or data portability within a twelve (12) month period.  Please note that You are not required to create an account with Us to make a consumer request. The consumer request must:\n -\tProvide sufficient information that allows SVL to reasonably identify You are the person whom We collected Personal Data or an authorized representative.\n -\tDescribe Your request with sufficient detail that allows Us to evaluate and respond to it. \n\nWe endeavor to respond to a consumer request within forty-five (45) days of its receipt. If We require more time, up to ninety (90) days, We will inform You of the reasons and extension period in writing.\n\nThe right to opt-out of the sale of data. You have the right to request to opt-out of the sale of Your Personal Data to third-parties. You can exercise this right through the “Do Not Sell My Personal Information” link in the footer of our website, when such link becomes available on January 1, 2020.\n\nThe right to not be discriminated against. You have the right to not be discriminated against for exercising any of these rights granted to You under the CCPA.\nCalifornia “Shine the Light Law” – California Civil Code Section § 1798.83 permits Users of our website that are California residents to request, once a year, certain information regarding our disclosure of Personal Data to third parties for their direct marketing purposes. To make a request, please send an email to contact@svlsimulator.com with “Shine the Light” in the subject line. \n\n\n7.\tData Protection Rights Under GDPR\n\nIf You are visiting or registering for this website as a resident of the European Economic Area (EEA), You have certain data protection rights. You may contact Us about what Personal Data We collect about You and if You want to be removed from our systems. SVL would like to make sure You are fully aware of all of Your data protection rights. EEA users are entitled to the following:\nThe right to access – You have the right to request SVL for copies for Your Personal Data. \nThe right to rectification – You have the right to request that SVL correct any Personal Data You believe is inaccurate. You also have the right to request SVL complete the Personal Data You believe is incomplete. \nThe right to erasure – You have the right to request that SVL erase Your Personal Data, under certain conditions. \nThe right to restrict processing – You have the right to request that SVL restrict the processing of Your Personal Data, for legitimate reasons. \nThe right to data portability – You have the right to request that SVL transfer the Personal Data that We have collected to another organization, or directly to You, under certain conditions.\nThe right to lodge a complaint – You have the right to lodge a complaint with Your relevant data protection authority.\nIf You make a request, We have one month to response to You. If You wish to exercise one or more of these rights, please contact Us at contact@svlsimulator.com. \n\n\n8.\tData Processing\n\nSVL will only process Personal Data of EEA residents in accordance with the User’s explicit consent unless processing is required by the European Union or Member state to which SVL may be subject, in which case SVL will inform the User of the legal requirement before processing the Personal Data. The term “Process” and “Processer” in this section shall have the same meaning as defined in the GDPR.\n\nA.  Transferring Personal Data\n\nUser agrees that SVL may use Processors to Process Personal Data. A complete list is available upon request.\n\n\n9.\tInternational Data Transfers\n\nWe are based and store our data in the US. If You choose to provide us with Personal Data, please understand that Your Personal Data may be transferred to the US and that we may transfer that data to our affiliates and subsidiaries or to other third parties, across borders, and from Your country or jurisdiction to other countries or jurisdictions around the world. If You are visiting from the EU or other regions with laws governing data collection and use that may differ from US law, please note that You are transferring your Personal Data to the US and other jurisdictions which may not have the same data protection laws as the EU. We put in place appropriate operational, procedural and technical measures in order to ensure the protection of Your Personal Data. You acknowledge You understand that by providing your Personal Data: (i) Your Personal Data will be used for the uses identified above in accordance with this Privacy Policy; and (ii) Your Personal Data may be transferred to the US and other jurisdictions as indicated above, in accordance with applicable law.\n\n\n10.\tYour Choices\n\nWe would like to send You information about products and services that may interest You. If You have agreed to receive marketing, You may always opt out at a later time. If You no longer wish to be contacted for marketing purposes please contact Us at contact@svlsimulator.com or follow the “unsubscribe” link in the marketing communication. We will process your request as soon as possible in accordance with applicable law, but please be aware that in some circumstances you may receive a few more messages until your unsubscribe is processed.\nYou may update Your account information and email-communication preferences at any time by contacting us at contact@svlsimulator.com. Please note that You may not opt out of SVL service related communications like account verification, changes and updates to the Simulator Services, technical and security notices. These communications will be primarily informational in nature, rather than promotional.\n\n\n11.\tLinks to other sites\n\nThis Privacy Policy applies solely to Personal Data collected on the website and through the Simulator Services. The website may contain links to other web sites. We are not responsible for the privacy practices or the content of these other web sites. Any third party links do not imply that SVL endorsees or reviews third party websites. Please refer to the privacy policies on these other web sites to see how these third parties collect and handle your Personal Data.\n\n\n12.\tChildren’s Privacy\n\nSVL does not knowingly collect Personal Data from anyone under the age of 13 in the US or 16 in the EU. If You are under 13 in the US or under 16 in the EU please do not attempt to register on the website or send Us any Personal Data. \n\n\n13.\tChanges to the Privacy Policy\n\nWe reserve the right to change this Privacy Policy from time to time in our sole discretion. When We do, We will also revise the “last update” date at the top of this Privacy Policy. In the event We make material changes to the Privacy Policy, we will notify you via a prominent notice on the website and/or via email at the email address we have on file for you. \n\n\n14.\tSecurity\n\nNo data transmissions over the Internet can be guaranteed to be 100% secure. Consequently, We cannot ensure or warrant the security of any Personal Data You transmit to Us and You understand that any Personal Data that You transfer to LGEUS is done at Your own risk. Once We receive Your transmission, We make commercially reasonable efforts to ensure security on our systems. If We learn of a security systems breach We may attempt to notify You electronically so that You can take appropriate protective steps. By using this website or providing Personal Data to Us, You agree that We can communicate with You electronically regarding security, privacy and administrative issues relating to Your use of the website. We may post a notice on our website if a security breach occurs. We may also send an email to You at the email address You have provided to Us in these circumstances. Depending on where You live, You may have a legal right to receive notice of a security breach in writing.\n\n\n15.\tAssignment\n\nIn the event of any direct or indirect reorganization process including, but not limited to, mergers, acquisitions and sales of all or substantially all of our assets, You grant us the right to assign the Personal Data collected via the website and Simulator Services.\n\n\n16.\tContact Us\n\ncontact@svlsimulator.com\n5150 Great America Parkway\nSanta Clara, CA 95054\n\n"
        },
        {
          "name": "Packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "ProjectSettings",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.5654296875,
          "content": "<h1 align=\"center\">SVL Simulator:  An Autonomous Vehicle Simulator</h1>\n\n<div align=\"center\">\n<a href=\"https://github.com/lgsvl/simulator/releases/latest\">\n<img src=\"https://img.shields.io/github/release-pre/lgsvl/simulator.svg\" alt=\"Github release\" /></a>\n<a href=\"\">\n<img src=\"https://img.shields.io/github/downloads/lgsvl/simulator/total.svg\" alt=\"Release downloads\" /></a>\n</div>\n<div align=\"center\">\n  <h4>\n    <a href=\"https://svlsimulator.com\" style=\"text-decoration: none\">\n    Website</a>\n    <span> | </span>\n    <a href=\"https://svlsimulator.com/docs\" style=\"text-decoration: none\">\n    Documentation</a>\n    <span> | </span>\n    <a href=\"https://github.com/lgsvl/simulator/releases/latest\" style=\"text-decoration: none\">\n    Download</a>\n  </h4>\n</div>\n\n## Sunsetting SVL Simulator\n\n### LG has made the difficult decision to suspend active development of SVL Simulator, as of January 1, 2022.\n\nThere are no plans for any new or bugfix releases of SVL Simulator in 2022. There will be no new source code changes pushed to GitHub, and there will be no reviews or merging of Pull Requests submitted on GitHub for SVL Simulator or any of its related plug-ins. There will be no new simulator assets built and shared nor updates made to existing assets by the SVL Simulator team.\n\nWe will make a reasonable effort to keep the [wise.svlsimulator.com](https://wise.svlsimulator.com) website up and running through at least Thursday, June 30, 2022, and will also maintain the [SVLSimulator.com](https://SVLSimulator.com) web site including the [simulator documentation](https://www.svlsimulator.com/docs/) pages through at least Thursday, June 30, 2022.\n\nAt this time we do not plan to remove the [SVL Simulator source code](https://github.com/lgsvl/simulator) (and related plug-in) projects from GitHub. The open source project and source code will remain available for anyone who wants to build (or modify) SVL Simulator.\n\nWe apologize for any inconvenience this may cause and appreciate your understanding.\n\nSincerely,\n\nThe SVL Simulator team\n\n<br/>\n\n### Questions\n\n##### **Q: Will SVL Simulator run locally without the [wise.svlsimulator.com](https://wise.svlsimulator.com) web site?**\n\nA: The latest released version of SVL (2021.3) requires the use of the WISE (web user interface) cloud service to download assets, configure simulation clusters, and create and launch simulations. It may be possible to remove this dependency (e.g. in a fork; see below) and then build and launch a local simulator instance.\n\n##### **Q: Will LG release the source code for the WISE (web user interface) cloud service?**\n\nA: There are no plans at this time to release the source code for WISE.\n\n##### **Q: Would LG be interested in transferring the SVL Simulator project to someone interested in taking over the project?**\n\nA: There are no plans at this time to transfer the SVL Simulator project (or the WISE cloud service).\n\n##### **Q: Will the Simulator Software License Agreement be changed?**\n\nA: There are no plans at this time to change the [Simulator Software License Agreement](https://github.com/lgsvl/simulator/blob/master/LICENSE).\n\n##### **Q: Can users share source code changes and forks of SVL Simulator?**\n\nA: As a GitHub project, anyone is able to create their own fork; in fact, there are already over 500 such forks of the [SVL Simulator project](https://github.com/lgsvl/simulator). Users can then make changes and even submit pull requests back to the original (parent) project. While we have no plans to review or merge such changes into the main project, users are free to review open PRs and create their own local build from their own or any other public fork.\n\n##### **Q: Can users share new builds of SVL Simulator?**\n\nA: The [Simulator Software License Agreement](https://github.com/lgsvl/simulator/blob/master/LICENSE) allows you to “modify or create derivative works of the Licensed Materials” and only restricts their commercial use. Therefore, it is ok for users to share new builds of SVL Simulator as long as such builds are not sold or otherwise used for commercial purposes.\n\n##### **Q: What about the SVL Simulator Premium product and/or cloud simulation service?**\n\nA: There are no plans at this time to offer a SVL Simulator Premium product or cloud service.\n\n##### **Q: Can users still post technical questions on GitHub?**\n\nA: Technical questions may be posted to the [SVL Simulator Issues](https://github.com/lgsvl/simulator/issues) page on GitHub but may not be answered by the SVL Simulator team. We encourage users to help each other with questions or issues that are posted.\n\n##### **Q: What if there are other questions not addressed in this document?**\n\nA: Other questions may be posted to the [SVL Simulator Issues](https://github.com/lgsvl/simulator/issues) page on GitHub.\n\n<br/>\n\n------ \n# Project README\n\n## Stay Informed\n\nCheck out our latest [news](https://www.svlsimulator.com/news/) and subscribe to our [mailing list](http://eepurl.com/htlRjH) to get the latest updates.\n\n\n## Introduction\n\nLG Electronics America R&D Lab has developed an HDRP Unity-based multi-robot simulator for autonomous vehicle developers. \nWe provide an out-of-the-box solution which can meet the needs of developers wishing to focus on testing their autonomous vehicle algorithms. \nIt currently has integration with The Autoware Foundation's [Autoware.auto](https://gitlab.com/autowarefoundation/autoware.auto/AutowareAuto) and Baidu's [Apollo](https://github.com/ApolloAuto/apollo) platforms, can generate HD maps, and can be immediately used for testing and validation of a whole system with little need for custom integrations. \nWe hope to build a collaborative community among robotics and autonomous vehicle developers by open sourcing our efforts. \n\n*To use the simulator with Apollo 6.0 or master, first download the simulator binary, then follow our [Running with latest Apollo](https://www.svlsimulator.com/docs/system-under-test/apollo-master-instructions/) docs.*\n\n*To use the simulator with Autoware.auto, first download the simulator binary, then follow the guide on our [Autoware.auto](https://autowarefoundation.gitlab.io/autoware.auto/AutowareAuto/lgsvl.html).*\n\nFor users in China, you can view our latest videos [here](https://space.bilibili.com/412295691) and download our simulator releases [here](https://pan.baidu.com/s/1M33ysJYZfi4vya41gmB0rw) (code: 6k91).\n对于中国的用户，您也可在[哔哩哔哩](https://space.bilibili.com/412295691)上观看我们最新发布的视频，从[百度网盘](https://pan.baidu.com/s/1M33ysJYZfi4vya41gmB0rw)(提取码: 6k91)上下载使用我们的仿真器。\n\n\n## Paper\nIf you are using SVL Simulator for your research paper, please cite our ITSC 2020 paper:\n[LGSVL Simulator: A High Fidelity Simulator for Autonomous Driving](https://arxiv.org/pdf/2005.03778)\n\n```\n@article{rong2020lgsvl,\n  title={LGSVL Simulator: A High Fidelity Simulator for Autonomous Driving},\n  author={Rong, Guodong and Shin, Byung Hyun and Tabatabaee, Hadi and Lu, Qiang and Lemke, Steve and Mo{\\v{z}}eiko, M{\\=a}rti{\\c{n}}{\\v{s}} and Boise, Eric and Uhm, Geehoon and Gerow, Mark and Mehta, Shalin and others},\n  journal={arXiv preprint arXiv:2005.03778},\n  year={2020}\n}\n```\n\n\n\n## Getting Started\n\nYou can find complete and the most up-to-date guides on our [documentation website](https://www.svlsimulator.com/docs).\n\nRunning the simulator with reasonable performance and frame rate (for perception related tasks) requires a high performance desktop. Below is the recommended system for running the simulator at high quality. We are currently working on performance improvements for a better experience. \n\n**Recommended system:**\n\n- 4 GHz Quad Core CPU\n- Nvidia GTX 1080, 8GB GPU memory\n- Windows 10 64 Bit\n\nThe easiest way to get started with running the simulator is to download our [latest release](https://github.com/lgsvl/simulator/releases/latest) and run as a standalone executable.\n\nCurrently, running the simulator in Windows yields better performance than running on Linux. \n\n### Downloading and starting simulator\n\n1. Download the latest release of the SVL Simulator for your supported operating system (Windows or Linux) here: [https://github.com/lgsvl/simulator/releases/latest](https://github.com/lgsvl/simulator/releases/latest)\n2. Unzip the downloaded folder and run the executable.\n\nSee the full installation guide [here](https://svlsimulator.com/docs/installation-guide/installing-simulator).\n\n### Building and running from source\n\nIf you would like to customize the simulator, build simulation content, or access specific features available in [Developer Mode](https://www.svlsimulator.com/docs/running-simulations/developer-mode), you can clone the project with Unity Editor, and build the project from source.\n\nCheck out our instructions for getting started with building from source [here](https://www.svlsimulator.com/docs/installation-guide/build-instructions).\n**Note:** Please checkout the \"release-*\" branches or release tags for stable (ready features) and \"master\" branch for unstable (preview of work in progress).\n\n\n## Simulator Instructions (from 2021.1 release onwards)\n\n1. After starting the simulator, you should see a button to \"Link to Cloud\".\n2. Use this button to link your local simulator instance to a [cluster](https://www.svlsimulator.com/docs/user-interface/web/clusters-tab) on our [web user interface](https://wise.svlsimulator.com).\n3. Now create a [random traffic](https://www.svlsimulator.com/docs/creating-scenarios/random-traffic-scenarios/) simulation. For a standard setup, select \"BorregasAve\" for map and \"Jaguar2015XE with Apollo 5.0 sensor configuration\" for vehicle. Click \"Run\" to begin.\n4. The vehicle should spawn inside the map environment that was selected.\n5. Read [here](https://www.svlsimulator.com/docs/user-interface/keyboard-shortcuts/) for an explanation of all current keyboard shortcuts and controls.\n6. Follow the guides on our respective [Autoware](https://github.com/lgsvl/Autoware) and [Apollo 5.0](https://github.com/lgsvl/apollo-5.0) repositories for instructions on running the platforms with the simulator.\n\n**NOTE**: If using a release older than \"2021.1\", please follow the instructions on our documentation [archives](https://www.svlsimulator.com/docs/archive/).\n\n### Guide to simulator functionality\n\nLook [here](https://www.svlsimulator.com/docs) for a guide to currently available functionality and features.\n\n\n\n## Contact\n\nPlease feel free to provide feedback or ask questions by creating a Github issue. For inquiries about collaboration, please email us at [contact@svlsimulator.com](mailto:contact@svlsimulator.com).\n\n\n\n## Copyright and License\n\nCopyright (c) 2019-2021 LG Electronics, Inc.\n\nThis software contains code licensed as described in LICENSE.\n"
        },
        {
          "name": "config.yml.template",
          "type": "blob",
          "size": 0.1220703125,
          "content": "headless: false\nread_only: false\napi_hostname: \"localhost\"\napi_port: 8181\ncloud_url: \"https://wise.preview.svlsimulator.com\"\n"
        }
      ]
    }
  ]
}