{
  "metadata": {
    "timestamp": 1736710913336,
    "page": 521,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "SlightlyMad/VolumetricLights",
      "stars": 2061,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0322265625,
          "content": "*.sln\nLibrary\nTemp\n*.suo\n*.csproj"
        },
        {
          "name": "Assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.453125,
          "content": "Copyright (c) 2016, Michal Skalsky\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of VolumetricLights nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "ProjectSettings",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.2783203125,
          "content": "# Volumetric Lights for Unity 5\n[![IMAGE ALT TEXT HERE](https://bqu2ya.dm1.livefilestore.com/y4mSxIn4D7Zx9td_2NWn3yZu8UxWeqJKN4qdciZ0fCqO9ox290xR837Moux6HnPpWPkF8mi7oY26ZNF7n0eJfbPMNoBTtrMraKnghJ4XF13tCK2bBPybZVudlL1UU_gBkFyY7lt30UYbVJ-EZVaV2Z8C1DglijmBYelQfJyplssFe7oSklBvneGtDlhwDv1dougv2ZpHmipfzYRuR6fLeawlQ?width=1167&height=653&cropmode=none)](https://www.youtube.com/watch?v=JPxLCYXB-8A) [![IMAGE ALT TEXT HERE](https://agu0ya-dm2305.files.1drv.com/y4mnqQ4pzhZdF4k3Z7Fv_QApimv9POLR1ShQPoNg8wtUf7TzqFdWLY6Y8bxtyJhGQNRe8NLvy1GGoZsorNssr2h6fTsAfyi-F2LOIA4wzNY_7cS-1iEjVHyOCyOCTA0_8na3cmWvQ34gHBfyXOxxE6AZIjaVwCemZP7kSwaUNoNDyCPsCkx8vsdmxuwmuVcrH1rYblmFCaVH5za_EsrqM-qJA?width=1167&height=650&cropmode=none)](https://www.youtube.com/watch?v=ElaPJyzR504)\n\nOpen source (BSD) extension for built-in Unity lights. It uses ray marching in light's volume to compute volumetric fog. This technique is similar to the one used in Killzone ([GPU Pro 5](http://www.amazon.com/GPU-Pro-Advanced-Rendering-Techniques/dp/1482208636): Volumetric Light Effects in Killzone Shadow Fall by Nathan Vos)\n\nCorresponding thread in Unity Forum can be found [here](http://forum.unity3d.com/threads/true-volumetric-lights-open-source-soon.390818/).\n\n### Demo Project\nI developed this technology for my hobby project. It was never meant for real use and it is therefore little rough around the edges.\n\nYou can see the demo on [Youtube](https://www.youtube.com/watch?v=JPxLCYXB-8A).\nOr you can try it for yourself: [Binary download](https://onedrive.live.com/redir?resid=D65A46249BFF9056!40295&authkey=!AAK3X7BJ_nr3IhE&ithint=file%2czip)\n### Features\n* Volumetric fog effect for multiple lights. Point, spot  and directional lights are fully supported.\n* Volumetric shadows\n* Volumetric light cookies\n* Volumetric noise implemented as animated 3D texture.\n\n### Usage\n* Add VolumetricLightRenderer script to your camera and set default cookie texture for spot light.\n* Add VolumetricLight script to every light that you want to have volumetric fog.\n\nVolumetric lights will respect standard light's parameters like color, intensity, range, shadows and cookie. There are also additional parameters specific for volumetric lights. For example:\n* Sample count - number of raymarching samples (trade quality for performance)\n* Scattering Coef - scattering coefficient controls amount of light that is reflected towards camera. Makes the effect stronger.\n* Extinction Coef - controls amount of light absorbed or out-scattered with distance. Makes the effect weaker with increasing distance. It also attenuates existing scene color when used with directional lights.\n* Skybox Extinction Coef - Only affects directional light. It controls how much skybox is affected by Extinction coefficient. This technique ignores small air particles and decreasing particle density with altitude. That often makes skybox too \"foggy\". Skybox extinction coefficient can help with it.\n* MieG - controls mie scattering (controls how light is reflected with respect to light's direction)\n* Height Fog - toggle exponential height fog\n* Height Fog Scale - scale height fog\n* Noise - enable volumetric noise\n* Noise Scale - noise scale\n* Noise Speed - noise animation speed\n\nSeveral sample scenes are part of this project.\n\n#### Building a standalone player\n**_IMPORTANT_** - Standalone player will work only if all shaders are included in build! All shaders must be added into \"Always Included Shaders\" in ProjectSettings/Graphics.\n\n#### Example scene with different parameters\n* Low/High Scattering and Extinction parameters\n![](https://agu1ya-dm2306.files.1drv.com/y4mgo5ud5huq-SUjw4z8gGjB_pnFcs5Le8t64E29kCLJ7WVPpmPLo79oi0BI2YPe6mCMiNOIAZnVNorlBrk6hULgNHbpWGmvLgFOnWEFbj1sRnDP6ml9WXuAFYmH9HZ68DKvTZpjU5VPEDNVRtl2UtsQMDJkR-T0N3V2CirkmHtGKATppk2FI5ffRgdRyEiKErUnEpZjhPk610xZS7JxaeLOA?width=2338&height=650&cropmode=none)\n* Low/High Mie G parameter\n![](https://agupya-dm2pap001.files.1drv.com/y4mobk9viWO3q53gQlSGj7LiWmEt72ezfHqnMFYTziSGr2UBFEoIXgbTNZEfbrtG-Arznyc-6V19FunkGzO9K87fXVCI9EnYRAiFyHmmpBGrhPrl_pmpE-y_b01FJJdXLZ6GfGkzjd8Zr6CB8Ity2QYHWizx2saq8ZHPwG8fdajjUUQPSLO9nsY7irPHiGzXt846gJml1rK4QA5aGpMC13_3A?width=2338&height=650&cropmode=none)\n* High/Low Shadow Strength. This technique uses single scattering model. That makes areas in shadow unnaturally dark. Use Shadow Strength to \"simulate\" multiple scattering.\n![](https://aguqya-dm2305.files.1drv.com/y4mQZxpA5UbrBUPIMo44IfWCpDPdJmn4kEdFab0EuyQVNXdfYIWG4v-nnmU4M0nSCcUpE8sLgq-DV5I21QMk3oDt-rS8o8SlahBJ6TKxVk-ejvmPZUojx9BDMrjzSjfYvy6eQxtMF9ksV2bYZqQOCNPYJmvp5TFzR_fP7aJv7XJhJ2tP3ioLLCenF5sBiuR1p5anj915BAl6vAi0n4iX0v53w?width=2338&height=650&cropmode=none)\n* Height fog with different scale\n![](https://bqu4ya.dm2302.livefilestore.com/y4mmmE_KTmAE9MRLeoYFM3wkJZk7hVmA2rh6P4qPWDYv3p3w6kMwzSFnKkSjUir0LAf9YIRDsR_lUsd85dud97TtlHB03vwAtAJSViYPkzYo_IcqBcH87NENZM6lawDtOJaxorQhC0XMade8rVcGHKTPftLIV4E1OYHSKfqNCiNoNTJ2ezc3qwRtEFq4580Z-VsHIoo1eZZIgqyrN-cQr96hw?width=2338&height=650&cropmode=none)\n* High/Low Skybox Extinction parameter\n![](https://bqu3ya.dm2302.livefilestore.com/y4mxWdkqeJLzQKmg9OI8Xd2PwtzTYi0M5s7TlIcVkOeLHWeEXz_OXSKSAEduhc4MQnC6rajZ1bWSxbKvJLRYj5GpHPAZu1fPijrKAfCg3nat0laIP06t5A6yIljMAd8yi7U0a_0ri0ipRhkW0Ep8d3gLqSFDppSvxrVQ4UgPJhSHJPGItDPbeM7wvHBxxrhcRWTlv2VQqqSG6_6hCxcLmh-fw?width=2338&height=650&cropmode=none)\n\n### Rendering resolution\nVolumetric fog can be rendered in smaller resolution as an optimization. Set rendering resolution in VolumetricLightRenderer script.\n* Full resolution - best quality, poor performance. Serves as a \"ground truth\".\n* Half resolution - best quality/performance ratio.\n* Quarter resolution - experimental. Worse quality, best performance.\n\n### Requirements\n* Unity 5 (tested on 5.3.4, 5.4 and 5.5)\n* DirectX 10/11 or OpenGL 4.1 and above\n* Tested on Windows and Mac but it should work on other platforms as well\n* VR isn't supported\n* Mobile devices aren't supported\n\n### Known Limitations\n* ~~Currently requires HDR camera and deferred renderer~~\n* ~~Currently requires DirectX 11~~\n* Doesn't handle transparent geometry correctly (cutout is ok)\n* 3d noise texture is hard coded. VolumetricLightRenderer has custom dds file loader that loads one specific 3d texture (Unity doesn't support 3d textures loaded from file). File \"NoiseVolume.bytes\" has to be in Resources folder.\n* Shadow fading is not implemented\n* Parameters and thresholds for bilateral blur and upscale are hard-coded in shaders. Different projects may need different constants. Look into BilateralBlur.shader. There are several constants at the beginning that control downsampling, blur and upsampling. \n\n### Technique overview\n* Create render target for volumetric light (volume light buffer)\n* Use CameraEvent.BeforeLighting to clear volume light buffer\n* For every volumetric light render light's volume geometry (sphere, cone, full-screen quad)\n  * Use LightEvent.AfterShadowMap for shadow casting lights​\n  * Use CameraEvent.BeforeLighting for non-shadow casting lights​\n  * Perform raymarching in light's volume​\n    * Dithering is used to offset ray origin for neighbouring pixels​\n* Use CameraEvent.AfterLighting to perform depth aware gaussian blur on volume light buffer\n* Add volume light buffer to Unity's built-in light buffer\n\n### Possible improvements\n* Light's volume geometry is unnecessarily high poly\n* Ray marching is performed in view space and every sample is then transformed to shadow space. It would be better to perform ray marching in both spaces simultaneously.\n* Add temporal filter to improve image quality and stability in motion. Change sampling pattern every frame to get more ray marching steps at no additional cost (works only with temporal filter)\n* Bilateral blur and upscale can be improved\n* I didn't try to optimize the shaders, there is likely room for improvement.\n \n### Donations\nI've been asked about donation button several times now. I don't feel very comfortable about it. I don't need the money. I have a well paid job. It could also give the impression that I would use the money for further development. But that is certainly not the case. \n\nBut if you really like it and you want to brighten my day then you can always buy me a little gift. Send me [Amazon](https://www.amazon.com/Amazon-Amazon-com-eGift-Cards/dp/BT00DC6QU4) or [Steam](https://www.paypal-gifts.com/uk/brands/steam-digital-wallet-code.html) gift card and I'll buy myself something shiny. You can find my email in my profile. \n"
        }
      ]
    }
  ]
}