{
  "metadata": {
    "timestamp": 1736710910142,
    "page": 513,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "aws/aws-sdk-net",
      "stars": 2080,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.22265625,
          "content": "README.md merge=overridegenerated\nsdk/*.sln merge=overridegenerated\nsdk/*.FxCop merge=overridegenerated\nsdk/code-analysis/AWSCodeAnalysisTestExtension/* merge=overridegenerated\nsdk/test/UnitTests/*.csproj merge=overridegenerated"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.2822265625,
          "content": "######################################\n# Visual Studio per-user settings data\n######################################\n*.suo\n*.user\n**/.idea/**\n\n####################\n# Build/Test folders\n####################\n\n**/bin/\n**/obj/\n**/TestResults/\n**/Temp/\n**/buildlogs/\n**/.vs/\n\n**/*project.lock.json\n**/project.lock.json\n**/*.nuspec\n\nsdk/packages/**\nsdk/test/PCLTests/AndroidTests/packages/**\nsdk/.vs/**\n\n**/fxcop-report-*.xml\n\ndocgenerator/.vs/**\n\nDeployment/**\nNuGetDownloads/**\nDocDeployment/**\nDocBuildAssemblies/**\nInclude/**\n\n**/*.userprefs\n/sdk/test/CrossPlatformTests/CommonTests/Resources/settings.json\npackages\n/sdk/test/Unity/Unity3DTests/Assets/Resources/settings.json\n/sdk/test/Unity/Unity3DTests/Assets/Resources/awsconfig.xml\n/sdk/test/Unity/Unity3DTests/Unity3DTests.CSharp.csproj\n/sdk/test/Unity/Unity3DTests/Unity3DTests.CSharp.Editor.csproj\n/sdk/test/Unity/Unity3DTests/Unity3DTests.sln\n/sdk/test/Unity/Unity3DTests/Library\n/sdk/test/Unity/Unity3DTests/Assets/SDK/*.dll\n/sdk/test/Unity/Unity3DTests/Assets/SDK/*.pdb\n\n*.bak\ngenerator/.vs/**\n*.mdb\n*.apk\n*.meta\n/sdk/test/Unity/AWSAndroidHelper/.settings\n/sdk/test/Unity3DTests/Assets/SDK/*.mdb\n\n**/*.partial.sln\n**/*.partial.FxCop\n**/*.partial.csproj\n\n.vscode\n\ncodesign-zip\n*.binlog\n/sdk/src/netsdk-*\n\nsdk/test/Performance/**/BenchmarkDotNet.Artifacts/*"
        },
        {
          "name": "License.txt",
          "type": "blob",
          "size": 8.958984375,
          "content": "Apache License\n\nVersion 2.0, January 2004\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n“License” shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.\n\n“Licensor” shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.\n\n“Legal Entity” shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, “control” means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n“You” (or “Your”) shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n“Source” form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.\n\n“Object” form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.\n\n“Work” shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).\n\n“Derivative Works” shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\n\n“Contribution” shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, “submitted” means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as “Not a Contribution.”\n\n“Contributor” shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.\n\n2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.\n\n4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:\n\nYou must give any other recipients of the Work or Derivative Works a copy of this License; and \n\nYou must cause any modified files to carry prominent notices stating that You changed the files; and \n\nYou must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and \n\nIf the Work includes a “NOTICE” text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License.\nYou may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.\n\n5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an “AS IS” BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.\n\n8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability.\n\nEND OF TERMS AND CONDITIONS"
        },
        {
          "name": "Notice.txt",
          "type": "blob",
          "size": 3.9404296875,
          "content": "The AWS SDK for .NET includes the following third-party software/licensing:\n\n** Json processing from LitJson\nAll the source code and related files distributed with this software have\nbeen dedicated to the public domain by the authors.\n\nAnyone is free to copy, modify, publish, use, compile, sell, or distribute\nthe software, either in source code form or as a compiled binary, for any\npurpose, commercial or non-commercial, and by any means.\n\n----------------\n\n** Parsing PEM files from Bouncy Castle\nCopyright (c) 2000 - 2017 The Legion of the Bouncy Castle Inc. (http://www.bouncycastle.org) \n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n----------------\n\n** Performing CRC32 checks from vbAccelerator.com\nvbAccelerator Software License\n\nVersion 1.0\n\nCopyright (c) 2002 vbAccelerator.com\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nThe end-user documentation included with the redistribution, if any, must include the following acknowledgment:\n\n\"This product includes software developed by vbAccelerator ( http://vbaccelerator.com/).\"\n\nAlternately, this acknowledgment may appear in the software itself, if and wherever such third-party acknowledgments normally appear.\nThe names \"vbAccelerator\" and \"vbAccelerator.com\" must not be used to endorse or promote products derived from this software without prior written permission. For written permission, please contact vbAccelerator through steve@vbaccelerator.com.\nProducts derived from this software may not be called \"vbAccelerator\", nor may \"vbAccelerator\" appear in their name, without prior written permission of vbAccelerator.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESSED OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY\nAND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL\nVBACCELERATOR OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\nNOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThis software consists of voluntary contributions made by many individuals on behalf of the vbAccelerator. For more information, please see http://vbaccelerator.com/ .\n\nThe vbAccelerator licence is based on the Apache Software Foundation Software Licence, Copyright (c) 2000 The Apache Software Foundation. All rights reserved."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 121.9736328125,
          "content": "# AWS SDK for .NET [![Gitter](https://badges.gitter.im/Join%20Chat.svg)](https://gitter.im/aws/aws-sdk-net?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\nThe **AWS SDK for .NET** enables .NET developers to easily work with [Amazon Web Services][aws] and build scalable solutions with Amazon S3, Amazon DynamoDB, Amazon Glacier, and more.\n\n* [API Docs][docs-api]\n* [AWS .NET Developer Blog][dotnet-blog]\n* [SDK Homepage][sdk-website]\n* [SDK Developer Guide](https://docs.aws.amazon.com/sdk-for-net)\n* [Forum][sdk-forum]\n* [GitHub Issues][sdk-issues]\n* [SDK Samples](https://github.com/awsdocs/aws-doc-sdk-examples/tree/main/dotnetv3)\n\n## Getting Help\n\nPlease use these community resources for getting help. We use the [GitHub issues][sdk-issues] for tracking bugs and feature requests and have limited bandwidth to address them.\n* Ask a question on [StackOverflow](http://stackoverflow.com/) and tag it with aws-sdk-net\n* Come join the AWS .NET community chat on [gitter](https://gitter.im/aws/aws-sdk-net)\n* Open a support ticket with [AWS Support](https://console.aws.amazon.com/support/home)\n* If it turns out that you may have found a bug, please open an [issue][sdk-issues]\n\n### Opening Issues\n\nIf you encounter a bug with AWS SDK for .NET we would like to hear about it. Search the existing [issues](https://github.com/aws/aws-sdk-net/issues?q=is%3Aissue) and try to make sure your problem doesn’t already exist before opening a new issue. It’s helpful if you include the version of AWS SDK .NET and the OS you’re using. Please include a stack trace and reduced repro case when appropriate, too.\n\nThe [GitHub issues][sdk-issues] are intended for bug reports and feature requests. For help and questions with using AWS SDK for .NET please make use of the resources listed in the Getting Help section. There are limited resources available for handling issues and by keeping the list of open issues clean we can respond in a timely manner.\n\n## SDK Change Log\n\nThe change log for the SDK can be found in the [SDK.CHANGELOG.ALL.md](https://github.com/aws/aws-sdk-net/blob/main/changelogs/SDK.CHANGELOG.ALL.md) file. Change logs divided up by year can be found in the [changelogs folder](https://github.com/aws/aws-sdk-net/tree/main/changelogs).\n\n## Maintenance and support for SDK major versions\n\nFor information about maintenance and support for SDK major versions and their underlying dependencies, see the following in the AWS SDKs and Tools Shared Configuration and Credentials Reference Guide:\n\n* [AWS SDKs and Tools Maintenance Policy](https://docs.aws.amazon.com/credref/latest/refdocs/maint-policy.html)\n* [AWS SDKs and Tools Version Support Matrix](https://docs.aws.amazon.com/credref/latest/refdocs/version-support-matrix.html)\n\n## Modularization\n\nWith version 3 of the AWS SDK for .NET the SDK has been modularized. This means a separate NuGet package is created for each service as well as a core project. To use this branch compile the solution in the **sdk** folder that matches the desired platform and then include the assemblies for the services needed as well as the core assembly.\n\n## Versioning\n\nThe AWS SDK for .NET uses a 4 part versioning scheme following the pattern of `w.x.y.z`. \n\n* **w** - Incremented for code breaking changes.\n* **x** - Incremented for binary breaking changes. In particular this is used to identitfy what versions of AWSSDK.Core are binary compatible with the service packages. For example if AWSSDK.SQS version 3.3.1.0 came out today when the current version of AWSSDK.Core is 3.3.17.5 then AWSSDK.SQS 3.3.1.0 would be compatible with all versions of AWSSDK.Core starting from 3.3.17.5 up to but not including a future 3.4.0.0.\n* **y** - Incremented for a new SDK feature, like new credential management, or an AWS service update.\n* **z** - Incremented for a bug fix or for service packages to update to the latest AWSSDK.Core to pull in latest bug fixes.\n\nThe SDK assemblies are strongly named which requires consumers of the SDK to recompile every time the `AssemblyVersion` attribute is incremented. To avoid forced recompilations the `AssemblyVersion` only contains the `w.x` portion of the version. The full `w.x.y.z` version number is set in the `AssemblyFileVersion` attribute which is not part of the strong name.\n\n### Internal Namespace\n\nClasses and interfaces with `Internal` in the namespace name are logically internal to the SDK but are often marked with a `public` access modifier, generally to allow the service-specific packages to use shared functionality in the Core package. Classes and interfaces in these namespaces are subject to modification or removal outside of versioning scheme described above. If you find yourself relying on `Internal` functionality directly, consider [opening a Feature Request](https://github.com/aws/aws-sdk-net/issues/new/choose) for your use case if one does not already exist.\n\n## Code Analyzers\n\nEach service package includes a code analyzer that's automatically included when installing from NuGet. These analyzers are created based on the rules from the service model, and will generate a warning if you use a property value that's not valid (for example, shorter than the minimum length expected by the service).\n\nStarting with the 3.7.200 versions of the AWS SDK for .NET NuGet packages, the analyzers target [.NET Standard 2.0](https://learn.microsoft.com/en-us/dotnet/standard/net-standard) and support Visual Studio 2019 RTM and later (announcement: https://github.com/aws/aws-sdk-net/issues/2998).\n\nUsers on Visual Studio 2017 (or earlier) can still use new versions of the SDK, but there'll be a new warning (`CS8032`) about analyzers failing to run. If the build system is configured to treat warnings as errors, this new warning will need to be suppressed or ignored (using [WarningsNotAsErrors](https://learn.microsoft.com/en-us/dotnet/csharp/language-reference/compiler-options/errors-warnings#warningsaserrors-and-warningsnotaserrors)).\n\n## Unity Support\n\nStarting with version 3.5 of the AWS SDK for .NET, projects using Unity 2018.1 or later should target the .NET Standard 2.0 release of the SDK. You can find additional information in the developer guide: [Unity support](https://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/unity-special.html) and [Migrating your Unity application](https://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/net-dg-v35.html#net-dg-v35-changes-unity).\n\nYou can find the archive for _**legacy**_ Unity support at https://github.com/aws/aws-sdk-unity-net.\n\n## Functionality requiring AWS Common Runtime (CRT)\n\nThis SDK has optional functionality that requires the [AWS Common Runtime (CRT)](https://docs.aws.amazon.com/sdkref/latest/guide/common-runtime.html)\nbindings to be included as a dependency with your application. This functionality includes:\n* [Amazon S3 Multi-Region Access Points](https://docs.aws.amazon.com/AmazonS3/latest/userguide/MultiRegionAccessPoints.html)\n* [Amazon S3 Object Integrity](https://docs.aws.amazon.com/AmazonS3/latest/userguide/checking-object-integrity.html)\n* Amazon EventBridge Global Endpoints\n\nIf the required AWS Common Runtime components are not installed you will receive an error like `Attempting to make a request that requires an implementation of AWS Signature V4a. Add a reference to the AWSSDK.Extensions.CrtIntegration NuGet package to your project to include the AWS Signature V4a signer.`,\nindicating that the required dependency is missing to use the associated functionality. To install this dependency follow\nthe provided [instructions](#installing-the-aws-common-runtime-crt-dependency).\n\n### Installing the AWS Common Runtime (CRT) Dependency\n\nAdd a reference to the NuGet package [AWSSDK.Extensions.CrtIntegration](https://www.nuget.org/packages/AWSSDK.Extensions.CrtIntegration/) to your project.\n\n## Tests\n\n**Important:** Do not run the integration tests on a production account.\n\nIntegration tests can be found in the **AWSSDK.IntegrationTests** project. These test assume that a default profile has been \nconfigured for credentials. For information about setting up a default profile read the [Developer Guide][credentials-management].\n\nThe tests are designed to create and delete the resources needed for testing but it is important to keep your data safe. Do not run\nthese tests on accounts that contain production data or resources. Since AWS resources are created and deleted during the running \nof these tests, charges can occur. To reduce charges occurred by running the tests the test focus on AWS resources that have minimal cost.\n\nUnit tests can be found in the **AWSSDK.UnitTests** project.\n\nProtocol tests can be found in the `sdk/test/ProtocolTests` directory. Protocol tests ensure that each AWS protocol is working as expected. Each supported protocol is [listed here](https://smithy.io/2.0/aws/protocols/index.html). These tests are safe to run as they do not call real AWS services. You can run these tests by either opening the solution file and running the tests or via the `dotnet` cli by invoking `dotnet test AWSSDK.ProtocolTests.NetStandard.csproj`. The structure for the protocol test cases can be found [here in the smithy docs](https://smithy.io/2.0/additional-specs/http-protocol-compliance-tests.html).\n\n### NuGet Packages\n\n* [AWSSDK.AccessAnalyzer](https://www.nuget.org/packages/AWSSDK.AccessAnalyzer/)\n\t* Introducing AWS IAM Access Analyzer, an IAM feature that makes it easy for AWS customers to ensure that their resource-based policies provide only the intended access to resources outside their AWS accounts.\n* [AWSSDK.Account](https://www.nuget.org/packages/AWSSDK.Account/)\n\t* This release of the Account Management API enables customers to manage the alternate contacts for their AWS accounts. For more information, see https://docs.aws.amazon.com/accounts/latest/reference/accounts-welcome.html\n* [AWSSDK.ACMPCA](https://www.nuget.org/packages/AWSSDK.ACMPCA/)\n\t* AWS Certificate Manager (ACM) Private Certificate Authority (CA) is a managed private CA service that helps you easily and securely manage the lifecycle of your private certificates. ACM Private CA provides you a highly-available private CA service without the upfront investment and ongoing maintenance costs of operating your own private CA. ACM Private CA extends ACM's certificate management capabilities to private certificates, enabling you to manage public and private certificates centrally.\n* [AWSSDK.Amplify](https://www.nuget.org/packages/AWSSDK.Amplify/)\n\t* Amplify is a fully managed continuous deployment and hosting service for modern web apps.\n* [AWSSDK.AmplifyBackend](https://www.nuget.org/packages/AWSSDK.AmplifyBackend/)\n\t* (New Service) The Amplify Admin UI offers an accessible way to develop app backends and manage app content. We recommend that you use the Amplify Admin UI to manage the backend of your Amplify app.\n* [AWSSDK.AmplifyUIBuilder](https://www.nuget.org/packages/AWSSDK.AmplifyUIBuilder/)\n\t* This release introduces the actions and data types for the new Amplify UI Builder API. The Amplify UI Builder API provides a programmatic interface for creating and configuring user interface (UI) component libraries and themes for use in Amplify applications.\n* [AWSSDK.APIGateway](https://www.nuget.org/packages/AWSSDK.APIGateway/)\n\t* Amazon API Gateway helps developers deliver robust, secure and scalable mobile and web application backends. Amazon API Gateway allows developers to securely connect mobile and web applications to APIs that run on AWS Lambda, Amazon EC2, or other publicly addressable web services that are hosted outside of AWS.\n* [AWSSDK.ApiGatewayManagementApi](https://www.nuget.org/packages/AWSSDK.ApiGatewayManagementApi/)\n\t* This is the initial SDK release for the Amazon API Gateway Management API, which allows you to directly manage runtime aspects of your APIs. This release makes it easy to send data directly to clients connected to your WebSocket-based APIs.\n* [AWSSDK.ApiGatewayV2](https://www.nuget.org/packages/AWSSDK.ApiGatewayV2/)\n\t* This is the initial SDK release for the Amazon API Gateway v2 APIs. This SDK will allow you to manage and configure APIs in Amazon API Gateway; this first release provides the capabilities that allow you to programmatically setup and manage WebSocket APIs end to end.\n* [AWSSDK.AppConfig](https://www.nuget.org/packages/AWSSDK.AppConfig/)\n\t* Introducing AWS AppConfig, a new service that enables customers to quickly deploy validated configurations to applications of any size in a controlled and monitored fashion.\n* [AWSSDK.AppConfigData](https://www.nuget.org/packages/AWSSDK.AppConfigData/)\n\t* AWS AppConfig Data is a new service that allows you to retrieve configuration deployed by AWS AppConfig. See the AppConfig user guide for more details on getting started. https://docs.aws.amazon.com/appconfig/latest/userguide/what-is-appconfig.html\n* [AWSSDK.AppFabric](https://www.nuget.org/packages/AWSSDK.AppFabric/)\n\t* Initial release of AWS AppFabric for connecting SaaS applications for better productivity and security.\n* [AWSSDK.Appflow](https://www.nuget.org/packages/AWSSDK.Appflow/)\n\t* Amazon AppFlow is a fully managed integration service that securely transfers data between AWS services and SaaS applications. This update releases the first version of Amazon AppFlow APIs and SDK.\n* [AWSSDK.AppIntegrationsService](https://www.nuget.org/packages/AWSSDK.AppIntegrationsService/)\n\t* The Amazon AppIntegrations service (in preview release) enables you to configure and reuse connections to external applications.\n* [AWSSDK.ApplicationAutoScaling](https://www.nuget.org/packages/AWSSDK.ApplicationAutoScaling/)\n\t* Application Auto Scaling is a general purpose Auto Scaling service for supported elastic AWS resources. With Application Auto Scaling, you can automatically scale your AWS resources, with an experience similar to that of Amazon EC2 Auto Scaling.\n* [AWSSDK.ApplicationCostProfiler](https://www.nuget.org/packages/AWSSDK.ApplicationCostProfiler/)\n\t* APIs for AWS Application Cost Profiler.\n* [AWSSDK.ApplicationDiscoveryService](https://www.nuget.org/packages/AWSSDK.ApplicationDiscoveryService/)\n\t* AWS Application Discovery Service helps Systems Integrators quickly and reliably plan application migration projects by automatically identifying applications running in your data center, their associated dependencies, and their performance profile.\n* [AWSSDK.ApplicationInsights](https://www.nuget.org/packages/AWSSDK.ApplicationInsights/)\n\t* CloudWatch Application Insights detects errors and exceptions from logs, including .NET custom application logs, SQL Server logs, IIS logs, and more, and uses a combination of built-in rules and machine learning, such as dynamic baselining, to identify common problems. You can then easily drill into specific issues with CloudWatch Automatic Dashboards that are dynamically generated. These dashboards contain the most recent alarms, a summary of relevant metrics, and log snippets to help you identify root cause.\n* [AWSSDK.ApplicationSignals](https://www.nuget.org/packages/AWSSDK.ApplicationSignals/)\n\t* This is the initial SDK release for Amazon CloudWatch Application Signals. Amazon CloudWatch Application Signals provides curated application performance monitoring for developers to monitor and troubleshoot application health using pre-built dashboards and Service Level Objectives.\n* [AWSSDK.AppMesh](https://www.nuget.org/packages/AWSSDK.AppMesh/)\n\t* AWS App Mesh is a service mesh that makes it easy to monitor and control communications between microservices of an application. AWS App Mesh APIs are available for preview in eu-west-1, us-east-1, us-east-2, and us-west-2 regions.\n* [AWSSDK.AppRegistry](https://www.nuget.org/packages/AWSSDK.AppRegistry/)\n\t* AWS Service Catalog AppRegistry provides a repository of your applications, their resources, and the application metadata that you use within your enterprise.\n* [AWSSDK.AppRunner](https://www.nuget.org/packages/AWSSDK.AppRunner/)\n\t* AWS App Runner is a service that provides a fast, simple, and cost-effective way to deploy from source code or a container image directly to a scalable and secure web application in the AWS Cloud.\n* [AWSSDK.AppStream](https://www.nuget.org/packages/AWSSDK.AppStream/)\n\t* Amazon AppStream is a fully managed, secure application streaming service that allows you to stream desktop applications from AWS to a web browser.\n* [AWSSDK.AppSync](https://www.nuget.org/packages/AWSSDK.AppSync/)\n\t* AWS AppSync is an enterprise-level, fully managed GraphQL service with real-time data synchronization and offline programming features.\n* [AWSSDK.AppTest](https://www.nuget.org/packages/AWSSDK.AppTest/)\n\t* AWS Mainframe Modernization Application Testing is an AWS Mainframe Modernization service feature that automates functional equivalence testing for mainframe application modernization and migration to AWS, and regression testing.\n* [AWSSDK.ARCZonalShift](https://www.nuget.org/packages/AWSSDK.ARCZonalShift/)\n\t* Amazon Route 53 Application Recovery Controller Zonal Shift is a new service that makes it easy to shift traffic away from an Availability Zone in a Region. See the developer guide for more information: https://docs.aws.amazon.com/r53recovery/latest/dg/what-is-route53-recovery.html\n* [AWSSDK.Artifact](https://www.nuget.org/packages/AWSSDK.Artifact/)\n\t* This is the initial SDK release for AWS Artifact. AWS Artifact provides on-demand access to compliance and third-party compliance reports. This release includes access to List and Get reports, along with their metadata. This release also includes access to AWS Artifact notifications settings.\n* [AWSSDK.Athena](https://www.nuget.org/packages/AWSSDK.Athena/)\n\t* This release adds support for Amazon Athena. Amazon Athena is an interactive query service that makes it easy to analyze data in Amazon S3 using standard SQL. Athena is serverless, so there is no infrastructure to manage, and you pay only for the queries that you run.\n* [AWSSDK.AuditManager](https://www.nuget.org/packages/AWSSDK.AuditManager/)\n\t* AWS Audit Manager helps you continuously audit your AWS usage to simplify how you manage risk and compliance. This update releases the first version of the AWS Audit Manager APIs and SDK.\n* [AWSSDK.AugmentedAIRuntime](https://www.nuget.org/packages/AWSSDK.AugmentedAIRuntime/)\n\t* This release adds support for Amazon Augmented AI, which makes it easy to build workflows for human review of machine learning predictions.\n* [AWSSDK.AutoScaling](https://www.nuget.org/packages/AWSSDK.AutoScaling/)\n\t* Auto Scaling helps you maintain application availability and allows you to scale your capacity up or down automatically according to conditions you define.\n* [AWSSDK.AutoScalingPlans](https://www.nuget.org/packages/AWSSDK.AutoScalingPlans/)\n\t* AWS Auto Scaling enables you to quickly discover all of the scalable resources underlying your application and set up application scaling in minutes using built-in scaling recommendations.\n* [AWSSDK.AWSHealth](https://www.nuget.org/packages/AWSSDK.AWSHealth/)\n\t* The AWS Health API serves as the primary source for you to receive personalized information related to your AWS infrastructure, guiding your through scheduled changes, and accelerating the troubleshooting of issues impacting your AWS resources and accounts.\n* [AWSSDK.AWSMarketplaceCommerceAnalytics](https://www.nuget.org/packages/AWSSDK.AWSMarketplaceCommerceAnalytics/)\n\t* The AWS Marketplace Commerce Analytics service allows marketplace partners to programmatically request business intelligence data from AWS Marketplace. This service provides the same data that was previously only available through the AWS Marketplace Management Portal, but offers the data in a fully-machine-readable format and available in fine-grained data sets rather than large reports.\n* [AWSSDK.AWSMarketplaceMetering](https://www.nuget.org/packages/AWSSDK.AWSMarketplaceMetering/)\n\t* The AWS Marketplace Metering Service enables sellers to price their products along new pricing dimensions. After a integrating their product with the AWS Marketplace Metering Service, that product will emit an hourly record capturing the usage of any single pricing dimension. Buyers can easily subscribe to software priced by this new dimension on the AWS Marketplace website and only pay for what they use.\n* [AWSSDK.AWSSupport](https://www.nuget.org/packages/AWSSDK.AWSSupport/)\n\t* The AWS Support API provides methods for creating and managing AWS Support cases and for retrieving the results of AWS Trusted Advisor checks.\n* [AWSSDK.B2bi](https://www.nuget.org/packages/AWSSDK.B2bi/)\n\t* This is the initial SDK release for AWS B2B Data Interchange.\n* [AWSSDK.Backup](https://www.nuget.org/packages/AWSSDK.Backup/)\n\t* AWS Backup is a fully managed backup service that makes it easy to centralize and automate the back up of data across AWS services in the cloud as well as on-premises.\n* [AWSSDK.BackupGateway](https://www.nuget.org/packages/AWSSDK.BackupGateway/)\n\t* Initial release of AWS Backup gateway which enables you to centralize and automate protection of on-premises VMware and VMware Cloud on AWS workloads using AWS Backup.\n* [AWSSDK.BackupSearch](https://www.nuget.org/packages/AWSSDK.BackupSearch/)\n\t* Add support for searching backups\n* [AWSSDK.Batch](https://www.nuget.org/packages/AWSSDK.Batch/)\n\t* AWS Batch enables developers, scientists, and engineers to easily and efficiently run hundreds of thousands of batch computing jobs on AWS. \n* [AWSSDK.BCMDataExports](https://www.nuget.org/packages/AWSSDK.BCMDataExports/)\n\t* Users can create, read, update, delete Exports of billing and cost management data.  Users can get details of Export Executions and details of Tables for exporting.  Tagging support is provided for Exports\n* [AWSSDK.BCMPricingCalculator](https://www.nuget.org/packages/AWSSDK.BCMPricingCalculator/)\n\t* Initial release of the AWS Billing and Cost Management Pricing Calculator API.\n* [AWSSDK.Bedrock](https://www.nuget.org/packages/AWSSDK.Bedrock/)\n\t* Model Invocation logging added to enable or disable logs in customer account. Model listing and description support added. Provisioned Throughput feature added. Custom model support added for creating custom models. Also includes list, and delete functions for custom model.\n* [AWSSDK.BedrockAgent](https://www.nuget.org/packages/AWSSDK.BedrockAgent/)\n\t* This release introduces Agents for Amazon Bedrock\n* [AWSSDK.BedrockAgentRuntime](https://www.nuget.org/packages/AWSSDK.BedrockAgentRuntime/)\n\t* This release introduces Agents for Amazon Bedrock Runtime\n* [AWSSDK.BedrockDataAutomation](https://www.nuget.org/packages/AWSSDK.BedrockDataAutomation/)\n\t* Release Bedrock Data Automation SDK\n* [AWSSDK.BedrockDataAutomationRuntime](https://www.nuget.org/packages/AWSSDK.BedrockDataAutomationRuntime/)\n\t* Release Bedrock Data Automation Runtime SDK\n* [AWSSDK.BedrockRuntime](https://www.nuget.org/packages/AWSSDK.BedrockRuntime/)\n\t* Run Inference: Added support to run the inference on models.  Includes set of APIs for running inference in streaming and non-streaming mode.\n* [AWSSDK.Billing](https://www.nuget.org/packages/AWSSDK.Billing/)\n\t* Today, AWS announces the general availability of ListBillingViews API in the AWS SDKs, to enable AWS Billing Conductor (ABC) users to create proforma Cost and Usage Reports (CUR) programmatically.\n* [AWSSDK.BillingConductor](https://www.nuget.org/packages/AWSSDK.BillingConductor/)\n\t* This is the initial SDK release for AWS Billing Conductor. The AWS Billing Conductor is a customizable billing service, allowing you to customize your billing data to match your desired business structure.\n* [AWSSDK.Braket](https://www.nuget.org/packages/AWSSDK.Braket/)\n\t* Amazon Braket general availability with Device and Quantum Task operations.\n* [AWSSDK.Budgets](https://www.nuget.org/packages/AWSSDK.Budgets/)\n\t* AWS Budget service will provide create/get/list/update/delete budgets for cost management. \n* [AWSSDK.CertificateManager](https://www.nuget.org/packages/AWSSDK.CertificateManager/)\n\t* AWS Certificate Manager (ACM) is an AWS service that makes it easier for you to deploy secure SSL based websites and applications on the AWS platform.\n* [AWSSDK.Chatbot](https://www.nuget.org/packages/AWSSDK.Chatbot/)\n\t* This release adds support for AWS Chatbot. You can now monitor, operate, and troubleshoot your AWS resources with interactive ChatOps using the AWS SDK.\n* [AWSSDK.Chime](https://www.nuget.org/packages/AWSSDK.Chime/)\n\t* The Amazon Chime API (application programming interface) is designed for administrators to use to perform key tasks, such as creating and managing Amazon Chime accounts and users.\n* [AWSSDK.ChimeSDKIdentity](https://www.nuget.org/packages/AWSSDK.ChimeSDKIdentity/)\n\t* The Amazon Chime SDK Identity APIs allow software developers to create and manage unique instances of their messaging applications.\n* [AWSSDK.ChimeSDKMediaPipelines](https://www.nuget.org/packages/AWSSDK.ChimeSDKMediaPipelines/)\n\t* For Amazon Chime SDK meetings, the Amazon Chime Media Pipelines SDK allows builders to capture audio, video, and content share streams. You can also capture meeting events, live transcripts, and data messages. The pipelines save the artifacts to an Amazon S3 bucket that you designate.\n* [AWSSDK.ChimeSDKMeetings](https://www.nuget.org/packages/AWSSDK.ChimeSDKMeetings/)\n\t* The Amazon Chime SDK Meetings APIs allow software developers to create meetings and attendees for interactive audio, video, screen and content sharing in custom meeting applications which use the Amazon Chime SDK.\n* [AWSSDK.ChimeSDKMessaging](https://www.nuget.org/packages/AWSSDK.ChimeSDKMessaging/)\n\t* The Amazon Chime SDK Messaging APIs allow software developers to send and receive messages in custom messaging applications.\n* [AWSSDK.ChimeSDKVoice](https://www.nuget.org/packages/AWSSDK.ChimeSDKVoice/)\n\t* Amazon Chime Voice Connector, Voice Connector Group and PSTN Audio Service APIs are now available in the Amazon Chime SDK Voice namespace. See https://docs.aws.amazon.com/chime-sdk/latest/dg/sdk-available-regions.html for more details.\n* [AWSSDK.CleanRooms](https://www.nuget.org/packages/AWSSDK.CleanRooms/)\n\t* Initial release of AWS Clean Rooms\n* [AWSSDK.CleanRoomsML](https://www.nuget.org/packages/AWSSDK.CleanRoomsML/)\n\t* Public Preview SDK release of AWS Clean Rooms ML APIs\n* [AWSSDK.Cloud9](https://www.nuget.org/packages/AWSSDK.Cloud9/)\n\t* Adds support for creating and managing AWS Cloud9 development environments. AWS Cloud9 is a cloud-based integrated development environment (IDE) that you use to write, run, and debug code.\n* [AWSSDK.CloudControlApi](https://www.nuget.org/packages/AWSSDK.CloudControlApi/)\n\t* Initial release of the SDK for AWS Cloud Control API\n* [AWSSDK.CloudDirectory](https://www.nuget.org/packages/AWSSDK.CloudDirectory/)\n\t* Cloud Directory (CD) is a multi-tenant, hierarchical data store for use by other AWS services to store directory data for AWS resources, including both metadata about resources and policy data governing resources.\n* [AWSSDK.CloudFormation](https://www.nuget.org/packages/AWSSDK.CloudFormation/)\n\t* AWS CloudFormation gives developers and systems administrators an easy way to create and manage a collection of related AWS resources, provisioning and updating them in an orderly and predictable fashion.\n* [AWSSDK.CloudFront](https://www.nuget.org/packages/AWSSDK.CloudFront/)\n\t* Amazon CloudFront is a content delivery web service. It integrates with other Amazon Web Services products to give developers and businesses an easy way to distribute content to end users with low latency, high data transfer speeds, and no minimum usage commitments.\n* [AWSSDK.CloudFrontKeyValueStore](https://www.nuget.org/packages/AWSSDK.CloudFrontKeyValueStore/)\n\t* This release adds support for CloudFront KeyValueStore, a globally managed key value datastore associated with CloudFront Functions.\n* [AWSSDK.CloudHSM](https://www.nuget.org/packages/AWSSDK.CloudHSM/)\n\t* The AWS CloudHSM service helps you meet corporate, contractual and regulatory compliance requirements for data security by using dedicated Hardware Security Module (HSM) appliances within the AWS cloud. With CloudHSM, you control the encryption keys and cryptographic operations performed by the HSM.\n* [AWSSDK.CloudHSMV2](https://www.nuget.org/packages/AWSSDK.CloudHSMV2/)\n\t* CloudHSM provides hardware security modules for protecting sensitive data and cryptographic keys within an EC2 VPC, and enable the customer to maintain control over key access and use. This is a second-generation of the service that will improve security, lower cost and provide better customer usability.\n* [AWSSDK.CloudSearch](https://www.nuget.org/packages/AWSSDK.CloudSearch/)\n\t* Amazon CloudSearch is a managed service in the AWS Cloud that makes it simple and cost-effective to set up, manage, and scale a search solution for your website or application.\n* [AWSSDK.CloudSearchDomain](https://www.nuget.org/packages/AWSSDK.CloudSearchDomain/)\n\t* Amazon CloudSearch Domain encapsulates a collection of data you want to search, the search instances that process your search requests, and a configuration that controls how your data is indexed and searched.\n* [AWSSDK.CloudTrail](https://www.nuget.org/packages/AWSSDK.CloudTrail/)\n\t* AWS CloudTrail is a web service that records AWS API calls for your account and delivers log files to you. The recorded information includes the identity of the API caller, the time of the API call, the source IP address of the API caller, the request parameters, and the response elements returned by the AWS service.\n* [AWSSDK.CloudTrailData](https://www.nuget.org/packages/AWSSDK.CloudTrailData/)\n\t* Add CloudTrail Data Service to enable users to ingest activity events from non-AWS sources into CloudTrail Lake.\n* [AWSSDK.CloudWatch](https://www.nuget.org/packages/AWSSDK.CloudWatch/)\n\t* Amazon CloudWatch is a monitoring service for AWS cloud resources and the applications you run on AWS. You can use Amazon CloudWatch to collect and track metrics, collect and monitor log files, and set alarms.\n* [AWSSDK.CloudWatchEvents](https://www.nuget.org/packages/AWSSDK.CloudWatchEvents/)\n\t* Amazon CloudWatch Events helps you to respond to state changes in your AWS resources. When your resources change state they automatically send events into an event stream. You can create rules that match selected events in the stream and route them to targets to take action. You can also use rules to take action on a pre-determined schedule.\n* [AWSSDK.CloudWatchEvidently](https://www.nuget.org/packages/AWSSDK.CloudWatchEvidently/)\n\t* Introducing Amazon CloudWatch Evidently. This is the first public release of Amazon CloudWatch Evidently.\n* [AWSSDK.CloudWatchLogs](https://www.nuget.org/packages/AWSSDK.CloudWatchLogs/)\n\t* Amazon CloudWatch is a monitoring service for AWS cloud resources and the applications you run on AWS. You can use Amazon CloudWatch to collect and track metrics, collect and monitor log files, and set alarms.\n* [AWSSDK.CloudWatchRUM](https://www.nuget.org/packages/AWSSDK.CloudWatchRUM/)\n\t* This is the first public release of CloudWatch RUM\n* [AWSSDK.CodeArtifact](https://www.nuget.org/packages/AWSSDK.CodeArtifact/)\n\t* Added support for AWS CodeArtifact.\n* [AWSSDK.CodeBuild](https://www.nuget.org/packages/AWSSDK.CodeBuild/)\n\t* AWS CodeBuild is a fully-managed build service in the cloud. AWS CodeBuild compiles your source code, runs unit tests, and produces artifacts that are ready to deploy.\n* [AWSSDK.CodeCatalyst](https://www.nuget.org/packages/AWSSDK.CodeCatalyst/)\n\t* This release adds operations that support customers using the AWS Toolkits and Amazon CodeCatalyst, a unified software development service that helps developers develop, deploy, and maintain applications in the cloud. For more information, see the documentation.\n* [AWSSDK.CodeCommit](https://www.nuget.org/packages/AWSSDK.CodeCommit/)\n\t* AWS CodeCommit is a fully-managed source control service that makes it easy for companies to host secure and highly scalable private Git repositories.\n* [AWSSDK.CodeConnections](https://www.nuget.org/packages/AWSSDK.CodeConnections/)\n\t* Duplicating the CodeStar Connections service into the new, rebranded AWS CodeConnections service.\n* [AWSSDK.CodeDeploy](https://www.nuget.org/packages/AWSSDK.CodeDeploy/)\n\t* AWS CodeDeploy is a service that automates code deployments. AWS CodeDeploy makes it easier for you to rapidly release new features, helps you avoid downtime during deployment, and handles the complexity of updating your applications.\n* [AWSSDK.CodeGuruProfiler](https://www.nuget.org/packages/AWSSDK.CodeGuruProfiler/)\n\t* (New Service) Amazon CodeGuru Profiler analyzes application CPU utilization and latency characteristics to show you where you are spending the most cycles in your application. This analysis is presented in an interactive flame graph that helps you easily understand which paths consume the most resources, verify that your application is performing as expected, and uncover areas that can be optimized further.\n* [AWSSDK.CodeGuruReviewer](https://www.nuget.org/packages/AWSSDK.CodeGuruReviewer/)\n\t* This is the preview release of Amazon CodeGuru Reviewer.\n* [AWSSDK.CodeGuruSecurity](https://www.nuget.org/packages/AWSSDK.CodeGuruSecurity/)\n\t* Initial release of Amazon CodeGuru Security APIs\n* [AWSSDK.CodePipeline](https://www.nuget.org/packages/AWSSDK.CodePipeline/)\n\t* AWS CodePipeline is a continuous delivery service for fast and reliable application updates.\n* [AWSSDK.CodeStarconnections](https://www.nuget.org/packages/AWSSDK.CodeStarconnections/)\n\t* Public beta for Bitbucket Cloud support in AWS CodePipeline through integration with AWS CodeStar connections.\n* [AWSSDK.CodeStarNotifications](https://www.nuget.org/packages/AWSSDK.CodeStarNotifications/)\n\t* This release adds a notification manager for events in repositories, build projects, deployments, and pipelines. You can now configure rules and receive notifications about events that occur for resources. Each notification includes a status message as well as a link to the resource (repository, build project, deployment application, or pipeline) whose event generated the notification.\n* [AWSSDK.CognitoIdentity](https://www.nuget.org/packages/AWSSDK.CognitoIdentity/)\n\t* Amazon Cognito is a service that makes it easy to save user data, such as app preferences or game state, in the AWS Cloud without writing any backend code or managing any infrastructure. With Amazon Cognito, you can focus on creating great app experiences instead of having to worry about building and managing a backend solution to handle identity management, network state, storage, and sync.\n* [AWSSDK.CognitoIdentityProvider](https://www.nuget.org/packages/AWSSDK.CognitoIdentityProvider/)\n\t* You can create a user pool in Amazon Cognito Identity to manage directories and users. You can authenticate a user to obtain tokens related to user identity and access policies. This API reference provides information about user pools in Amazon Cognito Identity, which is a new capability that is available as a beta.\n* [AWSSDK.CognitoSync](https://www.nuget.org/packages/AWSSDK.CognitoSync/)\n\t* Amazon Cognito is a service that makes it easy to save user data, such as app preferences or game state, in the AWS Cloud without writing any backend code or managing any infrastructure. With Amazon Cognito, you can focus on creating great app experiences instead of having to worry about building and managing a backend solution to handle identity management, network state, storage, and sync.\n* [AWSSDK.Comprehend](https://www.nuget.org/packages/AWSSDK.Comprehend/)\n\t* Amazon Comprehend is an AWS service for gaining insight into the content of text and documents. It can be used to determine the topics contained in your documents, the topics they discuss, the  predominant sentiment expressed in them, the predominant language used, and more. For more information, go to the Amazon Comprehend product page. To get started, see the Amazon Comprehend Developer Guide.\n* [AWSSDK.ComprehendMedical](https://www.nuget.org/packages/AWSSDK.ComprehendMedical/)\n\t* The first release of Comprehend Medical includes two APIs, detectPHI and detectEntities. DetectPHI extracts PHI from your clinical text, and detectEntities extracts entities such as medication, medical conditions, or anatomy. DetectEntities also extracts attributes (e.g. dosage for medication) and identifies contextual traits (e.g. negation) for each entity.\n* [AWSSDK.ComputeOptimizer](https://www.nuget.org/packages/AWSSDK.ComputeOptimizer/)\n\t* Initial release of AWS Compute Optimizer. AWS Compute Optimizer recommends optimal AWS Compute resources to reduce costs and improve performance for your workloads.\n* [AWSSDK.ConfigService](https://www.nuget.org/packages/AWSSDK.ConfigService/)\n\t* AWS Config is a fully managed service that provides you with an AWS resource inventory, configuration history, and configuration change notifications to enable security and governance.\n* [AWSSDK.Connect](https://www.nuget.org/packages/AWSSDK.Connect/)\n\t* Amazon Connect is a self-service, cloud-based contact center service that makes it easy for any business to deliver better customer service at lower cost.\n* [AWSSDK.ConnectCampaignService](https://www.nuget.org/packages/AWSSDK.ConnectCampaignService/)\n\t* Added Amazon Connect high volume outbound communications SDK.\n* [AWSSDK.ConnectCampaignsV2](https://www.nuget.org/packages/AWSSDK.ConnectCampaignsV2/)\n\t* Added Amazon Connect Outbound Campaigns V2 SDK.\n* [AWSSDK.ConnectCases](https://www.nuget.org/packages/AWSSDK.ConnectCases/)\n\t* This release adds APIs for Amazon Connect Cases. Cases allows your agents to quickly track and manage customer issues that require multiple interactions, follow-up tasks, and teams in your contact center.  For more information, see https://docs.aws.amazon.com/cases/latest/APIReference/Welcome.html\n* [AWSSDK.ConnectContactLens](https://www.nuget.org/packages/AWSSDK.ConnectContactLens/)\n\t* Contact Lens for Amazon Connect analyzes conversations, both real-time and post-call. The ListRealtimeContactAnalysisSegments API returns a list of analysis segments for a real-time analysis session.\n* [AWSSDK.ConnectParticipant](https://www.nuget.org/packages/AWSSDK.ConnectParticipant/)\n\t* This release adds 5 new APIs: CreateParticipantConnection, DisconnectParticipant, GetTranscript, SendEvent, and SendMessage. For Amazon Connect chat, you can use them to programmatically perform participant actions on the configured Amazon Connect instance. Learn more here: https://docs.aws.amazon.com/connect-participant/latest/APIReference/Welcome.html\n* [AWSSDK.ConnectWisdomService](https://www.nuget.org/packages/AWSSDK.ConnectWisdomService/)\n\t* Released Amazon Connect Wisdom, a feature of Amazon Connect, which provides real-time recommendations and search functionality in general availability (GA).  For more information, see https://docs.aws.amazon.com/wisdom/latest/APIReference/Welcome.html.\n* [AWSSDK.ControlCatalog](https://www.nuget.org/packages/AWSSDK.ControlCatalog/)\n\t* This is the initial SDK release for AWS Control Catalog, a central catalog for AWS managed controls. This release includes 3 new APIs - ListDomains, ListObjectives, and ListCommonControls - that vend high-level data to categorize controls across the AWS platform.\n* [AWSSDK.ControlTower](https://www.nuget.org/packages/AWSSDK.ControlTower/)\n\t* This release contains the first SDK for AWS Control Tower. It introduces  a new set of APIs: EnableControl, DisableControl, GetControlOperation, and ListEnabledControls.\n* [AWSSDK.CostAndUsageReport](https://www.nuget.org/packages/AWSSDK.CostAndUsageReport/)\n\t* The AWS Cost and Usage Report Service API allows you to enable and disable the Cost and Usage report, as well as modify the report name, the data granularity, and the delivery preferences.\n* [AWSSDK.CostExplorer](https://www.nuget.org/packages/AWSSDK.CostExplorer/)\n\t* The AWS Cost Explorer API gives customers programmatic access to AWS cost and usage information, allowing them to perform adhoc queries and build interactive cost management applications that leverage this dataset.\n* [AWSSDK.CostOptimizationHub](https://www.nuget.org/packages/AWSSDK.CostOptimizationHub/)\n\t* This release launches Cost Optimization Hub, a new AWS Billing and Cost Management feature that helps you consolidate and prioritize cost optimization recommendations across your AWS Organizations member accounts and AWS Regions, so that you can get the most out of your AWS spend.\n* [AWSSDK.CustomerProfiles](https://www.nuget.org/packages/AWSSDK.CustomerProfiles/)\n\t* This is the first release of Amazon Connect Customer Profiles, a unified customer profile for your Amazon Connect contact center.\n* [AWSSDK.DatabaseMigrationService](https://www.nuget.org/packages/AWSSDK.DatabaseMigrationService/)\n\t* AWS Database Migration Service (AWS DMS) can migrate your data to and from most widely used commercial and open-source databases such as Oracle, PostgreSQL, Microsoft SQL Server, Amazon Aurora, MariaDB, and MySQL. The service supports homogeneous migrations such as Oracle to Oracle, and also heterogeneous migrations between different database platforms, such as Oracle to MySQL or MySQL to Amazon Aurora.\n* [AWSSDK.DataExchange](https://www.nuget.org/packages/AWSSDK.DataExchange/)\n\t* Introducing AWS Data Exchange, a service that makes it easy for AWS customers to securely create, manage, access, and exchange data sets in the cloud.\n* [AWSSDK.DataPipeline](https://www.nuget.org/packages/AWSSDK.DataPipeline/)\n\t* AWS Data Pipeline is a managed extract-transform-load (ETL) service that helps you reliably and cost-effectively move and process data across your on-premise data stores and AWS services.\n* [AWSSDK.DataSync](https://www.nuget.org/packages/AWSSDK.DataSync/)\n\t* AWS DataSync simplifies, automates, and accelerates moving and replicating data between on-premises storage and AWS services over the network.\n* [AWSSDK.DataZone](https://www.nuget.org/packages/AWSSDK.DataZone/)\n\t* Initial release of Amazon DataZone\n* [AWSSDK.DAX](https://www.nuget.org/packages/AWSSDK.DAX/)\n\t* Amazon DynamoDB Accelerator (DAX) is a fully managed, highly available, in-memory cache for DynamoDB that delivers up to a 10x performance improvement - from milliseconds to microseconds - even at millions of requests per second. DAX does all the heavy lifting required to add in-memory acceleration to your DynamoDB tables, without requiring developers to manage cache invalidation, data population, or cluster management.\n* [AWSSDK.Deadline](https://www.nuget.org/packages/AWSSDK.Deadline/)\n\t* AWS Deadline Cloud is a new fully managed service that helps customers set up, deploy, and scale rendering projects in minutes, so they can improve the efficiency of their rendering pipelines and take on more projects.\n* [AWSSDK.Detective](https://www.nuget.org/packages/AWSSDK.Detective/)\n\t* This is the initial release of Amazon Detective.\n* [AWSSDK.DeviceFarm](https://www.nuget.org/packages/AWSSDK.DeviceFarm/)\n\t* AWS Device Farm is an app testing service that enables you to test your Android and Fire OS apps on real, physical phones and tablets that are hosted by AWS. The service allows you to upload your own tests or use built-in, script-free compatibility tests.\n* [AWSSDK.DevOpsGuru](https://www.nuget.org/packages/AWSSDK.DevOpsGuru/)\n\t* (New Service) Amazon DevOps Guru is available in public preview. It's a fully managed service that uses machine learning to analyze your operational solutions to help you find and troubleshoot issues.\n* [AWSSDK.DirectConnect](https://www.nuget.org/packages/AWSSDK.DirectConnect/)\n\t* AWS Direct Connect makes it easy to establish a dedicated network connection from your premises to AWS. Using AWS Direct Connect, you can establish private connectivity between AWS and your datacenter, office, or colocation environment, which in many cases can reduce your network costs, increase bandwidth throughput, and provide a more consistent network experience than Internet-based connections.\n* [AWSSDK.DirectoryService](https://www.nuget.org/packages/AWSSDK.DirectoryService/)\n\t* AWS Directory Service is a managed service that allows you to connect your AWS resources with an existing on-premises Microsoft Active Directory or to set up a new, stand-alone directory in the AWS Cloud.\n* [AWSSDK.DirectoryServiceData](https://www.nuget.org/packages/AWSSDK.DirectoryServiceData/)\n\t* Added new AWS Directory Service Data API, enabling you to manage data stored in AWS Directory Service directories. This includes APIs for creating, reading, updating, and deleting directory users, groups, and group memberships.\n* [AWSSDK.DLM](https://www.nuget.org/packages/AWSSDK.DLM/)\n\t* Amazon Data Lifecycle Manager manages lifecycle of your AWS resources.\n* [AWSSDK.DocDB](https://www.nuget.org/packages/AWSSDK.DocDB/)\n\t* Amazon DocumentDB is a fast, reliable, and fully managed MongoDB compatible database service.\n* [AWSSDK.DocDBElastic](https://www.nuget.org/packages/AWSSDK.DocDBElastic/)\n\t* Launched Amazon DocumentDB Elastic Clusters. You can now use the SDK to create, list, update and delete Amazon DocumentDB Elastic Cluster resources\n* [AWSSDK.Drs](https://www.nuget.org/packages/AWSSDK.Drs/)\n\t* Introducing AWS Elastic Disaster Recovery (AWS DRS), a new service that minimizes downtime and data loss with fast, reliable recovery of on-premises and cloud-based applications using affordable storage, minimal compute, and point-in-time recovery.\n* [AWSSDK.DSQL](https://www.nuget.org/packages/AWSSDK.DSQL/)\n\t* Add new API operations for Amazon Aurora DSQL. Amazon Aurora DSQL is a serverless, distributed SQL database with virtually unlimited scale, highest availability, and zero infrastructure management.\n* [AWSSDK.DynamoDBv2](https://www.nuget.org/packages/AWSSDK.DynamoDBv2/)\n\t* Amazon DynamoDB is a fast and flexible NoSQL database service for all applications that need consistent, single-digit millisecond latency at any scale.\n* [AWSSDK.EBS](https://www.nuget.org/packages/AWSSDK.EBS/)\n\t* This release introduces the EBS direct APIs for Snapshots: 1. ListSnapshotBlocks, which lists the block indexes and block tokens for blocks in an Amazon EBS snapshot. 2. ListChangedBlocks, which lists the block indexes and block tokens for blocks that are different between two snapshots of the same volume/snapshot lineage. 3. GetSnapshotBlock, which returns the data in a block of an Amazon EBS snapshot.\n* [AWSSDK.EC2](https://www.nuget.org/packages/AWSSDK.EC2/)\n\t* Amazon Elastic Compute Cloud (Amazon EC2) is a web service that provides resizable compute capacity in the cloud. It is designed to make web-scale cloud computing easier for developers.\n* [AWSSDK.EC2InstanceConnect](https://www.nuget.org/packages/AWSSDK.EC2InstanceConnect/)\n\t* Amazon EC2 Instance Connect is a simple and secure way to connect to your instances using Secure Shell (SSH). With EC2 Instance Connect, you can control SSH access to your instances using AWS Identity and Access Management (IAM) policies as well as audit connection requests with AWS CloudTrail events. In addition, you can leverage your existing SSH keys or further enhance your security posture by generating one-time use SSH keys each time an authorized user connects.\n* [AWSSDK.ECR](https://www.nuget.org/packages/AWSSDK.ECR/)\n\t* Amazon EC2 Container Registry (Amazon ECR) is a managed AWS Docker registry service. Customers can use the familiar Docker CLI to push, pull, and manage images.\n* [AWSSDK.ECRPublic](https://www.nuget.org/packages/AWSSDK.ECRPublic/)\n\t* Supports Amazon Elastic Container Registry (Amazon ECR) Public, a fully managed registry that makes it easy for a developer to publicly share container software worldwide for anyone to download.\n* [AWSSDK.ECS](https://www.nuget.org/packages/AWSSDK.ECS/)\n\t* Amazon EC2 Container Service is a highly scalable, high performance container management service that supports Docker containers and allows you to easily run distributed applications on a managed cluster of Amazon EC2 instances.\n* [AWSSDK.EKS](https://www.nuget.org/packages/AWSSDK.EKS/)\n\t* Amazon Elastic Container Service for Kubernetes (Amazon EKS) is a fully managed service that makes it easy to deploy, manage, and scale containerized applications using Kubernetes on AWS.Amazon EKS runs Kubernetes management infrastructure for you across multiple AWS availability zones to eliminate a single point of failure. Amazon EKS is certified Kubernetes conformant so you can use existing tooling and plugins from partners and the Kubernetes community. Applications running on any standard Kubernetes environment are fully compatible and can be easily migrated to Amazon EKS.\n* [AWSSDK.EKSAuth](https://www.nuget.org/packages/AWSSDK.EKSAuth/)\n\t* This release adds support for EKS Pod Identity feature. EKS Pod Identity makes it easy for customers to obtain IAM permissions for their applications running in the EKS clusters.\n* [AWSSDK.ElastiCache](https://www.nuget.org/packages/AWSSDK.ElastiCache/)\n\t* ElastiCache is a web service that makes it easy to deploy, operate, and scale an in-memory cache in the cloud. The service improves the performance of web applications by allowing you to retrieve information from fast, managed, in-memory caches, instead of relying entirely on slower disk-based databases.\n* [AWSSDK.ElasticBeanstalk](https://www.nuget.org/packages/AWSSDK.ElasticBeanstalk/)\n\t* AWS Elastic Beanstalk is an easy-to-use service for deploying and scaling web applications and services developed with Java, .NET, PHP, Node.js, Python, Ruby, Go, and Docker on familiar servers such as Apache, Nginx, Passenger, and IIS.\n* [AWSSDK.ElasticFileSystem](https://www.nuget.org/packages/AWSSDK.ElasticFileSystem/)\n\t* Amazon Elastic File System (Amazon EFS) is a file storage service for Amazon Elastic Compute Cloud (Amazon EC2) instances.\n* [AWSSDK.ElasticInference](https://www.nuget.org/packages/AWSSDK.ElasticInference/)\n\t* Amazon Elastic Inference allows customers to attach Elastic Inference Accelerators to Amazon EC2 and Amazon ECS tasks, thus providing low-cost GPU-powered acceleration and reducing the cost of running deep learning inference. This release allows customers to add or remove tags for their Elastic Inference Accelerators.\n* [AWSSDK.ElasticLoadBalancing](https://www.nuget.org/packages/AWSSDK.ElasticLoadBalancing/)\n\t* Elastic Load Balancing automatically distributes incoming application traffic across multiple compute instances in the cloud.\n* [AWSSDK.ElasticLoadBalancingV2](https://www.nuget.org/packages/AWSSDK.ElasticLoadBalancingV2/)\n\t* Elastic Load Balancing automatically distributes incoming application traffic across multiple compute instances in the cloud.\n* [AWSSDK.ElasticMapReduce](https://www.nuget.org/packages/AWSSDK.ElasticMapReduce/)\n\t* Amazon Elastic MapReduce (Amazon EMR) is a web service that makes it easy to quickly and cost-effectively process vast amounts of data.\n* [AWSSDK.Elasticsearch](https://www.nuget.org/packages/AWSSDK.Elasticsearch/)\n\t* Use the Amazon Elasticsearch configuration API to create, configure, and manage Elasticsearch domains.\n* [AWSSDK.ElasticTranscoder](https://www.nuget.org/packages/AWSSDK.ElasticTranscoder/)\n\t* Amazon Elastic Transcoder is media transcoding in the cloud. It is designed to be a highly scalable, easy to use and a cost effective way for developers and businesses to convert (or 'transcode') media files from their source format into versions that will playback on devices like smartphones, tablets and PCs.\n* [AWSSDK.EMRContainers](https://www.nuget.org/packages/AWSSDK.EMRContainers/)\n\t* This release adds support for Amazon EMR on EKS, a simple way to run Spark on Kubernetes.\n* [AWSSDK.EMRServerless](https://www.nuget.org/packages/AWSSDK.EMRServerless/)\n\t* This release adds support for Amazon EMR Serverless, a serverless runtime environment that simplifies running analytics applications using the latest open source frameworks such as Apache Spark and Apache Hive.\n* [AWSSDK.EntityResolution](https://www.nuget.org/packages/AWSSDK.EntityResolution/)\n\t* AWS Entity Resolution can effectively match a source record from a customer relationship management (CRM) system with a source record from a marketing system containing campaign information.\n* [AWSSDK.EventBridge](https://www.nuget.org/packages/AWSSDK.EventBridge/)\n\t* Amazon EventBridge is a serverless event bus service that makes it easy to connect your applications with data from a variety of sources, including AWS services, partner applications, and your own applications.\n* [AWSSDK.Finspace](https://www.nuget.org/packages/AWSSDK.Finspace/)\n\t* This is the initial SDK release for the management APIs for Amazon FinSpace. Amazon FinSpace is a data management and analytics service for the financial services industry (FSI).\n* [AWSSDK.FinSpaceData](https://www.nuget.org/packages/AWSSDK.FinSpaceData/)\n\t* This is the initial SDK release for the data APIs for Amazon FinSpace. Amazon FinSpace is a data management and analytics application for the financial services industry (FSI).\n* [AWSSDK.FIS](https://www.nuget.org/packages/AWSSDK.FIS/)\n\t* Initial release of AWS Fault Injection Simulator, a managed service that enables you to perform fault injection experiments on your AWS workloads\n* [AWSSDK.FMS](https://www.nuget.org/packages/AWSSDK.FMS/)\n\t* This release is the initial release version for AWS Firewall Manager, a new AWS service that makes it easy for customers to centrally configure WAF rules across all their resources (ALBs and CloudFront distributions) and across accounts.\n* [AWSSDK.ForecastQueryService](https://www.nuget.org/packages/AWSSDK.ForecastQueryService/)\n\t* Amazon Forecast is a fully managed machine learning service that makes it easy for customers to generate accurate forecasts using their historical time-series data\n* [AWSSDK.ForecastService](https://www.nuget.org/packages/AWSSDK.ForecastService/)\n\t* Amazon Forecast is a fully managed machine learning service that makes it easy for customers to generate accurate forecasts using their historical time-series data\n* [AWSSDK.FraudDetector](https://www.nuget.org/packages/AWSSDK.FraudDetector/)\n\t* Amazon Fraud Detector is a fully managed service that makes it easy to identify potentially fraudulent online activities such as online payment fraud and the creation of fake accounts. Amazon Fraud Detector uses your data, machine learning (ML), and more than 20 years of fraud detection expertise from Amazon to automatically identify potentially fraudulent online activity so you can catch more fraud faster.\n* [AWSSDK.FreeTier](https://www.nuget.org/packages/AWSSDK.FreeTier/)\n\t* This is the initial SDK release for the AWS Free Tier GetFreeTierUsage API\n* [AWSSDK.FSx](https://www.nuget.org/packages/AWSSDK.FSx/)\n\t* Amazon FSx provides fully-managed third-party file systems optimized for a variety of enterprise and compute-intensive workloads.\n* [AWSSDK.GameLift](https://www.nuget.org/packages/AWSSDK.GameLift/)\n\t* Amazon GameLift Service is a managed AWS service for developers who need a scalable, server-based solution for multiplayer games.\n* [AWSSDK.GeoMaps](https://www.nuget.org/packages/AWSSDK.GeoMaps/)\n\t* Release of Amazon Location Maps API. Maps enables you to build digital maps that showcase your locations, visualize your data, and unlock insights to drive your business\n* [AWSSDK.GeoPlaces](https://www.nuget.org/packages/AWSSDK.GeoPlaces/)\n\t* Release of Amazon Location Places API. Places enables you to quickly search, display, and filter places, businesses, and locations based on proximity, category, and name\n* [AWSSDK.GeoRoutes](https://www.nuget.org/packages/AWSSDK.GeoRoutes/)\n\t* Release of Amazon Location Routes API. Routes enables you to plan efficient routes and streamline deliveries by leveraging real-time traffic, vehicle restrictions, and turn-by-turn directions.\n* [AWSSDK.Glacier](https://www.nuget.org/packages/AWSSDK.Glacier/)\n\t* Amazon Glacier is a secure, durable, and extremely low-cost storage service for data archiving and online backup.\n* [AWSSDK.GlobalAccelerator](https://www.nuget.org/packages/AWSSDK.GlobalAccelerator/)\n\t* AWS Global Accelerator is a network layer service that helps you improve the availability and performance of the applications that you offer to your global customers. Global Accelerator uses the AWS global network to direct internet traffic from your users to your applications running in AWS Regions. Global Accelerator creates a fixed entry point for your applications through static anycast IP addresses, and routes user traffic to the optimal endpoint based on performance, application health and routing policies that you can configure. Global Accelerator supports the following features at launch: static anycast IP addresses, support for TCP and UDP, support for Network Load Balancers, Application Load Balancers and Elastic-IP address endpoints,  continuous health checking, instant regional failover, fault isolating Network Zones, granular traffic controls, and client affinity.\n* [AWSSDK.Glue](https://www.nuget.org/packages/AWSSDK.Glue/)\n\t* AWS Glue is a fully managed extract, transform, and load (ETL) service that makes it easy for customers to prepare and load their data for analytics. You can create and run an ETL job with a few clicks in the AWS Management Console. You simply point AWS Glue to your data stored on AWS, and AWS Glue discovers your data and stores the associated metadata (e.g. table definition and schema) in the AWS Glue Data Catalog. Once cataloged, your data is immediately searchable, queryable, and available for ETL. AWS Glue generates the code to execute your data transformations and data loading processes. AWS Glue generates Python code that is entirely customizable, reusable, and portable. Once your ETL job is ready, you can schedule it to run on AWS Glue's fully managed, scale-out Spark environment. AWS Glue provides a flexible scheduler with dependency resolution, job monitoring, and alerting. AWS Glue is serverless, so there is no infrastructure to buy, set up, or manage. It automatically provisions the environment needed to complete the job, and customers pay only for the compute resources consumed while running ETL jobs. With AWS Glue, data can be available for analytics in minutes.\n* [AWSSDK.GlueDataBrew](https://www.nuget.org/packages/AWSSDK.GlueDataBrew/)\n\t* This is the initial SDK release for AWS Glue DataBrew. DataBrew is a visual data preparation tool that enables users to clean and normalize data without writing any code.\n* [AWSSDK.Greengrass](https://www.nuget.org/packages/AWSSDK.Greengrass/)\n\t* AWS Greengrass is software that lets you run local compute, messaging, and device state synchronization for connected devices in a secure way. With AWS Greengrass, connected devices can run AWS Lambda functions, keep device data in sync, and communicate with other devices securely even when not connected to the Internet. Using AWS Lambda, Greengrass ensures your IoT devices can respond quickly to local events, operate with intermittent connections, and minimize the cost of transmitting IoT data to the cloud.\n* [AWSSDK.GreengrassV2](https://www.nuget.org/packages/AWSSDK.GreengrassV2/)\n\t* AWS IoT Greengrass V2 is a new major version of AWS IoT Greengrass. This release adds several updates such as modular components, continuous deployments, and improved ease of use.\n* [AWSSDK.GroundStation](https://www.nuget.org/packages/AWSSDK.GroundStation/)\n\t* AWS Ground Station is a fully managed service that enables you to control satellite communications, downlink and process satellite data, and scale your satellite operations efficiently and cost-effectively without having to build or manage your own ground station infrastructure.\n* [AWSSDK.GuardDuty](https://www.nuget.org/packages/AWSSDK.GuardDuty/)\n\t* Enable Amazon GuardDuty to continuously monitor and process AWS data sources to identify threats to your AWS accounts and workloads. You can add customization by uploading additional threat intelligence lists and IP safe lists. You can list security findings, suspend, and disable the service.\n* [AWSSDK.HealthLake](https://www.nuget.org/packages/AWSSDK.HealthLake/)\n\t* This release introduces Amazon HealthLake (preview), a HIPAA-eligible service that enables healthcare and life sciences customers to store, transform, query, and analyze health data in the AWS Cloud.\n* [AWSSDK.IAMRolesAnywhere](https://www.nuget.org/packages/AWSSDK.IAMRolesAnywhere/)\n\t* IAM Roles Anywhere allows your workloads such as servers, containers, and applications to obtain temporary AWS credentials and use the same IAM roles and policies that you have configured for your AWS workloads to access AWS resources.\n* [AWSSDK.IdentityManagement](https://www.nuget.org/packages/AWSSDK.IdentityManagement/)\n\t* AWS Identity and Access Management (IAM) enables you to securely control access to AWS services and resources for your users. Using IAM, you can create and manage AWS users and groups, and use permissions to allow and deny their access to AWS resources.\n* [AWSSDK.IdentityStore](https://www.nuget.org/packages/AWSSDK.IdentityStore/)\n\t* AWS Single Sign-On (SSO) Identity Store service provides an interface to retrieve all of your users and groups. It enables entitlement management per user or group for AWS SSO and other IDPs.\n* [AWSSDK.Imagebuilder](https://www.nuget.org/packages/AWSSDK.Imagebuilder/)\n\t* This is the first release of EC2 Image Builder, a service that provides a managed experience for automating the creation of EC2 AMIs.\n* [AWSSDK.ImportExport](https://www.nuget.org/packages/AWSSDK.ImportExport/)\n\t* AWS Import/Export accelerates moving large amounts of data into and out of the AWS cloud using portable storage devices for transport.\n* [AWSSDK.Inspector](https://www.nuget.org/packages/AWSSDK.Inspector/)\n\t* Amazon Inspector identifies security issues in your application deployments.\n* [AWSSDK.Inspector2](https://www.nuget.org/packages/AWSSDK.Inspector2/)\n\t* This release adds support for the new Amazon Inspector API. The new Amazon Inspector can automatically discover and scan Amazon EC2 instances and Amazon ECR container images for software vulnerabilities and unintended network exposure, and report centralized findings across multiple AWS accounts.\n* [AWSSDK.InspectorScan](https://www.nuget.org/packages/AWSSDK.InspectorScan/)\n\t* This release adds support for the new Amazon Inspector Scan API. The new Inspector Scan API can synchronously scan SBOMs adhering to the CycloneDX v1.5 format.\n* [AWSSDK.InternetMonitor](https://www.nuget.org/packages/AWSSDK.InternetMonitor/)\n\t* CloudWatch Internet Monitor is a a new service within CloudWatch that will help application developers and network engineers continuously monitor internet performance metrics such as availability and performance between their AWS-hosted applications and end-users of these applications\n* [AWSSDK.Invoicing](https://www.nuget.org/packages/AWSSDK.Invoicing/)\n\t* AWS Invoice Configuration allows you to receive separate AWS invoices based on your organizational needs. You can use the AWS SDKs to manage Invoice Units and programmatically fetch the information of the invoice receiver.\n* [AWSSDK.IoT](https://www.nuget.org/packages/AWSSDK.IoT/)\n\t* AWS IoT allows you to leverage AWS to build your Internet of Things.\n* [AWSSDK.IoTAnalytics](https://www.nuget.org/packages/AWSSDK.IoTAnalytics/)\n\t* AWS IoT Analytics is a fully-managed service that makes it easy to run and operationalize sophisticated analytics on massive volumes of IoT data without having to worry about the cost and complexity typically required to build an IoT analytics platform.\n* [AWSSDK.IotData](https://www.nuget.org/packages/AWSSDK.IotData/)\n\t* AWS IoT-Data enables secure, bi-directional communication between Internet-connected things (such as sensors, actuators, embedded devices, or smart appliances) and the AWS cloud. It implements a broker for applications and things to publish messages over HTTP (Publish) and retrieve, update, and delete thing shadows. A thing shadow is a persistent representation of your things and their state in the AWS cloud.\n* [AWSSDK.IoTDeviceAdvisor](https://www.nuget.org/packages/AWSSDK.IoTDeviceAdvisor/)\n\t* AWS IoT Core Device Advisor is fully managed test capability for IoT devices. Device manufacturers can use Device Advisor to test their IoT devices for reliable and secure connectivity with AWS IoT.\n* [AWSSDK.IoTEvents](https://www.nuget.org/packages/AWSSDK.IoTEvents/)\n\t* The AWS IoT Events service allows customers to monitor their IoT devices and sensors to detect failures or changes in operation and to trigger actions when these events occur\n* [AWSSDK.IoTEventsData](https://www.nuget.org/packages/AWSSDK.IoTEventsData/)\n\t* The AWS IoT Events service allows customers to monitor their IoT devices and sensors to detect failures or changes in operation and to trigger actions when these events occur\n* [AWSSDK.IoTFleetHub](https://www.nuget.org/packages/AWSSDK.IoTFleetHub/)\n\t* AWS IoT Fleet Hub, a new feature of AWS IoT Device Management that provides a web application for monitoring and managing device fleets connected to AWS IoT at scale.\n* [AWSSDK.IoTFleetWise](https://www.nuget.org/packages/AWSSDK.IoTFleetWise/)\n\t* General availability (GA) for AWS IoT Fleetwise. It adds AWS IoT Fleetwise to AWS SDK. For more information, see https://docs.aws.amazon.com/iot-fleetwise/latest/APIReference/Welcome.html.\n* [AWSSDK.IoTJobsDataPlane](https://www.nuget.org/packages/AWSSDK.IoTJobsDataPlane/)\n\t* This release adds support for new the service called Iot Jobs. This client is built for the device SDK to use Iot Jobs Device specific APIs.\n* [AWSSDK.IoTSecureTunneling](https://www.nuget.org/packages/AWSSDK.IoTSecureTunneling/)\n\t* This release adds support for IoT Secure Tunneling to remote access devices behind restricted firewalls.\n* [AWSSDK.IoTSiteWise](https://www.nuget.org/packages/AWSSDK.IoTSiteWise/)\n\t* AWS IoT SiteWise is a managed service that makes it easy to collect, store, organize and monitor data from industrial equipment at scale. You can use AWS IoT SiteWise to model your physical assets, processes and facilities, quickly compute common industrial performance metrics, and create fully managed web applications to help analyze industrial equipment data, prevent costly equipment issues, and reduce production inefficiencies.\n* [AWSSDK.IoTThingsGraph](https://www.nuget.org/packages/AWSSDK.IoTThingsGraph/)\n\t* Initial Release.\n* [AWSSDK.IoTTwinMaker](https://www.nuget.org/packages/AWSSDK.IoTTwinMaker/)\n\t* AWS IoT TwinMaker makes it faster and easier to create, visualize and monitor digital twins of real-world systems like buildings, factories and industrial equipment to optimize operations. Learn more: https://docs.aws.amazon.com/iot-twinmaker/latest/apireference/Welcome.html (New Service) (Preview)\n* [AWSSDK.IoTWireless](https://www.nuget.org/packages/AWSSDK.IoTWireless/)\n\t* AWS IoT for LoRaWAN enables customers to setup a private LoRaWAN network by connecting their LoRaWAN devices and gateways to the AWS cloud without managing a LoRaWAN Network Server.\n* [AWSSDK.IVS](https://www.nuget.org/packages/AWSSDK.IVS/)\n\t* Introducing Amazon Interactive Video Service - a managed live streaming solution that is quick and easy to set up, and ideal for creating interactive video experiences.\n* [AWSSDK.Ivschat](https://www.nuget.org/packages/AWSSDK.Ivschat/)\n\t* Adds new APIs for IVS Chat, a feature for building interactive chat experiences alongside an IVS broadcast.\n* [AWSSDK.IVSRealTime](https://www.nuget.org/packages/AWSSDK.IVSRealTime/)\n\t* Initial release of the Amazon Interactive Video Service RealTime API.\n* [AWSSDK.Kafka](https://www.nuget.org/packages/AWSSDK.Kafka/)\n\t* Amazon Managed Streaming for Kafka (Amazon MSK). Amazon MSK is a service that you can use to easily build, monitor, and manage Apache Kafka clusters in the cloud.\n* [AWSSDK.KafkaConnect](https://www.nuget.org/packages/AWSSDK.KafkaConnect/)\n\t* This is the initial SDK release for Amazon Managed Streaming for Apache Kafka Connect (MSK Connect).\n* [AWSSDK.Kendra](https://www.nuget.org/packages/AWSSDK.Kendra/)\n\t* It is a preview launch of Amazon Kendra. Amazon Kendra is a managed, highly accurate and easy to use enterprise search service that is powered by machine learning.\n* [AWSSDK.KendraRanking](https://www.nuget.org/packages/AWSSDK.KendraRanking/)\n\t* Introducing Amazon Kendra Intelligent Ranking, a new set of Kendra APIs that leverages Kendra semantic ranking capabilities to improve the quality of search results from other search services (i.e. OpenSearch, ElasticSearch, Solr).\n* [AWSSDK.KeyManagementService](https://www.nuget.org/packages/AWSSDK.KeyManagementService/)\n\t* AWS Key Management Service (KMS) is a managed service that makes it easy for you to create and control the encryption keys used to encrypt your data, and uses Hardware Security Modules (HSMs) to protect the security of your keys.\n* [AWSSDK.Keyspaces](https://www.nuget.org/packages/AWSSDK.Keyspaces/)\n\t* This release adds support for data definition language (DDL) operations\n* [AWSSDK.Kinesis](https://www.nuget.org/packages/AWSSDK.Kinesis/)\n\t* Amazon Kinesis is a fully managed, cloud-based service for real-time processing of large, distributed data streams.\n* [AWSSDK.KinesisAnalytics](https://www.nuget.org/packages/AWSSDK.KinesisAnalytics/)\n\t* Amazon Kinesis Analytics is a fully managed service for continuously querying streaming data using standard SQL.\n* [AWSSDK.KinesisAnalyticsV2](https://www.nuget.org/packages/AWSSDK.KinesisAnalyticsV2/)\n\t* Amazon Kinesis Data Analytics now supports Java-based stream processing applications, in addition to the previously supported SQL. Now, you can use your own Java code in Amazon Kinesis Data Analytics to build and run stream processing applications. This new capability also comes with an update to the previous Amazon Kinesis Data Analytics APIs to enable support for different runtime environments and more.\n* [AWSSDK.KinesisFirehose](https://www.nuget.org/packages/AWSSDK.KinesisFirehose/)\n\t* Amazon Kinesis Firehose is a fully managed service for ingesting data streams directly into AWS data services such as Amazon S3 and Amazon Redshift.\n* [AWSSDK.KinesisVideo](https://www.nuget.org/packages/AWSSDK.KinesisVideo/)\n\t* Announcing Amazon Kinesis Video Streams, a fully managed video ingestion and storage service. Kinesis Video Streams makes it easy to securely stream video from connected devices to AWS for machine learning, analytics, and processing. You can also stream other time-encoded data like RADAR and LIDAR signals using Kinesis Video Streams.\n* [AWSSDK.KinesisVideoArchivedMedia](https://www.nuget.org/packages/AWSSDK.KinesisVideoArchivedMedia/)\n\t* Announcing Amazon Kinesis Video Streams, a fully managed video ingestion and storage service. Kinesis Video Streams makes it easy to securely stream video from connected devices to AWS for machine learning, analytics, and processing. You can also stream other time-encoded data like RADAR and LIDAR signals using Kinesis Video Streams.\n* [AWSSDK.KinesisVideoMedia](https://www.nuget.org/packages/AWSSDK.KinesisVideoMedia/)\n\t* Announcing Amazon Kinesis Video Streams, a fully managed video ingestion and storage service. Kinesis Video Streams makes it easy to securely stream video from connected devices to AWS for machine learning, analytics, and processing. You can also stream other time-encoded data like RADAR and LIDAR signals using Kinesis Video Streams.\n* [AWSSDK.KinesisVideoSignalingChannels](https://www.nuget.org/packages/AWSSDK.KinesisVideoSignalingChannels/)\n\t* Announcing support for WebRTC in Kinesis Video Streams, as fully managed capability. You can now use simple APIs to enable your connected devices, web, and mobile apps with real-time two-way media streaming capabilities.\n* [AWSSDK.KinesisVideoWebRTCStorage](https://www.nuget.org/packages/AWSSDK.KinesisVideoWebRTCStorage/)\n\t* Amazon Kinesis Video Streams offers capabilities to stream video and audio in real-time via WebRTC to the cloud for storage, playback, and analytical processing. Customers can use our enhanced WebRTC SDK and cloud APIs to enable real-time streaming, as well as media ingestion to the cloud.\n* [AWSSDK.LakeFormation](https://www.nuget.org/packages/AWSSDK.LakeFormation/)\n\t* Lake Formation: (New Service) AWS Lake Formation is a fully managed service that makes it easier for customers to build, secure and manage data lakes.  AWS Lake Formation simplifies and automates many of the complex manual steps usually required to create data lakes including collecting, cleaning and cataloging data and securely making that data available for analytics and machine learning.\n* [AWSSDK.Lambda](https://www.nuget.org/packages/AWSSDK.Lambda/)\n\t* AWS Lambda is a compute service that runs your code in response to events and automatically manages the compute resources for you, making it easy to build applications that respond quickly to new information.\n* [AWSSDK.LaunchWizard](https://www.nuget.org/packages/AWSSDK.LaunchWizard/)\n\t* AWS Launch Wizard is a service that helps reduce the time it takes to deploy applications to the cloud while providing a guided deployment experience.\n* [AWSSDK.Lex](https://www.nuget.org/packages/AWSSDK.Lex/)\n\t* Amazon Lex is a service for building conversational interactions into any application using voice or text.\n* [AWSSDK.LexModelBuildingService](https://www.nuget.org/packages/AWSSDK.LexModelBuildingService/)\n\t* Amazon Lex is a service for building conversational interfaces into any application using voice and text.\n* [AWSSDK.LexModelsV2](https://www.nuget.org/packages/AWSSDK.LexModelsV2/)\n\t* This release adds support for Amazon Lex V2 APIs for model building.\n* [AWSSDK.LexRuntimeV2](https://www.nuget.org/packages/AWSSDK.LexRuntimeV2/)\n\t* This release adds support for Amazon Lex V2 APIs for runtime, including Streaming APIs for conversation management.\n* [AWSSDK.LicenseManager](https://www.nuget.org/packages/AWSSDK.LicenseManager/)\n\t* AWS License Manager makes it easier to manage licenses in AWS and on premises when customers run applications using existing licenses from a variety of software vendors including Microsoft, SAP, Oracle, and IBM. AWS License Manager automatically tracks and controls license usage once administrators have created and enforced rules that emulate the terms of their licensing agreements. The capabilities of AWS License Manager are available through SDK and Tools, besides the management console and CLI.\n* [AWSSDK.LicenseManagerLinuxSubscriptions](https://www.nuget.org/packages/AWSSDK.LicenseManagerLinuxSubscriptions/)\n\t* AWS License Manager now offers cross-region, cross-account tracking of commercial Linux subscriptions on AWS. This includes subscriptions purchased as part of EC2 subscription-included AMIs, on the AWS Marketplace, or brought to AWS via Red Hat Cloud Access Program.\n* [AWSSDK.LicenseManagerUserSubscriptions](https://www.nuget.org/packages/AWSSDK.LicenseManagerUserSubscriptions/)\n\t* This release supports user based subscription for Microsoft Visual Studio Professional and Enterprise on EC2.\n* [AWSSDK.Lightsail](https://www.nuget.org/packages/AWSSDK.Lightsail/)\n\t* An extremely simplified VM creation and management service.\n* [AWSSDK.LocationService](https://www.nuget.org/packages/AWSSDK.LocationService/)\n\t* Initial release of Amazon Location Service. A new geospatial service providing capabilities to render maps, geocode/reverse geocode, track device locations, and detect geofence entry/exit events.\n* [AWSSDK.LookoutEquipment](https://www.nuget.org/packages/AWSSDK.LookoutEquipment/)\n\t* This release introduces support for Amazon Lookout for Equipment.\n* [AWSSDK.LookoutforVision](https://www.nuget.org/packages/AWSSDK.LookoutforVision/)\n\t* This release introduces support for Amazon Lookout for Vision.\n* [AWSSDK.LookoutMetrics](https://www.nuget.org/packages/AWSSDK.LookoutMetrics/)\n\t* Amazon Lookout for Metrics is now generally available. You can use Lookout for Metrics to monitor your data for anomalies. For more information, see the Amazon Lookout for Metrics Developer Guide.\n* [AWSSDK.MachineLearning](https://www.nuget.org/packages/AWSSDK.MachineLearning/)\n\t* Amazon Machine Learning is a service that makes it easy for developers of all skill levels to use machine learning technology.\n* [AWSSDK.Macie2](https://www.nuget.org/packages/AWSSDK.Macie2/)\n\t* This release introduces a new major version of the Amazon Macie API. You can use this version of the API to develop tools and applications that interact with the new Amazon Macie.\n* [AWSSDK.MailManager](https://www.nuget.org/packages/AWSSDK.MailManager/)\n\t* This release includes a new Amazon SES feature called Mail Manager, which is a set of email gateway capabilities designed to help customers strengthen their organization's email infrastructure, simplify email workflow management, and streamline email compliance control.\n* [AWSSDK.MainframeModernization](https://www.nuget.org/packages/AWSSDK.MainframeModernization/)\n\t* AWS Mainframe Modernization service is a managed mainframe service and set of tools for planning, migrating, modernizing, and running mainframe workloads on AWS\n* [AWSSDK.ManagedBlockchain](https://www.nuget.org/packages/AWSSDK.ManagedBlockchain/)\n\t* (New Service) Amazon Managed Blockchain is a fully managed service that makes it easy to create and manage scalable blockchain networks using popular open source frameworks.\n* [AWSSDK.ManagedBlockchainQuery](https://www.nuget.org/packages/AWSSDK.ManagedBlockchainQuery/)\n\t* Amazon Managed Blockchain (AMB) Query provides serverless access to standardized, multi-blockchain datasets with developer-friendly APIs.\n* [AWSSDK.ManagedGrafana](https://www.nuget.org/packages/AWSSDK.ManagedGrafana/)\n\t* Initial release of the SDK for Amazon Managed Grafana API.\n* [AWSSDK.MarketplaceAgreement](https://www.nuget.org/packages/AWSSDK.MarketplaceAgreement/)\n\t* The AWS Marketplace Agreement Service provides an API interface that helps AWS Marketplace sellers manage their agreements, including listing, filtering, and viewing details about their agreements.\n* [AWSSDK.MarketplaceCatalog](https://www.nuget.org/packages/AWSSDK.MarketplaceCatalog/)\n\t* This is the first release for the AWS Marketplace Catalog service which allows you to list, describe and manage change requests on your published entities on AWS Marketplace. \n* [AWSSDK.MarketplaceDeployment](https://www.nuget.org/packages/AWSSDK.MarketplaceDeployment/)\n\t* AWS Marketplace Deployment is a new service that provides essential features that facilitate the deployment of software, data, and services procured through AWS Marketplace.\n* [AWSSDK.MarketplaceEntitlementService](https://www.nuget.org/packages/AWSSDK.MarketplaceEntitlementService/)\n\t* AWS Marketplace Entitlement Service enables AWS Marketplace sellers to determine the capacity purchased by their customers.\n* [AWSSDK.MarketplaceReporting](https://www.nuget.org/packages/AWSSDK.MarketplaceReporting/)\n\t* The AWS Marketplace Reporting service introduces the GetBuyerDashboard API. This API returns a dashboard that provides visibility into your organization's AWS Marketplace agreements and associated spend across the AWS accounts in your organization.\n* [AWSSDK.MediaConnect](https://www.nuget.org/packages/AWSSDK.MediaConnect/)\n\t* This is the initial release for AWS Elemental MediaConnect, an ingest and transport service for live video. This new AWS service allows broadcasters and content owners to send high-value live content into the cloud, securely transmit it to partners for distribution, and replicate it to multiple destinations around the globe.\n* [AWSSDK.MediaConvert](https://www.nuget.org/packages/AWSSDK.MediaConvert/)\n\t* AWS Elemental MediaConvert is a file-based video conversion service that transforms media into formats required for traditional broadcast and for internet streaming to multi-screen devices.\n* [AWSSDK.MediaLive](https://www.nuget.org/packages/AWSSDK.MediaLive/)\n\t* AWS Elemental MediaLive is a video service that lets you easily create live outputs for broadcast and streaming delivery.\n* [AWSSDK.MediaPackage](https://www.nuget.org/packages/AWSSDK.MediaPackage/)\n\t* AWS Elemental MediaPackage is a just-in-time video packaging and origination service that lets you format highly secure and reliable live outputs for a variety of devices.\n* [AWSSDK.MediaPackageV2](https://www.nuget.org/packages/AWSSDK.MediaPackageV2/)\n\t* Adds support for the MediaPackage Live v2 API\n* [AWSSDK.MediaPackageVod](https://www.nuget.org/packages/AWSSDK.MediaPackageVod/)\n\t* AWS Elemental MediaPackage now supports Video-on-Demand (VOD) workflows. These new features allow you to easily deliver a vast library of source video Assets stored in your own S3 buckets using a small set of simple to set up Packaging Configurations and Packaging Groups.\n* [AWSSDK.MediaStore](https://www.nuget.org/packages/AWSSDK.MediaStore/)\n\t* AWS Elemental MediaStore is an AWS storage service optimized for media. It gives you the performance, consistency, and low latency required to deliver live and on-demand video content. AWS Elemental MediaStore acts as the origin store in your video workflow.\n* [AWSSDK.MediaStoreData](https://www.nuget.org/packages/AWSSDK.MediaStoreData/)\n\t* AWS Elemental MediaStore Data is an AWS storage service optimized for media. It gives you the performance, consistency, and low latency required to deliver live and on-demand video content. AWS Elemental MediaStore Data acts as the origin store in your video workflow.\n* [AWSSDK.MediaTailor](https://www.nuget.org/packages/AWSSDK.MediaTailor/)\n\t* AWS Elemental MediaTailor is a personalization and monetization service that allows scalable server-side ad insertion. The service enables you to serve targeted ads to viewers while maintaining broadcast quality in over-the-top (OTT) video applications. This SDK allows user access to the AWS Elemental MediaTailor configuration interface.\n* [AWSSDK.MedicalImaging](https://www.nuget.org/packages/AWSSDK.MedicalImaging/)\n\t* General Availability (GA) release of AWS Health Imaging, enabling customers to store, transform, and analyze medical imaging data at petabyte-scale.\n* [AWSSDK.MemoryDB](https://www.nuget.org/packages/AWSSDK.MemoryDB/)\n\t* AWS MemoryDB  SDK now supports all APIs for newly launched MemoryDB service.\n* [AWSSDK.Mgn](https://www.nuget.org/packages/AWSSDK.Mgn/)\n\t* Add new service - Application Migration Service.\n* [AWSSDK.MigrationHub](https://www.nuget.org/packages/AWSSDK.MigrationHub/)\n\t* AWS Migration Hub provides a single location to track migrations across multiple AWS and partner solutions. Using Migration Hub allows you to choose the AWS and partner migration tools that best fit your needs, while providing visibility into the status of your entire migration portfolio. Migration Hub also provides key metrics and progress for individual applications, regardless of which tools are being used to migrate them. For example, you might use AWS Database Migration Service, AWS Server Migration Service, and partner migration tools to migrate an application comprised of a database, virtualized web servers, and a bare metal server. Using Migration Hub will provide you with a single screen that shows the migration progress of all the resources in the application. This allows you to quickly get progress updates across all of your migrations, easily identify and troubleshoot any issues, and reduce the overall time and effort spent on your migration projects. Migration Hub is available to all AWS customers at no additional charge. You only pay for the cost of the migration tools you use, and any resources being consumed on AWS. \n* [AWSSDK.MigrationHubConfig](https://www.nuget.org/packages/AWSSDK.MigrationHubConfig/)\n\t* AWS Migration Hub Config Service allows you to get and set the Migration Hub home region for use with AWS Migration Hub and Application Discovery Service\n* [AWSSDK.MigrationHubOrchestrator](https://www.nuget.org/packages/AWSSDK.MigrationHubOrchestrator/)\n\t* Introducing AWS MigrationHubOrchestrator. This is the first public release of AWS MigrationHubOrchestrator.\n* [AWSSDK.MigrationHubRefactorSpaces](https://www.nuget.org/packages/AWSSDK.MigrationHubRefactorSpaces/)\n\t* This is the initial SDK release for AWS Migration Hub Refactor Spaces\n* [AWSSDK.MigrationHubStrategyRecommendations](https://www.nuget.org/packages/AWSSDK.MigrationHubStrategyRecommendations/)\n\t* AWS SDK for Migration Hub Strategy Recommendations. It includes APIs to start the portfolio assessment, import portfolio data for assessment, and to retrieve recommendations. For more information, see the AWS Migration Hub documentation at https://docs.aws.amazon.com/migrationhub/index.html\n* [AWSSDK.MobileAnalytics](https://www.nuget.org/packages/AWSSDK.MobileAnalytics/)\n\t* Amazon Mobile Analytics is a service that lets you simply and cost effectively collect and analyze your application usage data. In addition to providing usage summary charts that are available for quick reference, Amazon Mobile Analytics enables you to set up automatic export of your data to Amazon S3 for use with other data analytics tools such as Amazon Redshift, Amazon Elastic MapReduce (EMR), Extract, Transform and Load (ETL) software, or your own data warehouse.\n* [AWSSDK.MQ](https://www.nuget.org/packages/AWSSDK.MQ/)\n\t* This is the initial SDK release for Amazon MQ. Amazon MQ is a managed message broker service for Apache ActiveMQ that makes it easy to set up and operate message brokers in the cloud.\n* [AWSSDK.MTurk](https://www.nuget.org/packages/AWSSDK.MTurk/)\n\t* Amazon MTurk is a web service that provides an on-demand, scalable, human workforce to complete jobs that humans can do better than computers, for example, recognizing objects in photos.\n* [AWSSDK.MWAA](https://www.nuget.org/packages/AWSSDK.MWAA/)\n\t* (New Service) Amazon MWAA is a managed service for Apache Airflow that makes it easy for data engineers and data scientists to execute data processing workflows in the cloud.\n* [AWSSDK.Neptune](https://www.nuget.org/packages/AWSSDK.Neptune/)\n\t* Amazon Neptune is a fast, reliable graph database service that makes it easy to build and run applications that work with highly connected datasets. Neptune supports popular graph models Property Graph and W3C's Resource Description Frame (RDF), and their respective query languages Apache TinkerPop Gremlin 3.3.2 and SPARQL 1.1. \n* [AWSSDK.Neptunedata](https://www.nuget.org/packages/AWSSDK.Neptunedata/)\n\t* Allows customers to execute data plane actions like bulk loading graphs, issuing graph queries using Gremlin and openCypher directly from the SDK.\n* [AWSSDK.NeptuneGraph](https://www.nuget.org/packages/AWSSDK.NeptuneGraph/)\n\t* This is the initial SDK release for Amazon Neptune Analytics\n* [AWSSDK.NetworkFirewall](https://www.nuget.org/packages/AWSSDK.NetworkFirewall/)\n\t* (New Service) AWS Network Firewall is a managed network layer firewall service that makes it easy to secure your virtual private cloud (VPC) networks and block malicious traffic.\n* [AWSSDK.NetworkFlowMonitor](https://www.nuget.org/packages/AWSSDK.NetworkFlowMonitor/)\n\t* This release adds documentation for a new feature in Amazon CloudWatch called Network Flow Monitor. You can use Network Flow Monitor to get near real-time metrics, including retransmissions and data transferred, for your actual workloads.\n* [AWSSDK.NetworkManager](https://www.nuget.org/packages/AWSSDK.NetworkManager/)\n\t* This is the initial SDK release for AWS Network Manager.\n* [AWSSDK.NetworkMonitor](https://www.nuget.org/packages/AWSSDK.NetworkMonitor/)\n\t* CloudWatch Network Monitor is a new service within CloudWatch that will help network administrators and operators continuously monitor network performance metrics such as round-trip-time and packet loss between their AWS-hosted applications and their on-premises locations.\n* [AWSSDK.Notifications](https://www.nuget.org/packages/AWSSDK.Notifications/)\n\t* This release adds support for AWS User Notifications. You can now configure and view notifications from AWS services in a central location using the AWS SDK.\n* [AWSSDK.NotificationsContacts](https://www.nuget.org/packages/AWSSDK.NotificationsContacts/)\n\t* This release adds support for AWS User Notifications Contacts. You can now configure and view email contacts for AWS User Notifications using the AWS SDK.\n* [AWSSDK.OAM](https://www.nuget.org/packages/AWSSDK.OAM/)\n\t* Amazon CloudWatch Observability Access Manager is a new service that allows configuration of the CloudWatch cross-account observability feature.\n* [AWSSDK.ObservabilityAdmin](https://www.nuget.org/packages/AWSSDK.ObservabilityAdmin/)\n\t* Amazon CloudWatch Observability Admin adds the ability to audit telemetry configuration for AWS resources in customers AWS Accounts and Organizations. The release introduces new APIs to turn on/off the new experience, which supports discovering supported AWS resources and their state of telemetry.\n* [AWSSDK.Omics](https://www.nuget.org/packages/AWSSDK.Omics/)\n\t* Amazon Omics is a new, purpose-built service that can be used by healthcare and life science organizations to store, query, and analyze omics data. The insights from that data can be used to accelerate scientific discoveries and improve healthcare.\n* [AWSSDK.OpenSearchServerless](https://www.nuget.org/packages/AWSSDK.OpenSearchServerless/)\n\t* Publish SDK for Amazon OpenSearch Serverless\n* [AWSSDK.OpenSearchService](https://www.nuget.org/packages/AWSSDK.OpenSearchService/)\n\t* Updated Configuration APIs for Amazon OpenSearch Service (successor to Amazon Elasticsearch Service)\n* [AWSSDK.OpsWorks](https://www.nuget.org/packages/AWSSDK.OpsWorks/)\n\t* AWS OpsWorks is an application management service that makes it easy to deploy and operate applications of all shapes and sizes. You can define the application's architecture and the specification of each component including package installation, software configuration and resources such as storage.\n* [AWSSDK.OpsWorksCM](https://www.nuget.org/packages/AWSSDK.OpsWorksCM/)\n\t* AWS OpsWorks for Chef Automate gives customers a single tenant Chef Automate server. The Chef Automate server is fully managed by AWS and supports automatic backup, restore and upgrade operations.\n* [AWSSDK.Organizations](https://www.nuget.org/packages/AWSSDK.Organizations/)\n\t* AWS Organizations is a web service that enables you to consolidate your multiple AWS accounts into an organization and centrally manage your accounts and their resources.\n* [AWSSDK.OSIS](https://www.nuget.org/packages/AWSSDK.OSIS/)\n\t* Initial release for OpenSearch Ingestion\n* [AWSSDK.Outposts](https://www.nuget.org/packages/AWSSDK.Outposts/)\n\t* This is the initial release for AWS Outposts, a fully managed service that extends AWS infrastructure, services, APIs, and tools to customer sites. AWS Outposts enables you to launch and run EC2 instances and EBS volumes locally at your on-premises location. This release introduces new APIs for creating and viewing Outposts. \n* [AWSSDK.Panorama](https://www.nuget.org/packages/AWSSDK.Panorama/)\n\t* General availability for AWS Panorama. AWS SDK for Panorama includes APIs to manage your devices and nodes, and deploy computer vision applications to the edge. For more information, see the AWS Panorama documentation at http://docs.aws.amazon.com/panorama\n* [AWSSDK.PartnerCentralSelling](https://www.nuget.org/packages/AWSSDK.PartnerCentralSelling/)\n\t* Announcing AWS Partner Central API for Selling: This service launch Introduces new APIs for co-selling opportunity management and related functions. Key features include notifications, a dynamic sandbox for testing, and streamlined validations.\n* [AWSSDK.PaymentCryptography](https://www.nuget.org/packages/AWSSDK.PaymentCryptography/)\n\t* Initial release of AWS Payment Cryptography Control Plane service for creating and managing cryptographic keys used during card payment processing.\n* [AWSSDK.PaymentCryptographyData](https://www.nuget.org/packages/AWSSDK.PaymentCryptographyData/)\n\t* Initial release of AWS Payment Cryptography DataPlane Plane service for performing cryptographic operations typically used during card payment processing.\n* [AWSSDK.PcaConnectorAd](https://www.nuget.org/packages/AWSSDK.PcaConnectorAd/)\n\t* The Connector for AD allows you to use a fully-managed AWS Private CA as a drop-in replacement for your self-managed enterprise CAs without local agents or proxy servers. Enterprises that use AD to manage Windows environments can reduce their private certificate authority (CA) costs and complexity.\n* [AWSSDK.PcaConnectorScep](https://www.nuget.org/packages/AWSSDK.PcaConnectorScep/)\n\t* Connector for SCEP allows you to use a managed, cloud CA to enroll mobile devices and networking gear. SCEP is a widely-adopted protocol used by mobile device management (MDM) solutions for enrolling mobile devices. With the connector, you can use AWS Private CA with popular MDM solutions.\n* [AWSSDK.PCS](https://www.nuget.org/packages/AWSSDK.PCS/)\n\t* Introducing AWS Parallel Computing Service (AWS PCS), a new service makes it easy to setup and manage high performance computing (HPC) clusters, and build scientific and engineering models at virtually any scale on AWS.\n* [AWSSDK.Personalize](https://www.nuget.org/packages/AWSSDK.Personalize/)\n\t* Amazon Personalize is a machine learning service that makes it easy for developers to create individualized recommendations for customers using their applications.\n* [AWSSDK.PersonalizeEvents](https://www.nuget.org/packages/AWSSDK.PersonalizeEvents/)\n\t* Introducing Amazon Personalize  - a machine learning service that makes it easy for developers to create individualized recommendations for customers using their applications.\n* [AWSSDK.PersonalizeRuntime](https://www.nuget.org/packages/AWSSDK.PersonalizeRuntime/)\n\t* Amazon Personalize is a machine learning service that makes it easy for developers to create individualized recommendations for customers using their applications.\n* [AWSSDK.PI](https://www.nuget.org/packages/AWSSDK.PI/)\n\t* Performance Insights is a feature of Amazon Relational Database Service (RDS) that helps you quickly assess the load on your database, and determine when and where to take action. You can use the SDK to retrieve Performance Insights data and integrate your monitoring solutions.\n* [AWSSDK.Pinpoint](https://www.nuget.org/packages/AWSSDK.Pinpoint/)\n\t* Amazon Pinpoint makes it easy to run targeted campaigns to improve user engagement. Pinpoint helps you understand your users behavior, define who to target, what messages to send, when to deliver them, and tracks the results of the campaign.\n* [AWSSDK.PinpointEmail](https://www.nuget.org/packages/AWSSDK.PinpointEmail/)\n\t* This is the first release of the Amazon Pinpoint Email API. You can use this API to configure and send transactional email from your Amazon Pinpoint account to specific email addresses. Unlike campaign-based email that you send from Amazon Pinpoint, you don't have to create segments and campaigns in order to send transactional email. \n* [AWSSDK.PinpointSMSVoice](https://www.nuget.org/packages/AWSSDK.PinpointSMSVoice/)\n\t* With Amazon Pinpoint Voice, you can use text-to-speech technology to deliver personalized voice messages to your customers. Amazon Pinpoint Voice is a way to deliver transactional messages -- such as one-time passwords and appointment confirmations to customers.\n* [AWSSDK.PinpointSMSVoiceV2](https://www.nuget.org/packages/AWSSDK.PinpointSMSVoiceV2/)\n\t* Amazon Pinpoint now offers a version 2.0 suite of SMS and voice APIs, providing increased control over sending and configuration. This release is a new SDK for sending SMS and voice messages called PinpointSMSVoiceV2.\n* [AWSSDK.Pipes](https://www.nuget.org/packages/AWSSDK.Pipes/)\n\t* AWS introduces new Amazon EventBridge Pipes which allow you to connect sources (SQS, Kinesis, DDB, Kafka, MQ) to Targets (14+ EventBridge Targets) without any code, with filtering, batching, input transformation, and an optional Enrichment stage (Lambda, StepFunctions, ApiGateway, ApiDestinations)\n* [AWSSDK.Polly](https://www.nuget.org/packages/AWSSDK.Polly/)\n\t* Amazon Polly is a service that turns text into lifelike speech, making it easy to develop applications that use high-quality speech to increase engagement and accessibility.\n* [AWSSDK.Pricing](https://www.nuget.org/packages/AWSSDK.Pricing/)\n\t* We launched new service, Price List Service.\n* [AWSSDK.Private5G](https://www.nuget.org/packages/AWSSDK.Private5G/)\n\t* This is the initial SDK release for AWS Private 5G. AWS Private 5G is a managed service that makes it easy to deploy, operate, and scale your own private mobile network at your on-premises location.\n* [AWSSDK.PrometheusService](https://www.nuget.org/packages/AWSSDK.PrometheusService/)\n\t* (New Service) Amazon Managed Service for Prometheus is a fully managed Prometheus-compatible monitoring service that makes it easy to monitor containerized applications securely and at scale.\n* [AWSSDK.Proton](https://www.nuget.org/packages/AWSSDK.Proton/)\n\t* This is the initial SDK release for AWS Proton\n* [AWSSDK.QApps](https://www.nuget.org/packages/AWSSDK.QApps/)\n\t* This is a general availability (GA) release of Amazon Q Apps, a capability of Amazon Q Business. Q Apps leverages data sources your company has provided to enable users to build, share, and customize apps within your organization.\n* [AWSSDK.QBusiness](https://www.nuget.org/packages/AWSSDK.QBusiness/)\n\t* Amazon Q - a generative AI powered application that your employees can use to ask questions and get answers from knowledge spread across disparate content repositories, summarize reports, write articles, take actions, and much more - all within their company's connected content repositories.\n* [AWSSDK.QConnect](https://www.nuget.org/packages/AWSSDK.QConnect/)\n\t* Amazon Q in Connect, an LLM-enhanced evolution of Amazon Connect Wisdom. This release adds generative AI support to Amazon Q Connect QueryAssistant and GetRecommendations APIs.\n* [AWSSDK.QLDB](https://www.nuget.org/packages/AWSSDK.QLDB/)\n\t* Introduces operations needed for managing Amazon QLDB ledgers. This includes the ability to create, delete, modify, and describe Amazon QLDB ledgers. This also includes the ability to cryptographically verify documents and export the journal in a ledger.\n* [AWSSDK.QLDBSession](https://www.nuget.org/packages/AWSSDK.QLDBSession/)\n\t* Amazon QLDB introduces the SendCommand API to interact with data in Amazon QLDB ledgers.\n* [AWSSDK.QuickSight](https://www.nuget.org/packages/AWSSDK.QuickSight/)\n\t* Amazon QuickSight is a fully managed, serverless, cloud business intelligence system that allows you to extend data and insights to every user in your organization. The first release of APIs for Amazon QuickSight introduces embedding and user/group management capabilities. The get-dashboard-embed-url API allows you to obtain an authenticated dashboard URL that can be embedded in application domains whitelisted for QuickSight dashboard embedding. User APIs allow you to programmatically expand and manage your QuickSight deployments while group APIs allow easier permissions management for resources within QuickSight.\n* [AWSSDK.RAM](https://www.nuget.org/packages/AWSSDK.RAM/)\n\t* AWS Resource Access Manager (AWS RAM) enables you to share your resources with any AWS account or through AWS Organizations.\n* [AWSSDK.RDS](https://www.nuget.org/packages/AWSSDK.RDS/)\n\t* Amazon Relational Database Service (Amazon RDS) is a web service that makes it easy to set up, operate, and scale a relational database in the cloud. It provides cost-efficient and resizable capacity while managing time-consuming database management tasks, freeing you up to focus on your applications and business.\n* [AWSSDK.RDSDataService](https://www.nuget.org/packages/AWSSDK.RDSDataService/)\n\t* Amazon RDS Data Service API is an HTTP endpoint to run SQL statements on an Amazon Aurora Serverless DB cluster.\n* [AWSSDK.RecycleBin](https://www.nuget.org/packages/AWSSDK.RecycleBin/)\n\t* This release adds support for Recycle Bin.\n* [AWSSDK.Redshift](https://www.nuget.org/packages/AWSSDK.Redshift/)\n\t* Amazon Redshift is a fast, fully managed, petabyte-scale data warehouse solution that makes it simple and cost-effective to efficiently analyze all your data using your existing business intelligence tools.\n* [AWSSDK.RedshiftDataAPIService](https://www.nuget.org/packages/AWSSDK.RedshiftDataAPIService/)\n\t* The Amazon Redshift Data API is generally available. This release enables querying Amazon Redshift data and listing various database objects.\n* [AWSSDK.RedshiftServerless](https://www.nuget.org/packages/AWSSDK.RedshiftServerless/)\n\t* Add new API operations for Amazon Redshift Serverless, a new way of using Amazon Redshift without needing to manually manage provisioned clusters. The new operations let you interact with Redshift Serverless resources, such as create snapshots, list VPC endpoints, delete resource policies, and more.\n* [AWSSDK.Rekognition](https://www.nuget.org/packages/AWSSDK.Rekognition/)\n\t* AWS Rekognition service does image processing and concept recognition, face detection and identification, face verification, similar face search and face clustering.\n* [AWSSDK.Repostspace](https://www.nuget.org/packages/AWSSDK.Repostspace/)\n\t* Initial release of AWS re:Post Private\n* [AWSSDK.ResilienceHub](https://www.nuget.org/packages/AWSSDK.ResilienceHub/)\n\t* Initial release of AWS Resilience Hub, a managed service that enables you to define, validate, and track the resilience of your applications on AWS\n* [AWSSDK.ResourceExplorer2](https://www.nuget.org/packages/AWSSDK.ResourceExplorer2/)\n\t* This is the initial SDK release for AWS Resource Explorer. AWS Resource Explorer lets your users search for and discover your AWS resources across the AWS Regions in your account.\n* [AWSSDK.ResourceGroups](https://www.nuget.org/packages/AWSSDK.ResourceGroups/)\n\t* AWS Resource Groups lets you search and group AWS resources from multiple services based on their tags.\n* [AWSSDK.ResourceGroupsTaggingAPI](https://www.nuget.org/packages/AWSSDK.ResourceGroupsTaggingAPI/)\n\t* Resource Groups Tagging APIs can help you organize your resources and enable you to simplify resource management, access management, and cost allocation.\n* [AWSSDK.RoboMaker](https://www.nuget.org/packages/AWSSDK.RoboMaker/)\n\t* (New Service) AWS RoboMaker is a service that makes it easy to develop, simulate, and deploy intelligent robotics applications at scale. \n* [AWSSDK.Route53](https://www.nuget.org/packages/AWSSDK.Route53/)\n\t* Amazon Route 53 is a highly available and scalable cloud Domain Name System (DNS) web service.\n* [AWSSDK.Route53Domains](https://www.nuget.org/packages/AWSSDK.Route53Domains/)\n\t* Amazon Route 53 is a highly available and scalable cloud Domain Name System (DNS) web service.\n* [AWSSDK.Route53Profiles](https://www.nuget.org/packages/AWSSDK.Route53Profiles/)\n\t* Route 53 Profiles allows you to apply a central DNS configuration across many VPCs regardless of account.\n* [AWSSDK.Route53RecoveryCluster](https://www.nuget.org/packages/AWSSDK.Route53RecoveryCluster/)\n\t* Amazon Route 53 Application Recovery Controller's routing control - Routing Control Data Plane APIs help you update the state (On/Off) of the routing controls to reroute traffic across application replicas in a 100% available manner.\n* [AWSSDK.Route53RecoveryControlConfig](https://www.nuget.org/packages/AWSSDK.Route53RecoveryControlConfig/)\n\t* Amazon Route 53 Application Recovery Controller's routing control - Routing Control Configuration APIs help you create and delete clusters, control panels, routing controls and safety rules. State changes (On/Off) of routing controls are not part of configuration APIs.\n* [AWSSDK.Route53RecoveryReadiness](https://www.nuget.org/packages/AWSSDK.Route53RecoveryReadiness/)\n\t* Amazon Route 53 Application Recovery Controller's readiness check capability continually monitors resource quotas, capacity, and network routing policies to ensure that the recovery environment is scaled and configured to take over when needed.\n* [AWSSDK.Route53Resolver](https://www.nuget.org/packages/AWSSDK.Route53Resolver/)\n\t* This is the first release of the Amazon Route 53 Resolver API. Customers now have the ability to create and manage Amazon Route 53 Resolver endpoints and Amazon Route 53 Resolver rules.\n* [AWSSDK.S3](https://www.nuget.org/packages/AWSSDK.S3/)\n\t* Amazon Simple Storage Service (Amazon S3), provides developers and IT teams with secure, durable, highly-scalable object storage.\n* [AWSSDK.S3Control](https://www.nuget.org/packages/AWSSDK.S3Control/)\n\t* Add support for new S3 Block Public Access account-level APIs. The Block Public Access settings allow account owners to prevent public access to S3 data via bucket/object ACLs or bucket policies.\n* [AWSSDK.S3Outposts](https://www.nuget.org/packages/AWSSDK.S3Outposts/)\n\t* Amazon S3 on Outposts expands object storage to on-premises AWS Outposts environments, enabling you to store and retrieve objects using S3 APIs and features.\n* [AWSSDK.S3Tables](https://www.nuget.org/packages/AWSSDK.S3Tables/)\n\t* Amazon S3 Tables deliver the first cloud object store with built-in open table format support, and the easiest way to store tabular data at scale.\n* [AWSSDK.SageMaker](https://www.nuget.org/packages/AWSSDK.SageMaker/)\n\t* Amazon SageMaker is a fully-managed service that enables data scientists and developers to quickly and easily build, train, and deploy machine learning models, at scale.\n* [AWSSDK.SagemakerEdgeManager](https://www.nuget.org/packages/AWSSDK.SagemakerEdgeManager/)\n\t* Amazon SageMaker Edge Manager makes it easy to optimize, secure, monitor, and maintain  machine learning (ML) models across fleets of edge devices such as smart cameras, smart speakers, and robots.\n* [AWSSDK.SageMakerFeatureStoreRuntime](https://www.nuget.org/packages/AWSSDK.SageMakerFeatureStoreRuntime/)\n\t* This release adds support for Amazon SageMaker Feature Store, which makes it easy for customers to create, version, share, and manage curated data for machine learning (ML) development.\n* [AWSSDK.SageMakerGeospatial](https://www.nuget.org/packages/AWSSDK.SageMakerGeospatial/)\n\t* This release provides Amazon SageMaker geospatial APIs to build, train, deploy and visualize geospatial models.\n* [AWSSDK.SageMakerMetrics](https://www.nuget.org/packages/AWSSDK.SageMakerMetrics/)\n\t* This release introduces support SageMaker Metrics APIs.\n* [AWSSDK.SageMakerRuntime](https://www.nuget.org/packages/AWSSDK.SageMakerRuntime/)\n\t* Amazon SageMaker is a fully-managed service that enables data scientists and developers to quickly and easily build, train, and deploy machine learning models, at scale.\n* [AWSSDK.SavingsPlans](https://www.nuget.org/packages/AWSSDK.SavingsPlans/)\n\t* This is the first release of Savings Plans, a new flexible pricing model that offers low prices on Amazon EC2 and AWS Fargate usage.\n* [AWSSDK.Scheduler](https://www.nuget.org/packages/AWSSDK.Scheduler/)\n\t* AWS introduces the new Amazon EventBridge Scheduler. EventBridge Scheduler is a serverless scheduler that allows you to create, run, and manage tasks from one central, managed service.\n* [AWSSDK.Schemas](https://www.nuget.org/packages/AWSSDK.Schemas/)\n\t* This release introduces support for Amazon EventBridge schema registry, making it easy to discover and write code for events in EventBridge.\n* [AWSSDK.SecretsManager](https://www.nuget.org/packages/AWSSDK.SecretsManager/)\n\t* AWS Secrets Manager enables you to easily create and manage the secrets that you use in your customer-facing apps. Instead of embedding credentials into your source code, you can dynamically query Secrets Manager from your app whenever you need credentials. You can automatically and frequently rotate your secrets without having to deploy updates to your apps. All secret values are encrypted when they're at rest with AWS KMS, and while they're in transit with HTTPS and TLS.\n* [AWSSDK.SecurityHub](https://www.nuget.org/packages/AWSSDK.SecurityHub/)\n\t* AWS Security Hub provides you with a comprehensive view of your security state within AWS and your compliance with the security industry standards and best practices. Security Hub collects security data from across AWS accounts, services, and supported third-party partners and helps you analyze your security trends and identify the highest priority security issues.\n* [AWSSDK.SecurityIR](https://www.nuget.org/packages/AWSSDK.SecurityIR/)\n\t* AWS Security Incident Response is a purpose-built security incident solution designed to help customers prepare for, respond to, and recover from security incidents.\n* [AWSSDK.SecurityLake](https://www.nuget.org/packages/AWSSDK.SecurityLake/)\n\t* Amazon Security Lake automatically centralizes security data from cloud, on-premises, and custom sources into a purpose-built data lake stored in your account. Security Lake makes it easier to analyze security data, so you can improve the protection of your workloads, applications, and data\n* [AWSSDK.SecurityToken](https://www.nuget.org/packages/AWSSDK.SecurityToken/)\n\t* The AWS Security Token Service (AWS STS) enables you to provide trusted users with temporary credentials that provide controlled access to your AWS resources.\n* [AWSSDK.ServerlessApplicationRepository](https://www.nuget.org/packages/AWSSDK.ServerlessApplicationRepository/)\n\t* First release of the AWS Serverless Application Repository SDK.\n* [AWSSDK.ServerMigrationService](https://www.nuget.org/packages/AWSSDK.ServerMigrationService/)\n\t* AWS Server Migration Service (SMS) is an agentless service which makes it easier and faster for you to migrate thousands of on-premises workloads to AWS.\n* [AWSSDK.ServiceCatalog](https://www.nuget.org/packages/AWSSDK.ServiceCatalog/)\n\t* AWS Service Catalog allows organizations to create and manage catalogs of IT services that are approved for use on AWS.\n* [AWSSDK.ServiceDiscovery](https://www.nuget.org/packages/AWSSDK.ServiceDiscovery/)\n\t* AWS Cloud Map lets you configure public DNS, private DNS, or HTTP namespaces that your microservice applications run in. When an instance of the service becomes available, you can call the AWS Cloud Map API to register the instance with AWS Cloud Map. For public or private DNS namespaces, AWS Cloud Map automatically creates DNS records and an optional health check. Clients that submit public or private DNS queries, or HTTP requests, for the service receive an answer that contains up to eight healthy records.\n* [AWSSDK.ServiceQuotas](https://www.nuget.org/packages/AWSSDK.ServiceQuotas/)\n\t* Service Quotas enables you to view and manage your quotas for AWS services from a central location.\n* [AWSSDK.Shield](https://www.nuget.org/packages/AWSSDK.Shield/)\n\t* AWS Shield protects web applications from large and sophisticated DDoS attacks at Layer 3, 4 and 7. In addition AWS Shield provides visibility in attacks, and access to 24X7 DDoS Response Team.\n* [AWSSDK.Signer](https://www.nuget.org/packages/AWSSDK.Signer/)\n\t* With code signing for IoT, you can sign code that you create for any IoT device that is supported by Amazon Web Services (AWS). Code signing is available through Amazon FreeRTOS and AWS IoT Device Management, and integrated with AWS Certificate Manager (ACM).\n* [AWSSDK.SimpleDB](https://www.nuget.org/packages/AWSSDK.SimpleDB/)\n\t* Amazon SimpleDB is a highly available, scalable, and flexible non-relational data store that enables you to store and query data items using web services requests.\n* [AWSSDK.SimpleEmail](https://www.nuget.org/packages/AWSSDK.SimpleEmail/)\n\t* Amazon SES is an outbound-only email-sending service that provides an easy, cost-effective way for you to send email.\n* [AWSSDK.SimpleEmailV2](https://www.nuget.org/packages/AWSSDK.SimpleEmailV2/)\n\t* This is the first release of version 2 of the Amazon SES API. You can use this API to configure your Amazon SES account, and to send email. This API extends the functionality that exists in the previous version of the Amazon SES API.\n* [AWSSDK.SimpleNotificationService](https://www.nuget.org/packages/AWSSDK.SimpleNotificationService/)\n\t* Amazon Simple Notification Service (Amazon SNS) is a fast, flexible, fully managed push messaging service. Amazon SNS makes it simple and cost-effective to push notifications to Apple, Google, Fire OS, and Windows devices, as well as Android devices in China with Baidu Cloud Push.  You can also use SNS to push notifications to internet connected smart devices, as well as other distributed services.\n* [AWSSDK.SimpleSystemsManagement](https://www.nuget.org/packages/AWSSDK.SimpleSystemsManagement/)\n\t* Amazon EC2 Simple Systems Manager (SSM) enables you to manage a number of administrative and configuration tasks on your instances.\n* [AWSSDK.SimpleWorkflow](https://www.nuget.org/packages/AWSSDK.SimpleWorkflow/)\n\t* Amazon SWF helps developers build, run, and scale background jobs that have parallel or sequential steps. You can think of Amazon SWF as a fully-managed state tracker and task coordinator in the Cloud.\n* [AWSSDK.SimSpaceWeaver](https://www.nuget.org/packages/AWSSDK.SimSpaceWeaver/)\n\t* AWS SimSpace Weaver is a new service that helps customers build spatial simulations at new levels of scale - resulting in virtual worlds with millions of dynamic entities. See the AWS SimSpace Weaver developer guide for more details on how to get started. https://docs.aws.amazon.com/simspaceweaver\n* [AWSSDK.Snowball](https://www.nuget.org/packages/AWSSDK.Snowball/)\n\t* Amazon Snowball is a petabyte-scale data transport solution that uses secure appliances to transfer large amounts of data into and out of the AWS cloud\n* [AWSSDK.SnowDeviceManagement](https://www.nuget.org/packages/AWSSDK.SnowDeviceManagement/)\n\t* AWS Snow Family customers can remotely monitor and operate their connected AWS Snowcone devices.\n* [AWSSDK.SocialMessaging](https://www.nuget.org/packages/AWSSDK.SocialMessaging/)\n\t* This release for AWS End User Messaging includes a public SDK, providing a suite of APIs that enable sending WhatsApp messages to end users.\n* [AWSSDK.SQS](https://www.nuget.org/packages/AWSSDK.SQS/)\n\t* Amazon Simple Queue Service (SQS) is a fast, reliable, scalable, fully managed message queuing service. SQS makes it simple and cost-effective to decouple the components of a cloud application.\n* [AWSSDK.SSMContacts](https://www.nuget.org/packages/AWSSDK.SSMContacts/)\n\t* AWS Systems Manager Incident Manager enables faster resolution of critical application availability and performance issues, management of contacts and post incident analysis\n* [AWSSDK.SSMIncidents](https://www.nuget.org/packages/AWSSDK.SSMIncidents/)\n\t* AWS Systems Manager Incident Manager enables faster resolution of critical application availability and performance issues, management of contacts and post-incident analysis\n* [AWSSDK.SSMQuickSetup](https://www.nuget.org/packages/AWSSDK.SSMQuickSetup/)\n\t* This release adds API support for the QuickSetup feature of AWS Systems Manager\n* [AWSSDK.SsmSap](https://www.nuget.org/packages/AWSSDK.SsmSap/)\n\t* AWS Systems Manager for SAP provides simplified operations and management of SAP applications such as SAP HANA. With this release, SAP customers and partners can automate and simplify their SAP system administration tasks such as backup/restore of SAP HANA.\n* [AWSSDK.SSO](https://www.nuget.org/packages/AWSSDK.SSO/)\n\t* This is an initial release of AWS Single Sign-On (SSO) end-user access. This release adds support for accessing AWS accounts assigned in AWS SSO using short term credentials.\n* [AWSSDK.SSOAdmin](https://www.nuget.org/packages/AWSSDK.SSOAdmin/)\n\t* This is an initial release of AWS Single Sign-On (SSO) Access Management APIs. This release adds support for SSO operations which could be used for managing access to AWS accounts.\n* [AWSSDK.SSOOIDC](https://www.nuget.org/packages/AWSSDK.SSOOIDC/)\n\t* This is an initial release of AWS Single Sign-On OAuth device code authorization service.\n* [AWSSDK.StepFunctions](https://www.nuget.org/packages/AWSSDK.StepFunctions/)\n\t* AWS Step Functions is a web service that enables you to coordinate a network of computing resources across distributed components using state machines.\n* [AWSSDK.StorageGateway](https://www.nuget.org/packages/AWSSDK.StorageGateway/)\n\t* The AWS Storage Gateway is a service connecting an on-premises software appliance with cloud-based storage to provide seamless and secure integration between an organization's on-premises IT environment and AWS's storage infrastructure.\n* [AWSSDK.SupplyChain](https://www.nuget.org/packages/AWSSDK.SupplyChain/)\n\t* This release includes APIs CreateBillOfMaterialsImportJob and GetBillOfMaterialsImportJob.\n* [AWSSDK.SupportApp](https://www.nuget.org/packages/AWSSDK.SupportApp/)\n\t* This is the initial SDK release for the AWS Support App in Slack.\n* [AWSSDK.Synthetics](https://www.nuget.org/packages/AWSSDK.Synthetics/)\n\t* Introducing CloudWatch Synthetics. This is the first public release of CloudWatch Synthetics.\n* [AWSSDK.TaxSettings](https://www.nuget.org/packages/AWSSDK.TaxSettings/)\n\t* Initial release of AWS Tax Settings API\n* [AWSSDK.Textract](https://www.nuget.org/packages/AWSSDK.Textract/)\n\t* Amazon Textract enables you to add document text detection and analysis to your applications. You provide a document image to the Amazon Textract API, and the service detects the document text. Amazon Textract works with formatted text and can detect words and lines of words that are located close to each other. It can also analyze a document for items such as related text, tables, key-value pairs, and selection elements.\n* [AWSSDK.TimestreamInfluxDB](https://www.nuget.org/packages/AWSSDK.TimestreamInfluxDB/)\n\t* This is the initial SDK release for Amazon Timestream for InfluxDB. Amazon Timestream for InfluxDB is a new time-series database engine that makes it easy for application developers and DevOps teams to run InfluxDB databases on AWS for near real-time time-series applications using open source APIs.\n* [AWSSDK.TimestreamQuery](https://www.nuget.org/packages/AWSSDK.TimestreamQuery/)\n\t* (New Service) Amazon Timestream is a fast, scalable, fully managed, purpose-built time series database that makes it easy to store and analyze trillions of time series data points per day.\n* [AWSSDK.TimestreamWrite](https://www.nuget.org/packages/AWSSDK.TimestreamWrite/)\n\t* (New Service) Amazon Timestream is a fast, scalable, fully managed, purpose-built time series database that makes it easy to store and analyze trillions of time series data points per day.\n* [AWSSDK.Tnb](https://www.nuget.org/packages/AWSSDK.Tnb/)\n\t* This is the initial SDK release for AWS Telco Network Builder (TNB). AWS Telco Network Builder is a network automation service that helps you deploy and manage telecom networks.\n* [AWSSDK.TranscribeService](https://www.nuget.org/packages/AWSSDK.TranscribeService/)\n\t* Amazon Transcribe Public Preview Release\n* [AWSSDK.Transfer](https://www.nuget.org/packages/AWSSDK.Transfer/)\n\t* AWS Transfer for SFTP is a fully managed service that enables transfer of secure data over the internet into and out of Amazon S3. SFTP is deeply embedded in data exchange workflows across different industries such as financial services, healthcare, advertising, and retail, among others.\n* [AWSSDK.Translate](https://www.nuget.org/packages/AWSSDK.Translate/)\n\t* Public preview release of Amazon Translate and the Amazon Translate Developer Guide. For more information, see the Amazon Translate Developer Guide.\n* [AWSSDK.TrustedAdvisor](https://www.nuget.org/packages/AWSSDK.TrustedAdvisor/)\n\t* AWS Trusted Advisor introduces new APIs to enable you to programmatically access Trusted Advisor best practice checks, recommendations, and prioritized recommendations. Trusted Advisor APIs enable you to integrate Trusted Advisor with your operational tools to automate your workloads.\n* [AWSSDK.VerifiedPermissions](https://www.nuget.org/packages/AWSSDK.VerifiedPermissions/)\n\t* GA release of Amazon Verified Permissions.\n* [AWSSDK.VoiceID](https://www.nuget.org/packages/AWSSDK.VoiceID/)\n\t* Released the Amazon Voice ID SDK, for usage with the Amazon Connect Voice ID feature released for Amazon Connect.\n* [AWSSDK.VPCLattice](https://www.nuget.org/packages/AWSSDK.VPCLattice/)\n\t* General Availability (GA) release of Amazon VPC Lattice\n* [AWSSDK.WAF](https://www.nuget.org/packages/AWSSDK.WAF/)\n\t* AWS WAF (Web Application Firewall) protects web applications from attack by allowing customers to block bad actors and provides filters against common web exploits like SQL injection.\n* [AWSSDK.WAFRegional](https://www.nuget.org/packages/AWSSDK.WAFRegional/)\n\t* AWS WAF (Web Application Firewall) Regional protects web applications from attack via ALB load balancer and provides API to associate it with a WAF WebACL.\n* [AWSSDK.WAFV2](https://www.nuget.org/packages/AWSSDK.WAFV2/)\n\t* This release introduces new set of APIs (wafv2) for AWS WAF. Major changes include single set of APIs for creating/updating resources in global and regional scope, and rules are configured directly into web ACL instead of being referenced. The previous APIs (waf and waf-regional) are now referred as AWS WAF Classic. For more information visit: https://docs.aws.amazon.com/waf/latest/APIReference/Welcome.html\n* [AWSSDK.WellArchitected](https://www.nuget.org/packages/AWSSDK.WellArchitected/)\n\t* This is the first release of AWS Well-Architected Tool API support, use to review your workload and compare against the latest AWS architectural best practices.\n* [AWSSDK.WorkDocs](https://www.nuget.org/packages/AWSSDK.WorkDocs/)\n\t* Amazon WorkDocs is a fully managed, secure enterprise storage and sharing service with strong administrative controls and feedback capabilities that improve user productivity.\n* [AWSSDK.WorkMail](https://www.nuget.org/packages/AWSSDK.WorkMail/)\n\t* Today, Amazon WorkMail released an administrative SDK and enabled AWS CloudTrail integration. With the administrative SDK, you can natively integrate WorkMail with your existing services. The SDK enables programmatic user, resource, and group management through API calls. This means your existing IT tools and workflows can now automate WorkMail management, and third party applications can streamline WorkMail migrations and account actions.\n* [AWSSDK.WorkMailMessageFlow](https://www.nuget.org/packages/AWSSDK.WorkMailMessageFlow/)\n\t* This release allows customers to access email messages as they flow to and from Amazon WorkMail.\n* [AWSSDK.WorkSpaces](https://www.nuget.org/packages/AWSSDK.WorkSpaces/)\n\t* Amazon WorkSpaces is a managed desktop computing service in the cloud.\n* [AWSSDK.WorkSpacesThinClient](https://www.nuget.org/packages/AWSSDK.WorkSpacesThinClient/)\n\t* Initial release of Amazon WorkSpaces Thin Client\n* [AWSSDK.WorkSpacesWeb](https://www.nuget.org/packages/AWSSDK.WorkSpacesWeb/)\n\t* This is the initial SDK release for Amazon WorkSpaces Web. Amazon WorkSpaces Web is a low-cost, fully managed WorkSpace built to deliver secure web-based workloads and software-as-a-service (SaaS) application access to users within existing web browsers.\n* [AWSSDK.XRay](https://www.nuget.org/packages/AWSSDK.XRay/)\n\t* AWS X-Ray helps developers analyze and debug distributed applications. With X-Ray, you can understand how your application and its underlying services are performing to identify and troubleshoot the root cause of performance issues and errors.\n\n### Code Generator\n\nAll low-level service clients are created using the code generator found in the **generator** folder. The code generator \nuses the service models defined in the **generator\\ServiceModels** folder.\n\n[nuget-info]: https://nuget.org/\n[aws]: http://aws.amazon.com/\n[sdk-website]: http://aws.amazon.com/sdkfornet\n[sdk-forum]: http://developer.amazonwebservices.com/connect/forum.jspa?forumID=61\n[sdk-source]: https://github.com/aws/aws-sdk-net\n[sdk-issues]: https://github.com/aws/aws-sdk-net/issues\n[sdk-license]: http://aws.amazon.com/apache2.0/\n[docs-api]: http://docs.aws.amazon.com/sdkfornet/v3/apidocs/Index.html\n[docs-signup]: http://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/net-dg-setup.html\n[aws-iam-credentials]: http://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/net-dg-hosm.html\n[docs-guide]: http://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/welcome.html\n[credentials-management]: http://docs.aws.amazon.com/sdk-for-net/latest/developer-guide/net-dg-config-creds.html\n[dotnet-blog]: http://blogs.aws.amazon.com/net/\n[github-aws-sdk-net-v2]: https://github.com/aws/aws-sdk-net/tree/aws-sdk-net-v2\n\n\n"
        },
        {
          "name": "SDK.CHANGELOG.MD",
          "type": "blob",
          "size": 0.1298828125,
          "content": "The changelogs have been moved to the changelogs folder. The changelogs folder contains yearly changelogs and a monolithic changelog."
        },
        {
          "name": "buildtools",
          "type": "tree",
          "content": null
        },
        {
          "name": "changelogs",
          "type": "tree",
          "content": null
        },
        {
          "name": "docgenerator",
          "type": "tree",
          "content": null
        },
        {
          "name": "extensions",
          "type": "tree",
          "content": null
        },
        {
          "name": "generator",
          "type": "tree",
          "content": null
        },
        {
          "name": "sdk",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}