{
  "metadata": {
    "timestamp": 1736710682744,
    "page": 39,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "t1m0thyj/WinDynamicDesktop",
      "stars": 4471,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".env.example",
          "type": "blob",
          "size": 0.0390625,
          "content": "LOCATIONIQ_API_KEY=\nPOEDITOR_API_TOKEN=\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.4912109375,
          "content": "dist/\r\nthemes/\r\nuwp/AppPackages/\r\nuwp/BundleArtifacts/\r\nuwp/*.assets.cache\r\nuwp/Package.StoreAssociation.xml\r\n.env\r\n*.pot\r\n\r\n*.swp\r\n*.*~\r\nproject.lock.json\r\n.DS_Store\r\n*.pyc\r\nnupkg/\r\n\r\n# Visual Studio Code\r\n.vscode\r\n\r\n# Rider\r\n.idea\r\n\r\n# User-specific files\r\n*.suo\r\n*.user\r\n*.userosscache\r\n*.sln.docstates\r\n\r\n# Build results\r\n[Dd]ebug/\r\n[Dd]ebugPublic/\r\n[Rr]elease/\r\n[Rr]eleases/\r\nx64/\r\nx86/\r\nbuild/\r\nbld/\r\n[Bb]in/\r\n[Oo]bj/\r\n[Oo]ut/\r\nmsbuild.log\r\nmsbuild.err\r\nmsbuild.wrn\r\n\r\n# Visual Studio 2015\r\n.vs/\r\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 11.06640625,
          "content": "# Changelog\r\n\r\n## `5.6.0`\r\n\r\n### Enhancements\r\n\r\n* Added Sequoia Abstract theme\r\n* Added [command line support](https://github.com/t1m0thyj/WinDynamicDesktop/wiki/Frequently-asked-questions#how-can-i-automate-actions-in-the-app) for actions like selecting themes, refreshing wallpaper, and toggling theme mode ([#585](https://github.com/t1m0thyj/WinDynamicDesktop/issues/585))\r\n\r\n### Bug Fixes\r\n\r\n* Fixed error that could happen when changing theme and in a region where sun stays up all day ([#599](https://github.com/t1m0thyj/WinDynamicDesktop/issues/599))\r\n* Fixed crash on startup when number of monitors has increased since the last time app ran ([#604](https://github.com/t1m0thyj/WinDynamicDesktop/issues/604))\r\n* Fixed automatic location not updating when app is restarted or Refresh Wallpaper command is run\r\n\r\n## `5.5.0`\r\n\r\n**Note:** PowerShell scripts written for older versions of WinDD will stop working and must be updated. To update them, download the latest scripts from [here](https://windd.info/scripts/) and revise any custom scripts.\r\n\r\n### Enhancements\r\n\r\n* Added light mode as alternative to dark mode that always shows day images ([#547](https://github.com/t1m0thyj/WinDynamicDesktop/issues/547))\r\n* Added option to show only installed themes in Select Theme dialog ([#576](https://github.com/t1m0thyj/WinDynamicDesktop/issues/576))\r\n\r\n### Bug Fixes\r\n\r\n* Fixed error in wallpaper scheduler the day after Daylight Saving Time begins ([#579](https://github.com/t1m0thyj/WinDynamicDesktop/issues/579))\r\n* Fixed invalid format strings for some translations like Javanese ([#580](https://github.com/t1m0thyj/WinDynamicDesktop/issues/580))\r\n* Fixed error when downloading beta translations from POEditor ([#581](https://github.com/t1m0thyj/WinDynamicDesktop/issues/581))\r\n\r\n## `5.4.2`\r\n\r\n**Note:** Version 5.4.0 had a bug causing the Change Lockscreen Image setting to be disabled for some users. If you had this option selected, check lock screen settings in the Select Theme dialog to ensure it is still enabled after upgrading.\r\n\r\n* Fixed error when shuffle theme option is enabled and Windows 11 theme gets picked ([#563](https://github.com/t1m0thyj/WinDynamicDesktop/issues/563))\r\n* Fixed error when setting lock screen image and no other displays have wallpaper set ([#564](https://github.com/t1m0thyj/WinDynamicDesktop/issues/564))\r\n* Fixed crash when disconnecting user account if app is running in background ([#569](https://github.com/t1m0thyj/WinDynamicDesktop/issues/569))\r\n* Fixed hang when uninstalling app from Microsoft Store ([#570](https://github.com/t1m0thyj/WinDynamicDesktop/issues/570))\r\n* Fixed ellipsis (3 dots) button in Select Theme dialog not rendering on high-DPI displays\r\n\r\n## `5.4.1`\r\n\r\n* Fixed crash when opening Select Theme dialog due to resource missing from Release build ([#562](https://github.com/t1m0thyj/WinDynamicDesktop/issues/562))\r\n\r\n## `5.4.0`\r\n\r\n### Enhancements\r\n\r\n* Added shuffle option to include only favorite themes ([#359](https://github.com/t1m0thyj/WinDynamicDesktop/issues/359))\r\n* Added shuffle option to change frequency to hourly, daily, weekly, or monthly ([#397](https://github.com/t1m0thyj/WinDynamicDesktop/issues/397))\r\n* Added lock screen as another display in Select Theme dialog which can have a separate theme applied ([#500](https://github.com/t1m0thyj/WinDynamicDesktop/issues/500))\r\n* Added Windows 11 wallpaper to list of built-in dynamic wallpapers (only for Windows 11) ([#526](https://github.com/t1m0thyj/WinDynamicDesktop/issues/526))\r\n* Made wallpaper timing more accurate for polar day and polar night by showing brightest image at solar noon ([#545](https://github.com/t1m0thyj/WinDynamicDesktop/issues/545))\r\n* Added Slovak, Tamil, and Uyghur translations (thanks Ignus, Arjun, and Widio)\r\n* Updated from .NET 6 to .NET 8 (this should not affect most users)\r\n\r\n### Bug Fixes\r\n\r\n* Fixed error in Store app when applying theme if name contains special characters ([#434](https://github.com/t1m0thyj/WinDynamicDesktop/issues/434))\r\n* Fixed crash when Microsoft Store force closes app to update to newer version ([#512](https://github.com/t1m0thyj/WinDynamicDesktop/issues/512))\r\n* Fixed misplaced strings in Configure Schedule dialog when localized ([#513](https://github.com/t1m0thyj/WinDynamicDesktop/issues/513))\r\n* Fixed error that could happen previewing theme with only day and night segments ([#529](https://github.com/t1m0thyj/WinDynamicDesktop/issues/529))\r\n\r\n## `5.3.1`\r\n\r\n* Updated dark theme to stop using buggy Mica effect which may prevent mouse clicks ([#525](https://github.com/t1m0thyj/WinDynamicDesktop/issues/525))\r\n\r\n## `5.3.0`\r\n\r\n* Added Sonoma Abstract theme\r\n* Added support for 3-segment wallpapers ([#442](https://github.com/t1m0thyj/WinDynamicDesktop/issues/442))\r\n* Added Taiwanese translation (thanks SABA)\r\n* Fixed \"The process cannot access the file\" error when downloading themes ([#492](https://github.com/t1m0thyj/WinDynamicDesktop/issues/492))\r\n\r\n## `5.2.1`\r\n\r\n* Fixed `NullReferenceException` when settings.json file is invalid\r\n* Fixed PowerShell scripts not being invoked with the latest version of PowerShell (v7) ([#439](https://github.com/t1m0thyj/WinDynamicDesktop/issues/439))\r\n* Fixed a few strings that were not translatable in Select Theme dialog ([#507](https://github.com/t1m0thyj/WinDynamicDesktop/issues/507))\r\n* Fixed font rendering issues on Windows 11 with light theme ([#508](https://github.com/t1m0thyj/WinDynamicDesktop/issues/508))\r\n* Added Galician and Luxembourgish translations (thanks Juan Paz and Arno)\r\n\r\n## `5.2.0`\r\n\r\n* Added dark UI theme using Mica (only for Windows 11 22H2)\r\n* Added Burmese translation (thanks Febri)\r\n* Fixed user-defined sunrise and sunset times being stored incorrectly for some locales ([#487](https://github.com/t1m0thyj/WinDynamicDesktop/issues/487))\r\n* Fixed IndexOutOfRangeException that could occur when Select Theme dialog is opened and there are multiple monitors ([#498](https://github.com/t1m0thyj/WinDynamicDesktop/issues/498))\r\n* Fixed error when PowerShell scripts run with blank imagePath parameter because there is no active theme\r\n\r\n## `5.1.0`\r\n\r\n**Note:** This version removes syncing wallpaper across virtual desktops in Windows 11 which used an experimental API that is too unstable to support. If you still want this functionality, install the [Sync Virtual Desktops](https://github.com/t1m0thyj/WDD-scripts/tree/master/experimental#synchronize-virtual-desktops) script.\r\n\r\n* Added Ventura Abstract theme ([#451](https://github.com/t1m0thyj/WinDynamicDesktop/issues/451))\r\n* Added dropdown in theme download dialog to select alternate mirrors that may be faster\r\n* Added \"Hide system tray icon\" to menu which hides tray icon until the next time the app is manually launched ([#464](https://github.com/t1m0thyj/WinDynamicDesktop/issues/464))\r\n* Added Estonian translation (thanks ST)\r\n* Fixed error when applying settings and there is no active theme ([#457](https://github.com/t1m0thyj/WinDynamicDesktop/issues/457))\r\n* Fixed theme not updating on displays that were connected when device is sleeping\r\n* Fixed error when theme download is cancelled\r\n* Fixed PowerShell scripts being invoked multiple times with the same arguments\r\n* Fixed incorrect theme name shown in bold when there is no active theme\r\n\r\n## `5.0.3`\r\n\r\n* Fixed IndexOutOfRangeException when Select Theme dialog is opened and there are multiple monitors ([#446](https://github.com/t1m0thyj/WinDynamicDesktop/issues/446))\r\n\r\n## `5.0.2`\r\n\r\n**Note:** Version 5.0.0 had a bug causing automatic update checking to be disabled for fresh installs. If you want automatic updates, check that they are enabled in the system tray menu: More Options -> Check for updates once a week.\r\n\r\n* Updated LocationIQ geocoding provider to stop using endpoint that will be deprecated on June 1\r\n* Fixed display names shown in wrong order in theme dialog ([#420](https://github.com/t1m0thyj/WinDynamicDesktop/issues/420))\r\n* Fixed background not updating when night mode is toggled ([#425](https://github.com/t1m0thyj/WinDynamicDesktop/issues/425))\r\n* Fixed user-defined sunrise and sunset times being stored in wrong locale format ([#432](https://github.com/t1m0thyj/WinDynamicDesktop/issues/432))\r\n* Added Azerbaijani and Hebrew translations (thanks Arzu and elie7han)\r\n\r\n## `5.0.1`\r\n\r\n* Fixed error when wallpaper changes and Change Lockscreen Image is enabled\r\n* Fixed error when wallpaper changes and PowerShell scripts are enabled\r\n* Disabled virtual desktop support for Windows 11 Insider builds ([#421](https://github.com/t1m0thyj/WinDynamicDesktop/issues/421))\r\n\r\n## `5.0.0`\r\n\r\n* Added support for setting separate background on multiple monitors\r\n* Added support for syncing lockscreen image with desktop background\r\n* Added time of day to preview for downloaded themes\r\n* Updated from .NET Framework to .NET 6 which is bundled with the app (thanks @sungaila for helping with this)\r\n* Added Amharic, Catalan, Javanese, Kazakh, Persian, Portuguese, and Thai translations (thanks Yonas, Joaquim, Raihan, Janat, Ali, João, and Chananthip)\r\n\r\n## `4.7.0`\r\n\r\n* Added support for syncing wallpaper across virtual desktops in Windows 11\r\n* Added Arabic U.A.E., Hungarian, and Icelandic translations (thanks mustafa, DJ Phoenix, and Anonymous)\r\n* Fixed startup task being created for all users in installer instead of current user\r\n\r\n## `4.6.0`\r\n\r\n* Added Monterey Abstract theme\r\n* Added estimate of disk space usage in theme previewer\r\n* Added Arabic and Ukrainian translations (thanks Abdul Rahim and Віталій)\r\n* Fixed timezone calculations failing in Oceania\r\n* Fixed config reload overwriting changes on disk\r\n* Fixed open dialogs preventing app from exiting\r\n\r\n## `4.5.0`\r\n\r\n* Added installer option to install for all users\r\n* Added ability to favorite themes to move them to top of list\r\n* Added Croatian, Danish, Finnish, Swedish, and Traditional Chinese translations (thanks Denis Bogdan, Anders Ferdinandus, Klokki, Christian, and Williamrob104)\r\n* Reduced memory usage of theme previewer (thanks @cjvaughter)\r\n* Fixed error when location has different timezone that may be a day ahead of or behind the system clock\r\n* Fixed error when multiple users run the app simultaneously on the same machine\r\n* Fixed hang when invalid images cause thumbnail generation to fail\r\n* Fixed missing data that was not being supplied to PowerShell scripts\r\n* Fixed error when downloading new translations from POEditor\r\n\r\n## `4.4.0`\r\n\r\n* Added 8 new themes from Big Sur 11.0.1\r\n* Added Greek and Vietnamese translations (thanks masterjunior24 and Truong Huynh)\r\n* Fixed issue where wrong preview image was shown for time of day in theme dialog\r\n\r\n## `4.3.1`\r\n\r\n* Fixed error when 2-image themes (e.g., Big Sur Abstract) are selected in theme dialog\r\n\r\n## `4.3.0`\r\n\r\n* Redesigned theme selector dialog to show carousel that autocycles through images (thanks @cjvaughter)\r\n* Added Dutch, Korean, and Indonesian translations (thanks Samuel, jihwan_bong, and @ChrisG661)\r\n* Fixed error when Windows 10 default wallpaper missing\r\n\r\n## `4.2.0`\r\n\r\n* Added Big Sur and Big Sur Abstract themes\r\n* Added Bulgarian and Japanese translations (thanks Marin and Syoyusensation)\r\n* Improved error checking for theme JSON when new themes are installed\r\n* Fixed check for updates failing on Windows 7\r\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.158203125,
          "content": "# Contributing\n\nPull requests are welcome. For major changes, please [open an issue](https://github.com/t1m0thyj/WinDynamicDesktop/issues/new?assignees=&labels=&projects=&template=feature_request.md) to discuss them first.\n\n## How to Build\n\n1. Install [Visual Studio](https://visualstudio.microsoft.com/vs/) (Community edition is fine) with the following workloads:\n    * .NET desktop deployment\n    * Universal Windows Platform deployment\n\n2. Create an env file by copying `.env.example` to `.env`. Define the following variables in it:\n    * `LOCATIONIQ_API_KEY` (optional) - [LocationIQ API key](https://help.locationiq.com/support/solutions/articles/36000172496-how-do-i-get-the-api-key-access-token-) used to get latitude and longitude based on city name\n    * `POEDITOR_API_TOKEN` (optional) - [POEditor API token](https://poeditor.com/account/api) used to test new translations from the POEditor website\n\n3. Open [the solution file](./WinDynamicDesktop.sln) in Visual Studio and build one of the projects:\n    * `WinDynamicDesktop` - Main project to run the app\n    * `WinDynamicDesktop.Package` - UWP project for Microsoft Store app\n    * `WinDynamicDesktop.Tests` - Unit tests\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 16.3330078125,
          "content": "Mozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in\n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE\nfile in a relevant directory) where a recipient would be likely to look\nfor such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n---------------------------------------------------------\n\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\n  defined by the Mozilla Public License, v. 2.0.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.2138671875,
          "content": "<p align=\"center\">\n<img src=\"https://github.com/t1m0thyj/WinDynamicDesktop/blob/main/uwp/Images/Square44x44Logo.scale-200.png?raw=true\">\n<br/>\n<a href=\"https://github.com/t1m0thyj/WinDynamicDesktop/releases\"><img src=\"https://img.shields.io/github/downloads/t1m0thyj/WinDynamicDesktop/total.svg?style=flat-square\" alt=\"GitHub releases\"></a>\n<a href=\"https://chocolatey.org/packages/windynamicdesktop\"><img src=\"https://img.shields.io/chocolatey/v/windynamicdesktop?style=flat-square\" alt=\"Chocolatey package\"></a>\n<a href=\"https://github.com/t1m0thyj/WinDynamicDesktop/actions/workflows/build.yml\"><img src=\"https://img.shields.io/github/actions/workflow/status/t1m0thyj/WinDynamicDesktop/build.yml?branch=main&logo=github&style=flat-square\" alt=\"Build status\"></a>\n</p>\n\n# WinDynamicDesktop\nPort of macOS Mojave Dynamic Desktop feature to Windows 10 and 11. Available on GitHub and the Microsoft Store.\n\n<a href=\"https://github.com/t1m0thyj/WinDynamicDesktop/releases/latest\"><img src=\"https://github.com/t1m0thyj/WinDynamicDesktop/blob/main/images/download_github.png?raw=true\" alt=\"GitHub download\" width=\"142\"></a>\n<a href=\"//www.microsoft.com/store/apps/9nm8n7dq3z5f?cid=storebadge&ocid=badge\"><img src=\"https://developer.microsoft.com/store/badges/images/English_get-it-from-MS.png\" alt=\"Microsoft Store\" width=\"142\"/></a>\n\n## Themes\n\nPick from bundled macOS themes, browse hundreds of themes [available online](https://windd.info/themes/), or [create your own](https://github.com/t1m0thyj/WinDynamicDesktop/wiki/Creating-custom-themes)\n\n![Screenshot of Select Theme window](images/select_theme.png)\n\n## Schedule\n\nChoose a schedule for cycling through wallpaper images over 24 hours\n\n![Screenshot of Configure Timing window](images/configure_schedule.png)\n\n## Scripts\n\nExtend the behavior of WinDynamicDesktop with PowerShell scripts, and share them with other users [here](https://github.com/t1m0thyj/WDD-scripts#readme)\n\n## Supported Devices\n\nWinDynamicDesktop is developed primarily for Windows 11, but should run on any device with Windows 7 or newer. Windows Insider builds are not officially supported.\n\n## Resources\n\n* [Get Help](https://github.com/t1m0thyj/WinDynamicDesktop/wiki)\n* [Translate on POEditor](https://poeditor.com/join/project/DEgfVpyuiK)\n* [.ddw Theme Creator](https://ddw-theme-creator.vercel.app/) (thanks @gdstewart)\n\n## Known Issues\n\n* [Wallpaper fit not remembered in Microsoft Store app](https://github.com/t1m0thyj/WinDynamicDesktop/wiki/Known-issues#wallpaper-fit-not-saved-with-multiple-monitors)\n* [Wallpaper gets stuck and won't update](https://github.com/t1m0thyj/WinDynamicDesktop/wiki/Known-issues#wallpaper-gets-stuck-and-wont-update)\n\n## Limitations\n* [Can't show separate images on multiple virtual desktops](https://github.com/t1m0thyj/WinDynamicDesktop/issues/299)\n\n## Disclaimers\n\n* Wallpaper images are not owned by me, they belong to Apple\n* [LocationIQ API](https://locationiq.org/) is used when your enter your location, to convert it to latitude and longitude\n* Microsoft Store app uses the Windows location API if permission is granted\n* App icon made by [Roundicons](https://www.flaticon.com/authors/roundicons) from [flaticon.com](https://www.flaticon.com/) and is licensed by [CC 3.0 BY](http://creativecommons.org/licenses/by/3.0/)\n"
        },
        {
          "name": "WinDynamicDesktop.sln",
          "type": "blob",
          "size": 6.654296875,
          "content": "﻿\nMicrosoft Visual Studio Solution File, Format Version 12.00\n# Visual Studio Version 17\nVisualStudioVersion = 17.0.32014.148\nMinimumVisualStudioVersion = 10.0.40219.1\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"WinDynamicDesktop\", \"src\\WinDynamicDesktop.csproj\", \"{D752C033-AB46-423A-8611-E2E2A40CA80F}\"\nEndProject\nProject(\"{C7167F0D-BC9F-4E6E-AFE1-012C56B48DB5}\") = \"WinDynamicDesktop.Package\", \"uwp\\WinDynamicDesktop.Package.wapproj\", \"{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}\"\nEndProject\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"WinDynamicDesktop.Tests\", \"test\\WinDynamicDesktop.Tests.csproj\", \"{36DDFE85-328C-4160-8C1C-21C33DC51453}\"\nEndProject\nGlobal\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\n\t\tDebug|Any CPU = Debug|Any CPU\n\t\tDebug|ARM = Debug|ARM\n\t\tDebug|ARM64 = Debug|ARM64\n\t\tDebug|x64 = Debug|x64\n\t\tDebug|x86 = Debug|x86\n\t\tRelease|Any CPU = Release|Any CPU\n\t\tRelease|ARM = Release|ARM\n\t\tRelease|ARM64 = Release|ARM64\n\t\tRelease|x64 = Release|x64\n\t\tRelease|x86 = Release|x86\n\tEndGlobalSection\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|ARM.ActiveCfg = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|ARM.Build.0 = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|ARM64.ActiveCfg = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|ARM64.Build.0 = Debug|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|x64.Build.0 = Debug|x64\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|x86.ActiveCfg = Debug|x86\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Debug|x86.Build.0 = Debug|x86\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|ARM.ActiveCfg = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|ARM.Build.0 = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|ARM64.ActiveCfg = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|ARM64.Build.0 = Release|Any CPU\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|x64.ActiveCfg = Release|x64\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|x64.Build.0 = Release|x64\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|x86.ActiveCfg = Release|x86\n\t\t{D752C033-AB46-423A-8611-E2E2A40CA80F}.Release|x86.Build.0 = Release|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|Any CPU.Deploy.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM.ActiveCfg = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM.Build.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM.Deploy.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM64.ActiveCfg = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM64.Build.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|ARM64.Deploy.0 = Debug|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x64.ActiveCfg = Debug|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x64.Build.0 = Debug|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x64.Deploy.0 = Debug|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x86.ActiveCfg = Debug|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x86.Build.0 = Debug|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Debug|x86.Deploy.0 = Debug|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|Any CPU.Deploy.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM.ActiveCfg = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM.Build.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM.Deploy.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM64.ActiveCfg = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM64.Build.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|ARM64.Deploy.0 = Release|Any CPU\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x64.ActiveCfg = Release|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x64.Build.0 = Release|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x64.Deploy.0 = Release|x64\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x86.ActiveCfg = Release|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x86.Build.0 = Release|x86\n\t\t{D10BBBDF-EFCF-4051-9BFD-9B0AFCD30EE4}.Release|x86.Deploy.0 = Release|x86\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|ARM.ActiveCfg = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|ARM.Build.0 = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|ARM64.ActiveCfg = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|ARM64.Build.0 = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|x64.ActiveCfg = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|x64.Build.0 = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|ARM.ActiveCfg = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|ARM.Build.0 = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|ARM64.ActiveCfg = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|ARM64.Build.0 = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|x64.ActiveCfg = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|x64.Build.0 = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{36DDFE85-328C-4160-8C1C-21C33DC51453}.Release|x86.Build.0 = Release|Any CPU\n\tEndGlobalSection\n\tGlobalSection(SolutionProperties) = preSolution\n\t\tHideSolutionNode = FALSE\n\tEndGlobalSection\n\tGlobalSection(ExtensibilityGlobals) = postSolution\n\t\tSolutionGuid = {C134BA3F-F73D-4C16-8B2A-9511F3562E78}\n\tEndGlobalSection\nEndGlobal\n"
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "uwp",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}