{
  "metadata": {
    "timestamp": 1736710728432,
    "page": 135,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "NoelFB/Celeste",
      "stars": 3637,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0419921875,
          "content": "MIT License\n\nCopyright (c) 2018 Noel Berry\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 0.947265625,
          "content": "# Celeste\nThis repo is used to track issues and bugs with [Celeste](http://www.celestegame.com/). Before submitting an issue, please check the [Celeste changelog](http://www.celestegame.com/changelog.html) and closed issues to see if it has already been fixed.\n\n### Info & Links\n - Tech support and general inquiries should be sent to our email at [contact.celestegame@gmail.com](mailto:contact.celestegame@gmail.com)\n - A changelog of all releases can be [found here](http://www.celestegame.com/changelog.html)\n\n### Source Code\n - We also will be releasing a few of the class files from Celeste, which you will later find in this repo. They're here as a learning resource and for general interest.\n - The Framework Celeste was developed in is also [open source and can be found here](https://bitbucket.org/MattThorson/monocle-engine/src).\n - NOTE: the MIT License only applies to the code in this repo and does not include the actual commercial Celeste game or assets.\n"
        },
        {
          "name": "Source",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}