{
  "metadata": {
    "timestamp": 1736710920067,
    "page": 539,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "IdentityServer/IdentityServer3",
      "stars": 2012,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 2.458984375,
          "content": "###############################################################################\n# Set default behavior to automatically normalize line endings.\n###############################################################################\n* text=auto\n\n###############################################################################\n# Set default behavior for command prompt diff.\n#\n# This is need for earlier builds of msysgit that does not have it on by\n# default for csharp files.\n# Note: This is only used by command line\n###############################################################################\n#*.cs     diff=csharp\n\n###############################################################################\n# Set the merge driver for project and solution files\n#\n# Merging from the command prompt will add diff markers to the files if there\n# are conflicts (Merging from VS is not affected by the settings below, in VS\n# the diff markers are never inserted). Diff markers may cause the following \n# file extensions to fail to load in VS. An alternative would be to treat\n# these files as binary and thus will always conflict and require user\n# intervention with every merge. To do so, just uncomment the entries below\n###############################################################################\n#*.sln       merge=binary\n#*.csproj    merge=binary\n#*.vbproj    merge=binary\n#*.vcxproj   merge=binary\n#*.vcproj    merge=binary\n#*.dbproj    merge=binary\n#*.fsproj    merge=binary\n#*.lsproj    merge=binary\n#*.wixproj   merge=binary\n#*.modelproj merge=binary\n#*.sqlproj   merge=binary\n#*.wwaproj   merge=binary\n\n###############################################################################\n# behavior for image files\n#\n# image files are treated as binary by default.\n###############################################################################\n#*.jpg   binary\n#*.png   binary\n#*.gif   binary\n\n###############################################################################\n# diff behavior for common document formats\n# \n# Convert binary document formats to text before diffing them. This feature\n# is only available from the command line. Turn it on by uncommenting the \n# entries below.\n###############################################################################\n#*.doc   diff=astextplain\n#*.DOC   diff=astextplain\n#*.docx  diff=astextplain\n#*.DOCX  diff=astextplain\n#*.dot   diff=astextplain\n#*.DOT   diff=astextplain\n#*.pdf   diff=astextplain\n#*.PDF   diff=astextplain\n#*.rtf   diff=astextplain\n#*.RTF   diff=astextplain\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.4833984375,
          "content": "## Ignore Visual Studio temporary files, build results, and\n## files generated by popular Visual Studio add-ons.\n\n# Visual Studio 2015 cache/options directory\n.vs/\n# Uncomment if you have tasks that create the project's static files in wwwroot\n#wwwroot/\n\n# DNX\nproject.lock.json\nartifacts/\n\n# User-specific files\n*.suo\n*.user\n*.sln.docstates\n\n# Build results\n\n[Dd]ebug/\n[Rr]elease/\nx64/\nbuild/\n[Bb]in/\n[Oo]bj/\n\n# Enable \"build/\" folder in the NuGet Packages folder since NuGet packages use it for MSBuild targets\n!packages/*/build/\nnuget.exe\n\n# MSTest test Results\n[Tt]est[Rr]esult*/\n[Bb]uild[Ll]og.*\n\n*_i.c\n*_p.c\n*.ilk\n*.meta\n*.obj\n*.pch\n*.pdb\n*.pgc\n*.pgd\n*.rsp\n*.sbr\n*.tlb\n*.tli\n*.tlh\n*.tmp\n*.tmp_proj\n*.log\n*.vspscc\n*.vssscc\n.builds\n*.pidb\n*.log\n*.svclog\n*.scc\n\n# Visual C++ cache files\nipch/\n*.aps\n*.ncb\n*.opensdf\n*.sdf\n*.cachefile\n\n# Visual Studio profiler\n*.psess\n*.vsp\n*.vspx\n\n# Guidance Automation Toolkit\n*.gpState\n\n# ReSharper is a .NET coding add-in\n_ReSharper*/\n*.[Rr]e[Ss]harper\n\n# TeamCity is a build add-in\n_TeamCity*\n\n# DotCover is a Code Coverage Tool\n*.dotCover\n\n# NCrunch\n*.ncrunch*\n.*crunch*.local.xml\n\n# Installshield output folder\n[Ee]xpress/\n\n# DocProject is a documentation generator add-in\nDocProject/buildhelp/\nDocProject/Help/*.HxT\nDocProject/Help/*.HxC\nDocProject/Help/*.hhc\nDocProject/Help/*.hhk\nDocProject/Help/*.hhp\nDocProject/Help/Html2\nDocProject/Help/html\n\n# Click-Once directory\npublish/\n\n# Publish Web Output\n*.Publish.xml\n*.pubxml\n!Local.pubxml\n\n# Visual Studio 2015 cache/options directory\n.vs/\n# Uncomment if you have tasks that create the project's static files in wwwroot\n#wwwroot/\n\n# NuGet Packages Directory\n## TODO: If you have NuGet Package Restore enabled, uncomment the next line\npackages/\n\n# Windows Azure Build Output\ncsx\n*.build.csdef\n\n# Windows Store app package directory\nAppPackages/\n\n# Others\nsql/\n*.Cache\nClientBin/\n[Ss]tyle[Cc]op.*\n~$*\n*~\n*.dbmdl\n*.[Pp]ublish.xml\n*.publishsettings\n\n# RIA/Silverlight projects\nGenerated_Code/\n\n# Backup & report files from converting an old project file to a newer\n# Visual Studio version. Backup files are not needed, because we have git ;-)\n_UpgradeReport_Files/\nBackup*/\nUpgradeLog*.XML\nUpgradeLog*.htm\n\n# SQL Server files\nApp_Data/*.mdf\nApp_Data/*.ldf\n\n# =========================\n# Windows detritus\n# =========================\n\n# Windows image file caches\nThumbs.db\nehthumbs.db\n\n# Folder config file\nDesktop.ini\n\n# Recycle Bin used on file shares\n$RECYCLE.BIN/\n\n# Mac crap\n.DS_Store\ndistribution/\n*_NCrunch_*\nsource/IdentityServer3.sln.GhostDoc.xml\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.0244140625,
          "content": "# How to contribute\n\nThe easiest ways to contribute is to open an issue and start a discussion. \nThen we can decided if and how a feature or a change could be implemented and if you should submit a pull requests with code changes.\n\n## General questions around token-based authentication and architecture?\nWe monitor the `identityserver3` tag on [StackOverflow](https://stackoverflow.com/questions/tagged/?tagnames=identityserver3&sort=newest).\n\n## Feedback and issues?\nPlease start a discussion on the [core repo issue tracker](https://github.com/IdentityServer/IdentityServer3/issues).\n\n## Bugs and feature requests?\nPlease log a new issue in the appropriate GitHub repo:\n\n* [Core](https://github.com/IdentityServer/IdentityServer3)\n* [WS-Federation plugin](https://github.com/IdentityServer/IdentityServer3.WsFederation)\n* [EntityFramework support](https://github.com/IdentityServer/IdentityServer3.EntityFramework)\n* [ASP. NET Identity support](https://github.com/IdentityServer/IdentityServer3.AspNetIdentity)\n* [MembershipReboot support](https://github.com/IdentityServer/IdentityServer3.MembershipReboot)\n* [AccessToken validation](https://github.com/IdentityServer/IdentityServer3.AccessTokenValidation)\n* [Samples](https://github.com/IdentityServer/IdentityServer3.Samples)\n\nDue to the security nature of IdentityServer, errors are very vague. Make sure you read and understand how to enable [logging](https://identityserver.github.io/Documentation/docsv2/configuration/logging.html) before opening an issue/bug report.\n\n## Chat with us and other identityserver users\nhttps://gitter.im/IdentityServer/IdentityServer3\n\n## Filing issues\nThe best way to get your bug fixed is to be as detailed as you can be about the problem.\nProviding a minimal project with steps to reproduce the problem is ideal.\nHere are questions you can answer before you file a bug to make sure you're not missing any important information.\n\n1. Did you read the [documentation](https://identityserver.github.io/Documentation)?\n2. Did you include the snippet of broken code in the issue?\n3. What are the *EXACT* steps to reproduce this problem?\n\nGitHub supports [markdown](http://github.github.com/github-flavored-markdown/), so when filing bugs make sure you check the formatting before clicking submit.\n\n## Contributing code and content\nYou will need to sign a [Contributor License Agreement](https://cla.dotnetfoundation.org/) before submitting your pull request. \n\nMake sure you can build the code. Familiarize yourself with the project workflow and our coding conventions. If you don't know what a pull request is read this article: https://help.github.com/articles/using-pull-requests.\n\n**We only accept PRs to the dev branch.**\n\nBefore submitting a feature or substantial code contribution please discuss it with the team and ensure it follows the product roadmap. Here's a list of blog posts that are worth reading before doing a pull request:\n\n* [Open Source Contribution Etiquette](http://tirania.org/blog/archive/2010/Dec-31.html) by Miguel de Icaza\n* [Don't \"Push\" Your Pull Requests](http://www.igvita.com/2011/12/19/dont-push-your-pull-requests/) by Ilya Grigorik.\n* [10 tips for better Pull Requests](http://blog.ploeh.dk/2015/01/15/10-tips-for-better-pull-requests/) by Mark Seemann\n* [How to write the perfect pull request](https://github.com/blog/1943-how-to-write-the-perfect-pull-request) by GitHub\n\nHere's a few things you should always do when making changes to the code base:\n\n**Commit/Pull Request Format**\n\n```\nSummary of the changes (Less than 80 chars)\n - Detail 1\n - Detail 2\n\n#bugnumber (in this specific format)\n```\n\n**Tests**\n\n-  Tests need to be provided for every bug/feature that is completed.\n-  Tests only need to be present for issues that need to be verified by QA (e.g. not tasks)\n-  If there is a scenario that is far too hard to test there does not need to be a test for it.\n  - \"Too hard\" is determined by the team as a whole.\n\n**Contribution Packages**\n\nIf you are planning to add functionality via contribution packages, we would like you to use `IdentityServer3.Contrib.*` as a naming convention.\n"
        },
        {
          "name": "GitReleaseManager.yaml",
          "type": "blob",
          "size": 0.3896484375,
          "content": "create:\n  include-footer: false\n  footer-heading:\n  footer-content:\n  footer-includes-milestone: false\n  milestone-replace-text:\nexport:\n  include-created-date-in-title: false\n  created-date-string-format:\n  perform-regex-removal: false\n  regex-text:\n  multiline-regex: false\nissue-labels-include:\n- bug fix\n- new feature\n- enhancement\n- breaking change\nissue-labels-exclude:\n- Internal Refactoring\n"
        },
        {
          "name": "ISSUE_TEMPLATE",
          "type": "blob",
          "size": 0.4169921875,
          "content": "## Note: This repository is no longer in active development or maintenance, other than reported security vulnerabilities.\n## If you have questions and are seeking free support, see [here](http://docs.identityserver.io/en/release/intro/support.html#free-support) for more details.\n## If you require commercial support, see [here](http://docs.identityserver.io/en/release/intro/support.html#commercial-support) for more details.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 8.8955078125,
          "content": "Apache License\n\nVersion 2.0, January 2004\n\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n\"License\" shall mean the terms and conditions for use, reproduction, and distribution as defined by Sections 1 through 9 of this document.\n\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner that is granting the License.\n\n\"Legal Entity\" shall mean the union of the acting entity and all other entities that control, are controlled by, or are under common control with that entity. For the purposes of this definition, \"control\" means (i) the power, direct or indirect, to cause the direction or management of such entity, whether by contract or otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such entity.\n\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising permissions granted by this License.\n\n\"Source\" form shall mean the preferred form for making modifications, including but not limited to software source code, documentation source, and configuration files.\n\n\"Object\" form shall mean any form resulting from mechanical transformation or translation of a Source form, including but not limited to compiled object code, generated documentation, and conversions to other media types.\n\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made available under the License, as indicated by a copyright notice that is included in or attached to the work (an example is provided in the Appendix below).\n\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that is based on (or derived from) the Work and for which the editorial revisions, annotations, elaborations, or other modifications represent, as a whole, an original work of authorship. For the purposes of this License, Derivative Works shall not include works that remain separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\n\n\"Contribution\" shall mean any work of authorship, including the original version of the Work and any modifications or additions to that Work or Derivative Works thereof, that is intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an individual or Legal Entity authorized to submit on behalf of the copyright owner. For the purposes of this definition, \"submitted\" means any form of electronic, verbal, or written communication sent to the Licensor or its representatives, including but not limited to communication on electronic mailing lists, source code control systems, and issue tracking systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding communication that is conspicuously marked or otherwise designated in writing by the copyright owner as \"Not a Contribution.\"\n\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom a Contribution has been received by Licensor and subsequently incorporated within the Work.\n\n2. Grant of Copyright License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and distribute the Work and such Derivative Works in Source or Object form.\n\n3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.\n\n4. Redistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium, with or without modifications, and in Source or Object form, provided that You meet the following conditions:\n\nYou must give any other recipients of the Work or Derivative Works a copy of this License; and\nYou must cause any modified files to carry prominent notices stating that You changed the files; and\nYou must retain, in the Source form of any Derivative Works that You distribute, all copyright, patent, trademark, and attribution notices from the Source form of the Work, excluding those notices that do not pertain to any part of the Derivative Works; and\nIf the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative Works that You distribute must include a readable copy of the attribution notices contained within such NOTICE file, excluding those notices that do not pertain to any part of the Derivative Works, in at least one of the following places: within a NOTICE text file distributed as part of the Derivative Works; within the Source form or documentation, if provided along with the Derivative Works; or, within a display generated by the Derivative Works, if and wherever such third-party notices normally appear. The contents of the NOTICE file are for informational purposes only and do not modify the License. You may add Your own attribution notices within Derivative Works that You distribute, alongside or as an addendum to the NOTICE text from the Work, provided that such additional attribution notices cannot be construed as modifying the License. \n\nYou may add Your own copyright statement to Your modifications and may provide additional or different license terms and conditions for use, reproduction, or distribution of Your modifications, or for any such Derivative Works as a whole, provided Your use, reproduction, and distribution of the Work otherwise complies with the conditions stated in this License.\n5. Submission of Contributions. Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in the Work by You to the Licensor shall be under the terms and conditions of this License, without any additional terms or conditions. Notwithstanding the above, nothing herein shall supersede or modify the terms of any separate license agreement you may have executed with Licensor regarding such Contributions.\n\n6. Trademarks. This License does not grant permission to use the trade names, trademarks, service marks, or product names of the Licensor, except as required for reasonable and customary use in describing the origin of the Work and reproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or redistributing the Work and assume any risks associated with Your exercise of permissions under this License.\n\n8. Limitation of Liability. In no event and under no legal theory, whether in tort (including negligence), contract, or otherwise, unless required by applicable law (such as deliberate and grossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for damages, including any direct, indirect, special, incidental, or consequential damages of any character arising as a result of this License or out of the use or inability to use the Work (including but not limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or any and all other commercial damages or losses), even if such Contributor has been advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability. While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for, acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent with this License. However, in accepting such obligations, You may act only on Your own behalf and on Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify, defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against, such Contributor by reason of your accepting any such warranty or additional liability."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.6689453125,
          "content": "# IdentityServer3 #\n\n## Note: This repository is no longer in active development or maintenance, other than reported security vulnerabilities.\n## We highly encourage you to consider [IdentityServer4](https://github.com/IdentityServer/IdentityServer4/) instead.\n## If you have questions and are seeking free support, see [here](http://docs.identityserver.io/en/release/intro/support.html#free-support) for more details.\n## If you require commercial support, see [here](http://docs.identityserver.io/en/release/intro/support.html#commercial-support) for more details.\n\n\nDev build: [![Build status](https://ci.appveyor.com/api/projects/status/rtaj3nb7c60xg7cb/branch/dev?svg=true)](https://ci.appveyor.com/project/leastprivilege/thinktecture/branch/dev)\n[![Gitter](https://badges.gitter.im/JoinChat.svg)](https://gitter.im/IdentityServer/IdentityServer3?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\n![openid_certified](https://cloud.githubusercontent.com/assets/1454075/7611268/4d19de32-f97b-11e4-895b-31b2455a7ca6.png)\n\n[Certified](http://openid.net/certification/) OpenID Connect implementation.\n\n## Overview ##\n\nIdentityServer is a .NET/Katana-based framework and hostable component that allows implementing single sign-on and access control for modern web applications and APIs using protocols like OpenID Connect and OAuth2. It supports a wide range of clients like mobile, web, SPAs and desktop applications and is extensible to allow integration in new and existing architectures.\n\nWatch this for the big picture: [Introduction to OpenID Connect, OAuth2 and IdentityServer](https://vimeo.com/113604459) - and [An Introduction to IdentityServer](https://vimeo.com/154172925) for a more code-centric talk.\n\nGo to the documentation [site](https://identityserver.github.io/Documentation/).\n\n[OpenID Connect specification](http://openid.net/specs/openid-connect-core-1_0.html) / [OAuth2 specification](http://tools.ietf.org/html/rfc6749 \"OAuth2 specification\")\n\n## Getting started ##\nIdentityServer is designed as an OWIN/Katana component. By referencing the library or nuget you get a `UseIdentityServer` extension method for `IAppBuilder` that allows setting up IdentityServer in your OWIN host:  \n\n```csharp\npublic void Configuration(IAppBuilder app)\n{\n    var options = new IdentityServerOptions\n    {\n        SigningCertificate = Certificate.Get(),\n        Factory = Factory.Create()\n    };\n\n    app.UseIdentityServer(options);\n}\n```\n\n*Note:* If you're hosting in IIS, make sure you [enable RAMMFAR in your web.config file](http://identityserver.github.io/Documentation/docsv2/configuration/overview.html).\n\nFor more information, e.g.\n\n* support for MembershipReboot and ASP.NET Identity based user stores\n* support for additional Katana authentication middleware (e.g. Google, Twitter, Facebook etc)\n* support for EntityFramework based persistence of configuration\n* support for WS-Federation\n* extensibility\n\ncheck out the [documentation](https://identityserver.github.io/Documentation/) and the [samples](https://github.com/identityserver/IdentityServer3.Samples).\n\n## Related repositories ##\n* [Access Token Validation](https://github.com/identityserver/IdentityServer3.AccessTokenValidation)\n* [EntityFramework support](https://github.com/identityserver/IdentityServer3.EntityFramework)\n* [MembershipReboot support](https://github.com/identityserver/IdentityServer3.MembershipReboot)\n* [ASP.Net Identity support](https://github.com/identityserver/IdentityServer3.AspNetIdentity)\n* [WS-Federation plugin](https://github.com/identityserver/IdentityServer3.WsFederation)\n* [Samples](https://github.com/IdentityServer/IdentityServer3.Samples)\n\n## Credits ##\nIdentityServer is built using the following great open source projects:\n\n- [ASP.NET Web API](https://aspnetwebstack.codeplex.com/)\n- [Autofac](http://autofac.org/)\n- [Json.Net](http://www.newtonsoft.com/json)\n- [LibLog](https://github.com/damianh/LibLog)\n- [Katana](https://katanaproject.codeplex.com/)\n- [Web Protection Library](https://wpl.codeplex.com/)\n- [XUnit](https://github.com/xunit/xunit)\n- [License Header Manager](https://visualstudiogallery.msdn.microsoft.com/5647a099-77c9-4a49-91c3-94001828e99e)\n\n..and is supported by the following open source friendly companies:\n\n- [JetBrains](http://www.jetbrains.com)\n- [Gitter](https://gitter.im/)\n- [Huboard](https://huboard.com/)\n- [AppVeyor](http://www.appveyor.com)\n- [MyGet](http://myget.org)\n\n...and last but not least thanks to all [contributors](https://github.com/IdentityServer/IdentityServer3/graphs/contributors)!\n\nIdentityServer is a [.NET Foundation](http://www.dotnetfoundation.org/) project\n\n<img src=\"https://cloud.githubusercontent.com/assets/1454075/10598539/1c44ba0a-76fa-11e5-9d7e-af1b363c524a.png\" width=\"144\">\n"
        },
        {
          "name": "build.ps1",
          "type": "blob",
          "size": 0.7763671875,
          "content": "Param(\n\t[string]$buildNumber = \"0\",\n\t[string]$preRelease = $null\n)\n\n$exists = Test-Path nuget.exe\n\nif ($exists -eq $false) {\n    $source = \"https://dist.nuget.org/win-x86-commandline/latest/nuget.exe\"\n    Invoke-WebRequest $source -OutFile nuget.exe\n}\n\n.\\nuget.exe update -self\n\ngci .\\source -Recurse \"packages.config\" |% {\n\t\"Restoring \" + $_.FullName\n\t.\\nuget.exe install $_.FullName -o .\\source\\packages\n}\n\nImport-Module .\\source\\packages\\psake.4.4.1\\tools\\psake.psm1\n\nif(Test-Path Env:\\APPVEYOR_BUILD_NUMBER){\n\t$buildNumber = [int]$Env:APPVEYOR_BUILD_NUMBER\n\tWrite-Host \"Using APPVEYOR_BUILD_NUMBER\"\n\n\t$task = \"appVeyor\"\n}\n\n\"Build number $buildNumber\"\n\nInvoke-Psake .\\default.ps1 $task -framework \"4.0x64\" -properties @{ buildNumber=$buildNumber; preRelease=$preRelease }\n\nRemove-Module psake"
        },
        {
          "name": "default.ps1",
          "type": "blob",
          "size": 3.23046875,
          "content": "properties {\n\t$base_directory = Resolve-Path .\n\t$src_directory = \"$base_directory\\source\"\n\t$output_directory = \"$base_directory\\build\"\n\t$dist_directory = \"$base_directory\\distribution\"\n\t$sln_file = \"$src_directory\\IdentityServer3.sln\"\n\t$target_config = \"Release\"\n\t$framework_version = \"v4.5\"\n\t$xunit_path = \"$src_directory\\packages\\xunit.runner.console.2.0.0\\tools\\xunit.console.exe\"\n\t$ilmerge_path = \"$src_directory\\packages\\ILMerge.2.14.1208\\tools\\ILMerge.exe\"\n\t$nuget_path = \"$base_directory\\nuget.exe\"\n\n\t$buildNumber = 0;\n\t$version = \"2.6.3.0\"\n\t$preRelease = $null\n}\n\ntask default -depends Clean, RunTests, CreateNuGetPackage\ntask appVeyor -depends Clean, CreateNuGetPackage\n\ntask Clean {\n\trmdir $output_directory -ea SilentlyContinue -recurse\n\trmdir $dist_directory -ea SilentlyContinue -recurse\n\texec { msbuild /nologo /verbosity:quiet $sln_file /p:Configuration=$target_config /t:Clean }\n}\n\ntask Compile -depends UpdateVersion {\n\texec { msbuild /nologo /verbosity:q $sln_file /p:Configuration=$target_config /p:TargetFrameworkVersion=v4.5 }\n\n\tif ($LastExitCode -ne 0) {\n        exit $LastExitCode\n    }\n}\n\ntask UpdateVersion {\n\t$vSplit = $version.Split('.')\n\tif($vSplit.Length -ne 4)\n\t{\n\t\tthrow \"Version number is invalid. Must be in the form of 0.0.0.0\"\n\t}\n\t$major = $vSplit[0]\n\t$minor = $vSplit[1]\n\t$patch = $vSplit[2]\n\t$assemblyFileVersion =  \"$major.$minor.$patch.$buildNumber\"\n\t$assemblyVersion = \"$major.$minor.0.0\"\n\t$versionAssemblyInfoFile = \"$src_directory/VersionAssemblyInfo.cs\"\n\t\"using System.Reflection;\" > $versionAssemblyInfoFile\n\t\"\" >> $versionAssemblyInfoFile\n\t\"[assembly: AssemblyVersion(\"\"$assemblyVersion\"\")]\" >> $versionAssemblyInfoFile\n\t\"[assembly: AssemblyFileVersion(\"\"$assemblyFileVersion\"\")]\" >> $versionAssemblyInfoFile\n}\n\ntask RunTests -depends Compile {\n\t$project = \"IdentityServer3.Tests\"\n\tmkdir $output_directory\\xunit\\$project -ea SilentlyContinue\n\t.$xunit_path \"$src_directory\\Tests\\UnitTests\\bin\\Release\\$project.dll\"\n}\n\n\ntask ILMerge -depends Compile {\n\t$input_dlls = \"$output_directory\\IdentityServer3.dll\"\n\n\tGet-ChildItem -Path $output_directory -Filter *.dll |\n\t\tforeach-object {\n\t\t\t# Exclude IdentityServer3.dll as that will be the primary assembly\n\t\t\tif (\"$_\" -ne \"IdentityServer3.dll\" -and\n\t\t\t    \"$_\" -ne \"Owin.dll\") {\n\t\t\t\t$input_dlls = \"$input_dlls $output_directory\\$_\"\n\t\t\t}\n\t}\n\n\tNew-Item $dist_directory\\lib\\net45 -Type Directory\n\tInvoke-Expression \"$ilmerge_path /targetplatform:v4 /internalize /allowDup /target:library /out:$dist_directory\\lib\\net45\\IdentityServer3.dll $input_dlls\"\n}\n\ntask CreateNuGetPackage -depends ILMerge {\n\t$vSplit = $version.Split('.')\n\tif($vSplit.Length -ne 4)\n\t{\n\t\tthrow \"Version number is invalid. Must be in the form of 0.0.0.0\"\n\t}\n\t$major = $vSplit[0]\n\t$minor = $vSplit[1]\n\t$patch = $vSplit[2]\n\t$packageVersion =  \"$major.$minor.$patch\"\n\tif($preRelease){\n\t\t$packageVersion = \"$packageVersion-$preRelease\"\n\t}\n\t\n\tif ($buildNumber -ne 0){\n\t\t$packageVersion = $packageVersion + \"-build\" + $buildNumber.ToString().PadLeft(5,'0')\n\t}\n\n\n\tcopy-item $src_directory\\IdentityServer3.nuspec $dist_directory\n\tcopy-item $output_directory\\IdentityServer3.xml $dist_directory\\lib\\net45\\\n\texec { . $nuget_path pack $dist_directory\\IdentityServer3.nuspec -BasePath $dist_directory -OutputDirectory $dist_directory -version $packageVersion }\n}\n"
        },
        {
          "name": "mygetpush.cmd",
          "type": "blob",
          "size": 0.072265625,
          "content": "nuget push distribution\\*.nupkg -Source https://www.myget.org/F/identity/\n"
        },
        {
          "name": "nuget.config",
          "type": "blob",
          "size": 0.34375,
          "content": "﻿<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<configuration>\n  <activePackageSource>\n    <add key=\"All\" value=\"(Aggregate source)\" />\n  </activePackageSource>\n  <packageSources>\n    <add key=\"Identity* Dev Feed\" value=\"https://www.myget.org/F/identity/\" />\n    <add key=\"Nuget\" value=\"https://www.nuget.org/api/v2/\" />\n  </packageSources>\n</configuration>"
        },
        {
          "name": "nugetpush.cmd",
          "type": "blob",
          "size": 0.03125,
          "content": "nuget push distribution\\*.nupkg\n"
        },
        {
          "name": "source",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}