{
  "metadata": {
    "timestamp": 1736710669606,
    "page": 11,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "HearthSim/Hearthstone-Deck-Tracker",
      "stars": 4795,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 1.759765625,
          "content": "root=true\n\n[*]\nend_of_line = lf\nindent_style = tab\ninsert_final_newline = true\ntrim_trailing_whitespace = true\n\n[*.cs]\ndotnet_style_qualification_for_event = false:suggestion\ndotnet_style_qualification_for_field = false:suggestion\ndotnet_style_qualification_for_method = false:suggestion\ndotnet_style_qualification_for_property = false:suggestion\ndotnet_style_predefined_type_for_locals_parameters_members = true:suggestion\ndotnet_style_predefined_type_for_member_access = true:suggestion\ndotnet_style_object_initializer = true:suggestion\ndotnet_style_collection_initializer = true:suggestion\ndotnet_style_explicit_tuple_names = true:suggestion\ndotnet_style_coalesce_expression = true:suggestion\ndotnet_style_null_propagation = true:suggestion\ncsharp_space_after_keywords_in_control_flow_statements = false\ncsharp_style_var_for_built_in_types = true:suggestion\ncsharp_style_var_when_type_is_apparent = true:suggestion\ncsharp_style_var_elsewhere = true:suggestion\ncsharp_style_expression_bodied_methods = true:none\ncsharp_style_expression_bodied_constructors = true:none\ncsharp_style_expression_bodied_operators = true:none\ncsharp_style_expression_bodied_properties = true:none\ncsharp_style_expression_bodied_indexers = true:none\ncsharp_style_expression_bodied_accessors = true:none\ncsharp_style_pattern_matching_over_is_with_cast_check = true:suggestion\ncsharp_style_pattern_matching_over_as_with_null_check = true:suggestion\ncsharp_style_inlined_variable_declaration = true:suggestion\ncsharp_style_throw_expression = true:suggestion\ncsharp_style_conditional_delegate_call = true:suggestion\ncsharp_new_line_before_open_brace = all\ncsharp_new_line_before_catch = true\ncsharp_new_line_before_else = true\ncsharp_new_line_before_finally = true\n\n\n[*.xml]\nindent_style = space\n\n[*.xaml]\nindent_style = space\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.02734375,
          "content": "*.cs eol=lf\r\n*.xaml eol=lf\r\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.99609375,
          "content": "## Ignore Visual Studio temporary files, build results, and\n## files generated by popular Visual Studio add-ons.\n\n# User-specific files\n*.suo\n*.user\n*.sln.docstates\n\n# Build results\n\n[Dd]ebug/\n[Rr]elease/\nx64/\nbuild/\n[Bb]in/\n[Oo]bj/\n\n# Enable \"build/\" folder in the NuGet Packages folder since NuGet packages use it for MSBuild targets\n!packages/*/build/\n\n# Visual Studio 2015 cache/options directory\n.vs/\n# Uncomment if you have tasks that create the project's static files in wwwroot\n#wwwroot/\n\n# MSTest test Results\n[Tt]est[Rr]esult*/\n[Bb]uild[Ll]og.*\n\n*_i.c\n*_p.c\n*.ilk\n*.meta\n*.obj\n*.pch\n*.pdb\n*.pgc\n*.pgd\n*.rsp\n*.sbr\n*.tlb\n*.tli\n*.tlh\n*.tmp\n*.tmp_proj\n*.log\n*.vspscc\n*.vssscc\n.builds\n*.pidb\n*.log\n*.scc\n\n# Visual C++ cache files\nipch/\n*.aps\n*.ncb\n*.opensdf\n*.sdf\n*.cachefile\n\n# Visual Studio profiler\n*.psess\n*.vsp\n*.vspx\n\n# Guidance Automation Toolkit\n*.gpState\n\n# ReSharper is a .NET coding add-in\n_ReSharper*/\n*.[Rr]e[Ss]harper\n\n# TeamCity is a build add-in\n_TeamCity*\n\n# DotCover is a Code Coverage Tool\n*.dotCover\n\n# NCrunch\n*.ncrunch*\n.*crunch*.local.xml\n\n# Installshield output folder\n[Ee]xpress/\n\n# DocProject is a documentation generator add-in\nDocProject/buildhelp/\nDocProject/Help/*.HxT\nDocProject/Help/*.HxC\nDocProject/Help/*.hhc\nDocProject/Help/*.hhk\nDocProject/Help/*.hhp\nDocProject/Help/Html2\nDocProject/Help/html\n\n# Click-Once directory\npublish/\n\n# Publish Web Output\n*.Publish.xml\n\n# NuGet is used in bootstrap.exe to retrieve packages\nnuget.exe\n\n# NuGet Packages Directory\n## TODO: If you have NuGet Package Restore enabled, uncomment the next line\n#packages/\n\n# Windows Azure Build Output\ncsx\n*.build.csdef\n\n# Windows Store app package directory\nAppPackages/\n\n# Others\nsql/\n*.Cache\nClientBin/\n[Ss]tyle[Cc]op.*\n~$*\n*~\n*.dbmdl\n*.[Pp]ublish.xml\n*.pfx\n*.publishsettings\n\n# RIA/Silverlight projects\nGenerated_Code/\n\n# Backup & report files from converting an old project file to a newer\n# Visual Studio version. Backup files are not needed, because we have git ;-)\n_UpgradeReport_Files/\nBackup*/\nUpgradeLog*.XML\nUpgradeLog*.htm\n\n# SQL Server files\nApp_Data/*.mdf\nApp_Data/*.ldf\n\n\n#LightSwitch generated files\nGeneratedArtifacts/\n_Pvt_Extensions/\nModelManifest.xml\n\n# =========================\n# Windows detritus\n# =========================\n\n# Windows image file caches\nThumbs.db\nehthumbs.db\n\n# Folder config file\nDesktop.ini\n\n# Recycle Bin used on file shares\n$RECYCLE.BIN/\n\n# Mac desktop service store files\n.DS_Store\nHearthstone Deck Tracker.sln.ide/*\npackages/*\n!packages/repositories.config\n\nHearthstone Deck Tracker/Releases\nHearthDb/\nHearthMirror/\nHearthstone Deck Tracker/Resources/CHANGELOG.md\nHSReplay-Api/\nHearthstone Deck Tracker/Properties/Strings.*\nHDT-Localization/\nResources/Generated/\nResources/Tiles/\n/lib/HSReplay.dll\n/lib/HearthMirror.exe\n/lib/HearthMirror.dll\n/lib/HearthMirror.zip\n/lib/HearthDb.dll\n/lib/BobsBuddy.dll\n/lib/Newtonsoft.Json.dll\n/lib/System.Reflection.DispatchProxy.dll\n/lib/untapped-scry-dotnet.dll\n/lib/api-ms-win-crt-*.dll\n/lib/msvcp140.dll\n/lib/ucrtbase.dll\n/lib/vcruntime140.dll\n\n# Rider config files\n.idea/\n"
        },
        {
          "name": "Bootstrap",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 95.30078125,
          "content": "## **Release v1.38.1 - 2024-12-25**\n**Hearthstone**:\n- Fixed some Year of the Wolf sets not being considered as Wild.\n\n**Battlegrounds**:\n- Fixed the Tier7 version of the Comp Guides not filtering correctly for \"All\" minions.\n- Fixed the Comp Guides showing outdated information when HDT was kept running for a long time.\n\n## **Release v1.38.0 - 2024-12-17**\n**Updated for Hearthstone 31.2.2**\n\n**Hearthstone**:\n- Added indicator for Incindius' Eruption buffs.\n- Added related card tooltip to Grand Magister Rommath.\n- Added related card tooltips to most cards that resurrect from the Graveyard.\\\n  *Abominable Bowman, All Fel Breaks Loose, Amulet of Undying, Animate Dead, Anyfin Can Happen, Bloodreaver Gul'dan, Body Wrapper, Bonecaller, Boneshredder, Catrina Muerte, Counterfeit Blade, Da Undatakah, Defense Attorney Nathanos, Eternal Servitude, Habeas Corpses, Hadronox, Infantry Reanimator, Jewel of N'Zoth, Lesser Diamond Spell Stone, Mass Resurrection, N'Zoth, God of the Deep, N'Zoth, The Corruptor, Onyx Bishop, Psychopomp, Raise Dead, Rally!, Resurrect, Revive Pet, Tamsin's Phylactery, Tomb Lurker, Twilight's Call, Unending Swarm, Vectus, Witching Hour, Xyrella, the Devout*\n- Fixed the deck selector switching to the wrong tab after importing a deck.\n\n**Battlegrounds**:\n- Added free Comp Guides to the overlay, written by none other than Jeef!\\\n  *These correspond to the Comp Guides we recently added to HSReplay.net, presented so they're easy to browse and read inbetween turns.*\n- New Tier7 feature: Click on any minion in the minion browser to see how top players include that card in their lineups.\\\n  *You'll also find a button on the new Comp Guides to see typical final boards for that Comp.*\n- New Tier7 feature: Added additional filtering and a tier preview to the (new) Comp Guides tab.\n- Added counters for Beetle stats, Spells played and the Undead attack bonus.\n- Fixed the latest games in the session recap showing the wrong hero after rerolling a skin.\n- Fixed Sleeping Sea Glass appearing in the available minion list in Duos.\n- Fixed the Tier7 hero picking stats not updating when rerolling a skin.\n- Fixed the Tier7 hero picking stats flickering when hovering over a hero.\n- Fixed the Tier7 hero picking stats showing for locked heroes.\n\n## **Release v1.37.5 - 2024-12-03**\n**Updated for Hearthstone 31.2.0**\n\n**Battlegrounds**:\n- Updated Tier7 hero picking overlay for hero rerolling.\n\n**Plugins**:\n- Fixed compatibility with some older plugins relying on a deprecated property.\n\n## **Release v1.37.4 - 2024-11-28**\n**Hearthstone**:\n- Added card icons for cards that return to hand at the end of the turn (Corpsicle, Libram of Divinity).\n- Fixed forge icon not appearing when the forged card was drawn by another card.\n- Fixed The Ceaseless Expanse counter not increasing when fracking is played.\n- Fixed some active effects appearing on the wrong side.\n- Fixed Pro gamer's Rock, Paper and Scissors cards appearing in the decklist.\n\n**Updater Improvements**:\n- Improved reliability and download speeds for users in China.\n\n**Language Settings**:\n- The card language setting has been removed. The language used for cards now automatically matches the language of the Hearthstone installation.\n- The UI language setting has been moved to `Options > Tracker > General`.\n\n\n## **Release v1.37.3 - 2024-11-21**\n**Updated for Hearthstone 31.0.3**\n\n## **Release v1.37.2 - 2024-11-19**\n**Hearthstone**:\n- Added support for Triangulate\n- Added counters for Playhouse Giant and cards drawn this turn\n- Fixed disabled card ages still showing a placeholder icon\n\n**Plugins**:\n- Fixed compatibility with some older plugins relying on a deprecated property\n\n**Updater Improvements**:\n- Will no longer block HDT from starting under slow network conditions\n- Errors that occur during updates are now surfaced in the main window\n\n## **Release v1.37.0 - 2024-11-12**\n**Performance**:\n- Significantly improved downloader size: Card Tile images are now loaded dynamically instead of being included in the initial download.\n- Significantly improved memory usage.\n\n## **Release v1.36.4 - 2024-11-07**\n**Hearthstone:**\n- Added counter for The Ceaseless Expanse.\n- Fixed handling of Starships when creating related cards.\n- Fixed an issue where Tess Greymane related cards were not taking in consideration player class changing by playing a Hero card.\n- Fixed Rewind showing in the opponent's related cards when it was not relevant.\n- Fixed cards popping in when hovering counters or effects that show a multi-card tooltip.\n\n## **Release v1.36.2 - 2024-10-30**\n**Fixes**:\n- Fixed an issue with setting the initial language configuration.\n- Fixed handling of Zilliax Deluxe 3000 when creating related cards.\n- Fixed an issue where Lady Liadrin related cards were not resetting after a match.\n\n## **Release v1.36.1 - 2024-10-29**\n**Updated for Hearthstone 31.0.0**\n\n**Hearthstone**:\n- Added support for cards that will be recasted by Mistah Vistah effect.\n- Added support to new expansion cards.\\\n  *Asteroids, Kil'jaeden, Librams, Ingenious Artificer, Ace Wayfinder, Astrobiologist, Space Pirate, Starlight Wanderer, Stranded Spaceman, Askara, Lucky Coment, Spacerock Collector, Planetary Navigator, Foreboding Flame, Infernal Stratagem,  Expedition Sergeant, Unyielding Vindicator, Wakener Of Souls, Dirdra Rebel Captain, Emergency Meeting,  Headhunt, Voronei Recruiter, Velen Leader Of The Exiled, Yrel Beacon Of Hope, Scrounging Shipwright, Starship Schematic, Archimonde, Xortoth Breaker Of Stars, Talgath, Astral Vigilant*\n\n## **Release v1.36.0 - 2024-10-23**\n**Hearthstone**:\n- Added tooltips for related cards.\\\n  *Hovering over cards in hand or deck now shows their related cards. These tooltips will automatically appear for opponents when relevant.*\n- Added related cards for: \\\n  *Return Policy, Hydration Station, Pet Parrot, Product 9, Sasquawk, Stranglethorn Heart, Rewind, Commander Sivara, The Galactic Projection Orb, Tyr, Tyr's Tears, Lady Liadrin, Tess Greymane, Shudderwock, Inventor Boom, Photographer Fizzle, Tidepool Pupil.*\n- Implemented Fizzle's Snapshot to track cards as the opponent plays them.\n- Updated the elemental turn sequence counter card image to a more fitting one.\n- Fixed an issue where cast spells were counted towards \"Played Spells\" counters.\n- Fixed an issue that counters appeared in inappropriate game modes.\n- Fixed an issue where card marks displayed incorrect icons when drawn by a blacklisted card.\n\n## **Release v1.35.3 - 2024-10-17**\n**Updated for Hearthstone 30.6.2**\n\n## **Release v1.35.1 - 2024-10-11**\n\n**Hearthstone**:\n- Tweaked when to show Summoned Dragons and Spell Schools counters.\n- Added tourist related cards to the counter system.\n- Fixed active effects showing on top of counters.\n- Fixed counter text cropping in some cases.\n\n## **Release v1.35.0 - 2024-10-10**\n**Updated for Hearthstone 30.6.0**\n\n**Hearthstone**:\n- Added new-style counters! They will automatically pop up when they're relevant in a game and feature rich tooltips appropriate to the current game state.\\\n  *We're still working on making them individually configurable but wanted to share our current progress with you. The old counters are still temporarily available but have been moved to the Advanced options.*\n- Added counters for: Abyssal Curse, Astral Automaton, Chaotic Tendril, C'Thun, Elemental turns in a row, Excavate, Fatigue, Galakrond, Jade Display, Jade Golems, Librams, Played Spell Schools, Played Spells, Pogo Hopper, Damage taken on your turns, Summoned Dragons and Wheel of Death.\n- Added filtering to \"Drawn By\" card marks in the opponent's hand to cut down on unimportant information (such as non-tutored draws).\n- Added a new icon to the opponents hand to better differentiate a card's identity from the identity of the card that drew it.\n- Fixed an info leak related to forged cards that where shuffled into the opponents deck and drawn again later.\n\n**Battlegrounds**:\n- Add a counter to show the current Blood Gem size.\n\n## **Release v1.34.0 - 2024-09-26**\n**Updated for Hearthstone 30.4.3**\n\n**Hearthstone**:\n- Added card mark for Forged cards in the opponent's hand.\n- Fixed tourists appearing twice in the opponent's deck list.\n\n**Battlegrounds**:\n- Added Battlegrounds Trinket picking stats to the overlay!\\\n  *Try this feature for free with your weekly Tier7 trials and subscribe to Tier7 for unlimited access.*\n- Fixed various simulation interactions between Persistent Poet and All minions.\n\n## **Release v1.33.2 - 2024-09-19**\n\n**Hearthstone**:\n- Show the tourist in the opponent's deck list when they play a tourist card.\n- Fixed the attack counter sometimes ignoring Windfury and Mega-Windfury.\n- Fixed the deck list not correctly updating for plagues with Augmented Elekk.\n\n## **Release v1.33.0 - 2024-09-10**\n**Updated for Hearthstone 30.4.0**\n\n**Hearthstone**:\n- Fixed some active effects appearing having an unnecessary counter (e.g. Tar Slick).\n\n## **Release v1.32.2 - 2024-09-06**\n**General**:\n- Fixed a silent crash that affected certain devices after playing a few matches.\n\n**Battlegrounds**:\n- Increased the maximum simulation time when Leapfroggers are present.\n\n## **Release v1.32.1 - 2024-09-04**\n**Overlay**:\n- New Overlay Masking Feature: Introduced a mask that automatically hides the tracker overlay when a specific game UI element is focused. This feature ensures the tracker is more seamlessly integrated with the game interface, reducing clutter and enhancing immersion.\n\n**Hearthstone**:\n- New Active Effects Indicator: Added a visual indicator to the overlay to show when game effects are present.\n- Show exact card counts, even when there's more than 9 cards in the deck.\n- Fixed Plagues not being tracked correctly after playing Helya.\n- Fixed Plagues not being removed from the deck list when playing Steamcleaner.\n\n**Battlegrounds:**\n- Automatically show Tavern Tier 7 in the Battlegrounds minion browser when Pagle's Fishing Rod or Thorim's Hero Power is offered.\n- Fixed Brann Bronzebeard having a golden star in the Battlegrounds minion browser.\n- Fixed minions from Tavern Tier 7 not appearing when filtering for a specific minion type.\n\n**Streaming:**\n- Added a streaming-specific masking setting for the capturable overlay. This setting allows you to choose whether the overlay should be masked when streaming or not.\\\n  *You'll find this setting under Options > Streaming > Capturable Overlay*\n\n## **Release v1.31.5 - 2024-08-29**\n**Updated for Hearthstone 30.2.2**\n\n**Overlay**:\n- Fixed an issue where the \"Always show Tavern Tier 7\" setting for Battlegrounds was disabled.\n- Fixed Rylak Metalhead's card text being outdated in the Battlegrounds minion browser.\n\n**Battlegrounds**:\n- Fixed a simulation issue when Flourishing Frostling triggers Moss of the Schloss.\n- Fixed a simulation crash when the Boom Controller trinket was present.\n\n## **Release v1.31.3 - 2024-08-27**\n**Battlegrounds**:\n- Fixed a major simulation issue with the Bronze Timepiece trinket.\n- Fixed trinkets from Souvenir Stand not being incorporated into the simulations.\n\n## **Release v1.31.1 - 2024-08-25**\n**Battlegrounds**:\n- Automatically show Tavern Tier 7 in the Battlegrounds minion browser when you have Pagle's Fishing Rod.\n- Added a setting to always show Tavern Tier 7 in the Battlegrounds minion browser.\\\n  *You'll find this setting under Options > Overlay > Battlegrounds > Always show Tavern Tier 7.*\n- Added support for the Blood Golem Sticker trinket.\n- Fixed a simulation crash that could cause the odds to spin forever.\n\n**Streaming**:\n- Fixed hero powers not being hoverable on the Twitch Extension.\n- Added full trinket support in an upcoming version of the Twitch Extension.\\\n  *Until then, your viewers can hover the weapon slot to see the latest trinket.*\n- Added support for Cho'Gall anomalies in an upcoming version of the Twitch Extension.\n\n## **Release v1.31.0 - 2024-08-20**\n**Updated for Hearthstone 30.2.0**\n\n**Overlay**:\n- Added golden cards to the Battlegrounds minion browser: hover over the cards for a little longer to see the golden version.\n- Slightly reduced the number of games shown in the session recap from 10 to 8 to free up some vertical screen space.\n\n**Battlegrounds**:\n- Added over 70 implementations for the new trinkets and new or updated cards.\\\n  *We'll be monitoring the simulation accuracy and will likely issue another update within the coming days.*\n\n**Streaming**:\n- Added basic trinket support to the Twitch Extension so that viewers can hover one of the trinkets on the stream.\\\n  *We're working on an update to the extension so that viewers can hover both trinkets as you'd expect.*\n\n## **Release v1.30.3 - 2024-08-08**\n**Updated for Hearthstone 30.0.3**\n\n## **Release v1.30.2 - 2024-08-05**\n**Hearthstone**:\n- Fixed the Mulligan Guide popup in the bottom right corner not appearing correctly.\n- Fixed Arena decks with unknown cards being stuck in a broken state after an expansion release.\n\n## **Release v1.30.1 - 2024-08-02**\n**Deck Tracker**:\n- Fixed a number of recent cards not showing what the opponent added to their hand.\n- Fixed Snake Oil appearing twice in the opponent's deck list after trading.\n- Fixed the spell school counter not automatically appearing for Shaman decks with Razzle-Dazzler.\n- Fixed the underlying issue causing Arena decks to be repeatedly imported when a new set is released.\n\n**Overlay**:\n- Fixed the full screen overlay being misaligned when screen scaling was enabled on a second monitor.\n- Fixed card tooltips to not appear in the correct place when hovering the opponent's deck list.\n- Fixed hover zones for card marks in the opponent's hand sometimes being too small.\n- Fixed an issue causing the Mulligan Guide box to be misaligned in the deck picker for Warlock decks with runes (from Tourist).\n\n## **Release v1.30.0 - 2024-07-17**\n**Updated for Hearthstone 30.0.0**\n\nArena players may have noticed the deck tracker repeatedly importing decks that contained cards from the new expansion.\nThis issue is resolved for now as this update contains the new cards, but we'll fix the underlying issue in a future update.\n\n**New**:\n- Added initial deck tracking support for Perils in Paradise cards. More to come soon!\n- Added Tourist support to the deck builder.\n\n**Fixes**:\n- Fixed the Excavate counter not appearing for all Excavate cards.\n- Fixed an issue where the Tier7 hero picking overlay would have conflicting hover zones.\n- Fixed the Twitch Extension not allowing viewers to hover the buddy button.\n\n## **Release v1.29.9 - 2024-07-12**\n**Fixes**:\n- Tier7 setting not affecting Composition Stats visibility.\n\n## **Release v1.29.8 - 2024-07-11**\n**Fixes**:\n- Tier7 Composition Stats visibility.\n\n## **Release v1.29.7 - 2024-07-11**\n**New**:\n- Hide Hero Picking overlay covering up buddies.\n- Added Tier7 Composition Stats!\n\n**Fixes**:\n- Remove obsolete tooltip from Hero Picking tiers.\n\n**Bob's Buddy**:\n- Fixed incorrect simulation results in Duos due to partial combat.\n\n## **Release v1.29.6 - 2024-07-05**\n**Fixes**:\n- Fixed an issue causing automatic deck importing to not update premade decks, such as Twist and Loaner decks.\n- Fixed a memory leak that could cause a sudden crash after a long session of interacting with the Battlegrounds minion browser.\n\n**Bob's Buddy**:\n- Fixed an issue where minions exclusive to Duos would prevent simulations even when not playing Duos.\n\n## **Release v1.29.5 - 2024-06-27**\n**Updated for Hearthstone 29.6.2**\n\n**Bob's Buddy**:\n- Fixed incorrect simulation results due to Sky Pirate (Scallywag's summon).\n- Fixed incorrect simulation results due to Sr. Tomb Diver.\n\n## **Release v1.29.4 - 2024-06-21**\n**Bob's Buddy**:\n- Fixed incorrect simulation results in Duos due to minions being unable to attack.\n- Fixed incorrect simulation results due to Teron Gorefiend's hero power (Rapid Reanimation).\n\n## **Release v1.29.3 - 2024-06-20**\n**Bob's Buddy**:\n- Fixed incorrect simulation results due to Tarecgosa.\n- Fixed incorrect simulation results due to Golden Persistent Poet.\n- Fixed incorrect simulation results due to Sky Pirate (Scallywag's summon).\n- Fixed incorrect simulation results due to Teron Gorefiend's hero power (Rapid Reanimation).\n\n## **Release v1.29.2 - 2024-06-17**\n**Updated for Hearthstone 29.6.0**\n\n**Fixes**:\n- Fixed an issue where counters from traditional Hearthstone would be shown in Battlegrounds.\n\n## **Release v1.29.1 - 2024-06-11**\n**New**:\n- Show Fatigue Counter in more circumstances (such as when playing Insanity Warlock).\n- Make it easier to sign in to HSReplay.net after subscribing to Tier7.\n\n**Fixes**:\n- Fixed an issue where Bob's Buddy would not update after an Akazamzarak secret was revealed.\n- Fixed an issue where Bob's Buddy would enter an invalid state when conceding during hero selection.\n\n## **Release v1.29.0 - 2024-06-03**\n**New**:\n- Added Tier7 Hero Picking stats in Duos!\n- Added Bob's Buddy in Duos!\\\n  *You may occasionally see a partial result, in case where we don't see one of the teammates.*\n\n**Changes**:\n- Limit how fast HDT catches up with the game, which should prevent sudden HDT crashes in very complex Battlegrounds games.\n\n## **Release v1.28.6 - 2024-05-31**\n**Fixes**:\n- Fixed a crash when closing Hearthstone.\n\n## **Release v1.28.5 - 2024-05-31**\n**New**:\n- Added automatic deck importing for the new Twist season!\n- Added automatic deck importing for Loaner decks!\n\n## **Release v1.28.4 - 2024-05-30**\n**Fixes**:\n- Fixed a memory leak that could cause the deck tracker to crash mid-game.\n- Fixed an issue where the session recap would show really bad Duos losses as 5th place.\n- Fixed an issue where Twitch VODs would not appear on HSReplay.net.\n\n**Bob's Buddy**:\n- Fixed various minor simulation issues.\n\n## **Release v1.28.3 - 2024-05-23**\n**Updated for Hearthstone 29.4.2**\n\n**Fixes**:\n- Fixed Bargain Bin not appearing as a possible secret.\n- Added extra logging to help us investigate certain types of bugs.\n\n## **Release v1.28.2 - 2024-05-18**\n**Bob's Buddy**:\n- Fixed opposing Boon of Beetles not being simulated correctly.\n- Fixed various minor simulation issues.\n\n## **Release v1.28.1 - 2024-05-17**\n**New**:\n- Start tracking the last known board state in Battlegrounds Duos!\\\n  *Hover over heroes on the leaderboard as usual to see the last board you encountered.*\n\n**Fixes**:\n- Fixed an issue causing the last known board state in Battlegrounds sometimes showing a board from the wrong hero.\n- Fixed an issue causing the death counter in Battlegrounds to sometimes be misaligned.\n\n## **Release v1.28.0 - 2024-05-14**\n**Updated for Hearthstone 29.4.0**\n\n## **Release v1.27.3 - 2024-05-13**\n**New**:\n- Switched the tiers shown in Battlegrounds hero picking overlay to a new and improved methodology.\\\n  *Hero tiers are now one of S, A, B, C, D and F. The S and F tiers are very rare and will only appear for true outliers.*\n- Visual improvements to the Battlegrounds hero picking overlay.\n\n**Bob's Buddy**:\n- Added support for Boon of Beetles.\n- Fixed incorrect simulation results when the opponent had multiple secrets.\n\n## **Release v1.27.2 - 2024-05-10**\n**Fixes**:\n- Ensure the Battlegrounds Compare Heroes popup uses the same filters as the hero picking overlay.\n\n**Bob's Buddy**:\n- Fixed various simulation issues.\n\n## **Release v1.27.1 - 2024-05-08**\n**New**:\n- Added Duos support to the Battlegrounds session recap.\\\n  *Duos support for Bob's Buddy and the hero picking overlay are being worked on!*\n\n**Fixes**:\n- Fixed automatic deck importing for Whizbang the Wonderful.\\\n  *Whizbang the Splendiferous and Zayle, Shadow Cloak will follow in a future update.*\n- Fixed the Battlegrounds hero picking popup not disappearing after a disconnect.\n- Improved the reliability of detecting the available minion types in Battlegrounds.\n\n**Bob's Buddy**:\n- Fixed incorrect lethal rates due to an issue detecting the damage cap.\n- Fixed incorrect simulation results due to Fleeting Vigor.\n- Fixed incorrect simulation results due to Teron Gorefiend's hero power.\n\n## **Release v1.27.0 - 2024-04-25**\n**Updated for Hearthstone 29.2.2**\n\n## **Release v1.26.1 - 2024-04-23**\n\n**Fixes**:\n- Fixed \"All\" type minions missing from the Battlegrounds minion list when filtering for a specific minion type.\n- Fixed decks containing certain Zilliax Deluxe 3000 cosmetics not showing HSReplay.net statistics.\n- Fixed duplicate tooltips in the overlay when deck window card tooltips were enabled.\n- Fixed various crashes related to the Battlegrounds overlay.\n\n**Bob's Buddy**:\n- Fixed incorrect simulation results due to Pack Tactics.\n- Fixed incorrect simulation results due to Golden Goose.\n- Fixed incorrect simulation results due to Silithid Burrower.\n- Fixed incorrect simulation results due to Teron Gorefiend's hero power (Rapid Reanimation).\n\n## **Release v1.26.0 - 2024-04-18**\n\n**New**:\n- Added a button to filter the Battlegrounds minion list by minion type!\n\n**Fixes**:\n- Fixed an issue causing the Battlegrounds Hero Picking overlay to not align with the heroes.\n- Fixed an issue causing Duos-exclusive Battlegrounds minions to appear in the normal Battlegrounds minion list.\n- Fixed an issue causing the Twitch Extension to show incorrect card tooltips while you viewed your teammate's board in Duos.\n- Fixed plugin compatibility in Duos.\n\n## **Release v1.25.4 - 2024-04-16**\n**Updated for Hearthstone 29.2.0**\n\n**Notes**:\n- Most Battlegrounds features are disabled in Duos right now. We'll be investigating what's possible in the coming days!\n\n**New**:\n- Added a new setting to show the available Minion Types in the Battlegrounds session panel!\n\n**Fixes**:\n- Fixed an issue causing the Twitch Extension to generate incomplete deck codes if Zilliax Deluxe 3000 was in the deck.\n- Fixed an issue causing the Mulligan Guide to not show data for Zilliax Deluxe 3000.\n\n## **Release v1.25.3 - 2024-03-28**\n**Updated for Hearthstone 29.0.3**\n\n## **Release v1.25.2 - 2024-03-27**\n**Fixes**:\n- Fixed a memory leak that could cause the deck tracker to crash mid-game.\n- Fixed a long-standing issue that could cause long games (especially Battlegrounds) to go missing.\n- Fixed an issue causing Zilliax Deluxe 3000 to appear in the deck list twice after drawing it.\n- Fixed an issue causing new core secrets to not appear in the secret tracker.\n\n## **Release v1.25.1 - 2024-03-19**\n**New**:\n- Added support for Zilliax Deluxe 3000's custom cost in the deck list.\n\n**Fixes**:\n- Fixed an issue causing E.T.C.'s Band to appear when Zilliax was in the deck.\n- Fixed an issue causing the deck list to continuously reset when playing a Whizbang deck.\n- Fixed an issue causing decks with cards from Caverns of Time or Legacy to not be flagged as Wild.\n\n## **Release v1.25.0 - 2024-03-19**\n**Updated for Year of the Pegasus**\n\n## **Release v1.24.9 - 2024-03-13**\n- Fixed an issue that could cause deck that are legal in Standard to appear in the Wild section.\n\n## **Release v1.24.8 - 2024-03-12**\n- Fixed a crash related to Arena runs with new cards.\n\n## **Release v1.24.7 - 2024-03-11**\n**Updated for Hearthstone 29.0.0**\n- Updates for the release of Whizbang's Workshop and the Standard rotation will follow!\n\n## **Release v1.24.6 - 2024-02-22**\n**Updated for Hearthstone 28.6.2**\n\n## **Release v1.24.5 - 2024-02-19**\n**Fixes**:\n- Battlegrounds: Fixed an issue where the \"Minions Banned\" component showed the wrong minion types.\n- Battlegrounds: Fixed an issue where the hero picking overlay did not disappear immediately upon choosing a hero.\n\n## **Release v1.24.4 - 2024-02-18**\n**Fixes**:\n- Fixed an issue that could cause the mulligan popup to appear twice.\n- Fixed an issue causing the Wild icon to appear on decks with Gift cards and/or Harth Stonebrew.\n\n## **Release v1.24.3 - 2024-02-17**\n**Bob's Buddy**:\n- Enable combat simulations for Diremuck Forager when the opponent's board is full.\n\n**Changes**:\n- Started using data more appropriate for the current MMR in the Tier7 quest and hero picking overlays.\n\n**Fixes**:\n- Fixed an issue where the Tier7 quest overlay would not appear.\n- Fixed an issue where the in-menu Battlegrounds overlays would appear and disappear at incorrect times.\n\n## **Release v1.24.2 - 2024-02-14**\n**Fixes**:\n- Fixed an issue that could cause the deck lists to disappear.\n\n## **Release v1.24.1 - 2024-02-13**\n**Updated for Hearthstone 28.6.0**\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n- The Battlegrounds Quest Picking Overlay will return as soon as there's enough data for quests.\n\n**New**:\n- Added an in-game Mulligan Guide for HSReplay.net Premium subscribers! This feature is available in Ranked, Casual, Friendly Challenge and Arena.\n\n**Fixes**:\n- Fixed an issue where secrets would be incorrectly grayed out when dormant minions or portals were on the board.\n- Fixed an issue where Plagues moving into the opponent's hand through effects such as Sir Finley, Sea Guide were unintentionally revealed.\n\n## **Release v1.23.15 - 2024-01-29**\n**Updated for Hearthstone 28.4.1**\n\n**Fixes**:\n- Fixed Summoning Ward not appearing in the Mage secret tracker.\n- Fixed an issue where the attack counter incorrectly accounted for Mega-Windfury despite Silence (e.g. a silenced Walking Mountain).\n- Fixed an issue causing the \"Know your opponent's deck?\" prompt to stay up when entering menus.\n\n## **Release v1.23.15 - 2024-01-19**\n**Bob's Buddy**:\n- Fixed an issue that caused Bob's Buddy to get stuck on turn 1.\n\n## **Release v1.23.13 - 2024-01-18**\n**Updated for the release of Delve into Deepholm**\n\n**Changes**:\n- Hide card counters and card marks during the mulligan phase.\n\n**Bob's Buddy**:\n- Added support for Murozond (via Rylak).\n\n## **Release v1.23.12 - 2024-01-08**\n**Fixes**:\n- Fixed a long-standing issue where a duplicate overlay could appear on slower devices.\n\n**Bob's Buddy**:\n- Fixed an issue where Admiral Eliza Goreblade was not simulated correctly.\n\n## **Release v1.23.11 - 2023-12-19**\n**Updated for Hearthstone 28.2.3**\n\n**Changes**:\n- Reworked how Whizbang decks are imported, making HDT support new decks immediately when future expansions are released!\n- Show tavern tier 7 in the minion list overlay when Thorim, Stormlord is offered.\n\n**Bob's Buddy**:\n- Fixed an issue where the Recurring Nightmare deathrattle was not taken into account if it was added to another minion in the shopping phase.\n\n## **Release v1.23.10 - 2023-12-13**\n**New**:\n- Battlegrounds: Added support for Venomous and Reborn to the Last Known Board and Final Board features.\n\n**Changes**:\n- Battlegrounds: Improved the behaviour of the Bob's Buddy panel at the end of a match.\n\n**Fixes**:\n- Fixed an issue causing the popup with a link to the Mulligan guide sometimes incorrectly identifying the First/Coin state.\n- Battlegrounds: Fixed an issue causing the hero picking overlay and popup not disappearing when HDT was started during the hero picking phase.\n\n## **Release v1.23.9 - 2023-12-10**\n**Fixes**:\n- Fixed an issue where tooltips from the sideboard would appear even if the deck list is hidden.\n- Fixed an issue where the attack counters would not correctly handle Mega Mountain.\n\n**Bob's Buddy**:\n- Fixed an issue where Battlecries from Rylak Metalhead were not simulated correctly after being triggered by Hawkstrider Herald.\n- Fixed various simulation issues related to recently introduced and updated cards.\n\n## **Release v1.23.8 - 2023-12-08**\n**Updated for Hearthstone 28.2.1**\n\n**Bob's Buddy**:\n- Added support for spell triggers during combat (such as extra battlecries/deathrattles and start of combat effects).\n- Fixed an issue where Audacious Anchor could crash the simulation.\n\n## **Release v1.23.7 - 2023-12-07**\n**New**:\n- Added Battlegrounds spells to the Battlegrounds minion list overlay!\n\n**Fixes**:\n- Fixed an issue where the deck builder did not show neutral cards.\n- Fixed an issue where some cards in the Battlegrounds minion list were missing their card art.\n- Fixed an issue where the Twitch Extension would not work properly with boards containing Battlegrounds spells.\n\n## **Release v1.23.6 - 2023-12-05**\n**Updated for Hearthstone 28.2**\n\n**Bob's Buddy**:\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n\n## **Release v1.23.5 - 2023-12-04**\n**Changes**:\n- The Battlegrounds minion overlay no longer shows minions from tavern tier 7 unless Secrets of Norgannon is active.\n\n**Fixes**:\n- Fixed an issue that caused the deck builder to not show appropriate multi-class cards.\n\n**Bob's Buddy**:\n- Added support for Fairy Tale Caroler's Battlecry (with Rylak Metalhead).\n\n## **Release v1.23.4 - 2023-11-29**\n**Updated for Hearthstone 28.0.3**\n\n**Fixes**:\n- Fixed an issue where Snipe occasionally did not appear as a valid secret.\n- Fixed an issue where the Spell School counter overlay settings did not persist properly.\n- Fixed an issue where Love Everlasting and similar cards were not treated as spells.\n\n## **Release v1.23.3 - 2023-11-23**\n**New**:\n- Added a spell school counter!\n\n**Fixes**:\n- Fixed an issue where Sigils were not treated as spells.\n\n**Bob's Buddy**:\n- Improved secret handling by showing the odds immediately and recalculating whenever secrets are revealed (similar to Free-Flying Feathermane).\n- Fixed an issue where Admiral Eliza Goreblade was not simulated correctly.\n\n## **Release v1.23.1 - 2023-11-15**\n**Fixes**:\n- Fixed an issue causing the secret tracker to show Wild secrets in Standard.\n- Fixed the HSReplay.net settings not showing Tier7 subscriptions.\n\n## **Release v1.23.0 - 2023-11-14**\n**Updated for the release of Showdown in the Badlands**\n\n**New**:\n- Added Excavate counters.\n- Added support for a number of older cards.\n\n## **Release v1.22.12 - 2023-11-08**\n**Updated for Hearthstone 28.0**\n\n**Changes**:\n- The Battlegrounds minion overlay is now available during hero picking.\n\n## **Release v1.22.11 - 2023-10-26**\n**Updated for Hearthstone 27.6.2**\n\n**Fixes**:\n- Improved reliability of the available secrets for specific game modes.\n- Fixed an issue where the attack counters were not correctly handling Titans.\n- Fixed an issue where Plagues were not correctly added back to the deck when Helya is in play.\n\n## **Release v1.22.10 - 2023-10-17**\n**Updated for Hearthstone 27.6**\n\n**Bob's Buddy**:\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n\n## **Release v1.22.9 - 2023-10-16**\n**Fixes**\n- Fixed Battlegrounds minion types not appearing in the correct language.\n- Fixed a state in which HDT would excessively try to fetch remote data.\n\n## **Release v1.22.8 - 2023-10-10**\n**Bob's Buddy**\n- Fixed an issue where Choral Mrrrglr was not simulated correctly.\n\n## **Release v1.22.7 - 2023-10-01**\n**Fixes**\n- Fixed an issue where Battlegrounds games were sometimes not recorded in the Session Recap.\n\n## **Release v1.22.6 - 2023-09-29**\n**Fixes**\n- Fixed an occasional crash on Hearthstone startup.\n\n## **Release v1.22.5 - 2023-09-28**\n**Updated for Hearthstone 27.4.2**\n\n## **Release v1.22.3 - 2023-09-25**\n- Improved stability.\n\n## **Release v1.21.12 - 2023-09-20**\n**Bob's Buddy**\n- Fixed an issue where the Blessed or Blighted anomaly was not simulated correctly.\n\n## **Release v1.21.11 - 2023-09-19**\n**Updated for Hearthstone 27.4.0**\n\n**Fixes**\n- Fixed an issue where randomly cast cards with Dredge could unintentionally reveal the affected cards.\n- Fixed the C'Thun counter.\n\n**Bob's Buddy**\n- Fixed an issue where Mannoroth and Murcules were not simulated correctly after being attacked.\n- Fixed an issue where Frostwolf Lieutenant was simulated according to outdated card text.\n\n## **Release v1.21.10 - 2023-09-08**\n- Added missing Caverns of Time icon.\n\n**Bob's Buddy**\n- Fixed some rare interactions crashing the simulation.\n- Fixed various card issues related to cards updated in Hearthstone 27.2.2.\n\n## **Release v1.21.9 - 2023-09-05**\n- Added Caverns of Time filter to deck editor.\n\n**Bob's Buddy**\n- Fixed an issue with a player having multiple Recurring Nightmares.\n- Fixed various card issues related to cards updated in Hearthstone 27.2.2.\n\n## **Release v1.21.8 - 2023-08-30**\n**Updated for Hearthstone 27.2.2**\n\n## **Release v1.21.7 - 2023-08-25**\n- Minions that are banned in a given anomaly are now marked as such in the Battlegrounds minion list.\n\n**Bob's Buddy**\n- Fixed Bob's Buddy reappearing when Free-Flying Feathermane is summoned by the opponent.\n- Fixed further issues related to cards and mechanics added with Hearthstone 27.2.0.\n\n## **Release v1.21.6 - 2023-08-24**\n- Restored the Tier7 hero picking overlay with Anomaly support.\n\n**Bob's Buddy**\n- Fixed further issues related to cards and mechanics added with Hearthstone 27.2.0.\n\n## **Release v1.21.5 - 2023-08-23**\n- Added Anomaly support to the Twitch Extension.\n\n**Fixes**\n- Fixed an issue where the label for E.T.C.'s band would be visible on launch.\n- Fixed missing sideboards when copying a deck from the Twitch Extension.\n\n**Bob's Buddy**\n- Added support for Murky.\n- Fixed various issues related to cards and mechanics added with Hearthstone 27.2.0.\n- Fixed an issue where Menagerie Mug, Menagerie Jug and Tide Oracle Morgl could crash the simulation.\n\n## **Release v1.21.4 - 2023-08-22**\n**Bob's Buddy**\n- Added support for the new Minions and Anomalies.\n- There are likely still issues with some new cards. We will update these in the coming days.\n\n## **Release v1.21.3 - 2023-08-22**\n**Partially updated for Hearthstone 27.2.0**\n- The new minions are now available in the Battlegrounds overlay\n- An initial update for Bob's Buddy will follow soon!\n\n## **Release v1.21.2 - 2023-08-18**\n- Preparations for the upcoming Hearthstone patch 27.2.\n\n## **Release v1.21.1 - 2023-08-09**\n- Added support for an upcoming HSReplay.net feature\n\n**Bob's Buddy**:\n- Added support for Annihilan Battlemaster\n\n## **Release v1.21.0 - 2023-08-01**\n**Updated for the release of TITANS**\n\n**Fixes**\n- Fixed an issue where Buddy tooltips were still shown to viewers on Twitch\n\n## **Release v1.20.18 - 2023-07-25**\n**Updated for Hearthstone 27.0.0**\n\n## **Release v1.20.17 - 2023-07-16**\n**Bob's Buddy**:\n- Fixed an issue where buffs to cards in hand were not working correctly. This was leading to various incorrect 99% predictions.\n\n## **Release v1.20.15 - 2023-07-14**\n**Bob's Buddy**:\n- Fixed an issue where some Hero Power Start of Combat effects could be resolved in an incorrect order.\n\n## **Release v1.20.14 - 2023-07-13**\n**Fixes**:\n- Fixed an issue where the Tier7 Quest overlay was not working correctly.\n\n## **Release v1.20.13 - 2023-07-12**\n**Bob's Buddy**:\n- Fixed an issue where Tavish Stormpike's Hero Power was dealing an incorrect amount of damage.\n- Fixed an issue where Teron Gorefiend's Hero Power was sometimes resummoning the minion in the wrong position.\n- Fixed an issue where Ghoul of the Feast was triggering too often.\n\n## **Release v1.20.12 - 2023-07-11**\n**Bob's Buddy**:\n- Updated with support for the new Quests and Quest Rewards.\n- Fixed an issue where the initial board state used for simulations could be slightly incorrect in some cases.\n- We are actively investigating simulation issues and should have more improvements soon!\n\n## **Release v1.20.11 - 2023-07-06**\n**Updated for Hearthstone 26.6.2**\n\n## **Release v1.20.10 - 2023-06-27**\n**Updated for Hearthstone 26.6.0**\n\n## **Release v1.20.9 - 2023-06-15**\n**Updated for Hearthstone 26.4.3**\n\n## **Release v1.20.8 - 2023-06-01**\n**Fixes**:\n- Fixed an issue where old games were potentially parsed when starting HDT.\n\n## **Release v1.20.7 - 2023-05-31**\n**Updated for Hearthstone 26.4.0**\n\n## **Release v1.20.5 - 2023-05-31**\n**Restores functionality for Hearthstone 26.4.0**\n- Another update for the new card data will follow.\n\n**Bob's Buddy**:\n- Fixed an issue where Scourfin was unnecessarily preventing simulations.\n- Fixed an issue where Mantid Queen was not working correctly.\n\n## **Release v1.20.3 - 2023-05-30**\n**Bob's Buddy**:\n- Added support for many Battlecry interactions with Rylak Metalhead\n- Fixed various issues related to cards and mechanics added with Hearthstone 26.2.0.\n\n## **Release v1.20.2 - 2023-05-19**\n**Updated for Hearthstone 26.2.2**\n\n## **Release v1.20.1 - 2023-05-11**\n**Bob's Buddy**:\n- Fixed various issues related to cards and mechanics added with Hearthstone 26.2.0.\n\n## **Release v1.20.0 - 2023-05-10**\n**Updated for Hearthstone 26.2.0**\n\n**Bob's Buddy**:\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n- Interactions with Battlecries (Rylak Metalhead) are currently unsupported.\n- Interactions with unknown cards in the opponents hand (e.g. Bassgill or Scourfin) are currently unsupported.\n\n## **Release v1.19.24 - 2023-04-27**\n**Updated for Hearthstone 26.0.4**\n\n## **Release v1.19.23 - 2023-04-14**\n**Updated for Hearthstone 26.0.2**\n\n## **Release v1.19.22 - 2023-04-12**\n**Fixes**:\n- Fixed an issue where decks with Festival of Legends cards were marked as Wild.\n- Fixed an issue where ETC sideboard overlay was not showing correctly.\n\n## **Release v1.19.21 - 2023-04-11**\n**Updated for Year of the Wolf**\n\n**Changes**:\n- Added support for the majority of new cards.\n\n## **Release v1.19.20 - 2023-04-04**\n**Updated for Hearthstone 26.0.0**\n\n## **Release v1.19.19 - 2023-03-29**\n- Added support for E.T.C Band Manager in overlay.\n\n## **Release v1.19.17 - 2023-03-23**\n**Updated for Hearthstone 25.6.2**\n\n**Fixes**:\n- Fixed an issue where the expected damage range displayed by Bob's Buddy did not quite match the explanation in the tooltip.\n- Fixed an issue where Tribe-less supporting minions in Battlegrounds would be displayed when their Tribe was not available in the current lobby.\n\n## **Release v1.19.16 - 2023-03-14**\n**Updated for Hearthstone 25.6.0**\n\n## **Release v1.19.15 - 2023-03-02**\n**Updated for Hearthstone 25.4.3**\n\n## **Release v1.19.14 - 2023-02-15**\n**Bob's Buddy**:\n- Fixed an issue where Teron Gorefiends Hero Power was not working correctly.\n\n## **Release v1.19.13 - 2023-02-14**\n**Updated for Hearthstone 25.4.0**\n\n## **Release v1.19.12 - 2023-01-26**\n**Updated for Hearthstone 25.2.2**\n\n## **Release v1.19.11 - 2023-01-20**\n**Bob's Buddy**:\n- Fixed various issues related to cards and mechanics added with Hearthstone 25.2.0.\n\n## **Release v1.19.10 - 2023-01-19**\n**Bob's Buddy**:\n- Fixed an issue where dual-type minions were not working correctly.\n- Fixed an issue where Rot Hide Gnoll was not working correctly.\n\n**Fixes**:\n- Fixed an issue where the 5th banned Tribe was not appearing in the Session Recap panel.\n\n## **Release v1.19.9 - 2023-01-18**\n**Bob's Buddy**:\n- Added support for Putricide's Creations.\n- Fixed various issues related to Hearthstone 25.2.0.\n\n## **Release v1.19.8 - 2023-01-17**\n**Updated for Hearthstone 25.2.0**\n\n**Notes**:\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n\n## **Release v1.19.7 - 2022-12-19**\n**Updated for Hearthstone 25.0.4**\n\n## **Release v1.19.6 - 2022-12-13**\n**Changes**:\n- Added a setting to show/hide menu Overlays while Hearthstone is in the background. Defaults to hidden.\n- Added a setting to disable the Tier7 overlay functionality entirely.\n- Added a setting to disable the Tier7 MMR and \"Go to my stats\" panel.\n\n## **Release v1.19.5 - 2022-12-07**\n**Fixes**:\n- Fix an issue where cards consumed by the players Souleater's Scythe were revealed before the mulligan.\n- Fix an issue where cards consumed by the opponents Souleater's Scythe were revealed at all.\n\n## **Release v1.19.4 - 2022-12-06**\n**Changes**:\n- Added an option to disable the Battlegrounds Quest Reward Composition stats.\n\n**Fixes**:\n- Fix an issue where the Tier7 Pre-Game overlay could cover parts of the in-game Shop, Season Rewards, Friendslist and Quest UIs.\n\n## **Release v1.19.2 - 2022-12-05**\n**New**:\n- Added Battlegrounds Hero and Quest Reward stats to the Overlay!\n\n## **Release v1.19.1 - 2022-12-02**\n**Added support for March of the Lich King**\n\n## **Release v1.19.0 - 2022-11-29**\n**Fixes**:\n- Restored general functionality for Hearthstone 25.0.0.\n\n## **Release v1.18.27 - 2022-11-22**\n**Updated how Khadgar interacts with Evil Twin in Bob's Buddy**\n\n## **Release v1.18.26 - 2022-11-10**\n**Updated for Hearthstone 24.6.2**\n\n**Fixes**:\n- Fixed various Bob's Buddy simulation issues related to Hearthstone 24.6.0.\n\n## **Release v1.18.25 - 2022-11-03**\n**Fixes**:\n- Fixed an issue in Bob's Buddy where Volatile Venom was not working correctly.\n- Fixed an issue where Venomstrike Trap and Frozen Clone were not showing up in the secret tracker.\n\n## **Release v1.18.24 - 2022-11-01**\n**Updated for Hearthstone 24.6.0**\n\n## **Release v1.18.23 - 2022-10-13**\n**Updated for Hearthstone 24.4.3**\n\n## **Release v1.18.22 - 2022-09-29**\n**Added support for Dual and Neutral classes on Duels stats machups table**\n**Added support for Maw and Disorder secrets**\n**Fixed an issue where secrets were excluded from the list when Tight-Lipped Witness was in play**\n**Fixed several issues in Bob's Buddy related to Hearthstone 24.4.0**\n\n## **Release v1.18.21 - 2022-09-27**\n**Updated for Hearthstone 24.4.0**\n\n## **Release v1.18.20 - 2022-09-09**\n**Updated for Hearthstone 24.2.2**\n\n## **Release v1.18.19 - 2022-09-06**\n**Fixes**:\n- Fixed various more Bob's Buddy simulation issues related to Hearthstone 24.2.0.\n\n## **Release v1.18.18 - 2022-09-01**\n**Fixes**:\n- Fixed various more Bob's Buddy simulation issues related to Hearthstone 24.2.0.\n\n## **Release v1.18.17 - 2022-08-31**\n**Fixes**:\n- Fixed various Bob's Buddy simulation issues related to Hearthstone 24.2.0.\n- Fixed an issue where the opponents Battlegrounds Hero was not correctly appearing in the Twitch Extension.\n- Fixed an issue where multiple Battlegrounds Quests were not correctly appearing in the Twitch Extension.\n\n## **Release v1.18.16 - 2022-08-30**\n**Fixes**:\n- Fixed an issue in Bob's Buddy where Quest Rewards would sometimes incorrectly be considered active.\n- Fixed an issue where Quest Rewards were not appearing in the Twitch Extension.\n\n## **Release v1.18.14 - 2022-08-30**\n**Updated for Hearthstone 24.2.0**\n\n**Fixes**:\n- Fixed an issue where it was revealed that the opponent was playing Renathal during mulligan.\n\n**Notes**:\n- There are likely still issues with some new cards in Bob's Buddy. We will update these in the coming days.\n- Tooltips for vaious Battlegrounds cards may still be missing but should start appearing soon.\n- The experience progress bar has been disabled until we are able to update it for this patch.\n\n\n## **Release v1.18.13 - 2022-08-16**\n**Updated for Hearthstone 24.0.3**\n\n**Fixes**:\n- Fixed an issue where Secrets countered by Blademaster Okami were not handled correctly.\n\n## **Release v1.18.12 - 2022-08-03**\n**Fixes**:\n- Fixed an issue where Location cards were not working correctly with the Twitch Extension.\n- Fixed an issue where the chosen cards of Suspicious Alchemist/Usher/Pirate was revealed.\n\n## **Release v1.18.10 - 2022-08-01**\n**Added support for Murder at Castle Nathria**\n\n## **Release v1.18.9 - 2022-07-26**\n**Updated for Hearthstone 24.0.0**\n\n## **Release v1.18.8 - 2022-07-12**\n**Fixes**:\n- Fixed an issue where Battlegrounds Session Recap was not respecting some settings\n\n## **Release v1.18.6 - 2022-06-27**\n**Updated for Hearthstone 23.6.0**\n\n## **Release v1.18.5 - 2022-06-16**\n**Updated for Hearthstone 23.4.3**\n\n**New**:\n- Added a Battlegrounds Session Recap overlay & window, showing Banned Minions, MMR changes, and Recent Games.\n- Added a counter for Abyssal Curse\n\n**Fixes**:\n- Fixed an issue where Mirror Entity was displayed in Standard games.\n- Fixed an issue where information about cards discarded by Immolation was unintentionally revealed.\n\n## **Release v1.18.4 - 2022-06-01**\n**Fixes**:\n- Fixed an issue where the Ozumat Hero Power was not working correctly.\n\n## **Release v1.18.3 - 2022-06-01**\n**Updated for Hearthstone 23.4.0**\n\n**New**:\n- Hovering an opponent in Battlegrounds will now display their Tavern-Up and Triple history.\n\n## **Release v1.18.2 - 2022-05-19**\n**Updated for Hearthstone 23.2.2**\n\n**Fixes**:\n- Fixed an issue where cards added to the top or bottom of the deck by From the Depths were not tracked correctly.\n\n## **Release v1.18.1 - 2022-05-10**\n**Fixes**:\n- Fixed a remaining issue from the 23.2.0 patch where players were not correctly detected, leading e.g. to missing game results.\n\n## **Release v1.18.0 - 2022-05-10**\n**Updated for Hearthstone 23.2.0**\n\n**Fixes**:\n- Fixed an issue where Questline parts were counting towards the spell counter.\n\n## **Release v1.17.14 - 2022-05-03**\n**Fixes**:\n- Fixed an issue where the dredge card panels were missing in some cases.\n\n## **Release v1.17.13 - 2022-04-26**\n**Updated for Hearthstone 23.0.3**\n\n## **Release v1.17.12 - 2022-04-14**\n**New**\n- Cards added to the top or bottom of the deck, e.g. by Dredge or Azsharan cards, are now displayed next to the deck list.\n  - These additonal panels can be moved or disabled under \"options > overlay > player\".\n  - The following cards are currently not supported and will clear these panels to avoid displaying inaccurate information: Sir Finley Sea Guide, Ambassador Faelin, Sphere of Sapience, and Sightless Watcher.\n\n## **Release v1.17.11 - 2022-04-12**\n**Updated for Year of the Hydra**\n\n**Changes**:\n- Added support for the majority of new cards.\n\nDredge support coming soon!\n\n\n## **Release v1.17.10 - 2022-04-05**\n**Updated for Hearthstone 23.0.0**\n\n## **Release v1.17.9 - 2022-03-18**\n**Fixes**:\n- Fixed an issue where uploading the Mercenaries collection was no longer working after patch 22.6.0.\n\n## **Release v1.17.8 - 2022-03-17**\n**Updated for Hearthstone 22.6.0**\n\n## **Release v1.17.7 - 2022-03-03**\n**Updated for Hearthstone 22.4.3**\n\n## **Release v1.17.6 - 2022-02-15**\n**Updated for Hearthstone 22.4.0**\n\n## **Release v1.17.5 - 2022-02-08**\n**Updated for Hearthstone 22.2.2**\n\n**Fixes**:\n- Fixed an issue where the indicator for how long Battlegrounds opponents have been dead was misaligned when Hero Skins were present in the lobby.\n\n## **Release v1.17.4 - 2022-02-01**\n**Changes**:\n- The Twitch Extension now shows the Buddy when hovering the Buddy Meter in Battlegrounds.\n\n**Bob's Buddy**:\n- Tarecgosa now retains the 'Immune while attacking' buff, while the game has this behavior.\n- Fixed an issue where the additional reborn minions summond by Arfus had an incorrect amount of health.\n- Fixed an issue where attack and health values could overflow.\n\n## **Release v1.17.3 - 2022-01-25**\n**Bob's Buddy**:\n- Fixed various issues related to Spirit Raptor, Sr. Tomb Diver, Elementium Squirrel Bomb, and Arfus.\n- Fixed an issue with the interaction between Rafaam's Hero Power and Peggy Brittlebone.\n- Fixed an issue where deaths of multiple Scallywags were not resolved in the correct order in specific edge cases.\n\n## **Release v1.17.2 - 2022-01-25**\n**Bob's Buddy**:\n- Fixed various issues related to Spirit Raptor, Baby Y'Shaarj, Sr. Tomb Diver and Eclipsion Illidari.\n- Fixed an issue with the resolution order of Bru'Kan's Hero Power.\n- Fixed an issue with the interaction between golden Tarecgosa and Whelp Smuggler.\n- Fixed an issue introduced in today's update where Fragrant Phylactery would trigger without being activated.\n- Known issue: Piloted Whirl-O-Tron is not yet implemented.\n\n## **Release v1.17.1 - 2022-01-25**\n**Updated for Hearthstone 22.2.0**\n\n**Bob's Buddy**:\n- Added initial support for all Buddies. Fixes for any issues related to Buddies will follow shortly.\n\n\n## **Release v1.17.0 - 2022-01-19**\n**New**:\n- You can now view your [Mercenaries Collection on HSReplay.net](https://hsreplay.net/mercenaries/collection/mine/?utm_source=hdt&utm_medium=client&utm_campaign=update_notes)\n\n## **Release v1.16.19 - 2022-01-18**\n**Fixes**:\n- Fixed an issue where hotkeys were not working correctly.\n\n**Bob's Buddy**:\n- Fixed an issue where Mechano-Tank would target the wrong minion.\n- Fixed various issues related to resolution order of effects.\n\n## **Release v1.16.16 - 2022-01-04**\n**Bob's Buddy**:\n- Fixed an issue where Fish of N'Zoth was not copying all types of Deathrattles correctly.\n- Fixed an issue where Cattlecarp of N'Zoth was not working.\n- Fixed an issue where extra Deathrattles from Baron Rivendare would resolve too early.\n- Fixed an issue where Avenge effects would resolve too early.\n- Fixed an issue where golden Impulsive Trickster would always target the same minion twice.\n- Fixed an issue where Grease Bot would buff the target before damage was dealt.\n- Fixed an issue with the interaction between Greybough's Hero Power and Khadgar.\n- Fixed an issue where Prestor's Pyrospawn woud trigger on non-dragon minions and itself.\n- Fixed an issue where the 15 damage cap was still applied incorrectly in many cases when determining lethal rates.\n\n## **Release v1.16.13 - 2021-12-20**\n**Updated for Hearthstone 22.0.2**\n\n## **Release v1.16.12 - 2021-12-17**\n**Bob's Buddy**:\n- Fixed various interactions with Peggy Brittlebone.\n- Fixed an issue where various Avenge effects would trigger too often.\n- Fixed an issue where Tamsin Roame's Hero Power could target the wrong minion.\n- Fixed an issue where Impulsive Trickster would not pass on the correct amount of health when buffed.\n- Fixed an issue where Sewer Rat was not considered to have a Deathrattle effect.\n- Fixed an issue where the 15 damage cap was applied incorrectly in many cases when determining lethal rates.\n\n## **Release v1.16.11 - 2021-12-06**\n**Fixes**:\n- Fixed an issue where the turn timer could be visible during Mercenaries games.\n\n**Changes**:\n- Added support for Alterac Valley cards.\n\n## **Release v1.16.10 - 2021-11-30**\n**Updated for Hearthstone 22.0.0**\n\n## **Release v1.16.9 - 2021-11-19**\n**Fixes**\n- Fixed an issue where importing Duels decks was not working correctly.\n- Improved Bob's Buddy performance for Diablo.\n- Improved Bob's Buddy speed.\n- Improved Bob's Buddy performance when two players with secrest enter combat.\n\n## **Release v1.16.8 - 2021-11-16**\n**Updated for Hearthstone 21.8.0**\n\n**Fixes**\n- Fixed an issue where the Mercenaries game overlay would sometimes stay visible after the end of a game.\n- Fixed an issue where some Plugins would not receive game events.\n\n## **Release v1.16.7 - 2021-11-07**\n**Fixes**\n- Fixed Bob's Buddy's interaction with Diablo.\n- Fixed issue where overlay could sometimes block the \"back\" button when playing Mercenaries.\n\n## **Release v1.16.6 - 2021-11-02**\n**Updated for Hearthstone 21.6.0**\n\n\n## **Release v1.16.5 - 2021-10-31**\n**Fixes**\n- Fixed an issue where the Attack counter would be displayed during Mercenaries gameplay.\n- Fixed an issue where hovering the Minion Tier icons in Battlegrounds would not work correctly at resolutions above 1080p.\n\n\n## **Release v1.16.4 - 2021-10-28**\n\n**Fixes**\n- Fixed an issue where the \"set opponent deck\" panel in friendly games would be difficult to interact with in some cases.\n\n**Mercenaries**:\n- Added a \"Tasks\" icon to the overlay that displays the list of current tasks and their progress on hover.\n\n\n## **Release v1.16.3 - 2021-10-21**\n**Updated for Hearthstone 21.4.4**\n\n**Fixes**\n- Fixed an issue with the \"damage on board\" calculations when playing heroes with a weapon (e.g. Jaraxxus).\n\n**Mercenaries**:\n- Added icons above/below each Mercenary showing their Abilites with current Speed and Cooldown. Works for PvP and PvE.\n- Updated the Mercenaries hovers to show the actual level of an ability if it has been revealed.\n- Updated the Mercenaries hovers to show abilities for all PvE opponents.\n- All Mercenaries related overlay features can now individually be disabled under `options > overlay > mercenaries`.\n\n\n## **Release v1.16.2 - 2021-10-14**\n**Fixes**\n- Fixed a few issues related to Mercenaries.\n\n## **Release v1.16.0 - 2021-10-12**\n**Updated for Hearthstone 21.4.0**\n\n**Mercenaries**:\n- Added initial support for Mercenaries.\n- Hovering the opposing Mercenaries in PVP will display their 3 Abilities on the side of the screen.\n- More will follow in the coming days and weeks!\n\n## **Release v1.15.9 - 2021-09-21**\n**Updated for Hearthstone 21.3.0**\n\n**Fixes**\n- Improve Bob's Buddy preformance.\n\n## **Release v1.15.8 - 2021-09-14**\n**Fixes**\n- Improve Bob's Buddy preformance.\n- Fix issue where Judgement of Justice would be removed from the secret list after the player's hero attacked.\n- Fix issue where HDT would display when an opponent drew Pack Mule in their mulligan.\n\n## **Release v1.15.7 - 2021-09-07**\n**Fixes**\n- Improve Bob's Buddy preformance.\n\n## **Release v1.15.6 - 2021-09-03**\n**Fixes**\n- Fix other accuracy issues with Bob's Buddy.\n\n## **Release v1.15.5 - 2021-09-02**\n**Fixes**\n- Fix accuracy issues with Bob's Buddy.\n\n## **Release v1.15.4 - 2021-09-02**\n**Bob's Buddy**\n- Added a data quality warning about simulation results. We are actively working on improvements.\n\n## **Release v1.15.3 - 2021-08-31**\n**Updated for Hearthstone 21.2.0**\n\n## **Release v1.15.2 - 2021-08-17**\n**Updated for Hearthstone 21.0.3**\n\n**Fixes**:\n- Fixed various issues related to tracking secrets.\n- Fixed an issue where tradable cards were not tracked correctly.\n\n## **Release v1.15.1 - 2021-08-03**\n**Fixes**:\n- Fixed an issue where HDT did not count games played against an opponent with Maestra as games against a Rogue.\n- Fixed an issue where the battlegrounds overlay would not work with hero skins in some cases.\n- Fixed an issue where questlines were not considered quests.\n\n## **Release v1.15.0 - 2021-07-27**\n**Updated for Hearthstone 21.0.0**\n\n## **Release v1.14.27 - 2021-07-15**\n**Updated for Hearthstone 20.8.2**\n**Fixes**:\n- Fixed issue where the secret Judgement of Justice wouldn't be tracked.\n- Fixed issue where Bob's Buddy would have problems detecting the Lich King hero power.\n- Fixed issue where linking the opponent's deck would occasionally be duplicated.\n\n## **Release v1.14.26 - 2021-07-06**\n**New**:\n- The opponent deck list can now be set in friendly games. This can be enabled for all game modes under `options > overlay > opponent`.\n- Added support for Spanish as a language for the overlay.\n\n## **Release v1.14.25 - 2021-07-01**\n**Updated for Hearthstone 20.8.0**\n\n## **Release v1.14.24 - 2021-06-28**\n**New**:\n- Added ability to handle opponent secrets for Bob's Buddy.\n- Added tracking for what effect drew cards in the opponent's hand.\n**Fixes**:\n- Fixed issue where the opponent spell tracker would occasionally break.\n\n## **Release v1.14.22 - 2021-06-23**\n**Fixes**\n- Bob's Buddy improvements.\n\n## **Release v1.14.21- 2021-06-16**\n**Updated for Hearthstone 20.4.2**\n**Fixes**\n- Fixed bug where Agamaggan the Great Boar was classified as a beast in the battlegrounds minion menu.\n\n## **Release v1.14.20- 2021-06-14**\n**Fixes**\n- Fixed crash related to previous secret tracker update.\n\n## **Release v1.14.19- 2021-06-13**\n**Fixes**\n- Fixed crashes related to previous secret tracker update.\n\n## **Release v1.14.17- 2021-06-13**\n**Fixes**\n- Fix issue with Reckoning being removed as a possible secret when the damage dealer dies.\n- Fix issue with secrets triggered by spells being removed by spells cast by Sparkjoy Cheat.\n\n## **Release v1.14.16- 2021-06-03**\n**Updated for Hearthstone 20.4.0**\n\n## **Release v1.14.15- 2021-05-25**\n**Fixes**\n- Fix text of libram option.\n\n## **Release v1.14.14- 2021-05-22**\n**Fixes**\n- Bob's Buddy improvements.\n\n## **Release v1.14.13- 2021-05-19**\n**New**\n- Added tracker for cost reductions to librams.\n- Added tracking for cost reductions from Efficient Octo-bot.\n**Fixes**\n- Fixed Rigged Faire Game not being removed from possible secrets when the opponent only lost armor.\n- Bob's Buddy improvements.\n\n## **Release v1.14.12- 2021-05-12**\n**Updated for Hearthstone 20.2.2**\n\n## **Release v1.14.11- 2021-05-05**\n**Fixes**\n- Added card tiles for new Battlegrounds cards.\n\n## **Release v1.14.10 - 2021-05-04**\n**Updated for Hearthstone 20.2.0**\n\n## **Release v1.14.9 - 2021-05-04**\n**Fixes**\n- Fixed an issue related to the Hearthstone 20.2 patch that would cause the app to freeze. Another update for the Battlegrounds changes will follow shortly\n\n## **Release v1.14.8 - 2021-04-13**\n**Updated for Hearthstone 20.0.2**\n**New**\n- Added mulligan toast for constructed games.\n**Fixes**\n- Fixed an issue where \"Rank 1\" spells were not tracked correctly.\n\n## **Release v1.14.6 - 2021-04-10**\n**Fixes**\n- Fix issue where old secrets would incorrectly appear as available in Standard.\n- Fix issue where a secret transformed by Oh My Yogg would still cause the secret list to appear.\n- Fix issue where Rigged Faire Game would occasionally incorrectly be ruled out a possible secret.\n- Fix issue where Oasis Ally could appear as having been ruled out as a possible secret during their turn if they played Hysteria.\n\n## **Release v1.14.4 - 2021-04-03**\n**Fixes**\n- Add Demon Hunter Initiate to wild.\n- Add support for diamond cards\n- Fix playing against opponents with hidden names\n\n## **Release v1.14.3 - 2021-03-31**\n**Fixes**\n- Fix issue where Ashes of Outland was mistakenly moved to wild.\n- Fix Bob's Buddy issue with Barrens Blacksmith.\n\n## **Release v1.14.2 - 2021-03-30**\n**Fixes**\n- Add support for Forged in the Barrens.\n\n## **Release v1.14.1 - 2021-03-30**\n**Fixes**\n- Add support for secrets in Classic.\n- Prevent a duplicate murloc tidecaller from appearing in the Battlegrounds minion tiers.\n- Stop a data leak where cards discarded by opponent trackings would be visible in their decklist.\n- Fix an issue where Bob's Buddy could occasionally crash.\n- Fix an issue with tracking Competitive Spirit and Open the Cages.\n\n## **Release v1.14.0 - 2021-03-25**\n**Updated for Hearthstone 20.0.0**\n**Fixes**:\n- Fixed various Hearthstone patch related issues to restore general functionality. More fixes and updates for the patch will follow soon.\n\n## **Release v1.13.27 - 2021-03-08**\n**Fixes**:\n- Fixed an issue where the xp bar could fill up over and over again on startup.\n- Improved Bob's Buddy.\n- Fix issue where card images could download again even when the image already existed.\n\n\n## **Release v1.13.26 - 2021-02-19**\n**Updated for Hearthstone 19.6.0.74257 **\n\n## **Release v1.13.25 - 2021-01-29**\n**Fixes**:\n- Fixed an issue C'Thun The Shattered pieces were added to the wrong deck.\n\n## **Release v1.13.24 - 2021-01-28**\n**Updated for Hearthstone 19.4.1.72661**\n**Fixes**\n- Fixed an issue where Bob's Buddy would sometimes miss-use Greybough's hero power with reborn\n\n## **Release v1.13.23 - 2021-01-25**\n**New**\n- Upgraded cards in decklist to show full card images on hover\n**Fixes**\n- Fixed an issue where Shenanigans might be removed from possible secrets late\n\n## **Release v1.13.22 - 2021-01-21**\n**Updated for Hearthstone 19.4.0.71003**\n**New**\n- Added an indicator for how long Battlegrounds Opponents have been dead.\n\n## **Release v1.13.21 - 2021-01-08**\n**Updated for Hearthstone 19.2.1.70828**\n**Fixes**\n- Fixed an issue where player's could see cards created by C'thun The Shattered in their opponents' hands.\n\n## **Release v1.13.20 - 2020-12-18**\n**New**:\n- Added experience bar.\n**Fixes**:\n- Improved Bob's Buddy for most recent patch.\n\n## **Release v1.13.19 - 2020-12-15**\n**Fixes**:\n- Fixed an issue where playing against or with Fish of N'Zoth could cause Bob's Buddy to not run that turn.\n\n## **Release v1.13.18 - 2020-12-15**\n**Updated for Hearthstone 19.2.0.68600**\n\n## **Release v1.13.17 - 2020-12-04**\n**Fixes**:\n- Restore option to not show flavor text on card hover.\n\n## **Release v1.13.16 - 2020-11-24**\n**Fixes**:\n- Fixed an issue where Darkmoon Faire secrets might not appear as possible opponent secrets.\n\n## **Release v1.13.15 - 2020-11-18**\n**New**:\n- Added card and secret tracking for Darkmoon Faire.\n\n## **Release v1.13.14 - 2020-11-13**\n**Fixes**:\n- Fixed an issue where the Capturable Overlay (for streamers) could move around when e.g. hovering opponents in Battlegrounds.\n- Fixed an issue where Bob's Buddy mistook the player's board.\n\n## **Release v1.13.13 - 2020-11-12**\n**Updated for Hearthstone 19.0.0.65614**\n\n## **Release v1.13.12 - 2020-11-08**\n**Fixes**:\n- Fixed an issue where viewing opponent boards would ocassionally cause HDT to crash.\n\n## **Release v1.13.11 - 2020-11-05**\n**Updated for Hearthstone 18.6.1.65000**\n\n**New**:\n- Added support for the new Duels game mode.\n\n**Changes**:\n- Improved the way past opponent boards in Battlegrounds are displayed.\n\n## **Release v1.13.10 - 2020-10-28**\n- Added support for upcoming Tier7 feature\n\n## **Release v1.13.9 - 2020-10-22**\n**Updated for Hearthstone 18.6.0.63160**\n-Fix an issue where past known Battlegrounds boards wouldn't appear in custom lobbies.\n-Support for Duels game mode will be coming soon!\n\n## **Release v1.13.8 - 2020-09-08**\n**Updated for Hearthstone 18.4.2.62331**\n\n## **Release v1.13.7 - 2020-10-07**\n\n**Bob's Buddy**\n-Add information about the average damage given and taken in combat.\n-Fix an issue where Wildfire Elemental would sometimes damage the wrong minion.\n-Fix an issue where golden Crackling Cyclone's would sometimes not get Mega Windfury.\n\n## **Release v1.13.6 - 2020-09-29**\n**Updated for Hearthstone 18.4.0.60352**\n\n\n## **Release v1.13.5 - 2020-09-08**\n**Updated for Hearthstone 18.2.0.58213**\n\n**Fixes**:\n- Fixed an issue where Bob's Buddy might crash when facing Lich King.\n\n\n## **Release v1.13.4 - 2020-09-03**\n\n**Bob's Buddy**\n- Added additional instrumentation to track down Lich King prediction inaccuracies.\n\n\n## **Release v1.13.3 - 2020-09-01**\n\n**Fixes**:\n- Fixed an issue where additional secrets could be greyed out when the opponent had multiple secrets in play and Counterspell was triggered.\n- Fixed an issue where Aranna Starseeker's last board was not tracked between transforming to Aranna, Unleashed.\n\n**Bob's Buddy**\n- Fixed an issue where activations of Lich King's hero power would occasionally be missed.\n\n\n## **Release v1.13.2 - 2020-08-18**\n**Updated for Hearthstone 18.0.2.56359**\n\n**Fixes**:\n- Fixed an issue where Zoobot would still appear on the Battlegrounds minion list.\n- Fixed an issue where HDT would not work while playing Millhouse Manastorm with the Korean localization of Hearthstone.\n- Fixed an issue where drawing Transfer Student would add another copy to the deck.\n\n\n## **Release v1.13.1 - 2020-08-06**\n\n**Changes**:\n- Added support for Plagiarize.\n- Added tracking support for most Scholomance Academy cards.\n\n\n## **Release v1.13.0 - 2020-07-20**\n**Updated for Scholomance Academy**\n\n\n## **Release v1.12.17 - 2020-07-20**\n\n**Fixes**:\n- Fixed an issue where HDT would not correctly start on Windows 10, version 2004.\n\n\n## **Release v1.12.16 - 2020-07-14**\n**Updated for Hearthstone 17.6.0.53261**\n\n**Bob's Buddy**:\n-Fixed an issue where Khadgar-copied Sky Pirates wouldn't trigger Arcane Cannons.\n-Fixed an issue where Waxrider Toggwaggle would be able to save itself after being hit by a cleave minion (in response to Blizzard server-side changes).\n-Fixed an issue where a Baron Rivendare killed in the same attack as a Deathrattle minion wouldn't double the Deathrattle.\n\n\n## **Release v1.12.14 - 2020-07-08**\n\n**Bob's Buddy**:\n- Fixed an issue where Khadgar paired with a Scallywag would summon too few Sky Pirates.\n\n\n## **Release v1.12.13 - 2020-07-02**\n\n**Bob's Buddy**:\n- Fixed an issue where King Bagurgle triggered by Monstrous Macaw would buff itself.\n- Fixed an issue where duplicate Hero Powers would not stack (e.g. Deathwing vs Sir Finnley).\n- Fixed an issue where Deflect-o-Bot Divine Shield trigger did not correctly interact with Deathrattles.\n- Updated Khadgar to be able to duplicate minions with Reborn (this was a server-side change by Blizzard).\n\n\n## **Release v1.12.12 - 2020-06-18**\n**Updated for Hearthstone 17.4.1.51510**\n\n**Fixes**:\n - Fixed an issue where Zoobot might get duplicated in the minions list in Battlegrounds games without Mechs.\n\n**Bob's Buddy**:\n- Fixed an issue where Bob's Buddy was not working when spectating Battlegrounds games.\n- Fixed more issues related to auras that increase health.\n\n\n## **Release v1.12.11 - 2020-06-15**\n\n**Fixes**:\n- Fixed an issue where Zoobot would not show up in the Minions list in Battlegrounds games without Mechs.\n\n**Bob's Buddy**:\n- Fixed an issue with the interaction between Illidans Hero Power and Arcane Canon.\n- Random summons are now restricted to the tribes available during the game.\n- Fixed an issue where auras that increase health were not correctly removed.\n\n\n## **Release v1.12.10 - 2020-06-13**\n\n**Bob's Buddy**:\n- Fixed an issue with the interaction between Scallywag and Monstrous Macaw.\n- Fixed an issue where Arcane Canon would sometimes not detect its neighbouring minions correctly.\n- Fixed an issue where Khadgar would not correctly work with The Beast's Deathrattle.\n\n\n## **Release v1.12.9 - 2020-06-11**\n\n**Bob's Buddy**:\n- Fixed an issue with the attack timing for Skallywag's Deathrattle and Arcane Canon.\n- Fixed an issue with resolving multiple Deathrattles at once.\n\n\n## **Release v1.12.8 - 2020-06-09**\n**Updated for Hearthstone 17.4.0.49534**\n\n**Changes**:\n- The minion list in Battlegrounds games will now only show races available in the current game.\n\n**Bob's Buddy**:\n- Added initial support for all new minions added in this Hearthstone patch (Pirates).\n- Fixed various minor issues related to Kangor's Apprentice's Deathrattle.\n- Fixed an issue where Siegebreaker's aura wasn't working correctly.\n\n\n## **Release v1.12.7 - 2020-06-03**\n\n**Bob's Buddy**:\n- Fixed an issue where multiple Deathrattles triggering simultaneously would sometimes not resolve correctly (e.g. in Exodia builds).\n- Fixed an issue where Professor Putricide's Hero Power was applied twice in some cases.\n- Fixed an issue where Mal'Ganis' aura was sometimes not applied correctly.\n\n\n## **Release v1.12.6 - 2020-05-25**\n\n**New**:\n- Opponent hand icons now display the card they have been created by.\n\n**Fixes**:\n- Fixed an issue causing high GPU usage during Battlegrounds games.\n\n**Bob's Buddy**:\n- Increased the maximum amount of time simulations are allowed to run for complex boards.\n- Fixed an issue where Reborn minions could trigger effects on themselves.\n\n\n## **Release v1.12.5 - 2020-05-20**\n\n**Fixes**:\n- Fixed an issue where HDT had unnecessarily high CPU/GPU usage in some cases.\n- Fixed an issue where flavor text tooltips were not working correctly for cards held in hand.\n- Fixed an issue where flavor text tooltips were not working correctly with transformed minions.\n- Fixed an issue where card tooltips in the Twitch Extension were not working correctly with transformed minions.\n- Fixed several issues where the secret helper would not correctly handle minions that died during an attack.\n\n**Bob's Buddy**:\n- Fixed an issue where Start of Combat triggers for Kel'Thuzad were not handled correctly (this was recently fixed in Hearthstone).\n- Fixed an issue where opposing Lich King / Putricide were considered to have used their hero power when they did not.\n- Fixed an issue where Fiendish Servant was not able to target the same minion twice.\n- Fixed an issue where Khadgar would incorrectly duplicate minions with Reborn.\n\n\n## **Release v1.12.2 - 2020-05-18**\n**Updated for Hearthstone 17.2.1.48313**\n\n**Changes**:\n- The attack counters are now automatically hidden while in Battlegrounds.\n- Fixed a rounding issue where the Bob's Buddy lethal chance could exceed the chance to win.\n- Improved Bob's Buddy prediction accuracy.\n\n\n## **Release v1.12.0 - 2020-05-13**\n**Updated for Hearthstone 17.2.0.47374**\n\n**Notes**:\n- Hearthstone 17.2 introduced major internal changes. We think we got everything working again, but please let us know if you encounter issues with this release.\n- Some card images added with 17.2 may still be missing. These will be added with the next update.\n\n**Changes**:\n- Improved Bob's Buddy prediction accuracy.\n- Potentially fixed an issue causing decks to not be selected at the start of a game.\n\n\n## **Release v1.11.9 - 2020-05-06**\n**Fixes**:\n- Fixed an issue where some Deathrattle interactions were not handled correctly in Bob's Buddy.\n\n\n## **Release v1.11.8 - 2020-05-05**\n**Changes**:\n- Added Tracking for cards copied by e.g. Maname Lazul and Mind Vision.\n- Improved Bob's Buddy prediction accuracy.\n\n\n## **Release v1.11.7 - 2020-04-30**\n**Fixes**:\n- Fixed an issue where golden minions in Battlegrounds could lead to incorrect outcome predictions.\n\n\n## **Release v1.11.6 - 2020-04-29**\n**New**:\n- Added Bob's Buddy: A Battlegrounds combat simulator showing the likelihood to win, tie or lose.  [Learn more.](https://articles.hsreplay.net/2020/04/24/introducing-bobs-buddy/)\n\n**Fixes**:\n- Fixed an issue where running other deck trackers in parallel may have caused HDT to stop working in some cases.\n- Fixed an issue causing several created cards (e.g. Bombs) to not be tracked correctly.\n- Fixed an issue where weapons were not correctly accounted for in the attacak mana curve.\n\n**Notes**:\n- This version upgrades to .NET Framework 4.7.2, which means installations of Windows 7 and Windows 8 that are not updated to Service Pack 1 will no longer be able to run HDT.\n- This version updates several dependencies, causing some Plugins to no longer load.\n- Releases v1.11.0-v1.11.5 contained various updates and fixes to Bob's Buddy\n\n\n## **Release v1.10.8 - 2020-04-20**\n**Updated for 17.0.2.45932**\n\n**Fixes**:\n- Fixed an issue where Netherwind Portal was missing from the secret helper.\n- Plugins should now be less likely to cause crashes.\n\n\n## **Release v1.10.7 - 2020-04-09**\n**Updated for 17.0.0.45310**\n\n**Fixes**:\n- Fixed an issue where Snipe, Explosive Runes, Potion of Polymorph and Repentance would get greyed out when playing a dormant minion.\n- Fixed an issue where dormant minions would sometimes count towards damage on board.\n- Fixed an issue where Al'ar, when resurrected from his ashes, would count towards damage on board.\n- Fixed an issue where linked Twitch accounts were not detected correctly in some cases.\n- Fixed an issue where the global statistics panel would not show data for new decks (due to local caching, this may take up to 24 hours to update).\n\n\n## **Release v1.10.6 - 2020-04-07**\n**Updated for Year of the Phoenix**\n\n**Changes**:\n- Added support for Ashes of Outland secrets\n- Added support for card tracking for several new cards\n\n\n## **Release v1.10.5 - 2020-04-04**\n**Fixes**:\n- Fixed an issue where the deck tracker would stop working when playing AI games, caused by an oversight in v1.10.4.\n- Fixed an issue where moving a game between decks would not update the deck in the games list.\n\n\n## **Release v1.10.4 - 2020-04-04**\n**Fixes**:\n- Fixed an issue where the deck tracker would stop working when playing against opponents appearing as offline.\n\n\n## **Release v1.10.3 - 2020-04-02**\n**Changes**:\n- Added a \"All Leagues + Legacy\" filter option to the constructed stats League filter.\n\n**Fixes**:\n- Fixed an issue where Warrior was missing from the Arena Win/Loss chart.\n- Fixed an issue where Demon Hunter decks were not imported correctly.\n\n\n## **Release v1.10.2 - 2020-03-30**\n**Added support for the new constructed rank system**:\n- Added a \"League\" filter under `STATS > CONSTRUCTED`, when the Game Mode is set to Ranked, to show games played in a specific league.\n- Games played in the old rank system can still be found by selecting \"Legacy\" in the League filter.\n\n**Fixes**:\n- Fixed various layout issues introduced by the addition of Demon Hunter and the new rank system.\n\n\n## **Release v1.10.1 - 2020-03-26**\n**Updated for Ashes of Outland**\n- Added basic support for Demon Hunter\n- Updated for Battlegrounds changes\n- Updated for Hall of Fame changes\n\nThis update should restore the basic functionality. Support for Demon Hunter card interactions and the new Ranked system coming soon.\n\n\n## **Release v1.10.0 - 2020-03-25**\n**New**:\n- Added a turn counter on the Battlegrounds overlay (`options > overlay > general`)\n- Added a notification at the start of Battlegrounds games to see the HSReplay.net Hero Tier List filtered to the hero choices (`options > tracker > notifications`).\n\n**Changes**:\n- The Battlegrounds overlay is now clickable rather than hover activated.\n\n\n## **Release v1.9.12 - 2020-03-17**\n**Updated for Hearthstone 16.6.0.43246**\n\n\n## **Release v1.9.11 - 2020-02-26**\n**Updated for Hearthstone 16.4.0.42174**\n\n**Fixed**:\n- Fixed an issue where Misdirection secret detection would not work correctly with immune targets.\n\n\n## **Release v1.9.10 - 2020-01-21**\n**Updated for Hearthstone 16.2.0.39954**\n\n\n## **Release v1.9.9 - 2020-01-09**\n**Updated for Hearthstone 16.0.8.39282**\n\n\n## **Release v1.9.8 - 2019-12-20**\n**New**:\n- Added a new counter for Galakrond invocations.\n\n**Changes**:\n- Turn timers are now always hidden while playing Battlegrounds.\n\n\n## **Release v1.9.7 - 2019-12-19**\n**Updated for Hearthstone 16.0.5.38377**\n\n\n## **Release v1.9.6 - 2019-12-11**\n**Fixes**:\n- Fixed an issue that was causing HDT to stop tracking cards and stats under certain conditions.\n\n\n## **Release v1.9.5 - 2019-12-10**\n**Changes**:\n- Added card tracking for serveral new Descent of Dragons cards.\n- The Battlegrounds minion tiers overlay now fades out when hovering opponents in the leaderboard.\n\n**Fixes**:\n- Fixed an issue where Galakrond was not tracked correctly.\n\n\n## **Release v1.9.4 - 2019-12-09**\n**Fixes**:\n- Potentially fixed an issue where the battlegrounds overlay would go off screen.\n- Fixed an issue where HDT would crash when showing tooltips for certain cards.\n- Fixed an issue where HDT would cause a crash during some battlegrounds games.\n\n\n## **Release v1.9.3 - 2019-12-09**\n**Fixes**:\n- Fixed an issue where the last known board state in Battlegrounds was not always reliably tracked.\n\n\n## **Release v1.9.2 - 2019-12-05**\n**Updated for Descent of Dragons**\n\n\n## **Release v1.9.1 - 2019-12-03**\n**New**:\n- Added a new overlay for Battlegrounds, showing minions available in each tavern tier.\n\n**Fixes**:\n- Fixed an issue where pinned shortcuts would not work across updates.\n\n\n## **Release v1.9.0 - 2019-11-14**\n**New: Battlegrounds Support**:\n- Hovering an opponent in the sidebar will now display their last known board state.\n\n**Fixes**:\n- Fixed an issue where the arena dialog would show up after a Battlegrounds match if an arena deck was previously selected.\n- The secret panel has been temporarily disabled in Battlegrounds, until it is fixed to work correctly.\n\n\n## **Release v1.8.22 - 2019-11-05**\n**Updated for Hearthstone 15.6.0.35747**\n\n\n## **Release v1.8.21 - 2019-10-08**\n**Fixes**:\n- Fixed an issue introduced with 15.4.0.34670 where Arena Decks would not be imported.\n- Fixed an issue introduced with 15.4.0.34670 where Adventure Decks would not be imported.\n\n\n## **Release v1.8.20 - 2019-10-08**\n**Updated for Hearthstone 15.4.0.34670**\n\n**Fixes**:\n- Fixed an issue introduced with 15.4.0.34670 where HDT would hang when starting Hearthstone.\n\n**Outstanding issues**:\n- Adventure deck detection broke with 15.4.0.34670. We are hoping we can fix this soon.\n- There might be more issues introduced by the patch that we missed so far. Please let us know if you find any.\n\n\n## **Release v1.8.19 - 2019-09-23**\n**Fixes**:\n- Fixed an issue causing HDT to occasionally crash when importing Tombs of Terror decks.\n\n\n## **Release v1.8.18 - 2019-09-23**\n**Added support for Tombs of Terror**\n\n\n## **Release v1.8.17 - 2019-09-10**\n**Updated for Hearthstone 15.2.0.33717**\n\n**New**:\n- Added tracking support for minions shuffled by Spirit of the Dead.\n\n\n## **Release v1.8.16 - 2019-08-26**\n**Updated for Hearthstone 15.0.4.33402**\n\n\n## **Release v1.8.15 - 2019-08-08**\n**Added support for several Saviors of Uldum cards**\n\n**Fixes**:\n- Fixed an issue where Whizbang decks would not be imported or detected correctly.\n- Fixed an issue where Pressure Plate secret detection was not working correctly.\n\n\n## **Release v1.8.14 - 2019-08-01**\n**Updated for Saviors of Uldum**\n\n\n## **Release v1.8.13 - 2019-07-01**\n**Updated for Hearthstone 14.6.0.31761**\n\n\n## **Release v1.8.12 - 2019-06-18**\n**Fixes**:\n- Fixed a couple of minor issues causing more information to be revealed than intended.\n\n\n## **Release v1.8.11 - 2019-06-03**\n**Updated for Hearthstone 14.4.0.31268**\n\n\n## **Release v1.8.10 - 2019-05-27**\n**Updated for Hearthstone 14.2.2.31022**\n- Added deck tracking support for the Dalaran Heist adventure\n\n\n## **Release v1.8.9 - 2019-05-16**\n**Updated for Hearthstone 14.2.0.30795**\n- Full support for the Dalaran Heist adventure will follow with a later update!\n\n\n## **Release v1.8.7 - 2019-04-13**\n**Fixes**:\n- Fixed various interactions with Augmented Elekk.\n- Fixed an issue where Never surrender would be greyed out with no minions on the board.\n\n\n## **Release v1.8.6 - 2019-04-11**\n**Fixes**:\n- Fixed an issue where an incorrect list of secrets would be displayed in Arena.\n- Fixed an issue where tooltips were not working correctly for some cards.\n\n\n## **Release v1.8.5 - 2019-04-09**\n__Updated for Year of the Dragon__\n\n\n## **Release v1.8.4 - 2019-04-04**\n__Updated for Rise of Shadows__\n\n\n## **Release v1.8.3 - 2019-03-16**\n**Fixes**:\n- Fixed an issue where Hakkar's Corrupted Blood would not be tracked correctly.\n- Fixed an issue with detecting the Twitch stream language for HSReplay.net intregration.\n\n\n## **Release v1.8.2 - 2019-03-15**\n**Updated for Hearthstone 13.4.0.29349**\n\n\n## **Release v1.8.1 - 2019-03-04**\n- Added additional features for Twitch VODs on HSReplay.net.\n\n\n## **Release v1.8.0 - 2019-02-05**\n**Updated for Hearthstone 13.2.0.28855**\n\n**New**:\n- Added an option to display the set of a card in the tooltip. (`options > overlay > general`)\n\n**Changes**:\n- Updated Rumble Run decks for recent changes.\n\n**Fixes**:\n- Fixed an issue where cards created by Augmented Elekk were not tracked.\n- Fixed an issue where Snipe was excluded from the possible secret in Arena.\n- Fixed several set icons.\n\n\n## __Release v1.7.16 - 2018-12-19__\n__Updated for Hearthstone 13.0.3.28329__\n\n\n## __Release v1.7.15 - 2018-12-13__\n\n__New__:\n- Added support for Rumble Run.\n\n__Fixes__:\n- Fixed an issue where Freezing Trap and Bear Trap would sometimes be incorrectly greyed out.\n\n\n## __Release v1.7.13 - 2018-11-29__\n__Updated for Rastakhan's Rumble__\n\n__Fixes__:\n- Fixed an issue where spells played by an opposing Grand Archivist were not tracked.\n- Fixed an issue where the gold tracker would not reset correctly sometimes.\n\n\n## __Release v1.7.12 - 2018-11-12__\n\n__Fixes__:\n- Fixed an issue where gold progress tracking was no longer working with Hearthstone 12.4.0.27641.\n\n\n## __Release v1.7.11 - 2018-11-05__\n__Updated for Hearthstone 12.4.0.27405__\n\n\n## __Release v1.7.10 - 2018-10-28__\n\n__Fixes__:\n- Fixed the Mage and Toki stater decks for Dungeon Run and Monster Hunt modes.\n\n\n## __Release v1.7.9 - 2018-10-18__\n__Updated for Hearthstone 12.2.0.27358__\n\n__Fixes__:\n- Fixed an issue where Dungeon Run decks would not be named correctly.\n\n\n## __Release v1.7.8 - 2018-10-04__\n\n__Fixes__:\n- Fixed more issues where deck tracking would not work in some game modes / at legend.\n\n\n## __Release v1.7.7 - 2018-10-03__\n\n__Fixes__:\n- Fixed an issue where deck tracking would not work correctly in some game modes.\n\n\n## __Release v1.7.6 - 2018-10-02__\n__Updated for Hearthstone 12.2.0.26757__\n\n__New__:\n- Added a Pogo-Hopper counter for Rogues.\n\n__Fixes__:\n- Fixed an issue where starting Hearthstone would sometimes not work correctly.\n- Fixed an issue where standard decks could get tagged as \"brawl\".\n- Improved the secret detection when minions die (e.g. Explosive Runes and Potion of Polymorph).\n- Improved the way Whizbang decks are detected.\n- Improved stability when saving files.\n\n\n## __Release v1.7.5 - 2018-08-15__\n\n__Fixes__:\n- Fixed an issue where Autodefense Matrix would be greyed out when attacking minions with divine shield.\n- (Hopefully) Fixed an issue where the player and opponent decks could be swapped in some cases.\n- Fixed an issue where it would sometimes still be possible to tell that the opponent was playing a Whizbang deck.\n- Improved automatic deck selection when playing the Whizbang deck.\n\n\n## __Release v1.7.4 - 2018-08-09__\n\n- Fixed several crashes.\n\n\n## __Release v1.7.2 - 2018-08-09__\n\n__New__:\n- Added tracking for several Boomsday cards.\n- All possible decks for Whizbang are now automatically imported when his deck is found.\n\n__Fixes__:\n- Fixed an issue where Boomsday packs were missing as an arena reward.\n- Fixed an issue where Whizbang decks were not tracked correctly.\n- Fixed an issue where secrets would be ruled out when using Magnetic minions as a buff.\n- (Hopefully) Fixed \"Uneven Permissons\" issues in some cases.\n\n\n## __Release v1.7.1 - 2018-08-02__\n__Updated for The Boomsday Project__\n\n- Fixed several crashes.\n- Tracking for cards created by Boomsday cards will follow in a later update.\n\n\n## __Release v1.6.9 - 2018-07-10__\n__Updated for Hearthstone 11.4.0.25252__\n\n- Fixed issues with collection syncing and arena drafting introduced by this patch.\n\n\n## __Release v1.6.8 - 2018-06-24__\n\n- Fixed an issue where Hearthstone was no longer starting via the integrated button.\n\n\n## __Release v1.6.7 - 2018-06-10__\n__Updated for Taverns of Time event__\n\n__New__:\n- Redesigned the plugins menu (`options > tracker > plugins`).\n- Added an option to display the \"last edited\" date on decks (`options > tracker > general`).\n- Improved configuration for turn start and friendly challenge notifications (`options > tracker > notifications`).\n\n__Fixes__:\n- Fixed an issue where cards were sometimes not permanently removed from the deck after patch 11.2.0.\n\n\n## __Release v1.6.6 - 2018-05-22__\n__Updated for Hearthstone 11.1.1.24589__\n\n__New__:\n- Added an option to close HDT to the system tray. `(options > tracker > settings)`\n\n__Fixes__:\n- Fixed tracking for cards created by Shadow Reflection and several Monster Hunt cards.\n\n\n## __Release v1.6.5 - 2018-04-27__\n\n__Added support for Monster Hunt__\n\n__Fixes__:\n- Fixed an issue where Direhorn Hatchling was considered created after dying.\n\n\n## __Release v1.6.4 - 2018-04-17__\n\n__Fixes__:\n- Fixed an issue where cards in dungeon runs were not tracked correctly.\n- Fixed an issue where cards created by Shudderwock were not tracked correctly.\n- Fixed an issue where cards drawn by Far Sight were not tracked correctly.\n\n\n## __Release v1.6.3 - 2018-04-13__\n\n__New__:\n- The opponent card list now tracks cards revealed by Cameleos.\n\n__Fixes__:\n- Fixed an issue where deck tracking would no longer work after playing Prince Liam.\n- Fixed an issue where secret tracking for Hidden Wisdom and Rat Trap did not work correctly.\n- Fixed an issue where Ice Block, Molten Giant and Coldlight Oracle were still considered Standard.\n\n\n## __Release v1.6.2 - 2018-04-12__\n\n__Updated for Standard rotation__\n\n\n## __Release v1.6.1 - 2018-04-10__\n\n__Updated for The Witchwood__\n\n__Fixes__:\n- Fixed an issue where the options menu was not scrollable.\n\n\n## __Release v1.6.0 - 2018-03-21__\n\n__New__:\n- Added support to upload your collection to HSReplay.net.\n\n__Fixes__:\n- Fixed an issue where the \"Start Hearthstone\" button would not work correctly in some cases when the launcher was not running.\n\n\n## __Release v1.5.14 - 2018-03-15__\n\n- Fixed an issue with the updater for the portable version.\n\n\n## __Release v1.5.13 - 2018-03-12__\n__Updated for Hearthstone 10.4.0.23576__\n\n__Fixes__:\n- Fixed an issue where the player and opponent could sometimes be swapped.\n- Fixed an issue where mulliganed cards would sometimes be out of order in the deck list.\n- Fixed an issue where Weasel Tunneler was not tracked correctly.\n- Fixed an issue with card name font on the flavor text panel.\n\n\n## __Release v1.5.12 - 2018-02-06__\n__Updated for Hearthstone 10.2.0.23180__\n\n__New__:\n- Added an option for Hearthstone to flash when receiving a friendly challenge `(options > tracker > general)`.\n\n__Fixes__:\n- Fixed an issue where stats on deck tiles would not update.\n- Fixed an issue where spectator games would somtimes be attached to the wrong decks.\n- Fixed an issue with the card tooltip font for some languages.\n\n\n## __Release v1.5.11 - 2018-01-17__\n\n__Fixes__:\n- Fixed an issue where the \"Toggle Secrets\" hotkey wasn't working.\n- Fixed several issues with UI components not updating when changing languages/colors.\n- Fixed an issue where The Candle wasn't tracked correctly.\n- Fixed the image for Psychic Scream.\n\n\n## __Release v1.5.10 - 2017-12-18__\n\n- Fixed tracking of cards created by: Dead Man's Hand, Psychic Scream, Spiteful Summoner, Dragon's Fury, and several others.\n\n\n## __Release v1.5.9 - 2017-12-15__\n\n- Fixed an issue where some other cards would no longer be tracked due to the previous update.\n\n\n## __Release v1.5.8 - 2017-12-14__\n\n- Fixed an issue where Togwaggle and his King's Ransom would reveal more information than they should.\n\n\n## __Release v1.5.7 - 2017-12-13__\n\n__New:__\n- Added support for dungeon run decks.\n\t- Settings for this can be found under `options (advanced) > tracker > importing`.\n- Added filters for dungeon and brawl decks to the decks list filters.\n\n__Fixes:__\n- Fixed tracking for cards created by: Fal'dorei Strider, Kingsbane and Scroll of Wonders.\n- Fixed an issue where Sudden Betrayal would sometimes grey out when attacking with the hero.\n- Fixed an issue where the The Darkness token would count towards the attack counter.\n- Fixed a performance issue when \"Advanced window search\" was enabled.\n- Fixed several crashes.\n\n\n## __Release v1.5.6 - 2017-12-07__\n\n__Updated for Kobolds and Catacombs__\n\n__Fixes__:\n- Fixed an issue where flavor text tooltips were barely readable in some cases.\n\n__Changes__:\n- Improved secret tracking logic for Hidden Cache.\n\n\n## __Release v1.5.5 - 2017-11-06__\n\n__Updated for Hearthstone 9.4.0.22115__\n\n\n## __Release v1.5.4 - 2017-10-28__\n\n- Fixed an issue that caused transformed cards to not be recognized correctly (e.g. Fatespinner or Shifter Zerus).\n\n\n## __Release v1.5.3 - 2017-10-26__\n\n- Fixed an issue that could cause HDT to crash when trying to authenticate with HSReplay.net.\n\n\n## __Release v1.5.2 - 2017-10-26__\n\n__New__:\n- Our Twitch Overlay Extension is now available! (`options (advanced) > streaming > twitch extension`)\n\n__Fixes__:\n- Fixed an issue where starting Battle.net/Hearthstone was not working with the Battle.net beta client.\n\n\n## __Release v1.5.1 - 2017-10-18__\n\n- Fixed an issue where games played with the new Warlock hero would not be recorded correctly.\n\n\n## __Release v1.5.0 - 2017-10-17__\n\n__Updated for Hearthstone 9.2.0.21517__\n\n__Fixes__:\n- Fixed an issue where Wild Secrets would show up in Arena.\n\n\n## __Release v1.4.4 - 2017-09-20__\n\nFixed a crash on startup when the config was set to be stored locally.\n\n\n## __Release v1.4.3 - 2017-09-19__\n\n__Updated for Hearthstone 9.1.0.20970__\n\n__New__:\n- Added support to use the windows native accent color.\n- Added hotkey functionality for toggling the \"My Games\" panel.\n\n__Changes__:\n- Deck codes can now also be pasted into the deck editor.\n- Several opponent overlay options have been moved from `general` to `opponent`.\n\n\n## __Release v1.4.2 - 2017-09-05__\n\n- Fixed an issue where cards from the Classic set could not be set as arena rewards.\n\n\n## __Release v1.4.1 - 2017-08-24__\n\n__Fixes__:\n- Fixed an issue where cards destroyed by Skulking Geist would sometimes not be tracked.\n- Fixed an issue where Adventure heroes would show up in the card lists.\n- Fixed an issue where entering card names in the arena rewards dialog would not work if the UI language was not english.\n- Fixed several issues related to secrets tracking.\n\n\n## __Release v1.4.0 - 2017-08-08__\n\n__Updated for Knights of the Frozen Throne__\n\n__Changes__:\n- Opponent card markers now scale with the opponent scaling value set in `options > overlay > opponent`.\n\n__API__:\n- Added GameEvents.OnModeChanged\n\n\n## __Release v1.3.6 - 2017-07-30__\n\n__New__:\n- Added German and French translations.\n- Added a \"Missing cards\" tab to the \"Export\" flyout, which will show you any cards you are missing for that deck.\n\n__Fixes__:\n- Fixed an issue where deck importing would not find an existing deck in versions.\n- Fixed an issue where auto deck selection would not always find the correct version.\n- Fixed an issue where the deck editor would not find non-english card names.\n- Fixed an issue where the \"This week\" timeframe filter would not always use the correct first day of the week.\n- Fixed an issue where global statistics would not be loaded for wild decks.\n\n__Changes__:\n- Deck code export now has an option to include the version number in the name.\n- The global statistics is now hidden while an arena deck is selected.\n- Improved touch screen behavior in several places.\n\n\n## __Release v1.3.5 - 2017-06-03__\n\n__Fixes__:\n- Fixed an issue where the export deck dialog would not respect the selected deck version.\n- Fixed an issue where editing and saving a deck as the current version would not update it in the UI.\n- Fixed an issue where Mirror Entity would be grayed out while the opponent has a full board.\n- Fixed several crashes.\n\n__Changes__:\n- Added an option to hide the new \"my games\" panel: `options (advanced) > tracker > general`\n\n\n## __Release v1.3.2 - 2017-06-02__\n\n__Updated for 8.2.0.19506__\n- Fixed a crash when starting/exiting a match.\n- Now using Hearthstones new deck code system for importing and exporting decks.\n\n\n## __Release v1.3.1 - 2017-06-01__\n- Fixed a crash on startup if the legacy deck style was selected.\n\n\n## __Release v1.3.0 - 2017-06-01__\n\n__New__:\n- Added more stats, recent games, as well as global stats (if available) for the selected deck.\n- Added \"Most Played\" as a deck sorting option.\n\n__Changes__:\n- Greatly improved the deck screenshot dialog.\n  - Deck images can now also be copied to the clipboard.\n- Deck editor has been moved to it's own flyout.\n- Deck version history has been moved to it's own flyout and can now be accessed via the `DECK` menu item or the decks context menu.\n- Importing decks from a list of card names now also gives a language selection option if english is the active language but an alternative language is selected.\n\n__Fixes__:\n- Fixed an issue where enchantment cards would be tracked in some cases.\n\n\n## __Release v1.2.5 - 2017-05-02__\n- Fixed several crashes.\n\n\n## __Release v1.2.4 - 2017-05-01__\n\n__New__:\n- Added a simple way on decks to open the corresponding HSReplay.net deck page.\n- Added Brazilian Portuguese translation.\n\n__Changes__:\n- Exporting decks to Hearthstone will now warn you about missing cards before starting the export process.\n- Wild deck are now indicated with the proper icon (instead of the 'S' on standard decks).\n\n__Fixes__:\n- Fixed an issue where HDT would have trouble picking up the correct Hearthstone path.\n\n\n## __Release v1.2.3 - 2017-04-12__\n\n__Changes__:\n- Hopefully made some improvements to issues with the overlay hiding behind Hearthstone.\n  - If you are still having problems, try running HDT as administrator.\n- Drag & Dropping plugins into the plugins options menu will now install them without requiring a restart.\n\n__Fixes__:\n- Fixed an issue where Direhorn Hatchling would not add a token to the deck.\n- Fixed an issue where Patches would remain in the decklist in some cases.\n- Fixes an issue where transformed cards would not be displayed correctly in the opponents deck list (Shifter Zerus, Molten Blade).\n- Fixed an issue where quests would not count towards the spell counter.\n\n__API__:\n- Quests now properly emit `OnPlay` events.\n\n\n## __Release v1.2.2 - 2017-04-07__\n\n__Fixes__:\n- Fixed an issue where Quests would trigger the secret list.\n- Fixed an issue where some cards were not in the correct sets.\n\n\n## __Release v1.2.1 - 2017-04-04__\n\n__Fixes__:\n- Fixed an issue where the Tracking (Hunter) pick would not be tracked correctly.\n- Fixed an issue where the Desktop/Start shortcut was not updated properly.\n\n\n## __Release v1.2.0 - 2017-04-04__\n\n__Updated for 8.0.0.18336__\n- Fixed deck tracking :).\n- The UI will consider rotating sets wild even before they are. This will not affect your stats.\n\n__New__:\n- Added Ukranian translation.\n\n__Changes__:\n- Secret helper now only displays standard secrets in arena.\n- The local replay system has now been fully removed.\n\n__Fixes__:\n- Fixes an issue where region detection would not work in some cases\n  - This also fixes some issues with gold progress tracking since it relies on regions.\n- Fixed an issue that prevented disabling no-deck mode.\n- Fixed an issue where importing decks from meta tags would not properly decode values.\n\n\n## __Release v1.1.7 - 2017-03-01__\n\n__Updated for 7.1.0.17720__\n\n__New__:\n- HDT will now notify you if important options (automatic importing and deck selection) are disabled.\n- Added Korean and Japanese translations.\n\n__Changes__:\n- Trying to start Battle.net/Hearthstone should now time out later.\n\n__Fixes__:\n- Drag and drop installing should now work for all plugins.\n\n\n## __Release v1.1.6 - 2017-01-12__\n\n__New__:\n- Added an option to remove detected secrets instead of just greying them out.\n  - The option can be found under `options (advanced) > overlay > general`.\n\n__Fixes__:\n- Fixed an issue where cards revealed by Jousts would not be tracked.\n- Fixed an issue where HDT would crash when starting some brawls.\n- Fixed an issue where HDT would force no-deck mode when spectating.\n\n\n## __Release v1.1.5 - 2016-12-22__\n\n__New__:\n- Added Jade Golem counters.\n- Now translated into Traditional Chinese (zh-TW).\n\n__Changes__:\n- Fully disabled HearthStats integration to prevent deck corruption.\n- The arena rewards dialog now accepts and auto completes card names for selected secondary card languages.\n\n__Fixes__:\n- Fixed an issue where auto deck importing and selection would not work for brawl.\n- Fixed an issue where cards created by Manic Soulcaster and White Eyes would not be tracked.\n- Fixed an issue where the \"this week\" stats filter would not work properly.\n- Fixed an issue where the \"max rank\" stats filter would not recognize legend ranks.\n\n\n## __Release v1.1.4 - 2016-12-04__\n\n__Changes__:\n- Cards created by Jade Idol and White Eyes are now properly tracked.\n\n__Fixes__:\n- Fixed an issue where the secrets list would not disappear after all secrets were triggered.\n- Fixed an issue where importing decks from the game would not work in some cases.\n- Fixed an issue where the \"Minimal\" card theme would not display any images.\n- Fixed an issue where creating deck screenshots would crash HDT.\n\n\n## __Release v1.1.2 - 2016-11-30__\n\n__Updated for 7.0.0.15590__\n- Known issue: The \"Hidden Cache\" Hunter secret does not automatically grey out.\n\n__Changes__:\n- You can now paste (ctrl-v) deck urls directly into HDT, rather than having to use the `IMPORT` menu.\n- The installation and update process should be faster now.\n\n__Fixes__:\n- Fixed an issue where games would not be sorted by duration properly.\n\n\n## __Release v1.1.1 - 2016-10-04__\n\n__Updated for 6.1.3.14830__\n\n__Fixes__:\n- Fixed an issue where the deck builder would not work properly with some UI languages.\n- Minor text changes.\n\n\n## __Release v1.1.0 - 2016-09-21__\n\n__New__:\n- Greatly improved replays! More information after the update notes.\n- HDT is now translated into Chinese and Russian.\n  - You can change the language under `options > tracker > appearance`\n  - Other languages are coming soon! If you want to help with translation, there is a link next to the opion.\n- The (Yogg-Saron) counter `Auto` mode now also works for Arcane Giant.\n\n__Fixes__:\n- Fixed an issue where Competitive Spirit would sometimes incorrectly be greyed out.\n- Fixed an issue where Cat Trick was missing from the secrets list.\n- Fixed an issue where card images were missing occasionally in some cases.\n- Fixed an issue where HDT would crash during exporting or when opening/closing the friendslist.\n\n__Changes__:\n- Made several further improvemets to auto deck importing.\n- Made several improvements to auto deck seletion.\n- Made several improvements to the \"Export to Hearthstone\" feature.\n- Doubleclicking decks will now activate them. With the changes to deck auto importing, editing decks within HDT should rarely be necessary.\n\n__API__:\n- Fixed an issue where `OnTurnStart` would not fire for the first turn of the game.\n- Importing from web now supports meta tags (#2769)\n\n\n## __Release v1.0.5 - 2016-08-10__\n\n__Updated for Hearthstone 6.0.0.13921__:\n- Added support for restarted adventure matches.\n\n__Fixes__:\n- Fixed an issue where the mana curve would not correctly display spells.\n- Fixed an issue where automatic constructed importing would in some cases import multiple decks to the same local deck, resulting in a high number of versions on the deck.\n\n__API/Plugins__:\n- Added `API.GameEvents.OnEntityWillTakeDamage.`\n- Added support for loading plugins with embedded dependencies - see #2735.\n\n\n## __Release v1.0.4 - 2016-08-04__\n\n__New__:\n- We have a new, awesome updater! HDT will tell you all about it after you close the update notes.\n- Added support for importing decks from marduktv.com.br\n\n__Changes__:\n- HDT will now try to automatically restore corrupted data files, e.g. from an unexpected shutdown.\n- Plugins are now stored in `%AppData%/HearthstoneDeckTracker/Plugins`. Your existing plugins are moved there automatically.\n- Custom themes are now stored in `%AppData%/HearthstoneDeckTracker/Themes`. Your existing custom themes are moved there automatically.\n- You can now select all/no decks when importing from constructed.\n- Plugins are now less likely to cause HDT to crash.\n\n__Fixes__:\n- Fixed an issue where the cost reduction would still be displayed for cards that were returned to hand.\n- Fixed an issue where the card sorting would no longer match the game's new sorting.\n- Fixed an issue where the Yogg or C'Thun counter would sometimes be incorrectly shown during brawls.\n- Fixed several crashes.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.9326171875,
          "content": "# Setup\n1. Download and install [Visual Studio Community 2017](https://www.visualstudio.com/downloads/). During install, make sure \".NET desktop development\" is checked.\n2. Download and install [Git](https://git-scm.com/download). During install, change \"Use Git from Git Bash only\" to one of the other two options, depending on your preference.\n3. Clone the repository by opening command prompt/powershell in the folder of your choice and typing `git clone https://github.com/HearthSim/Hearthstone-Deck-Tracker`.\n4. Download the recommended latest [nuget executable](https://dist.nuget.org/index.html) and copy it into your PATH, or where you cloned the git repository (where bootstrap.ps1 is).\n5. run bootstrap.ps1, preferably from a powershell window to see any errors.\n6. Open the solution file with VS17 and do a build to make sure everything is working properly.\n\n# Creating Issues\n- Have a look at the [FAQ](https://github.com/HearthSim/Hearthstone-Deck-Tracker/wiki/FAQ).\n- Check if a similar issue already exists (use the search function).\n- In case of a bug/crash/problem: Add as much detail as possible, including crash reports/logs ([see here](https://github.com/HearthSim/Hearthstone-Deck-Tracker/wiki/Reporting-Issues)).\n\n# Contributing\n\n## Contributor License Agreement\n\nHearthSim requires a signed CLA from any contributor before his/her PR can be merged.\n\n### What's a CLA?\n\n> A CLA is a legal document in which you state you are entitled to contribute\nthe code/documentation/translation to the project youre contributing to and are\nwilling to have it used in distributions and derivative works. This means that\nshould there be any kind of legal issue in the future as to the origins and\nownership of any particular piece of code, then that project has the necessary\nforms on file from the contributor(s) saying they were permitted to make this\ncontribution.\n\n> The CLA also ensures that once you have provided a contribution, you cannot try\nto withdraw permission for its use at a later date. People and companies can\ntherefore use that software, confident that they will not be asked to stop using\npieces of the code at a later date.\n\n- [Tony Guntharp (CLAHub)](http://fusion94.org/2013-01-16-clahub-clas-done-right/)\n\n\n### Why?\n\nHearthSim uses a Contributor License Agreement to ensure we can legally use,\nredistribute and relicense external contributions to our various projects.\n\n### How do I sign it?\n\nContact any admin on our [Developer Discord](https://discord.gg/hearthsim-devs) or send us an email at contact@hearthsim.net. Please include your Github username.\n\n## Project approval\n\nFor trivial changes or fixes (i.e. a couple lines of code) on new or existing issues and projects feel free to just open a PR.\n\nWe would like to avoid wasting your time, so for non-trivial changes or fixes please do one of the following before starting to work on it:\n- For work on an existing issue please comment on that issue and wait for approval.\n- If no issue exists, please open a new issue with the proposal and wait for approval.\n- Propose the project in #hdt on the [Developer Discord](https://discord.gg/hearthsim-devs) and wait for approval.\n\n## Coding style\n\n1. Always use tabs.\n2. Use LF line endings.\n3. Always place braces on new lines.\n4. Use [C# 6](https://github.com/dotnet/roslyn/wiki/New-Language-Features-in-C%23-6)/[C# 7](https://blogs.msdn.microsoft.com/dotnet/2016/08/24/whats-new-in-csharp-7-0/) syntax whenever possible. \n5. Follow the [standard MS C# naming conventions](https://msdn.microsoft.com/en-us/library/ms229002(v=vs.110).aspx) \n([short version](http://programmers.stackexchange.com/a/224910)). \nAlso see: [How to name things in programming](http://www.slideshare.net/pirhilton/how-to-name-things-the-hardest-problem-in-programming)\n6. Know when to make exceptions.\n\n## Commits and Pull Requests \n\nKeep the commit log as healthy as the code. It is one of the first places new contributors will look at the project.\n\n1. No more than one change per commit. There should be no changes in a commit which are unrelated to its message.\n2. Follow [these conventions](http://chris.beams.io/posts/git-commit/) when writing the commit message.\n3. Keep the diffs as clean as possible. Avoid unnecessary line changes.\n\nWhen filing a Pull Request, make sure it is rebased on top of most recent master.\nIf you need to modify it or amend it in some way, you should always appropriately \n[fixup](https://help.github.com/articles/about-git-rebase/) the issues in git and force-push your changes to your fork.\n\nAlso see: [Github Help: Using Pull Requests](https://help.github.com/articles/using-pull-requests/)\n\n\n## Translations\n\nWant to help translate the app? Take a look at the [HDT-Localization repository](https://github.com/HearthSim/HDT-Localization).\n\n## Need help?\n\nYou can always ask for help on [Gitter](https://gitter.im/HearthSim/Hearthstone-Deck-Tracker), #hdt in the [Developer Discord](https://discord.gg/hearthsim-devs), or the HearthSim IRC channel, `#Hearthsim` on [Freenode](https://freenode.net/).\n"
        },
        {
          "name": "HDTTests",
          "type": "tree",
          "content": null
        },
        {
          "name": "HDTUninstaller",
          "type": "tree",
          "content": null
        },
        {
          "name": "HDTUpdate",
          "type": "tree",
          "content": null
        },
        {
          "name": "HearthWatcher.Test",
          "type": "tree",
          "content": null
        },
        {
          "name": "HearthWatcher",
          "type": "tree",
          "content": null
        },
        {
          "name": "Hearthstone Deck Tracker.sln",
          "type": "blob",
          "size": 5.6533203125,
          "content": "\r\nMicrosoft Visual Studio Solution File, Format Version 12.00\r\n# Visual Studio Version 16\r\nVisualStudioVersion = 16.0.29920.165\r\nMinimumVisualStudioVersion = 10.0.40219.1\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Hearthstone Deck Tracker\", \"Hearthstone Deck Tracker\\Hearthstone Deck Tracker.csproj\", \"{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}\"\r\n\tProjectSection(ProjectDependencies) = postProject\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359} = {7CF4E289-B871-4E52-B451-EE7BF1250359}\r\n\tEndProjectSection\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"HDTTests\", \"HDTTests\\HDTTests.csproj\", \"{A99438AD-6733-4FDA-928C-30C37255FF1B}\"\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"HDTUpdate\", \"HDTUpdate\\HDTUpdate.csproj\", \"{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}\"\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"HDTUninstaller\", \"HDTUninstaller\\HDTUninstaller.csproj\", \"{245A59F5-6E48-4B5B-B828-24A4C3EED309}\"\r\nEndProject\r\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"Solution Items\", \"Solution Items\", \"{239EBA5D-709C-446C-93FD-40BBF9D5CBBF}\"\r\n\tProjectSection(SolutionItems) = preProject\r\n\t\t.editorconfig = .editorconfig\r\n\t\tbootstrap.bat = bootstrap.bat\r\n\t\tCHANGELOG.md = CHANGELOG.md\r\n\t\tlib\\De.TorstenMandelkow.MetroChart.dll = lib\\De.TorstenMandelkow.MetroChart.dll\r\n\t\tgenerate_resources.bat = generate_resources.bat\r\n\t\tlib\\HearthDb.dll = lib\\HearthDb.dll\r\n\tEndProjectSection\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"HearthWatcher\", \"HearthWatcher\\HearthWatcher.csproj\", \"{02E1843D-3F5D-45E0-9B16-1F28209EED82}\"\r\n\tProjectSection(ProjectDependencies) = postProject\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359} = {7CF4E289-B871-4E52-B451-EE7BF1250359}\r\n\tEndProjectSection\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"HearthWatcher.Test\", \"HearthWatcher.Test\\HearthWatcher.Test.csproj\", \"{D081BCA4-14FD-4FBC-B92A-82574AB0478B}\"\r\nEndProject\r\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Bootstrap\", \"Bootstrap\\Bootstrap.csproj\", \"{7CF4E289-B871-4E52-B451-EE7BF1250359}\"\r\nEndProject\r\nGlobal\r\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\r\n\t\tDebug|x86 = Debug|x86\r\n\t\tRelease|x86 = Release|x86\r\n\t\tSquirrel|x86 = Squirrel|x86\r\n\tEndGlobalSection\r\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Release|x86.Build.0 = Release|x86\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Squirrel|x86.ActiveCfg = Squirrel|x86\r\n\t\t{E63A3F1C-E662-4E62-BE43-AF27CB9E953D}.Squirrel|x86.Build.0 = Squirrel|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Release|x86.Build.0 = Release|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Squirrel|x86.ActiveCfg = Squirrel|x86\r\n\t\t{A99438AD-6733-4FDA-928C-30C37255FF1B}.Squirrel|x86.Build.0 = Squirrel|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Release|x86.Build.0 = Release|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Squirrel|x86.ActiveCfg = Squirrel|x86\r\n\t\t{4DA33EE8-3F32-4D91-82FA-3BC7F014263D}.Squirrel|x86.Build.0 = Squirrel|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Release|x86.Build.0 = Release|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Squirrel|x86.ActiveCfg = Squirrel|x86\r\n\t\t{245A59F5-6E48-4B5B-B828-24A4C3EED309}.Squirrel|x86.Build.0 = Squirrel|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Release|x86.Build.0 = Release|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Squirrel|x86.ActiveCfg = Release|x86\r\n\t\t{02E1843D-3F5D-45E0-9B16-1F28209EED82}.Squirrel|x86.Build.0 = Release|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Release|x86.Build.0 = Release|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Squirrel|x86.ActiveCfg = Release|x86\r\n\t\t{D081BCA4-14FD-4FBC-B92A-82574AB0478B}.Squirrel|x86.Build.0 = Release|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Debug|x86.ActiveCfg = Debug|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Debug|x86.Build.0 = Debug|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Release|x86.ActiveCfg = Release|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Release|x86.Build.0 = Release|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Squirrel|x86.ActiveCfg = Debug|x86\r\n\t\t{7CF4E289-B871-4E52-B451-EE7BF1250359}.Squirrel|x86.Build.0 = Debug|x86\r\n\tEndGlobalSection\r\n\tGlobalSection(SolutionProperties) = preSolution\r\n\t\tHideSolutionNode = FALSE\r\n\tEndGlobalSection\r\n\tGlobalSection(ExtensibilityGlobals) = postSolution\r\n\t\tSolutionGuid = {ECF19AE1-60AA-4AF8-A232-DDA7927AC94D}\r\n\tEndGlobalSection\r\nEndGlobal\r\n"
        },
        {
          "name": "Hearthstone Deck Tracker.sln.DotSettings",
          "type": "blob",
          "size": 3.4638671875,
          "content": "<wpf:ResourceDictionary xml:space=\"preserve\" xmlns:x=\"http://schemas.microsoft.com/winfx/2006/xaml\" xmlns:s=\"clr-namespace:System;assembly=mscorlib\" xmlns:ss=\"urn:shemas-jetbrains-com:settings-storage-xaml\" xmlns:wpf=\"http://schemas.microsoft.com/winfx/2006/xaml/presentation\">\n\t<s:Boolean x:Key=\"/Default/CodeInspection/CodeAnnotations/NamespacesWithAnnotations/=Hearthstone_005FDeck_005FTracker_002EAnnotations/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/ALIGN_MULTILINE_BINARY_EXPRESSIONS_CHAIN/@EntryValue\">True</s:Boolean>\n\t<s:Int64 x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/CONTINUOUS_INDENT_MULTIPLIER/@EntryValue\">1</s:Int64>\n\t<s:String x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/PLACE_ACCESSORHOLDER_ATTRIBUTE_ON_SAME_LINE_EX/@EntryValue\">NEVER</s:String>\n\t<s:Boolean x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/SPACE_WITHIN_SINGLE_LINE_ARRAY_INITIALIZER_BRACES/@EntryValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/WRAP_BEFORE_BINARY_OPSIGN/@EntryValue\">True</s:Boolean>\n\t<s:String x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/WRAP_CHAINED_METHOD_CALLS/@EntryValue\">WRAP_IF_LONG</s:String>\n\t<s:String x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/WRAP_FOR_STMT_HEADER_STYLE/@EntryValue\">WRAP_IF_LONG</s:String>\n\t<s:String x:Key=\"/Default/CodeStyle/CodeFormatting/CSharpFormat/WRAP_TERNARY_EXPR_STYLE/@EntryValue\">WRAP_IF_LONG</s:String>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ECSharpAttributeForSingleLineMethodUpgrade/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ECSharpKeepExistingMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ECSharpPlaceEmbeddedOnSameLineMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ECSharpRenamePlacementToArrangementMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ECSharpUseContinuousIndentInsideBracesMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ESettingsUpgrade_002EAddAccessorOwnerDeclarationBracesMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ESettingsUpgrade_002ECSharpPlaceAttributeOnSameLineMigration/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ESettingsUpgrade_002EMigrateBlankLinesAroundFieldToBlankLinesAroundProperty/@EntryIndexedValue\">True</s:Boolean>\n\t<s:Boolean x:Key=\"/Default/Environment/SettingsMigration/IsMigratorApplied/=JetBrains_002EReSharper_002EPsi_002ECSharp_002ECodeStyle_002ESettingsUpgrade_002EMigrateThisQualifierSettings/@EntryIndexedValue\">True</s:Boolean></wpf:ResourceDictionary>"
        },
        {
          "name": "Hearthstone Deck Tracker",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.7568359375,
          "content": "# Hearthstone-Deck-Tracker\n[![Build status](https://ci.appveyor.com/api/projects/status/3wow545sjaq9ybji/branch/master?svg=true)](https://ci.appveyor.com/project/azeier/hearthstone-deck-tracker/branch/master)\n\nHearthstone Deck Tracker is an automatic deck tracker and deck manager for Hearthstone.\n\n## Installation\n- Requirements:\n  - Windows Vista or higher\n  - .NET Framework 4.5 or higher\n- [Download and run the installer](https://hsdecktracker.net/download/).\n\n## Community & Troubleshooting\n- [Follow HDT on Twitter](https://twitter.com/hsdecktracker)\n- Join the Community Discord: [![Join HearthSim Community Discord](https://discordapp.com/api/guilds/265636998700728321/widget.png)](https://discord.gg/hearthsim)\n- You can find the [FAQ here](https://github.com/HearthSim/Hearthstone-Deck-Tracker/wiki/FAQ).\n- Streamers: Please read [Streaming instructions for OBS and XSplit](https://github.com/HearthSim/Hearthstone-Deck-Tracker/wiki/Streaming-Instructions) and [Twitch extension setup](https://hsdecktracker.net/twitch/setup/).\n- HSReplay.net integration: Please email <support@hsdecktracker.net> for support.\n\n## Contributing\n- Please read the [coding style and Commit/Pull Request guidelines](https://github.com/HearthSim/Hearthstone-Deck-Tracker/blob/master/CONTRIBUTING.md).\n- Developer Discord: [![joindeveloper#hdt](https://discordapp.com/api/guilds/195326447118712832/widget.png)](https://discord.gg/hearthsim-devs)\n- Hearthstone Deck Tracker is a [HearthSim](https://hearthsim.info) project.\n\n## Features\nAn in-game overlay:\n\n![Overlay](https://github.com/HearthSim/Hearthstone-Deck-Tracker/raw/master/raw-assets/readme/overlay.png \"Overlay\")\n\nThe app: \n\n![Tracker](https://github.com/HearthSim/Hearthstone-Deck-Tracker/raw/master/raw-assets/readme/hdt-ui.png \"HDT UI\")\n\n- **Tracks**:\n  - Cards left in your deck or cards drawn from your deck.\n  - Your handcount, deckcount and draw chances.\n  - Cards played by your opponent.\n  - Your opponent's handcount, deckcount and probablities of him having/drawing cards.\n  - How long your opponent had each card in his hand and what cards have been mulliganed, stolen or returned.  \n- **Timer** for the current turn and total time spent for you and your opponent.  \n- The tracker tries to **automatically select the deck you are playing**.  \n- The cards and timer can either be displayed in an overlay (see screenshot) or in **extra windows** (Options > General > Additional Windows)  \n- **Deck Manager**:\n  - **Import** decks from websites: arenavalue, hearthstats, hearthpwn, hearthhead, hearthstoneplayers, tempostorm, hearthstonetopdeck and hearthnews  \n  - Circumvent the 27 deck limit: Saved decks can be **exported to Hearthstone**. (My Decks > More...)\n  - Decks can be filtered by custom **tags** and sorted by name, date and tags.  \n  - Set **notes** for each deck (My Decks > More...)  \n  - Create **screenshots** of decks (My Decks > More...)  \n  - **Share** your decks by exporting them as xml files or id-strings (My Decks > More...). Both can be imported via New Deck > Import.  \n- **Notifications**: get notified when a game or a turn starts (either by the tray icon flashing or hearthstone popping up)  \n- **Customization**: Almost every feature can be turned on/off separately.\n- **Extensible via plugins**: [available plugins](https://github.com/HearthSim/Hearthstone-Deck-Tracker/wiki/Available-Plugins)\n- **Stats per deck**:\n  - Track the result of each game (win/loss), opponents, game mode and more\n  - Win/loss rate vs each class.\n  - Details for each game (cards drawn, played, etc.).\n  - Select which game modes to track (Options > Other).  \n  - Import your opponent's (partial) deck from a tracked game as a new deck.\n\n![Stats](https://i.imgur.com/Wke3Cuw.png \"Deck stats\")\n\n\n## License\n\nCopyright  [HearthSim](https://hearthsim.net). All Rights Reserved.\n"
        },
        {
          "name": "bootstrap.ps1",
          "type": "blob",
          "size": 0.986328125,
          "content": "[Net.ServicePointManager]::SecurityProtocol = [Net.SecurityProtocolType]::Tls12\n\nif (Test-Path \"nuget.exe\") {\n\tInvoke-Expression \"./nuget restore\"\n}\nelseif((Get-Command \"nuget\" -ErrorAction SilentlyContinue) -ne $null) {\n\tnuget restore\n}\nelse {\n\t\"Nuget was not found and is required to run bootstrap.ps. Download and retry now?\"\n\tchoice /c yn\n\tif ($LASTEXITCODE -eq 1) {\n\t\t\"Downloading nuget...\"\n\t\t$nugetLocation = \"https://dist.nuget.org/win-x86-commandline/latest/nuget.exe\"\n\t\t(New-Object Net.WebClient).DownloadFile($nugetLocation, \"$PSScriptRoot\\nuget.exe\")\n\t\tInvoke-Expression \"./nuget restore\"\n\t}\n}\n\ntry {\n\tgit --version\n}\ncatch {\n\t\"Git was not found and is required to run bootstrap.bat. Download git from https://git-scm.com/download and during installation choose `\"Use Git from the Windows Command Prompt`\".\"\n}\n\nInvoke-Expression \"msbuild Bootstrap/Bootstrap.csproj /p:Configuration=Debug\"\nInvoke-Expression \"msbuild 'Hearthstone Deck Tracker/Hearthstone Deck Tracker.csproj' /p:Configuration=Debug\"\n"
        },
        {
          "name": "build-scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "generate_whizbang_decks.bat",
          "type": "blob",
          "size": 0.1767578125,
          "content": "@echo off\n\nmsbuild ResourceGenerator\\ResourceGenerator.csproj /p:Configuration=Debug /p:Platform=\"x86\"\n.\\ResourceGenerator\\bin\\x86\\Debug\\ResourceGenerator.exe whizbang whizbang.json"
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "licenses",
          "type": "tree",
          "content": null
        },
        {
          "name": "nuget.config",
          "type": "blob",
          "size": 0.275390625,
          "content": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<configuration>\n  <config>\n    <add key=\"repositoryPath\" value=\"./packages\" />\n    <add key=\"globalPackagesFolder\" value=\"./packages\" />\n  </config>\n  <settings>\n    <repositoryPath>./packages</repositoryPath>\n  </settings>\n</configuration>"
        },
        {
          "name": "packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "raw-assets",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}