{
  "metadata": {
    "timestamp": 1736710769027,
    "page": 227,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "domaindrivendev/Swashbuckle.WebApi",
      "stars": 3072,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1826171875,
          "content": "[Oo]bj/\n[Bb]in/\nApp_Data\n[Pp]ackages\nLogs\nPrecompiledWeb/\n\n_ReSharper.*\n*crunch*\n\n*.user\n*.suo\n*.cache\n*.dotCover\n*.dotsettings\n!*.proj\n\n# Visual Studio 2015 cache/options directory\n.vs/\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.0947265625,
          "content": "[submodule \"swagger-ui\"]\n\tpath = swagger-ui\n\turl = https://github.com/swagger-api/swagger-ui.git\n"
        },
        {
          "name": ".nuget",
          "type": "tree",
          "content": null
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.3408203125,
          "content": "Contributing to Swashbuckle\n=========\n\nContributions to Swashbuckle are welcomed in the form of construcutive, reproducible bug reports, feature requests that align to the project's goals, or better still a PR that's accompanied with passing tests.\n\nIf you have general questions or feedback around the use of Swashbuckle, PLEASE DON'T CREATE AN ISSUE AND POST TO STACKOVERFLOW INSTEAD.\n\n## Bug Reports ##\n\nIf you're reporting a bug, please include a clear description of the issue, the version of Swashbuckle you're using, and a simple set of repro steps.\n\nPlease remember that Swashbuckle is a free and open-source project provided to the community with zero financial gain to the author(s). Any issues deemed to have a negative or arrogant tone will be closed without response.\n\n## Feature Requests ##\n\nFundamentally, Swashbuckle is a library that attempts to generate an accurate description for APIs built on WebAPI, using [Swagger 2.0](https://swagger.io/docs/specification/2-0/basic-structure/), according to the routes, controllers and models that have been implemented. So, the resulting API documentation is driven by \"actual\" behavior as opposed to \"intended\" behavior. This is an important distinction to consider when submitting feature requests. For example, a feature that leverages built-in attributes that affect runtime behavior (e.g. AuthorizeAttribute, RequiredAttribute etc.) would be more aligned to the project goals than one that introduces custom attributes that drive documentation and nothing else.\n\nIt's also worth noting that Swashbuckle leverages the [swagger-ui project](https://github.com/swagger-api/swagger-ui) but doesn't actually implement any UI code. If you have a bug report or feature request that's UI-specific, PLEASE DON'T CREATE AN ISSUE HERE AND POST TO THE SWAGGER-UI REPO INSTEAD.\n\n## Pull Requests ##\n\nIf you've identified a feature/bug fix that aligns to the project goals, or even just an addition to the docs, please submit a Pull Request (PR). If applicable, include tests and ensure all tests are passing locally before you commit.\n\nOnce you clone the repo, development should be straightforward bar one gotcha: the swagger-ui assets are pulled down as a git submodule and incorporated into the library as \"embedded resources\" during build-time. So, before building, you'll need to inititiate the submodule:\n\n```\ngit submodule update --init\n```"
        },
        {
          "name": "ISSUE_TEMPLATE.md",
          "type": "blob",
          "size": 0.9951171875,
          "content": "\\*\\* As per the [contributing guidelines](CONTRIBUTING.md), please restrict the creation of issues to reproducible bug reports and feature requests that align to the project's goals. If you have general questions or feedback around the use of Swashbuckle, PLEASE DON'T CREATE AN ISSUE AND POST TO STACKOVERFLOW INSTEAD.\n\nAlso note that Swashbuckle leverages the [swagger-ui project](https://github.com/swagger-api/swagger-ui) but doesn't actually implement any UI code. If you've discovered a UI-specific issue, PLEASE DON'T CREATE AN ISSUE HERE AND POST TO THE SWAGGER-UI REPO INSTEAD \\*\\*\n\n## VERSION: ##\n_Provide the version of Swashbuckle you're using_\n\n## STEPS TO REPRODUCE: ##\n_Provide a clear set of steps to reproduce the problem, ideally starting with an empty WebAPI project_\n\n## EXPECTED RESULT: ##\n_Provide a description and example of the expected result_\n\n## ACTUAL RESULT: ##\n_Provide a description of the actual behavior you're observing_\n\n## ADDITIONAL DETAILS ##\n_Provide any additional details here_"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.44921875,
          "content": "Copyright (c) 2013, Richard Morris\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 35.5615234375,
          "content": "| :mega: Calling for Maintainers |\n|--------------|\n| With the introduction of [ASP.NET Core](https://www.asp.net/core), I've now shifted my focus to the Core-specific project - [Swashbuckle.AspNetCore](https://github.com/domaindrivendev/Swashbuckle.AspNetCore). That will be receiving most of my (already limited) personal time, and so I won't have the capacity to maintain this one at a sufficient rate. Still, I'd love to see it live on and am seeking one or two \"core\" contributors / maintainers to help out. Ideally, these would be people who have already contributed through PRs and understand the inner workings and overall design. Once signed-up, we can agree on an approach that works - ultimately, I want to remove myself as the bottleneck to merging PRs and getting fresh Nugets published. If you're interested, please let me know by adding a comment [here](https://github.com/domaindrivendev/Swashbuckle/issues/1053) |\n\nSwashbuckle\n=========\n\n[![Build status](https://ci.appveyor.com/api/projects/status/qoesh4nm6tb6diuk?svg=true)](https://ci.appveyor.com/project/domaindrivendev/swashbuckle)\n\nSeamlessly adds a [Swagger](http://swagger.io/) to WebApi projects! Combines ApiExplorer and Swagger/swagger-ui to provide a rich discovery, documentation and playground experience to your API consumers.\n\nIn addition to its Swagger generator, Swashbuckle also contains an embedded version of [swagger-ui](https://github.com/swagger-api/swagger-ui) which it will automatically serve up once Swashbuckle is installed. This means you can complement your API with a slick discovery UI to assist consumers with their integration efforts. Best of all, it requires minimal coding and maintenance, allowing you to focus on building an awesome API!\n\nAnd that's not all ...\n\nOnce you have a Web API that can describe itself in Swagger, you've opened the treasure chest of Swagger-based tools including a client generator that can be targeted to a wide range of popular platforms. See [swagger-codegen](https://github.com/swagger-api/swagger-codegen) for more details.\n\n**Swashbuckle Core Features:**\n\n* Auto-generated [Swagger 2.0](https://github.com/swagger-api/swagger-spec/blob/master/versions/2.0.md)\n* Seamless integration of swagger-ui\n* Reflection-based Schema generation for describing API types\n* Extensibility hooks for customizing the generated Swagger doc\n* Extensibility hooks for customizing the swagger-ui\n* Out-of-the-box support for leveraging Xml comments\n* Support for describing ApiKey, Basic Auth and OAuth2 schemes ... including UI support for the Implicit OAuth2 flow\n\n**Swashbuckle 5.0**\n\nSwashbuckle 5.0 makes the transition to Swagger 2.0. The 2.0 schema is significantly different to its predecessor (1.2) and, as a result, the Swashbuckle config interface has undergone yet another overhaul. Checkout the [transition guide](#transitioning-to-swashbuckle-50) if you're upgrading from a prior version.\n\n## Getting Started ##\n\nThere are currently two Nuget packages - the Core library (Swashbuckle.Core) and a convenience package (Swashbuckle)  - that provides automatic bootstrapping. The latter is only applicable to regular IIS hosted Web APIs. For all other hosting environments, you should only install the Core library and then follow the instructions below to manually enable the Swagger routes.\n\nOnce installed and enabled, you should be able to browse the following Swagger docs and UI endpoints respectively:\n\n***\\<your-root-url\\>/swagger/docs/v1***\n\n***\\<your-root-url\\>/swagger***\n\n### IIS Hosted ###\n\nIf your service is hosted in IIS, you can start exposing Swagger docs and a corresponding swagger-ui by simply installing the following Nuget package:\n\n    Install-Package Swashbuckle\n\nThis will add a reference to Swashbuckle.Core and also install a bootstrapper (App_Start/SwaggerConfig.cs) that enables the Swagger routes on app start-up using [WebActivatorEx](https://github.com/davidebbo/WebActivator).\n\n### Self-hosted ###\n\nIf your service is self-hosted, just install the Core library:\n\n    Install-Package Swashbuckle.Core\n\nThen manually enable the Swagger docs and, optionally, the swagger-ui by invoking the following extension methods (in namespace Swashbuckle.Application) on an instance of HttpConfiguration (e.g. in Program.cs)\n\n```csharp\nhttpConfiguration\n     .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n     .EnableSwaggerUi();\n```\n\n### OWIN  ###\n\nIf your service is hosted using OWIN middleware, just install the Core library:\n\n    Install-Package Swashbuckle.Core\n\nThen manually enable the Swagger docs and swagger-ui by invoking the extension methods (in namespace Swashbuckle.Application) on an instance of HttpConfiguration (e.g. in Startup.cs)\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n    .EnableSwaggerUi();    \n```\n\n## Troubleshooting ##\n\nTroubleshooting??? I thought this was all supposed to be \"seamless\"? OK you've called me out! Things shouldn't go wrong, but if they do, take a look at the [FAQs](#troubleshooting-and-faqs) for inspiration.\n\n## Customizing the Generated Swagger Docs ##\n\nThe following snippet demonstrates the minimum configuration required to get the Swagger docs and swagger-ui up and running:\n```csharp\nhttpConfiguration\n      .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n      .EnableSwaggerUi();\n```\n\nThese methods expose a range of configuration and extensibility options that you can pick and choose from, combining the convenience of sensible defaults with the flexibility to customize where you see fit. Read on to learn more.\n\n### Custom Routes ###\n\nThe default route templates for the Swagger docs and swagger-ui are \"swagger/docs/{apiVersion}\" and \"swagger/ui/{\\*assetPath}\" respectively. You're free to change these so long as the provided templates include the relevant route parameters - {apiVersion} and {\\*assetPath}.\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(\"docs/{apiVersion}/swagger\", c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n    .EnableSwaggerUi(\"sandbox/{*assetPath}\");\n```\n\nIn this case the URL to swagger-ui will be `sandbox/index`.\n\n### Pretty Print ###\n\nIf you want the output Swagger docs to be indented properly, enable the __PrettyPrint__ option as following:\n\n```cs\nhttpConfiguration\n    .EnableSwagger(c => c.PrettyPrint())\n    .EnableSwaggerUi();\n```\n\n### Additional Service Metadata ###\n\nIn addition to operation descriptions, Swagger 2.0 includes several properties to describe the service itself. These can all be provided through the configuration API:\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c =>\n        {\n            c.RootUrl(req => GetRootUrlFromAppConfig());\n\n            c.Schemes(new[] { \"http\", \"https\" });\n\n            c.SingleApiVersion(\"v1\", \"Swashbuckle.Dummy\")\n                .Description(\"A sample API for testing and prototyping Swashbuckle features\")\n                .TermsOfService(\"Some terms\")\n                .Contact(cc => cc\n                    .Name(\"Some contact\")\n                    .Url(\"http://tempuri.org/contact\")\n                    .Email(\"some.contact@tempuri.org\"))\n                .License(lc => lc\n                    .Name(\"Some License\")\n                    .Url(\"http://tempuri.org/license\"));\n        });\n```\n#### RootUrl ####\n\nBy default, the service root url is inferred from the request used to access the docs. However, there may be situations (e.g. proxy and load-balanced environments) where this does not resolve correctly. You can workaround this by providing your own code to determine the root URL.\n\n#### Schemes ####\n\nIf schemes are not explicitly provided in a Swagger 2.0 document, then the scheme used to access the docs is taken as the default. If your API supports multiple schemes and you want to be explicit about them, you can use the __Schemes__ option.\n\n#### SingleApiVersion ####\n\nUse this to describe a single version API. Swagger 2.0 includes an \"Info\" object to hold additional metadata for an API. Version and title are required but you may also provide additional fields as shown above.\n\n__NOTE__: If your Web API is hosted in IIS, you should avoid using full-stops in the version name (e.g. \"1.0\"). The full-stop at the tail of the URL will cause IIS to treat it as a static file (i.e. with an extension) and bypass the URL Routing Module and therefore, Web API. \n\n### Describing Multiple API Versions ###\n\nIf your API has multiple versions, use __MultipleApiVersions__ instead of __SingleApiVersion__. In this case, you provide a lambda that tells Swashbuckle which actions should be included in the docs for a given API version. Like __SingleApiVersion__, __Version__ also returns an \"Info\" builder so you can provide additional metadata per API version.\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c =>\n        {\n            c.MultipleApiVersions(\n                (apiDesc, targetApiVersion) => ResolveVersionSupportByRouteConstraint(apiDesc, targetApiVersion),\n                (vc) =>\n                {\n                    vc.Version(\"v2\", \"Swashbuckle Dummy API V2\");\n                    vc.Version(\"v1\", \"Swashbuckle Dummy API V1\");\n                });\n        });\n    .EnableSwaggerUi(c =>\n        {\n            c.EnableDiscoveryUrlSelector();\n        });\n```\n\n\\* You can also enable a select box in the swagger-ui (as shown above) that displays a discovery URL for each version. This provides a convenient way for users to browse documentation for different API versions.\n\n### Describing Security/Authorization Schemes ###\n\nYou can use BasicAuth, __ApiKey__ or __OAuth2__ options to describe security schemes for the API. See https://github.com/swagger-api/swagger-spec/blob/master/versions/2.0.md for more details.\n\n```csharp\nhttpConfiguration\n     .EnableSwagger(c =>\n         {\n             //c.BasicAuth(\"basic\")\n             //    .Description(\"Basic HTTP Authentication\");\n\n             //c.ApiKey(\"apiKey\")\n             //    .Description(\"API Key Authentication\")\n             //    .Name(\"apiKey\")\n             //    .In(\"header\");\n\n             c.OAuth2(\"oauth2\")\n                 .Description(\"OAuth2 Implicit Grant\")\n                 .Flow(\"implicit\")\n                 .AuthorizationUrl(\"http://petstore.swagger.wordnik.com/api/oauth/dialog\")\n                 //.TokenUrl(\"https://tempuri.org/token\")\n                 .Scopes(scopes =>\n                 {\n                     scopes.Add(\"read\", \"Read access to protected resources\");\n                     scopes.Add(\"write\", \"Write access to protected resources\");\n                 });\n\n             c.OperationFilter<AssignOAuth2SecurityRequirements>();\n         });\n     .EnableSwaggerUi(c =>\n         {\n             c.EnableOAuth2Support(\"test-client-id\", \"test-realm\", \"Swagger UI\");\n         });\n```\n__NOTE:__ These only define the schemes and need to be coupled with a corresponding \"security\" property at the document or operation level to indicate which schemes are required for each operation.  To do this, you'll need to implement a custom IDocumentFilter and/or IOperationFilter to set these properties according to your specific authorization implementation\n\n\\* If your API supports the OAuth2 Implicit flow, and you've described it correctly, according to the Swagger 2.0 specification, you can enable UI support as shown above.\n\n### Customize the Operation Listing ###\n\nIf necessary, you can ignore obsolete actions and provide custom grouping/sorting strategies for the list of Operations in a Swagger document:\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c =>\n        {\n            c.IgnoreObsoleteActions();\n\n            c.GroupActionsBy(apiDesc => apiDesc.HttpMethod.ToString());\n\n            c.OrderActionGroupsBy(new DescendingAlphabeticComparer());\n        });\n```\n#### IgnoreObsoleteActions ####\n\nSet this flag to omit operation descriptions for any actions decorated with the Obsolete attribute\n\n__NOTE__: If you want to omit specific operations but without using the Obsolete attribute, you can create an IDocumentFilter or make use of the built in ApiExplorerSettingsAttribute\n\n#### GroupActionsBy ####\n\nEach operation can be assigned one or more tags which are then used by consumers for various reasons. For example, the swagger-ui groups operations according to the first tag of each operation. By default, this will be the controller name but you can use this method to override with any value.\n\n#### OrderActionGroupsBy ####\n\nYou can also specify a custom sort order for groups (as defined by __GroupActionsBy__) to dictate the order in which operations are listed. For example, if the default grouping is in place (controller name) and you specify a descending alphabetic sort order, then actions from a ProductsController will be listed before those from a CustomersController. This is typically used to customize the order of groupings in the swagger-ui.\n\n### Modifying Generated Schemas ###\n\nSwashbuckle makes a best attempt at generating Swagger compliant JSON schemas for the various types exposed in your API. However, there may be occasions when more control of the output is needed.  This is supported through the following options:\n\n```csharp\nhttpConfiguration\n      .EnableSwagger(c =>\n          {\n              c.MapType<ProductType>(() => new Schema { type = \"integer\", format = \"int32\" });\n\n              c.SchemaFilter<ApplySchemaVendorExtensions>();\n\n              //c.UseFullTypeNameInSchemaIds();\n\n              c.SchemaId(t => t.FullName.Contains('`') ? t.FullName.Substring(0, t.FullName.IndexOf('`')) : t.FullName);\n              \n              c.IgnoreObsoleteProperties();\n\n              c.DescribeAllEnumsAsStrings();\n          });\n```\n\n#### MapType ####\n\nUse this option to override the Schema generation for a specific type.\n\nIt should be noted that the resulting Schema will be placed \"inline\" for any applicable Operations. While Swagger 2.0 supports inline definitions for \"all\" Schema types, the swagger-ui tool does not. It expects \"complex\" Schemas to be defined separately and referenced. For this reason, you should only use the __MapType__ option when the resulting Schema is a primitive or array type.\n\nIf you need to alter a complex Schema, use a Schema filter.\n\n#### SchemaFilter ####\n\nIf you want to post-modify \"complex\" Schemas once they've been generated, across the board or for a specific type, you can wire up one or more Schema filters.\n\nISchemaFilter has the following interface:\n\n```csharp\nvoid Apply(Schema schema, SchemaRegistry schemaRegistry, Type type);\n```\n\nA typical implementation will inspect the system Type and modify the Schema accordingly. If necessary, the schemaRegistry can be used to obtain or register Schemas for other Types\n\n#### UseFullTypeNamesInSchemaIds ####\n\nIn a Swagger 2.0 document, complex types are typically declared globally and referenced by unique Schema Id. By default, Swashbuckle does NOT use the full type name in Schema Ids. In most cases, this works well because it prevents the \"implementation detail\" of type namespaces from leaking into your Swagger docs and UI. However, if you have multiple types in your API with the same class name, you'll need to opt out of this behavior to avoid Schema Id conflicts.  \n\n#### SchemaId ####\n\nUse this option to provide your own custom strategy for inferring SchemaId's for describing \"complex\" types in your API.\n\n#### IgnoreObsoleteProperties ####\n\nSet this flag to omit schema property descriptions for any type properties decorated with the Obsolete attribute \n\n#### DescribeAllEnumsAsStrings ####\n\nIn accordance with the built in JsonSerializer, Swashbuckle will, by default, describe enums as integers. You can change the serializer behavior by configuring the StringEnumConverter globally or for a given enum type. Swashbuckle will honor this change out-of-the-box. However, if you use a different approach to serialize enums as strings, you can also force Swashbuckle to describe them as strings.\n\n### Modifying Generated Operations ###\n\nSimilar to Schema filters, Swashbuckle also supports Operation and Document filters:\n\n```csharp\nhttpConfiguration\n     .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n         {\n             c.OperationFilter<AddDefaultResponse>();\n\n             c.DocumentFilter<ApplyDocumentVendorExtensions>();\n         });\n```\n#### OperationFilter ####\n\nPost-modify Operation descriptions once they've been generated by wiring up one or more Operation filters.\n\nIOperationFilter has the following interface:\n\n```csharp\nvoid Apply(Operation operation, SchemaRegistry schemaRegistry, ApiDescription apiDescription);\n```\n\nA typical implementation will inspect the ApiDescription and modify the Operation accordingly. If necessary, the schemaRegistry can be used to obtain or register Schemas for Types that are used in the Operation.\n\n#### DocumentFilter ####\n\nPost-modify the entire Swagger document by wiring up one or more Document filters.\n\nIDocumentFilter has the following interface:\n\n```csharp\nvoid Apply(SwaggerDocument swaggerDoc, SchemaRegistry schemaRegistry, IApiExplorer apiExplorer);\n```\n\nThis gives full control to modify the final SwaggerDocument. You can gain additional context from the provided SwaggerDocument (e.g. version) and IApiExplorer. You should have a good understanding of the [Swagger 2.0 spec.](https://github.com/swagger-api/swagger-spec/blob/master/versions/2.0.md) before using this option.\n\n### Wrapping the SwaggerGenerator with Additional Behavior ###\n\nThe default implementation of ISwaggerProvider, the interface used to obtain Swagger metadata for a given API, is the SwaggerGenerator. If neccessary, you can inject your own implementation or wrap the existing one with additional behavior. For example, you could use this option to inject a \"Caching Proxy\" that attempts to retrieve the SwaggerDocument from a cache before delegating to the built-in generator:\n\n```csharp\nhttpConfiguration\n      .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n          {\n        c.CustomProvider((defaultProvider) => new CachingSwaggerProvider(defaultProvider));\n          });\n```\n\n### Including XML Comments ###\n\nIf you annotate Controllers and API Types with [Xml Comments](http://msdn.microsoft.com/en-us/library/b2s063f7(v=vs.110).aspx), you can incorporate those comments into the generated docs and UI. The Xml tags are mapped to Swagger properties as follows:\n\n* **Action summary** -> Operation.summary\n* **Action remarks** -> Operation.description\n* **Parameter summary** -> Parameter.description\n* **Type summary** -> Schema.descripton\n* **Property summary** -> Schema.description (i.e. on a property Schema)\n\nYou can enable this by providing the path to one or more XML comments files:\n```csharp\nhttpConfiguration\n    .EnableSwagger(c =>\n        {\n            c.SingleApiVersion(\"v1\", \"A title for your API\");\n            c.IncludeXmlComments(GetXmlCommentsPathForControllers());\n            c.IncludeXmlComments(GetXmlCommentsPathForModels());\n        });\n```\n\nNOTE: You will need to enable output of the XML documentation file. This is enabled by going to project properties -> Build -> Output. The \"XML documentation file\" needs to be checked and a path assigned, such as \"bin\\Debug\\MyProj.XML\". You will also want to verify this across each build configuration. Here's an example of reading the file, but it may need to be modified according to your specific project settings:\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c =>\n        {\n            var baseDirectory = AppDomain.CurrentDomain.BaseDirectory;\n            var commentsFileName = Assembly.GetExecutingAssembly().GetName().Name + \".XML\";\n            var commentsFile = Path.Combine(baseDirectory, commentsFileName);\n\n            c.SingleApiVersion(\"v1\", \"A title for your API\");\n            c.IncludeXmlComments(commentsFile);\n            c.IncludeXmlComments(GetXmlCommentsPathForModels());\n        });\n```\n#### Response Codes ####\n\nSwashbuckle will automatically create a \"success\" response for each operation based on the action's return type. If it's a void, the status code will be 204 (No content), otherwise 200 (Ok). This mirrors WebApi's default behavior. If you need to change this and/or list additional response codes, you can use the non-standard \"response\" tag:\n\n```csharp\n/// <response code=\"201\">Account created</response>\n/// <response code=\"400\">Username already in use</response>\npublic int Create(Account account)\n```\n### Working Around Swagger 2.0 Constraints ###\n\nIn contrast to Web API, Swagger 2.0 does not include the query string component when mapping a URL to an action. As a result, Swashbuckle will raise an exception if it encounters multiple actions with the same path (sans query string) and HTTP method. You can workaround this by providing a custom strategy to pick a winner or merge the descriptions for the purposes of the Swagger docs \n\n```csharp\nhttpConfiguration\n    .EnableSwagger((c) =>\n        {\n            c.SingleApiVersion(\"v1\", \"A title for your API\"));\n            c.ResolveConflictingActions(apiDescriptions => apiDescriptions.First());\n        });\n```\nSee the following discussion for more details:\n\n<https://github.com/domaindrivendev/Swashbuckle/issues/142>\n\n## Customizing the swagger-ui ##\n\nThe swagger-ui is a JavaScript application hosted in a single HTML page (index.html), and it exposes several customization settings. Swashbuckle ships with an embedded version and includes corresponding configuration methods for each of the UI settings. If you require further customization, you can also inject your own version of \"index.html\". Read on to learn more.\n\n### Customizations via the configuration API ###\n\nIf you're happy with the basic look and feel but want to make some minor tweaks, the following options may be sufficient:\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n    .EnableSwaggerUi(c =>\n        {\n            c.InjectStylesheet(containingAssembly, \"Swashbuckle.Dummy.SwaggerExtensions.testStyles1.css\");\n            c.InjectJavaScript(containingAssembly, \"Swashbuckle.Dummy.SwaggerExtensions.testScript1.js\");\n            c.SetValidatorUrl(\"http://localhost/validator\");\n            c.DisableValidator();\n            c.DocExpansion(DocExpansion.List);\n            c.SupportedSubmitMethods(\"GET\", \"HEAD\")\n        });\n```\n\n#### InjectStylesheet ####\n\nUse this to enrich the UI with one or more additional CSS stylesheets. The file(s) must be included in your project as an \"Embedded Resource\", and then the resource's \"Logical Name\" is passed to the method as shown above. See [Injecting Custom Content](#injecting-custom-content) for step by step instructions.\n\n#### InjectJavaScript ####\n\nUse this to invoke one or more custom JavaScripts after the swagger-ui has loaded. The file(s) must be included in your project as an \"Embedded Resource\", and then the resource's \"Logical Name\" is passed to the method as shown above. See [Injecting Custom Content](#injecting-custom-content) for step by step instructions.\n\n#### SetValidatorUrl/DisableValidator ####\n\nBy default, swagger-ui will validate specs against swagger.io's online validator and display the result in a badge at the bottom of the page. Use these options to set a different validator URL or to disable the feature entirely.\n\n#### DocExpansion ####\n\nUse this option to control how the Operation listing is displayed. It can be set to \"None\" (default), \"List\" (shows operations for each resource), or \"Full\" (fully expanded: shows operations and their details).\n\n#### SupportedSubmitMethods ####\n\nSpecify which HTTP operations will have the 'Try it out!' option. An empty parameter list disables it for all operations.\n\n### Provide your own \"index\" file ###\n\nAs an alternative, you can inject your own version of \"index.html\" and customize the markup and swagger-ui directly. Use the __CustomAsset__ option to instruct Swashbuckle to return your version instead of the default when a request is made for \"index\". As with all custom content, the file must be included in your project as an \"Embedded Resource\", and then the resource's \"Logical Name\" is passed to the method as shown below. See [Injecting Custom Content](#injecting-custom-content) for step by step instructions.\n\nFor compatibility, you should base your custom \"index.html\" off [this version](https://github.com/domaindrivendev/Swashbuckle/blob/v5.5.3/Swashbuckle.Core/SwaggerUi/CustomAssets/index.html)\n\n```csharp\nhttpConfiguration\n     .EnableSwagger(c => c.SingleApiVersion(\"v1\", \"A title for your API\"))\n     .EnableSwaggerUi(c =>\n         {\n             c.CustomAsset(\"index\", yourAssembly, \"YourWebApiProject.SwaggerExtensions.index.html\");\n         });\n```\n\n### Injecting Custom Content ###\n\nThe __InjectStylesheet__, __InjectJavaScript__ and __CustomAsset__ options all share the same mechanism for providing custom content. In each case, the file must be included in your project as an \"Embedded Resource\". The steps to do this are described below:\n\n1. Add a new file to your Web API project.\n2. In Solution Explorer, right click the file and open its properties window. Change the \"Build Action\" to \"Embedded Resource\".\n\nThis will embed the file in your assembly and register it with a \"Logical Name\". This can then be passed to the relevant configuration method. It's based on the Project's default namespace, file location and file extension. For example, given a default namespace of \"YourWebApiProject\" and a file located at \"/SwaggerExtensions/index.html\", then the resource will be assigned the name - \"YourWebApiProject.SwaggerExtensions.index.html\". If you use \"Swagger\" as the root folder name for your custom assets, this will collide with the default route templates and the page will not be loaded correctly.\n\n## Transitioning to Swashbuckle 5.0 ##\n\nThis version of Swashbuckle makes the transition to Swagger 2.0. The 2.0 specification is significantly different to its predecessor (1.2) and forces several breaking changes to Swashbuckle's configuration API. If you're using Swashbuckle without any customizations, i.e. App_Start/SwaggerConfig.cs has never been modified, then you can overwrite it with the new version. The defaults are the same and so the swagger-ui should behave as before.\n\n\\* If you have consumers of the raw Swagger document, you should ensure they can accept Swagger 2.0 before making the upgrade.\n\nIf you're using the existing configuration API to customize the final Swagger document and/or swagger-ui, you will need to port the code manually. The static __Customize__ methods on SwaggerSpecConfig and SwaggerUiConfig have been replaced with extension methods on HttpConfiguration - __EnableSwagger__ and __EnableSwaggerUi__. All options from version 4.0 are made available through these methods, albeit with slightly different naming and syntax. Refer to the tables below for a summary of changes:\n\n\n| 4.0 | 5.0 Equivalent | Additional Notes |\n| --------------- | --------------- | ---------------- |\n| ResolveBasePathUsing | RootUrl | |\n| ResolveTargetVersionUsing | N/A | version is now implicit in the docs URL e.g. \"swagger/docs/{apiVersion}\" |\n| ApiVersion | SingleApiVersion| now supports additional metadata for the version | \n| SupportMultipleApiVersions | MultipleApiVersions | now supports additional metadata for each version |\n| Authorization | BasicAuth/ApiKey/OAuth2 | | \n| GroupDeclarationsBy | GroupActionsBy | |\n| SortDeclarationsBy | OrderActionGroupsBy | |\n| MapType | MapType | now accepts Func&lt;Schema&gt; instead of Func&lt;DataType&gt; |\n| ModelFilter | SchemaFilter | IModelFilter is now ISchemaFilter, DataTypeRegistry is now SchemaRegistry |\n| OperationFilter | OperationFilter | DataTypeRegistry is now SchemaRegistry |\n| PolymorphicType | N/A | not currently supported |\n| SupportHeaderParams | N/A | header params are implicitly supported |\n| SupportedSubmitMethods | N/A | all HTTP verbs are implicitly supported |\n| CustomRoute | CustomAsset | &nbsp; |\n\n## Troubleshooting and FAQ's ##\n\n1. [Swagger-ui showing \"Can't read swagger JSON from ...\"](#swagger-ui-showing-cant-read-swagger-json-from)\n2. [Page not found when accessing the UI](#page-not-found-when-accessing-the-ui)\n3. [Swagger-ui broken by Visual Studio 2013](#swagger-ui-broken-by-visual-studio-2013)\n4. [OWIN Hosted in IIS - Incorrect VirtualPathRoot Handling](#owin-hosted-in-iis---incorrect-virtualpathroot-handling)\n5. [How to add vendor extensions](#how-to-add-vendor-extensions)\n6. [FromUri Query string DataMember names are incorrect](#fromuri-query-string-datamember-names-are-incorrect)\n7. [Remove Duplicate Path Parameters](#remove-duplicate-path-parameters)\n8. [Deploying behind Load Balancer / Reverse Proxies](#deploying-behind-load-balancer--reverse-proxies)\n9. [500 : {\"Message\":\"An error has occurred.\"}](#500--messagean-error-has-occurred)\n\n### Swagger-ui showing \"Can't read swagger JSON from ...\"\n\nIf you see this message, it means the swagger-ui received an unexpected response when requesting the Swagger document. You can troubleshoot further by navigating directly to the discovery URL included in the error message. This should provide more details.\n\nIf the discovery URL returns a 404 Not Found response, it may be due to a full-stop in the version name (e.g. \"1.0\"). This will cause IIS to treat it as a static file (i.e. with an extension) and bypass the URL Routing Module and therefore, Web API. \n\nTo workaround, you can update the version name specified in SwaggerConfig.cs. For example, to \"v1\", \"1-0\" etc. Alternatively, you can change the route template being used for the swagger docs (as shown [here](#custom-routes)) so that the version parameter is not at the end of the route.\n\n### Page not found when accessing the UI ###\n\nSwashbuckle serves an embedded version of the swagger-ui through the Web API pipeline. But, most of the URLs contain extensions (.html, .js, .css) and many IIS environments are configured to bypass the managed pipeline for paths containing extensions.\n\nIn previous versions of Swashbuckle, this was resolved by adding the following setting to your Web.config:\n\n```xml\n<system.webServer>\n  <modules runAllManagedModulesForAllRequests=\"true\" />\n</system.webServer>\n```\n\nThis is no longer neccessary in Swashbuckle 5.0 because it serves the swagger-ui through extensionless URL's.\n\nHowever, if you're using the SingleApiVersion, MultipleApiVersions or CustomAsset configuration settings you could still get this error. Check to ensure you're not specifying a value that causes a URL with an extension to be referenced in the UI. For example a full-stop in a version number ...\n\n```csharp\nhttpConfiguration\n    .EnableSwagger(c => c.SingleApiVersion(\"1.0\", \"A title for your API\"))\n    .EnableSwaggerUi();\n```\nwill result in a discovery URL like this \"/swagger/docs/1.0\" where the full-stop is treated as a file extension.\n\n### Swagger-ui broken by Visual Studio 2013 ###\n\nVS 2013 ships with a new feature - Browser Link - that improves the web development workflow by setting up a channel between the IDE and pages being previewed in a local browser. It does this by dynamically injecting JavaScript into your files.\n\nAlthough this JavaScript SHOULD have no affect on your production code, it appears to be breaking the swagger-ui.\n\nI hope to find a permanent fix, but in the meantime, you'll need to workaround this issue by disabling the feature in your web.config:\n\n```xml\n<appSettings>\n    <add key=\"vs:EnableBrowserLink\" value=\"false\"/>\n</appSettings>\n```\n### OWIN Hosted in IIS - Incorrect VirtualPathRoot Handling\n\nWhen you host Web API 2 on top of OWIN/SystemWeb, Swashbuckle cannot correctly resolve VirtualPathRoot by default.\n\nYou must either explicitly set VirtualPathRoot in your HttpConfiguration at startup, or perform customization like this to fix automatic discovery:\n\n```csharp\nhttpConfiguration.EnableSwagger(c => \n{\n    c.RootUrl(req =>\n        req.RequestUri.GetLeftPart(UriPartial.Authority) +\n        req.GetRequestContext().VirtualPathRoot.TrimEnd('/'));\n}\n```\n\n### How to add vendor extensions\n\nSwagger 2.0 allows additional meta-data (aka vendor extensions) to be added at various points in the Swagger document. Swashbuckle supports this by including a \"vendorExtensions\" dictionary with each of the extensible Swagger types. Meta-data can be added to these dictionaries from custom Schema, Operation or Document filters. For example:\n\n```csharp\npublic class ApplySchemaVendorExtensions : ISchemaFilter\n{\n    public void Apply(Schema schema, SchemaRegistry schemaRegistry, Type type)\n    {\n        schema.vendorExtensions.Add(\"x-foo\", \"bar\");\n    }\n}\n```\n\nAs per the specification, all extension properties should be prefixed by \"x-\"\n\n### FromUri Query string DataMember names are incorrect\n\nWhen using `FromUri` Model Binding, it is possible to override the querystring parameter name's using `DataMember`s. In this case you can add a custom operation filter to override the name. For example:\n\n```csharp\npublic class ComplexTypeOperationFilter : IOperationFilter\n{\n    public void Apply(Operation operation, SchemaRegistry schemaRegistry, ApiDescription apiDescription)\n    {\n        if (operation.parameters == null)\n            return;\n\n        var parameters = apiDescription.ActionDescriptor.GetParameters();\n        foreach (var parameter in parameters)\n        {\n            foreach (var property in parameter.ParameterType.GetProperties())\n            {\n                var param = operation.parameters.FirstOrDefault(o => o.name.ToLowerInvariant().Contains(property.Name.ToLowerInvariant()));\n\n                if (param == null) continue;\n\n                var name = GetNameFromAttribute(property);\n\n                if (string.IsNullOrEmpty(name))\n                {\n                    operation.parameters.Remove(param);\n                }\n                param.name = GetNameFromAttribute(property);\n            }\n        }\n    }\n    \n    private static string GetNameFromAttribute(PropertyInfo property)\n    {\n        var customAttributes = property.GetCustomAttributes(typeof(DataMemberAttribute), true);\n        if (customAttributes.Length > 0)\n        {\n            var attribute = customAttributes[0] as DataMemberAttribute;\n            if (attribute != null) return attribute.Name;\n        }\n        return string.Empty;\n    }\n}\n```\n\n### Remove Duplicate Path Parameters\n\nWhen using `FromUri` Model Binding, duplicate items can appear as items can be passed as URI parameters, or querystrings. In this case you can add a custom operation filter to remove the duplicates. For example:\n\n```csharp\npublic class ComplexTypeOperationFilter : IOperationFilter\n{\n    public void Apply(Operation operation, SchemaRegistry schemaRegistry, ApiDescription apiDescription)\n    {\n       if (operation.parameters == null)\n           return;\n       var complexParameters = operation.parameters.Where(x => x.@in == \"query\" && !string.IsNullOrWhiteSpace(x.name)).ToArray();\n\n       foreach (var parameter in complexParameters)\n       {\n           if (!parameter.name.Contains('.')) continue;\n           var name = parameter.name.Split('.')[1];\n\n           var opParams = operation.parameters.Where(x => x.name == name);\n           var parameters = opParams as Parameter[] ?? opParams.ToArray();\n\n           if (parameters.Length > 0)\n           {\n               operation.parameters.Remove(parameter);\n           }\n       }\n    }\n}\n```\n\n### Deploying behind Load Balancer / Reverse Proxies\n\nSwashbuckle attempts to populate the [Swagger \"host\"](http://swagger.io/specification/#swaggerObject) property from HTTP headers that are sent with the request for Swagger JSON. This may cause issues in load balancer / reverse proxy environments, particularly if non-standard headers are used to pass on the outer most host name. You can workaround this by providing your own function for determining your API's root URL based on vendor-specific headers. Checkout [issue 705](https://github.com/domaindrivendev/Swashbuckle/issues/705) for some potential implementations.\n\n### 500 : {\"Message\":\"An error has occurred.\"}\n\nIf, on loading the Swagger UI page, you get an error: `500 : {\"Message\":\"An error has occurred.\"} http://<url>/swagger/docs/v1` ensure that the XML documentation output settings have been set in the project file in the solution, for both Debug and Release configurations.\n"
        },
        {
          "name": "Swashbuckle.Core",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.Dummy.Core",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.Dummy.SelfHost",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.Dummy.WebHost",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.Tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.WebHost",
          "type": "tree",
          "content": null
        },
        {
          "name": "Swashbuckle.sln",
          "type": "blob",
          "size": 5.9873046875,
          "content": "﻿\r\nMicrosoft Visual Studio Solution File, Format Version 12.00\r\n# Visual Studio 2013\r\nVisualStudioVersion = 12.0.30501.0\r\nMinimumVisualStudioVersion = 10.0.40219.1\r\nProject(\"{E24C65DC-7377-472B-9ABA-BC803B73C61A}\") = \"swagger-ui\", \"http://localhost:55139\", \"{DDE07B02-DD45-4ABF-96D3-A4FBB144BBA1}\"\r\n\tProjectSection(WebsiteProperties) = preProject\r\n\t\tUseIISExpress = \"true\"\r\n\t\tTargetFrameworkMoniker = \".NETFramework,Version%3Dv4.0\"\r\n\t\tDebug.AspNetCompiler.VirtualPath = \"/localhost_55139\"\r\n\t\tDebug.AspNetCompiler.PhysicalPath = \"swagger-ui\\\"\r\n\t\tDebug.AspNetCompiler.TargetPath = \"PrecompiledWeb\\localhost_55139\\\"\r\n\t\tDebug.AspNetCompiler.Updateable = \"true\"\r\n\t\tDebug.AspNetCompiler.ForceOverwrite = \"true\"\r\n\t\tDebug.AspNetCompiler.FixedNames = \"false\"\r\n\t\tDebug.AspNetCompiler.Debug = \"True\"\r\n\t\tRelease.AspNetCompiler.VirtualPath = \"/localhost_55139\"\r\n\t\tRelease.AspNetCompiler.PhysicalPath = \"swagger-ui\\\"\r\n\t\tRelease.AspNetCompiler.TargetPath = \"PrecompiledWeb\\localhost_55139\\\"\r\n\t\tRelease.AspNetCompiler.Updateable = \"true\"\r\n\t\tRelease.AspNetCompiler.ForceOverwrite = \"true\"\r\n\t\tRelease.AspNetCompiler.FixedNames = \"false\"\r\n\t\tRelease.AspNetCompiler.Debug = \"False\"\r\n\t\tSlnRelativePath = \"swagger-ui\\\"\r\n\tEndProjectSection\r\nEndProject\r\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \".nuget\", \".nuget\", \"{67E5A2D2-56E1-4195-AEAF-8F9812559F49}\"\r\n\tProjectSection(SolutionItems) = preProject\r\n\t\t.nuget\\NuGet.Config = .nuget\\NuGet.Config\r\n\t\t.nuget\\NuGet.exe = .nuget\\NuGet.exe\r\n\t\t.nuget\\NuGet.targets = .nuget\\NuGet.targets\r\n\tEndProjectSection\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.Core\", \"Swashbuckle.Core\\Swashbuckle.Core.csproj\", \"{D50A26FF-02C6-4C16-BA94-4CD7D43EFBB3}\"\r\nEndProject\r\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"Tests\", \"Tests\", \"{6A2C69FA-6824-44F3-A1A5-1313050FA567}\"\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.WebHost\", \"Swashbuckle.WebHost\\Swashbuckle.WebHost.csproj\", \"{FE974ABE-021C-415C-BF57-041A42136AA1}\"\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.Tests\", \"Swashbuckle.Tests\\Swashbuckle.Tests.csproj\", \"{2F5D233D-F779-473E-9EEC-ACC58AC266ED}\"\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.Dummy.WebHost\", \"Swashbuckle.Dummy.WebHost\\Swashbuckle.Dummy.WebHost.csproj\", \"{E51BDA79-1942-490E-A1D4-E37235736D8A}\"\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.Dummy.Core\", \"Swashbuckle.Dummy.Core\\Swashbuckle.Dummy.Core.csproj\", \"{2DFE3931-747F-48C6-8530-B74710988095}\"\r\nEndProject\r\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"Swashbuckle.Dummy.SelfHost\", \"Swashbuckle.Dummy.SelfHost\\Swashbuckle.Dummy.SelfHost.csproj\", \"{2D1F2F73-5828-413C-9FD0-6F81A964C82D}\"\r\nEndProject\r\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"Solution Items\", \"Solution Items\", \"{1C2DFC9F-AC30-4057-AC24-8D859C9F0DE8}\"\r\n\tProjectSection(SolutionItems) = preProject\r\n\t\tappveyor.yml = appveyor.yml\r\n\t\tCONTRIBUTING.md = CONTRIBUTING.md\r\n\t\tISSUE_TEMPLATE.md = ISSUE_TEMPLATE.md\r\n\t\tLICENSE = LICENSE\r\n\t\tREADME.md = README.md\r\n\tEndProjectSection\r\nEndProject\r\nGlobal\r\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\r\n\t\tDebug|Any CPU = Debug|Any CPU\r\n\t\tRelease|Any CPU = Release|Any CPU\r\n\tEndGlobalSection\r\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\r\n\t\t{DDE07B02-DD45-4ABF-96D3-A4FBB144BBA1}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{DDE07B02-DD45-4ABF-96D3-A4FBB144BBA1}.Release|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{DDE07B02-DD45-4ABF-96D3-A4FBB144BBA1}.Release|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{D50A26FF-02C6-4C16-BA94-4CD7D43EFBB3}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{D50A26FF-02C6-4C16-BA94-4CD7D43EFBB3}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{D50A26FF-02C6-4C16-BA94-4CD7D43EFBB3}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{D50A26FF-02C6-4C16-BA94-4CD7D43EFBB3}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\t\t{FE974ABE-021C-415C-BF57-041A42136AA1}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{FE974ABE-021C-415C-BF57-041A42136AA1}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{FE974ABE-021C-415C-BF57-041A42136AA1}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{FE974ABE-021C-415C-BF57-041A42136AA1}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\t\t{2F5D233D-F779-473E-9EEC-ACC58AC266ED}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{2F5D233D-F779-473E-9EEC-ACC58AC266ED}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{2F5D233D-F779-473E-9EEC-ACC58AC266ED}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{2F5D233D-F779-473E-9EEC-ACC58AC266ED}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\t\t{E51BDA79-1942-490E-A1D4-E37235736D8A}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{E51BDA79-1942-490E-A1D4-E37235736D8A}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{E51BDA79-1942-490E-A1D4-E37235736D8A}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{E51BDA79-1942-490E-A1D4-E37235736D8A}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\t\t{2DFE3931-747F-48C6-8530-B74710988095}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{2DFE3931-747F-48C6-8530-B74710988095}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{2DFE3931-747F-48C6-8530-B74710988095}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{2DFE3931-747F-48C6-8530-B74710988095}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\t\t{2D1F2F73-5828-413C-9FD0-6F81A964C82D}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\r\n\t\t{2D1F2F73-5828-413C-9FD0-6F81A964C82D}.Debug|Any CPU.Build.0 = Debug|Any CPU\r\n\t\t{2D1F2F73-5828-413C-9FD0-6F81A964C82D}.Release|Any CPU.ActiveCfg = Release|Any CPU\r\n\t\t{2D1F2F73-5828-413C-9FD0-6F81A964C82D}.Release|Any CPU.Build.0 = Release|Any CPU\r\n\tEndGlobalSection\r\n\tGlobalSection(SolutionProperties) = preSolution\r\n\t\tHideSolutionNode = FALSE\r\n\tEndGlobalSection\r\n\tGlobalSection(NestedProjects) = preSolution\r\n\t\t{2F5D233D-F779-473E-9EEC-ACC58AC266ED} = {6A2C69FA-6824-44F3-A1A5-1313050FA567}\r\n\t\t{E51BDA79-1942-490E-A1D4-E37235736D8A} = {6A2C69FA-6824-44F3-A1A5-1313050FA567}\r\n\t\t{2DFE3931-747F-48C6-8530-B74710988095} = {6A2C69FA-6824-44F3-A1A5-1313050FA567}\r\n\t\t{2D1F2F73-5828-413C-9FD0-6F81A964C82D} = {6A2C69FA-6824-44F3-A1A5-1313050FA567}\r\n\tEndGlobalSection\r\nEndGlobal\r\n"
        },
        {
          "name": "Swashbuckle.sln.nuspec",
          "type": "blob",
          "size": 0.75,
          "content": "<?xml version=\"1.0\"?>\n<package >\n  <metadata>\n    <id>.\\Swashbuckle.sln</id>\n    <version>1.0.0</version>\n    <authors>rmorris</authors>\n    <owners>rmorris</owners>\n    <licenseUrl>http://LICENSE_URL_HERE_OR_DELETE_THIS_LINE</licenseUrl>\n    <projectUrl>http://PROJECT_URL_HERE_OR_DELETE_THIS_LINE</projectUrl>\n    <iconUrl>http://ICON_URL_HERE_OR_DELETE_THIS_LINE</iconUrl>\n    <requireLicenseAcceptance>false</requireLicenseAcceptance>\n    <description>Package description</description>\n    <releaseNotes>Summary of changes made in this release of the package.</releaseNotes>\n    <copyright>Copyright 2013</copyright>\n    <tags>Tag1 Tag2</tags>\n    <dependencies>\n      <dependency id=\"SampleDependency\" version=\"1.0\" />\n    </dependencies>\n  </metadata>\n</package>"
        },
        {
          "name": "appveyor.yml",
          "type": "blob",
          "size": 0.1279296875,
          "content": "init:\n  - git config --global core.autocrlf true \n\nbefore_build:\n  - git submodule update --init\n\nbuild:\n  project: Swashbuckle.sln"
        },
        {
          "name": "swagger-ui",
          "type": "commit",
          "content": null
        }
      ]
    }
  ]
}