{
  "metadata": {
    "timestamp": 1736710992074,
    "page": 692,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "snozbot/fungus",
      "stars": 1705,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.2470703125,
          "content": "[Ll]ibrary/\r\n[Tt]emp/\r\n[Oo]bj/\r\n[Bb]uild/\r\n\r\n# Autogenerated VS/MD solution and project files\r\n*.csproj\r\n*.unityproj\r\n*.sln\r\n\r\n*.userprefs\r\n*.csv#\r\n\r\n.vs/*\r\nUWP/*\r\n.idea/*\r\nAssets/Plugins/\r\nAssets/Plugins.meta\r\nLogs/*\r\n.vscode/launch.json\r\nCodeCoverage\n"
        },
        {
          "name": "Assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 2.3076171875,
          "content": "# Code of conduct\n\n# TL;DR #\nBe nice to each other :)\n\nWe want an open and respectful community at Fungus. So we would ask you when communicating (for example, posting on our Forums, Comments or github repository ) to be friendly and helpful. We find, for most people, this is not a problem. Our list of guidelines below is not exhaustive but should give a strong indication of what we consider acceptable community behaviour.\n\n# Be welcoming #\nWe welcome and support people of all backgrounds and identities. This includes, but is not limited to members of any race, ethnicity, culture, national origin, colour, immigration status, social and economic class, educational level, sex, sexual orientation, gender identity and expression, age, size, family status, political belief, religion, and mental and physical ability.\n\n# Be respectful #\nIt's ok to disagree with someone. It's not ok to personally attack someone. Instead, focus on helping to resolve issues and learning from mistakes.\n\nBullying or Harassment will not be tolerated\nThe following behaviours are not acceptable:\n\n- Violent threats or language directed against another person.\n- Sexist, racist, or otherwise discriminatory jokes and language.\n- Posting sexually explicit or violent material.\n- Posting (or threatening to post) other people's personally identifying information (\"doxing\").\n- Sharing private content, such as emails sent privately or non-publicly, or unlogged forums such as IRC channel history.\n- Personal insults, especially those using racist or sexist terms.\n- Unwelcome sexual attention.\n- Excessive or unnecessary profanity.\n- Repeated harassment of others. In general, if someone asks you to stop, then stop.\n- Advocating for, or encouraging, any of the above behaviour.\n\n# Assume Good Intentions #\nGive people the benefit of the doubt. If you believe they have acted against the code of conduct, please refer them to this document. Remember, although English is the primary language of Fungus development, that not all members have English as their primary language.\n\nThanks to [http://www.apache.org/foundation/policies/conduct.html](http://www.apache.org/foundation/policies/conduct.html) and [https://www.djangoproject.com/conduct](https://www.djangoproject.com/conduct) for inspiration and content.\n\nIf you have any questions about these guidelines please contact us.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.7861328125,
          "content": "# Contributing\n\nWe welcome pull requests from everyone. By contributing to this project, you agree to abide by the Fungus [code of conduct]. You also agree that by submitting a pull request for this project, **[your contribution will be licensed under the MIT license for this project][fungus license]**.\n\nNote: For large changes or added features, please open an Issue indicating what you are intended to work on. This is to allow greater collaboration and prevent multiple isolated indivduals accidentially working on the same thing.\n\n1. Fork and clone the Fungus repo (see [fork a repo] )\n2. Switch to the develop branch.\n3. Make sure the tests pass locally (see the project readme for instructions).\n4. Make your change. Add tests and/or demo scenes for your change. \n5. Make the tests pass locally.\n6. Push to your fork and [submit a pull request][pr].\n\nWe will try to give initial feedback to pull requests within a few days. However, this may not always be possible. Please be patient, we will look at every pull request as soon as we can.\n\nYour pull request will have a better chance of being accepted if you do the following: \n\n* Send one pull request for each new feature. It's time consuming for us to review multi-feature changes.\n* Write tests for each change / new feature (not always possible)\n* Follow our [coding standard]\n* Write a [good commit message][commit].\n* Target and make changes against the develop branch.\n\n[code of conduct]: https://github.com/snozbot/fungus/blob/master/CODE_OF_CONDUCT.md\n[commit]: http://chris.beams.io/posts/git-commit/\n[fork a repo]: https://help.github.com/articles/fork-a-repo/\n[fungus license]: https://github.com/FungusGames/Fungus/blob/master/LICENSE\n[pr]: https://github.com/snozbot/fungus/compare\n[coding standard]: https://github.com/snozbot/fungus/wiki/coding_standard\n"
        },
        {
          "name": "Docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "Fungus-Playmaker Scripts.unitypackage",
          "type": "blob",
          "size": 2.5205078125,
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0537109375,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2014 Chris Gregan\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "Packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "ProjectSettings",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.841796875,
          "content": "Fungus\n======\n\nThe goal of Fungus is to provide a free, open source tool for creating interactive storytelling games in Unity 3D. Fungus is designed to be easy to learn for beginners to Unity 3D, especially for people with no coding experience. For power users, it provides an intuitive, fast workflow for visual scripting and interactive storytelling. Fungus is being used to create Visual Novels, Point and Click Adventure Games, Childrens Stories, Hidden Object Games, eLearning apps and also some frankly weird stuff which defies classification :)\n\n- Maintainer: [Steve Halliwell](https://github.com/stevehalliwell)\n- Website: [fungusgames.com](https://fungusgames.com)\n- Email: funguswork@stevehalliwell.com \n\nFungus was originally created by [Chris Gregan](https://github.com/chrisgregan) - [@gofungus](https://twitter.com/gofungus)\n\nInstallation\n============\n\nDownload & installation instructions and tutorial videos are available in [the wiki](https://github.com/snozbot/fungus/wiki/installation) and the official [Fungus website](https://fungusgames.com).\n\nSupport & Documentation\n=======\n\nThe Fungus documentation is available on [our wiki](https://github.com/snozbot/fungus/wiki). Contributions to the wiki are very  welcome.\n\nIf you have questions about Fungus, please search our forum first as someone may have had the same issue already. If you can't find an answer please start a new discussion and we'll answer you as soon as we can. Fungus is designed for beginners and we love to hear from users so please don't be shy about posting on [the forum](https://fungusgames.com/forum)!\n\nThere is also a community run [Discord server](https://discord.gg/99RqraQ).\n\nYou can also join into our chat room.\n[![Join the chat at https://gitter.im/snozbot/fungus](https://badges.gitter.im/snozbot/fungus.svg)](https://gitter.im/snozbot/fungus?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\n\nStatus & Branches\n=================\n\nFungus uses a [gitflow](https://nvie.com/posts/a-successful-git-branching-model/) style setup. The default branch holds the most recent stable release. Develop is the staging ground for ongoing work and the default target of most PRs. \n\nDevelop is currently the staging ground for the next Fungus [feature release 3.14](https://github.com/snozbot/fungus/milestone/1)\n\nContributing\n============\n\nMany thanks to everyone who has [contributed](https://github.com/snozbot/fungus/graphs/contributors) to the project to date!\n\nTo contribute code or documentation to Fungus, please see [CONTRIBUTING](https://github.com/snozbot/fungus/blob/master/CONTRIBUTING.md).\n\nYou can view the upcoming roadmap via the [Milestones](https://github.com/snozbot/fungus/milestones).\n\nRunning the automated tests\n===========================\n\nThe Unity Test Runner is used for testing some underlying elements. Far more are desired and PRs in this area would most welcome.\n"
        }
      ]
    }
  ]
}