{
  "metadata": {
    "timestamp": 1736710907131,
    "page": 505,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "bbepis/XUnity.AutoTranslator",
      "stars": 2103,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.6171875,
          "content": "﻿root = true\n\n[*]\ncharset                  = utf-8-bom\ninsert_final_newline     = true\ntrim_trailing_whitespace = true\n\n# CSharp code style settings:\n[*.cs]\nindent_size                                                        = 3\ncsharp_space_between_method_call_parameter_list_parentheses        = true\ncsharp_space_between_method_declaration_parameter_list_parentheses = true\ncsharp_space_between_square_brackets                               = true\ncsharp_space_after_keywords_in_control_flow_statements             = false\ncsharp_space_between_parentheses                                   = control_flow_statements, expressions"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 1.3134765625,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto\n\n# Custom for Visual Studio\n*.cs text diff=csharp\n*.vb text\n*.c text\n*.cpp text\n*.cxx text\n*.h text\n*.hxx text\n*.py text\n*.rb text\n*.java text\n*.html text\n*.htm text\n*.css text\n*.scss text\n*.sass text\n*.less text\n*.js text\n*.lisp text\n*.clj text\n*.sql text\n*.php text\n*.lua text\n*.m text\n*.asm text\n*.erl text\n*.fs text\n*.fsx text\n*.hs text\n*.ps1 text\n*.psm1 text\n*.md text\n*.cmd text\n\n# Visual Studio Project files\n*.csproj text merge=union \n*.ccproj text merge=union \n*.vbproj text merge=union \n*.fsproj text merge=union \n*.dbproj text merge=union \n*.xproj text merge=union \n*.sln text eol=crlf merge=union \n\n# Standard to msysgit\n*.doc\t diff=astextplain\n*.DOC\t diff=astextplain\n*.docx diff=astextplain\n*.DOCX diff=astextplain\n*.dot  diff=astextplain\n*.DOT  diff=astextplain\n*.pdf  diff=astextplain\n*.PDF\t diff=astextplain\n*.rtf\t diff=astextplain\n*.RTF\t diff=astextplain\n\n# Binaries\n*.dll binary\n*.DLL binary\n*.chm binary\n*.pdb binary\n*.PDB binary\n*.exe binary\n*.EXE binary\n\n# Certificates\n*.pfx binary\n*.p12 binary\n\n# Images\n*.png binary\n*.jpeg binary\n*.jpg binary\n*.gif binary\n*.PNG binary\n*.JPEG binary\n*.JPG binary\n*.GIF binary\n\n# Fonts\n*.eot binary\n*.otf binary\n*.ttf binary\n*.woff binary\n*.woff2 binary\n*.EOT binary\n*.OTF binary\n*.TTF binary\n*.WOFF binary\n*.WOFF2 binary\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 4.2080078125,
          "content": "﻿## Ignore Visual Studio temporary files, build results, and\n## files generated by popular Visual Studio add-ons.\n\n# User-specific files\n*.suo\n*.user\n*.userosscache\n*.sln.docstates\n\n# User-specific files (MonoDevelop/Xamarin Studio)\n*.userprefs\n\n# Build results\n[Dd]ebug/\n[Dd]ebugPublic/\n[Rr]elease/\n[Rr]eleases/\nx64/\nx86/\nbld/\n[Bb]in/\n[Oo]bj/\n[Ll]og/\n\n# Visual Studio 2015 cache/options directory\n.vs/\n# Uncomment if you have tasks that create the project's static files in wwwroot\n#wwwroot/\n\n# MSTest test Results\n[Tt]est[Rr]esult*/\n[Bb]uild[Ll]og.*\n\n# NUNIT\n*.VisualState.xml\nTestResult.xml\n\n# Build Results of an ATL Project\n[Dd]ebugPS/\n[Rr]eleasePS/\ndlldata.c\n\n# DNX\nproject.lock.json\nartifacts/\n\n*_i.c\n*_p.c\n*_i.h\n*.ilk\n*.meta\n*.obj\n*.pch\n*.pdb\n*.pgc\n*.pgd\n*.rsp\n*.sbr\n*.tlb\n*.tli\n*.tlh\n*.tmp\n*.tmp_proj\n*.log\n*.vspscc\n*.vssscc\n.builds\n*.pidb\n*.svclog\n*.scc\n\n# Chutzpah Test files\n_Chutzpah*\n\n# Visual C++ cache files\nipch/\n*.aps\n*.ncb\n*.opendb\n*.opensdf\n*.sdf\n*.cachefile\n*.VC.db\n*.VC.VC.opendb\n\n# Visual Studio profiler\n*.psess\n*.vsp\n*.vspx\n*.sap\n\n# TFS 2012 Local Workspace\n$tf/\n\n# Guidance Automation Toolkit\n*.gpState\n\n# ReSharper is a .NET coding add-in\n_ReSharper*/\n*.[Rr]e[Ss]harper\n*.DotSettings.user\n\n# JustCode is a .NET coding add-in\n.JustCode\n\n# TeamCity is a build add-in\n_TeamCity*\n\n# DotCover is a Code Coverage Tool\n*.dotCover\n\n# NCrunch\n_NCrunch_*\n.*crunch*.local.xml\nnCrunchTemp_*\n\n# MightyMoose\n*.mm.*\nAutoTest.Net/\n\n# Web workbench (sass)\n.sass-cache/\n\n# Installshield output folder\n[Ee]xpress/\n\n# DocProject is a documentation generator add-in\nDocProject/buildhelp/\nDocProject/Help/*.HxT\nDocProject/Help/*.HxC\nDocProject/Help/*.hhc\nDocProject/Help/*.hhk\nDocProject/Help/*.hhp\nDocProject/Help/Html2\nDocProject/Help/html\n\n# Click-Once directory\npublish/\n\n# Publish Web Output\n*.[Pp]ublish.xml\n*.azurePubxml\n# TODO: Comment the next line if you want to checkin your web deploy settings\n# but database connection strings (with potential passwords) will be unencrypted\n#*.pubxml\n#*.publishproj\n\n# Microsoft Azure Web App publish settings. Comment the next line if you want to\n# checkin your Azure Web App publish settings, but sensitive information contained\n# in these scripts will be unencrypted\nPublishScripts/\n\n# NuGet Packages\n*.nupkg\n# The packages folder can be ignored because of Package Restore\n**/packages/*\n# except build/, which is used as an MSBuild target.\n!**/packages/build/\n# Uncomment if necessary however generally it will be regenerated when needed\n#!**/packages/repositories.config\n# NuGet v3's project.json files produces more ignoreable files\n*.nuget.props\n*.nuget.targets\n\n# Microsoft Azure Build Output\ncsx/\n*.build.csdef\n\n# Microsoft Azure Emulator\necf/\nrcf/\n\n# Windows Store app package directories and files\nAppPackages/\nBundleArtifacts/\nPackage.StoreAssociation.xml\n_pkginfo.txt\n\n# Visual Studio cache files\n# files ending in .cache can be ignored\n*.[Cc]ache\n# but keep track of directories ending in .cache\n!*.[Cc]ache/\n\n# Others\nClientBin/\n~$*\n*~\n*.dbmdl\n*.dbproj.schemaview\n*.publishsettings\nnode_modules/\norleans.codegen.cs\n\n# Since there are multiple workflows, uncomment next line to ignore bower_components\n# (https://github.com/github/gitignore/pull/1529#issuecomment-104372622)\n#bower_components/\n\n# RIA/Silverlight projects\nGenerated_Code/\n\n# Backup & report files from converting an old project file\n# to a newer Visual Studio version. Backup files are not needed,\n# because we have git ;-)\n_UpgradeReport_Files/\nBackup*/\nUpgradeLog*.XML\nUpgradeLog*.htm\n\n# SQL Server files\n*.mdf\n*.ldf\n\n# Business Intelligence projects\n*.rdl.data\n*.bim.layout\n*.bim_*.settings\n\n# Microsoft Fakes\nFakesAssemblies/\n\n# GhostDoc plugin setting file\n*.GhostDoc.xml\n\n# Node.js Tools for Visual Studio\n.ntvs_analysis.dat\n\n# Visual Studio 6 build log\n*.plg\n\n# Visual Studio 6 workspace options file\n*.opt\n\n# Visual Studio LightSwitch build output\n**/*.HTMLClient/GeneratedArtifacts\n**/*.DesktopClient/GeneratedArtifacts\n**/*.DesktopClient/ModelManifest.xml\n**/*.Server/GeneratedArtifacts\n**/*.Server/ModelManifest.xml\n_Pvt_Extensions\n\n# Paket dependency manager\n.paket/paket.exe\npaket-files/\n\n# FAKE - F# Make\n.fake/\n\n# JetBrains Rider\n.idea/\n*.sln.iml\n\n# Distribution\ndist/\n\n# Trampoline dll\n**/b979b301af8b4ef48f224de6dcf2ddf6.dll\n\n# Game DLL ignores\n/libs/Koikatsu\n"
        },
        {
          "name": "CHANGELOG - ResourceRedirector.md",
          "type": "blob",
          "size": 1.5458984375,
          "content": "﻿### 2.1.0\n * FEATURE - Added support for latest MelonLoader and BepInEx bleeding edge builds (only for IL2CPP, use stable release for Mono), also dropped support for earlier versions!\n\n### 2.0.0\n * FEATURE - IL2CPP support through BepInEx 6 and MelonLoader\n * MISC - Prioritize HarmonyX hooks over MonoMod hooks\n * MISC - Changed BepInEx setting names\n * MISC - Renamed BepInEx plugin package from BepIn-5x to BepInEx. If updating remember to remove the old BepIn-5x DLL\n * BUG FIX - Fixed bug that caused some rarely used methods to be short-circuited incorrectly\n\n### 1.2.1\n * MISC - Improved logging statements for redirection subscriptions allowing for less spam\n\n### 1.2.0\n * FEATURE - Support callbacks for asset bundles loaded from streams\n\n### 1.1.3\n * BUG FIX - Fixed bug that caused the GetBuiltinResource to not be found on later versions of the Unity Engine. Thanks to aqie13 on GitHub\n\n### 1.1.2\n * MISC - Internal API changes - some code moved to XUnity.Common\n\n### 1.1.1\n * BUG FIX - Development-time fix to the nuget package\n * BUG FIX - Fixed bug in method 'LoadFromFileWithRandomizedCabIfRequired' where offset was ignored if the initial load attempt failed\n\n### 1.1.0\n * FEATURE - Added method to load an asset from a file, with fallback to loading it from an in-memory stream with randomized CAB\n * FEATURE - Added support for postfix hooks on AssetBundle loads\n * FEATURE - Added hook for 'LoadFromMemory' and 'LoadFromMemoryAsync' when loading asset bundles\n\n### 1.0.1\n * MISC - Support for UnityEngine version 2018.2 and lower\n\n### 1.0.0\n * Initial release\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 38.490234375,
          "content": "﻿### 5.4.3\n* FEATURE - CustomTranslateEndpoint - Add EnableShortDelay and DisableSpamChecks settings\n* BUG FIX - Fix `minor regex performance improvement` breaking in some games\n\n### 5.4.2\n * FEATURE - Translation scoping - if GetScopeFromComponent fails, use GetActiveSceneId instead of -1                \n * BUG FIX - Make config accessible on Android\n * BUG FIX - Make paths OS-independent in the MelonMod version\n * MISC - Minor regex performance improvement\n * MISC - Move XZipper from DotNetZip to SharpCompress\n\n### 5.4.1\n * BUG FIX - Fix change font crash when previous font is null\n\n### 5.4.0\n * FEATURE - Keep the outline style when overriding TextMeshPro Font\n * BUG FIX - Update to BepInEx 6.0 BE-704 to fix some IL2CPP crashes\n * BUG FIX - Fix failing to get some Il2CppTypes silently and crashing later\n * BUG FIX - Update DeepL supported languages\n\n### 5.3.1\n * BUG FIX - Various bugfixes and minor improvemnents to the IL2CPP build\n * BUG FIX - Various bugfixes to the DeepL endpoint\n\n### 5.3.0\n * FEATURE - Added support for latest MelonLoader and BepInEx bleeding edge builds (only for IL2CPP, use stable release for Mono), also dropped support for earlier versions!\n * FEATURE - Added 'PersistRichTextMode' to allow control over how text that is parsed as rich text during translation is persisted\n * REGRESSION - Dropped support for pre-2017 Unity Engine versions for IL2CPP versions due to problems with new IL2CPP interop (may be re-added later)\n * BUG FIX - Fixed some potential NullReferenceException occurrences\n * BUG FIX - Fixed potential bug during substitution replacements - thanks to @TokcDK\n\n### 5.2.0\n * FEATURE - Added support for Lingo Cloud - thanks to Kiles Duli\n * BUG FIX - Fixed IL2CPP issue where plugin did not always use correct unhollowed paths for BepInEx\n\n### 5.1.0\n * BREAKING CHANGE - Fixed escaping for '='-sign in translation files. Now uses '\\=' instead of '%3D', though '%3D' is still recognized as newline when reading translations\n * FEATURE - Added automatic translation pruning for translations replaced by regexes in the standard output file. Does not work for splitter regexes\n * BUG FIX - Fixed an issue related to TextMesh Pro font fallback in MelonLoader\n * BUG FIX - Fixed a bug related to splitter regex construction\n * BUG FIX - Fixed issue related reloading translations\n * BUG FIX - Added warnings for badly formed regexes\n * MISC - Reduced Translation Aggregator window delay from 2 seconds to 1 second\n * MISC - Improved error logging associated with translation reading\n * MISC - ezTransXP and LEC now not affected by anti spam measures as though it was an online endpoint\n\n### 5.0.0\n * FEATURE - Basic IL2CPP support through BepInEx 6 and MelonLoader\n * FEATURE - MelonLoader support\n * FEATURE - Added FallbackFontTextMeshPro as an alternative to OverrideFontTextMeshPro. If game supports, it is recommended to use that instead\n * FEATURE - Added ClipboardDebounceTime that can control how long time between a text is shown until it reaches the clipboard\n * MISC - Renamed BepInEx plugin package from BepIn-5x to BepInEx. If updating remember to remove the old BepIn-5x DLL\n * MISC - UTAGE support re-implemented from scratch to better support IL2CPP\n * BUG FIX - Fixed text escaping error related to GoogleTranslateV2\n * BUG FIX - Fixed issue that could cause texts not to be hooked in certain situations during component initialization\n\n### 4.21.0\n * FEATURE - Added support for additional control over spam handling/translation delays to improve support for offline translators\n * BUG FIX - Properly handle shutdown of ExtProtocolEndpoints\n * BUG FIX - Fixed PapagoTranslate\n * BUG FIX - Fixed an issue related to cleanup of web resources applicable to certain runtimes\n * MISC - Reorganization of code in relation to soon-to-be merging of IL2CPP branch with master\n\n### 4.20.1\n * MISC - Performance improvements for IMGUI translations\n\n### 4.20.0\n * FEATURE - Added TMP_Overflow and TMP_Alignment resize commands\n\n### 4.19.0\n * FEATURE - Added RegexPostProcessing configuration option\n * BUG FIX - Fixed bug related to reload translations after changing screen size\n\n### 4.18.1\n * BUG FIX - Fixed an unhandled exception that could occur during hook callbacks\n\n### 4.18.0\n * FEATURE - Improved AutoResize command to enable min/max font size control\n * FEATURE - Added translation file directive allowing control of tranlations/resizing based on resolution size\n * FEATURE - Added new '_Postprocessors.txt' file that can make substitutions to the text returned from the translation endpoint\n * MISC - Changed default value of EnableTranslationScoping to True\n * BUG FIX - Fixed bug where GoogleTranslate could no longer be properly selected a translate endpoint\n\n### 4.17.0\n * FEATURE - Additional public APIs in relation to SimpleTextTranslationCache\n * CHANGE - Default endpoint changed to GoogleTranslateV2\n * MISC - Improved error logging in GoogleTranslate\n\n### 4.16.3\n * MISC - Make \"MaxConcurrency\" property in HttpEndpoint and WwwEndpoint virtual\n * BUG FIX - Fixed bug that caused exception spam if no endpoint were selected\n\n### 4.16.2\n * BUG FIX - DeepLLegitimate no longer selectable if no API key has been configured\n\n### 4.16.1\n * MISC - Allow free developer API to be used with DeepL\n * BUG FIX - Fixed bug that would often incorrectly cache parsed translations and made the feature optional\n * BUG FIX - Fixed bug that would cause token translations not to be read correctly in certain situations\n\n### 4.16.0\n * BREAKING CHANGE - Changed load order of translation files in Text directory. Zip files are now lowest priority and files inside zip files are also prioritized alphabetically. Now reflects the same behaviour as redirected resources.\n * BREAKING CHANGE - Changes to IMGUI handling of numbers. This may cause previous translations to break\n * FEATURE - UI to control fallback endpoint\n * MISC - Caching of result of \"sr\" regexes, allowing it to be used for IMGUI and potentially increasing performance for scenarios where the same text is being translated through a regex all the tim\n * MISC - New configuration \"TemplateAllNumbersAway\", that will ensure all numbers are templated away before being send to translator/being stored in translation file\n * MISC - New configuration \"ReloadTranslationsOnFileChange\", that will automatically reload files when a translation file changes\n * MISC - Publication of various minor APIs related to resource redirection\n\n### 4.15.0\n * FEATURE - Added DeepL support\n * FEATURE - New setting for automated fallback translation endpoint\n * FEATURE - Extensions to ITranslateEndpoint interface allowing handling of contextual translation information\n * MISC - Added HTML Entity decoding during postprocessing (enabled by default if configuration is reset)\n * BUG FIX - Fixed issue related to newline handling\n * BUG FIX - Fixed issue that could cause text not to be displayed in older versions of Unity\n * BUG FIX - Fixed issue that could cause out-of-process hosted translation endpoints to fail in certain situations\n * BUG FIX - Fixed issue where out-of-process translation endpoints would sometimes get shutdown before the game\n * BUG FIX - Fixed issue where redirected resources were not always identified as such during standard translations\n * BUG FIX - Fixed issue that could cause web requests timeout after a long period rather than fail immediately in certain situations\n * BUG FIX - Fixed issue with GoogleTranslateV2 that could cause it to fail if untranslated texts included certain characters\n\n### 4.14.0\n * FEATURE - New version of GoogleTranslate endpoint that supports new API. May replace replace old GoogleTranslate endpoint in the future\n * MISC - Made more log statements affected by silent mode\n * MISC - Changed behaviour of the copy to clipboard feature. Now it will always copy to clipboard when text is being translated on a text component\n * MISC - Support for older versions of UTAGE\n * MISC - Fixed some log statements to no longer indicate error in case an error did not occur during hooking\n * MISC - Updated user agents for API requests\n * MISC - Improved SpriteRenderer support\n * BUG FIX - Fixed a bug that could cause crash in older versions of the Unity Engine\n * BUG FIX - Fixed a bug that could occur during dynamic code generation in certain situations\n\n### 4.13.0\n * FEATURE - API that allows external plugins to take some degree of control of how a game is translated\n * FEATURE - Can now output text that exceeds the maximum length if configured through 'OutputTooLongText'\n * MISC - Increased max value of 'MaxCharactersPerTranslation' from 1000 to 2500\n * MISC - Allow fallback to reflection when dynamic code generation fails\n * BUG FIX - A new option that controls and attempts to prevent potential double translations of redirected resources\n * BUG FIX - Bug in manual plugin translations in relation to unity combo boxes\n * BUG FIX - Bug in the translation aggregator where the default translation would always be copied\n * BUG FIX - Fixed bug that caused traditional chinese not to be usable with Baidu\n * BUG FIX - Fixed bug that ignored the delay configuration in the BaiduTranslate implementation\n * BUG FIX - Fixed bug that caused language detection not to be usable with Bing\n\n### 4.12.1\n * MISC - Option to enable Harmony detour bridge (enabled by default for ReiPatcher setup if SRE is not supported)\n * MISC - Improved ForceUIResizing implementation\n * MISC - Some performance improvements during text component compatibility checks\n * BUG FIX - Disabled hooking of SpriteRenderer unless the hooking config is enabled\n * BUG FIX - Fixed PapagoTranslate API - Thanks to hype5 on Github\n\n### 4.12.0\n * FEATURE - Specialized plugin translation support. Can now read text translation files that are only used for specific plugins\n * FEATURE - Proper IMGUI support in Unity 2018 and 2019+\n * MISC - Changed guidance on IMGUI redistribution\n * MISC - Changed the way output text is determined when multiple text parsers are involved in the translation (now priority based rather than first come first serve)\n * MISC - Removed feature listening to text changed event from external translation plugins\n\n### 4.11.4\n * MISC - Allow using separate service endpoint for google. Use to circumvent GFWoC\n * BUG FIX - Fix bug with scene scan that could sometimes fail in certain versions of Unity\n\n### 4.11.3\n * MISC - Added API to control the scope when performing programmatic translations\n * BUG FIX - Fixed a bug where BaiduTranslate could not be used properly with japanese (and various other languages). Now supported through 'ja'.\n\n### 4.11.2\n * MISC - Add toggle to enable/disable translation aggregator UI\n * MISC - Enable copy translations / original text to clipboard from translation aggregator UI\n * MISC - Enable \"auto\" source language for google, bing and papago translate\n * BUG FIX - Fixed some startup errors that occurred while initializing the plugin if the Resource Redirector was not present\n\n### 4.11.1\n * MISC - Added support for named and optional groups in splitter and standard regexes\n * BUG FIX - Fixed bug in NGUI hooks that could cause a bunch of NullReferenceExceptions\n\n### 4.11.0\n * FEATURE - Enabled text parsing recursion. Disabled by default\n * FEATURE - Support for FairyGUI\n * MISC - New setting to toggle handling of rich text\n * MISC - Removed strict text length restriction on IMGUI translations\n * MISC - General performance improvements\n * MISC - API improvements for TextAsset resource redirection handling - Thanks to GeBo1 on Github\n * MISC - Additional API surface to check if SimpleTextTranslationCache is empty\n * BUG FIX - Fixed bug where translations could not be loaded if they included only whitespace\n * BUG FIX - Fixed bug where the plugin could cause an internal exception if found text included only whitespace\n\n### 4.10.0\n * FEATURE - Native ezTransXP support through Ehnd - Thanks to Jiwon-Park on Github\n * MISC - Improved linux support. Plugin should now function as expected when used with BepInEx 5.x on linux (resource redirection may still have problems with case-sensitivity and path separators). Other installation methods may not yield similar results\n * MISC - Fixed .zip release files so they use correct directory separators\n\n### 4.9.0\n * FEATURE - API to support easier manual translations of TextAsset resources\n * FEATURE - Support for not loading every translated image into memory permanently, but instead loading them on demand (new configuration option)\n * FEATURE - Better support for variations of Chinese as output language. 'zh-CN', 'zh-TW', 'zh-Hans', 'zh-Hant', 'zh' can now all be used by all translators if supported\n * FEATURE - Better support for variations of Chinese as input language. Plugin wont complain if 'zh-Hans', 'zh-Hant' or 'zh' is used\n * MISC - Support for older versions of UTAGE\n * MISC - New option that enables ignoring rules for calling virtual methods when setting the text of a text component: 'IgnoreVirtualTextSetterCallingRules'\n * MISC - Updated version of MonoMod distributed with the plugin\n * BUG FIX - Potential errors caused by using weak references incorrectly causing a race condition\n * BUG FIX - Potential error during initialization if Resource Redirector is not present\n\n### 4.8.3\n * MISC - Added support for ShimejiEngine.dll\n * BUG FIX - Fixed a NullReferenceException that could cause the plugin to stop working\n\n### 4.8.2\n * MISC - Bundle Harmony 2.0-beta (custom build) with UnityInjector package instead of 1.2.0.1 to be more compatible with i18nEx\n * BUG FIX - Fixed bug that could cause out-of-process requests to stop working in certain situations\n * BUG FIX - Fixed a \"performance\" bug in TextMesh hooks\n\n### 4.8.1\n * MISC - Experimental Google! Translate compatibility endpoint that services requests out-of-process\n * MISC - Updated default user agents\n * MISC - Minor changes to Google! translate TKK timing logic\n * MISC - Allow translation of placeholder text with UGUI and TextMesh Pro texts\n * BUG FIX - Disallow outputting of IMGUI templated texts that are not considered translatable\n\n### 4.8.0\n * FEATURE - Changed the way TextMesh Pro fonts can be changed. Fonts can now be loaded through external asset bundles\n * CHANGE - Removed BepInEx 4.x package to remove confusion about which package to download\n * BUG FIX - Fixed a bug that could cause a crash in Unity games using a very old version of the engine\n * BUG FIX - Fixed a bug where substitutions could sometimes cause texts not to be translated\n * BUG FIX - Fixed a bug that could cause redirected resources not to be loaded if dumping was enabled\n\n### 4.7.1\n * BUG FIX - Development-time fix to the nuget package\n * BUG FIX - The 'Translators' directory must now be placed in the same directory that the XUnity.AutoTranslator.Plugin.Core.dll is placed in. This allows moving around the plugin as you see fit in BepInEx 5.0. For the ReiPatcher installer, the Translators are now found in the Managed directory of the game. For UnityInjector the Translators directory has been moved out of the Config directory\n * BUG FIX - Minor bug fix where in some cases the plugin could not create the initial translation files on startup\n\n### 4.7.0\n * FEATURE - Text preprocessors that allows applying text replacements before a text is sent for translation\n * MISC - Changed a lot of logging levels and changed SilentMode to default to true\n\n### 4.6.4\n * BUG FIX - Fixed bug where the OutputFile was not always loaded with lowest priority during initialization\n * BUG FIX - Fixed a bug where redirected resources could not be located under certain circumstances (again)\n\n### 4.6.3\n * MISC - Disable all translator endpoints if output language is the same as the source language\n\n### 4.6.2\n * BUG FIX - Fixed a bug where redirected resources could not be located under certain circumstances\n * BUG FIX - Added throttling logic to Baidu translate to ensure the plugin never exceeds one query per second\n\n### 4.6.1\n * BUG FIX - Fixed a bug where in some situations a line may be sent for translation twice due to whitespace differences\n\n### 4.6.0\n * FEATURE - Support for ZIP files in redirected resource directory\n * BUG FIX - Fixed bug where you somtimes had to close dialogues before translations would appear\n * BUG FIX - Fixed bug where plugin would not function if a game is launched through a custom launcher not located in the game directory\n * MISC - Automatically enable texture translations if a texture directory is present during initial startup\n\n### 4.5.1\n * MISC - Improved ZIP archive performance (probably)\n * MISC - Disabled HTTPS certificate checks by default for all runtimes because default value generation was incorrect\n * MISC - Added built-in 'Passthrough' endpoint that does not perform any translations, but allows dumping texts and process texts through substitutions, etc.\n * MISC - Increased max value of 'MaxCharactersPerTranslation' from 500 to 1000\n\n### 4.5.0\n * CHANGE - Warning! All default directory paths have been changed in new configuration files\n * FEATURE - {Lang} / {lang} parameter can now be used in any path specified in the configuration file. This will allow more clean seperation between translations to different languages without needing to modify/move any files\n * FEATURE - Support ZIP files for translation, resize and texture files\n * MISC - Reduced number of static translations significantly\n\n### 4.4.0\n * FEATURE - Allow translation of any found texts. Whether or not text considered to be untranslatable should be output is controlled through configuration\n * BUG FIX - Fixed a bug in the 'ReiPatcher' standalone installer that caused installation to fail on Windows 7 and below\n * MISC - Reduced batch error re-enable cooldown from 240 seconds to 60 seconds\n\n### 4.3.1\n * BUG FIX - Fixed rich text handling bug introduced in 4.3.0\n\n### 4.3.0\n * FEATURE - Added UI resize functionality that enables resizing the font size and more of translated text components manually\n * MISC - Obsoleted AssetLoadedHandlerBase<T>.IsDumpingEnabled. Replaced with AutoTranslatorSettings.IsDumpingRedirectedResourcesEnabled\n\n### 4.2.0\n * CHANGE - Changed how splitting regexes are configured to supports scopes + more.\n\n### 4.1.0\n * FEATURE - Added new concept that allows splitting texts to be translated with a regex before trying to translate them\n * MISC - Improved NGUI text resizing behaviour\n\n### 4.0.1\n * MISC - Added option to convert japanese wide-width numerics to standard ASCII numerics during translation postprocessing\n\n### 4.0.0\n * BREAKING CHANGE - Restructuring of internal and some public APIs - ITranslateEndpoint API not affected\n * BREAKING CHANGE - Changed file layout in Translators directory - should replace folder entirely upon upgrade to avoid redundant files that may be picked up unintentionally by mod loaders\n * FEATURE - Resource Redirection API\n * FEATURE - Support for redirecting translation processing to an external process\n * MISC - Updated distributed MonoMod version\n\n### 3.8.1\n * BUG FIX - Minor bug in relation to harmony initialization\n * BUG FIX - Fixed bug in MonoMod hooking that would cause it to always use native hooks over managed hooks\n * BUG FIX - Fixed bug in 'EnableLegacyTextureLoading' which should now work consistently\n * MISC - Option to enable/disable success translation logs through option 'EnableSilentMode'\n * MISC - IMGUI window black listing option\n\n### 3.8.0\n * FEATURE - Support 'TARC' directives '#set exe', '#unset exe', '#set level' and '#unset level'. Must be explicitly enabled through config option 'EnableTranslationScoping=True'\n * CHANGE - Completely reworked whitespace handling to better support manual translations (still backwards compatible)\n * BUG FIX - Fixed bug in 'TextGetterCompatibilityMode'\n * BUG FIX - Corrected whitespace handling when constructing alternate translation-pairs for languages requiring whitespace\n * MISC - Removed 'Delay' config option due to feature bloat\n * MISC - Removed 'WhitespaceRemovalStrategy' config option due to feature bloat\n * MISC - Changed default value of 'CacheWhitespaceDifferences' from True to False\n\n### 3.7.0\n * FEATURE - Support for hooking 3D TextMesh (disabled by default)\n * FEATURE - Public API surface to query the plugin for translations\n * CHANGE - Replaced 'Experimental' hooks with MonoMod hooks, which are now always enabled in supported environments\n * MISC - Allow external plugins to pass in unknown components when overriding hooks\n * BUG FIX - Fixed bug in relation to rich text handling in Translation Aggregator-view\n\n### 3.6.2\n * BUG FIX - Fixed a bug with escape/unescape logic in translation text files\n * BUG FIX - Plugin now loads all translations provided in the translation text files - even if they are not considered a candidate for machine translation\n * BUG FIX - Fixed a bug where reloading or toggling the translations would not always show the correct text\n * BUG FIX - Fixed a bug where substitution file was being loaded twice - this should have no actual effect though\n * MISC - Improved rich text handling logic\n * MISC - Support generating partial translations through config option `GeneratePartialTranslations`\n * MISC - Support for overriding TextMeshPro fonts through config options `OverrideFontTextMeshPro`, though this requires the game to be build with the specified resource\n * MISC - Support for generating partial translations to better support text that is scrolling in\n * MISC - Support for for older versions of the Unity engine (tested down to 4.5)\n * MISC - Updated Bing API plugin to new API version\n\n### 3.6.1\n * BUG FIX - Substitution would sometimes causes some translations not to be shown the first time around\n * BUG FIX - In the Translation Aggregator-view, sometimes texts would not be translated because the original text could not found\n * MISC - Option to only let the plugin generate translations without variables (GenerateStaticSubstitutionTranslations)\n\n### 3.6.0\n * FEATURE - 'Translation Aggregator'-like view that enables viewing translations for displayed texts from multiple different translators (press ALT+1)\n * FEATURE - Substitution support. Enable dictionary lookup for strings (usually proper nouns) embedded in text to replace them with a manual translation\n * FEATURE - Papago translator support\n * MISC - Removed hard dependency on UnityEngine.UI to support older versions of the Unity engine\n * MISC - Automatically initialize LEC installation path if installed when creating configuration file\n * MISC - Automatically enable experimental hooks when installed in single mod scenario (ReiPatcher) and it is required by the runtime\n * BUG FIX - Fixed bug where LEC was not working when run in a .NET 4.x equivalent runtime\n\n### 3.5.0\n * FEATURE - Harmony 2.0-prerelease support (in order to support BepInEx 5.0.0-RC1)\n * BUG FIX - Fixed a bug where the plugin would sometimes dump textures if 'DetectDuplicateTextureNames' was turned on, even though 'EnableTextureDumping' was turned off\n * BUG FIX - Correct whitespace handling of source languages requiring whitelines between words\n\n### 3.4.0\n * FEATURE - Added capability of plugin to detect textures that shares the same resource name and identify these resources in an alternative way\n * BUG FIX - Fixed an issue with TextMeshPro that could cause text to glitch in certain situations\n\n### 3.3.1\n * MISC - Options to cache results of regex lookups and whitespace differences\n * BUG FIX - Fixed 'WhitespaceRemovalStrategy.TrimPerNewline' which was broken to remove all non-repeating whitespace, rather than only the non-repeating whitespace surrounding newlines\n * BUG FIX - Fully clear translations before reloading (ALT+R)\n\n### 3.3.0\n * FEATURE - Support 'TARC' regex formatting in translation files\n * FEATURE - Much improved handling of whitespace and newlines. Option 'TrimAllText' removed and options for 'WhitespaceRemovalStrategy' changed\n * BUG FIX - Allow hooking of text with components named 'Dummy'\n\n### 3.2.0\n * FEATURE - BepInEx 5.x plugin support\n * CHANGE - Restructured large portions of the internal code to support more features going forward\n * BUG FIX - Interacting with UI now blocks input to game\n * BUG FIX - Better handling of error'ed translations in relation to rich text\n * BUG FIX - Minor fixes to 'copy to clipboard' to disable IMGUI spam\n * BUG FIX - Fixed potential NullReferenceException in GoogleTranslate and BingTranslate during timeout errors\n * MISC - Removed 'Dump Untranslated Texts' hotkey due to feature bloat\n * MISC - Allow unselecting translation endpoint in UI\n * MISC - Increased request timeout from 50 to 150 seconds to ensure better error logging of failed requests\n\n### 3.1.0\n * FEATURE - Support for games with 'netstandard2.0' API surface through config option 'EnableExperimentalHooks'\n * BUG FIX - Bug fixes and improvements to Utage hooking implementation - EnableUtage config option also removed (always on now)\n * BUG FIX - Rich text parser bug fixes when only a single tag with no ending was used\n * BUG FIX - Fixed potential NullReferenceException in TextGetterCompatibilityMode\n * BUG FIX - Load translator assemblies even if a '#' is present in file path\n * MISC - Determine whether to disable certificate checks at config initialization based on scripting backend and unity version\n\n### 3.0.2\n * BUG FIX - UnityInjector installer package now uses correct folder structure (Translators has been moved into Config folder) and ExIni is no longer distributed\n * BUG FIX - Fixed harmony priority usage, which was incorrectly used in 3.0.1\n * MISC - Plugin should no longer translate text input fields for NGUI\n * MISC - Added config option to 'DisableCertificateValidation' for all hosts under all circumstances in case the plugin locks up. This option is only required by very few games\n * MISC - Experimental hooking support for methods with no body (configured through 'EnableExperimentalHooks' setting)\n * MISC - Restructured README file. New order: 1. Installation, 2. Usage, 3. Configuration, 4. Integration \n\n### 3.0.1\n * BUG FIX - Fixed bug that could in certain situation cause IMGUI translation to drain on performance\n * BUG FIX - Never close a service point while a request is ongoing. Previously this could cause the plugin to lockup\n * BUG FIX - Only disable certificate checks if the .NET version is at or below 3.5\n * BUG FIX - Improved cleanup of object references\n * BUG FIX - Improved 'text stagger' check. Sometimes the plugin was identifying text as scrolling in, even though it was not\n * MISC - Proper test and support for .NET 4.x equivalent scripting backend for Unity\n * MISC - Timeout handling if an endpoint becomes unresponsive\n * MISC - Support post processing for normal text translations\n * MISC - Change harmony text hook priority to 'Last' instead of simply be executed 'after DTL'\n * MISC - More resilient harmony hook implementation to support potentially different versions of harmony being used\n * MISC - Updated harmony version deployed with the plugin (for IPA, ReiPatcher and UnityInjector), so it is no longer the homebrew version that was distributed with BepInEx\n * MISC - Made UI more readable by using a solid background\n * MISC - Changed max queued translations from 3500 to 4000\n\n### 3.0.0\n * FEATURE - UI to control plugin more conveniently (press ALT + 0 (that's a zero))\n * FEATURE - Dynamic selection of translator during game session\n * FEATURE - Support BingTranslate API\n * FEATURE - Support LEC Offline Power Translator 15\n * FEATURE - Enable custom implementations of translators\n * FEATURE - Removed support for Excite translate because it only support the 'WWW' API in Unity due to missing Tls1.2 support\n * FEATURE - Updated Watson translate to v3\n * FEATURE - Support for 'romaji' as output language. Only google supports this at the moment\n * FEATURE - Batching support for all endpoints where the API supports it\n * BUG FIX - Too many small fixes to mention\n * MISC - {GameExeName} variable can now be used in configuration of directories and files\n * MISC - Changed the way the 'Custom' endpoint works. See README for more info\n * MISC - Added new configuration 'GameLogTextPaths' to enable special handling of text components that text is being appended to continuously (requires export knowledge to setup)\n\n### 2.18.0\n * FEATURE - Text Getter Compatibility Mode. Fools the game into thinking that it is not actually translated\n * FEATURE - Textures - Live2D component support\n * FEATURE - Textures - SpriteRenderer component support\n * FEATURE - Hotkey to reboot plugin in certain situations\n * BUG FIX - No longer trim translated text (if configured) when loading translation files\n * MISC - Support legacy OnLevelWasLoaded\n * MISC - Avoid harmless 'log errors' in relation to texture translation\n * MISC - Set max value of MaxCharactersPerTranslation to 500\n * MISC - Documentation update to describe 'Behaviour' configuration section\n * MISC - Removed \"FromImageNameThenData\" as hash source on textures\n * MISC - Added \"FromImageNameAndScene\" as hash source on textures\n * MISC - Inline comment handling when using '//' to indicate a comment\n * MISC - Improved default configuration for Utage-related games to improve translation when newlines are involved\n\n### 2.17.0\n * FEATURE - Support legitimate Bing translate API (requires key)\n * FEATURE - Documented custom endpoint\n * BUG FIX - Fixed bug in older versions of the Unity engine where the plugin would crash on startup due to missing APIs in relation to the SceneManagement namespace\n * BUG FIX - Fixed bug that could happen in Utage-based games, that would cause dialogue to sometimes be cut off mid-sentence\n * BUG FIX - Incorrect handling of 'null' default values in configuration\n * BUG FIX - Various other minor fixes\n * MISC - Added configuration option to support ignoring texts starting with certain characters, IgnoreTextStartingWith\n * MISC - Template reparation for IMGUI translations\n * MISC - Big update to README file to fully describe the features of the plugin\n\n### 2.16.0\n * FEATURE - Support image dumping and loading (not automatic!). Disabled by default\n * BUG FIX - Fixed toggle translation which was broken in 2.15.4\n * BUG FIX - Updated TKK retrieval logic\n * MISC - Removed Jurassic dependency as it is no longer required\n\n### 2.15.4\n * MISC - Added configuration option to apply 'UI resize behaviour' to all components regardless of them being translated: ForceUIResizing\n * MISC - Added configuration option to change line spacing for UGUI within the 'UI resize behaviour': ResizeUILineSpacingScale\n\n### 2.15.3\n * BUG FIX - Potential crash during startup where potentially 'illegal' property was being read.\n * MISC - Support 'scrolling text' for immediate components such as IMGUI. Previously such behaviour would shut down the plugin.\n * MISC - Changed behaviour of font overriding. All found Text instances will now have their fonts changed.\n\n### 2.15.2\n * BUG FIX - Fixed bug that could cause hooking not to work when hooks were overriden by external plugin\n\n### 2.15.1\n * BUG FIX - Updated TKK retrieval logic. Improved error message if it cannot be retrieved.\n\n### 2.15.0\n * FEATURE - Manual hooking - press ALT + U. This will lookup all game objects and attempt translation immediately\n * FEATURE - Capability for other plugins to tell the Auto Translator not to translate texts\n * BUG FIX - Initialization hooking that will attempt to hook any game object that was missed during game initialization\n * BUG FIX - Minor fixes to handling of rich text to better support tags that should be ignored, such as ruby, group\n * MISC - Generally better hooking capabilities\n\n### 2.14.1\n * BUG FIX - Never allow text to be queued for translation before stabilization check for rich text \n * MISC - Improved a spam detection check\n\n### 2.14.0\n * FEATURE - Dramatically improved the text hooking capability for NGUI to much better handle static elements\n\n### 2.13.1\n * BUG FIX - Minor bug fix in rich text parser\n * MISC - Enable Rich Text for TextMeshPro\n * MISC - Improved whitespace handling with additional configuration option\n\n### 2.13.0\n * FEATURE - Support for older Unity Engine versions\n * BUG FIX - Respect BepInEx logger config over own config\n * BUG FIX - Fix exception that could occur in relation to NGUI\n * MISC - Less leniency in what constitutes an error when translating\n\n### 2.12.0\n * FEATURE - General support for rich text in relation to UGUI and Utage\n * FEATURE - Experimental support for custom fonts for UGUI\n * CHANGE - Support only source languages with predefined character checks - for now (ja, zh-CN, zh-TW, ru, ko, en)\n * CHANGE - Slightly different translation load priority from files\n * BUG FIX - Dramatically improved resize behaviour for NGUI\n * BUG FIX - Fixed a bug where hook overrides would not always be honored depending on mod load order\n * MISC - 3 additional spam prevention checks\n * MISC - Uses BepInLogger for BepInEx implementation (requires 4.0.0+)\n * MISC - Redirect \"GoogleTranslateHack\" to \"GoogleTranslate\" because instructions were being distributed to use this, and it is not very friendly towards their APIs\n\n### 2.11.0\n * FEATURE - Support for legitimate Google Cloud Translate API (requires key)\n * BUG FIX - Fixed situations where a text would not be translated on a component if a operation is ongoing on the component\n * BUG FIX - Less delay on translation in certain situations\n * MISC - Plugin seeded with ~10000 manually translated texts for commonly used translations to avoid hitting the configured endpoint too much (enable or disable with \"UseStaticTranslations\")\n   * Only applies when configured for Japanese to English (default)\n\n### 2.10.1\n * BUG FIX - Fix to prevent text overflow for large component for UGUI\n\n### 2.10.0\n * FEATURE - Support Yandex translate (requires key)\n * FEATURE - Support Watson translate (requires key)\n * FEATURE - Batching support for selected endpoints (makes translations much faster and requires lesser request)\n * FEATURE - Experimental Utage support\n * BUG FIX - Fixed minor bug during reading of text translation cache\n * BUG FIX - Now escapes the '='-sign in the translation file, so texts containing this character can be translated\n * BUG FIX - Fixed kana check when testing if a text is a candidate for translation\n * MISC - No longer creating a new thread for each translation\n * MISC - Proactive closing of unused TCP connections\n * CONFIG - TrimAllText, to indicate whether whitespace in front of and behind translation candidates should be removed\n * CONFIG - EnableBatching, to indicate whether batching should be enabled for supported endpoints\n * CONFIG - EnableUIResizing, to indicate whether the plugin should make a \"best attempt\" at resizing the UI upon translation. Current only work for NGUI\n\n### 2.9.1\n * MISC - Added automatic configuration migration support\n   * Versions of this plugin were being distributed with predefined configuration to target \"GoogleTranslateHack\". The first time the plugin is run under this version, it will change this value back to the default.\n\n### 2.9.0\n * FEATURE - Installation as UnityInjector plugin\n * FEATURE - Support Excite translate\n * MISC - Better debugging capabilities with extra config options\n\n### 2.8.0\n * CHANGE - Whether SSL is enabled or not is now entirely based on chosen endpoint support\n * FEATURE - Support for IMGUI translation texts with numbers\n * FEATURE - Support for overwriting IMGUI hook events\n * BUG FIX - Improved fix for gtrans (23.07.2018) by supporting persistent HTTP connections and cookies and recalculation of TKK and SSL\n * BUG FIX - Fixed whitespace handling to honor configuration more appropriately\n * BUG FIX - User-interaction (hotkeys) now works when in shutdown mode\n * MISC - Prints out to console errors that occurrs during translation\n * MISC - IMGUI is still disabled by default. Often other mods UI are implemented in IMGUI. Enabling it will allow those UIs to be translated as well. \n   * Simply change the config, such that: EnableIMGUI=True\n\n### 2.7.0\n * FEATURE - Additional installation instructions for standalone installation through ReiPatcher\n * BUG FIX - Fixed a bug with NGUI that caused those texts not to be translated\n * BUG FIX - Improved fix for gtrans (23.07.2018)\n\n### 2.6.0\n * FEATURE - Support for newer versions of unity engine (those including UnityEngine.CoreModule, etc. in Managed folder)\n * BUG FIX - Fix for current issue with gtrans (23.07.2018)\n * BUG FIX - Keeps functioning if web services fails, but no requests will be sent in such scenario. Texts will simply be translated from cache\n * BUG FIX - Changed hooking, such that if text framework fails, the others wont also fail\n * MISC - Concurrency now based on which type of endpoint. For gtrans it is set to 1\n * MISC - Bit more leniency in translation queue spam detection to prevent shutdown of plugin under normal circumstances\n\n### 2.5.0\n * FEATURE Copy to clipboard feature\n * BUG FIX - Various new rate limiting patterns to prevent spam to configured translate endpoint\n\n### 2.4.1\n * BUG FIX - Disabled IMGUI hook due to bug\n\n### 2.4.0\n * CHANGE - Completely reworked configuration for more organization\n * FEATURE - Added support for BaiduTranslate. User must provide AppId/AppSecret for API . Use \"BaiduTranslate\" as endpoint\n * FEATURE - Force splitting translated texts into newlines, if configured\n * BUG FIX - Fixed broken feature that allowed disabling the online Endpoint\n * BUG FIX - Eliminated potential concurrency issues that could cause a translated string to be retranslated.\n * BUG FIX - Better support for other 'from' languages than japanese, as the japanese symbol check has been replaced with a more generic one\n * BUG FIX - Fixed a bug where hot key actions (toggle translation, etc.) would often fail\n * BUG FIX - Multiline translations now partially supported. However, all texts considered dialogue will still be translated as a single line\n * BUG FIX - More leniency in allowing text formats (in translation files) to be included as translations\n\n### 2.3.1\n * BUG FIX - Fixed bug that caused the application to quit if any hooks were overriden.\n\n### 2.3.0\n * FEATURE - Allow usage of SSL\n * BUG FIX - Better dialogue caching handling. Often a dialogue might get translated multiple times because of small differences in the source text in regards to whitespace.\n\n### 2.2.0\n * MISC - Added anti-spam safeguards to web requests that are sent. What it means: The plugin will no longer be able to attempt to translate a text it already considers translated.\n * MISC - Changed internal programmatic HTTP service provider from .NET WebClient to Unity WWW.\n\n### 2.1.0\n * FEATURE - Added configuration options to control which text frameworks to translate\n * FEATURE - Added integration feature that allows other translation plugins to use this plugin as a fallback\n * BUG FIX - Fixed a bug that could cause a StackOverflowException in unfortunate scenarios, if other mods interfered.\n * BUG FIX - MUCH improved dialogue handling. Translations for dialogues should be significantly better than 2.0.1\n\n### 2.0.1\n * BUG FIX - Changed configuration path so to not conflict with the configuration files that other mods uses, as it does not use the shared configuration system. The previous version could override configuration from other mods.\n * MISC - General performance improvements.\n\n### 2.0.0\n * Initial release\n"
        },
        {
          "name": "Directory.Build.props",
          "type": "blob",
          "size": 1.5966796875,
          "content": "﻿<Project>\n\t<!-- Use these properties to change version numbers globally -->\n\t<PropertyGroup>\n\t\t<!-- Plugin version -->\n\t\t<Version>5.4.3</Version>\n\t\t<!-- XUnity.Common version -->\n\t\t<VersionCommon>1.0.3</VersionCommon>\n\t\t<!-- XUnity.AutoTranslator.Plugin.ExtProtocol version -->\n\t\t<VersionExtProtocol>1.0.1</VersionExtProtocol>\n\t\t<!-- XUnity.ResourceRedirector version -->\n\t\t<VersionRedirector>2.1.0</VersionRedirector>\n\t</PropertyGroup>\n\n\t<PropertyGroup>\n\t\t<Authors>gravydevsupreme, Bepis, others at https://github.com/bbepis/XUnity.AutoTranslator</Authors>\n\t\t<Copyright>Copyright © 2018 / MIT License</Copyright>\n\t\t<PackageReleaseNotes>https://github.com/bbepis/XUnity.AutoTranslator/blob/master/CHANGELOG.md</PackageReleaseNotes>\n\t\t<PackageProjectUrl>https://github.com/bbepis/XUnity.AutoTranslator</PackageProjectUrl>\n\t\t<PackageLicenseExpression>MIT</PackageLicenseExpression>\n\t\t<PackageTags>unity;xunity</PackageTags>\n\t</PropertyGroup>\n\n\t<Target Name=\"AddGeneratedFile\" BeforeTargets=\"BeforeCompile;CoreCompile\" Inputs=\"$(MSBuildAllProjects)\" Outputs=\"$(IntermediateOutputPath)GeneratedFile.cs\">\n\t\t<PropertyGroup>\n\t\t\t<GeneratedText><![CDATA[namespace $(RootNamespace) { internal static class GeneratedInfo { public const string PROJECT_VERSION = \"$(Version)\"%3B } }]]></GeneratedText>\n\t\t\t<GeneratedFilePath>$(IntermediateOutputPath)GeneratedInfo.cs</GeneratedFilePath>\n\t\t</PropertyGroup>\n\t\t<ItemGroup>\n\t\t\t<Compile Include=\"$(GeneratedFilePath)\" />\n\t\t\t<FileWrites Include=\"$(GeneratedFilePath)\" />\n\t\t</ItemGroup>\n\t\t<WriteLinesToFile Lines=\"$(GeneratedText)\" File=\"$(GeneratedFilePath)\" Overwrite=\"true\" />\n\t</Target>\n</Project>\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.037109375,
          "content": "MIT License\n\nCopyright (c) 2018 Bepis\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 149.958984375,
          "content": "﻿# XUnity Auto Translator\n\n## Index\n * [Introduction](#introduction)\n * [Plugin Frameworks](#plugin-frameworks)\n * [Installation](#installation)\n * [Key Mapping](#key-mapping)\n * [Translators](#translators)\n * [Text Frameworks](#text-frameworks)\n * [Configuration](#configuration)\n * [IL2CPP Support](#il2cpp-support)\n * [Frequently Asked Questions](#frequently-asked-questions)\n * [Translating Mods](#translating-mods)\n * [Manual Translations](#manual-translations)\n * [Regarding Redistribution](#regarding-redistribution)\n * [Texture Translation](#texture-translation)\n * [Integrating with Auto Translator](#integrating-with-auto-translator)\n * [Implementing a Translator](#implementing-a-translator)\n * [Implementing a Resource Redirector](#implementing-a-resource-redirector)\n \n## Introduction\nThis is an advanced translator plugin that can be used to translate Unity-based games automatically and also provides the tools required to translate games manually.\n\nIt does (obviously) go to the internet, in order to provide the automated translation, so if you are not comfortable with that, don't use it.\n\nIf you intend on redistributing this plugin as part of a translation suite for a game, please read [this section](#regarding-redistribution) and the section regarding [manual translations](#manual-translations) so you understand how the plugin operates.\n\n## Plugin Frameworks\nThe mod can be installed without any external dependencies or as a plugin to the following Plugin Managers/Mod Loaders:\n * [BepInEx](https://github.com/bbepis/BepInEx) (recommended)\n * [MelonLoader](https://melonwiki.xyz)\n * [IPA](https://github.com/Eusth/IPA)\n * UnityInjector\n\nInstallation instructions for all methods can be found below.\n\n## Installation\nThe plugin can be installed in following ways:\n\n### Standalone Installation (ReiPatcher)\nREQUIRES: Nothing, ReiPatcher is provided by this download.\n\n*VERY IMPORTANT NOTE: Using this method is a certain way to get the plugin working in most Unity games with two simple clicks. Do note that if one of the supported Plugin Managers is used, this installation method should be avoided as it will cause problems.*\n\n 0. Read the `VERY IMPORTANT NOTE` above.\n 1. Download XUnity.AutoTranslator-ReiPatcher-{VERSION}.zip from [releases](../../releases).\n 2. Extract directly into the game directory, such that \"SetupReiPatcherAndAutoTranslator.exe\" is placed alongside other exe files.\n 3. Execute \"SetupReiPatcherAndAutoTranslator.exe\". This will setup up ReiPatcher correctly.\n 4. Execute the shortcut {GameExeName} (Patch and Run).lnk that was created besides existing executables. This will patch and launch the game.\n 5. From now on you can launch the game from the {GameExeName}.exe instead.\n 6. Due to various considerations, not all text hooks are enabled by default, so if you find that the game or parts of the game are not being properly translated it may be worth going into the configuration file and enable some of the disabled text frameworks! The configuration file is created when the game is launched.\n\nThe file structure should like like this\n```\n{GameDirectory}/ReiPatcher/Patches/XUnity.AutoTranslator.Patcher.dll\n{GameDirectory}/ReiPatcher/ExIni.dll\n{GameDirectory}/ReiPatcher/Mono.Cecil.dll\n{GameDirectory}/ReiPatcher/Mono.Cecil.Inject.dll\n{GameDirectory}/ReiPatcher/Mono.Cecil.Mdb.dll\n{GameDirectory}/ReiPatcher/Mono.Cecil.Pdb.dll\n{GameDirectory}/ReiPatcher/Mono.Cecil.Rocks.dll\n{GameDirectory}/ReiPatcher/ReiPatcher.exe\n{GameDirectory}/{GameExeName}_Data/Managed/ReiPatcher.exe\n{GameDirectory}/{GameExeName}_Data/Managed/XUnity.Common.dll\n{GameDirectory}/{GameExeName}_Data/Managed/XUnity.ResourceRedirector.dll\n{GameDirectory}/{GameExeName}_Data/Managed/XUnity.AutoTranslator.Plugin.Core.dll\n{GameDirectory}/{GameExeName}_Data/Managed/XUnity.AutoTranslator.Plugin.ExtProtocol.dll\n{GameDirectory}/{GameExeName}_Data/Managed/MonoMod.RuntimeDetour.dll\n{GameDirectory}/{GameExeName}_Data/Managed/MonoMod.Utils.dll\n{GameDirectory}/{GameExeName}_Data/Managed/Mono.Cecil.dll\n{GameDirectory}/{GameExeName}_Data/Managed/0Harmony.dll\n{GameDirectory}/{GameExeName}_Data/Managed/ExIni.dll\n{GameDirectory}/{GameExeName}_Data/Managed/Translators/{Translator}.dll\n{GameDirectory}/AutoTranslator/Translation/AnyTranslationFile.txt (these files will be auto generated by plugin!)\n ```\n\n**NOTE:** The `Mono.Cecil.dll` file placed in the ReiPatcher directory is not the same file as is placed in the Managed directory.\n\n### BepInEx Plugin\nREQUIRES: [BepInEx plugin manager](https://github.com/BepInEx/BepInEx) (follow its installation instructions first!). \n\n 1. Download XUnity.AutoTranslator-BepInEx-{VERSION}.zip from [releases](../../releases).\n 2. Extract directly into the game directory, such that the plugin dlls are placed in BepInEx folder.\n 3. Launch the game.\n 4. Due to various considerations, not all text hooks are enabled by default, so if you find that the game or parts of the game are not being properly translated it may be worth going into the configuration file and enable some of the disabled text frameworks! The configuration file is created when the game is launched.\n\nThe file structure should like like this:\n```\n{GameDirectory}/BepInEx/core/XUnity.Common.dll\n{GameDirectory}/BepInEx/plugins/XUnity.ResourceRedirector/XUnity.ResourceRedirector.dll\n{GameDirectory}/BepInEx/plugins/XUnity.ResourceRedirector/XUnity.ResourceRedirector.BepInEx.dll\n{GameDirectory}/BepInEx/plugins/XUnity.AutoTranslator/XUnity.AutoTranslator.Plugin.Core.dll\n{GameDirectory}/BepInEx/plugins/XUnity.AutoTranslator/XUnity.AutoTranslator.Plugin.BepInEx.dll\n{GameDirectory}/BepInEx/plugins/XUnity.AutoTranslator/XUnity.AutoTranslator.Plugin.ExtProtocol.dll\n{GameDirectory}/BepInEx/plugins/XUnity.AutoTranslator/ExIni.dll\n{GameDirectory}/BepInEx/plugins/XUnity.AutoTranslator/Translators/{Translator}.dll\n{GameDirectory}/BepInEx/core/MonoMod.RuntimeDetour.dll\n{GameDirectory}/BepInEx/core/MonoMod.Utils.dll\n{GameDirectory}/BepInEx/core/Mono.Cecil.dll\n{GameDirectory}/BepInEx/Translation/AnyTranslationFile.txt (these files will be auto generated by plugin!)\n```\n\n#### BepInEx IL2CPP Plugin\nThe instructions for installation for IL2CPP are the same as for the standard version except that you must install BepInEx 6 for IL2CPP, which as of this writing are only available as bleeding edge builds [right here](https://builds.bepis.io/projects/bepinex_be) and you must use the `BepInEx-IL2CPP` package of this plugin instead.\n\nThe current version (5.4.0) was built against bleeding edge build 704.\n\n### MelonLoader Plugin\nREQUIRES: [Melon Loader](https://melonwiki.xyz) (follow its installation instructions first!).\n\n 1. Download XUnity.AutoTranslator-MelonMod-{VERSION}.zip from [releases](../../releases).\n 2. Extract directly into the game directory, such that the plugin dlls are placed in Mods and UserLibs folders.\n 3. Launch the game.\n 4. Due to various considerations, not all text hooks are enabled by default, so if you find that the game or parts of the game are not being properly translated it may be worth going into the configuration file and enable some of the disabled text frameworks! The configuration file is created when the game is launched.\n\nThe file structure should like like this:\n```\n{GameDirectory}/Mods/XUnity.AutoTranslator.Plugin.MelonMod.dll\n{GameDirectory}/UserLibs/XUnity.Common.dll\n{GameDirectory}/UserLibs/XUnity.ResourceRedirector.dll\n{GameDirectory}/UserLibs/XUnity.AutoTranslator.Plugin.Core.dll\n{GameDirectory}/UserLibs/XUnity.AutoTranslator.Plugin.ExtProtocol.dll\n{GameDirectory}/UserLibs/ExIni.dll\n{GameDirectory}/UserLibs/Translators/{Translator}.dll\n{GameDirectory}/AutoTranslator/Translation/AnyTranslationFile.txt (these files will be auto generated by plugin!)\n```\n\nThe current version (5.4.0) was built against v0.6.1 Open-Beta.\n\n#### MelonLoader IL2CPP Plugin\nThe instructions for installation for IL2CPP are the same as for the standard version except that you must use the `MelonMod-IL2CPP` package of this plugin instead.\n\n### IPA Plugin\nREQUIRES: [IPA plugin manager](https://github.com/Eusth/IPA) (follow its installation instructions first!).\n\n 1. Download XUnity.AutoTranslator-IPA-{VERSION}.zip from [releases](../../releases).\n 2. Extract directly into the game directory, such that the plugin dlls are placed in Plugins folder.\n 3. Launch the game.\n 4. Due to various considerations, not all text hooks are enabled by default, so if you find that the game or parts of the game are not being properly translated it may be worth going into the configuration file and enable some of the disabled text frameworks! The configuration file is created when the game is launched.\n\nThe file structure should like like this\n```\n{GameDirectory}/Plugins/XUnity.Common.dll\n{GameDirectory}/Plugins/XUnity.ResourceRedirector.dll\n{GameDirectory}/Plugins/XUnity.AutoTranslator.Plugin.Core.dll\n{GameDirectory}/Plugins/XUnity.AutoTranslator.Plugin.IPA.dll\n{GameDirectory}/Plugins/XUnity.AutoTranslator.Plugin.ExtProtocol.dll\n{GameDirectory}/Plugins/MonoMod.RuntimeDetour.dll\n{GameDirectory}/Plugins/MonoMod.Utils.dll\n{GameDirectory}/Plugins/Mono.Cecil.dll\n{GameDirectory}/Plugins/0Harmony.dll\n{GameDirectory}/Plugins/ExIni.dll\n{GameDirectory}/Plugins/Translators/{Translator}.dll\n{GameDirectory}/Plugins/Translation/AnyTranslationFile.txt (these files will be auto generated by plugin!)\n ```\n\n### UnityInjector Plugin\nREQUIRES: UnityInjector (follow its installation instructions first!).\n\n 1. Download XUnity.AutoTranslator-UnityInjector-{VERSION}.zip from [releases](../../releases).\n 2. Extract directly into the game directory, such that the plugin dlls are placed in UnityInjector folder. **This may not be game root directory!**\n 3. Launch the game.\n 4. Due to various considerations, not all text hooks are enabled by default, so if you find that the game or parts of the game are not being properly translated it may be worth going into the configuration file and enable some of the disabled text frameworks! The configuration file is created when the game is launched.\n\nThe file structure should like like this\n```\n{GameDirectory}/UnityInjector/XUnity.Common.dll\n{GameDirectory}/UnityInjector/XUnity.ResourceRedirector.dll\n{GameDirectory}/UnityInjector/XUnity.AutoTranslator.Plugin.Core.dll\n{GameDirectory}/UnityInjector/XUnity.AutoTranslator.Plugin.UnityInjector.dll\n{GameDirectory}/UnityInjector/XUnity.AutoTranslator.Plugin.ExtProtocol.dll\n{GameDirectory}/UnityInjector/0Harmony.dll\n{GameDirectory}/UnityInjector/Translators/{Translator}.dll\n{GameDirectory}/UnityInjector/Config/Translation/AnyTranslationFile.txt (these files will be auto generated by plugin!)\n ```\n\n**NOTE:** MonoMod hooks are not supported with this installation method because an outdated version of `Mono.Cecil.dll` is being used with Sybaris.\n \n## Key Mapping\nThe following key inputs are mapped:\n * ALT + 0: Toggle XUnity AutoTranslator UI. (That's a zero, not an O)\n * ALT + 1: Toggle Translation Aggregator UI.\n * ALT + T: Alternate between translated and untranslated versions of all texts provided by this plugin.\n * ALT + R: Reload translation files. Useful if you change the text and texture files on the fly. Not guaranteed to work for all textures.\n * ALT + U: Manual hooking. The default hooks wont always pick up texts. This will attempt to make lookups manually. Will not hook text components from frameworks not enabled.\n * ALT + F: If OverrideFont is configured, will toggle between overridden and default font.\n * ALT + Q: Reboot the plugin if it was shutdown. This will only work if the plugin was shut down due to consecutive errors towards the translation endpoint. Should only be used if you have reason to believe you have remedied the problem (such as changed VPN endpoint etc.) otherwise it will just shut down again.\n\n Debugging-only keys:\n  * CTRL + ALT + NP9: Simulate synchronous errors\n  * CTRL + ALT + NP8: Simulate asynchronous errors delayed by one second\n  * CTRL + ALT + NP7: Print out loaded scene names and ids to console\n  * CTRL + ALT + NP6: Print out entire GameObject hierarchy to file `hierarchy.txt`\n\n## Translators\nThe supported translators are:\n * [GoogleTranslate](https://anonym.to/?https://translate.google.com/), based on the online Google translation service. Does not require authentication.\n   * No limitations, but unstable.\n * [GoogleTranslateV2](https://anonym.to/?https://translate.google.com/), based on the online Google translation service. Does not require authentication.\n   * No limitations, but unstable. Currently being tested. May replace original version in future since that API is no longer used on their official translator web.\n * [GoogleTranslateCompat](https://anonym.to/?https://translate.google.com/), same as the above, except requests are served out-of-process which is needed in some versions of Unity/Mono.\n   * No limitations, but unstable.\n * [GoogleTranslateLegitimate](https://anonym.to/?https://cloud.google.com/translate/), based on the Google cloud translation API. Requires an API key.\n   * Provides trial period of 1 year with $300 credits. Enough for 15 million characters translations.\n * [BingTranslate](https://anonym.to/?https://www.bing.com/translator), based on the online Bing translation service. Does not require authentication.\n   * No limitations, but unstable.\n * [BingTranslateLegitimate](https://anonym.to/?https://docs.microsoft.com/en-us/azure/cognitive-services/translator/translator-info-overview), based on the Azure text translation. Requires an API key.\n   * Free up to 2 million characters per month.\n * [DeepLTranslate](https://anonym.to/?https://www.deepl.com/translator), based on the online DeepL translation service. Does not require authentication.\n   * No limitations, but unstable. Remarkable quality.\n * [DeepLTranslateLegitimate](https://anonym.to/?https://www.deepl.com/translator), based on the online DeepL translation service. Requires an  API Key.\n   * $4.99 per month and $20 per million characters translated that month. \n   * Free up to 0.5 million characters per month.\n   * For now, you must subscribe to DeepL API (for Developers). - DOES NOT WORK WITH DeepL Pro (Starter, Advanced and Ultimate)\n * [PapagoTranslate](https://anonym.to/?https://papago.naver.com/), based on the online Papago translation service. Does not require authentication.\n   * No limitations, but unstable.\n * [BaiduTranslate](https://anonym.to/?https://fanyi.baidu.com/), based on Baidu translation service. Requires AppId and AppSecret.\n   * After registration, the first 50,000 characters per month are free (QPS=1), and 49 yuan/million characters are charged after that. If you have passed the free identity authentication, then the first 1 million characters per month are free (QPS=10), and the excess is charged at 49 yuan/million characters. The longest single request is 6000 characters.\n * [YandexTranslate](https://anonym.to/?https://tech.yandex.com/translate/), based on the Yandex translation service. Requires an API key.\n   * Free up to 1 million characters per day, but max 10 million characters per month.\n * [WatsonTranslate](https://anonym.to/?https://cloud.ibm.com/apidocs/language-translator), based on IBM's Watson. Requires a URL and an API key.\n   * Free up to 1 million characters per month.\n * LecPowerTranslator15, based on LEC's Power Translator. Does not require authentication, but does require the software installed.\n   * No limitations.\n * ezTrans XP, based on Changsinsoft's japanese-korean translator ezTrans XP. Does not require authentication, but does require the software and [Ehnd](https://github.com/sokcuri/ehnd) installed.\n   * No limitations.\n * [Sugoi Translator](https://github.com/Vin-meido/XUnity-AutoTranslator-SugoiOfflineTranslatorEndpoint), currently requires external translator plugin.\n   * No limitations. Remarkable quality.\n * [ChatGPT](https://github.com/joshfreitas1984/XUnity.AutoChatGptTranslator), currently requires external translator plugin.\n   * Requires an APIKey, paid per tokens used.\n * [LingoCloudTranslate](https://anonym.to/?https://fanyi.caiyunapp.com/), based on the online LingoCloud translation service. Translation is only supported in Chinese and two other languages: Japanese and English.\n   * After registration and free certification, the first 1 million characters per month are free, and the excess will be charged at 20 yuan/million characters.The official test token is `3975l6lr5pcbvidl6jl2`, you can try it before registering.\n * CustomTranslate. Alternatively you can also specify any custom HTTP url that can be used as a translation endpoint (GET request). This must use the query parameters \"from\", \"to\" and \"text\" and return only a string with the result (try HTTP without SSL first, as unity-mono often has issues with SSL).\n   * *NOTE: This is a developer-centric option. You cannot simply specify \"CustomTranslate\" and expect it to work with any arbitrary translation service you find online. See [FAQ](#frequently-asked-questions)*\n   * Example Configuration:\n     * Endpoint=CustomTranslate\n     * [Custom]\n     * Url=http://my-custom-translation-service.net/translate\n   * Example Request: GET http://my-custom-translation-service.net/translate?from=ja&to=en&text=こんにちは\n   * Example Response (only body): Hello\n   * Known implementations that can be used with CustomTranslate:\n     * ezTrans: https://github.com/HelloKS/ezTransWeb\n \n*NOTE: If you use any of the online translators that does not require some form of authentication, that this plugin may break at any time.*\n\nSince 3.0.0, you can also implement your own translators. To do so, follow the instruction [here](#implementing-a-translator).\n\n### About Authenticated Translators\nIf you decide to use an authenticated service *do not ever share your key or secret*. If you do so by accident, you should revoke it immediately. Most, if not all services provides an option for this.\n\nIf you want to use a paid option, remember to check if that plugin supports the language you want to translate from and to before paying. Also, while the plugin does attempt to keep the amount of requests sent to the translation endpoint to a minimum, there are no guarantees about how much it will ask the endpoint to translate, and the author/owner of this repository takes no responsibility for any charges you may receive from your selected translation provider as a result of using this plugin.\n\nHow the plugin attempts to minmize the number of requests it sends out is outlined [here](#spam-prevention).\n\n### Spam Prevention\nThe plugin employs the following spam prevention mechanisms:\n 1. When it sees a new text, it will always wait one second before it queues a translation request, to check if that same text changes. It will not send out any request until the text has not changed for 1 second.\n 2. It will never send out more than 8000 requests (max 200 characters each (configurable)) during a single game session.\n 3. It will never send out more than 1 request at a time (no concurrency!).\n 4. If it detects an increasing number of queued translations (4000), the plugin will shutdown.\n 5. If the service returns no result for five consecutive requests, the plugin will shutdown.\n 6. If the plugin detects that the game queues translations every frame, the plugin will shutdown after 90 frames.\n 7. If the plugin detects text that \"scrolls\" into place, the plugin will shutdown. This is detected by inspecting all requests that are queued for translation. ((1) will genenerally prevent this from happening)\n 8. If the plugin consistently queues translations every second for more than 60 seconds, the plugin will shutdown.\n 9. For the supported languages, each translatable line must pass a symbol check that detects if the line includes characters from the source language.\n 10. It will never attempt a translation for a text that is already considered a translation for something else.\n 11. All queued translations are kept track of. If two different components that require the same translation and both are queued for translation at the same time, only a single request is sent.\n 12. It employs an internal dictionary of manual translations (~2000 in total) for commonly used phrases (Japanese-to-English only) to prevent sending out translation requests for these.\n 13. Some endpoints support batching of translations so far fewer requests are sent. This does not increase the total number of translations per session (2).\n 14. All translation results are cached in memory and stored on disk to prevent making the same translation request twice.\n 15. Due to its spammy nature, any text that comes from an IMGUI component has any numbers found in it templated away (and substituted back in upon translation) to prevent issues in relation to (6).\n 16. The plugin will keep a single TCP connection alive towards the translation endpoint. This connection will be gracefully closed if it is not used for 50 seconds.\n\n## Text Frameworks\nThe following text frameworks are supported.\n * [UGUI](https://docs.unity3d.com/Manual/UISystem.html)\n * [NGUI](https://assetstore.unity.com/packages/tools/gui/ngui-next-gen-ui-2413)\n * [IMGUI](https://docs.unity3d.com/Manual/GUIScriptingGuide.html) (disabled by default)\n * [TextMeshPro](http://digitalnativestudios.com/textmeshpro/docs/)\n * [TextMesh](https://docs.unity3d.com/Manual/class-TextMesh.html) (disabled by default, often text float in 3D space)\n * [FairyGUI for Unity](https://github.com/fairygui/FairyGUI-unity)\n * [Utage (VN Game Engine)](http://madnesslabo.net/utage/?lang=en)\n\n## Configuration\nThe default configuration file, looks as such:\n\n```ini\n[Service]\nEndpoint=GoogleTranslate         ;Endpoint to use. See the [translators section](#translators) for valid values.\nFallbackEndpoint=                ;Endpoint to automatically fallback to if the primary endpoint fails for a specific translation.\n\n[General]\nLanguage=en                      ;The language to translate into\nFromLanguage=ja                  ;The original language of the game. \"auto\" is also supported for some endpoints, but it is generally not recommended\n\n[Files]\nDirectory=Translation\\{Lang}\\Text                                   ;Directory to search for cached translation files. Can use placeholder: {GameExeName}, {Lang}\nOutputFile=Translation\\{Lang}\\Text\\_AutoGeneratedTranslations.txt   ;File to insert generated translations into. Can use placeholders: {GameExeName}, {Lang}\nSubstitutionFile=Translation\\{Lang}\\Text\\_Substitutions.txt         ;File that contains substitution applied before translations. Can use placeholders: {GameExeName}, {Lang}\nPreprocessorsFile=Translation\\{Lang}\\Text\\_Preprocessors.txt        ;File that contains preprocessors to be applied before sending a text to a translator. Can use placeholders: {GameExeName}, {Lang}\nPostprocessorsFile=Translation\\{Lang}\\Text\\_Postprocessors.txt      ;File that contains postprocessors to be applied after receiving a text from a translator. Can use placeholders: {GameExeName}, {Lang}\n\n[TextFrameworks]\nEnableUGUI=True                  ;Enable or disable UGUI translation\nEnableNGUI=True                  ;Enable or disable NGUI translation\nEnableTextMeshPro=True           ;Enable or disable TextMeshPro translation\nEnableTextMesh=False             ;Enable or disable TextMesh translation\nEnableIMGUI=False                ;Enable or disable IMGUI translation\n\n[Behaviour]\nMaxCharactersPerTranslation=200  ;Max characters per text to translate. Max 2500.\nIgnoreWhitespaceInDialogue=True  ;Whether or not to ignore whitespace, including newlines, in dialogue keys\nIgnoreWhitespaceInNGUI=True      ;Whether or not to ignore whitespace, including newlines, in NGUI\nMinDialogueChars=20              ;The length of the text for it to be considered a dialogue\nForceSplitTextAfterCharacters=0  ;Split text into multiple lines once the translated text exceeds this number of characters\nCopyToClipboard=False            ;Whether or not to copy hooked texts to clipboard\nMaxClipboardCopyCharacters=450   ;Max number of characters to hook to clipboard at a time\nClipboardDebounceTime=1.25       ;The number of seconds it takes for hooked text to reach the clipboard. Minimum is 0.1\nEnableUIResizing=True            ;Whether or not the plugin should provide a \"best attempt\" at resizing UI components upon translation\nEnableBatching=True              ;Indicates whether batching of translations should be enabled for supported endpoints\nUseStaticTranslations=True       ;Indicates whether or not to use translations from the included static translation cache\nOverrideFont=                    ;Overrides the fonts used for texts when updating text components. NOTE: Only works for UGUI\nOverrideFontTextMeshPro=         ;Consider using FallbackFontTextMeshPro instead. Overrides the fonts used for texts when updating text components. NOTE: Only works for TextMeshPro\nFallbackFontTextMeshPro=         ;Adds a fallback font for TextMeshPro in case a specific character is not supported. This is recommended over OverrideFontTextMeshPro\nResizeUILineSpacingScale=        ;A decimal value that the default line spacing should be scaled by during UI resizing, for example: 0.80. NOTE: Only works for UGUI\nForceUIResizing=True             ;Indicates whether the UI resize behavior should be applied to all UI components regardless of them being translated.\nIgnoreTextStartingWith=\\u180e;   ;Indicates that the plugin should ignore any strings starting with certain characters. This is a list seperated by ';'.\nTextGetterCompatibilityMode=False ;Indicates whether or not to enable \"Text Getter Compatibility Mode\". Should only be enabled if required by the game. \nGameLogTextPaths=                ;Indicates specific paths for game objects that the game uses as \"log components\", where it continuously appends or prepends text to. Requires expert knowledge to setup. This is a list seperated by ';'.\nRomajiPostProcessing=ReplaceMacronWithCircumflex;RemoveApostrophes;ReplaceHtmlEntities ;Indicates what type of post processing to do on 'translated' romaji texts. This can be important in certain games because the font used does not support various diacritics properly. This is a list seperated by ';'. Possible values: [\"RemoveAllDiacritics\", \"ReplaceMacronWithCircumflex\", \"RemoveApostrophes\", \"ReplaceHtmlEntities\"]\nTranslationPostProcessing=ReplaceMacronWithCircumflex;ReplaceHtmlEntities ;Indicates what type of post processing to do on translated texts (not romaji). Possible values: [\"RemoveAllDiacritics\", \"ReplaceMacronWithCircumflex\", \"RemoveApostrophes\", \"ReplaceWideCharacters\", \"ReplaceHtmlEntities\"]\nRegexPostProcessing=None         ;Indicates what type of post processing to perform on the capture groups of regexes. Possible values: [\"RemoveAllDiacritics\", \"ReplaceMacronWithCircumflex\", \"RemoveApostrophes\", \"ReplaceWideCharacters\", \"ReplaceHtmlEntities\"]\nCacheRegexLookups=False          ;Indicates whether or not results of regex lookups should be output to the specified OutputFile\nCacheWhitespaceDifferences=False ;Indicates whether or not whitespace differences should be output to the specified OutputFile\nCacheRegexPatternResults=False   ;Indicates whether or not the complete result of regex-splitted translations should be output to the specified OutputFile\nGenerateStaticSubstitutionTranslations=False ;Indicates that the plugin should generate translations without variables when using substitutions\nGeneratePartialTranslations=False ;Indicates that the plugin should generate partial translations to support text translations as it is \"scrolling in\"\nEnableTranslationScoping=False   ;Indicates the plugin should parse 'TARC' directives and scope translations based on these\nEnableSilentMode=False           ;Indicates the plugin should not print out success messages in relation to translations\nBlacklistedIMGUIPlugins=         ;If an IMGUI window assembly/class/method name contains any of the strings in this list (case insensitive) that UI will not be translated. Requires MonoMod hooks. This is a list seperated by ';'\nOutputUntranslatableText=False   ;Indicates if texts that are considered by the plugin to be untranslatable should be output to the specified OutputFile\nIgnoreVirtualTextSetterCallingRules=False; Indicates that rules for virtual method calls should be ignored when trying to set the text of a text component. May in some cases help setting the text of stubborn components\nMaxTextParserRecursion=1         ;Indicates how many levels of recursion are allowed when text is parsed so it can be translated in different parts. This can be used with splitter-regexes in advanced scenarios. The default value of one essentially means that recursion is disabled.\nHtmlEntityPreprocessing=True     ;Will preprocess and decode html entities before they are send for translation. Some translators will fail when html entities are sent.\nHandleRichText=True              ;Will enable automated handling of rich text (text with markup)\nPersistRichTextMode=Final        ;Indicates how parsed rich text should be persisted. Either 'Fragment' to store the the text piecemeal or 'Final' to store the entire translated string (does not support substitutions!)\nEnableTranslationHelper=False    ;Indicates if translator-related helpful log messages should be enabled. May be useful when tranlating based on redirected resources\nForceMonoModHooks=False          ;Indicates that the plugin must use MonoMod hooks instead of harmony hooks\nInitializeHarmonyDetourBridge=False ;Indicates the plugin should initial harmony detour bridge which allows harmony hooks to work in an environment where System.Reflection.Emit does not exist (usually such settings are handled by plugin managers, so don't use when using a plugin manager)\nRedirectedResourceDetectionStrategy=AppendMongolianVowelSeparatorAndRemoveAll ;Indicates if and how the plugin should attempt to recognize redirected resources in order to prevent double translations. Can be [\"None\", \"AppendMongolianVowelSeparator\", \"AppendMongolianVowelSeparatorAndRemoveAppended\", \"AppendMongolianVowelSeparatorAndRemoveAll\"]\nOutputTooLongText=False          ;Indicates if the plugin should output text that exceeds 'MaxCharactersPerTranslation' without translating it\n\n[Texture]\nTextureDirectory=Translation\\{Lang}\\Texture ;Directory to dump textures to, and root of directories to load images from. Can use placeholder: {GameExeName}, {Lang}\nEnableTextureTranslation=False   ;Indicates whether the plugin will attempt to replace in-game images with those from the TextureDirectory directory\nEnableTextureDumping=False       ;Indicates whether the plugin will dump texture it is capable of replacing to the TextureDirectory. Has significant performance impact\nEnableTextureToggling=False      ;Indicates whether or not toggling the translation with the ALT+T hotkey will also affect textures. Not guaranteed to work for all textures. Has significant performance impact\nEnableTextureScanOnSceneLoad=False ;Indicates whether or not the plugin should scan for textures on scene load. This enables the plugin to find and (possibly) replace more texture\nEnableSpriteRendererHooking=False ;Indicates whether or not the plugin should attempt to hook SpriteRenderer. This is a seperate option because SpriteRenderer can't actually be hooked properly and the implemented workaround could have a theoretical impact on performance in certain situations\nLoadUnmodifiedTextures=False     ;Indicates whether or not unmodified textures should be loaded. Modifications are determined based on the hash in the file name. Only enable this for debugging purposes as it is likely to cause oddities\nTextureHashGenerationStrategy=FromImageName ;Indicates how the mod identifies pictures through hashes. Can be [\"FromImageName\", \"FromImageData\", \"FromImageNameAndScene\"]\nDuplicateTextureNames=           ;Indicates specific texture names that are duplicated in the game. List is separated by ';'.\nDetectDuplicateTextureNames=False;Indicates if the plugin should detect duplicate texture names.\nEnableLegacyTextureLoading=False ;Indicates the plugin should use a different strategy to load images, that may be relevant if the game engine is old\nCacheTexturesInMemory=True       ;Indicates that all textures loaded should be kept in memory for optimal performance. Disable to decrease memory usage\n\n[ResourceRedirector]\nPreferredStoragePath=Translation\\{Lang}\\RedirectedResources ;Indicates the preferred storage for redirected resources in relation to the Auto Translator. Can use placeholder: {GameExeName}, {Lang}\nEnableTextAssetRedirector=False  ;Indicates if TextAssets should be redirected\nLogAllLoadedResources=False      ;Indicates if the plugin should log to the console all loaded assets. Useful to determine what can be hooked\nEnableDumping=False              ;Indicates if translatable resources that are found should be dumped\nCacheMetadataForAllFiles=True    ;When files are in ZIP files in the PreferredStoragePath, these files are indexed in memory to avoid performing file check IO when loading them. Enabling this option will do the same for physical files\n\n[Http]\nUserAgent=                       ;Override the user agent used by APIs requiring a user agent\nDisableCertificateValidation=False ;Indiciates whether certificate validations for the .NET API should be disabled\n\n[TranslationAggregator]\nWidth=400                        ;The total width of the translation aggregator window.\nHeight=100                       ;The width (per translator) of the translation aggregator window.\nEnabledTranslators=              ;The id's of the translation endpoints that has been enabled in the translation aggregator window. List is separated by ';'.\n\n[Google]\nServiceUrl=                      ;OPTIONAL, can be used to direct google API request to a different URL. Can be used to circumvent GFWoC\n\n[GoogleLegitimate]\nGoogleAPIKey=                    ;OPTIONAL, needed if GoogleTranslateLegitimate is configured\n\n[BingLegitimate]\nOcpApimSubscriptionKey=          ;OPTIONAL, needed if BingTranslateLegitimate is configured\n\n[Baidu]\nBaiduAppId=                      ;OPTIONAL, needed if BaiduTranslate is configured\nBaiduAppSecret=                  ;OPTIONAL, needed if BaiduTranslate is configured\n\n[Yandex]\nYandexAPIKey=                    ;OPTIONAL, needed if YandexTranslate is configured\n\n[Watson]\nUrl=                             ;OPTIONAL, needed if WatsonTranslate is configured\nKey=                             ;OPTIONAL, needed if WatsonTranslate is configured\n\n[DeepL]\nMinDelay=2                       ;OPTIONAL, used for throttling DeepL\nMaxDelay=7                       ;OPTIONAL, used for throttling DeepL\n\n[DeepLLegitimate]\nApiKey=                          ;OPTIONAL, required if DeepLLegitimate is configured\nFree=False                       ;OPTIONAL, required if DeepLLegitimate is configured\n\n[Custom]\nUrl=                             ;Optional, needed if CustomTranslated is configured\n\n[LecPowerTranslator15]\nInstallationPath=                ;Optional, needed if LecPowerTranslator15 is configured\n\n[LingoCloud]\nLingoCloudToken=                 ;Optional, needed if LingoCloudTranslate is configured\n\n[Debug]\nEnableConsole=False              ;Enables the console. Do not enable if other plugins (managers) handles this\nEnableLog=False                  ;Enables extra logging for debugging purposes\n\n[Migrations]\nEnable=True                      ;Used to enable automatic migrations of this configuration file\nTag=4.15.0                        ;Tag representing the last version this plugin was executed under. Do not edit\n```\n\n### Behaviour Configuration Explanation\n\n#### Whitespace Handling\nThis section describes configuration parameters that has an effect on whitespace handling before and after performing a translation. **None of these settings have an impact on the 'untranslated texts' that are placed in the auto generated translations file.**\n\nWhen it comes to automated translations, proper whitespace handling can really make or break the translation. The parameters that control whitespace handling are:\n * `IgnoreWhitespaceInDialogue`\n * `IgnoreWhitespaceInNGUI`\n * `MinDialogueChars`\n * `ForceSplitTextAfterCharacters`\n\nThe plugin first determines whether or not it should perform a special whitespace removal operation. It determines whether or not to perform this operation based on the parameters `IgnoreWhitespaceInDialogue`, `IgnoreWhitespaceInNGUI` and `MinDialogueChars`:\n * `IgnoreWhitespaceInDialogue`: If the text is longer than `MinDialogueChars`, whitespace is removed.\n * `IgnoreWhitespaceInNGUI`: If the text comes from an NGUI component, whitespace is removed.\n\nAfter the text has been translated by the configured service, `ForceSplitTextAfterCharacters` is used to determine if the plugin should force the result into multiple lines after a certain number of characters.\n\nThe main reason that this type of handling can make or break a translation really comes down to whether or not whitespace is removed from the source text before sending it to the endpoint. Most endpoints (such as GoogleTranslate) consider text on multiple lines seperately, which can often result in terrible translation if an unnecessary newline is included.\n\n#### Text post/pre-processing\nWhile proper whitespace handling goes a long way in ensuring better translations, it is not always enough.\n\nThe `PreprocessorsFile` allows defining entries that modifies the text just before it is sent to the translator.\n\nThe `PostprocessorsFile` allows defining entries that modifies the translated text just after it is received from the translator.\n\n#### UI Resizing\nOften when performing a translation on a text component, the resulting text is larger than the original. This often means that there is not enough room in the text component for the result. This section describes ways to remedy that by changing important parameters of the text components.\n\nBy default, the plugin will attempt some basic auto-resizing behaviour, which are controlled by the following parameters: `EnableUIResizing`, `ResizeUILineSpacingScale`, `ForceUIResizing`, `OverrideFont` and `OverrideFontTextMeshPro`.\n * `EnableUIResizing`: Resizes the components when a translation is performed.\n * `ForceUIResizing`: Resizes all components at all times, period.\n * `ResizeUILineSpacingScale`: Changes the line spacing of resized components. UGUI only.\n * `OverrideFont`: Changes the font of all text components regardless of `EnableUIResizing` and `ForceUIResizing`. UGUI only.\n * `OverrideFontTextMeshPro`: Consider using `FallbackFontTextMeshPro` instead. Changes the font of all text components regardless of `EnableUIResizing` and `ForceUIResizing`. TextMeshPro only. This option is able to load a font in two different ways. If the specified string indicates a path within the game folder, then that file will be attempted to be loaded as an asset bundle (requires Unity 2018 or greater (or alternatively a custom asset bundle built specifically for the targeted game)). If not, it will be attempted to be loaded through the Resources API. Default resources that are often distributed with TextMeshPro are: `Fonts & Materials/LiberationSans SDF` or `Fonts & Materials/ARIAL SDF`.\n * `FallbackFontTextMeshPro`: Adds a fallback font that TextMesh Pro can use in case a specific character is not supported.\n\nAn additional note on changing the font of TextMeshPro: You can download some pre-built asset bundles for Unity 2018 and 2019 in the release tab, but for now, they are not particularly well tested. If you want to try them out, simply download the .zip folder and put one of the font assets into the game folder. Then configure it up by writing the name of the file in the configuration file in `OverrideFontTextMeshPro`.\n\nResizing of a UI component does not refer to changing of it's dimensions, but rather how the component handles overflow. The plugin changes the overflow parameters such that text is more likely to be displayed.\n\nThe configuratiaon `EnableUIResizing` and `ForceUIResizing` also control whether or not manual UI resize behaviour is enabled. See [this section](#ui-font-resizing) for more information.\n\n#### Reducing Translation Requests\nThe following aims at reducing the number of requests send to the translation endpoint:\n * `EnableBatching`: Batches several translation requests into a single with supported endpoints.\n * `UseStaticTranslations`: Enables usage of internal lookup dictionary of various english-to-japanese terms.\n * `MaxCharactersPerTranslation`: Specifies the maximum length of a text to translate. Any texts longer than this is ignored by the plugin. Cannot be greater than 1000. **Never redistribute this mod with this value greater than 400**\n\n#### Romaji 'translation'\nOne of the possible values as output `Language` is 'romaji'. If you choose this as language, you will find that games often has problems showing the translations because the font does not understand the special characters used, for example the [macron diacritic](https://en.wikipedia.org/wiki/Macron_(diacritic)).\n\nTo rememdy this, post processing can be applied to translations when 'romaji' is chosen as `Language`. This is done through the option `RomajiPostProcessing`. This option is a ';'-seperated list of values:\n * `RemoveAllDiacritics`: Remove all diacritics from the translated text\n * `ReplaceMacronWithCircumflex`: Replaces the macron diacritic with a circumflex.\n * `RemoveApostrophes`: Some translators might decide to include apostrophes after the 'n'-character. Applying this option removes those.\n * `ReplaceWideCharacters`: Replaces wide-width japanese characters with standard ASCII characters\n * `ReplaceHtmlEntities`: Replaces all html entities with their unescaped character\n\nThis type of post processing is also applied to normal translations, but instead uses the option `TranslationPostProcessing`, which can use the same values.\n\n#### MonoMod Hooks\nMonoMod hooks are hooks are created at runtime, but not through the Harmony dependency. Harmony has two primary problems that these hooks attempt to solve:\n * Harmony cannot hook methods with no body.\n * Harmony cannot hook methods under the `netstandard2.0` API surface, which later versions of Unity can be build under.\n\nMonoMod solves both of these problems. In order to use MonoMod hooks the libraries `MonoMod.RuntimeDetours.dll`, `MonoMod.Utils.dll` and `Mono.Cecil.dll` must be available to the plugin. These are optional dependencies.\n\nThese are only available in the following packages:\n * `XUnity.AutoTranslator-BepInEx-{VERSION}.zip` (because all dependencies are distributed with BepInEx 5.x)\n * `XUnity.AutoTranslator-IPA-{VERSION}.zip` (because all dependencies are included in the package)\n * `XUnity.AutoTranslator-ReiPatcher-{VERSION}.zip` (because all dependencies are included in the package)\n\nThey are not distributed in the BepInEx 4.x because of the potential for conflicts in mod packages for various games.\n\nThe following configuration controls the MonoMod hooks:\n * `ForceMonoModHooks`: Forces the plugin to use MonoMod hooks over Harmony hooks.\n\nIf MonoMod hooks are not forced they are only used if available and a given method cannot be hooked through Harmony for one of the two reasons mentioned above.\n\n#### Other Options\n * `TextGetterCompatibilityMode`: This mode fools the game into thinking that the text displayed is not translated. This is required if the game uses text displayed to the user to determine what logic to execute. You can easily determine if this is required if you can see the functionality works fine if you toggle the translation off (hotkey: ALT+T).\n * `IgnoreTextStartingWith`: Disable translation for any texts starting with values in this ';-separated' setting. The [default value](https://www.charbase.com/180e-unicode-mongolian-vowel-separator) is an invisible character that takes up no space.\n * `CopyToClipboard`: Copy text to translate to the clipboard to support tools such as Translation Aggregator.\n * `ClipboardDebounceTime`: The delay between hooking a text and it being copied to clipboard. This is to avoid spamming the clipboard. If multiple texts appear in this period they will be concatenated.\n * `EnableSilentMode`: Indicates the plugin should not print out success messages in relation to translations.\n * `BlacklistedIMGUIPlugins`: If an IMGUI window assembly/class/method name contains any of the strings in this list (case insensitive) that UI will not be translated. Requires MonoMod hooks. This is a list seperated by ';'.\n * `OutputUntranslatableText`: Indicates if texts that are considered by the plugin to be untranslatable should be output to the specified OutputFile. Enabling this may also output a lot of garbage to the `OutputFile` that should be deleted before potential redistribution. **Never redistribute the mod with this enabled.**\n * `IgnoreVirtualTextSetterCallingRules`: Indicates that rules for virtual method calls should be ignored when trying to set the text of a text component. May in some cases help setting the text of stubborn components.\n * `RedirectedResourceDetectionStrategy`: Indicates if and how the plugin should attempt to recognize redirected resources in order to prevent double translations. Can be [\"None\", \"AppendMongolianVowelSeparator\", \"AppendMongolianVowelSeparatorAndRemoveAppended\", \"AppendMongolianVowelSeparatorAndRemoveAll\"]\n * `OutputTooLongText`: Indicates if the plugin should output text that exceeds 'MaxCharactersPerTranslation' without translating it\n\n## IL2CPP Support\nWhile this plugin offers some level of IL2CPP support, it is by no means complete. The following differences can be observed/features are missing:\n * Subpar text hooking capabilities\n * TextGetterCompatibilityMode is not supported\n * Plugin-specific translations are not supported (yet)\n * IMGUI translations are not supported (yet)\n * Many other features are completely unproven\n\n## Frequently Asked Questions\n> **Q: How do I disable auto translations?**  \nA: Select the empty endpoint when you press ALT+0 or set the configuration parameter `Endpoint=` to empty.\n\n> **Q: How do I disable the plugin entirely?**  \nA: You can do so by deleting the \"XUnity.AutoTranslator\" directory in the \"{GameDirectory}\\BepInEx\\plugins\" directory. Avoid deleting the \"XUnity.ResourceRedirector\" directory as other plugins may depend on it.\n\n> **Q: The game stops working when this plugin applies translations.**  \nA: Try setting the following configuration parameter `TextGetterCompatibilityMode=True`.\n\n> **Q: Can this plugin translate other plugins/mods?**  \nA: Likely yes, see [here](#translating-mods).\n\n> **Q: How do I use CustomTranslate?**  \nA: If you have to ask, you probably can't. CustomTranslate is intended for developers of a translation service. They would be able to expose an API that conforms to CustomTranslate's API specification without needing to implement a custom ITranslateEndpoint in this plugin as well.\n\n> **Q: Please provide support for translation service X.**  \nA: For now, additional support for services that does not require some form of authentication is unlikely. Do note though, that it is possible to implement custom translators independently of this plugin. And it takes remarkably little code to do so.\n\n## Translating Mods\nOften other mods UI are implemented through IMGUI. As you can see above, this is disabled by default. By changing the \"EnableIMGUI\" value to \"True\", it will start translating IMGUI as well, which likely means that other mods UI will be translated.\n\nIt is also possible to provide plugin-specific translations. See next section.\n\n## Manual Translations\nWhen you use this plugin, you can always go to the file `Translation\\{Lang}\\Text\\_AutoGeneratedTranslations.txt` (OutputFile) to edit any auto generated translations and they will show up the next time you run the game. Or you can press (ALT+R) to reload the translation immediately.\n\nIt is also worth noting that this plugin will read all text files (*.txt) in the `Translation` (Directory), so if you want to provide a manual translation, you can simply cut out texts from the `Translation\\_AutoGeneratedTranslations.{lang}.txt` (OutputFile) and place them in new text files in order to replace them with a manual translation. These text files can also be placed in standard .zip archives.\n\nIn this context, the `Translation\\{Lang}\\Text\\_AutoGeneratedTranslations.txt` (OutputFile) will always have the lowest priority when reading translations. So if the same translation is present in two places, it will not be the one from the (OutputFile) that is used.\n\nIn some ADV engines text 'scrolls' into place slowly. Different techniques are used for this and in some instances if you want the translated text to be scrolling in instead of the untranslated text, you may need to set `GeneratePartialTranslations=True`. This should not be turned on unless required by the game.\n\n### Plugin-specific Manual Translations\nOften you may want to provide translations for other plugins that are not naturally translated. This is obviously also possible with this plugin as described in the previous section. But what if you want to provide translations that should be specific to that plugin because such translation would conflict with a different plugin/generic translation?\n\nIn order to add plugin-specific translations, simply create a `Plugins` directory in the text translation `Directory`. In this directory you can create a new directory for each plugin you want to provide plugin-specific translations for. The name of the directory should be the same as the dll name without the extension (.dll).\n\nWithin this directory you can create translations files as you normally would. In addition you can add the following directive in these files:\n\n```\n#enable fallback\n```\n\nThis will allow the plugin-specific translations to fallback to the generic/automated translations provided by the plugin. It does not matter which translation file this directive is placed it and it only need to be added once.\n\nAs a plugin author it is also possible to embed these translation files in your plugin and register them through code with the following API:\n\n```csharp\n/// <summary>\n/// Entry point for manipulating translations that have been loaded by the plugin.\n///\n/// Methods on this interface should be called during plugin initialization. Preferably during the Start callback.\n/// </summary>\npublic static class TranslationRegistry\n{\n    /// <summary>\n    /// Obtains the translations registry instance.\n    /// </summary>\n    public static ITranslationRegistry Default { get; }\n}\n\n/// <summary>\n/// Interface for manipulating translation that have been loaded by the plugin.\n/// </summary>\npublic interface ITranslationRegistry\n{\n    /// <summary>\n    /// Registers and loads the specified translation package.\n    /// </summary>\n    /// <param name=\"assembly\">The assembly that the behaviour should be applied to.</param>\n    /// <param name=\"package\">Package containing translations.</param>\n    void RegisterPluginSpecificTranslations( Assembly assembly, StreamTranslationPackage package );\n\n    /// <summary>\n    /// Registers and loads the specified translation package.\n    /// </summary>\n    /// <param name=\"assembly\">The assembly that the behaviour should be applied to.</param>\n    /// <param name=\"package\">Package containing translations.</param>\n    void RegisterPluginSpecificTranslations( Assembly assembly, KeyValuePairTranslationPackage package );\n\n    /// <summary>\n    /// Allow plugin-specific translation to fallback to generic translations.\n    /// </summary>\n    /// <param name=\"assembly\">The assembly that the behaviour should be applied to.</param>\n    void EnablePluginTranslationFallback( Assembly assembly );\n}\n```\n\n### Substitutions\nIt is also possible to add substitutions that are applied to found texts before translations are created. This is controlled through the `SubstitutionFile`, which uses the same format as normal translation text files, although things like regexes are not supported.\n\nThis is useful for replacing names that are often translated incorrectly, etc.\n\nWhen using substitutions, the found occurrences will be parameterized in the generated translations, like so:\n\n```\n私は{{A}}=I am {{A}}\n```\n\nAlternatively, if the configuration `GenerateStaticSubstitutionTranslations=True` is used the translations will not be parameterized.\n\nWhen creating manual translations, use this file as sparingly as you would use regexes, as it can have an effect on performance.\n\n*NOTE: If the text to be translated includes rich text, it cannot currently be parameterized.*\n\n### Regex Usage\nText translation files support regexes as well. Always remember to use regexes sparingly and scope them to avoid performance issues.\n\nRegexes can be applied to translations in two different ways. The following two sections describes these two ways:\n\n#### Standard Regex Translation\nStandard regex translation are simply regexes that applied directly onto a translatable text, if no direct lookup can be found.\n\n```\nr:\"^シンプルリング ([0-9]+)$\"=Simple Ring $1\n```\n\nThese are identified by the untranslated text starting with 'r:'.\n\n#### Splitter Regex\nSometimes games likes to combine texts before displaying them on screen. This means that it can sometimes be hard to know what text to add to the translation file because it appears in a number of different ways.\n\nThis section explores a solution to this by applying a regex to split the text to be translated into individual pieces before trying to make lookups for the specified texts.\n\nFor example, let's say an accessory (Simple Ring) would be translated with the following line `シンプルリング=Simple Ring`. Now lets say this appears in multiple textboxes throughout the game like `01 シンプルリング` and `02 シンプルリング`. Providing a standard regex in a translation file to handle this is not going to work because you would need a regex for each accessory and this would not be performant at all.\n\nHowever, if we split the translation before trying to make lookups it will allow us to only have a single simple translation in our file, like this: `シンプルリング=Simple Ring`.\n\nSimply place the following regex in a translation file:\n\n```\nsr:\"^([0-9]{2}) ([\\S\\s]+)$\"=$1 $2\n```\n\nThis will split up the text to be translated into two parts, translate them individually and put them back together.\n\nThese are identified by the untranslated text starting with 'sr:'.\n\nIt is also worth noting that this methodology can be used recursively, if configured. This means that it allows the individual strings that were split for translations by a regex, to flow into another splitter regex, and so on.\n\nIn addition to identifying each group by index, they can also be identified by a name, which allows groups to be completely additional. Let's take a look at an example that combines all of these things:\n\n```\nsr:\"^\\[(?<stat>[\\w\\s]+)(?<num_i>[\\+\\-]{1}[0-9]+)?\\](?<after>[\\s\\S]+)?$\"=\"[${stat}${num_i}]${after}\"\n```\n\nIn this example there are 3 named groups, two of which are optional (standard regex syntax). The replacement pattern identifies these named group by surrounding the name with `${}`.\n\nIf the identifier name ends in `_i` it means that the string will not be attempted to be translated, but rather transfered as is. Generally this is not really needed as the plugin is smart enough to determine if something should be translated or not.\n\nSo what would this regex split? It would split strings like this:\n\n```\n[DEF+14][ATK+64][DEX+34][AGI]\n```\n\nThe group(s) `(?<stat>[\\w]+)(?<num_i>[\\+\\-]{1}[0-9]+)?` matches the text inside the `[]`. As you can see there are two groups. The first is requried and represents the text. The second is optional and represents the plus-/minus sign and number that comes after.\n\nThe group `(?<after>[\\s\\S]+)` matches whatever comes after. Because of this, it will attempt to translate that text like any other, and that may flow directly back into this splitter regex.\n\n#### Regex Post Processing\nUsing the configuration option `RegexPostProcessing`, it is also possible to apply post processing the to the groups of a regex. For `sr:` regexes they are only applied to groups where the identifier name ends in `_i`.\n\n### UI Font Resizing\nIt is also possible to manually control the font size of text components. This is useful when the translated text uses more space than the untranslated text.\n\nYou can control this in files that end in `resizer.txt` placed in the translation `Directory`. This file takes a simply syntax like this:\n\n```\nCharaCustom/CustomControl/CanvasDraw=ChangeFontSizeByPercentage(0.5)\n```\n\nIn these files, the left-hand side of the equals sign represents a (partial) path to the components that must have their fonts resized. The right-hand sized represent a ';'-separated list of the command to perform on those texts.\n\nIn the shown example it will reduce the font size of all texts below the specified path to 50%.\n\nLike any other translation file, these files also support translation scoping, as decribed in [this section](#translation-scoping).\n\nThe following types of commands exists:\n * Commands that change the font size to a static size:\n   * `ChangeFontSizeByPercentage(double percentage)`: Where the percentage is the percentage of the original font size to reduce it to.\n   * `ChangeFontSize(int size)`: Where the size if the new size of the font\n   * `IgnoreFontSize()`: This can be used to reset font resize behavior that was set on a very 'non-specific' path.\n * Commands that control auto-resizing:\n   * `AutoResize(bool enabled, minSize, maxSize)`: Where enabled control if auto-resize behaviour should be enabled. The two last parameters are optional.\n     * minSize, maxSize possible values: [keep, none, any number]\n * Commands that control the line spacing (UGUI only):\n   * `UGUI_ChangeLineSpacingByPercentage(float percentage)`\n   * `UGUI_ChangeLineSpacing(float lineSpacing)`\n * Commands that control horizontal overflow (UGUI only):\n   * `UGUI_HorizontalOverflow(string mode)` - possible values: [wrap, overflow]\n * Commands that control vertical overflow (UGUI only):\n   * `UGUI_VerticalOverflow(string mode)` - possible values: [truncate, overflow]\n * Commands to control overflow (TMP only):\n   * `TMP_Overflow(string mode)` - [possible values](https://docs.unity3d.com/Packages/com.unity.textmeshpro@3.0/api/TMPro.TextOverflowModes.html)\n * Commands to control text alignment (TMP only):\n   * `TMP_Alignment(string mode)` - [possible values](https://docs.unity3d.com/Packages/com.unity.textmeshpro@3.0/api/TMPro.TextAlignmentOptions.html)\n\nBut stop you say! How would I determine the path to use? This plugin provides no way to easily determine this, but there are other plugins that will allow you to do this.\n\nThere's two ways, and you will likely need to use both of them:\n * Using [Runtime Unity Editor](https://github.com/ManlyMarco/RuntimeUnityEditor) to determine these.\n * Enabling the option `[Behaviour] EnableTextPathLogging=True`, which will log out the path to all text components that text are changed on.\n\n### Translation Scoping\nThe following two options are available when it comes to scoping translations to only part of the game:\n\nThe translation files support the following directives:\n * `#set level 1,2,3` tells the plugin that translations following this line in this file may only be applied in scenes with ID 1, 2 or 3.\n * `#unset level 1,2,3` tells the plugin that translations following this line in this file should not be applied in scenes with ID 1, 2 or 3. If no levels are set, all specified translations are global.\n * `#set exe game1,game2` tells the plugin that translations following this line in this file may only be applied when the game is run through an executable with the name game1 or game2.\n * `#unset exe game1,game2` tells the plugin that translations following this line in this file should not be applied when the game is run through an executable with the name game1 or game2. If no exes are set, all specified translations are global.\n * `#set required-resolution height > 1280 && width > 720` tells the plugin that translations following this line in this file should only be applied if the resolution is greater than specified. Current implementation only handles the resolution used by the game at startup.\n * `#unset required-resolution` tells the plugin to ignore previously specified `#set required-resolution` directive.\n\nFor this to work, the following configuration option must be `True`:\n\n```\n[Behaviour]\nEnableTranslationScoping=True\n```\n\nAlso, this behaviour is not available in the `OutputFile`.\n\nYou can always see which levels are loaded by using the hotkey CTRL+ALT+NP7.\n\nAnother way of scoping translations are through file names. It is possible to tell the plugin where to look for translation files. It is possible to parameterize these paths with the variable {GameExeName}.\n\nExample configuration that seperates translations for each executable:\n\n```\n[Files]\nDirectory=Translation\\{GameExeName}\\{Lang}\\Text\nDirectory=Translation\\{GameExeName}\\{Lang}\\Text\\_AutoGeneratedTranslations.txt\nDirectory=Translation\\{GameExeName}\\{Lang}\\Text\\_Substitutions.txt\n```\n\nSo when should use scope your translations? Well that depends on the type of scope:\n * `level` scopes should really only be used to avoid translation collisions\n * `exe` scopes can be used both to avoid translation collisions and to enhance performance\n\n### Text Lookup and Whitespace Handling\nThis section is provided to give the translator an understanding of how this plugin looks up texts and provides translations.\n\nIn the simplest form, the way the plugin works is as a dictionary of untranslated text strings. When plugin sees a text that it considers untranslated, it will attempt to look up the text string in the dictionary and if it finds a result, it will display the found translation instead.\n\nThe world, however, is not always that simple. Depending on the engine/text framework used by a game, an untranslated text string may be slightly different when used in different contexts. For example for a VN it may not be the exact same text string that appears in the \"ADV history\"-view as it was when it was being initially displayed to the user.\n\n**Example:**\n```\n「こう見えて怒っているんですよ？……失礼しますね」\n「こう見えて怒っているんですよ？\\n ……失礼しますね」\n```\n\nThese text strings are not the same and it would be annoying having to translate the same text multiple times if the final translation is supposed to be the same. \n\nIn fact, only one of these translations are needed. Here's why: (still very much simplified):\n 1. When the plugin sees an untranslated text, it will actually make four lookups, not one. These are, in order:\n    * Based on the untouched original text\n    * Based on the original text but without leading/trailing whitespace. If found the leading/trailing whitespace is added to the resulting translation\n    * Based on the original text but without internal non-repeating whitespace surrounding a newline\n    * Based on the original text but without leading/trailing whitespace and internal non-repeating whitespace surrounding a newline. If found the leading/trailing whitespace is added to the resulting translation\n\nThis means that for the following string `\\n 「こう見えて怒っているんですよ？\\n ……失礼しますね」` the plugin will make the following lookups:\n```\n\\n 「こう見えて怒っているんですよ？\\n ……失礼しますね」\n「こう見えて怒っているんですよ？\\n ……失礼しますね」\n\\n 「こう見えて怒っているんですよ？……失礼しますね」\n「こう見えて怒っているんですよ？……失礼しますね」\n```\n\n 2. When the plugin loads the (manual/automatic) translation it will not make one dictionary entry, but three. These are:\n    * Based on the untouched original text and original translation\n    * Based on the original text (without leading/trailing whitespace) and original translation (without leading/trailing whitespace)\n    * Based on the original text (without leading/trailing whitespace and internal non-repeating whitespace surrounding a newline) and original translation (without leading/trailing whitespace and internal non-repeating whitespace surrounding a newline)\n   \nThis means that for the following string `\\n 「こう見えて怒っているんですよ？\\n ……失礼しますね」` the plugin will make the following entries:\n```\n\\n 「こう見えて怒っているんですよ？\\n ……失礼しますね」\n「こう見えて怒っているんですよ？\\n ……失礼しますね」\n「こう見えて怒っているんですよ？……失礼しますね」\n```\n\nThis means you can get away with providing a single translation for both of these cases. Which you think is better is up to you.\n\nAnother thing to note is that the plugin will always output the original text without modifications in the translation file. But if it sees another text afterwards that is \"compatible\" with that text-string (due to the above mentioned text modifications) it will not output this new text by default.\n\nThis is controlled by the configuration option `CacheWhitespaceDifferences=False`. You can change this to true, and it will output a new entry for each unique text, even if the only differences are whitespace. Obviously, translations-pairs actually appearing in the translation file will always that precendent over translations-pairs that are generated based on an exinsting translation-pair.\n\n*NOTE: Whitespace differences in relation to level-scoped translations will never be output regardless of this setting.*\n\n### Resource Redirection\nSometimes it's easier to provide a translation to a game by directly overriding the game resource files. However, directly overriding the game resource files is also problematic because that means the modification will likely only work for one version of the game.\n\nTo overcome this problem, and allow for modification of resource files, this plugin also has a resource redirector module that allows redirecting any kind of resource loaded by the game.\n\nBefore we get into the details of this module, it is worth mentioning that it is:\n * It is not a plugin. Rather it is just a library that is not beholden to any plugin manager (it does come with a plugin-compatible BepInEx DLL but this is only to manage configuration).\n * It is game independent.\n * And while it may be redistributed with the Auto Translator, it is completely independent from it and it can be used without having the Auto Translator installed.\n\nThe DLLs required for the Resource Redirector to work are `XUnity.Common.dll` and `XUnity.ResourceRedirector.dll`. By themselves, these libraries do nothing.\n\nBy default the Auto Translator plugin comes with one resource redirector for `TextAsset`, which basically outputs the raw text assets to the file system allowing them to be individually overridden.\n\nMore redirectors can be implemented for specific games, though this does require programming knowledge, see [this section](#implementing-a-resource-redirector) for more information.\n\nThe Auto Translator has the following Resource Redirector-specific configuration:\n * `PreferredStoragePath`: Indicates where the Auto Translator should store redirected resources.\n * `EnableTextAssetRedirector`: Indicates if the TextAsset redirector is enabled.\n * `LogAllLoadedResources`: Indicates if Resource Redirector should log all resources to the console (can also be controlled through Resource Redirector API surface).\n * `EnableDumping`: Indicates if resources redirected to the Auto Translator should be dumped for overwriting if possible.\n * `CacheMetadataForAllFiles`: When files are in ZIP files in the PreferredStoragePath, these files are indexed in memory to avoid performing file check IO when loading them. Enabling this option will do the same for physical files\n\nZIP files that are placed in the `PreferredStoragePath` will be indexed during startup, allowing redirected resources to be compressed and zipped. When files are placed in a zip file, the zip file is simply treated as not existing during file lookup.\n\n## Regarding Redistribution\nRedistributing this plugin for various games is absolutely encouraged. However, if you do so, please keep the following in mind:\n * **Distribute the _AutoGeneratedTranslations.txt file along with the redistribution with as many translations as possible to ensure the online translator is hit as little as possible.**\n * **Test your redistribution with logging/console enabled to ensure the game does not exhibit undesirable behaviour such as spamming the endpoints.**\n * Do not redistribute the plugin with a non-default translation endpoint configured which comes from this repository. This means:\n   * Don't set `Endpoint=DeepLTranslate` and then redistribute.\n   * However, if you implemented your own endpoint or the endpoint is not a part of this repository, you can go ahead and redistribute it with that as the default endpoint.\n * Ensure you keep the plugin up-to-date, as much as reasonably possible.\n * If you use image loading feature, make sure you read [this section](#texture-translation).\n\n## Texture Translation\nFrom version 2.16.0+ this mod provides basic capabilities to replace images. It is a feature that is disabled by default. There is no automatic translation of these images though.\n\nThis feature is primarily meant for games with little to no mod support to enable full translations without needing to modify resource files.\n\nIt is controlled by the following configuration:\n\n```ini\n[Texture]\nTextureDirectory=Translation\\Texture\nEnableTextureTranslation=False\nEnableTextureDumping=False\nEnableTextureToggling=False\nEnableTextureScanOnSceneLoad=False\nEnableSpriteRendererHooking=False\nLoadUnmodifiedTextures=False\nTextureHashGenerationStrategy=FromImageName\nDuplicateTextureNames=\nDetectDuplicateTextureNames=False\nEnableLegacyTextureLoading=False\nCacheTexturesInMemory=True\n```\n\n`TextureDirectory` specifies the directory where textures are dumped to and loaded from. Loading will happen from all subdirectories of the specified directory as well, so you can move dumped images to whatever folder structure you desire.\n\n`EnableTextureTranslation` enables texture translation. This basically means that textures will be loaded from the `TextureDirectory` and it's subsdirectories. These images will replace the in-game images used by the game.\n\n`EnableTextureDumping` enables texture dumping. This means that the mod will dump any images it has not already dumped to the `TextureDirectory`. When dumping textures, it may also be worth enabling `EnableTextureScanOnSceneLoad` to more quickly find all textures that require translating. **Never redistribute the mod with this enabled.**\n\n`EnableTextureScanOnSceneLoad` allows the plugin to scan for texture objects on the sceneLoad event. This enables the plugin to find more texture at a tiny performance cost during scene load (which is often during loading screens, etc.). However, because of the way Unity works not all of these are guaranteed to be replacable. If you find an image that is dumped but cannot be translated, please report it. However, please recognize this mod is primarily intended for replacing UI textures, not textures for 3D meshes.\n\n`EnableSpriteRendererHooking` allows the plugin to attempt to hook SpriteRenderer. This is a seperate option because SpriteRenderer can't actually be hooked properly and the implemented workaround could have a theoretical impact on performance in certain situations.\n\n`LoadUnmodifiedTextures` enables whether or not the plugin should load textures that has not been modified. This is only useful for debugging, and likely to cause various visual glitches, especially if `EnableTextureScanOnSceneLoad` is also enabled. **Never redistribute the mod with this enabled.**\n\n`EnableTextureToggling` enables whether the ALT+T hotkey will also toggle textures. This is by no means guaranteed to work, especially if `EnableTextureScanOnSceneLoad` is also enabled. **Never redistribute the mod with this enabled.**\n\n`DuplicateTextureNames` specifies different textures in the game that are used under the same resource name. The plugin will fallback to the 'FromImageData' for image identification for these images.\n\n`DetectDuplicateTextureNames` specifies that the plugin should identify which image names are duplicated and update the configuration with these names automatically. **Never redistribute the mod with this enabled.**\n\n`EnableLegacyTextureLoading` specifies that the plugin should use attempt to load images differently, which may be relevant if the unity engine is old (verified with versions less than 5.3). This should not be used unless the images that are loaded are not the ones that you expected.\n\n`CacheTexturesInMemory` specifies that all translation textures should be kept in memory to optimize performance. Can be disabled to reduce memory usage.\n\n`TextureHashGenerationStrategy` specifies how images are identified. When images are stored, the game will need some way of associating them with the image that it has to replace.\nThis is done through a hash-value that is stored in square brackets in each image file name, like this: `file_name [0223B639A2-6E698E9272].png`. This configuration specifies how these hash-values are generated:\n * `FromImageName` means that the hash is generated from the internal resource name that the game uses for the image, which may not exist for all images or even be unique. However, it is generally fairly reliable. If an image has no resource name, it will not be dumped.\n * `FromImageData` means that the hash is generated from the data stored in the image, which is guaranteed to exist for all images. However, generating the hash comes at a performance cost, that will also be incurred by the end-users.\n * `FromImageNameAndScene` means that it should use the name and scene to generate a hash. The name is still required for this to work. When using this option, there is a chance the same texture could be dumped with different hashes, which is undesirable, but it could be required for some games, if the name itself is not unique and the `FromImageData` option causes performance issues. If this is used, it is recommended to enable `EnableTextureScanOnSceneLoad` as well.\n\nThere's an important catch you need to be aware when dealing with these options and that is if ANY of these options exists: `EnableTextureDumping=True`, `EnableTextureToggling=True`, `TextureHashGenerationStrategy=FromImageData`, then the game will need to read the raw data from all images it finds in game in order to replace the image and this is an expensive operation.\n\nIt is therefore recommended to use `TextureHashGenerationStrategy=FromImageName`. Most likely, images without a resource name won't be interesting to translate anyway.\n\nIf you redistribute this mod with translated images, it is recommended you delete all images you either have no intention of translating or are not translated at all.\n\nYou can also change the file name to whatever you desire, as long as you keep the hash appended to the end of the file name.\n\nIf you take anything away from this section, it should be these two points:\n * **Never redistribute the mod with `EnableTextureDumping=True`, `EnableTextureToggling=True`, `LoadUnmodifiedTextures=True` or `DetectDuplicateTextureNames=true`**\n * **Only redistribute the mod with `TextureHashGenerationStrategy=FromImageData` enabled if absolutely required by the game.**\n\n### Technical details about Hash Generation in file names\nThere are actually two hashes in the generated file name, separated by a dash (-):\n * The first hash is a SHA1 (only first 5 bytes) based on the `TextureHashGenerationStrategy` used. If `FromImageName` is specified, then it is based on the UTF8 (without BOM) representation.\n * The second hash is a SHA1 (only first 5 bytes) based on the data in the image. This is used to determine whether or not the image has been modified, so images that has not been edited are not loaded. Unless `LoadUnmodifiedTextures` is specified.\n\nIf `TextureHashGenerationStrategy=FromImageData` is specified, only a single hash will appear in each file name, as that single hash can be used both to identify the image and to determine whether or not it has been edited.\n\n## Integrating with Auto Translator\n*NOTE: Everything below this point requires programming knowledge!*\n\n### Implementing a plugin that can query translations\nAs a mod author, you may want to query translations from the plugin. This easily done, take a look at the example below.\n\n```C#\npublic class MyPlugin : XPluginBase\n{\n   public void Start()\n   {\n      var untranslatedText = \"お前はもう死んでいる！\";\n\n      // EXAMPLE 1) Query cache, and if it cannot be found in cache query the user-selected translation endpoint\n      AutoTranslator.Default.TranslateAsync( untranslatedText, result =>\n      {\n         if( result.Succeeded )\n         {\n            var translatedText = result.TranslatedText;\n         }\n         else\n         {\n            var errorMessage = result.ErrorMessage;\n         }\n      } );\n\n      // EXAMPLE 2) Query cache only\n      if( AutoTranslator.Default.TryTranslate( untranslatedText, out string translation ) )\n      {\n         // success\n      }\n      else\n      {\n         // failure\n      }\n   }\n}\n```\n\nThis requires version 3.7.0 or later!\n\n### Implementing a component that the Auto Translator should not interfere with\nAs a mod author, you might not want the Auto Translator to interfere with your mods UI. If this is the case there's two ways to tell Auto Translator not to perform any translation:\n * If your UI is based on GameObjects, you can simply name your GameObjects containing the text element (for example Text class) to something that contains the string \"XUAIGNORE\". The Auto Translator will check for this and ignore components that contains the string.\n * If your UI is based on IMGUI, the above approach is not possible, because there are no GameObject. In that case you can do the following instead:\n\n```C#\npublic class MyPlugin : XPluginBase\n{\n   private GameObject _xua;\n   private bool _lookedForXua;\n\n   public void OnGUI()\n   {\n      // make sure we only do this lookup once, as it otherwise may be detrimental to performance!\n      // also: do not attempt to do this in the Awake method or similar of your plugin, as your plugin may be instantiated before the auto translator!\n      if(!_lookedForXua)\n      {\n         _lookedForXua = true;\n         _xua = GameObject.Find( \"___XUnityAutoTranslator\" );\n      }\n\n      // try-finally block is important to make sure you re-enable the plugin\n      try\n      {\n         _xua?.SendMessage(\"DisableAutoTranslator\");\n\n         // do your GUI things here\n         GUILayout.Button( \"こんにちは！\" );\n      }\n      finally\n      {\n         _xua?.SendMessage(\"EnableAutoTranslator\");\n      }\n   }\n}\n```\n\nThis requires version 2.15.0 or later!\n\n## Implementing a Translator\nSince version 3.0.0, you can now also implement your own translators.\n\nIn order to do so, all you have to do is implement the following interface, build the assembly and place the generated DLL in the `Translators` folder.\n\n```C#\n/// <summary>\n/// The interface that must be implemented by a translator.\n/// </summary>\npublic interface ITranslateEndpoint\n{\n   /// <summary>\n   /// Gets the id of the ITranslateEndpoint that is used as a configuration parameter.\n   /// </summary>\n   string Id { get; }\n\n   /// <summary>\n   /// Gets a friendly name that can be displayed to the user representing the plugin.\n   /// </summary>\n   string FriendlyName { get; }\n\n   /// <summary>\n   /// Gets the maximum concurrency for the endpoint. This specifies how many times \"Translate\"\n   /// can be called before it returns.\n   /// </summary>\n   int MaxConcurrency { get; }\n\n   /// <summary>\n   /// Gets the maximum number of translations that can be served per translation request.\n   /// </summary>\n   int MaxTranslationsPerRequest { get; }\n\n   /// <summary>\n   /// Called during initialization. Use this to initialize plugin or throw exception if impossible.\n   /// </summary>\n   void Initialize( IInitializationContext context );\n\n   /// <summary>\n   /// Attempt to translated the provided untranslated text. Will be used in a \"coroutine\",\n   /// so it can be implemented in an asynchronous fashion.\n   /// </summary>\n   IEnumerator Translate( ITranslationContext context );\n}\n```\n\nOften an implementation of this interface will access an external web service. If this is the case, you do not need to implement the entire interface yourself. Instead you can rely on a base class in the `XUnity.AutoTranslator.Plugin.Core` assembly. But more on this later.\n\n### Important Notes on Implementing a Translator based on an Online Service\nWhenever you implement a translator based on an online service, it is important to not use it in an abusive way. For example by:\n * Establishing a large number of connections to it\n * Performing web scraping instead of using an available API\n * Making concurrent requests towards it\n * *This is especially important if the service is not authenticated*\n\nWith that in mind, consider the following:\n * The `WWW` class in Unity establishes a new TCP connection on each request you make, making it extremely poor at this kind of job. Especially if SSL (https) is involved because it has to do the entire handshake procedure each time. Yuck.\n * The `UnityWebRequest` class in Unity does not exist in most games, because the authors use an old engine, so it is not a good choice either.\n * The `WebClient` class from .NET is capable of using persistent connections (it does so by default), but has its own problems with SSL. The version of Mono used in most Unity games rejects all certificates by default making all HTTPS connections fail. This, however, can be remedied during the initialization phase of the translator (see examples below). Another shortcoming of this API is the fact that the runtime will never release the TCP connections it has used until the process ends. The API also integrates terribly with Unity because callbacks return on a background thread.\n * The `WebRequest` class from .NET is essentially the same as WebClient.\n * The `HttpClient` class from .NET is also unlikely to exist in most Unity games.\n\nNone of these are therefore an ideal solution.\n\nTo remedy this, the plugin implements a class `XUnityWebClient`, which is based on Mono's version of WebClient. However, it adds the following features:\n * Enables integration with Unity by returning result classes that can be 'yielded'.\n * Properly closes connections that has not been used for 50 seconds.\n\nI recommend using this class, or in case that cannot be used, falling back to the .NET 'WebClient'.\n\n### How-To\nFollow these steps:\n 1. Download XUnity.AutoTranslator-Developer-{VERSION}.zip from [releases](../../releases)\n 2. Start a new project (.NET 3.5) in Visual Studio 2017 or later. I recommend using the same name for your assembly/project as the \"Id\" you are going to use in your interface implementation. This makes it easier for users to know how to configure your translator\n    * I recommend using the \"Class Library (.NET Standard)\" and simply editing the generated .csproj file to use 'net35' instead of 'netstandard2.0'. This generates much cleaner .csproj files.\n 3. Add a reference to the XUnity.AutoTranslator.Plugin.Core.dll that you downloaded in step 1\n 4. You do not need to directly reference the UnityEngine.dll assembly. This is good, because you do not need to worry about which version of Unity is used.\n    * If you do need a reference to this assembly (because you need functionality from it) consider using an old version of it (if `UnityEngine.CoreModule.dll` exists in the Managed folder, it is not an old version!)\n 5. Create a new class that either:\n    * Implements the `ITranslateEndpoint` interface\n    * Inherits from the `HttpEndpoint` class\n    * Inherits from the `WwwEndpoint` class\n    * Inherits from the `ExtProtocolEndpoint` class\n\nHere's an example that simply reverses the text and also reads some configuration from the configuration file the plugin uses:\n\n```C#\npublic class ReverseTranslatorEndpoint : ITranslateEndpoint\n{\n   private bool _myConfig;\n\n   public string Id => \"ReverseTranslator\";\n\n   public string FriendlyName => \"Reverser\";\n\n   public int MaxConcurrency => 50;\n\n   public int MaxTranslationsPerRequest => 1;\n\n   public void Initialize( IInitializationContext context )\n   {\n      _myConfig = context.GetOrCreateSetting( \"Reverser\", \"MyConfig\", true );\n   }\n\n   public IEnumerator Translate( ITranslationContext context )\n   {\n      var reversedText = new string( context.UntranslatedText.Reverse().ToArray() );\n      context.Complete( reversedText );\n\n      return null;\n   }\n}\n```\n\nArguably, this is not a particularly interesting example, but it illustrates the basic principles of what must be done in order to implement a Translator.\n\nLet's take a look at a more advanced example that accesses the web:\n\n```C#\ninternal class YandexTranslateEndpoint : HttpEndpoint\n{\n   private static readonly HashSet<string> SupportedLanguages = new HashSet<string> { \"az\", \"sq\", \"am\", \"en\", \"ar\", \"hy\", \"af\", \"eu\", \"ba\", \"be\", \"bn\", \"my\", \"bg\", \"bs\", \"cy\", \"hu\", \"vi\", \"ht\", \"gl\", \"nl\", \"mrj\", \"el\", \"ka\", \"gu\", \"da\", \"he\", \"yi\", \"id\", \"ga\", \"it\", \"is\", \"es\", \"kk\", \"kn\", \"ca\", \"ky\", \"zh\", \"ko\", \"xh\", \"km\", \"lo\", \"la\", \"lv\", \"lt\", \"lb\", \"mg\", \"ms\", \"ml\", \"mt\", \"mk\", \"mi\", \"mr\", \"mhr\", \"mn\", \"de\", \"ne\", \"no\", \"pa\", \"pap\", \"fa\", \"pl\", \"pt\", \"ro\", \"ru\", \"ceb\", \"sr\", \"si\", \"sk\", \"sl\", \"sw\", \"su\", \"tg\", \"th\", \"tl\", \"ta\", \"tt\", \"te\", \"tr\", \"udm\", \"uz\", \"uk\", \"ur\", \"fi\", \"fr\", \"hi\", \"hr\", \"cs\", \"sv\", \"gd\", \"et\", \"eo\", \"jv\", \"ja\" };\n   private static readonly string HttpsServicePointTemplateUrl = \"https://translate.yandex.net/api/v1.5/tr.json/translate?key={3}&text={2}&lang={0}-{1}&format=plain\";\n\n   private string _key;\n\n   public override string Id => \"YandexTranslate\";\n\n   public override string FriendlyName => \"Yandex Translate\";\n\n   public override void Initialize( IInitializationContext context )\n   {\n      _key = context.GetOrCreateSetting( \"Yandex\", \"YandexAPIKey\", \"\" );\n      context.DisableCertificateChecksFor( \"translate.yandex.net\" );\n\n      // if the plugin cannot be enabled, simply throw so the user cannot select the plugin\n      if( string.IsNullOrEmpty( _key ) ) throw new Exception( \"The YandexTranslate endpoint requires an API key which has not been provided.\" );\n      if( !SupportedLanguages.Contains( context.SourceLanguage ) ) throw new Exception( $\"The source language '{context.SourceLanguage}' is not supported.\" );\n      if( !SupportedLanguages.Contains( context.DestinationLanguage ) ) throw new Exception( $\"The destination language '{context.DestinationLanguage}' is not supported.\" );\n   }\n\n   public override void OnCreateRequest( IHttpRequestCreationContext context )\n   {\n      var request = new XUnityWebRequest(\n         string.Format(\n            HttpsServicePointTemplateUrl,\n            context.SourceLanguage,\n            context.DestinationLanguage,\n            WwwHelper.EscapeUrl( context.UntranslatedText ),\n            _key ) );\n         \n      request.Headers[ HttpRequestHeader.Accept ] = \"*/*\";\n      request.Headers[ HttpRequestHeader.AcceptCharset ] = \"UTF-8\";\n\n      context.Complete( request );\n   }\n\n   public override void OnExtractTranslation( IHttpTranslationExtractionContext context )\n   {\n      var data = context.Response.Data;\n      var obj = JSON.Parse( data );\n\n      var code = obj.AsObject[ \"code\" ].ToString();\n      if( code != \"200\" ) context.Fail( \"Received bad response code: \" + code );\n\n      var token = obj.AsObject[ \"text\" ].ToString();\n      var translation = JsonHelper.Unescape( token.Substring( 2, token.Length - 4 ) );\n\n      if( string.IsNullOrEmpty( translation ) ) context.Fail( \"Received no translation.\" );\n\n      context.Complete( translation );\n   }\n}\n```\n\nThis plugin extends from `HttpEndpoint`. Let's look at the three methods it overrides:\n * `Initialize` is used to read the API key the user has configured. In addition it calls `context.DisableCertificateChecksFor( \"translate.yandex.net\" )` in order to disable the certificate check for this specific hostname. If this is neglected, SSL will fail in most versions of Unity. Finally, it throws an exception if the plugin cannot be used with the specified configuration.\n * `OnCreateRequest` is used to construct the `XUnityWebRequest` object that will be sent to the external endpoint. The call to `context.Complete( request )` specifies the request to use.\n * `OnExtractTranslation` is used to extract the text from the response returned from the web server.\n\nAs you can see, the `XUnityWebClient` class is not even used. We simply specify a request object that the `HttpEndpoint` will use internally to perform the request.\n\nAfter implementing the class, simply build the project and place the generated DLL file in the \"Translators\" directory of the plugin folder. That's it.\n\nFor more examples of implementations, you can simply take a look at this projects source code.\n\n**NOTE**: If you implement a class based on the `HttpEndpoint` and you get an error where the web request is never completed, then it is likely due to the web server requiring Tls1.2. Unity-mono has issues with this spec and it will cause the request to lock up forever. The only solutions to this for now are:\n * Disable SSL, if you can. There are many situations where it is simply not possible to do this because the web server will simply redirect back to the HTTPS endoint.\n * Use the `WwwEndpoint` instead. I highly advice against this though, unless it is an authenticated endpoint.\n\nAnother way to implement a translator is to implement the `ExtProtocolEndpoint` class. This can be used to delegate the actual translation logic to an external process. Currently there is no documentation on this, but you can take a look at the LEC implementation, which uses it.\n\nIf instead, you use the interface directly, it is also possible to extend from MonoBehaviour to get access to all the normal lifecycle callbacks of Unity components.\n\n## Implementing a Resource Redirector\nThe resource director allows you to modify resources loaded through the `Resources` and `AssetBundle` API as they are being loaded by the game.\n\nThe following API surface is made available by the Resource Redirector:\n\n```C#\n/// <summary>\n/// Entrypoint to the resource redirection API.\n/// </summary>\npublic static class ResourceRedirection\n{\n    /// <summary>\n    /// Gets or sets a bool indicating if the resource redirector\n    /// should log all loaded resources/assets to the console.\n    /// </summary>\n    public static bool LogAllLoadedResources { get; set; }\n\n    /// <summary>\n    /// Register an AssetLoading hook (prefix to loading an asset from an asset bundle).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAssetLoadingHook( int priority, Action<AssetLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AssetLoading hook (prefix to loading an asset from an asset bundle).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAssetLoadingHook( Action<AssetLoadingContext> action );\n\n    /// <summary>\n    /// Register an AsyncAssetLoading hook (prefix to loading an asset from an asset bundle asynchronously).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAsyncAssetLoadingHook( int priority, Action<AsyncAssetLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AsyncAssetLoading hook (prefix to loading an asset from an asset bundle asynchronously).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAsyncAssetLoadingHook( Action<AsyncAssetLoadingContext> action );\n\n    /// <summary>\n    /// Register an AsyncAssetLoading hook and AssetLoading hook (prefix to loading an asset from an asset bundle synchronously/asynchronously).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAsyncAndSyncAssetLoadingHook( int priority, Action<IAssetLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AsyncAssetLoading hook and AssetLoading hook (prefix to loading an asset from an asset bundle synchronously/asynchronously).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAsyncAndSyncAssetLoadingHook( Action<IAssetLoadingContext> action );\n\n    /// <summary>\n    /// Register an AssetLoaded hook (postfix to loading an asset from an asset bundle (both synchronous and asynchronous)).\n    /// </summary>\n    /// <param name=\"behaviour\">The behaviour of the callback.</param>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAssetLoadedHook( HookBehaviour behaviour, int priority, Action<AssetLoadedContext> action );\n\n    /// <summary>\n    /// Unregister an AssetLoaded hook (postfix to loading an asset from an asset bundle (both synchronous and asynchronous)).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAssetLoadedHook( Action<AssetLoadedContext> action );\n\n    /// <summary>\n    /// Register an AssetBundleLoading hook (prefix to loading an asset bundle synchronously).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAssetBundleLoadingHook( int priority, Action<AssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AssetBundleLoading hook (prefix to loading an asset bundle synchronously).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAssetBundleLoadingHook( Action<AssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Register an AsyncAssetBundleLoading hook (prefix to loading an asset bundle asynchronously).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAsyncAssetBundleLoadingHook( int priority, Action<AsyncAssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AsyncAssetBundleLoading hook (prefix to loading an asset bundle asynchronously).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAsyncAssetBundleLoadingHook( Action<AsyncAssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Register an AsyncAssetBundleLoading hook and AssetBundleLoading hook (prefix to loading an asset bundle synchronously/asynchronously).\n    /// </summary>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterAsyncAndSyncAssetBundleLoadingHook( int priority, Action<IAssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Unregister an AsyncAssetBundleLoading hook and AssetBundleLoading hook (prefix to loading an asset bundle synchronously/asynchronously).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterAsyncAndSyncAssetBundleLoadingHook( Action<IAssetBundleLoadingContext> action );\n\n    /// <summary>\n    /// Register a ReourceLoaded hook (postfix to loading a resource from the Resources API (both synchronous and asynchronous)).\n    /// </summary>\n    /// <param name=\"behaviour\">The behaviour of the callback.</param>\n    /// <param name=\"priority\">The priority of the callback, the higher the sooner it will be called.</param>\n    /// <param name=\"action\">The callback.</param>\n    public static void RegisterResourceLoadedHook( HookBehaviour behaviour, int priority, Action<ResourceLoadedContext> action );\n\n    /// <summary>\n    /// Unregister a ReourceLoaded hook (postfix to loading a resource from the Resources API (both synchronous and asynchronous)).\n    /// </summary>\n    /// <param name=\"action\">The callback.</param>\n    public static void UnregisterResourceLoadedHook( Action<ResourceLoadedContext> action );\n\n    /// <summary>\n    /// Enables experimental hooks that allows returning an Asset instead of a Request from async prefix\n    /// asset load operations.\n    /// </summary>\n    public static void EnableSyncOverAsyncAssetLoads();\n\n    /// <summary>\n    /// Disables all recursive behaviour in the plugin. This means that trying to load an asset\n    /// using the hooked APIs will not trigger a callback back into the callback chain. This makes\n    /// setting the correct priorities on callbacks much more important.\n    ///\n    /// This method should not be called lightly. It should not be something a single plugin randomly\n    /// decides to call, but rather decision for how to use the ResourceRedirection API on a game-wide basis.\n    /// </summary>\n    public static void DisableRecursionPermanently();\n\n    /// <summary>\n    /// Creates an asset bundle hook that attempts to load asset bundles in the emulation directory\n    /// over the default asset bundles if they exist.\n    /// </summary>\n    /// <param name=\"hookPriority\">Priority of the hook.</param>\n    /// <param name=\"emulationDirectory\">The directory to look for the asset bundles in.</param>\n    public static void EnableEmulateAssetBundles( int hookPriority, string emulationDirectory );\n\n    /// <summary>\n    /// Disable a previously enabled asset bundle emulation.\n    /// </summary>\n    public static void DisableEmulateAssetBundles();\n\n    /// <summary>\n    /// Creates an asset bundle hook that redirects asset bundles loads to an empty\n    /// asset bundle if the file that is being loaded does not exist.\n    /// </summary>\n    /// <param name=\"hookPriority\">Priority of the hook.</param>\n    public static void EnableRedirectMissingAssetBundlesToEmptyAssetBundle( int hookPriority );\n\n    /// <summary>\n    /// Disable a previously enabled redirect missing asset bundles to empty asset bundle.\n    /// </summary>\n    public static void DisableRedirectMissingAssetBundlesToEmptyAssetBundle();\n}\n\n```\n\nLet's attach some comments to this API.\n\n### Asset Loading/Loaded Methods\nThe resource redirector comes with both postfix and prefix callbacks when loading an asset from the `AssetBundle` API.\n\nThe event callback chain looks like this `[AssetLoading / AsyncAssetLoading hooks] => [Original Method] => [AssetLoaded hooks]`. The `AssetLoaded` event handles postfixes for both synchronous and asynchronous loading of assets.\n\n#### Asset Loading Methods\nThe methods `RegisterAssetLoadingHook( HookBehaviour behaviour, Action<AssetLoadingContext> action )` and `RegisterAsyncAssetLoadingHook( int priority, Action<AsyncAssetLoadingContext> action )` hooks into the `AssetBundle` API when loading assets.\n\nThese methods registers prefix callbacks, which means the assets themselves wont be loaded yet when they are called.\n\nThe callbacks take the types `AssetLoadingContext` and `AsyncAssetLoadingContext` as an argument, respectively. Let's take a look at their definitions:\n\n```C#\n/// <summary>\n/// The operation context surrounding the AssetLoading hook (synchronous).\n/// </summary>\npublic class AssetLoadingContext : IAssetLoadingContext\n{\n    /// <summary>\n    /// Gets the original path the asset bundle was loaded with.\n    /// </summary>\n    /// <returns>The unmodified, original path the asset bundle was loaded with.</returns>\n    public string GetAssetBundlePath();\n\n    /// <summary>\n    /// Gets the normalized path to the asset bundle that is:\n    ///  * Relative to the current directory\n    ///  * Lower-casing\n    ///  * Uses '\\' as separators.\n    /// </summary>\n    /// <returns></returns>\n    public string GetNormalizedAssetBundlePath();\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset/resource load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPrefixes\">Indicate if the remaining prefixes should be skipped.</param>\n    /// <param name=\"skipOriginalCall\">Indicate if the original call should be skipped. If you set the asset, you likely want to set this to true.</param>\n    /// <param name=\"skipAllPostfixes\">Indicate if the postfixes should be skipped.</param>\n    public void Complete( bool skipRemainingPrefixes = true, bool? skipOriginalCall = true, bool? skipAllPostfixes = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the original parameters the asset load call was called with.\n    /// </summary>\n    public AssetLoadingParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets the AssetBundle associated with the loaded assets.\n    /// </summary>\n    public AssetBundle Bundle { get; }\n\n    /// <summary>\n    /// Gets or sets the loaded assets.\n    ///\n    /// Consider using this if the load type is 'LoadByType' or 'LoadNamedWithSubAssets'.\n    /// </summary>\n    public UnityEngine.Object[] Assets { get; set; }\n\n    /// <summary>\n    /// Gets or sets the loaded assets. This is simply equal to the first index of the Assets property, with some\n    /// additional null guards to prevent NullReferenceExceptions when using it.\n    /// </summary>\n    public UnityEngine.Object Asset { get; set; }\n}\n\n/// <summary>\n/// The operation context surrounding the AsyncAssetLoading hook (asynchronous).\n/// </summary>\npublic class AsyncAssetLoadingContext : IAssetLoadingContext\n{\n    /// <summary>\n    /// Gets the original path the asset bundle was loaded with.\n    /// </summary>\n    /// <returns>The unmodified, original path the asset bundle was loaded with.</returns>\n    public string GetAssetBundlePath();\n\n    /// <summary>\n    /// Gets the normalized path to the asset bundle that is:\n    ///  * Relative to the current directory\n    ///  * Lower-casing\n    ///  * Uses '\\' as separators.\n    /// </summary>\n    /// <returns></returns>\n    public string GetNormalizedAssetBundlePath();\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset/resource load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPrefixes\">Indicate if the remaining prefixes should be skipped.</param>\n    /// <param name=\"skipOriginalCall\">Indicate if the original call should be skipped. If you set the asset, you likely want to set this to true.</param>\n    /// <param name=\"skipAllPostfixes\">Indicate if the postfixes should be skipped.</param>\n    public void Complete( bool skipRemainingPrefixes = true, bool? skipOriginalCall = true, bool? skipAllPostfixes = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the original parameters the asset load call was called with.\n    /// </summary>\n    public AssetLoadingParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets the AssetBundle associated with the loaded assets.\n    /// </summary>\n    public AssetBundle Bundle { get; }\n\n    /// <summary>\n    /// Gets or sets the AssetBundleRequest used to load assets.\n    /// </summary>\n    public AssetBundleRequest Request { get; set; }\n\n    /// <summary>\n    /// Gets or sets the loaded assets.\n    ///\n    /// Consider using this if the load type is 'LoadByType' or 'LoadNamedWithSubAssets'.\n    /// </summary>\n    UnityEngine.Object[] Assets { get; set; }\n\n    /// <summary>\n    /// Gets or sets the loaded assets. This is simply equal to the first index of the Assets property, with some\n    /// additional null guards to prevent NullReferenceExceptions when using it.\n    /// </summary>\n    UnityEngine.Object Asset { get; set; }\n\n    /// <summary>\n    /// Gets or sets how this load operation should be resolved.\n    /// Setting the Asset/Assets/Request property will automatically update this value.\n    /// </summary>\n    public AsyncAssetLoadingResolve ResolveType { get; set; }\n}\n```\n\nThe only difference between these two contexts is that one has an `Asset/Assets` property you can set, while the other has a `Request` property you can set.\n\nNow if you actually paid attention to what you were reading(!?), you would notice that both of the above context objects has an `Asset/Assets` property that can be set.\n\nUnder normal circumstances, however, you cannot use the `Assets/Asset` property on the the `AsyncAssetLoadingContext`. In order to be able to use these, you must first call `ResourceRedirection.EnableSyncOverAsyncAssetLoads` once during your initialization logic. This will allow you to set the asset directly so you don't have to go through the standard `AssetBundle` API to obtain a request object.\n\nIt is, however, recommended that if you can that you set the `Request` property instead of the `Assets/Asset` property as that will keep the operation asynchronous and not block the game while the asset is being loaded.\n\nIf you can handle the loading of the asset remember to call the `Complete` method to indicate your intentions regarding:\n * Whether the rest of the prefixes registered should be skipped.\n * Whether the original method should be skipped.\n * Whether all the postfixes should be skipped.\n\nAn important points to make here, is that there is both an `Asset` and an `Assets` property on the context object. These can be used interchangably, but an array will only ever be used if the following condition apply:\n * The `LoadType` in the `Parameters` property is `LoadByType` or `LoadNamedWithSubAssets`, which are the only types of resource loading that may return multiple resources.\n\nFinally, if we take a look at the `Parameters` property of the context object, we will find the following definition:\n\n```C#\n/// <summary>\n/// Class representing the original parameters of the load call.\n/// </summary>\npublic class AssetLoadingParameters\n{\n    /// <summary>\n    /// Gets or sets the name of the asset being loaded. Will be null if loaded through 'LoadMainAsset' or 'LoadByType'.\n    /// </summary>\n    public string Name { get; set; }\n\n    /// <summary>\n    /// Gets or sets the type that passed to the asset load call.\n    /// </summary>\n    public Type Type { get; set; }\n\n    /// <summary>\n    /// Gets the type of call that loaded this asset. If 'LoadByType' or 'LoadNamedWithSubAssets' is specified\n    /// multiple assets may be returned if subscribed as 'OneCallbackPerLoadCall'.\n    /// </summary>\n    public AssetLoadType LoadType { get; }\n}\n\n/// <summary>\n/// Enum representing the different ways an asset may be loaded.\n/// </summary>\npublic enum AssetLoadType\n{\n    /// <summary>\n    /// Indicates that this asset has been loaded as the 'mainAsset' in the AssetBundle API.\n    /// </summary>\n    LoadMainAsset,\n\n    /// <summary>\n    /// Indicates that this call is loading all assets of a specific type in an AssetBundle API.\n    /// </summary>\n    LoadByType,\n\n    /// <summary>\n    /// Indicates that this call is loading a specific named asset in the AssetBundle API.\n    /// </summary>\n    LoadNamed,\n\n    /// <summary>\n    /// Indicates that this call is loading a specific named asset and all those below it in the AssetBundle API.\n    /// </summary>\n    LoadNamedWithSubAssets\n}\n```\n\nAnother way to change the result of the asset load operation is to change the value of the `Name` and `Type` properties in the `Parameters` property. If you do this, you likely will not want to call the Complete method, as you will want the original method to still be called.\n\nAn important additional way to subscribe to the prefix asset loading operations are through the method `RegisterAsyncAndSyncAssetLoadingHook( int priority, Action<IAssetLoadingContext> action )`. This method will handle both async and sync asset loading operations. The `IAssetLoadingContext` is an interface implemented by both the `AssetLoadingContext` and `AsyncAssetLoadingContext`.\n\nDo note, that if you want to use this method you must first call the method `EnableSyncOverAsyncAssetLoads()` to enable the hooks required for this to work.\n\n#### Asset Loaded Methods\nThe method `RegisterAssetLoadedHook( HookBehaviour behaviour, Action<AssetLoadedContext> action )` hooks into the `AssetBundle` API in the UnityEngine. Any time an asset is loaded through this API a callback is sent to these hooks.\n\nThis API is a postfix hook to the `AssetBundle` API, which means that it is first called once the original asset has already been loaded, but is still replacable.\n\nThe `AssetLoadedContext` class has the following definition:\n\n```C#\n/// <summary>\n/// The operation context surrounding the AssetLoaded hook.\n/// </summary>\npublic class AssetLoadedContext : IAssetOrResourceLoadedContext\n{\n    /// <summary>\n    /// Gets a bool indicating if this resource has already been redirected before.\n    /// </summary>\n    public bool HasReferenceBeenRedirectedBefore( UnityEngine.Object asset );\n\n    /// <summary>\n    /// Gets a file system path for the specfic asset that should be unique.\n    /// </summary>\n    /// <param name=\"asset\"></param>\n    /// <returns></returns>\n    public string GetUniqueFileSystemAssetPath( UnityEngine.Object asset );\n\n    /// <summary>\n    /// Gets the original path the asset bundle was loaded with.\n    /// </summary>\n    /// <returns>The unmodified, original path the asset bundle was loaded with.</returns>\n    public string GetAssetBundlePath();\n\n    /// <summary>\n    /// Gets the normalized path to the asset bundle that is:\n    ///  * Relative to the current directory\n    ///  * Lower-casing\n    ///  * Uses '\\' as separators.\n    /// </summary>\n    /// <returns></returns>\n    public string GetNormalizedAssetBundlePath();\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset/resource load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPostfixes\">Indicate if any other hooks should be skipped.</param>\n    public void Complete( bool skipRemainingPostfixes = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the original parameters the asset load call was called with.\n    /// </summary>\n    public AssetLoadedParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets the AssetBundle associated with the loaded assets.\n    /// </summary>\n    public AssetBundle Bundle { get; }\n\n    /// <summary>\n    /// Gets the loaded assets. Override individual indices to change the asset reference that will be loaded.\n    ///\n    /// Consider using this if the load type is 'LoadByType' or 'LoadNamedWithSubAssets' and you subscribed with 'OneCallbackPerLoadCall'.\n    /// </summary>\n    public UnityEngine.Object[] Assets { get; set; }\n\n    /// <summary>\n    /// Gets the loaded asset. This is simply equal to the first index of the Assets property, with some\n    /// additional null guards to prevent NullReferenceExceptions when using it.\n    /// </summary>\n    public UnityEngine.Object Asset { get; set; }\n}\n```\n\nThe HookBehaviour is an enum with the following definition:\n\n```C#\n/// <summary>\n/// Enum indicating how the resource redirector should treat the callback.\n/// </summary>\npublic enum HookBehaviour\n{\n    /// <summary>\n    /// Specifies that exactly one callback should be received per call to asset/resource load method.\n    /// </summary>\n    OneCallbackPerLoadCall = 1,\n\n    /// <summary>\n    /// Specifies that exactly one callback should be received per loaded asset/resources. This means\n    /// that the 'Asset' property should be used over the 'Assets' property on the context object.\n    /// Do note that when using this option, if no resources are returned by a load call, no callbacks\n    /// will be received.\n    /// </summary>\n    OneCallbackPerResourceLoaded = 2\n}\n```\n\nAn important points to make here, is that there is both an `Asset` and an `Assets` property on the context object. These can be used interchangably, but an array will only ever be used if the following two conditions apply:\n * You've subscribed with `OneCallbackPerLoadCall`.\n * The `LoadType` in the `Parameters` property is `LoadByType` or `LoadNamedWithSubAssets`, which are the only types of resource loading that may return multiple resources.\n\nIn relation to this, it is worth mentioning that if a call to load assets returns 0 assets, you will not receive any callbacks if you subscribe through `OneCallbackPerResourceLoaded` where as if you subscribe through `OneCallbackPerLoadCall` you would still get your one callback.\n\nIf you update or replace the asset being loaded remember to call to `Complete` method to indicate your intentions regarding:\n * Whether the remaining postfixes should be called.\n\nIn addition, if we take a look at the `Parameters` property of the context object, we will find the following definition:\n\n```C#\n/// <summary>\n/// Class representing the original parameters of the load call.\n/// </summary>\npublic class AssetLoadedParameters\n{\n    /// <summary>\n    /// Gets the name of the asset being loaded. Will be null if loaded through 'LoadMainAsset' or 'LoadByType'.\n    /// </summary>\n    public string Name { get; }\n\n    /// <summary>\n    /// Gets the type that passed to the asset load call.\n    /// </summary>\n    public Type Type { get; }\n\n    /// <summary>\n    /// Gets the type of call that loaded this asset. If 'LoadByType' or 'LoadNamedWithSubAssets' is specified\n    /// multiple assets may be returned if subscribed as 'OneCallbackPerLoadCall'.\n    /// </summary>\n    public AssetLoadType LoadType { get; }\n}\n\n/// <summary>\n/// Enum representing the different ways an asset may be loaded.\n/// </summary>\npublic enum AssetLoadType\n{\n    /// <summary>\n    /// Indicates that this asset has been loaded as the 'mainAsset' in the AssetBundle API.\n    /// </summary>\n    LoadMainAsset,\n\n    /// <summary>\n    /// Indicates that this call is loading all assets of a specific type in an AssetBundle API.\n    /// </summary>\n    LoadByType,\n\n    /// <summary>\n    /// Indicates that this call is loading a specific named asset in the AssetBundle API.\n    /// </summary>\n    LoadNamed,\n\n    /// <summary>\n    /// Indicates that this call is loading a specific named asset and all those below it in the AssetBundle API.\n    /// </summary>\n    LoadNamedWithSubAssets\n}\n```\n\nIt is also worth mentioning that these hooks handles both synchronous and asynchronous loading of assets.\n\nHooks subscribed through hook behaviour `OneCallbackPerLoadCall` will be called before hooks with the behaviour `OneCallbackPerResourceLoaded`.\n\n### Resource Load Methods\nThe resource redirector comes only with postfix callbacks when loading an asset from the `Resources` API.\n\nThe event callback chain looks like this `[Original Method] => [ResourceLoaded hooks]`. The `ResourceLoaded` event handles postfixes for both synchronous and asynchronous loading of assets.\n\n#### Resource Loaded Methods\nThe method `RegisterResourceLoadedHook( HookBehaviour behaviour, Action<ResourceLoadedContext> action )` hooks into the `Resources` API in the UnityEngine. Any time a resource is loaded through this API a callback is sent to these hooks.\n\nThis API is a postfix hook to the `Resources` API, which means that it is first called once the original asset has already been loaded, but is still replacable.\n\nThe `ResourceLoadedContext` class has the following definition:\n\n```C#\n/// <summary>\n/// The operation context surrounding the ResourceLoaded hook.\n/// </summary>\npublic class ResourceLoadedContext : IAssetOrResourceLoadedContext\n{\n    /// <summary>\n    /// Gets a bool indicating if this resource has already been redirected before.\n    /// </summary>\n    public bool HasReferenceBeenRedirectedBefore( UnityEngine.Object asset );\n\n    /// <summary>\n    /// Gets a file system path for the specfic asset that should be unique.\n    /// </summary>\n    /// <param name=\"asset\"></param>\n    /// <returns></returns>\n    public string GetUniqueFileSystemAssetPath( UnityEngine.Object asset );\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset/resource load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPostfixes\">Indicate if any other hooks should be skipped.</param>\n    public void Complete( bool skipRemainingPostfixes = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the original parameters the asset load call was called with.\n    /// </summary>\n    public ResourceLoadParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets the loaded assets. Override individual indices to change the asset reference that will be loaded.\n    ///\n    /// Consider using this if the load type is 'LoadByType' and you subscribed with 'OneCallbackPerLoadCall'.\n    /// </summary>\n    public UnityEngine.Object[] Assets { get; set; }\n\n    /// <summary>\n    /// Gets the loaded asset. This is simply equal to the first index of the Assets property, with some\n    /// additional null guards to prevent NullReferenceExceptions when using it.\n    /// </summary>\n    public UnityEngine.Object Asset { get; set; }\n}\n```\n\nThe HookBehaviour is an enum with the following definition:\n\n```C#\n/// <summary>\n/// Enum indicating how the resource redirector should treat the callback.\n/// </summary>\npublic enum HookBehaviour\n{\n    /// <summary>\n    /// Specifies that exactly one callback should be received per call to asset/resource load method.\n    /// </summary>\n    OneCallbackPerLoadCall = 1,\n\n    /// <summary>\n    /// Specifies that exactly one callback should be received per loaded asset/resources. This means\n    /// that the 'Asset' property should be used over the 'Assets' property on the context object.\n    /// Do note that when using this option, if no resources are returned by a load call, no callbacks\n    /// will be received.\n    /// </summary>\n    OneCallbackPerResourceLoaded = 2\n}\n```\n\nAn important points to make here, is that there is both an `Asset` and an `Assets` property on the context object. These can be used interchangably, but an array will only ever be used if the following two conditions apply:\n * You've subscribed with `OneCallbackPerLoadCall`.\n * The `LoadType` in the `Parameters` property is `LoadByType`, which is the only type of resource loading that may return multiple resources.\n\nIn relation to this, it is worth mentioning that if a call to load assets returns 0 assets, you will not receive any callbacks if you subscribe through `OneCallbackPerResourceLoaded` where as if you subscribe through `OneCallbackPerLoadCall` you would still get your one callback.\n\nIf you update or replace the asset being loaded remember to call to `Complete` method to indicate your intentions regarding:\n * Whether the remaining postfixes should be called.\n\nIn addition, if we take a look at the `Parameters` property of the context object, we will find the following definition:\n\n```C#\n/// <summary>\n/// Class representing the original parameters of the load call.\n/// </summary>\npublic class ResourceLoadedParameters\n{\n    /// <summary>\n    /// Gets the name of the resource being loaded. Will not be the complete resource path if 'LoadByType' is used.\n    /// </summary>\n    public string Path { get; set; }\n\n    /// <summary>\n    /// Gets the type that passed to the resource load call.\n    /// </summary>\n    public Type Type { get; set; }\n\n    /// <summary>\n    /// Gets the type of call that loaded this asset. If 'LoadByType' is specified\n    /// multiple assets may be returned if subscribed as 'OneCallbackPerLoadCall'.\n    /// </summary>\n    public ResourceLoadType LoadType { get; }\n}\n\n/// <summary>\n/// Enum representing the different ways a resource may be loaded.\n/// </summary>\npublic enum ResourceLoadType\n{\n    /// <summary>\n    /// Indicates that this call is loading all assets of a specific type (below a specific path) in the Resources API.\n    /// </summary>\n    LoadByType,\n\n    /// <summary>\n    /// Indicates that this call is loading a single named asset in the Resources API.\n    /// </summary>\n    LoadNamed,\n\n    /// <summary>\n    /// Indicates that this call is loading a single named built-in asset in the Resources API.\n    /// </summary>\n    LoadNamedBuiltIn\n}\n```\n\nIt is also worth mentioning that these hooks handles both synchronous and asynchronous loading of resources.\n\nHooks subscribed through hook behaviour `OneCallbackPerLoadCall` will be called before hooks with the behaviour `OneCallbackPerResourceLoaded`.\n\n### AssetBundle Load Methods\nIt is also possible to hook the loading of `AssetBundles` themselves. Only prefix hooks are supported when loading an asset bundle.\n\nThe event callback chain looks like this `[AssetBundleLoading/AsyncAssetBundleLoading hooks] => [Original Method]`.\n\n#### AssetBundle Synchrous Load Methods\nThe method `RegisterAssetBundleLoadingHook( Action<AssetBundleLoadingContext> action )` is used to hook the synchronous AssetBundle load methods.\n\nThis API is a prefix to the `AssetBundle` API, which means that it is called before the AssetBundle is loaded.\n\nThe `AssetBundleLoadingContext` class has the following definition:\n\n```C#\n/// <summary>\n/// The operation context surrounding the AssetBundleLoading hook (synchronous).\n/// </summary>\npublic class AssetBundleLoadingContext : IAssetBundleLoadingContext\n{\n    /// <summary>\n    /// Gets a normalized path to the asset bundle that is:\n    ///  * Relative to the current directory\n    ///  * Lower-casing\n    ///  * Uses '\\' as separators.\n    /// </summary>\n    /// <returns></returns>\n    public string GetNormalizedPath();\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset bundle load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPrefixes\">Indicate if the remaining prefixes should be skipped.</param>\n    /// <param name=\"skipOriginalCall\">Indicate if the original call should be skipped. If you set the asset bundle, you likely want to set this to true.</param>\n    public void Complete( bool skipRemainingPrefixes = true, bool? skipOriginalCall = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the parameters of the call.\n    /// </summary>\n    public AssetBundleLoadingParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets or sets the AssetBundle being loaded.\n    /// </summary>\n    public AssetBundle Bundle { get; set; }\n}\n```\n\nBecause this is a prefix API, the `Bundle` property will be null when the method is called and it is up to you to set it to a different value if you can handle the specified path.\n\nIf you update the `Bundle` property, remember to call the `Complete` to indicate your intentions regarding:\n * Whether or not the remaining prefixes should be skipped.\n * Whether or not the original method should be skipped.\n\nIn addition, if we take a look at the `Parameters` property of the context object, we will find the following definition:\n\n```C#\n/// <summary>\n/// Class representing the original parameters of the load call.\n/// </summary>\npublic class AssetBundleLoadingParameters\n{\n    /// <summary>\n    /// Gets or sets the loaded path. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public string Path { get; }\n\n    /// <summary>\n    /// Gets or sets the crc. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public uint Crc { get; }\n\n    /// <summary>\n    /// Gets or sets the offset. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public ulong Offset { get; }\n\n    /// <summary>\n    /// Gets the type of call that is loading this asset bundle.\n    /// </summary>\n    public AssetBundleLoadType LoadType { get; }\n}\n\n/// <summary>\n/// Enum representing the different ways an asset bundle may be loaded.\n/// </summary>\npublic enum AssetBundleLoadType\n{\n    /// <summary>\n    /// Indicates that the asset bundle is being loaded through a call to 'LoadFromFile' or 'LoadFromFileAsync'.\n    /// </summary>\n    LoadFromFile,\n}\n```\n\nAs can be seen, the current implementation only hooks the LoadFromFile/LoadFromFileAsync ways of loading AssetBundles, but this may be expanded in the future.\n\nIt may also be worth looking at the `GetNormalizedPath()` method instead of the `Path` property of the original call parameters. This is because the path passed to the method can take literally any form:\n * Absolute path\n * Relative path\n * Include a stray '..' in the middle of the path\n \nAnother way to change the result of the asset bundle load operation is to change the value of the `Path`, `Crc` and `Offset` properties in the `Parameters` property. If you do this, you likely will not want to call the Complete method, as you will want the original method to still be called.\n\n#### AssetBundle Asynchrounous Load Methods\nThe method `RegisterAsyncAssetBundleLoadingHook( Action<AsyncAssetBundleLoadingContext> action )` is used to hook the asynchronous AssetBundle load methods.\n\nThis API is a prefix to the `AssetBundle` API, which means that it is called before the `AssetBundleCreateRequest` is created.\n\nThe `AsyncAssetBundleLoadingContext` class has the following definition:\n\n```C#\n/// <summary>\n/// The operation context surrounding the AsyncAssetBundleLoading hook (asynchronous).\n/// </summary>\npublic class AsyncAssetBundleLoadingContext : IAssetBundleLoadingContext\n{\n    /// <summary>\n    /// Gets a normalized path to the asset bundle that is:\n    ///  * Relative to the current directory\n    ///  * Lower-casing\n    ///  * Uses '\\' as separators.\n    /// </summary>\n    /// <returns></returns>\n    public string GetNormalizedPath();\n\n    /// <summary>\n    /// Indicate your work is done and if any other hooks to this asset bundle load should be called.\n    /// </summary>\n    /// <param name=\"skipRemainingPrefixes\">Indicate if the remaining prefixes should be skipped.</param>\n    /// <param name=\"skipOriginalCall\">Indicate if the original call should be skipped. If you set the request, you likely want to set this to true.</param>\n    public void Complete( bool skipRemainingPrefixes = true, bool? skipOriginalCall = true );\n\n    /// <summary>\n    /// Disables recursive calls if you make an asset/asset bundle load call\n    /// from within your callback. If you want to prevent recursion this should\n    /// be called before you load the asset/asset bundle.\n    /// </summary>\n    public void DisableRecursion();\n\n    /// <summary>\n    /// Gets the parameters of the call.\n    /// </summary>\n    public AssetBundleLoadingParameters Parameters { get; }\n\n    /// <summary>\n    /// Gets or sets the AssetBundleCreateRequest being used to load the AssetBundle.\n    /// </summary>\n    public AssetBundleCreateRequest Request { get; set; }\n\n    /// <summary>\n    /// Gets or sets the AssetBundle being loaded.\n    /// </summary>\n    public AssetBundle Bundle { get; set; }\n\n    /// <summary>\n    /// Gets or sets how this load operation should be resolved.\n    /// Setting the Bundle/Request property will automatically update this value.\n    /// </summary>\n    public AsyncAssetBundleLoadingResolve ResolveType { get; set; }\n}\n```\n\nBecause this is a prefix API, the `Request` property will be null when the method is called and it is up to you to set it to a different value if you can handle the specified path.\n\nAs you can see there is actually also a `Bundle` property available on the context object. Under normal circumstances, however, you cannot use the `Bundle` property on the the `AsyncAssetBundleLoadingContext`. In order to be able to use these, you must first call `ResourceRedirection.EnableSyncOverAsyncAssetLoads` once during your initialization logic. This will allow you to set the bundle directly so you don't have to go through the standard `AssetBundle` API to obtain a request object.\n\nIt is, however, recommended that if you can that you set the `Request` property instead of the `Bundle` property as that will keep the operation asynchronous and not block the game while the asset is being loaded.\n\nIf you update the `Request` property, remember to call the `Complete` to indicate your intentions regarding:\n * Whether or not the remaining prefixes should be skipped.\n * Whether or not the original method should be skipped.\n\nIn addition, if we take a look at the `Parameters` property of the context object, we will find the following definition:\n\n```C#\n/// <summary>\n/// Class representing the original parameters of the load call.\n/// </summary>\npublic class AssetBundleLoadingParameters\n{\n    /// <summary>\n    /// Gets the loaded path. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public string Path { get; }\n\n    /// <summary>\n    /// Gets the crc. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public uint Crc { get; }\n\n    /// <summary>\n    /// Gets the offset. Only relevant for 'LoadFromFile'.\n    /// </summary>\n    public ulong Offset { get; }\n\n    /// <summary>\n    /// Gets the type of call that is loading this asset bundle.\n    /// </summary>\n    public AssetBundleLoadType LoadType { get; }\n}\n\n/// <summary>\n/// Enum representing the different ways an asset bundle may be loaded.\n/// </summary>\npublic enum AssetBundleLoadType\n{\n    /// <summary>\n    /// Indicates that the asset bundle is being loaded through a call to 'LoadFromFile' or 'LoadFromFileAsync'.\n    /// </summary>\n    LoadFromFile,\n}\n```\n\nAs can be see, the current implementation only hooks the LoadFromFile/LoadFromFileAsync ways of loading AssetBundles, but this may be expanded in the future.\n\nIt may also be worth looking at the `GetNormalizedPath()` method instead of the `Path` property of the original call parameters. This is because the path passed to the method can take literally any form:\n * Absolute path\n * Relative path\n * Include a stray '..' in the middle of the path\n \nAnother way to change the result of the asset bundle load operation is to change the value of the `Path`, `Crc` and `Offset` properties in the `Parameters` property. If you do this, you likely will not want to call the Complete method, as you will want the original method to still be called.\n\nAn important additional way to subscribe to the prefix asset bundle loading operations are through the method `RegisterAsyncAndSyncAssetBundleLoadingHook( int priority, Action<IAssetBundleLoadingContext> action )`. This method will handle both async and sync asset bundle loading operations. The `IAssetLoadingContext` is an interface implemented by both the `AssetBundleLoadingContext` and `AsyncAssetBundleLoadingContext`.\n\nDo note, that if you want to use this method you must first call the method `EnableSyncOverAsyncAssetLoads()` to enable the hooks required for this to work.\n\n### About Recursion\nAs you may have noticed, all of the context classes shown in the previous sections had a method called `DisableRecursion` and that there is a method called `DisableRecursionPermanently` directly on the `ResourceRedirection` class.\n\nThe purpose of these method is, as it name states, to disable recursion. That only leaves the question, when does recursion occur?\n\nRecursion will happen anytime you try to load an asset/resource/asset bundle from within your callback using the `AssetBundle` or `Resources` API. Essentially, what it means is that all callbacks (except the one loading the resource) will get a chance to modify the resource that is being loaded by your callback.\n\nThis may not always be desirable, so if you call the method `DisableRecursion` *before* you load your resource, this recursive behaviour is disabled. In many other cases, this behaviour is very desirable because it means that it is less important to set the *correct* priority, whatever that may be.\n\nRecursion has an important side effect for other prefix/postfix callbacks, and that is that they will always be called if you make a recursive load call in your callback, even if you indicate through the `Complete` method that they should not be called. So if, in your scenario, it is important to avoid this, you must disable recursion.\n\n`DisableRecursionPermanently` disables recursion permanently for all subscribers to the ResourceRedirection API no matter who calls it. This is a game-wide setting that should be decided upon between plugin developers rather than by the hand of the individual.\n\nThese options exists only because it is not currently known whether or not having recursion enabled gives the best experience to plugin developers.\n\n### Implementing an Asset Redirector\nHere's an example of how a resource redirection may be implemented to hook all `Texture2D` objects loaded through the `AssetBundle` API:\n\n```C#\nclass TextureReplacementPlugin\n{\n    void Awake()\n    {\n        ResourceRedirection.RegisterAssetLoadedHook(\n            behaviour: HookBehaviour.OneCallbackPerResourceLoaded,\n            priority: 0,\n            action: AssetLoaded );\n    }\n\n    public void AssetLoaded( AssetLoadedContext context )\n    {\n        if( context.Asset is Texture2D texture2d ) // also acts as a null check\n        {\n            // TODO: Modify, replace or dump the texture\n                \n            context.Asset = texture2d; // only need to update the reference if you created a new texture\n            context.Complete(\n                skipRemainingPostfixes: true );\n        }\n    }\n}\n```\n\n### Implemting an AssetBundle Redirector\nHere's an example of how a resource redirection may be implemented to redirect non-existing resources to a seperate 'mods' directory.\n\n```C#\nclass AssetBundleRedirectorPlugin\n{\n    void Awake()\n    {\n        ResourceRedirection.RegisterAssetBundleLoadingHook(\n            priority: 1000,\n            action: AssetBundleLoading );\n\n        ResourceRedirection.RegisterAsyncAssetBundleLoadingHook(\n            priority: 1000,\n            action: AsyncAssetBundleLoading );\n    }\n\n    public void AssetBundleLoading( AssetBundleLoadingContext context )\n    {\n        if( !File.Exists( context.Parameters.Path ) )\n        {\n            // the game is trying to load a path that does not exist, lets redirect to our own resources\n\t\t    \n            // obtain different resource path\n            var normalizedPath = context.GetNormalizedPath();\n            var modFolderPath = Path.Combine( \"mods\", normalizedPath );\n\t\t    \n            // if the path exists, let's load that instead\n            if( File.Exists( modFolderPath ) )\n            {\n                var bundle = AssetBundle.LoadFromFile( modFolderPath );\n\t\t    \n                context.Bundle = bundle;\n                context.Complete(\n                    skipRemainingPrefixes: true,\n                    skipOriginalCall: true );\n            }\n        }\n    }\n\n    public void AsyncAssetBundleLoading( AsyncAssetBundleLoadingContext context )\n    {\n        if( !File.Exists( context.Parameters.Path ) )\n            {\n            // the game is trying to load a path that does not exist, lets redirect to our own resources\n\t\t    \n            // obtain different resource path\n            var normalizedPath = context.GetNormalizedPath();\n            var modFolderPath = Path.Combine( \"mods\", normalizedPath );\n\t\t    \n            // if the path exists, let's load that instead\n            if( File.Exists( modFolderPath ) )\n            {\n                var request = AssetBundle.LoadFromFileAsync( modFolderPath );\n\t\t    \n                context.Request = request;\n                context.Complete(\n                    skipRemainingPrefixes: true,\n                    skipOriginalCall: true );\n            }\n        }\n    }\n}\n```\n\nHere's a smart way to implement the same thing, by having a single method that hooks both the synchronous and asynchronous method at the same time:\n\n```C#\nclass AssetBundleRedirectorSyncOverAsyncPlugin\n{\n    void Awake()\n    {\n        ResourceRedirection.EnableSyncOverAsyncAssetLoads();\n\t    \n        ResourceRedirection.RegisterAsyncAndSyncAssetBundleLoadingHook(\n            priority: 1000,\n            action: AssetBundleLoading );\n    }\n\n    public void AssetBundleLoading( IAssetBundleLoadingContext context )\n    {\n        if( !File.Exists( context.Parameters.Path ) )\n        {\n            // the game is trying to load a path that does not exist, lets redirect to our own resources\n\t    \n            // obtain different resource path\n            var normalizedPath = context.GetNormalizedPath();\n            var modFolderPath = Path.Combine( \"mods\", normalizedPath );\n\t    \n            // if the path exists, let's load that instead\n            if( File.Exists( modFolderPath ) )\n            {\n                var bundle = AssetBundle.LoadFromFile( modFolderPath );\n\t    \n                context.Bundle = bundle;\n                context.Complete(\n                    skipRemainingPrefixes: true,\n                    skipOriginalCall: true );\n            }\n        }\n    }\n}\n```\n\nWhile this is clean it causes all asset bundles to be loaded synchronously, potentially locking up the game causing FPS lag. Another approach that also handles that could look like this:\n\n```C#\nclass SmartAssetBundleRedirectorSyncOverAsyncPlugin\n{\n    void Awake()\n    {\n        ResourceRedirection.EnableSyncOverAsyncAssetLoads();\n\t    \n        ResourceRedirection.RegisterAsyncAndSyncAssetBundleLoadingHook(\n            priority: 1000,\n            action: AssetBundleLoading );\n    }\n\n    public void AssetBundleLoading( IAssetBundleLoadingContext context )\n    {\n        if( !File.Exists( context.Parameters.Path ) )\n        {\n            // the game is trying to load a path that does not exist, lets redirect to our own resources\n\t    \n            // obtain different resource path\n            var normalizedPath = context.GetNormalizedPath();\n            var modFolderPath = Path.Combine( \"mods\", normalizedPath );\n\t    \n            // if the path exists, let's load that instead\n            if( File.Exists( modFolderPath ) )\n            {\n                if( context is AsyncAssetBundleLoadingContext asyncContext )\n                {\n                    var request = AssetBundle.LoadFromFileAsync( modFolderPath );\n                    asyncContext.Request = request;\n                }\n                else\n                {\n                    var bundle = AssetBundle.LoadFromFile( modFolderPath );\n                    context.Bundle = bundle;\n                }\n\t    \n                context.Complete(\n                    skipRemainingPrefixes: true,\n                    skipOriginalCall: true );\n            }\n        }\n    }\n}\n```\n\nHere's the redirector that is activated if the `EmulateAssetBundles` option is enabled in the plugin, which allows loading asset bundles from a different location than the game is requesting the bundle from:\n\n```C#\n/// <summary>\n/// Creates an asset bundle hook that attempts to load asset bundles in the emulation directory\n/// over the default asset bundles if they exist.\n/// </summary>\n/// <param name=\"hookPriority\">Priority of the hook.</param>\n/// <param name=\"emulationDirectory\">The directory to look for the asset bundles in.</param>\npublic static void EnableEmulateAssetBundles( int hookPriority, string emulationDirectory )\n{\n    RegisterAssetBundleLoadingHook( hookPriority, ctx => HandleAssetBundleEmulation( ctx, SetBundle ) );\n    RegisterAsyncAssetBundleLoadingHook( hookPriority, ctx => HandleAssetBundleEmulation( ctx, SetRequest ) );\n\t\t    \n    // define base callback\n    void HandleAssetBundleEmulation<T>( T context, Action<T, string> changeBundle )\n        where T : IAssetBundleLoadingContext\n    {\n        if( context.Parameters.LoadType == AssetBundleLoadType.LoadFromFile )\n        {\n            var normalizedPath = context.GetNormalizedPath();\n            var emulatedPath = Path.Combine( emulationDirectory, normalizedPath );\n            if( File.Exists( emulatedPath ) )\n            {\n                changeBundle( context, emulatedPath );\n\t\t    \n                context.Complete(\n                    skipRemainingPrefixes: true,\n                    skipOriginalCall: true );\n            }\n        }\n    }\n\t\t    \n    // synchronous specific code\n    void SetBundle( AssetBundleLoadingContext context, string path )\n    {\n        context.Bundle = AssetBundle.LoadFromFile( path, context.Parameters.Crc, context.Parameters.Offset );\n    }\n\t\t    \n    // asynchronous specific code\n    void SetRequest( AsyncAssetBundleLoadingContext context, string path )\n    {\n        context.Request = AssetBundle.LoadFromFileAsync( path, context.Parameters.Crc, context.Parameters.Offset );\n    }\n}\n```\n\nHere's the redirector that is activated if the `RedirectMissingAssetBundles` option is enabled in the plugin, which essentially simply loads an empty asset bundle if an asset bundle cannot be found:\n\n```C#\n/// <summary>\n/// Creates an asset bundle hook that redirects asset bundles loads to an empty\n/// asset bundle if the file that is being loaded does not exist.\n/// </summary>\n/// <param name=\"hookPriority\">Priority of the hook.</param>\npublic static void EnableRedirectMissingAssetBundlesToEmptyAssetBundle( int hookPriority )\n{\n    RegisterAssetBundleLoadingHook( hookPriority, ctx => HandleMissingBundle( ctx, SetBundle ) );\n    RegisterAsyncAssetBundleLoadingHook( hookPriority, ctx => HandleMissingBundle( ctx, SetRequest ) );\n\t    \n    // define base callback\n    void HandleMissingBundle<TContext>( TContext context, Action<TContext, byte[]> changeBundle )\n        where TContext : IAssetBundleLoadingContext\n    {\n        if( context.Parameters.LoadType == AssetBundleLoadType.LoadFromFile\n            && !File.Exists( context.Parameters.Path ) )\n        {\n            var buffer = Properties.Resources.empty;\n            CabHelper.RandomizeCab( buffer );\n\t    \n            changeBundle( context, buffer );\n\t    \n            context.Complete(\n                skipRemainingPrefixes: true,\n                skipOriginalCall: true );\n\t    \n            XuaLogger.ResourceRedirector.Warn( \"Tried to load non-existing asset bundle: \" + context.Parameters.Path );\n        }\n    }\n\t    \n    // synchronous specific code\n    void SetBundle( AssetBundleLoadingContext context, byte[] assetBundleData )\n    {\n        var bundle = AssetBundle.LoadFromMemory( assetBundleData );\n        context.Bundle = bundle;\n    }\n\t    \n    // asynchronous specific code\n    void SetRequest( AsyncAssetBundleLoadingContext context, byte[] assetBundleData )\n    {\n        var request = AssetBundle.LoadFromMemoryAsync( assetBundleData );\n        context.Request = request;\n    }\n}\n```\n\n### Implementing an Asset/Resource Handler (Auto Translator)\nThis section shows how to implement an asset/resource redirector that respects the Auto Translator configuration.\n\nThe `XUnity.AutoTranslator.Core.Plugin.dll` assembly has a base class that can be used to implement a plugin that dumps resources for the purposes of translation.\n\nThis class simply hooks the postfix to the load of assets from the `AssetBundle` and the `Resources` API. Here's how the base class looks:\n\n```C#\n/// <summary>\n/// Base implementation of resource redirect handler that takes care of the plumming for a\n/// resource redirector that is interested in either updating or dumping redirected resources.\n/// </summary>\n/// <typeparam name=\"TAsset\">The type of asset being redirected.</typeparam>\npublic abstract class AssetLoadedHandlerBaseV2<TAsset>\n    where TAsset : UnityEngine.Object\n{\n    /// <summary>\n    /// Method invoked when an asset should be updated or replaced.\n    /// </summary>\n    /// <param name=\"calculatedModificationPath\">This is the modification path calculated in the CalculateModificationFilePath method.</param>\n    /// <param name=\"asset\">The asset to be updated or replaced.</param>\n    /// <param name=\"context\">This is the context containing all relevant information for the resource redirection event.</param>\n    /// <returns>A bool indicating if the event should be considered handled.</returns>\n    protected abstract bool ReplaceOrUpdateAsset( string calculatedModificationPath, ref TAsset asset, IAssetOrResourceLoadedContext context );\n\n    /// <summary>\n    /// Method invoked when an asset should be dumped.\n    /// </summary>\n    /// <param name=\"calculatedModificationPath\">This is the modification path calculated in the CalculateModificationFilePath method.</param>\n    /// <param name=\"asset\">The asset to be updated or replaced.</param>\n    /// <param name=\"context\">This is the context containing all relevant information for the resource redirection event.</param>\n    /// <returns>A bool indicating if the event should be considered handled.</returns>\n    protected abstract bool DumpAsset( string calculatedModificationPath, TAsset asset, IAssetOrResourceLoadedContext context );\n\n    /// <summary>\n    /// Method invoked when a new resource event is fired to calculate a unique path for the resource.\n    /// </summary>\n    /// <param name=\"asset\">The asset to be updated or replaced.</param>\n    /// <param name=\"context\">This is the context containing all relevant information for the resource redirection event.</param>\n    /// <returns>A string uniquely representing a path for the redirected resource.</returns>\n    protected abstract string CalculateModificationFilePath( TAsset asset, IAssetOrResourceLoadedContext context );\n\n    /// <summary>\n    /// Method to be invoked to indicate if the asset should be handled or not.\n    /// </summary>\n    /// <param name=\"asset\">The asset to be updated or replaced.</param>\n    /// <param name=\"context\">This is the context containing all relevant information for the resource redirection event.</param>\n    /// <returns>A bool indicating if the asset should be handled.</returns>\n    protected abstract bool ShouldHandleAsset( TAsset asset, IAssetOrResourceLoadedContext context );\n}\n```\n\nThe Auto Translation includes one default implementation of this class for TextAssets. It looks like this:\n\n```C#\ninternal class TextAssetLoadedHandler : AssetLoadedHandlerBaseV2<TextAsset>\n{\n    protected override string CalculateModificationFilePath( TextAsset asset, IAssetOrResourceLoadedContext context )\n    {\n        return context.GetPreferredFilePath( asset, \".txt\" );\n    }\n\n    protected override bool DumpAsset( string calculatedModificationPath, TextAsset asset, IAssetOrResourceLoadedContext context )\n    {\n        Directory.CreateDirectory( new FileInfo( calculatedModificationPath ).Directory.FullName );\n        File.WriteAllBytes( calculatedModificationPath, asset.bytes );\n\n        return true;\n    }\n\n    protected override bool ReplaceOrUpdateAsset( string calculatedModificationPath, ref TextAsset asset, IAssetOrResourceLoadedContext context )\n    {\n        RedirectedResource file;\n\n        var files = RedirectedDirectory.GetFile( calculatedModificationPath ).ToList();\n        if( files.Count == 0 )\n        {\n\t\t    return false;\n        }\n        else\n        {\n            if( files.Count > 1 )\n            {\n                XuaLogger.AutoTranslator.Warn( \"Found more than one resource file in the same path: \" + calculatedModificationPath );\n            }\n\t\t    \n            file = files.FirstOrDefault();\n        }\n\n        if( file != null )\n        {\n            using( var stream = file.OpenStream() )\n            {\n                var data = stream.ReadFully( (int)stream.Length );\n                var text = Encoding.UTF8.GetString( data );\n\t\t    \n                var ext = asset.GetOrCreateExtensionData<TextAssetExtensionData>();\n                ext.Data = data;\n                ext.Text = text;\n\t\t    \n                return true;\n            }\n        }\n        return false;\n    }\n\n    protected override bool ShouldHandleAsset( TextAsset asset, IAssetOrResourceLoadedContext context )\n    {\n        return !context.HasReferenceBeenRedirectedBefore( asset );\n    }\n}\n```\n\nNote that when accessing the resource file, we do not use the standard file API to obtain a stream to get the data in the file. Instead we use the RedirectedDirectory facade. This will also look in ZIP files and simply treat a ZIP file as a directory when making the lookup.\n\nAnother examples of an implementation of this class would be for Koikatsu that enables replacing its custom resources:\n\n```C#\npublic class ScenarioDataResourceRedirector : AssetLoadedHandlerBaseV2<ScenarioData>\n{\n   public ScenarioDataResourceRedirector()\n   {\n      CheckDirectory = true;\n   }\n\n   protected override string CalculateModificationFilePath( ScenarioData asset, IAssetOrResourceLoadedContext context )\n   {\n      return context.GetPreferredFilePathWithCustomFileName( asset, null )\n         .Replace( \".unity3d\", \"\" );\n   }\n\n   protected override bool DumpAsset( string calculatedModificationPath, ScenarioData asset, IAssetOrResourceLoadedContext context )\n   {\n      var defaultTranslationFile = Path.Combine( calculatedModificationPath, \"translation.txt\" );\n      var cache = new SimpleTextTranslationCache(\n         file: defaultTranslationFile,\n         loadTranslationsInFile: false );\n\n      foreach( var param in asset.list )\n      {\n         if( param.Command == Command.Text )\n         {\n            for( int i = 0; i < param.Args.Length; i++ )\n            {\n               var key = param.Args[ i ];\n\n               if( !string.IsNullOrEmpty( key ) && LanguageHelper.IsTranslatable( key ) )\n               {\n                  cache.AddTranslationToCache( key, key );\n               }\n            }\n         }\n      }\n\n      return true;\n   }\n\n   protected override bool ReplaceOrUpdateAsset( string calculatedModificationPath, ref ScenarioData asset, IAssetOrResourceLoadedContext context )\n   {\n      var defaultTranslationFile = Path.Combine( calculatedModificationPath, \"translation.txt\" );\n      var redirectedResources = RedirectedDirectory.GetFilesInDirectory( calculatedModificationPath, \".txt\" );\n      var streams = redirectedResources.Select( x => x.OpenStream() );\n      var cache = new SimpleTextTranslationCache(\n         outputFile: defaultTranslationFile,\n         inputStreams: streams,\n         allowTranslationOverride: false,\n         closeStreams: true );\n\n      foreach( var param in asset.list )\n      {\n         if( param.Command == Command.Text )\n         {\n            for( int i = 0; i < param.Args.Length; i++ )\n            {\n               var key = param.Args[ i ];\n               if( !string.IsNullOrEmpty( key ) )\n               {\n                  if( cache.TryGetTranslation( key, true, out var translated ) )\n                  {\n                     param.Args[ i ] = translated;\n                  }\n                  else if( AutoTranslatorSettings.IsDumpingRedirectedResourcesEnabled && LanguageHelper.IsTranslatable( key ) )\n                  {\n                     cache.AddTranslationToCache( key, key );\n                  }\n               }\n            }\n         }\n      }\n\n      return true;\n   }\n\n   protected override bool ShouldHandleAsset( ScenarioData asset, IAssetOrResourceLoadedContext context )\n   {\n      return !context.HasReferenceBeenRedirectedBefore( asset );\n   }\n}\n```\n\nNote that this implementation uses a `SimpleTextTranslationCache` to lookup translations. Using this class for translation lookups have the following benefits:\n * Whitespace doesn't have to match exactly.\n * It respects the `RedirectedResourceDetectionStrategy` configuration. If this is not respected the plugin may double translate certain texts.\n * When loading text translation files, it supports the same text format that is otherwise used by the plugin.\n\nOnce you have implemented one of these classes, you just need to instantiate it and it will do it's magic. \n"
        },
        {
          "name": "XUnity.AutoTranslator.Koikatsu.sln",
          "type": "blob",
          "size": 4.4775390625,
          "content": "﻿\nMicrosoft Visual Studio Solution File, Format Version 12.00\n# Visual Studio Version 16\nVisualStudioVersion = 16.0.29905.134\nMinimumVisualStudioVersion = 10.0.40219.1\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.Core\", \"src\\XUnity.AutoTranslator.Plugin.Core\\XUnity.AutoTranslator.Plugin.Core.csproj\", \"{FDB73417-983D-4D42-97F8-F562149D2AA7}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.Common\", \"src\\XUnity.Common\\XUnity.Common.csproj\", \"{350892C4-0A33-496A-AE73-E30D5916411A}\"\nEndProject\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"src\", \"src\", \"{57262841-794B-4996-A43C-00AA8E1A849E}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.ResourceRedirector\", \"src\\XUnity.ResourceRedirector\\XUnity.ResourceRedirector.csproj\", \"{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.ExtProtocol\", \"src\\XUnity.AutoTranslator.Plugin.ExtProtocol\\XUnity.AutoTranslator.Plugin.ExtProtocol.csproj\", \"{134AE8FE-4942-415E-AF4C-8B21DCBF5C97}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.KoikatsuResources\", \"src\\XUnity.AutoTranslator.KoikatsuResources\\XUnity.AutoTranslator.KoikatsuResources.csproj\", \"{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B}\"\nEndProject\nProject(\"{FAE04EC0-301F-11D3-BF4B-00C04F79EFBC}\") = \"XUnity.AutoTranslator.KoikatsuFormatter\", \"src\\XUnity.AutoTranslator.KoikatsuFormatter\\XUnity.AutoTranslator.KoikatsuFormatter.csproj\", \"{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8}\"\nEndProject\nGlobal\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\n\t\tDebug|Any CPU = Debug|Any CPU\n\t\tRelease|Any CPU = Release|Any CPU\n\tEndGlobalSection\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\n\t\t{FDB73417-983D-4D42-97F8-F562149D2AA7}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{FDB73417-983D-4D42-97F8-F562149D2AA7}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{FDB73417-983D-4D42-97F8-F562149D2AA7}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{FDB73417-983D-4D42-97F8-F562149D2AA7}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{350892C4-0A33-496A-AE73-E30D5916411A}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{350892C4-0A33-496A-AE73-E30D5916411A}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{350892C4-0A33-496A-AE73-E30D5916411A}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{350892C4-0A33-496A-AE73-E30D5916411A}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{134AE8FE-4942-415E-AF4C-8B21DCBF5C97}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{134AE8FE-4942-415E-AF4C-8B21DCBF5C97}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{134AE8FE-4942-415E-AF4C-8B21DCBF5C97}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{134AE8FE-4942-415E-AF4C-8B21DCBF5C97}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8}.Release|Any CPU.Build.0 = Release|Any CPU\n\tEndGlobalSection\n\tGlobalSection(SolutionProperties) = preSolution\n\t\tHideSolutionNode = FALSE\n\tEndGlobalSection\n\tGlobalSection(NestedProjects) = preSolution\n\t\t{FDB73417-983D-4D42-97F8-F562149D2AA7} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\t\t{350892C4-0A33-496A-AE73-E30D5916411A} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\t\t{4A9B6B0D-A1C4-49E8-95D4-36F32C48D627} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\t\t{134AE8FE-4942-415E-AF4C-8B21DCBF5C97} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\t\t{0754CB8F-BFAE-49C1-B923-5E37F5DC7C9B} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\t\t{9A3A2130-BDD5-4919-93E6-3ADF96A2B8F8} = {57262841-794B-4996-A43C-00AA8E1A849E}\n\tEndGlobalSection\n\tGlobalSection(ExtensibilityGlobals) = postSolution\n\t\tSolutionGuid = {01634BC4-C45F-4967-A704-6705B0178273}\n\tEndGlobalSection\nEndGlobal\n"
        },
        {
          "name": "XUnity.AutoTranslator.sln",
          "type": "blob",
          "size": 46.6279296875,
          "content": "﻿\nMicrosoft Visual Studio Solution File, Format Version 12.00\n# Visual Studio Version 17\nVisualStudioVersion = 17.9.34728.123\nMinimumVisualStudioVersion = 10.0.40219.1\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"src\", \"src\", \"{0F9B38FC-4E57-4B83-AF0B-0993B8470823}\"\nEndProject\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"Solution Items\", \"Solution Items\", \"{ACADAE2C-1642-428A-84D4-CC53E24F1348}\"\n\tProjectSection(SolutionItems) = preProject\n\t\t.editorconfig = .editorconfig\n\t\tCHANGELOG - ResourceRedirector.md = CHANGELOG - ResourceRedirector.md\n\t\tCHANGELOG.md = CHANGELOG.md\n\t\tDirectory.Build.props = Directory.Build.props\n\t\tLICENSE = LICENSE\n\t\tREADME.md = README.md\n\tEndProjectSection\nEndProject\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"Translators\", \"Translators\", \"{7A01BA34-3B96-4910-AC70-462BA59417CB}\"\nEndProject\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"test\", \"test\", \"{2A4A3DDF-338C-40C0-8E26-2A810BAAADD6}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.Core\", \"src\\XUnity.AutoTranslator.Plugin.Core\\XUnity.AutoTranslator.Plugin.Core.csproj\", \"{718A3B1D-A5E5-4223-AD53-45C60C874150}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.IPA\", \"src\\XUnity.AutoTranslator.Plugin.IPA\\XUnity.AutoTranslator.Plugin.IPA.csproj\", \"{C749698C-9E49-4CC3-8B45-62AE3AD0C938}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4} = {848D741E-A4F2-4680-AFD2-74C8723CE3C4}\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705} = {1C574D77-FCC8-4249-8890-0B00EF092705}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Patcher\", \"src\\XUnity.AutoTranslator.Patcher\\XUnity.AutoTranslator.Patcher.csproj\", \"{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Setup\", \"src\\XUnity.AutoTranslator.Setup\\XUnity.AutoTranslator.Setup.csproj\", \"{86BF1F46-44C1-4301-8314-6EC32F74575F}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4} = {848D741E-A4F2-4680-AFD2-74C8723CE3C4}\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705} = {1C574D77-FCC8-4249-8890-0B00EF092705}\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD} = {B3A3D3E7-A8F1-4110-8151-E674947CB8FD}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.UnityInjector\", \"src\\XUnity.AutoTranslator.Plugin.UnityInjector\\XUnity.AutoTranslator.Plugin.UnityInjector.csproj\", \"{12F1D16B-B8E1-4A9D-B65A-044650F15440}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4} = {848D741E-A4F2-4680-AFD2-74C8723CE3C4}\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705} = {1C574D77-FCC8-4249-8890-0B00EF092705}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"ReverseTranslator\", \"src\\Translators\\ReverseTranslator\\ReverseTranslator.csproj\", \"{7493BA4A-C688-4103-B161-7E578FBB6C0E}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"GoogleTranslate\", \"src\\Translators\\GoogleTranslate\\GoogleTranslate.csproj\", \"{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"BingTranslate\", \"src\\Translators\\BingTranslate\\BingTranslate.csproj\", \"{95C83913-8D7F-4FA1-877E-288251A2A461}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"BaiduTranslate\", \"src\\Translators\\BaiduTranslate\\BaiduTranslate.csproj\", \"{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"BingTranslateLegitimate\", \"src\\Translators\\BingTranslateLegitimate\\BingTranslateLegitimate.csproj\", \"{F49BA6D1-FAFB-414C-97B1-28B77FC21286}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"CustomTranslate\", \"src\\Translators\\CustomTranslate\\CustomTranslate.csproj\", \"{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"YandexTranslate\", \"src\\Translators\\YandexTranslate\\YandexTranslate.csproj\", \"{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"WatsonTranslate\", \"src\\Translators\\WatsonTranslate\\WatsonTranslate.csproj\", \"{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"LecPowerTranslator15\", \"src\\Translators\\LecPowerTranslator15\\LecPowerTranslator15.csproj\", \"{AE28F88E-E877-456B-98AB-BD03A59A3E44}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Lec.ExtProtocol\", \"src\\Translators\\Lec.ExtProtocol\\Lec.ExtProtocol.csproj\", \"{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"GoogleTranslateLegitimate\", \"src\\Translators\\GoogleTranslateLegitimate\\GoogleTranslateLegitimate.csproj\", \"{41B612A5-2974-4988-A82E-84EEF2212A61}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.ExtProtocol\", \"src\\XUnity.AutoTranslator.Plugin.ExtProtocol\\XUnity.AutoTranslator.Plugin.ExtProtocol.csproj\", \"{65500234-7AD4-48B8-B51B-945ADBFF1133}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Setup.Build\", \"src\\XUnity.AutoTranslator.Setup.Build\\XUnity.AutoTranslator.Setup.Build.csproj\", \"{848D741E-A4F2-4680-AFD2-74C8723CE3C4}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939} = {D70C425F-F0C9-45BB-835D-16E827AC2939}\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83} = {95D6B899-8772-4A7A-AD95-ACDF18FD4D83}\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022} = {94BD50EF-2E18-4A86-8582-35E75453F022}\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076} = {AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Setup.Build-x86\", \"src\\XUnity.AutoTranslator.Setup.Build-x86\\XUnity.AutoTranslator.Setup.Build-x86.csproj\", \"{1C574D77-FCC8-4249-8890-0B00EF092705}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.RuntimeHooker\", \"src\\XUnity.RuntimeHooker\\XUnity.RuntimeHooker.csproj\", \"{15A1D255-25F3-4D10-8053-F24B32C1CB7B}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A} = {BE7ED338-106C-4CC6-BA19-8ADB2534326A}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.RuntimeHooker.Core\", \"src\\XUnity.RuntimeHooker.Core\\XUnity.RuntimeHooker.Core.csproj\", \"{921151C6-C532-44E3-92A1-283E5094171F}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.RuntimeHooker.Trampolines\", \"src\\XUnity.RuntimeHooker.Trampolines\\XUnity.RuntimeHooker.Trampolines.csproj\", \"{BE7ED338-106C-4CC6-BA19-8ADB2534326A}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.RuntimeHooker.ConsoleTests\", \"test\\XUnity.RuntimeHooker.ConsoleTests\\XUnity.RuntimeHooker.ConsoleTests.csproj\", \"{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.RuntimeHooker.Benchmark\", \"test\\XUnity.RuntimeHooker.Benchmark\\XUnity.RuntimeHooker.Benchmark.csproj\", \"{E2F50278-9134-4DC8-9C50-4C0A52063A89}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.BepInEx\", \"src\\XUnity.AutoTranslator.Plugin.BepInEx\\XUnity.AutoTranslator.Plugin.BepInEx.csproj\", \"{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}\"\n\tProjectSection(ProjectDependencies) = postProject\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4} = {848D741E-A4F2-4680-AFD2-74C8723CE3C4}\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B} = {526D9044-1C4D-4A06-BAEB-0EB135F04F6B}\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705} = {1C574D77-FCC8-4249-8890-0B00EF092705}\n\tEndProjectSection\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.Core.Tests\", \"test\\XUnity.AutoTranslator.Plugin.Core.Tests\\XUnity.AutoTranslator.Plugin.Core.Tests.csproj\", \"{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"PapagoTranslate\", \"src\\Translators\\PapagoTranslate\\PapagoTranslate.csproj\", \"{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Http.ExtProtocol\", \"src\\Translators\\Http.ExtProtocol\\Http.ExtProtocol.csproj\", \"{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Common.ExtProtocol.Executor\", \"src\\Translators\\Common.ExtProtocol.Executor\\Common.ExtProtocol.Executor.csproj\", \"{94BD50EF-2E18-4A86-8582-35E75453F022}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"Common.ExtProtocol\", \"src\\Translators\\Common.ExtProtocol\\Common.ExtProtocol.csproj\", \"{D70C425F-F0C9-45BB-835D-16E827AC2939}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.Common\", \"src\\XUnity.Common\\XUnity.Common.csproj\", \"{B57D7D90-D295-4613-AD19-CC510158244C}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.ResourceRedirector\", \"src\\XUnity.ResourceRedirector\\XUnity.ResourceRedirector.csproj\", \"{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.Common.Tests\", \"test\\XUnity.Common.Tests\\XUnity.Common.Tests.csproj\", \"{B704D970-E95D-4297-AF83-A4F7DAFC1690}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Setup.Build-net45\", \"src\\XUnity.AutoTranslator.Setup.Build-net45\\XUnity.AutoTranslator.Setup.Build-net45.csproj\", \"{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.ResourceRedirector.BepInEx\", \"src\\XUnity.ResourceRedirector.BepInEx\\XUnity.ResourceRedirector.BepInEx.csproj\", \"{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.TextureHashGenerator\", \"src\\XUnity.TextureHashGenerator\\XUnity.TextureHashGenerator.csproj\", \"{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"GoogleTranslateCompat\", \"src\\Translators\\GoogleTranslateCompat\\GoogleTranslateCompat.csproj\", \"{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"GoogleTranslateCompat.ExtProtocol\", \"src\\Translators\\GoogleTranslateCompat.ExtProtocol\\GoogleTranslateCompat.ExtProtocol.csproj\", \"{6DC48447-D7DC-45F6-B830-35A0F916C7BF}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XZipper\", \"src\\XZipper\\XZipper.csproj\", \"{70A12896-52AF-444C-99EE-7D8E779741CA}\"\nEndProject\nProject(\"{2150E333-8FDC-42A3-9474-1A3956D46DE8}\") = \"tools\", \"tools\", \"{3E70DF54-72CA-4874-9EFE-6EA2F43FD7AC}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"ezTransXP\", \"src\\Translators\\ezTransXP\\ezTransXP.csproj\", \"{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"ezTransXP.ExtProtocol\", \"src\\Translators\\ezTransXP.ExtProtocol\\ezTransXP.ExtProtocol.csproj\", \"{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.MelonMod\", \"src\\XUnity.AutoTranslator.Plugin.MelonMod\\XUnity.AutoTranslator.Plugin.MelonMod.csproj\", \"{332A2D79-680C-4641-B823-2F7DA87952E5}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.AutoTranslator.Plugin.BepInEx-IL2CPP\", \"src\\XUnity.AutoTranslator.Plugin.BepInEx-IL2CPP\\XUnity.AutoTranslator.Plugin.BepInEx-IL2CPP.csproj\", \"{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"DeepLTranslate.ExtProtocol\", \"src\\Translators\\DeepLTranslate.ExtProtocol\\DeepLTranslate.ExtProtocol.csproj\", \"{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"DeepLTranslate\", \"src\\Translators\\DeepLTranslate\\DeepLTranslate.csproj\", \"{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"UnityEngine\", \"src\\UnityEngine\\UnityEngine.csproj\", \"{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"XUnity.ResourceRedirector.BepInEx-IL2CPP\", \"src\\XUnity.ResourceRedirector.BepInEx-IL2CPP\\XUnity.ResourceRedirector.BepInEx-IL2CPP.csproj\", \"{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}\"\nEndProject\nProject(\"{9A19103F-16F7-4668-BE54-9A1E7A4F7556}\") = \"LingoCloudTranslate\", \"src\\Translators\\LingoCloudTranslate\\LingoCloudTranslate.csproj\", \"{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}\"\nEndProject\nGlobal\n\tGlobalSection(SolutionConfigurationPlatforms) = preSolution\n\t\tDebug|Any CPU = Debug|Any CPU\n\t\tDebug|x86 = Debug|x86\n\t\tRelease|Any CPU = Release|Any CPU\n\t\tRelease|x86 = Release|x86\n\tEndGlobalSection\n\tGlobalSection(ProjectConfigurationPlatforms) = postSolution\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150}.Release|x86.Build.0 = Release|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938}.Release|x86.Build.0 = Release|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD}.Release|x86.Build.0 = Release|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F}.Release|x86.Build.0 = Release|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440}.Release|x86.Build.0 = Release|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E}.Release|x86.Build.0 = Release|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0}.Release|x86.Build.0 = Release|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461}.Release|x86.Build.0 = Release|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB}.Release|x86.Build.0 = Release|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286}.Release|x86.Build.0 = Release|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC}.Release|x86.Build.0 = Release|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5}.Release|x86.Build.0 = Release|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5}.Release|x86.Build.0 = Release|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44}.Release|x86.Build.0 = Release|Any CPU\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Debug|Any CPU.ActiveCfg = Debug|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Debug|Any CPU.Build.0 = Debug|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Debug|x86.ActiveCfg = Debug|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Debug|x86.Build.0 = Debug|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Release|Any CPU.ActiveCfg = Release|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Release|Any CPU.Build.0 = Release|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Release|x86.ActiveCfg = Release|x86\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076}.Release|x86.Build.0 = Release|x86\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61}.Release|x86.Build.0 = Release|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133}.Release|x86.Build.0 = Release|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4}.Release|x86.Build.0 = Release|Any CPU\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Debug|Any CPU.ActiveCfg = Debug|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Debug|Any CPU.Build.0 = Debug|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Debug|x86.ActiveCfg = Debug|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Debug|x86.Build.0 = Debug|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Release|Any CPU.ActiveCfg = Release|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Release|Any CPU.Build.0 = Release|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Release|x86.ActiveCfg = Release|x86\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705}.Release|x86.Build.0 = Release|x86\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B}.Release|x86.Build.0 = Release|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{921151C6-C532-44E3-92A1-283E5094171F}.Release|x86.Build.0 = Release|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A}.Release|x86.Build.0 = Release|Any CPU\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Debug|x86.ActiveCfg = Debug|x86\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Debug|x86.Build.0 = Debug|x86\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Release|x86.ActiveCfg = Release|x86\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3}.Release|x86.Build.0 = Release|x86\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89}.Release|x86.Build.0 = Release|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403}.Release|x86.Build.0 = Release|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD}.Release|x86.Build.0 = Release|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346}.Release|x86.Build.0 = Release|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83}.Release|x86.Build.0 = Release|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022}.Release|x86.Build.0 = Release|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD}.Release|x86.Build.0 = Release|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0}.Release|x86.Build.0 = Release|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06}.Release|x86.Build.0 = Release|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF}.Release|x86.Build.0 = Release|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA}.Release|x86.Build.0 = Release|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1}.Release|x86.Build.0 = Release|Any CPU\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Debug|Any CPU.ActiveCfg = Debug|x86\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Debug|Any CPU.Build.0 = Debug|x86\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Release|Any CPU.ActiveCfg = Release|x86\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Release|Any CPU.Build.0 = Release|x86\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D}.Release|x86.Build.0 = Release|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5}.Release|x86.Build.0 = Release|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72}.Release|x86.Build.0 = Release|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3}.Release|x86.Build.0 = Release|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B}.Release|x86.Build.0 = Release|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D}.Release|x86.Build.0 = Release|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC}.Release|x86.Build.0 = Release|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Debug|Any CPU.ActiveCfg = Debug|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Debug|Any CPU.Build.0 = Debug|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Debug|x86.ActiveCfg = Debug|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Debug|x86.Build.0 = Debug|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Release|Any CPU.ActiveCfg = Release|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Release|Any CPU.Build.0 = Release|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Release|x86.ActiveCfg = Release|Any CPU\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6}.Release|x86.Build.0 = Release|Any CPU\n\tEndGlobalSection\n\tGlobalSection(SolutionProperties) = preSolution\n\t\tHideSolutionNode = FALSE\n\tEndGlobalSection\n\tGlobalSection(NestedProjects) = preSolution\n\t\t{7A01BA34-3B96-4910-AC70-462BA59417CB} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{718A3B1D-A5E5-4223-AD53-45C60C874150} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{C749698C-9E49-4CC3-8B45-62AE3AD0C938} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{0A2A6B66-91D4-4A4E-AC77-80C6DD748FCD} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{86BF1F46-44C1-4301-8314-6EC32F74575F} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{12F1D16B-B8E1-4A9D-B65A-044650F15440} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{7493BA4A-C688-4103-B161-7E578FBB6C0E} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{5D9A4F4D-D2D2-4D2B-A58A-F7529DDAF1D0} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{95C83913-8D7F-4FA1-877E-288251A2A461} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{DDE97F5D-E021-45C0-87B6-FAD35BC8BCFB} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{F49BA6D1-FAFB-414C-97B1-28B77FC21286} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{CEA7D2D8-C2CF-4FA3-8184-DD485160CDAC} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{42DEC139-7E8E-4E2E-9BC9-0B5661F444C5} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{A74F9486-2BA0-42FF-8BBC-9F07ECFBDCE5} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{AE28F88E-E877-456B-98AB-BD03A59A3E44} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{AD0C7EF2-D394-43B5-9CCE-FA8A0A820076} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{41B612A5-2974-4988-A82E-84EEF2212A61} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{65500234-7AD4-48B8-B51B-945ADBFF1133} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{848D741E-A4F2-4680-AFD2-74C8723CE3C4} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{1C574D77-FCC8-4249-8890-0B00EF092705} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{15A1D255-25F3-4D10-8053-F24B32C1CB7B} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{921151C6-C532-44E3-92A1-283E5094171F} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{BE7ED338-106C-4CC6-BA19-8ADB2534326A} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{20E57B16-F3C7-4D80-88FC-09D6C5A4CCC3} = {2A4A3DDF-338C-40C0-8E26-2A810BAAADD6}\n\t\t{E2F50278-9134-4DC8-9C50-4C0A52063A89} = {2A4A3DDF-338C-40C0-8E26-2A810BAAADD6}\n\t\t{ADCCF172-7D31-42C6-B9D4-1779EAC8B403} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{4E1A0EB3-563A-419A-BE9D-5870A1A44CAD} = {2A4A3DDF-338C-40C0-8E26-2A810BAAADD6}\n\t\t{6CCCF86D-AA99-45B2-A301-7AE24C2E6346} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{95D6B899-8772-4A7A-AD95-ACDF18FD4D83} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{94BD50EF-2E18-4A86-8582-35E75453F022} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{D70C425F-F0C9-45BB-835D-16E827AC2939} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{B57D7D90-D295-4613-AD19-CC510158244C} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{B9D3F6D2-F140-4F14-B6BF-CA41C9F49E28} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{B704D970-E95D-4297-AF83-A4F7DAFC1690} = {2A4A3DDF-338C-40C0-8E26-2A810BAAADD6}\n\t\t{B3A3D3E7-A8F1-4110-8151-E674947CB8FD} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{526D9044-1C4D-4A06-BAEB-0EB135F04F6B} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{B0CFE100-5BB0-4FF0-B36A-98F6FE4E3DF0} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{A560E8E8-C0B1-4FC3-8CD4-C15D64BF9B06} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{6DC48447-D7DC-45F6-B830-35A0F916C7BF} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{70A12896-52AF-444C-99EE-7D8E779741CA} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{B75BB3F8-13D6-4124-BFA4-CA7EF8A92EA1} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{32E7E8D4-A0F7-47E9-95CA-60E928E06F2D} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{332A2D79-680C-4641-B823-2F7DA87952E5} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{11D631E6-0376-4913-BE3F-B7D7EDC2CD72} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{40E5D1F8-87F5-4BEF-8731-84335D4AC8C3} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{0DDB7B41-D86A-4810-8C2B-8F75DDF95E6B} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\t\t{715ECB82-01FD-4FD1-AEDA-24EFE6391D6D} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{884A07A0-9FBE-45C6-A771-5E5BB42ED3CC} = {0F9B38FC-4E57-4B83-AF0B-0993B8470823}\n\t\t{A5FFBACF-F165-4F22-A78C-A7A508E02AF6} = {7A01BA34-3B96-4910-AC70-462BA59417CB}\n\tEndGlobalSection\n\tGlobalSection(ExtensibilityGlobals) = postSolution\n\t\tSolutionGuid = {EE803FED-4447-4D19-B3D6-88C56E8DFCCA}\n\tEndGlobalSection\nEndGlobal\n"
        },
        {
          "name": "libs",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}