{
  "metadata": {
    "timestamp": 1736711034568,
    "page": 768,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjc3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Unity-Technologies/DOTS-training-samples",
      "stars": 1571,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.5068359375,
          "content": "[Ll]ibrary/\n[Ll]ogs/\n[Tt]emp/\n[Oo]bj/\n[Bb]uild/\n[Bb]uilds/\n.idea/\n\nt?\np?\n\n**/Assets/Plugins/\n**/Assets/Plugins.meta\nAssets/AssetStoreTools*\n\n# Visual Studio cache directory\n.vs/\n\n# Autogenerated VS/MD/Consulo solution and project files\nExportedObj/\n.consulo/\n*.csproj\n*.unityproj\n*.sln\n*.suo\n*.tmp\n*.user\n*.userprefs\n*.pidb\n*.booproj\n*.svd\n*.pdb\n*.opendb\n*.vsconfig\n\n# Unity3D generated meta files\n*.pidb.meta\n*.pdb.meta\n\n# Unity3D Generated File On Crash Reports\nsysinfo.txt\n\n# Builds\n*.apk\n*.unitypackage\n\n*.DS_Store\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 0.4677734375,
          "content": "DOTS training samples copyright © 2019 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see [Unity Companion License](https://unity3d.com/legal/licenses/Unity_Companion_License). \n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n"
        },
        {
          "name": "Original",
          "type": "tree",
          "content": null
        },
        {
          "name": "Ported",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 13.5830078125,
          "content": "Under the 'Originals' directory, you'll find small simulations/games implemented in classic (non-DOTS) Unity. Your task is to implement one of these samples in DOTS.\n\n1. Clone this repository.\n2. Make a new branch for your sample port.\n3. Create a new Unity Project and place it under the 'Ported' directory, *e.g* /Ported/AutoFarmers/\n4. Configure the project for DOTS.\n\nFeel free to copy assets and code snippets from the originals into your ports. The focus of this exercise is to familiarize yourself with the DOTS API and to practice Data-oriented Design principles!\n\n## Sample Gallery\n\n*Expand the arrows for more details about each sample.*\n\n<details>\n  <summary><strong>Ant Pheromones</strong>: Ants look for food and spread pheromones to influence the pathing of other ants.<br><i>Click here for details</i></summary>\n  \n  <ul>\n<li>Ants bring food from the source (green spot) to the destination (red spot).</li>\n<li>Each ant spawns at the center point with a random heading.</li>\n<li>Ants bounce off of walls at the inverse angle.</li>\n<li>Ants will steer towards the food source (green dot) if they have line of sight.</li>\n<li>Ants leave pheromone in the spots they walk over.</li>\n<li>Ant steering is affected by pheromones, goal location (food or nest), obstacle avoidance and obstacle \"bounce\".</li>\n<li>Pheromone at a spot decays over time.</li>\n<li>Ant steering is also slightly randomized, so ants don’t walk in straight lines.</li>\n<li>The gaps in the ring walls randomly vary in size and placement.</li>\n<li>Keyboard controls allow the user to slow down, speed up, and reset the simulation.</li>\n<li>The amount of pheromone an ant drops depends on the speed of the ant, and the speed depends on steering.</li>\n</ul>\n</details>\n\n![Ant Pheromones](_imgs/AntPhermones.gif?raw=true)\n \n---\n \n<details>\n  <summary><strong>Auto Farmers</strong>: Farmers gather and sell resources to expand their farm.<br><i>Click here for details</i></summary>\n  \n   <ul>\n<li>On start, a single farmer (the green cylinders) spawns.</li>\n<li>Farmers walk around to destroy rocks (the grey cylinders) to make way for tilling the soil (creating brown-striped crop cells).</li>\n<li>A plant grows in each crop cell. (The color and mesh of plant randomly varies.)</li>\n<li>When fully grown, a plant is ready for harvest by a farmer. Farmers deposit plants in the nearest silo (grey-blue cylinder).</li>\n<li>When enough resources have been collected into a silo, a new farmer spawns from the silo.</li>\n<li>Farmers look for their next task in a limited radius. If no task is found, they look in an increasingly larger radius until a task is found.</li>\n<li>For every fifth farmer spawned, a drone is spawned instead.</li>\n<li>Drones fly and harvest plants. They do not destroy rocks or plant crops.</li>\n<li>After depositing, drones hover over the silo until they locate a plant to harvest.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n \n![Auto Farmers](_imgs/AutoFarmers.png?raw=true)\n \n---\n \n <details>\n   <summary><strong>Bucket Brigade</strong>: Firefighters pass buckets along a chain to extinguish a fire.<br><i>Click here for details</i></summary>\n     \n   <ul>\n<li>Each cell of the grid has a temperature from 0.0 to 1.0. Cells above 0.2 are on fire and transmit heat to their neighbors. The color and height of a fire cell reflects its temperature. (For visual effect, a fire cell's height randomly oscillates a small amount, but this does not reflect its actual temperature.)</li>\n<li>On start, a few random cells are on fire. Buckets are randomly placed around the field.</li>\n<li>Workers are grouped into teams. Each team picks the closest cell on fire and forms two lines from the fire to the nearest water (blue cells outside the field). One line passes full buckets; the other passes empty buckets.</li>\n<li>Each team has a bucket fetcher, who retrieves the nearest bucket, walks it to the water at the end of the line, fills the bucket, and then drops it.</li>\n<li>Workers in the 'pass full' line look for full buckets on the ground within a small radius. When found, they walk over, pick up the bucket, carry it to the next worker up the line, and drop it. The last worker in the 'pass full' line empties the bucket on the fire (lowering the temperature of that cell and its eight surrounding cells to zero). Workers move slower while carrying a full bucket.</li>\n<li>Workers in the 'pass empty' line behave the same but only carry empty buckets.</li>\n<li>Every frame, a team will reposition its line to the fire cell closest to its current water source.</li>\n<li>When a team's water source is exhausted, it repositions the line to the next closest water.</li>\n<li>When repositioning, a worker will not resume its normal behavior until it has reached its new position.</li>\n<li>In the moment between a worker placing a bucket on the ground and the next picking it up, the line might reposition, in which case the bucket will be left on the ground.</li>\n<li>OPTIONAL: A small configured number of 'omniworkers' (black) are not part of any team. An omniworker picks up the nearest bucket, fills it at the nearest water source, and dumps it on the nearest fire.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Bucket Brigade](_imgs/BucketBrigade.png?raw=true)\n\n---\n\n<details>\n  <summary><strong>Combat Bees</strong>: Two bee hives battle for resources and survival.<br><i>Click here for details</i></summary>\n    \n   <ul>\n<li>Resources (green discs) spawn in the middle. Yellow bees spawn in the yellow base. Blue bees spawn in the blue base.</li>\n<li>Resources spawned at the same location will stack on top of each other.</li>\n<li>Bees pick up resources and drop them in their base.</li>\n<li>When a resource hits the ground of a base, it explodes, spawning several bees of that base's color.</li>\n<li>Bees not carrying resources may attack and destroy enemy bees.</li>\n<li>A destroyed bee emits bee fragments and blood splatters, and the resource eventually carried falls to the ground.</li>\n<li>Blood splatters on surfaces shrink to nothing over time.</li>\n<li>Each bee's displayed scale oscillates along all three axes, but this is just a visual effect. Collisions are not affected.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n<li>Left mouse clicks spawn additional resources at the point clicked (determined by casting a ray from the cursor).</li>\n<li>The camera can be controlled with the mouse (hold down right button to rotate, use mouse wheel to zoom). </li>\n   </ul>\n</details>\n\n![Combat Bees](_imgs/CombatBees.gif?raw=true)\n\n---\n\n<details>\n  <summary><strong>Highway Racers</strong>: Simulate traffic on a 4-lane highway.<br><i>Click here for details</i></summary>\n  \n  <ul>\n<li>Each car has a random cruising speed, a random overtake speed, a random overtake distance, and a random overtake time (each within a fixed min/max range).</li>\n<li>When traveling at its cruising speed, a car is grey. When going below its cruising speed, it turns red. While going above its cruising speed, it turns green.</li>\n<li>Cars have three main states: cruising, looking to change lane, and overtaking.</li>\n<li>While cruising, a car accelerates/brakes to its cruising speed; if it comes up behind a slower car within its overtake distance, it enters the 'looking to change lane' state.</li>\n<li>A looking-to-change car will look for sufficient open space to its left or right to change lanes. While blocked from changing lanes, the car will tail the car ahead of it. When it is clear to change lane, it will enter the overtake state.</li>\n<li>In the overtake state, a car first moves into another lane, then accelerates to its overtake speed. Once the car's overtake time elapses, it looks to move back into the lane it came from. If blocked from moving back, the car gives up and goes back to the cruising state. If at any time the car is impeded by a slower moving car within its overtake distance, it goes back to the cruising state.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Highway Racers](_imgs/HighwayRacers.gif?raw=true)\n\n---\n\n<details>\n  <summary><strong>LabRat</strong>: Place arrows on the board to route the most mice into your home base.<br><i>Click here for details</i></summary>\n    \n   <ul>\n<li>Mice spawn at frequent, randomized intervals from locations randomly chosen at startup.</li>\n<li>The board has holes at random locations, both mice and cats can fall into those holes and despawn when that happens.</li>\n<li>At start of play, walls are randomly placed between grid cells.</li>\n<li>Cats and mice travel on the grid, changing direction when they hit a wall or travel over an arrow.</li>\n<li>Cats spawn in random squares. When a cat and mouse intersect, the mouse is eaten.</li>\n<li>When a mouse hits a player's 'home base' (one of the four dots placed near the center of the grid), the mouse disappears, and the player is awarded a point.</li>\n<li>Similarly, when a cat hits a player's 'home base', the cat disappears, and the player gets negative points.</li>\n<li>Players can place arrows in cells of the board. The green player places green arrows, the red player places red arrows, etc. A player cannot place their arrows in a cell occupied by an arrow of another player.</li>\n<li>Once a player has three arrows on the board, their next placed arrow removes their oldest arrow on the board.</li>\n<li>Only one player is human. The AI players just place their arrows randomly at random intervals.</li>\n<li>At the end of 30 seconds, the player with the most points wins.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n<li>Walls can be added at runtime by left clicking while holding the shift key down.</li>\n   </ul>\n</details>\n\n![Lab Rat](_imgs/LabRat.gif?raw=true)\n\n---\n\n<details>\n  <summary><strong>Stack Interchange</strong>: Cars drive through a stack interchange.<br><i>Click here for details</i></summary>\n   \n   <ul>\n   <li>At random intervals, cars spawn at the edge of the straight roads. Cars despawn when they run off the edge of the straight roads.</li>\n   <li>Cars merging onto a new road should yield for cars on the road.</li>\n   <li>Each road has two lanes. Cars in both lanes of a road travel in the same direction.</li>\n   <li>Cars stay in their lanes through their whole trip, <em>e.g.</em> a car in the left lane will travel in the left lane on all roads.</li>\n   <li>Each car has a color matching one of the roadways. A car's path through the interchange must include the roadway maching its color.</li>\n   <li>Some roadways arch upwards to pass over other roads.</li>\n   <li>The simulation has multiple interchanges, but each is unconnected and independent from the others. Cars of one interchange do not travel to the other interchanges.</li>\n   <li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Stack Interchange](_imgs/StackInterchange.png?raw=true)\n\n---\n\n<details>\n  <summary><strong>Thrower Arms</strong>: Mechanical arms throw rocks at tin cans.<br><i>Click here for details</i></summary>\n   \n   <ul>\n   <li>The arms and hands are animated by inverse kinematics.</li>\n   <li>The cans scroll in from the sides and wrap around.</li>\n   <li>Rocks scroll in from the side and get destroyed once they reach the end. Additional rocks spawn along the path to ensure all arms have sufficient rocks.</li>\n   <li>Two arms should never reach for the same ball.</li>\n   <li>An arm does not collide with rocks or with other arms. The fingers wrap around a rock but do not actually grip the rock. The rock is temporarily attached to the hand.</li>\n   <li>Once an arm has picked up a rock, it targets a can and calculates the required throwing trajectory). (No two arms should ever attempt to pick up the same rock or target the same can.)</li>\n   <li>When struck, a can is affected by gravity and the force of the hit. A single rock can hit multiple cans. Rocks are impacted by their collisions with the cans. Cans do not collide with other cans.</li>\n   <li>Falling rocks and cans despawn when they fall below a certain altitude.</li>\n   <li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Thrower Arms](_imgs/ThrowerArms.gif?raw=true)\n\n---\n\n<details>\n  <summary><strong>Metro</strong>: Metro train transport commuters from station to station.<br><i>Click here for details</i></summary>\n    \n   <ul>\n   <li>The trains move on a fixed schedule. Passengers should not enter or exit the train if they do not have time to get in position before the train moves.</li>\n   <li>Disembarking passengers randomly pick another train to board.</li>\n   <li>The scene contains a set of authored control points that defines splines for the tracks. Some of these control points also define the placement of stations.</li>\n   <li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Metro](_imgs/Metro.gif?raw=true)\n\n\n---\n\n<details>\n  <summary><strong>Zombie Maze</strong>: A circle picks up capsules in a maze infested with zombies.<br><i>Click here for details</i></summary>\n  \n   <ul>\n   <li>A player (yellow cube) and zombies (green cubes) move along the grid of the board.</li>\n   <li>The interior maze walls are randomly generated at init time.</li>\n   <li>The magenta walls move back and forth at a regular interval.</li>\n   <li>The player wins by picking up all of the capsules.</li>\n   <li>Most zombies path towards a randoly chosen pill. When a zombie reaches its destination pill, it selects another pill target.</li>\n   <li>A fixed number of zombies path towards the player.</li>\n   <li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Zombie Maze](_imgs/ZombieMaze.png?raw=true)\n\n---\n\n[Deprecated samples](deprecated.md)\n"
        },
        {
          "name": "_imgs",
          "type": "tree",
          "content": null
        },
        {
          "name": "deprecated.md",
          "type": "blob",
          "size": 4.462890625,
          "content": "## Deprecated Samples\n\nThe following samples have proven to be poor exercises because they are too simple, too complicated, or too confusing. We list them here for completeness.\n\n* Cliff Divers (Difficulty 1): Dramatic shots of people diving down a cliff.\n\n    ![Cliff Divers](_imgs/CliffDivers.gif?raw=true)\n\n* CpuCarManufacturer (Difficulty 2): Car manufacturing used as a metaphor for the memory stack.\n\n    ![Cpu Car Manufacturer](_imgs/CpuCarManufacturer.png?raw=true)\n\n* Distance Field Attractors (Difficulty 1): Colorful particles move towards the surface of an invisible mesh.\n\n    ![Distance Field Attractors](_imgs/DistanceFieldAttractors.gif?raw=true)\n    \n* Future HUD (Difficulty 3): Futuristic HUDs drawn with OpenGL primitives.\n \n    ![Future HUD](_imgs/FutureHUD.png?raw=true)\n    \n* JobCloth (Difficulty 2): Simulate clothing using the Job system.\n\n    ![Job Cloth](_imgs/JobCloth.gif?raw=true)\n\n* Surgeon Master (Difficulty 2): Cut and stitch a triangle-mesh.\n\n    ![Surgeon Master](_imgs/SurgeonMaster.png?raw=true)\n\n* Parade (Difficulty 1): Take part in a parade and let people cheer for you.\n\n    ![Parade](_imgs/Parade.gif?raw=true)\n    \n---\n\n<details>\n  <summary><strong>Tornado</strong>: A tornado devastates a construction site.<br><i>Click here for details</i></summary>\n  \n   <ul>\n   <li>A tornado travels along the ground in a figure 8 pattern.</li>\n   <li>A fixed set of cubes swirl around in the tornado.</li>\n   <li>The force of the tornado breaks apart the joints of the randomly spawned towers.</li>\n   <li>The cubes and beams are affected by the force of the tornado, but they collide only with the ground, not with each other.</li>\n   <li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Tornado](_imgs/Tornado.gif?raw=true)\n\n\n---\n\n<details>\n  <summary><strong>Magnetic Roads</strong>: Cars drive along 3D generated splines in all orientations.<br><i>Click here for details</i></summary>\n    \n   <ul>\n<li>Cars drive in two lanes on both sides of the road. Cars always drive in the right lane.</li>\n<li>The cars all drive at the same speed. Cars will brake before hitting the car in front of them.</li>\n<li>Intersections join two or three road segments, but never four. Some intersecionts are dead ends: they connect to only one road segment.</li>\n<li>At three-way intersections, each car randomly chooses whether to go left, right, or straight.</li>\n<li>Cars wait to enter an intersection if their path through the intersection crosses the path of another car in the intersection.</li>\n   </ul>\n</details>\n\n![Magnetic Roads](_imgs/MagneticRoads.gif?raw=true)   \n\n---\n\n<details>\n  <summary><strong>Jump The Gun</strong>: A ball jumps through a blocky landscape and avoids cannonballs.<br><i>Click here for details</i></summary>\n\n<ul>\n<li>The ball bounces from column to adjacent column towards the mouse cursor. (This requires computing the appropriate trajectory for each bounce.) The movement is clamped to the edges of the playing field.</li>\n<li>On init, the cannons spawn on random columns. The cannons always turn to face the player's ball.</li>\n<li>Periodically, each cannon fires a cannon ball along a trajectory that will intersect the player's ball (at its current position) but not hit any columns in between.</li>\n<li>When a cannon ball hits the top of a column, the impact pushes the column down (but not below the minimum height).</li>\n<li>The game is over when a cannon ball hits the player's ball.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>  \n\n</details>\n\n![Jump The Gun](_imgs/JumpTheGun.gif?raw=true)\n\n---\n\n<details>\n  <summary><strong>Factory</strong>: Robots transport resources along lanes to crafters.<br><i>Click here for details</i></summary>\n  \n   <ul>\n<li>Users can click to add a cluster of several additional bots. Users can also click on tiles of the grid to clear them or to add walls (grey tile), add a resource (purple tile), add a crafter (green tile), add green lines, or add purple lines.</li>\n<li>Bots are purple when carrying a resource and green when not.</li>\n<li>Bots pick up resources at the purple tiles and deliver them to the green tiles (crafters).</li>\n<li>Bots will not collide with other bots. When bots are spawned, other bots gets pushed out of the way.</li>\n<li>Bots will path around walls. If you place a wall on top of bots, they will remain stuck until you erase the tile.</li>\n<li>Keyboard controls allow the user to reset the simulation.</li>\n   </ul>\n</details>\n\n![Factory](_imgs/Factory.png?raw=true)\n\n\n"
        }
      ]
    }
  ]
}