{
  "metadata": {
    "timestamp": 1736709601983,
    "page": 17,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "google/fonts",
      "stars": 18439,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".ci",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.03125,
          "content": "*.pb linguist-language=protobuf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.1279296875,
          "content": "*.ttx\n*.pyc\n\n# General\n.DS_Store\n.AppleDouble\n.LSOverride\n\n# Thumbnails\n._*\n\n# Files that might appear in the root of a volume\n.DocumentRevisions-V100\n.fseventsd\n.Spotlight-V100\n.TemporaryItems\n.Trashes\n.VolumeIcon.icns\n.com.apple.timemachine.donotpresent\n\n# Directories potentially created on remote AFP share\n.AppleDB\n.AppleDesktop\nNetwork Trash Folder\nTemporary Items\n.apdisk\n\n# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# Distribution / packaging\n.Python\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\npip-wheel-metadata/\nshare/python-wheels/\n*.egg-info/\n.installed.cfg\n*.egg\nMANIFEST\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test / coverage reports\nhtmlcov/\n.tox/\n.nox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*.cover\n*.py,cover\n.hypothesis/\n.pytest_cache/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\ndb.sqlite3\ndb.sqlite3-journal\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# IPython\nprofile_default/\nipython_config.py\n\n# pyenv\n.python-version\n\n# pipenv\n#   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.\n#   However, in case of collaboration, if having platform-specific dependencies or dependencies\n#   having no cross-platform support, pipenv may install dependencies that don't work, or not\n#   install all needed dependencies.\n#Pipfile.lock\n\n# PEP 582; used by e.g. github.com/David-OConnor/pyflow\n__pypackages__/\n\n# Celery stuff\ncelerybeat-schedule\ncelerybeat.pid\n\n# SageMath parsed files\n*.sage.py\n\n# Environments\n.env\n.venv\nenv/\nvenv/\nENV/\nenv.bak/\nvenv.bak/\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n.dmypy.json\ndmypy.json\n\n# Pyre type checker\n.pyre/\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "AUTHORS.txt",
          "type": "blob",
          "size": 0.3349609375,
          "content": "# This is the official list of authors for copyright purposes\n# of original works in this repository.\n#\n# This file is distinct from the CONTRIBUTORS files.\n# See the latter for an explanation.\n#\n# Names should be added to this file as:\n# Name or Organization <email address>\n# The email address is not required for organizations.\n\nGoogle LLC\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 6.826171875,
          "content": "\n# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement.\n\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Conflict Resolution\n\nWe do not believe that all conflict is bad; healthy debate and disagreement\noften yield positive results. However, it is never okay to be disrespectful or\nto engage in behavior that violates the project’s code of conduct.\n\nIf you see someone violating the code of conduct, you are encouraged to address\nthe behavior directly with those involved. Many issues can be resolved quickly\nand easily, and this gives people more control over the outcome of their\ndispute. If you are unable to resolve the matter for any reason, or if the\nbehavior is threatening or harassing, report it. We are dedicated to providing\nan environment where participants feel welcome and safe.\n\nReports should be directed to Dave Crossland <dcrossland@google.com>, the\nProject Steward(s) for Google Fonts. It is the Project Steward’s duty to\nreceive and address reported violations of the code of conduct. They will then\nwork with a committee consisting of representatives from the Open Source\nPrograms Office and the Google Open Source Strategy team. If for any reason you\nare uncomfortable reaching out the Project Steward, please email\n<opensource@google.com>.\n\nWe will investigate every complaint, but you may not receive a direct response.\nWe will use our discretion in determining when and how to follow up on reported\nincidents, which may range from not taking action to permanent expulsion from\nthe project and project-sponsored spaces. We will notify the accused of the\nreport and provide them an opportunity to discuss it before any action is taken.\nThe identity of the reporter will be omitted from the details of the report\nsupplied to the accused. In potentially harmful situations, such as ongoing\nharassment or threats to anyone's safety, we may take action without notice.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.3212890625,
          "content": "# Contribute to Google Fonts\n\nIn June 2022, we introduced new detailed documentation to help people contribute to Google Fonts, the [Google Fonts Guide](https://googlefonts.github.io/gf-guide/).\n\n## Feedback\n\nIf you have any feedback on Google Fonts API, catalog website, or the fonts themselves, please create an issue at [github.com/google/fonts/issues](http://github.com/google/fonts/issues).\nDon't forget to search in the issue tracker (using keywords) to check if your topic has already been raised, before opening a new one.\n\nWe have some issue templates for common topics:\n\n- [Submit an OFL Font](https://github.com/google/fonts/issues/new?assignees=&labels=II+New+Font%2C+>+Submission&template=1_add-font.md&title=Add+%5BFont+Name%5D)\n- [Submit a font upgrade](https://github.com/google/fonts/issues/new?assignees=&labels=II+Font+Upgrade&template=2_update-font.md&title=Update+%5BFont+Name%5D)\n- [Report a problem with a font](https://github.com/google/fonts/issues/new?assignees=&labels=II+Font+Bug&template=3_font-bug.md&title=)\n- [Anything else](https://github.com/google/fonts/issues/new?assignees=&labels=II+API+%2F+Website+%2F+Platform%2C+II+Tools+%2F+workflow+%2F+repo&template=4_anything-else.md&title=)\n\n## Adding and Upgrading families\n\nThe Google Fonts Guide has a chapter dedicated to the [requirements for font submissions and upgrade suggestions](https://googlefonts.github.io/gf-guide/onboarding.html).\nPlease read it carefully.\n\nIf you are able to meet these requirements yourself, please [create a new issue](https://github.com/google/fonts/issues) with a link to the project's source repository.\nIn special circumstances, you can request an exception to these requirements on your issue.\n\nIf you are a non-technical person who has developed a high quality typeface in a GUI application and are happy to meet all these requirements in spirit but need someone else to take care of all the technical stuff, Google Fonts also accepts submissions via email.\nSend an email to <fonts@google.com> with an attachment that includes complete source files, along with a clear statement you are the sole original author and are licensing the source files under OFL, with a request that we take care of everything else. \n\nFrom time to time, Google Fonts provides financial and design assistance for projects. \nIf you would like to discuss this, please mention that you would like someone to contact you privately when filing an issue (and have contact details on your Github profile page.)\n\n## Contributor License Agreement\n\nWe love to accept all good patches and contributions to this project. \nThere is just one thing contributors need to do first...\n\nContributions to Google projects must be accompanied by a Contributor License Agreement. \nThis is not a copyright assignment, it simply gives Google permission to use and redistribute your contributions as part of the project.\n\n<https://cla.developers.google.com>\n\nYou generally only need to submit the Google CLA once, so if you've already submitted one for a different project, you probably don't need to do it again.\n\nAfter your contribution is included, you can be listed in [CONTRIBUTORS](CONTRIBUTORS.txt) and/or [AUTHORS](AUTHORS.txt) files; \n`CONTRIBUTORS.txt` is the official list of people who can contribute (and typically have contributed) code to this repository, while the `AUTHORS.txt` file lists the copyright holders.\n"
        },
        {
          "name": "CONTRIBUTORS.txt",
          "type": "blob",
          "size": 1.119140625,
          "content": "# This is the official list of people who can contribute\n# (and typically have contributed) code to the original works\n# in this repository.\n#\n# The AUTHORS file lists the copyright holders; this file\n# lists people.  For example, Google employees are listed here\n# but not in AUTHORS, because Google holds the copyright.\n#\n# Names should be added to this file only after verifying that\n# the individual or the individual's organization has agreed to\n# the appropriate Contributor License Agreement, found here:\n#\n#     http://code.google.com/legal/individual-cla-v1.0.html\n#     http://code.google.com/legal/corporate-cla-v1.0.html\n#\n# The agreement for individuals can be filled out on the web.\n#\n# When adding J Random Contributor's name to this file,\n# either J's name or J's organization's name should be\n# added to the AUTHORS file, depending on whether the\n# individual or corporate CLA was used.\n#\n# Names should be added to this file like so:\n#     Name <email address>\n\nDavid Kuettel\nJeremie Lenfant-Engelmann\nRaph Levien\nDave Crossland\nRoozbeh Pournader\nBehdad Esfahbod\nRaziel Alvarez\nGarret Rieger\nRoderick Sheeter\nNyshadh Rachamallu\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.6806640625,
          "content": "[![CI Status](https://github.com/google/fonts/workflows/Continuous%20Test/badge.svg?branch=main)](https://github.com/google/fonts/actions/workflows/ci.yml?query=workflow%3ATest+branch%3Amain)\n\n# Google Fonts Files\n\nThis project mainly contains the binary font files served by Google Fonts ([fonts.google.com](https://fonts.google.com))\n\nThe top-level directories indicate the license of all files found within them.\nSubdirectories are named according to the family name of the fonts within.\n\nEach family subdirectory contains the `.ttf` font files served by Google Fonts, plus a `METADATA.pb` file with metadata for the family (such as information on the project designer(s), genre category, and license - [learn more](https://github.com/googlefonts/gf-docs/tree/master/METADATA)) and a `DESCRIPTION.en_us.html` with a description of the family in US English.\n\nThe `/catalog` subdirectory contains additional metadata, such as profile texts and portrait/avatar images of font designers, and this is open for contributions and corrections from anyone via GitHub.\n\nThe `/axisregistry` subtree contains metadata for the GF Axis Registry, containing information on variable font axes that can be found in the collection, including experimental axes.\nAs a subtree, no changes should be made directly to this repo, instead please use the upstream, [github.com/googlefonts/axisregistry](http://github.com/googlefonts/axisregistry)\n\nThe `/lang` subtree contains language support data, and should also not be changed here but instead upstream.\n[github.com/googlefonts/lang](https://github.com/googlefonts/lang)\n\n## Bug Reports and Improvement Requests\n\nIf you find a problem with a font file or have a request for the future development of a font project, please [create a new issue in this project's issue tracker](https://github.com/google/fonts/issues).\n\n## Contribute Fonts\n\nIf you need more context on how to create issues in a GitHub issue tracker, or if you want to contribute a font directly, see [CONTRIBUTING](https://github.com/google/fonts/blob/main/CONTRIBUTING.md)\n\n## Contributor Code of Conduct\n\nHowever you choose to contribute, please abide by our [code of conduct](CODE_OF_CONDUCT.md) to keep our community a healthy and welcoming place.\n\n## Self Host Fonts Available From Google Fonts\n\nSince all the fonts available here are licensed with permission to redistribute, subject to the license terms, you can self-host using a variety of third-party projects.\n\nOne popular service is [Fontsource](https://github.com/fontsource/fontsource), which offers bundled NPM packages.\n\n## Local installation package managers\n\nFor Linux, macOS, FreeBSD, or HaikuOS you can also use [fnt](https://github.com/alexmyczko/fnt), to install single fonts. For [RPM](http://bootes.ethz.ch/fonts/rpm/), [DEB](http://bootes.ethz.ch/fonts/deb/) based systems, feel free to try the linked URLs for individual fonts. Others can also use the [webservice](http://bootes.ethz.ch/fonts/).\n\n## Download All Google Fonts\n\nYou can download all Google Fonts in a simple ZIP snapshot (over 1GB) from <https://github.com/google/fonts/archive/main.zip>\n\n#### Sync With Git\n\nYou can also sync the collection with git so that you can update by only fetching what has changed. To learn how to use git, GitHub provides [illustrated guides](https://guides.github.com), a [youtube channel](https://www.youtube.com/user/GitHubGuides), and an [interactive learning site](https://skills.github.com/).\nFree, open-source git applications are available for [Windows](https://git-scm.com/download/gui/windows) and [Mac OS X](https://git-scm.com/download/gui/mac).\n\n## License\n\nIt is important to always read the license for every font that you use.\nEach font family directory contains the appropriate license file for the fonts in that directory.\nThe fonts files themselves also contain licensing and authorship metadata.\n\nMost of the fonts in the collection use the SIL Open Font License, v1.1.\nSome fonts use the Apache 2 license.\nThe Ubuntu fonts use the Ubuntu Font License v1.0.\n\nThe SIL Open Font License has an option for copyright holders to include a Reserved Font Name requirement, and this option is used with some of the fonts.\nIf you modify those fonts, please take care of this important detail.\n\n## Source Files\n\nSource files for each family are often available from the designer, or from [github.com/googlefonts](https://github.com/googlefonts)\n\nThese fonts are usually the result of collaborative projects, where you are invited to discuss issues with the designers and even contribute to their ongoing development.\n\nWhen customizing or remixing fonts, please do contact the designers to understand what they might need in order to include your improvements.\n\nMost of all: Enjoy the fonts!\n\n– The Google Fonts team\n"
        },
        {
          "name": "TRIVIA.md",
          "type": "blob",
          "size": 9.19921875,
          "content": "# github.com/google/fonts.git repo trivia\n\n## Incomplete greek-ext subsets \n\nOpen Sans (and some others, like Roboto) are advertised as they supporting Extended Greek, but choosing the greek-ext subset will not display Open Sans (or the required font) for this range because they don't actually contain the required characters.\nYou're welcome to commission these characters, though.\n\n## Google Fonts Repo Wiki\n\nThe previous fonts Mercurial repository had a wiki at <https://code.google.com/p/googlefontdirectory/wiki> which is no longer available. \nThe contents of the wiki are now available here:\n\n<https://github.com/googlefonts/gf-docs>\n\n## Duplicated fonts\n\nFrom time to time, families have been renamed or updated in a way that the existing styles had to change substantially.\nUntil April 2020, the initial family was retained, creating similarly named pairs of directories and often duplicate/redundant, files.\nThe initial families are kept in the API so that people already using them can continue to do so. \nThey are no longer listed in the [fonts.google.com](https://fonts.google.com) catalog, or in the HEAD of the master branch, but the files still exist in the commit history.\n\n| Initial Family           | Current Family           | Category |\n|:-------------------------|:-------------------------|:---------|\n| `alefhebrew`             | `alef`                   | renamed  |\n| `mrbedford`              | `mrbedfort`              | renamed  |\n| `misssaintdelafield`     | `mrssaintdelafield`      | renamed  |\n| `siamreap`               | `siemreap`               | renamed  |\n| `terminaldosis`          | `dosis`                  | renamed  |\n| `terminaldosislight`     | `dosis`                  | expanded |\n| `baloo`                  | `baloo2`                 | expanded |\n| `baloobhai`              | `baloobhai2`             | expanded |\n| `baloobhaijaan`          | `baloobhaijaan2`         | expanded |\n| `baloobhaina`            | `baloobhaina2`           | expanded |\n| `baloochettan`           | `baloochettan2`          | expanded |\n| `balooda`                | `balooda2`               | expanded |\n| `baloopaaji`             | `baloopaaji2`            | expanded |\n| `balootamma`             | `balootamma2`            | expanded |\n| `balootammudu`           | `balootammudu2`          | expanded |\n| `baloothambi`            | `baloothambi2`           | expanded |\n| `bevietnam`              | `bevietnampro`           | expanded |\n| `spartan`                | `leaguespartan`          | expanded |\n| `scheherazade`           | `scheherazadenew`        | expanded |\n| `kdamthmor`              | `kdamthmorpro`           | expanded |\n| `andikanewbasic`         | `andika`                 | expanded |\n| `gentiumbasic`           | `gentiumplus`            | expanded |\n| `andada`                 | `andadapro`              | expanded |\n| `fredokaone`             | `fredoka`                | expanded |\n| `gentiumbookbasic`       | `gentiumbookplus`        | expanded |\n| `arimamadurai`           | `arima`                  | expanded |\n| `meriendaone`            | `merienda`               | expanded |\n| `codacaption`            | `coda`                   | expanded |\n| `sourceserifpro`         | `sourceserif4`           | renamed  |\n| `sourcesanspro`          | `sourcesans3`            | renamed  |\n\n\n## Missing METADATA.pb files\n\nFonts in Early Access do not have METADATA.pb files.\n\n## .pb vs .textproto \n\nWhile `.textproto` is now the canonical extension for Protocol Buffers (Protobuf) text files, we have hundreds of `METADATA` files with the `.pb` extension. \nThe inconsistency isn't a practical issue, and as we have internal tools that assume the old filenames, it isn't worth renaming them proactively.\n\n## Install on Windows\n\nYou can install all of the fonts using Windows PowerShell. Change directories to the folder where you downloaded the package, and run the following command:\n\n    $fonts = (New-Object -ComObject Shell.Application).Namespace(0x14)\n    dir ofl/*/*.ttf | %{ $fonts.CopyHere($_.fullname) }\n\n## 3rd Party Directories\n\nThe [fonts.google.com](https://fonts.google.com) is accompanied by a [Google Fonts Developer API](https://developers.google.com/fonts/docs/developer_api), which provides raw data for constructing such a directory in JSON format. \nHere is a list of 3rd party directories:\n\n* <http://font-combinator.com> + <http://chipcullen.com/font-combinator>\n* <https://www.typetester.org>\n* <http://font-combinator.com>\n* <http://somadesign.ca/demos/better-google-fonts>\n* <http://fontapp.org>\n* <http://fontapp.org/graph>\n* <http://katydecorah.com/font-library>\n* <http://fontcdn.org>\n* <http://googlefontsdirectory.org>\n* <https://hail2u.github.io/mn>\n* <http://fontflame.com>\n* <http://jenniferdewalt.com/gfboom/page>\n* <http://fontpair.co>\n* <https://typ.io>\n* <http://andreasweis.com/webfontblender>\n* <http://www.typegenius.com>\n* <http://abbychen.me/punch>\n* <http://typewonder.com>\n* <http://www.localfont.com>\n* <http://open-foundry.com>\n* <https://typeresources.github.io/glyph-gazer>\n* <http://cdn.canelodigital.cl/fonts>\n* <http://code.thisarmy.com/fontsinfo>\n* <http://www.localfont.com>\n* <http://brandmark.io/font-generator>\n* <http://archetypeapp.com>\n* <https://useratio.com/the-anatomy-of-a-thousand-typefaces>\n* <https://tyffle.ml>\n* <https://lepovirta.github.io/Typographer> \n* <https://lepovirta.github.io/Typographer-React>\n* <https://jmattthew.github.io/better-font-finder/better-font-finder.html>\n* <https://font2vec.vishalgupta.me> ([source](https://github.com/py-ranoid/font2vec)), a 3D projection of all fonts\n* <https://logogenerator.website>\n* <http://www.ourownthing.co.uk/fontpairing/>\n* <https://goofonts.com>\n* <https://designmeme.github.io/finding-baseline>\n* <https://mikk3lro.github.io/vue-fontpicker>\n* <https://paulzi.github.io/google-fonts-loader>\n* <https://winniethemu.github.io/tiff>\n* <https://www.fontcomparer.com>\n\nThere are also handcrafted directories with rich samples:\n\n* <http://hellohappy.org/beautiful-web-type>\n* <http://femmebot.github.io/google-type>\n* <http://100daysoffonts.com>\n* <http://jxnblk.com/type-a>\n* <https://jonsuh.com/100-days-of-scriptures>\n* <http://codepen.io/nxworld/pen/XKRaRm>\n* <https://twitter.com/FontSnek>\n* <https://www.reliablepsd.com/ultimate-google-font-pairings>\n* <http://fonts.greatsimple.io>\n* <https://digitalsynopsis.com/design/best-google-font-combinations-typeface-pairings/>\n* <https://www.fontsinthewild.com/google>\n* <https://stabla.github.io/good-google-fonts>\n\n## Rightsholder contacts\n\nThis shell command shows all email addresses for font copyright holders listed in the METADATA.pb files:\n\n    grep copyright\\: */*/MET* | grep \\@ |  perl -ne'if(/[\\w\\.\\-\\_]+@([\\w\\-\\_]+\\.)+[A-Za-z]{2,4}/g){print \"$&\\n\"}' | sort | uniq\n\nThis shell command shows all the families without a contact email address:\n\n    grep copyright\\: */*/MET* | grep -v \\@ | cut -d\\: -f1 | cut -d\\/ -f2 | uniq | sort\n\nThe copyright holders of those families include Google, SIL, Adobe, Canonical, Naver, and a couple of outliers. \n\n## Articles about Google Fonts\n\nSome interesting articles about Google Fonts:\n\n* <http://googlecode.blogspot.com/2010/05/introducing-google-font-api-google-font.html>\n* <http://googlewebfonts.blogspot.com>\n* <https://design.google.com/articles/reimagining-google-fonts>\n* <https://medium.com/google-design/introducing-space-mono-a-new-monospaced-typeface-by-colophon-foundry-for-google-fonts-84367eac6dfb>\n* <http://www.fastcodesign.com/3033126/roboto-rebooted-why-google-plans-to-update-its-font-like-the-rest-of-its-products>\n\n## Interesting Libre Fonts Not In Google Fonts\n\nHere is a list of some libre fonts made for special purposes (emoji, math, icons, etc) that are not available in Google Fonts. \n\n* <https://material.io/icons>\n* <https://github.com/figs-lab/datalegreya>\n\n## Where were the homepage sample texts from?\n\nIn 2016 to 2020, the Google Fonts catalog displayed one of a dozen or so different sample texts.\nHere they are and where they are from:\n\n* \"A red flair silhouetted the jagged edge of a wing\" – The Jewels of Aptor, Samuel R. Delany\n* \"A shining crescent far beneath the flying vessel\" – Triplanetary, E. E. Smith\n* \"All their equipment and instruments are alive\" – Mr. Spaceship, Philip K. Dick\n* \"Almost before we knew it, we had left the ground\" – A Trip to Venus, John Munro\n* \"I watched the storm, so beautiful yet terrific\" – Frankenstein, Mary Shelley\n* \"It was going to be a lonely trip back\" – Youth by Isaac Asimov\n* \"Mist enveloped the ship three hours out from port\" – The Jewels of Aptor, Samuel R. Delany\n* \"My two natures had memory in common\" – Strange Case of Dr Jekyll and Mr Hyde, Robert Louis Stevenson\n* \"She stared through the window at the stars\" – The Millionaire's Convenient Bride, Catherine George ????\n* \"Silver mist suffused the deck of the ship\" – The Jewels of Aptor, Samuel R. Delany\n* \"The face of the moon was in shadow\" – Mr. Spaceship, Philip K. Dick\n* \"The recorded voice scratched in the speaker\" – Deathworld, Harry Harrison\n* \"The sky was cloudless and of a deep dark blue\" – A Trip to Venus, John Munro\n* \"The spectacle before us was indeed sublime\" – A Trip to Venus, John Munro\n* \"Then came the night of the first falling star\" – The War of the Worlds, H. G. Wells\n* \"Waves flung themselves at the blue evening\" – The Jewels of Aptor, Samuel R. Delany\"\n"
        },
        {
          "name": "apache",
          "type": "tree",
          "content": null
        },
        {
          "name": "axisregistry",
          "type": "tree",
          "content": null
        },
        {
          "name": "catalog",
          "type": "tree",
          "content": null
        },
        {
          "name": "cc-by-sa",
          "type": "tree",
          "content": null
        },
        {
          "name": "lang",
          "type": "tree",
          "content": null
        },
        {
          "name": "ofl",
          "type": "tree",
          "content": null
        },
        {
          "name": "tags",
          "type": "tree",
          "content": null
        },
        {
          "name": "to_delist.txt",
          "type": "blob",
          "size": 1.978515625,
          "content": "lang/languages/sa_Avst.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Batk.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Buhd.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Dogr.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Hano.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Khoj.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Kthi.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Lepc.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Mahj.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Olck.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Saur.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Takr.textproto # https://github.com/google/fonts/pull/6573\nlang/languages/sa_Modi.textproto # https://github.com/google/fonts/pull/7622\nlang/languages/sa_Ranj.textproto # https://github.com/google/fonts/pull/7622\nlang/languages/sa_Sind.textproto # https://github.com/google/fonts/pull/7622\nlang/languages/sa_Sund.textproto # https://github.com/google/fonts/pull/7622\nlang/languages/sd_Khud.textproto # https://github.com/google/fonts/pull/6648\nlang/languages/zul_Latn.textproto # https://github.com/google/fonts/pull/6787\nlang/languages/adl_Latn.textproto # https://github.com/google/fonts/pull/6962\nlang/languages/bwy_Latn.textproto # https://github.com/google/fonts/pull/7146\nlang/languages/sa_Limb.textproto # https://github.com/google/fonts/pull/7146\nlang/languages/sa_Sylo.textproto # https://github.com/google/fonts/pull/7248\nlang/languages/mlt_Latn.textproto # https://github.com/google/fonts/pull/7680\n\n# will be replaced by https://fonts.google.com/noto/specimen/Noto+Sans+PhagsPa (no space)\nhttps://fonts.google.com/noto/specimen/Noto+Sans+Phags+Pa \n\n# Apache license will be replaced by ofl\napache/roboto # https://github.com/google/fonts/pull/6943\n\n"
        },
        {
          "name": "to_production.txt",
          "type": "blob",
          "size": 0.0009765625,
          "content": "\n"
        },
        {
          "name": "to_sandbox.txt",
          "type": "blob",
          "size": 0.1474609375,
          "content": "# New\n\n# Designer profile\n\n# Knowledge\n\n# Metadata / Description / License\nofl/zhimangxing # https://github.com/google/fonts/pull/8728\n\n# Sample texts\n"
        },
        {
          "name": "ufl",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}