{
  "metadata": {
    "timestamp": 1736567717565,
    "page": 303,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "contribsys/faktory",
      "stars": 5805,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.029296875,
          "content": "Dockerfile\ndocker-compose.yml\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.3994140625,
          "content": "# Binaries for programs and plugins\n*.exe\n*.dll\n*.so\n*.dylib\n\n# Test binary, build with `go test -c`\n*.test\ntmp/\n\n# Output of the go coverage tool, specifically when used with LiteIDE\n*.out\n\n# Project-local glide cache, RE: https://github.com/Masterminds/glide/issues/736\n.glide/\n.vagrant\npackaging/output/\nvendor/\n\n.DS_Store\n\n/faktory\n/faktory_amd64\n/faktory_arm64\n/faktory-cli\n/loadtest\n/coverage.html\ntags\n"
        },
        {
          "name": ".golangci.yml",
          "type": "blob",
          "size": 0.8623046875,
          "content": "linters-settings:\n  gocritic:\n    # Which checks should be enabled; can't be combined with 'disabled-checks';\n    # See https://go-critic.github.io/overview#checks-overview\n    # To check which checks are enabled run `GL_DEBUG=gocritic golangci-lint run`\n    # By default list of stable checks is used.\n    disabled-checks:\n      - commentedOutCode\n      - paramTypeCombine\n      - ifElseChain\n      - unnamedResult\n\n    # Enable multiple checks by tags, run `GL_DEBUG=gocritic golangci-lint run` to see all tags and checks.\n    # Empty list by default. See https://github.com/go-critic/go-critic#usage -> section \"Tags\".\n    enabled-tags:\n      - performance\n      - diagnostic\n      - opinionated\n\n    settings: # settings passed to gocritic\n      rangeExprCopy:\n        sizeThreshold: 24\n      rangeValCopy:\n        sizeThreshold: 24\nlinters:\n  enable:\n    - gocritic\n    - gosec\n"
        },
        {
          "name": ".local.sh",
          "type": "blob",
          "size": 0.1669921875,
          "content": "ROCKSDB_HOME=/usr/local/Cellar/rocksdb/5.5.1\nCGO_CFLAGS=\"-I${ROCKSDB_HOME}/include\"\nCGO_LDFLAGS=\"-L${ROCKSDB_HOME} -lrocksdb -lstdc++ -lm -lz -lbz2 -lsnappy -llz4 -lzstd\"\n"
        },
        {
          "name": "COMM-LICENSE",
          "type": "blob",
          "size": 17.15234375,
          "content": "END-USER LICENSE AGREEMENT\n\n------------------------------------------------------------------------------\n\nIMPORTANT: THIS SOFTWARE END-USER LICENSE AGREEMENT (\"EULA\") IS A LEGAL AGREEMENT (“Agreement”) BETWEEN YOU (THE CUSTOMER, EITHER AS AN INDIVIDUAL OR, IF PURCHASED OR OTHERWISE ACQUIRED BY OR FOR AN ENTITY, AS AN ENTITY) AND CONTRIBUTED SYSTEMS. READ IT CAREFULLY BEFORE COMPLETING THE INSTALLATION PROCESS AND USING FAKTORY PRO AND RELATED SOFTWARE COMPONENTS (“SOFTWARE”). IT PROVIDES A LICENSE TO USE THE SOFTWARE AND CONTAINS WARRANTY INFORMATION AND LIABILITY DISCLAIMERS. BY INSTALLING AND USING THE SOFTWARE, YOU ARE CONFIRMING YOUR ACCEPTANCE OF THE SOFTWARE AND AGREEING TO BECOME BOUND BY THE TERMS OF THIS AGREEMENT.\n\n------------------------------------------------------------------------------\n\nIn order to use the Software under this Agreement, you must receive a “Access Credentials” at the time of purchase, in accordance with the scope of use and other terms specified for each type of Software and as set forth in this Section 1 of this Agreement. \n\n1. License Grant\n\n1.1 General Use. This Agreement grants you a non-exclusive, non-transferable, limited license to the use rights for the Software, without the right to grant sublicenses, subject to the terms and conditions in this Agreement. The Software is licensed, not sold.\n\n1.2 Server License. If you purchased a Server License, you may install the Software on an unlimited number of Hosts for the purposes of development or testing. You must purchase a license for each production Host. “Host” means any physical or virtual machine which is controlled by you.\n\n1.3 Appliance License. If you purchased an Appliance License, you may distribute the Software in any applications, frameworks, or elements (collectively referred to as an “Application” or “Applications”) that you develop using the Software in accordance with this EULA, provided that such distribution does not violate the restrictions set forth in section 3 of this EULA. You must not remove, obscure or interfere with any copyright, acknowledgment, attribution, trademark, warning or disclaimer statement affixed to, incorporated in or otherwise applied in connection with the Software. You are required to ensure that the Software is not reused by or with any applications other than those with which you distribute it as permitted herein. For example, if You install the Software on a customer’s server, that customer is not permitted to use the Software independently of your Application. You must inform Contributed Systems of your knowledge of any infringing use of the Software by any of your customers. You are liable for compliance by those third parties with the terms and conditions of this EULA. You will not owe Contributed Systems any royalties for your distribution of the Software in accordance with this EULA.\n\n1.4 Archive Copies. You are entitled to make a reasonable amount of copies of the Software for archival purposes. Each copy must reproduce all copyright and other proprietary rights notices on or in the Software Product.\n\n1.5 Electronic Delivery. All Software and license documentation shall be delivered by electronic means unless otherwise specified on the applicable invoice or at the time of purchase. Software shall be deemed delivered when it is made available for download by you (“Delivery”).\n\n2. Modifications. Contributed Systems shall provide you with source code so that you can create Modifications of the original software. “Modification” means: (a) any addition to or deletion from the contents of a file included in the original Software or previous Modifications created by You, or (b) any new file that contains any part of the original Software or previous Modifications. While you retain all rights to any original work authored by you as part of the Modifications, We continue to own all copyright and other intellectual property rights in the Software.\n\n3. Restricted Uses.\n\n3.1 You shall not (and shall not allow any third party to): (a) decompile, disassemble, or otherwise reverse engineer the Software or attempt to reconstruct or discover any source code, underlying ideas, algorithms, file formats or programming interfaces of the Software by any means whatsoever (except and only to the extent that applicable law prohibits or restricts reverse engineering restrictions); (b) distribute, sell, sublicense, rent, lease or use the Software for time sharing, hosting, service provider or like purposes, except as expressly permitted under this Agreement; (c) redistribute the Software or Modifications other than by including the Software or a portion thereof within your own product, which must have substantially different functionality than the Software or Modifications and must not allow any third party to use the Software or Modifications, or any portions thereof, for software development or application development purposes; (d) redistribute the Software as part of a product, \"appliance\" or \"virtual server\"; (e) redistribute the Software on any server which is not directly under your control; (f) remove any product identification, proprietary, copyright or other notices contained in the Software; (g) modify any part of the Software, create a derivative work of any part of the Software (except as permitted in Section 4), or incorporate the Software, except to the extent expressly authorized in writing by Contributed Systems; (h) publicly disseminate performance information or analysis (including, without limitation, benchmarks) from any source relating to the Software; (i) utilize any equipment, device, software, or other means designed to circumvent or remove any form of access control or copy protection used by Contributed Systems in connection with the Software, or use the Software together with any authorization code, credentials, serial number, or other copy protection device not supplied by Contributed Systems; (j) use the Software to develop a product which is competitive with any Contributed Systems product offerings; or (k) use unauthorized credentials or keycode(s) or distribute or publish credentials or keycode(s), except as may be expressly permitted by Contributed Systems in writing. If your unique credentials are ever published, Contributed Systems reserves the right to terminate your access without notice.\n\n3.2 UNDER NO CIRCUMSTANCES MAY YOU USE THE SOFTWARE AS PART OF A PRODUCT OR SERVICE THAT PROVIDES SIMILAR FUNCTIONALITY TO THE SOFTWARE ITSELF.\n\nThe Open Source version of the Software (“AGPL Version”) is licensed\nunder the terms of the GNU Affero General Public License version 3.0\n(“AGPL”) and not under this EULA.\n\n4. Ownership. Notwithstanding anything to the contrary contained herein, except for the limited license rights expressly provided herein, Contributed Systems and its suppliers have and will retain all rights, title and interest (including, without limitation, all patent, copyright, trademark, trade secret and other intellectual property rights) in and to the Software and all copies, modifications and derivative works thereof (including any changes which incorporate any of your ideas, feedback or suggestions). You acknowledge that you are obtaining only a limited license right to the Software, and that irrespective of any use of the words “purchase”, “sale” or like terms hereunder no ownership rights are being conveyed to you under this Agreement or otherwise.\n\n5. Fees and Payment. The Software license fees will be due and payable in full as set forth in the applicable invoice or at the time of purchase. If the Software does not function properly within two weeks of purchase, please contact us within those two weeks for a refund. You shall be responsible for all taxes, withholdings, duties and levies arising from the order (excluding taxes based on the net income of Contributed Systems).\n\n6. Support, Maintenance and Services. Subject to the terms and conditions of this Agreement, as set forth in your invoice, and as set forth on the Faktory Pro support page (https://github.com/contribsys/faktory/wiki/Commercial-Support), support and maintenance services may be included with the purchase of your license subscription.\n\n7. Term of Agreement.\n\n7.1 Term. This Agreement is effective as of the Delivery of the Software and expires at such time as all license and service subscriptions hereunder have expired in accordance with their own terms (the “Term”). For clarification, the term of your license under this Agreement may be perpetual, limited for Evaluation Version, or designated as a fixed-term license in the Invoice, and shall be specified at your time of purchase. Either party may terminate this Agreement (including all related Invoices) if the other party: (a) fails to cure any material breach of this Agreement within thirty (30) days after written notice of such breach, provided that Contributed Systems may terminate this Agreement immediately upon any breach of Section 3 or if you exceed any other restrictions contained in Section 1, unless otherwise specified in this agreement; (b) ceases operation without a successor; or (c) seeks protection under any bankruptcy, receivership, trust deed, creditors arrangement, composition or comparable proceeding, or if any such proceeding is instituted against such party (and not dismissed within sixty (60) days)). Termination is not an exclusive remedy and the exercise by either party of any remedy under this Agreement will be without prejudice to any other remedies it may have under this Agreement, by law, or otherwise.\n\n7.2 Termination. Upon any termination of this Agreement, you shall cease any and all use of any Software and destroy all copies thereof.\n\n7.3 Expiration of License. Upon the expiration of any term under this Agreement, (a) all Software updates and services pursuant to the license shall cease, (b) you may no longer use existing installations of the Software, (c) you may not install the Software on any additional Hosts, and (d) any further use of the Software shall require the purchase of a new license subscription from Contributed Systems.\n\n8. Disclaimer of Warranties. The Software is provided \"as is,\" with all faults, defects and errors, and without warranty of any kind. Contributed Systems does not warrant that the Software will be free of bugs, errors, viruses or other defects, and Contributed Systems shall have no liability of any kind for the use of or inability to use the Software, the Software content or any associated service, and you acknowledge that it is not technically practicable for Contributed Systems to do so.\nTo the maximum extent permitted by applicable law, Contributed Systems disclaims all warranties, express, implied, arising by law or otherwise, regarding the Software, the Software content and their respective performance or suitability for your intended use, including without limitation any implied warranty of merchantability, fitness for a particular purpose.\n\n9. Limitation of Liability.\n\nIn no event will Contributed Systems be liable for any direct, indirect, consequential, incidental, special, exemplary, or punitive damages or liabilities whatsoever arising from or relating to the Software, the Software content or this Agreement, whether based on contract, tort (including negligence), strict liability or other theory, even if Contributed Systems has been advised of the possibility of such damages.\n\nIn no event will Contributed Systems' liability exceed the Software license price as indicated in the invoice. The existence of more than one claim will not enlarge or extend this limit.\n\n10. Remedies. Your exclusive remedy and Contributed Systems’ entire liability for breach of this Agreement shall be limited, at Contributed Systems’ sole and exclusive discretion, to (a) replacement of any defective software or documentation; or (b) refund of the license fee paid to Contributed Systems, payable in accordance with Contributed Systems' refund policy.\n\n11. Acknowledgements.\n\n11.1 Consent to the Use of Data. You agree that Contributed Systems and its affiliates may collect and use technical information gathered as part of the product support services. Contributed Systems may use this information solely to improve products and services and will not disclose this information in a form that personally identifies you.\n\n11.2 Verification. We or a certified auditor acting on our behalf, may, upon its reasonable request and at its expense, audit you with respect to the use of the Software. Such audit may be conducted by mail, electronic means or through an in-person visit to your place of business. Any such in-person audit shall be conducted during regular business hours at your facilities and shall not unreasonably interfere with your business activities. We shall not remove, copy, or redistribute any electronic material during the course of an audit. If an audit reveals that you are using the Software in a way that is in material violation of the terms of the EULA, then you shall pay our reasonable costs of conducting the audit. In the case of a material violation, you agree to pay Us any amounts owing that are attributable to the unauthorized use. In the alternative, We reserve the right, at our sole option, to terminate the licenses for the Software.\n\n11.3 Government End Users. If the Software and related documentation are supplied to or purchased by or on behalf of the United States Government, then the Software is deemed to be \"commercial software\" as that term is used in the Federal Acquisition Regulation system. Rights of the United States shall not exceed the minimum rights set forth in FAR 52.227-19 for \"restricted computer software\". All other terms and conditions of this Agreement apply.\n\n12. Third Party Software.  Examples included in Software may provide links to third party libraries or code (collectively “Third Party Software”) to implement various functions. Third Party Software does not comprise part of the Software. In some cases, access to Third Party Software may be included along with the Software delivery as a convenience for demonstration purposes. Such source code and libraries may be included in the “…/examples” source tree delivered with the Software and do not comprise the Software. Licensee acknowledges (1) that some part of Third Party Software may require additional licensing of copyright and patents from the owners of such, and (2) that distribution of any of the Software referencing or including any portion of a Third Party Software may require appropriate licensing from such third parties.\n\n\n13. Miscellaneous\n\n13.1 Entire Agreement. This Agreement sets forth our entire agreement with respect to the Software and the subject matter hereof and supersedes all prior and contemporaneous understandings and agreements whether written or oral.\n\n13.2 Amendment. Contributed Systems reserves the right, in its sole discretion, to amend this Agreement from time. Amendments to this Agreement can be located at: https://github.com/contribsys/faktory/blob/master/COMM-LICENSE.\n\n13.3 Assignment. You may not assign this Agreement or any of its rights under this Agreement without the prior written consent of Contributed Systems and any attempted assignment without such consent shall be void.\n\n13.4 Export Compliance. You agree to comply with all applicable laws and regulations, including laws, regulations, orders or other restrictions on export, re-export or redistribution of software.\n\n13.5 Indemnification. You agree to defend, indemnify, and hold harmless Contributed Systems from and against any lawsuits, claims, losses, damages, fines and expenses (including attorneys' fees and costs) arising out of your use of the Software or breach of this Agreement.\n\n13.6 Governing Law. This Agreement is governed by the laws of the State of Oregon and the United States without regard to conflicts of laws provisions thereof, and without regard to the United Nations Convention on the International Sale of Goods or the Uniform Computer Information Transactions Act, as currently enacted by any jurisdiction or as may be codified or amended from time to time by any jurisdiction. The jurisdiction and venue for actions related to the subject matter hereof shall be the state of Oregon and United States federal courts located in Portland, Oregon, and both parties hereby submit to the personal jurisdiction of such courts.\n\n13.7 Attorneys’ Fees and Costs. The prevailing party in any action to enforce this Agreement will be entitled to recover its attorneys’ fees and costs in connection with such action.\n\n13.8 Severability. If any provision of this Agreement is held by a court of competent jurisdiction to be invalid, illegal, or unenforceable, the remainder of this Agreement will remain in full force and effect.\n\n13.9 Waiver. Failure or neglect by either party to enforce at any time any of the provisions of this licence Agreement shall not be construed or deemed to be a waiver of that party's rights under this Agreement.\n\n13.10 Headings. The headings of sections and paragraphs of this Agreement are for convenience of reference only and are not intended to restrict, affect or be of any weight in the interpretation or construction of the provisions of such sections or paragraphs.\n\n14. Contact Information. If you have any questions about this EULA, or if you want to contact Contributed Systems for any reason, please direct correspondence to info@contribsys.com.\n"
        },
        {
          "name": "Changes.md",
          "type": "blob",
          "size": 8.6640625,
          "content": "# Faktory Changelog\n\nChangelog: Faktory || [Faktory Enterprise](https://github.com/contribsys/faktory/blob/master/Ent-Changes.md)\n\n## 1.9.1\n\n- Fix top-error silently crashing Faktory [#479]\n- Various lint fixes for golangci-lint\n- Go 1.22, go-redis 9.6.1, alpine 3.20\n\n## 1.9.0\n\n- Faktory now refuses further connections on :7419 if the connection count is larger than\n  allowed, 2000 in Faktory or your licensed amount in Faktory Enterprise. [#476]\n- The `INFO` response has changed slightly, all elements now have well-defined types [#474]\n  Deprecate `client.Info` Go API, add new `client.CurrentState` Go API which\n  is almost identical to `client.Info` but has a strongly-typed response.\n- Implement native TLS support [#469]\n  Put `public.cert.pem` and `private.key.pem` in your config directory\n  and Faktory will automatically enable TLS on port 7419 and 7420.\n- Unwrap and display ActiveJob class names [#460, ibrahima]\n- Add Go client API so batches can push jobs in bulk [#437, tylerian]\n- Go 1.22, go-redis 9.5.1, alpine 3.18\n\n## 1.8.0\n\n- Upgrade to Go 1.21 and go-redis 9.2.0.\n- Don't double encode HTML entities for display in Web UI [#440]\n- Validate and limit `days` parameter for Dashboard [#431] CVE-2023-37279\n- Validate and limit `timeInterval` refresh parameter for Dashboard\n\n## 1.7.0\n\n- Upgrade all internal APIs to propogate Context\n- Upgrade `redis/go-redis` to the new v9 driver, requires Redis v6.0+ and RESP3\n- Upgrade `datadog-go` to the new v5 driver\n- Upgrade to Go 1.20 and Alpine 3.17\n\n## 1.6.2\n\n- Add `client.RemoveQueues(...)` to delete existing queues via API\n- Add IO deadlines to client I/O [#373]\n- Upgrade to Go 1.19\n\n## 1.6.1\n\n- Add per-worker connection count on Busy page\n- Add `QUEUE REMOVE [queue_names...]` subcommand to remove one or more queues [#399]\n- Fixes for linting warnings from gocritic and golangci-lint\n- Upgrade to Go 1.18.\n\n## 1.6.0\n\n- The core Job struct in Go was modified slightly so the Retry element\n  is now a `int*` rather than `int`. This was necessary so code could\n  distinguish between the default value \"0\" and disabling retries \"0\";\n  the default value is now \"nil\" and will result in the default retry\n  policy of \"25\". [#385]\n- Add `remaining` to the Job Failures struct to track retries remaining [#374]\n- Add new `PUSHB` PUSH Bulk jobs command. You send an Array of Jobs\n  rather than a single Job with `PUSH`. There is no limit to the Array\n  size but we recommend 1000 at a time as a best practice. Returns a Map\n  of JID to ErrorMsg for jobs which failed to push. [#386]\n```\nPUSHB [{job},{job},...] => Map<JID, ErrorMsg>\n```\n\n## 1.5.5\n\n- Fix worker heartbeat monitoring which led to premature worker disassociation\n\n## 1.5.4\n\n- Remove invalid client-side deadline which lead to lots of I/O errors [#375]\n- Upgrade to Go 1.17.\n\n## 1.5.3\n\n- Remove trailing \"-1\" on Faktory versions and tags. Future versions\n  will use the standard form of \"vX.Y.Z\" except for Linux DEB/RPM packages.\n- Implement client-side I/O deadlines, which will look like this if the\n  network is slow or misconfigured:\n  `read tcp 127.0.0.1:63027->127.0.0.1:7419: i/o timeout`\n- Build fixes for ARM support [#370]\n\n## 1.5.2\n\n- Extend Faktory's Redis load timeout to allow for huge datasets [#225]\n- Upgrade Bootstrap from v3.3.7 to v5.0.1 [#360, saurori]\n- Support username in FAKTORY_URL, useful for connection routing proxies.\n- Publish arm64 Docker images [#366]\n\n## 1.5.1\n\n- **Change license from GPLv3 to AGPLv3.** This is intended to ensure Faktory\n  remains open source, even if someone forks Faktory and provides it as a\n  service. **No worker or application code is covered by this license.**\n- Add support for native arm64 builds. Docker images still in progress.\n- Fixed Windows build.\n\n## 1.5.0\n\n- Add `QUEUE PAUSE` and `QUEUE RESUME` commands, add buttons to the /queues page [#336]\n- The Busy page can now display current RSS for Worker processes [#339]\n- The /debug page now displays Redis latency [#337]\n- Add `Dialer` support for custom `faktory.Client` connections [#330]\n- Upgrade to Go 1.16 and alpine 3.13; remove go-bindata dependency [#338]\n\n## 1.4.2\n\n- Allow FAKTORY_ENV to switch environment without flags [#325]\n- Fix jobs with Retry:0 not running FAIL middleware [#317]\n- Fix frequent \"Bad connection EOF\" log messages due to k8s probes\n- Upgrade to Go 1.15 and alpine 3.12.\n\n## 1.4.1\n\n- Fix crash with invalid mutate API usage [#313]\n- Fix form handler on Scheduled Job and Retry Job UI pages [#236]\n- Refactor scheduled job processing to handle large job counts [#309]\n\n## 1.4.0\n\n- Faktory Enterprise now supports **[Job Tracking](https://github.com/contribsys/faktory/wiki/Ent-Tracking)**.\n- Integrate golangci-lint and numerous minor changes for issues it raised\n- Support staging environment `-e staging`\n\n## 1.3.0\n\n- Allow workers to send their current process state as part of BEAT [#266]\n- Faktory will now dump all thread stacktraces when sent the TTIN signal\n- Remove apex/log dependency [#289]\n- Upgrade to Go 1.14\n- Enable SLOWLOG in Faktory's Redis instance\n\n## 1.2.0\n\n- **Faktory Enterprise** is now available with [Batches and Queue Throttling](https://github.com/contribsys/faktory/wiki#faktory-enterprise).\n- Upgrade Docker image to Alpine 3.10\n- Add connection pool support for `client` Go package.\n- Refactor manager package for Pro/Ent integration.\n- Scheduled jobs now go through `push` middleware when pushed [#260]\n\n## 1.1.0\n\n- Upgrade Go runtime from 1.10 to 1.13.\n- Faktory, Faktory Pro and faktory\\_worker\\_go are now using Go modules [#216, ClaytonNorthey92]\n- Fix \"Add to Queue\" button on the Scheduled page [#236]\n- Rework fetching jobs from queues to be more efficient. [#235]\n- Add several helper APIs to configure Faktory Pro features. [#251, tylerb]\n- You can now put nginx in front of Faktory's Web UI using `proxy_pass`:\n```nginx\nlocation /faktory {\n   proxy_set_header X-Script-Name /faktory;\n\n   proxy_pass   http://127.0.0.1:7420;\n   proxy_set_header Host $host;\n   proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n   proxy_set_header X-Scheme $scheme;\n   proxy_set_header X-Real-IP $remote_addr;\n}\n```\n\n## 1.0.1\n\n- Pause Faktory boot and wait upon any `LOADING` errors from Redis\n\n## 1.0.0\n\n- Support known, specific errors to be returned to clients [#208]\n- All jobs now default to `\"retry\":25` if not specified when pushed [#211]\n- Update job arguments within Web UI to show as JSON, not native Go [#210]\n\n## 0.9.7\n\n- Add new MUTATE command which allows bulk manipulation of Faktory's\n  persistent sets (i.e. scheduled, retries, dead) [#205]\n  See https://github.com/contribsys/faktory/wiki/Mutate-API\n\n## 0.9.6\n\n- Remove legacy job priority from APIs and Job struct\n- Improve display of job arguments and custom elements in Web UI [#199]\n\n## 0.9.5\n\n- Add queue sizes to the INFO stats [#197, thapakazi]\n- Fix infinite loop with sorted set iteration [#196, antoinefinkelstein]\n\n## 0.9.4\n\n- More aggressive Redis persistence [#195]\n- Fix possible race condition panic on new connection\n\n## 0.9.3\n\n- Increase maximum client count to 1000.\n\n## 0.9.2\n\n- Fix crash under load [#187]\n- First [Faktory Pro](https://contribsys.com/faktory) release\n\n## 0.9.1\n\n- Fix crash on startup in Linux in development mode\n- Close all associated connections when a worker process expires [#182]\n- Shutdown Redis cleanly if Faktory panics (Linux only)\n\n## 0.9.0\n\n- Switch Faktory from RocksDB to Redis for storage. [#160]\n- Implement Faktory-internal middleware hooks [#168]\n- Integrate TOML config system [#169]\n\n## 0.8.0\n\n- Workaround for negative busy/retry/scheduled/dead counts [#148]\n- Fix slow index page rendering under heavy load [#156]\n- Upgrade to Go 1.10.3\n- Upgrade to RocksDB 5.14.2\n\n## 0.7.0\n\n- Upgrade RocksDB from 5.7.3 to 5.9.2\n- Add CSRF protection to Web UI [#92, vosmith]\n- Faktory in production mode now requires a password by default [#113]\n- Orphaned jobs now use the retry process so they don't re-enqueue forever [#99]\n- Implement automated backups, default once per hour and keeping 24. [#106]\n- Implement `purge` command for faktory-cli, to remove old backups.\n\n## 0.6.1\n\n- Fix job reservation [#94, jweslley]\n- Send exhausted jobs to the morgue [#86, jweslley]\n\n## 0.6.0\n\n- Add support for job priorities [#68, andrewstucki]\n  Jobs may now include \"priority\" with values 1-9, 9 being\n  highest priority.  Push a job with `\"priority\":9` and it will\n  effectively go to the front of the queue.  The default priority is 5.\n```\n{\"jid\":\"12o31i2u3o1\",\"jobtype\":\"FooJob\",\"args\":[1,2,3],\"priority\":8}\n```\n- Various protocol changes [#72]\n- Remove TLS support in server [#76]\n- Fix heartbeat pruning so old workers disappear from Busy page [#37]\n- Add Docker image [#13]\n- Add Homebrew install [#10]\n- Lots of polish and code cleanup from cdrx, agnivade, adomokos,\n  ustrajunior, jwsslley and others.  Thank you!\n\n## 0.5.0\n\n- Initial release\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.2861328125,
          "content": "FROM alpine:3.20\nARG TARGETPLATFORM\nRUN apk add --no-cache redis ca-certificates socat\nCOPY ./tmp/$TARGETPLATFORM /faktory\n\nRUN mkdir -p /root/.faktory/db\nRUN mkdir -p /var/lib/faktory/db\nRUN mkdir -p /etc/faktory\n\nEXPOSE 7419 7420\nCMD [\"/faktory\", \"-w\", \"0.0.0.0:7420\", \"-b\", \"0.0.0.0:7419\"]\n"
        },
        {
          "name": "Ent-Changes.md",
          "type": "blob",
          "size": 2.7197265625,
          "content": "# Faktory Enterprise Changelog\n\nChangelog: [Faktory](https://github.com/contribsys/faktory/blob/master/Changes.md) || Faktory Enterprise\n\nA trial version of Faktory Enterprise for macOS is available with each [release](/contribsys/faktory/releases/).\nClick to purchase [Faktory Enterprise](https://billing.contribsys.com/fent/).\n\n## 1.9.1\n\n- Fix \"concurrent write\" crash with heavily contended per-worker throttles [#483]\n- Add support for `DD_DOGSTATSD_URL`, you do not need statsd.toml at all anymore [#479]\n  `DD_DOGSTATSD_URL=udp://localhost:8125 faktory ...`\n- Upgrade datadog client to v5.5.0 [#479]\n- Print error if Faktory fails to start [#479]\n\n## 1.9.0\n\n- Add Redis round trip time (in µs) to Statsd, \"ops.redis.rtt_us\" [#475]\n\n## 1.8.0\n\n- Migrate usage of SHA1 to SHA256 to appease linters\n- Fix broken default Statsd namespacing [#433]\n\n## 1.7.0\n\n- Upgrade Redis driver to v9\n- Upgrade Datadog driver to v5\n\n## 1.6.2\n\n- Fix crash when batch callback jobs retry [#408]\n\n## 1.6.1\n\n- Support `reserve_for` in cron jobs [#381]\n\n## 1.6.0\n\n- Add support for unlimited license without external network access for\n  high security environments. See the Licensing wiki page for details.\n\n## 1.5.5\n\n- Cron jobs now support empty arguments and can configure expiry via `expires_in` [#384]\n```toml\n[[cron]]\n  schedule = \"*/5 * * * *\"\n  [cron.job]\n    type = \"FiveJob\"\n    args = []\n    [cron.job.custom]\n      expires_in = 60\n```\n\n## 1.5.4\n\n- Upgrade to Go 1.17\n\n## 1.5.1\n\n- License check now supports HTTP(S)_PROXY env variables.\n- Fix crash upon license check if license server is down.\n- Releases now provide macOS trial binaries for Apple Silicon.\n\n## 1.5.0\n\n- Implement BYOR - **Bring Your Own Redis**. If Faktory Enterprise sees a\n  `REDIS_URL` or `REDIS_PROVIDER` variable, it will use that to connect\n  to Redis rather than starting its own Redis instance. This allows\n  Faktory Enterprise to be used directly with AWS Elasticache, Heroku\n  Redis and other SaaS providers. The Web UI /debug page will show you\n  the current latency to Redis and warn if the latency is above 1ms.\n\n## 1.4.2\n\n- *No significant changes*\n\n## 1.4.1\n\n- Fix for `redis: transaction failed` error during batch processing under heavy load [#305]\n\n## 1.4.0\n\n- Major new feature: **[Job Tracking](https://github.com/contribsys/faktory/wiki/Ent-Tracking)** [#278]\n- `-e staging` environment support, limited to 100 connections\n\n## 1.3.0\n\n- Allow custom WebUI tweaks for OEM whitelabeling by customers looking\n  to integrate Faktory into their own product. [#270]\n- Fix crash when pushing batch jobs [#274]\n\n## 1.2.0\n\n- Major features are [Batches](https://github.com/contribsys/faktory/wiki/Ent-Batches) and [Queue Throttling](https://github.com/contribsys/faktory/wiki/Ent-Throttling).\n- Initial release.\n"
        },
        {
          "name": "Gopkg.lock",
          "type": "blob",
          "size": 2.4443359375,
          "content": "# This file is autogenerated, do not edit; changes may be undone by the next 'dep ensure'.\n\n\n[[projects]]\n  digest = \"1:e4b30804a381d7603b8a344009987c1ba351c26043501b23b8c7ce21f0b67474\"\n  name = \"github.com/BurntSushi/toml\"\n  packages = [\".\"]\n  pruneopts = \"\"\n  revision = \"3012a1dbe2e4bd1391d42b32f0577cb7bbc7f005\"\n  version = \"v0.3.1\"\n\n[[projects]]\n  branch = \"master\"\n  digest = \"1:d743f5ff04492330917b701b421bb60c8a865362ad51b1af867787b9afda5d26\"\n  name = \"github.com/apex/log\"\n  packages = [\".\"]\n  pruneopts = \"\"\n  revision = \"d6c5facec1f2ae23a97782ab0ee18af58734346f\"\n\n[[projects]]\n  digest = \"1:0deddd908b6b4b768cfc272c16ee61e7088a60f7fe2f06c547bd3d8e1f8b8e77\"\n  name = \"github.com/davecgh/go-spew\"\n  packages = [\"spew\"]\n  pruneopts = \"\"\n  revision = \"8991bc29aa16c548c550c7ff78260e27b9ab7c73\"\n  version = \"v1.1.1\"\n\n[[projects]]\n  digest = \"1:c2db84082861ca42d0b00580d28f4b31aceec477a00a38e1a057fb3da75c8adc\"\n  name = \"github.com/go-redis/redis\"\n  packages = [\n    \".\",\n    \"internal\",\n    \"internal/consistenthash\",\n    \"internal/hashtag\",\n    \"internal/pool\",\n    \"internal/proto\",\n    \"internal/util\",\n  ]\n  pruneopts = \"\"\n  revision = \"75795aa4236dc7341eefac3bbe945e68c99ef9df\"\n  version = \"v6.15.3\"\n\n[[projects]]\n  branch = \"master\"\n  digest = \"1:b3328b1cb82bf4fc91abdfe1c1c5976e8412ddbd074fc2b81b167b1c12fd2cf3\"\n  name = \"github.com/justinas/nosurf\"\n  packages = [\".\"]\n  pruneopts = \"\"\n  revision = \"05988550ea1890c49b702363e53b3afa7aad2b4b\"\n\n[[projects]]\n  digest = \"1:1d7e1867c49a6dd9856598ef7c3123604ea3daabf5b83f303ff457bcbc410b1d\"\n  name = \"github.com/pkg/errors\"\n  packages = [\".\"]\n  pruneopts = \"\"\n  revision = \"ba968bfe8b2f7e042a574c888954fccecfa385b4\"\n  version = \"v0.8.1\"\n\n[[projects]]\n  digest = \"1:256484dbbcd271f9ecebc6795b2df8cad4c458dd0f5fd82a8c2fa0c29f233411\"\n  name = \"github.com/pmezard/go-difflib\"\n  packages = [\"difflib\"]\n  pruneopts = \"\"\n  revision = \"792786c7400a136282c1664665ae0a8db921c6c2\"\n  version = \"v1.0.0\"\n\n[[projects]]\n  digest = \"1:381bcbeb112a51493d9d998bbba207a529c73dbb49b3fd789e48c63fac1f192c\"\n  name = \"github.com/stretchr/testify\"\n  packages = [\"assert\"]\n  pruneopts = \"\"\n  revision = \"ffdc059bfe9ce6a4e144ba849dbedead332c6053\"\n  version = \"v1.3.0\"\n\n[solve-meta]\n  analyzer-name = \"dep\"\n  analyzer-version = 1\n  input-imports = [\n    \"github.com/BurntSushi/toml\",\n    \"github.com/apex/log\",\n    \"github.com/go-redis/redis\",\n    \"github.com/justinas/nosurf\",\n    \"github.com/stretchr/testify/assert\",\n  ]\n  solver-name = \"gps-cdcl\"\n  solver-version = 1\n"
        },
        {
          "name": "Gopkg.toml",
          "type": "blob",
          "size": 0.806640625,
          "content": "\n# Gopkg.toml example\n#\n# Refer to https://github.com/golang/dep/blob/master/docs/Gopkg.toml.md\n# for detailed Gopkg.toml documentation.\n#\n# required = [\"github.com/user/thing/cmd/thing\"]\n# ignored = [\"github.com/user/project/pkgX\", \"bitbucket.org/user/project/pkgA/pkgY\"]\n#\n# [[constraint]]\n#   name = \"github.com/user/project\"\n#   version = \"1.0.0\"\n#\n# [[constraint]]\n#   name = \"github.com/user/project2\"\n#   branch = \"dev\"\n#   source = \"github.com/myfork/project2\"\n#\n# [[override]]\n#  name = \"github.com/x/y\"\n#  version = \"2.4.0\"\n\n[[constraint]]\n  name = \"github.com/BurntSushi/toml\"\n  version = \"v0.3.1\"\n\n[[constraint]]\n  name = \"github.com/go-redis/redis\"\n  version = \"v6.15.3\"\n\n[[constraint]]\n  name = \"github.com/apex/log\"\n  branch = \"master\"\n\n[[constraint]]\n  name = \"github.com/stretchr/testify\"\n  version = \"1.3.0\"\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 34.2021484375,
          "content": "Faktory is AGPL licensed. What does this mean? In short:\n\nIf you fork Faktory, make changes and allow others to access your modified Faktory,\nthe source code for those changes must be made available to those users.\n\nNote the Faktory client and worker libraries are NOT covered by this license, only the server is AGPL licensed.\nYou do NOT need to open source any business logic or code for your background jobs.\nPlease email mike@contribsys.com if you have further licensing questions.\n\n\n---------\n\n\n                    GNU AFFERO GENERAL PUBLIC LICENSE\n                       Version 3, 19 November 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<https://www.gnu.org/licenses/>.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 8.49609375,
          "content": "NAME=faktory\nVERSION=1.9.1\n\n# when fixing packaging bugs but not changing the binary, we increment ITERATION\nITERATION=1\nBASENAME=$(NAME)_$(VERSION)-$(ITERATION)\n\nTEST_FLAGS=-parallel 4\nifdef DETECT_RACES\n\tTEST_FLAGS += -race\nendif\n\n# TODO I'd love some help making this a proper Makefile\n# with real file dependencies.\n\n.DEFAULT_GOAL := help\n\nall: test\n\n# need to login with `mperham` and the personal token at github.com/settings/tokens\nrelease:\n\tcp /tmp/faktory-ent_$(VERSION).macos.* packaging/output/systemd\n\t@echo Generating release notes\n\truby .github/notes.rb $(VERSION)\n\t@echo Releasing $(NAME) $(VERSION)\n\thub release create v$(VERSION) \\\n\t\t-a packaging/output/systemd/faktory_$(VERSION)-$(ITERATION)_amd64.deb \\\n\t\t-a packaging/output/systemd/faktory_$(VERSION)-$(ITERATION)_arm64.deb \\\n\t\t-a packaging/output/systemd/faktory-$(VERSION)-$(ITERATION).x86_64.rpm \\\n\t\t-a packaging/output/systemd/faktory-$(VERSION)-$(ITERATION).aarch64.rpm \\\n\t\t-a packaging/output/systemd/faktory-ent_$(VERSION).macos.arm64.tbz \\\n\t\t-a packaging/output/systemd/faktory-ent_$(VERSION).macos.amd64.tbz \\\n\t\t-F /tmp/release-notes.md -e -o || :\n\nprepare: ## install build prereqs\n\tgo install github.com/benbjohnson/ego/...@v0.4.3\n\t@echo Now you should be ready to run \"make\"\n\ntags: clean ## Create tags file for vim, etc\n\tfind . -name \"*.go\" | grep -v \"./vendor\" | gotags -L - > tags\n\ntest: clean generate ## Execute test suite\n\tgo test $(TEST_FLAGS) \\\n\t\tgithub.com/contribsys/faktory/client \\\n\t\tgithub.com/contribsys/faktory/cli \\\n\t\tgithub.com/contribsys/faktory/manager \\\n\t\tgithub.com/contribsys/faktory/server \\\n\t\tgithub.com/contribsys/faktory/storage \\\n\t\tgithub.com/contribsys/faktory/test \\\n\t\tgithub.com/contribsys/faktory/util \\\n\t\tgithub.com/contribsys/faktory/webui\n\nkill:\n\t@killall -m -9 -e redis || :\n\n# docker buildx create --name cross\n# docker buildx use cross\ndimg: clean generate ## Make cross-platform Docker images for the current version\n\tGOOS=linux GOARCH=amd64 go build -o tmp/linux/amd64 cmd/faktory/daemon.go\n\tGOOS=linux GOARCH=arm64 go build -o tmp/linux/arm64 cmd/faktory/daemon.go\n\tupx -qq ./tmp/linux/amd64\n\tupx -qq ./tmp/linux/arm64\n\tdocker buildx build --tag contribsys/faktory:$(VERSION) --tag contribsys/faktory:latest --load .\n\ndpush: clean generate\n\tGOOS=linux GOARCH=amd64 go build -o tmp/linux/amd64 cmd/faktory/daemon.go\n\tGOOS=linux GOARCH=arm64 go build -o tmp/linux/arm64 cmd/faktory/daemon.go\n\tupx -qq ./tmp/linux/amd64\n\tupx -qq ./tmp/linux/arm64\n\tdocker buildx build --platform \"linux/arm64,linux/amd64\" --tag contribsys/faktory:$(VERSION) --tag contribsys/faktory:latest --push .\n\ndrun: ## Run Faktory in a local Docker image, see also \"make dimg\"\n\tdocker run --rm -it -e \"FAKTORY_SKIP_PASSWORD=true\" \\\n\t\t-v faktory-data:/var/lib/faktory \\\n\t\t-p 127.0.0.1:7419:7419 \\\n\t\t-p 127.0.0.1:7420:7420 \\\n\t\tcontribsys/faktory:latest /faktory -e production\n\ndmon: ## Monitor Redis within the running Docker image\n\tdocker run --rm -it -t -i \\\n\t\t-v faktory-data:/var/lib/faktory \\\n\t\tcontribsys/faktory:latest /usr/bin/redis-cli -s /var/lib/faktory/db/redis.sock monitor\n\n#dinsp:\n\t#docker run --rm -it -e \"FAKTORY_PASSWORD=${PASSWORD}\" \\\n\t\t#-p 127.0.0.1:7419:7419 \\\n\t\t#-p 127.0.0.1:7420:7420 \\\n\t\t#-v faktory-data:/var/lib/faktory \\\n\t\t#contribsys/faktory:$(VERSION) /bin/bash\n\ngenerate:\n\tgo generate github.com/contribsys/faktory/webui\n\ncover:\n\tgo test -coverprofile cover.out \\\n\t\tgithub.com/contribsys/faktory/cli \\\n\t\tgithub.com/contribsys/faktory/client \\\n\t\tgithub.com/contribsys/faktory/manager \\\n\t\tgithub.com/contribsys/faktory/server \\\n\t\tgithub.com/contribsys/faktory/storage \\\n\t\tgithub.com/contribsys/faktory/util \\\n\t\tgithub.com/contribsys/faktory/webui\n\tgo tool cover -html=cover.out -o coverage.html\n\topen coverage.html\n\nxbuild: clean generate\n\t@CGO_ENABLED=0 GOOS=linux GOARCH=amd64 go build -o $(NAME)_amd64 cmd/faktory/daemon.go\n\t# brew install upx\n\tupx -qq ./$(NAME)_amd64\n\t@CGO_ENABLED=0 GOOS=linux GOARCH=arm64 go build -o $(NAME)_arm64 cmd/faktory/daemon.go\n\t# brew install upx\n\tupx -qq ./$(NAME)_arm64\n\nbuild: clean generate\n\tgo build -o $(NAME) cmd/faktory/daemon.go\n\nmon:\n\tredis-cli -s ~/.faktory/db/redis.sock\n\n# this is a separate target because loadtest doesn't need redis or webui\nbuild_load:\n\tgo build -o loadtest test/load/main.go\n\nload: # not war\n\tgo run test/load/main.go 30000 10\n\nmegacheck:\n\t@megacheck $(shell go list -f '{{ .ImportPath }}'  ./... | grep -ve vendor | paste -sd \" \" -) || true\n\n# TODO integrate a few useful Golang linters.\nlint:\n\t# brew install golangci/tap/golangci-lint\n\tgolangci-lint run\n\nfmt: ## Format the code\n\tgo fmt ./...\n\nwork: ## Run a simple Ruby worker, see also \"make run\"\n\tcd test/ruby && bundle exec faktory-worker -v -r ./app.rb -q critical -q default -q bulk\n\nclean: ## Clean the project, set it up for a new build\n\t@rm -rf tmp\n\t@rm -f main $(NAME) $(NAME)_amd64 $(NAME)_arm64 templates.go\t\n\t@mkdir -p tmp/linux\n\t@go clean -testcache\n\t@rm -rf packaging/output\n\t@mkdir -p packaging/output/upstart\n\t@mkdir -p packaging/output/systemd\n\nrun: clean generate ## Run Faktory daemon locally\n\tFAKTORY_PASSWORD=${PASSWORD} go run cmd/faktory/daemon.go -l debug -e development\n\ncssh:\n\tpushd build/centos && vagrant up && vagrant ssh\n\nussh:\n\tpushd build/ubuntu && vagrant up && vagrant ssh\n\n# gem install fpm\n# Packaging uses Go's cross compile + fpm so we can build Linux packages on macOS.\n\npackage: clean deb rpm\n\npackage_base_name: \n\t@echo $(BASENAME)\n\nversion_check:\n\t@grep -q $(VERSION) client/faktory.go || (echo VERSIONS OUT OF SYNC && false)\n\n# these two reload targets are meant to be run within the Vagrant boxes\nreload_rpm:\n\tsudo rpm -e $(NAME)\n\tsudo yum install -y packaging/output/systemd/$(NAME)-$(VERSION)-$(ITERATION).x86_64.rpm\n\nreload_deb:\n\tsudo apt-get purge -y $(NAME)\n\tsudo dpkg -i packaging/output/systemd/$(NAME)_$(VERSION)-$(ITERATION)_amd64.deb\n\nrpm: xbuild\n\t@cp $(NAME)_arm64 $(NAME)\n\tfpm -s dir -t rpm -n $(NAME) -v $(VERSION) -p packaging/output/systemd \\\n\t\t--depends redis \\\n\t\t--rpm-compression bzip2 \\\n\t \t--rpm-os linux \\\n\t \t--after-install packaging/scripts/postinst.rpm.systemd \\\n\t \t--before-remove packaging/scripts/prerm.rpm.systemd \\\n\t\t--after-remove packaging/scripts/postrm.rpm.systemd \\\n\t\t--url https://contribsys.com/faktory \\\n\t\t--description \"Background job server\" \\\n\t\t-m \"Contributed Systems LLC <info@contribsys.com>\" \\\n\t\t--iteration $(ITERATION) --license \"GPL 3.0\" \\\n\t\t--vendor \"Contributed Systems\" -a arm64 \\\n\t\tfaktory=/usr/bin/faktory \\\n\t\tpackaging/root/=/\n\t@cp -f $(NAME)_amd64 $(NAME)\n\tfpm -s dir -t rpm -n $(NAME) -v $(VERSION) -p packaging/output/systemd \\\n\t\t--depends redis \\\n\t\t--rpm-compression bzip2 \\\n\t \t--rpm-os linux \\\n\t \t--after-install packaging/scripts/postinst.rpm.systemd \\\n\t \t--before-remove packaging/scripts/prerm.rpm.systemd \\\n\t\t--after-remove packaging/scripts/postrm.rpm.systemd \\\n\t\t--url https://contribsys.com/faktory \\\n\t\t--description \"Background job server\" \\\n\t\t-m \"Contributed Systems LLC <info@contribsys.com>\" \\\n\t\t--iteration $(ITERATION) --license \"GPL 3.0\" \\\n\t\t--vendor \"Contributed Systems\" -a amd64 \\\n\t\tfaktory=/usr/bin/faktory \\\n\t\tpackaging/root/=/\n#\t@rm $(NAME)\n\ndeb: xbuild\n\t@cp $(NAME)_arm64 $(NAME)\n\tfpm -s dir -t deb -n $(NAME) -v $(VERSION) -p packaging/output/systemd \\\n\t\t--depends redis-server \\\n\t\t--deb-priority optional --category admin \\\n\t\t--no-deb-no-default-config-files \\\n\t \t--after-install packaging/scripts/postinst.deb.systemd \\\n\t \t--before-remove packaging/scripts/prerm.deb.systemd \\\n\t\t--after-remove packaging/scripts/postrm.deb.systemd \\\n\t\t--url https://contribsys.com/faktory \\\n\t\t--description \"Background job server\" \\\n\t\t-m \"Contributed Systems LLC <info@contribsys.com>\" \\\n\t\t--iteration $(ITERATION) --license \"GPL 3.0\" \\\n\t\t--vendor \"Contributed Systems\" -a arm64 \\\n\t\tfaktory=/usr/bin/faktory \\\n\t\tpackaging/root/=/\n\t@cp -f $(NAME)_amd64 $(NAME)\n\tfpm -s dir -t deb -n $(NAME) -v $(VERSION) -p packaging/output/systemd \\\n\t\t--depends redis-server \\\n\t\t--deb-priority optional --category admin \\\n\t\t--no-deb-no-default-config-files \\\n\t \t--after-install packaging/scripts/postinst.deb.systemd \\\n\t \t--before-remove packaging/scripts/prerm.deb.systemd \\\n\t\t--after-remove packaging/scripts/postrm.deb.systemd \\\n\t\t--url https://contribsys.com/faktory \\\n\t\t--description \"Background job server\" \\\n\t\t-m \"Contributed Systems LLC <info@contribsys.com>\" \\\n\t\t--iteration $(ITERATION) --license \"GPL 3.0\" \\\n\t\t--vendor \"Contributed Systems\" -a amd64 \\\n\t\tfaktory=/usr/bin/faktory \\\n\t\tpackaging/root/=/\n#\t@rm $(NAME)\n\ntag:\n\tgit tag v$(VERSION) && git push --tags || :\n\n.PHONY: help all clean test build package\n\n\nhelp:\n\t\t@grep -E '^[a-zA-Z_-]+:.*?## .*$$' $(MAKEFILE_LIST) | sort | awk 'BEGIN {FS = \":.*?## \"}; {printf \"\\033[36m%-20s\\033[0m %s\\n\", $$1, $$2}'\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.6318359375,
          "content": "# Faktory [![CI](https://github.com/contribsys/faktory/actions/workflows/ci.yml/badge.svg)](https://github.com/contribsys/faktory/actions/workflows/ci.yml) [![Go Report Card](https://goreportcard.com/badge/github.com/contribsys/faktory)](https://goreportcard.com/report/github.com/contribsys/faktory)\n\nAt a high level, Faktory is a work server.  It is the repository for\nbackground jobs within your application. Jobs have a type and a set of\narguments and are placed into queues for workers to fetch and execute.\n\nYou can use this server to distribute jobs to one or hundreds of\nmachines. Jobs can be executed with any language by clients using\nthe Faktory API to fetch a job from a queue.\n\n![webui](https://raw.githubusercontent.com/contribsys/faktory/master/docs/webui.png)\n\n## Basic Features\n\n- Jobs are represented as JSON hashes.\n- Jobs are pushed to and fetched from queues.\n- Jobs are reserved with a timeout, 30 min by default.\n- Jobs `FAIL`'d or not `ACK`'d within the reservation timeout are requeued.\n- FAIL'd jobs trigger a retry workflow with exponential backoff.\n- Contains a comprehensive Web UI for management and monitoring.\n\n## Installation\n\nSee the [Installation wiki page](https://github.com/contribsys/faktory/wiki/Installation) for current installation methods.\nHere's more info on installation with [Docker](https://github.com/contribsys/faktory/wiki/Docker) and [AWS ECS](https://github.com/contribsys/faktory/wiki/AWS-ECS).\n\n## Documentation\n\nPlease [see the Faktory wiki](https://github.com/contribsys/faktory/wiki) for full documentation.\n\n## Support\n\nOpen up a Discussion or Issue.\n\n## Author\n\nMike Perham, @getajobmike, mike @ contribsys.com\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.0986328125,
          "content": "# Security Policy\n\n## Reporting a Vulnerability\n\nPlease contact support@contribsys.com with details.\n"
        },
        {
          "name": "cli",
          "type": "tree",
          "content": null
        },
        {
          "name": "client",
          "type": "tree",
          "content": null
        },
        {
          "name": "cmd",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "example",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.mod",
          "type": "blob",
          "size": 0.53515625,
          "content": "module github.com/contribsys/faktory\n\ngo 1.22\n\nrequire (\n\tgithub.com/BurntSushi/toml v0.4.1\n\tgithub.com/justinas/nosurf v1.1.1\n\tgithub.com/stretchr/testify v1.9.0\n)\n\nrequire github.com/redis/go-redis/v9 v9.6.1\n\nrequire (\n\tgithub.com/cespare/xxhash/v2 v2.3.0 // indirect\n\tgithub.com/dgryski/go-rendezvous v0.0.0-20200823014737-9f7001d12a5f // indirect\n\tgopkg.in/yaml.v3 v3.0.1 // indirect\n)\n\nrequire (\n\tgithub.com/contribsys/faktory_worker_go v1.6.0\n\tgithub.com/davecgh/go-spew v1.1.1 // indirect\n\tgithub.com/pmezard/go-difflib v1.0.0 // indirect\n)\n"
        },
        {
          "name": "go.sum",
          "type": "blob",
          "size": 2.2880859375,
          "content": "github.com/BurntSushi/toml v0.4.1 h1:GaI7EiDXDRfa8VshkTj7Fym7ha+y8/XxIgD2okUIjLw=\ngithub.com/BurntSushi/toml v0.4.1/go.mod h1:CxXYINrC8qIiEnFrOxCa7Jy5BFHlXnUU2pbicEuybxQ=\ngithub.com/bsm/ginkgo/v2 v2.12.0 h1:Ny8MWAHyOepLGlLKYmXG4IEkioBysk6GpaRTLC8zwWs=\ngithub.com/bsm/ginkgo/v2 v2.12.0/go.mod h1:SwYbGRRDovPVboqFv0tPTcG1sN61LM1Z4ARdbAV9g4c=\ngithub.com/bsm/gomega v1.27.10 h1:yeMWxP2pV2fG3FgAODIY8EiRE3dy0aeFYt4l7wh6yKA=\ngithub.com/bsm/gomega v1.27.10/go.mod h1:JyEr/xRbxbtgWNi8tIEVPUYZ5Dzef52k01W3YH0H+O0=\ngithub.com/cespare/xxhash/v2 v2.3.0 h1:UL815xU9SqsFlibzuggzjXhog7bL6oX9BbNZnL2UFvs=\ngithub.com/cespare/xxhash/v2 v2.3.0/go.mod h1:VGX0DQ3Q6kWi7AoAeZDth3/j3BFtOZR5XLFGgcrjCOs=\ngithub.com/contribsys/faktory_worker_go v1.6.0 h1:ov69BLHL62i/wRLJwvuj5UphwgjMOINRCGW3KzrKOjk=\ngithub.com/contribsys/faktory_worker_go v1.6.0/go.mod h1:XMNGn3sBJdqFGfTH4SkmYkMovhdkq5cDJj36wowfbNY=\ngithub.com/davecgh/go-spew v1.1.1 h1:vj9j/u1bqnvCEfJOwUhtlOARqs3+rkHYY13jYWTU97c=\ngithub.com/davecgh/go-spew v1.1.1/go.mod h1:J7Y8YcW2NihsgmVo/mv3lAwl/skON4iLHjSsI+c5H38=\ngithub.com/dgryski/go-rendezvous v0.0.0-20200823014737-9f7001d12a5f h1:lO4WD4F/rVNCu3HqELle0jiPLLBs70cWOduZpkS1E78=\ngithub.com/dgryski/go-rendezvous v0.0.0-20200823014737-9f7001d12a5f/go.mod h1:cuUVRXasLTGF7a8hSLbxyZXjz+1KgoB3wDUb6vlszIc=\ngithub.com/justinas/nosurf v1.1.1 h1:92Aw44hjSK4MxJeMSyDa7jwuI9GR2J/JCQiaKvXXSlk=\ngithub.com/justinas/nosurf v1.1.1/go.mod h1:ALpWdSbuNGy2lZWtyXdjkYv4edL23oSEgfBT1gPJ5BQ=\ngithub.com/pmezard/go-difflib v1.0.0 h1:4DBwDE0NGyQoBHbLQYPwSUPoCMWR5BEzIk/f1lZbAQM=\ngithub.com/pmezard/go-difflib v1.0.0/go.mod h1:iKH77koFhYxTK1pcRnkKkqfTogsbg7gZNVY4sRDYZ/4=\ngithub.com/redis/go-redis/v9 v9.6.1 h1:HHDteefn6ZkTtY5fGUE8tj8uy85AHk6zP7CpzIAM0y4=\ngithub.com/redis/go-redis/v9 v9.6.1/go.mod h1:0C0c6ycQsdpVNQpxb1njEQIqkx5UcsM8FJCQLgE9+RA=\ngithub.com/stretchr/testify v1.9.0 h1:HtqpIVDClZ4nwg75+f6Lvsy/wHu+3BoSGCbBAcpTsTg=\ngithub.com/stretchr/testify v1.9.0/go.mod h1:r2ic/lqez/lEtzL7wO/rwa5dbSLXVDPFyf8C91i36aY=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405 h1:yhCVgyC4o1eVCa2tZl7eS0r+SDo693bJlVdllGtEeKM=\ngopkg.in/check.v1 v0.0.0-20161208181325-20d25e280405/go.mod h1:Co6ibVJAznAaIkqp8huTwlJQCZ016jof/cbN4VW5Yz0=\ngopkg.in/yaml.v3 v3.0.1 h1:fxVm/GzAzEWqLHuvctI91KS9hhNmmWOoWu0XTYJS7CA=\ngopkg.in/yaml.v3 v3.0.1/go.mod h1:K4uyk7z7BCEPqu6E+C64Yfv1cQ7kz7rIZviUmN+EgEM=\n"
        },
        {
          "name": "internal",
          "type": "tree",
          "content": null
        },
        {
          "name": "manager",
          "type": "tree",
          "content": null
        },
        {
          "name": "packaging",
          "type": "tree",
          "content": null
        },
        {
          "name": "server",
          "type": "tree",
          "content": null
        },
        {
          "name": "storage",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "util",
          "type": "tree",
          "content": null
        },
        {
          "name": "webui",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}