{
  "metadata": {
    "timestamp": 1736567495289,
    "page": 99,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjEwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "m1k1o/neko",
      "stars": 8278,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".docker",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.251953125,
          "content": "* text=auto\n*.css text\n*.js text\n*.ts text\n*.json text\n*.htm text\n*.html text\n*.env text\n*.xml text\n*.svg text\n*.txt text\n*.ini text\n*.sql text\n*.sh text\n*.png binary\n*.jpg binary\n*.jpeg binary\n*.gif binary\n*.ico binary\n*.mov binary\n*.mp4 binary\n*.mp3 binary"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.330078125,
          "content": "# OS files\n.DS_Store\n.DS_Store?\n._*\n.Spotlight-V100\n.Trashes\nehthumbs.db\nThumbs.db\n\n# Log/Temp files\n.tmp/\ntmp/\n*.tmp\n.logs/\nlogs/\n*.log\ncore\n.build\n\n# Runtime data\npids\n*.pid\n*.seed\n*.pid.lock\n\n# TypeScript incremental compilation cache\n*.tsbuildinfo\n\n# Node modules\nnode_modules\ndist\nbin\n\n# Environment files\n*.env\n\n# Code Editors\n.idea"
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.15234375,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright (C) 2020 Nurdism <nurdism.io@gmail.com>\n   Copyright (C) 2020-2023 m1k1o\n   All Rights Reserved.\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.9228515625,
          "content": "<div align=\"center\">\n  <a href=\"https://github.com/m1k1o/neko\" title=\"Neko's Github repository.\">\n    <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/logo.png\" width=\"400\" height=\"auto\"/>\n  </a>\n  <p align=\"center\">\n    <a href=\"https://github.com/m1k1o/neko/releases\">\n      <img src=\"https://img.shields.io/github/v/release/m1k1o/neko\" alt=\"release\">\n    </a>\n    <a href=\"https://github.com/m1k1o/neko/blob/master/LICENSE\">\n      <img src=\"https://img.shields.io/github/license/m1k1o/neko\" alt=\"license\">\n    </a>\n    <a href=\"https://hub.docker.com/u/m1k1o/neko\">\n      <img src=\"https://img.shields.io/docker/pulls/m1k1o/neko\" alt=\"pulls\">\n    </a>\n    <a href=\"https://github.com/m1k1o/neko/issues\">\n      <img src=\"https://img.shields.io/github/issues/m1k1o/neko\" alt=\"issues\">\n    </a>\n    <a href=\"https://github.com/sponsors/m1k1o\">\n      <img src=\"https://img.shields.io/badge/-sponsor-red\" alt=\"issues\">\n    </a>\n    <a href=\"https://discord.gg/3U6hWpC\">\n      <img src=\"https://discordapp.com/api/guilds/665851821906067466/widget.png\" alt=\"Chat on discord\">\n    </a>\n    <a href=\"https://github.com/m1k1o/neko/actions\">\n      <img src=\"https://github.com/m1k1o/neko/actions/workflows/ghcr-amd.yml/badge.svg\" alt=\"build\">\n    </a>\n  </p>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/intro.gif\" width=\"650\" height=\"auto\"/>\n</div>\n\n# n.eko\n\nWelcome to Neko, a self-hosted virtual browser that runs in Docker and uses WebRTC technology. Neko is a powerful tool that allows you to **run a fully-functional browser in a virtual environment**, giving you the ability to **access the internet securely and privately from anywhere**. With Neko, you can browse the web, **run applications**, and perform other tasks just as you would on a regular browser, all within a **secure and isolated environment**. Whether you are a developer looking to test web applications, a **privacy-conscious user seeking a secure browsing experience**, or simply someone who wants to take advantage of the **convenience and flexibility of a virtual browser**, Neko is the perfect solution.\n\nIn addition to its security and privacy features, Neko offers the **ability for multiple users to access it simultaneously**. This makes it an ideal solution for teams or organizations that need to share access to a browser, as well as for individuals who want to use **multiple devices to access the same virtual environment**. With Neko, you can **easily and securely share access to a browser with others**, without having to worry about maintaining separate configurations or settings. Whether you need to **collaborate on a project**, access shared resources, or simply want to **share access to a browser with friends or family**, Neko makes it easy to do so.\n\nNeko is also a great tool for **hosting watch parties** and interactive presentations. With its virtual browser capabilities, Neko allows you to host watch parties and presentations that are **accessible from anywhere**, without the need for in-person gatherings. This makes it easy to **stay connected with friends and colleagues**, even when you are unable to meet in person. With Neko, you can easily host a watch party or give an **interactive presentation**, whether it's for leisure or work. Simply invite your guests to join the virtual environment, and you can share the screen and **interact with them in real-time**.\n\n## About\n\nThis app uses WebRTC to stream a desktop inside of a docker container, original author made this because [rabb.it](https://en.wikipedia.org/wiki/Rabb.it) went under and his internet could not handle streaming and discord kept crashing when his friend attempted to. He just wanted to watch anime with his friends ლ(ಠ益ಠლ) so he started digging throughout the internet and found a few *kinda* clones, but none of them had the virtual browser, then he found [Turtus](https://github.com/Khauri/Turtus) and he was able to figure out the rest.\n\nThen I found [this](https://github.com/nurdism/neko) project and started to dig into it. I really liked the idea of having collaborative browser browsing together with multiple people, so I created a fork. Initially, I wanted to merge my changes to the upstream repository, but the original author did not have time for this project anymore and it got eventually archived.\n\n## Use-cases and comparison\n\nNeko started as a virtual browser that is streamed using WebRTC to multiple users.\n- It is **not only limited to a browser**; it can run anything that runs on linux (e.g. VLC). Browser only happens to be the most popular and widely used use-case.\n- In fact, it is not limited to a single program either; you can install a full desktop environment (e.g. XFCE, KDE).\n- Speaking of limits, it does not need to run in a container; you could install neko on your host, connect to your X server and control your whole VM.\n- Theoretically it is not limited to only X server, anything that can be controlled and scraped periodically for images could be used instead.\n  - Like implementing RDP or VNC protocol, where neko would only act as WebRTC relay server. This is currently only future.\n\nPrimary use case is connecting with multiple people, leveraging real time synchronization and interactivity:\n- **Watch party** - watching video content together with multiple people and reacting to it (chat, emotes) - open source alternative to [giggl.app](https://giggl.app/) or [hyperbeam](https://watch.hyperbeam.com).\n- **Interactive presentation** - not only screen sharing, but others can control the screen.\n- **Collaborative tool** - brainstorming ideas, cobrowsing, code debugging together.\n- **Support/Teaching** - interactively guiding people in controlled environment.\n- **Embed anything** - embed virtual browser in your web app - open source alternative to [hyperbeam API](https://hyperbeam.com/).\n  - open any third-party website or application, synchronize audio and video flawlessly among multiple participants.\n  - request rooms using API with [neko-rooms](https://github.com/m1k1o/neko-rooms).\n\nOther use cases that benefit from single-user:\n- **Personal workspace** - streaming containerized apps and desktops to end-users - similar to [kasm](https://www.kasmweb.com/).\n- **Persistent browser** - own browser with persistent cookies available anywhere - similar to [mightyapp](https://www.mightyapp.com/).\n  - no state is left on the host browser after terminating the connection.\n  - sensitive data like cookies are not transferred - only video is shared.\n- **Throwaway browser** - a better solution for planning secret parties and buying birthday gifts off the internet.\n  - use Tor Browser and [VPN](https://github.com/m1k1o/neko-vpn) for additional anonymity.\n  - mitigates risk of OS fingerprinting and browser vulnerabilities by running in container.\n- **Session broadcasting** - broadcast room content using RTMP (to e.g. twitch or youtube...).\n- **Session recording** - broadcast RTMP can be saved to a file using e.g. [nginx-rtmp](https://www.nginx.com/products/nginx/modules/rtmp-media-streaming/)\n  - have clean environment when recording tutorials.\n  - no need to hide bookmarks or use incognito mode.\n- **Jump host** - access your internal applications securely without the need for VPN.\n- **Automated browser** - you can install [playwright](https://playwright.dev/) or [puppeteer](https://pptr.dev/) and automate tasks while being able to actively intercept them.\n\nCompared to clientless remote desktop gateway (e.g. [Apache Guacamole](https://guacamole.apache.org/) or [websockify](https://github.com/novnc/websockify) with [noVNC](https://novnc.com/)), installed with remote desktop server along with desired program (e.g. [linuxserver/firefox](https://docs.linuxserver.io/images/docker-firefox)) provides neko additionally:\n- **Smooth video** because it uses WebRTC and not images sent over WebSockets.\n- **Built in audio** support, what is not part of Apache Guacamole or noVNC.\n- **Multi-participant control**, what is not natively supported by Apache Guacamole or noVNC.\n\n### Supported browsers\n\n<div align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/firefox.svg\" title=\"m1k1o/neko:firefox\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/google-chrome.svg\" title=\"m1k1o/neko:google-chrome\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/chromium.svg\" title=\"m1k1o/neko:chromium\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/microsoft-edge.svg\" title=\"m1k1o/neko:microsoft-edge\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/brave.svg\" title=\"m1k1o/neko:brave\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/vivaldi.svg\" title=\"m1k1o/neko:vivaldi\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/opera.svg\" title=\"m1k1o/neko:opera\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/tor-browser.svg\" title=\"m1k1o/neko:tor-browser\" width=\"60\" height=\"auto\"/>\n</div>\n\n### Other programs\n\n<div align=\"center\">\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/remmina.png\" title=\"m1k1o/neko:remmina\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/vlc.svg\" title=\"m1k1o/neko:vlc\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/xfce.svg\" title=\"m1k1o/neko:xfce\" width=\"60\" height=\"auto\"/>\n  <img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/icons/kde.svg\" title=\"m1k1o/neko:kde\" width=\"60\" height=\"auto\"/>\n\n  ... others in <a href=\"https://github.com/m1k1o/neko-apps\">m1k1o/neko-apps</a>\n</div>\n\n### Features\n\n  * Text Chat (With basic markdown support, discord flavor)\n  * Admin users (Kick, Ban & Force Give/Release Controls, Lock room)\n  * Clipboard synchronization (on [supported browsers](https://developer.mozilla.org/en-US/docs/Web/API/Clipboard/readText))\n  * Emote overlay\n  * Ignore user (chat and emotes)\n  * Persistent settings\n  * Automatic Login with custom url args. (add `?usr=<your-user-name>&pwd=<room-pass>` to the url.)\n  * Broadcasting room content using RTMP (to e.g. twitch or youtube...)\n  * Bidirectional file transfer (if enabled)\n\n<div align=\"center\">\n\nWith `NEKO_FILE_TRANSFER_ENABLED=true`:\n\n<img src=\"https://raw.githubusercontent.com/m1k1o/neko/master/docs/_media/file-transfer.gif\" width=\"650\" height=\"auto\"/>\n</div>\n\n### Why n.eko?\n\nI like cats 🐱 (`Neko` is the Japanese word for cat), I'm a weeb/nerd.\n\n***But why the cat butt?*** Because cats are *assholes*, but you love them anyways.\n\n## Multiple rooms\n\nFor n.eko room management software, visit [neko-rooms](https://github.com/m1k1o/neko-rooms).\n\nIt also offers zero-knowledge [installation script (with HTTPS and Traefik)](https://github.com/m1k1o/neko-rooms/#zero-knowledge-installation-with-https-and-traefik).\n\n## Documentation\n\n* [Getting Started](https://neko.m1k1o.net/#/getting-started/)\n  * [Quick Start](https://neko.m1k1o.net/#/getting-started/quick-start)\n  * [Examples](https://neko.m1k1o.net/#/getting-started/examples)\n  * [Reverse Proxy](https://neko.m1k1o.net/#/getting-started/reverse-proxy)\n  * [Configuration](https://neko.m1k1o.net/#/getting-started/configuration)\n  * [Troubleshooting](https://neko.m1k1o.net/#/getting-started/troubleshooting)\n* [Mobile Support](https://neko.m1k1o.net/#/mobile-support)\n* [Contributing](https://neko.m1k1o.net/#/contributing)\n  * [Non Goals](https://neko.m1k1o.net/#/non-goals)\n  * [Technologies](https://neko.m1k1o.net/#/technologies)\n* [Changelog](https://neko.m1k1o.net/#/changelog)\n\n## How to contribute? How to build?\n\nNavigate to [.docker](.docker) folder for further information.\n\n## Support\n\nIf you want to support this project, you can do it [here](https://github.com/sponsors/m1k1o).\n"
        },
        {
          "name": "client",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker-compose.yaml",
          "type": "blob",
          "size": 0.333984375,
          "content": "version: \"3.4\"\nservices:\n  neko:\n    image: \"m1k1o/neko:firefox\"\n    restart: \"unless-stopped\"\n    shm_size: \"2gb\"\n    ports:\n      - \"8080:8080\"\n      - \"52000-52100:52000-52100/udp\"\n    environment:\n      NEKO_SCREEN: 1920x1080@30\n      NEKO_PASSWORD: neko\n      NEKO_PASSWORD_ADMIN: admin\n      NEKO_EPR: 52000-52100\n      NEKO_ICELITE: 1\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "neko.code-workspace",
          "type": "blob",
          "size": 1.1142578125,
          "content": "{\n\t\"folders\": [\n\t\t{\n\t\t\t\"path\": \"server\"\n\t\t},\n\t\t{\n\t\t\t\"path\": \"client\"\n\t\t},\n\t\t{\n\t\t\t\"path\": \".\"\n\t\t}\n\t],\n  \"settings\": {\n    \"editor.tabSize\": 2,\n    \"editor.insertSpaces\": true,\n    \"editor.detectIndentation\": false,\n    \"files.encoding\": \"utf8\",\n    \"files.eol\": \"\\n\",\n    \"typescript.tsdk\": \"./client/node_modules/typescript/lib\",\n    \"todo-tree.filtering.excludeGlobs\": [\"**/node_modules/**\"],\n    \"eslint.validate\": [\n      \"vue\",\n      \"javascript\",\n      \"javascriptreact\",\n      \"typescript\",\n      \"typescriptreact\",\n    ],\n    \"vetur.validation.template\": true,\n    \"vetur.useWorkspaceDependencies\": true,\n    \"remote.extensionKind\": {\n      \"ms-azuretools.vscode-docker\": \"ui\"\n    },\n    \"remote.containers.defaultExtensions\": [\n      \"ms-vscode.go\",\n      \"octref.vetur\",\n      \"ms-vscode.cpptools\",\n      \"esbenp.prettier-vscode\",\n      \"dbaeumer.vscode-eslint\",\n      \"ms-vscode-remote.vscode-remote-extensionpack\",\n      \"ms-vscode-remote.remote-containers\",\n      \"ms-azuretools.vscode-docker\",\n      \"editorconfig.editorconfig\",\n      \"gruntfuggly.todo-tree\",\n      \"eamodio.gitlens\",\n      \"swyphcosmo.spellchecker\"\n    ]\n  }\n}"
        },
        {
          "name": "server",
          "type": "tree",
          "content": null
        },
        {
          "name": "tsconfig.json",
          "type": "blob",
          "size": 0.0400390625,
          "content": "{\n  \"extends\": \"./client/tsconfig.json\"\n}"
        }
      ]
    }
  ]
}