{
  "metadata": {
    "timestamp": 1736560921830,
    "page": 651,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Tautulli/Tautulli",
      "stars": 5722,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0947265625,
          "content": ".git\n.github\n.gitignore\ncontrib\ninit-scripts\npackage\npylintrc\nsnap\n*.md\n!CHANGELOG*.md\nstart.bat\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.0595703125,
          "content": "\n# Compiled source #\n###################\n__pycache__\n*.pyc\n*.py~\n*.pyproj\n*.sln\n\n# PlexPy files #\n######################\n*.log\n*.db*\n*.db-journal\n*.ini\nrelease.lock\nversion.lock\nlib/*.dist-info\nlib/*.egg-info\nlib/*.pth\nlib/*/*.pyd\nlib/_distutils_hack\nlib/pkg_resources\nlib/setuptools\nlogs/*\nbackups/*\ncache/*\nexports/*\nnewsletters/*\n*.mmdb\nversion.txt\nbranch.txt\n.TEST\n\n# HTTPS Cert/Key #\n##################\n/*.crt\n/*.key\n/*.csr\n/*.pem\n\n# Mergetool\n*.orgin\n\n# OS generated files #\n######################\n.DS_Store?\n.DS_Store\nehthumbs.db\nIcon?\nThumbs.db\n\n#Ignore files generated by PyCharm\n*.idea/*\n\n#Ignore files generated by VSCode\n*.vscode/*\n\n#Ignore files generated by vi\n*.swp\n\n#Ignore files build by Visual Studio\n*.obj\n*.exe\n*.pdb\n*.user\n*.aps\n*.pch\n*.vspscc\n*_i.c\n*_p.c\n*.ncb\n*.suo\n*.tlb\n*.tlh\n*.bak\n*.cache\n*.ilk\n[Bb]in\n[Dd]ebug*/\n*.lib\n*.sbr\nobj/\n[Rr]elease*/\n_ReSharper*/\n[Tt]est[Rr]esult*\n/cache\n/logs\n.project\n.pydevproject\n\n#Ignore files generated by pyinstaller\n/build\n/dist\n\n#snapcraft specifics\n/parts/\n/stage/\n/prime/\n*.snap\n.snapcraft\n*_source.tar.bz2\nsnap/.snapcraft"
        },
        {
          "name": "API.md",
          "type": "blob",
          "size": 0.140625,
          "content": "# API Reference\n\nTautulli API documentation has been moved to the [wiki page](https://github.com/Tautulli/Tautulli/wiki/Tautulli-API-Reference)."
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 115.9609375,
          "content": "# Changelog\n\n## v2.15.0 (2024-11-24)\n\n* Notes:\n  * Support for Python 3.8 has been dropped. The minimum Python version is now 3.9.\n* Notifications:\n  * New: Allow Telegram blockquote and tg-emoji HTML tags. (Thanks @MythodeaLoL) (#2427)\n  * New: Added Plex slug and Plex Watch URL notification parameters. (#2420)\n  * Change: Update OneSignal API calls to use the new API endpoint for Tautulli Remote App notifications.\n* Newsletters:\n  * Fix: Dumping custom dates in raw newsletter json.\n* History:\n  * Fix: Unable to fix match for artists. (#2429)\n* Exporter:\n  * New: Added movie and episode hasVoiceActivity attribute to exporter fields.\n  * New: Added subtitle canAutoSync attribute to exporter fields.\n  * New: Added logos to the exporter fields.\n* UI:\n  * New: Add friendly name to the top bar of config modals. (Thanks @peagravel) (#2432)\n* API:\n  * New: Added plex slugs to metadata in the get_metadata API command.\n* Other:\n  * Fix: Tautulli failing to start with Python 3.13. (#2426)\n\n\n## v2.14.6 (2024-10-12)\n\n* Newsletters:\n  * Fix: Allow formatting newsletter date parameters.\n  * Change: Support apscheduler compatible cron expressions.\n* UI:\n  * Fix: Round runtime before converting to human duration.\n  * Fix: Make recently added/watched rows touch scrollable.\n* Other:\n  * Fix: Auto-updater not running.\n\n\n## v2.14.5 (2024-09-20)\n\n* Activity:\n  * Fix: Display of 2k resolution on activity card.\n* Notifications:\n  * Fix: ntfy notifications with special characters failing to send.\n* Other:\n  * Fix: Memory leak with database closing. (#2404)\n\n\n## v2.14.4 (2024-08-10)\n\n* Notifications:\n  * Fix: Update Slack notification info card.\n  * New: Added ntfy notification agent. (Thanks @nwithan8) (#2356, #2000)\n* UI:\n  * Fix: macOS platform capitalization.\n* Other:\n  * Fix: Remove deprecated getdefaultlocale. (Thanks @teodorstelian) (#2364, #2345)\n\n\n## v2.14.3 (2024-06-19)\n\n* Graphs:\n  * Fix: History table not loading when clicking on the graphs in some instances.\n* UI:\n  * Fix: Scheduled tasks table not loading when certain tasks are disabled.\n  * Removed: Unnecessary Remote Server checkbox from the settings page.\n* Other:\n  * Fix: Webserver not restarting after the setup wizard.\n  * Fix: Workaround webserver crashing in some instances.\n\n\n## v2.14.2 (2024-05-18)\n\n* History:\n  * Fix: Live TV activity not logging to history.\n  * Fix: Incorrect grouping of live TV history.\n* Notifications:\n  * Fix: Pushover configuration settings refreshing after entering a token.\n  * Fix: Plex remote access down notifications not triggering.\n  * Fix: Deleting all images from Cloudinary only deleting 1000 images.\n  * New: Added platform version and product version notification parameters. (#2244)\n  * New: Added LAN streams and WAN streams notification parameters. (#2276)\n  * New: Added Dolby Vision notification parameters. (#2240)\n  * New: Added live TV channel notification parameters.\n  * Change: Improved Tautulli Remote App notification encryption method.\n    * Note: Requires Tautulli Remote App version 3.2.4.\n* Exporter:\n  * New: Added slug attribute to exporter fields.\n  * New: Added track genres to exporter fields.\n  * New: Added playlist source URI to exporter fields.\n  * New: Added artProvider and thumbProvider to exporter fields.\n* UI:\n  * Fix: Mask deleted usernames in the logs.\n  * Fix: Live TV watch stats not showing on the media info page.\n  * Fix: Users without access to Plex server not showing as inactive.\n  * Removed: Deprecated synced item pages.\n  * Removed: Anonymous redirect settings. Links now use browser no-referrer policy instead.\n* API:\n  * New: Added Dolby Vision info to the get_metadata API command.\n  * New: Added before and after parameters to the get_home_stats API command. (#2231)\n* Packages:\n  * New: Universal binary for macOS for Apple silicon.\n  * New: Bump Snap package to core22.\n* Other:\n  * Change: Login cookie expires changed to max-age.\n  * Change: Improved key generation for login password. It is recommended to reenter your HTTP Password in the settings after upgrading.\n  * Removed: Python 2 compatibility code. (#2098, #2226) (Thanks @zdimension)\n\n\n## v2.13.4 (2023-12-07)\n\n* UI:\n  * Fix: Tautulli configuration settings page not loading when system language is None.\n  * Fix: Login cookie expiring too quickly.\n\n\n## v2.13.3 (2023-12-03)\n\n* Notifications:\n  * New: Added duration_time notification parameter.\n  * New: Added file_size_bytes notification parameter.\n  * New: Added time formats notification text modifiers.\n  * New: Added support for thetvdb_url for movies.\n* UI:\n  * Fix: Activity card overflowing due to screen scaling. (#2033)\n  * Fix: Stream duration on activity card not being updated on track changes in some cases. (#2206)\n\n\n## v2.13.2 (2023-10-26)\n\n* History:\n  * New: Added quarter values icons for history watch status. (#2179, #2156) (Thanks @herby2212)\n* Graphs:\n  * New: Added concurrent streams per day graph. (#2046) (Thanks @herby2212)\n* Exporter:\n  * New: Added metadata directory to exporter fields.\n  * Removed: Banner exporter fields for tv shows.\n* UI:\n  * New: Added last triggered time to notification agents and newsletter agent lists.\n* Other:\n  * New: Added X-Plex-Language header override to config file.\n\n\n## v2.13.1 (2023-08-25)\n\n* Notes:\n  * Support for Python 3.7 has been dropped. The minimum Python version is now 3.8.\n* Other:\n  * Fix: Tautulli failing to start on some systems.\n\n\n## v2.13.0 (2023-08-25)\n\n* Notes:\n  * Support for Python 3.7 has been dropped. The minimum Python version is now 3.8.\n* Notifications:\n  * Fix: Improved watched notification trigger description. (#2104)\n  * New: Added notification image option for iOS Tautulli Remote app.\n* Exporter:\n  * New: Added track chapter export fields.\n  * New: Added on-demand subtitle export fields.\n\n\n## v2.12.5 (2023-07-13)\n\n* Activity:\n  * New: Added d3d11va to list of hardware decoders.\n* History:\n  * Fix: Incorrect grouping of play history.\n  * New: Added button in settings to regroup play history.\n* Notifications:\n  * Fix: Incorrect concurrent streams notifications by IP addresss for IPv6 addresses (#2096) (Thanks @pooley182)\n* UI:\n  * Fix: Occasional UI crashing on Python 3.11.\n  * New: Added multiselect user filters to History and Graphs pages. (#2090) (Thanks @zdimension)\n* API:\n  * New: Added regroup_history API command.\n  * Change: Updated graph API commands to accept a comma separated list of user IDs.\n\n\n## v2.12.4 (2023-05-23)\n\n* History:\n  * Fix: Set view offset equal to duration if a stream is stopped within the last 10 sec.\n* Other:\n  * Fix: Database import may fail for some older databases.\n  * Fix: Double-quoted strings for newer versions of SQLite. (#2015, #2057)\n* API:\n  * Change: Return the ID for async API calls (export_metadata, notify, notify_newsletter).\n\n\n## v2.12.3 (2023-04-14)\n\n* Activity:\n  * Fix: Incorrect subtitle decision shown when subtitles are transcoded.\n* History:\n  * Fix: Incorrect order when sorting by the duration column in the history tables.\n* Notifications:\n  * Fix: Logging error when running scripts that use PlexAPI.\n* UI:\n  * Fix: Calculate file sizes setting causing the media info table to fail to load.\n  * Fix: Incorrect artwork and thumbnail shown for Live TV on the Most Active Libraries statistics card.\n* API:\n  * Change: Renamed duration to play_duration in the get_history API response. (Note: duration kept for backwards compatibility.)\n\n\n## v2.12.2 (2023-03-16)\n\n* Other:\n  * Fix: Tautulli not starting on FreeBSD jails.\n\n\n## v2.12.1 (2023-03-14)\n\n* Activity:\n  * Fix: Stop checking for deprecated sync items sessions.\n  * Change: Do not show audio language on activity cards for music.\n* Other:\n  * Fix: Tautulli not starting on macOS.\n\n\n## v2.12.0 (2023-03-13)\n\n* Notifications:\n  * New: Added support for Telegram group topics. (#1980)\n  * New: Added anidb_id and anidb_url notification parameters. (#1973)\n  * New: Added notification triggers for Intro Marker, Commercial Marker, and Credits Marker.\n  * New: Added various intro, commercial, and credits marker notification parameters.\n  * New: Allow setting a custom Pushover notification sound. (#2005)\n  * Change: Notification images are now uploaded directly to Discord without the need for a 3rd party image hosting service.\n  * Change: Automatically strip whitespace from notification condition values.\n  * Change: Trigger watched notifications based on the video watched completion behaviour setting.\n* Exporter:\n  * Fix: Unable to run exporter when using the Snap package. (#2007)\n  * New: Added credits marker, and audio/subtitle settings to export fields.\n* UI:\n  * Fix: Incorrect styling and missing content for collection media info pages.\n  * New: Added edition details field on movie media info pages. (#1957) (Thanks @herby2212)\n  * New: Added setting to change the video watched completion behaviour.\n  * New: Added watch time and user statistics to collection and playlist media info pages. (#1982, #2012) (Thanks @herby2212)\n  * New: Added history table to collection and playlist media info pages.\n  * New: Dynamically change watched status in the UI based on video watched completion behaviour setting.\n  * New: Added hidden setting to override server name.\n  * Change: Move track artist to a details field instead of in the title on track media info pages.\n* API:\n  * New: Added section_id and user_id parameters to get_home_stats API command. (#1944)\n  * New: Added marker info to get_metadata API command results.\n  * New: Added media_type parameter to get_item_watch_time_stats and get_item_user_stats API commands. (#1982) (Thanks @herby2212)\n  * New: Added last_refreshed timestamp to get_library_media_info API command response.\n* Other:\n  * Change: Migrate analytics to Google Analytics 4.\n\n\n## v2.11.1 (2022-12-22)\n\n* Activity:\n  * Fix: Use source language instead of stream language on activity cards.\n* Notifications:\n  * Fix: Blank start time notification parameters causing recently added notifications to fail. (#1940)\n* Other:\n  * Fix: Tautulli failing to start when using python 3.7.\n  * Fix: Snap install failing to start. (#1941)\n  * Fix: Update check crashing when git is missing. (#1943) (Thanks @Minituff)\n\n\n## v2.11.0 (2022-12-22)\n\n* Activity:\n  * New: Added audio and subtitle language to activity cards. (#1831, #1900) (Thanks @fscorrupt)\n* History:\n  * New: Log subtitle language and subtitle forced to database. (#1826)\n* Notifications:\n  * Fix: Validating condition operators would fail with a blank parameter.\n  * New: Added start time and stop time notification parameters. (#1931)\n  * New: Added session_key to LunaSea notification payload. (#1929) (Thanks @JagandeepBrar)\n* Newsletters:\n  * Fix: Allow CSS to support light and dark themes.\n* Exporter:\n  * New: Added editionTitle to movie exporter fields.\n  * Change: m3u8 export changed to .m3u file extension. File is still encoded using UTF-8.\n* UI:\n  * Fix: Link watch statistics to media page using metadata from history. (#1882)\n  * New: Show subtitle language and subtitle forced flag in stream data modal.\n* Other:\n  * Fix: Mask more user and metadata fields for guest access. (#1913)\n  * Change: Disable TLS 1.0 and 1.1 for the webserver. Minimum TLS version is 1.2. (#1870)\n  * Change: Use system language for requests to Plex Media Server.\n\n\n## v2.10.5 (2022-11-07)\n\n* Notifications:\n  * New: Added edition_title notification parameter. (#1838)\n  * Change: Track notifications link to MusicBrainz track instead of album.\n* Newsletters:\n  * New: Added months time frame for newsletters. (#1876)\n* UI:\n  * Fix: Broken link on library statistic cards. (#1852)\n  * Fix: Check for IPv6 host when generating QR code for app registration.\n  * Fix: Missing padding on condition operator dropdown on small screens.\n* Other:\n  * Fix: Launching browser when webserver is bound to IPv6.\n  * New: Tautulli can be installed via the Windows Package Manager (winget).\n  * Change: Separate stdout and stderr console logging. (#1874)\n* API:\n  * Fix: API not returning 400 response code.\n  * New: Added edition_title to get_metadata API response.\n  * New: Added collections to get_children_metadata API response.\n  * New: Added user_thumb to get_history API response.\n  * New: Validate custom notification conditions before saving notification agents. (#1846)\n  * Change: Fallback to parent_thumb for seasons in get_metadata API response.\n\n\n## v2.10.4 (2022-09-05)\n\n* Activity:\n  * New: Added tooltip for quality profile on activity cards.\n* Notifications:\n  * New: Added \"does not begin with\" and \"does not end with\" condition operators.\n* UI:\n  * Fix: Album count showing 0 on library statistics.\n  * Fix: Library statistics not showing up for libraries without any history.\n\n\n## v2.10.3 (2022-08-09)\n\n* Notifications:\n  * New: Added JSON support for MQTT notifications. (#1763)\n  * New: Added show year notification parameter.\n* Exporter:\n  * New: Added guids to artist, album, and track metadata export fields.\n  * New: Added languageTag to stream media info export fields.\n* UI:\n  * Fix: Long channel identifier overflowing activity card. (#1802) \n  * Change: Use the last played item's artwork for library statistics cards. \n* Other:\n  * Fix: Username log filter causing database to lock up. (#1705)\n  * Change: Username log filter only applies to usernames longer than 3 characters. (#1806)\n* API:\n  * New: Added parent_year and grandparent_year to get_metadata_details API command.\n  * New: Added last played metadata to top_libraries and top_users in get_home_stats API command.\n  * New: Allow fallback to another PMS image in pms_image_proxy API command.\n\n\n## v2.10.2 (2022-07-03)\n\n* Activity:\n  * Fix: Incorrect audio stream info shown on the activity card when playing a secondary audio track.\n* UI:\n  * Fix: Usernames not showing on the home statistics cards.\n  * Fix: Do not save a user's friendly name if it is the same as the username.\n  * Change: Update library icons to the latest Plex style.\n\n\n## v2.10.1 (2022-06-01)\n\n* Notifications:\n  * New: Added support for MusicBrainz (mbid://) guids in notification parameters without MusicBrainz lookup enabled. Requires Plex Media Server 1.27.0 or newer with refreshed Plex Music agent metadata.\n* Mobile App:\n  * Fix: OneSignal validation failing when registering a device.\n* API:\n  * New: Added grandparent_guids and parent_guids to get_metadata API command.\n  * Change: Updated continent in get_geoip_lookup API command.\n  * Change: Removed server_token from from get_users API command.\n  * Change: shared_libraries changed to a list instead of a string for get_users API command.\n\n\n## v2.10.0 (2022-05-23)\n\n* Activity:\n  * Fix: Detection of Dolby Vision missing for PMS 1.26.1.\n* Notifications:\n  * Fix: Parsing of filename notification parameter incorrect for Windows PMS.\n* Exporter:\n  * New: Added additional theme and label export fields.\n* UI:\n  * Fix: Slow loading of collections and playlists tables.\n  * Change: Update default user thumbnail image to match Plex Web.\n* API:\n  * Change: Values for get_users_table and get_libraries_table return an integer instead of \"Checked\". \n\n\n## v2.9.7 (2022-04-11)\n\n* UI:\n  * Fix: Managed user missing the username in the Users table. \n\n\n## v2.9.6 (2022-04-10)\n\n* Activity:\n  * New: Improved display of dynamic range on the activity cards. (Thanks @herby2212)\n* Notifications:\n  * Change: Make include summary option apply to all media types for Discord and Slack notifications.\n* UI:\n  * Fix: Validating Plex login in the setup wizard. (#1697)\n  * New: Added hidden username, email, and full name columns to users table. \n* Other:\n  * Fix: Apply pms_timeout setting to websocket connection.\n  * Fix: Importing of Plex username instead of the full name. (#1710)\n\n\n## v2.9.5 (2022-03-26)\n\n* Note:\n  * Updated Snap packages are currently unavailable due to an upstream issue.\n* Activity:\n  * Change: Improve calculation for transcode progress bar percentage on the activity cards.\n* History:\n  * Fix: Live TV history filter not working. (#1691) \n* Newsletter:\n  * Fix: Newsletter not showing different album types. (#1559) \n* UI:\n  * Fix: Display season summary on the media info page if available with a fallback to show summary. (#1657)\n  * Change: Colour active filter buttons to improve contrast. (#1663)\n* API:\n  * New: Added transcode offset keys to get_activity command.\n* Other:\n  * Fix: Reschedule backup task after changing backup interval. (#1662)\n  * Fix: Dynamic anonymous redirect setting not being enabled by default after the setup wizard.\n  * Fix: Usernames with special characters not being filtered in the logs.\n\n\n## v2.9.4 (2022-02-12)\n\n* UI:\n  * Fix: Setup wizard appearing when restarting after saving settings.\n* Other:\n  * Fix: Stop Tautulli from starting multiple instances on Windows after a clean reinstall. Check the startup items in Windows Task Manager if it is still occurring.\n\n\n## v2.9.3 (2022-02-09)\n\n* UI:\n  * Fix: Setup wizard looping.\n* Other:\n  * Fix: Logger username masking preventing Tautulli from starting on new installs.\n\n\n## v2.9.2 (2022-02-08)\n\n* Notification:\n  * New: Added support for additional Telegram HTML tags.\n  * Removed: Revert Telegram defaulting to MarkdownV2 and only support HTML. (#1635)\n* Other:\n  * Fix: The Local user being masked in the logs.\n\n\n## v2.9.1 (2022-02-07)\n\n* Other:\n  * Fix: Incorrect changelog version number and date.\n\n\n## v2.9.0 (2022-02-07)\n\n* Notification:\n  * New: Added track disc number notification parameter. \n  * Change: Default Telegram messages to MarkdownV2 when HTML is disabled. (#1635)\n* Exporter:\n  * Fix: Images not being included in export zip file download.\n* UI:\n  * Fix: Favicon missing from the newsletter authentication page.\n  * Fix: IPv6 details not being shown in IP address modal. (#1629)\n  * Fix: PWA not respecting device rotation settings. (#1633)\n  * New: Added intermediary login page to the Plex XML shortcuts.\n  * New: Added setting to mask usernames in logs (enabled by default).\n  * New: Added location, secure connection, and Plex Relay details to IP address modal.\n  * Change: Remove Plex token from the settings page.\n  * Change: Increase verifying server timeout to 30 seconds.\n* API:\n  * New: Added get_tautulli_info API command.\n  * New: Added location, secure, and relayed to get_history API response.\n  * Change: Null pms_token and jwt_token in the response of the get_settings API command. (#1616)\n* Other:\n  * Fix: Better validation of config when saving settings.\n  * Fix: Correct section_id and prevent rating_key collisions when updating metadata. (#1640)\n  * Change: Proxy Plex token check and Plex downloads json through the Tautulli server.\n  * Change: Remove tokens from downloaded database and config files.\n  * Change: Do not import pms_token or jwt_secret when importing a config file.\n\n\n## v2.8.1 (2022-01-04)\n\n* API:\n  * New: Added grouping and query_days parameters to the get_item_watch_time_stats API command.\n  * New: Added grouping parameter to the get_item_user_stats API command.\n  * New: Added total_time to the get_library_user_stats, get_user_player_stats, and get_item_user_stats API command responses.\n  * Removed: media_type parameter no longer required for the get_item_watch_time_stats, and get_item_user_stats API commands. The media type is determined automatically.\n* Other:\n  * Fix: Clean .pyc files automatically after updating.\n  * New: Allow Snap package to access /media and /mnt locations. Refer to the FAQ for instructions on how to enable access.\n\n\n## v2.8.0 (2021-12-15)\n\n* History:\n  * Fix: Live TV history filter not working correctly when combined with other filters.\n  * Fix: Direct Stream history filter not remembering the state when reloading the page.\n  * Fix: History table not loading when no filters are selected.\n  * New: Added watch time and user stats to media info pages. (Thanks @herby2212) (#1417, #1471)\n* Notifications:\n  * New: Added Microsoft Teams notification agent. (#1514)\n  * New: Added Gotify notification agent. (#1584)\n  * New: Add warning message that passwords are not copied when duplicating a notification or newsletter agent. (#1540)\n* Newsletters:\n  * Fix: Different album types not shown on newsletter. (#1559)\n* Exporter:\n  * New: Added album formats, subformats, and sonic analysis export fields.\n* UI:\n  * Fix: Docker config volume message overlapping modal windows. (#1567)\n  * Fix: Different album types not shown on artist media info page.\n  * New: Added show more/less toggle for summaries on media info pages. (#1546)\n  * Change: Do not save datatable page or search states when reloading the page. (#1532)\n  * Change: Improve the Plex log reader.\n* API:\n  * New: Added before and after parameters to the get_history API command.\n* Other:\n  * Fix: Updated Python dependencies. (#1499)\n  * Fix: Some websocket connections not respecting the verify SSL setting. (Thanks @nmaggioni) (#1541)\n  * New: Support for Python 3.10. (#1522)\n  * New: Added dynamic anonymous redirect service setting. (#1526)\n\n\n## v2.7.7 (2021-10-14)\n\n* Notifications:\n  * Fix: Colons and exclamation marks being replaced outside of expressions.\n  * New: Added LunaSea notification agent. Note: Requires a future LunaSea app update to function.\n* Newsletters:\n  * Fix: Star rating not showing on newsletter with the new Plex metadata agents. (#1511)\n* UI:\n  * Fix: Sorting of mobile devices table with uppercase and lowercase device names.\n  * Fix: Various dropdown menus with centered text to left-aligned text.\n* Other:\n  * Fix: Plex.tv account token not changing when fetching a new token.\n  * New: Added check and warning message for missing Docker container volume mount.\n\n\n## v2.7.6 (2021-08-31)\n\n* Notifications:\n  * Fix: Unable to parse colons (:) and exclamation marks (!) in notification text eval strings.\n* Exporter:\n  * Fix: Unable to export playlists and collections from a library. (#1484)\n  * New: Added new episode export fields.\n* Mobile App:\n  * Fix: Unable to scan QR code with dark mode enabled.\n  * New: Tautulli Remote App is out of beta for iOS and can be downloaded in the App Store.\n* Other:\n  * New: Update PlexAPI to 4.6.3.\n  * New: Added popup alert message for Windows and macOS when Tautulli fails to start.\n\n\n## v2.7.5 (2021-07-15)\n\n* History:\n  * Fix: Guest users were unable to view history.\n  * Fix: Most Active Library statistics was counting deleted libraries.\n* Newsletters:\n  * Fix: Incorrect padding on the newsletter configuration modal.\n* Mobile App:\n  * New: Tautulli Remote App is out of beta on Android. The iOS app is available for beta testing on TestFlight.\n* API:\n  * New: Added mobile device platform and version to device registration.\n* Other:\n  * Fix: Unable to remove authentication.\n  * Change: Improve API key and device token security on Python 3.\n  * Remove: Basic Authentication setting.\n\n\n## v2.7.4 (2021-06-19)\n\n* Activity:\n  * Fix: Incorrect quality profile shown on the activity card.\n* Notifications:\n  * New: Added ability to evaluate Python expressions in notification parameters.\n  * New: Added tilde (~) to represent blank notification condition values.\n* Exporter:\n  * Fix: Blank fields missing from csv and json exports. \n  * New: Added some new exporter fields.\n* Graphs:\n  * Fix: Play counts and durations not matching the homepage statistics.\n* UI:\n  * New: Show search bar in the collapsed menu on the mobile layout. (#1446)\n  * Change: Do not show seconds for total played duration on Users and Libraries tables.\n* Other:\n  * Fix: Check the Tautulli data folder is writable on startup. (#1441)\n  * New: Update PlexAPI to 4.6.1.\n  * Change: Always hash HTTP password in config file.\n\n\n## v2.7.3 (2021-05-22)\n\n* Activity:\n  * Fix: Incorrect quality profile being shown when transcoding to a higher bitrate.\n* Notifications:\n  * New: Added notification parameters for duration values in seconds. (#1434)\n  * New: Added setting to allow repeat Tautulli update notifications. By default the Tautulli update notification will only notify once.\n  * New: Added setting to allow repeat Plex Media Server update notifications. By default the Plex Media Server update notification will only notify once.\n  * New: Added setting to configure the Tautulli update check interval.\n* UI:\n  * Fix: Prevent accidentally closing modals when dragging the mouse outside the window.\n  * Fix: Recently added queue modal not loading. (#1429)\n  * New: Show collections tab in music libraries. (#1421)\n  * New: Added method to logout of active Tautulli sessions from the login logs.\n* API:\n  * Fix: Update edit_user and edit_library doc strings for required parameters. (#1432)\n* Other:\n  * New: Added advanced hidden setting for CherryPy thread pool size. (Thanks @psaab #1425)\n\n\n## v2.7.2 (2021-04-24)\n\n* UI:\n  * New: Show smart collections in the library collections tab.\n\n\n## v2.7.1 (2021-04-22)\n\n* Notifications:\n  * Fix: Recently added single episode being sent as a show notification. (#1420)\n* Newsletters:\n  * Change: Ignore items with incorrect added at dates in the future.\n* Exporter:\n  * Fix: Exporting not working for libraries, collections, and playlists. (#1408)\n* UI:\n  * Fix: Collections and playlist tabs not loading on library and user pages. (#1408)\n  * Fix: Header overlapping graphs tabs on mobile layout. \n  * Change: Rename \"Plays by Period\" graph tab to \"Media Type\".\n  * Removed: Clear logs button removed from main Tautulli logs.\n\n\n## v2.7.0 (2021-04-10)\n\n* History:\n  * New: Added transcode decision filter added to history tables.\n  * New: History table filters changed to allow multiple selections.\n* Notifications:\n  * Fix: Recently added notifications failing due to metadata not being available yet on the Plex server. (#1392)\n  * New: Added separate SSL/TLS support for Email notifications.\n  * New: Added notification image type setting for Tautulli Remote App notifications.\n  * New: Added guid notification parameter.\n  * New: Added a Plex server down notification threshold setting.\n* Newsletters:\n  * Fix: Newsletters would fail if an episode was missing a season number.\n* UI:\n  * Fix: Fixed spacing of rating images on the media info pages.\n  * Fix: Fixed refreshing cached image in the browser.\n  * Fix: Bootstrap tooltips logging javascript errors in some instances.\n  * Fix: Activity card progress bar not filling at 100%. (#1404)\n  * New: Added blurred background to the Most Active Users statistics card.\n  * New: Added transcode decision filter for all history tables.\n  * New: Added an error popup message if the Plex.tv token is no longer valid when visiting the settings page.\n  * New: Added Amazon Alexa platform logo.\n  * Change: Improved loading times for the homepage watch statistics.\n  * Change: Improved loading times for user and library watch time statistics.\n  * Change: Improved loading of the graph's history modal popup.\n  * Change: Automatically trim trailing slashes from the Tautulli Public Domain setting.\n  * Change: Renamed the Plex Media Server \"Use SSL\" setting to \"Use Secure Connection\".\n  * Change: Update Microsoft Edge platform logo.\n  * Change: Consider link local IP addresses as local addresses.\n  * Change: Reveal token fields if they are blank to make it easier to input new values.\n* Mobile App:\n  * New: Accept disabled OneSignal ID during device registration.\n* API:\n  * New: Added user fallback image option to the pms_image_proxy command.\n  * New: Added optional include_last_seen parameter to the get_user command.\n  * New: Added optional include_last_accessed parameter to the get_library command.\n  * New: Allow comma separated filter values for the get_history command.\n* Other:\n  * Fix: Importing the newsletter table would fail when manually repairing a corrupted database.\n  * Fix: Make fix match in Tautulli for music case-insensitive.\n  * New: Update PlexAPI to 4.5.2.\n  * Change: Migrate section_id from the session_history_metadata database table to session_history.\n  * Change: Copy the database file to the cache folder when importing a database using the browse option.\n  * Change: Delete the cached database file after successfully importing.\n\n\n## v2.6.10 (2021-03-17)\n\n* Other:\n  * Fix: Configuration upgrade would fail if the Most Active User card was disabled. (#1395)\n\n\n## v2.6.9 (2021-03-17)\n\n* Notifications:\n  * New: Added tautulli_update_exe and tautulli_update_exe notification parameters for Tautulli update notifications.\n* Exporter:\n  * New: Added new TV show export fields for the beta Plex TV agent.\n* UI:\n  * Fix: Some popover images not showing up on hover. (#1391)\n  * Remove: HTTP Host setting removed from the UI. This setting may still be changed in the config file.\n  * New: Added a Most Active Libraries statistics card to the homepage. (Thanks @herby2212) \n  * New: Mask sensitive text fields in the settings. Settings can be revealed by clicking on the eye icon.\n* Mobile App:\n  * Change: Make OneSignal validation asynchronous to help timeout issues when registering a device.\n* API:\n  * Added top_libraries stat_id option to get_home_stats API commaand.\n* Ohter:\n  * New: Updated PlexAPI to 4.4.1.\n\n\n## v2.6.8 (2021-03-08)\n\n* Mobile App:\n  * New: An all new Tautulli Remote App 2.0. Go to the Google Play link in the settings to download the new version.\n  * Fix: Registering the new app would fail if OneSignal is blocked.\n\n\n## v2.6.7 (2021-03-07)\n\n* History:\n  * New: Added audio language to detailed stream info. (Thanks @herby2212)\n* Notifications:\n  * New: Added season_name notification parameter.\n  * New: Update notifications to support custom season titles.\n* Newsletters:\n  * New: Update recently added newsletter template to support custom season titles.\n* Exporter:\n  * New: Added originalTitle and bannerFile to TV show export fields.\n* UI:\n  * New: Added TVDB rating image to info page for the new Plex TV agent.\n  * New: Update the UI to support custom season titles.\n* API:\n  * Fix: Return rating key for collections/playlists in get_synced_items.\n  * Fix: Return error when delete_synced_item fails.\n  * New: Return sync_media_type for collections/playlist in get_synced_items.\n  * New: Update pms_image_proxy to support playlist composite images.\n* Other:\n  * Remove: Auto-updater for the Windows exe installer due to it being flagged by antivirus software.\n  * New: Updated PlexAPI to 4.4.0.\n\n\n## v2.6.6 (2021-02-06)\n\n* Exporter:\n  * Fix: Exporting failed with long file paths on Windows.\n  * New: Updated various exporter fields.\n  * Change: Renamed collection children to collection items.\n* UI:\n  * Fix: Client side login redirect changed to server side.\n  * Change: Renamed \"Fix Metadata\" button to \"Fix Match\".\n* API:\n  * New: Added get_children_metadata API command.\n  * New: Return more metadata from the get_home_stats API command.\n* Other:\n  * New: Updated PlexAPI to 4.3.1.\n\n\n## v2.6.5 (2021-01-09)\n\n* Other:\n  * Fix: Some IP addresses not being masked in the logs.\n  * New: Auto-updater for Windows exe installer.\n  * Change: Allow Snap package to access the user home directory.\n  * Change: Migrate Snap user data to a persistent location that is retained if Tautulli is reinstalled.\n\n\n## v2.6.4 (2020-12-20)\n\n* Other:\n  * Fix: Restore Snap data folder from previous installs.\n\n\n## v2.6.3 (2020-12-19)\n\n* Announcements:\n  * This is the last Tautulli version to support Python 2. Python 3 will be required to continue receiving updates. You can check your Python version on the settings page.\n* Exporter:\n  * Fix: Accessible and exists attributes were blank for media info export level 9.\n* UI:\n  * Fix: Guest usernames were not masked on mouse hover.\n* Other:\n  * Fix: macOS menu bar icon for light and dark mode.\n  * New: Tautulli can officially be installed on Linux using a Snap package. See the installation wiki for details.\n\n\n## v2.6.2 (2020-12-05)\n\n* Notifications:\n  * Change: Send a notification of a user new device for the first time only. This can be toggled off in the settings.\n* Exporter:\n  * Fix: Allow exporting child fields only without requiring the parent fields as well.\n  * Fix: Exporting individual collection would fail.\n  * Change: Remove accessible and exists fields from the default media info export levels. This prevents the Plex server from reading the media files unnecessarily. \n* Other:\n  * Fix: Enable high resolution for the macOS system tray icon and menu.\n  * New: Added rate limiting for failed login attempts.\n  * Change: Use a white logo for the macOS system tray icon.\n* API:\n  * New: Added machine_id to the get_history API response.\n\n\n## v2.6.1 (2020-11-03)\n\n* Other:\n  * Fix: High CPU/memory usage in some instances.\n  * Fix: Logger error preventing Tautulli from starting.\n  * Fix: Database issue with non-unique image hashes.\n\n\n## v2.6.0 (2020-10-31)\n\n* Exporter:\n  * New: New exporter feature that allows you to export the metadata and images for any library, collection, playlist, or media item to csv, json, xml, or m3u8. Refer to the Exporter Guide in the wiki for more details.\n* UI:\n  * Fix: Margin on the homepage activity and statistic/library cards. (Thanks @dotsam)\n  * Fix: Movie ratings not showing on the info page for the new Plex Movie agent.\n  * New: Added ability to browse collections and playlists from the library and user pages.\n  * Change: Updated platform brand logos and colours.\n* API:\n  * New: Added export_metadata, download_export, and delete_export API commands.\n  * New: Added get_collections_table, and get_playlists_table API commands.\n  * New: Added min_version parameter to the register_device API command.\n  * New: Added include_activity parameter to the get_history API command.\n  * New: Added sync_id parameter to the get_metadata API command.\n  * New: Added delete_synced_item API command.\n  * New: Added a stat_id and stats_start parameters to the get_home_stats API command.\n  * New: Allow deleting a mobile device using the registration device_id for the delete_mobile_device API command.\n  * Change: Return Plex server info and Tautulli info from the register_device command.\n* Other:\n  * New: The Docker container is now also built for the arm32v6 architecture.\n  * New: The Docker container is also published to the GitHub Container Registry at ghcr.io/tautulli/tautulli.\n  * Change: Tautulli is now using a forked version of plexapi 3.6.0. This is to support the exporter feature while still maintaining Python 2 compatibility.\n  * Change: Updated systemd script to remove process forking. (Thanks @MichaIng)\n  * Change: Cache GitHub update check on startup.\n\n\n## v2.5.6 (2020-10-02)\n\n* Activity:\n  * Change: Renamed container \"Transcode\" to \"Converting\" on activity cards.\n* Notifications:\n  * New: Added a silent notification option for Telegram. (Thanks @JohnnyKing94)\n  * New: Added container_decision notification parameter.\n  * New: Added notification trigger for Playback Error.\n  * New: Added remote access down notification threshold setting.\n* Newsletter:\n  * Change: Stop flooring newsletter start date.\n* UI:\n  * Fix: Unable to purge history from the library edit modal.\n  * Fix: QR code not showing up for localhost address when trying to register a device.\n  * New: Added library name to the fix metadata modal.\n* API:\n  * New: Added default thumb and art to the Live TV library.\n* Other:\n  * Fix: Synced items not loading for guest access.\n  * New: Schedule some more automatic database optimizations.\n  * Change: Added automatic uninstall before installing to the Windows installer.\n\n\n## v2.5.5 (2020-09-06)\n\n* Activity:\n  * Fix: Filter out TV show background theme music sessions.\n* Notifications:\n  * New: Check Plex external guids for notification metadata provider links.\n* UI:\n  * Fix: Incorrect sorting for user/library recently played items.\n* API:\n  * Fix: get_synced_items API command returning error with empty result.\n  * Fix: Download API commands not returning the file.\n  * Fix: get_logs API command encoding error.\n  * Fix: get_user_player_stats API command returning error instead of empty result.\n  * New: Added get_server_info API command.\n  * New: Added external guids to get_metadata API command.\n  * New: Added support for multi-column sorting for datatable API commands.\n  * Change: get_activity API command return thumbnail override for clips.\n  * Change: get_libraries_table API command return custom library artwork.\n* Other:\n  * Fix: Tautulli failed to run with a stale pid file.\n  * New: Added scheduled task to optimize the Tautulli database.\n  * Change: Update plexapi to 3.6.0.\n  * Change: Update some libraries for Python 3 compatibility.\n\n\n## v2.5.4 (2020-07-31)\n\n* Monitoring:\n  * Change: Montitoring remote access changed to use websockets. Refer to Tautulli/Tautulli-Issues#251 for details.\n* Notifications:\n  * Fix: Uploading images to Cloudinary failed for titles with non-ASCII characters on Python 2.\n  * New: Added plex_id notification parameter.\n  * Remove: Running .exe files directly using script notifications is no longer supported.\n  * Remove: php, perl, and ruby prefix overrides for script notifications is no longer supported.\n  * Change: Stricter checking of file extensions for script notifications.\n  * Change: Fallback to The Movie Database lookup using title and year.\n  * Change: Fallback to TVmaze lookup using title.\n* UI:\n  * New: Added ability to import a previous Tautullli configuration file in the settings.\n  * New: Added a browse button for settings which require a folder or file input.\n  * New: Added first streamed column to user IP addresses table. (Thanks @dotsam)\n  * New: Added The Movie Database rating image to media page.\n  * Change: Different icon to represent direct stream in the history tables.\n* API:\n  * New: Updated API docs for importing a database and configuration file.\n\n\n## v2.5.3 (2020-07-10)\n\n* History:\n  * Fix: Unable to delete more than 1000 history entries at the same time.\n* Notifications:\n  * Change: Python script notifications to run using the same Python interpreter as Tautulli.\n* Newsletters:\n  * Fix: Unable to view newsletters with special characters.\n* Other:\n  * Fix: Tautulli failing to start after enabling HTTPS when installed using the Windows / macOS installers.\n  * Fix: Startup script not working on macOS.\n  * Fix: Unable to hide dock icon on macOS with the pkg install. Refer to the FAQ regarding the Python rocket dock icon.\n  * Change: Added path to Python interpreter in system startup (daemon) scripts.\n  * Change: Added Python version to Google analytics.\n\n\n## v2.5.2 (2020-07-01)\n\n* Announcements:\n  * Tautulli now supports Python 3!\n  * Python 2 is still supported for the time being, but it is recommended to upgrade to Python 3.\n* Notifications:\n  * Fix: Error uploading images to Cloudinary on Python 2.\n  * Fix: Testing browser notifications alert not disappearing.\n  * Change: Default recently added notification delay set to 300 seconds.\n* UI: \n  * Fix: MacOS menu bar icon causing Tautulli to fail to start.\n  * Fix: Unable to login to Tautulli on Python 2.\n  * New: Windows and MacOS setting to enable Tautulli to start automatically when you login.\n  * New: Added menu bar icon for MacOS.\n  * New: Ability to import a Tautulli database in the settings.\n  * New: Added Tautulli news area on the settings page.\n  * New: Added platform icon for LG devices.\n  * Remove: Ability to login to Tautulli using a Plex username and password has been removed. Login using a Plex.tv account is only supported via OAuth.\n* Mobile App:\n  * Fix: Improved API security and validation when registering the Android app.\n* Docker:\n  * Fix: Docker container not respecting the PUID and PGID environment variables.\n* Other:\n  * Fix: Error creating self-signed certificates on Python 3.\n  * Fix: Tautulli login session cookie not set on the HTTP root path.\n  * New: Windows and MacOS app installers to install Tautulli without needing Python installed.\n\n\n## v2.2.4 (2020-05-16)\n\n* Monitoring:\n  * Fix: Show \"None\" as the subtitle source on the activity card for user selected subtitles.\n* UI:\n  * Fix: Deleted libraries were showing up on the homepage library cards.\n  * Fix: Libraries could get stuck as inactive in the database in some instances.\n* API:\n  * Fix: Incorrect title was being returned for the get_history API command.\n* Other:\n  * Fix: Plex remote access check was not being rescheduled after changing the settings.\n\n\n## v2.2.3 (2020-05-01)\n\n* Notifications:\n  * Fix: Notification grouping by season/album and show/artist not enabled by default.\n  * Fix: The rating key notification parameter was being overwritten when 3rd party lookup was enabled.\n  * Fix: Missing artist value for Musicbrainz lookup in certain situations. \n  * New: Added notification trigger for Tautulli database corruption.\n  * New: Added TAUTULLI_PYTHON_VERSION to script notification environment variables.\n  * New: Added Plex Android / iOS App notification agent.\n  * New: Added bandwidth notification parameters.\n  * New: Added user thumb to notification parameters.\n  * New: Added initial stream notification parameter and threshold setting to determine if a stream is the first stream of a continuous streaming session.\n  * New: Added Plex remote access notification parameters.\n  * Change: The file size notification parameter is now reported in SI units. (Thanks @aaronldunlap)\n* UI:\n  * Fix: Delete lookup info from the media info page failing.\n  * Fix: XBMC platform icon not being redirected to the Kodi platform icon.\n  * Fix: History table was not being refreshed after deleting entries.\n  * New: Added icon on the users table to indicate if the user is not on the Plex server.\n  * New: Added icon on the libraries table to indicate if the library is not on the Plex server.\n  * Change: Improved deleting libraries so libraries with the same section ID are not also deleted.\n* Mobile App:\n  * Fix: Temporary device token was not being invalidated after cancelling device registration.\n* API:\n  * Fix: Returning XML from the API failing due to unicode characters.\n  * Fix: Grouping parameter for various API commands not falling back to default setting.\n  * New: Added time_queries parameter to get_library_watch_time_stats and get_user_watch_time_stats API command. (Thanks @KaasKop97)\n  * New: Added an \"is_active\" return value to the get_user, get_users, get_library, and get_libraries API commands which indicates if the user or library is on the Plex server.\n  * New: Added delete_history API command.\n  * Change: Added optional parameter for row_ids for delete_library, delete_user, delete_all_library_history, and delete_all_user_history API commands.\n* Other:\n  * Fix: Update failing on CentOS due to an older git version.\n  * Fix: Manifest file for creating a web app had incorrect info.\n  * Fix: Auto-updater was not scheduled when enabling the setting unless Tautulli was restarted.\n  * New: Docker images updated to support ARM platforms.\n  * Change: Remove the unnecessary optional Plex logs volume from the Docker image.\n  * Change: Use Plex.tv for GeoIP lookup instead of requiring the MaxMind GeoLite2 database.\n\n\n## v2.2.1 (2020-03-28)\n\n* Notifications:\n  * Fix: File size notification parameter incorrectly truncated to an integer.\n  * Fix: Notification grouping by season/album not enabled by default.\n  * New: Added transcode decision counts to notification parameters.\n  * Change: Tags (<>) are no longer stripped from from Webhook notification text.\n* Newsletter:\n  * New: Added favicon to newsletter template when viewing as a web page.\n* UI:\n  * Fix: Username missing from the Synced Items table.\n  * Fix: Windows system tray icon not enabled by default.\n  * Fix: Saving a mobile device with a blank friendly name caused an error.\n  * New: Added IMDb and Rotten Tomato Ratings to info pages.\n  * New: Added button in settings to delete all 3rd party metadata lookup info in the database.\n  * New: Added button in settings to flush recently added items in the database.\n* API:\n  * New: Added delete_recenly_added API command to flush recently added items.\n  * Change: Updated delete_lookup_info API command parameters to allow deleteing all 3rd party metadata lookup info.\n\n\n## v2.2.0 (2020-03-08)\n\n* Important Note!\n  * All Live TV changes requires Plex Media Server 1.18.7 or higher. \n* Monitoring:\n  * Fix: Improved IPv6 display on the activity cards. (Thanks @felixbuenemann)\n  * New: Added Live TV metadata and posters to the activity cards.\n  * Change: Show bandwidth in Gbps when greater than 1000 Mbps.\n* History:\n  * New: Added history logging for Live TV sessions.\n  * New: Added a fake \"Live TV\" library to collect Live TV history.\n    * Note: This library will show up the first time that Live TV is played.\n  * New: Added the ability to filter history by Live TV.\n* Graphs:\n  * New: Added Live TV series to the \"Plays by Period\" and \"Play Totals\" graphs.\n  * Change: Media type series on the graphs are only shown if the corresponding library type is present.\n* Notifications:\n  * Fix: Race condition causing stream count to be incorrect for playback stop notifications.\n  * New: Added Live TV channel notification parameters.\n  * New: Added Plex background art notification parameter.\n    * Note: This is the Plex API endpoint to retrieve the background art, not the actual image.\n  * New: Added poster images for clip notifications.\n  * Change: Default Webhook notification method to POST.\n* UI:\n  * Fix: Windows platform showing up twice on the Most Active Platforms statistics card.\n  * New: Added option to change the background art for library sections when editing a library.\n  * New: Added button to reset Tautulli git installation in settings to fix failed git updates.\n* API:\n  * New: Added ability to filter history using a \"live\" media type and by guid for the get_history API command.\n  * New: Added cutsom_art parameter to the edit_library API command.\n* Other:\n  * Change: Add crossorigin use-credentials attribute to manifest tags. (Thanks @pkoenig10)\n  * Change: Disable automatic updates for Docker containers. Updates are now handled by updating the Docker container.\n    * Note: If you are using an old Docker container created before v2.2.0, then you may need to completely remove and recreate the container to update for the first time.\n    * Note: Use the \":latest\" Docker tag for the newest stable release, or the \":beta\" or \":nightly\" tags to access the beta or nightly branches.\n\n\n## v2.1.44 (2020-02-05)\n\n* Monitoring:\n  * Fix: SDR source video being identified as HDR stream video.\n* Notifications:\n  * Fix: Unable to select condition operator for video color parameters.\n* UI:\n  * Fix: Capitalization for platforms on history tables.\n\n\n## v2.1.43 (2020-02-03)\n\n* Monitoring:\n  * New: Added HDR indicator on activity card.\n  * New: Added dynamic range to history steam info modal.\n* Notifications:\n  * Fix: Webhook notification body sent as incorrect data type when Content-Type header is overridden.\n  * Fix: Telegram notification character limit incorrect for unicode characters.\n  * New: Added color and dynamic range notification parameters.\n* Newsletters:\n  * Fix: Episodes and Albums plural spelling on recently added newsletter section headers.\n* UI:\n  * Fix: Windows and macOS platform capitalization.\n  * Fix: Season number 0 not shown for episodes on history tables.\n* Other:\n  * Change: Mask email addresses in logs.\n  * Change: Update deprecated GitHub access token URL parameter to Authorization header.  \n\n\n## v2.1.42 (2020-01-04)\n\n* Other:\n  * Fix: SSL certificate error when installing GeoLite2 database.\n  * Change: Verify MaxMind license key and GeoLite2 database path before installing.\n  * Change: Disable GeoLite2 database uninstall button when it is not installed.\n\n\n## v2.1.41 (2019-12-30)\n\n* Other:\n  * Fix: Failing to extract the GeoLite2 database on Windows.\n\n\n## v2.1.40 (2019-12-30)\n\n* UI:\n  * Change: Moved 3rd Party API settings to new tab in the settings.\n* Graphs:\n  * Change: Improve calculating month ranges for Play Totals graphs.\n* Other:\n  * Fix: Failing to verify a Plex Media Server using a hostname.\n  * Change: A license key is now required to install the MaxMind GeoLite2 database for IP geolocation. Please follow the guide in the wiki to reinstall the GeoLite2 database.\n  * Change: The GeoLite2 database will now automatically update periodically if installed.\n\n\n## v2.1.39 (2019-12-08)\n\n* UI:\n  * New: Added creating admin username and password to setup wizard.\n* API:\n  * Change: Remove default notification subject and body for notify API command.\n* Other:\n  * Change: Check for database corruption when making backup.\n\n\n## v2.1.38 (2019-11-17)\n\n* Notifications:\n  * New: Added custom JSON headers to the webhook notification agent.\n* UI:\n  * Fix: Homepage recently watched card not showing grouped history.\n* Other:\n  * New: Added GitHub sponsor donation option.\n  * Change: Improve resolving hostnames.\n\n\n## v2.1.37 (2019-10-11)\n\n* Notifications:\n  * Fix: Last.fm URLs linking to artist page instead of the album page.\n  * New: Added option for MusicBrainz lookup for music notifications. Option must be enabled under 3rd Party APIs in the settings.\n  * New: Added MusicBrainz ID and MusicBrainz URL notification parameters.\n  * Change: Automatically truncate Discord description summary to 2048 characters.\n\n\n## v2.1.36-beta (2019-10-05)\n\n* Monitoring:\n  * Fix: Activity card title not updating after pre-rolls or auto-play.\n* History:\n  * Fix: Display correct interlaced or progressive video scan type on stream data modal.\n* Graphs:\n  * New: Separate interlaced and progressive video scan type on source and stream resolution graphs.\n* API:\n  * New: Added parent_guid and grandparent_guid to get_activity and get_metadata commands.\n\n\n## v2.1.35-beta (2019-09-24)\n\n* Monitoring:\n  * Fix: Audio shown as blank on activity cards when changing audio tracks during direct play.\n  * Fix: Display correct interlaced or progressive video scan type on activity cards.\n  * New: Added flag for Nvidia hardware decoding on activity cards.\n* Notifications:\n  * Fix: Notification parameter prefix and suffix were not substituted correctly.\n  * Fix: Release Date notification parameter was incorrectly casted to an integer instead of a string.\n  * New: Added video scan type and full resolution notification parameters.\n* UI:\n  * Fix: Movies with the same title but different year being grouped on the homepage stats cards.\n* API:\n  * New: Added video scan type and full resolution values to get_activity command.\n* Other:\n  * Fix: Tautulli logging out every time after saving settings and restarting.\n\n\n## v2.1.34 (2019-09-03)\n\n* History:\n  * New: Added Product column to history tables.\n* Notifications:\n  * Fix: IMDB/TMDb/TVDB/TVmaze ID notification parameters showing blank values after lookup.\n* UI:\n  * Fix: Libraries and Users tables did not respect the group history setting.\n* API:\n  * Fix: Title field was not searchable in get_library_media_info command.\n  * New: Added grouping option to get_libraries_table and get_users_table commands.\n  * New: Added product value to get_history command.\n* Other:\n  * Fix: Could not verify Plex Media Server with unpublished hostnames.\n  * Change: Automatically logout all Tautulli instances when changing the admin password.\n\n\n## v2.1.33 (2019-07-27)\n\n* Notifications:\n  * Change: Mask notification agent password fields.\n  * Change: Enable searching by email address in dropdown menu.\n* Other:\n  * Fix: Version number being overwritten with \"None\" which prevented updating in some instances.\n  * Change: Update Plex OAuth request headers.\n\n\n## v2.1.32 (2019-06-26)\n\n* Newsletters:\n  * Fix: Newsletter scheduler issue for QNAP devices using an invalid \"local\" timezone preventing Tautulli from starting.\n\n\n## v2.1.31 (2019-06-24)\n\n* No additional changes from v2.1.31-beta.\n\n\n## v2.1.31-beta (2019-06-13)\n\n* Monitoring:\n  * Fix: Synced content showing incorrect stream info.\n* Other:\n  * Fix: Unable to view database status when authentication is enabled.\n  * Change: Default database synchronous mode changed to prevent database corruption. Database response may be slower.\n\n\n## v2.1.30-beta (2019-05-11)\n\n* Monitoring:\n  * Fix: Activity crashing with Plex's Artist TV feature.\n  * New: Added setting for Plex Media Server Update Check Interval. (Thanks @abiacco)\n* Notifications:\n  * New: Added secure and relayed connection notification parameters.\n  * New: Added PLEX_USER_TOKEN to script environment variables.\n  * Change: Schedule notifications using UTC to prevent missing notifications due to misconfigured timezones.\n* API:\n  * New: Added status API command to check the status of Tautulli.\n\n\n## v2.1.29 (2019-05-11)\n\n* No additional changes from v2.1.29-beta.\n\n\n## v2.1.29-beta (2019-04-14)\n\n* Monitoring:\n  * Change: \"Required Bandwidth\" changed to \"Reserved Bandwidth\" in order to match the Plex dashboard.\n* Notifications:\n  * New: Added prefix and suffix notification text modifiers. See the \"Notification Text Modifiers\" help modal for details.\n* UI:\n  * New: Added \"Undelete\" button to the edit library and edit user modals.\n  * Fix: User IP address history table showing incorrect \"Last Seen\" values.\n* API:\n  * Fix: Search API only returning 3 results.\n  * Fix: Terminate stream API failing when both session_key and session_id were provided.\n  * Change: Improved API response HTTP status codes and error messages.\n\n\n## v2.1.28 (2019-03-10)\n\n* Monitoring:\n  * New: Added secure/insecure connection icon on the activity cards. Requires Plex Media Server v1.15+.\n* Other:\n  * Change: Improved mass deleting of all images from Cloudinary. Requires all previous images on Cloudinary to be manually tagged with \"tautulli\". New uploads are automatically tagged.\n\n\n## v2.1.27-beta (2019-03-03)\n\n* Monitoring:\n  * Fix: Error when playing synced optimized versions.\n  * Change: Show message to complete the setup wizard instead of error communicating with server message.\n  * Change: URL changed on Plex.tv for Plex Media Server beta updates.\n* Notifications:\n  * New: Show the media type exclusion tags in the text preview modal.\n  * Fix: Unicode error in the Email notification failed response message.\n  * Fix: Error when a notification agent response is missing the \"Content-Type\" header.\n* UI:\n  * Fix: Usernames were not being sanitized in dropdown selectors.\n  * Change: Different display of \"All\" recently added items on the homepage due to change in the Plex Media Server v1.15+ API.\n* API:\n  * New: Added current Tautulli version to update_check API response.\n  * Change: API no longer returns sanitized HTML response data.\n* Other:\n  * New: Added auto-restart to systemd init script.\n  * Fix: Patreon donation URL.\n  * Remove: Crypto donation options.\n\n\n## v2.1.26 (2018-12-01)\n\n* Monitoring:\n  * Fix: Resume event not being triggered after buffering.\n* Notifications:\n  * New: Added user email as a notification parameter.\n* Graphs:\n  * Fix: History model showing no results for stream info graph.\n* API:\n  * Fix: API returning error when missing a cmd.\n\n\n## v2.1.25 (2018-11-03)\n\n* Monitoring:\n  * Fix: Audio and video codec showing up as * on the activity cards.\n  * New: Poster and background image on the activity cards for live TV.\n* UI:\n  * Fix: Alert message for invalid Tautulli Public Domain setting.\n\n\n## v2.1.24-beta (2018-10-29)\n\n* Monitoring:\n  * Fix: Transcode change events creating invalid sessions in the database.\n* Notifications:\n  * Change: Update Telegram character limit to 1024.\n* History:\n  * Fix: Save history table states separately for multiple Tautulli instances.\n* Graphs:\n  * Fix: Save graphs states separately for multiple Tautulli instances.\n  * Change: Version graphs to bypass browser cache.\n* UI:\n  * New: Added queued tasks modals to the scheduled tasks table for debugging.\n* Other:\n  * Change: Updated timezone info and display in configuration table.\n\n\n## v2.1.23-beta (2018-10-14)\n\n* Monitoring:\n  * Fix: Buffer events not being triggered properly.\n  * Fix: Watched progress sometimes not saved correctly. (Thanks @Sheigutn)\n* Notifications:\n  * New: Added notification trigger for transcode decision change.\n  * Fix: Multiple buffer notifications being triggered within the same second.\n  * Change: Default buffer notification threshold changed to 10 for buffer thresholds less than 10.\n* Newsletter:\n  * New: Added Other Video libraries to the newsletter.\n* Homepage:\n  * New: Added Other Video type to recently added on the homepage.\n  * Change: Save homepage recently added media type toggle state.\n  * Change: Save homepage stats config to local storage instead of the server.\n* History:\n  * Change: Save history table media type toggle state.\n* Graphs:\n  * Change: Save series visibility state when toggling the legend.\n  * Change: Save graph config to local storage instead of the server.\n* UI:\n  * New: Show the remote app device token and id in the edit device modal.\n  * Change: Lock certain settings if using the Tautulli docker container.\n* API:\n  * Fix: download_config, download_database, download_log, and download_plex_log API commands not working.\n  * Change: get_recently_added command 'type' parameter renamed to 'media_type'. Backwards compatibility is maintained.\n  * Change: get_home_stats command 'stats_type' parameter change to string 'plays' or 'duration'. Backwards compatibility is maintained.\n\n\n## v2.1.22 (2018-10-05)\n\n* Notifications:\n  * Fix: Notification agent settings not loading when failed to retrieve some data.\n* UI:\n  * Fix: Incorrectly showing localhost server in the setup wizard.\n* Other:\n  * Fix: Incorrect redirect to HTTP when HTTPS proxy header is present.\n  * Fix: Websocket not connecting automatically after the setup wizard.\n\n\n## v2.1.21 (2018-09-21)\n\n* Notifications:\n  * Fix: Content Rating notification condition always evaluating to True. (Thanks @Arcanemagus)\n  * Fix: Script arguments not showing substituted values in the notification logs.\n* UI:\n  * New: Unsupported browser warning when using IE or Edge.\n  * Fix: Misaligned refresh image icon in album search results. (Thanks @Sheigutn)\n  * Fix: Music history showing as pre-Tautulli in stream info modal.\n* Other:\n  * Fix: Typo in Systemd init script group value. (Thanks @ldumont)\n  * Fix: Execute permissions in Fedora/CentOS and Systemd init scripts. (Thanks @wilmardo)\n  * Fix: Systemd init script instructions per Linux distro. (Thanks @samwiseg00)\n  * Change: Fallback to Tautulli data directory if logs/backup/cache/newsletter directories are not writable.\n  * Change: Check for alternative reverse proxy headers if X-Forwarded-Host is missing.\n\n\n## v2.1.20 (2018-09-05)\n\n* No additional changes from v2.1.20-beta.\n\n\n## v2.1.20-beta (2018-09-02)\n\n* Monitoring:\n  * Fix: Fetch messing season info when \"Hide Seasons\" is enabled for a show.\n  * Fix: Video and Audio details sometimes missing on activity cards.\n* Notifications:\n  * New: Added UTC timestamp to notification parameters. (Thanks @samwiseg00)\n  * New: Added TAUTULLI_PUBLIC_URL to script environment variables. (Thanks @samwiseg00)\n* UI:\n  * Change: Automatically redirect '/' to HTTP root if enabled.\n* API:\n  * New: Added return_hash parameter to pms_image_proxy command.\n  * New: Added session_id parameter to get_activity command.\n* Other:\n  * Change: Linux systemd startup script to use the \"tautulli\" group permission. (Thanks @samwiseg00)\n\n\n## v2.1.19-beta (2018-08-19)\n\n* Notifications:\n  * New: Added Webhook notification agent.\n  * Fix: Scripts failing due to unicode characters in substituted script arguments.\n  * Change: Ability to override PYTHONPATH for scripts.\n  * Remove: Notify My Android notification agent.\n* Newsletters:\n  * New: Added option for threaded newsletter emails.\n  * Fix: Missing space in newsletter format.\n* UI:\n  * New: Added Windows system tray icon.\n  * Fix: Plex OAuth not working with Plex remote access disabled. (Thanks @samwiseg00)\n* API:\n  * Fix: SQL command creating a database backup every time. (Thanks @samwiseg00)\n\n\n## v2.1.18 (2018-07-27)\n\n* Monitoring:\n  * Fix: Progress bar on activity cards showing incorrect 100% when starting a stream.\n* Notifications:\n  * Fix: Notification text boxes scrolling to top when inputting text.\n  * Change: Skip formatting invalid notification parameters instead of returning default text.\n* UI:\n  * Fix: Padding around search bar causing the navigation bar to break on smaller screens.\n\n\n## v2.1.17-beta (2018-07-22)\n\n* Notifications:\n  * Change: Use default selected stream for media info in notifications.\n* UI:\n  * New: Automatically discover localhost Plex servers in server selection dropdown.\n  * Change: Save Datatables state indefinitely.\n\n\n## v2.1.16-beta (2018-07-06)\n\n* Monitoring:\n  * Fix: Plex server not detected as down during sudden network loss.\n* Notifications:\n  * Fix: Incorrect rounding of percentages in some cases.\n  * Fix: Incorrect stream duration value for playback start notifications.\n  * New: Added critic rating parameter for Rotten Tomatoes ratings.\n* Newsletters:\n  * Fix: Typo in \"seasons\" when there is only one additional season.\n* UI:\n  * New: Added ability to use Plex OAuth to login to Tautulli.\n* API:\n  * Fix: Unicode characters causing get_logs command to return bad data.\n  * New: Added rating_image and audience_rating_image to get_activity and get_metadata commands.\n\n\n## v2.1.15-beta (2018-07-01)\n\n* Monitoring:\n  * Fix: Progress percent displaying NaN for live TV.\n  * Fix: Unable to terminate sessions with unicode characters in the message.\n  * Change: Tizen platform to display the Samsung icon.\n* Notifications:\n  * New: Added PYTHONPATH to script environment variables so scripts can automatically import from Tautulli libraries.\n  * Fix: Proper handling of unicode script arguments.\n  * Fix: Incorrect TAUTULLI_URL environment variable if the HTTP host setting is changed.\n  * Fix: Email addresses selectize box not expanding.\n* Newsletters:\n  * Change: HTTPS URLS for images hosted on tautulli.com.\n* Graphs:\n  * Fix: SD resolution sometimes not grouped together.\n\n\n## v2.1.14 (2018-06-21)\n\n* Notifications:\n  * Fix: Parsing script arguments in quotes.\n* UI:\n  * Fix: Slow loading due to Font Awesome 5 javascript.\n  * Change: Play counts on user an library pages now respect the history grouping setting.\n* API:\n  * New: Added optional grouping parameter to user and library watch statistics.\n\n\n## v2.1.13 (2018-06-16)\n\n* Monitoring:\n  * Fix: Soft crash when viewing photos not in an album.\n* Notifications:\n  * New: Added current date and time notification parameters.\n* UI:\n  * New: Added support page with embedded Discord chat using WidgetBot.\n\n\n## v2.1.12 (2018-06-08)\n\n* Notifications:\n  * Change: Blank notification link source means disabled instead of default.\n* Newsletters:\n  * New: Make collection tags available in the raw newsletter data for custom templates.\n* API:\n  * New: Ability to terminate a stream using the session key.\n\n\n## v2.1.11-beta (2018-06-02)\n\n* Monitoring:\n  * Fix: Activity progress bar not updating in some cases.\n  * Fix: Monitory Remote Access setting disabled due to Plex Media Server API changes.\n  * Change: Improved logic for grouping history items without being successive plays.\n* Notifications:\n  * New: Added filename to notification parameters.\n* Other:\n  * Fix: Update metadata failing for tracks without track numbers.\n\n\n## v2.1.10-beta (2018-05-28)\n\n* Monitoring:\n  * Fix: Improved monitoring of live tv sessions.\n  * Change: Use track artist instead of album artist.\n* Notifications:\n  * New: Added timestamp to Discord notification embeds. (Thanks @samwiseg00)\n  * New: Enable notifications for \"clip\" media types.\n  * Fix: Actually add the \"live\" notification parameter.\n  * Change: Update Twitter for 280 characters.\n  * Change: Use HTTPS url for Cloudinary images.\n* Newsletters:\n  * Fix: Artist summaries not showing up on newsletter cards.\n  * Change: Do not send the newsletter if the template fails to render.\n\n\n## v2.1.9 (2018-05-21)\n\n* Notifications:\n  * New: Added \"live\" to notification parameters.\n\n\n## v2.1.8-beta (2018-05-19)\n\n* Newsletters:\n  * New: Added authentication options for self-hosted newsletters.\n  * Change: Check if the Tautulli footer has been removed in custom newsletter templates.\n* Notifications:\n  * Fix: Cloudinary images not working for Twitter notifications.\n* API:\n  * Fix: Return proper HTTP status codes for errors.\n\n\n## v2.1.7-beta (2018-05-13)\n\n* Newsletters:\n  * New: Option to toggle between inline or internal CSS style templates.\n  * New: Button to delete all uploaded images from Imgur/Cloudinary.\n  * Fix: Long titles overflowing the newsletter cards.\n  * Change: Self-hosted images on newsletters to use the /image endpoint instead of proxying through /newsletter/image.\n  * Change: Strip whitespace from newsletter for smaller file size before sending to email.\n* API:\n  * New: Added get_stream_data command to API.\n  * New: Added newsletter API commands to documentation.\n\n\n## v2.1.6-beta (2018-05-09)\n\n* Newsletters:\n  * Change: Setting to specify static URL ID name instead of using the newsletter ID number.\n  * Change: Reorganize newsletter config options.\n\n\n## v2.1.5-beta (2018-05-07)\n\n* Newsletters:\n  * New: Added setting for a custom newsletter template folder.\n  * New: Added option to enable static newsletter URLs to retrieve the last sent scheduled newsletter.\n  * New: Added ability to change the newsletter output directory and filenames.\n  * New: Added option to save the newsletter file without sending it to a notification agent.\n  * Fix: Check for disabled image hosting setting.\n  * Fix: Cache newsletter images when refreshing the page.\n  * Fix: Refresh image from the Plex server when uploading to image hosting.\n  * Change: Allow all image hosting options with self-hosted newsletters.\n* UI:\n  * Change: Don't retrieve recently added on the homepage if the Plex Cloud server is sleeping.\n* Other:\n  * Fix: Imgur database upgrade migration.\n\n\n## v2.1.4 (2018-05-05)\n\n* Newsletters:\n  * Fix: Newsletter URL without an HTTP root.\n\n\n## v2.1.3-beta (2018-05-04)\n\n* Newsletters:\n  * Fix: HTTP root doubled in newsletter URL.\n  * Fix: Configuration would not open with failed hostname resolution.\n  * Fix: Schedule one day off when using weekday names in cron.\n  * Fix: Images not refreshing when changed in Plex.\n  * Fix: Cloudinary upload with non-ASCII image titles.\n* Other:\n  * Fix: Potential XSS vulnerability in search.\n\n\n## v2.1.2-beta (2018-05-01)\n\n* Newsletters:\n  * New: Added Cloudinary option for image hosting.\n* Notifications:\n  * New: Added Message-ID to Email header (Thanks @Dam64)\n  * Fix: Posters not showing up on Twitter with self-hosted images.\n  * Fix: Incorrect action parameter for new device notifications.\n  * Change: Hardcode Pushover sound list instead of fetching the list every time.\n* API:\n  * Fix: Success result for empty response data.\n  * Change: Do not send notification when checking for Tautulli updates via the API.\n\n\n## v2.1.1-beta (2018-04-11)\n\n* Monitoring:\n  * Fix: Live TV transcoding showing incorrectly as direct play.\n* Newsletters:\n  * New: Added week number as parameter. (Thanks @samip5)\n  * Fix: Fallback to cover art on the newsletter cards.\n  * Change: Option to set newsletter time frame by calendar days or hours.\n* Notifications:\n  * New: Added week number as parameter. (Thanks @samip5)\n* Other:\n  * New: Added plexapi library for custom scripts.\n\n\n## v2.1.0-beta (2018-04-07)\n\n* Newsletters:\n  * New: A completely new scheduled newsletter system.\n    * Beautiful HTML formatted newsletter for recently added movies, TV shows, or music.\n    * Send newsletters on a daily, weekly, or monthly schedule to your users.\n    * Customize the number of days of recently added content and the libraries to include on the newsletter.\n    * Add a custom message to be included on the newsletter.\n    * Option to either send an HTML formatted email, or a link to a self-hosted newsletter on your own domain to any notification agent.\n* Notifications:\n  * New: Ability to use self-hosted images on your own domain instead of using Imgur.\n\n\n## v2.0.28 (2018-04-02)\n\n* Monitoring:\n  * Fix: Homepage activity header text.\n\n\n## v2.0.27 (2018-04-02)\n\n* Monitoring:\n  * Change: Move activity refresh interval setting to the settings page.\n\n\n## v2.0.26-beta (2018-03-30)\n\n* Monitoring:\n  * New: Setting to change the refresh interval on the homepage.\n  * Fix: Identify extras correctly on the activity cards.\n* Notifications:\n  * Change: Send Telegram image and text separately if the caption is longer than 200 characters.\n* UI:\n  * Fix: Error when clicking on synced playlist links.\n\n\n## v2.0.25 (2018-03-22)\n\n* Monitoring:\n  * Fix: Websocket not reconnecting causing activity monitoring and notifications to not work.\n  * Fix: Error checking for synced streams without Plex Pass.\n\n\n## v2.0.24 (2018-03-18)\n\n* Monitoring:\n  * Fix: Fix stream data not showing for history recorded before v2.\n* Notifications:\n  * Fix: Set all environment variables for scripts.\n  * Change: Moved all notification agent instructions to the wiki.\n  * Change: XBMC notification agent renamed to Kodi.\n  * Change: OSX Notify notification agent renamed to macOS Notification Center.\n\n\n## v2.0.23-beta (2018-03-16)\n\n* Monitoring:\n  * Fix: Certain transcode stream showing incorrectly as direct play in history. Fix is not retroactive.\n* Notifications:\n  * New: Added season/episode/album/track count to notification parameters.\n  * New: Added \"Value 3\" setting for IFTTT notifications.\n  * New: Set PLEX_URL, PLEX_TOKEN, TAUTULLI_URL, and TAUTULLI_APIKEY environment variables for scripts.\n  * Fix: Notifications failing to send with invalid custom conditions json.\n  * Fix: Email notifications failing with unicode username/passwords.\n  * Change: Facebook Graph API version updated to v2.12.\n* UI:\n  * New: Show the Plex Server URL in the settings.\n  * Fix: Incorrect info displayed in the Tautulli login logs.\n* API:\n  * Fix: API returning empty data if a message was in the original data.\n  * Change: get_server_id command returns json instead of string.\n* Other:\n  * Fix: Forgot git pull when changing branches in the web UI.\n\n\n## v2.0.22 (2018-03-10)\n\n* Tautulli v2 release!\n\n\n## v2.0.22-beta (2018-03-09)\n\n* Notifications:\n  * Fix: Pushover notifications failing with priority 2 is set.\n  * Fix: Expanding selectize box for some notification agent settings.\n* Other:\n  * Fix: Update check failing when an update is available.\n  * Fix: Item count incorrect for photo libraries.\n\n\n## v2.0.21-beta (2018-03-04)\n\n* Monitoring:\n  * New: Identify if a stream is using Plex Relay.\n  * Change: Don't ping the Plex server if the websocket is disconnected.\n* Notifications:\n  * Fix: Pause/resume state not being sent correctly in some instances.\n* Other:\n  * New: Add Patreon donation method.\n  * Fix: Catch failure to send analytics.\n  * Fix: IP address connection lookup error when the country is missing.\n  * Change: Updated all init scripts to Tautulli.\n  * Change: Move database to tautulli.db.\n  * Change: Move logs to tautulli.log.\n  * Change: Move startup file to Tautulli.py.\n\n\n## v2.0.20-beta (2018-02-24)\n\n* Notifications:\n  * New: Add poster support for Pushover notifications.\n  * New: Add poster support for Pushbullet notifications.\n  * Fix: Incorrect Plex/Tautulli update notification parameter types.\n  * Change: Poster and text sent as a single message for Telegram.\n  * Change: Posters uploaded directly to Telegram without Imgur.\n* UI:\n  * New: Add \"Delete\" button to synced items table on user pages.\n  * Fix: Button spacing/positioning on mobile site.\n  * Fix: Music statistic cards not using the fallback thumbnail.\n  * Fix: Logo not showing up when using an SVG.\n  * Change: Graphs now respect the \"Group History\" setting.\n* API:\n  * New: Add grouping to graph API commands.\n* Other:\n  * New: Added Google Analytics to collect installation metrics.\n  * Fix: Reconnecting to the Plex server when server settings are not changed.\n\n\n## v2.0.19-beta (2018-02-16)\n\n* Monitoring:\n  * Fix: Connect to Plex Cloud server without keeping it awake.\n  * Fix: Reconnect to Plex Cloud server after the server wakes up from sleeping.\n* Notifications:\n  * Fix: Don't send Plex Server Up/Down notifications when Tautulli starts up.\n  * Change: Better handling of Watched notifications.\n* UI:\n  * New: Added Plex server selection dropdown in the settings.\n  * Fix: Libraries and Users tables not refreshing properly.\n  * Change: Updated the masked info shown to guests.\n  * Change: Check for updates without refreshing to the homepage.\n* API:\n  * New: Added update_check to the API.\n  * Fix: delete_media_info_cache not deleting the cache.\n  * Change: Document \"refresh\" parameter for get_library_media_info.\n* Other:\n  * Fix: Show the full changelog since v2 on a fresh install.\n\n\n## v2.0.18-beta (2018-02-12)\n\n* Notifications:\n  * Fix: Default text for Tautulli update notifications using the wrong parameter.\n  * Fix: Playback pause and resume notifications only triggering once.\n  * Change: Negative operators for custom conditions now use \"and\" instead of \"or\".\n* UI:\n  * New: Added button to delete the 3rd party lookup info from the info pages.\n  * Fix: Missing host info in the login logs when logging in using Firefox.\n  * Change: Cleaned up settings. Advanced settings are now hidden behind a toggle.\n* API:\n  * New: Updated API documentation for v2.\n* Other:\n  * Fix: DeprecationWarning when using HTTPS with self-signed certificates.\n  * Change: Deleting the Imgur poster URL also deletes the poster from Imgur (only available for new uploads).\n  * Change: GitHub repository moved to Tautulli/Tautulli. Old GitHub URLs will still work.\n\n\n## v2.0.17-beta (2018-02-03)\n\n* Notifications:\n  * Fix: Unable to use @ mentions tags for Discord and Slack.\n  * New: Added Zapier notification agent.\n* API:\n  * Fix: get_synced_items returning no results.\n  * Fix: get_library_media_info returning incorrect media type for photo albums.\n  * Fix: get_library_media_info not being able to sort by title.\n\n\n## v2.0.16-beta (2018-01-30)\n\n* Monitoring:\n  * Fix: Timestamp sometimes showing as \"0:60\" on the activity cards.\n  * Fix: Incorrect session information being shown for playback of synced content.\n  * Fix: Sessions not being stopped when \"Playback Stopped\" notifications were enabled.\n* UI:\n  * Fix: Stream resolution showing up as \"unknown\" on the graphs.\n  * New: Added user filter to the Synced Items table.\n* Other:\n  * New: Option to use the Plex server update channel when checking for updates.\n\n\n## v2.0.15-beta (2018-01-27)\n\n* Monitoring:\n  * Fix: Live TV sessions not being stopped in History.\n  * Fix: Stream location showing as \"unknown\" on the activity cards.\n  * New: Improved Live TV details on the activity cards.\n* Notifications:\n  * New: Added labels and collections to notification parameters.\n  * New: Added more server details to notification parameters.\n  * Change: Renamed \"PlexPy\" update notification parameters to \"Tautulli\".\n\n\n## v2.0.14-beta (2018-01-20)\n\n* Monitoring:\n  * Change: Added \"Cellular\" bandwidth to \"WAN\" in activity header.\n* Notifications:\n  * Fix: Plex Web URL for tracks now go to the album page.\n  * Fix: Recently added notifications being sent for the entire library when DVR EPG data was refreshed.\n  * Fix: Notifier settings not loading with an apostrophe in the custom condition values.\n  * Fix: Custom email addresses not being saved when closing the notifier settings.\n  * Change: Re-enabled Browser notifications.\n  * Change: Renamed \"PlexPy\" update notification parameters to \"Tautulli\".\n  * Change: Emails no longer automatically insert HTML line breaks.\n  * Change: \"Date\" header added to email notifications.\n* UI:\n  * Change: Show all changelogs since the previous version when updating.\n\n\n## v2.0.13-beta (2018-01-13)\n\n* Notifications:\n  * New: Added dropdown selection for email addresses of shared users.\n  * New: Added more notification options for Join.\n  * Change: Show \"OR\" between custom condition values.\n* Other:\n  * New: Use JSON Web Tokens for authentication. Login now works with SSO applications.\n  * New: Allow the Plex server admin to login as a Tautulli admin using their Plex.tv account.\n\n\n## v2.0.12-beta (2018-01-07)\n\n* Notifications:\n  * Fix: Incorrect Plex URL parameter value.\n  * Change: Custom condition logic is now optional. An implicit \"and\" is applied between all conditions if the logic is blank.\n* UI:\n  * New: Added separate required LAN/WAN bandwidth in the activity header.\n* API:\n  * Fix: Notify API command not sending notifications.\n\n\n## v2.0.11-beta (2018-01-05)\n\n* Notifications:\n  * Fix: Some notification parameters showing up blank.\n* UI:\n  * Fix: Stream data showing up as \"None\" for pre-v2 history.\n* Other:\n  * Fix: Ability to login using the hashed password.\n\n\n## v2.0.10-beta (2018-01-04)\n\n* Monitoring:\n  * Fix: HW transcoding indicator on activity cards incorrect after refreshing.\n* Notifications:\n  * Remove: Notification toggles from library and user settings. Use custom conditions to filter out notifications instead.\n* UI:\n  * Fix: Incorrect examples for some date format options. Also added a few missing date format options. (Thanks @Tommatheussen)\n\n\n## v2.0.9-beta (2018-01-03)\n\n* Notifications:\n  * Fix: Notifications failing due to incorrect season/episode number types.\n\n\n## v2.0.8-beta (2018-01-03)\n\n* Monitoring:\n  * Fix: Incorrect HW transcoding indicator on activity cards.\n  * Fix: Long product/player names hidden behind platform icon on activity cards.\n* Notifications:\n  * Fix: Notifications failing due to some missing notification parameters.\n\n\n## v2.0.7-beta (2018-01-01)\n\n* Monitoring:\n  * Fix: Incorrect LAN/WAN location on activity cards.\n  * Fix: Paused time not recording correctly.\n* Other:\n  * Fix: Failed to retrieve synced items when there are special characters in the title.\n\n\n## v2.0.6-beta (2017-12-31)\n\n* Monitoring:\n  * New: Beta Plex Cloud support.\n  * Fix: Update paused time while still paused.\n* UI:\n  * Fix: Stopped time showing as \"n/a\" on history table.\n\n\n## v2.0.5-beta (2017-12-31)\n\n* Monitoring:\n  * Fix: IPv6 addresses overflowing on the activity cards.\n* Notifications:\n  * Fix: Error sending Join notifications.\n* UI:\n  * New: Added total required bandwidth in the activity header.\n* Other:\n  * Fix: Failing to retrieve releases from GitHub.\n  * Fix: CherryPy SSL connection warning. (Thanks @felixbuenemann)\n  * Fix: Sanitize script output in logs.\n  * Change: Login sessions persists across server restarts.\n\n\n## v2.0.4-beta (2017-12-29)\n\n* Monitoring:\n  * Fix: Current activity cards duplicating on the homepage.\n* Notifications:\n  * Fix: Concurrent stream notifications being sent when there is an incorrect number of streams.\n* UI:\n  * New: Info pages for collections.\n  * New: Button to test Plex Web URL override.\n  * Fix: Library and User pages return to the correct tab when pressing back.\n\n\n## v2.0.3-beta (2017-12-25)\n\n* Monitoring:\n  * Fix: Missing sync ID error causing logging to crash.\n  * Fix: Incorrect optimized version title column name causing logging to crash.\n* Notifications:\n  * Fix: Report correct beta version for Tautulli update notifications.\n* UI:\n  * Fix: Missing CSS for stream info modal.\n\n\n## v2.0.2-beta (2017-12-24)\n\n* Monitoring:\n  * Fix: Websocket connection fails to start with existing streams when upgrading to v2.\n  * Fix: Long request URI for refreshing current activity on the homepage.\n  * Fix: Missing subtitle database columns.\n  * Fix: Details for synced and optimized versions reporting incorrectly.\n* Notifications:\n  * Fix: Recently added notifications sending for previously added items. It is now limited to past 24 hours only.\n  * Fix: Source video/audio/subtitle parameters showing up as blank.\n  * Change: Validate condition logic when saving a notification agent.\n* API:\n  * Change: API is enabled by default on new installs.\n* UI:\n  * New: Add logo svg files. (Thanks @Fish2)\n  * New: Updated stream info modal.\n  * Change: Media info tables sort by sort title instead of title.\n* Other:\n  * Fix: Updating library IDs message on libraries page.\n  * Fix: Wtched percentage settings not saving after restart.\n  * Remove: Video Preview Thumbnails setting no longer used.\n  * Change: Add back HTTP Proxy setting under the Web Interface settings tab.\n  * Change: \"Group Table and Watch Statistics History\" and \"Current Activity in History Tables\" enabled by default on new installs.\n\n\n## v2.0.1-beta (2017-12-19)\n\n* Monitoring:\n  * Fix: Missing video_height database column.\n* Notifications:\n  * Fix: Join API key.\n  * Change: Temporarily disable broken browser notifications.\n* UI:\n  * Fix: Incorrect fallback image for music watch statistics.\n\n\n## v2.0.0-beta (2017-12-18)\n\n* Monitoring:\n  * New: More detailed stream info including subtitles, bitrates, bandwidth, and quality profiles.\n  * New: Terminate sessions from the current activity (Plex Pass only).\n  * Change: Monitoring uses websockets only now.\n* Notifications:\n  * New: Completely new notification system.\n    * Allow adding multiple of the same notification agent and/or duplicating existing notification agents.\n    * Each notification agent has it's own notification triggers and notification text.\n    * Notification agents are stored in the database instead of the config file. Some notification configurations may have been lost in the transfer. Sorry.\n  * New: Discord notification agent.\n  * New: GroupMe notification agent.\n  * New: MQTT notification agent.\n  * New: More customizable info cards for Discord, Facebook, Hipchat, and Slack.\n  * New: Script notifications are configured individually per script with separate arguments for each notification action.\n  * New: Icon and duration options for Plex Home Theater and XBMC notifications.\n  * New: Notification for Tautulli updates.\n  * New: Added &lt;show&gt;, &lt;season&gt;, &lt;artist&gt;, and &lt;album&gt; notification exclusion tags.\n    * &lt;tv&gt; is renamed to &lt;episode&gt;, and &lt;music&gt; is renamed to &lt;track&gt;\n  * New: Preview notification text in the notifier settings.\n  * New: Properly group recently added notifications when adding a batch of media.\n    * The {season_num}, {episode_num}, and {track_num} parameters will be substituted with the range (e.g. 06-10)\n  * New: Option to group recently added notifications by show/artist or season/album.\n  * New: More detailed media info (video, audio, subtitle, file, etc.) notification options available.\n  * New: Added notification text modifiers to change case and slice lists.\n  * New: Custom notification conditions using parameters to filter notifications.\n  * New: Button to trigger manual recently added notifications from the info pages.\n  * New: Lookup TVMaze and TheMovieDatabase links.\n  * Remove: The shared Imgur client ID has been removed. Please enter your own client ID in the settings to continue uploading posters.\n  * Change: Notifications with a blank subject or body will no longer be sent at all.\n  * Change: Line breaks inserted automatically in Email notification text.\n  * Change: Notifications for season/episodes now use the season poster and album/track now use the album art.\n  * Change: The {action} parameter is no longer capitalized.\n  * Change: Notification success or failure added to notification logs.\n* API:\n  * New: Added check for Plex Media Server updates with the Tautulli API.\n  * New: Added show/artist and episode/track titles to the \"get_history\" API command.\n  * New: Added manual trigger for recently added notifications.\n  * Remove: Defunct API v1.\n  * Change: The \"notify\" API command now requires a notifier_id instead of an agent_id. The notifier ID can be found in the settings for each notification agent.\n  * Change: The returned json for the \"get_metadata\" API command is no longer nested under the \"metadata\" key.\n* UI:\n  * New: Updated current activity, watch statistics, and library statistics cards on the home page.\n  * New: Toggle stats and recently added categories directly on the homepage.\n  * New: Ability to delete synced items from the Synced Items page.\n  * New: Updated platform icons to a uniform style.\n  * Remove: Setting for number of top items for watch statistic cards.\n  * Change: Separate API and websocket logs.\n* Android Tautulli Remote App (beta):\n  * New: Download the Tautulli Remote app on Google Play!\n    * Link the app using a QR code in the Tautulli settings.\n  * New: Push notifications directly to the Tautulli Remote app.\n* Other:\n  * New: Option to update Tautulli automatically when an update is available.\n  * New: Option to switch the tracking git remote and branch.\n  * New: Option to change the path to your git environment variable.\n  * New: Option to use a HTTPS certificate chain.\n  * New: Option to override the Plex Web URL for click-through links.\n  * New: Separate watched percentage for movies, episodes, and tracks.\n  * New: Show changelog after updating Tautulli.\n  * New: Support for IPv6 geolocation lookup.\n  * New: Download the Tautulli configuration file or database from the settings.\n  * New: Log failed Tautulli login attempts.\n  * Fix: Modal popups not working on mobile Safari.\n  * Fix: Prevent password managers from autofilling the password in the settings.\n  * Fix: Unable to search with special characters.\n  * Remove: Some unused options have been removed from the settings page.\n  * Change: The database schema has been changed, and reverting back to PlexPy v1 will not work.\n  * Change: The dev branch has been depreciated. A master/beta/nightly system is used instead.\n\n  \n## v1.4.25 (2017-10-02)\n\n* Fix: Tab instead of spaces preventing startup.\n\n\n## v1.4.24 (2017-10-01)\n\n* Fix: New Plex Web urls. (Thanks @Joshua1337)\n* Fix: Fallback to the product name if the player title is blank.\n* New: Added no forking option to startup arguments. (Thanks @Vashypooh)\n\n\n## v1.4.23 (2017-09-30)\n\n* Fix: Playstation 4 platform name.\n* Fix: PlexWatch and Plexivity import.\n* Fix: Pushbullet authorization header.\n\n\n## v1.4.22 (2017-08-19)\n\n* Fix: Cleaning up of old config backups.\n* Fix: Temporary fix for incorrect source media info.\n\n\n## v1.4.21 (2017-07-01)\n\n* New: Updated donation methods.\n\n\n## v1.4.20 (2017-06-24)\n\n* New: Added platform image for the PlexTogether player.\n* Fix: Corrected math used to calculate human duration. (Thanks @senepa)\n* Fix: Sorting of 4k in media info tables.\n* Fix: Update file sizes when refreshing media info tables.\n* Fix: Support a custom port for Mattermost (Slack) notifications.\n\n\n## v1.4.19 (2017-05-31)\n\n* Fix: Video resolution not showing up for transcoded streams on PMS 1.7.x.\n\n\n## v1.4.18 (2017-04-22)\n\n* New: Added some new Arnold quotes. (Thanks @senepa)\n* Fix: Text wrapping in datatable footers.\n* Fix: API command get_apikey. (Thanks @Hellowlol)\n\n\n## v1.4.17 (2017-03-04)\n\n* New: Configurable month range for the Plays by month graph. (Thanks @Pbaboe)\n* New: Option to chanage the week to start on Monday for the the Plays by day of week graph. (Thanks @Pbaboe)\n* Fix: Invalid iOS icon file paths. (Thanks @demonbane)\n* Fix: Plex Web 3.0 URLs on info pages and notifications.\n* Fix: Update bitcoin donation link to Coinbase.\n* Fix: Update init scripts. (Thanks @ampsonic)\n\n\n## v1.4.16 (2016-11-25)\n\n* Fix: Websocket for new json response on PMS 1.3.0.\n* Fix: Update stream and transcoder tooltip percent.\n* Fix: Typo in the edit user modal.\n\n\n## v1.4.15 (2016-11-11)\n\n* New: Add stream and transcoder progress percent to the current activity tooltip.\n* Fix: Refreshing of images in the cache when authentication is disabled.\n* Fix: Plex.tv authentication with special characters in the username or password.\n* Fix: Line breaks in the info page summaries.\n* Fix: Redirect to the proper http root when restarting.\n* Fix: API result type and responses showing incorrectly. (Thanks @Hellowlol)\n* Change: Use https URL for app.plex.tv.\n* Change: Show API traceback errors in the browser with debugging enabled. (Thanks @Hellowlol)\n* Change: Increase table width on mobile devices and max width set to 1750px. (Thanks @XusBadia)\n\n\n## v1.4.14 (2016-10-12)\n\n* Fix: History logging locking up if media is removed from Plex before PlexPy can save the session.\n* Fix: Unable to save API key in the settings.\n* Fix: Some typos in the settings. (Thanks @Leafar3456)\n* Change: Disable script timeout by setting timeout to 0 seconds.\n\n\n## v1.4.13 (2016-10-08)\n\n* New: Option to set the number of days to keep PlexPy backups.\n* New: Option to add a supplementary url to Pushover notifications.\n* New: Option to set a timeout duration for script notifications.\n* New: Added flush temporary sessions button to extra settings for emergency use.\n* New: Added pms_image_proxy to the API.\n* Fix: Insanely long play durations being recorded when connection to the Plex server is lost.\n* Fix: Script notification output not being sent to the logger.\n* Fix: New libraries not being added to homepage automatically.\n* Fix: Success message shown incorrectly when sending a test notification.\n* Fix: PlexPy log level filter not working.\n* Fix: Admin username not shown in login logs.\n* Fix: FeatHub link in readme document.\n* Change: Posters disabled by default for all notification agents.\n* Change: Disable manual changing of the PlexPy API key.\n* Change: Force refresh the Plex.tv token when fetching a new token.\n* Change: Script notifications run in a new thread with the timeout setting.\n* Change: Watched percent moved to general settings.\n* Change: Use human readable file sizes to the media info tables. (Thanks @logaritmisk)\n* Change: Update pytz library.\n\n\n## v1.4.12 (2016-09-18)\n\n* Fix: PMS update check not working for MacOSX.\n* Fix: Square covers for music stats on homepage.\n* Fix: Card width on the homepage for iPhone 6/7 Plus. (Thanks @XusBadia)\n* Fix: Check for running PID when starting PlexPy. (Thanks @spolyack)\n* Fix: FreeBSD service script not stopping PlexPy properly.\n* Fix: Some web UI cleanup.\n* Change: GitHub repostitory moved.\n\n\n## v1.4.11 (2016-09-02)\n\n* Fix: PlexWatch and Plexivity import errors.\n* Fix: Searching in history datatables.\n* Fix: Notifications not sending for Local user.\n\n\n## v1.4.10 (2016-08-15)\n\n* Fix: Missing python ipaddress module preventing PlexPy from starting.\n\n\n## v1.4.9 (2016-08-14)\n\n* New: Option to include current activity in the history tables.\n* New: ISP lookup info in the IP address modal.\n* New: Option to disable web page previews for Telegram notifications.\n* Fix: Send correct JSON header for Slack/Mattermost notifications.\n* Fix: Twitter and Facebook test notifications incorrectly showing as \"failed\".\n* Fix: Current activity progress bars extending past 100%.\n* Fix: Typo in the setup wizard. (Thanks @wopian)\n* Fix: Update PMS server version before checking for a new update.\n* Change: Compare distro and build when checking for server updates.\n* Change: Nicer y-axis intervals when viewing \"Play Duration\" graphs.\n\n\n## v1.4.8 (2016-07-16)\n\n* New: Setting to specify PlexPy backup interval.\n* Fix: User Concurrent Streams Notifications by IP Address checkbox not working.\n* Fix: Substitute {update_version} in fallback PMS update notification text.\n* Fix: Check version for automatic IP logging setting.\n* Fix: Use library refresh interval.\n\n\n## v1.4.7 (2016-07-14)\n\n* New: Use MaxMind GeoLite2 for IP address lookup.\n  * Note: The GeoLite2 database must be installed from the settings page.\n* New: Check for Plex updates using plex.tv downloads instead of the server API.\n  * Note: Check for Plex updates has been disabled and must be re-enabled in the settings.\n* New: More notification options for Plex updates.\n* New: Notifications for concurrent streams by a single user.\n* New: Notifications for user streaming from a new device.\n* New: HipChat notification agent. (Thanks @aboron)\n* Fix: Username showing as blank when friendly name is blank.\n* Fix: Direct stream count wrong in the current activity header.\n* Fix: Current activity reporting direct stream when reducing the stream quality switches to transcoding.\n* Fix: Apostophe in an Arnold quote causing the shutdown/restart page to crash.\n* Fix: Disable refreshing posters in guest mode.\n* Fix: PlexWatch/Plexivity import unable to select the \"grouped\" database table.\n* Change: Updated Facebook notification instructions.\n* Change: Subject line optional for Join notifications.\n* Change: Line break between subject and body text instead of a colon for Facebook, Slack, Twitter, and Telegram.\n* Change: Allow Mattermost notifications using the Slack config.\n* Change: Better formatting for Slack poster notifications.\n* Change: Telegram only notifies once instead of twice when posters are enabled.\n* Change: Host Open Sans font locally instead of querying Google Fonts.\n\n\n## v1.4.6 (2016-06-11)\n\n* New: Added User and Library statistics to the API.\n* New: Ability to refresh individual poster images without clearing the entire cache. (Thanks @Hellowlol)\n* New: Added {added_date}, {updated_date}, and {last_viewed_date} to metadata notification options.\n* New: Log level filter for Plex logs. (Thanks @sanderploegsma)\n* New: Log level filter for PlexPy logs.\n* New: Button to download Plex logs directly from the web interface.\n* New: Advanced setting in the config file to change the number of Plex log lines retrieved.\n* Fix: FreeBSD and FreeNAS init scripts to reflect the path in the installation guide. (Thanks @nortron)\n* Fix: Monitoring crashing when failed to retrieve current activity.\n\n\n## v1.4.5 (2016-05-25)\n\n* Fix: PlexPy unable to start if failed to get shared libraries for a user.\n* Fix: Matching port number when retrieving the PMS url.\n* Fix: Extract mapped IPv4 address in Plexivity import.\n* Change: Revert back to internal url when retrieving PMS images.\n\n\n## v1.4.4 (2016-05-24)\n\n* Fix: Image queries crashing the PMS when playing clips from channels.\n* Fix: Plexivity import if IP address is missing.\n* Fix: Tooltips shown behind the datatable headers.\n* Fix: Current activity instances rendered in a random order causing them to jump around.\n\n\n## v1.4.3 (2016-05-22)\n\n* Fix: PlexPy not starting without any authentication method.\n\n\n## v1.4.2 (2016-05-22)\n\n* New: Option to use HTTP basic authentication instead of the HTML login form.\n* Fix: Unable to save settings when enabling the HTTP proxy setting.\n* Change: Match the PMS port when retrieving the PMS url.\n\n\n## v1.4.1 (2016-05-20)\n\n* New: HTTP Proxy checkbox in the settings. Enable this if using an SSL enabled reverse proxy in front of PlexPy.\n* Fix: Check for blank username/password on login.\n* Fix: Persist current activity artwork blur across refreshes when transcoding details are visible.\n* Fix: Send notifications to multiple XBMC/Plex Home Theater devices.\n* Fix: Reset PMS identifier when clicking verify server button in settings.\n* Fix: Crash when trying to group current activity session in database.\n* Fix: Check current activity returns sessions when refreshing.\n* Fix: Logs sorted out of order.\n* Fix: Resolution reported incorrectly in the stream info modal.\n* Fix: PlexPy crashing when hashing password in the config file.\n* Fix: CherryPy doubling the port number when accessing PlexPy locally with http_proxy enabled.\n* Change: Sort by most recent for ties in watch statistics.\n* Change: Refresh Join devices when changing the API key.\n* Change: Format the Join device IDs.\n* Change: Join notifications now sent with Python Requests module.\n* Change: Add paging for recently added in the API.\n\n\n## v1.4.0 (2016-05-15)\n\n* New: An HTML form login page with sessions support.\n* New: Guest access control for shared users using Plex.tv authentication.\n  * Enable the option in the settings and toggle guest access per user from Users > Edit mode.\n  * Guests can only view their own user data. Other user info is removed/masked.\n  * Guests can only view media from libraries that are shared with them (content rating and label filters are respected). Other libraries are removed/masked.\n  * All settings and admin controls are restricted from guests.\n  * All current activity on the server is shown, but with masked user/metadata info.\n* New: Login logs table on the User and Logs pages.\n* New: Filter the history table by user.\n* New: Filter the graphs by user. (Thanks @Otger)\n* New: Option to hash the admin passowrd in the config file.\n* New: Options to enable/disable/rearrange each section on the homepage\n* New: Toggle media types for recently added items on the homepage.\n* New: Option to enter an Imgur API client ID for uploading posters.\n  * Note: The shared Imgur client id will be removed in a future PlexPy update! Please enter your own client id in the settings to continue uploading posters!\n* New: HTML support for Email.\n* New: Posters and HTML support for Telegram.\n* New: Poster support for Slack.\n* New: Poster support for Twitter.\n* New: Re-added Plex Home Theater notification agent.\n* New: Browser notification agent (experimental).\n* New: Added {plex_url} as a notification option.\n* New: Added transcode decision to the activity header.\n* New: Documentation for APIv2 (see API.md for details).\n* New: Import a Plexivity database into PlexPy.\n* New: Prettier fallback image for art/episodes.\n* New: Prettier confirm modal dialogues.\n* New: Cache images to reduce Plex API calls. This can be disabled in the under Settings > Extra Settings. (Thanks @Hellowlol)\n* New: Scheduled backups of the config file.\n* New: Button to clear the PlexPy cache/images in the settings.\n* New: Button to manually backup the PlexPy database/config in the settings.\n* New: Button to clear the PlexPy logs in the settings.\n* New: Button to download PlexPy log file on the Logs tab.\n* New: Advanced setting in config file to change the Plex API timeout value.\n* Fix: Mixed content HTTP request in settings (for reverse proxies with SSL).\n* Fix: Rename recently \"watched\" music to \"played\".\n* Change: Current activity details now persists across refreshes.\n* Change: Smoother transitions between preview thumbnails in current activity.\n* Change: Datatables now display all columns and scroll horizontally on smaller screens.\n* Change: Ability to change the base URL for reverse proxies in the web interface.\n* Change: Added a \"Verify Server\" button in the settings.\n* Change: Added request status code in the logs for notifer errors.\n* Change: Remove in-memory logs and read lines from log file instead. (Thanks @Hellowlol)\n* Change: Limit number of failed attempts to write sessions to history. Default is 5 attempts.\n* Change: A bunch of UI updates.\n* Change: A bunch of backend code cleanup.\n* Removed: All unused Python packages.\n\n\n## v1.3.16 (2016-05-01)\n\n* Fix: Viewing photos crashing PlexPy.\n* Fix: Persist Users > Edit mode on datatable page change.\n* Fix: PMS update notifications broken.\n* Change: Cache notifications poster with thread ID to avoid overwritting images.\n\n\n## v1.3.15 (2016-04-18)\n\n* Fix: Slack notifications failing when using and icon URL.\n* Fix: 127.0.0.1 showing as an external IP address on the history tables.\n* Fix: Regression file sizes not shown in the media info table footer.\n* Fix: Retrieving proper PMS URL when multiple connections are published to plex.tv.\n* Fix: Some typos in the logger.\n* Fix: Some other typos in the WebUI. (Thanks @xtjoeytx)\n* Change: Optimized mobile web app icons and spash screens. (Thanks @alotufo)\n\n\n## v1.3.14 (2016-03-29)\n\n* Fix: Regression for missing notify_action for script notifications.\n* Fix: Typo for home stats cards in the settings.\n\n\n## v1.3.13 (2016-03-27)\n\n* Fix: Only mask strings longer than 5 characters in logs.\n\n\n## v1.3.12 (2016-03-27)\n\n* Fix: \"Check GitHub for updates\" not rescheduling when toggling setting.\n* Fix: Bug where notifications would fail if metadata is not found.\n* Fix: Bug where notifications would fail if unable to upload poster to Imgur.\n* Fix: PlexPy will now start properly for different Python environment variables.\n* New: Feature requests moved to FeatHub.\n* New: Ability to specify a GitHub API token for updates (optional).\n* New: Mask out sensitive information from the logs.\n* New: New and updated Arnold quotes. (Thanks @Vilsol & @Chrisophogus)\n* New: \"First\" and \"Last\" page buttons to datatables.\n* New: Access log file from the \"Help & Info\" page.\n* New: CherryPy environment options (for development). (Thanks @codedecay)\n* New: PlexPy development environment (for development only).\n* Change: Facebook posts with a posters now include a summary.\n* Change: Facebook posts now use a default poster if the poster is not found or unable to upload to Imgur.\n* Change: IFTTT events can be fromatted with the {action} name.\n* Change: Logs now use ISO date format to avoid locale encoding errors. (Thanks @alshain)\n* Remove: Non-functioning Plex notification agent.\n\n\n## v1.3.11 (2016-03-15)\n\n* Fix: Typo preventing history logging for websockets.\n\n\n## v1.3.10 (2016-03-12)\n\n* Fix: Actually allow HTML tags for Pushover.\n* Fix: PlexPy not restarting on Windows if there is a space in the folder path.\n* Fix: Reconnect websocket when changing PMS SSL setting.\n* Fix: Datatables not loading when view_offset or duration is blank.\n* Fix: Bug when checking the PMS version in the settings.\n* Fix: Auto-refreshing of log tables.\n* Fix: Logging of IPv6 addresses. (PMS version >0.9.14 only.)\n* Fix: Hide days selection from the Play Totals graph page.\n* Fix: PlexPy overwriting user's own SSL certificate/key.\n* Fix: Multiple watched notifications when using websocket.\n* Fix: Some missing python library imports.\n* Fix: Some typos in settings and PlexWatch importer.\n* New: Ability to get notified of PMS updates.\n* New: Ability to disable the link to Plex Web with Facebook notifications and use IMDB, TVDB, TMDb, or Last.fm instead.\n* New: Ability to reset Imgur poster url from the info page if the poster is changed.\n* New: Tooltips on the current activity progress bars.\n* New: Side scrolling of Recently Added/Recently Played items.\n* New: Document all date/time format options.\n* New: Button to clear notification logs.\n* New: Customizable backup, cache, and log directories.\n* Change: Retry writing sessions to history if it fails, so sessions don't get lost. (Activity pinger only, not availble for websocket.)\n* Change: Save any unknown sessions to the \"Local\" user.\n* Change: History table modal is filtered depending on which graph series is clicked.\n* Change: Revert back to saving the state of datatables (search, sorting, entries per page, etc.).\n* Change: Newlines are not longer stripped from notification text which allows for finer control of how notifications look.\n* Change: Updated FreeNAS/FreeBSD init scripts. (Must have updated jails.) (Thanks @chiviak)\n\n\n## v1.3.9 (2016-02-21)\n\n* Fix: Recently added notification not sent to all notification agents.\n* New: Pushover HTML support. (Thanks @elseym)\n\n\n## v1.3.8 (2016-02-21)\n\n* Fix: Regression unable to clear HTTP password.\n* Fix: Remove media tags from script arguments for server notifications.\n* Fix: Encode poster titles to UTF-8 for Imgur upload.\n* Fix: Allow notifications to send without poster if Imgur upload fails.\n* New: Notification Logs table in the Logs tab.\n* New: Toggle in settings to enable posters in notifications. (Disabled by default.)\n* Change: Save Imgur poster URL to database so upload is not needed every time.\n* Change: Notify log in database to log each event as a separate entry.\n* Change: Monitor remote access is unchecked if remote access is disabled on server.\n\n\n## v1.3.7 (2016-02-20)\n\n* Fix: Verifying server with SSL enabled.\n* Fix: Regression where {stream_duration} reported as 0.\n* Fix: Video metadata flags showing up for track info.\n* Fix: Custom library icons not applied to Library Statistics.\n* Fix: Typos in the Web UI.\n* New: ETA to Current Activity overlay.\n* New: Total duration to Libraries and Users tables.\n* New: {machine_id} to notification options.\n* New: IMDB, TVDB, TMDb, Last.fm, and Trackt IDs/URLs to notification options.\n* New: {poster_url} to notification options using Imgur.\n* New: Poster and link for Facebook notifications.\n* New: Log javascript errors from the Web UI.\n* New: Configuration and Scheduler info to the settings page.\n* New: Schedule background task to backup the PlexPy database.\n* New: URL anonymizer for external links.\n* New: Plex Media Scanner log file to Log viewer.\n* New: API v2 (sill very experimental). (Thanks @Hellowlol)\n* Change: Allow secure websocket connections.\n* Change: History grouping now accounts for the view offset.\n* Change: Subject line can be toggled off for Facebook, Slack, Telegram, and Twitter.\n* Change: Create self-signed SSL certificates when enabling HTTPS.\n* Change: Revert homepage \"Last Played\" to \"Last Watched\".\n* Change: Disable monitor remote access checkbox if remote access is not enabled on the PMS.\n* Change: Disable IP logging checkbox if PMS version is 0.9.14 or greater.\n\n\n## v1.3.6 (2016-02-03)\n\n* Fix: Regression where {duration} not reported in minutes.\n* Fix: Proper daemonizing in FreeBSD and FreeNAS init scripts.\n* Change: Update readme documentation.\n\n\n## v1.3.5 (2016-02-02)\n\n* Fix: Removing unique constraints from database.\n* Fix: Unable to expand media info table when missing \"Added At\" date.\n* Fix: Server verification for unpublished servers.\n* Fix: Updating PMS identifier for server change.\n* New: {stream_time}, {remaining_time}, and {progress_time} to notification options.\n* New: Powershell script support. (Thanks @Hellowlol)\n* New: Method to delete duplicate libraries.\n* Change: Daemonize before running start up tasks.\n\n\n## v1.3.4 (2016-01-29)\n\n* Fix: Activity checker not starting with library update (history not logging).\n* Fix: Libraries duplicated in database.\n* Fix: Buffer notifications even when disabled when using websockets.\n* Fix: Libraries and Users lists not refreshing.\n* Fix: Server verification in settings.\n* Fix: Empty libraries not added to database.\n* New: Unique identifiers to notification options.\n* Remove: Requirement of media type toggles for recently added notifications.\n* Remove: Built in Twitter key and secret.\n* Change: Unnecessary quoting of script arguments.\n* Change: Facebook notification instructions.\n\n\n## v1.3.3 (2016-01-26)\n\n* Fix: Plays by Month graph not loading.\n* Change: Disable caching for datatables.\n* Change: Improved updating library data in the database again.\n\n\n## v1.3.2 (2016-01-24)\n\n* Fix: 'datestamp' and 'timestamp' for server notifications.\n* Change: New method for updating library data in database.\n\n\n## v1.3.1 (2016-01-23)\n\n* Fix: Notifiers authorization popups for reverse proxies.\n* Fix: Empty brackets in titles on tables.\n* Fix: Star rating overlapping text.\n* Fix: Unable to startup when library refresh fails.\n* Fix: Unable to parse 'datestamp' and 'timestamp' format.\n* Change: Rename \"Last Watched\" to \"Last Played\".\n* Change: More descriptive libraries updating message.\n\n\n## v1.3.0 (2016-01-23)\n\n* New: Brand new Libraries section.\n* New: Lots of new library statistics.\n* New: Media info table for libraries.\n* New: Web app for Android and iOS. (Thanks @zobe123)\n* New: Slack notification agent. (Thanks @richipargo)\n* New: Facebook notification agent.\n* New: Custom script notification agent. (Thanks @Hellowlol)\n* New: Custom \"From Name\" to email notification agent.\n* New: Ability to test notifications / send custom one-off notifications.\n* New: 'datestamp' and 'timestamp' notification options.\n* New: More concurrent stream statistics.\n* New: Media info flags on the info pages.\n* New: Ability to fix broken metadata if the item has been moved in Plex.\n* New: Ability to rearrange the homepage statistics cards.\n* New: CentOS startup script (Thanks @PHoSawyer)\n* Fix: Server name blank after first run wizard.\n* Fix: Incorrect duration for grouped home stats.\n* Fix: Allow SSL when verifying server in settings.\n* Fix: Metadata for grouped recently added notifications.\n* Fix: Unable to access settings with missing changelog file.\n* Fix: Month name localization on play totals graphs.\n* Fix: Get new PMS identifier when changing servers.\n* Fix: Websocket log spam when there is no active session.\n* Fix: Logs and cache folder not created in the data directory.\n* Fix: Title links on sync table.\n* Fix: Other various minor bugs and graphical glitches.\n* Change: Prettier thumbnail popovers on tables.\n* Change: Star ratings to use css/font-awesome.\n* Change: More detailed logging info to warnings and errors.\n* Change: Better PlexPy process restart handling (Thanks @jackwilsdon)\n* Change: Massive behind the scenes code cleanup.\n* Remove: Built in Pushover API token (User's own API token is now required).\n\n\n## v1.2.16 (2015-12-22)\n\n* Fix Most Concurrent stream stat for emtpy databases\n* Change logs to 50 lines by default\n\n\n## v1.2.15 (2015-12-20)\n\n* Fix navbar covering current activity on smaller screens.\n* Fix metadata for grouped recently added notifications.\n* Fix Growl notification agent not working.\n* Change graph days selection.\n* Change watch statistics to match table history grouping.\n* Add automatic discovery of Pushbullet devices.\n* Add Most Concurrent Streams watch statistic.\n* Add precentage to current activity progress bars.\n* Add a bunch of stream details to notification options.\n* Add notification for Plex Remote Access/Plex Media Server back up.\n* Add CC/BCC and multiple recipients to email notification agent.\n* Add total watch time to history table footer.\n\n\n## v1.2.14 (2015-12-07)\n\n* Fix regression with PlexWatch db importer and buffer warnings.\n\n\n## v1.2.13 (2015-12-06)\n\n* Fix match newlines between tags in notification text.\n* Fix current activity not showing on PMS 0.9.12.\n\n\n## v1.2.12 (2015-12-06)\n\n* Fix for \"too many open files\" error.\n\n\n## v1.2.11 (2015-12-06)\n\n* Fix more regressions (sorry).\n\n\n## v1.2.10 (2015-12-06)\n\n* Fix broken count graphs regression.\n\n\n## v1.2.9 (2015-12-06)\n\n* Fix and improve text sanitization.\n\n\n## v1.2.8 (2015-12-06)\n\n* Fix sanitize player names\n* Fix recently added notification delay\n* Fix recently added metadata queries\n* Fix multiple lines in notification body text\n* Fix UTF-8 encoding in Prowl notifications subject line\n* Change to only log IPv4 addresses\n* Add global toggle for recently added notifcations\n* Add feature to delete users\n* Add channel support for Telegram notification agent\n* Add icon for Apple tvOS\n* Add icon for Microsoft Edge\n\n\n## v1.2.7 (2015-11-27)\n\n* Fix IP address option in notifications\n\n\n## v1.2.6 (2015-11-27)\n\n* Fixes for IP logging in PMS < 0.9.14.x.\n* Fix issue in plexWatch importer when trying to import item with no ratingKey.\n\n\n## v1.2.5 (2015-11-25)\n\n* Add video_decision and audio_decision to notification options\n* Fix IP address logging\n* Fix log spam if notifications disabled \n\n\n## v1.2.4 (2015-11-24)\n\n* Add filtering by media type in the history table\n* Add IFTTT notification agent\n* Add Telegram notification agent\n* Add notifications for recently added media\n* Add notifications for server down and remote access down\n* Add more metadata to notifications options\n* Add IP address to notification options (for PMS 0.9.14 and above)\n* Add server uptime to notification options\n* Add IP address to current activity\n* Add IPv6 address logging\n* Add PMS server name to the page title\n* Fix bug in \"Last Watched\" statistic\n* Fix bug in search query\n* Fix bug on user pages for usernames with single quotes\n* Fix name for new Plex Media Center\n* Fix Pushover notifications with unicode characters\n* Fix bug with showing old usernames in datatables\n* Fix bug with \"Please verify your server\" in settings\n* Change IP lookup provider\n* Change notifications custom body text to larger text box\n* Change movie/tv logging and notifications into individual options\n\n\n## v1.2.3 (2015-10-18)\n\n* Added \"remaining time\" as notification substitution.\n* Fix bug on home stats cards.\n* Fix visual bug on user page.\n\n\n## v1.2.2 (2015-10-12)\n\n* Add server discovery on first run.\n* Add column to tables for Platform.\n* Add link to top level breadcrumbs on info pages.\n* Add ability to change notification sounds for Pushover and Boxcar.\n* Show watched percentage tooltip on progress column in history tables. \n* More logging in event an http request fails.\n* Code cleanups and other fixes.\n* Fix ordering on sync table.\n* Fix bug on home stats cards.\n* Fix bug on activity pane where music details were not shown.\n\n\n## v1.2.1 (2015-09-29)\n\n* Fix for possible issue when paused_counter is null.\n\n\n## v1.2.0 (2015-09-29)\n\n* Added option to group consecutive plays in the history tables.\n* Added option for websocket monitoring (still slightly experimental and disabled by default).\n* Added global search option (searches your Plex library).\n* Added option to update any items that may have had their rating keys changed.\n* Added option to disable consecutive notifications. \n* Some visual tweaks and fixes.\n* Fix bug where monitoring wouldn't start up after first run.\n* Fix bug showing incorrect transcode decisions for music tracks on history tables.\n\n\n## v1.1.10 (2015-09-20)\n\n* Added dedicated settings section for home stats configuration with ability to show/hide selected stats and sections.\n* Added support for Twitter notifications.\n* Only show music in graphs if music logging is enabled.\n* The monitoring ignore interval now excludes paused time. \n* Fix display bug on activity panel which incorrectly reported transcoding sometimes.\n* Fix bug with Email notification TLS checkbox when it would be disabled by changing any other settings afterwards.\n* Fix issue on some Python releases where the webbrowser library isn't included.\n\n\n## v1.1.9 (2015-09-14)\n\n* Another JonnyWong release. I'm going to stop thanking you now ;)\n* Add music plays to graphs.\n* Add info pages for music items.\n* Add music to user recently watched items.\n* Add photo views to Activity pane (photos are not logged).\n* Fix token validation message on Settings page.\n* Fix some \"Mystery\" platform names.\n* Fix paused time be counted for graph data.\n* Other small bug fixes.\n\n\n## v1.1.8 (2015-09-09)\n\n* Add platform images for Windows devices. Thanks @JonnyWong.\n* Add click-through to PlexWeb preplay page from info page. Thanks @JonnyWong. \n* Fix broken delete option on info pages. Thanks @JonnyWong.\n* Fix tagline bug in PlexWatch db import tool.\n* Fix home stats text overflow bug. Thanks @JonnyWong.\n\n\n## v1.1.7 (2015-09-07)\n\n* Show tagline in info screens for movies. Thanks @JonnyWong.\n* Add play/pause/buffer icon to activity pane. Thanks @JonnyWong.\n* Add transcoder info in activity pane info. Thanks @JonnyWong.\n* Show transcoder progress on activity progress bar. Thanks @JonnyWong.\n* Fix bug where custom notification strings would be ignored if unicode characters were present.\n* Fix text overflow issue on home stats cards. Thanks @JonnyWong.\n* Fix regression with user friendly name change input in edit screen. Thanks @JonnyWong.\n\n\n## v1.1.6 (2015-09-06)\n\n* Home stats cards are now expandable to show multiple items. Configurable in settings. Thanks @JonnyWong.\n* Completely redesigned media info pages. Thanks @JonnyWong.\n* Redesigned activity pane to match Plex Web more closely. Thanks @JonnyWong.\n* New Library stats on home page, shows total item counts per library. Thanks @JonnyWong.\n* New last watched card in home stats. Shows last watched items. Thanks @JonnyWong.\n* Improved some layout issues on mobile devices. Thanks @JonnyWong.\n* Fixed issue where some clip/channel items are reported as episodes and causing exceptions.\n* Many styling improvements and fixes. Thanks @JonnyWong.\n* Fixed incorrect sort on home stats platform count by duration. Thanks @JonnyWong.\n* Fix issue where user refresh would continually be called as \"Local\" user didn't exist in database.\n* Fixed styling on graph stream modal. Thanks @JonnyWong.\n* Fixed some issues with users page editing. Thanks @JonnyWong.\n* Fix error page when clicking through to an item that no longer exists.\n\n\n## v1.1.5 (2015-08-27)\n\n* Fix git tag being one release behind.\n\n\n## v1.1.4 (2015-08-26)\n\n* User info is now editable from the users table. Thanks @JonnyWong.\n* Improved delete mode for history pages - able to multi-select now. Thanks @JonnyWong.\n* Improved image quality on tooltip images.\n* More styling improvements and fixes on user and info pages. Thanks @JonnyWong.\n* Added some user submitted systemd init scripts. Thanks @malle-pietje and @artbird309.\n* Fixed some background operations when saving settings.\n* Fix max width restricting home stats to 1600px.\n* Fix stream duration parameter for notifications when paused counter is null.\n\n\n## v1.1.3 (2015-08-22)\n\n* Show human readable version info and this cool changelog in Settings -> General.\n* Add a \"delete\" mode to the history tables. Toggle it to show a delete button next to each history item.\n* Two digit season and episode numbers for custom notification messages. Thanks @JonnyWong.\n* New FreeNAS init script. Thanks @JonnyWong.\n* Lots of styling improvements! Thanks @JonnyWong.\n* Graph page remembers last selected options. Thanks @JonnyWong.\n* New Popular movie homepage stats. Thanks @JonnyWong.\n* Add option for duration vs play count on home stats. (Settings -> Extra Settings). Thanks @JonnyWong.\n* Clean up media info pages. Don't show metadata that is missing. Thanks @JonnyWong.\n* Add clear button to search inputs. Thanks @JonnyWong.\n* New columns on Users list. Thanks @JonnyWong.\n* New stream duration option for custom notification messages. Thanks @JonnyWong.\n* Rad new tooltips on the history pages. Thanks @JonnyWong.\n* And a lot of small visual changes and fixes. Thanks @JonnyWong.\n* Fixed IP address modal on user history page.\n* Fixed \"invalid date\" showing on monthly plays graph.\n\n## v1.1.2 (2015-08-16)\n\n* Fix bug where user refresh would fail under certain circumstances.\n\n## v1.1.1 (2015-08-15)\n\n* Added Most watched movie for home stats. Thanks @jroyal.\n* Added TV show title to recently added text. Thanks @jroyal.\n* Fix bug with buffer warnings where notification would trigger continuously after first trigger.\n* Fix bug where custom avatar URL would get reset on every user refresh.\n\n## v1.1.0 (2015-08-15)\n\n* Add option to disable all history logging per user.\n* Add option to change user avatar URL. Thanks @jroyal.\n* Show all users on users table even if they don't yet have history.\n* Add option to change time frame of statistics on home page (Settings -> Extra Settings). Thanks @jroyal.\n* Add 7 day period for graphs. Thanks @jroyal.\n* Add pause, resume and buffer warning notification options.\n* Add fine tuning settings for buffer warning triggers.\n* Fix issue with SSL cert verification bypass when method doesn't exist (depends on Python version).\n* Fix bug on home stats which wouldn't update unless a TV show was first logged.\n* Fix alignment of bands on daily graphs which highlight weekends.\n* Fix behaviour of close button on update popup, will now stay closed for an hour after clicking close.\n* Fix some styling niggles.\n\n## v1.0.1 (2015-08-13)\n\n* Allow SSL certificate check override for certain systems with bad CA stores.\n* Fix typo on graphs page causing date selection to break on Safari.\n\n## v1.0 (2015-08-11)\n\n* First release"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.5029296875,
          "content": "# Contributing to Tautulli\n\n## Pull Requests\nIf you think you can contribute code to the Tautulli repository, do not hesitate to submit a pull request.\n\n### Branches\nAll pull requests should be based on the `nightly` branch, to minimize cross merges. When you want to develop a new feature, clone the repository with `git clone origin/nightly -b FEATURE_NAME`. Use meaningful commit messages.\n\n### Python Code\n\n#### Compatibility\nThe code should work with Python 3.8+. Note that Tautulli runs on many different platforms.\n\nRe-use existing code. Do not hesitate to add logging in your code. You can the logger module `plexpy.logger.*` for this. Web requests are invoked via `plexpy.request.*` and derived ones. Use these methods to automatically add proper and meaningful error handling.\n\n#### Code conventions\nAlthough Tautulli did not adopt a code convention in the past, we try to follow [PEP8](http://legacy.python.org/dev/peps/pep-0008/) conventions for future code. A short summary to remind you (copied from http://wiki.ros.org/PyStyleGuide):\n\n * 4 space indentation\n * 80 characters per line\n * `package_name`\n * `ClassName`\n * `method_name`\n * `field_name`\n * `_private_something`\n * `self.__really_private_field`\n * `_global`\n\n#### Documentation\nDocument your code. Use docstrings See [PEP-257](https://www.python.org/dev/peps/pep-0257/) for more information.\n\n### HTML/Template code\n\n#### Compatibility\nHTML5 compatible browsers are targeted.\n\n#### Conventions\n* 4 space indentation\n* `methodName`\n* `variableName`\n* `ClassName`\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.6240234375,
          "content": "FROM ghcr.io/tautulli/tautulli-baseimage:python3\n\nLABEL maintainer=\"Tautulli\"\n\nARG BRANCH\nARG COMMIT\n\nENV TAUTULLI_DOCKER=True\nENV TZ=UTC\n\nWORKDIR /app\nCOPY . /app\nRUN \\\n  groupadd -g 1000 tautulli && \\\n  useradd -u 1000 -g 1000 tautulli && \\\n  echo ${BRANCH} > /app/branch.txt && \\\n  echo ${COMMIT} > /app/version.txt\n\nRUN \\\n  mkdir /config && \\\n  touch /config/DOCKER\nVOLUME /config\n\nCMD [ \"python\", \"Tautulli.py\", \"--datadir\", \"/config\" ]\nENTRYPOINT [ \"./start.sh\" ]\n\nEXPOSE 8181\nHEALTHCHECK --start-period=90s CMD curl -ILfSs http://localhost:8181/status > /dev/null || curl -ILfkSs https://localhost:8181/status > /dev/null || exit 1\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 34.3232421875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    <program>  Copyright (C) <year>  <name of author>\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "PlexPy.py",
          "type": "blob",
          "size": 0.79296875,
          "content": "#!/usr/bin/env python\n\n# -*- coding: utf-8 -*-\n\n# This file is part of Tautulli.\n#\n#  Tautulli is free software: you can redistribute it and/or modify\n#  it under the terms of the GNU General Public License as published by\n#  the Free Software Foundation, either version 3 of the License, or\n#  (at your option) any later version.\n#\n#  Tautulli is distributed in the hope that it will be useful,\n#  but WITHOUT ANY WARRANTY; without even the implied warranty of\n#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n#  GNU General Public License for more details.\n#\n#  You should have received a copy of the GNU General Public License\n#  along with Tautulli.  If not, see <http://www.gnu.org/licenses/>.\n\nfrom Tautulli import main\n\n# Call main() from Tautulli.py\nif __name__ == \"__main__\":\n    main()\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.7919921875,
          "content": "# Tautulli\n\nA python based web application for monitoring, analytics and notifications for \n[Plex Media Server](https://plex.tv).\n\nThis project is based on code from [Headphones](https://github.com/rembo10/headphones)\nand [PlexWatchWeb](https://github.com/ecleese/plexWatchWeb).\n\n## Features\n\n-   Responsive web design viewable on desktop, tablet and mobile web browsers.\n-   Themed to complement Plex/Web.\n-   Easy configuration setup (no separate web server required).\n-   Monitor current Plex Media Server activity.\n-   Fully customizable notifications for stream activity and recently added media.\n-   Top statistics on home page with configurable duration and measurement metric.\n-   Global watching history with search/filtering & dynamic column sorting.\n-   Full user list with general information and comparison stats.\n-   Individual user information including devices IP addresses.\n-   Complete library statistics and media file information.\n-   Rich analytics presented using Highcharts graphing.\n-   Beautiful content information pages.\n-   Full sync list data on all users syncing items from your library.\n-   And many more!!\n\n## Preview\n\n[Full preview gallery available on our website][Tautulli]\n\n![Tautulli Homepage](https://tautulli.com/images/screenshots/activity-compressed.jpg?v=2)\n\n## Installation\n\n[![Python][badge-python]][Python]\n[![Docker Pulls][badge-docker-pulls]][DockerHub]\n[![Docker Stars][badge-docker-stars]][DockerHub]\n[![Downloads][badge-downloads]][Releases Latest]\n\n[badge-python]: https://img.shields.io/badge/python->=3.9-blue?style=flat-square\n[badge-docker-pulls]: https://img.shields.io/docker/pulls/tautulli/tautulli?style=flat-square\n[badge-docker-stars]: https://img.shields.io/docker/stars/tautulli/tautulli?style=flat-square\n[badge-downloads]: https://img.shields.io/github/downloads/Tautulli/Tautulli/total?style=flat-square\n\n| Status | Branch: `master` | Branch: `beta` | Branch: `nightly` |\n| --- | --- | --- | --- |\n| Release   | [![Release@master][badge-release-master]][Releases Latest] <br> [![Release Date@master][badge-release-master-date]][Releases Latest] | [![Release@beta][badge-release-beta]][Releases] <br> [![Commits@beta][badge-release-beta-commits]][Commits Beta] | [![Last Commits@nightly][badge-release-nightly-last-commit]][commits Nightly] <br> [![Commits@nightly][badge-release-nightly-commits]][Commits Nightly] |\n| Docker    | [![Docker@master][badge-docker-master]][DockerHub] <br> [![Docker Build@master][badge-docker-master-ci]][Publish Docker Master] | [![Docker@beta][badge-docker-beta]][DockerHub] <br> [![Docker Build@beta][badge-docker-beta-ci]][Publish Docker Beta] | [![Docker@nightly][badge-docker-nightly]][DockerHub] <br> [![Docker Build@nightly][badge-docker-nightly-ci]][Publish Docker Nightly] |\n| Snap      | [![Snap@master][badge-snap-master]][Snapcraft] <br> [![Snap Build@master][badge-snap-master-ci]][Publish Snap Master] | [![Snap@beta][badge-snap-beta]][Snapcraft] <br> [![Snap Build@beta][badge-snap-beta-ci]][Publish Snap Beta] | [![Snap@nightly][badge-snap-nightly]][Snapcraft] <br> [![Snap Build@nightly][badge-snap-nightly-ci]][Publish Snap Nightly] |\n| Installer | [![Windows@master][badge-installer-master-win]][Releases Latest] <br> [![MacOS@master][badge-installer-master-macos]][Releases Latest] <br> [![Installer Build@master][badge-installer-master-ci]][Publish Installer Master] | [![Windows@beta][badge-installer-beta-win]][Releases] <br> [![MacOS@beta][badge-installer-beta-macos]][Releases] <br> [![Installer Build@beta][badge-installer-beta-ci]][Publish Installer Beta] | [![Installer Build@nightly][badge-installer-nightly-ci]][Publish Installer Nightly] |\n\nRead the [Installation Guides][Installation] for instructions on how to install Tautulli.\n\n[badge-release-master]: https://img.shields.io/github/v/release/Tautulli/Tautulli?style=flat-square\n[badge-release-master-date]: https://img.shields.io/github/release-date/Tautulli/Tautulli?style=flat-square&color=blue\n[badge-release-beta]: https://img.shields.io/github/v/release/Tautulli/Tautulli?include_prereleases&style=flat-square\n[badge-release-beta-commits]: https://img.shields.io/github/commits-since/Tautulli/Tautulli/latest/beta?style=flat-square&color=blue\n[badge-release-nightly-last-commit]: https://img.shields.io/github/last-commit/Tautulli/Tautulli/nightly?style=flat-square&color=blue\n[badge-release-nightly-commits]: https://img.shields.io/github/commits-since/Tautulli/Tautulli/latest/nightly?style=flat-square&color=blue\n[badge-docker-master]: https://img.shields.io/badge/docker-latest-blue?style=flat-square\n[badge-docker-master-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-docker.yml?style=flat-square&branch=master\n[badge-docker-beta]: https://img.shields.io/badge/docker-beta-blue?style=flat-square\n[badge-docker-beta-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-docker.yml?style=flat-square&branch=beta\n[badge-docker-nightly]: https://img.shields.io/badge/docker-nightly-blue?style=flat-square\n[badge-docker-nightly-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-docker.yml?style=flat-square&branch=nightly\n[badge-snap-master]: https://img.shields.io/badge/snap-stable-blue?style=flat-square\n[badge-snap-master-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-snap.yml?style=flat-square&branch=master\n[badge-snap-beta]: https://img.shields.io/badge/snap-beta-blue?style=flat-square\n[badge-snap-beta-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-snap.yml?style=flat-square&branch=beta\n[badge-snap-nightly]: https://img.shields.io/badge/snap-edge-blue?style=flat-square\n[badge-snap-nightly-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-snap.yml?style=flat-square&branch=nightly\n[badge-installer-master-win]: https://img.shields.io/github/v/release/Tautulli/Tautulli?label=windows&style=flat-square\n[badge-installer-master-macos]: https://img.shields.io/github/v/release/Tautulli/Tautulli?label=macos&style=flat-square\n[badge-installer-master-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-installers.yml?style=flat-square&branch=master\n[badge-installer-beta-win]: https://img.shields.io/github/v/release/Tautulli/Tautulli?label=windows&include_prereleases&style=flat-square\n[badge-installer-beta-macos]: https://img.shields.io/github/v/release/Tautulli/Tautulli?label=macos&include_prereleases&style=flat-square\n[badge-installer-beta-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-installers.yml?style=flat-square&branch=beta\n[badge-installer-nightly-ci]: https://img.shields.io/github/actions/workflow/status/Tautulli/Tautulli/.github/workflows/publish-installers.yml?style=flat-square&branch=nightly\n\n## Support\n\n[![Wiki][badge-wiki]][Wiki]\n[![Discord][badge-discord]][Discord]\n[![Reddit][badge-reddit]][Reddit]\n[![Plex Forums][badge-forums]][Plex Forums]\n[![Issues][badge-issues]][Issues]\n\n[badge-wiki]: https://img.shields.io/badge/github-wiki-black?style=flat-square\n[badge-discord]: https://img.shields.io/discord/183396325142822912?label=discord&style=flat-square&color=7289DA\n[badge-reddit]: https://img.shields.io/reddit/subreddit-subscribers/tautulli?label=reddit&style=flat-square&color=FF5700\n[badge-forums]: https://img.shields.io/badge/plex%20forums-discussion-E5A00D?style=flat-square\n[badge-issues]: https://img.shields.io/badge/github-issues-black?style=flat-square\n\nIf you think you've found a bug in Tautulli make sure you have read the [FAQ][]\nfirst to make sure it hasn't been covered by one of the questions there. If your\nproblem isn't answered in the FAQ try the following first:\n\n-   Update to the latest version of Tautulli.\n-   Turning your device off and on again.\n-   Analyzing your logs, you just might find the solution yourself!\n-   Using the **search** function to see if this issue has already been reported/solved.\n-   Checking the [Wiki][] for [Installation][] instructions and reading the [FAQs][FAQ].\n-   For basic questions try asking on [Discord][], [Reddit][], \n    or the [Plex Forums][] first before opening an issue.\n\n**If nothing has worked:**\n\n1.  Please check the [issues tracker][Issues] to see if someone else has already reported the bug.\n2.  If this is a new bug, open a [bug report][Issue New] on the issues tracker.\n3.  Provide a clear title to easily help identify your problem.\n4.  Use proper [Markdown syntax][] to structure your post (i.e. code/log in code blocks).\n5.  Make sure to fill out the required information on the issue template.\n6.  Close your issue when it's solved! If you found the solution yourself please\n    comment so that others benefit from it.\n\n## Feature Requests\n\n1.  Pleases check the [issues tracker][Issues] to see if someone else has already requested the feature.\n    If a similar idea has already been requested, _give it a thumbs up_. **Do not comment\n    with `+1` or something similar as it creates unnecessary spam.**\n2.  If this is a new feature request, open a [feature request][Issue New] on the issues tracker.\n\n## License\n\n[![License][badge-license]][License]\n\n[badge-license]: https://img.shields.io/github/license/Tautulli/Tautulli?style=flat-square\n\nThis is free software under the GPL v3 open source license. Feel free to do with it what you wish,\nbut any modification must be open sourced. A copy of the license is included.\n\nThis software includes Highsoft software libraries which you may freely distribute for \nnon-commercial use. Commerical users must licence this software, for more information visit\nhttps://shop.highsoft.com/faq/non-commercial#non-commercial-redistribution.\n\n\n[Python]: https://python.org/downloads\n[DockerHub]: https://hub.docker.com/r/tautulli/tautulli\n[Releases]: https://github.com/Tautulli/Tautulli/releases\n[Releases Latest]: https://github.com/Tautulli/Tautulli/releases/latest\n[License]: https://github.com/Tautulli/Tautulli/blob/master/LICENSE\n[FAQ]: https://github.com/Tautulli/Tautulli/wiki/Frequently-Asked-Questions\n[Installation]: https://github.com/Tautulli/Tautulli/wiki/Installation\n[Issues]: https://github.com/Tautulli/Tautulli/issues\n[Issue New]: https://github.com/Tautulli/Tautulli/issues/new/choose\n[Markdown syntax]: https://help.github.com/articles/github-flavored-markdown\n[Tautulli]: http://tautulli.com\n[Wiki]: https://github.com/Tautulli/Tautulli/wiki\n[Discord]: https://tautulli.com/discord\n[Reddit]: https://reddit.com/r/Tautulli\n[Plex Forums]: https://forums.plex.tv/t/tautulli-monitor-your-plex-media-server/225242\n[Snapcraft]: https://snapcraft.io/tautulli\n[Commits Beta]: https://github.com/Tautulli/Tautulli/commits/beta\n[Commits Nightly]: https://github.com/Tautulli/Tautulli/commits/nightly\n\n[Publish Docker Master]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Docker\"+branch%3Amaster\n[Publish Docker Beta]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Docker\"+branch%3Abeta\n[Publish Docker Nightly]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Docker\"+branch%3Anightly\n[Publish Snap Master]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Snap\"+branch%3Amaster\n[Publish Snap Beta]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Snap\"+branch%3Abeta\n[Publish Snap Nightly]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Snap\"+branch%3Anightly\n[Publish Installer Master]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Installers\"+branch%3Amaster\n[Publish Installer Beta]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Installers\"+branch%3Abeta\n[Publish Installer Nightly]: https://github.com/Tautulli/Tautulli/actions?query=workflow%3A\"Publish+Installers\"+branch%3Anightly\n"
        },
        {
          "name": "Tautulli.py",
          "type": "blob",
          "size": 11.51953125,
          "content": "#!/usr/bin/env python\n\n# -*- coding: utf-8 -*-\n\n# This file is part of Tautulli.\n#\n#  Tautulli is free software: you can redistribute it and/or modify\n#  it under the terms of the GNU General Public License as published by\n#  the Free Software Foundation, either version 3 of the License, or\n#  (at your option) any later version.\n#\n#  Tautulli is distributed in the hope that it will be useful,\n#  but WITHOUT ANY WARRANTY; without even the implied warranty of\n#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n#  GNU General Public License for more details.\n#\n#  You should have received a copy of the GNU General Public License\n#  along with Tautulli.  If not, see <http://www.gnu.org/licenses/>.\n\nimport os\nimport sys\n\n# Ensure lib added to path, before any other imports\nsys.path.insert(0, os.path.join(os.path.dirname(os.path.abspath(__file__)), 'lib'))\n\n\nimport argparse\nimport datetime\nimport locale\nimport platformdirs\nimport pytz\nimport signal\nimport shutil\nimport time\nimport threading\nimport tzlocal\nimport ctypes\n\nimport plexpy\nfrom plexpy import common, config, database, helpers, logger, webstart\nif common.PLATFORM == 'Windows':\n    from plexpy import windows\nelif common.PLATFORM == 'Darwin':\n    from plexpy import macos\n\n# Register signals, such as CTRL + C\nsignal.signal(signal.SIGINT, plexpy.sig_handler)\nsignal.signal(signal.SIGTERM, plexpy.sig_handler)\n\n\ndef main():\n    \"\"\"\n    Tautulli application entry point. Parses arguments, setups encoding and\n    initializes the application.\n    \"\"\"\n\n    # Fixed paths to Tautulli\n    if hasattr(sys, 'frozen') and hasattr(sys, '_MEIPASS'):\n        plexpy.FROZEN = True\n        plexpy.FULL_PATH = os.path.abspath(sys.executable)\n        plexpy.PROG_DIR = sys._MEIPASS\n    else:\n        plexpy.FULL_PATH = os.path.abspath(__file__)\n        plexpy.PROG_DIR = os.path.dirname(plexpy.FULL_PATH)\n\n    plexpy.ARGS = sys.argv[1:]\n\n    # From sickbeard\n    plexpy.SYS_PLATFORM = sys.platform\n    plexpy.SYS_ENCODING = None\n\n    try:\n\n        # Attempt to get the system's locale settings\n        language_code, encoding = locale.getlocale()\n\n        # Special handling for Windows platform\n        if sys.platform == 'win32':\n            # Get the user's current language settings on Windows\n            windll = ctypes.windll.kernel32\n            lang_id = windll.GetUserDefaultLCID()\n\n            # Map Windows language ID to locale identifier\n            language_code = locale.windows_locale.get(lang_id, '')\n\n        # Get the preferred encoding\n        encoding = locale.getpreferredencoding()\n\n        # Assign values to application-specific variable\n        plexpy.SYS_LANGUAGE = language_code\n        plexpy.SYS_ENCODING = encoding\n\n    except (locale.Error, IOError):\n        pass\n\n    # for OSes that are poorly configured I'll just force UTF-8\n    if not plexpy.SYS_ENCODING or plexpy.SYS_ENCODING in ('ANSI_X3.4-1968', 'US-ASCII', 'ASCII'):\n        plexpy.SYS_ENCODING = 'UTF-8'\n\n    # Set up and gather command line arguments\n    parser = argparse.ArgumentParser(\n        description='A Python based monitoring and tracking tool for Plex Media Server.')\n\n    parser.add_argument(\n        '-v', '--verbose', action='store_true', help='Increase console logging verbosity')\n    parser.add_argument(\n        '-q', '--quiet', action='store_true', help='Turn off console logging')\n    parser.add_argument(\n        '-d', '--daemon', action='store_true', help='Run as a daemon')\n    parser.add_argument(\n        '-p', '--port', type=int, help='Force Tautulli to run on a specified port')\n    parser.add_argument(\n        '--dev', action='store_true', help='Start Tautulli in the development environment')\n    parser.add_argument(\n        '--datadir', help='Specify a directory where to store your data files')\n    parser.add_argument(\n        '--config', help='Specify a config file to use')\n    parser.add_argument(\n        '--nolaunch', action='store_true', help='Prevent browser from launching on startup')\n    parser.add_argument(\n        '--pidfile', help='Create a pid file (only relevant when running as a daemon)')\n    parser.add_argument(\n        '--nofork', action='store_true', help='Start Tautulli as a service, do not fork when restarting')\n\n    args = parser.parse_args()\n\n    if args.verbose:\n        plexpy.VERBOSE = True\n    if args.quiet:\n        plexpy.QUIET = True\n\n    # Do an intial setup of the logger.\n    # Require verbose for pre-initilization to see critical errors\n    logger.initLogger(console=not plexpy.QUIET, log_dir=False, verbose=True)\n\n    try:\n        plexpy.SYS_TIMEZONE = tzlocal.get_localzone()\n    except (pytz.UnknownTimeZoneError, LookupError, ValueError) as e:\n        logger.error(\"Could not determine system timezone: %s\" % e)\n        plexpy.SYS_TIMEZONE = pytz.UTC\n\n    plexpy.SYS_UTC_OFFSET = datetime.datetime.now(plexpy.SYS_TIMEZONE).strftime('%z')\n\n    if helpers.bool_true(os.getenv('TAUTULLI_DOCKER', False)):\n        plexpy.DOCKER = True\n        plexpy.DOCKER_MOUNT = not os.path.isfile('/config/DOCKER')\n    if helpers.bool_true(os.getenv('TAUTULLI_SNAP', False)):\n        plexpy.SNAP = True\n\n    if args.dev:\n        plexpy.DEV = True\n        logger.debug(\"Tautulli is running in the dev environment.\")\n\n    if args.daemon:\n        if sys.platform == 'win32':\n            logger.warn(\"Daemonizing not supported under Windows, starting normally\")\n        else:\n            plexpy.DAEMON = True\n            plexpy.QUIET = True\n\n    if args.nofork:\n        plexpy.NOFORK = True\n        logger.info(\"Tautulli is running as a service, it will not fork when restarted.\")\n\n    if args.pidfile:\n        plexpy.PIDFILE = str(args.pidfile)\n\n        # If the pidfile already exists, plexpy may still be running, so\n        # exit\n        if os.path.exists(plexpy.PIDFILE):\n            try:\n                with open(plexpy.PIDFILE, 'r') as fp:\n                    pid = int(fp.read())\n            except IOError as e:\n                raise SystemExit(\"Unable to read PID file: %s\", e)\n\n            try:\n                os.kill(pid, 0)\n            except OSError:\n                logger.warn(\"PID file '%s' already exists, but PID %d is \"\n                            \"not running. Ignoring PID file.\" %\n                            (plexpy.PIDFILE, pid))\n            else:\n                # The pidfile exists and points to a live PID. plexpy may\n                # still be running, so exit.\n                raise SystemExit(\"PID file '%s' already exists. Exiting.\" %\n                                 plexpy.PIDFILE)\n\n        # The pidfile is only useful in daemon mode, make sure we can write the\n        # file properly\n        if plexpy.DAEMON:\n            plexpy.CREATEPID = True\n\n            try:\n                with open(plexpy.PIDFILE, 'w') as fp:\n                    fp.write(\"pid\\n\")\n            except IOError as e:\n                raise SystemExit(\"Unable to write PID file: %s\", e)\n        else:\n            logger.warn(\"Not running in daemon mode. PID file creation \" \\\n                        \"disabled.\")\n\n    # Determine which data directory and config file to use\n    if args.datadir:\n        plexpy.DATA_DIR = args.datadir\n    elif plexpy.FROZEN:\n        plexpy.DATA_DIR = platformdirs.user_data_dir(\"Tautulli\", False)\n    else:\n        plexpy.DATA_DIR = plexpy.PROG_DIR\n\n    # Migrate Snap data dir\n    if plexpy.SNAP:\n        snap_common = os.environ['SNAP_COMMON']\n        old_data_dir = os.path.join(snap_common, 'Tautulli')\n        if os.path.exists(old_data_dir) and os.listdir(old_data_dir):\n            plexpy.SNAP_MIGRATE = True\n            logger.info(\"Migrating Snap user data.\")\n            shutil.move(old_data_dir, plexpy.DATA_DIR)\n\n    if args.config:\n        config_file = args.config\n    else:\n        config_file = os.path.join(plexpy.DATA_DIR, config.FILENAME)\n\n    # Try to create the DATA_DIR if it doesn't exist\n    if not os.path.exists(plexpy.DATA_DIR):\n        try:\n            os.makedirs(plexpy.DATA_DIR)\n        except OSError:\n            raise SystemExit(\n                'Could not create data directory: ' + plexpy.DATA_DIR + '. Exiting....')\n\n    # Make sure the DATA_DIR is writeable\n    test_file = os.path.join(plexpy.DATA_DIR, '.TEST')\n    try:\n        with open(test_file, 'w'):\n            pass\n    except IOError:\n        raise SystemExit(\n            'Cannot write to the data directory: ' + plexpy.DATA_DIR + '. Exiting...')\n    finally:\n        try:\n            os.remove(test_file)\n        except OSError:\n            pass\n\n    # Put the database in the DATA_DIR\n    plexpy.DB_FILE = os.path.join(plexpy.DATA_DIR, database.FILENAME)\n\n    # Move 'plexpy.db' to 'tautulli.db'\n    if os.path.isfile(os.path.join(plexpy.DATA_DIR, 'plexpy.db')) and \\\n            not os.path.isfile(os.path.join(plexpy.DATA_DIR, plexpy.DB_FILE)):\n        try:\n            os.rename(os.path.join(plexpy.DATA_DIR, 'plexpy.db'), plexpy.DB_FILE)\n        except OSError as e:\n            raise SystemExit(\"Unable to rename plexpy.db to tautulli.db: %s\", e)\n\n    if plexpy.DAEMON:\n        plexpy.daemonize()\n\n    # Read config and start logging\n    plexpy.initialize(config_file)\n\n    # Start the background threads\n    plexpy.start()\n\n    # Force the http port if necessary\n    if args.port:\n        plexpy.HTTP_PORT = args.port\n        logger.info('Using forced web server port: %i', plexpy.HTTP_PORT)\n    else:\n        plexpy.HTTP_PORT = int(plexpy.CONFIG.HTTP_PORT)\n\n    # Try to start the server. Will exit here is address is already in use.\n    webstart.start()\n\n    if common.PLATFORM == 'Windows':\n        if plexpy.CONFIG.SYS_TRAY_ICON:\n            plexpy.WIN_SYS_TRAY_ICON = windows.WindowsSystemTray()\n            plexpy.WIN_SYS_TRAY_ICON.start()\n        windows.set_startup()\n    elif common.PLATFORM == 'Darwin':\n        macos.set_startup()\n\n    # Open webbrowser\n    if plexpy.CONFIG.LAUNCH_BROWSER and not args.nolaunch and not plexpy.DEV:\n        plexpy.launch_browser(plexpy.CONFIG.HTTP_HOST, plexpy.HTTP_PORT,\n                              plexpy.HTTP_ROOT)\n\n    if common.PLATFORM == 'Darwin' and plexpy.CONFIG.SYS_TRAY_ICON:\n        if not macos.HAS_PYOBJC:\n            logger.warn(\"The pyobjc module is missing. Install this \"\n                        \"module to enable the MacOS menu bar icon.\")\n            plexpy.CONFIG.SYS_TRAY_ICON = False\n\n        if plexpy.CONFIG.SYS_TRAY_ICON:\n            # MacOS menu bar icon must be run on the main thread and is blocking\n            # Start the rest of Tautulli on a new thread\n            thread = threading.Thread(target=wait)\n            thread.daemon = True\n            thread.start()\n\n            plexpy.MAC_SYS_TRAY_ICON = macos.MacOSSystemTray()\n            plexpy.MAC_SYS_TRAY_ICON.start()\n        else:\n            wait()\n    else:\n        wait()\n\n\ndef wait():\n    logger.info(\"Tautulli is ready!\")\n\n    # Wait endlessly for a signal to happen\n    while True:\n        if not plexpy.SIGNAL:\n            try:\n                time.sleep(1)\n            except KeyboardInterrupt:\n                plexpy.SIGNAL = 'shutdown'\n        else:\n            logger.info('Received signal: %s', plexpy.SIGNAL)\n\n            if plexpy.SIGNAL == 'shutdown':\n                plexpy.shutdown()\n            elif plexpy.SIGNAL == 'restart':\n                plexpy.shutdown(restart=True)\n            elif plexpy.SIGNAL == 'checkout':\n                plexpy.shutdown(restart=True, checkout=True)\n            elif plexpy.SIGNAL == 'reset':\n                plexpy.shutdown(restart=True, reset=True)\n            elif plexpy.SIGNAL == 'update':\n                plexpy.shutdown(restart=True, update=True)\n            else:\n                logger.error('Unknown signal. Shutting down...')\n                plexpy.shutdown()\n\n            plexpy.SIGNAL = None\n\n\nif __name__ == \"__main__\":\n    main()\n"
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "init-scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "package",
          "type": "tree",
          "content": null
        },
        {
          "name": "plexpy",
          "type": "tree",
          "content": null
        },
        {
          "name": "pylintrc",
          "type": "blob",
          "size": 9.0341796875,
          "content": "[MASTER]\n\n# Specify a configuration file.\n#rcfile=\n\n# Python code to execute, usually for sys.path manipulation such as\n# pygtk.require().\ninit-hook=sys.path.insert(0, 'lib/')\n\n# Profiled execution.\nprofile=no\n\n# Add files or directories to the blacklist. They should be base names, not\n# paths.\nignore=CVS\n\n# Pickle collected data for later comparisons.\npersistent=yes\n\n# List of plugins (as comma separated values of python modules names) to load,\n# usually to register additional checkers.\nload-plugins=\n\n\n[MESSAGES CONTROL]\n\n# Enable the message, report, category or checker with the given id(s). You can\n# either give multiple identifier separated by comma (,) or put this option\n# multiple time. See also the \"--disable\" option for examples.\n#enable=\n\n# Disable the message, report, category or checker with the given id(s). You\n# can either give multiple identifiers separated by comma (,) or put this\n# option multiple times (only on the command line, not in the configuration\n# file where it should appear only once).You can also use \"--disable=all\" to\n# disable everything first and then reenable specific checks. For example, if\n# you want to run only the similarities checker, you can use \"--disable=all\n# --enable=similarities\". If you want to run only the classes checker, but have\n# no Warning level messages displayed, use\"--disable=all --enable=classes\n# --disable=W\"\n#I0011 an inline option disables a pylint message or a messages category\n#R0801 a set of similar lines has been detected among multiple file\n#W0142 a function or method is called using *args or **kwargs to dispatch argument\n\n# W1201(logging-not-lazy)\n# C0330(bad-continuation)\n# E1205(logging-too-many-args)\n\ndisable=I0011,R0801,W0142,C0103,C0111,C0301,C0302,C0304,C0321,C1001,E0101,E0203,E0602,E1101,E1123,R0201,R0401,R0911,R0912,R0914,R0915,R0923,W0102,W0109,W0120,W0141,W0201,W0212,W0231,W0232,W0233,W0301,W0311,W0401,W0403,W0404,W0511,W0601,W0602,W0603,W0611,W0612,W0613,W0621,W0622,W0633,W0702,W0703,W1401,W1201,C0330\n\n[REPORTS]\n\n# Set the output format. Available formats are text, parseable, colorized, msvs\n# (visual studio) and html. You can also give a reporter class, eg\n# mypackage.mymodule.MyReporterClass.\n#output-format=parseable\n\n# Put messages in a separate file for each module / package specified on the\n# command line instead of printing them on stdout. Reports (if any) will be\n# written in a file name \"pylint_global.[txt|html]\".\nfiles-output=no\n\n# Tells whether to display a full report or only the messages\nreports=no\n\n# Python expression which should return a note less than 10 (10 is the highest\n# note). You have access to the variables errors warning, statement which\n# respectively contain the number of errors / warnings messages and the total\n# number of statements analyzed. This is used by the global evaluation report\n# (RP0004).\nevaluation=10.0 - ((float(5 * error + warning + refactor + convention) / statement) * 10)\n\n# Add a comment according to your evaluation note. This is used by the global\n# evaluation report (RP0004).\ncomment=no\n\n# Template used to display messages. This is a python new-style format string\n# used to format the massage information. See doc for all details\n#msg-template=\nmsg-template={path}:{line}: [{msg_id}({symbol}), {obj}] {msg}\n\n[BASIC]\n\n# Required attributes for module, separated by a comma\nrequired-attributes=\n\n# List of builtins function names that should not be used, separated by a comma\nbad-functions=map,filter,apply,input\n\n# Regular expression which should only match correct module names\nmodule-rgx=(([a-z_][a-z0-9_]*)|([A-Z][a-zA-Z0-9]+))$\n\n# Regular expression which should only match correct module level names\nconst-rgx=(([A-Z_][A-Z0-9_]*)|(__.*__))$\n\n# Regular expression which should only match correct class names\nclass-rgx=[A-Z_][a-zA-Z0-9]+$\n\n# Regular expression which should only match correct function names\nfunction-rgx=[a-z_][a-z0-9_]{2,50}$\n\n# Regular expression which should only match correct method names\nmethod-rgx=[a-z_][a-z0-9_]{2,50}$\n\n# Regular expression which should only match correct instance attribute names\nattr-rgx=[a-z_][a-z0-9_]{2,50}$\n\n# Regular expression which should only match correct argument names\nargument-rgx=[a-z_][a-z0-9_]{2,50}$\n\n# Regular expression which should only match correct variable names\nvariable-rgx=[a-z_][a-z0-9_]{2,50}$\n\n# Regular expression which should only match correct attribute names in class\n# bodies\nclass-attribute-rgx=([A-Za-z_][A-Za-z0-9_]{2,30}|(__.*__))$\n\n# Regular expression which should only match correct list comprehension /\n# generator expression variable names\ninlinevar-rgx=[A-Za-z_][A-Za-z0-9_]*$\n\n# Good variable names which should always be accepted, separated by a comma\ngood-names=i,j,k,ex,Run,_\n\n# Bad variable names which should always be refused, separated by a comma\nbad-names=foo,bar,baz,toto,tutu,tata\n\n# Regular expression which should only match function or class names that do\n# not require a docstring.\nno-docstring-rgx=__.*__\n\n# Minimum line length for functions/classes that require docstrings, shorter\n# ones are exempt.\ndocstring-min-length=-1\n\n\n[FORMAT]\n\n# Maximum number of characters on a single line.\nmax-line-length=150\n\n# Allow the body of an if to be on the same line as the test if there is no\n# else.\nsingle-line-if-stmt=no\n\n# Regexp for a line that is allowed to be longer than the limit.\nignore-long-lines=^\\s*(# )?<?https?://\\S+>?$\n\n# Maximum number of lines in a module\nmax-module-lines=1000\n\n# String used as indentation unit. This is usually \" \" (4 spaces) or \"\\t\" (1\n# tab).\nindent-string='    '\n\n\n[MISCELLANEOUS]\n\n# List of note tags to take in consideration, separated by a comma.\nnotes=FIXME,XXX,TODO\n\n\n[SIMILARITIES]\n\n# Minimum lines number of a similarity.\nmin-similarity-lines=4\n\n# Ignore comments when computing similarities.\nignore-comments=yes\n\n# Ignore docstrings when computing similarities.\nignore-docstrings=yes\n\n# Ignore imports when computing similarities.\nignore-imports=no\n\n\n[TYPECHECK]\n\n# Tells whether missing members accessed in mixin class should be ignored. A\n# mixin class is detected if its name ends with \"mixin\" (case insensitive).\nignore-mixin-members=yes\n\n# List of classes names for which member attributes should not be checked\n# (useful for classes with attributes dynamically set).\nignored-classes=SQLObject\n\n# When zope mode is activated, add a predefined set of Zope acquired attributes\n# to generated-members.\nzope=no\n\n# List of members which are set dynamically and missed by pylint inference\n# system, and so shouldn't trigger E0201 when accessed. Python regular\n# expressions are accepted.\ngenerated-members=REQUEST,acl_users,aq_parent,objects\n\n\n[VARIABLES]\n\n# Tells whether we should check for unused import in __init__ files.\ninit-import=no\n\n# A regular expression matching the beginning of the name of dummy variables\n# (i.e. not used).\ndummy-variables-rgx=_$|dummy\n\n# List of additional names supposed to be defined in builtins. Remember that\n# you should avoid to define new builtins when possible.\nadditional-builtins=\n\n\n[CLASSES]\n\n# List of interface methods to ignore, separated by a comma. This is used for\n# instance to not check methods defines in Zope's Interface base class.\nignore-iface-methods=isImplementedBy,deferred,extends,names,namesAndDescriptions,queryDescriptionFor,getBases,getDescriptionFor,getDoc,getName,getTaggedValue,getTaggedValueTags,isEqualOrExtendedBy,setTaggedValue,isImplementedByInstancesOf,adaptWith,is_implemented_by\n\n# List of method names used to declare (i.e. assign) instance attributes.\ndefining-attr-methods=__init__,__new__,setUp\n\n# List of valid names for the first argument in a class method.\nvalid-classmethod-first-arg=cls\n\n# List of valid names for the first argument in a metaclass class method.\nvalid-metaclass-classmethod-first-arg=mcs\n\n\n[DESIGN]\n\n# Maximum number of arguments for function / method\nmax-args=10\n\n# Argument names that match this expression will be ignored. Default to name\n# with leading underscore\nignored-argument-names=_.*\n\n# Maximum number of locals for function / method body\nmax-locals=15\n\n# Maximum number of return / yield for function / method body\nmax-returns=6\n\n# Maximum number of branch for function / method body\nmax-branches=12\n\n# Maximum number of statements in function / method body\nmax-statements=50\n\n# Maximum number of parents for a class (see R0901).\nmax-parents=7\n\n# Maximum number of attributes for a class (see R0902).\nmax-attributes=20\n\n# Minimum number of public methods for a class (see R0903).\nmin-public-methods=0\n\n# Maximum number of public methods for a class (see R0904).\nmax-public-methods=100\n\n\n[IMPORTS]\n\n# Deprecated modules which should not be used, separated by a comma\ndeprecated-modules=regsub,TERMIOS,Bastion,rexec\n\n# Create a graph of every (i.e. internal and external) dependencies in the\n# given file (report RP0402 must not be disabled)\nimport-graph=\n\n# Create a graph of external dependencies in the given file (report RP0402 must\n# not be disabled)\next-import-graph=\n\n# Create a graph of internal dependencies in the given file (report RP0402 must\n# not be disabled)\nint-import-graph=\n\n\n[EXCEPTIONS]\n\n# Exceptions that will emit a warning when being caught. Defaults to\n# \"Exception\"\novergeneral-exceptions=Exception\n"
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 1.013671875,
          "content": "apscheduler==3.10.1\narrow==1.3.0\nbeautifulsoup4==4.12.3\nbleach==6.2.0\ncertifi==2024.8.30\ncheroot==10.0.1\ncherrypy==18.10.0\ncloudinary==1.41.0\ndistro==1.9.0\ndnspython==2.7.0\nfacebook-sdk==3.1.0\nfuture==1.0.0\nga4mp==2.0.4\ngntp==1.0.3\nhtml5lib==1.1\nhttpagentparser==1.9.5\nidna==3.10\nimportlib-metadata==8.5.0\nimportlib-resources==6.4.5\ngit+https://github.com/Tautulli/ipwhois.git@master#egg=ipwhois\nIPy==1.01\nMako==1.3.6\nMarkupSafe==3.0.2\nmusicbrainzngs==0.7.1\npackaging==24.2\npaho-mqtt==2.1.0\nplatformdirs==4.3.6\nplexapi==4.16.0\nportend==3.2.0\nprofilehooks==1.13.0\nPyJWT==2.10.0\npyparsing==3.2.0\npython-dateutil==2.9.0.post0\npython-twitter==3.5\npytz==2024.2\nrequests==2.32.3\nrequests-oauthlib==2.0.0\nrumps==0.4.0; platform_system == \"Darwin\"\nsimplejson==3.19.3\nsix==1.16.0\ntempora==5.7.0\ntokenize-rt==6.1.0\ntzdata==2024.2\ntzlocal==5.0.1\nurllib3<2\nwebencodings==0.5.1\nwebsocket-client==1.8.0\nxmltodict==0.14.2\nzipp==3.21.0\n\n# configobj==5.1.0\n# sgmllib3k==1.0.0\n# git+https://github.com/JonnyWong16/infi.systray.git@develop#egg=infi.systray\n"
        },
        {
          "name": "snap",
          "type": "tree",
          "content": null
        },
        {
          "name": "start.bat",
          "type": "blob",
          "size": 0.0244140625,
          "content": "Start pythonw Tautulli.py"
        },
        {
          "name": "start.sh",
          "type": "blob",
          "size": 0.9833984375,
          "content": "#!/usr/bin/env bash\n\nif [[ \"$TAUTULLI_DOCKER\" == \"True\" ]]; then\n    PUID=${PUID:-1000}\n    PGID=${PGID:-1000}\n\n    groupmod -o -g \"$PGID\" tautulli\n    usermod -o -u \"$PUID\" tautulli\n\n    find /config \\! \\( -uid $(id -u tautulli) -gid $(id -g tautulli) \\) -print0 | xargs -0r chown tautulli:tautulli\n\n    echo \"Running Tautulli using user tautulli (uid=$(id -u tautulli)) and group tautulli (gid=$(id -g tautulli))\"\n    exec gosu tautulli \"$@\"\nelse\n    python_versions=(\"python3.11\" \"python3.10\" \"python3.9\" \"python3\" \"python\")\n    for cmd in \"${python_versions[@]}\"; do\n        if command -v \"$cmd\" >/dev/null; then\n            echo \"Starting Tautulli with $cmd.\"\n            if [[ \"$(uname -s)\" == \"Darwin\" ]]; then\n                $cmd Tautulli.py &> /dev/null &\n            else\n                $cmd Tautulli.py --quiet --daemon\n            fi\n            exit\n        fi\n    done\n    echo \"Unable to start Tautulli. No Python interpreter was found in the following options:\" \"${python_versions[@]}\"\nfi\n"
        }
      ]
    }
  ]
}