{
  "metadata": {
    "timestamp": 1736560511114,
    "page": 105,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjExMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mailpile/Mailpile",
      "stars": 8816,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".coveragerc",
          "type": "blob",
          "size": 1.064453125,
          "content": "# =========================================================================\n# COVERAGE CONFIGURATION FILE: .coveragerc\n# =========================================================================\n# LANGUAGE: Python\n# SEE ALSO:\n#  * http://nedbatchelder.com/code/coverage/\n#  * http://nedbatchelder.com/code/coverage/config.html\n# =========================================================================\n\n[coverage:run]\nappend  = .coverage\ninclude = mailpile*\nomit = nose\nbranch  = True\n#parallel = True\n\n[coverage:report]\n# Regexes for lines to exclude from consideration\nexclude_lines =\n    # Have to re-enable the standard pragma\n    pragma: no cover\n\n    # Don't complain about missing debug-only code:\n    def __repr__\n    if self\\.debug\n\n    # Don't complain if tests don't hit defensive assertion code:\n    raise AssertionError\n    raise NotImplementedError\n\n    # Don't complain if non-runnable code isn't run:\n    if 0:\n    if False:\n    if __name__ == .__main__.:\n\nignore_errors = True\n\n[coverage:html]\ndirectory = build/coverage.html\n\n[coverage:xml]\noutfile = build/coverage.xml\n\n"
        },
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0224609375,
          "content": "Dockerfile\nVagrantfile\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.46484375,
          "content": "*.pyc\n*.pyo\n*~\n*.po\n*.debhelper\n*.iml\n*.ipr\n*.swp\n*.swo\nmp-virtualenv\n.idea\n.*deps\n.tox\nmailpile.egg-info/\nmailpile-tmp.py\nstatic/default/plugins/\nmailpile/tests/data/private-test-data.mbx\nmailpile/tests/data/tmp\nmailpile/tests/data/gpg-keyring/random_seed\nscripts/less-compiler.mk\n.DS_Store\n.vagrant\n.coverage\nghostdriver.log\nbuild/\ndist/\n.eggs/\ncover/\nbower_components/\nnode_modules/\ntesting/\nmailpile.tar.gz\nAUTHORS\nChangeLog\nshared-data/multipile/www/admin.cgi\nsetup-tmp/\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.453125,
          "content": "[submodule \"doc\"]\n\tpath = doc\n\turl = https://github.com/pagekite/Mailpile.wiki.git\n\tbranch = master\n[submodule \"shared-data/contrib/print\"]\n\tpath = shared-data/contrib/print\n\turl = https://github.com/mailpile/Mailpile-print.git\n[submodule \"submodules/gui-o-matic\"]\n\tpath = submodules/gui-o-matic\n\turl = https://github.com/mailpile/gui-o-matic\n[submodule \"submodules/gui-o-mac-tic\"]\n\tpath = submodules/gui-o-mac-tic\n\turl = https://github.com/mailpile/gui-o-mac-tic\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.189453125,
          "content": "language: python\npython: 2.7\nenv:\n  - TOX_ENV=py27\n\naddons:\n  apt:\n    packages:\n      - gnupg\n\ninstall:\n  - pip install tox coveralls\n\nscript:\n  - tox -e $TOX_ENV\n\nafter_success:\n  - coveralls\n"
        },
        {
          "name": ".tx",
          "type": "tree",
          "content": null
        },
        {
          "name": "AGPLv3.txt",
          "type": "blob",
          "size": 33.783203125,
          "content": "NOTE: Please see the file COPYING.md for details on Mailpile licensing.\n\n\n                    GNU AFFERO GENERAL PUBLIC LICENSE\n                       Version 3, 19 November 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<http://www.gnu.org/licenses/>.\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.6396484375,
          "content": "# The Mailpile Code of Conduct\n\nThe Mailpile project depends on its community of volunteers, supporters and of\ncourse users. We want people to feel welcome and respected. To this end,\nproject maintainers have plegded to adhere to and enforce the Contrbitor\nCovenant Code of Conduct, in their Mailpile related activities, both online and\nin person.\n\nWe respectfully ask that other contributors and participants in our community\ndo so as well.\n\nThank you for your understanding, and welcome!\n\n\n# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, gender identity and expression, level of experience,\nnationality, personal appearance, race, religion, or sexual identity and\norientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n  advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at <mailto:team@mailpile.is>. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at [http://contributor-covenant.org/version/1/4][version]\n\n[homepage]: http://contributor-covenant.org\n[version]: http://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.8359375,
          "content": "## How to contribute to Mailpile\n\nFirst of all: Thank you! :heart:\n\n\n#### Further Reading\n\nSecond of all, please adhere to our Code of Conduct when you participate\nin our community. Be kind, be respectful. [The full Code of Conduct can\nbe found here](CODE_OF_CONDUCT.md).\n\nPlease also be sure you are comfortable with [our license](COPYING.md)\nbefore contributing any code to Mailpile.\n\nNote that Mailpile is a slightly unsual app; the design is both political\nand opinionated. If you are confused or unsure whether something is a bug or a\nfeature, [our developer FAQ might have answers](DEV_FAQ.md)! Please read it\nbefore filing issues about design choices or attempting to reorganize the code\nin any major way. The FAQ also contains a quick introduction Mailpile internals\nand debugging techniques.\n\nAlso, have you seen [the main Mailpile website](https://www.mailpile.is/) and\n[the community Discourse](https://community.mailpile.is/categories)?\n\n\n#### Are you new to Mailpile and/or FOSS?\n\n* Welcome! The first step is probably to get Mailpile up and running, play with it, get familiar.\n\n* Read the links above, and [check out our website](https://www.mailpile.is/) if you haven't already.\n\n* Not sure what to work on? Find inspiration in one of our [Low Hanging Fruit](https://github.com/mailpile/Mailpile/issues?q=is%3Aissue+is%3Aopen+label%3A%22Low+Hanging+Fruit%22) issues!\n\n* Otherwise, read on...\n\n\n#### Did you find a bug?\n\n* **Ensure the bug was not already reported** by searching on GitHub\n  under [Issues](https://github.com/mailpile/Mailpile/issues).\n\n* If you're unable to find an open issue addressing the problem,\n  [open a new one](https://github.com/mailpile/Mailpile/issues/new). Be\n  sure to include a **title and clear description**, as much relevant\n  information as possible.\n\n* Remember, we cannot read your mind or see your screen, so you'll\n  probably need to answer all of these:\n\n   1. What were you doing?\n   2. What did you expect would happen?\n   3. What actually happened?\n   4. Operating system? GnuPG version? Mailpile version?\n\n* Reproducability is key. If you cannot reliably trigger the bug or\n  cannot describe how to do so, then unfortunately it's less likely that\n  the Mailpile team will be able to do anything about it. It may still\n  be useful to file a report in case others are having the same issue, but\n  bugs that can be reproduced will in general get fixed much faster!\n\n* The [Developer FAQ](DEV_FAQ.md) has a section on debugging techniques.\n\n* If it's not bug, but you still need help: [visit our Discourse support\n  forum](https://community.mailpile.is/c/support).\n\n\n#### Did you write a patch that fixes a bug?\n\n* Open a new GitHub pull request with the patch.\n\n* Ensure the PR description clearly describes the problem and solution.\n  Include the relevant issue number if applicable.\n\n\n#### Do you plan write a patch that adds a feature?\n\n* Please be sure you have read the [Developer FAQ](DEV_FAQ.md) to ensure\n  your feature is compatible with our high-level goals and design decisions.\n\n* If you are unsure or would like some guidance, join the #mailpile\n  channel on IRC (Freenode) and discuss your plans there.\n\n* Open a new GitHub pull request with the patch.\n\n* Ensure the PR description clearly describes what your feature does.\n  Include the relevant issue number if applicable.\n\n\n#### Did you fix whitespace, format code, or make a purely cosmetic patch?\n\nChanges that are cosmetic in nature and do not add anything substantial to the\nstability, functionality, or testability of Mailpile will generally not be\naccepted.\n\nAll patches to Mailpile are reviewed by a human and our resources (time,\npeople) are very limited. Cosmetic patches are no easier to review than other\npatches and we would rather focus our efforts on functional improvements to the\nsoftware.\n\n\n#### Do you want help other users?\n\nOur [community Discourse](https://community.mailpile.is/categories) has a\nsupport forum and needs friendly people to help out and steer conversations\nin friendly and productive directions. Please join the conversation!\n\n\n#### Do you want to translate Mailpile to your language?\n\nPlease feel free to join our translation community\n[on Transifex](https://www.transifex.com/otf/mailpile/).\n\n\n#### Do you plan to write documentation?\n\n* Please feel free to contribute documentation to\n  [our wiki](https://github.com/mailpile/Mailpile/wiki).\n\n* If you would like some guidance, join the #mailpile channel on IRC\n  (Freenode) or file an issue with your questions.\n\n* If you added a new page or made major major changes to an existing page,\n  please file [a new issue requesting a review](https://github.com/mailpile/Mailpile/issues/new)\n  when you are done. Be sure to include a link to the wiki page!\n\n\n#### Credits\n\nThis document borrows some language and structure from the [Ruby on Rails\ncontributor guidelines](https://raw.githubusercontent.com/rails/rails/master/CONTRIBUTING.md).\n\n"
        },
        {
          "name": "COPYING.md",
          "type": "blob",
          "size": 1.2958984375,
          "content": "# Mailpile - a program for doing stuff with e-mail\n\nCopyright (C) 2011-2015, Bjarni R. Einarsson, Mailpile ehf and friends.\n\nThis program is free software: you can redistribute it and/or modify it\nunder the terms of the GNU Affero General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or (at\nyour option) any later version.\n\nThis program is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Affero\nGeneral Public License more details.\n\nYou should have received a copy of the GNU Affero General Public License\nalong with this program. If not, see <http://www.gnu.org/licenses/>.\n\n\n## What happened to the Apache license?\n\nThis software used to be dual-licensed under AGPLv3 and the Apache\nLicense 2.0. If you feel an uncontrollable urge to fork and carry on\nwithout the AGPL, the last dual-licensed code point is tagged as\n\"Gunsmoke--TheLastApacheTag\".  Have fun!\n\nFor more details on our licensing choices, see these blog posts:\n\n* <https://www.mailpile.is/blog/2015-05-08_Choosing_a_License.html>\n* <https://www.mailpile.is/blog/2015-06-15_Community_License_Feedback.html> \n* <https://www.mailpile.is/blog/2015-07-02_Licensing_Decision.html>\n\nThanks!\n"
        },
        {
          "name": "DEV_FAQ.md",
          "type": "blob",
          "size": 11.833984375,
          "content": "## Mailpile Developer FAQ\n\nThis document contain a collection of frequently asked questions (with\nanswers) about Mailpile development. Please familiarize yourself with\nthe contents before attempting any deep hacking on Mailpile.\n\nYou don't have to agree with all of our priorities to take part or make\nuse of Mailpile, but we do feel it helps if most of the community is\nrowing in roughly the same general direction!\n\nNote: If you are just looking for debugging tips and tricks, you can skip\nto the end.\n\n\n### Why Mailpile?\n\nThe long-term goal of Mailpile is to help *non-technical people* become\n*more independent* and *more private* online, in particular when it\ncomes to e-mail.\n\nBy **more independent**, we mean people should be in control of their\ne-mail and the software used to manage it. This is why Mailpile is Free\nSoftware, and this is why we *don't* promote Mailpile as a tool for\nbuilding \"cloud services\".\n\nBy **more private**, we mean people should have more control over who has\naccess to their e-mail, when and how. This is why Mailpile tries to make\ne-mail encryption more accessible, and this is why Mailpile tries to\nmake it convenient *and secure* for people to store their e-mail on their\nown devices.\n\nOur focus on **non-technical people** implies, amongst other things, that\nwe cannot exclude people who are using non-free platforms such as\nMicrosoft Windows or Mac OS X, and we cannot require our users learn a\nradically new, unfamiliar user interface or understand highly technical\nconcepts such as public key cryptography.\n\n\n### Are All of These Decisions Awesome?\n\nNo. Some of these decisions were almost certainly mistakes. But that's\npart of innovating, you try new things and see how they go!\n\nSo we kindly request that our contributors and collaboratores refrain\nfrom picking arguments with us over these decisions. Making forward\nprogress is much more fun than rehashing the past over and over again.\n\n\n### Why Do You Reinvent So Many Wheels?\n\nUsually, the answer is one or more of the following:\n\n   * We didn't know a solution already existed\n   * We evaluated solutions X, Y and Z, but didn't like them\n   * We felt the problem was simple enough to Just Do It\n\nIn general, we are reluctant to take on new external dependencies unless\nthey are stable and widely available: if they exist in pre-packaged form\nfor Windows, Mac OS X and the most common Linux distributions, they are\nprobably fine!\n\nIf not, the benefits need to outweigh the added complexity posed for our\ncross-platform packaging efforts.\n\nFor this reason we also tend to prefer pure-Python (or Javascript, for\nthe UI) libraries over native code, which also avoids certain classes of\nbugs and security vulnerabilities which are simply not present in a\nmemory-safe, managed language.\n\nWe have broken this rule more often than we'd like in our user-interface\ncode, due to cultural differences between web developers and Python\nfolks. *We would like to gradually reduce our front-end dependencies.*\n\n\n### Why a Search Engine?\n\nMailpile started as an experimental search engine, a hobby project.\nEverything else came later.\n\n*OK, so why not replace it with a standard component?*\n\nBecause it works! Replacing it at this point would be *more work, not less*.\n\nAlso, we are unaware of any \"off the shelf\" search engines that let us\nencrypt their data stores and we feel encrypting the search index is an\nabsolute requirement since we by default allow the user to search inside\nencrypted messages.\n\n*I see. Why not remove it, to simplify the code?*\n\nThe entire app is built around the search metaphor, much like Google's\nGMail. This is a fundamentally different way to build an e-mail client,\nfrom the traditional \"messages and mailboxes\" model.\n\nThe search engine also makes it easy for Mailpile to do some pretty cool\nthings. For example:\n\n   * Mailpile can evaluate the trustworthiness of a message by asking the\n     search engine about the past behaviour of the sender\n   * Mailpile can postpone processing of things like attached PGP keys\n     until it actually intends to use the key: the search engine makes the\n     keys easy to find later on\n\n\n### Why doesn't Mailpile have a Native User Interface?\n\nFor now, because the team is very small and we would like to reach users\non many different platforms, we have bet entirely on the web as our\nprimary user interface:\n\n   * This decision allows us to target any operating system for which\n     Python 2.7 has been made available.\n\n   * It also allows us to get help from the enormous community of web\n     developers; this is a much larger talent pool than the pool of\n     developers that know how to write native apps.\n\n   * Last but not least, the web interface is key to our plan to allow\n     users to access their Mailpile remotely over the network. Remote\n     access is critical if we want to get people to store their e-mail\n     on their own devices, because most people read their mail on\n     multiple devices (laptop, tablet, mobile, work computer, etc).\n\nThat said: we do want to have a minimal native user interface, on all\nthe major desktop operating systems. [That is what the gui-o-matic\nspin-off project is about](https://github.com/mailpile/gui-o-matic).\n\nNative mobile apps on Android and/or iOS would also be nice to have!\n\n\n### How Does Mailpile Handle Security?\n\nThis is a huge topic! Please consult our [Security\nRoadmap](https://github.com/mailpile/Mailpile/wiki/Security-roadmap).\n\nSecurity is complex and means different things to different people.\n\nThe most controversial questions relating to security, have to do with\nmass surveillance and law enforcement. Mailpile's stance is that we\nbelieve that people have an innate right to privacy we believe that mass\nsurveillance is *wrong*. If the government wants to read your e-mail,\nwe feel they should present you with a search warrant.\n\nThwarting other adversaries (criminals, jealous partners, etc.) is also\nvery much something we care about, but is probably less divisive.\n\n\n### Why GnuPG? Why not GPGME? Why not PGPy?\n\nGnuPG is mature and stable. Although the user interfaces may leave\nsomething to be desired, it has a rich ecosystem of powerful tools built\naround it and a wealth of documentation and support to be found online.\nIf we didn't use GnuPG, we would have to reinvent a lot of wheels that\naren't central to Mailpile's mission.\n\nOur issue tracker contains [further discussions on the topic of why\nGnuPG and not something else, such as\nPGPy](https://github.com/mailpile/Mailpile/issues/1743).\n\n[Use of GPGME is also being\ndiscussed](https://github.com/mailpile/Mailpile/issues/1742). Currently,\nwe don't feel GPGME provides enough benefit to justify the additional\ndependency and the additional (hypothetical) risk posed by solving the\nGnuPG integration problem with a large amount of code written in C (as\nopposed to Python, which is memory-safe and less likely to contain\ncertain classes of security vulnerabilities).\n\n\n### Why not Python 3?\n\nWe depend on some libraries - spambayes in particular - which were not\navailable for Python 3 when we started this project.\n\nWe don't think Python 2 is going away in the near future.\n\n[There is a Github issue discussing\nthis.](https://github.com/mailpile/Mailpile/issues/160)\n\n\n### Why Not Django? Or Flask?\n\nReasons!\n\nOur way may be unusual, but it's kinda awesome once you get used to it\nand it wasn't obvious to us how we could get this kind of behaviour from\none of the standard frameworks.\n\nPlease read the next section for details.\n\n\n### How Does Mailpile's Web UI Work?\n\nThe text-based command-line interface is an important part of Mailpile's\nuser interface. Our home-brewed framework allows us to generate web API\nend-points, text commands and command-line arguments *at the same time*.\n\nOur internal framework also has the concept of commands supporting\nmultiple output formats; so the same API endpoint can generate text,\ntemplated HTML, JSON and XML-RPC interfaces with relatively little\nadditional code. Some endpoints also generate XML, CSV, CSS or\nJavascript.\n\nYou can try this yourself, simply by editing the URL in your browser:\n\n    # The default, rendered as HTML\n    http://localhost:33411/in/inbox/\n    http://localhost:33411/in/inbox/as.html\n    http://localhost:33411/search/?q=in:inbox\n\n    # Same thing, as JSON\n    http://localhost:33411/in/inbox/as.json\n    http://localhost:33411/api/0/search/?q=in:inbox\n\n    # Same thing, as text\n    http://localhost:33411/in/inbox/as.text\n    http://localhost:33411/api/0/search/as.text?q=in:inbox\n\nThe filename part of the URL is used to select output formats. All\nendpoints support `as.json`, most support HTML and/or text.\n\nThe HTML output of each command is generated using Jinja2 templates\nthat are found in `shared-data/default-theme/html/...`. The directory\nstructure generally matches the URL paths seen in the browser, with\nthe main template for each command named `index.html`.\n\nAlternate templates for the same API endpoint can have other names, for\nexample a template named `.../html/search/social.html` would be\naccessible using URLs like so:\n\n    http://localhost:33411/in/inbox/social.html\n    http://localhost:33411/search/social.html?q=from:person@foo.com\n\n\n### Can I Develop Plugins For Mailpile?\n\nSort-of!\n\nInternally, the app is quite modular and there are methods which allow\ncode to register classes or functions that perform various functions.\n\nHowever, the plugin API is not considered stable, it is incomplete and\nit is not very well documented. It may also not be a very nice API, and\nwe rather expect it to develop and change rapidly post-1.0.\n\nIf you are interested in Mailpile's plugin APIs, take a look in\n`shared-data/contrib/` for some examples of \"external plugins\" and\n`mailpile/plugins/` for \"internal plugins\".\n\n\n### How Do I Debug Mailpile?\n\nDevelopers should learn to use the Mailpile CLI. The `mailpile>` prompt is\nwhere all of the low-level magic happens. Future versions of Mailpile will\nexpose this functionality to the web interface itself, but for now you will\nneed to use your shell.\n\nPossibly the most important command for Mailpile hackers, is to know\nhow to enable debugging. An example:\n\n    # Enable verbose debugging of HTTP requests and GnuPG integration\n    # Note: HTTP debugging disables all sorts of internal caches!\n    mailpile> set sys.debug = log http gnupg\n    ...\n\nMany other subsystems can have debugging enabled.  At the time of writing,\nthe `sys.debug` can include the following terms to make various parts of\nthe app more verbose:\n\n    log http compose cryptostate autotag rescan keywords cache connbroker\n    vcard pop3 gnupg keylookup imap sources jinja timing sendmail httpdata\n\nThere are also a few other ways to examine the app state:\n\n    # Watch logging and debug messages fly by\n    mailpile> eventlog/watch\n    ...\n    [CTRL+C]\n    ...\n\n    # Examine event log (piped through less)\n    mailpile> pipe less eventlog\n    ...\n    mailpile> pipe less eventlog incomplete\n    ...\n\n    # Get an overview of what threads are running and what they are doing\n    mailpile> ps\n    ...\n\nLow-level changes and exploration of the configuration are also best done\nfrom the CLI:\n\n    # Explore the configuration; see also mailpile/config/defaults.py\n    mailpile> print -short sys\n    ...\n    mailpile> print -flat sources\n    ...\n    mailpile> print -secrets secrets\n    ...\n \n    # Change things (dangerous)\n    mailpile> set sys.gpg_binary = /bin/false\n    ...\n\n    # Reset something to its default setting\n    mailpile> unset sys.gpg_binary\n    ...\n\nThere is also a help command, and you can use tab completion to try and\n\"guess\" what commands exist.\n\n    mailpile> help\n    ...\n    mailpile> help tags\n    ...\n\nFinally, the app ships with a `hacks` plugin which is disabled by default.\nIf you load it, that will add a few more low-level commands, including an\nembedded Python interpretor:\n\n    mailpile> plugins/load hacks\n    ...\n\n    mailpile> hacks/pycli\n    ...\n\nThere's sure to be more; please feel free to file a pull request against\nthis document to add your favourite tricks or clarify these.\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.791015625,
          "content": "FROM debian:stretch-slim\n\nENV GID 33411\nENV UID 33411\n\nRUN apt-get update && \\\n    apt-get install -y curl apt-transport-https gnupg && \\\n    curl -s https://packages.mailpile.is/deb/key.asc | apt-key add - && \\\n    echo \"deb https://packages.mailpile.is/deb release main\" | tee /etc/apt/sources.list.d/000-mailpile.list && \\\n    apt-get update && \\\n    apt-get install -y mailpile && \\\n    # TODO Enable apache for multi users\n    # apt-get install -y mailpile-apache2\n    update-rc.d tor defaults && \\\n    service tor start && \\\n    groupadd -g $GID mailpile && \\\n    useradd -u $UID -g $GID -m mailpile && \\\n    su - mailpile -c 'mailpile setup' && \\\n    apt-get clean\n\nWORKDIR /home/mailpile\nUSER mailpile\n\nVOLUME /home/mailpile/.local/share/Mailpile\nEXPOSE 33411\n\nCMD mailpile --www=0.0.0.0:33411/ --wait\n"
        },
        {
          "name": "Dockerfile.dev",
          "type": "blob",
          "size": 0.6015625,
          "content": "FROM mailpile\n\n# Install C compiler for python deps w/ native extensions\nRUN apk --no-cache add \\\n  gcc \\\n  libc-dev \\\n  python-dev \\\n  shadow\n\n# Workaround: Setting mailpile users uid to 1000 to have write permissions\n# from the docker host the to the shared volumes /Mailpile and /mailpile-data.\n# Mounted volumes seem to be configured w/ uid/guid = 1000.\n# Learn more here:\n# - https://github.com/docker/docker/issues/7198\n# - https://denibertovic.com/posts/handling-permissions-with-docker-volumes/\nRUN usermod -u 1000 mailpile\n\nRUN pip install -r requirements-dev.txt\n\nRUN chmod +x /entrypoint.sh\n\nCMD [\"./mp\"]\n"
        },
        {
          "name": "Gruntfile.js",
          "type": "blob",
          "size": 2.794921875,
          "content": "module.exports = function(grunt) {\n\n  grunt.registerTask('watch', [ 'watch' ]);\n\n  grunt.initConfig({\n    concat: {\n      js: {\n        options: {\n          separator: ';'\n        },\n        src: [\n          'bower_components/jquery/dist/jquery.min.js',\n          'bower_components/underscore/underscore-min.js',\n          'bower_components/jquery-timer/jquery.timer.js',\n          'bower_components/autosize/dist/autosize.js',\n          'bower_components/mousetrap/mousetrap.js',\n          'shared-data/default-theme/js/mousetrap.global.bind.js',\n          'bower_components/jquery.ui/ui/jquery.ui.core.js',\n          'bower_components/jquery.ui/ui/jquery.ui.widget.js',\n          'bower_components/jquery.ui/ui/jquery.ui.mouse.js',\n          'bower_components/jquery.ui/ui/jquery.ui.draggable.js',\n          'bower_components/jquery.ui/ui/jquery.ui.droppable.js',\n          'bower_components/jquery.ui/ui/jquery.ui.sortable.js',\n          'bower_components/jqueryui-touch-punch/jquery.ui.touch-punch.js',\n          'bower_components/qtip2/basic/jquery.qtip.min.js',\n          'bower_components/jquery-slugify/dist/slugify.js',\n          'bower_components/typeahead.js/dist/typeahead.jquery.js',\n          'bower_components/bootstrap/js/dropdown.js',\n          'bower_components/bootstrap/js/modal.js',\n          'bower_components/favico.js/favico.js',\n          'bower_components/select2/select2.min.js',\n          'bower_components/moxie/bin/js/moxie.min.js',\n          'bower_components/plupload/js/plupload.min.js',\n          'bower_components/dompurify/dist/purify.min.js'\n        ],\n        dest: 'shared-data/default-theme/js/libraries.min.js'\n      }\n    },\n    uglify: {\n      options: {\n        mangle: false\n      },\n      js: {\n        files: {\n          'shared-data/default-theme/js/libraries.min.js': ['shared-data/default-theme/js/libraries.min.js']\n        }\n      }\n    },\n    less: {\n      options: {\n        cleancss: true\n      },\n      style: {\n        files: {\n          \"shared-data/default-theme/css/default.css\": \"shared-data/default-theme/less/default.less\"\n        }\n      }\n    },\n    watch: {\n      js: {\n        files: ['shared-data/default-theme/js/*.js'],\n        tasks: ['concat:js', 'uglify:js'],\n        options: {\n          livereload: true,\n        }\n      },\n      css: {\n        files: [\n          'shared-data/default-theme/less/config.less',\n          'shared-data/default-theme/less/default.less',\n          'shared-data/default-theme/less/app/*.less',\n          'shared-data/default-theme/less/libraries/*.less'\n        ],\n        tasks: ['less:style'],\n        options: {\n          livereload: true,\n        }\n      }\n    }\n  });\n\n  grunt.loadNpmTasks('grunt-contrib-concat');\n  grunt.loadNpmTasks('grunt-contrib-uglify');\n  grunt.loadNpmTasks('grunt-contrib-less');\n  grunt.loadNpmTasks('grunt-contrib-watch');\n\n};\n"
        },
        {
          "name": "MANIFEST.in",
          "type": "blob",
          "size": 0.6201171875,
          "content": "recursive-exclude locale *\nrecursive-exclude scripts *\nrecursive-exclude testing *\nrecursive-include mailpile/tests/data *\nrecursive-exclude mailpile/tests/data *~\nrecursive-include mailpile/locale *.mo *.po *.pot\nrecursive-include mailpile/plugins *\ninclude Makefile\ninclude README.md\ninclude AGPLv3.txt\ninclude LICENSE-2.0.txt\ninclude requirements.txt\ninclude test-requirements.txt\ninclude requirements-dev.txt\ninclude install_hooks.py\ninclude scripts/compile-messages.sh\ninclude scripts/make-messages.sh\ninclude scripts/mailpile-test.py\ninclude scripts/test-sendmail.sh\ninclude scripts/setup-test.sh\nrecursive-include shared-data *\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 9.400390625,
          "content": "# Recipes for stuff\nexport PYTHONPATH := .\n\nhelp:\n\t@echo \"\"\n\t@echo \"BUILD\"\n\t@echo \"    dpkg\"\n\t@echo \"        Create a debian package of this service (in a Docker \"\n\t@echo \"        container).\"\n\t@echo \"\"\n\n\nall:\tsubmodules alltests docs web compilemessages transifex\n\ndev:\n\t@echo export PYTHONPATH=`pwd`\n\narch-dev:\n\tsudo pacman -Syu --needed community/python2-pillow extra/python2-lxml community/python2-jinja \\\n\t                 community/python2-pep8 extra/python2-nose community/phantomjs \\\n\t                 extra/python2-pip community/python2-mock \\\n\t                 extra/ruby community/npm community/spambayes\n\tTMPDIR=`mktemp -d /tmp/aur.XXXXXXXXXX`; \\\n\tcd $$TMPDIR; \\\n\tpacman -Qs '^yuicompressor$$' > /dev/null; \\\n\tif [ $$? -ne 0 ]; then \\\n\t  sudo pacman -S --needed core/base-devel; \\\n\t  curl -s https://aur.archlinux.org/cgit/aur.git/snapshot/yuicompressor.tar.gz | tar xzv; \\\n\t  cd yuicompressor; \\\n\t  makepkg -si; \\\n\t  cd $$TMPDIR; \\\n\tfi; \\\n\tcd /tmp; \\\n\trm -rf $$TMPDIR\n\tsudo pip2 install 'selenium>=2.40.0'\n\twhich lessc >/dev/null || sudo gem install therubyracer less\n\twhich bower >/dev/null || sudo npm install -g bower\n\twhich uglify >/dev/null || sudo npm install -g uglify\n\nfedora-dev:\n\tsudo yum install python-imaging python-lxml python-jinja2 python-pep8 \\\n\t                     ruby ruby-devel python-yui python-nose spambayes \\\n\t                     phantomjs python-pip python-mock npm\n\tsudo yum install rubygems; \\\n\tsudo yum install python-pgpdump || pip install pgpdump\n\tsudo pip install 'selenium>=2.40.0'\n\twhich lessc >/dev/null || sudo gem install therubyracer less\n\twhich bower >/dev/null || sudo npm install -g bower\n\twhich uglify >/dev/null || sudo npm install -g uglify\n\ndebian-dev:\n\tsudo apt-get install python-imaging python-lxml python-jinja2 pep8 \\\n\t                     ruby-dev yui-compressor python-nose spambayes \\\n\t                     python-pip python-mock python-selenium \\\n\t\t\t\t\t\t rubygems-integration\n\tdpkg -l|grep -qP ' nodejs .*nodesource' || sudo apt install npm\n\tsudo apt-get install python-pgpdump || pip install pgpdump\n\twhich phantomjs >/dev/null || sudo apt-get install phantomjs || sudo npm install -g phantomjs\n\twhich lessc >/dev/null || sudo gem install therubyracer less\n\twhich bower >/dev/null || sudo npm install -g bower\n\twhich uglify >/dev/null || sudo npm install -g uglify\n\n\nsubmodules:\n\tgit submodule update --remote\n\ndocs: submodules\n\t@python2.7 mailpile/urlmap.py |grep -v ^FIXME: >doc/URLS.md\n\t@ls -l doc/URLS.md\n\t@python2.7 mailpile/defaults.py |grep -v -e ^FIXME -e ';timestamp' \\\n           >doc/defaults.cfg\n\t@ls -l doc/defaults.cfg\n\nweb: less js\n\t@true\n\nalltests: clean pytests\n\t@chmod go-rwx mailpile/tests/data/gpg-keyring\n\t@DISPLAY= nosetests\n\t@DISPLAY= python2.7 scripts/mailpile-test.py || true\n\t@git checkout mailpile/tests/data/\n\npytests:\n\t@echo -n 'security         ' && python2.7 mailpile/security.py\n\t@echo -n 'urlmap           ' && python2.7 mailpile/urlmap.py -nomap\n\t@echo -n 'search           ' && python2.7 mailpile/search.py\n\t@echo -n 'mailboxes.mbox   ' && python2.7 mailpile/mailboxes/mbox.py\n\t@echo -n 'mailutils.safe   ' && python2.7 mailpile/mailutils/safe.py\n\t@echo -n 'mailutils.addrs  ' && python2.7 mailpile/mailutils/addresses.py\n\t@echo -n 'mailutils.emails ' && python2.7 mailpile/mailutils/emails.py\n\t@echo -n 'config/base      ' && python2.7 mailpile/config/base.py\n\t@echo -n 'config/validators' && python2.7 mailpile/config/validators.py\n\t@echo -n 'config/manager   ' && python2.7 mailpile/config/manager.py\n\t@echo -n 'conn_brokers     ' && python2.7 mailpile/conn_brokers.py\n\t@echo -n 'crypto/autocrypt ' && python2.7 mailpile/crypto/autocrypt.py\n\t@echo -n 'plug...autocrypt ' && python2.7 mailpile/plugins/crypto_autocrypt.py\n\t@echo -n 'crypto/mime      ' && python2.7 mailpile/crypto/mime.py\n\t@echo -n 'index.base       ' && python2.7 mailpile/index/base.py\n\t@echo -n 'index.msginfo    ' && python2.7 mailpile/index/msginfo.py\n\t@echo -n 'index.mailboxes  ' && python2.7 mailpile/index/mailboxes.py\n\t@echo -n 'index.search     ' && python2.7 mailpile/index/search.py\n\t@echo -n 'util             ' && python2.7 mailpile/util.py\n\t@echo -n 'vcard            ' && python2.7 mailpile/vcard.py\n\t@echo -n 'workers          ' && python2.7 mailpile/workers.py\n\t@echo -n 'packing          ' && python2.7 mailpile/packing.py\n\t@echo -n 'mailboxes/pop3   ' && python2.7 mailpile/mailboxes/pop3.py\n\t@echo -n 'mail_source/imap ' && python2.7 mailpile/mail_source/imap.py\n\t@echo -n 'crypto/aes_utils ' && python2.7 mailpile/crypto/aes_utils.py\n\t@echo 'spambayes...        ' && python2.7 mailpile/spambayes/Tester.py\n\t@echo 'crypto/streamer...'   && python2.7 mailpile/crypto/streamer.py\n\t@echo\n\nclean:\n\t@rm -f `find . -name \\\\*.pyc` \\\n\t       `find . -name \\\\*.pyo` \\\n\t       `find . -name \\\\*.mo` \\\n\t        mailpile-tmp.py mailpile.py \\\n\t        ChangeLog AUTHORS \\\n\t        .appver MANIFEST .SELF .*deps \\\n                dist/*.tar.gz dist/*.deb dist/*.rpm \\\n\t        scripts/less-compiler.mk ghostdriver.log\n\t@rm -rf *.egg-info build/ \\\n               mailpile/tests/data/tmp/ testing/tmp/\n\t@rm -f shared-data/multipile/www/admin.cgi\n\nmrproper: clean\n\t@rm -rf shared-data/locale/?? shared-data/locale/??[_@]*\n\t@rm -rf bower_components/ shared-data/locale/mailpile.pot\n\t@rm -rf mp-virtualenv/\n\tgit reset --hard && git clean -dfx\n\nsdist: clean\n\t@python setup.py sdist\n\n#bdist-prep: compilemessages web -- FIXME: Make building web assets work!\nbdist-prep: compilemessages\n\t@true\n\nbdist:\n\t@python setup.py bdist_wheel\n\nvirtualenv: mp-virtualenv/bin/activate\nvirtualenv-dev: mp-virtualenv/bin/.dev\n\nmp-virtualenv/bin/activate:\n\tvirtualenv -p python2.7 --system-site-packages mp-virtualenv\n\tbash -c 'source mp-virtualenv/bin/activate && pip install -r requirements.txt && python setup.py install'\n\t@rm -rf mp-virtualenv/bin/.dev\n\t@echo\n\t@echo NOTE: If you want to test/develop with GnuPG 2.1, you might\n\t@echo       want to activate the virtualenv and then run this script\n\t@echo to build GnuPG 2.1: ./scripts/add-gpgme-and-gnupg-to-venv\n\t@echo\n\nmp-virtualenv/bin/.dev: virtualenv\n\trm -rf mp-virtualenv/lib/python2.7/site-packages/mailpile\n\tcd mp-virtualenv/lib/python2.7/site-packages/ && ln -s ../../../../mailpile\n\trm -rf mp-virtualenv/share/mailpile\n\tcd mp-virtualenv/share/ && ln -s ../../shared-data mailpile\n\t@touch mp-virtualenv/bin/.dev\n\nbower_components:\n\t@bower install\n\njs: bower_components\n\t# Warning: Horrible hack to extract rules from Gruntfile.js\n\t@rm -f shared-data/default-theme/js/libraries.min.js\n\t@rm -f shared-data/default-theme/js/mailpile-min.js.tmp*\n\t@cat Gruntfile.js \\\n                |sed -e '1,/concat:/d ' \\\n                |sed -e '1,/src:/d' -e '/dest:/,$$d' \\\n                |grep / \\\n                |sed -e \"s/[',]/ /g\" \\\n            |xargs sed -e '$$a;' \\\n            >> shared-data/default-theme/js/mailpile-min.js.tmp\n\t@uglify -s shared-data/default-theme/js/mailpile-min.js.tmp \\\n               -o shared-data/default-theme/js/mailpile-min.js.tmp2\n\t@sed -e \"s/@MP_JSBUILD_INFO@/`./scripts/gitwhere.sh`/\" \\\n\t    < shared-data/default-theme/js/libraries.js \\\n\t    > shared-data/default-theme/js/libraries.min.js\n\t@echo '/* Sources...' \\\n\t    >> shared-data/default-theme/js/libraries.min.js\n\t@bower --offline --no-color list \\\n\t    >> shared-data/default-theme/js/libraries.min.js\n\t@echo '*/' \\\n\t    >> shared-data/default-theme/js/libraries.min.js\n\t@cat shared-data/default-theme/js/mailpile-min.js.tmp2 \\\n            >> shared-data/default-theme/js/libraries.min.js\n\t@rm -f shared-data/default-theme/js/mailpile-min.js.tmp*\n\nless: less-compiler bower_components\n\t@cp -fa \\\n                bower_components/select2/select2.png \\\n                bower_components/select2/select2x2.png \\\n                bower_components/select2/select2-spinner.gif \\\n            shared-data/default-theme/css/\n\t@make -s -f scripts/less-compiler.mk\n\nless-loop: less-compiler\n\t@echo 'Running less compiler every 15 seconds. CTRL+C quits.'\n\t@while [ 1 ]; do \\\n                make -s less; \\\n                sleep 15; \\\n        done\n\nless-compiler:\n\tbower install\n\t@cp scripts/less-compiler.in scripts/less-compiler.mk\n\t@find shared-data/default-theme/less/ -name '*.less' \\\n                |perl -npe s'/^/\\t/' \\\n\t\t|perl -npe 's/$$/\\\\/' \\\n                >>scripts/less-compiler.mk\n\t@echo >> scripts/less-compiler.mk\n\t@perl -e 'print \"\\t\\@touch .less-deps\", $/' >> scripts/less-compiler.mk\n\ngenmessages:\n\t@scripts/make-messages.sh\n\ncompilemessages:\n\t@scripts/compile-messages.sh\n\ntransifex:\n\ttx pull -a --minimum-perc=25\n\ttx pull -l is,en_GB\n\n\n# -----------------------------------------------------------------------------\n# BUILD\n# -----------------------------------------------------------------------------\n\ndist/version.txt: mailpile/config/defaults.py scripts/version.py\n\tmkdir -p dist\n\tscripts/version.py > dist/version.txt\n\ndist/mailpile.tar.gz: mrproper genmessages transifex dist/version.txt\n\tgit submodule update --init --recursive\n\tgit submodule foreach 'git reset --hard && git clean -dfx'\n\tmkdir -p dist\n\tscripts/version.py > dist/version.txt\n\ttar --exclude='./packages/debian' --exclude=dist --exclude-vcs -czf dist/mailpile-$$(cat dist/version.txt).tar.gz -C $(shell pwd) .\n\t(cd dist; ln -fs mailpile-$$(cat version.txt).tar.gz mailpile.tar.gz)\n\n.dockerignore: dist/version.txt packages/Dockerfile_debian packages/debian packages/debian/rules\n\tmkdir -p dist\n\tdocker build \\\n\t    --file=packages/Dockerfile_debian \\\n\t    --tag=mailpile-deb-builder \\\n\t    ./\n\ttouch .dockerignore\n\ndpkg: dist/mailpile.tar.gz .dockerignore\n\tdocker run \\\n\t    --rm --volume=$$(pwd)/dist:/mnt/dist \\\n\t    mailpile-deb-builder\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.271484375,
          "content": "# Welcome to Mailpile! #\n\n**IMPORTANT NOTE**\n\nDevelopment on this codebase has halted, until the\n[Python3 rewrite](https://community.mailpile.is/t/a-very-uninformative-progress-update-mailpile-2/785)\nhas completed.\n\nApologies to those who have unanswered, out-standing pull requests and\nissues.  Your efforts are appreciated!\n\nIf you rely on this code and have your own branch which you actively\nmaintain, let us know: we would be happy to link to it.\n\nIf you need to run Mailpile v1 to access legacy data, consider using\nour [legacy Docker images](https://github.com/mailpile/Mailpile-v1-Docker).\n\n\n------------------------------------------------------------------------\n\n## Introduction (Obsolete) ##\n\nMailpile (<https://www.mailpile.is/>) is a modern, fast web-mail client\nwith user-friendly encryption and privacy features. The development of\nMailpile is funded by\n[a large community of backers](https://www.mailpile.is/#community)\nand all code related to the project is and will be released under an OSI\napproved Free Software license.\n\nMailpile places great emphasis on providing a clean, elegant user\ninterface and pleasant user experience. In particular, Mailpile aims to\nmake it easy and convenient to receive and send PGP encrypted or signed\ne-mail.\n\nMailpile's primary user interface is web-based, but it also has a basic\ncommand-line interface and an API for developers. Using web technology\nfor the interface allows Mailpile to function both as a local desktop\napplication (accessed by visiting `localhost` in the browser) or a\nremote web-mail on a personal server or VPS.\n\nThe core of Mailpile is a fast search engine, custom written to deal\nwith large volumes of e-mail on consumer hardware. The search engine\nallows e-mail to be organized using tags (similar to GMail's labels) and\nthe application can be configured to automatically tag incoming mail\neither based on static rules or bayesian classifiers.\n\n\n### Trying Mailpile\n\nIf you need to run Mailpile v1 to access legacy data, consider using\nour [legacy Docker images](https://github.com/mailpile/Mailpile-v1-Docker).\n\n\n## Credits and License ##\n\nBjarni R. Einarsson (<http://bre.klaki.net/>) created this!  If you\nthink it's neat, you should also check out PageKite:\n<https://pagekite.net/>. [Smri](<http://www.smarimccarthy.is/>) and\n[Brennan](https://brennannovak.com) joined the team in 2013 and made\nthis a real project (not just a toy search engine).\n\nThe original GMail team deserve a mention for their inspiring work:\nwishing the Free Software world had something like GMail is what\nmotivated Bjarni to start working on Mailpile. We would also like to\nthank Edward Snowden for inspiring us to try and make PGP usable for\njournalists and everday folks!\n\nContributors:\n\n- Bjarni R. Einarsson (<http://bre.klaki.net/>)\n- Brennan Novak (<https://brennannovak.com/>)\n- Smari McCarthy (<http://www.smarimccarthy.is/>)\n- Lots more, run `git shortlog -s` for a list! (Or check\n  [GitHub](https://github.com/mailpile/Mailpile/graphs/contributors).)\n\nAnd of course, we couldn't do this without [our community of\nbackers](https://www.mailpile.is/#community).\n\nThis program is free software: you can redistribute it and/or modify it\nunder the terms of the GNU Affero General Public License as published by\nthe Free Software Foundation. See the file `COPYING.md` for details.\n\n"
        },
        {
          "name": "babel.cfg",
          "type": "blob",
          "size": 0.8369140625,
          "content": "# Extraction from Python source files\n[python: mailpile/**.py]\nencoding = utf-8\n\n[python: shared-data/contrib/**.py]\nencoding = utf-8\n\n[python: shared-data/multiple/**.py]\nencoding = utf-8\n\n[python: shared-data/mailpile-gui/**.py]\nencoding = utf-8\n\n# Extraction from Jinja2 template files\n[jinja2: shared-data/default-theme/html/**]\nencoding = utf-8\nignore_tags = style\nextensions = jinja2.ext.do,jinja2.ext.autoescape,mailpile.www.jinjaextensions.MailpileCommand\nsilent = false\n\n[jinja2: shared-data/contrib/html/**.html]\nencoding = utf-8\nignore_tags = style\nextensions = jinja2.ext.do,jinja2.ext.autoescape,mailpile.www.jinjaextensions.MailpileCommand\nsilent = false\n\n[jinja2: shared-data/contrib/html/**.js]\nencoding = utf-8\nignore_tags = style\nextensions = jinja2.ext.do,jinja2.ext.autoescape,mailpile.www.jinjaextensions.MailpileCommand\nsilent = false\n"
        },
        {
          "name": "bower.json",
          "type": "blob",
          "size": 0.91796875,
          "content": "{\n  \"name\": \"mailpile\",\n  \"version\": \"0.1.0\",\n  \"homepage\": \"https://mailpile.is\",\n  \"authors\": [\n    \"Various\"\n  ],\n  \"description\": \"Front end libraries and dependencies for Mailpile default theme\",\n  \"main\": \"libraries.js\",\n  \"license\": \"Various\",\n  \"private\": true,\n  \"ignore\": [\n    \"**/.*\",\n    \"node_modules\",\n    \"bower_components\",\n    \"test\",\n    \"tests\"\n  ],\n  \"dependencies\": {\n    \"underscore\": \">=1.7.0\",\n    \"bootstrap\": \"~3.3.0\",\n    \"favico.js\": \"~0.3.5\",\n    \"html5shiv\": \"~3.7.0\",\n    \"jquery\": \"~2.1\",\n    \"autosize\": \"~3.0.14\",\n    \"jquery-confirm\": \"~2.1.1\",\n    \"jquery-slugify\": \"~1.0.3\",\n    \"jquery-timer\": \"*\",\n    \"jquery.ui\": \"~1.10\",\n    \"less-elements-old\": \"~1.0\",\n    \"mousetrap\": \"~1.6.0\",\n    \"moxie\": \"~1.3.4\",\n    \"plupload\": \"~2.1.2\",\n    \"qtip2\": \"~2.1.1\",\n    \"rebar\": \"~0.3.2\",\n    \"select2\": \"3.5.4\",\n    \"typeahead.js\": \"~0.10.5\",\n    \"jqueryui-touch-punch\": \"*\",\n    \"dompurify\": \"~1.0.11\"\n  }\n}\n"
        },
        {
          "name": "default-theme",
          "type": "blob",
          "size": 0.025390625,
          "content": "shared-data/default-theme/"
        },
        {
          "name": "design",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "commit",
          "content": null
        },
        {
          "name": "docker-compose.dev.yml",
          "type": "blob",
          "size": 0.296875,
          "content": "version: '3.0'\nservices:\n  mailpile_dev:\n    tty: true\n    stdin_open: true\n    container_name: mailpile_dev\n    build:\n      context: .\n      dockerfile: Dockerfile.dev\n    image: mailpile_dev\n    volumes:\n      - .:/Mailpile\n      - .dev-mailpile-data:/mailpile-data:rw\n    ports:\n      - 33412:33411\n\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 0.201171875,
          "content": "version: '3.0'\nservices:\n  mailpile:\n    container_name: mailpile\n    build: .\n    image: mailpile\n    volumes:\n      - .:/Mailpile\n      - .dev-mailpile-data:/mailpile-data\n    ports:\n      - 33411:33411\n\n"
        },
        {
          "name": "external-plugins",
          "type": "blob",
          "size": 0.0185546875,
          "content": "shared-data/contrib"
        },
        {
          "name": "install_hooks.py",
          "type": "blob",
          "size": 0.4267578125,
          "content": "import os\nimport sys\n\ndef symlink_develop(config):\n    if 'develop' in sys.argv:\n        share_path = os.path.join(sys.prefix, 'share')\n\n        if not os.path.exists(share_path):\n            os.makedirs(share_path)\n\n        os.symlink(\n            os.path.join(\n                os.path.dirname(os.path.realpath(__file__)),\n                'shared-data'\n            ),\n            os.path.join(sys.prefix, 'share', 'mailpile')\n        )\n"
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "locale",
          "type": "blob",
          "size": 0.0185546875,
          "content": "shared-data/locale/"
        },
        {
          "name": "mailpile",
          "type": "tree",
          "content": null
        },
        {
          "name": "mp",
          "type": "blob",
          "size": 0.015625,
          "content": "scripts/mailpile"
        },
        {
          "name": "mp.cmd",
          "type": "blob",
          "size": 0.3798828125,
          "content": "@echo off\nset PATH=%PATH%;GnuPG\\;OpenSSL\\;\nset PYTHONPATH=%~dp0;%~dp0\\GnuPG\\;%~dp0\\OpenSSL\\;\nif exist python27\\python.exe (\n  set PYTHONBIN=python27\\python.exe\n) else if exist c:\\python27\\python.exe (\n  set PYTHONBIN=c:\\python27\\python.exe\n) else (\n  set PYTHONBIN=python\n)\nREM i18n support doesn't work on Windows, default to English.\nset LANG=en\nSTART /B %PYTHONBIN% scripts\\mailpile %*\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.240234375,
          "content": "{\n  \"name\": \"mailpile\",\n  \"version\": \"0.4.1\",\n  \"devDependencies\": {\n    \"grunt\": \"latest\",\n    \"grunt-contrib-concat\": \"latest\",\n    \"grunt-contrib-uglify\": \"latest\",\n    \"grunt-contrib-less\": \"latest\",\n    \"grunt-contrib-watch\": \"latest\"\n  }\n}\n"
        },
        {
          "name": "packages",
          "type": "tree",
          "content": null
        },
        {
          "name": "requirements-dev.txt",
          "type": "blob",
          "size": 0.22265625,
          "content": "appdirs\nsetuptools>=11.3\ncryptography>=1.3.4\nlxml>=2.3.2\nimgsize\nJinja2\nselenium>=2.40.0\nmarkupsafe\nnose\nmock>=1.0.1\npycrypto\npyDNS\nPySocks\npgpdump\npillow\npbr\nfasteners\nwin_inet_pton; sys_platform == 'win32'\nstem>=1.4\nicalendar\n"
        },
        {
          "name": "requirements-with-deps.txt",
          "type": "blob",
          "size": 0.208984375,
          "content": "appdirs\ncryptography>=1.3.4\nlxml>=2.3.2\nimgsize\nJinja2\nspambayes>=1.1b1\nmarkupsafe\npyDNS\nPySocks\npgpdump\npillow\npbr\nidna\nasn1crypto\nsix\nenum34\nipaddress\ncffi\nlockfile\npyasn1\npycparser\nfasteners\nmonotonic\nstem>=1.4\n"
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 0.1435546875,
          "content": "appdirs\nsetuptools>=11.3\ncryptography>=1.3.4\nlxml>=2.3.2\nimgsize\nJinja2\nmarkupsafe\npy3DNS\nPySocks\npgpdump\npillow\npbr\nfasteners\nstem>=1.4\nicalendar\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "setup.cfg",
          "type": "blob",
          "size": 0.9345703125,
          "content": "[metadata]\nname = mailpile\nlicense = AGPLv3+\nauthor = Mailpile ehf.\nauthor_email = team@mailpile.is\nurl = https://www.mailpile.is/\nsummary = An e-mail search engine and webmail client, with easy encryption and privacy.\ndescription-file = README.md\nclassifier = \n    Development Status :: 4 - Beta\n    Programming Language :: Python :: 2.7\n    Programming Language :: JavaScript\n    License :: OSI Approved :: GNU Affero General Public License v3 or later (AGPLv3+)\n    Intended Audience :: End Users/Desktop\n    Topic :: Communications :: Email :: Email Clients (MUA)\n    Topic :: Security :: Cryptography\n    Operating System :: POSIX\n    Environment :: Console\n    Environment :: Web Environment\nkeywords =\n    email\n    webmail\n    search\n    pgp\n\n[files]\npackages = mailpile\ndata_files =\n    share/mailpile = shared-data/*\n\n[entry_points]\nconsole_scripts =\n    mailpile = mailpile.__main__:main\n\n[global]\nsetup-hooks =\n    install_hooks.symlink_develop\n"
        },
        {
          "name": "setup.py",
          "type": "blob",
          "size": 2.5361328125,
          "content": "#!/usr/bin/env python2.7\nfrom __future__ import print_function\nfrom datetime import date\nfrom setuptools import setup, find_packages\nfrom setuptools.command.build_py import build_py\nimport datetime\nimport os\nimport re\nimport subprocess\nfrom glob import glob\n\nfrom scripts.version import APPVER\n\nhere = os.path.abspath(os.path.dirname(__file__))\n\n########################################################\n##################### PBR Fix ##########################\n## Issue: https://bugs.launchpad.net/pbr/+bug/1530867 ##\n## PR: https://review.openstack.org/#/c/263297/ ########\n########################################################\n\nimport pbr.git\n\ndef _get_submodules(git_dir):\n    submodules = pbr.git._run_git_command(['submodule', 'status'], git_dir)\n    submodules = [s.strip().split(' ')[1]\n                  for s in submodules.split('\\n')\n                  if s != '']\n    return submodules\n\ndef _find_git_files(dirname='', git_dir=None):\n    \"\"\"Behave like a file finder entrypoint plugin.\n\n    We don't actually use the entrypoints system for this because it runs\n    at absurd times. We only want to do this when we are building an sdist.\n    \"\"\"\n    file_list = []\n    if git_dir is None:\n        git_dir = pbr.git._run_git_functions()\n    if git_dir:\n        file_list = pbr.git._run_git_command(['ls-files', '-z'], git_dir)\n        file_list += pbr.git._run_git_command(\n            ['submodule', 'foreach', '--quiet', 'ls-files', '-z'],\n            git_dir\n        )\n        # Users can fix utf8 issues locally with a single commit, so we are\n        # strict here.\n        file_list = file_list.split(b'\\x00'.decode('utf-8'))\n        submodules = _get_submodules(git_dir)\n    return [f for f in file_list if f and f not in submodules]\n\npbr.git._find_git_files = _find_git_files\n\n########## end of pbr fix ######\n\n\n## Cleanup ###################################################################\ntry:\n    assert(0 == subprocess.call(['make', 'clean'], cwd=here))\nexcept:\n    print(\"Faild to run 'make clean'. Bailing out.\")\n    exit(1)\n\n\n## Install ###################################################################\n\nclass Builder(build_py):\n    def run(self):\n        try:\n            assert(0 == subprocess.call(['make', 'bdist-prep'], cwd=here))\n        except:\n            print(\"Error building package. Try running 'make'.\")\n            exit(1)\n        else:\n            build_py.run(self)\n\n\n## \"Main\" ####################################################################\n\nsetup(\n    setup_requires=['pbr'],\n    version=APPVER,\n    pbr=True,\n    cmdclass={'build_py': Builder},\n)\n"
        },
        {
          "name": "shared-data",
          "type": "tree",
          "content": null
        },
        {
          "name": "submodules",
          "type": "tree",
          "content": null
        },
        {
          "name": "test-requirements.txt",
          "type": "blob",
          "size": 0.0458984375,
          "content": "selenium>=2.40.0\nmock>=1.0.1\ncoverage\nnose\ntox\n"
        },
        {
          "name": "testing-data",
          "type": "blob",
          "size": 0.01953125,
          "content": "mailpile/tests/data/"
        },
        {
          "name": "tox.ini",
          "type": "blob",
          "size": 0.2587890625,
          "content": "[tox]\nenvlist = py27\n\n[testenv]\nVIRTUAL_ENV={envdir}\ndeps = -r{toxinidir}/requirements.txt\n       -r{toxinidir}/test-requirements.txt\ncommands =\n    nosetests {toxinidir}/mailpile/tests --with-coverage --cover-package=mailpile\n    python ./scripts/mailpile-test.py\n"
        }
      ]
    }
  ]
}