{
  "metadata": {
    "timestamp": 1736561035758,
    "page": 807,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "mbadry1/DeepLearning.ai-Summary",
      "stars": 5173,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0634765625,
          "content": "# Auto detect text files and perform LF normalization\n* text=auto"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.03515625,
          "content": "# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# Distribution / packaging\n.Python\nenv/\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\n*.egg-info/\n.installed.cfg\n*.egg\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test / coverage reports\nhtmlcov/\n.tox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*,cover\n.hypothesis/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# pyenv\n.python-version\n\n# celery beat schedule file\ncelerybeat-schedule\n\n# dotenv\n.env\n\n# virtualenv\n.venv/\nvenv/\nENV/\n\n# Spyder project settings\n.spyderproject\n\n# Rope project settings\n.ropeproject\n"
        },
        {
          "name": "1- Neural Networks and Deep Learning",
          "type": "tree",
          "content": null
        },
        {
          "name": "2- Improving Deep Neural Networks",
          "type": "tree",
          "content": null
        },
        {
          "name": "3- Structuring Machine Learning Projects",
          "type": "tree",
          "content": null
        },
        {
          "name": "4- Convolutional Neural Networks",
          "type": "tree",
          "content": null
        },
        {
          "name": "5- Sequence Models",
          "type": "tree",
          "content": null
        },
        {
          "name": "Certificate.png",
          "type": "blob",
          "size": 222.0283203125,
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.037109375,
          "content": "MIT License\n\nCopyright (c) 2017 MBadry\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE."
        },
        {
          "name": "Notebooks headers.md",
          "type": "blob",
          "size": 22.6572265625,
          "content": "# Notebooks headers\n\nIn this document, i present the whole notebook assignments headers of [deeplearning.ai](https://deeplearning.ai). It may help someone know the code contents of the course or to fast check the applications the courses has dealt with.\n\n## Table of contents\n\n* [Notebooks headers](#notebooks-headers)\n   * [Table of contents](#table-of-contents)\n   * [Neural Networks and Deep Learning](#neural-networks-and-deep-learning)\n      * [Python Basics with Numpy (optional assignment)](#python-basics-with-numpy-optional-assignment)\n      * [Logistic Regression with a Neural Network mindset](#logistic-regression-with-a-neural-network-mindset)\n      * [Planar data classification with one hidden layer](#planar-data-classification-with-one-hidden-layer)\n      * [Building your Deep Neural Network: Step by Step](#building-your-deep-neural-network-step-by-step)\n      * [Deep Neural Network for Image Classification: Application](#deep-neural-network-for-image-classification-application)\n   * [Improving Deep Neural Networks](#improving-deep-neural-networks)\n      * [Initialization](#initialization)\n      * [Regularization](#regularization)\n      * [TensorFlow Tutorial](#tensorflow-tutorial)\n      * [Optimization Methods](#optimization-methods)\n      * [Gradient Checking](#gradient-checking)\n   * [Structuring Machine Learning Projects](#structuring-machine-learning-projects)\n   * [Convolutional Neural Networks](#convolutional-neural-networks)\n      * [Convolutional Neural Networks: Step by Step](#convolutional-neural-networks-step-by-step)\n      * [Convolutional Neural Networks: Application](#convolutional-neural-networks-application)\n      * [Keras tutorial - the Happy House](#keras-tutorial---the-happy-house)\n      * [Residual Networks](#residual-networks)\n      * [Deep Learning &amp; Art: Neural Style Transfer](#deep-learning--art-neural-style-transfer)\n      * [Autonomous driving - Car detection](#autonomous-driving---car-detection)\n   * [Sequence Models](#sequence-models)\n      * [Building a recurrent neural network - step by step](#building-a-recurrent-neural-network---step-by-step)\n      * [Dinosaur Island -- Character-level language model](#dinosaur-island----character-level-language-model)\n      * [Jazz improvisation with LSTM](#jazz-improvisation-with-lstm)\n      * [Emojify](#emojify)\n      * [Word Vector Representation](#word-vector-representation)\n      * [Machine Translation (Neural Machine Translation)](#machine-translation-neural-machine-translation)\n      * [Trigger word detection](#trigger-word-detection)\n\n\n## Neural Networks and Deep Learning\n\n### Python Basics with Numpy (optional assignment)\n\nWelcome to your first assignment. This exercise gives you a brief introduction to Python. Even if you've used Python before, this will help familiarize you with functions we'll need.  \n\n**Instructions:**\n- You will be using Python 3.\n- Avoid using for-loops and while-loops, unless you are explicitly told to do so.\n- Do not modify the (# GRADED FUNCTION [function name]) comment in some cells. Your work would not be graded if you change this. Each cell containing that comment should only contain one function.\n- After coding your function, run the cell right below it to check if your result is correct.\n\n**After this assignment you will:**\n- Be able to use iPython Notebooks\n- Be able to use numpy functions and numpy matrix/vector operations\n- Understand the concept of \"broadcasting\"\n- Be able to vectorize code\n\nLet's get started!\n\n### Logistic Regression with a Neural Network mindset\n\nWelcome to your first (required) programming assignment! You will build a logistic regression classifier to recognize  cats. This assignment will step you through how to do this with a Neural Network mindset, and so will also hone your intuitions about deep learning.\n\n**Instructions:**\n- Do not use loops (for/while) in your code, unless the instructions explicitly ask you to do so.\n\n**You will learn to:**\n- Build the general architecture of a learning algorithm, including:\n    - Initializing parameters\n    - Calculating the cost function and its gradient\n    - Using an optimization algorithm (gradient descent) \n- Gather all three functions above into a main model function, in the right order.\n\n### Planar data classification with one hidden layer\n\nWelcome to your week 3 programming assignment. It's time to build your first neural network, which will have a hidden layer. You will see a big difference between this model and the one you implemented using logistic regression. \n\n**You will learn how to:**\n- Implement a 2-class classification neural network with a single hidden layer\n- Use units with a non-linear activation function, such as tanh \n- Compute the cross entropy loss \n- Implement forward and backward propagation\n\n### Building your Deep Neural Network: Step by Step\n\nWelcome to your week 4 assignment (part 1 of 2)! You have previously trained a 2-layer Neural Network (with a single hidden layer). This week, you will build a deep neural network, with as many layers as you want!\n\n- In this notebook, you will implement all the functions required to build a deep neural network.\n- In the next assignment, you will use these functions to build a deep neural network for image classification.\n\n**After this assignment you will be able to:**\n- Use non-linear units like ReLU to improve your model\n- Build a deeper neural network (with more than 1 hidden layer)\n- Implement an easy-to-use neural network class\n\n**Notation**:\n- Superscript <sup>[l]</sup> denotes a quantity associated with the `l.th` layer.\n    - Example: a<sup>[L]</sup> is the `L.th` layer activation. W<sup>[L]</sup> and b<sup>[L]</sup> are the `L.th` (last) layer parameters.\n- Superscript <sup>(i)</sup> denotes a quantity associated with the `i.th` example.\n    - Example: x<sup>(i)</sup> is the `i.th` training example.\n- Lowerscript <sub>i</sub> denotes the `i.th` entry of a vector.\n    - Example: a<sup>[l]</sup><sub>i</sub> denotes the `i.th` entry of the `l.th` layer's activations).\n\nLet's get started!\n\n### Deep Neural Network for Image Classification: Application\n\nWhen you finish this, you will have finished the last programming assignment of Week 4, and also the last programming assignment of this course! \n\nYou will use use the functions you'd implemented in the previous assignment to build a deep network, and apply it to cat vs non-cat classification. Hopefully, you will see an improvement in accuracy relative to your previous logistic regression implementation.  \n\n**After this assignment you will be able to:**\n- Build and apply a deep neural network to supervised learning. \n\nLet's get started!\n\n## Improving Deep Neural Networks\n\n### Initialization\n\nWelcome to the first assignment of \"Improving Deep Neural Networks\". \n\nTraining your neural network requires specifying an initial value of the weights. A well chosen initialization method will help learning.  \n\nIf you completed the previous course of this specialization, you probably followed our instructions for weight initialization, and it has worked out so far. But how do you choose the initialization for a new neural network? In this notebook, you will see how different initializations lead to different results. \n\nA well chosen initialization can:\n- Speed up the convergence of gradient descent\n- Increase the odds of gradient descent converging to a lower training (and generalization) error \n\nTo get started, run the following cell to load the packages and the planar dataset you will try to classify.\n\n### Regularization\n\nWelcome to the second assignment of this week. Deep Learning models have so much flexibility and capacity that **overfitting can be a serious problem**, if the training dataset is not big enough. Sure it does well on the training set, but the learned network **doesn't generalize to new examples** that it has never seen!\n\n**You will learn to:** Use regularization in your deep learning models.\n\nLet's first import the packages you are going to use.\n\n### TensorFlow Tutorial\n\nWelcome to this week's programming assignment. Until now, you've always used numpy to build neural networks. Now we will step you through a deep learning framework that will allow you to build neural networks more easily. Machine learning frameworks like TensorFlow, PaddlePaddle, Torch, Caffe, Keras, and many others can speed up your machine learning development significantly. All of these frameworks also have a lot of documentation, which you should feel free to read. In this assignment, you will learn to do the following in TensorFlow: \n\n- Initialize variables\n- Start your own session\n- Train algorithms \n- Implement a Neural Network\n\nPrograming frameworks can not only shorten your coding time, but sometimes also perform optimizations that speed up your code. \n\n### Optimization Methods\n\nUntil now, you've always used Gradient Descent to update the parameters and minimize the cost. In this notebook, you will learn more advanced optimization methods that can speed up learning and perhaps even get you to a better final value for the cost function. Having a good optimization algorithm can be the difference between waiting days vs. just a few hours to get a good result. \n\nGradient descent goes \"downhill\" on a cost function `J`. Think of it as trying to do this: \nAt each step of the training, you update your parameters following a certain direction to try to get to the lowest possible point. </center></caption>\n\n**Notations**: As usual, &part;J / &part;a =  `da` for any variable `a`.\n\nTo get started, run the following code to import the libraries you will need.\n\n### Gradient Checking\n\nWelcome to the final assignment for this week! In this assignment you will learn to implement and use gradient checking. \n\nYou are part of a team working to make mobile payments available globally, and are asked to build a deep learning model to detect fraud--whenever someone makes a payment, you want to see if the payment might be fraudulent, such as if the user's account has been taken over by a hacker. \n\nBut backpropagation is quite challenging to implement, and sometimes has bugs. Because this is a mission-critical application, your company's CEO wants to be really certain that your implementation of backpropagation is correct. Your CEO says, \"Give me a proof that your backpropagation is actually working!\" To give this reassurance, you are going to use \"gradient checking\".\n\nLet's do it!\n\n## Structuring Machine Learning Projects\n\nThere were no code assignments in this course.\n\n## Convolutional Neural Networks\n\n### Convolutional Neural Networks: Step by Step\n\nWelcome to Course 4's first assignment! In this assignment, you will implement convolutional (CONV) and pooling (POOL) layers in numpy, including both forward propagation and (optionally) backward propagation. \n\n**Notation**:\n- Superscript <sup>[l]</sup> denotes an object of the `l.th` layer.\n    - Example: a<sup>[4]</sup> is the `4.th` layer activation. W<sup>[5]</sup> and b<sup>[5]</sup> are the `5.<sup>th</sup>` layer parameters.\n\n\n- Superscript <sup>(i)</sup> denotes an object from the `i.th` example.\n    - Example: x<sup>(i)</sup> is the `i.th` training example input.\n\n- Lowerscript <sub>i</sub> denotes the `i.th` entry of a vector.\n    - Example: a<sup>[l]</sup><sub>i</sub> denotes the `i.th` entry of the activations in layer `l`, assuming this is a fully connected (FC) layer.\n\n- `n_H`, `n_W` and `n_C` denote respectively the height, width and number of channels of a given layer. If you want to reference a specific layer `l`, you can also write n_H<sup>[l]</sup>, n_W<sup>[l]</sup>, n_C<sup>[l]</sup>.\n- `n_H_prev`, `n_W_prev` and `n_C_prev` denote respectively the height, width and number of channels of the previous layer. If referencing a specific layer `l`, this could also be denoted n_H<sup>[l-1]</sup>, n_W<sup>[l-1]</sup>, n_C<sup>[l-1]</sup>.\n\nWe assume that you are already familiar with `numpy` and/or have completed the previous courses of the specialization. Let's get started!\n\n### Convolutional Neural Networks: Application\n\nWelcome to Course 4's second assignment! In this notebook, you will:\n\n- Implement helper functions that you will use when implementing a TensorFlow model\n- Implement a fully functioning ConvNet using TensorFlow \n\n**After this assignment you will be able to:**\n\n- Build and train a ConvNet in TensorFlow for a classification problem \n\nWe assume here that you are already familiar with TensorFlow. If you are not, please refer the *TensorFlow Tutorial* of the third week of Course 2 (\"*Improving deep neural networks*\").\n\n### Keras tutorial - the Happy House\n\nWelcome to the first assignment of week 2. In this assignment, you will:\n1. Learn to use Keras, a high-level neural networks API (programming framework), written in Python and capable of running on top of several lower-level frameworks including TensorFlow and CNTK. \n2. See how you can in a couple of hours build a deep learning algorithm.\n\nWhy are we using Keras? Keras was developed to enable deep learning engineers to build and experiment with different models very quickly. Just as TensorFlow is a higher-level framework than Python, Keras is an even higher-level framework and provides additional abstractions. Being able to go from idea to result with the least possible delay is key to finding good models. However, Keras is more restrictive than the lower-level frameworks, so there are some very complex models that you can implement in TensorFlow but not (without more difficulty) in Keras. That being said, Keras will work fine for many common models. \n\nIn this exercise, you'll work on the \"Happy House\" problem, which we'll explain below. Let's load the required packages and solve the problem of the Happy House!\n\n### Residual Networks\n\nWelcome to the second assignment of this week! You will learn how to build very deep convolutional networks, using Residual Networks (ResNets). In theory, very deep networks can represent very complex functions; but in practice, they are hard to train. Residual Networks, introduced by [He et al.](https://arxiv.org/pdf/1512.03385.pdf), allow you to train much deeper networks than were previously practically feasible.\n\n**In this assignment, you will:**\n- Implement the basic building blocks of ResNets. \n- Put together these building blocks to implement and train a state-of-the-art neural network for image classification. \n\nThis assignment will be done in Keras. \n\nBefore jumping into the problem, let's run the cell below to load the required packages.\n\n### Deep Learning & Art: Neural Style Transfer\n\nWelcome to the second assignment of this week. In this assignment, you will learn about Neural Style Transfer. This algorithm was created by Gatys et al. (2015) (https://arxiv.org/abs/1508.06576). \n\n**In this assignment, you will:**\n- Implement the neural style transfer algorithm \n- Generate novel artistic images using your algorithm \n\nMost of the algorithms you've studied optimize a cost function to get a set of parameter values. In Neural Style Transfer, you'll optimize a cost function to get pixel values!\n\n### Autonomous driving - Car detection\n\nWelcome to your week 3 programming assignment. You will learn about object detection using the very powerful YOLO model. Many of the ideas in this notebook are described in the two YOLO papers: Redmon et al., 2016 (https://arxiv.org/abs/1506.02640) and Redmon and Farhadi, 2016 (https://arxiv.org/abs/1612.08242). \n\n**You will learn to**:\n- Use object detection on a car detection dataset\n- Deal with bounding boxes\n\nRun the following cell to load the packages and dependencies that are going to be useful for your journey!\n\n## Sequence Models\n\n### Building a recurrent neural network - step by step\nWelcome to Course 5's first assignment! In this assignment, you will implement your first Recurrent Neural Network in numpy.\n\nRecurrent Neural Networks (RNN) are very effective for Natural Language Processing and other sequence tasks because they have \"memory\". They can read inputs x<sup>`<t>`</sup> (such as words) one at a time, and remember some information/context through the hidden layer activations that get passed from one time-step to the next. This allows a uni-directional RNN to take information from the past to process later inputs. A bidirection RNN can take context from both the past and the future. \n\n**Notation**:\n- Superscript <sup>[l]</sup> denotes an object associated with the `l.th` layer.\n    - Example: a<sup>[4]</sup> is the `4.th` layer activation. W<sup>[5]</sup> and b<sup>[5]</sup> are the `5.th` layer parameters.\n\n- Superscript <sup>(i)</sup> denotes an object associated with the `i.th` example.\n    - Example: x<sup>(i)</sup> is the `i.th` training example input.\n\n- Superscript `<t>` denotes an object at the `t.th` time-step.\n    - Example: x<sup>`<t>`</sup> is the input x at the `t.th` time-step. x<sup>`(i)<t>`</sup> is the input at the `t.th` timestep of example `i`.\n\n- Lowerscript <sub>i</sub> denotes the `i.th` entry of a vector.\n    - Example: a<sup>[l]</sup><sub>i</sub> denotes the `i.th` entry of the activations in layer `l`.\n\nWe assume that you are already familiar with `numpy` and/or have completed the previous courses of the specialization. Let's get started!\n\n### Dinosaur Island -- Character-level language model\nWelcome to Dinosaurus Island! 65 million years ago, dinosaurs existed, and in this assignment they are back. You are in charge of a special task. Leading biology researchers are creating new breeds of dinosaurs and bringing them to life on earth, and your job is to give names to these dinosaurs. If a dinosaur does not like its name, it might go beserk, so choose wisely! \n<br />\nLuckily you have learned some deep learning and you will use it to save the day. Your assistant has collected a list of all the dinosaur names they could find, and compiled them into this [dataset](dinos.txt). (Feel free to take a look by clicking the previous link.) To create new dinosaur names, you will build a character level language model to generate new names. Your algorithm will learn the different name patterns, and randomly generate new names. Hopefully this algorithm will keep you and your team safe from the dinosaurs' wrath! \n\nBy completing this assignment you will learn:\n\n- How to store text data for processing using an RNN \n- How to synthesize data, by sampling predictions at each time step and passing it to the next RNN-cell unit\n- How to build a character-level text generation recurrent neural network\n- Why clipping the gradients is important\n\nWe will begin by loading in some functions that we have provided for you in `rnn_utils`. Specifically, you have access to functions such as `rnn_forward` and `rnn_backward` which are equivalent to those you've implemented in the previous assignment. \n\n### Jazz improvisation with LSTM\nWelcome to your final programming assignment of this week! In this notebook, you will implement a model that uses an LSTM to generate music. You will even be able to listen to your own music at the end of the assignment. \n\n**You will learn to:**\n- Apply an LSTM to music generation.\n- Generate your own jazz music with deep learning.\n\nPlease run the following cell to load all the packages required in this assignment. This may take a few minutes. \n\n### Emojify\nWelcome to the second assignment of Week 2. You are going to use word vector representations to build an Emojifier. \n\nHave you ever wanted to make your text messages more expressive? Your emojifier app will help you do that. So rather than writing \"Congratulations on the promotion! Lets get coffee and talk. Love you!\" the emojifier can automatically turn this into \"Congratulations on the promotion! 👍 Lets get coffee and talk. ☕️ Love you! ❤️\"\n\nYou will implement a model which inputs a sentence (such as \"Let's go see the baseball game tonight!\") and finds the most appropriate emoji to be used with this sentence (⚾️). In many emoji interfaces, you need to remember that ❤️ is the \"heart\" symbol rather than the \"love\" symbol. But using word vectors, you'll see that even if your training set explicitly relates only a few words to a particular emoji, your algorithm will be able to generalize and associate words in the test set to the same emoji even if those words don't even appear in the training set. This allows you to build an accurate classifier mapping from sentences to emojis, even using a small training set. \n\nIn this exercise, you'll start with a baseline model (Emojifier-V1) using word embeddings, then build a more sophisticated model (Emojifier-V2) that further incorporates an LSTM. \n\nLets get started! Run the following cell to load the package you are going to use. \n\n### Word Vector Representation\nWelcome to your first assignment of this week! \n\nBecause word embeddings are very computionally expensive to train, most ML practitioners will load a pre-trained set of embeddings. \n\n**After this assignment you will be able to:**\n\n- Load pre-trained word vectors, and measure similarity using cosine similarity\n- Use word embeddings to solve word analogy problems such as Man is to Woman as King is to ______. \n- Modify word embeddings to reduce their gender bias \n\nLet's get started! Run the following cell to load the packages you will need.\n\n### Machine Translation (Neural Machine Translation)\nWelcome to your first programming assignment for this week! \n\nYou will build a Neural Machine Translation (NMT) model to translate human readable dates (\"25th of June, 2009\") into machine readable dates (\"2009-06-25\"). You will do this using an attention model, one of the most sophisticated sequence to sequence models. \n\nThis notebook was produced together with NVIDIA's Deep Learning Institute. \n\nLet's load all the packages you will need for this assignment.\n\n### Trigger word detection\nWelcome to the final programming assignment of this specialization! \n\nIn this week's videos, you learned about applying deep learning to speech recognition. In this assignment, you will construct a speech dataset and implement an algorithm for trigger word detection (sometimes also called keyword detection, or wakeword detection). Trigger word detection is the technology that allows devices like Amazon Alexa, Google Home, Apple Siri, and Baidu DuerOS to wake up upon hearing a certain word.  \n\nFor this exercise, our trigger word will be \"Activate.\" Every time it hears you say \"activate,\" it will make a \"chiming\" sound. By the end of this assignment, you will be able to record a clip of yourself talking, and have the algorithm trigger a chime when it detects you saying \"activate.\" \n\nAfter completing this assignment, perhaps you can also extend it to run on your laptop so that every time you say \"activate\" it starts up your favorite app, or turns on a network connected lamp in your house, or triggers some other event? \n\nIn this assignment you will learn to: \n- Structure a speech recognition project\n- Synthesize and process audio recordings to create train/dev datasets\n- Train a trigger word detection model and make predictions\n\nLets get started! Run the following cell to load the package you are going to use.  \n\n\n<br><br>\n<br><br>\n"
        },
        {
          "name": "Readme.md",
          "type": "blob",
          "size": 5.2236328125,
          "content": "# DeepLearning.ai Courses Notes\n\nThis repository contains my personal notes and summaries on [DeepLearning.ai](https://deeplearning.ai) specialization courses. I've enjoyed every little bit of the course hope you enjoy my notes too.\n\n[DeepLearning.ai](https://deeplearning.ai)  contains five courses which can be taken on [Coursera](https://www.coursera.org/specializations/deep-learning). The five courses titles are:\n\n1. Neural Networks and Deep Learning.\n2. Improving Deep Neural Networks: Hyperparameter tuning, Regularization and Optimization.\n3. Structuring Machine Learning Projects.\n4. Convolutional Neural Networks.\n5. Sequence Models.\n\nThis is by far the best course series on deep learning that I've taken. Enjoy!\n\n\n\n## About This Specialization (From the official Deep Learning Specialization page)\n\n> If you want to break into AI, this Specialization will help you do so. Deep Learning is one of the most highly sought after skills in tech. We will help you become good at Deep Learning.\n>\n> In five courses, you will learn the foundations of Deep Learning, understand how to build neural networks, and learn how to lead successful machine learning projects. You will learn about Convolutional networks, RNNs, LSTM, Adam, Dropout, BatchNorm, Xavier/He initialization, and more. You will work on case studies from healthcare, autonomous driving, sign language reading, music generation, and natural language processing. You will master not only the theory, but also see how it is applied in industry. You will practice all these ideas in Python and in TensorFlow, which we will teach.\n>\n> You will also hear from many top leaders in Deep Learning, who will share with you their personal stories and give you career advice.\n>\n> AI is transforming multiple industries. After finishing this specialization, you will likely find creative ways to apply it to your work.\n>\n> We will help you master Deep Learning, understand how to apply it, and build a career in AI.\n\n\n\n## Specialization Certificate\n\nAt last I've successfully completed the specialization and earned my [certificate](https://coursera.org/verify/specialization/DTTJC9Y5B8U6)!\n\n![](Certificate.png)\n\n\n\n## Similar Notes\n\n- Beautifully drawn notes by Tess Ferrandez:\n  - https://www.slideshare.net/TessFerrandez/notes-from-coursera-deep-learning-courses-by-andrew-ng\n\n## Reviews\n\nAs [DeepLearning.ai](https://deeplearning.ai) is one of the most popular courses in the field of AI/ML/DL, there are some good reviews regarding some or whole of the specialization courses.\n\nThe list of reviews includes:\n\n- [Ryan Shrott](https://towardsdatascience.com/@ryanshrott?source=post_header_lockup) Reviews:\n  - [Deep Learning Specialization by Andrew Ng — 21 Lessons Learned](https://towardsdatascience.com/deep-learning-specialization-by-andrew-ng-21-lessons-learned-15ffaaef627c)\n  - [Computer Vision by Andrew Ng — 11 Lessons Learned](https://towardsdatascience.com/computer-vision-by-andrew-ng-11-lessons-learned-7d05c18a6999)\n- [Arthur Chan](https://www.linkedin.com/in/arthchan2003/) Reviews:\n  - [Review of Ng's deeplearning.ai Course 1: Neural Networks and Deep Learning](https://www.linkedin.com/pulse/review-ngs-deeplearningai-course-1-neural-networks-deep-arthur-chan/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_post_details%3BVLk6TK8sThiFt5gZF%2B25Ug%3D%3D)\n  - [Review of Ng's deeplearning.ai Course 2: Improving Deep Neural Networks](https://www.linkedin.com/pulse/review-ngs-deeplearningai-course-2-improving-deep-neural-arthur-chan/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_post_details%3BVLk6TK8sThiFt5gZF%2B25Ug%3D%3D)\n  - [Review of Ng's deeplearning.ai Course 3: Structuring Machine Learning Projects](https://www.linkedin.com/pulse/review-ngs-deeplearningai-course-3-structuring-machine-arthur-chan/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_post_details%3BVLk6TK8sThiFt5gZF%2B25Ug%3D%3D)\n  - [Review of Ng's deeplearning.ai Course 4: Convolutional Neural Networks](https://www.linkedin.com/pulse/review-ngs-deeplearningai-course-4-convolutional-neural-arthur-chan/?lipi=urn%3Ali%3Apage%3Ad_flagship3_profile_view_base_post_details%3BVLk6TK8sThiFt5gZF%2B25Ug%3D%3D)\n- [Thoughts after taking the Deeplearning.ai courses](https://towardsdatascience.com/thoughts-after-taking-the-deeplearning-ai-courses-8568f132153)\n- [Learning Deep Learning — fast.ai vs. deeplearning.ai](https://medium.com/@markryan_69718/learning-deep-learning-fast-ai-vs-deeplearning-ai-34f9c42cf701)\n\n\n\nA good Facebook group that discusses the courses are here: https://www.facebook.com/groups/DeepLearningAISpecialization/.\n\nGroup description:\n\n> This group is for current, past or future students of Prof Andrew Ng's deeplearning.ai class in Coursera. The purpose is for students to get to know each other, ask questions, and share insights. However, remember the Coursera Honor Code - please do not post any solution in the forum! \n\n\n\n## Next steps\n\nTaking [fast.ai](http://www.fast.ai/) courses series as it focuses more on the practical works.\n\n## Acknowledgements\n\nThanks to [VladKha](https://github.com/VladKha), [wangzhenhui1992](https://github.com/wangzhenhui1992), [jarpit96](https://github.com/jarpit96), and other contributors for helping me revising and fixing mistakes in the notes.\n\n<br/>\n\n<br/>\n\n<br/>\n\n<br/>\n\nMahmoud Badry @ 2018\n"
        },
        {
          "name": "download.py",
          "type": "blob",
          "size": 1.8642578125,
          "content": "################################################\n# File name: download.py                       #\n# Author: Mahmoud Badry                        #\n# Date created: 2/11/2018                      #\n# Date last modified: 2/11/2018                #\n# Python Version: 3                            #\n# Purpose: Download all notes in PDF format    #\n# Requirements: pypandoc >= 1.4                #\n################################################\nimport pypandoc\n\n\ndef main():\n    home_link = \"https://raw.githubusercontent.com/mbadry1/DeepLearning.ai-Summary/master/\"\n    marks_down_links = {\n        \"Deeplearning.ai summary Homepage\":\n            home_link + \"Readme.md\",\n        \"01- Neural Networks and Deep Learning\":\n            home_link + \"1-%20Neural%20Networks%20and%20Deep%20Learning/Readme.md\",\n        \"02- Improving Deep Neural Networks Hyperparameter tuning, Regularization and Optimization\":\n            home_link + \"2-%20Improving%20Deep%20Neural%20Networks/Readme.md\",\n        \"03- Structuring Machine Learning Projects\":\n            home_link + \"3-%20Structuring%20Machine%20Learning%20Projects/Readme.md\",\n        \"04- Convolutional Neural Networks\":\n            home_link + \"4-%20Convolutional%20Neural%20Networks/Readme.md\",\n        \"05- Sequence Models\":\n            home_link + \"5-%20Sequence%20Models/Readme.md\",\n    }\n\n    # Extracting pandoc version\n    print(\"pandoc_version:\", pypandoc.get_pandoc_version())\n    print(\"pandoc_path:\", pypandoc.get_pandoc_path())\n    print(\"\\n\")\n\n    # Starting downloading and converting\n    for key, value in marks_down_links.items():\n        print(\"Converting\", key)\n        pypandoc.convert_file(\n            value,\n            'pdf',\n            extra_args=['--pdf-engine=xelatex', '-V', 'geometry:margin=1.5cm'],\n            outputfile=(key + \".pdf\")\n        )\n        print(\"Converting\", key, \"completed\")\n\n\nif __name__ == \"__main__\":\n    main()\n"
        }
      ]
    }
  ]
}