{
  "metadata": {
    "timestamp": 1736560740681,
    "page": 419,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "pythonstock/stock",
      "stars": 6800,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.2216796875,
          "content": "# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\ndata\n\n# Distribution / packaging\n.Python\nenv/\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\n*.egg-info/\n.installed.cfg\n*.egg\n\nnotebooks\nnohup.out\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test_akshare / coverage reports\nhtmlcov/\n.tox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*.cover\n.hypothesis/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# pyenv\n.python-version\n\n# celery beat schedule file\ncelerybeat-schedule\n\n# SageMath parsed files\n*.sage.py\n\n# dotenv\n.env\n\n# virtualenv\n.venv\nvenv/\nENV/\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n\n.idea\n*.iml\n.DS_Store\n*.zip\n*.log\n*.pyc\ndoc\n/bin\npkg\n*.tmp"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 1.53125,
          "content": "# 拆分基础镜像： docker/dockerfile\n\n\n# 基础镜像，按照季度，月度更新。不影响应用镜像的构建。\n\nFROM pythonstock/pythonstock:base-2022-01\n\nWORKDIR /data\n\n#add cron sesrvice.\n#每分钟，每小时1分钟，每天1点1分，每月1号执行\nRUN mkdir -p /etc/cron.minutely && mkdir -p /etc/cron.hourly && mkdir -p /etc/cron.monthly && \\\n    echo \"SHELL=/bin/sh \\n\\\nPATH=/usr/local/sbin:/usr/local/bin:/sbin:/bin:/usr/sbin:/usr/bin \\n\\\n# min   hour    day     month   weekday command \\n\\\n*/1     *       *       *       *       /bin/run-parts /etc/cron.minutely \\n\\\n10       *       *       *       *       /bin/run-parts /etc/cron.hourly \\n\\\n30       16       *       *       *       /bin/run-parts /etc/cron.daily \\n\\\n30       17       1,10,20       *       *       /bin/run-parts /etc/cron.monthly \\n\" > /var/spool/cron/crontabs/root && \\\n    chmod 600 /var/spool/cron/crontabs/root\n\n\n#增加服务端口就两个 6006 8500 9001\nEXPOSE 8888 9999\n\n#经常修改放到最后：\nADD jobs /data/stock/jobs\nADD libs /data/stock/libs\nADD web /data/stock/web\nADD supervisor /data/supervisor\n\nADD jobs/cron.minutely /etc/cron.minutely\nADD jobs/cron.hourly /etc/cron.hourly\nADD jobs/cron.daily /etc/cron.daily\nADD jobs/cron.monthly /etc/cron.monthly\n\nRUN mkdir -p /data/logs && ls /data/stock/ && chmod 755 /data/stock/jobs/run_* &&  \\\n    chmod 755 /etc/cron.minutely/* && chmod 755 /etc/cron.hourly/* && \\\n    chmod 755 /etc/cron.daily/* && chmod 755 /etc/cron.monthly/*\n\nENTRYPOINT [\"supervisord\",\"-n\",\"-c\",\"/data/supervisor/supervisord.conf\"]"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 17.666015625,
          "content": "### 说明，项目迁移到了Gitee 啦，最后一次修改，2023-06-02 执行存档\n\n项目迁移到这里了：此项目后续更新访问这里：\n\nhttps://gitee.com/pythonstock/stock\n\ngithub项目后续就Archives存档了，不再更新了！\n\ncsdn的pythonstock专栏地址，相关资料都在这里有说明：\n\nhttps://blog.csdn.net/freewebsys/category_9285317.html\n\n\n### pythonstock V2 项目简介\n\n\n**特别说明：股市有风险投资需谨慎，本项目只能用于Python代码学习，股票分析，投资失败亏钱不负责，不算BUG。**\n\n```\n项目地址：https://github.com/pythonstock/stock\nPythonStock V2 是基于Python的pandas，akshare，bokeh，tornado，stockstats，ta-lib等框架开发的全栈股票系统。\n项目创建于2017年7月17日，每月不定期更新。\n1）可以直接使用docker直接本地部署运行，整个项目在docker hub上压缩后200MB，本地占用500MB磁盘空间。\n2）使用Docker解决了Python库安装问题，使用Mariadb（MySQL）存储数据。借助akshare抓取数据。\n3）使用cron做定时任务，每天进行数据抓取计算，每天18点开始进行数据计算，计算当日数据，使用300天数据进行计算，大约需要15分钟计算完毕。\n4）股票数据接口防止被封，按天进行数据缓存，储存最近3天数据，每天定时清除，同时使用read_pickle to_pickle 的gzip压缩模式存储。\n5）使用tornado开发web系统，支持每日股票数据-东财，龙虎榜-个股上榜-新浪，数据中心-大宗交易行情等。\n6）数据展示系统，是通用数据展示系统，配置字典模板之后，页面自动加载数据，并完成数据展示，后续自己开发的指标数据可以加入进去。\n7）增加曲线数据分析，在查看股票中，可以直接跳转到东方财富页面查看相关信息，点击指标之后使用Bokeh将多达 17 个指标的数据绘图，进行图表展示。\n8) 2.0 最大的更新在于替换tushare库（因部分库不能使用），使用akshare进行数据抓取。\n\n基础库版本\n\n1，pandas使用【 1.3.5 】版本，升级了\n2，numpy使用【 1.21.5 】版本，升级了\n3，akshare使用【 1.3.50 】版本，升级了\n4，bokeh使用【 2.4.2 】版本，升级了\n5，stockstats使用【 0.3.2 】版本\n\n```\n\n2.0 说明\n ![image](https://raw.githubusercontent.com/pythonstock/stock/master/web/static/img/stock2-001.png)\n ![image](https://raw.githubusercontent.com/pythonstock/stock/master/web/static/img/stock2-002.png)\n\n bokeh 绘图指标数据：\n \n  ![image](https://raw.githubusercontent.com/pythonstock/stock/master/web/static/img/stock2-003.png)\n \n\n然后根据3个指标进行股票数据计算：\n```\n\nKDJ:\n1，超买区：K值在80以上，D值在70以上，J值大于90时为超买。一般情况下，股价有可能下跌。投资者应谨慎行事，局外人不应再追涨，局内人应适时卖出。\n2，超卖区：K值在20以下，D值在30以下为超卖区。一般情况下，股价有可能上涨，反弹的可能性增大。局内人不应轻易抛出股票，局外人可寻机入场。\n\nRSI:\n1．当六日指标上升到达80时，表示股市已有超买现象，如果一旦继续上升，超过90以上时，则表示已到严重超买的警戒区，股价已形成头部，极可能在短期内反转回转。\n2．当六日强弱指标下降至20时，表示股市有超卖现象，如果一旦继续下降至10以下时则表示已到严重超卖区域，股价极可能有止跌回升的机会。\n\nCCI\n1、当CCI＞﹢100时，表明股价已经进入非常态区间——超买区间，股价的异动现象应多加关注。\n2、当CCI＜﹣100时，表明股价已经进入另一个非常态区间——超卖区间，投资者可以逢低吸纳股票。\n\n购买条件结果表：guess_indicators_lite_buy_daily\n购买条件结果表：guess_indicators_lite_sell_daily\n\n```\n\n每日股票指标数据计算17个指标如下（数据表 guess_indicators_daily）： \n\n\n| 计算指标           | 说明 |\n|---------- |------------------------------------------|\n| 1，交易量delta指标分析     | The Volume Delta (Vol ∆)  |\n| 2，计算n天差     |  可以计算，向前n天，和向后n天的差。  |\n| 3，n天涨跌百分百计算     |  可以看到，-n天数据和今天数据的百分比。  |\n| 4, CR指标     | http://wiki.mbalib.com/wiki/CR%E6%8C%87%E6%A0%87 价格动量指标 CR跌穿a、b、c、d四条线，再由低点向上爬升160时，为短线获利的一个良机，应适当卖出股票。 CR跌至40以下时，是建仓良机。而CR高于300~400时，应注意适当减仓。  |\n| 5，最大值，最小值     |  计算区间最大值 volume max of three days ago, yesterday and two days later stock[\"volume_-3,2,-1_max\"] volume min between 3 days ago and tomorrow stock[\"volume_-3~1_min\"] 实际使用的时候使用 -2~2 可计算出5天的最大，最小值。 |\n| 6, KDJ指标     | http://wiki.mbalib.com/wiki/%E9%9A%8F%E6%9C%BA%E6%8C%87%E6%A0%87    随机指标(KDJ)一般是根据统计学的原理，通过一个特定的周期（常为9日、9周等）内出现过的最高价、 最低价及最后一个计算周期的收盘价及这三者之间的比例关系，来计算最后一个计算周期的未成熟随机值RSV， 然后根据平滑移动平均线的方法来计算K值、D值与J值，并绘成曲线图来研判股票走势。 （3）在使用中，常有J线的指标，即3乘以K值减2乘以D值（3K－2D＝J），其目的是求出K值与D值的最大乖离程度， 以领先KD值找出底部和头部。J大于100时为超买，小于10时为超卖。 |\n| 7，SMA指标     | http://wiki.mbalib.com/wiki/Sma 简单移动平均线（Simple Moving Average，SMA） 可以动态输入参数，获得几天的移动平均。 |\n| 8, MACD指标     | http://wiki.mbalib.com/wiki/MACD   平滑异同移动平均线(Moving Average Convergence Divergence，简称MACD指标)，也称移动平均聚散指标 MACD 则可发挥其应有的功能，但当市场呈牛皮盘整格局，股价不上不下时，MACD买卖讯号较不明显。 当用MACD作分析时，亦可运用其他的技术分析指标如短期 K，D图形作为辅助工具，而且也可对买卖讯号作双重的确认。 |\n| 9, BOLL指标     | http://wiki.mbalib.com/wiki/BOLL   布林线指标(Bollinger Bands) |\n| 10, RSI指标     | http://wiki.mbalib.com/wiki/RSI    相对强弱指标（Relative Strength Index，简称RSI），也称相对强弱指数、相对力度指数 2）强弱指标保持高于50表示为强势市场，反之低于50表示为弱势市场。 （3）强弱指标多在70与30之间波动。当六日指标上升到达80时，表示股市已有超买现象，如果一旦继续上升，超过90以上时，则表示已到严重超买的警戒区，股价已形成头部，极可能在短期内反转回转。 |\n| 11, W%R指标     | http://wiki.mbalib.com/wiki/%E5%A8%81%E5%BB%89%E6%8C%87%E6%A0%87 威廉指数（Williams%Rate）该指数是利用摆动点来度量市场的超买超卖现象。 |\n| 12, CCI指标     | http://wiki.mbalib.com/wiki/%E9%A1%BA%E5%8A%BF%E6%8C%87%E6%A0%87 顺势指标又叫CCI指标，其英文全称为“Commodity Channel Index”， 是由美国股市分析家唐纳德·蓝伯特（Donald Lambert）所创造的，是一种重点研判股价偏离度的股市分析工具。 1、当CCI指标从下向上突破﹢100线而进入非常态区间时，表明股价脱离常态而进入异常波动阶段， 中短线应及时买入，如果有比较大的成交量配合，买入信号则更为可靠。 2、当CCI指标从上向下突破﹣100线而进入另一个非常态区间时，表明股价的盘整阶段已经结束， 将进入一个比较长的寻底过程，投资者应以持币观望为主。 CCI, default to 14 days |\n| 13, TR、ATR指标     | http://wiki.mbalib.com/wiki/%E5%9D%87%E5%B9%85%E6%8C%87%E6%A0%87   均幅指标（Average True Ranger,ATR）均幅指标（ATR）是取一定时间周期内的股价波动幅度的移动平均值，主要用于研判买卖时机。 |\n| 14, DMA指标     | http://wiki.mbalib.com/wiki/DMA   DMA指标（Different of Moving Average）又叫平行线差指标，是目前股市分析技术指标中的一种中短期指标，它常用于大盘指数和个股的研判。 DMA, difference of 10 and 50 moving average stock[‘dma’] |\n| 15, DMI，+DI，-DI，DX，ADX，ADXR指标    | http://wiki.mbalib.com/wiki/DMI    动向指数Directional Movement Index,DMI）   http://wiki.mbalib.com/wiki/ADX   平均趋向指标（Average Directional Indicator，简称ADX）   http://wiki.mbalib.com/wiki/%E5%B9%B3%E5%9D%87%E6%96%B9%E5%90%91%E6%8C%87%E6%95%B0%E8%AF%84%E4%BC%B0   平均方向指数评估（ADXR）实际是今日ADX与前面某一日的ADX的平均值。ADXR在高位与ADX同步下滑，可以增加对ADX已经调头的尽早确认。 ADXR是ADX的附属产品，只能发出一种辅助和肯定的讯号，并非入市的指标，而只需同时配合动向指标(DMI)的趋势才可作出买卖策略。 在应用时，应以ADX为主，ADXR为辅。 |\n| 16, TRIX，MATRIX指标     | http://wiki.mbalib.com/wiki/TRIX   TRIX指标又叫三重指数平滑移动平均指标（Triple Exponentially Smoothed Average） |\n| 17, VR，MAVR指标     | http://wiki.mbalib.com/wiki/%E6%88%90%E4%BA%A4%E9%87%8F%E6%AF%94%E7%8E%87   成交量比率（Volumn Ratio，VR）（简称VR），是一项通过分析股价上升日成交额（或成交量，下同）与股价下降日成交额比值， 从而掌握市场买卖气势的中期技术指标。 |\n\n\n### 使用方法（依赖docker）\n\n使用 mariadb 和 stock 两个镜像\n\n```\nmkdir -p /data/mariadb/data\ndocker pull pythonstock/pythonstock:latest\ndocker pull mariadb:latest\n\ndocker run --name mariadb -v /data/mariadb/data:/var/lib/mysql \\\n    -e MYSQL_ROOT_PASSWORD=mariadb -p 3306:3306 -d mariadb:latest\n\ndocker run -itd --link=mariadb --name stock  \\\n    -v /data/notebooks:/data/notebooks \\\n    -p 8888:8888 \\\n    -p 9999:9999 \\\n    pythonstock/pythonstock:latest\n\n```\n\n直接启动stock ，使用其他 mysql 数据库，需要配置变量方式：\n\n```\ndocker run -itd --name stock  \\\n    -v /data/notebooks:/data/notebooks \\\n    -p 8888:8888 \\\n    -p 9999:9999 \\\n    -e MYSQL_HOST=127.0.0.1 \\\n    -e MYSQL_USER=root \\\n    -e MYSQL_PWD=mariadb \\\n    -e MYSQL_DB=stock_data \\\n    pythonstock/pythonstock:latest\n```\n\n或者使用docker compose\n\n安装docker-compose\nhttps://www.runoob.com/docker/docker-compose.html\n\n```\nsudo curl -L \"https://github.com/docker/compose/releases/download/1.27.4/docker-compose-$(uname -s)-$(uname -m)\" -o /usr/local/bin/docker-compose\nsudo chmod +x /usr/local/bin/docker-compose\n```\n\n```\ndocker-compose up -d\n```\n\n要想修改文件进行调试，增加当前目录映射，加入到stock里面：\n```yaml\n        volumes:\n            - \"./jobs:/data/stock/jobs\"\n            - \"./libs:/data/stock/libs\"\n            - \"./web:/data/stock/web\"\n```\n\n进入镜像：\n```\ndocker exec -it stock bash \nsh /data/stock/jobs/cron.daily/run_daily\n```\n\n说明，启动容器后，会调用。run_init.sh 进行数据初始化，同时第一次执行后台执行当日数据。\n以后每日18点（只有18点左右才有今日的数据）进行股票数据抓取并计算。\n\n\n### 本地访问端口\n\n> http://localhost:9999 股票系统 \n\n\n### 股票系统设计\n\n相关博客资料：\nhttps://blog.csdn.net/freewebsys/category_9285317.html\n\n数据分析清洗使用pandas，numpy。\nhttp://pandas.pydata.org/\n\n数据存储到磁盘上，使用Mysql数据库。存储股票数据。\nhttps://pypi.python.org/pypi/mysqlclient\n\nweb框架使用tornado\nhttp://www.tornadoweb.org/en/stable/\n\ntornado web系统\nhttp://docs.pythontab.com/tornado/introduction-to-tornado/\n\n\n### 架构设计\n全系使用python实现。因为都是python的类库，互相之间调用方便。\n从数据抓取，数据处理，到数据展示数据运算都是python实现。\n\n最终的数据都到前端展示出来。主要分为4个文件夹。\n\n> jobs 抓取数据并存储实现类。\n> \n> libs 通用工具类。\n> \n> web 前端展示框架。\n> \n> supervisor 进程管理工具。\n\n\n### 应用部署\n\n需要mysql数据库启动。项目放到/data/stock 目录。\n```\nCREATE DATABASE IF NOT EXISTS `stock_data` CHARACTER SET utf8 COLLATE utf8_general_ci;\n```\n\n使用 :\n\nhttp://docs.sqlalchemy.org/en/latest/core/reflection.html\n\n## 更新日志\n\n### 15 发布一个 2.0 的版本 - 2021-10-11\n\n构建基础版本 pythonstock/pythonstock:base-2021-09 在这个镜像的基础上使用 akshare 1.1.9\n折腾几个月，终于把2.0 弄好了，为啥弄2.0 因为之前发现 tushare的数据不能抓取了。需要注册成 pro 版本，但是pro 还有积分限制。\n诸多不便吧，于是换成了 akshare 库了，大改了，需要找到相关的新库。然后在些代码。\n删除掉了 ta-lib 安装了之后从来没有用到，jupyter 也是没有用。占空间影响下载心情。将镜像进一步减小。\n\n\n### 14 bokeh 升级到 2.4.0 版本\n\n目录\n/usr/local/lib/python3.7/site-packages\n使用脚本进行升级。\n\n### 13 升级ak到v1.0.80 做好每日东方财经数据\n\nhttps://www.akshare.xyz/zh_CN/latest/data/stock/stock.html#id1\n限量: 单次返回所有 A 股上市公司的实时行情数据\n\n600开头的股票是上证A股，属于大盘股，其中6006开头的股票是最早上市的股票，\n6016开头的股票为大盘蓝筹股；900开头的股票是上证B股；\n000开头的股票是深证A股，001、002开头的股票也都属于深证A股，\n其中002开头的股票是深证A股中小企业股票；200开头的股票是深证B股；\n300开头的股票是创业板股票；400开头的股票是三板市场股票。\n\n过滤包括：600，6006，601，000，001，002，且不包括ST的股票数据。\n\n增加数据库utf8 参数 --character-set-server=utf8mb4 --collation-server=utf8mb4_unicode_ci \n\n\n### 12 升级基础镜像到3.7 python，保障 akshare 0.6.10 以上版本支持\n\n发现 akshare 要求升级python 3.7 以上版本才可以，需要升级基础镜像。\n然后 akshare 就可以升级到 0.9.65 的最新版本了。\n新版本就可以按照日期进行查询，解决 TypeError: stock_zh_a_daily() got an unexpected keyword argument 'start_date' 这个问题了。\n\n\n### 11 使用 akshare 做相关股票数据抓取\n\n\t\n中国的股市开盘时间为：每周一至周五的上午9:30——11：30，\n下午13:00——15:00。中国股市收盘时间为：每周一至周五的下午3点。\n\n实时行情数据\n接口: stock_zh_a_spot\n目标地址: http://vip.stock.finance.sina.com.cn/mkt/#hs_a\n描述: A 股数据是从新浪财经获取的数据, 重复运行本函数会被新浪暂时封 IP, 建议增加时间间隔\n限量: 单次返回所有 A 股上市公司的实时行情数据\n\n历史行情数据\n日频率\n接口: stock_zh_a_daily\n目标地址: https://finance.sina.com.cn/realstock/company/sh600006/nc.shtml(示例)\n描述: A 股数据是从新浪财经获取的数据, 历史数据按日频率更新; 注意其中的 sh689009 为 CDR, 请 通过 stock_zh_a_cdr_daily 接口获取\n限量: 单次返回指定 A 股上市公司指定日期间的历史行情日频率数据\n\n### 10 增加东方财经弹窗窗口、增加指标计算弹窗窗口\n\n发现了一个东方财富的页面，是给pc端用的。\n可以做个弹出框放到系统中。不进行调整了，长宽高可以做的小点。使用iframe引入界面。否则有跨域和样式问题。\n\n修改指标页面，改成窗口弹窗，做页面适配，方便查看。\n\n### 9，增加日历\n\n```\n古老的jquery 代码：\n\t\t$( \".date-picker\" ).datepicker({\n\t\t\tlanguage: 'zh-CN', //设置语言\n            format:\"yyyymmdd\",\n            showOtherMonths: true,\n            selectOtherMonths: false,\n            autoclose: true,\n\t\t\ttodayHighlight: true\n        });\n针对日期类型的搜索条件增加日历\n\n```\n\nhttps://www.bootcss.com/p/bootstrap-datetimepicker/\n不是使用jQuery的时间。\n\n### 8，发现MariaDb 版本不兼容问题，最后切换成mysql,使用 mysql:5.7 镜像\n\n相关数据执行只支持到10.5.4，版本可以使用，但是10.5.8 就有问题了。\n限制死了版本。看来软件也不能瞎升级，都用最新的有问题。可以解决数据问题。\n使用 mysql:5.7 镜像，更通用些，不折腾mariaDb了。\n\n\n### 7，解决 Bokeh JS兼容问题。\n\n> 升级 bokeh 到 2.1.1 版本\n>\n> https://pypi.org/project/bokeh/#files\n> \n> 升级JS，因为 lib 包升级导致问题。\n\n\n\n### 6，升级 bokeh 到 2.1.1 版本\n\n```\n\nhttps://pypi.org/project/bokeh/#files\n\n```\n\n### 5，解决日志打印问题\n\n```\n\n配置 main.py \ntornado.options.parse_command_line()\n\n然后启动配置参数：\n/usr/local/bin/python3 /data/stock/web/main.py -log_file_prefix=/data/logs/web.log\n\n```\n\n### 4，解决跑数据问题\n\n```\n# 通过数据库链接 engine。\ndef conn():\n    try:\n        db = MySQLdb.connect(MYSQL_HOST, MYSQL_USER, MYSQL_PWD, MYSQL_DB, charset=\"utf8\")\n        # db.autocommit = True\n    except Exception as e:\n        print(\"conn error :\", e)\n    db.autocommit(on=True)\n    return db.cursor()\n```\n\n之前升级过代码，造成 db.cursor() 问题。\n\n### 3，增加多字段排序\n\n> 1，点击是单个字段进行排序。\n>\n> 2，按照【shift】，点击多个，即可完成多字段排序。\n> \n> 3，服务端分页排序。\n>\n> 4，按照多个字段进行筛选查询。\n\n### 2，使用pandas处理重复数据\n\nhttps://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop_duplicates.html\n\n```python\n    data = get_data(year, quarter)\n    # 处理重复数据，保存最新一条数据。\n    data.drop_duplicates(subset=\"code\", keep=\"last\")\n```\n\n### 1，web使用datatable显示报表\n\n通用数据配置，在 libs/stock_web_dic.py 配置数据之后，可以实现动态加载菜单，根据数据库表的行列显示数据。\n\n不用一个表一个表进行开发，通用数据展示。\n\n\n"
        },
        {
          "name": "build.sh",
          "type": "blob",
          "size": 0.3115234375,
          "content": "#!/bin/sh\n\nDOCKER_TAG=pythonstock/pythonstock:latest\n\nsudo rm -rf data\nsudo rm -f jobs/nohup.out\n\necho \" docker build -f Dockerfile -t ${DOCKER_TAG} .\"\ndocker build -f Dockerfile -t ${DOCKER_TAG} .\necho \"#################################################################\"\necho \" docker push ${DOCKER_TAG} \"\n\nmkdir data\n\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 1.0791015625,
          "content": "version: \"3\"\nservices:\n    stock:\n        image: pythonstock/pythonstock:latest\n        container_name: stock\n        ports:\n            - \"8888:8888\"\n            - \"9999:9999\"\n        volumes:\n            - \"./data/notebooks:/data/notebooks\"\n            - \"./data/logs:/data/logs\"\n        environment:\n            MYSQL_HOST: mysqldb\n            MYSQL_USER: root\n            MYSQL_PWD: mysqldb\n            MYSQL_DB: stock_data\n            LANG: zh_CN.UTF-8\n            LC_CTYPE: zh_CN.UTF-8\n            PYTHONIOENCODING: utf-8\n        links:\n            - mysqldb:mysqldb\n        restart: always\n    mysqldb:\n        image: mysql:5.7\n        container_name: mysqldb\n        ports:\n            - \"3306:3306\"\n        volumes:\n            - \"./data/mysqldb/data:/var/lib/mysql\"\n        environment:\n            MYSQL_ROOT_PASSWORD: mysqldb\n            MYSQL_DATABASE: stock_data\n            TZ: Asia/Shanghai\n        command: [\n            '--character-set-server=utf8mb4',\n            '--collation-server=utf8mb4_general_ci',\n            '--max_connections=3000'\n        ]\n        restart: always\n        \n"
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "jobs",
          "type": "tree",
          "content": null
        },
        {
          "name": "libs",
          "type": "tree",
          "content": null
        },
        {
          "name": "nginx.conf",
          "type": "blob",
          "size": 1.6328125,
          "content": "# 设置nginx启动\n# systemctl enable nginx\nserver {\n    listen       8080;\n    server_name  www.pythonstock.com;\n    root         /usr/share/nginx/html;\n\n    error_page 404 /404.html;\n    error_page 500 502 503 504 /50x.html;\n\n    # 开启gzip\n    gzip on;\n    # 启用gzip压缩的最小文件；小于设置值的文件将不会被压缩\n    gzip_min_length 1k;\n    # gzip 压缩级别 1-10\n    gzip_comp_level 2;\n    # 进行压缩的文件类型。\n    gzip_types text/plain application/javascript application/x-javascript text/css application/xml text/javascript application/x-httpd-php image/jpeg image/gif image/png;\n    # 是否在http header中添加Vary: Accept-Encoding，建议开启\n    gzip_vary on;\n\n    access_log /var/log/nginx/stock.access.log main;\n    error_log /var/log/nginx/stock.error.log warn;\n\n    # https://medium.com/aviabird/413-414-request-url-entity-too-large-error-nginx-b6dcece6f5dd\n    # 解决GET 参数过长问题。\n    client_max_body_size 10M;\n    large_client_header_buffers 4 20k;\n\n\n    location ^~ /static/ {\n        access_log off;\n        # 需要把源代码,再下载一遍。\n        root /data/pythonstock/stock/web;\n        expires 30d; # 设置30天超时\n        # 参考 https://www.cnblogs.com/kevingrace/p/10459429.html\n        # add_header    Cache-Control  max-age=360000;\n    }\n\n    location / {\n        proxy_next_upstream     http_500 http_502 http_503 http_504 error timeout invalid_header;\n        proxy_set_header        Host  $host;\n        proxy_set_header        X-Forwarded-For $proxy_add_x_forwarded_for;\n        proxy_pass              http://127.0.0.1:9999;\n        expires                 0;\n    }\n}"
        },
        {
          "name": "old_jobs",
          "type": "tree",
          "content": null
        },
        {
          "name": "startStock.sh",
          "type": "blob",
          "size": 2.6396484375,
          "content": "#!/bin/bash\n\nPWD=`pwd`\n\nDB_IS_RUN=`docker ps --filter \"name=mariadb\" --filter \"status=running\" | wc -l `\nif [ $DB_IS_RUN -lt 2 ]; then\n\n    #判断文件夹存在不。\n    if [ ! -d \"${PWD}/data/mysqldb/data\" ]; then\n        mkdir -p ${PWD}/data/mysqldb/data\n    fi\n\n    HAS_DB=`docker images mysql:5.7 | wc -l `\n    if [ $HAS_DB -ne 2 ];then\n        docker pull mysql:5.7\n    fi\n\n    ####################### 启动数据库 #######################\n    #检查mysqldb是否启动\n    DB_IS_RUN=`docker ps --filter \"name=mysqldb\" --filter \"status=running\" | wc -l `\n\n    if [ $DB_IS_RUN -ne 2 ]; then\n\n        ####################### 创建数据库 #######################\n        docker run --name mysqldb -v ${PWD}/data/mysqldb/data:/var/lib/mysql --restart=always \\\n        -e MYSQL_ROOT_PASSWORD=mysqldb -e MYSQL_DATABASE=stock_data -e TZ=Asia/Shanghai \\\n        -p 3306:3306 -d mysql:5.7 --character-set-server=utf8mb4 --collation-server=utf8mb4_unicode_ci\n        echo \"starting mysqldb ...\"\n        echo \"wait 60 second , mysqldb is starting .\"\n        sleep 60\n    else\n        echo \"mysqldb is running !!!\"\n    fi\n\n\n    #检查mysqldb是否启动，等待5秒钟，再次检查mysqldb启动\n    DB_IS_RUN=`docker ps --filter \"name=mysqldb\" --filter \"status=running\" | wc -l `\n    if [ $DB_IS_RUN -ne 2 ]; then\n        echo \"mysqldb is not running !!!\"\n        exit 1;\n    fi\nfi\n\n#检查stock启动\nSTOCK_IS_RUN=`docker ps --filter \"name=stock\" --filter \"status=running\" | wc -l `\nif [ $STOCK_IS_RUN -ge 2 ]; then\n    echo \"stop & rm stock ...\"\n    docker stop stock && docker rm stock\nfi\n\nsleep 1\n\necho \"starting stock ...\"\n# 1 是开发环境。映射本地代码。\nif [ $# == 1 ] ; then\n    echo \"#############  run dev ############# \"\n    # /data/stock 是代码目录 -v /data/stock:/data/stock 是开发模式。\n    mkdir -p notebooks\n\n    #  测试使用，自己需注册，申请：https://tushare.pro/user/token\n\n    docker run -itd --link=mysqldb --name stock  \\\n      -e LANG=zh_CN.UTF-8 -e LC_CTYPE=zh_CN.UTF-8 -e PYTHONIOENCODING=utf-8 \\\n      -p 8888:8888 -p 9999:9999 --restart=always \\\n      -v ${PWD}/jobs:/data/stock/jobs \\\n      -v ${PWD}/libs:/data/stock/libs \\\n      -v ${PWD}/web:/data/stock/web \\\n      -v ${PWD}/supervisor:/data/supervisor \\\n      -v ${PWD}/notebooks:/data/notebooks \\\n      -v ${PWD}/data/logs:/data/logs \\\n       pythonstock/pythonstock:latest\n    exit 1;\nelse\n    echo \"############# run online ############# \"\n    # /data/stock 是代码目录 -v /data/stock:/data/stock 是开发模式。\n    docker run -itd --link=mysqldb --name stock  \\\n      -p 8888:8888 -p 9999:9999 --restart=always \\\n       pythonstock/pythonstock:latest\n    exit 1;\nfi\n\n"
        },
        {
          "name": "supervisor",
          "type": "tree",
          "content": null
        },
        {
          "name": "web",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}