{
  "metadata": {
    "timestamp": 1736560719020,
    "page": 389,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "iam-veeramalla/Jenkins-Zero-To-Hero",
      "stars": 6993,
      "defaultBranch": "main",
      "files": [
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.080078125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio-economic status,\nnationality, personal appearance, race, religion, or sexual identity\nand orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n* Demonstrating empathy and kindness toward other people\n* Being respectful of differing opinions, viewpoints, and experiences\n* Giving and gracefully accepting constructive feedback\n* Accepting responsibility and apologizing to those affected by our mistakes,\n  and learning from the experience\n* Focusing on what is best not just for us as individuals, but for the\n  overall community\n\nExamples of unacceptable behavior include:\n\n* The use of sexualized language or imagery, and sexual attention or\n  advances of any kind\n* Trolling, insulting or derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or email\n  address, without their explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards of\nacceptable behavior and will take appropriate and fair corrective action in\nresponse to any behavior that they deem inappropriate, threatening, offensive,\nor harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for moderation\ndecisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official e-mail address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\n.\nAll complaints will be reviewed and investigated promptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series\nof actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external channels\nlike social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior,  harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage],\nversion 2.0, available at\nhttps://www.contributor-covenant.org/version/2/0/code_of_conduct.html.\n\nCommunity Impact Guidelines were inspired by [Mozilla's code of conduct\nenforcement ladder](https://github.com/mozilla/diversity).\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see the FAQ at\nhttps://www.contributor-covenant.org/faq. Translations are available at\nhttps://www.contributor-covenant.org/translations.\n"
        },
        {
          "name": "Interview_Questions.md",
          "type": "blob",
          "size": 10.6591796875,
          "content": "## NOTE: While I have prepared all the questions, to provide better answers in a detailed way, the summary provided below is the collection of my knowledge and information from various sources like Medium, Stack Overflow, ChatGPT.\n\nQ: Can you explain the CICD process in your current project ? or Can you talk about any CICD process that you have implemented ?\n\nA: In the current project we use the following tools orchestrated with Jenkins to achieve CICD.\n   - Maven, Sonar, AppScan, ArgoCD, and Kubernetes\n   \n   Coming to the implementation, the entire process takes place in 8 steps\n    \n    1. Code Commit: Developers commit code changes to a Git repository hosted on GitHub.\n    2. Jenkins Build: Jenkins is triggered to build the code using Maven. Maven builds the code and runs unit tests.\n    3. Code Analysis: Sonar is used to perform static code analysis to identify any code quality issues, security vulnerabilities, and bugs.\n    4. Security Scan: AppScan is used to perform a security scan on the application to identify any security vulnerabilities.\n    5. Deploy to Dev Environment: If the build and scans pass, Jenkins deploys the code to a development environment managed by Kubernetes.\n    6. Continuous Deployment: ArgoCD is used to manage continuous deployment. ArgoCD watches the Git repository and automatically deploys new changes to the development environment as soon as they are committed.\n    7. Promote to Production: When the code is ready for production, it is manually promoted using ArgoCD to the production environment.\n    8. Monitoring: The application is monitored for performance and availability using Kubernetes tools and other monitoring tools.\n   \n\nQ: What are the different ways to trigger jenkins pipelines ?\n\nA: This can be done in multiple ways,\n   To briefly explain about the different options,\n   ```\n     - Poll SCM: Jenkins can periodically check the repository for changes and automatically build if changes are detected. \n                 This can be configured in the \"Build Triggers\" section of a job.\n                 \n     - Build Triggers: Jenkins can be configured to use the Git plugin, which allows you to specify a Git repository and branch to build. \n                 The plugin can be configured to automatically build when changes are pushed to the repository.\n                 \n     - Webhooks: A webhook can be created in GitHub to notify Jenkins when changes are pushed to the repository. \n                 Jenkins can then automatically build the updated code. This can be set up in the \"Build Triggers\" section of a job and in the GitHub repository settings.\n   ```\nQ: How to backup Jenkins ?\n\nA: Backing up Jenkins is a very easy process, there are multiple default and configured files and folders in Jenkins that you might want to backup.\n```  \n  - Configuration: The `~/.jenkins` folder. You can use a tool like rsync to backup the entire directory to another location.\n  \n    - Plugins: Backup the plugins installed in Jenkins by copying the plugins directory located in JENKINS_HOME/plugins to another location.\n    \n    - Jobs: Backup the Jenkins jobs by copying the jobs directory located in JENKINS_HOME/jobs to another location.\n    \n    - User Content: If you have added any custom content, such as build artifacts, scripts, or job configurations, to the Jenkins environment, make sure to backup those as well.\n    \n    - Database Backup: If you are using a database to store information such as build results, you will need to backup the database separately. This typically involves using a database backup tool, such as mysqldump for MySQL, to export the data to another location.\n```\nOne can schedule the backups to occur regularly, such as daily or weekly, to ensure that you always have a recent copy of your Jenkins environment available. You can use tools such as cron or Windows Task Scheduler to automate the backup process.\n\nQ: How do you store/secure/handle secrets in Jenkins ?\n\nA: Again, there are multiple ways to achieve this, \n   Let me give you a brief explanation of all the posible options.\n```  \n   - Credentials Plugin: Jenkins provides a credentials plugin that can be used to store secrets such as passwords, API keys, and certificates. The secrets are encrypted and stored securely within Jenkins, and can be easily retrieved in build scripts or used in other plugins.\n   \n   - Environment Variables: Secrets can be stored as environment variables in Jenkins and referenced in build scripts. However, this method is less secure because environment variables are visible in the build logs.\n   \n   - Hashicorp Vault: Jenkins can be integrated with Hashicorp Vault, which is a secure secrets management tool. Vault can be used to store and manage sensitive information, and Jenkins can retrieve the secrets as needed for builds.\n   \n   - Third-party Secret Management Tools: Jenkins can also be integrated with third-party secret management tools such as AWS Secrets Manager, Google Cloud Key Management Service, and Azure Key Vault.\n```\n\nQ: What is latest version of Jenkins or which version of Jenkins are you using ?\n\nA: This is a very simple question interviewers ask to understand if you are actually using Jenkins day-to-day, so always be prepared for this.\n\nQ: What is shared modules in Jenkins ?\n\nA: Shared modules in Jenkins refer to a collection of reusable code and resources that can be shared across multiple Jenkins jobs. This allows for easier maintenance, reduced duplication, and improved consistency across multiple build processes.\n   For example, shared modules can be used in cases like:\n```\n        - Libraries: Custom Java libraries, shell scripts, and other resources that can be reused across multiple jobs.\n        \n        - Jenkinsfile: A shared Jenkinsfile can be used to define the build process for multiple jobs, reducing duplication and making it easier to manage the build process for multiple projects.\n        \n        - Plugins: Common plugins can be installed once as a shared module and reused across multiple jobs, reducing the overhead of managing plugins on individual jobs.\n        \n        - Global Variables: Shared global variables can be defined and used across multiple jobs, making it easier to manage common build parameters such as version numbers, artifact repositories, and environment variables.\n```\n\nQ: can you use Jenkins to build applications with multiple programming languages using different agents in different stages ?\n\nA: Yes, Jenkins can be used to build applications with multiple programming languages by using different build agents in different stages of the build process.\n\nJenkins supports multiple build agents, which can be used to run build jobs on different platforms and with different configurations. By using different agents in different stages of the build process, you can build applications with multiple programming languages and ensure that the appropriate tools and libraries are available for each language.\n\nFor example, you can use one agent for compiling Java code and another agent for building a Node.js application. The agents can be configured to use different operating systems, different versions of programming languages, and different libraries and tools.\n\nJenkins also provides a wide range of plugins that can be used to support multiple programming languages and build tools, making it easy to integrate different parts of the build process and manage the dependencies required for each stage.\n\nOverall, Jenkins is a flexible and powerful tool that can be used to build applications with multiple programming languages and support different stages of the build process.\n\nQ: How to setup auto-scaling group for Jenkins in AWS ?\n\nA: Here is a high-level overview of how to set up an autoscaling group for Jenkins in Amazon Web Services (AWS):\n```\n    - Launch EC2 instances: Create an Amazon Elastic Compute Cloud (EC2) instance with the desired configuration and install Jenkins on it. This instance will be used as the base image for the autoscaling group.\n    \n    - Create Launch Configuration: Create a launch configuration in AWS Auto Scaling that specifies the EC2 instance type, the base image (created in step 1), and any additional configuration settings such as storage, security groups, and key pairs.\n    \n    - Create Autoscaling Group: Create an autoscaling group in AWS Auto Scaling and specify the launch configuration created in step 2. Also, specify the desired number of instances, the minimum number of instances, and the maximum number of instances for the autoscaling group.\n    \n    - Configure Scaling Policy: Configure a scaling policy for the autoscaling group to determine when new instances should be added or removed from the group. This can be based on the average CPU utilization of the instances or other performance metrics.\n    \n    - Load Balancer: Create a load balancer in Amazon Elastic Load Balancer (ELB) and configure it to forward traffic to the autoscaling group.\n    \n    - Connect to Jenkins: Connect to the Jenkins instance using the load balancer endpoint or the public IP address of one of the instances in the autoscaling group.\n    \n    - Monitoring: Monitor the instances in the autoscaling group using Amazon CloudWatch to ensure that they are healthy and that the autoscaling policy is functioning as expected.\n\n By using an autoscaling group for Jenkins, you can ensure that you have the appropriate number of instances available to handle the load on your build processes, and that new instances can be added or removed automatically as needed. This helps to ensure the reliability and scalability of your Jenkins environment.\n```\n\nQ: How to add a new worker node in Jenkins ?\n\nA: Log into the Jenkins master and navigate to Manage Jenkins > Manage Nodes > New Node. Enter a name for the new node and select Permanent Agent. Configure SSH and click on Launch.\n\nQ: How to add a new plugin in Jenkins ?\n\nA: Using the CLI, \n   `java -jar jenkins-cli.jar install-plugin <PLUGIN_NAME>`\n  \n  Using the UI,\n\n   1. Click on the \"Manage Jenkins\" link in the left-side menu.\n   2. Click on the \"Manage Plugins\" link.\n\nQ: What is JNLP and why is it used in Jenkins ?\n\nA: In Jenkins, JNLP is used to allow agents (also known as \"slave nodes\") to be launched and managed remotely by the Jenkins master instance. This allows Jenkins to distribute build tasks to multiple agents, providing scalability and improving performance.\n\n   When a Jenkins agent is launched using JNLP, it connects to the Jenkins master and receives build tasks, which it then executes. The results of the build are then sent back to the master and displayed in the Jenkins user interface.\n\nQ: What are some of the common plugins that you use in Jenkins ?\n\nA: Be prepared for answer, you need to have atleast 3-4 on top of your head, so that interview feels you use jenkins on a day-to-day basis.\n\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.05078125,
          "content": "MIT License\n\nCopyright (c) 2023 Abhishek Veeramalla\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.6201171875,
          "content": "# Jenkins-Zero-To-Hero\n\nAre you looking forward to learn Jenkins right from Zero(installation) to Hero(Build end to end pipelines)? then you are at the right place. \n\n## Installation on EC2 Instance\n\nYouTube Video ->\nhttps://www.youtube.com/watch?v=zZfhAXfBvVA&list=RDCMUCnnQ3ybuyFdzvgv2Ky5jnAA&index=1\n\n\n![Screenshot 2023-02-01 at 5 46 14 PM](https://user-images.githubusercontent.com/43399466/216040281-6c8b89c3-8c22-4620-ad1c-8edd78eb31ae.png)\n\nInstall Jenkins, configure Docker as agent, set up cicd, deploy applications to k8s and much more.\n\n## AWS EC2 Instance\n\n- Go to AWS Console\n- Instances(running)\n- Launch instances\n\n<img width=\"994\" alt=\"Screenshot 2023-02-01 at 12 37 45 PM\" src=\"https://user-images.githubusercontent.com/43399466/215974891-196abfe9-ace0-407b-abd2-adcffe218e3f.png\">\n\n### Install Jenkins.\n\nPre-Requisites:\n - Java (JDK)\n\n### Run the below commands to install Java and Jenkins\n\nInstall Java\n\n```\nsudo apt update\nsudo apt install openjdk-17-jre\n```\n\nVerify Java is Installed\n\n```\njava -version\n```\n\nNow, you can proceed with installing Jenkins\n\n```\ncurl -fsSL https://pkg.jenkins.io/debian/jenkins.io-2023.key | sudo tee \\\n  /usr/share/keyrings/jenkins-keyring.asc > /dev/null\necho deb [signed-by=/usr/share/keyrings/jenkins-keyring.asc] \\\n  https://pkg.jenkins.io/debian binary/ | sudo tee \\\n  /etc/apt/sources.list.d/jenkins.list > /dev/null\nsudo apt-get update\nsudo apt-get install jenkins\n```\n\n**Note: ** By default, Jenkins will not be accessible to the external world due to the inbound traffic restriction by AWS. Open port 8080 in the inbound traffic rules as show below.\n\n- EC2 > Instances > Click on <Instance-ID>\n- In the bottom tabs -> Click on Security\n- Security groups\n- Add inbound traffic rules as shown in the image (you can just allow TCP 8080 as well, in my case, I allowed `All traffic`).\n\n<img width=\"1187\" alt=\"Screenshot 2023-02-01 at 12 42 01 PM\" src=\"https://user-images.githubusercontent.com/43399466/215975712-2fc569cb-9d76-49b4-9345-d8b62187aa22.png\">\n\n\n### Login to Jenkins using the below URL:\n\nhttp://<ec2-instance-public-ip-address>:8080    [You can get the ec2-instance-public-ip-address from your AWS EC2 console page]\n\nNote: If you are not interested in allowing `All Traffic` to your EC2 instance\n      1. Delete the inbound traffic rule for your instance\n      2. Edit the inbound traffic rule to only allow custom TCP port `8080`\n  \nAfter you login to Jenkins, \n      - Run the command to copy the Jenkins Admin Password - `sudo cat /var/lib/jenkins/secrets/initialAdminPassword`\n      - Enter the Administrator password\n      \n<img width=\"1291\" alt=\"Screenshot 2023-02-01 at 10 56 25 AM\" src=\"https://user-images.githubusercontent.com/43399466/215959008-3ebca431-1f14-4d81-9f12-6bb232bfbee3.png\">\n\n### Click on Install suggested plugins\n\n<img width=\"1291\" alt=\"Screenshot 2023-02-01 at 10 58 40 AM\" src=\"https://user-images.githubusercontent.com/43399466/215959294-047eadef-7e64-4795-bd3b-b1efb0375988.png\">\n\nWait for the Jenkins to Install suggested plugins\n\n<img width=\"1291\" alt=\"Screenshot 2023-02-01 at 10 59 31 AM\" src=\"https://user-images.githubusercontent.com/43399466/215959398-344b5721-28ec-47a5-8908-b698e435608d.png\">\n\nCreate First Admin User or Skip the step [If you want to use this Jenkins instance for future use-cases as well, better to create admin user]\n\n<img width=\"990\" alt=\"Screenshot 2023-02-01 at 11 02 09 AM\" src=\"https://user-images.githubusercontent.com/43399466/215959757-403246c8-e739-4103-9265-6bdab418013e.png\">\n\nJenkins Installation is Successful. You can now starting using the Jenkins \n\n<img width=\"990\" alt=\"Screenshot 2023-02-01 at 11 14 13 AM\" src=\"https://user-images.githubusercontent.com/43399466/215961440-3f13f82b-61a2-4117-88bc-0da265a67fa7.png\">\n\n## Install the Docker Pipeline plugin in Jenkins:\n\n   - Log in to Jenkins.\n   - Go to Manage Jenkins > Manage Plugins.\n   - In the Available tab, search for \"Docker Pipeline\".\n   - Select the plugin and click the Install button.\n   - Restart Jenkins after the plugin is installed.\n   \n<img width=\"1392\" alt=\"Screenshot 2023-02-01 at 12 17 02 PM\" src=\"https://user-images.githubusercontent.com/43399466/215973898-7c366525-15db-4876-bd71-49522ecb267d.png\">\n\nWait for the Jenkins to be restarted.\n\n\n## Docker Slave Configuration\n\nRun the below command to Install Docker\n\n```\nsudo apt update\nsudo apt install docker.io\n```\n \n### Grant Jenkins user and Ubuntu user permission to docker deamon.\n\n```\nsudo su - \nusermod -aG docker jenkins\nusermod -aG docker ubuntu\nsystemctl restart docker\n```\n\nOnce you are done with the above steps, it is better to restart Jenkins.\n\n```\nhttp://<ec2-instance-public-ip>:8080/restart\n```\n\nThe docker agent configuration is now successful.\n\n\n\n\n"
        },
        {
          "name": "java-maven-sonar-argocd-helm-k8s",
          "type": "tree",
          "content": null
        },
        {
          "name": "multi-stage-multi-agent",
          "type": "tree",
          "content": null
        },
        {
          "name": "my-first-pipeline",
          "type": "tree",
          "content": null
        },
        {
          "name": "python-jenkins-argocd-k8s",
          "type": "tree",
          "content": null
        },
        {
          "name": "shared-libraries",
          "type": "tree",
          "content": null
        },
        {
          "name": "vars",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}