{
  "metadata": {
    "timestamp": 1736560911869,
    "page": 639,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "FederatedAI/FATE",
      "stars": 5779,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.42578125,
          "content": "# common file patterns\n.DS_STORE\n.idea\n.vscode/*\n*.iml\n*.pyc\n__pycache__\nvenv\n*.tar.gz\n*.db\n*.db-journal\n*.mdb\n*.jar\n.env\nCargo.lock\n\n# excluded paths\n/python/dist/\n/rust/**/target/\n/build/\n/java/**/target/\n/fateboard/target/\n/fate_flow/logs/\n/fate_flow/jobs/\n/java/osx/deploy/osx\n/dist/\n/schemas/\n/data/\n/logs/\n\n# logs\n**/logs/*\n\n# editable install\nPKG-INFO\nentry_points.txt\ndependency_links.txt\nrequires.txt\nSOURCES.txt\ntop_level.txt\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.537109375,
          "content": "[submodule \"eggroll\"]\n\tpath = eggroll\n\turl = https://github.com/FederatedAI/eggroll.git\n\tbranch = v3.2.0\n[submodule \"fate_client\"]\n\tpath = fate_client\n\turl = https://github.com/FederatedAI/FATE-Client\n\tbranch = v2.2.0\n[submodule \"fate_flow\"]\n\tpath = fate_flow\n\turl = https://github.com/FederatedAI/FATE-Flow\n\tbranch = v2.2.0\n[submodule \"fate_test\"]\n\tpath = fate_test\n\turl = https://github.com/FederatedAI/FATE-Test.git\n\tbranch = v2.2.0\n[submodule \"fate_board\"]\n\tpath = fate_board\n\turl = https://github.com/FederatedAI/FATE-Board.git\n\tbranch = v2.1.0\n"
        },
        {
          "name": ".pre-commit-config.yaml",
          "type": "blob",
          "size": 0.3271484375,
          "content": "repos:\n  - repo: https://github.com/pycqa/isort\n    rev: 5.12.0\n    hooks:\n      - id: isort\n  - repo: https://github.com/psf/black\n    rev: 22.8.0\n    hooks:\n      - id: black\n        exclude: |\n            (?x)^(\n                .*_pb2\\.py |\n                .*_pb2_grpc\\.py |\n            )$\n        args: [--config=./pyproject.toml]\n"
        },
        {
          "name": ".readthedocs.yml",
          "type": "blob",
          "size": 0.2158203125,
          "content": "version: 2\n\nmkdocs:\n  # configuration: .readthedocs.mkdocs.yml\n  fail_on_warning: false\n\nformats: all\n\nbuild:\n  os: ubuntu-22.04\n  tools:\n    python: \"3.8\"\npython:\n  install:\n  - requirements: doc/mkdocs/requirements.txt\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.2705078125,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at contact@fedai.org. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 5.3046875,
          "content": "# Contributing\n\nWhen contributing to this repository, please first discuss the change you wish to make via issue,\nemail whose address is contact@FedAI.org (or use the link [mailto](mailto:contact@FedAI.org) directly), or any other method with the owners of this repository before making a change. For more contact information, you may also refer to our [official website](https://www.fedai.org/)\n\nPlease note we have a code of conduct, please follow it in all your interactions with the project.\n\n## Pull Request Checklist\n\nBefore sending your pull requests, make sure you followed this list.\n\n- Read [contributing guidelines](CONTRIBUTING.md).\n- Read [Code of Conduct](CODE_OF_CONDUCT.md).\n- Follow the instruction of [develop guide](doc/develop/develop_guide.rst)\n- Ensure you have signed the [Developer Certificate of Origin (DCO)](https://developercertificate.org/).\n- Check if my changes are consistent with the [guidelines](https://github.com/FederatedAI/FATE/blob/master/CONTRIBUTING.md#contributing-to-fate).\n- Changes are consistent with the [PEP.8 Python Coding Style](https://www.python.org/dev/peps/pep-0008/).\n- Run [unit tests and write examples](https://github.com/FederatedAI/FATE/blob/master/CONTRIBUTING.md#contribution-guidelines-and-standards).\n\n\n## Contributing to FATE\n\n### Developer Certificate of Origin\n\nWe are more than glad to accept your patches. To start with, please make sure you have signed every commit with Developer Certificate of Origin (DCO). If you are still not familiar with DCO, please check [this website](https://www.dita-ot.org/dco) for more information.\n\n## Contributing code\n\n1. If you want to purpose a new feature and implement it, please open an issue and discuss the design and implementation with us.\n\n2. If you are interested in implementing an existed feature or bug-fix issue, please make a comment on the task that you want to work. And it is still strong recommended to discuss with us about your design and implementation.\n\n3. If you are not sure where to start, trying smaller and easier issue may be a good idea and then take a look at the issue with the \"contributions welcome\" label.\n\nOnce you are ready to send your pull request, we will create a contributor branch to which you can send pull request. Then, FATE team members will be assigned to review and test your pull request. Once the review is pass, your contribution is accepted and will be released in a future version.\n\nIf you have ideas of new features but don't know how to start with, a [develop guide](doc/develop/develop_guide.rst)  has been provided\n\n## Contributing\n\n### Contribution guidelines and standards\n\nBefore sending your pull request, here are some principle and standards to follow.\n\n* Include unit tests when you contribute new features. You may created a test folder in your module and put your test files in it. Here is [an example](./federatedml/model_selection/test/).  FATE provides a [test script](./federatedml/test/run_test.sh) for you to check all unit test. Make sure your code work correctly.\n\n* Provide examples in [example folder](./examples). If specific format data is needed, please also provided example data in [data folder](./example/data). In your algorithm examples, some dsl and conf files should be provided and provide a testsuite file with which user can test your example easily. Here is [an example of testsuite file](./examples/dsl/v2/hetero_logistic_regression/hetero_lr_testsuite.json)\n\n* After you contribute a new feature to FATE, FATE team members are (by default) responsible for the maintenance of this feature. This means we must make comparison between the benefit of contribution and the cost of maintaining the feature and accept those features with greater benefits.\n\n### License\nInclude a license at the top of new files. A license example has list below.\n\n```\n#\n#  Copyright 2019 The FATE Authors. All Rights Reserved.\n#\n#  Licensed under the Apache License, Version 2.0 (the \"License\");\n#  you may not use this file except in compliance with the License.\n#  You may obtain a copy of the License at\n#\n#      http://www.apache.org/licenses/LICENSE-2.0\n#\n#  Unless required by applicable law or agreed to in writing, software\n#  distributed under the License is distributed on an \"AS IS\" BASIS,\n#  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n#  See the License for the specific language governing permissions and\n#  limitations under the License.\n#\n```\n\n### Code Style\n\nYou should make sure your code and comments are consistent with the following coding style.\n\n* [PEP.8 Python Coding Style](https://www.python.org/dev/peps/pep-0008/).\n\n* [Numpy Docstring Format](https://numpydoc.readthedocs.io/en/latest/format.html#docstring-standard)\n\n### Pull Request Process\n\n1. Ensure any install or build dependencies are removed before the end of the layer when doing a build.\n2. Update the README.md with details of changes to the interface, this includes new environment variables, exposed ports, useful file locations and container parameters.\n3. Increase the version numbers in any examples files and the README.md to the new version that this Pull Request would represent. The versioning scheme we use is [SemVer](http://semver.org/).\n4. You may merge the Pull Request in once you have the sign-off of two other developers, or if you do not have permission to do that, you may request the second reviewer to merge it for you.\n"
        },
        {
          "name": "DISCLAIMER",
          "type": "blob",
          "size": 2.5908203125,
          "content": "\nDISCLAIMER\n\nThe copyright owner and all the contributors (collectively, the \"Licensors\") of FATE/FederatedAI (the \"Work\") non-exclusively grant any individual or legal entity (the \"Licensee\") the license to use the Work on condition that the Licensee consents to and agrees to be bound by this Disclaimer.\n\nThe Licensee acknowledges that the Licensors provide the Work on an \"AS IS\" basis and makes no warranties or conditions, express or implied, on the Work to the Licensee. The Licensors assume no obligations and responsibilities other than providing the Work.\n\nThe Licensee agrees that the Licensee shall use the Work at its own risk. Any problems or consequences arising from the use of the Work by the Licensee shall not be attributed to the Licensors and shall be borne by the Licensee, including but not limited to system failure, security vulnerabilities, title defects, third-party claims, commercial loss, etc.\n\nThe Licensee shall also acknowledge to abide by the rules on the use of the Work, not to infringe the rights and interests of the Licensors and the Work, and not to cause the Licensors to suffer any loss or assume any responsibility. Whether the Licensee is held accountable or not, the Licensors shall be exempted from any liability.\n\nAn act of use of the Work by the Licensee shall be deemed as the consent to be bound by this Disclaimer.\n\n\n\n免责条款\n\n　　FATE/FederatedAI（简称为“作品”）的著作权人及每一位贡献者（统称为“授权人”）开放地授予任何个人或法人实体（简称为“被授权人”）使用许可，但被授权人接受许可还应当同意本免责条款，并受到本免责条款的约束。\n　　\n　　被授权人确认，授权人是以“原样”（AS IS）基础向被授权人提供作品，且不对作品向被授权人作出任何明示或暗示的保证或条件。除提供作品之外，授权人不承担任何义务与责任。\n　　\n　　被授权人同意，被授权人应当自担使用作品的风险。被授权人使用作品过程中发生任何的问题或产生的任何后果与授权人无关，均由被授权人自行承担，包括但不限于系统故障、安全漏洞、权利瑕疵、第三人主张、商业损失等。\n　　\n　　被授权人还应当承诺遵守作品的使用规则，不得作出任何侵害授权人以及作品权益的行为，不得使授权人遭受任何损失或承担任何责任。不论被授权人是否被追责均应使得授权人免于任何责任。\n　　\n　　被授权人使用作品的行为即表示其受到本免责条款的约束，对被授权人具有法律约束力。\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 1.951171875,
          "content": "mkfile_path := $(abspath $(lastword $(MAKEFILE_LIST)))\nmkfile_dir := $(dir $(mkfile_path))\n.DEFAULT_GOAL:=help\n\n##@ Dev\n.PHONY: install-rust\ninstall-rust_paillier: ## Install rust_paillier.\n\t@echo \"install fate_utils\"\n\t@cd ${mkfile_dir} && \\\n\t\t. venv/bin/activate.sh && \\\n\t\tmaturin develop --release -m rust/fate_utils/Cargo.toml --target-dir build\n\n##@ Build\n.PHONY: build-rust\nbuild-rust: ## Build fate_utils.\n\t@echo \"build fate_utils\"\n\t@cd ${mkfile_dir} && \\\n\t\t. ${mkfile_dir}venv/bin/activate && \\\n\t\tmaturin build --release -m rust/fate_utils/crates/fate_utils/Cargo.toml --out dist --target-dir build\n\n.PHONY: build-fate\nbuild-fate: ## Build fate\n\t@echo \"build fate\"\n\t@cd ${mkfile_dir}/python && \\\n\t\tpython3 setup.py sdist --formats=gztar -d ../dist\n\n.PHONY: build ## Build all\nbuild: build-rust_paillier build-fate\n\t@echo \"build all\"\n\n##@ Generate\n.PHONY: gen-osx-proto\ngen-osx-proto: ## Generate osx protobuf.\n\t@cd ${mkfile_dir} && \\\n\t\tpython3 -m grpc_tools.protoc --proto_path=proto/ \\\n\t\t--python_out=python/fate/arch/federation/backends/osx/ \\\n\t\t--grpc_python_out=python/fate/arch/federation/backends/osx/ \\\n\t\tproto/osx/osx.proto\n\n.PHONY: gen-task-jsonschema\ngen-task-jsonschema: ## Generate task jsonschema.\n\t@cd ${mkfile_dir}/python && \\\n\t    mkdir -p ${mkfile_dir}/schemas && \\\n\t\tpython3 -c \"from fate.components.core.spec.task import TaskConfigSpec; print(TaskConfigSpec.schema_json(indent=2))\" >> \\\n\t\t${mkfile_dir}/schemas/task.schema.json\n\n##@ Clean\n.PHONY: clean\nclean: ## Clean unused files.\n\t@cd ${mkfile_dir} && \\\n\t\trm -rf dist/ build/ rust/tensor/rust_paillier/target && \\\n\t\tfind python -name '*.pyc' -exec rm -f {} \\; && \\\n\t\tfind python -name '__pycache__' -exec rm -rf {} \\+ && \\\n\t\tfind python -name '*.egg-info' -exec rm -rf {} \\+\n\n.PHONY: help\nhelp:\n\t@awk 'BEGIN {FS = \":.*##\"; printf \"Usage: make \\033[36m<target>\\033[0m\\n\"} /^[a-zA-Z_-]+:.*?##/ { printf \"  \\033[36m%-25s\\033[0m %s\\n\", $$1, $$2 } /^##@/ { printf \"\\n\\033[1m%s\\033[0m\\n\", substr($$0, 5) } ' $(MAKEFILE_LIST)\n"
        },
        {
          "name": "PULL_REQUEST_TEMPLATE.md",
          "type": "blob",
          "size": 0.0712890625,
          "content": "Signed-off-by: githubID email\n\nFixes  ISSUE #xxx\n\nChanges:\n\n1.\n\n2.\n\n3.\n\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.4345703125,
          "content": "[![License](https://img.shields.io/badge/License-Apache%202.0-blue.svg)](https://opensource.org/licenses/Apache-2.0) [![CodeStyle](https://img.shields.io/badge/Check%20Style-Google-brightgreen)](https://checkstyle.sourceforge.io/google_style.html) [![Style](https://img.shields.io/badge/Check%20Style-Black-black)](https://checkstyle.sourceforge.io/google_style.html) [![Build Status](https://travis-ci.org/FederatedAI/FATE.svg?branch=master)](https://travis-ci.org/FederatedAI/FATE)\n[![codecov](https://codecov.io/gh/FederatedAI/FATE/branch/master/graph/badge.svg)](https://codecov.io/gh/FederatedAI/FATE)\n[![Documentation Status](https://readthedocs.org/projects/fate/badge/?version=latest)](https://fate.readthedocs.io/en/latest/?badge=latest)\n[![Gitpod Ready-to-Code](https://img.shields.io/badge/Gitpod-Ready--to--Code-blue?logo=gitpod)](https://gitpod.io/from-referrer/)\n[![CII Best Practices](https://bestpractices.coreinfrastructure.org/projects/6308/badge)](https://bestpractices.coreinfrastructure.org/projects/6308)\n\n\n<div align=\"center\">\n  <img src=\"./doc/images/FATE_logo.png\">\n</div>\n\n\nFATE (Federated AI Technology Enabler) is the world's first industrial grade federated learning open source framework to enable enterprises and institutions to collaborate on data while protecting data security and privacy. \nIt implements secure computation protocols based on homomorphic encryption and multi-party computation (MPC). \nSupporting various federated learning scenarios, FATE now provides a host of federated learning algorithms, including logistic regression, tree-based algorithms, deep learning and transfer learning.\n\n\nFATE is an open source project hosted by Linux Foundation. The [Technical Charter](https://github.com/FederatedAI/FATE-Community/blob/master/FATE_Project_Technical_Charter.pdf) sets forth the responsibilities and procedures for technical contribution to, and oversight of, the FATE (“Federated AI Technology Enabler”) Project. \n\n<https://fate.readthedocs.io/en/latest>\n\n\n## Getting Started\nFATE can be deployed on a single node or on multiple nodes. Choose the deployment approach which matches your environment.\n[Release version can be downloaded here.](https://github.com/FederatedAI/FATE/wiki/Download)\n\n\n### Version >= 2.0\n### Standalone deployment\n\n- Deploying FATE on a single node via PyPI, pre-built docker images or installers. It is for simple testing purposes. Refer to this [guide](./deploy/standalone-deploy/).\n\n### Cluster deployment\nDeploying FATE to multiple nodes to achieve scalability, reliability and manageability.\n- [Cluster deployment by CLI](./deploy/cluster-deploy): Using CLI to deploy a FATE cluster.\n- [Docker-Compose deployment](./deploy/docker-compose): Using docker-compose to deploy FATE.\n\n### Quick Start\n- [Training Demo with Only FATE Installed From Pypi](doc/2.0/fate/ml)\n- [Training Demo with Both FATE AND FATE-Flow Installed From Pypi](doc/2.0/fate/quick_start.md)\n\n### Advanced Use\n- [Train & Predict for Homo Mode](./doc/2.0/fate/homo_quick_start.md)\n- [Run ML Launchers](./doc/README.md#run-ml-modulessince-v200)\n\n### More examples\n- [ML examples](examples/launchers)\n- [PipeLine examples](examples/pipeline)\n\n## Documentation\n\n### FATE Design\n- [Architecture](./doc/architecture/README.md): Building Unified and Standardized API for Heterogeneous Computing Engines Interconnection\n- [FATE Algorithm Components](./doc/2.0/fate/components/README.md): Building Standardized Algorithm Components for different Scheduling Engines\n- [OSX (Open Site Exchange)](./doc/2.0/osx/osx.md): Building Open Platform for Cross-Site Communication Interconnection\n- [FATE-Flow](https://github.com/FederatedAI/FATE-Flow/blob/main/doc/fate_flow.md): Building Open and Standardized Scheduling Platform for Scheduling Interconnection \n- [PipeLine Design](https://github.com/FederatedAI/FATE-Client/blob/main/doc/pipeline.md): Building Scalable Federated DSL for Application Layer Interconnection And Providing Tools For Fast Federated Modeling\n- [RoadMap](./doc/images/roadmap.png)\n- [Paper & Conference](./doc/resources/README.md)\n\n### Develop Guide\n- [Dag Usage Guide](./doc/2.0/fate/dag.md)\n- [Component Develop Guide](./doc/develop_guide/component_guide.md)  \n\n\n## Related Repositories (Projects)\n- [KubeFATE](https://github.com/FederatedAI/KubeFATE): An operational tool for the FATE platform using cloud native technologies such as containers and Kubernetes.\n- [FATE-Flow](https://github.com/FederatedAI/FATE-Flow): A multi-party secure task scheduling platform for federated learning pipeline.\n- [FATE-Board](https://github.com/FederatedAI/FATE-Board): A suite of visualization tools to explore and understand federated models easily and effectively.\n- [FATE-Serving](https://github.com/FederatedAI/FATE-Serving): A high-performance and production-ready serving system for federated learning models.\n- [FATE-Cloud](https://github.com/FederatedAI/FATE-Cloud): An infrastructure for building and managing industrial-grade federated learning cloud services.\n- [EggRoll](https://github.com/WeBankFinTech/eggroll): A simple high-performance computing framework for (federated) machine learning.\n- [AnsibleFATE](https://github.com/FederatedAI/AnsibleFATE): A tool to optimize and automate the configuration and deployment operations via Ansible.\n- [FATE-Builder](https://github.com/FederatedAI/FATE-Builder): A tool to build package and docker image for FATE and KubeFATE.\n- [FATE-Client](https://github.com/FederatedAI/FATE-Client): A tool to enable fast federated modeling tasks for FATE.\n- [FATE-Test](https://github.com/FederatedAI/FATE-Test): An automated testing tool for FATE, including tests and benchmark comparisons.\n- [FATE-LLM](https://github.com/FederatedAI/FATE-LLM/blob/main/README.md) : A framework to support federated learning for large language models(LLMs).\n\n## Governance \n\n[FATE-Community](https://github.com/FederatedAI/FATE-Community) contains all the documents about how the community members cooperate with each other. \n\n- [GOVERNANCE.md](https://github.com/FederatedAI/FATE-Community/blob/master/GOVERNANCE.md) documents the governance model of the project. \n- [Minutes](https://github.com/FederatedAI/FATE-Community/blob/master/meeting-minutes) of working meetings\n- [Development Process Guidelines](https://github.com/FederatedAI/FATE-Community/blob/master/FederatedAI_PROJECT_PROCESS_GUIDELINE.md) \n- [Security Release Process](https://github.com/FederatedAI/FATE-Community/blob/master/SECURITY.md) \n\n\n## Getting Involved\n\n### Contributing\nFATE is an inclusive and open community. We welcome developers who are interested in making FATE better! Contributions of all kinds are welcome. Please refer to the general [contributing guideline](https://github.com/FederatedAI/FATE-Community/blob/master/CONTRIBUTING.md) of all FATE projects and the contributing guideline of each repository.\n\n### Mailing list \n\nJoin the FATE user [mailing list](https://groups.io/g/Fate-FedAI), and stay connected with the community and learn about the latest news and information of the FATE project. Discussion and feedback on the FATE project are welcome.\n\n\n### Bugs or feature requests\n\nFile bugs and features requests via the [GitHub issues](https://github.com/FederatedAI/FATE/issues). If you need help, ask your questions via the mailing list.\n\n### Contact emails\n\nMaintainers: FedAI-maintainers @ groups.io\n\nSecurity Response Committee: FATE-security @ groups.io\n\n### Twitter\n\nFollow us on twitter [@FATEFedAI](https://twitter.com/FateFedAI)\n\n### FAQ\nhttps://github.com/FederatedAI/FATE/wiki\n\n\n## License\n[Apache License 2.0](LICENSE)\n\n"
        },
        {
          "name": "RELEASE.md",
          "type": "blob",
          "size": 7.8017578125,
          "content": "## Release 2.2.0\n### Major Features and Improvements\n> Deployment\n* Upgrade from Python 3.8 to Python 3.10\n* Upgrade the PyTorch version to 2.x\n\n\n## Release 2.1.1\n### Major Features and Improvements\n> Component\n* Support server model saving in Homo-NN\n\n> ML\n* aggregator support aggregation of torch.bfloat16 data type\n\n\n## Release 2.1.0\n### Major Features and Improvements\n> Arch\n* Some bugs fixed for spark computing engine\n\n> Component\n* Unified IO keys naming format for all components\n* Add LLMLoader to support running FATE-LLM v2.0 with pipeline\n\n> OSX\n* Compatible with eggroll-v2.x\n\n\n## Release 2.0.0\n### Major Features and Improvements\n> Arch 2.0：Building Unified and Standardized API for Heterogeneous Computing Engines Interconnection\n* Introduce `Context` to manage useful APIs for developers, such as `Distributed Compting`, `Federation`, `Cipher`, `Tensor`, `Metrics`,  and `IO`.\n* Introduce `Tensor` data structure to handle local and distributed matrix operation, with built-in heterogeneous acceleration support. \n  * abstracted PHETensor, smooth switch between various underlying PHE implementations through standard interface\n* Introduce `DataFrame`, a 2D tabular data structure for data io and simple feature engineering\n  * add data block manager to support mixed-type columns & feature anonymization\n  * added 30+ operator interfaces for statistics, including comparison, indexing, data binning, and transformation, etc\n* Refactor `Federation`, a unified interface for federated computing. We provide a unified Serdes control and more user-friendly api.\n* Introduce `Config`, a unified configuration for FATE, including safety restrictions, system configuration, and algorithm configuration\n* Refactor `logger`, customizable logging for different use cases and flavors.\n* Introduce `Launcher`, a simple tool for federated program execution, especially useful for standalone and local debugging\n* Framework: PSI-ECDH protocol support, single entry for histogram statistical computation \n* Deepspeed integration: support distributed training using deepspeed with Eggroll.\n* Protocol: Support for SSHE(mpc and homomophic encryption mixed protocol), ECDH, Secure Aggregation protocols\n* Experimental Integrate `Crypten` for SMPC support, more protocols and features will be added in the future\n\n> Components 2.0: Building Standardized Algorithm Components for different Scheduling Engines\n* Introduce components toolbox to wrap ML modules as standard executable programs\n* spec and loader expose clear API for smooth internal extension and external system integration\n* Provide several cli tools to interact and execute components\n* Input-Output: Further decoupling of FATE-Flow, providing standardized black-box calling processes \n* Component Definition: Support for typing-based definition, automatic checking for component parameters, support for multiple types of data and model input and output, in addition to multiple inputs\n\n> ML 2.0: Major functionality migration from FATE-v1.x, decoupling call hierarchy\n* Data preprocessing: Added DataFrame Transformer; Reader, Union and DataSplit migration completed\n* Feature Engineering: Migrated HeteroFederatedBinning, HeteroFeatureSelection, DataStatistics, Sampling, FeatureScale and Pearson Correlation\n* Federated Training Migrated: HeteroSecureBoost, HomoNN, HeteroCoordinatedLogisticRegression, HeteroCoordinatedLinearRegression, SSHE-LogisticRegression and SSHE-LinearRegression\n* Federated Training Added: \n  * SSHE-HeteroNN: based on mpc and homomorphic encryption mixed protocal\n  * FedPASS-HeteroNN: based on fedpass protocol\n\n> Algorithm Performance Improvements: (Comparison with FATE-v1.11.*)\n* PSI (Privacy Set Intersection): tested on a dataset of 100 million with an intersection result of 100 million, 1.8+ times of FATE-v1.11.4\n* Hetero-SSHE-LR: tested on data of guest 10w * 30 dimensions and host 10w * 300 dimensions, 4.3+ times of FATE-v1.11.4\n* Hetero-NN(Based on FedPass Protocol):  tested on data of guest 10w * 30 dimensions and host 10w * 300 dimensions, basically consistent with the plaintext performance, 143+ times of FATE-v1.11.4 \n* Hetero-Coordinated-LR: tested on data of guest 10w * 30 dimensions and host 10w * 300 dimensions, 1.2+ times of FATE-v1.11.4\n* Hetero-Feature-Binning: tested on data of guest 10w * 30 dimensions and host 10w * 300 dimensions, 1.5+ times of FATE-v1.11.4\n\n> OSX(Open Site Exchange) 1.0: Building Open Platform for Cross-Site Communication Interconnection \n* Implement the transmission interface in accordance with the “ Technical Specification for Financial Industry Privacy Computing Interconnection Platform”,The transmission interface is compatible with FATE 1.X version and  FATE 2.X version\n* Supports GRPC synchronous and streaming transmission, supports TLS secure transmission protocol, and is compatible with FATE1.X rollsite components\n* Supports Http 1.X protocol transmission and TLS secure transmission protocol\n* Support message queue mode transmission, used to replace rabbitmq and pulsar components in FATE 1.X\n* Supports Eggroll and Spark computing engines\n* Supports networking as an Exchange component, with support for FATE 1.X and FATE 2.X access\n* Compared to the rollsite component, it improves the exception handling logic during transmission and provides more accurate log output for quickly locating exceptions.\n* The routing configuration is basically consistent with the original rollsite, reducing the difficulty of porting\n* Supports HTTP interface modification of routing tables and provides simple permission verification\n* Improved network connection management logic, reduced connection leakage risk, and improved transmission efficiency\n* Using different ports to handle access requests both inside and outside the cluster, facilitating the adoption of different security policies for different ports\n\n> FATE Flow 2.0: Building Open and Standardized Scheduling Platform for Scheduling Interconnection\n* Adapted to new scalable and standardized federated DSL IR\n* Built an interconnected scheduling layer framework, supported the BFIA protocol\n* Optimized process scheduling, with scheduling separated and customizable, and added priority scheduling\n* Optimized algorithm component scheduling，support container-level algorithm loading， enhancing support for cross-platform heterogeneous scenarios\n* Optimized multi-version algorithm component registration, supporting registration for mode of components\n* Federated DSL IR extension enhancement: supports multi-party asymmetric scheduling\n* Optimized client authentication logic, supporting permission management for multiple clients\n* Optimized RESTful interface, making parameter fields and types, return fields, and status codes clearer\n* Added OFX(Open Flow Exchange) module: encapsulated scheduling client to allow cross-platform scheduling\n* Supported the new communication engine OSX, while remaining compatible with all engines from FATE Flow 1.x\n* Decoupled the System Layer and the Algorithm Layer, with system configuration moved from the FATE repository to the Flow repository\n* Published FATE Flow package to PyPI and added service-level CLI for service management\n* Migrated major functionality from FATE Flow 1.x\n\n> Fate-Client 2.0: Building Scalable Federated DSL for Application Layer Interconnection And Providing Tools For Fast Federated Modeling.\n* Introduce new scalable and standardized federated DSL IR(Intermediate Representation) for federated modeling job\n* Compile python client to DSL IR\n* Federated DSL IR extension enhancement: supports multi-party asymmetric scheduling\n* Support mutual translation between Standardized Fate-2.0.0 DSL IR and BFIA protocol\n* Support using components with BFIA protocol through adapter mode\n* Migrated Flow CLI and Flow SDK\n\n> Fate-Test: FATE Automated Testing Tool\n* Migrated automated testing for functionality, performance, and correctness\n\n> Easy Deploy\n* Supports installation of FATE by PyPi\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "c",
          "type": "tree",
          "content": null
        },
        {
          "name": "configs",
          "type": "tree",
          "content": null
        },
        {
          "name": "deploy",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "eggroll",
          "type": "commit",
          "content": null
        },
        {
          "name": "examples",
          "type": "tree",
          "content": null
        },
        {
          "name": "fate_board",
          "type": "commit",
          "content": null
        },
        {
          "name": "fate_client",
          "type": "commit",
          "content": null
        },
        {
          "name": "fate_flow",
          "type": "commit",
          "content": null
        },
        {
          "name": "fate_test",
          "type": "commit",
          "content": null
        },
        {
          "name": "java",
          "type": "tree",
          "content": null
        },
        {
          "name": "mkdocs.yml",
          "type": "blob",
          "size": 3.810546875,
          "content": "site_name: FATE\nsite_url: https://fate.readthedocs.io/en/latest\nrepo_name: FederatedAI/FATE\nrepo_url: https://github.com/FederatedAI/FATE\nedit_uri: edit/master/doc\ndocs_dir: doc\ncopyright: © Copyright 2020 WeBank Co., Ltd. | All Rights Reserved.\nnav:\n  - Home: index.md\n  - Architecture:\n    - architecture/README.md\n  - FATE:\n    - 2.0/fate/quick_start.md\n    - 2.0/fate/dag.md\n    - ML:\n      - ... | flat | 2.0/fate/ml/*.md\n    - Components:\n      - ... | flat | 2.0/fate/components/*.md\n    - Performance:\n      - ... | flat | 2.0/fate/performance/*.md\n  \n  - OSX:\n    - 2.0/osx/osx.md\n    - 2.0/osx/osx-tls.md\n    \ntheme:\n  name: material\n  custom_dir: \"doc/mkdocs/theme\"\n  features:\n    - navigation.tabs\n    # - navigation.expand\n    - navigation.indexes\n    - navigation.top\n    # - navigation.instant\n    - navigation.tracking\n    - header.autohide\n  icon:\n    repo: fontawesome/brands/github\n  language: en\n  font:\n    text: Roboto\n    code: Roboto Mono\n  favicon: images/logo.png\n  palette:\n    - media: \"(prefers-color-scheme: light)\"\n      scheme: default\n      primary: indigo\n      accent: indigo\n      toggle:\n        icon: material/lightbulb\n        name: Switch to dark mode\n\n    - media: \"(prefers-color-scheme: dark)\"\n      scheme: slate\n      primary: red\n      accent: red\n      toggle:\n        icon: material/lightbulb-outline\n        name: Switch to light mode\n\nplugins:\n  # - git-revision-date\n  - awesome-pages\n  # - mkdocs-simple-hooks:\n  #     hooks:\n  #       on_page_markdown: \"doc.mkdocs.hook:on_page_markdown\"\n  - search\n  # - gen-files:\n  #     scripts:\n  #       - doc/mkdocs/gen_params_doc.py\n  # - mkdocstrings:\n  #     handlers:\n  #       python:\n  #         paths: [\"python\"]\n  #         options:\n  #           docstring_style: numpy\n  #           docstring_section_style: table\n  #           merge_init_into_class: yes\n  #           show_source: true\n  #           show_category_heading: true\n  #           members_order: source\n  #           show_if_no_docstring: true\n  #         selection:\n  #           new_path_syntax: yes\n  #         enable_inventory: true\n  # - i18n:\n  #     docs_structure: suffix\n  #     languages:\n  #       - locale: en\n  #         default: true\n  #         name: English\n  #         build: true\n  #       - locale: zh\n  #         name: 中文\n  #         build: true\n  # - mkdocs-jupyter\n\nmarkdown_extensions:\n  - pymdownx.snippets\n  # - mdx_math\n  - admonition\n  - pymdownx.highlight\n  - toc:\n      permalink: true\n  - footnotes\n  - meta\n  - def_list\n  - pymdownx.arithmatex\n  - pymdownx.betterem:\n      smart_enable: all\n  - pymdownx.caret\n  - pymdownx.critic\n  - pymdownx.details\n  - pymdownx.inlinehilite\n  - pymdownx.magiclink\n  - pymdownx.mark\n  - pymdownx.smartsymbols\n  - pymdownx.superfences\n  - pymdownx.tasklist:\n      custom_checkbox: true\n  - pymdownx.tabbed\n  - pymdownx.tilde\n  - pymdownx.emoji:\n      emoji_index: !!python/name:material.extensions.emoji.twemoji\n      emoji_generator: !!python/name:materialx.emoji.to_svg\n\n\nextra:\n  alternate:\n    - name: English\n      lang: en\n      link: \"./\"\n    - name: 中文\n      lang: zh\n      link: \"./zh/\"\n\n  analytics:\n    provider: google\n    property: G-XHN446WWRD\n  \n  version:\n    provider: mike\n\n  social:\n    - icon: fontawesome/brands/github\n      link: https://github.com/FederatedAI/FATE\n    - icon: fontawesome/brands/docker\n      link: https://hub.docker.com/u/federatedai\n    - icon: octicons/video-16\n      link: https://space.bilibili.com/457797601?from=search&seid=6776229889454067000\n      name: bilibili course\n    - icon: fontawesome/brands/twitter\n      link: https://twitter.com/FateFedAI\n\nextra_css:\n  - \"mkdocs/css/termynal.css\"\n  - \"mkdocs/css/custom.css\"\n  - \"mkdocs/css/extra.css\"\n\nextra_javascript:\n  - \"mkdocs/js/termynal.js\"\n  - \"mkdocs/js/custom.js\"\n  - \"https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.0/MathJax.js?config=TeX-MML-AM_CHTML\""
        },
        {
          "name": "proto",
          "type": "tree",
          "content": null
        },
        {
          "name": "pyproject.toml",
          "type": "blob",
          "size": 0.814453125,
          "content": "[tool.autoflake]\ncheck = false\nexclude = [\"examples/*\", \"python/fate_test/*\", \"python/fate_client/*\", \"doc/*\", \"deploy/*\", \"c/*\", \"rust/*\"]\n\n[tool.isort]\nprofile = \"black\"\nskip_glob = [\"examples/*\", \"python/fate_test/*\", \"python/fate_client/*\", \"doc/*\", \"deploy/*\", \"c/*\", \"rust/*\", \"*_pb2.py\", \"*_pb2_grpc.py\"]\n\n[tool.black]\nline-length = 119\ntarget-version = ['py38']\ninclude = '\\.pyi?$'\nextend-exclude = '''\n(\n  ^/fate_flow/ |\n  ^/eggroll/ |\n  ^/examples/ |\n  ^/fate_client/ |\n  .*_pb2.py |\n  .*_pb2_grpc.py |\n  ^/examples/ |\n  ^/rust/ |\n  ^/c/ |\n  ^/doc/ |\n  ^/deploy/\n)\n'''\n\n[tool.pyright]\ninclude = [\"python\"]\nexclude = [\"**/node_modules\",\n    \"**/__pycache__\",\n    \"src/typestubs\"\n]\ndefineConstant = { DEBUG = true }\nreportMissingImports = true\nreportMissingTypeStubs = false\nexecutionEnvironments = [\n  { root = \"python\" },\n]\n"
        },
        {
          "name": "python",
          "type": "tree",
          "content": null
        },
        {
          "name": "rust",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}