{
  "metadata": {
    "timestamp": 1736560832780,
    "page": 528,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "itcharge/LeetCode-Py",
      "stars": 6299,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.787109375,
          "content": "# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# Distribution / packaging\n.Python\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\npip-wheel-metadata/\nshare/python-wheels/\n*.egg-info/\n.installed.cfg\n*.egg\nMANIFEST\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test / coverage reports\nhtmlcov/\n.tox/\n.nox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*.cover\n*.py,cover\n.hypothesis/\n.pytest_cache/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\ndb.sqlite3\ndb.sqlite3-journal\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# IPython\nprofile_default/\nipython_config.py\n\n# pyenv\n.python-version\n\n# pipenv\n#   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.\n#   However, in case of collaboration, if having platform-specific dependencies or dependencies\n#   having no cross-platform support, pipenv may install dependencies that don't work, or not\n#   install all needed dependencies.\n#Pipfile.lock\n\n# PEP 582; used by e.g. github.com/David-OConnor/pyflow\n__pypackages__/\n\n# Celery stuff\ncelerybeat-schedule\ncelerybeat.pid\n\n# SageMath parsed files\n*.sage.py\n\n# Environments\n.env\n.venv\nenv/\nvenv/\nENV/\nenv.bak/\nvenv.bak/\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n.dmypy.json\ndmypy.json\n\n# Pyre type checker\n.pyre/\n\n# Custom\nTemp\n.idea\n.DS_Store\n"
        },
        {
          "name": "Assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "Contents",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 19.1171875,
          "content": "Creative Commons Attribution-NonCommercial-NoDerivatives 4.0\nInternational\n\nCreative Commons Corporation (\"Creative Commons\") is not a law firm and\ndoes not provide legal services or legal advice. Distribution of\nCreative Commons public licenses does not create a lawyer-client or\nother relationship. Creative Commons makes its licenses and related\ninformation available on an \"as-is\" basis. Creative Commons gives no\nwarranties regarding its licenses, any material licensed under their\nterms and conditions, or any related information. Creative Commons\ndisclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\nUsing Creative Commons Public Licenses\n\nCreative Commons public licenses provide a standard set of terms and\nconditions that creators and other rights holders may use to share\noriginal works of authorship and other material subject to copyright and\ncertain other rights specified in the public license below. The\nfollowing considerations are for informational purposes only, are not\nexhaustive, and do not form part of our licenses.\n\nConsiderations for licensors: Our public licenses are intended for use\nby those authorized to give the public permission to use material in\nways otherwise restricted by copyright and certain other rights. Our\nlicenses are irrevocable. Licensors should read and understand the terms\nand conditions of the license they choose before applying it. Licensors\nshould also secure all rights necessary before applying our licenses so\nthat the public can reuse the material as expected. Licensors should\nclearly mark any material not subject to the license. This includes\nother CC-licensed material, or material used under an exception or\nlimitation to copyright. More considerations for licensors :\nwiki.creativecommons.org/Considerations_for_licensors\n\nConsiderations for the public: By using one of our public licenses, a\nlicensor grants the public permission to use the licensed material under\nspecified terms and conditions. If the licensor's permission is not\nnecessary for any reason–for example, because of any applicable\nexception or limitation to copyright–then that use is not regulated by\nthe license. Our licenses grant only permissions under copyright and\ncertain other rights that a licensor has authority to grant. Use of the\nlicensed material may still be restricted for other reasons, including\nbecause others have copyright or other rights in the material. A\nlicensor may make special requests, such as asking that all changes be\nmarked or described. Although not required by our licenses, you are\nencouraged to respect those requests where reasonable. More\nconsiderations for the public :\nwiki.creativecommons.org/Considerations_for_licensees\n\nCreative Commons Attribution-NonCommercial-NoDerivatives 4.0\nInternational Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree\nto be bound by the terms and conditions of this Creative Commons\nAttribution-NonCommercial-NoDerivatives 4.0 International Public License\n(\"Public License\"). To the extent this Public License may be interpreted\nas a contract, You are granted the Licensed Rights in consideration of\nYour acceptance of these terms and conditions, and the Licensor grants\nYou such rights in consideration of benefits the Licensor receives from\nmaking the Licensed Material available under these terms and conditions.\n\n-   Section 1 – Definitions.\n\n    -   a. Adapted Material means material subject to Copyright and\n        Similar Rights that is derived from or based upon the Licensed\n        Material and in which the Licensed Material is translated,\n        altered, arranged, transformed, or otherwise modified in a\n        manner requiring permission under the Copyright and Similar\n        Rights held by the Licensor. For purposes of this Public\n        License, where the Licensed Material is a musical work,\n        performance, or sound recording, Adapted Material is always\n        produced where the Licensed Material is synched in timed\n        relation with a moving image.\n    -   b. Copyright and Similar Rights means copyright and/or similar\n        rights closely related to copyright including, without\n        limitation, performance, broadcast, sound recording, and Sui\n        Generis Database Rights, without regard to how the rights are\n        labeled or categorized. For purposes of this Public License, the\n        rights specified in Section 2(b)(1)-(2) are not Copyright and\n        Similar Rights.\n    -   c. Effective Technological Measures means those measures that,\n        in the absence of proper authority, may not be circumvented\n        under laws fulfilling obligations under Article 11 of the WIPO\n        Copyright Treaty adopted on December 20, 1996, and/or similar\n        international agreements.\n    -   d. Exceptions and Limitations means fair use, fair dealing,\n        and/or any other exception or limitation to Copyright and\n        Similar Rights that applies to Your use of the Licensed\n        Material.\n    -   e. Licensed Material means the artistic or literary work,\n        database, or other material to which the Licensor applied this\n        Public License.\n    -   f. Licensed Rights means the rights granted to You subject to\n        the terms and conditions of this Public License, which are\n        limited to all Copyright and Similar Rights that apply to Your\n        use of the Licensed Material and that the Licensor has authority\n        to license.\n    -   g. Licensor means the individual(s) or entity(ies) granting\n        rights under this Public License.\n    -   h. NonCommercial means not primarily intended for or directed\n        towards commercial advantage or monetary compensation. For\n        purposes of this Public License, the exchange of the Licensed\n        Material for other material subject to Copyright and Similar\n        Rights by digital file-sharing or similar means is NonCommercial\n        provided there is no payment of monetary compensation in\n        connection with the exchange.\n    -   i. Share means to provide material to the public by any means or\n        process that requires permission under the Licensed Rights, such\n        as reproduction, public display, public performance,\n        distribution, dissemination, communication, or importation, and\n        to make material available to the public including in ways that\n        members of the public may access the material from a place and\n        at a time individually chosen by them.\n    -   j. Sui Generis Database Rights means rights other than copyright\n        resulting from Directive 96/9/EC of the European Parliament and\n        of the Council of 11 March 1996 on the legal protection of\n        databases, as amended and/or succeeded, as well as other\n        essentially equivalent rights anywhere in the world.\n    -   k. You means the individual or entity exercising the Licensed\n        Rights under this Public License. Your has a corresponding\n        meaning.\n\n-   Section 2 – Scope.\n\n    -   a. License grant.\n        -   1. Subject to the terms and conditions of this Public\n            License, the Licensor hereby grants You a worldwide,\n            royalty-free, non-sublicensable, non-exclusive, irrevocable\n            license to exercise the Licensed Rights in the Licensed\n            Material to:\n            -   A. reproduce and Share the Licensed Material, in whole\n                or in part, for NonCommercial purposes only; and\n            -   B. produce and reproduce, but not Share, Adapted\n                Material for NonCommercial purposes only.\n        -   2. Exceptions and Limitations. For the avoidance of doubt,\n            where Exceptions and Limitations apply to Your use, this\n            Public License does not apply, and You do not need to comply\n            with its terms and conditions.\n        -   3. Term. The term of this Public License is specified in\n            Section 6(a).\n        -   4. Media and formats; technical modifications allowed. The\n            Licensor authorizes You to exercise the Licensed Rights in\n            all media and formats whether now known or hereafter\n            created, and to make technical modifications necessary to do\n            so. The Licensor waives and/or agrees not to assert any\n            right or authority to forbid You from making technical\n            modifications necessary to exercise the Licensed Rights,\n            including technical modifications necessary to circumvent\n            Effective Technological Measures. For purposes of this\n            Public License, simply making modifications authorized by\n            this Section 2(a)(4) never produces Adapted Material.\n        -   5. Downstream recipients.\n            -   A. Offer from the Licensor – Licensed Material. Every\n                recipient of the Licensed Material automatically\n                receives an offer from the Licensor to exercise the\n                Licensed Rights under the terms and conditions of this\n                Public License.\n            -   B. No downstream restrictions. You may not offer or\n                impose any additional or different terms or conditions\n                on, or apply any Effective Technological Measures to,\n                the Licensed Material if doing so restricts exercise of\n                the Licensed Rights by any recipient of the Licensed\n                Material.\n        -   6. No endorsement. Nothing in this Public License\n            constitutes or may be construed as permission to assert or\n            imply that You are, or that Your use of the Licensed\n            Material is, connected with, or sponsored, endorsed, or\n            granted official status by, the Licensor or others\n            designated to receive attribution as provided in Section\n            3(a)(1)(A)(i).\n    -   b. Other rights.\n        -   1. Moral rights, such as the right of integrity, are not\n            licensed under this Public License, nor are publicity,\n            privacy, and/or other similar personality rights; however,\n            to the extent possible, the Licensor waives and/or agrees\n            not to assert any such rights held by the Licensor to the\n            limited extent necessary to allow You to exercise the\n            Licensed Rights, but not otherwise.\n        -   2. Patent and trademark rights are not licensed under this\n            Public License.\n        -   3. To the extent possible, the Licensor waives any right to\n            collect royalties from You for the exercise of the Licensed\n            Rights, whether directly or through a collecting society\n            under any voluntary or waivable statutory or compulsory\n            licensing scheme. In all other cases the Licensor expressly\n            reserves any right to collect such royalties, including when\n            the Licensed Material is used other than for NonCommercial\n            purposes.\n\n-   Section 3 – License Conditions.\n\n    Your exercise of the Licensed Rights is expressly made subject to\n    the following conditions.\n\n    -   a. Attribution.\n        -   1. If You Share the Licensed Material, You must:\n\n            -   A. retain the following if it is supplied by the\n                Licensor with the Licensed Material:\n                -   i. identification of the creator(s) of the Licensed\n                    Material and any others designated to receive\n                    attribution, in any reasonable manner requested by\n                    the Licensor (including by pseudonym if designated);\n                -   ii. a copyright notice;\n                -   iii. a notice that refers to this Public License;\n                -   iv. a notice that refers to the disclaimer of\n                    warranties;\n                -   v. a URI or hyperlink to the Licensed Material to\n                    the extent reasonably practicable;\n            -   B. indicate if You modified the Licensed Material and\n                retain an indication of any previous modifications; and\n            -   C. indicate the Licensed Material is licensed under this\n                Public License, and include the text of, or the URI or\n                hyperlink to, this Public License.\n\n            For the avoidance of doubt, You do not have permission under\n            this Public License to Share Adapted Material.\n\n        -   2. You may satisfy the conditions in Section 3(a)(1) in any\n            reasonable manner based on the medium, means, and context in\n            which You Share the Licensed Material. For example, it may\n            be reasonable to satisfy the conditions by providing a URI\n            or hyperlink to a resource that includes the required\n            information.\n        -   3. If requested by the Licensor, You must remove any of the\n            information required by Section 3(a)(1)(A) to the extent\n            reasonably practicable.\n\n-   Section 4 – Sui Generis Database Rights.\n\n    Where the Licensed Rights include Sui Generis Database Rights that\n    apply to Your use of the Licensed Material:\n\n    -   a. for the avoidance of doubt, Section 2(a)(1) grants You the\n        right to extract, reuse, reproduce, and Share all or a\n        substantial portion of the contents of the database for\n        NonCommercial purposes only and provided You do not Share\n        Adapted Material;\n    -   b. if You include all or a substantial portion of the database\n        contents in a database in which You have Sui Generis Database\n        Rights, then the database in which You have Sui Generis Database\n        Rights (but not its individual contents) is Adapted Material;\n        and\n    -   c. You must comply with the conditions in Section 3(a) if You\n        Share all or a substantial portion of the contents of the\n        database.\n\n    For the avoidance of doubt, this Section 4 supplements and does not\n    replace Your obligations under this Public License where the\n    Licensed Rights include other Copyright and Similar Rights.\n\n-   Section 5 – Disclaimer of Warranties and Limitation of Liability.\n\n    -   a. Unless otherwise separately undertaken by the Licensor, to\n        the extent possible, the Licensor offers the Licensed Material\n        as-is and as-available, and makes no representations or\n        warranties of any kind concerning the Licensed Material, whether\n        express, implied, statutory, or other. This includes, without\n        limitation, warranties of title, merchantability, fitness for a\n        particular purpose, non-infringement, absence of latent or other\n        defects, accuracy, or the presence or absence of errors, whether\n        or not known or discoverable. Where disclaimers of warranties\n        are not allowed in full or in part, this disclaimer may not\n        apply to You.\n    -   b. To the extent possible, in no event will the Licensor be\n        liable to You on any legal theory (including, without\n        limitation, negligence) or otherwise for any direct, special,\n        indirect, incidental, consequential, punitive, exemplary, or\n        other losses, costs, expenses, or damages arising out of this\n        Public License or use of the Licensed Material, even if the\n        Licensor has been advised of the possibility of such losses,\n        costs, expenses, or damages. Where a limitation of liability is\n        not allowed in full or in part, this limitation may not apply to\n        You.\n    -   c. The disclaimer of warranties and limitation of liability\n        provided above shall be interpreted in a manner that, to the\n        extent possible, most closely approximates an absolute\n        disclaimer and waiver of all liability.\n\n-   Section 6 – Term and Termination.\n\n    -   a. This Public License applies for the term of the Copyright and\n        Similar Rights licensed here. However, if You fail to comply\n        with this Public License, then Your rights under this Public\n        License terminate automatically.\n    -   b. Where Your right to use the Licensed Material has terminated\n        under Section 6(a), it reinstates:\n\n        -   1. automatically as of the date the violation is cured,\n            provided it is cured within 30 days of Your discovery of the\n            violation; or\n        -   2. upon express reinstatement by the Licensor.\n\n        For the avoidance of doubt, this Section 6(b) does not affect\n        any right the Licensor may have to seek remedies for Your\n        violations of this Public License.\n\n    -   c. For the avoidance of doubt, the Licensor may also offer the\n        Licensed Material under separate terms or conditions or stop\n        distributing the Licensed Material at any time; however, doing\n        so will not terminate this Public License.\n    -   d. Sections 1, 5, 6, 7, and 8 survive termination of this Public\n        License.\n\n-   Section 7 – Other Terms and Conditions.\n\n    -   a. The Licensor shall not be bound by any additional or\n        different terms or conditions communicated by You unless\n        expressly agreed.\n    -   b. Any arrangements, understandings, or agreements regarding the\n        Licensed Material not stated herein are separate from and\n        independent of the terms and conditions of this Public License.\n\n-   Section 8 – Interpretation.\n\n    -   a. For the avoidance of doubt, this Public License does not, and\n        shall not be interpreted to, reduce, limit, restrict, or impose\n        conditions on any use of the Licensed Material that could\n        lawfully be made without permission under this Public License.\n    -   b. To the extent possible, if any provision of this Public\n        License is deemed unenforceable, it shall be automatically\n        reformed to the minimum extent necessary to make it enforceable.\n        If the provision cannot be reformed, it shall be severed from\n        this Public License without affecting the enforceability of the\n        remaining terms and conditions.\n    -   c. No term or condition of this Public License will be waived\n        and no failure to comply consented to unless expressly agreed to\n        by the Licensor.\n    -   d. Nothing in this Public License constitutes or may be\n        interpreted as a limitation upon, or waiver of, any privileges\n        and immunities that apply to the Licensor or You, including from\n        the legal processes of any jurisdiction or authority.\n\nCreative Commons is not a party to its public licenses. Notwithstanding,\nCreative Commons may elect to apply one of its public licenses to\nmaterial it publishes and in those instances will be considered the\n\"Licensor.\" The text of the Creative Commons public licenses is\ndedicated to the public domain under the CC0 Public Domain Dedication.\nExcept for the limited purpose of indicating that material is shared\nunder a Creative Commons public license or as otherwise permitted by the\nCreative Commons policies published at creativecommons.org/policies,\nCreative Commons does not authorize the use of the trademark \"Creative\nCommons\" or any other trademark or logo of Creative Commons without its\nprior written consent including, without limitation, in connection with\nany unauthorized modifications to any of its public licenses or any\nother arrangements, understandings, or agreements concerning use of\nlicensed material. For the avoidance of doubt, this paragraph does not\nform part of the public licenses.\n\nCreative Commons may be contacted at creativecommons.org."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 16.66015625,
          "content": "# 算法通关手册（LeetCode）\n\n## 01. 项目简介\n\n- **「算法与数据结构」** 基础知识的讲解教程，「LeetCode」800+ 道题目的详细解析。本项目易于理解，没有大跨度的思维跳跃，项目中使用部分图示、例子来帮助理解。\n\n- 本教程先从基础的数据结构和算法开始讲解，再针对不同分类的数据结构和算法，进行具体题目的讲解分析。让读者可以通过「算法基础理论学习」和「编程实战学习」相结合的方式，彻底的掌握算法知识。\n\n- 本教程采用 Python 作为编程语言，要求学习者已有基本 Python 程序设计的知识与经验。\n\n## 02. 项目地址\n\n欢迎右上角 **「Star ⭐️  」** 和 **「Fork」**，这是对我最大的鼓励和支持。\n\n- GitHub 地址：[https://github.com/itcharge/LeetCode-Py](https://github.com/itcharge/LeetCode-Py)\n\n支持黑暗模式的在线电子书《算法通关手册》。\n\n- 电子书地址：[https://algo.itcharge.cn](https://algo.itcharge.cn)\n\n![电子书浅色模式](./Assets/Images/algo-book-light.png)\n\n![电子书深色模式](./Assets/Images/algo-book-dark.png)\n\n## 03. 关于作者\n\n我是一名 iOS / macOS 的开发程序员，另外也是北航软院的一名非全硕士（在读）。曾在大学期间学习过算法知识，并参加过 3 年的 ACM 比赛， 但水平有限，未能取得理想成绩。但是这 3 年的 ACM 经历，给我最大的收获是锻炼了自己的逻辑思维和解决实际问题的能力，这种能力为我今后的工作、学习打下了坚实的基础。\n\n我从 2021 年 03 月 30 日开始每日在 LeetCode 刷题，到 2022 年 06 月 08 日已经刷了 1000+ 道题目，并且完成了 800+ 道题解。努力向着 1000+、1500+、2000+ 道题解前进。\n\n在公众号 **「程序员充电站」** 里回复 \"**算法打卡**\"，拉你进 LeetCode 算法打卡计划群一起组队打卡。\n\n- 进群暗号：**算法打卡**\n- 进群要求：少闲聊、多分享、改备注。\n\n![](./Assets/Images/itcharge-qr-code.png)\n\n## 04. 版权说明\n\n- 本教程采用 [知识署名—非商业性使用—禁止演绎（BY-NC-ND）4.0 协议国际许可协议](https://creativecommons.org/licenses/by-nc-nd/4.0/legalcode.zh-Hans) 进行许可。\n- 本教程题解中的所有题目版权均归 [LeetCode](https://leetcode.com/) 和 [力扣中国](https://leetcode.cn/) 所有。\n\n## 05. 章节目录\n\n![章节目录](./Assets/Images/algo-book-contents.png)\n\n### 00. 绪论\n\n- [算法与数据结构](./Contents/00.Introduction/01.Data-Structures-Algorithms.md)\n- [算法复杂度](./Contents/00.Introduction/02.Algorithm-Complexity.md)\n- [LeetCode 入门与攻略](./Contents/00.Introduction/03.LeetCode-Guide.md)\n- [LeetCode 题解（字典序排序，850+ 道题解）](./Contents/00.Introduction/04.Solutions-List.md)\n- [LeetCode 题解（按分类排序，推荐刷题列表 ★★★）](./Contents/00.Introduction/05.Categories-List.md)\n- [LeetCode 面试最常考 100 题（按分类排序）](./Contents/00.Introduction/06.Interview-100-List.md)\n- [LeetCode 面试最常考 200 题（按分类排序）](./Contents/00.Introduction/07.Interview-200-List.md)\n\n### 01. 数组\n\n- 数组基础知识\n  - [数组基础知识](./Contents/01.Array/01.Array-Basic/01.Array-Basic.md)\n  - [数组基础题目](./Contents/01.Array/01.Array-Basic/02.Array-Basic-List.md)\n- 数组排序算法\n  - [冒泡排序](./Contents/01.Array/02.Array-Sort/01.Array-Bubble-Sort.md)\n  - [选择排序](./Contents/01.Array/02.Array-Sort/02.Array-Selection-Sort.md)\n  - [插入排序](./Contents/01.Array/02.Array-Sort/03.Array-Insertion-Sort.md)\n  - [希尔排序](./Contents/01.Array/02.Array-Sort/04.Array-Shell-Sort.md)\n  - [归并排序](./Contents/01.Array/02.Array-Sort/05.Array-Merge-Sort.md)\n  - [快速排序](./Contents/01.Array/02.Array-Sort/06.Array-Quick-Sort.md)\n  - [堆排序](./Contents/01.Array/02.Array-Sort/07.Array-Heap-Sort.md)\n  - [计数排序](./Contents/01.Array/02.Array-Sort/08.Array-Counting-Sort.md)\n  - [桶排序](./Contents/01.Array/02.Array-Sort/09.Array-Bucket-Sort.md)\n  - [基数排序](./Contents/01.Array/02.Array-Sort/10.Array-Radix-Sort.md)\n  - [数组排序题目](./Contents/01.Array/02.Array-Sort/11.Array-Sort-List.md)\n- 二分查找\n  - [二分查找知识（一）](./Contents/01.Array/03.Array-Binary-Search/01.Array-Binary-Search-01.md)\n  - [二分查找知识（二）](./Contents/01.Array/03.Array-Binary-Search/02.Array-Binary-Search-02.md)\n  - [二分查找题目](./Contents/01.Array/03.Array-Binary-Search/03.Array-Binary-Search-List.md)\n- 数组双指针\n  - [数组双指针知识](./Contents/01.Array/04.Array-Two-Pointers/01.Array-Two-Pointers.md)\n  - [数组双指针题目](./Contents/01.Array/04.Array-Two-Pointers/02.Array-Two-Pointers-List.md)\n- 数组滑动窗口\n  - [数组滑动窗口知识](./Contents/01.Array/05.Array-Sliding-Window/01.Array-Sliding-Window.md)\n  - [数组滑动窗口题目](./Contents/01.Array/05.Array-Sliding-Window/02.Array-Sliding-Window-List.md)\n\n### 02. 链表\n\n- 链表基础知识\n  - [链表基础知识](./Contents/02.Linked-List/01.Linked-List-Basic/01.Linked-List-Basic.md)\n  - [链表经典题目](./Contents/02.Linked-List/01.Linked-List-Basic/02.Linked-List-Basic-List.md)\n- 链表排序\n  - [链表排序知识](./Contents/02.Linked-List/02.Linked-List-Sort/01.Linked-List-Sort.md)\n  - [链表排序题目](./Contents/02.Linked-List/02.Linked-List-Sort/02.Linked-List-Sort-List.md)\n- 链表双指针\n  - [链表双指针知识](./Contents/02.Linked-List/03.Linked-List-Two-Pointers/01.Linked-List-Two-Pointers.md)\n  - [链表双指针题目](./Contents/02.Linked-List/03.Linked-List-Two-Pointers/02.Linked-List-Two-Pointers-List.md)\n\n### 03. 堆栈\n\n- 堆栈基础知识\n  - [堆栈基础知识](./Contents/03.Stack/01.Stack-Basic/01.Stack-Basic.md)\n  - [堆栈基础题目](./Contents/03.Stack/01.Stack-Basic/02.Stack-Basic-List.md)\n- 单调栈\n  - [单调栈知识](./Contents/03.Stack/02.Monotone-Stack/01.Monotone-Stack.md)\n  - [单调栈题目](./Contents/03.Stack/02.Monotone-Stack/02.Monotone-Stack-List.md)\n\n### 04. 队列\n\n- 队列基础知识\n  - [队列基础知识](./Contents/04.Queue/01.Queue-Basic/01.Queue-Basic.md)\n  - [队列基础题目](./Contents/04.Queue/01.Queue-Basic/02.Queue-Basic-List.md)\n- 优先队列\n  - [优先队列知识](./Contents/04.Queue/02.Priority-Queue/01.Priority-Queue.md)\n  - [优先队列题目](./Contents/04.Queue/02.Priority-Queue/02.Priority-Queue-List.md)\n\n### 05. 哈希表\n\n- [哈希表知识](./Contents/05.Hash-Table/01.Hash-Table.md)\n- [哈希表题目](./Contents/05.Hash-Table/02.Hash-Table-List.md)\n\n### 06. 字符串\n\n- 字符串基础知识\n  - [字符串基础知识](./Contents/06.String/01.String-Basic/01.String-Basic.md)\n  - [字符串经典题目](./Contents/06.String/01.String-Basic/02.String-Basic-List.md)\n- 单模式串匹配\n  - [Brute Force 算法](./Contents/06.String/02.String-Single-Pattern-Matching/01.String-Brute-Force.md)\n  - [Rabin Karp 算法](./Contents/06.String/02.String-Single-Pattern-Matching/02.String-Rabin-Karp.md)\n  - [KMP 算法](./Contents/06.String/02.String-Single-Pattern-Matching/03.String-KMP.md)\n  - [Boyer Moore 算法](./Contents/06.String/02.String-Single-Pattern-Matching/04.String-Boyer-Moore.md)\n  - [Horspool 算法](./Contents/06.String/02.String-Single-Pattern-Matching/05.String-Horspool.md)\n  - [Sunday 算法](./Contents/06.String/02.String-Single-Pattern-Matching/06.String-Sunday.md)\n  - [单模式串匹配题目](./Contents/06.String/02.String-Single-Pattern-Matching/07.String-Single-Pattern-Matching-List.md)\n- 多模式串匹配\n  - [字典树知识](./Contents/06.String/03.String-Multi-Pattern-Matching/01.Trie.md)\n  - [字典树题目](./Contents/06.String/03.String-Multi-Pattern-Matching/02.Trie-List.md)\n  - [AC 自动机知识](./Contents/06.String/03.String-Multi-Pattern-Matching/03.AC-Automaton.md)\n  - [AC 自动机题目](./Contents/06.String/03.String-Multi-Pattern-Matching/04.AC-Automaton-List.md)\n  - [后缀数组知识](./Contents/06.String/03.String-Multi-Pattern-Matching/05.Suffix-Array.md)\n  - [后缀数组题目](./Contents/06.String/03.String-Multi-Pattern-Matching/06.Suffix-Array-List.md)\n\n### 07. 树\n\n- 二叉树\n  - [树与二叉树基础知识](./Contents/07.Tree/01.Binary-Tree/01.Binary-Tree-Basic.md)\n  - [二叉树的遍历知识](./Contents/07.Tree/01.Binary-Tree/02.Binary-Tree-Traverse.md)\n  - [二叉树的遍历题目](./Contents/07.Tree/01.Binary-Tree/03.Binary-Tree-Traverse-List.md)\n  - [二叉树的还原知识](./Contents/07.Tree/01.Binary-Tree/04.Binary-Tree-Reduction.md)\n  - [二叉树的还原题目](./Contents/07.Tree/01.Binary-Tree/05.Binary-Tree-Reduction-List.md)\n- 二叉搜索树\n  - [二叉搜索树知识](./Contents/07.Tree/02.Binary-Search-Tree/01.Binary-Search-Tree.md)\n  - [二叉搜索树题目](./Contents/07.Tree/02.Binary-Search-Tree/02.Binary-Search-Tree-List.md)\n- 线段树\n  - [线段树知识](./Contents/07.Tree/03.Segment-Tree/01.Segment-Tree.md)\n  - [线段树题目](./Contents/07.Tree/03.Segment-Tree/02.Segment-Tree-List.md)\n- 树状数组\n  - [树状数组知识](./Contents/07.Tree/04.Binary-Indexed-Tree/01.Binary-Indexed-Tree.md)\n  - [树状数组题目](./Contents/07.Tree/04.Binary-Indexed-Tree/02.Binary-Indexed-Tree-List.md)\n- 并查集\n  - [并查集知识](./Contents/07.Tree/05.Union-Find/01.Union-Find.md)\n  - [并查集题目](./Contents/07.Tree/05.Union-Find/02.Union-Find-List.md)\n\n### 08. 图论\n\n- 图的基础知识\n  - [图的定义和分类](./Contents/08.Graph/01.Graph-Basic/01.Graph-Basic.md)\n  - [图的存储结构和问题应用](./Contents/08.Graph/01.Graph-Basic/02.Graph-Structure.md)\n- 图的遍历\n  - [图的深度优先搜索知识](./Contents/08.Graph/02.Graph-Traversal/01.Graph-DFS.md)\n  - [图的深度优先搜索题目](./Contents/08.Graph/02.Graph-Traversal/02.Graph-DFS-List.md)\n  - [图的广度优先搜索知识](./Contents/08.Graph/02.Graph-Traversal/03.Graph-BFS.md)\n  - [图的广度优先搜索题目](./Contents/08.Graph/02.Graph-Traversal/04.Graph-BFS-List.md)\n  - [图的拓扑排序知识](./Contents/08.Graph/02.Graph-Traversal/05.Graph-Topological-Sorting.md)\n  - [图的拓扑排序题目](./Contents/08.Graph/02.Graph-Traversal/06.Graph-Topological-Sorting-List.md)\n- 图的生成树\n  - [图的最小生成树知识](./Contents/08.Graph/03.Graph-Spanning-Tree/01.Graph-Minimum-Spanning-Tree.md)\n  - [图的最小生成树题目](./Contents/08.Graph/03.Graph-Spanning-Tree/02.Graph-Minimum-Spanning-Tree-List.md)\n- 最短路径\n  - [单源最短路径知识（一）](./Contents/08.Graph/04.Graph-Shortest-Path/01.Graph-Single-Source-Shortest-Path-01.md) \n  - [单源最短路径知识（二）](./Contents/08.Graph/04.Graph-Shortest-Path/02.Graph-Single-Source-Shortest-Path-02.md) \n  - [单源最短路径题目](./Contents/08.Graph/04.Graph-Shortest-Path/03.Graph-Single-Source-Shortest-Path-List.md)\n  - [多源最短路径知识](./Contents/08.Graph/04.Graph-Shortest-Path/04.Graph-Multi-Source-Shortest-Path.md)\n  - [多源最短路径题目](./Contents/08.Graph/04.Graph-Shortest-Path/05.Graph-Multi-Source-Shortest-Path-List.md)\n  - [次短路径知识](./Contents/08.Graph/04.Graph-Shortest-Path/06.Graph-The-Second-Shortest-Path.md)\n  - [次短路径题目](./Contents/08.Graph/04.Graph-Shortest-Path/07.Graph-The-Second-Shortest-Path-List.md)\n  - [差分约束系统知识](./Contents/08.Graph/04.Graph-Shortest-Path/08.Graph-System-Of-Difference-Constraints.md)\n  - [差分约束系统题目](./Contents/08.Graph/04.Graph-Shortest-Path/09.Graph-System-Of-Difference-Constraints-List.md)\n- 二分图\n  - [二分图基础知识](./Contents/08.Graph/05.Graph-Bipartite/01.Graph-Bipartite-Basic.md)\n  - [二分图基础题目](./Contents/08.Graph/05.Graph-Bipartite/02.Graph-Bipartite-Basic-List.md)\n  - [二分图最大匹配知识](./Contents/08.Graph/05.Graph-Bipartite/03.Graph-Bipartite-Matching.md)\n  - [匈牙利算法](./Contents/08.Graph/05.Graph-Bipartite/04.Graph-Hungarian-Algorithm.md)\n  - [Hopcroft-Karp 算法](./Contents/08.Graph/05.Graph-Bipartite/05.Graph-Hopcroft-Karp.md)\n  - [二分图最大匹配题目](./Contents/08.Graph/05.Graph-Bipartite/06.Graph-Bipartite-Matching-List.md)\n\n### 09. 基础算法\n\n- 枚举算法\n  - [枚举算法知识](./Contents/09.Algorithm-Base/01.Enumeration-Algorithm/01.Enumeration-Algorithm.md)\n  - [枚举算法题目](./Contents/09.Algorithm-Base/01.Enumeration-Algorithm/02.Enumeration-Algorithm-List.md)\n- 递归算法\n  - [递归算法知识](./Contents/09.Algorithm-Base/02.Recursive-Algorithm/01.Recursive-Algorithm.md)\n  - [递归算法题目](./Contents/09.Algorithm-Base/02.Recursive-Algorithm/02.Recursive-Algorithm-List.md)\n- 分治算法\n  - [分治算法知识](./Contents/09.Algorithm-Base/03.Divide-And-Conquer-Algorithm/01.Divide-And-Conquer-Algorithm.md)\n  - [分治算法题目](./Contents/09.Algorithm-Base/03.Divide-And-Conquer-Algorithm/02.Divide-And-Conquer-Algorithm-List.md)\n- 回溯算法\n  - [回溯算法知识](./Contents/09.Algorithm-Base/04.Backtracking-Algorithm/01.Backtracking-Algorithm.md)\n  - [回溯算法题目](./Contents/09.Algorithm-Base/04.Backtracking-Algorithm/02.Backtracking-Algorithm-List.md)\n- 贪心算法\n  - [贪心算法知识](./Contents/09.Algorithm-Base/05.Greedy-Algorithm/01.Greedy-Algorithm.md)\n  - [贪心算法题目](./Contents/09.Algorithm-Base/05.Greedy-Algorithm/02.Greedy-Algorithm-List.md)\n- 位运算\n  - [位运算知识](./Contents/09.Algorithm-Base/06.Bit-Operation/01.Bit-Operation.md)\n  - [位运算题目](./Contents/09.Algorithm-Base/06.Bit-Operation/02.Bit-Operation-List.md)\n\n### 10. 动态规划\n\n- 动态规划基础\n  - [动态规划基础知识](./Contents/10.Dynamic-Programming/01.Dynamic-Programming-Basic/01.Dynamic-Programming-Basic.md)\n  - [动态规划基础题目](./Contents/10.Dynamic-Programming/01.Dynamic-Programming-Basic/02.Dynamic-Programming-Basic-List.md)\n- 记忆化搜索\n  - [记忆化搜索知识](./Contents/10.Dynamic-Programming/02.Memoization/01.Memoization.md)\n  - [记忆化搜索题目](./Contents/10.Dynamic-Programming/02.Memoization/02.Memoization-List.md)\n- 线性 DP\n  - [线性 DP 知识（一）](./Contents/10.Dynamic-Programming/03.Linear-DP/01.Linear-DP-01.md)\n  - [线性 DP 知识（二）](./Contents/10.Dynamic-Programming/03.Linear-DP/02.Linear-DP-02.md)\n  - [线性 DP 题目](./Contents/10.Dynamic-Programming/03.Linear-DP/03.Linear-DP-List.md)\n- 背包问题\n  - [背包问题知识（一）](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/01.Knapsack-Problem-01.md)\n  - [背包问题知识（二）](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/02.Knapsack-Problem-02.md)\n  - [背包问题知识（三）](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/03.Knapsack-Problem-03.md)\n  - [背包问题知识（四）](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/04.Knapsack-Problem-04.md)\n  - [背包问题知识（五）](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/05.Knapsack-Problem-05.md)\n  - [背包问题题目](./Contents/10.Dynamic-Programming/04.Knapsack-Problem/06.Knapsack-Problem-List.md)\n- 区间 DP\n  - [区间 DP 知识](./Contents/10.Dynamic-Programming/05.Interval-DP/01.Interval-DP.md)\n  - [区间 DP 题目](./Contents/10.Dynamic-Programming/05.Interval-DP/02.Interval-DP-List.md)\n- 树形 DP\n  - [树形 DP 知识](./Contents/10.Dynamic-Programming/06.Tree-DP/01.Tree-DP.md)\n  - [树形 DP 题目](./Contents/10.Dynamic-Programming/06.Tree-DP/02.Tree-DP-List.md)\n- 状态压缩 DP\n  - [状态压缩 DP 知识](./Contents/10.Dynamic-Programming/07.State-DP/01.State-DP.md)\n  - [状态压缩 DP 题目](./Contents/10.Dynamic-Programming/07.State-DP/02.State-DP-List.md)\n- 计数 DP\n  - [计数 DP 知识](./Contents/10.Dynamic-Programming/08.Counting-DP/01.Counting-DP.md)\n  - [计数 DP 题目](./Contents/10.Dynamic-Programming/08.Counting-DP/02.Counting-DP-List.md)\n- 数位 DP\n  - [数位 DP 知识](./Contents/10.Dynamic-Programming/09.Digit-DP/01.Digit-DP.md)\n  - [数位 DP 题目](./Contents/10.Dynamic-Programming/09.Digit-DP/02.Digit-DP-List.md)\n- 概率 DP\n  - [概率 DP 知识](./Contents/10.Dynamic-Programming/10.Probability-DP/01.Probability-DP.md)\n  - [概率 DP 题目](./Contents/10.Dynamic-Programming/10.Probability-DP/02.Probability-DP-List.md)\n- 动态规划优化\n  - [单调栈 / 优先队列优化](./Contents/10.Dynamic-Programming/11.DP-Optimization/01.Monotone-Stack-Queue-Optimization.md)\n  - [斜率优化](./Contents/10.Dynamic-Programming/11.DP-Optimization/02.Slope-Optimization.md)\n  - [四边形不等式优化](./Contents/10.Dynamic-Programming/11.DP-Optimization/03.Quadrangle-Optimization.md)\n  - [动态规划优化题目](./Contents/10.Dynamic-Programming/11.DP-Optimization/04.DP-Optimization-List.md)\n\n### 11. 附加内容\n\n- [内容完成时间线](./Contents/Others/Update-Time.md)\n### [12. LeetCode 题解（已完成 860 道）](./Contents/00.Introduction/04.Solutions-List.md)"
        },
        {
          "name": "Solutions",
          "type": "tree",
          "content": null
        },
        {
          "name": "Templates",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}