{
  "metadata": {
    "timestamp": 1736554970533,
    "page": 39,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "golang/go",
      "stars": 125035,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.62,
          "content": "# Treat all files in the Go repo as binary, with no git magic updating\n# line endings. This produces predictable results in different environments.\n#\n# Windows users contributing to Go will need to use a modern version\n# of git and editors capable of LF line endings.\n#\n# Windows .bat files are known to have multiple bugs when run with LF\n# endings, and so they are checked in with CRLF endings, with a test\n# in test/winbatch.go to catch problems. (See golang.org/issue/37791.)\n#\n# We'll prevent accidental CRLF line endings from entering the repo\n# via the git-codereview gofmt checks and tests.\n#\n# See golang.org/issue/9281.\n\n* -text\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.94,
          "content": ".DS_Store\n*.[56789ao]\n*.a[56789o]\n*.so\n*.pyc\n._*\n.nfs.*\n[56789a].out\n*~\n*.orig\n*.rej\n*.exe\n.*.swp\ncore\n*.cgo*.go\n*.cgo*.c\n_cgo_*\n_obj\n_test\n_testmain.go\n\n/VERSION.cache\n/bin/\n/build.out\n/doc/articles/wiki/*.bin\n/goinstall.log\n/last-change\n/misc/cgo/life/run.out\n/misc/cgo/stdio/run.out\n/misc/cgo/testso/main\n/pkg/\n/src/*.*/\n/src/cmd/cgo/zdefaultcc.go\n/src/cmd/dist/dist\n/src/cmd/go/internal/cfg/zdefaultcc.go\n/src/cmd/internal/objabi/zbootstrap.go\n/src/go/build/zcgo.go\n/src/go/doc/headscan\n/src/internal/buildcfg/zbootstrap.go\n/src/internal/runtime/sys/zversion.go\n/src/unicode/maketables\n/src/time/tzdata/zzipdata.go\n/test.out\n/test/garbage/*.out\n/test/pass.out\n/test/run.out\n/test/times.out\n\n# This file includes artifacts of Go build that should not be checked in.\n# For files created by specific development environment (e.g. editor),\n# use alternative ways to exclude files from git.\n# For example, set up .git/info/exclude or use a global .gitignore.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.31,
          "content": "# Contributing to Go\n\nGo is an open source project.\n\nIt is the work of hundreds of contributors. We appreciate your help!\n\n## Before filing an issue\n\nIf you are unsure whether you have found a bug, please consider asking in the [golang-nuts mailing\nlist](https://groups.google.com/forum/#!forum/golang-nuts) or [other forums](https://golang.org/help/) first. If\nthe behavior you are seeing is confirmed as a bug or issue, it can easily be re-raised in the issue tracker.\n\n## Filing issues\n\nSensitive security-related issues should be reported to [security@golang.org](mailto:security@golang.org).\nSee the [security policy](https://golang.org/security) for details.\n\nThe recommended way to file an issue is by running `go bug`.\nOtherwise, when filing an issue, make sure to answer these five questions:\n\n1. What version of Go are you using (`go version`)?\n2. What operating system and processor architecture are you using?\n3. What did you do?\n4. What did you expect to see?\n5. What did you see instead?\n\nFor change proposals, see [Proposing Changes To Go](https://go.dev/s/proposal-process).\n\n## Contributing code\n\nPlease read the [Contribution Guidelines](https://golang.org/doc/contribute.html) before sending patches.\n\nUnless otherwise noted, the Go source files are distributed under\nthe BSD-style license found in the LICENSE file.\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.42,
          "content": "Copyright 2009 The Go Authors.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n   * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n   * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n   * Neither the name of Google LLC nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "PATENTS",
          "type": "blob",
          "size": 1.27,
          "content": "Additional IP Rights Grant (Patents)\n\n\"This implementation\" means the copyrightable works distributed by\nGoogle as part of the Go project.\n\nGoogle hereby grants to You a perpetual, worldwide, non-exclusive,\nno-charge, royalty-free, irrevocable (except as stated in this section)\npatent license to make, have made, use, offer to sell, sell, import,\ntransfer and otherwise run, modify and propagate the contents of this\nimplementation of Go, where such license applies only to those patent\nclaims, both currently owned or controlled by Google and acquired in\nthe future, licensable by Google that are necessarily infringed by this\nimplementation of Go.  This grant does not include claims that would be\ninfringed only as a consequence of further modification of this\nimplementation.  If you or your agent or exclusive licensee institute or\norder or agree to the institution of patent litigation against any\nentity (including a cross-claim or counterclaim in a lawsuit) alleging\nthat this implementation of Go or any code incorporated within this\nimplementation of Go constitutes direct or contributory patent\ninfringement, or inducement of patent infringement, then any patent\nrights granted to you under this License for this implementation of Go\nshall terminate as of the date such litigation is filed.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.42,
          "content": "# The Go Programming Language\n\nGo is an open source programming language that makes it easy to build simple,\nreliable, and efficient software.\n\n![Gopher image](https://golang.org/doc/gopher/fiveyears.jpg)\n*Gopher image by [Renee French][rf], licensed under [Creative Commons 4.0 Attribution license][cc4-by].*\n\nOur canonical Git repository is located at https://go.googlesource.com/go.\nThere is a mirror of the repository at https://github.com/golang/go.\n\nUnless otherwise noted, the Go source files are distributed under the\nBSD-style license found in the LICENSE file.\n\n### Download and Install\n\n#### Binary Distributions\n\nOfficial binary distributions are available at https://go.dev/dl/.\n\nAfter downloading a binary release, visit https://go.dev/doc/install\nfor installation instructions.\n\n#### Install From Source\n\nIf a binary distribution is not available for your combination of\noperating system and architecture, visit\nhttps://go.dev/doc/install/source\nfor source installation instructions.\n\n### Contributing\n\nGo is the work of thousands of contributors. We appreciate your help!\n\nTo contribute, please read the contribution guidelines at https://go.dev/doc/contribute.\n\nNote that the Go project uses the issue tracker for bug reports and\nproposals only. See https://go.dev/wiki/Questions for a list of\nplaces to ask questions about the Go language.\n\n[rf]: https://reneefrench.blogspot.com/\n[cc4-by]: https://creativecommons.org/licenses/by/4.0/\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.42,
          "content": "# Security Policy\n\n## Supported Versions\n\nWe support the past two Go releases (for example, Go 1.17.x and Go 1.18.x when Go 1.18.x is the latest stable release).\n\nSee https://go.dev/wiki/Go-Release-Cycle and in particular the\n[Release Maintenance](https://go.dev/wiki/Go-Release-Cycle#release-maintenance)\npart of that page.\n\n## Reporting a Vulnerability\n\nSee https://go.dev/security/policy for how to report a vulnerability.\n"
        },
        {
          "name": "api",
          "type": "tree",
          "content": null
        },
        {
          "name": "codereview.cfg",
          "type": "blob",
          "size": 0.01,
          "content": "branch: master\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "go.env",
          "type": "blob",
          "size": 0.49,
          "content": "# This file contains the initial defaults for go command configuration.\n# Values set by 'go env -w' and written to the user's go/env file override these.\n# The environment overrides everything else.\n\n# Use the Go module mirror and checksum database by default.\n# See https://proxy.golang.org for details.\nGOPROXY=https://proxy.golang.org,direct\nGOSUMDB=sum.golang.org\n\n# Automatically download newer toolchains as directed by go.mod files.\n# See https://go.dev/doc/toolchain for details.\nGOTOOLCHAIN=auto\n"
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "misc",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}