{
  "metadata": {
    "timestamp": 1736557571649,
    "page": 614,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjY0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "The-Run-Philosophy-Organization/run",
      "stars": 31850,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".markdownlinks.json",
          "type": "blob",
          "size": 0.33,
          "content": "{\n    \"ignorePatterns\": [\n        {\n            \"pattern\": \"^http(s)?://cdnjs.cloudflare.com\"\n        }, \n        {\n            \"pattern\": \"^http(s)?://www.cloudflare.com/\"\n        }, \n    ], \n    \"timeout\": \"60s\", \n    \"retryOn429\": true, \n    \"retryCount\": 5, \n    \"aliveStatusCodes\": [0, 403, 429, 200], \n    \"fallbackRetryDelay\": \"60s\"\n}\n"
        },
        {
          "name": ".markdownlinter.json",
          "type": "blob",
          "size": 0.06,
          "content": "{\n  \"default\": true,\n  \"line_length\": false,\n  \"MD033\": false\n}"
        },
        {
          "name": "Archive备份.md",
          "type": "blob",
          "size": 0.68,
          "content": "# Archive备份\n\n## [互联网档案馆](https://zh.wikipedia.org/zh-cn/互联网档案馆)\n\n此Archive备份会遵守 Robots.txt 协议\n\n## [Archive.is](https://zh.wikipedia.org/zh-cn/Archive.is)\n\nArchive.is 每次会捕捉网站的一个页面，并不遵守 Robots.txt 协议\n\n## 我该使用哪个Archive备份？\n\n请先访问网站的 Robots.txt 的URL查看(比如Github的 Robots.txt 协议位于 <https://github.com/robots.txt>),如果没有对 Archive 的 Bot [做出限制](https://zh.wikipedia.org/wiki/Robots.txt)，\n推荐优先使用[互联网档案馆](https://web.archive.org/)提供的 Archive 服务\n\n否则请使用 [Archive.is](https://archive.ph/) 提供的 Archive 服务\n"
        },
        {
          "name": "CodeOfConduct.md",
          "type": "blob",
          "size": 0.54,
          "content": "# Code Of Conduct\n\n本项目收录的文章/截图/视频要求:\n\n1. 原创文章或有转载授权(转载文章需要附上原文作者和链接)\n2. 截图应该在保证清晰的情况下尽可能小(最好还能附上原链接)，视频为 Youtube 或其他视频平台链接（不建议直接上传视频）\n3. 链接请移除追踪参数，如果存在被删除的风险请添加 [Archive 备份](Archive备份.md)链接\n4. 尽可能保证时效性和真实性\n5. 使用 MarkDown 请不要有语法错误，错误原因请查看 Actions 检查日志\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 19.66,
          "content": "Attribution-ShareAlike 4.0 International\n\n=======================================================================\n\nCreative Commons Corporation (\"Creative Commons\") is not a law firm and\ndoes not provide legal services or legal advice. Distribution of\nCreative Commons public licenses does not create a lawyer-client or\nother relationship. Creative Commons makes its licenses and related\ninformation available on an \"as-is\" basis. Creative Commons gives no\nwarranties regarding its licenses, any material licensed under their\nterms and conditions, or any related information. Creative Commons\ndisclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\nUsing Creative Commons Public Licenses\n\nCreative Commons public licenses provide a standard set of terms and\nconditions that creators and other rights holders may use to share\noriginal works of authorship and other material subject to copyright\nand certain other rights specified in the public license below. The\nfollowing considerations are for informational purposes only, are not\nexhaustive, and do not form part of our licenses.\n\n     Considerations for licensors: Our public licenses are\n     intended for use by those authorized to give the public\n     permission to use material in ways otherwise restricted by\n     copyright and certain other rights. Our licenses are\n     irrevocable. Licensors should read and understand the terms\n     and conditions of the license they choose before applying it.\n     Licensors should also secure all rights necessary before\n     applying our licenses so that the public can reuse the\n     material as expected. Licensors should clearly mark any\n     material not subject to the license. This includes other CC-\n     licensed material, or material used under an exception or\n     limitation to copyright. More considerations for licensors:\n\twiki.creativecommons.org/Considerations_for_licensors\n\n     Considerations for the public: By using one of our public\n     licenses, a licensor grants the public permission to use the\n     licensed material under specified terms and conditions. If\n     the licensor's permission is not necessary for any reason--for\n     example, because of any applicable exception or limitation to\n     copyright--then that use is not regulated by the license. Our\n     licenses grant only permissions under copyright and certain\n     other rights that a licensor has authority to grant. Use of\n     the licensed material may still be restricted for other\n     reasons, including because others have copyright or other\n     rights in the material. A licensor may make special requests,\n     such as asking that all changes be marked or described.\n     Although not required by our licenses, you are encouraged to\n     respect those requests where reasonable. More_considerations\n     for the public:\n\twiki.creativecommons.org/Considerations_for_licensees\n\n=======================================================================\n\nCreative Commons Attribution-ShareAlike 4.0 International Public\nLicense\n\nBy exercising the Licensed Rights (defined below), You accept and agree\nto be bound by the terms and conditions of this Creative Commons\nAttribution-ShareAlike 4.0 International Public License (\"Public\nLicense\"). To the extent this Public License may be interpreted as a\ncontract, You are granted the Licensed Rights in consideration of Your\nacceptance of these terms and conditions, and the Licensor grants You\nsuch rights in consideration of benefits the Licensor receives from\nmaking the Licensed Material available under these terms and\nconditions.\n\n\nSection 1 -- Definitions.\n\n  a. Adapted Material means material subject to Copyright and Similar\n     Rights that is derived from or based upon the Licensed Material\n     and in which the Licensed Material is translated, altered,\n     arranged, transformed, or otherwise modified in a manner requiring\n     permission under the Copyright and Similar Rights held by the\n     Licensor. For purposes of this Public License, where the Licensed\n     Material is a musical work, performance, or sound recording,\n     Adapted Material is always produced where the Licensed Material is\n     synched in timed relation with a moving image.\n\n  b. Adapter's License means the license You apply to Your Copyright\n     and Similar Rights in Your contributions to Adapted Material in\n     accordance with the terms and conditions of this Public License.\n\n  c. BY-SA Compatible License means a license listed at\n     creativecommons.org/compatiblelicenses, approved by Creative\n     Commons as essentially the equivalent of this Public License.\n\n  d. Copyright and Similar Rights means copyright and/or similar rights\n     closely related to copyright including, without limitation,\n     performance, broadcast, sound recording, and Sui Generis Database\n     Rights, without regard to how the rights are labeled or\n     categorized. For purposes of this Public License, the rights\n     specified in Section 2(b)(1)-(2) are not Copyright and Similar\n     Rights.\n\n  e. Effective Technological Measures means those measures that, in the\n     absence of proper authority, may not be circumvented under laws\n     fulfilling obligations under Article 11 of the WIPO Copyright\n     Treaty adopted on December 20, 1996, and/or similar international\n     agreements.\n\n  f. Exceptions and Limitations means fair use, fair dealing, and/or\n     any other exception or limitation to Copyright and Similar Rights\n     that applies to Your use of the Licensed Material.\n\n  g. License Elements means the license attributes listed in the name\n     of a Creative Commons Public License. The License Elements of this\n     Public License are Attribution and ShareAlike.\n\n  h. Licensed Material means the artistic or literary work, database,\n     or other material to which the Licensor applied this Public\n     License.\n\n  i. Licensed Rights means the rights granted to You subject to the\n     terms and conditions of this Public License, which are limited to\n     all Copyright and Similar Rights that apply to Your use of the\n     Licensed Material and that the Licensor has authority to license.\n\n  j. Licensor means the individual(s) or entity(ies) granting rights\n     under this Public License.\n\n  k. Share means to provide material to the public by any means or\n     process that requires permission under the Licensed Rights, such\n     as reproduction, public display, public performance, distribution,\n     dissemination, communication, or importation, and to make material\n     available to the public including in ways that members of the\n     public may access the material from a place and at a time\n     individually chosen by them.\n\n  l. Sui Generis Database Rights means rights other than copyright\n     resulting from Directive 96/9/EC of the European Parliament and of\n     the Council of 11 March 1996 on the legal protection of databases,\n     as amended and/or succeeded, as well as other essentially\n     equivalent rights anywhere in the world.\n\n  m. You means the individual or entity exercising the Licensed Rights\n     under this Public License. Your has a corresponding meaning.\n\n\nSection 2 -- Scope.\n\n  a. License grant.\n\n       1. Subject to the terms and conditions of this Public License,\n          the Licensor hereby grants You a worldwide, royalty-free,\n          non-sublicensable, non-exclusive, irrevocable license to\n          exercise the Licensed Rights in the Licensed Material to:\n\n            a. reproduce and Share the Licensed Material, in whole or\n               in part; and\n\n            b. produce, reproduce, and Share Adapted Material.\n\n       2. Exceptions and Limitations. For the avoidance of doubt, where\n          Exceptions and Limitations apply to Your use, this Public\n          License does not apply, and You do not need to comply with\n          its terms and conditions.\n\n       3. Term. The term of this Public License is specified in Section\n          6(a).\n\n       4. Media and formats; technical modifications allowed. The\n          Licensor authorizes You to exercise the Licensed Rights in\n          all media and formats whether now known or hereafter created,\n          and to make technical modifications necessary to do so. The\n          Licensor waives and/or agrees not to assert any right or\n          authority to forbid You from making technical modifications\n          necessary to exercise the Licensed Rights, including\n          technical modifications necessary to circumvent Effective\n          Technological Measures. For purposes of this Public License,\n          simply making modifications authorized by this Section 2(a)\n          (4) never produces Adapted Material.\n\n       5. Downstream recipients.\n\n            a. Offer from the Licensor -- Licensed Material. Every\n               recipient of the Licensed Material automatically\n               receives an offer from the Licensor to exercise the\n               Licensed Rights under the terms and conditions of this\n               Public License.\n\n            b. Additional offer from the Licensor -- Adapted Material.\n               Every recipient of Adapted Material from You\n               automatically receives an offer from the Licensor to\n               exercise the Licensed Rights in the Adapted Material\n               under the conditions of the Adapter's License You apply.\n\n            c. No downstream restrictions. You may not offer or impose\n               any additional or different terms or conditions on, or\n               apply any Effective Technological Measures to, the\n               Licensed Material if doing so restricts exercise of the\n               Licensed Rights by any recipient of the Licensed\n               Material.\n\n       6. No endorsement. Nothing in this Public License constitutes or\n          may be construed as permission to assert or imply that You\n          are, or that Your use of the Licensed Material is, connected\n          with, or sponsored, endorsed, or granted official status by,\n          the Licensor or others designated to receive attribution as\n          provided in Section 3(a)(1)(A)(i).\n\n  b. Other rights.\n\n       1. Moral rights, such as the right of integrity, are not\n          licensed under this Public License, nor are publicity,\n          privacy, and/or other similar personality rights; however, to\n          the extent possible, the Licensor waives and/or agrees not to\n          assert any such rights held by the Licensor to the limited\n          extent necessary to allow You to exercise the Licensed\n          Rights, but not otherwise.\n\n       2. Patent and trademark rights are not licensed under this\n          Public License.\n\n       3. To the extent possible, the Licensor waives any right to\n          collect royalties from You for the exercise of the Licensed\n          Rights, whether directly or through a collecting society\n          under any voluntary or waivable statutory or compulsory\n          licensing scheme. In all other cases the Licensor expressly\n          reserves any right to collect such royalties.\n\n\nSection 3 -- License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the\nfollowing conditions.\n\n  a. Attribution.\n\n       1. If You Share the Licensed Material (including in modified\n          form), You must:\n\n            a. retain the following if it is supplied by the Licensor\n               with the Licensed Material:\n\n                 i. identification of the creator(s) of the Licensed\n                    Material and any others designated to receive\n                    attribution, in any reasonable manner requested by\n                    the Licensor (including by pseudonym if\n                    designated);\n\n                ii. a copyright notice;\n\n               iii. a notice that refers to this Public License;\n\n                iv. a notice that refers to the disclaimer of\n                    warranties;\n\n                 v. a URI or hyperlink to the Licensed Material to the\n                    extent reasonably practicable;\n\n            b. indicate if You modified the Licensed Material and\n               retain an indication of any previous modifications; and\n\n            c. indicate the Licensed Material is licensed under this\n               Public License, and include the text of, or the URI or\n               hyperlink to, this Public License.\n\n       2. You may satisfy the conditions in Section 3(a)(1) in any\n          reasonable manner based on the medium, means, and context in\n          which You Share the Licensed Material. For example, it may be\n          reasonable to satisfy the conditions by providing a URI or\n          hyperlink to a resource that includes the required\n          information.\n\n       3. If requested by the Licensor, You must remove any of the\n          information required by Section 3(a)(1)(A) to the extent\n          reasonably practicable.\n\n  b. ShareAlike.\n\n     In addition to the conditions in Section 3(a), if You Share\n     Adapted Material You produce, the following conditions also apply.\n\n       1. The Adapter's License You apply must be a Creative Commons\n          license with the same License Elements, this version or\n          later, or a BY-SA Compatible License.\n\n       2. You must include the text of, or the URI or hyperlink to, the\n          Adapter's License You apply. You may satisfy this condition\n          in any reasonable manner based on the medium, means, and\n          context in which You Share Adapted Material.\n\n       3. You may not offer or impose any additional or different terms\n          or conditions on, or apply any Effective Technological\n          Measures to, Adapted Material that restrict exercise of the\n          rights granted under the Adapter's License You apply.\n\n\nSection 4 -- Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that\napply to Your use of the Licensed Material:\n\n  a. for the avoidance of doubt, Section 2(a)(1) grants You the right\n     to extract, reuse, reproduce, and Share all or a substantial\n     portion of the contents of the database;\n\n  b. if You include all or a substantial portion of the database\n     contents in a database in which You have Sui Generis Database\n     Rights, then the database in which You have Sui Generis Database\n     Rights (but not its individual contents) is Adapted Material,\n\n     including for purposes of Section 3(b); and\n  c. You must comply with the conditions in Section 3(a) if You Share\n     all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not\nreplace Your obligations under this Public License where the Licensed\nRights include other Copyright and Similar Rights.\n\n\nSection 5 -- Disclaimer of Warranties and Limitation of Liability.\n\n  a. UNLESS OTHERWISE SEPARATELY UNDERTAKEN BY THE LICENSOR, TO THE\n     EXTENT POSSIBLE, THE LICENSOR OFFERS THE LICENSED MATERIAL AS-IS\n     AND AS-AVAILABLE, AND MAKES NO REPRESENTATIONS OR WARRANTIES OF\n     ANY KIND CONCERNING THE LICENSED MATERIAL, WHETHER EXPRESS,\n     IMPLIED, STATUTORY, OR OTHER. THIS INCLUDES, WITHOUT LIMITATION,\n     WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR\n     PURPOSE, NON-INFRINGEMENT, ABSENCE OF LATENT OR OTHER DEFECTS,\n     ACCURACY, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\n     KNOWN OR DISCOVERABLE. WHERE DISCLAIMERS OF WARRANTIES ARE NOT\n     ALLOWED IN FULL OR IN PART, THIS DISCLAIMER MAY NOT APPLY TO YOU.\n\n  b. TO THE EXTENT POSSIBLE, IN NO EVENT WILL THE LICENSOR BE LIABLE\n     TO YOU ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\n     NEGLIGENCE) OR OTHERWISE FOR ANY DIRECT, SPECIAL, INDIRECT,\n     INCIDENTAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY, OR OTHER LOSSES,\n     COSTS, EXPENSES, OR DAMAGES ARISING OUT OF THIS PUBLIC LICENSE OR\n     USE OF THE LICENSED MATERIAL, EVEN IF THE LICENSOR HAS BEEN\n     ADVISED OF THE POSSIBILITY OF SUCH LOSSES, COSTS, EXPENSES, OR\n     DAMAGES. WHERE A LIMITATION OF LIABILITY IS NOT ALLOWED IN FULL OR\n     IN PART, THIS LIMITATION MAY NOT APPLY TO YOU.\n\n  c. The disclaimer of warranties and limitation of liability provided\n     above shall be interpreted in a manner that, to the extent\n     possible, most closely approximates an absolute disclaimer and\n     waiver of all liability.\n\n\nSection 6 -- Term and Termination.\n\n  a. This Public License applies for the term of the Copyright and\n     Similar Rights licensed here. However, if You fail to comply with\n     this Public License, then Your rights under this Public License\n     terminate automatically.\n\n  b. Where Your right to use the Licensed Material has terminated under\n     Section 6(a), it reinstates:\n\n       1. automatically as of the date the violation is cured, provided\n          it is cured within 30 days of Your discovery of the\n          violation; or\n\n       2. upon express reinstatement by the Licensor.\n\n     For the avoidance of doubt, this Section 6(b) does not affect any\n     right the Licensor may have to seek remedies for Your violations\n     of this Public License.\n\n  c. For the avoidance of doubt, the Licensor may also offer the\n     Licensed Material under separate terms or conditions or stop\n     distributing the Licensed Material at any time; however, doing so\n     will not terminate this Public License.\n\n  d. Sections 1, 5, 6, 7, and 8 survive termination of this Public\n     License.\n\n\nSection 7 -- Other Terms and Conditions.\n\n  a. The Licensor shall not be bound by any additional or different\n     terms or conditions communicated by You unless expressly agreed.\n\n  b. Any arrangements, understandings, or agreements regarding the\n     Licensed Material not stated herein are separate from and\n     independent of the terms and conditions of this Public License.\n\n\nSection 8 -- Interpretation.\n\n  a. For the avoidance of doubt, this Public License does not, and\n     shall not be interpreted to, reduce, limit, restrict, or impose\n     conditions on any use of the Licensed Material that could lawfully\n     be made without permission under this Public License.\n\n  b. To the extent possible, if any provision of this Public License is\n     deemed unenforceable, it shall be automatically reformed to the\n     minimum extent necessary to make it enforceable. If the provision\n     cannot be reformed, it shall be severed from this Public License\n     without affecting the enforceability of the remaining terms and\n     conditions.\n\n  c. No term or condition of this Public License will be waived and no\n     failure to comply consented to unless expressly agreed to by the\n     Licensor.\n\n  d. Nothing in this Public License constitutes or may be interpreted\n     as a limitation upon, or waiver of, any privileges and immunities\n     that apply to the Licensor or You, including from the legal\n     processes of any jurisdiction or authority.\n\n\n=======================================================================\n\nCreative Commons is not a party to its public\nlicenses. Notwithstanding, Creative Commons may elect to apply one of\nits public licenses to material it publishes and in those instances\nwill be considered the “Licensor.” The text of the Creative Commons\npublic licenses is dedicated to the public domain under the CC0 Public\nDomain Dedication. Except for the limited purpose of indicating that\nmaterial is shared under a Creative Commons public license or as\notherwise permitted by the Creative Commons policies published at\ncreativecommons.org/policies, Creative Commons does not authorize the\nuse of the trademark \"Creative Commons\" or any other trademark or logo\nof Creative Commons without its prior written consent including,\nwithout limitation, in connection with any unauthorized modifications\nto any of its public licenses or any other arrangements,\nunderstandings, or agreements concerning use of licensed material. For\nthe avoidance of doubt, this paragraph does not form part of the\npublic licenses.\n\nCreative Commons may be contacted at creativecommons.org.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.38,
          "content": "# 润学\n\n[![License](https://img.shields.io/github/license/The-Run-Philosophy-Organization/run?style=flat-square)](https://creativecommons.org/licenses/by-sa/4.0/)\n[![Issues](https://img.shields.io/github/issues/The-Run-Philosophy-Organization/run?style=flat-square)](https://github.com/The-Run-Philosophy-Organization/run/issues)\n[![Stars](https://img.shields.io/github/stars/The-Run-Philosophy-Organization/run?style=flat-square)](https://star-history.com/#The-Run-Philosophy-Organization/run&Date)\n[![Check](https://github.com/The-Run-Philosophy-Organization/run/actions/workflows/Check.yml/badge.svg?branch=main)](https://github.com/The-Run-Philosophy-Organization/run/actions/workflows/Check.yml)\n\n>\n> 润学全球官方指定GitHub，整理润学宗旨、纲领、理论和各类润之实例。\n> 本Repo的核心宗旨，即是在于解决并回答[为什么润](哲学概念/为何而润.md)，[润去哪里](润学方法论/各国选择/)，[怎么润](润学实例/)三大问题；并成为新中国人的核心宗教，核心信念。\n> 中国人的润将会持续至少100年，直到2122年为止。而本目录，也将会持续100年，直到山无棱、天地合，才敢与润绝。\n\n迁徙自由，是**基本人权**；\n当然了，讨论真理的言论自由也是**基本人权**之一。\n\n[![Reddit](https://img.shields.io/reddit/subreddit-subscribers/iwanttorun?style=flat-square)](https://www.reddit.com/r/iwanttorun/)\n[![twitter](https://img.shields.io/twitter/url?label=Share%20On%20Twitter&url=https%3A%2F%2Fgithub.com%2FThe-Run-Philosophy-Organization%2Frun)](https://twitter.com/intent/tweet?text=Wow:&url=https%3A%2F%2Fgithub.com%2FThe-Run-Philosophy-Organization%2Frun)\n\n## 提交PR\n\n欢迎大家通过提交PR（Pull Request）的方式，补充自己的润的经历。可以匿名，但是格式最好包括学历，专业，出国时间，所花费用，所去国家，所用签证，所获身份等。感谢大家一起共筑全世界最大的中文润学文库。\n\n关于如何提交PR：在创建好自己的GitHub账号之后，选择本首页[右上方的Fork](https://github.com/The-Run-Philosophy-Organization/run/fork)，然后进入自己用户名下Fork好的首页，并在 Actions 页面启用 Workflows\n\n- GitHub Web 端：在合适的文件夹里选择新建文件，创建一个 `.md` 文件编写内容。\n  - 如果是上传文件，则请在对应目录点击 Add File 后点击 Upload Files ，等待文件上传完毕后点击 Commit。\n  - 提交好之后点击左下角 Commit 并等待 Actions 检查，请在检查通过后在自己的首页上点击 Contribute 后点击下方的 Open Pull Request\n\n- 本地：请先安装`npm`，后续操作[见文章](https://chinese.freecodecamp.org/news/how-to-make-your-first-pull-request-on-github/)\n\n提交B站等国内平台的视频和文章链接请移除追踪参数，如果存在 404 风险请添加[Archive备份](Archive备份.md)链接\n\n详细要求[见此](CodeOfConduct.md)\n\n## 本站精华\n\n[![Contributors](https://img.shields.io/github/contributors/The-Run-Philosophy-Organization/run?style=flat-square)](https://github.com/The-Run-Philosophy-Organization/run)\n\n- [为什么港股中概股和A股在23年下半年崩盘](经济与投资/为什么港股中概股和A股在23年下半年崩盘.md)\n- [为何而润](哲学概念/为何而润.md)\n- [阿里巴巴大牛亲身经历分享：境外申请EB1A全攻略](润学方法论/各国选择/美洲/美国/境外申请EB1A全攻略.md)\n- [润美方法论：一位CS教授的靠谱润学](润学方法论/各国选择/美洲/美国/CS教授的靠谱润学.md)\n- [润美方法论：美国工作签证的基本常识](润学方法论/各国选择/美洲/美国/美国工作签证的基本常识.md)\n- [润学方法论：文科或不好找程序员工作的女生如何润美国，更新了婚后绿卡问题](润学方法论/各国选择/美洲/美国/文科女生不好找程序员的工作如何润美国.md)\n- [Andrew：衙学第一篇：公务员范围、职位、级别与工资](润学之衙学基础/衙学第一篇：公务员范围、职位、级别与工资.md)\n- [Nika：没钱人如何移民澳洲](润学方法论/各国选择/亚洲和大洋洲/澳大利亚/没钱人如何移民澳洲.md)\n- [贝贝拉分享之：如何去澳洲攒金币](润学实例/技工/贝贝拉如何去澳洲攒金币.md)\n- [阿里巴巴大牛亲身经历分享：EB1, NIW, O1...如何在国内申请美国绿卡](润学实例/计算机/如何在国内申请美国绿卡.md)\n- [阿里巴巴大牛亲身经历分享：如何寻找适合自己的方案](润学方法论/如何寻找适合自己的方案.md)\n- [润美国网meiguo.run：移民美国到底有多容易？为什么来了就是美国人？](润学方法论/各国选择/美洲/美国/王探长系列之：为什么来了就是美国人.md)\n- [润美国网meiguo.run：无惧H1B抽签不中的实操圣经 (2022) | H1B没抽中签，如何轻松破解？](润学方法论/各国选择/美洲/美国/王探长系列之：H1B没抽中签如何轻松破解.md)\n- [润美国网meiguo.run：从入门到放弃，美国EB-5投资移民签证实操圣经](润学方法论/各国选择/美洲/美国/王探长系列之：美国EB-5投资移民签证实操圣经.md)\n- [冷锋吴京：一些常见的计算机去美国问题总结（含10043问题）](润学实例/计算机/一些常见的计算机去美国问题总结.md)\n- [冷锋吴京：如何去美国当程序员](润学实例/计算机/去美国当程序员V2.5.0.md)\n- [疫情期间护照获取的办法](润学方法论/前期准备/护照获取/README.md)\n- [10043润美方法](润学实例/10043学校如何润/10043润美方法.md)\n- [润日指南](润学方法论/各国选择/亚洲和大洋洲/日本/润日指南.md)\n\n## 更新日志\n\n[![Commits](https://img.shields.io/github/commit-activity/m/The-Run-Philosophy-Organization/run?style=flat-square)](https://github.com/The-Run-Philosophy-Organization/run/pulse)\n[![LastCommit](https://img.shields.io/github/last-commit/The-Run-Philosophy-Organization/run?style=flat-square)](https://github.com/The-Run-Philosophy-Organization/run)\n\n近期新增（**Week of 2024-1-1**）：\n\n- [为什么港股中概股和A股在23年下半年崩盘](经济与投资/为什么港股中概股和A股在23年下半年崩盘.md)\n\n按此查看[过往更新](往期更新.md)\n\n## 阅读大纲\n\n请从阅读 [润学纲领](润学纲领.md) 开始, 或者查看 [润学感悟](润学感悟)\n\n- 关于**为什么润**的理论部分会被分类整理到 [哲学概念](哲学概念)\n\n- 关于**润哪里**，可以移步 [润学方法论/各国选择](润学方法论/各国选择)\n\n  - 美国签证顺序和常见问题：[润学方法论/各国选择/美洲/美国](润学方法论/各国选择/美洲/美国)\n\n- 关于**怎么润**，请参考全球润友自身的经历 [润学实例](润学实例)：\n\n最后，茶余饭后，博君一笑，可以访问 [咱们赢麻了知名言论合集](张维为陈平曹丰泽等知名言论收集), [外交部赢化论精选](外交部发言精选)。\n\n## Star 历史\n\n[![Star History Chart](https://api.star-history.com/svg?repos=The-Run-Philosophy-Organization/run&type=Date)](https://star-history.com/#The-Run-Philosophy-Organization/run&Date)\n\n## 协议\n\n[![LICENSE](https://i.creativecommons.org/l/by-sa/4.0/88x31.png)](https://creativecommons.org/licenses/by-sa/4.0/deed.zh)\n\n本作品采用[知识共享署名 4.0 国际许可协议](https://creativecommons.org/licenses/by-sa/4.0/deed.zh)进行许可。\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.6,
          "content": "# Security Policy\n\n## Supported Versions\n\nUse this section to tell people about which versions of your project are\ncurrently being supported with security updates.\n\n| Version | Supported          |\n| ------- | ------------------ |\n| 5.1.x   | :white_check_mark: |\n| 5.0.x   | :x:                |\n| 4.0.x   | :white_check_mark: |\n| < 4.0   | :x:                |\n\n## Reporting a Vulnerability\n\nUse this section to tell people how to report a vulnerability.\n\nTell them where to go, how often they can expect to get an update on a\nreported vulnerability, what to expect if the vulnerability is accepted or\ndeclined, etc.\n"
        },
        {
          "name": "人口问题相关",
          "type": "tree",
          "content": null
        },
        {
          "name": "内宣",
          "type": "tree",
          "content": null
        },
        {
          "name": "历史的先声",
          "type": "tree",
          "content": null
        },
        {
          "name": "哲学概念",
          "type": "tree",
          "content": null
        },
        {
          "name": "外交部发言精选",
          "type": "tree",
          "content": null
        },
        {
          "name": "对润学的报道",
          "type": "tree",
          "content": null
        },
        {
          "name": "张维为陈平曹丰泽等知名言论收集",
          "type": "tree",
          "content": null
        },
        {
          "name": "往期更新.md",
          "type": "blob",
          "size": 13.42,
          "content": "# 过往更新\n\n- [空想管理学](哲学概念/空想管理学.md)\n- [张爱玲逃港记](润学感悟/张爱玲逃港记.md)\n- [纪念张爱玲诞辰100周年](润学感悟/纪念张爱玲诞辰100周年.md)\n- [高中学历润日本](润学实例/计算机/高中学历润日本.md)\n- [润日指南](润学方法论/各国选择/亚洲和大洋洲/日本/润日指南.md)\n- [程序员润日的方法](润学方法论/各国选择/亚洲和大洋洲/日本/程序员润日.md)\n- [润学感悟：九年来倒行逆施盘点](润学感悟/九年来倒行逆施盘点/)\n- [Jimmy: 英语学习资料分享](润学方法论/前期准备/英语学习/英语学习资料分享.md)\n- [网络民议:人民日报谈追梦这十年等](内宣/网络民议/README.md)\n- [中国的审查:网剧许可证](哲学概念/中国的审查.md)\n- [中国清零防疫政策相关分析](新冠疫情相关/中国清零防疫政策.md)\n- [新冠疫情相关 居民抗议:上海长乐路市民抗争](新冠疫情相关/居民抗议/README.md)\n- [新冠疫情相关 中国特色抗疫童话](新冠疫情相关/相关创作.md)\n- [更新哲学概念之中国的审查，李佳琦等](哲学概念/中国的审查.md)\n- [《历史的先声》系列文章合集](历史的先声/)\n- [衙学第二篇：各级别广义公务员人数、职级及待遇（视频）](https://www.youtube.com/watch?v=6WCgyaX3G1A)\n- [润学感悟：中国的性少数群体现状](润学感悟/中国的性少数群体现状.md)\n- [一个失去理智的司机有多危险](润学感悟/一个失去理智的司机有多危险.md)\n- [经济问题相关：我们的经济会变好吗](经济问题相关/我们的经济会变好吗.md)\n- [经济问题相关：国务院十万人大会](经济问题相关/国务院十万人大会.md)\n- [经济问题相关：国内汽车销量数据分析](经济问题相关/国内汽车销量数据分析.md)\n- [经济问题相关：中国经济的真实状况](经济问题相关/中国经济的真实状况.md)\n- [润学感悟：聊聊“润”](润学感悟/聊聊“润”.md)\n- [经济学人：习近平正如何摧毁中国经济](经济问题相关/经济学人：习近平正如何摧毁中国经济.md)\n- [纽约时报 “最后一代”和“润学”：中国年轻人的绝望与幻灭](对润学的报道/“最后一代”和“润学”：中国年轻人的绝望与幻灭.md)\n- [翻车现场：上海地铁恢复当日直播大翻车](内宣/网络民议/README.md)\n- [中国清零防疫政策](新冠疫情相关/中国清零防疫政策.md)\n- [哲学概念：中国的审查](哲学概念/中国的审查.md)\n- [新冠疫情相关：相关创作](新冠疫情相关/相关创作.md)\n- [新冠疫情相关：离开上海](新冠疫情相关/离开上海.md)\n- [润美方法论：美国工作签证的基本常识](润学方法论/各国选择/美洲/美国/美国工作签证的基本常识.md)\n- [新冠疫情相关：中国清零防疫政策](新冠疫情相关/中国清零防疫政策.md)\n- [哲学概念：中国的审查](哲学概念/中国的审查.md)\n- [绿卡-永居-国籍的概念与区分](润学方法论/绿卡-永居-国籍的概念与区分.md)\n- [哲学概念：自由主义](哲学概念/自由主义.md)\n- [贝贝拉分享之：如何去澳洲攒金币](润学实例/技工/贝贝拉如何去澳洲攒金币.md)\n- [Secrets of China 中国的秘密：比莉波特与王思聪](润学感悟/比莉波特与王思聪.md)\n- [如何评价人民日报谈：凌晨三点的迪也不是没蹦过？](润学感悟/如何评价人民日报谈凌晨三点的迪也不是没蹦过.md)\n- [哲学概念：自发秩序](哲学概念/自发秩序.md)\n- [润美方法论之：一位CS教授的靠谱润学](润学方法论/各国选择/美洲/美国/CS教授的靠谱润学.md)\n- [2022年4月份近期金融数据](经济问题相关/金融数据全面坍塌.md)\n- [我们是最后一代](人口问题相关/我们是最后一代.md)\n- [国家移民管理局: 从严限制中国公民非必要出境活动](润学方法论/前期准备/护照获取/国家移民管理局之从严限制中国公民非必要出境活动.md)\n- [美国人的自由到底是什么自由](润学感悟/美国人的自由到底是什么自由.md)\n- [更新美东ICC公司合集](润学方法论/各国选择/美洲/美国/美东ICC公司合集.md)\n- [美国、墨西哥、加拿大：穷蛆跑路指南](润学方法论/各国选择/穷蛆跑路指南.md)\n- [上海解封后，会出现大量“沪漂”慢慢离开上海吗？](润学感悟/上海解封后会出现大量沪漂慢慢离开上海吗.md)\n- [润学实例：通过 L1 （计算机）来美帝](润学实例/计算机/通过L1来美帝.md)\n- [对润学的报道：经济学人报道润学](对润学的报道/China_young_elite_are_considering_moving_abroad.md)\n- [润学方法论：文科或不好找程序员工作的女生如何润美国，更新了婚后绿卡问题](润学方法论/各国选择/美洲/美国/文科女生不好找程序员的工作如何润美国.md)\n- [近代中国落后，清朝作为异族统治王朝是不是主要原因](润学感悟/近代中国落后，清朝作为异族统治王朝是不是主要原因.md)\n- [为什么清朝如此专制能统治中国这么长时间](润学感悟/为什么清朝如此专制能统治中国这么长时间.md)\n- [1978年以来中国资本家地位变化](经济问题相关/1978年以来中国资本家地位变化.md)\n- [中国2022年4月份经济数据比较](经济问题相关/4月份经济数据比较.md)\n- [爱因斯坦为什么不去苏联？](润学感悟/爱因斯坦为什么不去苏联.md)\n- [决定定居他国且不可能回国是什么样的心态](润学感悟/决定定居他国且不可能回国是什么样的心态.md)\n- [润学感悟之：理性润，辩证润](润学感悟/理性润，辩证润.md)\n- [润学之润意大利简介](润学方法论/各国选择/西欧北欧/意大利/)\n- [底层鼠人逃跑指南](润学方法论/底层鼠人逃跑指南.md)\n- [苏联是如何在意识形态领域自废武功的？](润学感悟/苏联是如何在意识形态领域自废武功.md)\n- [为什么中国最近20年发展就跟开了挂一样](润学感悟/为什么中国最近20年发展就跟开了挂一样.md)\n- [如果疫情一直不会结束最终世界会是什么样子的](新冠疫情相关/如果疫情一直不会结束最终世界会是什么样子的.md)\n- [西方媒体是怎样给西方人洗脑的](润学感悟/西方媒体是怎样给西方人洗脑的.md)\n- [Nika：没钱人如何移民澳洲](润学方法论/各国选择/亚洲和大洋洲/澳大利亚/没钱人如何移民澳洲.md)\n- [Nika：如何去澳洲读注册护士移民](润学方法论/各国选择/亚洲和大洋洲/澳大利亚/如何去澳洲读注册护士移民.md)\n- [Andrew：衙学第一篇：公务员范围、职位、级别与工资](润学之衙学基础/衙学第一篇：公务员范围、职位、级别与工资.md)\n- [北美王探长：美国EB-1A杰出人才绿卡/EB-2 NIW国家利益豁免移民/O-1杰出人才工作签证实操圣经（2022）](润学方法论/各国选择/美洲/美国/王探长系列之：EB1，NIW与O1申请实操指南.md)\n- [北美物理系PHD亲身经历分享：一些常见的物理去美国读PhD的问题解答](润学实例/物理/一些常见的物理去美国读PhD的问题解答.md)\n- [北美物理系PHD亲身经历分享：理科壬润美心路](润学实例/物理/理科壬润美心路.md)\n- [北美物理系PHD亲身经历分享：理科生申请PhD，你需要做什么](润学实例/物理/理科生申请PhD，你需要做什么.md)\n- [小李在荷兰之：在荷兰生活的第一年](润学实例/计算机/小李在荷兰之在荷兰生活的第一年.md)\n- [小李在荷兰之：离开北京前往荷兰](润学实例/计算机/小李在荷兰之离开北京前往荷兰.md)\n- [更新了外交部发言精选](外交部发言精选), [新冠疫情相关 相关创作](新冠疫情相关/相关创作.md)\n- [美东ICC公司合集](润学方法论/各国选择/美洲/美国/美东ICC公司合集.md)\n- [北欧文化简介](润学方法论/各国选择/西欧北欧/北欧文化.md), [瑞典生活常用网站](润学方法论/各国选择/西欧北欧/瑞典/瑞典生活常用网站.md)\n- [联合早报 下午察：如何理解网络流行语“润”?](对润学的报道/下午察：如何理解网络流行语“润”.md)\n- [北美王探长：无惧H1B抽签不中的实操圣经 (2022) | H1B没抽中签，如何轻松破解？](润学方法论/各国选择/美洲/美国/王探长系列之：H1B没抽中签如何轻松破解.md)\n- [存档：上海\"四月之声\"简短纪录片](https://www.youtube.com/watch?v=38_thLXNHY8)\n- [润学感悟：上海是预示未来一百年的大河](润学感悟/pdfs/上海是预示未来一百年的大河.pdf)\n- [经济探讨：外企大量撤资去印度越南会不会造成国人大量失业](经济问题相关/外企大量撤资去印度越南会不会造成国人大量失业.md)\n- [经济探讨：为什么我们的内需没有美国那么旺盛](经济问题相关/为什么我们的内需没有美国那么旺盛.md)\n- [润学伦理与国际主义精神](润学感悟/润学伦理与国际主义精神.md)\n- [润学感悟：资本主义和共产主义有什么区别](润学感悟/资本主义和共产主义有什么区别.md)\n- [润学方法论：如何寻找适合自己的方案](润学方法论/如何寻找适合自己的方案.md)\n- [从入门到放弃：美国EB-5投资移民签证实操圣经](润学方法论/各国选择/美洲/美国/王探长系列之：美国EB-5投资移民签证实操圣经.md)\n- [章立凡：\"国进民退\"的三次教训](经济问题相关/国进民退的三次教训.md)\n- [感悟：我现在明白为啥要润了](润学感悟/我现在明白为啥要润了.md)\n- [感悟：全世界可口可乐到底是不是一个味道?](润学感悟/全世界可口可乐到底是不是一个味道.md)\n- [德国人怒拒被带走录音](新冠疫情相关/居民抗议/德国人与居委会的录音.mp4)\n- [从偷着乐，到“䟏”](润学感悟/从偷着乐到䟏.md)\n- [新冠疫情相关：华东理工93岁教授](新冠疫情相关/记录在案的次生伤害/求救，华东理工93岁教授夫妇.md)\n- [流行病学专家李觉: “动态清零”是综合社会成本最低的抗疫策略](新冠疫情相关/“动态清零”是综合社会成本最低的抗疫策略.md)\n- [润学方法论之：荷兰](润学方法论/各国选择/西欧北欧/荷兰/)\n- [王思聪说自己不干了](新冠疫情相关/居民抗议/王思聪不干了.JPG)\n- [疫情期间护照获取的办法](润学方法论/前期准备/护照获取/README.md)\n- [一个宿舍的神神兔兔该如何相处](润学感悟/一个宿舍的神神兔兔该如何相处.md)\n- [莲花清瘟胶囊最新广告（下载后用播放器观看）](新冠疫情相关/莲花清瘟/莲花清瘟胶囊.mp4)\n- [润日本：程序员方案总结](润学方法论/各国选择/亚洲和大洋洲/日本/程序员润日.md)\n- [润日本：读硕士如何润日](润学方法论/各国选择/亚洲和大洋洲/日本/读硕士润日.md)\n- [从沉没成本谬误到损失厌恶情结](哲学概念/从沉没成本谬误到损失厌恶情结.md)\n- [赵立坚发言更新](外交部发言精选/赵立坚/)\n- [为何而润](哲学概念/为何而润.md)\n- [上海新冠被虐杀的宠物](新冠疫情相关/被虐杀的宠物/)\n- [上海新冠居民抗议](新冠疫情相关/居民抗议/)\n- [上海市民陈顺平4月14日去世发生经过](新冠疫情相关/记录在案的次生伤害/上海市民陈顺平4月14日去世发生经过.md)\n- [学好英文的十个步骤](润学方法论/前期准备/英语学习/学好英文的十个步骤.md)\n- [为了更好的润，我心中的润学](润学感悟/为了更好的润，我心中的润学.md)\n- [更新加拿大润学参考资料](润学方法论/各国选择/美洲/加拿大/参考资料.md)\n- [阿里巴巴大牛亲身经历分享：EB1, NIW, O1...如何在国内申请美国绿卡](润学实例/计算机/如何在国内申请美国绿卡.md)\n- [更新润学方法论](润学方法论/README.md)\n- [润学感悟之润文解字](润学感悟/润文解字.md)\n- [10043润美方法](润学实例/10043学校如何润/10043润美方法.md)\n- [方舱医院现状](新冠疫情相关/方舱医院现状.md)\n- [上海疫情逝者名单](新冠疫情相关/记录在案的次生伤害/上海疫情逝者名单.md)\n- [我为什么要润：基本哲学概念合集](哲学概念)\n- [人口问题相关](人口问题相关)\n- [冷锋吴京：一些常见的计算机去美国问题总结（含10043问题）](润学实例/计算机/一些常见的计算机去美国问题总结.md)\n- [加拿大各省提名具体要求](润学方法论/各国选择/美洲/加拿大/加拿大各省提名具体要求.md)\n- [芬兰留学移民优缺点](润学方法论/各国选择/西欧北欧/芬兰/芬兰留学移民优缺点.md)\n- [北美王探长：拿EB1, EB2, L1可能比你想象的要更简单](润学方法论/各国选择/美洲/美国/王探长系列之：为什么来了就是美国人.md)\n- [硕士秋招SDE找工时间线总结](润学实例/计算机/硕士秋招SDE找工时间线总结.md)\n- [冷锋吴京：如何去美国当程序员](润学实例/计算机/去美国当程序员V2.5.0.md)\n- [美国如果没抽到H1B怎么办](润学方法论/各国选择/美洲/美国/没抽到H1B怎么办.md)\n- [海专精算比我懂更比你懂](张维为陈平曹丰泽等知名言论收集/曹丰泽/)\n- [出国经历之：浙大本科美国三本弗罗里达数据工程师](润学实例/计算机/浙大本科美国三本佛罗里达数据工程师.md)\n"
        },
        {
          "name": "新冠疫情相关",
          "type": "tree",
          "content": null
        },
        {
          "name": "润学之衙学基础",
          "type": "tree",
          "content": null
        },
        {
          "name": "润学实例",
          "type": "tree",
          "content": null
        },
        {
          "name": "润学感悟",
          "type": "tree",
          "content": null
        },
        {
          "name": "润学方法论",
          "type": "tree",
          "content": null
        },
        {
          "name": "润学纲领.md",
          "type": "blob",
          "size": 1.93,
          "content": "# 润学纲领\n\n润，因他能在真正的意义上拯救中国人，所以可说是当下社会每个中国人唯一真正的宗教，唯一真正的哲学。他是一门物理救赎的宗教信仰；其实际价值可以与追求精神救赎的基督教媲美。\n\n润的人，会乐于帮助尚未润出的人润，拯救他们与现实的“地狱”；而想润的人，也将从本润学纲领所提供的哲学指导，思想升华与润学实例中，获益匪浅。\n\n迁徙自由，是基本人权；当然了，讨论真理的言论自由也是\n\n## 润的目的\n\n- 不是为了解决、掩盖或者逃避你现有的缺陷和不足\n- 不是为了让你获得物质、金钱上的利益\n- 是为了成为一个可以决定自己命运，而不被布尔什维克主义---也即凭借自我赋予正确性的极少数人所决定，并且在这些所谓正确、一盘大棋一般的决定的执行过程中，因受到官僚集团“唯上主义”只对上负责，而遭到漠视甚至牺牲的人\n- 是为了让自己，自己的家人，自己的伴侣，特别是自己的后代永远免受布尔什维克主义自以为是的正确而实则被戕害的人\n- 我究竟为何而润？参考本篇文章帮您详细阐述与分析[我究竟为何而润](哲学概念/为何而润.md)\n\n## 润的对象\n\n- 理论上说，润适用于全体除了极少数特权阶层，资产1个亿以上的既得利益者，和布尔什维克内部拥有最高决策，最高利己能力的中国大陆人\n- 据测算，全中国15亿人中，有大约14亿人年收入不足12万人民币；有1亿人年收入超过12万人民币\n- 其中，有1000万人具备突破信息封锁，以及上外网的条件\n- 去掉其中约200万的特权阶层，既得利益者，布尔什维克等，还有约800万人，是现阶段具备学历、一定财产、充足信息、外语能力等必备条件润的人群\n\n## _如果你满足以上条件，我们欢迎您加入润学大家庭_\n"
        },
        {
          "name": "经济与投资",
          "type": "tree",
          "content": null
        },
        {
          "name": "经济问题相关",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}