{
  "metadata": {
    "timestamp": 1736557341069,
    "page": 292,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "poteto/hiring-without-whiteboards",
      "stars": 47039,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.28,
          "content": "# EditorConfig helps developers define and maintain consistent\n# coding styles between different editors and IDEs\n# editorconfig.org\n\nroot = true\n\n\n[*]\nend_of_line = lf\ncharset = utf-8\ntrim_trailing_whitespace = true\ninsert_final_newline = true\nindent_style = space\nindent_size = 2\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.14,
          "content": "# Node build artifacts\nnode_modules\nnpm-debug.log\n\n# Local development\n*.env\n*.dev\n.DS_Store\n\n# Docker\nDockerfile\ndocker-compose.yml\n\n# IDE\n.idea/\n"
        },
        {
          "name": ".nvmrc",
          "type": "blob",
          "size": 0.01,
          "content": "lts/*\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.15,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, gender identity and expression, level of experience,\nnationality, personal appearance, race, religion, or sexual identity and\norientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\nadvances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at arr@sugarpirate.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at [http://contributor-covenant.org/version/1/4][version]\n\n[homepage]: http://contributor-covenant.org\n[version]: http://contributor-covenant.org/version/1/4/\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.59,
          "content": "# Contributing Guidelines\n\nThanks for contributing! Please adhere to the [Contributor Code of Conduct](/CODE_OF_CONDUCT.md). Please send a pull request if you have any [additions, updates](#additions-or-updates) or [removals](#removals).\n\n## Format\n\n```\n- [Company or team name within company](https://jobspage) | locations | description of interview process\n```\n\nLocations **must** be city names that are separated by a `/`, `;`, or `&`. Locations should be formatted like so:\n\n```\nSan Francisco, CA; Tokyo, Japan; Moscow, Russia\n```\n\nGood example:\n\n```\n- [MyCompany](https://example.com/jobs) | San Francisco, CA; Tokyo, Japan; Moscow, Russia | Take home project that resembles a problem MyCompany solves for, then discussion about the code in-person\n```\n\nPull requests will be accepted if they follow the [format](#format) and:\n\n## Additions or updates\n1. The pull request adheres to the repository's\n    [Code of Conduct](/CODE_OF_CONDUCT.md)\n1. The company fits the [criteria](/CRITERIA.md)\n1. You add the company in alphabetical order in the list\n1. You submit the company with a website\n1. You submit the company with a location\n1. You submit the company with a brief description of the interview process\n\n## Removals\n1. The pull request adheres to the repository's\n    [Code of Conduct](/CODE_OF_CONDUCT.md)\n1. The company **DOES NOT** fit the [criteria](/CRITERIA.md)\n1. Explain why the company does not fit the criteria\n1. The PR will be merged assuming the guidelines are followed\n1. The person who added the company will be given a chance to respond and add the company back if it does indeed **require** CS knowledge\n"
        },
        {
          "name": "CRITERIA.md",
          "type": "blob",
          "size": 0.5,
          "content": "# Criteria\n\nIn order to be accepted into this list, the company's interview process **must not** do the following in **any** step of the interview process:\n\n- Ask CS trivia/brainteasers/riddles/puzzles/etc that DO NOT relate to the job the candidate is applying for\n- Use live-coding sites like HackerRank or LeetCode\n\nThe only exceptions to the above is where CS knowledge is a **requirement** of the role. For example, if you are being hired to write a package manager, you probably need to understand DAGs.\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.05,
          "content": "MIT License\n\nCopyright (c) 2017 Lauren Elizabeth Tan\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 164.92,
          "content": "# Hiring Without Whiteboards\n\nA list of companies (or teams) that don't do \"whiteboard\" interviews. \"Whiteboards\" is used as a metaphor, and is a _symbol_ for the kinds of CS trivia questions that are associated with bad interview practices. Whiteboards are not bad – CS trivia questions are. Using sites like HackerRank/LeetCode _probably_ fall into a similar category.\n\nThe companies and teams listed here use interview techniques and questions that resemble day-to-day work. For example, pairing on a real world problem or a paid/unpaid take home exercise. Read (and contribute to) [our recommendations](RECOMMENDATIONS.md) for ways to conduct better interviews.\n\n### tl;dr\n\n- Discussing a real world problem (with or without whiteboard) is 👍\n- Solving CS trivia, technical puzzles, riddles, brainteasers (with or without whiteboard) is 👎\n\nPlease open a [PR](https://github.com/poteto/hiring-without-whiteboards/pull/new/master) to be added.\n\n### Duds\n\nIf you've been through an interview with one of these companies recently, and your experience suggests otherwise from their description, please open a [PR](https://github.com/poteto/hiring-without-whiteboards/pull/new/master) to remove them from this list.\n\n### I want to search/sort/filter/group by X!\n\nCheck out our [Airtable](https://airtable.com/shr3eGPDm3wGjT2gA)!\n\nAdditions to this document that are properly formatted will automatically be pushed and added to Airtable. Keywords from the description will also be extracted. You can see (and contribute!) to the [API here](https://github.com/poteto/hww-api).\n\nAlso check out [No Whiteboards](https://www.nowhiteboard.org) to search for jobs at these companies.\n\n### Discussion and other reads\n\n<!--lint disable-->\n\n- Discussion\n  - [HackerNews (2017)](https://news.ycombinator.com/item?id=13874026)\n  - [HackerNews (2020)](https://news.ycombinator.com/item?id=23981795)\n- [Finding a better alternative to the whiteboard interview](https://theoutline.com/post/1256/finding-a-better-alternative-to-the-whiteboard-interview)\n- [How to hire engineering talent without the BS](https://jes.al//2023/03/how-to-hire-engineering-talent-without-the-bs/)\n- [How I Hire Programmers](http://www.aaronsw.com/weblog/hiring.en) by Aaron Swartz\n\n<!--lint enable-->\n\n---\n\n## 0 - 9\n\n- [1000.software](https://www.1000.software/careers) | Krakow, Poland / Remote | Series of 2 interviews first on soft skills, second on technical skills (how to build things, how to solve specific, real world problem, best practice) and meeting with a team leader. Sometimes a take home, simple project.\n\n## A - C\n\n- [Aalyria](https://www.aalyria.com/jobs) | Remote | Timeboxed design exercise and related coding exercise, followed by a technical/behavioral discussion with the team, and behavioral interview with leadership\n- [Able](https://able.co/careers) | Lima, PE / Remote | Coding interview, Technical interview (Backlog Refinement + System Design), Leadership interview (Behavioural)\n- [Abstract](https://angel.co/abstract/jobs) | San Francisco, CA\n- [Accenture](https://www.accenture.com/us-en/careers) | San Francisco, CA / Los Angeles, CA / New York, NY / Kuala Lumpur, Malaysia | Technical phone discussion with architecture manager, followed by behavioral interview focusing on soft skills\n- [Accredible](https://www.accredible.com/careers) | Cambridge, UK / San Francisco, CA / Remote | Take home project, then a pair-programming and discussion onsite / Skype round.\n- [Acko](https://www.acko.com/careers) | Mumbai, India | Phone interview, followed by a small take home problem. Finally a F2F or skype pair programming session\n- [Acumen](https://www.acumenci.com/careers/) | London, UK | Small take home test, and sit in on some sprint rituals on-site\n- [Ad Hoc](https://adhoc.team) | Remote / Washington, DC | Technical take-home assignment, followed by multiple video calls that are discussions of technical background and experience.\n- [Adaface](https://www.adaface.com) | Remote/ Singapore, Singapore / Bangalore, India | Conversational on-the-job technical assessment, followed by video calls with technical lead and founders\n- [AdCellerant](https://adcellerant.com/career-job-listing/) | Denver, CO | Technical phone screen, 5-day take home code challenge, then on-site interview comprised of cultural and technical discussions\n- [Adeva](https://adevait.com) | New York, USA | 4 steps interviewing process that includes online coding assignment + lead engineer call.\n- [AdEx Network](https://www.adex.network) | Sofia, Bulgaria / Remote | Email screening process, followed by a take-home assignment\n- [Admiral](https://getadmiral.com) | Gainesville, FL / Remote | Intro phone call with hiring manager, take-home assignment, (mostly) non-technical on-site with team/leadership\n- [Adnymics](https://adnymics.com) | Munich, DE | Take home project, then work with the team for a day\n- [Adthena](https://adthena.com) | London, UK | Takehome project and discussion on-site\n- [Adyen](https://www.adyen.com) | Amsterdam, NL | Take-home assignment, design discussion based on take home, culture fit etc. Provides visa sponsorship to the Netherlands.\n- [Affinipay](https://www.affinipay.com) | Austin, TX | Short takehome project + video interview about coding with engineering manager\n- [Agency Enterprise Studio](https://ae.studio) | Remote / Los Angeles, CA / Florianópolis, Brazil | Live coding of a task you'd do daily\n- [Ageno](https://ageno.pl) | Bielsko-Biala, Poland | Simple Magento Take-home project and discussion on the real world problems.\n- [AgileMD](https://angel.co/agilemd/jobs) | San Francisco, CA | Takehome project\n- [AImotive](https://aimotive.com/career/) | Budapest, Hungary | Small take-home project, then in-person interview about technical background\n- [Airbase](https://www.airbase.com/careers) | San Francisco, CA; Bangalore, India; Remote | Intro Call with HR or EMs, small take-home project, two tech rounds with Airbase Engineers (based on real world engineering problems), followed by a final values round with the Founder or Director of Engineering.\n- [Airtable](https://airtable.com/careers) | San Francisco, CA; Austin, TX; Mountain View, CA; New York, NY; Remote | Take home project that resembles a problem Airtable solves for. Five hour on-site which includes a discussion of the project, UI design, discussing architectural tradeoffs, and code debugging.\n- [Aiwip](https://aiwip.com) | London, UK | Skype/phone interview followed by takehome project or worksample (or whiteboard)\n- [Albert](https://jobs.lever.co/meetalbert/) | Los Angeles, CA | Discussion with senior engineer, and then practical pair programming related to my experience + the position\n- [Algolia](https://www.algolia.com/careers) | Paris, France / San Francisco, CA | Takehome project & Onsite discussions and presentation\n- [all about apps GmbH](https://www.allaboutapps.at/jobs) | Vienna, Austria | 2-phase technical discussion & examination with department heads and management.\n- [Allegro](https://allegro.pl/praca) | Warsaw, Poland; Poznan, Poland; Torun, Poland; Wroclaw, Poland; Krakow, Poland | Take home, simple project. Series of 2 technical interviews (how to build things, how to solve specific, real world problem) and meeting with a team leader.\n- [Alluxi](https://www.alluxi.mx) | Monterrey, Mexico | Initial skype interview, technical interview with Senior engineer and work sample review.\n- [Almabase](https://www.almabase.com/careers#believe) | Bengaluru, India | Take-home assignment, design discussion based on take home, low level and high level design rounds based on real life problems, culture fit etc. during onsite.\n- [AlphaSights](https://www.alphasights.com/careers/open-roles/) | London, UK / New York, NY / Remote | Initial interview, pair programming then final round with general technical questions\n- [AMAGI](https://amagi.io) | Makati, Philippines | 1) Review of your resume, portfolio, and/or GitHub profile; 2) 1 hour discussion (in-person or Skype) about your goals, experience, personal culture, and how to apply technical solutions to real problems;\n- [Analytical Flavor Systems](https://gastrograph.com) | Manhattan, New York | Code sample or take-home project, both with discussion.\n- [Anderson Merchandisers](https://amerch.com) | Remote / Dallas, TX | Technical discussion about the technologies they are currently using. Going over background and resume.\n- [Angaza](https://www.angaza.com/careers/) | San Francisco, CA | Take-home assignment with guaranteed feedback, on-site interviews involving actual day-to-day work\n- [Animech](https://careers.animech.com) | Uppsala, Sweden | Multiple interviews with technical staff with real problem discussions.\n- [Anyfin](https://career.anyfin.com) | Stockholm, Sweden | Takehome project & Onsite discussions and presentation.\n- [Aparkado](https://aparkado.de) | Cologne, Germany / Remote | Intro with Co-Founder, team fit with the team plus a small real-world problem to solve, followed by final round with CEO / Co-Founder.\n- [Apollo Agriculture](https://apolloagriculture.com) | Nairobi, Kenya / Remote | Takehome project or Worksample (or whiteboard)\n- [Applied](https://www.beapplied.com) | London, UK | Situational judgement tests focusing on real-world soft skills (online then in structured interview)\n- [Arachnys](https://angel.co/arachnys/jobs/220465-software-engineer) | London, UK | Take home test, real world pair programming\n- [Articulate](https://www.articulate.com/about/careers/) | Remote | Take-home project & pair program on a problem similar to daily work\n- [Artsy](https://www.artsy.net/jobs#engineering) | New York, NY / London, UK / Berlin, Germany / Los Angeles, CA / Hong Kong, Hong Kong / Remote | Our process: 1) Informal chat 2) Application 3) Phone screen 4) In-person interview with 1 lead, 2 individual contributors and 1 non-engineer (30-45 mins each), focusing on your work habits and expertise as demonstrated in your previous work 5) ~4 in-depth professional reference calls (30-45 mins each).\n- [ASI Data Science](https://www.asidatascience.com/careers) | London, UK | Project to work at home, general technical questions, pair programming with engineers\n- [ASOS](https://www.asoscareers.com) | London, UK | Take home or in-person code refactoring exercise, in-person walk-though of solution including software craftsmanship principles and design decisions, in-person freestyle architecture walk-through\n- [Ataccama](https://jobs.ataccama.com) | Prague, Czech Republic | Face to face interview (skype or onsite), coding task for 30 min, meeting with team members\n- [aTech Media](https://atech.media) | London, UK | Face to face interview, review of existing open source contributions or, if none are available, asked to write a library for something that interests them\n- [Atlan](https://atlan.com) | New Delhi, India | A mini project (to be done within 8 days), followed by a discussion with the team you're applying to. Then as the final step, a call with one of the founders.\n- [Aura Frames](https://auraframes.com/jobs?gh_src=2ef5cfa32) | New York, NY / San Francisco, CA | Simplified real-world coding task on Coderpad.io, followed by a few hours onsite writing code in our actual codebase.\n- [Auto1](https://www.auto1-group.com/jobs) | Berlin, DE | Series of Skype interviews which covers general technical questions, followed by a take-home assignment\n- [Automattic](https://automattic.com/work-with-us/) | Remote | short take-home code test, then a part-time, paid project.\n- [AutoScout24](https://github.com/AutoScout24/hiring) | Munich, Germany | Skype interview followed by home assignment from our day-to-day business and then on-site interview including lunch with a team\n- [Avant](https://avant.com/jobs) | Chicago, IL | Pair programming interviews.\n- [Avarteq GmbH](https://www.avarteq.com/career) | Berlin, Germany / Saarbrücken, Germany | Technical interview with our developers on-site or remote followed by a work sample in a pair programming session or a previous take-home project with a follow-up discussion and detailed feedback.\n- [Axelerant](https://www.axelerant.com/careers) | Remote | Take-home project, interviews with hr and engineering team.\n- [Axiacore](https://axiacore.com) | Bogota, Colombia | We talk about on how is your process when solving problems.\n- [Axios](https://www.axios.com/careers) | Arlington, VA / New York, NY / San Francisco, CA / Remote | Take-home project, with discussion.\n- [B12](https://boards.greenhouse.io/b12#.WMlLfRIrJTa) | New York, NY | Take-home exercises and pair-programming with the team.\n- [Babylon Health iOS Team](https://github.com/Babylonpartners/iOS-Interview-Demo) | London, UK | Take-home project, on-site presentation and discussion, design and product interview.\n- [Backbase](https://workatbackbase.com) | Amsterdam, Netherlands; Cardiff, Wales; London, UK; Atlanta, GA | Takehome project, interviews\n- [Badi](https://jobs.badi.com) | Barcelona, Spain | Phone Screen, Take-home project, then a discussion onsite round.\n- [Badoo](https://team.badoo.com/jobs) | London, UK | Take-home project, then a discussion onsite round.\n- [BAE Systems Digital Intelligence](https://cybercareers.baesystems.com) | London, UK / Manchester, UK / Guildford, UK / Gloucester, UK | Initial interview with experience based technical questions, second interview pair programming on problem similar to daily work\n- [Bakken & Bæck](https://bakkenbaeck.com/jobs) | Oslo, Norway; Amsterdam, Netherlands; Bonn, Germany | Skype interview followed by take-home assignment and a visit to one of our offices\n- [Balabit](https://career.balabit.com) | Budapest, Hungary | Take-home project (medium size, with restrictions, e.g. only stdlib may be used), then discussion on-site\n- [Barracuda View Team](https://www.barracuda.com/company/careers) | Chelmsford, MA / Remote | Phone screen, remote pair programming session, technical discussion interview, culture fit interview\n- [Basecamp](https://basecamp.com/about/jobs) | Chicago, IL / Remote\n- [BCW Group](https://www.bcw.group) | Remote | Behavioral interview with the technical lead and hiring manager, followed by a take-home project, and finally a brief discussion about how the exercise went.\n- [Beam Dental](https://jobs.lever.co/beam) | Columbus, OH / Remote | Phone Screen, Take Home Project, In-Person or remote Pairing and Cross-Functional Interview\n- [Belka](https://www.belkadigital.com) | Trento, Italy; Munich, Germany | We give you a small task that you can do alone and then we evaluate your work with you\n- [Bemind](https://www.bemind.me) | Biella, Italy / Latina, Italy / Remote | Series of interviews, discussion about technical background and past experiences, take-home project & pair programming\n- [Bendyworks](https://bendyworks.com/careers) | Madison, WI | Interviews and pair programming on personal projects\n- [Benefex](https://hellobenefex.com/about-us/careers) | Southampton, UK / Remote | A short, 3-stages interview process. The first stage is with HR. The second stage is a take-home assignment. The third stage is discussing the take-home assignment solution with two engineers.\n- [Benshi.ai](https://www.benshi.ai) | Barcelona, Spain | Initial 15-30 mins interview with HR, followed by 15-30 mins chat with hiring manager to clear out basic concepts, then followed by take-home task for 5 days\n- [Betterment](https://www.betterment.com/careers) | New York, NY | Phone interview followed by on-site pair programming to simulate a Betterment feature build.\n- [BetterPT](https://www.betterhealthcare.co/careers) | New York, NY | Initial phone interview, project using our tech stack, on-site code review/pair programming and \"meet the team\".\n- [bevelop](https://bevelop.de) | Aschaffenburg, BY / Remote | Initial introductory call, on-sight or remote trial day with project\n- [Big Nerd Ranch](https://bignerdranch.com/careers) | Atlanta, GA & Remote | Interviews and pair programming on an internal project or problem.\n- [BigaBid](https://www.bigabid.com/careers) | Tel Aviv, Israel | Design a real time solution to a problem relevant to the business, followed by a take home project implementing a lean version of the solution\n- [BigBinary](https://www.bigbinary.com/jobs) | Remote | Phone discussion with a developer and the CEO\n- [BioConnect](https://bioconnect.com) | Toronto, Canada | Take-home assignment & discussion\n- [Bitchief Technology Services](https://www.bitchief.com) | India, Gurgaon | Screening Round: General comms and aptitude, Technical Round: Questions related to required technology, Home Assignments\n- [bitExpert AG](https://www.bitexpert.de/karriere) | Mannheim, Germany | Interview with experience based technical questions\n- [Bitpanda](https://www.bitpanda.com/en/career) | Cracow, Poland / Remote | HR talk, take-home task, tech interview, culture fit interview\n- [Bits of Love](https://www.bitsoflove.be/careers) | Bruges, Belgium | In-person interview to evaluate experience and motivation, potentially followed by take-home project.\n- [Bitso](https://bitso.com/jobs) | Mexico City, Mexico / Remote | Intro phone or hangouts/skype call with People team, take home project followed by walkthrough of your code and some tech questions focused on your experience, founders video call with one of the founders\n- [Blackdot Solutions](https://blackdotsolutions.com) | Cambridge, UK | Take-home project followed by on-site face-to-face walkthru of your code focusing on decisions/reasoning/technology used.\n- [BlackTech](https://blacktech.com.np) | Pokhara, NP | Take-home project followed by on-site face to face or remote video conference interview.\n- [Bleacher Report](https://bleacherreport.com) | San Francisco, CA, USA | Take-home project; on-site discussion about the project and meeting with different teams\n- [Blendle](https://blendle.homerun.co/?lang=en) | Utrecht, The Netherlands | Take-home project & pair program on a problem similar to daily work\n- [blogfoster](https://github.com/blogfoster/join-the-engineering-team) | Berlin, Germany | Take-home project, discussion on-site\n- [Bloom Works](https://bloomworks.digital/jobs) | Remote | Discussion, pair-programming exercise\n- [Blue Bottle Coffee](https://www.bluebottlecoffee.com) | Oakland, CA | Technical Phone Screen, Take Home Challenge, Technical in-persons.\n- [Bluesoft](http://www.bluesoft.com.br) | São Paulo, Brazil | Takehome project and an interview to evaluate the candidate's previous experience.\n- [Bocoup](https://bocoup.com/careers) | Boston, MA / Remote | Pair programming with personal laptop on typical problem seen at work\n- [Bonusly](https://bonus.ly/careers) | Boulder, CO | Values & Tech focused interview - Process: 30 minute with HR, 45 minute Google Meet interview with 2 team members, ~2-4 hour take-home project, on-site interview involving 2 values-alignment interviews and 1 technical interview going over your take home project\n- [BookingSync](https://www.bookingsync.com/en/jobs) | Remote | Small takehome project, interviews over skype with team members.\n- [BoomTown](https://boomtownroi.com) | Charleston, SC / Atlanta, GA / Remote | Conversational in-person interviews with potential team members and managers that revolve around past experience and how that could be applied to future work\n- [Botika](https://botika.ai) | San Marino, RSM | View code, projects, libraries or any other open source story that you have been a part of, take-home project followed by on-site face-to-face walkthru of your code focusing on decisions/reasoning/technology used.\n- [Bouvet](https://www.bouvet.no) | Bergen, Norway | Pair programming with senior engineers\n- [brainn.co](https://brainn.co) | São Paulo, BR | Zoom/On-site interview, take-home project and interview with a team leader.\n- [BrainStation-23](https://brainstation-23.com) | Dhaka, BD | A practical project followed by series of in-person interview sessions\n- [Bramble](https://www.brmbl.io) | Remote | Slack interview, take home test, pairing, culture-fit interview.\n- [Breather](https://breather.com/jobs) | Montreal, Canada | Series of interviews including a conversation about the candidate’s experience and a technical discussion involving real world problems\n- [BrightBytes](http://www.brightbytes.net/careers) | San Francisco, CA | Time-boxed coding exercise at home and on-site pair programming with engineers\n- [BrightHR](https://www.brighthr.com/careers) | Manchester, UK | Telephone conversation, coding exercise at home, on-site pairing with a cultural interview, meet the team.\n- [brightwheel](https://angel.co/brightwheel/jobs) | San Francisco, CA | Take home exercise, and systems design.\n- [Broad Institute's Data Sciences Platform](https://www.broadinstitute.org/data-sciences-platform) | Cambridge, MA | Phone screen, small take home project, both a technical and non-technical discussion panel, and a panel following up on the take home project walking through the solution and making a modification to the original code\n- [Broadlume](https://apply.workable.com/broadlume/) | New York, NY / Remote | Intro phone call with HR, second conversation with Broadlume engineer, and final pairing interview with Broadlume engineer over a screenshare\n- [Brooklyn Data Co](https://www.brooklyndata.co) | Remote | Zoom interview, take-home project followed by technical interview with ICs with opportunities to discuss the project, interview with team leaders.\n- [BrowserStack](https://www.browserstack.com/careers) | Mumbai, India; Dublin, Ireland | Initial phone screen with semi-technical questions, two 2-hour assignments based on real problems solved in company (allowed to lookup internet), final interview with EMs/Director.\n- [BRYTER](https://www.bryter.com/careers) | Remote | Initial 30min video call for getting to know each other, one 90min technical interview where you talk about one relevant previous project and we then dive deeper together (no pairing session or any other kind of exercise), second 90min interview where we ask questions around giving/receiving feedback and your ability to build relationships in remote setting, two final calls with people lead and then founder.\n- [btw](https://www.btw.so) | Remote/ Singapore, Singapore / Bangalore, India | Initial phone screen for cultural round, optional take-home assignment, two rounds of video interviews (1-2hrs) discussing through previous projects and technical stack\n- [Bubblin Superbooks](https://bubblin.io) | Remote | View code, projects, libraries or any other open source story that you have been a part of, a small take-home project with real code occasionally.\n- [Buffer](https://buffer.com/journey) | Remote | Interviews over video call, code walkthrough of real code focussing on decisions and reasoning, then a 45 day full time, fully paid contract project working on production code.\n- [Bugcrowd](https://www.bugcrowd.com/about/careers/) | San Francisco, CA / Sydney, NSW | Take home exercise, half-day onsite walking through code, and pair programming.\n- [Buildkite](https://buildkite.com/home) | Remote | No CV required. Anonymized writing assessments. Video chat with founder and future team member about you, the job, and the company. Last video chat is a pair programming for technical roles or more in-depth chat for non-technical roles. Offer.\n- [Busbud](https://www.busbud.com/en/careers) | Montreal, Canada | Phone screening, followed by a 2-4 hours take home assignment. If the challenge is a success, on-site or remote interview with team members, including someone who reviewed it, to talk about it and potential next steps if the challenge was a real life task.\n- [Bustle](https://jobs.lever.co/BDG?department=Product&team=Engineering) | New York City, NY / Remote | Half day pair programming on a task for production or one of our Open Source projects. We'll also buy you lunch with the team.\n- [busuu](https://www.busuu.com/jobs) | London, UK | Video call to show real code as first stage. In office pair programming, white board real world problem that we've encountered before, and history/experience discussion.\n- [ButterCMS](https://buttercms.com) | Chicago, IL; Remote | Take home exercise and half-day of pair programming\n- [ByBox](https://www.bybox.com/company/careers/) | Remote | Phone interview followed by interview with devs (ideally in person but sometimes Skype) covering technical experience and coding exercise with real code.\n- [BYU OIT](https://byu.edu) | Provo, UT | Take home programming challenge. Discussion in the interview about solution, among other normal hiring questions.\n- [Cabify](https://cabify.careers/en/) | Remote | First a phone screening with the recruiter to talk about your past experiences and the take-home assignment, then you will receive a take home project to deliver within 2 weeks and finally a zoom interview to talk about your project's solution and some other questions about decision making and company values.\n- [CACI Rome](https://careers.caci.com/ListJobs/All/Search/location/rome/state/ny/country/us) | Rome, NY; Remote | Phone interview followed by in-person or Skype screen sharing interview with a coding exercise in either Java, web (Node.js + frontend), or both. Interview format is exclusive to the Rome, NY office and may not be shared by other regional CACI offices.\n- [Cake DeFi](https://boards.greenhouse.io/cakedefi) | Remote; Central, Singapore | Initial HR interview, followed with technical lead interview with take home projects relevant to work, and finally cultural interview.\n- [Calendly](https://careers.calendly.com) | Remote; Atlanta, GA; Austin, TX | Initial phone screen followed by a panel interview primarily focused on a low-stress and real world set of problems.\n- [Capgemini UK Java Team](https://www.capgemini.com/gb-en) | London, UK; Woking, UK; Bristol, UK; Cardiff, Wales; Birmingham, UK; Manchester, UK; Leeds, UK; Rotherham, UK; Liverpool, UK; Newcastle, UK; Edinburgh, Scotland; Glasgow, Scotland | Technical telephone interview (30 minutes), take-home non-CompSci coding exercise (3-4 hours), face-to-face role-played consulting scenario involving a solution architecture and a delivery plan (two hours)\n- [Caravelo](https://www.caravelo.com/careers) | Barcelona, Spain | Take home project, then technical discussion about the code in-person or Skype and hang out with the team.\n- [Careera](https://careera.io) | Singapore, Singapore | Video/phone interview, code review\n- [CARTO](https://www.carto.com/careers/) | Madrid, Spain | Phone screen, take-home project, team code review/interview, hiring manager interview\n- [Casetext](https://casetext.com/jobs) | San Francisco, CA | Submit code sample for review/discussion, contract for one full day (paid)\n- [CASHLINK](https://cashlink.de) | Frankfurt, Germany | Skype/phone interview, take-home project\n- [Causeway](https://www.causeway.com/content/opportunity) | United Kingdom, India | Skype or Telephonic discussion on approaches and experience in regards to solve projects related work, then face to face round to write small solutions to common problems in related field.\n- [Chama The App](https://chamatheapp.bamboohr.com/jobs/) | Amsterdam, The Netherlands | Cultural fit interview, home test, technical interview with the team and then interview with the leadership\n- [Chargify](https://chargify.com/jobs) | San Antonio, TX / Remote | Take-home project & pair on a problem similar to daily work\n- [Checkout 51](https://checkout51.com/jobs) | Toronto, Canada | Phone conversation (15-20 minutes) followed by on-site pair programming and discussion focused on understanding decisions made during on-site work\n- [Checkr](https://checkr.com/company/careers) | San Francisco, CA / Denver, CO / Orlando, FL / Remote | 1 hour CoderPad problem, if pass, then four 1 hour interviews: API Design using your computer and languages, Refactoring in language of your choice, Object Design (no coding), System Architecture (no coding) and sometimes a 30 minute manager chat [read more](https://medium.com/checkr/an-engineers-guide-to-interviewing-at-checkr-fc28f9e8014b)\n- [Chef](https://www.chef.io/careers) | Seattle, WA / Remote | Take home small project testing the ability to implement real world problems. Phone/Zoom interviews discussing the said project. Checking if the candidate would be a good cultural fit.\n- [Chesapeake Technology](http://ctic-inc.com/careers/) | Denver, CO / Santa Barbara, CA / Camarillo, CA / Dulles, VA / California, MD / Remote | Phone screen (30 minutes), take home at leisure question based on real development followed by in person review of solution and general technical questions with actual team and opportunity for you to ask questions and provide feedback ( 2-3 hours)\n- [CHG-MERIDIAN](https://www.chg-meridian.com) | Weingarten, Germany | Face-to-face or video interview with our IT manager and human resources. Spend half a day at our headquarters and get to know the team, chat about current projects, etc., and finish up with having lunch together.\n- [CI&T](https://ciandt.com/us/en-us/careers/open-positions) | New York, NY / London, UK / Tokyo, Japan / Campinas, Brazil / Shanghai, China / Medellín, Colombia / Lisbon, Portugal / Melbourne, Australia / Remote | Video screening followed by a technical interview focusing on software engineering skills and finally, a feedback interview with the hiring manager.\n- [CircleCI](https://circleci.com) | San Francisco, CA / Remote | Take-home project and discussion, followed by on-site interview that includes pair programming on actual CircleCI bugs/feature requests.\n- [City of Boston's Analytics Team](https://boston.gov/analytics) | Boston, MA | Take-home project and in-person or phone/Skype interviews\n- [City of Philadelphia's Office of Open Data & Digital Transformation](https://beta.phila.gov/departments/office-of-open-data-and-digital-transformation/jobs) | Philadelphia, PA | Take-home project\n- [Civis Analytics](https://www.civisanalytics.com/careers) | Chicago, IL | Take-home project and discussion via Skype, followed by pair programming exercise\n- [CJ Affiliate](https://www.cj.com/careers) | Los Angeles, CA & Westlake Village, CA | Phone coding design exercise (no algorithms), followed by an on-site final interview that includes pair programming on a realistic object-oriented design problem\n- [Clara Lending](https://clara.com/careers) | San Francisco, CA | Phone conversation around technical background and experience, followed by take-home project, pair programming and discussion\n- [Clarisights](https://careers.clarisights.com) | Bangalore, India / Remote | Culture fit Interview, Basic Tech Round, Design Interview\n- [ClickMagick](https://www.clickmagick.com) | Austin, TX / Remote | Phone conversations and examples of Free Software/Open Source work\n- [Clippings](https://clippings.com) | Sofia, Bulgaria | Video screening first, then send us code they've recently wrote, then technical interview. We could ask questions about the code they wrote at home.\n- [Clockwork Consulting](https://www.cwconsult.dk) | Copenhagen, Denmark | Interviews, discussion of technical background and experiences.\n- [Close](https://www.close.com/careers) | Remote | Interviews and take home project.\n- [Cloud Consultants](https://cloudconsultants.ch) | Zurich, Switzerland; Remote | Phone interview, followed by the submission of a use case resolution to evaluate the problem solving skills.\n- [CloudBees](https://cloudbees.com/careers) | Remote | Multiple interviews, discussion of technical background and experiences.\n- [ClusterDev](https://clusterdev.com/#careers) | Kochi, India; Remote | Phone interview, Take home project and discussion later on about past experiences and/or personal projects.\n- [Code Orange](https://code-orange.nl) | Amsterdam, Netherlands | Phone conversation followed by take-home project\n- [Cogent Labs](https://www.cogent.co.jp) | Tokyo, Japan | On-site or video call conversation around technical background and experience, followed by take-home project that resembles a problem Cogent Labs solves for. This project will serve as the base of discussion with the developers for the second interview.\n- [Cognitran](http://www.cognitran.com/employment-opportunities) | Essex, UK / Szczecin, Poland / Detroit, MI | Skype/phone interview followed by pair programming.\n- [Colearn](https://kelas.colearn.id/career) | Remote; Bengaluru, India; Jakarta, Indonesia; Abu Dhabi, UAE; Central, Singapore | Alignment call with HR or CTO, small take home assignment, remote pair programming session about the assignment with senior engineer & tech lead.\n- [Collabora](https://www.collabora.com/careers.html) | Cambridge, UK / Montreal, Canada / Remote | On-site or video interview, discussion of technical experience and sometimes approach for tackling a hypothetical problem.\n- [Colonist](https://colonist.io/contribute.html) | Remote | Call->Solve real product coding assignment\n- [combyne](https://combyne.com) | Remote / Munich, Germany | Short online technical test, 4-hour take-home project, and culture fit interview with members of the team.\n- [Comcast India Engineering Center](https://corporate.comcast.com) | Chennai, India | Easy-Medium Technical questions asked by Senior Engineers, Hiring Manager Round, HR Interview, Offer Letter\n- [COMPEON](https://www.compeon.de/karriere) | Duesseldorf, Germany | Phone interview, followed by onsite discussions and pair programming with our developers\n- [Concordia Publishing House](https://about.cph.org/careers.html) | St Louis, MO | Take-home project followed by discussion of it on-site with future teammates.\n- [Condé Nast International](https://condenastinternational.com) | London, UK | Phone interview, 2 hour take-home project, and on-site with discussion of project, experience, and general technical questions.\n- [Contactlab](http://contactlab.com/en/careers) | Milan, Italy | Recruiter interview, tech interview (technical background and experiences), both on-site.\n- [Container Solutions](https://container-solutions.com) | Remote; Berlin, Germany; Amsterdam, Netherlands; London, UK | Unbiased process in a nutshell: chat with one of our recruiters, skills assessment and tech assessment, personality assessment which is followed by an interview with one of our occupational psychologists to discuss results. At the end a panel interview.\n- [Contentful](https://www.contentful.com/careers) | Berlin, Germany & SF, USA | Multiple interviews, discussion of technical background & live coding challenge (you can use the internet).\n- [ContentSquare](https://www.contentsquare.com/careers) | Paris, France | Real-world challenges with open discussions.\n- [Contino](https://www.contino.io/join-us) | London, UK; New York, USA; Sydney, Australia | Intro call, remote pair programming interview (Your IDE, your language, no code challenges), An open discussion on experience and technical background\n- [ConvertKit](https://convertkit.com/careers) | Remote | Fully remote job in USA and EMEA timezones with interview process starting with a written application, phone screen, short 2-hour coding and writing assignment, technical interview about assignment and culture contribution interview.\n- [Convious](https://www.convious.com) | Vilnius, Lithuania | Intro interview (video call), followed by a homework assignment, followed by a bit more technical interview discussing homework, technical background, etc. Homework feedback is always provided.\n- [Cookpad](https://cookpad.com/us) | Tokyo, Japan; Bristol, UK | Interviews, discussion of technical background and experiences, remotely pair with devs.\n- [Coorp Academy](https://www.coorpacademy.com) | Paris, France | Technical interview as an open discussion\n- [Cortlex](https://careers.cortlex.com) | Vilnius, Lithuania | Non-technical screening call with recruiter, then online interview with experience based technical questions\n- [Cosium](https://www.cosium.com) | Versailles, France | Phone screen, take-home coding challenge, remote or on-site technical interview starting with a quiz about tech fundamentals that often leads to an open discussion.\n- [Cossack Labs](https://www.cossacklabs.com/job/) | London, UK / Kyiv, UA / Remote | Initial screening video call, technical take-home challenge, technical interview with the team about real-world tasks and candidates' day-to-day work (programming, networking, OS, SSDLC, security).\n- [CoverHound, Inc.](https://www.coverhound.com) | San Francisco, CA | Open technical discussion, short on-site coding challenge.\n- [Cox Enterprises](https://jobs.coxenterprises.com/home-technology/) | Atlanta, GA; Remote | First-round behavioral interview with Engineering Lead, second-round technical discussion with the dev team\n- [COYO](https://www.coyoapp.com) | Hamburg, Germany | Exemplary take home project in different front- and backend flavors, followed by tech interview & meet the team\n- [Cquence](https://angel.co/company/cquence-app/jobs) | Remote | Phone screen, take-home coding challenge, collaborative technical interview, and behavioral interview.\n- [Creditas](https://boards.greenhouse.io/creditas) | Curitiba, Brazil | Phone conversations about the company and the opening; remote and on-site team interviews (tech-focused); take-home programming exercise\n- [Crownstone](https://crownstone.rocks/jobs) | Rotterdam, Netherlands | Technical interaction using previously created GitHub projects, followed by in-person interview with a focus on someone's professional ambition in the short and long term.\n- [cube19](https://www.cube19.com/work-with-us/) | London, UK | Take-home project, then an on-site discussion about the code and previous experience.\n- [Cultivate](https://cultivatehq.com) | Edinburgh, UK | 30 minute pair-programming screening interview on a simple exercise (remote or in-person). Half day pair programming, with 3 or 4 different team members plus informal chat, typically on-site.\n- [Culture Foundry](https://www.culturefoundry.com) | Austin, TX | Paid take-home project\n- [CurrencyTransfer](https://www.currencytransfer.com) | London, UK & Remote | Take-home project\n\n## D - F\n\n- [Dare](https://www.dare.global/careers/) | London, UK | Phone screen, On-site (or remote) pair programming and architecture discussions\n- [Data Theorem](https://www.datatheorem.com) | Palo Alto, CA; Paris, Fr; London, United Kingdom; Remote | Phone interview, then a take home project and finally in-person interview.\n- [DataChef](https://DataChef.co) | Amsterdam, Netherlands | Video call (technical questions about candidate's achievements), take home assignment, cultural fit zoom or face to face with rest of the team.\n- [DataMade](https://datamade.us) | Chicago, IL | After submitting an application, selected applicants are moved on to a round of interviews and will be asked to submit a piece of code for review. If you don’t have any code you can share, DataMade will provide a short exercise for you to complete. An in-person (or remote) interview will be scheduled to go over your background, what draws you to DataMade, and your code sample.\n- [Datascope](https://datascopeanalytics.com/careers/) | Chicago, IL | Take home exploratory data project with public data, discussion about the project via video chat, and in-person office visit.\n- [Def Method](https://www.defmethod.com) | NYC, NY | Take home test, pair programming with dev on test and client work, receive offer same day as pairing interview\n- [Delivery Center](https://deliverycenter.gupy.io) | Rio de Janeiro, Brazil & Remote | Interviews with the team about the company and the opening, with a short take-home project using their main stack.\n- [Delivery Much](https://carreiras.deliverymuch.com.br) | Florianópolis, Brazil & Remote | On-site (and/or remote) interviews about the company and the opening, with a short take-home project for leveling.\n- [Dentolo](https://angel.co/dentolo) | Berlin, Germany | Phone interview with the HR department, take-home project and technical interview to discuss your skill set + general questions\n- [Deskbookers](https://www.deskbookers.com/en-gb/jobs) | Amsterdam, Netherlands | Phone screen, take-home project, on-site interview\n- [DeSmart](https://www.desmart.com) | Gdynia, Poland | Technical interview, take-home project and talk about your experience\n- [Despark](https://despark.com) | Sofia, Bulgaria & Remote | Culture add interview, sample code review and paid pair programming with team member or take-home project.\n- [Detroit Labs](https://www.detroitlabs.com/careers) | Detroit, MI | Our technical interview starts with a take-home assignment that we will look at during the interview. You'll walk us though your thought process, add functionality if applicable to the interview, and talk about your experience. We believe that showing us your work in a practical setting is more telling of your abilities and what you will bring to the table, than writing code on a whiteboard.\n- [DEV](https://jobs.dev.to) | Remote | Written application, job-specific questionnaire and/or task, team interviews (total interview time under two hours)\n- [DevBoost](https://devboost.com/karriere) | Dresden, Germany | On-site get-to-know interview, on-site pair-programming and discussion\n- [Development Seed](https://developmentseed.org/careers) | Remote / Washington, DC / Lisbon, Portugal / Ayacucho, Peru | Introductory discussion; in-depth technical video interview (no whiteboard, and no live coding); mission & values video interview; onsite (or remote) 1 or 2 days paid working \"sprint\" in the context of a real project, culminating in a brief presentation of completed sprint work\n- [Devfolio](https://devfolio.co) | Bangalore, India; Remote | Phone call, followed by a small take home problem. Finally a F2F or Zoom pair programming session\n- [DevsData](https://devsdata.com) | New York, NY; San Francisco, CA; Warsaw, Poland; Frankfurt, Germany; Remote | Video interview, 3-hours take-home assignment, technical video interview\n- [DG-i](https://www.dg-i.net) | Cologne, Germany | Take-home project and/or discussion on-site about past experiences\n- [DICE](https://www.dice.se) | Stockholm, Sweden | Take-home project and code review at the on-site\n- [Digia](https://digia.com/en/careers/) | Helsinki, Finland | Behavioral interview and a technical discussion to chat about design patterns and other matters regarding the position. Both stages through Microsoft Teams.\n- [Digitally Imported](https://www.di.fm) | Denver, Colorado & Remote | Video meetings on past experience and high level tech questions, take-home project\n- [DigitalService](https://digitalservice.bund.de/en/career) | Berlin, Germany | Initial screening call with HR and Engineering Manager, take-home challenge or bring your own project, discussion about solution/project and past experience with two engineers, culture fit interview.\n- [Dixa](https://dixa.com/careers) | Copenhagen, Denmark | Initial phone call. Take-home programming task, then on-site discussion followed by online personality test\n- [Doctolib](https://about.doctolib.fr/jobs) | Paris, France; Berlin, Germany | Take-home project, on-site interview and work half a day with one of our feature team\n- [Doist](https://doist.com) | Remote | Personal interviews with part of the team and a takehome programming assignment.\n- [Dollar Shave Club](https://www.dollarshaveclub.com) | Venice, California | Phone interview, take-home projects, on-site interview\n- [door2door](https://door2door.io) | Berlin, Germany | Take home challenge + on-site interview + trial day\n- [Double Nines](https://doublenines.co) | Remote | Initial screening call with recruiter, culture/vibe conversation with engineering leadership, and a technical interview where you bring a recent project you've worked on to present and answer questions about architectural/strategic decisions as well as show code you've written.\n- [Draft Fantasy](https://docs.google.com/document/d/1fC_-liTPpYQOoE_5iKj0O3AwSdPggQGnOsjUKahfbkQ/edit?usp=sharing) | Tel Aviv, Israel | Talk about past experience and what the developer has actually built as well as pair programming or a programming exercise.\n- [Draftbit](https://draftbit.com) | Remote | Phone screening, take-home assignment based on an old project; pair programming and interview with team members\n- [Drawbotics](https://www.drawbotics.com/en/join-us) | Brussels, Belgium | Take-home project, bootcamp on-site\n- [drchrono](https://www.drchrono.com/careers) | Mountain View, CA | Hackerrank test (but not CS trivia, it's real product problems) & on-site/take-home project w/ presentation\n- [Drivy](https://www.drivy.com) | Paris, France | Phone screening followed by a take-home assignment, \"Resume\" interview, technical interview, product interview, interview with another team, finalizing the hire\n- [Drizly](https://www.drizly.com) | Remote | Phone screen, Blind take-home assignment, hiring manager interview, technical code pair interview, panel interview with sales, product, engineering and other stake holders.\n- [DroneDeploy](https://www.dronedeploy.com/careers.html) | San Francisco, CA | Pair program on a problem similar to daily work\n- [DroneSeed](https://www.droneseed.co/jobs/) | Seattle, WA | Take home assignment of a real problem we've worked on, group code review in subsequent interview.\n- [dubizzle](https://apply.workable.com/bayutdubizzle/#jobs) | Dubai, UAE; Sindh, Pakistan; Cluj County, Romania | Take home assignment, general technical questions, pair programming with engineers or tech leads\n- [DuckDuckGo](https://duckduckgo.com/hiring) | Remote | Up to two paid projects and video call interviews.\n- [Easy Taxi](http://easytaxi.com.br) | São Paulo, Brazil | Take-home project, interview to evaluate the candidate's previous experience.\n- [EatSleepRIDE](https://www.eatsleepride.com) | Toronto, Canada | Interview with CTO to discuss current experience/projects. Take home assignment. Behavioral interview with rest of the team.\n- [Eaze](https://eaze.com/careers) | San Francisco, CA | Take home project, on-site interview building off of the project\n- [eBay Kleinanzeigen](https://careers.ebayinc.com/join-our-team/start-your-search/find-jobs-by-location/detail/germany) | Berlin, Germany | 45 mins technical phone interview, take-home project/review, on-site interview including pair programming with team lead and agile interview with product manager.\n- [Ecaresoft](https://careers.ecaresoft.com) | Monterrey, Mexico | Cultural fit session and Predictive Index test with recruiter, best piece of code review and technical interview with engineers\n- [Echobind](https://echobind.com/culture) | Boston, MA; Remote | Meet the entire team, share examples of previous work and pair with one team member\n- [Edenspiekermann](https://jobs.edenspiekermann.com) | Amsterdam, Netherlands / Berlin, Germany / Los Angeles, CA / San Francisco, CA / Singapore, Singapore | On-site chat about skills and past experiences, review some code samples or a take-home assignment\n- [EF Education First](https://careers.ef.com) | London, UK; Boston, MA | Short phone interview, take-home project, discussion of project and real world engineering problems, meet the team.\n- [Efishery](https://efishery.darwinbox.com/ms/candidate/careers) | Bandung, Indonesia | Phone interview, HR Interview, take-home assignment, Presentation about the take home assignment and approach used, User Interview, Salary Negotiation.\n- [Eidu](https://eidu.com) | Berlin, Germany | Take-home project, discussion of results with team, and test days with pair programming\n- [El Niño](https://www.elnino.tech) | Enschede, The Netherlands; The Hague, The Netherlands | On-site chat about the candidate experience and the company followed by a trial day relevant for the role.\n- [El Passion](https://www.elpassion.com) | Warsaw, Poland | Take-home project, interview to 1) discuss delivered solution and 2) previous projects\n- [Electric Pulp](https://www.electricpulp.com) | Sioux Falls, SD, USA | Phone interviews with leadership team and technical team leads. We are a tight knit team, so emphasis on a great personal fit is as important as technical prowess.\n- [Elements Interactive](https://www.elements.nl/careers) | Almere, The Netherlands & Barcelona, Spain | Take-home project & discussion via Skype or on-site\n- [Ellucian](https://www.ellucian.com/About-Us/Careers/) | Reston, VA, USA | Discussion of real world problems (from resume, if possible)\n- [elmah.io](https://elmah.io) | Aarhus, Denmark / Remote | Discussion about code and looking at hobby projects (if any)\n- [Elvie](https://www.elvie.com) | London, England | Discussing real code, pairing and a paid day to see how you work with the team. No coding for free or time-restricted take-home projects, code challenges or abstract algorithm tests\n- [eMarketer](https://goo.gl/N7SMKl) | New York, NY | Short phone interview, then come in and meet the team, check out our space, and have a discussion with team members about real-world problems\n- [Emarsys](https://www.emarsys.com) | Budapest, Hungary | Take-home project (small, 1-2 days to solve), then discussion on-site\n- [Emergent Software](https://www.emergentsoftware.net) | Minneapolis, MN | Phone intro, discuss recent project, short take home project (4h max) with code review, real world open ended questions\n- [End Point Dev](https://www.endpointdev.com) | New York, NY; Johnson City, TN; Remote | Video interview with senior technical management followed by 2-hour scheduled take-home project similar to work done for our clients.\n- [Endava](https://www.endava.com/en/) | Belgrade, Serbia; Bucharest, Romania; Chisinau, Moldova; Cluj-Napoca, Romania; Iasi, Romania; Pitesti, Romania; Skopje, Macedonia; Sofia, Bulgaria; Frankfurt, Germany; Glasgow, Scotland; Hilversum, Netherlands; London, UK; Oxford, UK; Bogota, Colombia; Atlanta, GA; New Jersey, NJ; New York, NY | On-site discussion about previous experience and technical questions about the target technologies.\n- [Engel & Völkers Technology](https://www.engelvoelkers.com/en/tech/) | Hamburg, Germany | Remote technical interview with an Engineering Manager, followed by a practical coding challenge implemented in 5 hours, ending with a technical discussion with the team on the produced code either remotely or on-site based on geographical practicality.\n- [Enhancv](https://enhancv.com/about.html) | Sofia, Bulgaria | Talk is cheap, show us your code: github profile or other project examples. Explain them in person / remotely. Discuss habits and interests to see if we have a culture fit.\n- [Enigma](https://www.enigma.com) | New York, NY | 2-part takehome project, followed by a pair programming exercise\n- [Enki](https://enki.com) | London, UK | Skype/phone interview followed by takehome project\n- [Equal Experts](https://www.equalexperts.com) | London, UK; Manchester, UK; New York, NY; Pune, India; Lisbon, Portugal; Calgary, Canada | Fizzbuzz test done at home followed by Pair Programming session at office and finally face to face technical and attitude interview.\n- [Ericsson](https://www.ericsson.com) | Dublin, Ireland | Skype/phone interview followed by Face 2 Face interview, discussions and architecture questions followed by final small project on a problem similar to daily work.\n- [eShares, Inc](https://esharesinc.com/jobs) | San Francisco, CA; Palo Alto, CA; Seattle, WA; Rio de Janeiro, Brazil; London, UK; New York, NY | Phone call, practical technical screen, on site to meet the team & explore the company\n- [Espeo Software](https://espeo.eu/career) | Poznań, Poland | 30 min HR interview, 1 hour technical interview, 1 hour soft skills interview\n- [Etermax](https://etermax.com/en/careers/) | Buenos Aires, Argentina | Skype/phone screen with two engineers & HR, 30 min HR onsite interview, 2 hour onsite pair programming session (with focus on testing and design) with feedback\n- [Etix Everywhere](https://www.etixeverywhere.com/en/job-offers) | Luxembourg City, Luxembourg\n- [EURA NOVA](https://euranova.eu) | Mont-Saint-Guibert, Belgium; Marseille, France; Tunis, Tunisia | attitude interview, unpaid take-home project, technical discussion with 1 or 2 technical employees (remote or face 2 face), face 2 face discussion with HR, partner, and technical staff to have a foretaste of the collaboration\n- [Euro Payment Group](http://www.europaymentgroup.com) | Frankfurt, Germany | Take-home project followed by face to face interview\n- [EWORX](https://eworx.gr/jobs) | Athens, Greece | Take-home project and discussion.\n- [Exmox](https://exmox.com/career) | Hamburg, Germany; Remote | Video call with our CTO, then a technical discussion around a project of your choice or a take-home project.\n- [Exoscale](https://exoscale.ch) | Lausanne, Switzerland | Take-home project. Discussion and presentation. Then entire team meet.\n- [Extend](https://www.extend.com/careers) | San Francisco, CA; Dallas, TX; Remote | Phone call, a take home project similar to making a PR at work, then a meet & greet with the team.\n- [Eyevinn Technology](https://www.eyevinntechnology.se) | Stockholm, Sweden | Remote or face 2 face interview followed by take-home project. Then a discussion on-site where we go through the technical aspects of the project.\n- [F(x)](https://fdex.com.br) | São Paulo, Brazil | Skype interview, Take-home project and onsite interview to evaluate the candidate\n- [Facebook (Front End Engineer)](https://www.facebook.com/careers/jobs) | Tel Aviv, Israel; London, UK; US: Menlo Park, CA; Seattle, WA; Washington, DC | Initial phone code interview, then on site interview (or remote when not possible) with code and design / architecture interviews. All questions are based on actual problems the company has solved in the past.\n- [Facile.it](https://jobs.facile.it) | Milan, Italy; Cagliari, Italy; Remote | Initial call/Skype interview with HR. Tech interview about OOP concepts, HTTP and REST API design questions with 2 engineers. Brief talk with VP of Engineering or CTO.\n- [Fairwinds](https://fairwinds.com/careers) | Remote | Start with a brief talk with CTO or VP of Engineering, take home coding challenge, then remote interviews with several people on the engineering team\n- [Falcon.io](https://www.falcon.io/jobs/) | Copenhagen, Denmark | Initial call/Skype culture interview. Take-home tech assignment (game) and code review. On-site Interview about your experience and meeting the team.\n- [FastBill](https://www.fastbill.com/jobs) | Frankfurt, Germany | Initial interview via Skype/Zoom. Small tech-home project based on the specific job. Afterwards code review and technical discussion.\n- [FATMAP](https://www.fatmap.com) | London, UK; Berlin, Germany; Vilnius, Lithuania | Skype discussion, Take-home project, Face to face\n- [Fauna](https://fauna.com) | San Francisco, CA / Remote | Take home project, then follow up with interviews on-site or remote. Interviews are both technical and non-technical. Technical interviews comprehend the scope of the home project.\n- [Fetch Rewards](https://boards.greenhouse.io/fetchrewards) | Remote | Short take-home project. 50 min screening interview that includes discussion of project. 5.5 hr (w/ breaks) final interview that involves speaking with your future manager and a non-technical product manager, a real-world coding problem, and high-level and low-level system design problems.\n- [Field 33](https://field33.com/jobs) | Berlin, Germany | Video call interview followed by a take home project over a 3 day duration chosen by the candidate with hours spent up to the candidate. The project is tailored to the position and skill level of the candidate and resembles a past real-life problem encountered at our company. Solution is discussed in a ~30min call.\n- [Filestage.io](https://careers.filestage.io) | Stuttgart, Germany; Remote | Intro call, Take home technical assessment, Tech discussion on assessment and interview with Head of Development and an Engineer, Meeting with founders\n- [Findy](https://careers.findy.co.jp) | Tokyo, Japan | Tech interview + On-site discussion\n- [FINE](https://www.wearefine.com/careers) | Portland, OR | Small take-home challenge + follow-up discussion\n- [FireHire](https://firehire.ai) | Wilmington, USA / Remote | Soft Skills Check + Hard Skills Check with lead engineer.\n- [Firemind](https://www.firemind.io) | Maidstone, UK; London, UK; Remote | Small pre-interview challenge on github + discussion face to face in person or via video\n- [Fitbot](https://thefitbot.com/careers.html) | Boulder, CO | Pairing & writing code with the founders for a few hours\n- [Flatfox](https://flatfox.ch) | Zurich, Switzerland | Informal conversation to check mutual fit, small (4h) take-home assignment, discussion in team\n- [Flower Labs](https://flower.ai) | Cambridge, UK; Berlin, Germany; Remote | Reach out to us by email or on Slack with your CV. You'll receive a written interview which should take 15min to 30min to complete, after which we'll schedule at most 2x technical video interviews with a potential take-home assignment in between. Alternatively, you share the Open-Source code you have written so we can discuss that.\n- [Fluidly](https://fluidly.com) | London, UK | Casual 30min phone call. ~1hr take home tech exercise (not pass or fail). 1 stage onsite interview - discussion about experience, 1 hour pair programming on the real code base, then your turn to interview us!\n- [Fold](https://fold.money) | Bangalore, India; Remote | Phone call, followed by a small take home problem. Finally a F2F or Zoom pair programming session\n- [Fonoa](https://www.fonoa.com/careers) | Remote | Phone call, async questions regarding expectations and past experience, interview regarding communication and principles, async work sample, interview and AMA with CTO, interview with one of the founders\n- [Food52](https://food52.com/jobs) | New York, NY; Remote | Take-home project, discussion on-site or remote, interviews with both technical and non-technical staff\n- [Fooji](https://fooji.com) | Lexington, KY; Remote | Take-home project\n- [Form3](https://www.form3.tech/careers) | Remote | Preliminary call, take-home project, three stage interview (code review, technical assessment and debugging exercise)\n- [Formidable Labs](https://www.formidable.com/careers) | Seattle, WA; London, UK; Remote | Take-home project, remote pair programming, discussion on-site or remote\n- [Fortumo](https://fortumo.com/careers) | Tallinn, Estonia; Tartu, Estonia | After a 30-min call you get a simplified version of a task that has recently been a challenge for the engineering team\n- [Founders](https://founders.as/joinus) | Copenhagen, Denmark | Take Home project + Interviews\n- [Foundry Interactive](http://www.foundryinteractive.com/contact) | Seattle, WA | On-site or remote discussion, paid trial project with pairing and code reviews\n- [fournova](https://www.fournova.com/jobs) | Remote | Take-home project, discussion via video call\n- [Fourthwall](https://jobs.fourthwall.com) | Poznan, Poland; Remote | Paid take home, simple project. One technical interviews (how to build, solve specific, real world problem).\n- [Frappe](https://frappe.io/careers) | Mumbai, India; Remote | Take-home project, a short pair programming exercise, discussion and interview with members of the Engineering team.\n- [FreeAgent](https://www.freeagent.com/company/careers) | Edinburgh, UK | Take-home project, pair programming, discussion and interviews\n- [Freeletics](https://www.freeletics.com/en/corporate/jobs) | Munich, Germany | Small real-world challenge, multiple interviews on-site/remote and social gathering with team.\n- [Freetrade](https://www.freetrade.io/careers) | London, England | Initial hangout with fizz buzz style question followed by an on-site real world coding question and systems design conversation.\n- [FRIDAY](https://friday-jobs.personio.de) | Berlin, Germany | Take-home real-world challenge, interview on-site or remote\n- [Frontside](https://frontside.io/careers) | Austin, Texas | Phone interview with remote pairing session. Followed by in person pairing (paid for the day) and lunch with the team.\n- [Full Facing](https://www.fullfacing.com/vacancies) | Cape Town, South Africa | Take-home real-world challenge, interview on-site or remote\n- [Funda](https://www.funda.nl/vacatures) | Amsterdam, The Netherlands | Take Home test + Discussion On-Site/Remote\n- [FundApps](https://www.fundapps.co/about-us/join-our-team) | London, UK | Coffee with an Engineer; take-home kata; code review + on-site pair programming exercise.\n\n## G - I\n\n- [Garmin](https://careers.garmin.com) | Tucson, AZ | Non-technical phone screen, technical phone screen (questions about projects on your resume), in-person interview: programming an arduino, given 3 hours and a laptop with internet access\n- [Garner](https://www.garnercorp.com) | Toronto, Canada | step 1: online chat with hiring manager, step 2: at home assignment solving real-life problem, step 3: on-site pair programming with engineers, step 4: offer\n- [Gasket Games](https://www.gasketgames.com/work-with-us) | Vancouver, Canada | Non-technical phone screen, technical phone screen (open-ended questions), in-person interview / culture fit interview\n- [GatherContent](https://gathercontent.com/about-us) | Remote | Culture-first interviews, pair programming and remote, informal technical discussions\n- [Gcore](https://gcore.com/careers) | Remote | Non-technical screening, 2 hours technical and soft skills interview including architecture discussion\n- [Gemini](https://gemini.com/careers) | New York, NY | Phone chat. Take-home project, discussion on-site. Questions on prior experiences and culture fit\n- [GenUI](https://www.genui.com) | Seattle, WA | A short phone screen with questions regarding general knowledge related to the open position, then a half day pair programming interview.\n- [Geosite](https://www.geosite.io) | Remote | Phone chat -> Take home project resembling the team focus -> Discussion about takehome & culture fit.\n- [Ghost Inspector](https://ghostinspector.com/jobs) | Remote | Video interview, short (under 2 hour) take-home project, and team video interview\n- [Ginetta](https://jobs.ginetta.net) | Zurich, Switzerland; Braga, Portugal | Culture-first interviews, take home assignment that resembles a real-world problem we often solve, then discussion about the assignment in-person with pair-programming improvement sessions with our developers.\n- [GitHub](https://github.com/about/careers) | Remote; San Francisco, CA; Boulder, CO| Take-home exercise, code review and technical discussions.\n- [GitLab](https://about.gitlab.com/jobs/apply/) | Remote | A series of video calls, and a coding exercise involving working on a Merge Request that is like a real work task\n- [Glassdoor](https://glassdoor.com) | Remote; San Francisco, CA; Chicago, IL; Uniontown, OH | A series of video calls, some coding exercises involving real world problems (Styling a page with CSS, Using JavaScript to fetch data from an API and display on a page.\n- [Glints](https://glints.com/sg/inside/careers/) | Singapore, Singapore; Jakarta, Indonesia | Culture fit interview, take home assignment that resembles a real-world problem, walkthrough about the assignment\n- [GM Financial](https://gmfinancial.com/en-us/company/careers.html) | Irving, TX; Remote | Roles under [Marketing Technology team](https://globalcareers-gmfinancial.icims.com/jobs/search?ss=1&searchKeyword=Software+Development+Engineer&searchCategory=8741) are 100% remote and only have HR Screening + 2 rounds: 1st round: Technical conversation with an architect and a senior engineer regarding candidate's experience and how that matches up to the role. Final round: cultural/behavioral interview with hiring manager.\n- [Goalbook](https://goalbookapp.com/careers/) | Remote | Virtual interviews with recruiter, sr engineer, and hiring manager. Short real-world take-home project w/ follow-up conversation. Final interviews w/ CEO/Founder and Product team lead.\n- [GoCardless](https://gocardless.com/about/jobs) | London, UK | Project to work at home, general technical questions, pair programming with engineers\n- [GoJek](https://www.gojek.io) | Bangalore, India; Jakarta, Indonesia; Singapore, SG; Bangkok, Thailand | Take-home exercise, Pair programming with senior engineer, Technical problem solving and discussion, Cultural Fit\n- [Gower Street Analytics](https://gower.st) | Remote; London, UK | Initial telephone chat, then either a) work with us, fully paid, for a day on real code with the team; or b) pair-programming on a code kata with the team members for four pomodoros. Your choice.\n- [Graffino](https://www.graffino.com) | Sibiu, Romania | Take-home project, discussion on-site\n- [Grafton Studio](https://graftonstudio.com) | Boston, MA | Take-home project, discussion on-site\n- [Gram Games](https://gram.gs) | London, UK / Istanbul, Turkey | Initial interview -> Take home -> Take home discussion call -> On site code review and technical discussions\n- [Gramercy Tech](https://www.gramercytech.com) | New York, NY | Pair programming & discussion on-site\n- [grandcentrix](https://www.grandcentrix.net/jobs) | Cologne, Germany | Take-home project, discussion on-site\n- [Grape](https://www.chatgrape.com/jobs/) | Vienna, Austria / Remote | GitHub or code samples -> Pair programming -> Skype/phone interview\n- [Graph Digital](https://graph.digital) | London, UK | Initial screening call with Engineering Manager, take-home challenge or bring your own project, discussion about solution/project and past experience with two engineers, culture fit interview.\n- [Graphicacy](https://www.graphicacy.com) | Washington, DC | Phone interview; in-person or virtual interview depending on location and availability; two brief technical assignments focused on flexibility, creativity, and general competency\n- [Graphistry](https://www.graphistry.com) | San Francisco, CA; Remote | Discuss product/market, engineering, and culture, review past code/project, and for junior developers, choice of take home or code review.\n- [Great Minds, PBC](https://greatminds.recruitee.com) | Washington, DC | Zoom interview, technical interview discussing past real world experiences as well as knowledge of tools that will be used for position\n- [Gridscale](https://gridscale.io) | Cologne, Germany / Remote | Intro video call for open Q&A, followed by intro with hiring manager, team fit with the whole team plus a small real-world problem to solve, followed by final round with hiring manager and/or c-level/founder.\n- [Gruntwork](https://www.gruntwork.io) | Remote | Paid, take-home project with pair coding\n- [GTM Sportswear](https://gtmsportswear.com/careers) | Manhattan, KS / Remote | Remote pairing session, then a take-home test.\n- [Hacktiv8](https://hacktiv8.com) | Jakarta, Indonesia | Phone call for quick project & personal introduction followed by Video call interview with project owner for discussion about the project and general question on how the project should be solved.\n- [Happy Team](https://happyteam.io) | Warsaw, Poland; Remote | General technical questions, takehome paid exercise with feedback/discussion during implementation\n- [Happypie](http://www.happypie.com) | Uppsala, Sweden | Takehome exercise with code review after, in-person interview\n- [Harvard Library Innovation Lab](https://lil.law.harvard.edu/collaborate/) | Cambridge, MA | Take home project that mirrors work we might do on a [Sketch](https://lil.law.harvard.edu/sketches/) and follow up discussion after.\n- [Hash](https://www.hash.com.br/index.html) | Sao Paulo, Brazil | Take-home project and/or discussion (on-site or remote)\n- [Hashnode](https://hashnode.com/careers) | Remote | Phone/video call interview for quick personal introduction -> a take-home coding exercise based on real world example -> take-home task discussion -> culture fit session.\n- [Hashrocket](https://hashrocket.com) | Chicago, IL/Jacksonville Beach, FL | Remote pairing session, paid week pair programming with everyone on the team\n- [HeavenHR](https://heavenhr.com) | Berlin, Germany | Take home project based on the candidate's experience and future responsibilities. Then discussion about the solution\n- [HE:labs](https://helabs.com) | Rio de Janeiro, Brazil & Remote | Take-home project and discussion via Skype.\n- [HelloFresh](https://www.hellofresh.com/jobs) | Berlin, Germany | Take-home project, discussion via Skype or on-site\n- [Hero Digital](https://herodigital.com) | San Francisco, CA; Remote | Take-home project with code review, multiple (non-technical) interviews with different areas of the company about past projects and experience\n- [Heroku](https://heroku.com/careers) | Remote | Timeboxed independent project on GitHub, discussion/debrief of project via Hangouts, productionization discussion via Hangouts, \"meet the team\" meeting\n- [Hill Holliday](https://www.hhcc.com/careers) | Boston, MA | Take-home project on GitHub, in-person interview / culture fit interview\n- [Hinge Health](https://www.hingehealth.com/careers) | Portland, OR; San Francisco, CA; Seattle, WA; Austin, TX; Denver, CO; Montreal, Québec & Remote | Resume deep dive, take-home exercise on GitHub, (virtual) in-person including review of the take-home exercise (1hr), product collaboration, meet the team, and AMA with leadership\n- [Hireology](https://www.hireology.com/careers) | Chicago, IL; Remote | Walk through personal/work projects and discuss experience\n- [Hiventive](https://www.hiventive.com) | Pessac, France | Phone interview, home coding challenge, on-site interview with general programming questions, discussion of proposed solutions and personal experience.\n- [Holaluz - Platform Team](https://www.holaluz.com/en/work-with-us/) | Barcelona, Spain | Intro call with HHRR, Small tech test with Terraform and some technical and non-technical questions, Interview with manager, Interview with the Platform Team, Small chat interview with the CEO.\n- [HolidayPirates](https://holidaypirates.group/en/jobs) | Berlin, Germany | Take-home project, discussion via Skype or on-site\n- [HoloBuilder](https://www.holobuilder.com) | Aachen, Germany | Take-home project, discussion via Skype or on-site\n- [Hologram](https://www.hologram.io/careers) | Chicago, IL; Remote | Intro call, take-home project taken from production work, pair programming exercise\n- [Home Chef](https://www.homechef.com/careers) | Chicago, IL; Remote | Get-to-know-you meeting with the team, followed by a half-day collaborative coding session\n- [HomeLight](https://www.homelight.com/engineering) | San Francisco, CA; Scottsdale, AZ; Seattle, WA | Phone screen, take home that is close to production code, onsite with pair programming\n- [Hotjar](https://www.hotjar.com/careers/) | Remote | Short introduction call -> Technical interview with engineers on real-world problems/system design -> Paid short take-home task -> Team fit interview, EMEA timezones preferred\n\n- [Housemarque](https://housemarque.com) | Helsinki, Finland | Interview, take-home project, then interview and code review on-site\n- [HoxHunt](https://www.hoxhunt.com/careers/) | Helsinki, Finland | Take-home project, pair programming on-site\n- [Human API](https://humanapi.co/company/careers) | Redwood City, CA | Technical phone interview, then on-site pair programming and design discussion\n- [Humi Inc](https://humi.applytojob.com/apply) | Toronto, Canada | Interview, take-home project, then interview and code review on-site\n- [I|O](https://io.co.za/opportunities) | Cape Town, South Africa\n- [Icalia Labs](https://icalialabs.com) | Monterrey, Mexico | Pair programming, cultural fit session\n- [Ideamotive](https://ideamotive.co) | Warsaw, Poland & Remote | Take-home project, technical interview with developer\n- [IDEO](https://www.ideo.com/jobs) | San Francisco, CA; New York, NY; Chicago, IL; Cambridge, MA | Take home project that resembles a problem IDEO solves for, then pairing session in person or over video chat.\n- [ImmobilienScout24](https://boards.greenhouse.io/scout24) | Berlin, Germany | Take-home project, discussion on-site\n- [Impraise](http://jobs.impraise.com) | Amsterdam, The Netherlands | Take home test, real world pair programming\n- [Indellient](http://www.indellient.com/careers) | Oakville, Canada | Series of interviews both technical and non-technical\n- [Indiana Farm Bureau Insurance](https://jobs.infarmbureau.com/home-office) | Indianapolis, Indiana | series of interviews with team, followed by an interview with manager\n- [INEVITABLE](https://inevitableinnovations.com) | Manchester, UK | Take-home project, discussion on-site\n- [InfluxData](https://www.influxdata.com/careers) | San Francisco, CA & Remote | Technical and non-technical interviews, pair programming, with prospective manager and multiple prospective teammates\n- [InfoSum](https://www.infosum.com) | Basingstoke, UK | On-site unsupervised exercise & discussion.\n- [inKind Capital](https://inkindcapital.com) | Boulder, CO | Discussing real-world problems, pair programming, dinner & drinks with the team\n- [Inmar](https://www.inmar.com/careers) | Winston-Salem, NC; Austin, TX & Remote | Take-home project and conversation-style interviews\n- [Innoplexus](https://jobs.innoplexus.com) | Pune, India; Frankfurt, Germany | Take-home projects and On-site pair programming assignment.\n- [Innovia CoLabs](https://www.innoviacolabs.com) | Rochester, NY / Remote | Zoom interview with two to three engineers and you share projects/code you're proud of; only reviewing code you wrote yourself. Most of the interview is about culture fit and who you are as a person. There is a blog on the website that outlines the interview and will contact you prior to tell you exactly what the interview will be like.\n- [InstantPost](https://internshala.com/internships/internship-at-InstantPost) | Bangaluru, India | Remote assignment followed by Technical and Team round interview\n- [Integral.](https://www.integral.io) | Detroit, MI | 3-step process (100% remote): tech-screening with an engineer for 30 minutes, remote pair-programming and test driven development exercise for 1 hour, conversation with engineering leadership for 30 minutes.\n- [Intelipost](https://www.intelipost.com.br) | São Paulo, BR | Take-home project, on-site code review and presentation (skype available if needed), discussion involving real world problems and interviews with different teams\n- [Interfrog Produktion GmbH](https://interfrog.de/jobs) | Mannheim, Germany | Phone interview with developer and CEO to get to know each other and to understand skills and background. Follow-up interview to discuss technical realization of sample work which is handed over after the first interview.\n- [InvestSuite](https://www.investsuite.com/jobs) | Remote; Leuven, Belgium | Take home project -> discuss with 2 developers on-site or remote -> job offer\n- [IONOS SE](https://jobs.ionos.de/career/about-us) | Karlsruhe, Germany; Berlin, Germany | Our process has two stages for developers: An interview with your potential team lead followed by an interview with 1-2 future colleagues. All stages can be in-person in one of our offices or via Google Meet.\n- [IT Experts](https://itexperts.be) | Eeklo, Belgium | On site interview -> 1 or 1/2 day at the office to solve a real world problem with the team -> job offer.\n- [itdesign](https://itdesign.de/karriere/) | Tübingen, Germany | Short phone or personal interview. A day at our company to give you and us the opportunity to get to know each other.\n- [Ithaka](https://www.ithaka.travel) | Mumbai, India | Phone interview followed by a small development task. Finally a phone interview with CEO.\n- [iTrellis](https://itrellis.com) | Seattle, WA | Phone screen, then a take-home project, then pairing (remote or on-site) with 3 developers on the take-home project.\n- [iZettle](https://jobs.izettle.com/jobs) | Stockholm, Sweden | Remote pair programming exercise, propose an architecture for an application and discuss about it in an informal format.\n\n## J - L\n\n- [Jamasoftware](https://www.jamasoftware.com) | Portland, OR | Initial phone screen with hiring manager. In person pairing on project similar to day-to-day work with a separate cultural interview\n- [Jamit Labs](https://jamitlabs.com/jobs) | Karlsruhe, Germany | Phone interview or on-site interview & take-home code challenge or on-site programming session\n- [Jane Technologies (iheartjane.com)](https://iheartjane.com) | Santa Cruz, CA; Remote | Short take-home challenge, followed by practical interviews based on position the applicant is seeking\n- [Jeli](https://www.jeli.io) | Remote; San Francisco, CA | A series of conversations involving product deep dive, technical discussions, and behavioral topics. Discussions are open ended conversations about how one would approach solving real world problems. Questions may be scenario based involving talking through tradeoffs.\n- [Jetstack](https://www.jetstack.io/careers) | London, UK | Phone screen; shared terminal session on Linux & Programming; Take home task\n- [Jiminny](https://www.jiminny.com) | Sofia, Bulgaria | Phone screen. Take-home exercise. Follow-up discussion.\n- [Jitbit](https://www.jitbit.com) | Remote; London, UK; Tel-Aviv, Israel | Take-home real-world task\n- [Jobtome](https://weare.jobtome.com) | Stabio, Switzerland | Phone screen introduction with hiring manager. In site (or screen call) with Engineer Manager for a talk on skills and cultural fit.\n- [Journal Tech](https://journaltech.com/careers) | Los Angeles, CA | Mini take-home project, phone interview, discussion on-site\n- [Journalism++](https://www.jplusplus.org) | Berlin, Germany | Apply through a [relevant online challenge](http://internship.jplusplus.org) to show your technical skills and your capacity to investigate\n- [JOURNEE](https://jobs.lever.co/JOURNEE) | Berlin, Germany / Remote | Cultural fit assessment, Interview, Take-home assignment.\n- [Jumbo](https://nl.jobs.jumbo.com/nl) | Veghel, Netherlands | Culture Fit call, take-home project, design discussion based on take-home project, system design conversation online or in-person.\n- [JustWatch](https://www.justwatch.com/us/talent) | Berlin, Germany | Take-Home project, discussion on-site\n- [K Health](https://www.khealth.ai) | Tel Aviv, Israel | Phone screening to discuss technical background and past experience. Take-home assignment followed by on-site code review and interview. Cultural fit assessment\n- [Kahoot!](https://www.getkahoot.com/jobs) | London, UK / Oslo, Norway | Phone screening to discuss technical background and past experience. Take-home assignment followed by on-site code review and interview. Cultural fit assessment\n- [Kata.ai](https://kata.ai) | Malang, Indonesia / Jakarta, Indonesia | Take-home assignment, then invited to discuss the assignment and interview.\n- [Kayako](https://www.kayako.com) | London, UK / Gurgaon, India | Take-home assignment, series of experience based interviews, cultural fit assessment\n- [KEF Robotics](https://www.kefrobotics.com) | Pittsburgh PA, USA | Presentation on a technical topic of your choice, cultural fit assessment\n- [Kentik](https://www.kentik.com/careers) | San Francisco, CA | Phone screening to discuss technical background and past experience. Take-home assignment followed by on-site code review and interview. Cultural fit assessment\n- [Keymetrics](https://keymetrics.io) | Paris, France | Phone Interview, Take-home project based on our [API](https://github.com/keymetrics/keymetrics-api), IRL meeting with the whole team\n- [Kiến Guru](https://www.kienguru.vn) | Hồ Chí Minh, Vietnam | Phone screening with technical recruiter --> live coding with an engineer --> panel interview with related engineers (Test Engineers, Frontend Engineers, Backend Engineers, etc) --> final interview with VP of Engineering\n- [Kindred Group, Native Apps Team](https://careers.kindredplc.com) | Stockholm SE, London UK | On-site/Skype programming task, Interview\n- [Kinnek](https://www.kinnek.com/jointeam) | New York, NY | Phone screen, on-site pairing session, take-home project\n- [Kinsta](https://kinsta.com/careers/) | Remote | Culture fit interview, take home assignmentv, discussion on-site, technical interview discussing past real world experiences as well as knowledge of tools that will be used for position\n- [Kiwi.com](https://code.kiwi.com) | Brno, Czech Republic | Phone Interview, Take-home projects, On-site code review & interview\n- [Knock.com](https://www.knock.com/careers) | San Francisco, CA / New York, NY / Remote | Phone Interview, Take-home project, On-site technical conversation relating to the tech stack you would be hired to build with\n- [KNPLabs](https://knplabs.com) | Nantes, France | First step: screening call directly with the CEO, to discuss company vision, assess cultural fit and experience. Second step: call or IRL interview with a developer and a project facilitator , technical discussions with focus on soft skills. The goal of the interview is for the 2 KNPeers to be able to answer: “Do I want to work with this person ?” If both say yes, the person is hired. If even at least one says no, the person is not hired.\n- [Koala](https://www.koala.io) | Remote | Phone screen. Open-ended take-home coding challenge. Pair Programming exercise. Meet the CEO and the rest of team.\n- [Kodify](https://kodify.io) | Remote | HR interview, technical interview, take-home test related to role, technical interview about the test\n- [Koho by Expeditors](https://www.gokoho.com) | Portland, OR | Phone screening. Take home assignment. Conversational technical and cultural interview.\n- [Kong](https://www.konghq.com/careers) | San Francisco, CA | Phone interview. Pairing and technical interviews. Take home assignment.\n- [Kongregate](https://www.kongregate.com/jobs) | Portland, OR | Phone screening. Take home project. On-site pairing and conversational technical interviews.\n- [Kontainer](https://kontainer.com/vacant-positions-in-kontainer-job-and-career) | Copenhagen, Denmark | Phone screening. Practical questions on how past experience matches the job position. On-site technical interviews with lead engineers.\n- [Korbit](https://lightning.korbit.co.kr) | Seoul, South Korea | Take home assignment followed by on-site code review and interview\n- [Kulkul Tech](https://kulkul.tech/careers) | Jakarta, Indonesia | Take home and an in-person system design interview, then soft skills and culture assessment via interviews with the senior leadership team.\n- [KUNGFU.AI](https://www.kungfu.ai) | Remote; Austin, TX | 30-40 minute recruiter screen, 30 minute hiring manager screen, 1.5 hour final interview (discussion only, no coding or whiteboarding).\n- [Lab.Coop](http://lab.coop) | Budapest, Hungary | Partnership-fit discussion, code-review and trial days.\n- [Lab49](https://www.lab49.com/careers/) | New York, NY; Washington, DC; London, UK; Sydney, AU | First interview - Pairing interview using Codility. Final interviews that include a coding challenge.\n- [Landing.jobs](https://landing.jobs/at/landing-jobs) | Lisbon, Portugal | Interviews (in-person or remote), Take home coding project\n- [Lattice](https://lattice.com/careers) | San Francisco, CA; New York, NY; Remote | Technical exercises based on work we do at Lattice, discussion of a new architecture to solve a real world problem\n- [Launch Academy](https://launchacademy.com/careers) | Boston, Philadelphia | Nontechnical phone screen, pair programming with team member, and potentially a \"guest lecture\" for our students\n- [LaunchDarkly](https://launchdarkly.com/careers) | Oakland, CA | Informational phone screen with Eng leadership, take home project, onsite interviews\n- [League](https://league.com/ca/careers) | Toronto, Canada | Initial interview with talent team, take home coding challenge & technical interview to discuss, take home architecture challenge & interview to discuss, cross-functional interview, executive interview.\n- [Leapsome](https://leapsome.com) | Berlin, Germany | Phone screen with technical co-founder, take home case study, onsite culture-fit interview\n- [Learningbank](https://learningbank.dk) | Copenhagen, DK | Take home assignment, followed by on-site code review.\n- [Legalstart.fr](https://www.legalstart.fr) | Paris, France | Telephone interview followed by take-home challenges. Suitable applicants are asked to do further on-pair interviews on site.\n- [Leverton](https://www.leverton.ai) | Berlin, Germany | Initial chat with the HR continued with 1-2 rounds chat with the team; followed by a technical test and finally a chat with the CTO/MD. [Jobs page](https://leverton-jobs.personio.de)\n- [Liberty Mutual](https://www.libertymutualgroup.com/careers) | Seattle, WA; Boston, MA; Indianapolis, IN | Initial interview, discussion on-site, interview with peers\n- [Librato](https://www.librato.com/jobs) | San Francisco, CA; Boston, MA; Austin, TX; Vancouver, Canada; Krakow, Poland | Take home coding project, conversational technical interviews on-site\n- [Lightning Jar](https://lightningjar.agency) | San Antonio, Tx | Remote pairing session, Initial interview,discussion on-site\n- [Lightricks](https://www.lightricks.com) | Jerusalem, Israel | Initial interview, Take home project, discussion on-site\n- [LinkAja](https://www.linkaja.id) | Jakarta, Indonesia | Quick introductory chat, followed by take home project for 7 days\n- [LinkResearchTools](https://jobs.linkresearchtools.com/job-offers) | Vienna, Austria | Skype interview, mini take-home exercise, discussion on-site / personal interview\n- [Linx Systems](https://www.linxsystems.com) | Bloomington, IL / Remote | 5-10 minute take home project; followed by a non-technical interview; finish up with a second take home project or paired with a developer for a 30-60 minute session.\n- [lise GmbH](https://www.lise.de/karriere/stellenboerse) | Cologne, Germany | Phone interview, followed by getting to know each other in person, a short presentation about any topic you are interested in, pair programming on a real world problem\n- [Listen Lively](https://www.listenlively.com/about#careers) | Remote | 1 hour pair programming exercise on codesandbox; a second 1 hour pair programming exercise on codesandbox; followed by non-technical interview(s) with team members.\n- [Listium](https://listium.com/jobs) | Melbourne, Australia | Design and code proof of concept features with the team\n- [Litmus](https://litmus.com/careers#openings) | Remote | General technical questions, take-home code challenge, discussion, on-site programming session, meet & greet with the team\n- [LittleThings](https://www.littlethings.com/careers.html) | New York, NY | Take home code challenge, Discussion\n- [LoanZen](https://loanzen.in/team.html#Career) | Bengaluru, India | Initial phone interview about experience, a solve-at-home project based on the kind of work we do at our company, on-site interview discussing the submitted solution and a general discussion with the whole team\n- [Lob](https://lob.com/careers) | San Francisco, CA | Initial phone screen followed by an on-site interview. Technical problems discussed during the interview are all simplified versions of problems we've had to solve in production. Our entire interview process and what we're looking for is described in our blog post [How We Interview Engineers](https://lob.com/blog/how-we-interview-engineers).\n- [Locastic](https://www.locastic.com/posao) | Split, Croatia | Take-home code challenge, technical discussion & on-site programming session, meet & greet with the team\n- [Locaweb](https://www.locaweb.com.br/carreira) | São Paulo, Brazil | Skype interview, take-home project and discussion on-site\n- [LOGIBALL GmbH](https://www.logiball.de/en/jobs/) | Berlin, Hannover and Herne in Germany | Interviews and discussion\n- [Logic Soft](https://logicsoft.co.in) | Chennai, India | Phone discussion, F2F pair programming exercise + discussion\n- [LonRes](https://www.lonres.com/public/working-us) | London, United Kingdom | Quick introduction call with tech (Skype), coding task for ≈1 hour, face-to-face interview (or via Skype) and meeting with team members.\n- [LookBookHQ](https://www.pathfactory.com/careers/) | Toronto, Canada | On-site discussion, pair programming exercise\n- [Loom](https://www.useloom.com/careers) | San Francisco, CA | Google Hangouts resume dive on past experience, take-home project OR architectural phone screen, on-site interviews (2 technical architecture related to work, 1 or 2 non-technical)\n- [Luna](https://oiluna.com) | Sao Paulo, Brazil | Take-home project and/or discussion (on-site or remote)\n- [Lyft's Mobile Team](https://www.lyft.com/jobs) | San Francisco, CA; Seattle, WA; New York, NY; Minsk, Belarus; Mexico City, Mexico | On-site project, discussion of candidate's completed project afterwards\n- [Lykon](https://lykon.de) | Berlin, Germany | Phone interview followed by home assignment that reflect our daily work and then on-site interview\n- [Lyoness Austria GmbH](http://www.lyoness-corporate.com/de-AT/Karriere/Jobangebote) | Graz, Austria | Take-Home project, discussion on-site\n\n## M - O\n\n- [Made Tech](https://www.madetech.com/careers) | London, UK | [Our hiring process](https://github.com/madetech/handbook/tree/master/guides/hiring#20-minute-phone-conversation)\n- [Magical](https://magical.team/work) | Tel Aviv, Israel; Remote | Culture fit interview + take home assignment, followed by a technical interview, and a CTO interview.\n- [Magnetis](https://magnetis.workable.com) | São Paulo, Brazil & Remote | Phone interview + take home assignment, followed by pair programming and informal meeting with the team.\n- [Major League Soccer](https://careers-mlssoccer.icims.com/jobs/search?ss=1&searchCategory=20285) | New York, NY | Phone interview + short take home project, which is daily work focused. In person interview could involve discussing past projects or pair programming.\n- [MakeMusic](https://www.makemusic.com/careers/) | Boulder, CO; Denver, CO | Phone screen, take home project, remote and on-site interviews for technical and cultural fit\n- [MakeTime](https://maketime.workable.com) | Lexington, KY | Practical exercise and/or a pairing session on site\n- [Mango Solutions](http://www.mango-solutions.com/wp/about-mango/team) | London (UK), Chippenham (UK) | Initial phone interview, followed by on-site interview with take-home assignment\n- [Mapbox](https://www.mapbox.com/jobs) | San Francisco, CA; Washington, DC; Ayacucho, Peru; Bangalore, India; Berlin, Germany; Remote | Conversational interviews, paid onsite project with team.\n- [Mattermost](https://mattermost.com/careers/) | Remote | Follow-up questions over email, a couple of video calls, audition (paid real-world “try out” project), video call to discuss audtion, and then a video call with the CTO\n- [Mavenlink](https://www.mavenlink.com/careers) | San Francisco, CA; Irvine, CA; Salt Lake City, UT | On-site pairing with multiple engineers. Pairing exercises and pairing on company code.\n- [Maxwell Health](https://www.maxwellhealth.com/careers) | Boston, MA | Take-home exercise or pairing session with team. Then conversational meetings with members of the team.\n- [Me & Company](https://me-company.de/jobs/) | Düsseldorf, Germany | You join us for one or two paid trial days to work on an assignment and to meet the team.\n- [MealMe](https://mealme.ai) | San Francisco, California | Initial introductory interview, 1 hour technical interview with CTO (real-world problem), rapid fire questions about thinking and working in a start-up.\n- [Media Pop](https://mediapop.co) | Singapore, Singapore | Take-home or unsupervised (onsite) real-world assignment\n- [Meetrics](https://www.meetrics.com) | Berlin, Germany | Initial interview, take-home code challenge and review\n- [Meltwater](https://underthehood.meltwater.com/jobs) | Manchester, NH | Small take home exercise that will be presented to the team during a QA style interview\n- [Mention](https://mention.workable.com) | Paris, FR | Take-home small exercise followed up by on site meetings with your future coworkers\n- [Mercado Livre](https://jobs.mercadolibre.com) | São Paulo, Brazil | Phone interview with HR department, Takehome project and discussion (on-site or remote) with an interview to evaluate the candidate's previous experience and Cultural Fit interview with a manager.\n- [Mercatus](https://www.mercatus.com/company/careers) | Toronto, Canada | Practical on-site project similar to daily work\n- [Metro Markets](https://www.metro-markets.de/careers/) | Düsseldorf, Germany | You can get to know us by joining fully remote interviews with us or you can come and visit us onsite\n- [mfind](https://www.mfind.pl/dolacz-do-nas/) | Warsaw, PL | Phone call about technical experience, Take-home project or technical test(depends on experience), Onsite interview with technical lead.\n- [miDrive](https://midrive.com/careers) | London, UK | Phone screen, Take-home project / technical test, Onsite interview with senior and peer.\n- [milch & zucker](https://www.milchundzucker.de) | Gießen, Germany | Interview with direct feedback, applicants providing working sample, code review (product code or personal code of applications)\n- [Minute Media](https://www.minutemedia.com/careers/) | Tel-Aviv, Israel | Phone screening with engineer. On-site real-world challenge questions with two engineers. Sometimes a take-home assignment or existing code sample submission.\n- [Miro](https://miro.com/careers/) | Amsterdam, NL; Berlin, DE; London, UK | Screen-share your own IDE and code our assignment, on your terms. We share the problem 24 hours in advance, but ask you to only configure the IDE beforehand, so 100% of your coding happens during the interview.\n- [Mirumee](https://mirumee.com/jobs) | Wroclaw, Poland; Remote | Pair programming and code review using one of the issues (or Pull Requests) in our open-source Saleor project, general discussion about programming, technology and candidate's experience\n- [Mixmax](https://mixmax.com/careers) | San Francisco, CA | Takehome assignment purely based on their platform, followed by phone interview\n- [Mobile Reality](https://themobilereality.com/careers) | Warsaw, Poland | Interview with technical questions and practical task to do in home for 3-5 hours. Candidate has freedom in terms of project environment and setup. After few days feedback arrives in email.\n- [MobileCashout](https://www.mobilecashout.com) | Barcelona, Spain; Valencia, Spain | Quick introduction video call with a tech (less than 10-15 minutes). On-site open source contribution to a project of candidates choosing, paired with a tech from the team. Interview and a short questionnaire about software design and relevant technologies. Interview and presentation of the company with a HR rep.\n- [Mobilethinking](https://mobilethinking.ch) | Geneva, Switzerland | 1 hour discussion about technical background and past experiences, preferably in-person\n- [Mode](https://about.modeanalytics.com/careers) | San Francisco, CA | Phone interview followed by onsite pair-architecting and discussion\n- [MokaHR](https://mokahr.com) | Beijing, China | Take home project/challenge, then on-site programming session taken from problems we encounter at work\n- [Molten Cloud](https://www.moltencloud.com) | Cambridge, MA; Remote | Technical Interview, behavioural interview with CEO, take-home challenge designed to mirror problems the company encounters\n- [Moneytree Front-end Web Team](https://moneytree.jp) | Tokyo, Japan | Pair programming exercise and social gathering with team\n- [Monite](https://monite.com) | Berlin, Germany | Screening interview with HR (salary expectations, career plans), take-home architectural design project (no code) and technical interview to discuss your skill set + general questions\n- [Monzo](https://monzo.com) | London, UK & Remote | Phone interview with another engineer. Take-home assignment. Call to debrief on take-home assignment. Half-day interview (on-site or Hangouts) with three conversational sessions: (1) building on take-home test & real-world system design (verbal and collaborative); (2) digging into knowledge & understanding in 1-2 other relevant technical areas; (3) general background, teams and ways of working.\n- [Moteefe](https://www.moteefe.com/jobs) | London, UK & Remote | Interview with CTO. Take home project/challenge.\n- [Mozilla](https://careers.mozilla.org/listings) | San Francisco, US; Portland, US; Toronta, CA; Vancouver, CA; Berlin, DE; Remote | Deep-dive discussions on technical and mentorship problems solved in the past. No live coding. Total of 3 rounds.\n- [Mutual Mobile](https://mutualmobile.com/careers) | Austin, TX; Hyderabad, India | Technical discussion, code test based on actual work you'll be doing, panel style discussions for cross-functional and culture-fit.\n- [Mutual of Omaha](https://www.mutualofomaha.com/careers) | Omaha, NE, USA | Panel Style Interviews analyzing problem solving, ability to adapt well to change, and interpersonal communication skills.\n- [Mutually Human Software](https://www.mutuallyhuman.com) | MI, OH, WA | Collaborative problem analysis and design exercise, pairing exercise\n- [Mux](https://mux.com/jobs/) | San Francisco, CA; London, UK & Remote | Hands-on software engineer and system-design interviews that focus on collaboratively building practical applications at scale.\n- [My Taxi](https://mytaxi.com) | Hamburg, Germany | Video chat with HR, Take Home Assignment, Review of Assignment with a technical member, Technical interview and onboarding.\n- [MyHeritage](https://www.myheritage.com) | Or Yehuda, Israel; Kyiv, Ukraine | Video call with HR, problem solving test on codility.com, video call with tech lead and solving problem from real project, system design onsite interview.\n- [MyTutor](https://apply.workable.com/mytutor/) | London, UK | Take home test, followed by pair programming, system design discussion, and cross functional interview on site\n- [Naologic](https://naologic.com/careers/jobs) | San Francisco, US | Takehome programming assignment and personal interviews with part of the founding team.\n- [Native Instruments](https://www.native-instruments.com) | Berlin, Germany | Takehome programming assignment and personal interviews with part of the hiring team.\n- [Nearsoft Inc](https://nearsoft.com/join-us/) | Hermosillo, Mexico; Chihuahua, Mexico; Mexico City, Mexico | Takehome [logic test](https://nearsoft.com/blog/the-logic-behind-nearsofts-logic-test/), english interview to check communication skills, short technical interview about experience, long technical discussion about languages/tools/practices you will use on daily basis, pair programming session.\n- [Nedap](https://lifeatnedap.com/vacatures) | Groenlo, Netherlands / Remote | A simple conversation, human to human and a small on-site project\n- [Neoteric](https://neoteric.eu/career/) | Gdańsk, Warsaw Poland; Remote | Face2Face conversation, take home exercise & pair programming session\n- [NerdWallet](https://www.nerdwallet.com/careers) | San Francisco, CA; Remote | Code review phone screen, on-site project to build a functioning app with interviewee's platform of choice\n- [Netguru](https://www.netguru.co/career) | Warsaw, Poland; Remote | Takehome exercise & pair programming session\n- [Netlandish](https://www.netlandish.com) | Los Angeles, CA; Remote | Takehome exercise, chat interview, video interview\n- [Netlify](https://www.netlify.com/careers) | San Francisco, CA / Remote | Takehome project and online/onsite discussion\n- [Neulabs](https://neulabs.com/careers) | Milan, Italy | Initial phone screen with HR. Brief talk with VP of Engineering or CTO. Small take-home project followed by a technical review with 1 or more engineers & a culture-fit discussion.\n- [Neural Lab](https://neurallab.io) | Shatin, Hong Kong; Remote | Online non-technical (Behavioural) interview, followed by a Technical Interview with the core team - mainly revolving around the real-world problems, best approaches and some scenario based questions.\n- [New Relic](https://newrelic.com/about/careers) | San Francisco, CA | Takehome exercise &/ or pair programming session depending on the team\n- [NewStore](https://www.newstore.com/careers/) | Berlin, Germany; Hannover, Germany; Erfurt, Germany; Boston, MA | Telephone technical interview, code sample submission or takeaway coding exercise, on-site pair programming, design session (1/2 day)\n- [NewVoiceMedia](https://www.newvoicemedia.com/about-newvoicemedia/careers) | Basingstoke, England; Wroclaw, Poland | Telephone interview, takeaway coding exercise, on-site pair programming, code review & technical discussion (1/2 day)\n- [Nexapp](https://nexapp.ca/career/) | Quebec City, Canada | Video call where we get to know you more and you get to know us more, followed by a video call technical interview where we discuss a few open-ended problems strongly inspired by the daily real-world work we do.\n- [Nexcess.net](https://nexcess.net) | Southfield, MI | We mostly chat to get a feel on both ends if there's a good cultural fit. We ask questions to see what experience you have and how you think as a programmer. At some point we look at some of your code or have you work on some of ours (1 hour).\n- [Nimble](https://nimblehq.co) | Bangkok, Thailand; Ho Chi Minh City, Vietnam; Da Nang, Vietnam | Takehome exercise and specific role discussion\n- [Ninjaneers](https://www.ninjaneers.de) | Kassel, Germany; Remote | Google Hangouts resume dive on past experience and projects\n- [Niteoweb](https://www.niteoweb.com/careers) | Ljubljana, Slovenia | Join us for a week to see if we fit\n- [Nitro](https://www.gonitro.com/about/jobs) | Dublin, Ireland; San Francisco, CA | Phone Call, Take Home Test, Hiring Manager Phone Interview followed by an onsite discussion\n- [Nmbrs](https://jobs.nmbrs.com) | Amsterdam, The Netherlands; Lisbon, Portugal | Cultural interview, take home test, interview with CTO\n- [Noa](https://www.noa.one) | Berlin, Germany; San Francisco, CA | 1 technical chat, 2-3 cultural chats with colleagues from different departments in the team, if these work a pair programming exercise\n- [NodeSource](https://nodesource.com/careers) | Remote | A person-to–person walk through of a past project of yours\n- [Nomoko,camera](https://www.nomoko.world/jobs) | Zurich, Switzerland | Three interrogations\n- [Norbsoft](https://www.norbsoft.com/careers) | Kraków, Poland; Warszawa, Poland; Sosnowiec, Poland; Remote | Take-home exercise or code sample submission, technical discussion by video conference\n- [NordPass](https://nordsecurity.com/careers) | Remote | HR talk, take-home task, tech interview, culture fit interview\n- [NoRedInk](https://www.noredink.com/jobs) | San Francisco, CA | Take-home exercise & pair programming session\n- [Nova Care](https://www.novacare.no) | Oslo, Norway | Casual interview, take-home exercise & presentation\n- [Nova Credit](https://www.novacredit.com/careers) | San Francisco, CA | Choose between a take home assignment or two interviews on CoderPad, CodePen, or your local dev env while screensharing. Final round is onsite working on a small project\n- [NoviCap](https://novicap.com/en/careers.html) | Barcelona, Spain | Takehome exercise & discussion on-site\n- [Novoda](https://novoda.com/joinus) | London, UK; Liverpool, UK; Berlin, Germany; Barcelona, Spain; Remote | 2 x Pairing sessions & conversational interviews [(public repo)](https://github.com/novoda/dojos)\n- [Novus Partners](https://www.novus.com/jobs) | New York, NY | Take-home exercise & on-site exercises (choice of laptop or whiteboard)\n- [Noyo](https://www.noyo.com/careers/) | San Francisco, CA / Durham, NC / Remote | Phone interview, take-home assignment, on-site code review, and walk through a past project you're proud of\n- [Nozbe](https://nozbe.com/careers) | Remote | Take-home exercise & interview with the team\n- [npm, Inc](https://npmjs.com/jobs) | Oakland, CA / Remote | No technical challenges. Just interview conversations.\n- [Nubank](https://nubank.workable.com) | São Paulo, BR | Phone conversation, take-home exercise, code walkthrough, on-site code pairing.\n- [numberly](https://www.numberly.com) | Paris, France | Series of interviews, that go over technical background, past experiences and cultural knowledge\n- [numer.ai](https://angel.co/numerai/jobs) | San Francisco, CA\n- [Nurx](https://www.nurx.com/technology/) | San Francisco, CA; Remote | Phone screen with recruiter and/or hiring manager, tech assessment with multiple options (full take home, partial take home, no take home), and then virtual on-site with a pair coding session, peer review of a technical document, architecture design, and exec loop\n- [Nutshell](https://www.nutshell.com/jobs) | Ann Arbor, MI, US | Email screen / take-home programming exercise ([public repo](https://github.com/nutshellcrm/join-the-team))\n- [Nyon](https://www.nyon.nl/jobs) | Amsterdam, The Netherlands | 1. Skype (or real life) interview 2. Take home exercise (3-4 hours) 3. Meet entire team and pair programming sessions\n- [O'Reilly Media](https://oreilly.com/jobs) | Sebastopol, CA; Boston, MA; Remote | Phone conversation, take-home exercise or pair programming session, team interview, all via Google Hangout\n- [Oak Street Health](https://www.oakstreethealth.com/careers) | Chicago, IL / Remote | Casual but semi-technical initial phone screen. One hour video call consisting of in depth technical discussion with lead developers followed by one hour of discussion with the product team\n- [Object Partners, Inc.](https://objectpartners.com/careers/) | Minneapolis, MN; Omaha, NE | Phone interview to gauge mutual interest, followed by a slightly more in-depth technical round-table interview\n- [Objective, Inc.](https://www.objectiveinc.com/careers) | Salt Lake City, UT | Take-home programming exercise, then onsite friendly chat with team\n- [OCTO Technology](https://rejoins.octo.com) | Paris, France | HR interview to go over your experiences and cultural knowledge. Then more or less informal discussion with two future team members about architecture design, agile practices, take-home project, pair programming...\n- [Octopus Energy](https://octopus.energy/careers/) | London, UK; Sydney, Australia; Remote | Take-home exercise and phone or on-site interview/discussion with potential team\n- [Oda](https://careers.oda.com/jobs) | Oslo, Norway; Helsinki, Finland; Berlin, Germany | Phone screening to discuss technical background and past experience. Take-home assignment followed by virtual project discussion and interview. Cultural fit assessment.\n- [Odeko](https://grnh.se/e9ddbe544us) | Remote; New York, NY; Dublin, IE | Take-home project (2 hours) related to role, follow-up technical interview where you discuss your project implementation (may perform pair-programming session instead of technical interview).\n- [Olist](https://olist.com) | Curitiba, Brazil | Take-home project and remote or on-site interviews\n- [Omada Health](https://www.omadahealth.com/jobs) | San Francisco, CA | Take home exercise and/or pair programming session.\n- [Oncue](https://oncue.co) | San Francisco, CA; Remote | Online coding test on real-world problems (2 hours). Technical discussion with developer team.\n- [OneMain Financial](https://jobs.onemainfinancial.com) | Chicago, IL; Remote | Take-home exercise and on-site interview/discussion with potential team\n- [OneSignal](https://onesignal.com/careers) | San Mateo, CA | Intro call with recruiting, second conversation with OneSignal engineer, onsite pairing via screenshare\n- [Onfido](https://onfido.com/jobs) | London, UK; Lisbon, Portugal | Take-home exercise and on-site interview/discussion with potential team\n- [Ontame.io](https://ontame.io) | Copenhagen, Denmark | Take home exercise and specific role discussion\n- [Opbeat](https://opbeat.com/jobs#seniorbackendengineer) | Copenhagen, Denmark | Pairing on a real-world problem\n- [Openbase](https://angel.co/company/openbasecom) | San Francisco, CA | Take-home exercise on real-world problem & discussion with engineers about exercise\n- [Openmind](https://www.openmindonline.it) | Monza, Italy | On-site interviews\n- [optilyz](https://optilyz.com/careers) | Remote | Either take-home or pair programming on open-source code, then pair programming on our actual production code.\n- [Optoro](https://www.optoro.com/open_position_item/?oid=134960) | Washington, DC | Take home exercise. Review your code onsite.\n- [Optum](https://www.optum.in/about/careers.html) | India, Hyderabad | Online assessment, followed by technical interview and behavioural check\n- [Ori](https://ori.co)| London, UK | Phone interview and a takehome project, followed by a two hour meeting with the team\n- [OSISM](https://osism.tech) | Remote | Three video calls: general introduction, team introduction, contract\n- [Ostmodern](https://www.ostmodern.co.uk) | London, UK | Take-home exercise & discussion on-site\n- [Outbrain](https://careers.outbrain.com/?F1C=Netanya&F2C=&FTXT=) | Netanya, Israel | Take-home exercise & discussion\n- [Outlandish](https://outlandish.com) | London, UK | Take-home exercise, real-world pair programming session, friendly chat with team\n- [Outlook iOS & Android](https://github.com/outlook/jobs) | San Francisco, CA / New York, NY | Take-home project & online / onsite discussion\n- [The Nerdery](https://www.nerdery.com/careers) | Minneapolis, MN; Chicago, IL; Phoenix, AZ; Kansas City, KS | Take-home exercise\n- [The Outline](https://boards.greenhouse.io/theoutline) | New York, NY | Take-home exercise\n\n## P - R\n\n- [PACE Telematics](https://www.pace.car/jobs) | Karlsruhe, Germany | Culture and mindset check, on-site meet and great, small code challenge to see development style and strategy\n- [Paessler AG](https://www.paessler.com/company/career/jobs) | Nuremberg, Germany | Pairing with different engineers on a real problem\n- [Pagar.me](https://pagar.me) | São Paulo, BR | Skype interview, on-site pairing task and-or real world problem solving process / presentation\n- [Pager](https://pager.com) | New York, NY; Remote | Short phone interview, conversational interviews, take-home exercise & discussion\n- [PagerDuty](https://pagerduty.com/careers) | San Francisco, CA / Toronto, Canada / Atlanta, GA | Zoom / on-site pair programming and tasks\n- [Palatinate Tech](https://tech.palatinategroup.com) | London, UK | Hangout/Skype/phone followed by (normally) on-site pairing task\n- [Paper](https://withpaper.com/careers) | San Francisco, CA | Google Meets technical phone screen, take-home coding assignment, on-site with webapp architecture, team lunch, and culture-add conversations\n- [Parabol](https://parabol.co) | New York, NY; Los Angeles, CA; Remote | Culture check followed by compensated, [open-source contribution](https://github.com/ParabolInc/action/projects) skills evaluation\n- [Pariveda Solutions](https://parivedasolutions.com) | Dallas, TX / Houston, TX / Atlana, GA / Washington, DC / New York, NY / Chicago, IL / San Francisco, CA / Seattle, WA / Los Angeles, CA | Personality assessment (Predictive Index) and case study. Programming aptitude test (language independent) for college hires.\n- [PassFort](https://passfort.com/about#jobs) | London, UK | Skype interview, and on-site pairing task\n- [Passiv](https://passiv.com) | Fredericton, Canada | Zoom interview, take-home coding assignment, standalone bite-size project that delivers some value, small feature development involving team collaboration.\n- [Pathos Ethos](https://pathosethos.com/careers/) | Durham, NC / Raleigh, NC / Chapel Hill, NC / Remote | 3 conversational interviews (Manager, Team, Founder). No homework. We look for a candidate to be \"culture add\" instead of \"culture fit\"\n- [Paws](https://paws.com/careers) | London, UK | Phone screening, take-home project, on-site pairing/discussion on your solution and meet the team.\n- [Paybase](https://paybase.io) | London, UK | Phone screening, Take home project, On-site interview for technical and culture fit, Open Q&A session with team\n- [PayByPhone](https://www.paybyphone.com/careers) | Vancouver, Canada | Remote programming interview, on-site \"meet the team\"\n- [Peaksware Companies (TrainingPeaks, TrainHeroic, MakeMusic)](https://peaksware.com) | Boulder, CO; Denver, CO | Phone screen, take home project, remote and on-site interviews for technical and cultural fit\n- [PeerStreet](https://info.peerstreet.com/careers) | Los Angeles, CA | Phone, take home project & on-site to meet the team\n- [Pento](https://www.pento.io) | Remote | Quick personal interview, take home project\n- [Permutive](https://permutive.com/careers/) | London, UK | Phone call; short, relevant take-home coding assignment; on-site pairing, general technical discussion, values & ways of working interview.\n- [Persado](https://www.persado.com/company/life-at-persado) | New York, NY | Phone screen, take home project, remote meeting with team member to discuss the project, remote meeting with team manager to discuss role and go over statistical concepts relevant to the role\n- [Persgroep, de](https://www.persgroep.nl/werken-bij-it) | Amsterdam, Netherlands | Tech interview (technical background and experiences) and culture fit, both on-site\n- [Persona](https://www.withpersona.com/about) | San Francisco, CA | Tech interview (technical background and experiences), pair programming, and culture fit\n- [Pex](https://pex.com/careers/) | Los Angeles, CA; Remote | 3 sessions: brief phone conversation (30 min); take home assignment (2 hours); on-site or video discussion without any coding (2 hours)\n- [pfs](https://empleo.pfsgroup.es) | Madrid, Spain; Valencia, Spain; Lisbon, Portugal; CDMX, Mexico; Remote | We adapt each interview according to the candidate and the position. The interviews are open discussions (no quizzes) about real-world problems. 2-3 interviews max, all of them can be done remotely.\n- [Philo](https://philo.com/jobs) | San Francisco, CA; Cambridge, MA | Initial screen with deep-dive into one of your recent projects (30 mins) ; take-home coding exercise tailored your skills (4 hours); on-site with take-home code review, architecture interview, design interview and \"soft skills\" interview (4 hours)\n- [Phoodster](https://www.phoodster.com) | Stockholm, Sweden | Take-home exercise + on-site discussion\n- [Pie Insurance](https://www.pieinsurance.com/culture/careers) | Denver, CO; Washington, D.C.; Remote | Phone; remote technical screen paired with another engineer; remote multi-round interview to demonstrate basic backend/frontend skills (no bizarre Leetcode questions), behavioral/culture fit, design skills\n- [Pismo](https://pismo.io/pt/) | Remote; Bristol, UK; Austin, TX; Singapore, Singapore | Initial and quick screening with recruiters from hr department, remote general technical discussion with tech lead and team members, take home assessment (choose between Java and/or Golang), remote pair programming.\n- [Pixium Digital](https://pixiumdigital.com) | Singapore, Singapore | Remote or on-site interview with few generic / technical questions as well as portfolio review + discussion.\n- [Plane](https://pilot.notion.site/Plane-Careers-Page-0f9a2b64ddd8470f968335b769de0909) | Remote | Two calls. Introduction one (30m) + verification of communication skills and remote work experience (15m)\n- [Platform.sh](https://platform.sh) | Remote | Remote Interview, Wide-Ranging discussions on many diverse subjects. Remote interviews with team members.\n- [Platform45](https://platform45.com) | Johannesburg, South Africa; Cape Town, South Africa | On-site interview, take-home project and culture fit day\n- [Platogo Interactive Entertainment GmbH](https://platogo.com/hiring/) | Vienna, Austria | Simple online questionnaire, First Interview to get to know each other, Remote developer challenge (take home task), Code review together, Meet the team\n- [Playlyfe](https://getcatalyst.in/careers) | Bangalore, India | Short personal interview, on-site demonstration of programming in browser devtools followed by discussion about the problem\n- [Pleo](https://www.pleo.io/en/careers) | Remote; Copenhagen, Denmark; London, UK; Berlin, Germany; Stockholm, Sweden; Madrid, Spain| Intro interview (30m-45m), take home assignment, interview with discussion on the assignment + technical questions with the team (90m) and interview with managers (60m).\n- [Poki](https://jobs.poki.com) | Amsterdam, The Netherlands | Pair programming on-site w/ two engineers where we focus on teamwork, googling relevant documentation and fixing things together.\n- [Polar](http://polar.me/company/careers) | Toronto, Canada | Phone interview, followed by 1-2 onsite pair-programming interviews based on their platform\n- [Poll Everywhere](https://www.polleverywhere.com/jobs) | Remote | Introduction call, 1 hour take home technical assessment, pairing session with Designer and Engineer to enhance technical challenge submission, Meeting with CTO and hiring manager.\n- [Popstand](https://www.popstand.com) | Los Angeles, CA | Build MVPs for startups\n- [Popular Pays](http://www.popularpays.com) | Chicago, IL | Phone chat/coffee to determine what will be worked on during a day of pair-programming on a real problem that the candidate thinks best demonstrates their skills.\n- [Posit](https://posit.co) | Remote | Video calls with recruiter then engineering management, take home project, video call for code review with engineering lead\n- [Pragmateam](https://pragma.team/talent) | Sydney, Australia | Engineering Consultancy And Delivery - Takehome exercise & discussion\n- [PremiumBeat](https://www.premiumbeat.com/careers) | Montreal, Canada | Discussion and general, high level questions\n- [Primary](https://www.primary.com/jobs) | New York, NY / Remote | Phone chat, take home exercise, pair program and discuss onsite.\n- [Progressive](https://www.progressive.com/careers/) | Mayfield Village, OH / Remote | Recruiter phone screen, followed by 2 one-hour [manager STAR interviews](https://www.progressive.com/careers/how-we-hire/application-next-steps/interviewing/) and 1 one-hour [technical STAR interview](https://www.progressive.com/careers/life/how-to-prepare-for-a-technical-screening/).\n- [Prokeep](https://www.prokeep.com/careers) | Remote | Take-home project, informal chat with managers.\n- [PromptWorks](https://www.promptworks.com/jobs) | Philadelphia, PA | Take-home project, pair programming, discussion on-site\n- [PropertyCaptain](https://www.propertycaptain.ch) | Zurich, Switzerland | Take-home project, discussion on-site\n- [Proxy](https://www.proxy.com) | San Francisco, CA | Phone chat. In-depth discussion about experiences on-site. Occasionally a take home project.\n- [Pusher](https://pusher.com/jobs) | London, UK | Solve a real-world problem through a design session with our engineers\n- [Pygmalios](https://pygmalios.com/en) | Bratislava, Slovakia | Take-home project related to business and discussion with our engineers.\n- [Qonto](https://qonto.com/en/careers) | Paris, France / Berlin, Germany / Milan, Italy / Barcelona, Spain / Belgrade, Serbia / Remote | Take-home project, code review and discussions with our engineers.\n- [Quiet Light Communications](https://quietlightcom.com/positions-web.php) | Rockford, IL, USA | Discussion, work samples and/or small freelance project\n- [Quintype](http://www.workatquintype.com) | Bengaluru, India / San Mateo, USA | Take home project, pair programming, discussion on-site\n- [Quizizz](https://quizizz.com) | Bengaluru, India | Phone chat, real world assignment, discussion w/ developers, pair programming, discussion on-site\n- [Quizlet](https://quizlet.com/careers) | Remote; San Francisco, CA; New York, NY; London, UK | Preliminary screen followed by role-specific applied exercises where candidates create new projects/apps or make improvements to pre-existing code.\n- [Ragnarson](https://ragnarson.com) | Lodz, Poland; Remote | Take-home exercise & pair programming session\n- [Railscarma](https://www.railscarma.com) | Bengaluru, India | Take-home project, code review and discussion on-site\n- [Railslove](https://www.railslove.com) | Cologne, Germany | Have a coffee in our office, casual chat with us, pair programming on a real project\n- [Raising IT](https://www.raisingit.com) | London, UK | Coffee with a team member, on-site pair programming and discussion\n- [Ramp](https://ramp.com) | New York, NY | Phone interview on a basic applied problem, followed by 2-3 onsite programming interviews that test practical day-to-day software skills.\n- [RapidAPI](https://rapidapi.com/company/careers/) | San Francisco, CA; Berlin, Germany; Tallinn, Estonia | Take home assignment and discussion before/afterwards\n- [Rapptr Labs](https://careers.rapptrlabs.com) | Jersey City, NJ | Take-home exercise followed by a video interview with 2-3 engineers about domain-specific knowledge and open-ended questions.\n- [Rapyuta Robotics](https://www.rapyuta-robotics.com/pages/jobs.html) | Bengaluru, India / Tokyo, Japan / Zurich, Switzerland | Take-home assignment related to our ongoing projects, series of technical / experience based interviews, candidate presentation\n- [Razorpay](https://razorpay.com/jobs) | Bangalore, India | Phone screen, On-site pair programming, and occasionally a take home project.\n- [Reaktor](https://reaktor.com/careers) | New York, NY; Amsterdam, Netherlands; Helsinki, Finland; Tokyo, Japan | Discussion, work samples from previous projects (work or hobby), take-home exercise if needed for further info\n- [Realync](https://realync.com/careers) | Chicago, IL / Carmel, IN / Remote | Quick phone interview, then a take home project and finally in person interview (open discussions instead of quizzes - anything technical are real-world problems).\n- [Rebase Consulting](https://rebase.fi) | Helsinki, Finland / Remote | First round general discussion/introductions, second round technical interview built around a take-home exercise, 2x2 skill/interest matrix go-through and general technical topics based on the candidate's profile.\n- [Red Badger](https://red-badger.com/about-us/join-us) | London, UK | Phone & Skype interview, take home exercise, On-site interview\n- [Red Balloon Security](https://redballoonsecurity.com) | New York City, USA | A rather educational week long hacking challenge with a monetary reward upon finding solution. On-site with team members, real job related problems, a few open-ended questions.\n- [RedCarpet](https://www.redcarpetup.com/jobs) | New Delhi, India | Interview, work sample/take-home project and discussion/code reviews\n- [Redgate](https://www.red-gate.com/our-company/careers/current-opportunities/) | Cambridge, UK | Simple couple of questions during screening phase (up to 30 min) followed by a second phase with up to two coding exercises (non-CS).\n- [Reducer](https://reducer.co.uk) | London, UK | Introductions by phone, pair programming on site, then meeting the team.\n- [Reflektive](https://www.reflektive.com/careers/) | San Francisco, CA; Bengaluru, India | A short take home project/assignment, followed by a couple of technical and non-technical discussions online and offline.\n- [Refty](https://refty.co) | Paris, France | Introductory video call, soft skills assessment process powered by our own product, on-site discussion, lunch with everyone.\n- [Relabe](https://relabe.com) | San Juan, PR | First we screen for cultural fit then check for technical proficiency. 2-3 Interviews max in SJ\n- [Remote](https://remote.com) | Remote | Call with a recruiter (if needed), call with manager, code exercise, call with team.\n- [Render](https://render.com/careers) | San Francisco, CA; Remote | Phone screen followed by an onsite project based on our day-to-day, real world challenges.\n- [Rentify](https://www.rentify.com/jobs) | London, UK | Phone call, take home real-world project, on-site pair programming, product discussion\n- [RentoMojo](https://www.rentomojo.com/about/careers) | Bangalore, India | Short takehome project + phone interview\n- [Repl.it](https://repl.it/site/jobs) | San Francisco, CA / Remote | Take-home project and discussion, then an on-site project and discussion\n- [Resin.io](https://resin.io) | Remote | Take home real-world project and a couple of technical and non-technical discussions\n- [Resourcify](https://www.resourcify.com) | Hamburg, Germany; Remote | Get to know phone call with Engineering Manager and VP of People, pair programming a day-to-day problem with a Lead Engineer, meeting with team members.\n- [ReSpark](https://www.respark.co.uk) | London, UK | Phone conversation followed by on-site interview w/ task relevant to daily role.\n- [RestaurantOps](https://www.restaurantops.co) | Scottsdale, AZ | Take Home Project & pair programming session\n- [Retail Pulse](https://retailpulse.ai) | Bangalore, India | Phone chat, take home exercise, feedback & interview\n- [Rever](https://reverscore.com) | Guadalajara, Mexico | Take-home project, on-site discussion or via Hangouts.\n- [ReviewTrackers](https://www.reviewtrackers.com/careers/) | Remote; Chicago, IL | Phone conversation, take home project, virtual interview with project review and live coding, discussion with engineers and product, interview with VP of Engineering\n- [Rex Software](https://www.rexsoftware.com/careers) | Brisbane, Australia | Take home project, feedback + interview\n- [Rizk.com](https://rizk.com) | Ta' Xbiex, Malta | Take-home assignment, discussion w/ developers\n- [Rockerbox](https://www.rockerbox.com/careers) | Remote | Phone screen with pair programming. 2 hours of pre-interview prep. 4-hour final interview with situational questions, another pair programming, and presentation and discussion of pre-interview prep outputs.\n- [Rocket Alumni Solutions](https://rocketalumnisolutions.com) | Remote; Boston, MA | One pair programming session, total 2-3 hours of interviews with leadership.\n- [Rocket Travel](https://about.rocketmiles.com) | Remote; Chicago, IL; New York, NY | Pair programming, take home project (2-4 hours), 3-4 hour final interview with mix of high level technical, product, and cultural/behavioral sessions.\n- [Rockode](https://www.rockode.com) | Bangalore, India | Real world assignment, group hack session, discussions\n- [Rose Digital](https://rosedigital.co) | New York, NY | Phone conversation followed by pair coding components that mirror day to day work, in person discussion about code, take home project if needed for more info\n- [Ruangguru](https://career.ruangguru.com) | Jakarta, Indonesia / Yogyakarta, Indonesia / Malang, Indonesia / Bandung, Indonesia | Phone screening with technical recruiter --> live coding with an engineer --> panel interview with related engineers (Test Engineers, Frontend Engineers, Backend Engineers, etc) --> final interview with VP of Engineering\n- [RubyGarage](https://rubygarage.org) | Dnipro, UA | Take-home project, code review and discussion on-site\n- [Runtastic](https://www.runtastic.com) | Linz, Austria; Vienna, Austria | Video call with recruiting staff, take home project, video call for code review, discussion, questions\n- [RVU](https://www.rvu.co.uk/careers) | London, UK | Also known as Uswitch / Money.co.uk / Bankrate, small take-home project related to our business area, followed by open book pairing with developers to extend it followed by Q&A session to discuss your experience.\n\n## S - U\n\n- [SafeButler](https://www.safebutler.com) | San Francisco, CA | Take-home project, then an on-site or remote interview with a review, pair programming, and culture fit discussions\n- [Sahaj Software](https://www.sahaj.ai) | Bangalore, India; Chennai, India; Pune, India; Melbourne, Australia; London, UK; San Jose, CA | Take home code + Pairing + Discussion\n- [Sailing Byte](https://sailingbyte.com) | Rumia, Poland | Technical interview, Take-home Task\n- [Sakari](https://sakari.io) | San Francisco, CA | Phone screen, programming assignment related to Sakari business (communications) with pair programming element, team and culture fit\n- [SaleCycle](https://www.salecycle.com/careers) | Durham, UK; Brighton, UK | Phone screen, face-to-face discussion with developers, optional pairing session and discussion\n- [Salesfive](https://www.salesfive.com/jobs) | Munich, Germany; Berlin, Germany | Phone screen, Phone Interview with developer to discuss code and challenges, Take home challenge if necessary. Onsite visit\n- [Salesloft](https://salesloft.com) | Atlanta, GA | Phone interview, take-home project, cultural-fit interview, technical interview where candidate modifies take-home project\n- [SC5 Online](https://sc5.io/careers) | Helsinki, Finland; Jyväskylä, Finland | Take-home assignment (intentionally short, takes at most an hour to complete), discussion and review assignments\n- [Scapic](https://scapic.com/careers/) | Bangalore, India | Short takehome project + phone interview\n- [Schibsted Tech Polska](https://www.schibsted.pl) | Gdańsk, Poland | Phone screen, take-home exercise, code review and technical discussion\n- [SearchApi](https://www.searchapi.io) | Remote | Culture interview, take-home coding challenge and technical interview\n- [Seesaw](https://boards.greenhouse.io/seesaw) | Remote | Technical challenges based on real world problems\n- [Segment](https://segment.com) | San Francisco, CA; Vancouver, Canada | Phone interview, take-home assignment (small fun project), onsite interview (technical + core/culture) -> intended to set you up for success\n- [SEITENBAU](https://www.seitenbau.com/karriere/aktuelle-jobangebote) | Konstanz, Germany | Peer recruiting; conversational interviews (video call or face-to-face) with other developers and HR focussing on motivation, attitude, skills; possibly 2nd face-to-face interview meeting with additional team members\n- [Sendyne](https://www.sendyne.com) | New York City, USA | Phone screen, on-site with team members. Review of past experiences + questions regarding real problems.\n- [Sensor Tower](https://sensortower.com/jobs) | San Francisco, CA | Phone call, on-site interview including discussion about projects/skills and a short real-world programming challenge\n- [Sensu](https://sensu.io) | Remote | Video call, choice of pairing session or take home programming assignment\n- [Séntisis](http://sentisis.com/trabaja-con-nosotros) | Madrid, Spain; Mexico City, Mexico; Bogotá, Colombia; Santiago de Chile, Chile; Remote | Phone call, on-site/remote interview including discussion about projects/skills and a short real-world pair-programming exercise\n- [SerpApi](https://serpapi.com) | Austin, TX / Remote | Skype core value and culture interview, review of contributions on GitHub or other platforms, and take-home project if online contributions are not enough.\n- [Sertis](https://sertiscorp.com) | Bangkok, Thailand | Technical & culture fit interview, take-home project, follow-up discussion\n- [Setapp Sp. z o.o.](https://setapp.pl/career) | Poznan, Poland | Online/face-to-face discussion with developers about everyday programming dilemmas & reviewing your own code\n- [Sharoo](https://www.sharoo.com/jobs/) | Zurich, Switzerland; Remote | Soft skills interview, take home project, technical interview based on take home project.\n- [Ship&co](https://www.shipandco.com/en/) | Remote / Kyoto, Japan | Casual non-technical interview with the CEO. One hour technical discussion with lead developer about software development, skills and past experience. Three months paid trial period.\n- [Shogun](https://getshogun.com) | Remote | Discussion about software development and past experience, code samples, paid trial period.\n- [Shortcut](https://shortcut.com/careers) | New York, NY & Remote | Phone interview, followed by onsite discussions and pair programming\n- [Showmax](https://blog.showmax.com/engineering-careers) | Beroun, Czechia; Prague, Czechia; Remote | Take home project, then a pair-programming and discussion onsite / Hangouts round.\n- [ShuttleCloud](https://shuttlecloud.com/jobs) | Chicago, IL / Madrid, Spain | Take-home project, then on-site code walk through and a real world problem discussion.\n- [Signal AI](https://www.signal-ai.com/about-us/careers) | London, UK | Phone screen; take home code exercise; on-site code extension with pair programming and discussion\n- [SigNoz](https://signoz.io) | Bangalore, India; Remote | Intro round to explore interests, 1-2 Technical interviews that resembles a problem SigNoz solves for, then product round to discuss on industry and problems which SigNoz is solving.\n- [Simpli.fi](https://www.simpli.fi/about-us/careers) | Fort Worth, TX, USA | Takehome code challenge and review\n- [SimpliField](https://www.welcometothejungle.co/companies/simplifield/jobs) | Lille, France | Interview with the CTO and the developer team\n- [Simply Business](https://www.simplybusiness.co.uk/about-us/careers/tech) | London, UK / Remote | Three stage, one day interview with quick feedback. One of the stages is 1.5h pair-programming session, where interviewee is assigned a task and interviewing developer plays role of Product Owner.\n- [Sixfold](https://sixfold.com/careers) | Tallinn, Estonia; Tartu, Estonia; Vienna, Austria | 3-4 stages: 1st interview with HR and an engineering lead, 2nd a test-task to solve at home, 3rd technical discussion & feedback on the test-task, 4th optional meeting with further engineering leads to find best fitting team.\n- [Sixt](https://www.sixt.jobs/en) | Munich, Germany | 4 stages: 1st HR, 2nd take-home project, 3rd follow-up discussion, 4th on-site interview with team plus HR\n- [Skylight Digital](https://skylight.digital/join/) | Remote | Screening call to determine general interest, 1.5 hour pair programming exercise based on realistic scenario, EQ interview.\n- [Skyrise Pro](https://www.skyrisepro.com) | Chicago, IL | Take-home coding project, on-site interview including coding enhancements to the take-home project, offsite group activity\n- [Slack](https://slack.com/jobs) | San Francisco, CA | Call with recruiter, 1 week take-home project, call with hiring manager, on-site interview covering high-level system design, best software development practices and culture-fit\n- [Small Improvements](https://www.small-improvements.com/careers) | Berlin, Germany\n- [Smartia](https://smartia.tech) | Bristol, UK; Remote | Take-home real world project to complete, call with head of engineering, culture fit with CEO and COO\n- [Smartly.io](https://www.smartly.io/developer) | Helsinki, Finland | Discussion with recruiter and developers and a pair coding exercises\n- [Smile.io](https://smile.io/careers) | Kitchener, Canada / Remote | Take-home real world project, interviews with HR and engineering team\n- [Snyk](https://snyk.io/jobs) | London, UK; Tel Aviv, Israel | Take home task, then a pair coding on it\n- [Social Tables](https://www.socialtables.com) | Washington, DC | Chat about skills and past experiences + bring in a code sample from previous work or side project to discuss\n- [Softwear](https://softwear.nl/vacatures) | Amsterdam, Netherlands | Writing software for the fashion industry – remotely – in an international team.\n- [Sogilis](https://sogilis.com) | Grenoble, France | Discussion about interests, practices, and motivation. Presentation/code review/pair programming on a personal or professional project.\n- [Sourcegraph](https://about.sourcegraph.com/jobs) | San Francisco, CA & Remote | Tailored to the candidate, often consists of take-home work, discussion of real-world eng challenges, and product familiarity.\n- [Splice](https://jobs.splice.com) | New York, NY; Remote | Call with recruiter, 4 hr take-home project, video interview w two engs on take-home exercise, video call with hiring manager, video call w VPE & principal eng to talk about architecture.\n- [Splyt](https://careers.splyt.com) | London, UK; Singapore, Singapore; Kuala Lumpur, Malaysia; Tokyo, Japan | Initial screening with recruiters from hr department, take home assessment (React + Node.js), followed by remote/on-site interviews with hiring manager and CTO about the assessment, system design/architecture, and cultural fit.\n- [Spreedly](https://www.spreedly.com/jobs) | Durham, NC | Take-home project [related to business](https://engineering.spreedly.com/blog/programming-puzzles-are-not-the-answer-how-spreedly-does-work-samples.html)\n- [Springer Nature (Asia)](https://www.natureasia.com) | Tokyo, Japan | Discussion & Pair programming session\n- [Springer Nature Digital](https://sndigital.springernature.com) | Berlin, Germany; London, UK | Phone chat; take-home project; then a pairing session based on the project, a technical chat, and a chat with non-technical team members\n- [SpronQ](https://spronq.com) | Amsterdam, Netherlands | Takehome coding challenge\n- [Squadcast](https://www.squadcast.com/careers) | Bangalore,India | Phone screening, technical interview, Founder Interview.\n- [Square](https://squareup.com/careers) | San Francisco, CA | Pair programming in a work environment\n- [Square Sense](https://square-sense.com) | Paris, France | Short phone screen to confirm the interest, take-home project (similar to some of our existing software), a pair-programming interview where we will make some changes to the same project\n- [Srijan Technologies](https://srijan.net) | Delhi, India | General high level questions/discussion followed by Pair programming OR take-home coding challenge\n- [Stacc](https://stacc.com) | Norway, Bergen | Open-Ended Take Home Assignment (UX and/or Coding in your preferred language) followed by a high-level discussion and reflection upon the process with senior engineers.\n- [Stackgenie](https://stackgenie.io) | London, UK / New York, US / Trivandrum, India / Remote | Real-world take-home project, video interviews with HR and the engineering team.\n- [Stardog Union](https://stardog.com) | Washington, DC; Remote | Technical discussion and general interest conversations\n- [StartDee](http://startdee.com) | Bangkok, Thailand | Phone screening with technical recruiter --> live coding with an engineer --> panel interview with related engineers (Test Engineers, Frontend Engineers, Backend Engineers, etc) --> final interview with VP of Engineering\n- [StashAway](https://www.stashaway.sg/careers) | Singapore, Malaysia & Remote | Take Home Technical Task (broken down to frontend or backend focused), Database Architecture Case Design round, Peer-to-Peer (P2P) team round, and Management Interview\n- [Statflo](https://statflo.com) | Toronto, Canada | Phone screening, take home project, on-site interview discussing the take home project, high-level architectural brainstorm, and questions about career and team work.\n- [store2be](https://www.store2be.com/en/pages/jobs) | Berlin, Germany | Skype/on-site interview, take-home project\n- [Storm](https://www.stormx.io/about#jobs) | Seattle, WA; Remote | Phone/skype screen --> Take-home coding assignment --> on-site/skype interview loop to discuss assignment; meet-and-greet with other teams --> +1/-1 based on team consensus\n- [Storytel](https://jobs.storytel.com/departments/tech) | Stockholm, Sweden; Lund, Sweden; Karlstad, Sweden; Umeå, Sweden; Copenhagen, Denmark | Our process has few stages: a social interview with HR and 1-2 future teammates; a small take-home project followed by a technical discussion with 2-3 future colleagues. All stages can be in-person in one of our offices or via Google Meet\n- [Stride Consulting](https://www.stridenyc.com) | New York, NY / Chicago, IL | Phone Screen, Agile and Technical Overview, a Pairing session, and architecture interview on previous experience.\n- [Structura Biotechnology](https://structura.bio) | Toronto, Canada | Phone screening, take-home coding challenge, on-site review and discussion about past experience, and high-level architectural brainstorm\n- [STRV](https://strv.com/careers) | Prague, Czech Republic; Brno, Czech Republic; Remote | A social interview with a recruiter + take-home coding challenge followed by a technical interview session discussing your approach in solving the take-home assignment + a culture-fit interview with the head of engineering.\n- [STYLABS](https://www.stylabs.in) | Mumbai, India | Phone Screen, Take-home project and discussion on-site\n- [Subvertical (VerticalChange)](https://verticalchange.com/job_posts) | Remote | Phone screening, live pair programming & personal project code review\n- [Sulvo](https://sulvo.com/careers) | New York, NY / Remote | Interview over video call for cultural fit first, if you pass we proceed with technical interview that doesn't include coding games or challenges\n- [Summitto](https://careers.summitto.com) | Amsterdam, Netherlands | take-home coding challenge and on-site interview\n- [SumUp](https://www.sumup.com/careers/) | London, UK | Five-stages interview process. The first stage is with HR. The second stage is with the Engineering manager - discussion about general engineering knowledge and past projects. The third stage is take-home assignment. The fourth stage is a discussion of the take-home assignment solution with two engineers. The fifth stage is a behavioural interview structured around company values.\n- [SuperAwesome](https://www.superawesome.com) | London, UK | Short recruiter phone screen, take-home exercise, follow up system design and cultural interview focused on your past experience.\n- [Superplayer](https://superplayer.fm) | Porto Alegre, Brazil | Skype/On-site interview, take-home project and interview with CTO and CEO\n- [Surglogs](https://surglogs.com/careers/slovakia/) | Remote | (Europe timezone) Phone screen, take-home assignment with a follow-up call, or live coding focused on building simple real-world scenarios (based on your preference), culture-fit call with team and CTO.\n- [SurveySparrow](https://surveysparrow.com/careers) | Kochi, India | Skype interview, take home project and code review, interview with CTO and CEO\n- [Svix](https://www.svix.com) | Remote | Take home project, an interview to discuss the project, and a cultural fit interview.\n- [SVTi (Sveriges Television)](https://svti.svt.se) | Stockholm, Sweden | On-site interview, take-home project, follow up interview where you walk through how you chose to solve the task.\n- [SweetIQ](https://sweetiq.com/about/careers) | Montreal, Canada | Discussion and general, high level questions\n- [Swiftly](https://www.swiftly.com/about/careers) | Seattle, WA; San Francisco, CA | Take-home coding project, design principles discussions, collaborative problem solving\n- [Swisscom](https://www.swisscom.ch/en/about/career.html) | Rotterdam, The Netherlands | A mix of behavioural, technical and cultural interview, take-home project, project review with engineers from different teams and cultural interview with staff members.\n- [Symphony Commerce](https://www.symphonycommerce.com/careers) | San Francisco, CA / Remote | Take-home project (phone), design discussion, review and critique _our_ code, debugging questions\n- [Symplicity](https://www.symplicity.com/about/join-us) | Arlington, VA | Take-home project and code review in-person\n- [SysGarage](https://sysgarage.com) | Buenos Aires, Argentina | Take-home project and real world pair programming\n- [TableCheck](https://www.tablecheck.com/en/company/jobs/) | Tokyo, Japan | Show us your code! Brief call then take-home project or pairing for those without code.\n- [Tailor Brands](https://tailorbrands.com/jobs) | Tel Aviv-Yafo, Israel | Discuss knowledge and interests, explore previous work experience, during the technical interview we discuss real-life problems.\n- [tails.com](https://tails.com/careers) | Richmond (London), UK | Live pair programming or take home project with review\n- [Take Homes](https://takehomes.com) | San Francisco, CA & New York, NY | Take-home project based on a real-world problem, administered on their own platform, followed by a pair programming session, also on their platform, which builds on the initial project\n- [Take-Two Interactive](https://careers.take2games.com) | Bengaluru, India; Vancouver, Canada; London, UK; Singapore, Singapore; CA, NY, WA: United States | Data Engineering, Recruiter screening, followed by 1 round of fitment discussion, followed by a take home assignment(similar to actual work), followed by 1 round involving assignment solution discussion, programming language specific questions, and other role specific technical questions, followed by hiring manager discussion.\n- [takeaway.com](https://careers.takeaway.com) | Enschede, Netherlands & Berlin, Germany | Discussion and general, high level questions\n- [Tandem](https://www.madeintandem.com) | Chicago, IL; San Francisco, CA | Introductory phone screen, take-home project, take-home project phone review, a few hour-long pairing sessions on real projects.\n- [Tanooki Labs](https://tanookilabs.com) | New York, NY | Paid half-day take home project with followup review and discussion\n- [Tara AI](https://tara.ai/about/careers) | San Jose, CA | On-site interview with a deep dive into appropriate technology and our problem space. The same sort of problem solving you would do with peers after a standup\n- [Tattoodo](https://www.tattoodo.com) | Copenhagen, Denmark | Takehome exercise\n- [Taxdoo](https://www.taxdoo.com/#/jobs/) | Hamburg, Germany | On-site interview, little takehome exercise, followup review/interview\n- [Teamwork.com](https://www.teamwork.com) | Remote; Cork, Ireland; Belfast, UK; Wilmington, USA | Initial conversation, remote values interview, takehome exercise, followup review/interview\n- [Ten Thousand Coffees](https://tenthousandcoffees.com) | Toronto, Canada | Take home project, then explain how you solved the project\n- [Teraki](https://www.teraki.com) | Berlin, Germany | Pair programming exercise, 45min to 3h according to seniority and role.\n- [Tes](https://engineering.tes.com/recruitment/) | Remote; London, UK | Remote pair programming session on React/Node kata with small takehome exercise as prep. Remote interview with senior engineers about previous experience, technical knowledge and interests.\n- [Tesco PLC](https://www.tesco.com) | London, United Kingdom | Pair programming and casual hypothetical system design discussion\n- [Test Double](https://testdouble.com/careers) | Remote | Initial conversation, Consulting interview, Technical interview, Pair programming, Takehome exercise.\n- [Textio](https://textio.com/careers/?utm_source=github&utm_medium=forum&utm_campaign=textio-careers-engineering&utm_content=poteto-hiring-without-whiteboards) | Seattle, WA | Initial screen to discuss experience and interest in a role at Textio; then a take-home programming task is discussed during a 1-hour tech screen (on-site or remote); finally a larger take-home project, simulating real work, is discussed during an on-site presentation plus 1-1s; [How we hire](https://textio.ai/how-we-hire-a74cdbadd1e8)\n- [The Book of Everyone](https://thebookofeveryone.workable.com) | Barcelona, Spain | Quick interview, meet the team, pairing with developers on your own project\n- [The LEGO Group](https://lego.com) | Billund, Denmark; Copenhagen, Denmark; Enfield, USA; London, UK | First meeting to discuss interests, the team, and general questions. Next take-home case study/project, followed by another meeting discussion the high level solution with focus on the process and thoughts behind the solution.\n- [The Zebra](https://www.thezebra.com/about/careers/) | Austin, TX | Take-home coding challenge with in-person review and pair programming.\n- [Thinkmill](https://www.thinkmill.com.au) | Sydney, Australia | Initial meet and greet interview with Thinkmillers from the relevant team, take home assignment followed by tech review on a followup interview.\n- [Thinslices](https://www.thinslices.com) | Iasi, Romania | Takehome exercise & in person pair programming on a simple Kata.\n- [thoughtbot](https://thoughtbot.com/jobs) | San Francisco, CA; London, UK | [Our interview process](https://thoughtbot.com/playbook/our-company/hiring#interviewing)\n- [ThoughtWorks](https://www.thoughtworks.com/careers) | San Francisco, CA | Interviews with ThoughtWorkers of diverse backgrounds and roles; take home assignment followed by in person pairing session.\n- [ThoughtWorks Singapore](https://www.thoughtworks.com/careers/singapore) | Singapore, Singapore | Interviews with ThoughtWorkers of diverse backgrounds and roles; Simple, live paired coding exercise in language of choice focused on clean code, not speed. Followed by refactoring paired interview, and technical discussion on modelling and system design, tech depth & breadth and team leading skills (if applicable).\n- [Thread](https://www.thread.com/jobs) | London, UK | Take home test, real world architecture design, real world pair programming.\n- [ThreatSpike Labs](https://www.threatspike.com) | London, UK | Take home computing and security related challenges to be completed over a week.\n- [Tilde](https://www.tilde.io) | Portland, OR | Pair programming sessions with each member of the team, working on problems similar to daily work.\n- [Timbuktu](https://www.timbuktutravel.com) | Cape Town, South Africa | On site interview and pair programming exercise\n- [Tipalti](https://tipalti.com) | Glil-Yam, Israel | Real-world design and coding challenges\n- [Titanium](https://titanium.codes) | Moldova, Chisinau | High level review of public activity on GitHub/BitBucket/Gitlab (if applicable) and screening via phone, On-site technical & Team fit interview, Formal \"Meet the Team\" meeting\n- [Toggl](https://toggl.com/jobs) | Remote / Tallinn, Estonia | Online test on basic programming skills, followed by interview (typically includes get-to-know questions and technical skill testing). Depending on the team, there may be a take-home or live coding assignment. **Paid test week** to work with the team on actual bugs/features.\n- [Tooploox](https://www.tooploox.com/careers) | Warsaw, Poland; Wroclaw, Poland; Gdansk, Poland; Remote | Team fit interview and then take-home project. Next on-site or remote interview consisting of discussion and live coding based on the delivered code. Focusing on high level questions, architecture and design decisions.\n- [Toowoxx](https://toowoxx.de/index.php/karriere/) | Deisenhausen, Germany & Ulm, Germany | Short interview with general questions, on-site programming challenge, code review of result\n- [Top Hat](https://tophat.com/company/work-with-us/) | Remote / Toronto, Canada | Short coding challenge inspired from the day-to-day problem space followed by a longer frontend or backend pairing design and implementation exercise\n- [Toucan Toco](http://toucantoco.com/fr/team#jobs) | Paris, France | Pair-programming and TDD\n- [Touché](https://gotouche.com) | Singapore, Singapore; Barcelona, Spain | Skype / Phone / on-site interview, take-home project, technical interview to discuss the project, team interview.\n- [TrademarkVision](https://trademark.vision) | Brisbane, Australia | On site interview and quick take-home exercise\n- [TrainHeroic](https://trainheroic.com/careers/) | Boulder, CO; Denver, CO | Phone screen, take home project, remote and on-site interviews for technical and cultural fit\n- [TrainingPeaks](https://www.trainingpeaks.com/careers.html) | Boulder, CO; Denver, CO | Phone screen, take home project, remote and on-site interviews for technical and cultural fit\n- [Transparent Classroom](https://www.transparentclassroom.com) | Seattle, WA; Remote | Phone screen, 1 hr pairing on toy problem, 4 hr pairing on real code, full-day paid stage\n- [Trendency](https://trendency.hu) | Budapest, Hungary | Technical interview with a lead developer discussing past experience and tech related to the job, then culture fit/add interview with the CTO. Max 1 hour long sessions, both can be done via video call or on-site with friendly atmosphere\n- [TripStack](https://www.tripstack.com) | Toronto, Canada | Take-home assignment, followed up by a face to face code walk through\n- [Trivago](https://www.trivago.com) | Düsseldorf, Germany | Case Study, Skype Interview, On site Interview with some code review exercises\n- [Trōv](https://boards.greenhouse.io/trov) | Remote | Take-home project with followup interview from actual prospective teammates\n- [Truefit](https://truefit.io/about/) | Pittsburgh, PA | Phone screen, Take-home project, In-person interview with the team that you would join\n- [Truora](https://www.truora.com) | Bogotá, Colombia; Cali, Colombia; Remote | Take-home project, followed by phone interview with tech leads to discuss the project.\n- [Truss](https://truss.works/jobs) | San Francisco, CA; Remote | Phone screen/ Take-home project that resembles a problem Truss has seen many times before / Followup interview about the project / Closing Interview, all interviews done remotely\n- [TuneIn](https://www.tunein.com) | San Fransisco, CA | High level screening over the phone or on-site, take home project, code review and discussion\n- [Twistlock](https://www.twistlock.com) | Tel Aviv, Israel | Takehome\n- [Typito](https://typito.com/go) | Bangalore , India | Take home assignment project with options for focus in frontend or backend work. First interview round based on the project submitted, may require to do some edits or add further feature based on discussion , live during interview. Second round mostly specific to overall system engineering and discussion regarding solutions to common backend/frontend engineering problems.\n- [uberall](https://uberall.com/en/careers) | Berlin, Germany | 30-min coding on-site, then a trial day\n- [Ubots](https://ubots.com.br) | Porto Alegre, Brazil | Skype/On-site interview, take-home project, technical interview\n- [Unbounce](https://unbounce.com) | Vancouver, BC | Phone screen, take-home project, project discussion, technical interview\n- [Unboxed](https://unboxed.co) | London, UK | Take home feature requests, pairing with developers to extend solution, team-fit interviews, chat with a director\n- [Unearth](https://www.unearthlabs.com/careers) | Seattle, WA | Take home project, team-fit interviews, technical discussion\n- [Unito](https://unito.io/careers/) | Montreal, Canada | Team-fit interviews, technical discussion, paid take home project paired with developers.\n- [Untappd](https://www.untappd.com) | Wilmington, NC; New York, NY; Los Angeles, CA | Review portfolio - What projects have you worked on? + personality assessment, + interview\n- [Updater](https://www.updater.com/jobs/openings) | New York, NY | Begin-at-home assignment highly relevant to role, presented and discussed during on-site.\n- [Upstatement](https://www.upstatement.com/jobs/) | Boston, MA; New York, NY; Remote | Phone screen, take home project relevant to our work, first round interview to discuss background and take home implementation, second round interview to meet more employees and share some of your and our recent work.\n- [Upwave](https://www.upwave.com/careers) | San Francisco, CA; Remote | Intro call, take home project, live take home project review, application / system design conversation, behavioral interview, offer!\n- [Urban Dynamics](https://www.urbdyn.com/careers) | Knoxville, TN; Vilnius, Lithuania; Remote | Phone screen, take home project ([exercises publicly available](https://github.com/urbdyn/coding_exercises)), and then interview with team.\n- [Urban Massage](https://www.urbanmassage.com/jobs) | London, UK | Project done at home, in-person walk through. Meeting the team is an integral part.\n- [UserTesting](https://www.usertesting.com/about-us/jobs) | Atlanta, GA; San Francisco, CA; Mountain View, CA | Initial interview, pair programming, and offer\n\n## V - X\n\n- [V7](https://www.v7labs.com/careers) | London, UK; Remote | Initial screen by Talent team, first technical screen (application / system design), take-home assignment and follow-up review with extra application / system design conversation\n- [Valassis Digital](https://www.valassis.com/digital-advertising) | Seattle, WA; San Francisco, CA; Lansing, MI; Hamburg, Germany | Phone screen, on-site interview with group, paired whiteboard problem solving and discussion, take-home project and follow-up review\n- [Valuemotive](https://www.valuemotive.com/career) | Helsinki, Finland | Code examples from previous projects (work or hobby) or take-home exercise\n- [Vance](https://www.vance.tech/careers) | Bangalore, India | A take-home exercise followed by two rounds of interviews: the first with a team member focusing on technical skills and practical problem-solving, and the second with the Head of Engineering, also centered on technical expertise and real-world challenges.\n- [Varsity Tutors](https://www.varsitytutors.com) | Remote | Take home assignment, presentation of assignment, live code review with team. Advanced / high-level chat with team based on skillset and role.\n- [Vayu Technology](https://vayu.com.au) | Sydney, Australia; Kathmandu, Nepal | Short interview, general programming questions and short take home challenge.\n- [Vena Solutions](https://careers.venasolutions.com) | Toronto, Canada | Phone screen, on-site pair-programming and code-review exercise on a real-world problem\n- [Venminder, Inc.](https://www.venminder.com) | Elizabethtown, KY; Louisville, KY | Initial phone screen to explain position. If candidate interested they get a take home assignment followed by a non-scripted in-person interview with team members to judge personality fit.\n- [Verloop](https://verloop.io) | Bengaluru, India | A take home programming exercise and technical discussion\n- [Verve](https://verve.co/careers) | London, UK | An intentionally short, take home exercise that mirrors real project work and incorporates code review elements\n- [Verve Industrial Protection](https://verveindustrial.com/why-verve/careers) | Madison, WI / Remote | Phone screen, project discussion and tooling experience overview in panel interview with team, practical shared-editor coding problem and relevant architectural challenge in hands-on interview\n- [Vingle](https://careers.vingle.net) | Seoul, Korea | Written interview, takehome project, in-person, conversational code review and interviews with engineers and engineering managers\n- [Vinta Software](https://www.vinta.com.br/careers/) | Recife, Brazil | Culture fit interview, architectural challenge, take home project, and pairing over work sample\n- [virtual7](https://virtual7.de/de/karriere) | Kalrsruhe, Germany | Phone interview and on-site interview based on personal experience.\n- [Virtually Human](https://www.vhslab.com) | Remote | Take home assignment, Short interview around the assignment and past experience.\n- [Visma e-conomic](https://www.e-conomic.dk/om/job) | Copenhagen, Denmark | Take home assignment, assignment presentation and discussion\n- [Vitality South](https://vitalitysouth.com) | Tupelo, MS | Take home project, code review, and in-person discussion\n- [Voltra Co.](https://voltra.co) | Amsterdam, Netherlands / New York, NY / Remote | Show us your github account, tell us what you know. Let's pair on an OSS PR!\n- [VSX](https://https://vsx.net/jobs) | Dresden, Germany | On-site interview, home coding challenge, presentation/discussion of proposed solutions\n- [VTEX](http://lab.vtex.com/careers) | Rio de Janeiro, Brazil | Take-home project, Skype interview and then in-person talk.\n- [VTS](https://buildingvts.com) | New York City, New York | Technical Phone Screen, Pair programming on-site & in-person talks with multiple engineers\n- [Wallapop](https://apply.workable.com/wallapop/) | Barcelona, Spain | Intro call, technical take-home project OR tech repository you feel proud that highlights your skills for the job, practical interview and finally a competency interview\n- [Waymark](https://waymark.com/jobs) | Detroit, MI | Technical phone screen, take-home project, going over the project in person, follow up day in the office\n- [Wealthsimple](https://www.wealthsimple.com/work-with-us) | Toronto, Canada | Pair programming on a problem similar to daily work, discussion of system design\n- [WeAreHive](http://www.wearehive.co.uk) | London, UK | Just walk us through your best code or we give you a small real-world exercise to do at home.\n- [Webantic](https://webantic.co.uk/careers) | Manchester, UK | Basic TNA self-assessment and real-world problem-solving\n- [Webflow](https://webflow.com) | San Francisco, CA & Remote | Short take-home challenge, followed by a paid 3-5 day freelance contract project\n- [Weedmaps](https://weedmaps.com/careers) | Irvine, CA; Denver, CO; Tucson, AZ; Madrid, Spain; Remote | Phone screen, Group interview, and possible code review\n- [Wells Fargo (Technology Program)](https://www.wellsfargojobs.com/en/university-programs/undergraduate-programs/) | San Francisco, CA; Charlotte, NC; Des Moines, IA; Minneapolis, MN; Phoenix, AZ; St. Louis, MO | One round , Behavioral + One simple System Design Question + Questions for your resume\n- [wemake.services](https://wemake.services) | Remote | Short unpaid take-home challenge, code review, portfolio discussion\n- [WeMod](https://wemod.com) | Remote | Take-home & presentation / code review, resume discussion\n- [Wend](https://www.wend.nl) | Amsterdam, Netherlands | Face to face interview followed by a take-home assignment\n- [Weploy](https://www.weployapp.com/join-our-team/) | Melbourne, Australia; Sydney, Australia | Phase 1: Face to face interview to get to know the candidate. Phase 2: Problem solving session that involves designing a solution to a real-world problem followed by 1/2 day of pairing with a senior dev on implementing the proposed solution.\n- [WeTransfer](https://wetransfer.com/jobs) | Amsterdam, Netherlands | Culture fit and fundamentals chat, skills interview - no whiteboarding! - and take-home project, communication and collaboration interview, meet with the VP of Engineering\n- [Wheely](https://wheely.com/en/careers) | Moscow, Russia | Get to know each other in under 30 minutes on-site or via Skype, take-home challenge, on-site review and interview with the team.\n- [Wikimedia Foundation](https://wikimediafoundation.org/about/jobs/) | Remote | Cultural fit interview, about one hour of discussing possible solutions for real problems the team you are applying to could face. Not right or wrong answers, more of a brainstorming with two engineers who will evaluate how your problem solving workflow works.\n- [Windy.com](https://windy.com) | Prague, Czechia | Talk and write small program on a computer\n- [Wirecard Brasil](https://wirecardbrasil.workable.com) | São Paulo, Brazil | Phone or on-site Cultural Fit interview, take-home coding challenge, code review and discussing in-person.\n- [Wiredcraft](https://wiredcraft.com) | Shanghai, China | Phone or on-site interview, take-home coding challenge, code review and discussing in-person.\n- [WorldGaming](https://worldgaming.com) | Toronto, Canada | Technical Interview, Solution Design, Take Home Assignment, then Culture fit interview with the team\n- [WyeWorks](https://wyeworks.com) | Montevideo, Uruguay | Take-home project and discussion on-site\n- [X-Team](https://x-team.com) | Remote | A short, fun Node.js challenge, followed by a series of culture-based interview questions, followed by a creative mock project with tons of freedom on how to approach, and follow-up questions about the approach they chose to discuss the tradeoffs. Usually a 10-30 day paid training is rewarded to top candidates to prep them for remote communication skills needed to join a team.\n- [Xebia Security](https://xebia.com/careers/security/) | Hilversum, Netherlands | Culture fit, Technical interview, followed by take-home security project, on-site brainstorm session to discuss the solutions and approach.\n- [XING](https://www.xing.com) | Hamburg, Germany | Take-home coding challenge, on-site review and short interviews with future team.\n- [Xplor](https://ourxplor.com) | Melbourne, Australia; London, UK | Phone Cultural Fit interview, Take home-code challenge, pair-programming session and discussion about past experience\n\n## Y - \\#\n\n- [18F](https://18f.gsa.gov/join/) | Remote; Washington, DC; New York, NY; Chicago, IL; San Francisco, CA | take-home coding exercise (2-4 hours), technical and values-match interviews over video chat\n- [21st Real Estate](https://21re.de) | Berlin, Germany | Phone call for quick personal introduction followed by Video call interview. Finally, a pair-programming session on-site.\n- [23 Technologies](https://23technologies.cloud) | Remote | Three video calls: general introduction, team introduction, contract\n- [3BoxLabs](https://3boxlabs.com) | Remote | Intro call, resume walk-through, and finally live work exercise with ~2 hours independent work followed by ~1.5 hour debrief discussing the work with the rest of the team.\n- [3D Hubs](https://3dhubs.com/jobs) | Amsterdam, The Netherlands | Take-home code challenge from our product's domain followed by discussion remote/on-site, sometimes do an additional on-site pair programming session.\n- [47 Degrees](https://47-degrees.breezy.hr) | Remote; Seattle, WA; Madrid, ESP; Cadiz, ESP; London, UK | Questions related to implementation of specific projects using popular functional programming libraries and techniques and a discussion about the tradeoffs. Discussion of past open-source projects/contributions and future open-source goals. **Note:** This company looks for people who have modern functional programming experience in Haskell, Scala, Swift, or Kotlin and it looks for people who have existing open-source contributions in those fields so the roles can be a bit self-selecting.\n- [4Degrees](https://4degrees.ai/about/) | Chicago, Illinois | Collaborative pair-programming exercise done through video chat that's representative of the responsibilities of the job then a take-home programming task.\n- [500Tech](https://500Tech.com) | Tel Aviv, Israel | Pair programming on a laptop in working env\n- [5Minds](https://5minds.de) | Remote; Gelsenkirchen-Buer, DE | Coding exercise via GitHub, you are interviewed by a developer and a team lead, there is no live coding.\n- [8th Light](https://8thlight.com) | Chicago, IL; London, UK; Los Angeles, CA; New York, NY | Take home code challenge, discussion, pair programming session\n- [YLD](https://www.yld.io/join-us) | London, UK; Lisbon, PT; Porto, PT & Remote | Take home-code challenge, pair-programming session and discussion about past experience\n- [Yodas](https://yodas.com) | Binyamina, Israel | Coding tasks over github repository\n- [YouGov](https://yougov.com) | Remote; San Francisco, CA; London, UK; Warsaw, Poland; Mumbai, India; Hong Kong, China | Coding exercise sometimes over github repository, at least 1 interview with a developer and a lead, no live coding.\n- [Yoyo Wallet](http://yoyowallet.com) | London, UK | Take home code challenge, discussion of the code challenge, and general, high level questions\n- [YunoJuno](https://www.yunojuno.com) | London, UK | Code challenge based on a realistic feature request on a real open-source package created and used at YunoJuno; phone/video interview with members of the Product team to explore technical background, experiences, interests, cultural fit; on-site interview, usually with Product Manager and CTO.\n- [ZAP Group](https://jobs.kenoby.com/grupozap/) | São Paulo, Brazil | Takehome exercise; a series of real-world interviews with engineers, HR, engineering managers and product managers on site.\n- [Zapier](https://zapier.com/jobs/) | Remote | Recruiter interview, take-home project, code review of the take-home project, technical discussions with hiring manager and engineers from the team, and a values interview.\n- [Zencargo](https://www.zencargo.com/careers) | London, UK | Initial interview with CTO, covering professional experience interests and expectations, followed by one technical interview focused on fundamentals and familiarity with best practices. A further short chat with co-founders to get to know each other - either onsite or remote.\n- [Zenefits (UI Team)](https://www.zenefits.com/careers) | San Francisco, CA | One technical phone screen focused on JS fundamentals and/or one timeboxed take-home challenge. The onsite is a series of interviews designed to test your understanding of JS, HTML/CSS, design, etc.\n- [Zensurance](https://www.zensurance.com/careers) | Toronto, Canada; Remote | Timeboxed take-home challenge representative of the types of challenges faced day-to-day, and zoom chats with recruiter / hiring managers.\n- [Zerodha](https://zerodha.com/careers) | Bengaluru, India | Technical call at the beginning and one take home programming task.\n- [Zweitag](https://www.zweitag.de/karriere) | Münster, Germany & Remote | Get-to-know call, take-home task representative to our problems, on-site pairing and discussion, and mentoring throughout the process with talks for aligning expectations.\n\n## Also see:\n\n- [They Whiteboarded Me!](https://they.whiteboarded.me)\n\n[![Node.js CI](https://github.com/poteto/hiring-without-whiteboards/actions/workflows/node.js.yml/badge.svg)](https://github.com/poteto/hiring-without-whiteboards/actions/workflows/node.js.yml)\n"
        },
        {
          "name": "RECOMMENDATIONS.md",
          "type": "blob",
          "size": 1.01,
          "content": "# Recommendations for companies that do \"whiteboard\" interviews\n\nHave a suggestion? Please contribute to this doc!\n\n- Instead of using questions that bear no resemblance to the role, adapt the question so that it does. A screening question can be easily adapted so that it applies a \"real world\" requirement\n- Take-home exercises can be good. Please try to:\n  - pay the candidate for their time\n  - time-box them (e.g. under 4 hours)\n  - only allow use of the standard library\n  - keep it work-related. If their work will primarily be modifying an existing codebase, give them existing code to modify. If it will primarily involve creating new services from scratch, have them build something from scratch.\n- Give the candidate options:\n  - Some candidates might not have the time necessary to complete a take-home exercise. In those scenarios, allow the candidate to take their laptop in to perform a shorter exercise (e.g. pair program on a small issue)\n  - Some candidates prefer the whiteboard when discussing a problem, let them\n"
        },
        {
          "name": "index.js",
          "type": "blob",
          "size": 0.02,
          "content": "module.exports = {};"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 1.39,
          "content": "{\n  \"name\": \"hiring-without-whiteboards\",\n  \"version\": \"0.1.0\",\n  \"description\": \"Companies that don't have a broken hiring process\",\n  \"main\": \"index.js\",\n  \"scripts\": {\n    \"test\": \"node ./node_modules/remark-cli/cli.js README.md -f -q\"\n  },\n  \"repository\": {\n    \"type\": \"git\",\n    \"url\": \"git+https://github.com/poteto/hiring-without-whiteboards.git\"\n  },\n  \"keywords\": [\n    \"hiring\"\n  ],\n  \"author\": \"Lauren Tan <arr@sugarpirate.com> (http://www.sugarpirate.com)\",\n  \"license\": \"MIT\",\n  \"homepage\": \"https://github.com/poteto/hiring-without-whiteboards#readme\",\n  \"dependencies\": {\n    \"remark-cli\": \"^6.0.1\",\n    \"remark-lint\": \"^6.0.4\",\n    \"remark-lint-alphabetize-lists\": \"^2.0.1\",\n    \"remark-lint-hiring-without-whiteboards-links\": \"^0.3.2\",\n    \"remark-lint-no-tabs\": \"^1.0.2\",\n    \"remark-lint-no-trailing-spaces\": \"^2.0.0\",\n    \"remark-lint-no-url-trailing-slash\": \"^3.0.1\",\n    \"remark-lint-unordered-list-marker-style\": \"^1.0.2\",\n    \"remark-preset-lint-recommended\": \"^3.0.2\"\n  },\n  \"remarkConfig\": {\n    \"plugins\": [\n      \"lint\",\n      \"remark-preset-lint-recommended\",\n      \"remark-lint-no-tabs\",\n      \"remark-lint-no-trailing-spaces\",\n      \"remark-lint-unordered-list-marker-style\",\n      \"remark-lint-no-url-trailing-slash\",\n      \"remark-lint-hiring-without-whiteboards-links\",\n      \"lint-alphabetize-lists\",\n      [\n        \"remark-lint-list-item-indent\",\n        false\n      ]\n    ]\n  }\n}\n"
        },
        {
          "name": "yarn.lock",
          "type": "blob",
          "size": 65.39,
          "content": "# THIS IS AN AUTOGENERATED FILE. DO NOT EDIT THIS FILE DIRECTLY.\n# yarn lockfile v1\n\n\n\"@types/node@*\":\n  \"integrity\" \"sha512-wa09itaLE8L705aXd8F80jnFpxz3Y1/KRHfKsYL2bPc0XF+wEWu8sR9n5bmeu8Ba1N9z2GRNzm/YdHcghLkLKg==\"\n  \"resolved\" \"https://registry.npmjs.org/@types/node/-/node-11.10.4.tgz\"\n  \"version\" \"11.10.4\"\n\n\"@types/unist@*\", \"@types/unist@^2.0.0\":\n  \"integrity\" \"sha512-FvUupuM3rlRsRtCN+fDudtmytGO6iHJuuRKS1Ss0pG5z8oX0diNEw94UEL7hgDbpN94rgaK5R7sWm6RrSkZuAQ==\"\n  \"resolved\" \"https://registry.npmjs.org/@types/unist/-/unist-2.0.3.tgz\"\n  \"version\" \"2.0.3\"\n\n\"@types/vfile-message@*\":\n  \"integrity\" \"sha512-mlGER3Aqmq7bqR1tTTIVHq8KSAFFRyGbrxuM8C/H82g6k7r2fS+IMEkIu3D7JHzG10NvPdR8DNx0jr0pwpp4dA==\"\n  \"resolved\" \"https://registry.npmjs.org/@types/vfile-message/-/vfile-message-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"@types/node\" \"*\"\n    \"@types/unist\" \"*\"\n\n\"@types/vfile@^3.0.0\":\n  \"integrity\" \"sha512-b3nLFGaGkJ9rzOcuXRfHkZMdjsawuDD0ENL9fzTophtBg8FJHSGbH7daXkEpcwy3v7Xol3pAvsmlYyFhR4pqJw==\"\n  \"resolved\" \"https://registry.npmjs.org/@types/vfile/-/vfile-3.0.2.tgz\"\n  \"version\" \"3.0.2\"\n  dependencies:\n    \"@types/node\" \"*\"\n    \"@types/unist\" \"*\"\n    \"@types/vfile-message\" \"*\"\n\n\"ansi-regex@^3.0.0\":\n  \"integrity\" \"sha1-7QMXwyIGT3lGbAKWa922Bas32Zg=\"\n  \"resolved\" \"https://registry.npmjs.org/ansi-regex/-/ansi-regex-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n\n\"ansi-styles@^3.2.1\":\n  \"integrity\" \"sha512-VT0ZI6kZRdTh8YyJw3SMbYm/u+NqfsAxEpWO0Pf9sq8/e94WxxOpPKx9FR1FlyCtOVDNOQ+8ntlqFxiRc+r5qA==\"\n  \"resolved\" \"https://registry.npmjs.org/ansi-styles/-/ansi-styles-3.2.1.tgz\"\n  \"version\" \"3.2.1\"\n  dependencies:\n    \"color-convert\" \"^1.9.0\"\n\n\"anymatch@^2.0.0\":\n  \"integrity\" \"sha512-5teOsQWABXHHBFP9y3skS5P3d/WfWXpv3FUpy+LorMrNYaT9pI4oLMQX7jzQ2KklNpGpWHzdCXTDT2Y3XGlZBw==\"\n  \"resolved\" \"https://registry.npmjs.org/anymatch/-/anymatch-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n  dependencies:\n    \"micromatch\" \"^3.1.4\"\n    \"normalize-path\" \"^2.1.1\"\n\n\"argparse@^1.0.7\":\n  \"integrity\" \"sha1-c9g7wmP4bpf4zE9rrhsOkKfSLIY=\"\n  \"resolved\" \"https://registry.npmjs.org/argparse/-/argparse-1.0.9.tgz\"\n  \"version\" \"1.0.9\"\n  dependencies:\n    \"sprintf-js\" \"~1.0.2\"\n\n\"arr-diff@^4.0.0\":\n  \"integrity\" \"sha1-1kYQdP6/7HHn4VI1dhoyml3HxSA=\"\n  \"resolved\" \"https://registry.npmjs.org/arr-diff/-/arr-diff-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n\n\"arr-flatten@^1.1.0\":\n  \"integrity\" \"sha512-L3hKV5R/p5o81R7O02IGnwpDmkp6E982XhtbuwSe3O4qOtMMMtodicASA1Cny2U+aCXcNpml+m4dPsvsJ3jatg==\"\n  \"resolved\" \"https://registry.npmjs.org/arr-flatten/-/arr-flatten-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"arr-union@^3.1.0\":\n  \"integrity\" \"sha1-45sJrqne+Gao8gbiiK9jkZuuOcQ=\"\n  \"resolved\" \"https://registry.npmjs.org/arr-union/-/arr-union-3.1.0.tgz\"\n  \"version\" \"3.1.0\"\n\n\"array-iterate@^1.0.0\":\n  \"integrity\" \"sha1-TxMUj//6XydWtQRg5erI7tMaFOY=\"\n  \"resolved\" \"https://registry.npmjs.org/array-iterate/-/array-iterate-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"has\" \"^1.0.1\"\n\n\"array-unique@^0.3.2\":\n  \"integrity\" \"sha1-qJS3XUvE9s1nnvMkSp/Y9Gri1Cg=\"\n  \"resolved\" \"https://registry.npmjs.org/array-unique/-/array-unique-0.3.2.tgz\"\n  \"version\" \"0.3.2\"\n\n\"assign-symbols@^1.0.0\":\n  \"integrity\" \"sha1-WWZ/QfrdTyDMvCu5a41Pf3jsA2c=\"\n  \"resolved\" \"https://registry.npmjs.org/assign-symbols/-/assign-symbols-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"async-each@^1.0.1\":\n  \"integrity\" \"sha1-GdOGodntxufByF04iu28xW0zYC0=\"\n  \"resolved\" \"https://registry.npmjs.org/async-each/-/async-each-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"atob@^2.1.1\":\n  \"integrity\" \"sha512-Wm6ukoaOGJi/73p/cl2GvLjTI5JM1k/O14isD73YML8StrH/7/lRFgmg8nICZgD3bZZvjwCGxtMOD3wWNAu8cg==\"\n  \"resolved\" \"https://registry.npmjs.org/atob/-/atob-2.1.2.tgz\"\n  \"version\" \"2.1.2\"\n\n\"bail@^1.0.0\":\n  \"integrity\" \"sha1-kSV53os5Gq3zxf30zSoPwiXfO8I=\"\n  \"resolved\" \"https://registry.npmjs.org/bail/-/bail-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"balanced-match@^0.4.1\":\n  \"integrity\" \"sha1-yz8+PHMtwPAe5wtAPzAuYddwmDg=\"\n  \"resolved\" \"https://registry.npmjs.org/balanced-match/-/balanced-match-0.4.2.tgz\"\n  \"version\" \"0.4.2\"\n\n\"base@^0.11.1\":\n  \"integrity\" \"sha512-5T6P4xPgpp0YDFvSWwEZ4NoE3aM4QBQXDzmVbraCkFj8zHM+mba8SyqB5DbZWyR7mYHo6Y7BdQo3MoA4m0TeQg==\"\n  \"resolved\" \"https://registry.npmjs.org/base/-/base-0.11.2.tgz\"\n  \"version\" \"0.11.2\"\n  dependencies:\n    \"cache-base\" \"^1.0.1\"\n    \"class-utils\" \"^0.3.5\"\n    \"component-emitter\" \"^1.2.1\"\n    \"define-property\" \"^1.0.0\"\n    \"isobject\" \"^3.0.1\"\n    \"mixin-deep\" \"^1.2.0\"\n    \"pascalcase\" \"^0.1.1\"\n\n\"binary-extensions@^1.0.0\":\n  \"integrity\" \"sha1-SOyNFt9Dd+rl+liEaCSAr02Vx3Q=\"\n  \"resolved\" \"https://registry.npmjs.org/binary-extensions/-/binary-extensions-1.8.0.tgz\"\n  \"version\" \"1.8.0\"\n\n\"brace-expansion@^1.0.0\":\n  \"integrity\" \"sha1-cZfX6qm4fmSDkOph/GbIRCdCDfk=\"\n  \"resolved\" \"https://registry.npmjs.org/brace-expansion/-/brace-expansion-1.1.6.tgz\"\n  \"version\" \"1.1.6\"\n  dependencies:\n    \"balanced-match\" \"^0.4.1\"\n    \"concat-map\" \"0.0.1\"\n\n\"braces@^2.3.1\", \"braces@^2.3.2\":\n  \"integrity\" \"sha512-aNdbnj9P8PjdXU4ybaWLK2IF3jc/EoDYbC7AazW6to3TRsfXxscC9UXOB5iDiEQrkyIbWp2SLQda4+QAa7nc3w==\"\n  \"resolved\" \"https://registry.npmjs.org/braces/-/braces-2.3.2.tgz\"\n  \"version\" \"2.3.2\"\n  dependencies:\n    \"arr-flatten\" \"^1.1.0\"\n    \"array-unique\" \"^0.3.2\"\n    \"extend-shallow\" \"^2.0.1\"\n    \"fill-range\" \"^4.0.0\"\n    \"isobject\" \"^3.0.1\"\n    \"repeat-element\" \"^1.1.2\"\n    \"snapdragon\" \"^0.8.1\"\n    \"snapdragon-node\" \"^2.0.1\"\n    \"split-string\" \"^3.0.2\"\n    \"to-regex\" \"^3.0.1\"\n\n\"buffer-shims@^1.0.0\":\n  \"integrity\" \"sha1-mXjOMXOIxkmth5MCjDR37wRKi1E=\"\n  \"resolved\" \"https://registry.npmjs.org/buffer-shims/-/buffer-shims-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"cache-base@^1.0.1\":\n  \"integrity\" \"sha512-AKcdTnFSWATd5/GCPRxr2ChwIJ85CeyrEyjRHlKxQ56d4XJMGym0uAiKn0xbLOGOl3+yRpOTi484dVCEc5AUzQ==\"\n  \"resolved\" \"https://registry.npmjs.org/cache-base/-/cache-base-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"collection-visit\" \"^1.0.0\"\n    \"component-emitter\" \"^1.2.1\"\n    \"get-value\" \"^2.0.6\"\n    \"has-value\" \"^1.0.0\"\n    \"isobject\" \"^3.0.1\"\n    \"set-value\" \"^2.0.0\"\n    \"to-object-path\" \"^0.3.0\"\n    \"union-value\" \"^1.0.0\"\n    \"unset-value\" \"^1.0.0\"\n\n\"camelcase@^5.0.0\":\n  \"integrity\" \"sha512-faqwZqnWxbxn+F1d399ygeamQNy3lPp/H9H6rNrqYh4FSVCtcY+3cub1MxA8o9mDd55mM8Aghuu/kuyYA6VTsA==\"\n  \"resolved\" \"https://registry.npmjs.org/camelcase/-/camelcase-5.0.0.tgz\"\n  \"version\" \"5.0.0\"\n\n\"ccount@^1.0.0\":\n  \"integrity\" \"sha1-ZlaHlFFowhjsd/9hpBVa4AInqWw=\"\n  \"resolved\" \"https://registry.npmjs.org/ccount/-/ccount-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"chalk@^2.0.0\":\n  \"integrity\" \"sha512-Mti+f9lpJNcwF4tWV8/OrTTtF1gZi+f8FqlyAdouralcFWFQWF2+NgCHShjkCb+IFBLq9buZwE1xckQU4peSuQ==\"\n  \"resolved\" \"https://registry.npmjs.org/chalk/-/chalk-2.4.2.tgz\"\n  \"version\" \"2.4.2\"\n  dependencies:\n    \"ansi-styles\" \"^3.2.1\"\n    \"escape-string-regexp\" \"^1.0.5\"\n    \"supports-color\" \"^5.3.0\"\n\n\"character-entities-html4@^1.0.0\":\n  \"integrity\" \"sha1-GrCFUdPOH6HfCNAPucod77FHoGw=\"\n  \"resolved\" \"https://registry.npmjs.org/character-entities-html4/-/character-entities-html4-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"character-entities-legacy@^1.0.0\":\n  \"integrity\" \"sha1-sYqtmPa3vMZGweTIH58ZVjdqVho=\"\n  \"resolved\" \"https://registry.npmjs.org/character-entities-legacy/-/character-entities-legacy-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"character-entities@^1.0.0\":\n  \"integrity\" \"sha1-poPiz3Xb6LFxljUxNk5Y4YobFV8=\"\n  \"resolved\" \"https://registry.npmjs.org/character-entities/-/character-entities-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n\n\"character-reference-invalid@^1.0.0\":\n  \"integrity\" \"sha1-3smtHfufjQa0/NqircPE/ZevHmg=\"\n  \"resolved\" \"https://registry.npmjs.org/character-reference-invalid/-/character-reference-invalid-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"chokidar@^2.0.0\":\n  \"integrity\" \"sha512-IwXUx0FXc5ibYmPC2XeEj5mpXoV66sR+t3jqu2NS2GYwCktt3KF1/Qqjws/NkegajBA4RbZ5+DDwlOiJsxDHEg==\"\n  \"resolved\" \"https://registry.npmjs.org/chokidar/-/chokidar-2.1.2.tgz\"\n  \"version\" \"2.1.2\"\n  dependencies:\n    \"anymatch\" \"^2.0.0\"\n    \"async-each\" \"^1.0.1\"\n    \"braces\" \"^2.3.2\"\n    \"glob-parent\" \"^3.1.0\"\n    \"inherits\" \"^2.0.3\"\n    \"is-binary-path\" \"^1.0.0\"\n    \"is-glob\" \"^4.0.0\"\n    \"normalize-path\" \"^3.0.0\"\n    \"path-is-absolute\" \"^1.0.0\"\n    \"readdirp\" \"^2.2.1\"\n    \"upath\" \"^1.1.0\"\n  optionalDependencies:\n    \"fsevents\" \"^1.2.7\"\n\n\"class-utils@^0.3.5\":\n  \"integrity\" \"sha512-qOhPa/Fj7s6TY8H8esGu5QNpMMQxz79h+urzrNYN6mn+9BnxlDGf5QZ+XeCDsxSjPqsSR56XOZOJmpeurnLMeg==\"\n  \"resolved\" \"https://registry.npmjs.org/class-utils/-/class-utils-0.3.6.tgz\"\n  \"version\" \"0.3.6\"\n  dependencies:\n    \"arr-union\" \"^3.1.0\"\n    \"define-property\" \"^0.2.5\"\n    \"isobject\" \"^3.0.0\"\n    \"static-extend\" \"^0.1.1\"\n\n\"co@3.1.0\":\n  \"integrity\" \"sha1-TqVOpaCJOBUxheFSEMaNkJK8G3g=\"\n  \"resolved\" \"https://registry.npmjs.org/co/-/co-3.1.0.tgz\"\n  \"version\" \"3.1.0\"\n\n\"collapse-white-space@^1.0.2\":\n  \"integrity\" \"sha1-nEY/ucbRkNLcriGjVqAbyunu720=\"\n  \"resolved\" \"https://registry.npmjs.org/collapse-white-space/-/collapse-white-space-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"collection-visit@^1.0.0\":\n  \"integrity\" \"sha1-S8A3PBZLwykbTTaMgpzxqApZ3KA=\"\n  \"resolved\" \"https://registry.npmjs.org/collection-visit/-/collection-visit-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"map-visit\" \"^1.0.0\"\n    \"object-visit\" \"^1.0.0\"\n\n\"color-convert@^1.9.0\":\n  \"integrity\" \"sha512-QfAUtd+vFdAtFQcC8CCyYt1fYWxSqAiK2cSD6zDB8N3cpsEBAvRxp9zOGg6G/SHHJYAT88/az/IuDGALsNVbGg==\"\n  \"resolved\" \"https://registry.npmjs.org/color-convert/-/color-convert-1.9.3.tgz\"\n  \"version\" \"1.9.3\"\n  dependencies:\n    \"color-name\" \"1.1.3\"\n\n\"color-name@1.1.3\":\n  \"integrity\" \"sha1-p9BVi9icQveV3UIyj3QIMcpTvCU=\"\n  \"resolved\" \"https://registry.npmjs.org/color-name/-/color-name-1.1.3.tgz\"\n  \"version\" \"1.1.3\"\n\n\"component-emitter@^1.2.1\":\n  \"integrity\" \"sha1-E3kY1teCg/ffemt8WmPhQOaUJeY=\"\n  \"resolved\" \"https://registry.npmjs.org/component-emitter/-/component-emitter-1.2.1.tgz\"\n  \"version\" \"1.2.1\"\n\n\"concat-map@0.0.1\":\n  \"integrity\" \"sha1-2Klr13/Wjfd5OnMDajug1UBdR3s=\"\n  \"resolved\" \"https://registry.npmjs.org/concat-map/-/concat-map-0.0.1.tgz\"\n  \"version\" \"0.0.1\"\n\n\"concat-stream@^1.5.1\":\n  \"integrity\" \"sha1-CqxmL9Ur54lk1VMvaUeE5wEQrPc=\"\n  \"resolved\" \"https://registry.npmjs.org/concat-stream/-/concat-stream-1.6.0.tgz\"\n  \"version\" \"1.6.0\"\n  dependencies:\n    \"inherits\" \"^2.0.3\"\n    \"readable-stream\" \"^2.2.2\"\n    \"typedarray\" \"^0.0.6\"\n\n\"copy-descriptor@^0.1.0\":\n  \"integrity\" \"sha1-Z29us8OZl8LuGsOpJP1hJHSPV40=\"\n  \"resolved\" \"https://registry.npmjs.org/copy-descriptor/-/copy-descriptor-0.1.1.tgz\"\n  \"version\" \"0.1.1\"\n\n\"core-util-is@~1.0.0\":\n  \"integrity\" \"sha1-tf1UIgqivFq1eqtxQMlAdUUDwac=\"\n  \"resolved\" \"https://registry.npmjs.org/core-util-is/-/core-util-is-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"datasets-us-states-abbr@^1.0.0\":\n  \"integrity\" \"sha1-20UgxHNLMKa56IgqPNgYKczUaBs=\"\n  \"resolved\" \"https://registry.npmjs.org/datasets-us-states-abbr/-/datasets-us-states-abbr-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"debug@^2.2.0\", \"debug@^2.3.3\":\n  \"integrity\" \"sha512-bC7ElrdJaJnPbAP+1EotYvqZsb3ecl5wi6Bfi6BJTUcNowp6cvspg0jXznRTKDjm/E7AdgFBVeAPVMNcKGsHMA==\"\n  \"resolved\" \"https://registry.npmjs.org/debug/-/debug-2.6.9.tgz\"\n  \"version\" \"2.6.9\"\n  dependencies:\n    \"ms\" \"2.0.0\"\n\n\"debug@^3.1.0\":\n  \"integrity\" \"sha512-mel+jf7nrtEl5Pn1Qx46zARXKDpBbvzezse7p7LqINmdoIk8PYP5SySaxEmYv6TZ0JyEKA1hsCId6DIhgITtWQ==\"\n  \"resolved\" \"https://registry.npmjs.org/debug/-/debug-3.2.6.tgz\"\n  \"version\" \"3.2.6\"\n  dependencies:\n    \"ms\" \"^2.1.1\"\n\n\"decode-uri-component@^0.2.0\":\n  \"integrity\" \"sha1-6zkTMzRYd1y4TNGh+uBiEGu4dUU=\"\n  \"resolved\" \"https://registry.npmjs.org/decode-uri-component/-/decode-uri-component-0.2.0.tgz\"\n  \"version\" \"0.2.0\"\n\n\"deep-extend@^0.6.0\":\n  \"integrity\" \"sha512-LOHxIOaPYdHlJRtCQfDIVZtfw/ufM8+rVj649RIHzcm/vGwQRXFt6OPqIFWsm2XEMrNIEtWR64sY1LEKD2vAOA==\"\n  \"resolved\" \"https://registry.npmjs.org/deep-extend/-/deep-extend-0.6.0.tgz\"\n  \"version\" \"0.6.0\"\n\n\"define-property@^0.2.5\":\n  \"integrity\" \"sha1-w1se+RjsPJkPmlvFe+BKrOxcgRY=\"\n  \"resolved\" \"https://registry.npmjs.org/define-property/-/define-property-0.2.5.tgz\"\n  \"version\" \"0.2.5\"\n  dependencies:\n    \"is-descriptor\" \"^0.1.0\"\n\n\"define-property@^1.0.0\":\n  \"integrity\" \"sha1-dp66rz9KY6rTr56NMEybvnm/sOY=\"\n  \"resolved\" \"https://registry.npmjs.org/define-property/-/define-property-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"is-descriptor\" \"^1.0.0\"\n\n\"define-property@^2.0.2\":\n  \"integrity\" \"sha512-jwK2UV4cnPpbcG7+VRARKTZPUWowwXA8bzH5NP6ud0oeAxyYPuGZUAC7hMugpCdz4BeSZl2Dl9k66CHJ/46ZYQ==\"\n  \"resolved\" \"https://registry.npmjs.org/define-property/-/define-property-2.0.2.tgz\"\n  \"version\" \"2.0.2\"\n  dependencies:\n    \"is-descriptor\" \"^1.0.2\"\n    \"isobject\" \"^3.0.1\"\n\n\"error-ex@^1.3.1\":\n  \"integrity\" \"sha512-7dFHNmqeFSEt2ZBsCriorKnn3Z2pj+fd9kmI6QoWw4//DL+icEBfc0U7qJCisqrTsKTjw4fNFy2pW9OqStD84g==\"\n  \"resolved\" \"https://registry.npmjs.org/error-ex/-/error-ex-1.3.2.tgz\"\n  \"version\" \"1.3.2\"\n  dependencies:\n    \"is-arrayish\" \"^0.2.1\"\n\n\"escape-string-regexp@^1.0.5\":\n  \"integrity\" \"sha1-G2HAViGQqN/2rjuyzwIAyhMLhtQ=\"\n  \"resolved\" \"https://registry.npmjs.org/escape-string-regexp/-/escape-string-regexp-1.0.5.tgz\"\n  \"version\" \"1.0.5\"\n\n\"esprima@^3.1.1\":\n  \"integrity\" \"sha1-/cpRzuYTOJXjyI1TXOSdv/YqRjM=\"\n  \"resolved\" \"https://registry.npmjs.org/esprima/-/esprima-3.1.3.tgz\"\n  \"version\" \"3.1.3\"\n\n\"expand-brackets@^2.1.4\":\n  \"integrity\" \"sha1-t3c14xXOMPa27/D4OwQVGiJEliI=\"\n  \"resolved\" \"https://registry.npmjs.org/expand-brackets/-/expand-brackets-2.1.4.tgz\"\n  \"version\" \"2.1.4\"\n  dependencies:\n    \"debug\" \"^2.3.3\"\n    \"define-property\" \"^0.2.5\"\n    \"extend-shallow\" \"^2.0.1\"\n    \"posix-character-classes\" \"^0.1.0\"\n    \"regex-not\" \"^1.0.0\"\n    \"snapdragon\" \"^0.8.1\"\n    \"to-regex\" \"^3.0.1\"\n\n\"extend-shallow@^2.0.1\":\n  \"integrity\" \"sha1-Ua99YUrZqfYQ6huvu5idaxxWiQ8=\"\n  \"resolved\" \"https://registry.npmjs.org/extend-shallow/-/extend-shallow-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n  dependencies:\n    \"is-extendable\" \"^0.1.0\"\n\n\"extend-shallow@^3.0.0\":\n  \"integrity\" \"sha1-Jqcarwc7OfshJxcnRhMcJwQCjbg=\"\n  \"resolved\" \"https://registry.npmjs.org/extend-shallow/-/extend-shallow-3.0.2.tgz\"\n  \"version\" \"3.0.2\"\n  dependencies:\n    \"assign-symbols\" \"^1.0.0\"\n    \"is-extendable\" \"^1.0.1\"\n\n\"extend-shallow@^3.0.2\":\n  \"integrity\" \"sha1-Jqcarwc7OfshJxcnRhMcJwQCjbg=\"\n  \"resolved\" \"https://registry.npmjs.org/extend-shallow/-/extend-shallow-3.0.2.tgz\"\n  \"version\" \"3.0.2\"\n  dependencies:\n    \"assign-symbols\" \"^1.0.0\"\n    \"is-extendable\" \"^1.0.1\"\n\n\"extend@^3.0.0\":\n  \"integrity\" \"sha1-WkdDU7nzNT3dgXbf03uRyDpG8dQ=\"\n  \"resolved\" \"https://registry.npmjs.org/extend/-/extend-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n\n\"extglob@^2.0.4\":\n  \"integrity\" \"sha512-Nmb6QXkELsuBr24CJSkilo6UHHgbekK5UiZgfE6UHD3Eb27YC6oD+bhcT+tJ6cl8dmsgdQxnWlcry8ksBIBLpw==\"\n  \"resolved\" \"https://registry.npmjs.org/extglob/-/extglob-2.0.4.tgz\"\n  \"version\" \"2.0.4\"\n  dependencies:\n    \"array-unique\" \"^0.3.2\"\n    \"define-property\" \"^1.0.0\"\n    \"expand-brackets\" \"^2.1.4\"\n    \"extend-shallow\" \"^2.0.1\"\n    \"fragment-cache\" \"^0.2.1\"\n    \"regex-not\" \"^1.0.0\"\n    \"snapdragon\" \"^0.8.1\"\n    \"to-regex\" \"^3.0.1\"\n\n\"fault@^1.0.0\", \"fault@^1.0.2\":\n  \"integrity\" \"sha512-o2eo/X2syzzERAtN5LcGbiVQ0WwZSlN3qLtadwAz3X8Bu+XWD16dja/KMsjZLiQr+BLGPDnHGkc4yUJf1Xpkpw==\"\n  \"resolved\" \"https://registry.npmjs.org/fault/-/fault-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n  dependencies:\n    \"format\" \"^0.2.2\"\n\n\"fill-range@^4.0.0\":\n  \"integrity\" \"sha1-1USBHUKPmOsGpj3EAtJAPDKMOPc=\"\n  \"resolved\" \"https://registry.npmjs.org/fill-range/-/fill-range-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"extend-shallow\" \"^2.0.1\"\n    \"is-number\" \"^3.0.0\"\n    \"repeat-string\" \"^1.6.1\"\n    \"to-regex-range\" \"^2.1.0\"\n\n\"fn-name@^2.0.1\":\n  \"integrity\" \"sha1-UhTXU3pNBqSjAcDMJi/rhBiAAuc=\"\n  \"resolved\" \"https://registry.npmjs.org/fn-name/-/fn-name-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n\n\"for-in@^1.0.2\":\n  \"integrity\" \"sha1-gQaNKVqBQuwKxybG4iAMMPttXoA=\"\n  \"resolved\" \"https://registry.npmjs.org/for-in/-/for-in-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"format@^0.2.2\":\n  \"integrity\" \"sha1-1hcBB+nv3E7TDJ3DkBbflCtctYs=\"\n  \"resolved\" \"https://registry.npmjs.org/format/-/format-0.2.2.tgz\"\n  \"version\" \"0.2.2\"\n\n\"fragment-cache@^0.2.1\":\n  \"integrity\" \"sha1-QpD60n8T6Jvn8zeZxrxaCr//DRk=\"\n  \"resolved\" \"https://registry.npmjs.org/fragment-cache/-/fragment-cache-0.2.1.tgz\"\n  \"version\" \"0.2.1\"\n  dependencies:\n    \"map-cache\" \"^0.2.2\"\n\n\"fs.realpath@^1.0.0\":\n  \"integrity\" \"sha1-FQStJSMVjKpA20onh8sBQRmU6k8=\"\n  \"resolved\" \"https://registry.npmjs.org/fs.realpath/-/fs.realpath-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"function-bind@^1.0.2\":\n  \"integrity\" \"sha1-FhdnFMgBeY5Ojyz391KUZ7tKV3E=\"\n  \"resolved\" \"https://registry.npmjs.org/function-bind/-/function-bind-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"get-value@^2.0.3\", \"get-value@^2.0.6\":\n  \"integrity\" \"sha1-3BXKHGcjh8p2vTesCjlbogQqLCg=\"\n  \"resolved\" \"https://registry.npmjs.org/get-value/-/get-value-2.0.6.tgz\"\n  \"version\" \"2.0.6\"\n\n\"glob-parent@^3.1.0\":\n  \"integrity\" \"sha1-nmr2KZ2NO9K9QEMIMr0RPfkGxa4=\"\n  \"resolved\" \"https://registry.npmjs.org/glob-parent/-/glob-parent-3.1.0.tgz\"\n  \"version\" \"3.1.0\"\n  dependencies:\n    \"is-glob\" \"^3.1.0\"\n    \"path-dirname\" \"^1.0.0\"\n\n\"glob@^7.0.3\":\n  \"integrity\" \"sha1-gFIR3wT6rxxjo2ADBs31reULLsg=\"\n  \"resolved\" \"https://registry.npmjs.org/glob/-/glob-7.1.1.tgz\"\n  \"version\" \"7.1.1\"\n  dependencies:\n    \"fs.realpath\" \"^1.0.0\"\n    \"inflight\" \"^1.0.4\"\n    \"inherits\" \"2\"\n    \"minimatch\" \"^3.0.2\"\n    \"once\" \"^1.3.0\"\n    \"path-is-absolute\" \"^1.0.0\"\n\n\"graceful-fs@^4.1.11\":\n  \"integrity\" \"sha512-6uHUhOPEBgQ24HM+r6b/QwWfZq+yiFcipKFrOFiBEnWdy5sdzYoi+pJeQaPI5qOLRFqWmAXUPQNsielzdLoecA==\"\n  \"resolved\" \"https://registry.npmjs.org/graceful-fs/-/graceful-fs-4.1.15.tgz\"\n  \"version\" \"4.1.15\"\n\n\"has-flag@^3.0.0\":\n  \"integrity\" \"sha1-tdRU3CGZriJWmfNGfloH87lVuv0=\"\n  \"resolved\" \"https://registry.npmjs.org/has-flag/-/has-flag-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n\n\"has-value@^0.3.1\":\n  \"integrity\" \"sha1-ex9YutpiyoJ+wKIHgCVlSEWZXh8=\"\n  \"resolved\" \"https://registry.npmjs.org/has-value/-/has-value-0.3.1.tgz\"\n  \"version\" \"0.3.1\"\n  dependencies:\n    \"get-value\" \"^2.0.3\"\n    \"has-values\" \"^0.1.4\"\n    \"isobject\" \"^2.0.0\"\n\n\"has-value@^1.0.0\":\n  \"integrity\" \"sha1-GLKB2lhbHFxR3vJMkw7SmgvmsXc=\"\n  \"resolved\" \"https://registry.npmjs.org/has-value/-/has-value-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"get-value\" \"^2.0.6\"\n    \"has-values\" \"^1.0.0\"\n    \"isobject\" \"^3.0.0\"\n\n\"has-values@^0.1.4\":\n  \"integrity\" \"sha1-bWHeldkd/Km5oCCJrThL/49it3E=\"\n  \"resolved\" \"https://registry.npmjs.org/has-values/-/has-values-0.1.4.tgz\"\n  \"version\" \"0.1.4\"\n\n\"has-values@^1.0.0\":\n  \"integrity\" \"sha1-lbC2P+whRmGab+V/51Yo1aOe/k8=\"\n  \"resolved\" \"https://registry.npmjs.org/has-values/-/has-values-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"is-number\" \"^3.0.0\"\n    \"kind-of\" \"^4.0.0\"\n\n\"has@^1.0.1\":\n  \"integrity\" \"sha1-hGFzP1OLCDfJNh45qauelwTcLyg=\"\n  \"resolved\" \"https://registry.npmjs.org/has/-/has-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"function-bind\" \"^1.0.2\"\n\n\"ignore@^3.2.0\":\n  \"integrity\" \"sha1-JujaBkS+C7TLOVFvbHnw4PT/5Iw=\"\n  \"resolved\" \"https://registry.npmjs.org/ignore/-/ignore-3.2.6.tgz\"\n  \"version\" \"3.2.6\"\n\n\"inflight@^1.0.4\":\n  \"integrity\" \"sha1-Sb1jMdfQLQwJvJEKEHW6gWW1bfk=\"\n  \"resolved\" \"https://registry.npmjs.org/inflight/-/inflight-1.0.6.tgz\"\n  \"version\" \"1.0.6\"\n  dependencies:\n    \"once\" \"^1.3.0\"\n    \"wrappy\" \"1\"\n\n\"inherits@^2.0.1\", \"inherits@^2.0.3\", \"inherits@~2.0.1\", \"inherits@2\":\n  \"integrity\" \"sha1-Yzwsg+PaQqUC9SRmAiSA9CCCYd4=\"\n  \"resolved\" \"https://registry.npmjs.org/inherits/-/inherits-2.0.3.tgz\"\n  \"version\" \"2.0.3\"\n\n\"ini@~1.3.0\":\n  \"integrity\" \"sha1-BTfLedr1m1mhpRff9wbIbsA5Fi4=\"\n  \"resolved\" \"https://registry.npmjs.org/ini/-/ini-1.3.4.tgz\"\n  \"version\" \"1.3.4\"\n\n\"irregular-plurals@^1.0.0\":\n  \"integrity\" \"sha1-OPKZg0uowAwwvpxVThNyaXUv86w=\"\n  \"resolved\" \"https://registry.npmjs.org/irregular-plurals/-/irregular-plurals-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n\n\"is-accessor-descriptor@^0.1.6\":\n  \"integrity\" \"sha1-qeEss66Nh2cn7u84Q/igiXtcmNY=\"\n  \"resolved\" \"https://registry.npmjs.org/is-accessor-descriptor/-/is-accessor-descriptor-0.1.6.tgz\"\n  \"version\" \"0.1.6\"\n  dependencies:\n    \"kind-of\" \"^3.0.2\"\n\n\"is-accessor-descriptor@^1.0.0\":\n  \"integrity\" \"sha512-m5hnHTkcVsPfqx3AKlyttIPb7J+XykHvJP2B9bZDjlhLIoEq4XoK64Vg7boZlVWYK6LUY94dYPEE7Lh0ZkZKcQ==\"\n  \"resolved\" \"https://registry.npmjs.org/is-accessor-descriptor/-/is-accessor-descriptor-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"kind-of\" \"^6.0.0\"\n\n\"is-alphabetical@^1.0.0\":\n  \"integrity\" \"sha1-4lRMEwWCVfIUTLdXBmzTNCocjEY=\"\n  \"resolved\" \"https://registry.npmjs.org/is-alphabetical/-/is-alphabetical-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"is-alphanumeric@^1.0.0\":\n  \"integrity\" \"sha1-Spzvcdr0wAHB2B1j0UDPU/1oifQ=\"\n  \"resolved\" \"https://registry.npmjs.org/is-alphanumeric/-/is-alphanumeric-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"is-alphanumerical@^1.0.0\":\n  \"integrity\" \"sha1-4GSS5xnBvxXewjnk8a9fZ7TW578=\"\n  \"resolved\" \"https://registry.npmjs.org/is-alphanumerical/-/is-alphanumerical-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"is-alphabetical\" \"^1.0.0\"\n    \"is-decimal\" \"^1.0.0\"\n\n\"is-arrayish@^0.2.1\":\n  \"integrity\" \"sha1-d8mYQFJ6qOyxqLppe4BkWnqSap0=\"\n  \"resolved\" \"https://registry.npmjs.org/is-arrayish/-/is-arrayish-0.2.1.tgz\"\n  \"version\" \"0.2.1\"\n\n\"is-binary-path@^1.0.0\":\n  \"integrity\" \"sha1-dfFmQrSA8YenEcgUFh/TpKdlWJg=\"\n  \"resolved\" \"https://registry.npmjs.org/is-binary-path/-/is-binary-path-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"binary-extensions\" \"^1.0.0\"\n\n\"is-buffer@^1.1.5\":\n  \"integrity\" \"sha512-NcdALwpXkTm5Zvvbk7owOUSvVvBKDgKP5/ewfXEznmQFfs4ZRmanOeKBTjRVjka3QFoN6XJ+9F3USqfHqTaU5w==\"\n  \"resolved\" \"https://registry.npmjs.org/is-buffer/-/is-buffer-1.1.6.tgz\"\n  \"version\" \"1.1.6\"\n\n\"is-buffer@^2.0.0\":\n  \"integrity\" \"sha512-U15Q7MXTuZlrbymiz95PJpZxu8IlipAp4dtS3wOdgPXx3mqBnslrWU14kxfHB+Py/+2PVKSr37dMAgM2A4uArw==\"\n  \"resolved\" \"https://registry.npmjs.org/is-buffer/-/is-buffer-2.0.3.tgz\"\n  \"version\" \"2.0.3\"\n\n\"is-data-descriptor@^0.1.4\":\n  \"integrity\" \"sha1-C17mSDiOLIYCgueT8YVv7D8wG1Y=\"\n  \"resolved\" \"https://registry.npmjs.org/is-data-descriptor/-/is-data-descriptor-0.1.4.tgz\"\n  \"version\" \"0.1.4\"\n  dependencies:\n    \"kind-of\" \"^3.0.2\"\n\n\"is-data-descriptor@^1.0.0\":\n  \"integrity\" \"sha512-jbRXy1FmtAoCjQkVmIVYwuuqDFUbaOeDjmed1tOGPrsMhtJA4rD9tkgA0F1qJ3gRFRXcHYVkdeaP50Q5rE/jLQ==\"\n  \"resolved\" \"https://registry.npmjs.org/is-data-descriptor/-/is-data-descriptor-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"kind-of\" \"^6.0.0\"\n\n\"is-decimal@^1.0.0\":\n  \"integrity\" \"sha1-lAV5tupjxigICmnmK9qIyEcLT+A=\"\n  \"resolved\" \"https://registry.npmjs.org/is-decimal/-/is-decimal-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"is-descriptor@^0.1.0\":\n  \"integrity\" \"sha512-avDYr0SB3DwO9zsMov0gKCESFYqCnE4hq/4z3TdUlukEy5t9C0YRq7HLrsN52NAcqXKaepeCD0n+B0arnVG3Hg==\"\n  \"resolved\" \"https://registry.npmjs.org/is-descriptor/-/is-descriptor-0.1.6.tgz\"\n  \"version\" \"0.1.6\"\n  dependencies:\n    \"is-accessor-descriptor\" \"^0.1.6\"\n    \"is-data-descriptor\" \"^0.1.4\"\n    \"kind-of\" \"^5.0.0\"\n\n\"is-descriptor@^1.0.0\", \"is-descriptor@^1.0.2\":\n  \"integrity\" \"sha512-2eis5WqQGV7peooDyLmNEPUrps9+SXX5c9pL3xEB+4e9HnGuDa7mB7kHxHw4CbqS9k1T2hOH3miL8n8WtiYVtg==\"\n  \"resolved\" \"https://registry.npmjs.org/is-descriptor/-/is-descriptor-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n  dependencies:\n    \"is-accessor-descriptor\" \"^1.0.0\"\n    \"is-data-descriptor\" \"^1.0.0\"\n    \"kind-of\" \"^6.0.2\"\n\n\"is-empty@^1.0.0\":\n  \"integrity\" \"sha1-3pu1snhzigWgsJpX4ftNSjQan2s=\"\n  \"resolved\" \"https://registry.npmjs.org/is-empty/-/is-empty-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n\n\"is-extendable@^0.1.0\", \"is-extendable@^0.1.1\":\n  \"integrity\" \"sha1-YrEQ4omkcUGOPsNqYX1HLjAd/Ik=\"\n  \"resolved\" \"https://registry.npmjs.org/is-extendable/-/is-extendable-0.1.1.tgz\"\n  \"version\" \"0.1.1\"\n\n\"is-extendable@^1.0.1\":\n  \"integrity\" \"sha512-arnXMxT1hhoKo9k1LZdmlNyJdDDfy2v0fXjFlmok4+i8ul/6WlbVge9bhM74OpNPQPMGUToDtz+KXa1PneJxOA==\"\n  \"resolved\" \"https://registry.npmjs.org/is-extendable/-/is-extendable-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"is-plain-object\" \"^2.0.4\"\n\n\"is-extglob@^2.1.0\", \"is-extglob@^2.1.1\":\n  \"integrity\" \"sha1-qIwCU1eR8C7TfHahueqXc8gz+MI=\"\n  \"resolved\" \"https://registry.npmjs.org/is-extglob/-/is-extglob-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n\n\"is-fullwidth-code-point@^2.0.0\":\n  \"integrity\" \"sha1-o7MKXE8ZkYMWeqq5O+764937ZU8=\"\n  \"resolved\" \"https://registry.npmjs.org/is-fullwidth-code-point/-/is-fullwidth-code-point-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n\n\"is-glob@^3.1.0\":\n  \"integrity\" \"sha1-e6WuJCF4BKxwcHuWkiVnSGzD6Eo=\"\n  \"resolved\" \"https://registry.npmjs.org/is-glob/-/is-glob-3.1.0.tgz\"\n  \"version\" \"3.1.0\"\n  dependencies:\n    \"is-extglob\" \"^2.1.0\"\n\n\"is-glob@^4.0.0\":\n  \"integrity\" \"sha1-lSHHaEXMJhCoUgPd8ICpWML/q8A=\"\n  \"resolved\" \"https://registry.npmjs.org/is-glob/-/is-glob-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"is-extglob\" \"^2.1.1\"\n\n\"is-hexadecimal@^1.0.0\":\n  \"integrity\" \"sha1-XEWXcdKvmi45Ungf1U/LG8/kETw=\"\n  \"resolved\" \"https://registry.npmjs.org/is-hexadecimal/-/is-hexadecimal-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"is-hidden@^1.0.1\":\n  \"integrity\" \"sha1-qbBM+8OlhcU5yMfFCjQU2R7oURk=\"\n  \"resolved\" \"https://registry.npmjs.org/is-hidden/-/is-hidden-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"is-number@^3.0.0\":\n  \"integrity\" \"sha1-JP1iAaR4LPUFYcgQJ2r8fRLXEZU=\"\n  \"resolved\" \"https://registry.npmjs.org/is-number/-/is-number-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n  dependencies:\n    \"kind-of\" \"^3.0.2\"\n\n\"is-object@^1.0.1\":\n  \"integrity\" \"sha1-iVJojF7C/9awPsyF52ngKQMINHA=\"\n  \"resolved\" \"https://registry.npmjs.org/is-object/-/is-object-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"is-plain-obj@^1.1.0\":\n  \"integrity\" \"sha1-caUMhCnfync8kqOQpKA7OfzVHT4=\"\n  \"resolved\" \"https://registry.npmjs.org/is-plain-obj/-/is-plain-obj-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"is-plain-object@^2.0.1\", \"is-plain-object@^2.0.3\", \"is-plain-object@^2.0.4\":\n  \"integrity\" \"sha512-h5PpgXkWitc38BBMYawTYMWJHFZJVnBquFE57xFpjB8pJFiF6gZ+bU+WyI/yqXiFR5mdLsgYNaPe8uao6Uv9Og==\"\n  \"resolved\" \"https://registry.npmjs.org/is-plain-object/-/is-plain-object-2.0.4.tgz\"\n  \"version\" \"2.0.4\"\n  dependencies:\n    \"isobject\" \"^3.0.1\"\n\n\"is-whitespace-character@^1.0.0\":\n  \"integrity\" \"sha1-u/SoN2Tq0NRRvsKlUhjpGWGtwnU=\"\n  \"resolved\" \"https://registry.npmjs.org/is-whitespace-character/-/is-whitespace-character-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"is-windows@^1.0.2\":\n  \"integrity\" \"sha512-eXK1UInq2bPmjyX6e3VHIzMLobc4J94i4AWn+Hpq3OU5KkrRC96OAcR3PRJ/pGu6m8TRnBHP9dkXQVsT/COVIA==\"\n  \"resolved\" \"https://registry.npmjs.org/is-windows/-/is-windows-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"is-word-character@^1.0.0\":\n  \"integrity\" \"sha1-o6nl3a1wxcLuNvSpz8mlP0RTUkc=\"\n  \"resolved\" \"https://registry.npmjs.org/is-word-character/-/is-word-character-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"isarray@~1.0.0\", \"isarray@1.0.0\":\n  \"integrity\" \"sha1-u5NdSFgsuhaMBoNJV6VKPgcSTxE=\"\n  \"resolved\" \"https://registry.npmjs.org/isarray/-/isarray-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"isobject@^2.0.0\":\n  \"integrity\" \"sha1-8GVWEJaj8dou9GJy+BXIQNh+DIk=\"\n  \"resolved\" \"https://registry.npmjs.org/isobject/-/isobject-2.1.0.tgz\"\n  \"version\" \"2.1.0\"\n  dependencies:\n    \"isarray\" \"1.0.0\"\n\n\"isobject@^3.0.0\", \"isobject@^3.0.1\":\n  \"integrity\" \"sha1-TkMekrEalzFjaqH5yNHMvP2reN8=\"\n  \"resolved\" \"https://registry.npmjs.org/isobject/-/isobject-3.0.1.tgz\"\n  \"version\" \"3.0.1\"\n\n\"js-yaml@^3.6.1\":\n  \"integrity\" \"sha1-AtPiwPa+qyAkjUEsNSIDgn14ZyE=\"\n  \"resolved\" \"https://registry.npmjs.org/js-yaml/-/js-yaml-3.8.2.tgz\"\n  \"version\" \"3.8.2\"\n  dependencies:\n    \"argparse\" \"^1.0.7\"\n    \"esprima\" \"^3.1.1\"\n\n\"json-parse-better-errors@^1.0.1\":\n  \"integrity\" \"sha512-mrqyZKfX5EhL7hvqcV6WG1yYjnjeuYDzDhhcAAUrq8Po85NBQBJP+ZDUT75qZQ98IkUoBqdkExkukOU7Ts2wrw==\"\n  \"resolved\" \"https://registry.npmjs.org/json-parse-better-errors/-/json-parse-better-errors-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"json5@^1.0.0\":\n  \"integrity\" \"sha512-aKS4WQjPenRxiQsC93MNfjx+nbF4PAdYzmd/1JIj8HYzqfbu86beTuNgXDzPknWk0n0uARlyewZo4s++ES36Ow==\"\n  \"resolved\" \"https://registry.npmjs.org/json5/-/json5-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"minimist\" \"^1.2.0\"\n\n\"kind-of@^3.0.2\", \"kind-of@^3.0.3\", \"kind-of@^3.2.0\":\n  \"integrity\" \"sha1-MeohpzS6ubuw8yRm2JOupR5KPGQ=\"\n  \"resolved\" \"https://registry.npmjs.org/kind-of/-/kind-of-3.2.2.tgz\"\n  \"version\" \"3.2.2\"\n  dependencies:\n    \"is-buffer\" \"^1.1.5\"\n\n\"kind-of@^4.0.0\":\n  \"integrity\" \"sha1-IIE989cSkosgc3hpGkUGb65y3Vc=\"\n  \"resolved\" \"https://registry.npmjs.org/kind-of/-/kind-of-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"is-buffer\" \"^1.1.5\"\n\n\"kind-of@^5.0.0\":\n  \"integrity\" \"sha512-NGEErnH6F2vUuXDh+OlbcKW7/wOcfdRHaZ7VWtqCztfHri/++YKmP51OdWeGPuqCOba6kk2OTe5d02VmTB80Pw==\"\n  \"resolved\" \"https://registry.npmjs.org/kind-of/-/kind-of-5.1.0.tgz\"\n  \"version\" \"5.1.0\"\n\n\"kind-of@^6.0.0\":\n  \"integrity\" \"sha512-s5kLOcnH0XqDO+FvuaLX8DDjZ18CGFk7VygH40QoKPUQhW4e2rvM0rwUq0t8IQDOwYSeLK01U90OjzBTme2QqA==\"\n  \"resolved\" \"https://registry.npmjs.org/kind-of/-/kind-of-6.0.2.tgz\"\n  \"version\" \"6.0.2\"\n\n\"kind-of@^6.0.2\":\n  \"integrity\" \"sha512-s5kLOcnH0XqDO+FvuaLX8DDjZ18CGFk7VygH40QoKPUQhW4e2rvM0rwUq0t8IQDOwYSeLK01U90OjzBTme2QqA==\"\n  \"resolved\" \"https://registry.npmjs.org/kind-of/-/kind-of-6.0.2.tgz\"\n  \"version\" \"6.0.2\"\n\n\"load-plugin@^2.0.0\":\n  \"integrity\" \"sha1-XGiMVgJhmXtH39CnNh+usVKs9/U=\"\n  \"resolved\" \"https://registry.npmjs.org/load-plugin/-/load-plugin-2.1.0.tgz\"\n  \"version\" \"2.1.0\"\n  dependencies:\n    \"npm-prefix\" \"^1.2.0\"\n    \"resolve-from\" \"^2.0.0\"\n\n\"longest-streak@^2.0.1\":\n  \"integrity\" \"sha1-QtKRtUEeQDZcAOYxk0l+IkcxbjU=\"\n  \"resolved\" \"https://registry.npmjs.org/longest-streak/-/longest-streak-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n\n\"map-cache@^0.2.2\":\n  \"integrity\" \"sha1-wyq9C9ZSXZsFFkW7TyasXcmKDb8=\"\n  \"resolved\" \"https://registry.npmjs.org/map-cache/-/map-cache-0.2.2.tgz\"\n  \"version\" \"0.2.2\"\n\n\"map-visit@^1.0.0\":\n  \"integrity\" \"sha1-7Nyo8TFE5mDxtb1B8S80edmN+48=\"\n  \"resolved\" \"https://registry.npmjs.org/map-visit/-/map-visit-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"object-visit\" \"^1.0.0\"\n\n\"markdown-escapes@^1.0.0\":\n  \"integrity\" \"sha1-yMoZ8dlNaCRZ4Kk8htsnp+9xayM=\"\n  \"resolved\" \"https://registry.npmjs.org/markdown-escapes/-/markdown-escapes-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"markdown-extensions@^1.1.0\":\n  \"integrity\" \"sha1-+6Dxouu09BI9JbepO8NXksEfUE4=\"\n  \"resolved\" \"https://registry.npmjs.org/markdown-extensions/-/markdown-extensions-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"markdown-table@^1.1.0\":\n  \"integrity\" \"sha1-H1rmFlnO2ICNiCVUwy6LPzjdEUM=\"\n  \"resolved\" \"https://registry.npmjs.org/markdown-table/-/markdown-table-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"mdast-comment-marker@^1.0.0\":\n  \"integrity\" \"sha1-8PJsM/xdgeQdnsNv9PBmu1DSF/s=\"\n  \"resolved\" \"https://registry.npmjs.org/mdast-comment-marker/-/mdast-comment-marker-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"mdast-util-compact@^1.0.0\":\n  \"integrity\" \"sha1-TJTe3+NZMtVFfym2ULMw/cc+mUo=\"\n  \"resolved\" \"https://registry.npmjs.org/mdast-util-compact/-/mdast-util-compact-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unist-util-modify-children\" \"^1.0.0\"\n    \"unist-util-visit\" \"^1.1.0\"\n\n\"mdast-util-heading-style@^1.0.2\":\n  \"integrity\" \"sha1-FLfPKAKIHQmvDP3OQgJta8WE//E=\"\n  \"resolved\" \"https://registry.npmjs.org/mdast-util-heading-style/-/mdast-util-heading-style-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"mdast-util-to-string@^1.0.0\", \"mdast-util-to-string@^1.0.2\":\n  \"integrity\" \"sha1-3JlqJNK1IReNP6w5k2gMA6aD4d0=\"\n  \"resolved\" \"https://registry.npmjs.org/mdast-util-to-string/-/mdast-util-to-string-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"micromatch@^3.1.10\", \"micromatch@^3.1.4\":\n  \"integrity\" \"sha512-MWikgl9n9M3w+bpsY3He8L+w9eF9338xRl8IAO5viDizwSzziFEyUzo2xrrloB64ADbTf8uA8vRqqttDTOmccg==\"\n  \"resolved\" \"https://registry.npmjs.org/micromatch/-/micromatch-3.1.10.tgz\"\n  \"version\" \"3.1.10\"\n  dependencies:\n    \"arr-diff\" \"^4.0.0\"\n    \"array-unique\" \"^0.3.2\"\n    \"braces\" \"^2.3.1\"\n    \"define-property\" \"^2.0.2\"\n    \"extend-shallow\" \"^3.0.2\"\n    \"extglob\" \"^2.0.4\"\n    \"fragment-cache\" \"^0.2.1\"\n    \"kind-of\" \"^6.0.2\"\n    \"nanomatch\" \"^1.2.9\"\n    \"object.pick\" \"^1.3.0\"\n    \"regex-not\" \"^1.0.0\"\n    \"snapdragon\" \"^0.8.1\"\n    \"to-regex\" \"^3.0.2\"\n\n\"minimatch@^3.0.2\":\n  \"integrity\" \"sha1-Kk5AkLlrLbBqnX3wEFWmKnfJt3Q=\"\n  \"resolved\" \"https://registry.npmjs.org/minimatch/-/minimatch-3.0.3.tgz\"\n  \"version\" \"3.0.3\"\n  dependencies:\n    \"brace-expansion\" \"^1.0.0\"\n\n\"minimist@^1.2.0\":\n  \"integrity\" \"sha1-o1AIsg9BOD7sH7kU9M1d95omQoQ=\"\n  \"resolved\" \"https://registry.npmjs.org/minimist/-/minimist-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n\n\"mixin-deep@^1.2.0\":\n  \"integrity\" \"sha512-8ZItLHeEgaqEvd5lYBXfm4EZSFCX29Jb9K+lAHhDKzReKBQKj3R+7NOF6tjqYi9t4oI8VUfaWITJQm86wnXGNQ==\"\n  \"resolved\" \"https://registry.npmjs.org/mixin-deep/-/mixin-deep-1.3.1.tgz\"\n  \"version\" \"1.3.1\"\n  dependencies:\n    \"for-in\" \"^1.0.2\"\n    \"is-extendable\" \"^1.0.1\"\n\n\"ms@^2.1.1\":\n  \"integrity\" \"sha512-tgp+dl5cGk28utYktBsrFqA7HKgrhgPsg6Z/EfhWI4gl1Hwq8B/GmY/0oXZ6nF8hDVesS/FpnYaD/kOWhYQvyg==\"\n  \"resolved\" \"https://registry.npmjs.org/ms/-/ms-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n\n\"ms@2.0.0\":\n  \"integrity\" \"sha1-VgiurfwAvmwpAd9fmGF4jeDVl8g=\"\n  \"resolved\" \"https://registry.npmjs.org/ms/-/ms-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n\n\"nanomatch@^1.2.9\":\n  \"integrity\" \"sha512-fpoe2T0RbHwBTBUOftAfBPaDEi06ufaUai0mE6Yn1kacc3SnTErfb/h+X94VXzI64rKFHYImXSvdwGGCmwOqCA==\"\n  \"resolved\" \"https://registry.npmjs.org/nanomatch/-/nanomatch-1.2.13.tgz\"\n  \"version\" \"1.2.13\"\n  dependencies:\n    \"arr-diff\" \"^4.0.0\"\n    \"array-unique\" \"^0.3.2\"\n    \"define-property\" \"^2.0.2\"\n    \"extend-shallow\" \"^3.0.2\"\n    \"fragment-cache\" \"^0.2.1\"\n    \"is-windows\" \"^1.0.2\"\n    \"kind-of\" \"^6.0.2\"\n    \"object.pick\" \"^1.3.0\"\n    \"regex-not\" \"^1.0.0\"\n    \"snapdragon\" \"^0.8.1\"\n    \"to-regex\" \"^3.0.1\"\n\n\"normalize-path@^2.1.1\":\n  \"integrity\" \"sha1-GrKLVW4Zg2Oowab35vogE3/mrtk=\"\n  \"resolved\" \"https://registry.npmjs.org/normalize-path/-/normalize-path-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n  dependencies:\n    \"remove-trailing-separator\" \"^1.0.1\"\n\n\"normalize-path@^3.0.0\":\n  \"integrity\" \"sha512-6eZs5Ls3WtCisHWp9S2GUy8dqkpGi4BVSz3GaqiE6ezub0512ESztXUwUB6C6IKbQkY2Pnb/mD4WYojCRwcwLA==\"\n  \"resolved\" \"https://registry.npmjs.org/normalize-path/-/normalize-path-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n\n\"npm-prefix@^1.2.0\":\n  \"integrity\" \"sha1-5hlFX3B0ulTMZtbQ033Z8b5ry8A=\"\n  \"resolved\" \"https://registry.npmjs.org/npm-prefix/-/npm-prefix-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n  dependencies:\n    \"rc\" \"^1.1.0\"\n    \"shellsubstitute\" \"^1.1.0\"\n    \"untildify\" \"^2.1.0\"\n\n\"object-copy@^0.1.0\":\n  \"integrity\" \"sha1-fn2Fi3gb18mRpBupde04EnVOmYw=\"\n  \"resolved\" \"https://registry.npmjs.org/object-copy/-/object-copy-0.1.0.tgz\"\n  \"version\" \"0.1.0\"\n  dependencies:\n    \"copy-descriptor\" \"^0.1.0\"\n    \"define-property\" \"^0.2.5\"\n    \"kind-of\" \"^3.0.3\"\n\n\"object-visit@^1.0.0\":\n  \"integrity\" \"sha1-95xEk68MU3e1n+OdOV5BBC3QRbs=\"\n  \"resolved\" \"https://registry.npmjs.org/object-visit/-/object-visit-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"isobject\" \"^3.0.0\"\n\n\"object.pick@^1.3.0\":\n  \"integrity\" \"sha1-h6EKxMFpS9Lhy/U1kaZhQftd10c=\"\n  \"resolved\" \"https://registry.npmjs.org/object.pick/-/object.pick-1.3.0.tgz\"\n  \"version\" \"1.3.0\"\n  dependencies:\n    \"isobject\" \"^3.0.1\"\n\n\"once@^1.3.0\":\n  \"integrity\" \"sha1-suJhVXzkwxTsgwTz+oJmPkKXyiA=\"\n  \"resolved\" \"https://registry.npmjs.org/once/-/once-1.3.3.tgz\"\n  \"version\" \"1.3.3\"\n  dependencies:\n    \"wrappy\" \"1\"\n\n\"os-homedir@^1.0.0\":\n  \"integrity\" \"sha1-/7xJiDNuDoM94MFox+8VISGqf7M=\"\n  \"resolved\" \"https://registry.npmjs.org/os-homedir/-/os-homedir-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"parse-entities@^1.0.2\", \"parse-entities@^1.1.0\":\n  \"integrity\" \"sha1-S8WPNf3I5l3e01oS8uQCI8oko/c=\"\n  \"resolved\" \"https://registry.npmjs.org/parse-entities/-/parse-entities-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"character-entities\" \"^1.0.0\"\n    \"character-entities-legacy\" \"^1.0.0\"\n    \"character-reference-invalid\" \"^1.0.0\"\n    \"has\" \"^1.0.1\"\n    \"is-alphanumerical\" \"^1.0.0\"\n    \"is-decimal\" \"^1.0.0\"\n    \"is-hexadecimal\" \"^1.0.0\"\n\n\"parse-json@^4.0.0\":\n  \"integrity\" \"sha1-vjX1Qlvh9/bHRxhPmKeIy5lHfuA=\"\n  \"resolved\" \"https://registry.npmjs.org/parse-json/-/parse-json-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"error-ex\" \"^1.3.1\"\n    \"json-parse-better-errors\" \"^1.0.1\"\n\n\"pascalcase@^0.1.1\":\n  \"integrity\" \"sha1-s2PlXoAGym/iF4TS2yK9FdeRfxQ=\"\n  \"resolved\" \"https://registry.npmjs.org/pascalcase/-/pascalcase-0.1.1.tgz\"\n  \"version\" \"0.1.1\"\n\n\"path-dirname@^1.0.0\":\n  \"integrity\" \"sha1-zDPSTVJeCZpTiMAzbG4yuRYGCeA=\"\n  \"resolved\" \"https://registry.npmjs.org/path-dirname/-/path-dirname-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"path-is-absolute@^1.0.0\":\n  \"integrity\" \"sha1-F0uSaHNVNP+8es5r9TpanhtcX18=\"\n  \"resolved\" \"https://registry.npmjs.org/path-is-absolute/-/path-is-absolute-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"plur@^2.1.2\":\n  \"integrity\" \"sha1-dIJFLBoPUI4+NE6uwxLJHCncZVo=\"\n  \"resolved\" \"https://registry.npmjs.org/plur/-/plur-2.1.2.tgz\"\n  \"version\" \"2.1.2\"\n  dependencies:\n    \"irregular-plurals\" \"^1.0.0\"\n\n\"posix-character-classes@^0.1.0\":\n  \"integrity\" \"sha1-AerA/jta9xoqbAL+q7jB/vfgDqs=\"\n  \"resolved\" \"https://registry.npmjs.org/posix-character-classes/-/posix-character-classes-0.1.1.tgz\"\n  \"version\" \"0.1.1\"\n\n\"process-nextick-args@~1.0.6\":\n  \"integrity\" \"sha1-FQ4gt1ZZCtP5EJPyWk8q2L/zC6M=\"\n  \"resolved\" \"https://registry.npmjs.org/process-nextick-args/-/process-nextick-args-1.0.7.tgz\"\n  \"version\" \"1.0.7\"\n\n\"rc@^1.1.0\":\n  \"integrity\" \"sha512-y3bGgqKj3QBdxLbLkomlohkvsA8gdAiUQlSBJnBhfn+BPxg4bc62d8TcBW15wavDfgexCgccckhcZvywyQYPOw==\"\n  \"resolved\" \"https://registry.npmjs.org/rc/-/rc-1.2.8.tgz\"\n  \"version\" \"1.2.8\"\n  dependencies:\n    \"deep-extend\" \"^0.6.0\"\n    \"ini\" \"~1.3.0\"\n    \"minimist\" \"^1.2.0\"\n    \"strip-json-comments\" \"~2.0.1\"\n\n\"readable-stream@^2.0.2\", \"readable-stream@^2.2.2\":\n  \"integrity\" \"sha1-i0Ou125xSDk40SqNRsbPGgCx+BY=\"\n  \"resolved\" \"https://registry.npmjs.org/readable-stream/-/readable-stream-2.2.6.tgz\"\n  \"version\" \"2.2.6\"\n  dependencies:\n    \"buffer-shims\" \"^1.0.0\"\n    \"core-util-is\" \"~1.0.0\"\n    \"inherits\" \"~2.0.1\"\n    \"isarray\" \"~1.0.0\"\n    \"process-nextick-args\" \"~1.0.6\"\n    \"string_decoder\" \"~0.10.x\"\n    \"util-deprecate\" \"~1.0.1\"\n\n\"readdirp@^2.2.1\":\n  \"integrity\" \"sha512-1JU/8q+VgFZyxwrJ+SVIOsh+KywWGpds3NTqikiKpDMZWScmAYyKIgqkO+ARvNWJfXeXR1zxz7aHF4u4CyH6vQ==\"\n  \"resolved\" \"https://registry.npmjs.org/readdirp/-/readdirp-2.2.1.tgz\"\n  \"version\" \"2.2.1\"\n  dependencies:\n    \"graceful-fs\" \"^4.1.11\"\n    \"micromatch\" \"^3.1.10\"\n    \"readable-stream\" \"^2.0.2\"\n\n\"regex-not@^1.0.0\", \"regex-not@^1.0.2\":\n  \"integrity\" \"sha512-J6SDjUgDxQj5NusnOtdFxDwN/+HWykR8GELwctJ7mdqhcyy1xEc4SRFHUXvxTp661YaVKAjfRLZ9cCqS6tn32A==\"\n  \"resolved\" \"https://registry.npmjs.org/regex-not/-/regex-not-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n  dependencies:\n    \"extend-shallow\" \"^3.0.2\"\n    \"safe-regex\" \"^1.1.0\"\n\n\"remark-cli@^6.0.1\":\n  \"integrity\" \"sha512-h7Hwnfdcm5J03t2mxhl9BAav+Goqauqfz3LhpE7TP+RIiPnK6njU7qRDD7qlUd/hLyMSB+WBjYc7gVDQT3pv0A==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-cli/-/remark-cli-6.0.1.tgz\"\n  \"version\" \"6.0.1\"\n  dependencies:\n    \"markdown-extensions\" \"^1.1.0\"\n    \"remark\" \"^10.0.0\"\n    \"unified-args\" \"^6.0.0\"\n\n\"remark-lint-alphabetize-lists@^2.0.1\":\n  \"integrity\" \"sha512-0wK2Zb6uJgSogCRC+5BaaiPMUX2bcMI/WjIf67XXxaWJqG4WUlAXEnuxEhMVPw2T+iRIHyvCNBYBHyRLL25mMA==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-alphabetize-lists/-/remark-lint-alphabetize-lists-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n  dependencies:\n    \"mdast-util-to-string\" \"^1.0.0\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-visit\" \"^1.0.0\"\n\n\"remark-lint-final-newline@^1.0.0\":\n  \"integrity\" \"sha1-jZNVArRDhLmHFqj+EJ5EJy63IyE=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-final-newline/-/remark-lint-final-newline-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n\n\"remark-lint-hard-break-spaces@^1.0.0\":\n  \"integrity\" \"sha1-OcV7yX4zBezrIA/gc+/49y3haxU=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-hard-break-spaces/-/remark-lint-hard-break-spaces-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-hiring-without-whiteboards-links@^0.3.2\":\n  \"integrity\" \"sha1-MZeBZjhLPkCh3FN/kXiH/5UCKD8=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-hiring-without-whiteboards-links/-/remark-lint-hiring-without-whiteboards-links-0.3.2.tgz\"\n  \"version\" \"0.3.2\"\n  dependencies:\n    \"datasets-us-states-abbr\" \"^1.0.0\"\n    \"mdast-util-to-string\" \"^1.0.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.0.0\"\n\n\"remark-lint-list-item-bullet-indent@^1.0.0\":\n  \"integrity\" \"sha1-JEOrNgo95knpZuzLQTysZD5JR80=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-list-item-bullet-indent/-/remark-lint-list-item-bullet-indent-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"plur\" \"^2.1.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-list-item-indent@^1.0.0\":\n  \"integrity\" \"sha1-TQ9EtiuHNVcaxnjEPJ0snLj2n28=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-list-item-indent/-/remark-lint-list-item-indent-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"plur\" \"^2.1.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-auto-link-without-protocol@^1.0.0\":\n  \"integrity\" \"sha1-QXcsKXos8SegqTfHdAPe/fzC3V8=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-auto-link-without-protocol/-/remark-lint-no-auto-link-without-protocol-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"mdast-util-to-string\" \"^1.0.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-blockquote-without-marker@^2.0.0\":\n  \"integrity\" \"sha512-jkfZ4hFiviZttEo7Ac7GZWFgMQ/bdVPfSluLeuf+qwL8sQvR4ClklKJ0Xbkk3cLRjvlGsc8U8uZR8qqH5MSLoA==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-blockquote-without-marker/-/remark-lint-no-blockquote-without-marker-2.0.2.tgz\"\n  \"version\" \"2.0.2\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n    \"vfile-location\" \"^2.0.1\"\n\n\"remark-lint-no-duplicate-definitions@^1.0.0\":\n  \"integrity\" \"sha1-JrQs2O2Oq50tdYQsmNNrS+ZTC3M=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-duplicate-definitions/-/remark-lint-no-duplicate-definitions-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-heading-content-indent@^1.0.0\":\n  \"integrity\" \"sha1-onGv2WZNbk93WzZhJPKXO/sfRTU=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-heading-content-indent/-/remark-lint-no-heading-content-indent-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"mdast-util-heading-style\" \"^1.0.2\"\n    \"plur\" \"^2.1.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-inline-padding@^1.0.0\":\n  \"integrity\" \"sha1-1fpFqghvPVwFSPstEaAglQ4uQrw=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-inline-padding/-/remark-lint-no-inline-padding-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"mdast-util-to-string\" \"^1.0.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-literal-urls@^1.0.0\":\n  \"integrity\" \"sha1-ykN+8mZhiJE0GJXW0Pq2zS7jfzs=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-literal-urls/-/remark-lint-no-literal-urls-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"mdast-util-to-string\" \"^1.0.2\"\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-shortcut-reference-image@^1.0.0\":\n  \"integrity\" \"sha1-c1m4IEwlsBb9zIiUenlS9p73kr4=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-shortcut-reference-image/-/remark-lint-no-shortcut-reference-image-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-shortcut-reference-link@^1.0.0\":\n  \"integrity\" \"sha1-CJxon+Bsv+F9paBwp+2tYdvkxuE=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-shortcut-reference-link/-/remark-lint-no-shortcut-reference-link-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-tabs@^1.0.2\":\n  \"integrity\" \"sha512-jPjRLHyzO4lO6orhOmHd6AN6mVc/uMWvYZ3qD41dniktnLyHEbIG6DpPxixjfpmEe0wi73RXMywKHrWshLJwAg==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-tabs/-/remark-lint-no-tabs-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"vfile-location\" \"^2.0.1\"\n\n\"remark-lint-no-trailing-spaces@^2.0.0\":\n  \"integrity\" \"sha512-UVb0xAFO5lsa/kRNC/qHOz7GuF91TjW7hk+m8hUircj1Nh53BP9rH24DJ/NVPF1Ve+u5k+pfOTJPqJcvD0zgUw==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-trailing-spaces/-/remark-lint-no-trailing-spaces-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.2\"\n\n\"remark-lint-no-undefined-references@^1.0.0\":\n  \"integrity\" \"sha1-+x3amWEFGTQ+F7AsNKW52vC09+k=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-undefined-references/-/remark-lint-no-undefined-references-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-unused-definitions@^1.0.0\":\n  \"integrity\" \"sha1-QcS3t5mInCTnATQGXXz/W5DEVu0=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-unused-definitions/-/remark-lint-no-unused-definitions-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-no-url-trailing-slash@^3.0.1\":\n  \"integrity\" \"sha512-M1Urq1d6MshfQWo1MpklUhgfxfXpXlbSIdgayvdhLmsaWclVmOqi1i8+0pOyneBdmwbzPNRno7RtsNQjTtCp+A==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-no-url-trailing-slash/-/remark-lint-no-url-trailing-slash-3.0.1.tgz\"\n  \"version\" \"3.0.1\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-visit\" \"^1.0.0\"\n\n\"remark-lint-ordered-list-marker-style@^1.0.0\":\n  \"integrity\" \"sha1-C0hu+5r0q8VkbHpYvyI5PH0iIKE=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-ordered-list-marker-style/-/remark-lint-ordered-list-marker-style-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint-unordered-list-marker-style@^1.0.2\":\n  \"integrity\" \"sha512-qdnF9JuMWzFJzGIfdAWfOHyjad8dqIQSs+cTzqMlNZHOGrrCJdTUWzybzcZMGn1yuwreklZdHKhOglXQFwSD3A==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint-unordered-list-marker-style/-/remark-lint-unordered-list-marker-style-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n  dependencies:\n    \"unified-lint-rule\" \"^1.0.0\"\n    \"unist-util-generated\" \"^1.1.0\"\n    \"unist-util-position\" \"^3.0.0\"\n    \"unist-util-visit\" \"^1.1.1\"\n\n\"remark-lint@^6.0.0\", \"remark-lint@^6.0.4\":\n  \"integrity\" \"sha512-miD6SKhjEkLgdJXgAmNhGsdY1yIGAzwpoGIn/59MR6nZhshdxSm9/pLPiw9fK3loNASA3j7k//kea6x5vHb+jQ==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-lint/-/remark-lint-6.0.4.tgz\"\n  \"version\" \"6.0.4\"\n  dependencies:\n    \"remark-message-control\" \"^4.0.0\"\n\n\"remark-message-control@^4.0.0\":\n  \"integrity\" \"sha1-/TB6G7l1lWqLKiHAJu7Q7wJOB/I=\"\n  \"resolved\" \"https://registry.npmjs.org/remark-message-control/-/remark-message-control-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"mdast-comment-marker\" \"^1.0.0\"\n    \"trim\" \"0.0.1\"\n    \"unist-util-visit\" \"^1.0.0\"\n    \"vfile-location\" \"^2.0.0\"\n\n\"remark-parse@^6.0.0\":\n  \"integrity\" \"sha512-QbDXWN4HfKTUC0hHa4teU463KclLAnwpn/FBn87j9cKYJWWawbiLgMfP2Q4XwhxxuuuOxHlw+pSN0OKuJwyVvg==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-parse/-/remark-parse-6.0.3.tgz\"\n  \"version\" \"6.0.3\"\n  dependencies:\n    \"collapse-white-space\" \"^1.0.2\"\n    \"is-alphabetical\" \"^1.0.0\"\n    \"is-decimal\" \"^1.0.0\"\n    \"is-whitespace-character\" \"^1.0.0\"\n    \"is-word-character\" \"^1.0.0\"\n    \"markdown-escapes\" \"^1.0.0\"\n    \"parse-entities\" \"^1.1.0\"\n    \"repeat-string\" \"^1.5.4\"\n    \"state-toggle\" \"^1.0.0\"\n    \"trim\" \"0.0.1\"\n    \"trim-trailing-lines\" \"^1.0.0\"\n    \"unherit\" \"^1.0.4\"\n    \"unist-util-remove-position\" \"^1.0.0\"\n    \"vfile-location\" \"^2.0.0\"\n    \"xtend\" \"^4.0.1\"\n\n\"remark-preset-lint-recommended@^3.0.2\":\n  \"integrity\" \"sha512-os4YNWLbkorjvDHVB4o+zCCufZLzGoD4Iwdk7SV7bSIZurUTrMp/ZrpNytyetN9ugIMXuHbWJUE+dF0ND+WorQ==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-preset-lint-recommended/-/remark-preset-lint-recommended-3.0.2.tgz\"\n  \"version\" \"3.0.2\"\n  dependencies:\n    \"remark-lint\" \"^6.0.0\"\n    \"remark-lint-final-newline\" \"^1.0.0\"\n    \"remark-lint-hard-break-spaces\" \"^1.0.0\"\n    \"remark-lint-list-item-bullet-indent\" \"^1.0.0\"\n    \"remark-lint-list-item-indent\" \"^1.0.0\"\n    \"remark-lint-no-auto-link-without-protocol\" \"^1.0.0\"\n    \"remark-lint-no-blockquote-without-marker\" \"^2.0.0\"\n    \"remark-lint-no-duplicate-definitions\" \"^1.0.0\"\n    \"remark-lint-no-heading-content-indent\" \"^1.0.0\"\n    \"remark-lint-no-inline-padding\" \"^1.0.0\"\n    \"remark-lint-no-literal-urls\" \"^1.0.0\"\n    \"remark-lint-no-shortcut-reference-image\" \"^1.0.0\"\n    \"remark-lint-no-shortcut-reference-link\" \"^1.0.0\"\n    \"remark-lint-no-undefined-references\" \"^1.0.0\"\n    \"remark-lint-no-unused-definitions\" \"^1.0.0\"\n    \"remark-lint-ordered-list-marker-style\" \"^1.0.0\"\n\n\"remark-stringify@^6.0.0\":\n  \"integrity\" \"sha512-eRWGdEPMVudijE/psbIDNcnJLRVx3xhfuEsTDGgH4GsFF91dVhw5nhmnBppafJ7+NWINW6C7ZwWbi30ImJzqWg==\"\n  \"resolved\" \"https://registry.npmjs.org/remark-stringify/-/remark-stringify-6.0.4.tgz\"\n  \"version\" \"6.0.4\"\n  dependencies:\n    \"ccount\" \"^1.0.0\"\n    \"is-alphanumeric\" \"^1.0.0\"\n    \"is-decimal\" \"^1.0.0\"\n    \"is-whitespace-character\" \"^1.0.0\"\n    \"longest-streak\" \"^2.0.1\"\n    \"markdown-escapes\" \"^1.0.0\"\n    \"markdown-table\" \"^1.1.0\"\n    \"mdast-util-compact\" \"^1.0.0\"\n    \"parse-entities\" \"^1.0.2\"\n    \"repeat-string\" \"^1.5.4\"\n    \"state-toggle\" \"^1.0.0\"\n    \"stringify-entities\" \"^1.0.1\"\n    \"unherit\" \"^1.0.4\"\n    \"xtend\" \"^4.0.1\"\n\n\"remark@^10.0.0\":\n  \"integrity\" \"sha512-E6lMuoLIy2TyiokHprMjcWNJ5UxfGQjaMSMhV+f4idM625UjjK4j798+gPs5mfjzDE6vL0oFKVeZM6gZVSVrzQ==\"\n  \"resolved\" \"https://registry.npmjs.org/remark/-/remark-10.0.1.tgz\"\n  \"version\" \"10.0.1\"\n  dependencies:\n    \"remark-parse\" \"^6.0.0\"\n    \"remark-stringify\" \"^6.0.0\"\n    \"unified\" \"^7.0.0\"\n\n\"remove-trailing-separator@^1.0.1\":\n  \"integrity\" \"sha1-wkvOKig62tW8P1jg1IJJuSN52O8=\"\n  \"resolved\" \"https://registry.npmjs.org/remove-trailing-separator/-/remove-trailing-separator-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"repeat-element@^1.1.2\":\n  \"integrity\" \"sha1-7wiaF40Ug7quTZPrmLT55OEdmQo=\"\n  \"resolved\" \"https://registry.npmjs.org/repeat-element/-/repeat-element-1.1.2.tgz\"\n  \"version\" \"1.1.2\"\n\n\"repeat-string@^1.5.0\", \"repeat-string@^1.5.4\", \"repeat-string@^1.6.1\":\n  \"integrity\" \"sha1-jcrkcOHIirwtYA//Sndihtp15jc=\"\n  \"resolved\" \"https://registry.npmjs.org/repeat-string/-/repeat-string-1.6.1.tgz\"\n  \"version\" \"1.6.1\"\n\n\"replace-ext@1.0.0\":\n  \"integrity\" \"sha1-3mMSg3P8v3w8z6TeWkgMRaZ5WOs=\"\n  \"resolved\" \"https://registry.npmjs.org/replace-ext/-/replace-ext-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"resolve-from@^2.0.0\":\n  \"integrity\" \"sha1-lICrIOlP+h2egKgEx+oUdhGWa1c=\"\n  \"resolved\" \"https://registry.npmjs.org/resolve-from/-/resolve-from-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n\n\"resolve-url@^0.2.1\":\n  \"integrity\" \"sha1-LGN/53yJOv0qZj/iGqkIAGjiBSo=\"\n  \"resolved\" \"https://registry.npmjs.org/resolve-url/-/resolve-url-0.2.1.tgz\"\n  \"version\" \"0.2.1\"\n\n\"ret@~0.1.10\":\n  \"integrity\" \"sha512-TTlYpa+OL+vMMNG24xSlQGEJ3B/RzEfUlLct7b5G/ytav+wPrplCpVMFuwzXbkecJrb6IYo1iFb0S9v37754mg==\"\n  \"resolved\" \"https://registry.npmjs.org/ret/-/ret-0.1.15.tgz\"\n  \"version\" \"0.1.15\"\n\n\"safe-regex@^1.1.0\":\n  \"integrity\" \"sha1-QKNmnzsHfR6UPURinhV91IAjvy4=\"\n  \"resolved\" \"https://registry.npmjs.org/safe-regex/-/safe-regex-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"ret\" \"~0.1.10\"\n\n\"set-value@^0.4.3\":\n  \"integrity\" \"sha1-fbCPnT0i3H945Trzw79GZuzfzPE=\"\n  \"resolved\" \"https://registry.npmjs.org/set-value/-/set-value-0.4.3.tgz\"\n  \"version\" \"0.4.3\"\n  dependencies:\n    \"extend-shallow\" \"^2.0.1\"\n    \"is-extendable\" \"^0.1.1\"\n    \"is-plain-object\" \"^2.0.1\"\n    \"to-object-path\" \"^0.3.0\"\n\n\"set-value@^2.0.0\":\n  \"integrity\" \"sha512-hw0yxk9GT/Hr5yJEYnHNKYXkIA8mVJgd9ditYZCe16ZczcaELYYcfvaXesNACk2O8O0nTiPQcQhGUQj8JLzeeg==\"\n  \"resolved\" \"https://registry.npmjs.org/set-value/-/set-value-2.0.0.tgz\"\n  \"version\" \"2.0.0\"\n  dependencies:\n    \"extend-shallow\" \"^2.0.1\"\n    \"is-extendable\" \"^0.1.1\"\n    \"is-plain-object\" \"^2.0.3\"\n    \"split-string\" \"^3.0.1\"\n\n\"shellsubstitute@^1.1.0\":\n  \"integrity\" \"sha1-5PcCpQxRiw9v6YRRiQ1wWvKba3A=\"\n  \"resolved\" \"https://registry.npmjs.org/shellsubstitute/-/shellsubstitute-1.2.0.tgz\"\n  \"version\" \"1.2.0\"\n\n\"sliced@^1.0.1\":\n  \"integrity\" \"sha1-CzpmK10Ewxd7GSa+qCsD+Dei70E=\"\n  \"resolved\" \"https://registry.npmjs.org/sliced/-/sliced-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n\n\"snapdragon-node@^2.0.1\":\n  \"integrity\" \"sha512-O27l4xaMYt/RSQ5TR3vpWCAB5Kb/czIcqUFOM/C4fYcLnbZUc1PkjTAMjof2pBWaSTwOUd6qUHcFGVGj7aIwnw==\"\n  \"resolved\" \"https://registry.npmjs.org/snapdragon-node/-/snapdragon-node-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n  dependencies:\n    \"define-property\" \"^1.0.0\"\n    \"isobject\" \"^3.0.0\"\n    \"snapdragon-util\" \"^3.0.1\"\n\n\"snapdragon-util@^3.0.1\":\n  \"integrity\" \"sha512-mbKkMdQKsjX4BAL4bRYTj21edOf8cN7XHdYUJEe+Zn99hVEYcMvKPct1IqNe7+AZPirn8BCDOQBHQZknqmKlZQ==\"\n  \"resolved\" \"https://registry.npmjs.org/snapdragon-util/-/snapdragon-util-3.0.1.tgz\"\n  \"version\" \"3.0.1\"\n  dependencies:\n    \"kind-of\" \"^3.2.0\"\n\n\"snapdragon@^0.8.1\":\n  \"integrity\" \"sha512-FtyOnWN/wCHTVXOMwvSv26d+ko5vWlIDD6zoUJ7LW8vh+ZBC8QdljveRP+crNrtBwioEUWy/4dMtbBjA4ioNlg==\"\n  \"resolved\" \"https://registry.npmjs.org/snapdragon/-/snapdragon-0.8.2.tgz\"\n  \"version\" \"0.8.2\"\n  dependencies:\n    \"base\" \"^0.11.1\"\n    \"debug\" \"^2.2.0\"\n    \"define-property\" \"^0.2.5\"\n    \"extend-shallow\" \"^2.0.1\"\n    \"map-cache\" \"^0.2.2\"\n    \"source-map\" \"^0.5.6\"\n    \"source-map-resolve\" \"^0.5.0\"\n    \"use\" \"^3.1.0\"\n\n\"source-map-resolve@^0.5.0\":\n  \"integrity\" \"sha512-MjqsvNwyz1s0k81Goz/9vRBe9SZdB09Bdw+/zYyO+3CuPk6fouTaxscHkgtE8jKvf01kVfl8riHzERQ/kefaSA==\"\n  \"resolved\" \"https://registry.npmjs.org/source-map-resolve/-/source-map-resolve-0.5.2.tgz\"\n  \"version\" \"0.5.2\"\n  dependencies:\n    \"atob\" \"^2.1.1\"\n    \"decode-uri-component\" \"^0.2.0\"\n    \"resolve-url\" \"^0.2.1\"\n    \"source-map-url\" \"^0.4.0\"\n    \"urix\" \"^0.1.0\"\n\n\"source-map-url@^0.4.0\":\n  \"integrity\" \"sha1-PpNdfd1zYxuXZZlW1VEo6HtQhKM=\"\n  \"resolved\" \"https://registry.npmjs.org/source-map-url/-/source-map-url-0.4.0.tgz\"\n  \"version\" \"0.4.0\"\n\n\"source-map@^0.5.6\":\n  \"integrity\" \"sha1-igOdLRAh0i0eoUyA2OpGi6LvP8w=\"\n  \"resolved\" \"https://registry.npmjs.org/source-map/-/source-map-0.5.7.tgz\"\n  \"version\" \"0.5.7\"\n\n\"split-string@^3.0.1\", \"split-string@^3.0.2\":\n  \"integrity\" \"sha512-NzNVhJDYpwceVVii8/Hu6DKfD2G+NrQHlS/V/qgv763EYudVwEcMQNxd2lh+0VrUByXN/oJkl5grOhYWvQUYiw==\"\n  \"resolved\" \"https://registry.npmjs.org/split-string/-/split-string-3.1.0.tgz\"\n  \"version\" \"3.1.0\"\n  dependencies:\n    \"extend-shallow\" \"^3.0.0\"\n\n\"sprintf-js@~1.0.2\":\n  \"integrity\" \"sha1-BOaSb2YolTVPPdAVIDYzuFcpfiw=\"\n  \"resolved\" \"https://registry.npmjs.org/sprintf-js/-/sprintf-js-1.0.3.tgz\"\n  \"version\" \"1.0.3\"\n\n\"state-toggle@^1.0.0\":\n  \"integrity\" \"sha1-0g+aYWu08MO5i5GSLSW2QKorxCU=\"\n  \"resolved\" \"https://registry.npmjs.org/state-toggle/-/state-toggle-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"static-extend@^0.1.1\":\n  \"integrity\" \"sha1-YICcOcv/VTNyJv1eC1IPNB8ftcY=\"\n  \"resolved\" \"https://registry.npmjs.org/static-extend/-/static-extend-0.1.2.tgz\"\n  \"version\" \"0.1.2\"\n  dependencies:\n    \"define-property\" \"^0.2.5\"\n    \"object-copy\" \"^0.1.0\"\n\n\"string_decoder@~0.10.x\":\n  \"integrity\" \"sha1-YuIDvEF2bGwoyfyEMB2rHFMQ+pQ=\"\n  \"resolved\" \"https://registry.npmjs.org/string_decoder/-/string_decoder-0.10.31.tgz\"\n  \"version\" \"0.10.31\"\n\n\"string-width@^2.0.0\":\n  \"integrity\" \"sha512-nOqH59deCq9SRHlxq1Aw85Jnt4w6KvLKqWVik6oA9ZklXLNIOlqg4F2yrT1MVaTjAqvVwdfeZ7w7aCvJD7ugkw==\"\n  \"resolved\" \"https://registry.npmjs.org/string-width/-/string-width-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n  dependencies:\n    \"is-fullwidth-code-point\" \"^2.0.0\"\n    \"strip-ansi\" \"^4.0.0\"\n\n\"stringify-entities@^1.0.1\":\n  \"integrity\" \"sha1-IkSlFsTx6OAbc9rQECMBZ3ar2Rc=\"\n  \"resolved\" \"https://registry.npmjs.org/stringify-entities/-/stringify-entities-1.3.0.tgz\"\n  \"version\" \"1.3.0\"\n  dependencies:\n    \"character-entities-html4\" \"^1.0.0\"\n    \"character-entities-legacy\" \"^1.0.0\"\n    \"has\" \"^1.0.1\"\n    \"is-alphanumerical\" \"^1.0.0\"\n    \"is-hexadecimal\" \"^1.0.0\"\n\n\"strip-ansi@^4.0.0\":\n  \"integrity\" \"sha1-qEeQIusaw2iocTibY1JixQXuNo8=\"\n  \"resolved\" \"https://registry.npmjs.org/strip-ansi/-/strip-ansi-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"ansi-regex\" \"^3.0.0\"\n\n\"strip-json-comments@~2.0.1\":\n  \"integrity\" \"sha1-PFMZQukIwml8DsNEhYwobHygpgo=\"\n  \"resolved\" \"https://registry.npmjs.org/strip-json-comments/-/strip-json-comments-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n\n\"supports-color@^5.3.0\", \"supports-color@^5.4.0\":\n  \"integrity\" \"sha512-QjVjwdXIt408MIiAqCX4oUKsgU2EqAGzs2Ppkm4aQYbjm+ZEWEcW4SfFNTr4uMNZma0ey4f5lgLrkB0aX0QMow==\"\n  \"resolved\" \"https://registry.npmjs.org/supports-color/-/supports-color-5.5.0.tgz\"\n  \"version\" \"5.5.0\"\n  dependencies:\n    \"has-flag\" \"^3.0.0\"\n\n\"text-table@^0.2.0\":\n  \"integrity\" \"sha1-f17oI66AUgfACvLfSoTsP8+lcLQ=\"\n  \"resolved\" \"https://registry.npmjs.org/text-table/-/text-table-0.2.0.tgz\"\n  \"version\" \"0.2.0\"\n\n\"to-object-path@^0.3.0\":\n  \"integrity\" \"sha1-KXWIt7Dn4KwI4E5nL4XB9JmeF68=\"\n  \"resolved\" \"https://registry.npmjs.org/to-object-path/-/to-object-path-0.3.0.tgz\"\n  \"version\" \"0.3.0\"\n  dependencies:\n    \"kind-of\" \"^3.0.2\"\n\n\"to-regex-range@^2.1.0\":\n  \"integrity\" \"sha1-fIDBe53+vlmeJzZ+DU3VWQFB2zg=\"\n  \"resolved\" \"https://registry.npmjs.org/to-regex-range/-/to-regex-range-2.1.1.tgz\"\n  \"version\" \"2.1.1\"\n  dependencies:\n    \"is-number\" \"^3.0.0\"\n    \"repeat-string\" \"^1.6.1\"\n\n\"to-regex@^3.0.1\", \"to-regex@^3.0.2\":\n  \"integrity\" \"sha512-FWtleNAtZ/Ki2qtqej2CXTOayOH9bHDQF+Q48VpWyDXjbYxA4Yz8iDB31zXOBUlOHHKidDbqGVrTUvQMPmBGBw==\"\n  \"resolved\" \"https://registry.npmjs.org/to-regex/-/to-regex-3.0.2.tgz\"\n  \"version\" \"3.0.2\"\n  dependencies:\n    \"define-property\" \"^2.0.2\"\n    \"extend-shallow\" \"^3.0.2\"\n    \"regex-not\" \"^1.0.2\"\n    \"safe-regex\" \"^1.1.0\"\n\n\"to-vfile@^4.0.0\":\n  \"integrity\" \"sha512-Y7EDM+uoU8TZxF5ej2mUR0dLO4qbuuNRnJKxEht2QJWEq2421pyG1D1x8YxPKmyTc6nHh7Td/jLGFxYo+9vkLA==\"\n  \"resolved\" \"https://registry.npmjs.org/to-vfile/-/to-vfile-4.0.0.tgz\"\n  \"version\" \"4.0.0\"\n  dependencies:\n    \"is-buffer\" \"^2.0.0\"\n    \"vfile\" \"^3.0.0\"\n\n\"trim-trailing-lines@^1.0.0\":\n  \"integrity\" \"sha1-eu+7eAjfnWafbaLkOMrIxGradoQ=\"\n  \"resolved\" \"https://registry.npmjs.org/trim-trailing-lines/-/trim-trailing-lines-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"trim@0.0.1\":\n  \"integrity\" \"sha1-WFhUf2spB1fulczMZm+1AITEYN0=\"\n  \"resolved\" \"https://registry.npmjs.org/trim/-/trim-0.0.1.tgz\"\n  \"version\" \"0.0.1\"\n\n\"trough@^1.0.0\":\n  \"integrity\" \"sha1-a97f5/KqSabzxDIldodVWVfzQv0=\"\n  \"resolved\" \"https://registry.npmjs.org/trough/-/trough-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n\n\"typedarray@^0.0.6\":\n  \"integrity\" \"sha1-hnrHTjhkGHsdPUfZlqeOxciDB3c=\"\n  \"resolved\" \"https://registry.npmjs.org/typedarray/-/typedarray-0.0.6.tgz\"\n  \"version\" \"0.0.6\"\n\n\"unherit@^1.0.4\":\n  \"integrity\" \"sha1-a5qu379z3xdWrZ4xbdmBiFhAzX0=\"\n  \"resolved\" \"https://registry.npmjs.org/unherit/-/unherit-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"inherits\" \"^2.0.1\"\n    \"xtend\" \"^4.0.1\"\n\n\"unified-args@^6.0.0\":\n  \"integrity\" \"sha512-1m2pGiTClgcCtCvgtABkJLze8JJiZpzsqujRhzBjZsRwaIIU1Yj36YHY6t2RvidO8d6fucZdk3KX+8eS4+uv9g==\"\n  \"resolved\" \"https://registry.npmjs.org/unified-args/-/unified-args-6.0.0.tgz\"\n  \"version\" \"6.0.0\"\n  dependencies:\n    \"camelcase\" \"^5.0.0\"\n    \"chalk\" \"^2.0.0\"\n    \"chokidar\" \"^2.0.0\"\n    \"fault\" \"^1.0.2\"\n    \"json5\" \"^1.0.0\"\n    \"minimist\" \"^1.2.0\"\n    \"text-table\" \"^0.2.0\"\n    \"unified-engine\" \"^6.0.0\"\n\n\"unified-engine@^6.0.0\":\n  \"integrity\" \"sha512-iDJYH82TgcezQA4IZzhCNJQx7vBsGk4h9s4Q7Fscrb3qcPsxBqVrVNYez2W3sBVTxuU1bFAhyRpA6ba/R4j93A==\"\n  \"resolved\" \"https://registry.npmjs.org/unified-engine/-/unified-engine-6.0.1.tgz\"\n  \"version\" \"6.0.1\"\n  dependencies:\n    \"concat-stream\" \"^1.5.1\"\n    \"debug\" \"^3.1.0\"\n    \"fault\" \"^1.0.0\"\n    \"fn-name\" \"^2.0.1\"\n    \"glob\" \"^7.0.3\"\n    \"ignore\" \"^3.2.0\"\n    \"is-empty\" \"^1.0.0\"\n    \"is-hidden\" \"^1.0.1\"\n    \"is-object\" \"^1.0.1\"\n    \"js-yaml\" \"^3.6.1\"\n    \"load-plugin\" \"^2.0.0\"\n    \"parse-json\" \"^4.0.0\"\n    \"to-vfile\" \"^4.0.0\"\n    \"trough\" \"^1.0.0\"\n    \"unist-util-inspect\" \"^4.1.2\"\n    \"vfile-reporter\" \"^5.0.0\"\n    \"vfile-statistics\" \"^1.1.0\"\n    \"x-is-string\" \"^0.1.0\"\n    \"xtend\" \"^4.0.1\"\n\n\"unified-lint-rule@^1.0.0\", \"unified-lint-rule@^1.0.2\":\n  \"integrity\" \"sha512-6z+HH3mtlFdj/w3MaQpObrZAd9KRiro370GxBFh13qkV8LYR21lLozA4iQiZPhe7KuX/lHewoGOEgQ4AWrAR3Q==\"\n  \"resolved\" \"https://registry.npmjs.org/unified-lint-rule/-/unified-lint-rule-1.0.3.tgz\"\n  \"version\" \"1.0.3\"\n  dependencies:\n    \"wrapped\" \"^1.0.1\"\n\n\"unified@^7.0.0\":\n  \"integrity\" \"sha512-lbk82UOIGuCEsZhPj8rNAkXSDXd6p0QLzIuSsCdxrqnqU56St4eyOB+AlXsVgVeRmetPTYydIuvFfpDIed8mqw==\"\n  \"resolved\" \"https://registry.npmjs.org/unified/-/unified-7.1.0.tgz\"\n  \"version\" \"7.1.0\"\n  dependencies:\n    \"@types/unist\" \"^2.0.0\"\n    \"@types/vfile\" \"^3.0.0\"\n    \"bail\" \"^1.0.0\"\n    \"extend\" \"^3.0.0\"\n    \"is-plain-obj\" \"^1.1.0\"\n    \"trough\" \"^1.0.0\"\n    \"vfile\" \"^3.0.0\"\n    \"x-is-string\" \"^0.1.0\"\n\n\"union-value@^1.0.0\":\n  \"integrity\" \"sha1-XHHDTLW61dzr4+oM0IIHulqhrqQ=\"\n  \"resolved\" \"https://registry.npmjs.org/union-value/-/union-value-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"arr-union\" \"^3.1.0\"\n    \"get-value\" \"^2.0.6\"\n    \"is-extendable\" \"^0.1.1\"\n    \"set-value\" \"^0.4.3\"\n\n\"unist-util-generated@^1.1.0\":\n  \"integrity\" \"sha1-jJVlf/ErMur/4HMfuzfaaZX64Bs=\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-generated/-/unist-util-generated-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"unist-util-inspect@^4.1.2\":\n  \"integrity\" \"sha512-Fv9R88ZBbDp7mHN+wsbxS1r8VW3unyhZh/F18dcJRQsg0+g3DxNQnMS+AEG/uotB8Md+HMK/TfzSU5lUDWxkZg==\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-inspect/-/unist-util-inspect-4.1.3.tgz\"\n  \"version\" \"4.1.3\"\n  dependencies:\n    \"is-empty\" \"^1.0.0\"\n\n\"unist-util-modify-children@^1.0.0\":\n  \"integrity\" \"sha1-VZIDroXXp2KDJ3vhq/uvWVoXfq0=\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-modify-children/-/unist-util-modify-children-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"array-iterate\" \"^1.0.0\"\n\n\"unist-util-position@^3.0.0\":\n  \"integrity\" \"sha1-5uHgPu64HF4a/lU+jUrfvXwNj4I=\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-position/-/unist-util-position-3.0.0.tgz\"\n  \"version\" \"3.0.0\"\n\n\"unist-util-remove-position@^1.0.0\":\n  \"integrity\" \"sha1-JET+3DRLxfVA2rY1PgE7bXgQHcI=\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-remove-position/-/unist-util-remove-position-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n  dependencies:\n    \"unist-util-visit\" \"^1.1.0\"\n\n\"unist-util-stringify-position@^1.0.0\", \"unist-util-stringify-position@^1.1.1\":\n  \"integrity\" \"sha512-pNCVrk64LZv1kElr0N1wPiHEUoXNVFERp+mlTg/s9R5Lwg87f9bM/3sQB99w+N9D/qnM9ar3+AKDBwo/gm/iQQ==\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-stringify-position/-/unist-util-stringify-position-1.1.2.tgz\"\n  \"version\" \"1.1.2\"\n\n\"unist-util-visit@^1.0.0\", \"unist-util-visit@^1.1.0\", \"unist-util-visit@^1.1.1\":\n  \"integrity\" \"sha1-6RejsTdlizNctEIMfaLnTZKOTpQ=\"\n  \"resolved\" \"https://registry.npmjs.org/unist-util-visit/-/unist-util-visit-1.1.1.tgz\"\n  \"version\" \"1.1.1\"\n\n\"unset-value@^1.0.0\":\n  \"integrity\" \"sha1-g3aHP30jNRef+x5vw6jtDfyKtVk=\"\n  \"resolved\" \"https://registry.npmjs.org/unset-value/-/unset-value-1.0.0.tgz\"\n  \"version\" \"1.0.0\"\n  dependencies:\n    \"has-value\" \"^0.3.1\"\n    \"isobject\" \"^3.0.0\"\n\n\"untildify@^2.1.0\":\n  \"integrity\" \"sha1-F+soB5h/dpUunASF/DEdBqgmouA=\"\n  \"resolved\" \"https://registry.npmjs.org/untildify/-/untildify-2.1.0.tgz\"\n  \"version\" \"2.1.0\"\n  dependencies:\n    \"os-homedir\" \"^1.0.0\"\n\n\"upath@^1.1.0\":\n  \"integrity\" \"sha512-bzpH/oBhoS/QI/YtbkqCg6VEiPYjSZtrHQM6/QnJS6OL9pKUFLqb3aFh4Scvwm45+7iAgiMkLhSbaZxUqmrprw==\"\n  \"resolved\" \"https://registry.npmjs.org/upath/-/upath-1.1.0.tgz\"\n  \"version\" \"1.1.0\"\n\n\"urix@^0.1.0\":\n  \"integrity\" \"sha1-2pN/emLiH+wf0Y1Js1wpNQZ6bHI=\"\n  \"resolved\" \"https://registry.npmjs.org/urix/-/urix-0.1.0.tgz\"\n  \"version\" \"0.1.0\"\n\n\"use@^3.1.0\":\n  \"integrity\" \"sha512-cwESVXlO3url9YWlFW/TA9cshCEhtu7IKJ/p5soJ/gGpj7vbvFrAY/eIioQ6Dw23KjZhYgiIo8HOs1nQ2vr/oQ==\"\n  \"resolved\" \"https://registry.npmjs.org/use/-/use-3.1.1.tgz\"\n  \"version\" \"3.1.1\"\n\n\"util-deprecate@~1.0.1\":\n  \"integrity\" \"sha1-RQ1Nyfpw3nMnYvvS1KKJgUGaDM8=\"\n  \"resolved\" \"https://registry.npmjs.org/util-deprecate/-/util-deprecate-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"vfile-location@^2.0.0\", \"vfile-location@^2.0.1\":\n  \"integrity\" \"sha1-C/iBb3MrD4vZAqVv2kxiyOk13FI=\"\n  \"resolved\" \"https://registry.npmjs.org/vfile-location/-/vfile-location-2.0.1.tgz\"\n  \"version\" \"2.0.1\"\n\n\"vfile-message@^1.0.0\":\n  \"integrity\" \"sha512-1WmsopSGhWt5laNir+633LszXvZ+Z/lxveBf6yhGsqnQIhlhzooZae7zV6YVM1Sdkw68dtAW3ow0pOdPANugvA==\"\n  \"resolved\" \"https://registry.npmjs.org/vfile-message/-/vfile-message-1.1.1.tgz\"\n  \"version\" \"1.1.1\"\n  dependencies:\n    \"unist-util-stringify-position\" \"^1.1.1\"\n\n\"vfile-reporter@^5.0.0\":\n  \"integrity\" \"sha512-A/cfKvfVmeEmAKx1yyOWggCjC/k184Vkl5pVJAw5CEdppHd5FHBVcdyJ1JBSqIdJjJqyhZY4ZD3JycHr/uwmlA==\"\n  \"resolved\" \"https://registry.npmjs.org/vfile-reporter/-/vfile-reporter-5.1.1.tgz\"\n  \"version\" \"5.1.1\"\n  dependencies:\n    \"repeat-string\" \"^1.5.0\"\n    \"string-width\" \"^2.0.0\"\n    \"supports-color\" \"^5.4.0\"\n    \"unist-util-stringify-position\" \"^1.0.0\"\n    \"vfile-sort\" \"^2.1.2\"\n    \"vfile-statistics\" \"^1.1.0\"\n\n\"vfile-sort@^2.1.2\":\n  \"integrity\" \"sha512-RgxLXVWrJBWb2GuP8FsSkqK7HmbjXjnI8qx3nD6NTWhsWaelaKvJuxfh1F1d1lkCPD7imo4zzi8cf6IOMgaTnQ==\"\n  \"resolved\" \"https://registry.npmjs.org/vfile-sort/-/vfile-sort-2.2.0.tgz\"\n  \"version\" \"2.2.0\"\n\n\"vfile-statistics@^1.1.0\":\n  \"integrity\" \"sha512-16wAC9eEGXdsD35LX9m/iXCRIZyX5LIrDgDtAF92rbATSqsBRbC4n05e0Rj5vt3XRpcKu0UJeWnTxWsSyvNZ+w==\"\n  \"resolved\" \"https://registry.npmjs.org/vfile-statistics/-/vfile-statistics-1.1.2.tgz\"\n  \"version\" \"1.1.2\"\n\n\"vfile@^3.0.0\":\n  \"integrity\" \"sha512-y7Y3gH9BsUSdD4KzHsuMaCzRjglXN0W2EcMf0gpvu6+SbsGhMje7xDc8AEoeXy6mIwCKMI6BkjMsRjzQbhMEjQ==\"\n  \"resolved\" \"https://registry.npmjs.org/vfile/-/vfile-3.0.1.tgz\"\n  \"version\" \"3.0.1\"\n  dependencies:\n    \"is-buffer\" \"^2.0.0\"\n    \"replace-ext\" \"1.0.0\"\n    \"unist-util-stringify-position\" \"^1.0.0\"\n    \"vfile-message\" \"^1.0.0\"\n\n\"wrapped@^1.0.1\":\n  \"integrity\" \"sha1-x4PZ2Aeyc+mwHoUWgKk4yHyQckI=\"\n  \"resolved\" \"https://registry.npmjs.org/wrapped/-/wrapped-1.0.1.tgz\"\n  \"version\" \"1.0.1\"\n  dependencies:\n    \"co\" \"3.1.0\"\n    \"sliced\" \"^1.0.1\"\n\n\"wrappy@1\":\n  \"integrity\" \"sha1-tSQ9jz7BqjXxNkYFvA0QNuMKtp8=\"\n  \"resolved\" \"https://registry.npmjs.org/wrappy/-/wrappy-1.0.2.tgz\"\n  \"version\" \"1.0.2\"\n\n\"x-is-string@^0.1.0\":\n  \"integrity\" \"sha1-R0tQhlrzpJqcRlfwWs0UVFj3fYI=\"\n  \"resolved\" \"https://registry.npmjs.org/x-is-string/-/x-is-string-0.1.0.tgz\"\n  \"version\" \"0.1.0\"\n\n\"xtend@^4.0.1\":\n  \"integrity\" \"sha1-pcbVMr5lbiPbgg77lDofBJmNY68=\"\n  \"resolved\" \"https://registry.npmjs.org/xtend/-/xtend-4.0.1.tgz\"\n  \"version\" \"4.0.1\"\n"
        }
      ]
    }
  ]
}