{
  "metadata": {
    "timestamp": 1736554998661,
    "page": 80,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Hack-with-Github/Awesome-Hacking",
      "stars": 87520,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 6.4,
          "content": "CC0 1.0 Universal\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator and\nsubsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for the\npurpose of contributing to a commons of creative, cultural and scientific\nworks (\"Commons\") that the public can reliably and without fear of later\nclaims of infringement build upon, modify, incorporate in other works, reuse\nand redistribute as freely as possible in any form whatsoever and for any\npurposes, including without limitation commercial purposes. These owners may\ncontribute to the Commons to promote the ideal of a free culture and the\nfurther production of creative, cultural and scientific works, or to gain\nreputation or greater distribution for their Work in part through the use and\nefforts of others.\n\nFor these and/or other purposes and motivations, and without any expectation\nof additional consideration or compensation, the person associating CC0 with a\nWork (the \"Affirmer\"), to the extent that he or she is an owner of Copyright\nand Related Rights in the Work, voluntarily elects to apply CC0 to the Work\nand publicly distribute the Work under its terms, with knowledge of his or her\nCopyright and Related Rights in the Work and the meaning and intended legal\neffect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not limited\nto, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display, communicate,\n  and translate a Work;\n\n  ii. moral rights retained by the original author(s) and/or performer(s);\n\n  iii. publicity and privacy rights pertaining to a person's image or likeness\n  depicted in a Work;\n\n  iv. rights protecting against unfair competition in regards to a Work,\n  subject to the limitations in paragraph 4(a), below;\n\n  v. rights protecting the extraction, dissemination, use and reuse of data in\n  a Work;\n\n  vi. database rights (such as those arising under Directive 96/9/EC of the\n  European Parliament and of the Council of 11 March 1996 on the legal\n  protection of databases, and under any national implementation thereof,\n  including any amended or successor version of such directive); and\n\n  vii. other similar, equivalent or corresponding rights throughout the world\n  based on applicable law or treaty, and any national implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention of,\napplicable law, Affirmer hereby overtly, fully, permanently, irrevocably and\nunconditionally waives, abandons, and surrenders all of Affirmer's Copyright\nand Related Rights and associated claims and causes of action, whether now\nknown or unknown (including existing as well as future claims and causes of\naction), in the Work (i) in all territories worldwide, (ii) for the maximum\nduration provided by applicable law or treaty (including future time\nextensions), (iii) in any current or future medium and for any number of\ncopies, and (iv) for any purpose whatsoever, including without limitation\ncommercial, advertising or promotional purposes (the \"Waiver\"). Affirmer makes\nthe Waiver for the benefit of each member of the public at large and to the\ndetriment of Affirmer's heirs and successors, fully intending that such Waiver\nshall not be subject to revocation, rescission, cancellation, termination, or\nany other legal or equitable action to disrupt the quiet enjoyment of the Work\nby the public as contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason be\njudged legally invalid or ineffective under applicable law, then the Waiver\nshall be preserved to the maximum extent permitted taking into account\nAffirmer's express Statement of Purpose. In addition, to the extent the Waiver\nis so judged Affirmer hereby grants to each affected person a royalty-free,\nnon transferable, non sublicensable, non exclusive, irrevocable and\nunconditional license to exercise Affirmer's Copyright and Related Rights in\nthe Work (i) in all territories worldwide, (ii) for the maximum duration\nprovided by applicable law or treaty (including future time extensions), (iii)\nin any current or future medium and for any number of copies, and (iv) for any\npurpose whatsoever, including without limitation commercial, advertising or\npromotional purposes (the \"License\"). The License shall be deemed effective as\nof the date CC0 was applied by Affirmer to the Work. Should any part of the\nLicense for any reason be judged legally invalid or ineffective under\napplicable law, such partial invalidity or ineffectiveness shall not\ninvalidate the remainder of the License, and in such case Affirmer hereby\naffirms that he or she will not (i) exercise any of his or her remaining\nCopyright and Related Rights in the Work or (ii) assert any associated claims\nand causes of action with respect to the Work, in either case contrary to\nAffirmer's express Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n  a. No trademark or patent rights held by Affirmer are waived, abandoned,\n  surrendered, licensed or otherwise affected by this document.\n\n  b. Affirmer offers the Work as-is and makes no representations or warranties\n  of any kind concerning the Work, express, implied, statutory or otherwise,\n  including without limitation warranties of title, merchantability, fitness\n  for a particular purpose, non infringement, or the absence of latent or\n  other defects, accuracy, or the present or absence of errors, whether or not\n  discoverable, all to the greatest extent permissible under applicable law.\n\n  c. Affirmer disclaims responsibility for clearing rights of other persons\n  that may apply to the Work or any use thereof, including without limitation\n  any person's Copyright and Related Rights in the Work. Further, Affirmer\n  disclaims responsibility for obtaining any necessary consents, permissions\n  or other rights required for any use of the Work.\n\n  d. Affirmer understands and acknowledges that Creative Commons is not a\n  party to this document and has no duty or obligation with respect to this\n  CC0 or use of the Work.\n\nFor more information, please see\n<http://creativecommons.org/publicdomain/zero/1.0/>\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.34,
          "content": "![Awesome Hacking](awesome_hacking.jpg)\n\n# [Awesome Hacking](https://github.com/Hack-with-Github/Awesome-Hacking) [![Tweet](https://img.shields.io/twitter/url/http/shields.io.svg?style=social)](https://twitter.com/intent/tweet?text=Awesome%20Hacking%20-%20a%20collection%20of%20awesome%20lists%20for%20hackers%20and%20pentesters%20by%20@HackwithGithub&url=https://github.com/Hack-with-Github/Awesome-Hacking&hashtags=security,hacking)\n\n**A collection of awesome lists for hackers, pentesters & security researchers.**\n\nYour [contributions](contributing.md) are always welcome !\n\n## Awesome Repositories\n\nRepository | Description\n---- | ----\n[Android Security](https://github.com/ashishb/android-security-awesome) \t\t\t| Collection of Android security related resources\n[AppSec](https://github.com/paragonie/awesome-appsec)\t\t\t\t\t\t\t\t| Resources for learning about application security\n[Asset Discovery](https://github.com/redhuntlabs/Awesome-Asset-Discovery)    | List of resources which help during asset discovery phase of a security assessment engagement\n[Bug Bounty](https://github.com/djadmin/awesome-bug-bounty) \t\t\t\t\t\t| List of Bug Bounty Programs and write-ups from the Bug Bounty hunters\n[Capsulecorp Pentest](https://github.com/r3dy/capsulecorp-pentest) \t\t\t\t\t\t| Vagrant+Ansible virtual network penetration testing lab. Companion to \"The Art of Network Penetration Testing\" by Royce Davis \n[Celluar Hacking](https://github.com/W00t3k/Awesome-Cellular-Hacking)    | This is a list of hacking research in the 3G/4G/5G cellular security space. \n[CTF](https://github.com/apsdehal/awesome-ctf) \t\t\t\t\t\t\t\t\t\t| List of CTF frameworks, libraries, resources and softwares\n[Cyber Skills](https://github.com/joe-shenouda/awesome-cyber-skills) | Curated list of hacking environments where you can train your cyber skills legally and safely\n[DevSecOps](https://github.com/devsecops/awesome-devsecops) \t\t\t\t\t\t| List of awesome DevSecOps tools with the help from community experiments and contributions\n[Embedded and IoT Security](https://github.com/fkie-cad/awesome-embedded-and-iot-security) | A curated list of awesome resources about embedded and IoT security\n[Exploit Development](https://github.com/FabioBaroni/awesome-exploit-development) \t| Resources for learning about Exploit Development\n[Fuzzing](https://github.com/secfigo/Awesome-Fuzzing) \t\t\t\t\t\t\t\t| List of fuzzing resources for learning Fuzzing and initial phases of Exploit Development like root cause analysis\n[Hacking](https://github.com/carpedm20/awesome-hacking) \t\t\t\t\t\t| List of awesome Hacking tutorials, tools and resources\n[Hacking Resources](https://github.com/vitalysim/Awesome-Hacking-Resources)          | Collection of hacking / penetration testing resources to make you better!\n[Honeypots](https://github.com/paralax/awesome-honeypots) \t\t\t\t\t\t\t| List of honeypot resources\n[Incident Response](https://github.com/meirwah/awesome-incident-response) \t\t\t| List of tools for incident response\n[Industrial Control System Security](https://github.com/hslatman/awesome-industrial-control-system-security)      | List of resources related to Industrial Control System (ICS) security\n[InfoSec](https://github.com/onlurking/awesome-infosec) \t\t\t\t\t\t\t| List of awesome infosec courses and training resources\n[IoT Hacks](https://github.com/nebgnahz/awesome-iot-hacks) \t\t\t\t\t\t\t| Collection of Hacks in IoT Space\n[Mainframe Hacking](https://github.com/samanL33T/Awesome-Mainframe-Hacking) \t\t\t\t| List of Awesome Mainframe Hacking/Pentesting Resources\n[Malware Analysis](https://github.com/rshipp/awesome-malware-analysis) \t\t\t\t| List of awesome malware analysis tools and resources\n[OSINT](https://github.com/jivoi/awesome-osint) \t\t\t\t\t\t\t\t\t | List of amazingly awesome Open Source Intelligence (OSINT) tools and resources\n[OSX and iOS Security](https://github.com/ashishb/osx-and-ios-security-awesome) \t| OSX and iOS related security tools\n[Pcaptools](https://github.com/caesar0301/awesome-pcaptools) \t\t\t\t\t\t| Collection of tools developed by researchers in the Computer Science area to process network traces\n[Pentest](https://github.com/enaqx/awesome-pentest) \t\t\t\t\t\t\t\t| List of awesome penetration testing resources, tools and other shiny things\n[PHP Security](https://github.com/ziadoz/awesome-php#security) \t\t\t\t\t\t| Libraries for generating secure random numbers, encrypting data and scanning for vulnerabilities\n[Real-time Communications hacking & pentesting resources](https://github.com/EnableSecurity/awesome-rtc-hacking) | Covers VoIP, WebRTC and VoLTE security related topics\n[Red Teaming](https://github.com/yeyintminthuhtut/Awesome-Red-Teaming) | List of Awesome Red Team / Red Teaming Resources\n[Reversing](https://github.com/fdivrp/awesome-reversing) \t\t\t\t\t\t| List of awesome reverse engineering resources\n[Reinforcement Learning for Cyber Security](https://github.com/Limmen/awesome-rl-for-cybersecurity) \t\t\t\t\t\t\t| List of awesome reinforcement learning for security resources\n[Sec Talks](https://github.com/PaulSec/awesome-sec-talks) \t\t\t\t\t\t\t| List of awesome security talks\n[SecLists](https://github.com/danielmiessler/SecLists) \t\t\t\t\t\t\t\t| Collection of multiple types of lists used during security assessments\n[Security](https://github.com/sbilly/awesome-security) \t\t\t\t\t\t\t\t| Collection of awesome software, libraries, documents, books, resources and cools stuffs about security\n[Serverless Security](https://github.com/puresec/awesome-serverless-security/) \t\t\t| Collection of Serverless security related resources\n[Social Engineering](https://github.com/v2-dev/awesome-social-engineering) | List of awesome social engineering resources\n[Static Analysis](https://github.com/mre/awesome-static-analysis) \t\t\t\t\t| List of static analysis tools, linters and code quality checkers for various programming languages\n[The Art of Hacking Series](https://github.com/The-Art-of-Hacking/h4cker)    | List of resources  includes thousands of cybersecurity-related references and resources\n[Threat Intelligence](https://github.com/hslatman/awesome-threat-intelligence) \t\t| List of Awesome Threat Intelligence resources\n[Vehicle Security](https://github.com/jaredthecoder/awesome-vehicle-security) \t| List of resources for learning about vehicle security and car hacking\n[Vulnerability Research](https://github.com/re-pronin/awesome-vulnerability-research) | List of resources about Vulnerability Research\n[Web Hacking](https://github.com/infoslack/awesome-web-hacking) \t\t\t\t\t| List of web application security\n[Web3 Security](https://github.com/Anugrahsr/Awesome-web3-Security) | A curated list of web3 Security materials and resources For Pentesters and Bug Hunters.\n[Windows Exploitation - Advanced](https://github.com/yeyintminthuhtut/Awesome-Advanced-Windows-Exploitation-References) | List of Awesome Advanced Windows Exploitation References\n[WiFi Arsenal](https://github.com/0x90/wifi-arsenal) \t\t\t\t\t\t\t\t| Pack of various useful/useless tools for 802.11 hacking\n[YARA](https://github.com/InQuest/awesome-yara)                                     | List of awesome YARA rules, tools, and people\n[Hacker Roadmap](https://github.com/sundowndev/hacker-roadmap)                                     | A guide for amateur pen testers and a collection of hacking tools, resources and references to practice ethical hacking.\n\n## Other Useful Repositories\n\nRepository | Description\n---- | ----\n[Adversarial Machine Learning](https://github.com/yenchenlin/awesome-adversarial-machine-learning) | Curated list of awesome adversarial machine learning resources\n[AI Security](https://github.com/RandomAdversary/Awesome-AI-Security) | Curated list of AI security resources\n[API Security Checklist](https://github.com/shieldfy/API-Security-Checklist) | Checklist of the most important security countermeasures when designing, testing, and releasing your API\n[APT Notes](https://github.com/kbandla/APTnotes) \t\t\t\t\t\t\t\t\t| Various public documents, whitepapers and articles about APT campaigns\n[Bug Bounty Reference](https://github.com/ngalongc/bug-bounty-reference) \t\t\t| List of bug bounty write-up that is categorized by the bug nature\n[Cryptography](https://github.com/sobolevn/awesome-cryptography) | Cryptography resources and tools\n[CTF Tool](https://github.com/SandySekharan/CTF-tool) \t\t\t\t\t\t\t\t| List of Capture The Flag (CTF) frameworks, libraries, resources and softwares\n[CVE PoC](https://github.com/qazbnm456/awesome-cve-poc) | List of CVE Proof of Concepts (PoCs)\n[CVE PoC updated daily](https://github.com/trickest/cve) | List of CVE Proof of Concepts (PoCs) updated daily by Trickest\n[CyberChef](https://gchq.github.io/CyberChef/) | A simple, intuitive web app for analysing and decoding data without having to deal with complex tools or programming languages.\n[Detection Lab](https://github.com/clong/DetectionLab)                              |  Vagrant & Packer scripts to build a lab environment complete with security tooling and logging best practices\n[Forensics](https://github.com/Cugu/awesome-forensics) \t\t\t\t\t\t\t\t| List of awesome forensic analysis tools and resources\n[Free Programming Books](https://github.com/EbookFoundation/free-programming-books) \t\t\t| Free programming books for developers\n[Gray Hacker Resources](https://github.com/bt3gl/Gray-Hacker-Resources) \t\t\t| Useful for CTFs, wargames, pentesting\n[GTFOBins](https://gtfobins.github.io)\t| A curated list of Unix binaries that can be exploited by an attacker to bypass local security restrictions\n[Hacker101](https://github.com/Hacker0x01/hacker101) | A free class for web security by HackerOne\n[Infosec Getting Started](https://github.com/gradiuscypher/infosec_getting_started)\t\t\t\t\t| A collection of resources, documentation, links, etc to help people learn about Infosec\n[Infosec Reference](https://github.com/rmusser01/Infosec_Reference) \t\t\t\t| Information Security Reference That Doesn't Suck\n[IOC](https://github.com/sroberts/awesome-iocs) \t\t\t\t\t\t\t\t\t| Collection of sources of indicators of compromise\n[Linux Kernel Exploitation](https://github.com/xairy/linux-kernel-exploitation) | A bunch of links related to Linux kernel fuzzing and exploitation\n[Lockpicking](https://github.com/meitar/awesome-lockpicking) | Resources relating to the security and compromise of locks, safes, and keys.\n[Machine Learning for Cyber Security](https://github.com/jivoi/awesome-ml-for-cybersecurity)   | Curated list of tools and resources related to the use of machine learning for cyber security\n[Payloads](https://github.com/foospidy/payloads)  | Collection of web attack payloads\n[PayloadsAllTheThings](https://github.com/swisskyrepo/PayloadsAllTheThings)   | List of useful payloads and bypass for Web Application Security and Pentest/CTF\n[Pentest Cheatsheets](https://github.com/coreb1t/awesome-pentest-cheat-sheets)\t\t| Collection of the cheat sheets useful for pentesting\n[Pentest Wiki](https://github.com/nixawk/pentest-wiki) \t\t\t\t\t\t\t\t| A free online security knowledge library for pentesters / researchers\n[Probable Wordlists](https://github.com/berzerk0/Probable-Wordlists)  | Wordlists sorted by probability originally created for password generation and testing\n[Resource List](https://github.com/FuzzySecurity/Resource-List) \t\t\t\t\t| Collection of useful GitHub projects loosely categorised\n[Reverse Engineering](https://github.com/onethawt/reverseengineering-reading-list)   | List of Reverse Engineering articles, books, and papers\n[RFSec-ToolKit](https://github.com/cn0xroot/RFSec-ToolKit)  | Collection of Radio Frequency Communication Protocol Hacktools\n[Security Cheatsheets](https://github.com/andrewjkerr/security-cheatsheets) \t\t| Collection of cheatsheets for various infosec tools and topics\n[Security List](https://github.com/zbetcheckin/Security_list)\t\t\t\t\t\t | Great security list for fun and profit\n[Shell](https://github.com/alebcay/awesome-shell) \t\t\t\t\t\t\t\t\t| List of awesome command-line frameworks, toolkits, guides and gizmos to make complete use of shell\n[ThreatHunter-Playbook](https://github.com/Cyb3rWard0g/ThreatHunter-Playbook) | A Threat hunter's playbook to aid the development of techniques and hypothesis for hunting campaigns\n[Web Security](https://github.com/qazbnm456/awesome-web-security) | Curated list of Web Security materials and resources\n[Vulhub](https://github.com/vulhub/vulhub) | Pre-Built Vulnerable Environments Based on Docker-Compose\n\n## Need More ?\n\nFollow **Hack with GitHub** on your favorite social media to get daily updates on interesting GitHub repositories related to Security.\n - Twitter : [@HackwithGithub](https://twitter.com/HackwithGithub)\n - Facebook : [HackwithGithub](https://www.facebook.com/HackwithGithub)\n\n## Contributions\n\nPlease have a look at [contributing.md](contributing.md)\n"
        },
        {
          "name": "awesome_hacking.jpg",
          "type": "blob",
          "size": 32.73,
          "content": null
        },
        {
          "name": "contributing.md",
          "type": "blob",
          "size": 1.09,
          "content": "# Contribution Guidelines\n\nPlease follow the instructions below to make a contribution.\n\nThis resource was made by the developers and hackers alike! We appreciate and recognize all [contributors](#contributors).\n\n## Table of Content\n\n- [Adding to the list](#adding-to-the-list)\n- [To remove from the list](#to-remove-from-the-list)\n- [Contributors](#contributors)\n\n## Adding to the List\n\n- Please add the content to the `README.md` file and make sure that the edited list is in alphabetical order.\n- Submit a pull request.\n\n## Removing from the List\n\n- If you have any issues accessing any of the resources listed here, please let us know.\n\n## Contributors\n\n- [Chandrapal](https://github.com/Chan9390)\n- [Madhu Akula](https://www.github.com/madhuakula)\n- [Derick Thomson](https://www.facebook.com/derick.thomson) (Image)\n- [Aleksandar Todorović](https://github.com/aleksandar-todorovic)\n- [Sobolev Nikita](https://github.com/sobolevn)\n- [Serhii Pronin](https://github.com/re-pronin)\n- [ReadmeCritic](https://github.com/ReadmeCritic)\n- [Yakup Ateş](https://github.com/y-ates)\n- [Alan Chang](https://github.com/tcode2k16)"
        }
      ]
    }
  ]
}