{
  "metadata": {
    "timestamp": 1736557759872,
    "page": 921,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjk0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ValdikSS/GoodbyeDPI",
      "stars": 26074,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.11,
          "content": "root = true\n\n[*]\ncharset = utf-8\nindent_style = space\nindent_size = 4\ninsert_final_newline = true\nend_of_line = lf\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.01,
          "content": "*.o\n*.exe\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.09,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.68,
          "content": "GoodbyeDPI — Deep Packet Inspection circumvention utility\n=========================\n\nThis software designed to bypass Deep Packet Inspection systems found in many Internet Service Providers which block access to certain websites.\n\nIt handles DPI connected using optical splitter or port mirroring (**Passive DPI**) which do not block any data but just replying faster than requested destination, and **Active DPI** connected in sequence.\n\n**Windows 7, 8, 8.1, 10 or 11** with administrator privileges required.\n\n# Quick start\n\n* **For Russia**: Download [latest version from Releases page](https://github.com/ValdikSS/GoodbyeDPI/releases), unpack the file and run **1_russia_blacklist_dnsredir.cmd** script.\n* For other countries: Download [latest version from Releases page](https://github.com/ValdikSS/GoodbyeDPI/releases), unpack the file and run **2_any_country_dnsredir.cmd**.\n\nThese scripts launch GoodbyeDPI in recommended mode with DNS resolver redirection to Yandex DNS on non-standard port (to prevent DNS poisoning).  \nIf it works — congratulations! You can use it as-is or configure further.\n\n# How to use\n\nDownload [latest version from Releases page](https://github.com/ValdikSS/GoodbyeDPI/releases) and run.\n\n## Supported arguments\nTo get relevant information about your version of the program, use the -h (--help) argument at startup.\n```\nUsage: goodbyedpi.exe [OPTION...]\n -p          block passive DPI\n -q          block QUIC/HTTP3\n -r          replace Host with hoSt\n -s          remove space between host header and its value\n -m          mix Host header case (test.com -> tEsT.cOm)\n -f <value>  set HTTP fragmentation to value\n -k <value>  enable HTTP persistent (keep-alive) fragmentation and set it to value\n -n          do not wait for first segment ACK when -k is enabled\n -e <value>  set HTTPS fragmentation to value\n -a          additional space between Method and Request-URI (enables -s, may break sites)\n -w          try to find and parse HTTP traffic on all processed ports (not only on port 80)\n --port        <value>    additional TCP port to perform fragmentation on (and HTTP tricks with -w)\n --ip-id       <value>    handle additional IP ID (decimal, drop redirects and TCP RSTs with this ID).\n                          This option can be supplied multiple times.\n --dns-addr    <value>    redirect UDP DNS requests to the supplied IP address (experimental)\n --dns-port    <value>    redirect UDP DNS requests to the supplied port (53 by default)\n --dnsv6-addr  <value>    redirect UDPv6 DNS requests to the supplied IPv6 address (experimental)\n --dnsv6-port  <value>    redirect UDPv6 DNS requests to the supplied port (53 by default)\n --dns-verb               print verbose DNS redirection messages\n --blacklist   <txtfile>  perform circumvention tricks only to host names and subdomains from\n                          supplied text file (HTTP Host/TLS SNI).\n                          This option can be supplied multiple times.\n --allow-no-sni           perform circumvention if TLS SNI can't be detected with --blacklist enabled.\n --frag-by-sni            if SNI is detected in TLS packet, fragment the packet right before SNI value.\n --set-ttl     <value>    activate Fake Request Mode and send it with supplied TTL value.\n                          DANGEROUS! May break websites in unexpected ways. Use with care (or --blacklist).\n --auto-ttl    [a1-a2-m]  activate Fake Request Mode, automatically detect TTL and decrease\n                          it based on a distance. If the distance is shorter than a2, TTL is decreased\n                          by a2. If it's longer, (a1; a2) scale is used with the distance as a weight.\n                          If the resulting TTL is more than m(ax), set it to m.\n                          Default (if set): --auto-ttl 1-4-10. Also sets --min-ttl 3.\n                          DANGEROUS! May break websites in unexpected ways. Use with care (or --blacklist).\n --min-ttl     <value>    minimum TTL distance (128/64 - TTL) for which to send Fake Request\n                          in --set-ttl and --auto-ttl modes.\n --wrong-chksum           activate Fake Request Mode and send it with incorrect TCP checksum.\n                          May not work in a VM or with some routers, but is safer than set-ttl.\n --wrong-seq              activate Fake Request Mode and send it with TCP SEQ/ACK in the past.\n --native-frag            fragment (split) the packets by sending them in smaller packets, without\n                          shrinking the Window Size. Works faster (does not slow down the connection)\n                          and better.\n --reverse-frag           fragment (split) the packets just as --native-frag, but send them in the\n                          reversed order. Works with the websites which could not handle segmented\n                          HTTPS TLS ClientHello (because they receive the TCP flow \"combined\").\n --fake-from-hex <value>  Load fake packets for Fake Request Mode from HEX values (like 1234abcDEF).\n                          This option can be supplied multiple times, in this case each fake packet\n                          would be sent on every request in the command line argument order.\n --fake-with-sni <value>  Generate fake packets for Fake Request Mode with given SNI domain name.\n                          The packets mimic Mozilla Firefox 130 TLS ClientHello packet\n                          (with random generated fake SessionID, key shares and ECH grease).\n                          Can be supplied multiple times for multiple fake packets.\n --fake-gen <value>       Generate random-filled fake packets for Fake Request Mode, value of them\n                          (up to 30).\n --fake-resend <value>    Send each fake packet value number of times.\n                          Default: 1 (send each packet once).\n --max-payload [value]    packets with TCP payload data more than [value] won't be processed.\n                          Use this option to reduce CPU usage by skipping huge amount of data\n                          (like file transfers) in already established sessions.\n                          May skip some huge HTTP requests from being processed.\n                          Default (if set): --max-payload 1200.\n\n\nLEGACY modesets:\n -1          -p -r -s -f 2 -k 2 -n -e 2 (most compatible mode)\n -2          -p -r -s -f 2 -k 2 -n -e 40 (better speed for HTTPS yet still compatible)\n -3          -p -r -s -e 40 (better speed for HTTP and HTTPS)\n -4          -p -r -s (best speed)\n\nModern modesets (more stable, more compatible, faster):\n -5          -f 2 -e 2 --auto-ttl --reverse-frag --max-payload\n -6          -f 2 -e 2 --wrong-seq --reverse-frag --max-payload\n -7          -f 2 -e 2 --wrong-chksum --reverse-frag --max-payload\n -8          -f 2 -e 2 --wrong-seq --wrong-chksum --reverse-frag --max-payload\n -9          -f 2 -e 2 --wrong-seq --wrong-chksum --reverse-frag --max-payload -q (this is the default)\n\n Note: combination of --wrong-seq and --wrong-chksum generates two different fake packets.\n```\n## How to check\nTo check if your ISP's DPI could be circumvented, first make sure that your provider does not poison DNS answers by enabling \"Secure DNS (DNS over HTTPS)\" option in your browser.\n\n* **Chrome**: Settings → [Privacy and security](chrome://settings/security) → Use secure DNS → With: NextDNS\n* **Firefox**: [Settings](about:preferences) → Network Settings → Enable DNS over HTTPS → Use provider: NextDNS\n\nThen run the `goodbyedpi.exe` executable without any options. If it works — congratulations! You can use it as-is or configure further, for example by using `--blacklist` option if the list of blocked websites is known and available for your country.\n\nIf your provider intercepts DNS requests, you may want to use `--dns-addr` option to a public DNS resolver running on non-standard port (such as Yandex DNS `77.88.8.8:1253`) or configure DNS over HTTPS/TLS using third-party applications.\n\nCheck the .cmd scripts and modify it according to your preference and network conditions.\n\n# How does it work\n\n### Passive DPI\n\nMost Passive DPI send HTTP 302 Redirect if you try to access blocked website over HTTP and TCP Reset in case of HTTPS, faster than destination website. Packets sent by DPI usually have IP Identification field equal to `0x0000` or `0x0001`, as seen with Russian providers. These packets, if they redirect you to another website (censorship page), are blocked by GoodbyeDPI.\n\n### Active DPI\n\nActive DPI is more tricky to fool. Currently the software uses 7 methods to circumvent Active DPI:\n\n* TCP-level fragmentation for first data packet\n* TCP-level fragmentation for persistent (keep-alive) HTTP sessions\n* Replacing `Host` header with `hoSt`\n* Removing space between header name and value in `Host` header\n* Adding additional space between HTTP Method (GET, POST etc) and URI\n* Mixing case of Host header value\n* Sending fake HTTP/HTTPS packets with low Time-To-Live value, incorrect checksum or incorrect TCP Sequence/Acknowledgement numbers to fool DPI and prevent delivering them to the destination\n\nThese methods should not break any website as they're fully compatible with TCP and HTTP standards, yet it's sufficient to prevent DPI data classification and to circumvent censorship. Additional space may break some websites, although it's acceptable by HTTP/1.1 specification (see 19.3 Tolerant Applications).\n\nThe program loads WinDivert driver which uses Windows Filtering Platform to set filters and redirect packets to the userspace. It's running as long as console window is visible and terminates when you close the window.\n\n# How to build from source\n\nThis project can be build using **GNU Make** and [**mingw**](https://mingw-w64.org). The only dependency is [WinDivert](https://github.com/basil00/Divert).\n\nTo build x86 exe run:\n\n`make CPREFIX=i686-w64-mingw32- WINDIVERTHEADERS=/path/to/windivert/include WINDIVERTLIBS=/path/to/windivert/x86`\n\nAnd for x86_64:\n\n`make CPREFIX=x86_64-w64-mingw32- BIT64=1 WINDIVERTHEADERS=/path/to/windivert/include WINDIVERTLIBS=/path/to/windivert/amd64`\n\n# How to install as Windows Service\n\nCheck examples in `service_install_russia_blacklist.cmd`, `service_install_russia_blacklist_dnsredir.cmd` and `service_remove.cmd` scripts.\n\nModify them according to your own needs.\n\n# Known issues\n\n* Horribly outdated Windows 7 installations are not able to load WinDivert driver due to missing support for SHA256 digital signatures. Install KB3033929 [x86](https://www.microsoft.com/en-us/download/details.aspx?id=46078)/[x64](https://www.microsoft.com/en-us/download/details.aspx?id=46148), or better, update the whole system using Windows Update.\n* Intel/Qualcomm Killer network cards: `Advanced Stream Detect` in Killer Control Center is incompatible with GoodbyeDPI, [disable it](https://github.com/ValdikSS/GoodbyeDPI/issues/541#issuecomment-2296038239).\n* QUIK trading software [may interfere with GoodbyeDPI](https://github.com/ValdikSS/GoodbyeDPI/issues/677#issuecomment-2390595606). First start QUIK, then GoodbyeDPI.\n* ~~Some SSL/TLS stacks unable to process fragmented ClientHello packets, and HTTPS websites won't open. Bug: [#4](https://github.com/ValdikSS/GoodbyeDPI/issues/4), [#64](https://github.com/ValdikSS/GoodbyeDPI/issues/64).~~ Fragmentation issues are fixed in v0.1.7.\n* ~~ESET Antivirus is incompatible with WinDivert driver [#91](https://github.com/ValdikSS/GoodbyeDPI/issues/91). This is most probably antivirus bug, not WinDivert.~~\n\n\n# Similar projects\n\n- **[zapret](https://github.com/bol-van/zapret)** by @bol-van (for MacOS, Linux and Windows)\n- **[Green Tunnel](https://github.com/SadeghHayeri/GreenTunnel)** by @SadeghHayeri (for MacOS, Linux and Windows)\n- **[DPI Tunnel CLI](https://github.com/nomoresat/DPITunnel-cli)** by @zhenyolka (for Linux and routers)\n- **[DPI Tunnel for Android](https://github.com/nomoresat/DPITunnel-android)** by @zhenyolka (for Android)\n- **[PowerTunnel](https://github.com/krlvm/PowerTunnel)** by @krlvm (for Windows, MacOS and Linux)\n- **[PowerTunnel for Android](https://github.com/krlvm/PowerTunnel-Android)** by @krlvm (for Android)\n- **[SpoofDPI](https://github.com/xvzc/SpoofDPI)** by @xvzc (for macOS and Linux)\n- **[SpoofDPI-Platform](https://github.com/r3pr3ss10n/SpoofDPI-Platform)** by @r3pr3ss10n (for Android, macOS, Windows)\n- **[GhosTCP](https://github.com/macronut/ghostcp)** by @macronut (for Windows)\n- **[ByeDPI](https://github.com/hufrea/byedpi)** for Linux/Windows + **[ByeDPIAndroid](https://github.com/dovecoteescapee/ByeDPIAndroid/)** for Android (no root)\n- **[youtubeUnblock](https://github.com/Waujito/youtubeUnblock/)** by @Waujito (for OpenWRT/Entware routers and Linux)\n\n# Kudos\n\nThanks @basil00 for [WinDivert](https://github.com/basil00/Divert). That's the main part of this program.\n\nThanks for every [BlockCheck](https://github.com/ValdikSS/blockcheck) contributor. It would be impossible to understand DPI behaviour without this utility.\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}