{
  "metadata": {
    "timestamp": 1736710104099,
    "page": 726,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjczMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "SoftEtherVPN/SoftEtherVPN_Stable",
      "stars": 1870,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "AUTHORS.TXT",
          "type": "blob",
          "size": 0.080078125,
          "content": "Please see: https://github.com/SoftEtherVPN/SoftEtherVPN/blob/master/AUTHORS.TXT\r\n"
        },
        {
          "name": "BUILD_UNIX.TXT",
          "type": "blob",
          "size": 3.591796875,
          "content": "How to build SoftEther VPN for UNIX\r\n===================================\r\n\r\n\r\nRequirements\r\n------------\r\n\r\nYou need to install the following software to build SoftEther VPN for UNIX.\r\n\r\n- Linux, FreeBSD, Solaris or Mac OS X.\r\n- GNU Compiler Collectipon (gcc) and binary utilities.\r\n- GNU Make (gmake).\r\n- GNU C Library (glibc).\r\n- POSIX Threads (pthread).\r\n- OpenSSL (crypto, ssl).\r\n- libiconv.\r\n- readline.\r\n- ncurses.\r\n\r\nFor example, the following commands help you to install the above programs\r\non Fedora or CentOS Linux:\r\n\r\n$ yum -y groupinstall \"Development Tools\"\r\n$ yum -y install readline-devel ncurses-devel openssl-devel\r\n\r\n\r\nHow to Build\r\n------------\r\n\r\nTo build the programs from the source code, run the following commands:\r\n\r\n$ ./configure\r\n$ make\r\n\r\nIf any error occurs, please check the above requirements.\r\n\r\n\r\nHow to Install SoftEther VPN Server, Bridge or Client\r\n-----------------------------------------------------\r\n\r\nTo install the vpnserver, vpnbridge and vpnclient programs into the\r\n/usr/bin directory, run the following as the root user:\r\n\r\n# make install\r\n\r\nAfter the installation will complete successfully:\r\n\r\n- Execute 'vpnserver start' to run the SoftEther VPN Server background service.\r\n- Execute 'vpnbridge start' to run the SoftEther VPN Bridge background service.\r\n- Execute 'vpnclient start' to run the SoftEther VPN Client background service.\r\n- Execute 'vpncmd' to run SoftEther VPN Command-Line Utility to configure\r\n  VPN Server, VPN Bridge or VPN Client.\r\n\r\n- You can also use VPN Server/Client Manager GUI Tool on other Windows PC to\r\n  connect to VPN services remotely.\r\n  You can download the GUI Tools from https://www.softether-download.com/.\r\n\r\n\r\nHow to Run SoftEther VPN Server for Test\r\n----------------------------------------\r\n\r\nTo start the SoftEther VPN Server background service, run the following:\r\n\r\n$ bin/vpnserver/vpnserver start\r\n\r\nTo stop the service, run the following:\r\n\r\n$ bin/vpnserver/vpnserver stop\r\n\r\nTo configure the running SoftEther VPN Server service,\r\nyou can use SoftEther VPN Command Line Management Utility as following:\r\n\r\n$ bin/vpncmd/vpncmd\r\n\r\nOr you can also use VPN Server Manager GUI Tool on other Windows PC to\r\nconnect to the VPN Server remotely. You can download the GUI Tool\r\nfrom https://www.softether-download.com/.\r\n\r\n\r\nHow to Run SoftEther VPN Bridge for Test\r\n----------------------------------------\r\n\r\nTo start the SoftEther VPN Bridge background service, run the following:\r\n\r\n$ bin/vpnbridge/vpnbridge start\r\n\r\nTo stop the service, run the following:\r\n\r\n$ bin/vpnbridge/vpnbridge stop\r\n\r\nTo configure the running SoftEther VPN Bridge service,\r\nyou can use SoftEther VPN Command Line Management Utility as following:\r\n\r\n$ bin/vpncmd/vpncmd\r\n\r\nOr you can also use VPN Server Manager GUI Tool on other Windows PC to\r\nconnect to the VPN Bridge remotely. You can download the GUI Tool\r\nfrom https://www.softether-download.com/.\r\n\r\n\r\nHow to Run SoftEther VPN Client for Test\r\n----------------------------------------\r\n\r\nTo start the SoftEther VPN Client background service, run the following:\r\n\r\n$ bin/vpnclient/vpnclient start\r\n\r\nTo stop the service, run the following:\r\n\r\n$ bin/vpnclient/vpnclient stop\r\n\r\nTo configure the running SoftEther VPN Client service,\r\nyou can use SoftEther VPN Command Line Management Utility as following:\r\n\r\n$ bin/vpncmd/vpncmd\r\n\r\nOr you can also use VPN Client Manager GUI Tool on other Windows PC to\r\nconnect to the VPN Client remotely. You can download the GUI Tool\r\nfrom https://www.softether-download.com/.\r\n\r\n\r\n************************************\r\nThank You Using SoftEther VPN !\r\nBy SoftEther VPN Open-Source Project\r\nhttps://www.softether.org/\r\n"
        },
        {
          "name": "BUILD_WINDOWS.TXT",
          "type": "blob",
          "size": 1.4931640625,
          "content": "How to build SoftEther VPN for Windows\r\n======================================\r\n\r\n\r\nRequirements\r\n------------\r\n\r\nYou need to install the following software to build SoftEther VPN for Windows.\r\n\r\n- Microsoft Windows XP, Vista, 7, 8 or later.\r\n- Microsoft Visual Studio 2008 with the latest SP (SP1 9.0.30729.4462 QFE).\r\n  Make sure that you installed the x64 compiler and build tools.\r\n\r\n* Note:\r\n  Visual Studio 2008 SP1 is required to build SoftEther VPN on Windows.\r\n  Please make sure that VS2008 'SP1' is installed.\r\n  Visual Studio 2010, 2012 or 2013 is currently not supported.\r\n  Visual Studio 2008 Express Edition is not supported.\r\n  Standard Edition, Professional Edition, Team System or Team Suite is\r\n  required.\r\n\r\n\r\nFull Build Instructions\r\n-----------------------\r\n\r\nThe following steps will build all SoftEther VPN program files, and also build\r\nthe installer packages of SoftEther VPN. It is very easy.\r\n\r\n1. Run the \"BuildAll.cmd\" batch file in the \"src\" directory.\r\n2. Wait until the building process will complete.\r\n3. The built files are stored on the \"output\" directory.\r\n\r\n\r\nPartly Build, Debug or Development Instructions on Visual Studio 2008\r\n---------------------------------------------------------------------\r\n\r\nIf you are a programmer, you can open the SoftEther VPN solution file\r\nwith Visual Studio 2008 to customize. Open \"src\\SEVPN.sln\" and enjoy it.\r\n\r\n\r\n************************************\r\nThank You Using SoftEther VPN !\r\nBy SoftEther VPN Open-Source Project\r\nhttps://www.softether.org/\r\n"
        },
        {
          "name": "ChangeLog",
          "type": "blob",
          "size": 0.2275390625,
          "content": "ChangeLog of SoftEther VPN\r\n--------------------------\r\n\r\nThe ChangeLog of SoftEther VPN is on our web site:\r\nhttps://www.softether.org/5-download/history\r\n\r\n(In Japanese: https://ja.softether.org/5-download/history)\r\n\r\nEnjoy it!\r\n\r\n"
        },
        {
          "name": "ChangeLog.txt",
          "type": "blob",
          "size": 0.2275390625,
          "content": "ChangeLog of SoftEther VPN\r\n--------------------------\r\n\r\nThe ChangeLog of SoftEther VPN is on our web site:\r\nhttps://www.softether.org/5-download/history\r\n\r\n(In Japanese: https://ja.softether.org/5-download/history)\r\n\r\nEnjoy it!\r\n\r\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 13.685546875,
          "content": "                                 Apache License\r\n                           Version 2.0, January 2004\r\n                        http://www.apache.org/licenses/\r\n\r\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\r\n\r\n   1. Definitions.\r\n\r\n      \"License\" shall mean the terms and conditions for use, reproduction,\r\n      and distribution as defined by Sections 1 through 9 of this document.\r\n\r\n      \"Licensor\" shall mean the copyright owner or entity authorized by\r\n      the copyright owner that is granting the License.\r\n\r\n      \"Legal Entity\" shall mean the union of the acting entity and all\r\n      other entities that control, are controlled by, or are under common\r\n      control with that entity. For the purposes of this definition,\r\n      \"control\" means (i) the power, direct or indirect, to cause the\r\n      direction or management of such entity, whether by contract or\r\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\r\n      outstanding shares, or (iii) beneficial ownership of such entity.\r\n\r\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\r\n      exercising permissions granted by this License.\r\n\r\n      \"Source\" form shall mean the preferred form for making modifications,\r\n      including but not limited to software source code, documentation\r\n      source, and configuration files.\r\n\r\n      \"Object\" form shall mean any form resulting from mechanical\r\n      transformation or translation of a Source form, including but\r\n      not limited to compiled object code, generated documentation,\r\n      and conversions to other media types.\r\n\r\n      \"Work\" shall mean the work of authorship, whether in Source or\r\n      Object form, made available under the License, as indicated by a\r\n      copyright notice that is included in or attached to the work\r\n      (an example is provided in the Appendix below).\r\n\r\n      \"Derivative Works\" shall mean any work, whether in Source or Object\r\n      form, that is based on (or derived from) the Work and for which the\r\n      editorial revisions, annotations, elaborations, or other modifications\r\n      represent, as a whole, an original work of authorship. For the purposes\r\n      of this License, Derivative Works shall not include works that remain\r\n      separable from, or merely link (or bind by name) to the interfaces of,\r\n      the Work and Derivative Works thereof.\r\n\r\n      \"Contribution\" shall mean any work of authorship, including\r\n      the original version of the Work and any modifications or additions\r\n      to that Work or Derivative Works thereof, that is intentionally\r\n      submitted to Licensor for inclusion in the Work by the copyright owner\r\n      or by an individual or Legal Entity authorized to submit on behalf of\r\n      the copyright owner. For the purposes of this definition, \"submitted\"\r\n      means any form of electronic, verbal, or written communication sent\r\n      to the Licensor or its representatives, including but not limited to\r\n      communication on electronic mailing lists, source code control systems,\r\n      and issue tracking systems that are managed by, or on behalf of, the\r\n      Licensor for the purpose of discussing and improving the Work, but\r\n      excluding communication that is conspicuously marked or otherwise\r\n      designated in writing by the copyright owner as \"Not a Contribution.\"\r\n\r\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\r\n      on behalf of whom a Contribution has been received by Licensor and\r\n      subsequently incorporated within the Work.\r\n\r\n   2. Grant of Copyright License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      copyright license to reproduce, prepare Derivative Works of,\r\n      publicly display, publicly perform, sublicense, and distribute the\r\n      Work and such Derivative Works in Source or Object form.\r\n\r\n   3. Grant of Patent License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      (except as stated in this section) patent license to make, have made,\r\n      use, offer to sell, sell, import, and otherwise transfer the Work,\r\n      where such license applies only to those patent claims licensable\r\n      by such Contributor that are necessarily infringed by their\r\n      Contribution(s) alone or by combination of their Contribution(s)\r\n      with the Work to which such Contribution(s) was submitted. If You\r\n      institute patent litigation against any entity (including a\r\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\r\n      or a Contribution incorporated within the Work constitutes direct\r\n      or contributory patent infringement, then any patent licenses\r\n      granted to You under this License for that Work shall terminate\r\n      as of the date such litigation is filed.\r\n\r\n   4. Redistribution. You may reproduce and distribute copies of the\r\n      Work or Derivative Works thereof in any medium, with or without\r\n      modifications, and in Source or Object form, provided that You\r\n      meet the following conditions:\r\n\r\n      (a) You must give any other recipients of the Work or\r\n          Derivative Works a copy of this License; and\r\n\r\n      (b) You must cause any modified files to carry prominent notices\r\n          stating that You changed the files; and\r\n\r\n      (c) You must retain, in the Source form of any Derivative Works\r\n          that You distribute, all copyright, patent, trademark, and\r\n          attribution notices from the Source form of the Work,\r\n          excluding those notices that do not pertain to any part of\r\n          the Derivative Works; and\r\n\r\n      (d) If the Work includes a \"NOTICE\" text file as part of its\r\n          distribution, then any Derivative Works that You distribute must\r\n          include a readable copy of the attribution notices contained\r\n          within such NOTICE file, excluding those notices that do not\r\n          pertain to any part of the Derivative Works, in at least one\r\n          of the following places: within a NOTICE text file distributed\r\n          as part of the Derivative Works; within the Source form or\r\n          documentation, if provided along with the Derivative Works; or,\r\n          within a display generated by the Derivative Works, if and\r\n          wherever such third-party notices normally appear. The contents\r\n          of the NOTICE file are for informational purposes only and\r\n          do not modify the License. You may add Your own attribution\r\n          notices within Derivative Works that You distribute, alongside\r\n          or as an addendum to the NOTICE text from the Work, provided\r\n          that such additional attribution notices cannot be construed\r\n          as modifying the License.\r\n\r\n      You may add Your own copyright statement to Your modifications and\r\n      may provide additional or different license terms and conditions\r\n      for use, reproduction, or distribution of Your modifications, or\r\n      for any such Derivative Works as a whole, provided Your use,\r\n      reproduction, and distribution of the Work otherwise complies with\r\n      the conditions stated in this License.\r\n\r\n   5. Submission of Contributions. Unless You explicitly state otherwise,\r\n      any Contribution intentionally submitted for inclusion in the Work\r\n      by You to the Licensor shall be under the terms and conditions of\r\n      this License, without any additional terms or conditions.\r\n      Notwithstanding the above, nothing herein shall supersede or modify\r\n      the terms of any separate license agreement you may have executed\r\n      with Licensor regarding such Contributions.\r\n\r\n   6. Trademarks. This License does not grant permission to use the trade\r\n      names, trademarks, service marks, or product names of the Licensor,\r\n      except as required for reasonable and customary use in describing the\r\n      origin of the Work and reproducing the content of the NOTICE file.\r\n\r\n   7. Disclaimer of Warranty. Unless required by applicable law or\r\n      agreed to in writing, Licensor provides the Work (and each\r\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\r\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\r\n      implied, including, without limitation, any warranties or conditions\r\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\r\n      PARTICULAR PURPOSE. You are solely responsible for determining the\r\n      appropriateness of using or redistributing the Work and assume any\r\n      risks associated with Your exercise of permissions under this License.\r\n\r\n   8. Limitation of Liability. In no event and under no legal theory,\r\n      whether in tort (including negligence), contract, or otherwise,\r\n      unless required by applicable law (such as deliberate and grossly\r\n      negligent acts) or agreed to in writing, shall any Contributor be\r\n      liable to You for damages, including any direct, indirect, special,\r\n      incidental, or consequential damages of any character arising as a\r\n      result of this License or out of the use or inability to use the\r\n      Work (including but not limited to damages for loss of goodwill,\r\n      work stoppage, computer failure or malfunction, or any and all\r\n      other commercial damages or losses), even if such Contributor\r\n      has been advised of the possibility of such damages.\r\n\r\n   9. Accepting Warranty or Additional Liability. While redistributing\r\n      the Work or Derivative Works thereof, You may choose to offer,\r\n      and charge a fee for, acceptance of support, warranty, indemnity,\r\n      or other liability obligations and/or rights consistent with this\r\n      License. However, in accepting such obligations, You may act only\r\n      on Your own behalf and on Your sole responsibility, not on behalf\r\n      of any other Contributor, and only if You agree to indemnify,\r\n      defend, and hold each Contributor harmless for any liability\r\n      incurred by, or claims asserted against, such Contributor by reason\r\n      of your accepting any such warranty or additional liability.\r\n\r\n   END OF TERMS AND CONDITIONS\r\n\r\n\r\n   Copyright (c) all contributors on SoftEther VPN project in GitHub.\r\n   Copyright (c) Daiyuu Nobori, SoftEther Project at University of Tsukuba,\r\nand SoftEther Corporation.\r\n\r\n   Licensed under the Apache License, Version 2.0 (the \"License\");\r\n   you may not use this file except in compliance with the License.\r\n   You may obtain a copy of the License at\r\n\r\n       http://www.apache.org/licenses/LICENSE-2.0\r\n\r\n   Unless required by applicable law or agreed to in writing, software\r\n   distributed under the License is distributed on an \"AS IS\" BASIS,\r\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\r\n   See the License for the specific language governing permissions and\r\n   limitations under the License.\r\n\r\n\r\n\r\nDISCLAIMER\r\n==========\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\nSOFTWARE.\r\n\r\nTHIS SOFTWARE IS DEVELOPED IN JAPAN, AND DISTRIBUTED FROM JAPAN, UNDER\r\nJAPANESE LAWS. YOU MUST AGREE IN ADVANCE TO USE, COPY, MODIFY, MERGE, PUBLISH,\r\nDISTRIBUTE, SUBLICENSE, AND/OR SELL COPIES OF THIS SOFTWARE, THAT ANY\r\nJURIDICAL DISPUTES WHICH ARE CONCERNED TO THIS SOFTWARE OR ITS CONTENTS,\r\nAGAINST US (SOFTETHER PROJECT, SOFTETHER CORPORATION, DAIYUU NOBORI OR OTHER\r\nSUPPLIERS), OR ANY JURIDICAL DISPUTES AGAINST US WHICH ARE CAUSED BY ANY KIND\r\nOF USING, COPYING, MODIFYING, MERGING, PUBLISHING, DISTRIBUTING, SUBLICENSING,\r\nAND/OR SELLING COPIES OF THIS SOFTWARE SHALL BE REGARDED AS BE CONSTRUED AND\r\nCONTROLLED BY JAPANESE LAWS, AND YOU MUST FURTHER CONSENT TO EXCLUSIVE\r\nJURISDICTION AND VENUE IN THE COURTS SITTING IN TOKYO, JAPAN. YOU MUST WAIVE\r\nALL DEFENSES OF LACK OF PERSONAL JURISDICTION AND FORUM NON CONVENIENS.\r\nPROCESS MAY BE SERVED ON EITHER PARTY IN THE MANNER AUTHORIZED BY APPLICABLE\r\nLAW OR COURT RULE.\r\n\r\nUSE ONLY IN JAPAN. DO NOT USE THIS SOFTWARE IN ANOTHER COUNTRY UNLESS YOU HAVE\r\nA CONFIRMATION THAT THIS SOFTWARE DOES NOT VIOLATE ANY CRIMINAL LAWS OR CIVIL\r\nRIGHTS IN THAT PARTICULAR COUNTRY. USING THIS SOFTWARE IN OTHER COUNTRIES IS\r\nCOMPLETELY AT YOUR OWN RISK. THE SOFTETHER VPN PROJECT HAS DEVELOPED AND\r\nDISTRIBUTED THIS SOFTWARE TO COMPLY ONLY WITH THE JAPANESE LAWS AND EXISTING\r\nCIVIL RIGHTS INCLUDING PATENTS WHICH ARE SUBJECTS APPLY IN JAPAN. OTHER\r\nCOUNTRIES' LAWS OR CIVIL RIGHTS ARE NONE OF OUR CONCERNS NOR RESPONSIBILITIES.\r\nWE HAVE NEVER INVESTIGATED ANY CRIMINAL REGULATIONS, CIVIL LAWS OR\r\nINTELLECTUAL PROPERTY RIGHTS INCLUDING PATENTS IN ANY OF OTHER 200+ COUNTRIES\r\nAND TERRITORIES. BY NATURE, THERE ARE 200+ REGIONS IN THE WORLD, WITH\r\nDIFFERENT LAWS. IT IS IMPOSSIBLE TO VERIFY EVERY COUNTRIES' LAWS, REGULATIONS\r\nAND CIVIL RIGHTS TO MAKE THE SOFTWARE COMPLY WITH ALL COUNTRIES' LAWS BY THE\r\nPROJECT. EVEN IF YOU WILL BE SUED BY A PRIVATE ENTITY OR BE DAMAGED BY A\r\nPUBLIC SERVANT IN YOUR COUNTRY, THE DEVELOPERS OF THIS SOFTWARE WILL NEVER BE\r\nLIABLE TO RECOVER OR COMPENSATE SUCH DAMAGES, CRIMINAL OR CIVIL\r\nRESPONSIBILITIES. NOTE THAT THIS LINE IS NOT LICENSE RESTRICTION BUT JUST A\r\nSTATEMENT FOR WARNING AND DISCLAIMER.\r\n\r\nREAD AND UNDERSTAND THE 'src/WARNING.TXT' FILE BEFORE USING THIS SOFTWARE.\r\nSOME SOFTWARE PROGRAMS FROM THIRD PARTIES ARE INCLUDED ON THIS SOFTWARE WITH\r\nLICENSE CONDITIONS WHICH ARE DESCRIBED ON THE 'src/THIRD_PARTY.TXT' FILE.\r\n\r\n"
        },
        {
          "name": "LICENSE.TXT",
          "type": "blob",
          "size": 13.685546875,
          "content": "                                 Apache License\r\n                           Version 2.0, January 2004\r\n                        http://www.apache.org/licenses/\r\n\r\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\r\n\r\n   1. Definitions.\r\n\r\n      \"License\" shall mean the terms and conditions for use, reproduction,\r\n      and distribution as defined by Sections 1 through 9 of this document.\r\n\r\n      \"Licensor\" shall mean the copyright owner or entity authorized by\r\n      the copyright owner that is granting the License.\r\n\r\n      \"Legal Entity\" shall mean the union of the acting entity and all\r\n      other entities that control, are controlled by, or are under common\r\n      control with that entity. For the purposes of this definition,\r\n      \"control\" means (i) the power, direct or indirect, to cause the\r\n      direction or management of such entity, whether by contract or\r\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\r\n      outstanding shares, or (iii) beneficial ownership of such entity.\r\n\r\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\r\n      exercising permissions granted by this License.\r\n\r\n      \"Source\" form shall mean the preferred form for making modifications,\r\n      including but not limited to software source code, documentation\r\n      source, and configuration files.\r\n\r\n      \"Object\" form shall mean any form resulting from mechanical\r\n      transformation or translation of a Source form, including but\r\n      not limited to compiled object code, generated documentation,\r\n      and conversions to other media types.\r\n\r\n      \"Work\" shall mean the work of authorship, whether in Source or\r\n      Object form, made available under the License, as indicated by a\r\n      copyright notice that is included in or attached to the work\r\n      (an example is provided in the Appendix below).\r\n\r\n      \"Derivative Works\" shall mean any work, whether in Source or Object\r\n      form, that is based on (or derived from) the Work and for which the\r\n      editorial revisions, annotations, elaborations, or other modifications\r\n      represent, as a whole, an original work of authorship. For the purposes\r\n      of this License, Derivative Works shall not include works that remain\r\n      separable from, or merely link (or bind by name) to the interfaces of,\r\n      the Work and Derivative Works thereof.\r\n\r\n      \"Contribution\" shall mean any work of authorship, including\r\n      the original version of the Work and any modifications or additions\r\n      to that Work or Derivative Works thereof, that is intentionally\r\n      submitted to Licensor for inclusion in the Work by the copyright owner\r\n      or by an individual or Legal Entity authorized to submit on behalf of\r\n      the copyright owner. For the purposes of this definition, \"submitted\"\r\n      means any form of electronic, verbal, or written communication sent\r\n      to the Licensor or its representatives, including but not limited to\r\n      communication on electronic mailing lists, source code control systems,\r\n      and issue tracking systems that are managed by, or on behalf of, the\r\n      Licensor for the purpose of discussing and improving the Work, but\r\n      excluding communication that is conspicuously marked or otherwise\r\n      designated in writing by the copyright owner as \"Not a Contribution.\"\r\n\r\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\r\n      on behalf of whom a Contribution has been received by Licensor and\r\n      subsequently incorporated within the Work.\r\n\r\n   2. Grant of Copyright License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      copyright license to reproduce, prepare Derivative Works of,\r\n      publicly display, publicly perform, sublicense, and distribute the\r\n      Work and such Derivative Works in Source or Object form.\r\n\r\n   3. Grant of Patent License. Subject to the terms and conditions of\r\n      this License, each Contributor hereby grants to You a perpetual,\r\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\r\n      (except as stated in this section) patent license to make, have made,\r\n      use, offer to sell, sell, import, and otherwise transfer the Work,\r\n      where such license applies only to those patent claims licensable\r\n      by such Contributor that are necessarily infringed by their\r\n      Contribution(s) alone or by combination of their Contribution(s)\r\n      with the Work to which such Contribution(s) was submitted. If You\r\n      institute patent litigation against any entity (including a\r\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\r\n      or a Contribution incorporated within the Work constitutes direct\r\n      or contributory patent infringement, then any patent licenses\r\n      granted to You under this License for that Work shall terminate\r\n      as of the date such litigation is filed.\r\n\r\n   4. Redistribution. You may reproduce and distribute copies of the\r\n      Work or Derivative Works thereof in any medium, with or without\r\n      modifications, and in Source or Object form, provided that You\r\n      meet the following conditions:\r\n\r\n      (a) You must give any other recipients of the Work or\r\n          Derivative Works a copy of this License; and\r\n\r\n      (b) You must cause any modified files to carry prominent notices\r\n          stating that You changed the files; and\r\n\r\n      (c) You must retain, in the Source form of any Derivative Works\r\n          that You distribute, all copyright, patent, trademark, and\r\n          attribution notices from the Source form of the Work,\r\n          excluding those notices that do not pertain to any part of\r\n          the Derivative Works; and\r\n\r\n      (d) If the Work includes a \"NOTICE\" text file as part of its\r\n          distribution, then any Derivative Works that You distribute must\r\n          include a readable copy of the attribution notices contained\r\n          within such NOTICE file, excluding those notices that do not\r\n          pertain to any part of the Derivative Works, in at least one\r\n          of the following places: within a NOTICE text file distributed\r\n          as part of the Derivative Works; within the Source form or\r\n          documentation, if provided along with the Derivative Works; or,\r\n          within a display generated by the Derivative Works, if and\r\n          wherever such third-party notices normally appear. The contents\r\n          of the NOTICE file are for informational purposes only and\r\n          do not modify the License. You may add Your own attribution\r\n          notices within Derivative Works that You distribute, alongside\r\n          or as an addendum to the NOTICE text from the Work, provided\r\n          that such additional attribution notices cannot be construed\r\n          as modifying the License.\r\n\r\n      You may add Your own copyright statement to Your modifications and\r\n      may provide additional or different license terms and conditions\r\n      for use, reproduction, or distribution of Your modifications, or\r\n      for any such Derivative Works as a whole, provided Your use,\r\n      reproduction, and distribution of the Work otherwise complies with\r\n      the conditions stated in this License.\r\n\r\n   5. Submission of Contributions. Unless You explicitly state otherwise,\r\n      any Contribution intentionally submitted for inclusion in the Work\r\n      by You to the Licensor shall be under the terms and conditions of\r\n      this License, without any additional terms or conditions.\r\n      Notwithstanding the above, nothing herein shall supersede or modify\r\n      the terms of any separate license agreement you may have executed\r\n      with Licensor regarding such Contributions.\r\n\r\n   6. Trademarks. This License does not grant permission to use the trade\r\n      names, trademarks, service marks, or product names of the Licensor,\r\n      except as required for reasonable and customary use in describing the\r\n      origin of the Work and reproducing the content of the NOTICE file.\r\n\r\n   7. Disclaimer of Warranty. Unless required by applicable law or\r\n      agreed to in writing, Licensor provides the Work (and each\r\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\r\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\r\n      implied, including, without limitation, any warranties or conditions\r\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\r\n      PARTICULAR PURPOSE. You are solely responsible for determining the\r\n      appropriateness of using or redistributing the Work and assume any\r\n      risks associated with Your exercise of permissions under this License.\r\n\r\n   8. Limitation of Liability. In no event and under no legal theory,\r\n      whether in tort (including negligence), contract, or otherwise,\r\n      unless required by applicable law (such as deliberate and grossly\r\n      negligent acts) or agreed to in writing, shall any Contributor be\r\n      liable to You for damages, including any direct, indirect, special,\r\n      incidental, or consequential damages of any character arising as a\r\n      result of this License or out of the use or inability to use the\r\n      Work (including but not limited to damages for loss of goodwill,\r\n      work stoppage, computer failure or malfunction, or any and all\r\n      other commercial damages or losses), even if such Contributor\r\n      has been advised of the possibility of such damages.\r\n\r\n   9. Accepting Warranty or Additional Liability. While redistributing\r\n      the Work or Derivative Works thereof, You may choose to offer,\r\n      and charge a fee for, acceptance of support, warranty, indemnity,\r\n      or other liability obligations and/or rights consistent with this\r\n      License. However, in accepting such obligations, You may act only\r\n      on Your own behalf and on Your sole responsibility, not on behalf\r\n      of any other Contributor, and only if You agree to indemnify,\r\n      defend, and hold each Contributor harmless for any liability\r\n      incurred by, or claims asserted against, such Contributor by reason\r\n      of your accepting any such warranty or additional liability.\r\n\r\n   END OF TERMS AND CONDITIONS\r\n\r\n\r\n   Copyright (c) all contributors on SoftEther VPN project in GitHub.\r\n   Copyright (c) Daiyuu Nobori, SoftEther Project at University of Tsukuba,\r\nand SoftEther Corporation.\r\n\r\n   Licensed under the Apache License, Version 2.0 (the \"License\");\r\n   you may not use this file except in compliance with the License.\r\n   You may obtain a copy of the License at\r\n\r\n       http://www.apache.org/licenses/LICENSE-2.0\r\n\r\n   Unless required by applicable law or agreed to in writing, software\r\n   distributed under the License is distributed on an \"AS IS\" BASIS,\r\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\r\n   See the License for the specific language governing permissions and\r\n   limitations under the License.\r\n\r\n\r\n\r\nDISCLAIMER\r\n==========\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\r\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\r\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\r\nSOFTWARE.\r\n\r\nTHIS SOFTWARE IS DEVELOPED IN JAPAN, AND DISTRIBUTED FROM JAPAN, UNDER\r\nJAPANESE LAWS. YOU MUST AGREE IN ADVANCE TO USE, COPY, MODIFY, MERGE, PUBLISH,\r\nDISTRIBUTE, SUBLICENSE, AND/OR SELL COPIES OF THIS SOFTWARE, THAT ANY\r\nJURIDICAL DISPUTES WHICH ARE CONCERNED TO THIS SOFTWARE OR ITS CONTENTS,\r\nAGAINST US (SOFTETHER PROJECT, SOFTETHER CORPORATION, DAIYUU NOBORI OR OTHER\r\nSUPPLIERS), OR ANY JURIDICAL DISPUTES AGAINST US WHICH ARE CAUSED BY ANY KIND\r\nOF USING, COPYING, MODIFYING, MERGING, PUBLISHING, DISTRIBUTING, SUBLICENSING,\r\nAND/OR SELLING COPIES OF THIS SOFTWARE SHALL BE REGARDED AS BE CONSTRUED AND\r\nCONTROLLED BY JAPANESE LAWS, AND YOU MUST FURTHER CONSENT TO EXCLUSIVE\r\nJURISDICTION AND VENUE IN THE COURTS SITTING IN TOKYO, JAPAN. YOU MUST WAIVE\r\nALL DEFENSES OF LACK OF PERSONAL JURISDICTION AND FORUM NON CONVENIENS.\r\nPROCESS MAY BE SERVED ON EITHER PARTY IN THE MANNER AUTHORIZED BY APPLICABLE\r\nLAW OR COURT RULE.\r\n\r\nUSE ONLY IN JAPAN. DO NOT USE THIS SOFTWARE IN ANOTHER COUNTRY UNLESS YOU HAVE\r\nA CONFIRMATION THAT THIS SOFTWARE DOES NOT VIOLATE ANY CRIMINAL LAWS OR CIVIL\r\nRIGHTS IN THAT PARTICULAR COUNTRY. USING THIS SOFTWARE IN OTHER COUNTRIES IS\r\nCOMPLETELY AT YOUR OWN RISK. THE SOFTETHER VPN PROJECT HAS DEVELOPED AND\r\nDISTRIBUTED THIS SOFTWARE TO COMPLY ONLY WITH THE JAPANESE LAWS AND EXISTING\r\nCIVIL RIGHTS INCLUDING PATENTS WHICH ARE SUBJECTS APPLY IN JAPAN. OTHER\r\nCOUNTRIES' LAWS OR CIVIL RIGHTS ARE NONE OF OUR CONCERNS NOR RESPONSIBILITIES.\r\nWE HAVE NEVER INVESTIGATED ANY CRIMINAL REGULATIONS, CIVIL LAWS OR\r\nINTELLECTUAL PROPERTY RIGHTS INCLUDING PATENTS IN ANY OF OTHER 200+ COUNTRIES\r\nAND TERRITORIES. BY NATURE, THERE ARE 200+ REGIONS IN THE WORLD, WITH\r\nDIFFERENT LAWS. IT IS IMPOSSIBLE TO VERIFY EVERY COUNTRIES' LAWS, REGULATIONS\r\nAND CIVIL RIGHTS TO MAKE THE SOFTWARE COMPLY WITH ALL COUNTRIES' LAWS BY THE\r\nPROJECT. EVEN IF YOU WILL BE SUED BY A PRIVATE ENTITY OR BE DAMAGED BY A\r\nPUBLIC SERVANT IN YOUR COUNTRY, THE DEVELOPERS OF THIS SOFTWARE WILL NEVER BE\r\nLIABLE TO RECOVER OR COMPENSATE SUCH DAMAGES, CRIMINAL OR CIVIL\r\nRESPONSIBILITIES. NOTE THAT THIS LINE IS NOT LICENSE RESTRICTION BUT JUST A\r\nSTATEMENT FOR WARNING AND DISCLAIMER.\r\n\r\nREAD AND UNDERSTAND THE 'src/WARNING.TXT' FILE BEFORE USING THIS SOFTWARE.\r\nSOME SOFTWARE PROGRAMS FROM THIRD PARTIES ARE INCLUDED ON THIS SOFTWARE WITH\r\nLICENSE CONDITIONS WHICH ARE DESCRIBED ON THE 'src/THIRD_PARTY.TXT' FILE.\r\n\r\n"
        },
        {
          "name": "README",
          "type": "blob",
          "size": 8.8203125,
          "content": "SoftEther VPN (Stable Edition Repository)\r\n- An Open-Source Cross-platform Multi-protocol VPN Program\r\nhttps://www.softether.org/\r\n\r\nWe use GitHub as the primary official SoftEther VPN repository:\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nThis branch is officially managed by Daiyuu Nobori, the owner of\r\nSoftEther VPN Project. Pull requests should be sent to the\r\nDeveloper Edition Master Repository on\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN\r\n\r\nSource code packages (.zip and .tar.gz) and binary files are also available:\r\nhttps://www.softether-download.com/\r\n\r\nWe accept your patches by the acceptance policy:\r\nhttps://www.softether.org/5-download/src/9.patch\r\n\r\nCopyright (c) all contributors on SoftEther VPN project in GitHub.\r\nCopyright (c) Daiyuu Nobori, SoftEther Project at University of Tsukuba,\r\nand SoftEther Corporation.\r\nAll rights reserved.\r\n\r\nThe development of SoftEther VPN was supported by the MITOH Project,\r\na research and development project by Japanese Government,\r\nsubsidized by METI (Ministry of Economy, Trade and Industry of Japan),\r\nadministrated by IPA (Information Promotion Agency, Japan).\r\nhttps://www.ipa.go.jp/english/humandev/\r\n\r\nLicensed under the Apache License, Version 2.0 (the \"License\");\r\nyou may not use this file except in compliance with the License.\r\nYou may obtain a copy of the License at:\r\nhttp://www.apache.org/licenses/LICENSE-2.0\r\n\r\nSoftEther VPN (\"SoftEther\" means \"Software Ethernet\") is one of the\r\nworld's most powerful and easy-to-use multi-protocol VPN software.\r\n\r\nSoftEther VPN runs on Windows, Linux, Mac, FreeBSD and Solaris.\r\n\r\nSoftEther VPN supports most of widely-used VPN protocols\r\nincluding SSL-VPN, OpenVPN, IPsec, L2TP, MS-SSTP, L2TPv3 and EtherIP\r\nby the single SoftEther VPN Server program.\r\n\r\nMore details on https://www.softether.org/.\r\n\r\n\r\nSOFTETHER VPN ADVANTAGES\r\n------------------------\r\n\r\n- Supporting all popular VPN protocols by the single VPN server:\r\n  SSL-VPN (HTTPS)\r\n  OpenVPN\r\n  IPsec\r\n  L2TP\r\n  MS-SSTP\r\n  L2TPv3\r\n  EtherIP\r\n- Free and open-source software.\r\n- Easy to establish both remote-access and site-to-site VPN.\r\n- SSL-VPN Tunneling on HTTPS to pass through NATs and firewalls.\r\n- Revolutionary VPN over ICMP and VPN over DNS features.\r\n- Resistance to highly-restricted firewall.\r\n- Ethernet-bridging (L2) and IP-routing (L3) over VPN.\r\n- Embedded dynamic-DNS and NAT-traversal so that no static nor\r\n  fixed IP address is required.\r\n- AES 256-bit and RSA 4096-bit encryptions.\r\n- Sufficient security features such as logging and firewall inner\r\n  VPN tunnel.\r\n- User authentication with RADIUS and NT domain controllers.\r\n- User authentication with X.509 client certificate.\r\n- Packet logging.\r\n- 1Gbps-class high-speed throughput performance with low memory and\r\n  CPU usage.\r\n- Windows, Linux, Mac, Android, iPhone, iPad and Windows Phone are\r\n  supported.\r\n- The OpenVPN clone function supports legacy OpenVPN clients.\r\n- IPv4 / IPv6 dual-stack.\r\n- The VPN server runs on Windows, Linux, FreeBSD, Solaris and Mac OS X.\r\n- Configure All settings on GUI.\r\n- Multi-languages (English, Japanese and Simplified-Chinese).\r\n- No memory leaks. High quality stable codes, intended for long-term runs.\r\n  We always verify that there are no memory or resource leaks before\r\n  releasing the build.\r\n- More details at https://www.softether.org/.\r\n\r\n\r\nGETTING STARTED\r\n---------------\r\n\r\nVisit the SoftEther VPN Project official web site at first:\r\n        https://www.softether.org/\r\n\r\nIf you are not a developer, it is recommended to download the binary\r\ninstallers from:\r\n        https://www.softether-download.com/\r\n\r\nTo build from the source,\r\nsee \"BUILD_UNIX.TXT\" or \"BUILD_WINDOWS.TXT\" files.\r\n\r\n\r\nHOW TO DOWNLOAD THE LATEST SOURCE CODE PACKAGE\r\n----------------------------------------------\r\n\r\nGo to https://www.softether-download.com/ and you can find the latest\r\nsource-code package file in both .ZIP and .TAR.GZ format.\r\n\r\nThis is the easiest way to obtain the source code of SoftEther VPN.\r\n\r\n\r\nHOW TO GET THE LATEST SOURCE CODE TREE FOR DEVELOPERS\r\n-----------------------------------------------------\r\n\r\nIf you are an open-source developer, visit our GitHub repository:\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nYou can download the up-to-date source-code tree of SoftEther VPN\r\nfrom GitHub. You may make your own fork project from our project.\r\n\r\nThe download and build instruction is following:\r\n\r\n$ git clone https://github.com/SoftEtherVPN/SoftEtherVPN_Stable.git\r\n$ cd SoftEtherVPN\r\n$ ./configure\r\n$ make\r\n$ make install\r\n\r\n\r\nTO CIRCUMVENT YOUR GOVERNMENT'S FIREWALL RESTRICTION\r\n----------------------------------------------------\r\n\r\nBecause SoftEther VPN is overly strong tool to build a VPN tunnel,\r\nsome censorship governments want to block your access to the source code\r\nof SoftEther VPN, by abusing their censorship firewalls.\r\n\r\nTo circumvent your censor's unjust restriction,\r\nSoftEther VPN Project distributes the up-to-date source-code\r\non all the following open-source repositories:\r\n\r\n  - GitHub\r\n    https://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nTo fetch the source code from GitHub:\r\n$ git clone https://github.com/SoftEtherVPN/SoftEtherVPN_Stable.git\r\n\r\nWe hope that you can reach one of the above URLs at least!\r\n\r\n\r\nSOURCE CODE CONTRIBUTION\r\n------------------------\r\n\r\nYour contribution to SoftEther VPN Project is much appreciated.\r\nPlease send patches to us through GitHub.\r\nRead the SoftEther VPN Patch Acceptance Policy in advance:\r\nhttps://www.softether.org/5-download/src/9.patch\r\n\r\n\r\nDEAR SECURITY EXPERTS\r\n---------------------\r\n\r\nIf you find a bug or a security vulnerability please kindly inform us\r\nabout the problem immediately so that we can fix the security problem\r\nto protect a lot of users around the world as soon as possible.\r\n\r\nOur e-mail address for security reports is:\r\nsoftether-vpn-security [at] softether.org\r\n\r\nPlease note that the above e-mail address is not a technical support\r\ninquiry address. If you need technical assistance, please visit\r\nhttps://www.softether.org/ and ask your question on the users forum.\r\n\r\n\r\nDISCLAIMER\r\n----------\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\r\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\r\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\r\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\r\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\r\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\r\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\nTHIS SOFTWARE IS DEVELOPED IN JAPAN, AND DISTRIBUTED FROM JAPAN,\r\nUNDER JAPANESE LAWS. YOU MUST AGREE IN ADVANCE TO USE, COPY, MODIFY,\r\nMERGE, PUBLISH, DISTRIBUTE, SUBLICENSE, AND/OR SELL COPIES OF THIS\r\nSOFTWARE, THAT ANY JURIDICAL DISPUTES WHICH ARE CONCERNED TO THIS\r\nSOFTWARE OR ITS CONTENTS, AGAINST US (SOFTETHER PROJECT, SOFTETHER\r\nCORPORATION, DAIYUU NOBORI OR OTHER SUPPLIERS), OR ANY JURIDICAL\r\nDISPUTES AGAINST US WHICH ARE CAUSED BY ANY KIND OF USING, COPYING,\r\nMODIFYING, MERGING, PUBLISHING, DISTRIBUTING, SUBLICENSING, AND/OR\r\nSELLING COPIES OF THIS SOFTWARE SHALL BE REGARDED AS BE CONSTRUED AND\r\nCONTROLLED BY JAPANESE LAWS, AND YOU MUST FURTHER CONSENT TO\r\nEXCLUSIVE JURISDICTION AND VENUE IN THE COURTS SITTING IN TOKYO,\r\nJAPAN. YOU MUST WAIVE ALL DEFENSES OF LACK OF PERSONAL JURISDICTION\r\nAND FORUM NON CONVENIENS. PROCESS MAY BE SERVED ON EITHER PARTY IN\r\nTHE MANNER AUTHORIZED BY APPLICABLE LAW OR COURT RULE.\r\n\r\nUSE ONLY IN JAPAN. DO NOT USE THIS SOFTWARE IN ANOTHER COUNTRY UNLESS\r\nYOU HAVE A CONFIRMATION THAT THIS SOFTWARE DOES NOT VIOLATE ANY\r\nCRIMINAL LAWS OR CIVIL RIGHTS IN THAT PARTICULAR COUNTRY. USING THIS\r\nSOFTWARE IN OTHER COUNTRIES IS COMPLETELY AT YOUR OWN RISK. THE\r\nSOFTETHER VPN PROJECT HAS DEVELOPED AND DISTRIBUTED THIS SOFTWARE TO\r\nCOMPLY ONLY WITH THE JAPANESE LAWS AND EXISTING CIVIL RIGHTS INCLUDING\r\nPATENTS WHICH ARE SUBJECTS APPLY IN JAPAN. OTHER COUNTRIES' LAWS OR\r\nCIVIL RIGHTS ARE NONE OF OUR CONCERNS NOR RESPONSIBILITIES. WE HAVE\r\nNEVER INVESTIGATED ANY CRIMINAL REGULATIONS, CIVIL LAWS OR\r\nINTELLECTUAL PROPERTY RIGHTS INCLUDING PATENTS IN ANY OF OTHER 200+\r\nCOUNTRIES AND TERRITORIES. BY NATURE, THERE ARE 200+ REGIONS IN THE\r\nWORLD, WITH DIFFERENT LAWS. IT IS IMPOSSIBLE TO VERIFY EVERY\r\nCOUNTRIES' LAWS, REGULATIONS AND CIVIL RIGHTS TO MAKE THE SOFTWARE\r\nCOMPLY WITH ALL COUNTRIES' LAWS BY THE PROJECT. EVEN IF YOU WILL BE\r\nSUED BY A PRIVATE ENTITY OR BE DAMAGED BY A PUBLIC SERVANT IN YOUR\r\nCOUNTRY, THE DEVELOPERS OF THIS SOFTWARE WILL NEVER BE LIABLE TO\r\nRECOVER OR COMPENSATE SUCH DAMAGES, CRIMINAL OR CIVIL\r\nRESPONSIBILITIES. NOTE THAT THIS LINE IS NOT LICENSE RESTRICTION BUT\r\nJUST A STATEMENT FOR WARNING AND DISCLAIMER.\r\n\r\nREAD AND UNDERSTAND THE 'WARNING.TXT' FILE BEFORE USING THIS SOFTWARE.\r\nSOME SOFTWARE PROGRAMS FROM THIRD PARTIES ARE INCLUDED ON THIS SOFTWARE\r\nWITH LICENSE CONDITIONS WHICH ARE DESCRIBED ON THE 'THIRD_PARTY.TXT' FILE.\r\n\r\n\r\n"
        },
        {
          "name": "README.TXT",
          "type": "blob",
          "size": 8.8203125,
          "content": "SoftEther VPN (Stable Edition Repository)\r\n- An Open-Source Cross-platform Multi-protocol VPN Program\r\nhttps://www.softether.org/\r\n\r\nWe use GitHub as the primary official SoftEther VPN repository:\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nThis branch is officially managed by Daiyuu Nobori, the owner of\r\nSoftEther VPN Project. Pull requests should be sent to the\r\nDeveloper Edition Master Repository on\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN\r\n\r\nSource code packages (.zip and .tar.gz) and binary files are also available:\r\nhttps://www.softether-download.com/\r\n\r\nWe accept your patches by the acceptance policy:\r\nhttps://www.softether.org/5-download/src/9.patch\r\n\r\nCopyright (c) all contributors on SoftEther VPN project in GitHub.\r\nCopyright (c) Daiyuu Nobori, SoftEther Project at University of Tsukuba,\r\nand SoftEther Corporation.\r\nAll rights reserved.\r\n\r\nThe development of SoftEther VPN was supported by the MITOH Project,\r\na research and development project by Japanese Government,\r\nsubsidized by METI (Ministry of Economy, Trade and Industry of Japan),\r\nadministrated by IPA (Information Promotion Agency, Japan).\r\nhttps://www.ipa.go.jp/english/humandev/\r\n\r\nLicensed under the Apache License, Version 2.0 (the \"License\");\r\nyou may not use this file except in compliance with the License.\r\nYou may obtain a copy of the License at:\r\nhttp://www.apache.org/licenses/LICENSE-2.0\r\n\r\nSoftEther VPN (\"SoftEther\" means \"Software Ethernet\") is one of the\r\nworld's most powerful and easy-to-use multi-protocol VPN software.\r\n\r\nSoftEther VPN runs on Windows, Linux, Mac, FreeBSD and Solaris.\r\n\r\nSoftEther VPN supports most of widely-used VPN protocols\r\nincluding SSL-VPN, OpenVPN, IPsec, L2TP, MS-SSTP, L2TPv3 and EtherIP\r\nby the single SoftEther VPN Server program.\r\n\r\nMore details on https://www.softether.org/.\r\n\r\n\r\nSOFTETHER VPN ADVANTAGES\r\n------------------------\r\n\r\n- Supporting all popular VPN protocols by the single VPN server:\r\n  SSL-VPN (HTTPS)\r\n  OpenVPN\r\n  IPsec\r\n  L2TP\r\n  MS-SSTP\r\n  L2TPv3\r\n  EtherIP\r\n- Free and open-source software.\r\n- Easy to establish both remote-access and site-to-site VPN.\r\n- SSL-VPN Tunneling on HTTPS to pass through NATs and firewalls.\r\n- Revolutionary VPN over ICMP and VPN over DNS features.\r\n- Resistance to highly-restricted firewall.\r\n- Ethernet-bridging (L2) and IP-routing (L3) over VPN.\r\n- Embedded dynamic-DNS and NAT-traversal so that no static nor\r\n  fixed IP address is required.\r\n- AES 256-bit and RSA 4096-bit encryptions.\r\n- Sufficient security features such as logging and firewall inner\r\n  VPN tunnel.\r\n- User authentication with RADIUS and NT domain controllers.\r\n- User authentication with X.509 client certificate.\r\n- Packet logging.\r\n- 1Gbps-class high-speed throughput performance with low memory and\r\n  CPU usage.\r\n- Windows, Linux, Mac, Android, iPhone, iPad and Windows Phone are\r\n  supported.\r\n- The OpenVPN clone function supports legacy OpenVPN clients.\r\n- IPv4 / IPv6 dual-stack.\r\n- The VPN server runs on Windows, Linux, FreeBSD, Solaris and Mac OS X.\r\n- Configure All settings on GUI.\r\n- Multi-languages (English, Japanese and Simplified-Chinese).\r\n- No memory leaks. High quality stable codes, intended for long-term runs.\r\n  We always verify that there are no memory or resource leaks before\r\n  releasing the build.\r\n- More details at https://www.softether.org/.\r\n\r\n\r\nGETTING STARTED\r\n---------------\r\n\r\nVisit the SoftEther VPN Project official web site at first:\r\n        https://www.softether.org/\r\n\r\nIf you are not a developer, it is recommended to download the binary\r\ninstallers from:\r\n        https://www.softether-download.com/\r\n\r\nTo build from the source,\r\nsee \"BUILD_UNIX.TXT\" or \"BUILD_WINDOWS.TXT\" files.\r\n\r\n\r\nHOW TO DOWNLOAD THE LATEST SOURCE CODE PACKAGE\r\n----------------------------------------------\r\n\r\nGo to https://www.softether-download.com/ and you can find the latest\r\nsource-code package file in both .ZIP and .TAR.GZ format.\r\n\r\nThis is the easiest way to obtain the source code of SoftEther VPN.\r\n\r\n\r\nHOW TO GET THE LATEST SOURCE CODE TREE FOR DEVELOPERS\r\n-----------------------------------------------------\r\n\r\nIf you are an open-source developer, visit our GitHub repository:\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nYou can download the up-to-date source-code tree of SoftEther VPN\r\nfrom GitHub. You may make your own fork project from our project.\r\n\r\nThe download and build instruction is following:\r\n\r\n$ git clone https://github.com/SoftEtherVPN/SoftEtherVPN_Stable.git\r\n$ cd SoftEtherVPN\r\n$ ./configure\r\n$ make\r\n$ make install\r\n\r\n\r\nTO CIRCUMVENT YOUR GOVERNMENT'S FIREWALL RESTRICTION\r\n----------------------------------------------------\r\n\r\nBecause SoftEther VPN is overly strong tool to build a VPN tunnel,\r\nsome censorship governments want to block your access to the source code\r\nof SoftEther VPN, by abusing their censorship firewalls.\r\n\r\nTo circumvent your censor's unjust restriction,\r\nSoftEther VPN Project distributes the up-to-date source-code\r\non all the following open-source repositories:\r\n\r\n  - GitHub\r\n    https://github.com/SoftEtherVPN/SoftEtherVPN_Stable/\r\n\r\nTo fetch the source code from GitHub:\r\n$ git clone https://github.com/SoftEtherVPN/SoftEtherVPN_Stable.git\r\n\r\nWe hope that you can reach one of the above URLs at least!\r\n\r\n\r\nSOURCE CODE CONTRIBUTION\r\n------------------------\r\n\r\nYour contribution to SoftEther VPN Project is much appreciated.\r\nPlease send patches to us through GitHub.\r\nRead the SoftEther VPN Patch Acceptance Policy in advance:\r\nhttps://www.softether.org/5-download/src/9.patch\r\n\r\n\r\nDEAR SECURITY EXPERTS\r\n---------------------\r\n\r\nIf you find a bug or a security vulnerability please kindly inform us\r\nabout the problem immediately so that we can fix the security problem\r\nto protect a lot of users around the world as soon as possible.\r\n\r\nOur e-mail address for security reports is:\r\nsoftether-vpn-security [at] softether.org\r\n\r\nPlease note that the above e-mail address is not a technical support\r\ninquiry address. If you need technical assistance, please visit\r\nhttps://www.softether.org/ and ask your question on the users forum.\r\n\r\n\r\nDISCLAIMER\r\n----------\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\r\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\r\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\r\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\r\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\r\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\r\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\nTHIS SOFTWARE IS DEVELOPED IN JAPAN, AND DISTRIBUTED FROM JAPAN,\r\nUNDER JAPANESE LAWS. YOU MUST AGREE IN ADVANCE TO USE, COPY, MODIFY,\r\nMERGE, PUBLISH, DISTRIBUTE, SUBLICENSE, AND/OR SELL COPIES OF THIS\r\nSOFTWARE, THAT ANY JURIDICAL DISPUTES WHICH ARE CONCERNED TO THIS\r\nSOFTWARE OR ITS CONTENTS, AGAINST US (SOFTETHER PROJECT, SOFTETHER\r\nCORPORATION, DAIYUU NOBORI OR OTHER SUPPLIERS), OR ANY JURIDICAL\r\nDISPUTES AGAINST US WHICH ARE CAUSED BY ANY KIND OF USING, COPYING,\r\nMODIFYING, MERGING, PUBLISHING, DISTRIBUTING, SUBLICENSING, AND/OR\r\nSELLING COPIES OF THIS SOFTWARE SHALL BE REGARDED AS BE CONSTRUED AND\r\nCONTROLLED BY JAPANESE LAWS, AND YOU MUST FURTHER CONSENT TO\r\nEXCLUSIVE JURISDICTION AND VENUE IN THE COURTS SITTING IN TOKYO,\r\nJAPAN. YOU MUST WAIVE ALL DEFENSES OF LACK OF PERSONAL JURISDICTION\r\nAND FORUM NON CONVENIENS. PROCESS MAY BE SERVED ON EITHER PARTY IN\r\nTHE MANNER AUTHORIZED BY APPLICABLE LAW OR COURT RULE.\r\n\r\nUSE ONLY IN JAPAN. DO NOT USE THIS SOFTWARE IN ANOTHER COUNTRY UNLESS\r\nYOU HAVE A CONFIRMATION THAT THIS SOFTWARE DOES NOT VIOLATE ANY\r\nCRIMINAL LAWS OR CIVIL RIGHTS IN THAT PARTICULAR COUNTRY. USING THIS\r\nSOFTWARE IN OTHER COUNTRIES IS COMPLETELY AT YOUR OWN RISK. THE\r\nSOFTETHER VPN PROJECT HAS DEVELOPED AND DISTRIBUTED THIS SOFTWARE TO\r\nCOMPLY ONLY WITH THE JAPANESE LAWS AND EXISTING CIVIL RIGHTS INCLUDING\r\nPATENTS WHICH ARE SUBJECTS APPLY IN JAPAN. OTHER COUNTRIES' LAWS OR\r\nCIVIL RIGHTS ARE NONE OF OUR CONCERNS NOR RESPONSIBILITIES. WE HAVE\r\nNEVER INVESTIGATED ANY CRIMINAL REGULATIONS, CIVIL LAWS OR\r\nINTELLECTUAL PROPERTY RIGHTS INCLUDING PATENTS IN ANY OF OTHER 200+\r\nCOUNTRIES AND TERRITORIES. BY NATURE, THERE ARE 200+ REGIONS IN THE\r\nWORLD, WITH DIFFERENT LAWS. IT IS IMPOSSIBLE TO VERIFY EVERY\r\nCOUNTRIES' LAWS, REGULATIONS AND CIVIL RIGHTS TO MAKE THE SOFTWARE\r\nCOMPLY WITH ALL COUNTRIES' LAWS BY THE PROJECT. EVEN IF YOU WILL BE\r\nSUED BY A PRIVATE ENTITY OR BE DAMAGED BY A PUBLIC SERVANT IN YOUR\r\nCOUNTRY, THE DEVELOPERS OF THIS SOFTWARE WILL NEVER BE LIABLE TO\r\nRECOVER OR COMPENSATE SUCH DAMAGES, CRIMINAL OR CIVIL\r\nRESPONSIBILITIES. NOTE THAT THIS LINE IS NOT LICENSE RESTRICTION BUT\r\nJUST A STATEMENT FOR WARNING AND DISCLAIMER.\r\n\r\nREAD AND UNDERSTAND THE 'WARNING.TXT' FILE BEFORE USING THIS SOFTWARE.\r\nSOME SOFTWARE PROGRAMS FROM THIRD PARTIES ARE INCLUDED ON THIS SOFTWARE\r\nWITH LICENSE CONDITIONS WHICH ARE DESCRIBED ON THE 'THIRD_PARTY.TXT' FILE.\r\n\r\n\r\n"
        },
        {
          "name": "THIRD_PARTY.TXT",
          "type": "blob",
          "size": 42.73046875,
          "content": "BitVisor(R) VPN Client Module (IPsec Driver):\r\nCopyright (c) 2007, 2008 University of Tsukuba.\r\nCopyright (C) 2007, 2008 National Institute of Information and Communications\r\nTechnology.\r\nAll rights reserved.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n\r\n1. Redistributions of source code must retain the above copyright notice, this\r\nlist of conditions and the following disclaimer.\r\n2. Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n3. Neither the name of the University of Tsukuba nor the names of its\r\ncontributors may be used to endorse or promote products derived from this\r\nsoftware without specific prior written permission.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\r\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\r\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\r\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\r\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\r\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\r\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\r\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\r\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\r\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\n-------------------\r\n\r\nMicrosoft(R) C Runtime Library:\r\n(c) 2007 Microsoft Corporation. All Rights Reserved.\r\n\r\n-------------------\r\n\r\nRSA Security Inc. PKCS #11 Cryptographic Token Interface (Cryptoki):\r\n\r\nLicense to copy and use this software is granted provided that it is\r\nidentified as \"RSA Security Inc. PKCS #11 Cryptographic Token Interface\r\n(Cryptoki)\" in all material mentioning or referencing this software.\r\n\r\nLicense is also granted to make and use derivative works provided that such\r\nworks are identified as \"derived from the RSA Security Inc. PKCS #11\r\nCryptographic Token Interface (Cryptoki)\" in all material mentioning or\r\nreferencing the derived work.\r\n\r\nRSA Security Inc. makes no representations concerning either the\r\nmerchantability of this software or the suitability of this software for any\r\nparticular purpose. It is provided \"as is\" without express or implied warranty\r\nof any kind.\r\n\r\n-------------------\r\n\r\nWinPcap:\r\nCopyright (c) 2001 - 2003 NetGroup, Politecnico di Torino (Italy)\r\nAll rights reserved.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n\r\n1. Redistributions of source code must retain the above copyright notice, this\r\nlist of conditions and the following disclaimer.\r\n2. Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n3. Neither the name of the Politecnico di Torino nor the names of its\r\ncontributors may be used to endorse or promote products derived from this\r\nsoftware without specific prior written permission.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\r\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\r\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\r\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\r\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\r\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\r\nSERVICES; LOSS OF USE,\r\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\r\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\r\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\r\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\n-------------------\r\n\r\nlibedit:\r\nCopyright (c) 1992, 1993 The Regents of the University of California.  All\r\nrights reserved.\r\n\r\nThis code is derived from software contributed to Berkeley by Christos Zoulas\r\nof Cornell University.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n1. Redistributions of source code must retain the above copyright notice, this\r\nlist of conditions and the following disclaimer.\r\n2. Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n3. Neither the name of the University nor the names of its contributors may be\r\nused to endorse or promote products derived from this software without\r\nspecific prior written permission.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND ANY\r\nEXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\r\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\r\nDISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY\r\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\r\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\r\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\r\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\r\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\r\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\n-------------------\r\n\r\nlibiconv:\r\n\r\n          GNU LIBRARY GENERAL PUBLIC LICENSE\r\n               Version 2, June 1991\r\n\r\n Copyright (C) 1991 Free Software Foundation, Inc.\r\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA\r\n Everyone is permitted to copy and distribute verbatim copies of this license\r\ndocument, but changing it is not allowed.\r\n\r\n[This is the first released version of the library GPL. It is\r\n numbered 2 because it goes with version 2 of the ordinary GPL.]\r\n\r\n                Preamble\r\n\r\n  The licenses for most software are designed to take away your freedom to\r\nshare and change it. By contrast, the GNU General Public Licenses are intended\r\nto guarantee your freedom to share and change free software--to make sure the\r\nsoftware is free for all its users.\r\n\r\n  This license, the Library General Public License, applies to some specially\r\ndesignated Free Software Foundation software, and to any other libraries whose\r\nauthors decide to use it. You can use it for your libraries, too.\r\n\r\n  When we speak of free software, we are referring to freedom, not price. Our\r\nGeneral Public Licenses are designed to make sure that you have the freedom to\r\ndistribute copies of free software (and charge for\r\nthis service if you wish), that you receive source code or can get it if you\r\nwant it, that you can change the software or use pieces of it in new free\r\nprograms; and that you know you can do these things.\r\n\r\n  To protect your rights, we need to make restrictions that forbid anyone to\r\ndeny you these rights or to ask you to surrender the rights. These\r\nrestrictions translate to certain responsibilities for you if you distribute\r\ncopies of the library, or if you modify it.\r\n\r\n  For example, if you distribute copies of the library, whether gratis or for\r\na fee, you must give the recipients all the rights that we gave you. You must\r\nmake sure that they, too, receive or can get the source\r\ncode. If you link a program with the library, you must provide complete object\r\nfiles to the recipients so that they can relink them with the library, after\r\nmaking changes to the library and recompiling it. And you must show them these\r\nterms so they know their rights.\r\n\r\n  Our method of protecting your rights has two steps: (1) copyright the\r\nlibrary, and (2) offer you this license which gives you legal permission to\r\ncopy, distribute and/or modify the library.\r\n\r\n  Also, for each distributor's protection, we want to make certain that\r\neveryone understands that there is no warranty for this free library. If the\r\nlibrary is modified by someone else and passed on, we want its recipients to\r\nknow that what they have is not the original version, so that any problems\r\nintroduced by others will not reflect on the original authors' reputations.\r\n\r\n  Finally, any free program is threatened constantly by software patents. We\r\nwish to avoid the danger that companies distributing free software will\r\nindividually obtain patent licenses, thus in effect transforming the program\r\ninto proprietary software. To prevent this, we have made it clear that any\r\npatent must be licensed for everyone's free use or not licensed at all.\r\n\r\n  Most GNU software, including some libraries, is covered by the ordinary GNU\r\nGeneral Public License, which was designed for utility programs. This license,\r\nthe GNU Library General Public License, applies to certain designated\r\nlibraries. This license is quite different from the ordinary one; be sure to\r\nread it in full, and don't assume that anything in it is the same as in the\r\nordinary license.\r\n\r\n  The reason we have a separate public license for some libraries is that they\r\nblur the distinction we usually make between modifying or adding to a program\r\nand simply using it. Linking a program with a library, without changing the\r\nlibrary, is in some sense simply using the library, and is analogous to\r\nrunning a utility program or application program. However, in a textual and\r\nlegal sense, the linked executable is a combined work, a derivative of the\r\noriginal library, and the ordinary General Public License treats it as such.\r\n\r\n  Because of this blurred distinction, using the ordinary General Public\r\nLicense for libraries did not effectively promote software sharing, because\r\nmost developers did not use the libraries. We concluded that weaker conditions\r\nmight promote sharing better.\r\n\r\n  However, unrestricted linking of non-free programs would deprive the users\r\nof those programs of all benefit from the free status of the libraries\r\nthemselves. This Library General Public License is intended to\r\npermit developers of non-free programs to use free libraries, while preserving\r\nyour freedom as a user of such programs to change the free libraries that are\r\nincorporated in them. (We have not seen how to achieve this as regards changes\r\nin header files, but we have achieved it as regards changes in the actual\r\nfunctions of the Library.) The hope is that this will lead to faster\r\ndevelopment of free libraries.\r\n\r\n  The precise terms and conditions for copying, distribution and modification\r\nfollow. Pay close attention to the difference between a \"work based on the\r\nlibrary\" and a \"work that uses the library\". The former contains code derived\r\nfrom the library, while the latter only works together with the library.\r\n\r\n  Note that it is possible for a library to be covered by the ordinary General\r\nPublic License rather than by this special one.\r\n\r\n          GNU LIBRARY GENERAL PUBLIC LICENSE\r\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\r\n\r\n  0. This License Agreement applies to any software library which contains a\r\nnotice placed by the copyright holder or other authorized party saying it may\r\nbe distributed under the terms of this Library\r\nGeneral Public License (also called \"this License\"). Each licensee is\r\naddressed as \"you\".\r\n\r\n  A \"library\" means a collection of software functions and/or data prepared so\r\nas to be conveniently linked with application programs (which use some of\r\nthose functions and data) to form executables.\r\n\r\n  The \"Library\", below, refers to any such software library or work which has\r\nbeen distributed under these terms. A \"work based on the Library\" means either\r\nthe Library or any derivative work under copyright law: that is to say, a work\r\ncontaining the Library or a portion of it, either verbatim or with\r\nmodifications and/or translated straightforwardly into another language.\r\n(Hereinafter, translation is included without limitation in the term\r\n\"modification\".)\r\n\r\n  \"Source code\" for a work means the preferred form of the work for making\r\nmodifications to it. For a library, complete source code means all the source\r\ncode for all modules it contains, plus any associated interface definition\r\nfiles, plus the scripts used to control compilation and installation of the\r\nlibrary.\r\n\r\n  Activities other than copying, distribution and modification are not covered\r\nby this License; they are outside its scope. The act of running a program\r\nusing the Library is not restricted, and output from such a program is covered\r\nonly if its contents constitute a work based on the Library (independent of\r\nthe use of the Library in a tool for writing it). Whether that is true depends\r\non what the Library does and what the program that uses the Library does.\r\n\r\n  1. You may copy and distribute verbatim copies of the Library's complete\r\nsource code as you receive it, in any medium, provided that you conspicuously\r\nand appropriately publish on each copy an appropriate copyright notice and\r\ndisclaimer of warranty; keep intact all the notices that refer to this License\r\nand to the absence of any warranty; and distribute a copy of this License\r\nalong with the Library.\r\n\r\n  You may charge a fee for the physical act of transferring a copy, and you\r\nmay at your option offer warranty protection in exchange for a fee.\r\n\r\n  2. You may modify your copy or copies of the Library or any portion of it,\r\nthus forming a work based on the Library, and copy and distribute such\r\nmodifications or work under the terms of Section 1 above, provided that you\r\nalso meet all of these conditions:\r\n\r\n    a) The modified work must itself be a software library.\r\n\r\n    b) You must cause the files modified to carry prominent notices stating\r\nthat you changed the files and the date of any change.\r\n\r\n    c) You must cause the whole of the work to be licensed at no charge to all\r\nthird parties under the terms of this License.\r\n\r\n    d) If a facility in the modified Library refers to a function or a table\r\nof data to be supplied by an application program that uses the facility, other\r\nthan as an argument passed when the facility is invoked, then you must make a\r\ngood faith effort to ensure that, in the event an application does not supply\r\nsuch function or table, the facility still operates, and performs whatever\r\npart of its purpose remains meaningful.\r\n\r\n    (For example, a function in a library to compute square roots has a\r\npurpose that is entirely well-defined independent of the application.\r\nTherefore, Subsection 2d requires that any application-supplied function or\r\ntable used by this function must be optional: if the application does not\r\nsupply it, the square root function must still compute square roots.)\r\n\r\nThese requirements apply to the modified work as a whole. If identifiable\r\nsections of that work are not derived from the Library, and can be reasonably\r\nconsidered independent and separate works in themselves, then this License,\r\nand its terms, do not apply to those sections when you distribute them as\r\nseparate works. But when you distribute the same sections as part of a whole\r\nwhich is a work based on the Library, the distribution of the whole must be on\r\nthe terms of this License, whose permissions for other licensees extend to the\r\nentire whole, and thus to each and every part regardless of who wrote it.\r\n\r\nThus, it is not the intent of this section to claim rights or contest your\r\nrights to work written entirely by you; rather, the intent is to exercise the\r\nright to control the distribution of derivative or collective works based on\r\nthe Library.\r\n\r\nIn addition, mere aggregation of another work not based on the Library with\r\nthe Library (or with a work based on the Library) on a volume of a storage or\r\ndistribution medium does not bring the other work under the scope of this\r\nLicense.\r\n\r\n  3. You may opt to apply the terms of the ordinary GNU General Public\r\nLicense instead of this License to a given copy of the Library. To do this,\r\nyou must alter all the notices that refer to this License, so that they refer\r\nto the ordinary GNU General Public License, version 2, instead of to this\r\nLicense. (If a newer version than version 2 of the ordinary GNU General Public\r\nLicense has appeared, then you can specify that version instead if you wish.)\r\nDo not make any other change in these notices.\r\n\r\n  Once this change is made in a given copy, it is irreversible for that copy,\r\nso the ordinary GNU General Public License applies to all subsequent copies\r\nand derivative works made from that copy.\r\n\r\n  This option is useful when you wish to copy part of the code of the Library\r\ninto a program that is not a library.\r\n\r\n  4. You may copy and distribute the Library (or a portion or derivative of\r\nit, under Section 2) in object code or executable form under the terms of\r\nSections 1 and 2 above provided that you accompany it with the complete\r\ncorresponding machine-readable source code, which must be distributed under\r\nthe terms of Sections 1 and 2 above on a medium customarily used for software\r\ninterchange.\r\n\r\n  If distribution of object code is made by offering access to copy from a\r\ndesignated place, then offering equivalent access to copy the source code from\r\nthe same place satisfies the requirement to distribute the source code, even\r\nthough third parties are not compelled to copy the source along with the\r\nobject code.\r\n\r\n  5. A program that contains no derivative of any portion of the Library, but\r\nis designed to work with the Library by being compiled or linked with it, is\r\ncalled a \"work that uses the Library\". Such a work, in isolation, is not a\r\nderivative work of the Library, and therefore falls outside the scope of this\r\nLicense.\r\n\r\n  However, linking a \"work that uses the Library\" with the Library creates an\r\nexecutable that is a derivative of the Library (because it contains portions\r\nof the Library), rather than a \"work that uses the library\". The executable is\r\ntherefore covered by this License.\r\nSection 6 states terms for distribution of such executables.\r\n\r\n  When a \"work that uses the Library\" uses material from a header file that is\r\npart of the Library, the object code for the work may be a derivative work of\r\nthe Library even though the source code is not.\r\nWhether this is true is especially significant if the work can be linked\r\nwithout the Library, or if the work is itself a library. The threshold for\r\nthis to be true is not precisely defined by law.\r\n\r\n  If such an object file uses only numerical parameters, data structure\r\nlayouts and accessors, and small macros and small inline functions (ten lines\r\nor less in length), then the use of the object file is unrestricted,\r\nregardless of whether it is legally a derivative work. (Executables containing\r\nthis object code plus portions of the Library will still fall under Section\r\n6.)\r\n\r\n  Otherwise, if the work is a derivative of the Library, you may distribute\r\nthe object code for the work under the terms of Section 6. Any executables\r\ncontaining that work also fall under Section 6, whether or not they are linked\r\ndirectly with the Library itself.\r\n\r\n  6. As an exception to the Sections above, you may also compile or link a\r\n\"work that uses the Library\" with the Library to produce a work containing\r\nportions of the Library, and distribute that work under terms of your choice,\r\nprovided that the terms permit modification of the work for the customer's own\r\nuse and reverse engineering for debugging such modifications.\r\n\r\n  You must give prominent notice with each copy of the work that the Library\r\nis used in it and that the Library and its use are covered by this License.\r\nYou must supply a copy of this License. If the work during execution displays\r\ncopyright notices, you must include the copyright notice for the Library among\r\nthem, as well as a reference directing the user to the copy of this License.\r\nAlso, you must do one of these things:\r\n\r\n    a) Accompany the work with the complete corresponding machine-readable\r\nsource code for the Library including whatever changes were used in the work\r\n(which must be distributed under Sections 1 and 2 above) ; and, if the work is\r\nan executable linked with the Library, with the complete machine-readable\r\n\"work that uses the Library\", as object code and/or source code, so that the\r\nuser can modify the Library and then relink to produce a modified executable\r\ncontaining the modified Library. (It is understood that the user who changes\r\nthe contents of definitions files in the Library will not necessarily be able\r\nto recompile the application to use the modified definitions.)\r\n\r\n    b) Accompany the work with a written offer, valid for at least three\r\nyears, to give the same user the materials specified in Subsection 6a, above,\r\nfor a charge no more than the cost of performing this distribution.\r\n\r\n    c) If distribution of the work is made by offering access to copy from a\r\ndesignated place, offer equivalent access to copy the above specified\r\nmaterials from the same place.\r\n\r\n    d) Verify that the user has already received a copy of these materials or\r\nthat you have already sent this user a copy.\r\n\r\n  For an executable, the required form of the \"work that uses the Library\"\r\nmust include any data and utility programs needed for reproducing the\r\nexecutable from it. However, as a special exception, the source code\r\ndistributed need not include anything that is normally distributed (in either\r\nsource or binary form) with the major components (compiler, kernel, and so on)\r\nof the operating system on which the executable runs, unless that component\r\nitself accompanies the executable.\r\n\r\n  It may happen that this requirement contradicts the license restrictions of\r\nother proprietary libraries that do not normally accompany the operating\r\nsystem. Such a contradiction means you cannot use both them and the Library\r\ntogether in an executable that you distribute.\r\n\r\n  7. You may place library facilities that are a work based on the Library\r\nside-by-side in a single library together with other library facilities not\r\ncovered by this License, and distribute such a combined library, provided that\r\nthe separate distribution of the work based on the Library and of the other\r\nlibrary facilities is otherwise permitted, and provided that you do these two\r\nthings:\r\n\r\n    a) Accompany the combined library with a copy of the same work based on\r\nthe Library, uncombined with any other library facilities. This must be\r\ndistributed under the terms of the Sections above.\r\n\r\n    b) Give prominent notice with the combined library of the fact that part\r\nof it is a work based on the Library, and explaining where to find the\r\naccompanying uncombined form of the same work.\r\n\r\n  8. You may not copy, modify, sublicense, link with, or distribute the\r\nLibrary except as expressly provided under this License. Any attempt otherwise\r\nto copy, modify, sublicense, link with, or distribute the Library is void, and\r\nwill automatically terminate your rights under this License. However, parties\r\nwho have received copies, or rights, from you under this License will not have\r\ntheir licenses terminated so long as such parties remain in full compliance.\r\n\r\n  9. You are not required to accept this License, since you have not signed\r\nit. However, nothing else grants you permission to modify or distribute the\r\nLibrary or its derivative works. These actions are prohibited by law if you do\r\nnot accept this License. Therefore, by modifying or distributing the Library\r\n(or any work based on the Library), you indicate your acceptance of this\r\nLicense to do so, and all its terms and conditions for copying, distributing\r\nor modifying the Library or works based on it.\r\n\r\n  10. Each time you redistribute the Library (or any work based on the\r\nLibrary), the recipient automatically receives a license from the original\r\nlicensor to copy, distribute, link with or modify the Library subject to these\r\nterms and conditions. You may not impose any further restrictions on the\r\nrecipients' exercise of the rights granted herein. You are not responsible for\r\nenforcing compliance by third parties to this License.\r\n\r\n  11. If, as a consequence of a court judgment or allegation of patent\r\ninfringement or for any other reason (not limited to patent issues),\r\nconditions are imposed on you (whether by court order, agreement or otherwise)\r\nthat contradict the conditions of this License, they do not excuse you from\r\nthe conditions of this License. If you cannot distribute so as to satisfy\r\nsimultaneously your obligations under this License and any other pertinent\r\nobligations, then as a consequence you may not distribute the Library at all.\r\nFor example, if a patent license would not permit royalty-free redistribution\r\nof the Library by all those who receive copies directly or indirectly through\r\nyou, then the only way you could satisfy both it and this License would be to\r\nrefrain entirely from distribution of the Library.\r\n\r\nIf any portion of this section is held invalid or unenforceable under any\r\nparticular circumstance, the balance of the section is intended to apply, and\r\nthe section as a whole is intended to apply in other circumstances.\r\n\r\nIt is not the purpose of this section to induce you to infringe any patents or\r\nother property right claims or to contest validity of any such claims; this\r\nsection has the sole purpose of protecting the integrity of the free software\r\ndistribution system which is implemented by public license practices. Many\r\npeople have made generous contributions to the wide range of software\r\ndistributed through that system in reliance on consistent application of that\r\nsystem; it is up to the author/donor to decide if he or she is willing to\r\ndistribute software through any other system and a licensee cannot impose that\r\nchoice.\r\n\r\nThis section is intended to make thoroughly clear what is believed to be a\r\nconsequence of the rest of this License.\r\n\r\n  12. If the distribution and/or use of the Library is restricted in certain\r\ncountries either by patents or by copyrighted interfaces, the original\r\ncopyright holder who places the Library under this License may add an explicit\r\ngeographical distribution limitation excluding those countries, so that\r\ndistribution is permitted only in or among countries not thus excluded. In\r\nsuch case, this License incorporates the limitation as if written in the body\r\nof this License.\r\n\r\n  13. The Free Software Foundation may publish revised and/or new versions of\r\nthe Library General Public License from time to time. Such new versions will\r\nbe similar in spirit to the present version, but may differ in detail to\r\naddress new problems or concerns.\r\n\r\nEach version is given a distinguishing version number. If the Library\r\nspecifies a version number of this License which applies to it and \"any later\r\nversion\", you have the option of following the terms and conditions either of\r\nthat version or of any later version published by the Free Software\r\nFoundation. If the Library does not specify a license version number, you may\r\nchoose any version ever published by the Free Software Foundation.\r\n\r\n  14. If you wish to incorporate parts of the Library into other free programs\r\nwhose distribution conditions are incompatible with these, write to the author\r\nto ask for permission. For software which is copyrighted by the Free Software\r\nFoundation, write to the Free Software Foundation; we sometimes make\r\nexceptions for this. Our decision will be guided by the two goals of\r\npreserving the free status of all derivatives of our free software and of\r\npromoting the sharing and reuse of software generally.\r\n\r\n                NO WARRANTY\r\n\r\n  15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR\r\nTHE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE\r\nSTATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE\r\nLIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\r\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\r\nFITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND\r\nPERFORMANCE OF THE LIBRARY IS WITH YOU. SHOULD THE LIBRARY PROVE DEFECTIVE,\r\nYOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\r\n\r\n  16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\r\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\r\nREDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\r\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\r\nOUT OF THE USE OR INABILITY TO USE THE LIBRARY (INCLUDING BUT NOT LIMITED TO\r\nLOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR\r\nTHIRD PARTIES OR A FAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE),\r\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\r\nDAMAGES.\r\n\r\n             END OF TERMS AND CONDITIONS\r\n\r\n-------------------\r\n\r\nncurses:\r\nCopyright (c) 1998-2005,2006 Free Software Foundation, Inc.\r\n\r\nPermission is hereby granted, free of charge, to any person obtaining a copy\r\nof this software and associated documentation files (the \"Software\"), to deal\r\nin the Software without restriction, including without limitation the rights\r\nto use, copy, modify, merge, publish, distribute, distribute with\r\nmodifications, sublicense, and/or sell copies of the Software, and to permit\r\npersons to whom the Software is furnished to do so, subject to the following\r\nconditions:\r\n\r\nThe above copyright notice and this permission notice shall be included in all\r\ncopies or substantial portions of the Software.\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\nABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\r\nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR\r\nIN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\r\n\r\nExcept as contained in this notice, the name(s) of the above copyright holders\r\nshall not be used in advertising or otherwise to promote the sale, use or\r\nother dealings in this Software without prior written authorization.\r\n\r\n-------------------\r\n\r\nOpenSSL:\r\nOpenSSL License\r\nCopyright (c) 1998-2011 The OpenSSL Project.  All rights reserved.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n\r\n1. Redistributions of source code must retain the above copyright notice, this\r\nlist of conditions and the following disclaimer. \r\n\r\n2. Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n\r\n3. All advertising materials mentioning features or use of this software must\r\ndisplay the following acknowledgment: \"This product includes software\r\ndeveloped by the OpenSSL Project for use in the OpenSSL Toolkit.\r\n(http://www.openssl.org/)\"\r\n\r\n4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to\r\nendorse or promote products derived from this software without prior written\r\npermission. For written permission, please contact openssl-core@openssl.org.\r\n\r\n5. Products derived from this software may not be called \"OpenSSL\" nor may\r\n\"OpenSSL\" appear in their names without prior written permission of the\r\nOpenSSL Project.\r\n\r\n6. Redistributions of any form whatsoever must retain the following\r\nacknowledgment: \"This product includes software developed by the OpenSSL\r\nProject for use in the OpenSSL Toolkit (http://www.openssl.org/)\"\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY EXPRESSED\r\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\r\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO\r\nEVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\r\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\r\nBUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\r\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY\r\nOF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\r\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\r\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\nThis product includes cryptographic software written by Eric Young\r\n(eay@cryptsoft.com).  This product includes software written by Tim Hudson\r\n(tjh@cryptsoft.com).\r\n\r\nOriginal SSLeay License\r\nCopyright (C) 1995-1998 Eric Young (eay@cryptsoft.com) All rights reserved.\r\n\r\nThis package is an SSL implementation written by Eric Young\r\n(eay@cryptsoft.com). The implementation was written so as to conform with\r\nNetscapes SSL.\r\n\r\nThis library is free for commercial and non-commercial use as long as the\r\nfollowing conditions are aheared to.  The following conditions apply to all\r\ncode found in this distribution, be it the RC4, RSA, lhash, DES, etc., code;\r\nnot just the SSL code.  The SSL documentation included with this distribution\r\nis covered by the same copyright terms except that the holder is Tim Hudson\r\n(tjh@cryptsoft.com).\r\n\r\nCopyright remains Eric Young's, and as such any Copyright notices in the code\r\nare not to be removed. If this package is used in a product, Eric Young should\r\nbe given attribution as the author of the parts of the library used. This can\r\nbe in the form of a textual message at program startup or in documentation\r\n(online or textual) provided with the package.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n1. Redistributions of source code must retain the copyright notice, this list\r\nof conditions and the following disclaimer.\r\n2. Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n3. All advertising materials mentioning features or use of this software must\r\ndisplay the following acknowledgement: \"This product includes cryptographic\r\nsoftware written by Eric Young (eay@cryptsoft.com)\" The word 'cryptographic'\r\ncan be left out if the rouines from the library being used are not\r\ncryptographic related :-).\r\n4. If you include any Windows specific code (or a derivative thereof) from the\r\napps directory (application code) you must include an acknowledgement: \"This\r\nproduct includes software written by Tim Hudson (tjh@cryptsoft.com)\"\r\n\r\nTHIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND ANY EXPRESS OR IMPLIED\r\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\r\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO\r\nEVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\r\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\r\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\r\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\r\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\r\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\r\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\nThe licence and distribution terms for any publically available version or\r\nderivative of this code cannot be changed.  i.e. this code cannot simply be\r\ncopied and put under another distribution licence [including the GNU Public\r\nLicence.]\r\n\r\n-------------------\r\n\r\nzlib:\r\nAcknowledgments:\r\n  The deflate format used by zlib was defined by Phil Katz. The deflate and\r\nzlib specifications were written by L. Peter Deutsch. Thanks to all the people\r\nwho reported problems and suggested various improvements in zlib; they are too\r\nnumerous to cite here.\r\n\r\nCopyright notice:\r\n (C) 1995-2004 Jean-loup Gailly and Mark Adler\r\n\r\n  This software is provided 'as-is', without any express or implied warranty.\r\nIn no event will the authors be held liable for any damages arising from the\r\nuse of this software.\r\n\r\n  Permission is granted to anyone to use this software for any purpose,\r\nincluding commercial applications, and to alter it and redistribute it freely,\r\nsubject to the following restrictions:\r\n\r\n  1. The origin of this software must not be misrepresented; you must not\r\nclaim that you wrote the original software. If you use this software in a\r\nproduct, an acknowledgment in the product documentation would be appreciated\r\nbut is not required.\r\n  2. Altered source versions must be plainly marked as such, and must not be\r\nmisrepresented as being the original software.\r\n  3. This notice may not be removed or altered from any source distribution.\r\n\r\n  Jean-loup Gailly        Mark Adler\r\n  jloup@gzip.org          madler@alumni.caltech.edu\r\n\r\nIf you use the zlib library in a product, we would appreciate *not* receiving\r\nlengthy legal documents to sign. The sources are provided for free but without\r\nwarranty of any kind.  The library has been entirely written by Jean-loup\r\nGailly and Mark Adler; it does not include third-party code.\r\n\r\nIf you redistribute modified sources, we would appreciate that you include in\r\nthe file ChangeLog history information documenting your changes. Please read\r\nthe FAQ for more information on the distribution of modified source versions.\r\n\r\n-------------------\r\n\r\nIntel AESNI Sample Library:\r\n\r\nCopyright (c) 2010, Intel Corporation\r\nAll rights reserved.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions are met:\r\n\r\n* Redistributions of source code must retain the above copyright notice, this\r\nlist of conditions and the following disclaimer.\r\n* Redistributions in binary form must reproduce the above copyright notice,\r\nthis list of conditions and the following disclaimer in the documentation\r\nand/or other materials provided with the distribution.\r\n* Neither the name of Intel Corporation nor the names of its contributors may\r\nbe used to endorse or promote products derived from this software without\r\nspecific prior written permission.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\r\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\r\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\r\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\r\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\r\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\r\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\r\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\r\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\r\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\nIssue Date: Aug 6, 2010\r\n\r\n-------------------\r\n\r\nlibmincrypt:\r\n\r\n Copyright 2013 The Android Open Source Project\r\n\r\n Redistribution and use in source and binary forms, with or without\r\n modification, are permitted provided that the following conditions are met:\r\n     * Redistributions of source code must retain the above copyright\r\n       notice, this list of conditions and the following disclaimer.\r\n     * Redistributions in binary form must reproduce the above copyright\r\n       notice, this list of conditions and the following disclaimer in the\r\n       documentation and/or other materials provided with the distribution.\r\n     * Neither the name of Google Inc. nor the names of its contributors may\r\n       be used to endorse or promote products derived from this software\r\n       without specific prior written permission.\r\n\r\n THIS SOFTWARE IS PROVIDED BY Google Inc. ``AS IS'' AND ANY EXPRESS OR\r\n IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\r\n MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO\r\n EVENT SHALL Google Inc. BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\r\n SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\r\n PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\r\n OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\r\n WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\r\n OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\r\n ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\n-------------------\r\n\r\nNOTES WRITTEN BY SOFTETHER CORPORATION\r\n\r\nNote for users of non-Windows version of PacketiX VPN: The enumerated bundle\r\nof License Agreements above are copies of original License Agreements of each\r\nlibrary programs which PacketiX VPN uses. PacketiX VPN is not a delivered work\r\nfrom these libraries. PacketiX VPN is a separated work from the libraries, but\r\nit may call functions of the libraries (whether or not PacketiX VPN calls such\r\nfunctions are depended on the user's intention to link them or not on user's\r\nside computer). While some libraries indicate GPL or LGPL as a condition to\r\nre-distribute, PacketiX VPN is not license under GPL nor LGPL. Therefore, we\r\ntook special care not to make PacketiX VPN become delivered works of any GPL\r\nor LGPL libraries. In order to achieve that, both PacketiX VPN and GPL/LGPL\r\nlibraries are distributed with isolated forms (means that any program files of\r\nPacketiX VPN are not bound nor linked to any GPL/LGPL libraries). If a user of\r\nPacketiX VPN wants to link GPL/LGPL libraries by their own decisions,\r\noperations and responsibilities, he may do that on his computer. However, if a\r\ndelivered work under copyright law is created as a result of such an\r\noperation, such a delivered work must not re-distributed to other people,\r\nbecause it may violate GPL/LGPL libraries' conditions.\r\n\r\nNote for users of Windows version of PacketiX VPN: For technical reason, the\r\nabove texts are exactly same as a file which is also contained on the\r\nnon-Windows version of PacketiX VPN. Actually, the Windows version of PacketiX\r\nVPN has no relations to any GPL/LGPL libraries enumerated above.\r\n\r\nSoftEther Corporation provides source codes of some GPL/LGPL/other libraries\r\nlisted above on its web server. Anyone can download, use and re-distribute\r\nthem under individual licenses which are contained on each archive file,\r\navailable from the following URL:\r\nhttp://uploader.softether.co.jp/src/\r\n\r\n-------------------\r\n\r\nCopyright Notes and Acknowledgments for PacketiX VPN (Commercial Version):\r\n\r\nPacketiX VPN has some contributed codes from SoftEther VPN Project\r\n(http://www.softether.org/).\r\nThese contributed codes have been granted by contributors to be imported into\r\nthe PacketiX VPN source-tree without GPLv2 conditions.\r\n\r\nThe list of contributors for SoftEther VPN Project:\r\n\r\nhttps://github.com/SoftEtherVPN/SoftEtherVPN/blob/master/AUTHORS.TXT\r\n\r\n\r\nSoftEther Corporation, the distributor of PacketiX VPN, appreciates all\r\ncontributors for SoftEther VPN Project very much.\r\n\r\nSee also: http://www.softether.org/5-download/src/9.patch\r\n\r\n"
        },
        {
          "name": "WARNING.TXT",
          "type": "blob",
          "size": 39.70703125,
          "content": "THE IMPORTANT NOTICES ABOUT SOFTETHER VPN\r\n\r\nFUNCTIONS OF VPN COMMUNICATIONS EMBEDDED ON THIS SOFTWARE ARE VERY POWERFUL\r\nTHAN EVER. THIS STRONG VPN ABILITY WILL BRING YOU HUGE BENEFITS. HOWEVER, IF\r\nYOU MISUSE THIS SOFTWARE, IT MIGHT DAMAGE YOURSELF. IN ORDER TO AVOID SUCH\r\nRISKS, THIS DOCUMENT ACCOUNTS IMPORTANT NOTICES FOR CUSTOMERS WHO ARE WILLING\r\nTO USE THIS SOFTWARE. THE FOLLOWING INSTRUCTIONS ARE VERY IMPORTANT. READ AND\r\nUNDERSTAND IT CAREFULLY. ADDITIONALLY, IF YOU ARE PLANNING TO USE THE DYNAMIC\r\nDNS, THE NAT TRAVERSAL OR THE VPN AZURE FUNCTIONS, READ THE SECTION 3.5\r\nCAREFULLY. THESE FUNCTIONS ARE FREE SERVICES PROVIDED VIA THE INTERNET, ARE\r\nNOT GUARANTEED, AND ARE NOT INTENDED TO BE USED FOR BUSINESS OR COMMERCIAL\r\nUSE. DO NOT USE THESE SERVICES FOR YOUR BUSINESS OR COMMERCIAL USE.\r\n\r\n\r\n1. VPN Communication Protocols\r\n1.1. SoftEther VPN Protocol\r\nSoftEther VPN can perform VPN communication. Unlike traditional VPN protocols,\r\nSoftEther VPN has an implementation of the newly-designed \"SoftEther VPN\r\nProtocol (SE-VPN Protocol)\" . SE-VPN protocol encapsulates any Ethernet\r\npackets into a HTTPS (HTTP over SSL) connection. Therefore SE-VPN protocol can\r\ncommunicate beyond firewalls even if the firewall is configured to block\r\ntraditional VPN packets by network administrator. SE-VPN protocol is designed\r\nand implemented to comply TLS (RFC 5246) and HTTPS (RFC 2818). However, it\r\nsometimes have different behavior to RFCs. If you are a network administrator\r\nand want to block SE-VPN protocols on the firewall, you can adopt a\r\n\"white-list\" policy on the firewall to filter any TCP or UDP packets on the\r\nborder except explicitly allowed packets towards specific web sites and\r\nservers.\r\n\r\n1.2. NAT Traversal Function\r\nGenerally, if you use traditional VPN systems you have to request a network\r\nadministrator to make the NAT or firewall to \"open\" or \"relay\" specific TCP or\r\nUDP ports. However, there are demands somehow to eliminate such working costs\r\non network administrators. In order to satisfy such demands, SoftEther VPN has\r\nthe newly-implemented \"NAT Traversal\" function. NAT Traversal is enabled by\r\ndefault. A SoftEther VPN Server running on the computer behind NAT or firewall\r\ncan accept VPN connections from the Internet, without any special\r\nconfigurations on firewalls or NATs. If you want to disable the NAT Traversal\r\nfunction, modify the \"DisableNatTraversal\" to \"true\" on the configuration file\r\nof SoftEther VPN Server. In order to disable it on the client-side, append\r\n\"/tcp\" suffix on the destination hostname.\r\n\r\n1.3. Dynamic DNS Function\r\nTraditional legacy VPN system requires a static global IP address on the VPN\r\nserver. In consideration of shortage of global IP addresses, SoftEther\r\nCorporation implements the \"Dynamic DNS Function\" on SoftEther VPN Server.\r\nDynamic DNS is enabled by default. Dynamic DNS function notify the current\r\nglobal IP address of the PC to the Dynamic DNS Servers which are operated by\r\nSoftEther Corporation. A globally-unique hostname (FQDN) such as\r\n\"abc.softether.net\" ( \"abc\" varies as unique per a user) will be assigned on\r\nthe VPN Server. If you tell this unique hostname to a VPN user, the user can\r\nspecify it as the destination VPN Sever hostname on the VPN Client and will be\r\nable to connect the VPN Server. No IP addresses are required to know\r\nbeforehand. If the IP address of the VPN Server varies, the registered IP\r\naddress related to the hostname of Dynamic DNS service will be changed\r\nautomatically. By this mechanism, no longer need a static global IP address\r\nwhich costs monthly to ISPs. You can use consumer-level inexpensive Internet\r\nconnection with dynamic IP address in order to operate an enterprise-level VPN\r\nsystem. If you want to disable Dynamic DNS, specify \"true\" on the \"Disabled\"\r\nitems of the \"DDnsClient\" directive on the SoftEther VPN Server configuration\r\nfile. * Note for residents in People's Republic of China: If your VPN Server\r\nis running on the People's Republic of China, the DNS suffix will be replaced\r\nto \"sedns.cn\" domain. The \"sedns.cn\" domain is the service possessed and\r\noperated by \"Beijing Daiyuu SoftEther Technology Co., Ltd\" which is a\r\nChinese-local enterprise.\r\n\r\n1.4. VPN over ICMP / VPN over DNS functions\r\nIf you want to make a VPN connection between SoftEther VPN Client / Bridge and\r\nSoftEther VPN Server, but if TCP and UDP packets are prohibited by the\r\nfirewall, then you can encapsulates payloads into \"ICMP\" (as known as Ping) or\r\n\"DNS\" packets. This function can realize a VPN connection by using ICMP or DNS\r\neven if the firewall or router blocks every TCP or UDP connections. VPN over\r\nICMP / VPN over DNS functions are designed to comply standard ICMP and DNS\r\nspecifications as possible, however it sometimes has a behavior not to fully\r\ncomply them. Therefore, few poor-quality routers may be caused a\r\nmemory-overflow or something troubles when a lot of ICMP or DNS packets are\r\npassed, and such routers sometimes freezes or reboots. It might affects other\r\nusers on the same network. To avoid such risks, append the suffix \"/tcp\" on\r\nthe destination hostname which is specified on the VPN-client side to disable\r\nVPN over ICMP / DNS functions.\r\n\r\n1.5. VPN Azure Cloud Service\r\nIf your SoftEther VPN Server is placed behind the NAT or firwall, and by some\r\nreason you cannot use NAT Traversal function, Dynamic DNS function or VPN over\r\nICMP/DNS function, you can use VPN Azure Clouse Service. SoftEther Corporation\r\noperates VPN Azure Cloud on Internet. After the VPN Server makes a connection\r\nto the VPN Azure Cloud, the hostname \"abc.vpnazure.net\" ( \"abc\" is a unique\r\nhostname) can be specified to connect to the VPN Server via the VPN Azure\r\nCloud. Practically, such a hostname is pointing a global IP address of one of\r\ncloud servers which are operated by SoftEther Corporation. If A VPN Client\r\nconnects to such a VPN Azure host, then the VPN Azure host will relay all\r\ntraffics between the VPN Client and the VPN Server. VPN Azure is disabled by\r\ndefault. You can activate it easily by using VPN Server Configuration Tool.\r\n\r\n1.6. UDP Acceleration\r\nSoftEther VPN has the UDP Acceleration Function. If a VPN consists of two\r\nsites detects that UDP channel can be established, UDP will be automatically\r\nused. By this function, throughput of UDP increases. If direct UDP channel can\r\nbe established, direct UDP packets will be used. However, if there is\r\nsomething obstacles such as firewalls or NATs, the \"UDP Hole Punching\"\r\ntechnology will be used, instead. The \"UDP Hole Punching\" uses the cloud\r\nservers which SoftEther Corporation operates on Internet. UDP Acceleration can\r\nbe disabled anytime by setting up so on the VPN-client side.\r\n\r\n\r\n2. VPN Software\r\nThe notes in this section are not specific to SoftEther VPN or VPN Gate, but\r\napply to general system software. SoftEther VPN Client, SoftEther VPN Server,\r\nSoftEther VPN Bridge, and VPN Gate Relay Service will be installed on your\r\ncomputer as system services. System services always run in the background.\r\nSystem services usually do not appear on the computer display. Then your\r\ncomputer system is booted, system services automatically start in the\r\nbackground even before you or other users log in. To check whether\r\nPacketiX-related system service is running, check the process list or the\r\nbackground service list of your OS (called as \"Services\" in Windows, or\r\n\"Daemons\" in UNIX.) You can activate, deactivate, start, or stop system\r\nservices using the functions of the OS anytime. PacketiX-related GUI tools for\r\nmanaging system services communicate with these system services. After you\r\nterminate these management GUI tools, PacketiX-related system services will\r\ncontinue to run in the background. System services consume CPU time, computer\r\npower, memory and disk space. Because system services consume power, your\r\nelectricity charges and amount of thermal of your computer increase as result.\r\nIn addition, there is a possibility that the mechanical parts of the life of\r\nyour computer is reduced.\r\n\r\n2.1. SoftEther VPN Client\r\nIf you use SoftEther VPN Client on Windows, the Virtual Network Adapter device\r\ndriver will be installed on Windows. The Virtual Network Adapter is\r\nimplemented as a kernel-mode driver for Windows. The driver is\r\ndigitally-signed by a certificate issued by VeriSign, Inc. and also sub-signed\r\nby Symantec Corporation. A message to ask you want to sure install the driver\r\nmight be popped up on the screen. SoftEther VPN Client may response the\r\nmessage if possible. SoftEther VPN Client also optimizes the configuration of\r\nMMCSS (Multimedia Class Scheduler Service) on Windows. You can undo the\r\noptimizations of MMCSS afterwards.\r\n\r\n2.2. SoftEther VPN Server / Bridge\r\nIf you use SoftEther VPN Server / Bridge on Windows with \"Local Bridge\"\r\nfunctions, you have to install the low-level Ethernet packet processing driver\r\non the computer. The driver is digitally-signed by a certificate issued by\r\nVeriSign, Inc. and also sub-signed by Symantec Corporation. SoftEther VPN\r\nServer / Bridge may disable the TCP/IP offloading features on the physical\r\nnetwork adapter for Local Bridge function. In Windows Vista / 2008 or greater\r\nversion, VPN Server may inject a packet-filter driver which complies Windows\r\nFilter Platform (WPF) specification into the kernel in order to provide IPsec\r\nfunction. The packet-filter driver will be loaded available only if IPsec\r\nfunction is enabled. Once you enables IPsec function of SoftEther VPN Server,\r\nthe built-in IPsec function of Windows will be disabled. After you disabled\r\nIPsec function of SoftEther VPN Server, then the built-in IPsec function of\r\nWindows will revive. In order to provide the Local Bridge function, SoftEther\r\nVPN Server / Bridge disables the TCP/IP offloading function on the operating\r\nsystem.\r\n\r\n2.3. User-mode Installation\r\nYou can install SoftEther VPN Server and SoftEther VPN Bridge as \"User-mode\"\r\non Windows. In other words, even if you don't have Windows system\r\nadministrator's privileges, you can install SoftEther VPN as a normal user.\r\nUser-mode install will disable a few functions, however other most functions\r\nwork well. Therefore, for example, an employee can install SoftEther VPN\r\nServer on the computer in the office network, and he will be able to connect\r\nto the server from his home. In order to realize such a system by user-self,\r\nno system administrative privileges are required in the view-point of\r\ntechnical. However, breaking rules of the company to install software on the\r\ncomputer without authority might be regarded as an unfavorable behavior. If\r\nyou are an employee and belong to the company, and the company-policy\r\nprohibits installing software or making communications towards Internet\r\nwithout permission, you have to obtain a permission from the network\r\nadministrator or the executive officer of your company in advance to install\r\nSoftEther VPN. If you install VPN Server / Bridge as User-mode, an icon will\r\nbe appeared on the Windows task-tray. If you feel that the icon disturbs you,\r\nyou can hide it by your operation. However, you must not exploit this hiding\r\nfunction to install VPN Server on other person's computer as a spyware. Such\r\nbehavior might be an offence against the criminal law.\r\n\r\n2.4. Keep Alive Function\r\nSoftEther VPN Server and SoftEther VPN Bridge has Keep Alive Function by\r\ndefault. The purpose of this function is to sustain the Internet line active.\r\nThe function transmits UDP packets with a random-byte-array-payload\r\nperiodically. This function is useful to avoid automatic disconnection on\r\nmobile or dial-up connections. You can disable Keep Alive Function anytime.\r\n\r\n2.5. Uninstallation\r\nThe uninstallation process of SoftEther VPN software will delete all program\r\nfiles. However, non-program files (such as files and data which are generated\r\nby running of programs) ) will not be deleted. For technical reason, the exe\r\nand resource files of uninstaller might remain. Such remaining files never\r\naffects to use the computer, however you can delete it manually. Kernel-mode\r\ndrivers might not be deleted, however such drivers will not be loaded after\r\nthe next boot of Windows. You can use \"sc\" command of Windows to delete\r\nkernel-mode drivers manually.\r\n\r\n2.6. Security\r\nYou should set the administrator's password on SoftEther VPN Server / Bridge\r\nafter installation. If you neglect to do it, another person can access to\r\nSoftEther VPN Server / Bridge and can set the password without your\r\npermission. This caution might be also applied on SoftEther VPN Client for\r\nLinux.\r\n\r\n2.7. Automatic Update Notification\r\nSoftEther VPN software for Windows has an automatic update notification\r\nfunction. It accesses to the SoftEther Update server periodically to check\r\nwhether or not the latest version of software is released. If the latest\r\nversion is released, the notification message will be popped up on the screen.\r\nIn order to achieve this purpose, the version, language settings, the unique\r\nidentifier, the IP address of your computer and the hostname of VPN Server\r\nwhich is connected to will be sent to the SoftEther Update server. No personal\r\ninformation will be sent. Automatic Update Notification is enabled by default,\r\nhowever you can disable it on the configuration screen. The setting whether\r\nturned on or turned off will be saved individually corresponding to each\r\ndestination VPN server, by VPN Server Manager.\r\n\r\n2.8. Virtual NAT Function\r\nA Virtual Hub on SoftEther VPN Server / Bridge has \"Virtual NAT Function\" .\r\nVirtual NAT Function can share a single IP address on the physical network by\r\nmultiple private IP address of VPN Clients. There are two operation mode of\r\nVirtual NAT: User-mode and Kernel-mode. In the user-mode operation, Virtual\r\nNAT shares an IP address which is assigned on the host operating system.\r\nUnlike user-mode, the kernel-mode operation attempts to find DHCP servers on\r\nthe physical network. If there are two or more physical networks, a DHCP\r\nserver will be sought automatically for each segments serially. If a DHCP\r\nserver found, and an IP address is acquired, the IP address will be used by\r\nthe Virtual NAT. In this case, an IP entry as a DHCP client will be registered\r\non the IP pool of the physical DHCP Server. The physical default gateway and\r\nthe DNS server will be used by the Virtual NAT in order to communicate with\r\nhosts in Internet. In kernel-mode operation, a Virtual Hub has a virtual MAC\r\naddress which is operating on the physical Ethernet segment. In order to check\r\nthe connectivity to Internet, SoftEther VPN periodically sends DNS query\r\npacket to resolve the IP address of host \"www.yahoo.com\" or \"www.baidu.com\" ,\r\nand attempts to connect to the TCP port 80 of such a resulted IP address for\r\nconnectivity check.\r\n\r\n2.9. Unattended Installation of Kernel-mode Components\r\nWhen SoftEther VPN will detect a necessity to install the kernel-mode\r\ncomponents on Windows, a confirmation message will be appeared by Windows\r\nsystem. In this occasion, SoftEther VPN software will switch to the Unattended\r\nInstallation mode in order to respond \"Yes\" to Windows. This is a solution to\r\nprevent dead-locks when a remote-administration is performed from remote\r\nplace.\r\n\r\n2.10. Windows Firewall\r\nSoftEther VPN software will register itself as a safe-program. Such an entry\r\nwill be remain after the uninstallation. You can remove it manually from the\r\nControl Panel of Windows.\r\n\r\n\r\n3. Internet Services\r\n3.1. Internet Services which are provided by SoftEther Corporation\r\nSoftEther Corporation provides Dynamic DNS, NAT Traversal and VPN Azure server\r\nservices on the Internet. These services are free of charge. Customers can\r\naccess to the services by using SoftEther VPN software, via Internet. These\r\nservice will be planned to be available from Open-Source version of \"SoftEther\r\nVPN\" which will be released in the future.\r\n\r\n3.2. Sent Information and Privacy Protection\r\nSoftEther VPN software may send an IP address, hostname, the version of VPN\r\nsoftware on the customer's computer to the cloud service operated by SoftEther\r\nCorporation, in order to use the above services. These sending of information\r\nare minimal necessary to use the services. No personal information will be\r\nsent. SoftEther Corporation records log files of the cloud service servers for\r\n90 days at least with the received information. Such logs will be used for\r\ntroubleshooting and other legitimate activities. SoftEther Corporation may\r\nprovide logs to a public servant of Japanese government who are belonging to\r\ncourts, police stations and the prosecutor's office, in order to comply such\r\nauthorities' order. (Every Japanese public servants are liable by law to keep\r\nthe information close.) Moreover, the IP addresses or other information will\r\nbe processed statistically and provided to the public, not to expose the each\r\nconcrete IP address, in order to release the release of research activities.\r\n\r\n3.3. Communication Data via VPN Azure Service\r\nRegardless of the above 3.2 rule, if the customer sends or receives VPN\r\npackets using VPN Azure Cloud Service, the actual payloads will stored and\r\nforwarded via the volatile memory of the servers for very short period. Such a\r\nbehavior is naturally needed to provide the \"VPN relay service\" . No payloads\r\nwill be recorded on \"fixed\" storages such as hard-drives. However, the\r\n\"Wiretapping for Criminals Procedures Act\" (The 137th legislation ruled on\r\nAugust 18, 1999 in Japan) requires telecommunication companies to allow the\r\nJapanese government authority to conduct a wire-tapping on the line. VPN Azure\r\nServers which are physically placed on Japan are subjects of this law.\r\n\r\n3.4. Comply to Japanese Telecommunication Laws\r\nSoftEther Corporation complies with Japanese Telecommunication Laws as\r\nnecessary to provide online services via Internet.\r\n\r\n3.5. Free and Academic Experiment Services\r\nSoftEther provides Dynamic DNS, NAT Traversal and VPN Azure as academic\r\nexperiment services. Therefore, there services can be used for free of charge.\r\nThese services are not parts of \"SoftEther VPN Software Products\" . These\r\nservices are provided without any warranty. The services may be suspended or\r\ndiscontinued by technical or operational matters. In such occasions, users\r\nwill not be able to use the services. A user have to understand such risks,\r\nand to acknowledge that such risks are borne by a user-self. SoftEther will\r\nnever be liable to results or damages of use or unable-to-use of the service.\r\nEven if the user has already paid the license-fee of the commercial version of\r\nSoftEther VPN, such paid fees don't include any fees of these services.\r\nTherefore, if the online services will stop or be discontinued, no refunds or\r\nrecoveries of damages will be provided by SoftEther Corporation.\r\n\r\n3.6. DNS Proxy Cloud Servers\r\nIn some regions, when a user uses Internet, a DNS query sometimes broken or\r\nlost when it is passing through the ISP line. If SoftEther VPN Server, Client\r\nor Bridge detects a possibility that the accessing to the actual VPN server\r\nmight be unstable, then DNS queries will be also transferred to the DNS proxy\r\ncloud servers which are operated by SoftEther Corporation. A DNS proxy cloud\r\nserver will respond DNS queries with answering correct a IP address.\r\n\r\n\r\n4. General Cautions\r\n4.1. Needs an Approval from Network Administrator\r\nSoftEther VPN has powerful functions which don't require special settings by\r\nnetwork administrators. For example, you need not to ask the administrator to\r\nconfigure the existing firewall in order to \"open\" a TCP/UDP port. Such\r\ncharacteristic features are for the purpose to eliminate working times and\r\ncosts of network administrators, and avoid misconfiguration-risks around the\r\ntasks to open specific exception ports on the firewall. However, any employees\r\nbelong to the company have to obtain an approval from the network\r\nadministrator before installs SoftEther VPN. If your network administrator\r\nneglects to provide such an approval, you can consider to take an approval\r\nfrom an upper authority. (For example, executive officer of the company.) If\r\nyou use SoftEther VPN without any approvals from the authority of your\r\ncompany, you might have disadvantage. SoftEther Corporation will be never\r\nliable for results or damages of using SoftEther VPN.\r\n\r\n4.2. Observe Laws of Your Country\r\nIf your country's law prohibits the use of encryption, you have to disable the\r\nencryption function of SoftEther VPN by yourself. Similarly, in some countries\r\nor regions, some functions of SoftEther VPN might be prohibited to use by\r\nlaws. Other countries' laws are none of SoftEther Corporation's concern\r\nbecause SoftEther Corporation is an enterprise which is located and registered\r\nin Japan physically. For example, there might be a risk that a part of\r\nSoftEther VPN conflicts an existing patent which is valid only on the specific\r\nregion. SoftEther Corporation has no interests in such specific region outside\r\nJapan's territory. Therefore, if you want to use SoftEther VPN in regions\r\noutside Japan, you have to be careful not to violate third-person's rights.\r\nYou have to verify the legitimacy of the use of SoftEther VPN in the specific\r\nregion before you actually use it in such region. By nature, there are almost\r\n200 countries in the World, and each country's law is different each other. It\r\nis practically impossible to verify every countries' laws and regulations and\r\nmake the software comply with all countries' laws in advance to release the\r\nsoftware. Therefore SoftEther Corporation has verified the legitimacy of\r\nSoftEther VPN against the laws and regulations of only Japan. If a user uses\r\nSoftEther VPN in a specific country, and damaged by public servants of the\r\ngovernment authority, SoftEther Corporation will never be liable to recover or\r\ncompensate such damages or criminal responsibilities.\r\n\r\n\r\n5. VPN Gate Academic Experiment Project\r\n(This chapter applies only on SoftEther VPN software package which contains\r\nthe extension plug-in for VPN Gate Academic Experiment Project.)\r\n5.1. About VPN Gate Academic Experiment Project\r\nVPN Gate Academic Experiment Project is an online service operated for just\r\nthe academic research purpose at the graduate school of University of Tsukuba,\r\nJapan. The purpose of this research is to expend our knowledge about the\r\n\"Global Distributed Public VPN Relay Server\" (GDPVRS) technology. For details,\r\nplease visit http://www.vpngate.net/.\r\n\r\n5.2. About VPN Gate Service\r\nSoftEther VPN Server and SoftEther VPN Client may contain \"VPN Gate Service\"\r\nprogram. However, VPN Gate Service is disabled by default.\r\nVPN Gate Service should be activated and enabled by the voluntary intention of\r\nthe owner of the computer which SoftEther VPN Server or SoftEther VPN Client\r\nis installed on. After you activate VPN Gate Service, the computer will be\r\nstart to serve as a part of the Global Distributed Public VPN Relay Servers.\r\nThe IP address, hostname and related information of the computer will be sent\r\nand registered to the directory server of VPN Gate Academic Experiment\r\nProject, and they will be published and disclosed to the public. This\r\nmechanism will allow any VPN Gate Client software's user to connect to the VPN\r\nGate Service running on your computer. While the VPN session between a VPN\r\nGate Client and your VPN Gate Service is established, the VPN Gate Client's\r\nuser can send/receive any IP packets towards the Internet via the VPN Gate\r\nService. The global IP address of the VPN Gate Service's hosing computer will\r\nbe used as the source IP address of such communications which a VPN Gate\r\nClient initiates.\r\nVPN Gate Service will send some information to the VPN Gate Academic\r\nExperiment Service Directory Server. The information includes the operator's\r\ninformation which described in section 5.5, logging settings, uptime,\r\noperating system version, type of protocol, port numbers, quality information,\r\nstatistical information, VPN Gate clients' log history data (includes dates,\r\nIP addresses, version numbers and IDs), log records of destination HTTP/HTTPS\r\nhostnames or IP addresses and port numbers of VPN Gate communications, and the\r\nversion of the software. These information may be exposed on the directory.\r\nVPN Gate Service also receives a key for encoding which is described on the\r\nchapter 5.9 from the directory server.\r\n\r\n5.3. Details of VPN Gate Service's Behavior\r\nIf you enable VPN Gate Service manually, which is disabled by default, the\r\n\"VPNGATE\" Virtual Hub will be created on the SoftEther VPN Server. If you are\r\nusing SoftEther VPN Client and attempt to active VPN Gate Service on it, an\r\nequivalent program to SoftEther VPN Server will be invoked on the same process\r\nof SoftEther VPN Client, and the \"VPNGATE\" Virtual Hub will be created. The\r\n\"VPNGATE\" Virtual Hub contains a user named \"VPN\" by default which permits\r\nanyone on the Internet to make a VPN connection to the Virtual Hub. Once a VPN\r\nClient connects to the \"VPNGATE\" Virtual Hub, any communication between the\r\nuser and the Internet will pass through the Virtual Hub, and\r\ntransmitted/received using the physical network interface on the computer\r\nwhich SoftEther VPN Server (or SoftEther VPN Client) is running on. This will\r\ncause the result that a destination host specified by the VPN Client will\r\nidentify that the source of the communication has initiated from the VPN Gate\r\nService's hosting computer's IP address. However, for safety, any packets\r\nwhich destinations are within 192.168.0.0/255.255.0.0, 172.16.0.0/255.240.0.0\r\nor 10.0.0.0/255.0.0.0 will be blocked by the \"VPNGATE\" Virtual Hub in order to\r\nprotect your local network. Any packets which destinations are within\r\n169.254.0.0/16, 224.0.0.0/4 or 100.64.0.0/10 will also be blocked for just in\r\ncase. These packet filters except DNS, ICMP and ARP packets. Therefore, if you\r\nrun VPN Gate Service on your corporate network or private network, it is safe\r\nbecause anonymous VPN Client users will not be permitted to access such\r\nprivate networks. VPN Gate Service also serves as relay for accessing to the\r\nVPN Gate Directory Server.\r\nIn order to make VPN Gate Service familiar with firewalls and NATs, it opens\r\nan UDP port by using the NAT Traversal function which is described on the\r\nsection 1.2. It also opens and listens on some TCP ports, and some TCP and UDP\r\nports will be specified as the target port of Universal Plug and Play (UPnP)\r\nPort Transfer entries which are requested to your local routers. UPnP request\r\npackets will be sent periodically. Some routers keep such an opened TCP/UDP\r\nport permanently on the device. If you wish to close them, do it manually.\r\nVPN Gate Service also provides the mirror-site function for www.vpngate.net.\r\nThis is a mechanism that a copy of the latest contents from www.vpngate.net\r\nwill be hosted by the mirror-site tiny HTTP server which is running on the VPN\r\nGate Service program. It will register itself on the mirror-sites list in\r\nwww.vpngate.net. However, it never relays any other communications which are\r\nnot towards www.vpngate.net.\r\n\r\n5.4. Communication between Internet via VPN Gate Service\r\nVPN Gate Service provides a routing between users and the Internet, by using\r\nthe Virtual NAT Function which is described on the section 2.8. VPN Gate\r\nService sends polling Ping packets to the server which is located on\r\nUniversity of Tsukuba, and the Google Public DNS Server which is identified as\r\n8.8.8.8, in order to check the latest quality of your Internet line. VPN Gate\r\nService also sends and receives a lot of random packets to/from the Speed Test\r\nServer on University of Tsukuba. These quality data will be reported to VPN\r\nGate Directory Server, automatically and periodically. The result will be\r\nsaved and disclosed to the public. These periodical polling communication are\r\nadjusted not to occupy the Internet line, however in some circumstances they\r\nmight occupy the line.\r\n\r\n5.5. Operator's Information of VPN Gate Service\r\nIf you activate VPN Gate Service on your computer, the computer will be a part\r\nof the Global Distributed Public VPN Relay Servers. Therefore, the Operator's\r\nadministrative information of your VPN Gate Service should be reported and\r\nregistered on the VPN Gate Service Directory. Operator's information contains\r\nthe name of the operator and the abuse-reporting contact e-mail address. These\r\ninformation can be inputted on the screen if the VPN Gate configuration.\r\nInputted information will be transmitted to the VPN Gate Directory Server,\r\nstored and disclosed to the public. So you have to be careful to input\r\ninformation. By the way, until you specify something as the operator's\r\ninformation, the computer's hostname will be used automatically as the field\r\nof the name of the operator, by appending the \"'s owner\" string after the\r\nhostname.\r\n\r\n5.6. Observe Laws to Operate VPN Gate Service\r\nIn some countries or regions, a user who is planning to activate and operate\r\nVPN Gate Service, he are mandated to obtain a license or register a service\r\nfrom/to the government. If your region has such a regulation, you must fulfill\r\nmandated process before activating VPN Gate Service in advance. Neither the\r\ndevelopers nor operators of the VPN Gate Academic Experiment Project will be\r\nliable for legal/criminal responsibilities or damages which are occurred from\r\nfailure to comply your local laws.\r\n\r\n5.7. Protect Privacy of Communication\r\nMost of countries have a law which requires communication service's operators,\r\nincluding VPN Gate Service operators, to protect the privacy of communication\r\nof third-persons. When you operate VPN Gate Service, you must always protect\r\nuser's privacy.\r\n\r\n5.8. Packet Logs\r\nThe packet logging function is implemented on VPN Gate Service. It records\r\nessential headers of major TCP/IP packets which are transmitted via the\r\nVirtual Hub. This function will be helpful to investigate the \"original IP\r\naddress\" of the initiator of communication who was a connected user of your\r\nVPN Gate Service, by checking the packet logs and the connection logs. The\r\npacket logs are recorded only for such legitimate investigates purpose. Do not\r\npeek nor leak packet logs except the rightful purpose. Such act will be\r\nviolate the section 5.7.\r\n\r\n5.9. Packet Logs Automatic Archiving and Encoding Function\r\nThe VPN Gate Academic Experiment Service is operated and running under the\r\nJapanese constitution and laws. The Japanese constitution laws demand strictly\r\nprotection over the privacy of communication. Because this service is under\r\nJapanese rules, the program of VPN Gate Service implements this \"Automatic Log\r\nFile Encoding\" protection mechanism, and enabled by default.\r\nThe VPN Gate Service is currently configured to encode packet log files which\r\nhas passed two or more weeks automatically, by default. In order to protect\r\nprivacy of communication, if a packet log file is once encoded, even the\r\nadministrator of the local computer cannot censor the packet log file. This\r\nmechanism protects privacy of end-users of VPN Gate Service.\r\nYou can change the VPN Gate Service setting to disable this automatic encoding\r\nfunction. Then packet log files will never be encoded even after two weeks\r\npassed. In such a configuration, all packet logs will remain as plain-text on\r\nthe disk. Therefore you have to take care not to violate user's privacy.\r\nIf you are liable to decode an encoded packet log files (for example: a VPN\r\nGate Service's user illegally abused your VPN Gate Service and you have to\r\ndecode the packet logs in order to comply the laws), contact the administrator\r\nof the VPN Gate Academic Experiment Service at Graduate School of University\r\nof Tsukuba, Japan. You can find the contact address at\r\nhttp://www.vpngate.net/. The administrator of VPN Gate Service will respond to\r\ndecode the packet logs if there is an appropriate and legal request from court\r\nor other judicial authorities, according to laws.\r\nThe Packet Logs Automatic Archiving and Encoding Function may be disabled\r\naccording to technical or administrative reason.\r\n\r\n5.10. Caution if You Operate VPN Gate Service in the Japan's Territories\r\nWhen a user operates VPN Gate Service in the Japan's territories, such an act\r\nmay be regulated under the Japanese Telecommunication Laws if the operation is\r\na subject to the law. However, in such a circumstance, according to the\r\n\"Japanese Telecommunication Business Compete Manual [supplemental version]\" ,\r\nnon- profitable operations of communications are not identified as a\r\n\"telecommunication business\" . So usual operators of VPN Gate Service are not\r\nsubjects to \"telecommunication business operators\" , and not be mandated to\r\nregister to the government.\r\n\r\n5.11. VPN Gate Client\r\nIf SoftEther VPN Client contains the VPN Gate Client plug-in, you can use it\r\nto obtain the list of current operating VPN Gate Service servers in the\r\nInternet, and make a VPN connection to a specific server on the list.\r\nVPN Gate Client always keeps the latest list of the VPN Gate Services\r\nperiodically. Be careful if you are using a pay-per-use Internet line.\r\nWhen you start the VPN Gate Client software, the screen which asks you\r\nactivate or not VPN Gate Service will be appeared. For details of VPN Gate\r\nService, read the above sections.\r\n\r\n5.12. Caution before Joining or Exploiting VPN Gate Academic Experiment\r\nProject\r\nThe VPN Gate Academic Experiment Service is operated as a research project at\r\nthe graduate school on University of Tsukuba, Japan. The service is governed\r\nunder the Japanese laws. Other countries' laws are none of our concerns nor\r\nresponsibilities.\r\nBy nature, there are almost 200 countries in the World, with different laws.\r\nIt is impossible to verify every countries' laws and regulations and make the\r\nsoftware comply with all countries' laws in advance to release the software.\r\nIf a user uses VPN Gate service in a specific country, and damaged by public\r\nservants of the authority, the developer of either the service or software\r\nwill never be liable to recover or compensate such damages or criminal\r\nresponsibilities.\r\nBy using this software and service, the user must observe all concerned laws\r\nand rules with user's own responsibility. The user will be completely liable\r\nto any damages and responsibilities which are results of using this software\r\nand service, regardless of either inside or outside of Japan's territory.\r\nIf you don't agree nor understand the above warnings, do not use any of VPN\r\nGate Academic Experiment Service functions.\r\nVPN Gate is a research project for just academic purpose only. VPN Gate was\r\ndeveloped as a plug-in for SoftEther VPN and UT-VPN. However, all parts of VPN\r\nGate were developed on this research project at University of Tsukuba. Any\r\nparts of VPN Gate are not developed by SoftEther Corporation. The VPN Gate\r\nResearch Project is not a subject to be led, operated, promoted nor guaranteed\r\nby SoftEther Corporation.\r\n\r\n5.13. The P2P Relay Function in the VPN Gate Client to strengthen the\r\ncapability of circumvention of censorship firewalls\r\nVPN Gate Clients, which are published since January 2015, include the P2P\r\nRelay Function. The P2P Relay Function is implemented in order to strengthen\r\nthe capability of circumvention of censorship firewalls. If the P2P Relay\r\nFunction in your VPN Gate Client is enabled, then the P2P Relay Function will\r\naccept the incoming VPN connections from the VPN Gate users, which are located\r\non mainly same regions around you, and will provide the relay function to the\r\nexternal remote VPN Gate Servers, which are hosted by third parties in the\r\nfree Internet environment. This P2P Relay Function never provides the shared\r\nNAT functions nor replaces the outgoing IP address of the VPN Gate users to\r\nyour IP addresses because this P2P Relay Function only provides the\r\n\"reflection service\" (hair-pin relaying), relaying from incoming VPN Gate\r\nusers to an external VPN Gate Server. In this situation, VPN tunnels via your\r\nP2P Relay Function will be finally terminated on the external VPN Gate Server,\r\nnot your VPN Gate Client. However, the VPN Gate Server as the final\r\ndestination will record your IP address as the source IP address of VPN\r\ntunnels which will be initiated by your P2P Relay Function. Additionally, user\r\npackets which are transmitted via your P2P Relay Function will be recorded on\r\nyour computer as packet logs as described on the section 5.8. After you\r\ninstalled the VPN Gate Client, and if the P2P Relay Function will be enabled\r\nautomatically, then all matters on the 5.2, 5.3, 5.4, 5.5, 5.6, 5.7, 5.8, 5.9,\r\n5.10, 5.11 and 5.12 sections will be applied to you and your computer, as same\r\nto the situation when you enabled the VPN Gate Service (the VPN Gate Server\r\nfunction). If your P2P Function is enabled, then your computer's IP address\r\nand the default operator's name which is described on the section 5.5 will be\r\nlisted on the VPN Gate Server List which is provided by the VPN Gate Project.\r\nYou can change these strings by editing the \"vpn_gate_relay.config\" file\r\nmanually. Note that you need to stop the VPN Client service before editing it.\r\nThe VPN Gate Client will automatically enable the P2P Relay Function on your\r\ncomputer if the VPN Gate Client detects that your computer might be located in\r\nregions where there are existing censorship firewalls. If you want to disable\r\nthe P2P Relay Function, you must set the \"DisableRelayServer\" flag to \"true\"\r\non the \"vpn_client.config\" file which is the configuration file of the VPN\r\nClient. Note that you need to stop the VPN Client service before editing it.\r\nThe VPN Gate Client does not recognize the particular regulation of your\r\ncountry or your region. The VPN Gate Client activates the P2P Relay Function\r\neven if your country or your region has the law to restrict running P2P relay\r\nfunctions. Therefore, in such a case, you must disable the P2P Relay Function\r\non the VPN Gate Client manually by setting the \"DisableRelayServer\" flag if\r\nyou reside in such a restricted area, in your own responsibility.\r\n\r\nSoftEther VPN and VPN Gate (where applicable) are provided, distributed and\r\noperated under the responsibility of SoftEther Corporation (Corporate Number:\r\n1050001016519, Tsukuba, Ibaraki, Japan). These projects were researched and\r\ndeveloped in collaboration with Tsukuba University, a national university in\r\nJapan.\r\n\r\nTHIS SOFTWARE IS DEVELOPED IN JAPAN, AND DISTRIBUTED FROM JAPAN, UNDER\r\nJAPANESE LAWS. YOU MUST AGREE IN ADVANCE TO USE, COPY, MODIFY, MERGE, PUBLISH,\r\nDISTRIBUTE, SUBLICENSE, AND/OR SELL COPIES OF THIS SOFTWARE, THAT ANY\r\nJURIDICAL DISPUTES WHICH ARE CONCERNED TO THIS SOFTWARE OR ITS CONTENTS,\r\nAGAINST US (SOFTETHER CORPORATION OR OTHER SUPPLIERS), OR ANY JURIDICAL\r\nDISPUTES AGAINST US WHICH ARE CAUSED BY ANY KIND OF USING, COPYING, MODIFYING,\r\nMERGING, PUBLISHING, DISTRIBUTING, SUBLICENSING, AND/OR SELLING COPIES OF THIS\r\nSOFTWARE SHALL BE REGARDED AS BE CONSTRUED AND CONTROLLED BY JAPANESE LAWS,\r\nAND YOU MUST FURTHER CONSENT TO EXCLUSIVE JURISDICTION AND VENUE IN THE COURTS\r\nSITTING IN TOKYO, JAPAN. YOU MUST WAIVE ALL DEFENSES OF LACK OF PERSONAL\r\nJURISDICTION AND FORUM NON CONVENIENS. PROCESS MAY BE SERVED ON EITHER PARTY\r\nIN THE MANNER AUTHORIZED BY APPLICABLE LAW OR COURT RULE.\r\n\r\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\r\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\r\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\r\nSUPPLIERS, PROVIDERS, OPERATORS, AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR\r\nANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT\r\nOR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE\r\nUSE OR OTHER DEALINGS IN THE SOFTWARE.\r\n\r\nIMPORTANT NOTE: USE OF THIS SOFTWARE AND SERVICE BY INDIVIDUALS TO WHOM THE\r\nCONSUMER CONTRACT ACT APPLIES IS NOT ALLOWED. THIS SOFTWARE IS INTENDED FOR\r\nPROFESSIONALS AND IS NOT DESIGNED FOR PURELY BUSINESS-UNRELATED CONSUMERS.\r\nTHIS SOFTWARE AND SERVICE MAY BE USED ONLY FOR BUSINESS, COMMERCIAL,\r\nNON-PROFIT, ORGANIZATIONAL OPERATIONS, RESEARCH AND DEVELOPMENT PURPOSES OR\r\nOTHER NON-CONSUMPTIVE PURPOSES. THIS SOFTWARE IS NOT INTENDED FOR USE BY\r\nCONSUMERS. THIS SOFTWARE MAY NOT BE USED BY ANY INDIVIDUAL TO WHOM THE\r\nCONSUMER RIGHTS PROTECTIONS IN THE CONSUMER CONTRACT ACT OF JAPAN OR\r\nEQUIVALENT LAWS OF OTHER COUNTRIES APPLY. IF AN INDIVIDUAL USES THE SOFTWARE,\r\nTHE USE OF THE SOFTWARE SHALL BE DEEMED TO BE FOR BUSINESS PURPOSES.\r\n\r\n"
        },
        {
          "name": "centos",
          "type": "tree",
          "content": null
        },
        {
          "name": "compat",
          "type": "blob",
          "size": 0.001953125,
          "content": "9\n"
        },
        {
          "name": "configure",
          "type": "blob",
          "size": 1.955078125,
          "content": "#!/bin/sh\n\necho '---------------------------------------------------------------------'\necho 'SoftEther VPN for Unix'\necho\necho 'Copyright (c) Daiyuu Nobori.'\necho 'Copyright (c) SoftEther VPN Project, University of Tsukuba, Japan.'\necho 'Copyright (c) SoftEther Corporation.'\necho 'Copyright (c) all contributors on SoftEther VPN project in GitHub.'\necho\necho 'License: The Apache License, Version 2.0'\necho\necho 'Read and understand README.TXT, LICENSE.TXT and WARNING.TXT before use.'\necho '---------------------------------------------------------------------'\necho\n\necho 'Welcome to the corner-cutting configure script !'\necho\n\nOS=\"\"\ncase \"`uname -s`\" in\nLinux)\n\tOS=\"linux\"\n\t;;\nFreeBSD)\n\tOS=\"freebsd\"\n\t;;\nSunOS)\n\tOS=\"solaris\"\n\t;;\nDarwin)\n\tOS=\"macos\"\n\t;;\nOpenBSD)\n\tOS=\"openbsd\"\n\t;;\n*)\n\techo 'Select your operating system below:'\n\techo ' 1: Linux'\n\techo ' 2: FreeBSD'\n\techo ' 3: Solaris'\n\techo ' 4: Mac OS X'\n\techo ' 5: OpenBSD'\n\techo\n\techo -n 'Which is your operating system (1 - 5) ? : '\n\tread TMP\n\techo\n\tif test \"$TMP\" = \"1\"\n\tthen\n\t\tOS=\"linux\"\n\tfi\n\tif test \"$TMP\" = \"2\"\n\tthen\n\t\tOS=\"freebsd\"\n\tfi\n\tif test \"$TMP\" = \"3\"\n\tthen\n\t\tOS=\"solaris\"\n\tfi\n\tif test \"$TMP\" = \"4\"\n\tthen\n\t\tOS=\"macos\"\n\tfi\n\tif test \"$TMP\" = \"5\"\n\tthen\n\t\tOS=\"openbsd\"\n\tfi\n\n\tif test \"$OS\" = \"\"\n\tthen\n\t\techo \"Wrong number.\"\n\t\texit 1\n\tfi\n\t;;\nesac\n\nNOBITS=\"\"\ncase \"`uname -m`\" in\naarch*|arm*|arm*)\n\tNOBITS=\"_nobits\"\n\t;;\nesac\n\nCPU=\"\"\ncase \"`uname -m`\" in\nx86_64|amd64|aarch64|arm64|armv8*|mips64|ppc64|sparc64|alpha|ia64)\n\tCPU=64bit\n\t;;\ni?86|x86pc|i86pc|armv4*|armv5*|armv6*|armv7*)\n\tCPU=32bit\n\t;;\n*)\n\techo 'Select your CPU bits below:'\n\techo ' 1: 32-bit'\n\techo ' 2: 64-bit'\n\techo\n\techo -n 'Which is the type of your CPU (1 - 2) ? : '\n\tread TMP\n\techo\n\tif test \"$TMP\" = \"1\"\n\tthen\n\t\tCPU=\"32bit\"\n\tfi\n\tif test \"$TMP\" = \"2\"\n\tthen\n\t\tCPU=\"64bit\"\n\tfi\n\n\tif test \"$CPU\" = \"\"\n\tthen\n\t\techo \"Wrong number.\"\n\t\texit 1\n\tfi\n\t;;\nesac\n\ncp src/makefiles/${OS}_${CPU}${NOBITS}.mak Makefile\n\necho \"The Makefile is generated. Run 'make' to build SoftEther VPN.\"\n"
        },
        {
          "name": "debian",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "systemd",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}