{
  "metadata": {
    "timestamp": 1736709971918,
    "page": 529,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "PureDarwin/PureDarwin",
      "stars": 2269,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.1201171875,
          "content": "#config\n\nroot = true\n\n[*]\ntrim_trailing_whitespace = true\ninsert_final_newline = true\nindent_style = space\nindent_size = 4\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 2.400390625,
          "content": "\n# Created by https://www.gitignore.io/api/macos,swift\n# Edit at https://www.gitignore.io/?templates=macos,swift\n\n### macOS ###\n# General\n.DS_Store\n.AppleDouble\n.LSOverride\n\n# Icon must end with two \\r\nIcon\n\n# Thumbnails\n._*\n\n# Files that might appear in the root of a volume\n.DocumentRevisions-V100\n.fseventsd\n.Spotlight-V100\n.TemporaryItems\n.Trashes\n.VolumeIcon.icns\n.com.apple.timemachine.donotpresent\n\n# Directories potentially created on remote AFP share\n.AppleDB\n.AppleDesktop\nNetwork Trash Folder\nTemporary Items\n.apdisk\n\n### Swift ###\n# Xcode\n#\n# gitignore contributors: remember to update Global/Xcode.gitignore, Objective-C.gitignore & Swift.gitignore\n*.xcodeproj/\n*.xcworkspace/\n*.xcconfig\n\n## Build generated\nbuild/\nDerivedData/\n\n## Various settings\n*.pbxuser\n!default.pbxuser\n*.mode1v3\n!default.mode1v3\n*.mode2v3\n!default.mode2v3\n*.perspectivev3\n!default.perspectivev3\nxcuserdata/\n\n## JetBrains CLion\n.idea/\ncmake-build-*/\n\n## Visual Studio Code\n.vscode/\n.cache/\n\n## Other\n*.moved-aside\n*.xccheckout\n*.xcscmblueprint\n\n## Obj-C/Swift specific\n*.hmap\n*.ipa\n*.dSYM.zip\n*.dSYM\n*.o\n\n## Playgrounds\ntimeline.xctimeline\nplayground.xcworkspace\n\n# Swift Package Manager\n# Add this line if you want to avoid checking in source code from Swift Package Manager dependencies.\n# Packages/\n# Package.pins\n# Package.resolved\n.build/\n\n# CocoaPods\n# We recommend against adding the Pods directory to your .gitignore. However\n# you should judge for yourself, the pros and cons are mentioned at:\n# https://guides.cocoapods.org/using/using-cocoapods.html#should-i-check-the-pods-directory-into-source-control\n# Pods/\n# Add this line if you want to avoid checking in source code from the Xcode workspace\n# *.xcworkspace\n\n# Carthage\n# Add this line if you want to avoid checking in source code from Carthage dependencies.\n# Carthage/Checkouts\n\nCarthage/Build\n\n# fastlane\n# It is recommended to not store the screenshots in the git repo. Instead, use fastlane to re-generate the\n# screenshots whenever they are needed.\n# For more information about the recommended setup visit:\n# https://docs.fastlane.tools/best-practices/source-control/#source-control\n\nfastlane/report.xml\nfastlane/Preview.html\nfastlane/screenshots/**/*.png\nfastlane/test_output\n\n# Code Injection\n# After new code Injection tools there's a generated folder /iOSInjectionProject\n# https://github.com/johnno1962/injectionforxcode\n\niOSInjectionProject/\n\n# End of https://www.gitignore.io/api/macos,swift\n"
        },
        {
          "name": "APPLE_DRIVER_LICENSE.txt",
          "type": "blob",
          "size": 8.2998046875,
          "content": "\nAPPLE COMPUTER, INC.\nAPPLE BINARY DRIVER SOFTWARE LICENSE AGREEMENT\n\nPLEASE READ THIS SOFTWARE LICENSE AGREEMENT (\"LICENSE\") CAREFULLY BEFORE USING\nTHE SOFTWARE.  BY USING THE SOFTWARE, YOU ARE AGREEING TO BE BOUND BY THE TERMS\nOF THIS LICENSE.  IF YOU DO NOT AGREE TO THE TERMS OF THIS LICENSE, DO NOT USE\nTHE APPLE SOFTWARE.\n\n1. License.  The Apple driver software, kernel extension files, documentation\nand other materials accompanying this License, whether on disk, in read only\nmemory, on any other media or in any other form (collectively, the \"Apple\nSoftware\") are licensed, not sold, to you by Apple Computer, Inc. (\"Apple\") for\nuse only under the terms of this License, and Apple reserves all rights not\nexpressly granted to you.  The rights granted herein are limited to Apple's\nintellectual property rights in the Apple Software and do not include any other\npatents or intellectual property rights.  You own the media (if any) on which\nthe Apple Software is recorded but Apple retains ownership of the Apple\nSoftware itself.  The Apple Software in this package and any copies which this\nLicense authorizes you to make are subject to this License.  \n\n2. Permitted Uses and Restrictions.  Subject to the terms and conditions of\nthis License:\n\n(a) you may, in connection with the installation and running of Apple's Darwin\noperating system (\"Darwin OS\"), use the Apple Software for personal use or\ninternally within your business or organization, and you may make a reasonable\nnumber of copies of the Apple Software to the extent necessary to effect such\ninternal use purposes; and\n\n(b) if you are redistributing the Darwin OS (or portions thereof) pursuant to\nthe terms of the Apple Public Source License Versions 1.0, 1.1, 1.2, or 2.0\n(the \"APSL\"), you may reproduce and distribute copies of the Apple Software\ntogether with the Darwin OS for the sole purpose of enabling others to install\nand run the Darwin OS, provided that: (i) the Apple Software is distributed in\nits entirety, including all its component parts and related documentation (if\nany); (ii) the Apple Software is distributed under the terms of this License\nand a copy of this License accompanies such distribution; and (iii) your\nunderlying Darwin OS redistribution is in accordance with the terms of the APSL\nand other applicable third party licensing terms. This License does not permit\nthe Apple Software to be distributed on a standalone basis or in any manner\nother than as expressly permitted above.\n\nIn all cases, you must reproduce the Apple copyright notice and any other\nproprietary legends that were on the original copy of the Apple Software on\neach copy of the Apple Software that you make.  Except as and only to the\nextent expressly permitted in this License or by applicable law, you may not\ndecompile, reverse engineer, disassemble, modify, rent, lease, loan,\nsublicense, distribute or create derivative works based upon the Apple Software\nin whole or part or transmit the Apple Software over a network or from one\ncomputer to another.  Your rights under this License will terminate\nautomatically without notice from Apple if you fail to comply with any term(s)\nof this License. In addition, Apple reserves the right to terminate this\nLicense if a new version of Apple's operating system software or the Apple\nSoftware is released which is incompatible with this version of the Apple\nSoftware.\n\n3. Disclaimer Of Warranty.  The Apple Software may be designated as alpha,\nbeta, development, pre-release, untested, or not fully tested versions of the\nApple Software.  Such Apple Software may contain errors that could cause\nfailures or loss of data, and may be incomplete or contain inaccuracies.  YOU\nEXPRESSLY ACKNOWLEDGE AND AGREE THAT USE OF THE APPLE SOFTWARE IS AT YOUR SOLE\nRISK.  THE APPLE SOFTWARE IS PROVIDED \"AS IS\" AND WITHOUT WARRANTY OF ANY KIND\nAND APPLE AND APPLE'S LICENSORS (FOR THE PURPOSES OF SECTIONS 3 AND 4, APPLE\nAND APPLE'S LICENSORS SHALL BE COLLECTIVELY REFERRED TO AS \"APPLE\") EXPRESSLY\nDISCLAIM ALL WARRANTIES WITH RESPECT TO THE APPLE SOFTWARE, EXPRESS OR IMPLIED,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, OF\nFITNESS FOR A PARTICULAR PURPOSE, OF ACCURACY, OR QUIET ENJOYMENT, AND OF NON-\nINFRINGEMENT OF THIRD PARTY RIGHTS.  APPLE DOES NOT WARRANT AGAINST\nINTERFERENCE WITH YOUR ENJOYMENT OF THE APPLE SOFTWARE, THAT THE FUNCTIONS\nCONTAINED IN THE APPLE SOFTWARE WILL MEET YOUR REQUIREMENTS, OR THAT THE\nOPERATION OF THE APPLE SOFTWARE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT\nDEFECTS IN THE APPLE SOFTWARE WILL BE CORRECTED.  NO ORAL OR WRITTEN\nINFORMATION OR ADVICE GIVEN BY APPLE OR AN APPLE AUTHORIZED REPRESENTATIVE\nSHALL CREATE A WARRANTY.  SHOULD THE APPLE SOFTWARE PROVE DEFECTIVE, YOU ASSUME\nTHE ENTIRE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.  SOME\nJURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE\nEXCLUSION MAY NOT APPLY TO YOU.\n\n4. Limitation Of Liability.  TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT\nSHALL APPLE BE LIABLE FOR ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL\nDAMAGESWHATSOEVER, INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF PROFITS,\nLOSS OF DATA, BUSINESS INTERRUPTION OR ANY OTHER COMMERCIAL DAMAGES OR LOSSES,\nARISING OUT OF OR RELATED TO YOUR USE OR INABILITY TO USE THE APPLE SOFTWARE,\nHOWEVER CAUSED, REGARDLESS OF THE THEORY OF LIABILITY (CONTRACT, TORT OR\nOTHERWISE) AND EVEN IF APPLE HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.  SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OR EXCLUSION OF\nLIABILITY FOR INCIDENTAL OR CONSEQUENTIAL DAMAGES SO THE ABOVE LIMITATION OR\nEXCLUSION MAY NOT APPLY TO YOU. In no event shall Apple's total liability to\nyou for all damages, losses, and causes of action (whether in contract, tort\n(including negligence) or otherwise) exceed $50.\n\n5. Export Law Assurances.  You may not use or otherwise export or reexport the\nApple Software except as authorized by United States law and the laws of the\njurisdiction in which the Apple Software was obtained.  In particular, but\nwithout limitation, the Apple Software may not be exported or re-exported (a)\ninto (or to a national or resident of) any U.S. embargoed countries (currently\nCuba, Iran, Iraq, Libya, North Korea, Serbia, Sudan, Syria, or the Taliban\nControlled areas of Afghanistan) or (b) to anyone on the U.S. Treasury\nDepartment's list of Specially Designated Nationals or the U.S. Department of\nCommerce Denied Person's List or Entity List.  By using the Apple Software, you\nrepresent and warrant that you are not located in, under control of, or a\nnational or resident of any such country or on any such list.\n\n6. Government End Users. If the Apple Software is supplied to the United States\nGovernment, the Apple Software and related documentation are \"Commercial\nItems\", as that term is defined at 48 C.F.R. ¤2.101, consisting of \"Commercial\nComputer Software\" and \"Commercial Computer Software Documentation\", as such\nterms are used in 48 C.F.R. ¤12.212 or 48 C.F.R. ¤227.7202, as applicable.\nConsistent with 48 C.F.R. ¤12.212 or 48 C.F.R. ¤227.7202-1through 227.7202-4,\nas applicable, the Commercial Computer Software and Commercial Computer\nSoftware Documentation are being licensed to U.S. Government end users (a) only\nas Commercial Items and (b) with only those rights as are granted to all other\nend users pursuant to the terms and conditions herein.  Unpublished-rights\nreserved under the copyright laws of the United States.\n\n7. Controlling Law and Severability.   This License will be governed by and\nconstrued in accordance with the laws of the State of California, as applied to\nagreements entered into and to be performed entirely within California between\nCalifornia residents. This License shall not be governed by the United Nations\nConvention on Contracts for the International Sale of Goods, the application of\nwhich is expressly excluded. If for any reason a court of competent\njurisdiction finds any provision, or portion thereof, to be unenforceable, the\nremainder of this License shall continue in full force and effect.  \n\n8. Complete Agreement.  This License constitutes the entire agreement between\nthe parties with respect to the use of the Apple Software licensed hereunder\nand supersedes all prior or contemporaneous understandings regarding such\nsubject matter.  No amendment to or modification of this License will be\nbinding unless in writing and signed by Apple.\n\t\t\t\t\t\t                                        92501\n"
        },
        {
          "name": "APPLE_LICENSE.txt",
          "type": "blob",
          "size": 19.3642578125,
          "content": "APPLE PUBLIC SOURCE LICENSE\nVersion 2.0 - August 6, 2003\n\nPlease read this License carefully before downloading this software.\nBy downloading or using this software, you are agreeing to be bound by\nthe terms of this License. If you do not or cannot agree to the terms\nof this License, please do not download or use the software.\n\n1. General; Definitions. This License applies to any program or other\nwork which Apple Computer, Inc. (\"Apple\") makes publicly available and\nwhich contains a notice placed by Apple identifying such program or\nwork as \"Original Code\" and stating that it is subject to the terms of\nthis Apple Public Source License version 2.0 (\"License\"). As used in\nthis License:\n\n1.1 \"Applicable Patent Rights\" mean: (a) in the case where Apple is\nthe grantor of rights, (i) claims of patents that are now or hereafter\nacquired, owned by or assigned to Apple and (ii) that cover subject\nmatter contained in the Original Code, but only to the extent\nnecessary to use, reproduce and/or distribute the Original Code\nwithout infringement; and (b) in the case where You are the grantor of\nrights, (i) claims of patents that are now or hereafter acquired,\nowned by or assigned to You and (ii) that cover subject matter in Your\nModifications, taken alone or in combination with Original Code.\n\n1.2 \"Contributor\" means any person or entity that creates or\ncontributes to the creation of Modifications.\n\n1.3 \"Covered Code\" means the Original Code, Modifications, the\ncombination of Original Code and any Modifications, and/or any\nrespective portions thereof.\n\n1.4 \"Externally Deploy\" means: (a) to sublicense, distribute or\notherwise make Covered Code available, directly or indirectly, to\nanyone other than You; and/or (b) to use Covered Code, alone or as\npart of a Larger Work, in any way to provide a service, including but\nnot limited to delivery of content, through electronic communication\nwith a client other than You.\n\n1.5 \"Larger Work\" means a work which combines Covered Code or portions\nthereof with code not governed by the terms of this License.\n\n1.6 \"Modifications\" mean any addition to, deletion from, and/or change\nto, the substance and/or structure of the Original Code, any previous\nModifications, the combination of Original Code and any previous\nModifications, and/or any respective portions thereof. When code is\nreleased as a series of files, a Modification is: (a) any addition to\nor deletion from the contents of a file containing Covered Code;\nand/or (b) any new file or other representation of computer program\nstatements that contains any part of Covered Code.\n\n1.7 \"Original Code\" means (a) the Source Code of a program or other\nwork as originally made available by Apple under this License,\nincluding the Source Code of any updates or upgrades to such programs\nor works made available by Apple under this License, and that has been\nexpressly identified by Apple as such in the header file(s) of such\nwork; and (b) the object code compiled from such Source Code and\noriginally made available by Apple under this License.\n\n1.8 \"Source Code\" means the human readable form of a program or other\nwork that is suitable for making modifications to it, including all\nmodules it contains, plus any associated interface definition files,\nscripts used to control compilation and installation of an executable\n(object code).\n\n1.9 \"You\" or \"Your\" means an individual or a legal entity exercising\nrights under this License. For legal entities, \"You\" or \"Your\"\nincludes any entity which controls, is controlled by, or is under\ncommon control with, You, where \"control\" means (a) the power, direct\nor indirect, to cause the direction or management of such entity,\nwhether by contract or otherwise, or (b) ownership of fifty percent\n(50%) or more of the outstanding shares or beneficial ownership of\nsuch entity.\n\n2. Permitted Uses; Conditions & Restrictions. Subject to the terms\nand conditions of this License, Apple hereby grants You, effective on\nthe date You accept this License and download the Original Code, a\nworld-wide, royalty-free, non-exclusive license, to the extent of\nApple's Applicable Patent Rights and copyrights covering the Original\nCode, to do the following:\n\n2.1 Unmodified Code. You may use, reproduce, display, perform,\ninternally distribute within Your organization, and Externally Deploy\nverbatim, unmodified copies of the Original Code, for commercial or\nnon-commercial purposes, provided that in each instance:\n\n(a) You must retain and reproduce in all copies of Original Code the\ncopyright and other proprietary notices and disclaimers of Apple as\nthey appear in the Original Code, and keep intact all notices in the\nOriginal Code that refer to this License; and\n\n(b) You must include a copy of this License with every copy of Source\nCode of Covered Code and documentation You distribute or Externally\nDeploy, and You may not offer or impose any terms on such Source Code\nthat alter or restrict this License or the recipients' rights\nhereunder, except as permitted under Section 6.\n\n2.2 Modified Code. You may modify Covered Code and use, reproduce,\ndisplay, perform, internally distribute within Your organization, and\nExternally Deploy Your Modifications and Covered Code, for commercial\nor non-commercial purposes, provided that in each instance You also\nmeet all of these conditions:\n\n(a) You must satisfy all the conditions of Section 2.1 with respect to\nthe Source Code of the Covered Code;\n\n(b) You must duplicate, to the extent it does not already exist, the\nnotice in Exhibit A in each file of the Source Code of all Your\nModifications, and cause the modified files to carry prominent notices\nstating that You changed the files and the date of any change; and\n\n(c) If You Externally Deploy Your Modifications, You must make\nSource Code of all Your Externally Deployed Modifications either\navailable to those to whom You have Externally Deployed Your\nModifications, or publicly available. Source Code of Your Externally\nDeployed Modifications must be released under the terms set forth in\nthis License, including the license grants set forth in Section 3\nbelow, for as long as you Externally Deploy the Covered Code or twelve\n(12) months from the date of initial External Deployment, whichever is\nlonger. You should preferably distribute the Source Code of Your\nExternally Deployed Modifications electronically (e.g. download from a\nweb site).\n\n2.3 Distribution of Executable Versions. In addition, if You\nExternally Deploy Covered Code (Original Code and/or Modifications) in\nobject code, executable form only, You must include a prominent\nnotice, in the code itself as well as in related documentation,\nstating that Source Code of the Covered Code is available under the\nterms of this License with information on how and where to obtain such\nSource Code.\n\n2.4 Third Party Rights. You expressly acknowledge and agree that\nalthough Apple and each Contributor grants the licenses to their\nrespective portions of the Covered Code set forth herein, no\nassurances are provided by Apple or any Contributor that the Covered\nCode does not infringe the patent or other intellectual property\nrights of any other entity. Apple and each Contributor disclaim any\nliability to You for claims brought by any other entity based on\ninfringement of intellectual property rights or otherwise. As a\ncondition to exercising the rights and licenses granted hereunder, You\nhereby assume sole responsibility to secure any other intellectual\nproperty rights needed, if any. For example, if a third party patent\nlicense is required to allow You to distribute the Covered Code, it is\nYour responsibility to acquire that license before distributing the\nCovered Code.\n\n3. Your Grants. In consideration of, and as a condition to, the\nlicenses granted to You under this License, You hereby grant to any\nperson or entity receiving or distributing Covered Code under this\nLicense a non-exclusive, royalty-free, perpetual, irrevocable license,\nunder Your Applicable Patent Rights and other intellectual property\nrights (other than patent) owned or controlled by You, to use,\nreproduce, display, perform, modify, sublicense, distribute and\nExternally Deploy Your Modifications of the same scope and extent as\nApple's licenses under Sections 2.1 and 2.2 above.\n\n4. Larger Works. You may create a Larger Work by combining Covered\nCode with other code not governed by the terms of this License and\ndistribute the Larger Work as a single product. In each such instance,\nYou must make sure the requirements of this License are fulfilled for\nthe Covered Code or any portion thereof.\n\n5. Limitations on Patent License. Except as expressly stated in\nSection 2, no other patent rights, express or implied, are granted by\nApple herein. Modifications and/or Larger Works may require additional\npatent licenses from Apple which Apple may grant in its sole\ndiscretion.\n\n6. Additional Terms. You may choose to offer, and to charge a fee for,\nwarranty, support, indemnity or liability obligations and/or other\nrights consistent with the scope of the license granted herein\n(\"Additional Terms\") to one or more recipients of Covered Code.\nHowever, You may do so only on Your own behalf and as Your sole\nresponsibility, and not on behalf of Apple or any Contributor. You\nmust obtain the recipient's agreement that any such Additional Terms\nare offered by You alone, and You hereby agree to indemnify, defend\nand hold Apple and every Contributor harmless for any liability\nincurred by or claims asserted against Apple or such Contributor by\nreason of any such Additional Terms.\n\n7. Versions of the License. Apple may publish revised and/or new\nversions of this License from time to time. Each version will be given\na distinguishing version number. Once Original Code has been published\nunder a particular version of this License, You may continue to use it\nunder the terms of that version. You may also choose to use such\nOriginal Code under the terms of any subsequent version of this\nLicense published by Apple. No one other than Apple has the right to\nmodify the terms applicable to Covered Code created under this\nLicense.\n\n8. NO WARRANTY OR SUPPORT. The Covered Code may contain in whole or in\npart pre-release, untested, or not fully tested works. The Covered\nCode may contain errors that could cause failures or loss of data, and\nmay be incomplete or contain inaccuracies. You expressly acknowledge\nand agree that use of the Covered Code, or any portion thereof, is at\nYour sole and entire risk. THE COVERED CODE IS PROVIDED \"AS IS\" AND\nWITHOUT WARRANTY, UPGRADES OR SUPPORT OF ANY KIND AND APPLE AND\nAPPLE'S LICENSOR(S) (COLLECTIVELY REFERRED TO AS \"APPLE\" FOR THE\nPURPOSES OF SECTIONS 8 AND 9) AND ALL CONTRIBUTORS EXPRESSLY DISCLAIM\nALL WARRANTIES AND/OR CONDITIONS, EXPRESS OR IMPLIED, INCLUDING, BUT\nNOT LIMITED TO, THE IMPLIED WARRANTIES AND/OR CONDITIONS OF\nMERCHANTABILITY, OF SATISFACTORY QUALITY, OF FITNESS FOR A PARTICULAR\nPURPOSE, OF ACCURACY, OF QUIET ENJOYMENT, AND NONINFRINGEMENT OF THIRD\nPARTY RIGHTS. APPLE AND EACH CONTRIBUTOR DOES NOT WARRANT AGAINST\nINTERFERENCE WITH YOUR ENJOYMENT OF THE COVERED CODE, THAT THE\nFUNCTIONS CONTAINED IN THE COVERED CODE WILL MEET YOUR REQUIREMENTS,\nTHAT THE OPERATION OF THE COVERED CODE WILL BE UNINTERRUPTED OR\nERROR-FREE, OR THAT DEFECTS IN THE COVERED CODE WILL BE CORRECTED. NO\nORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY APPLE, AN APPLE\nAUTHORIZED REPRESENTATIVE OR ANY CONTRIBUTOR SHALL CREATE A WARRANTY.\nYou acknowledge that the Covered Code is not intended for use in the\noperation of nuclear facilities, aircraft navigation, communication\nsystems, or air traffic control machines in which case the failure of\nthe Covered Code could lead to death, personal injury, or severe\nphysical or environmental damage.\n\n9. LIMITATION OF LIABILITY. TO THE EXTENT NOT PROHIBITED BY LAW, IN NO\nEVENT SHALL APPLE OR ANY CONTRIBUTOR BE LIABLE FOR ANY INCIDENTAL,\nSPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES ARISING OUT OF OR RELATING\nTO THIS LICENSE OR YOUR USE OR INABILITY TO USE THE COVERED CODE, OR\nANY PORTION THEREOF, WHETHER UNDER A THEORY OF CONTRACT, WARRANTY,\nTORT (INCLUDING NEGLIGENCE), PRODUCTS LIABILITY OR OTHERWISE, EVEN IF\nAPPLE OR SUCH CONTRIBUTOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES AND NOTWITHSTANDING THE FAILURE OF ESSENTIAL PURPOSE OF ANY\nREMEDY. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OF LIABILITY OF\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS LIMITATION MAY NOT APPLY\nTO YOU. In no event shall Apple's total liability to You for all\ndamages (other than as may be required by applicable law) under this\nLicense exceed the amount of fifty dollars ($50.00).\n\n10. Trademarks. This License does not grant any rights to use the\ntrademarks or trade names \"Apple\", \"Apple Computer\", \"Mac\", \"Mac OS\",\n\"QuickTime\", \"QuickTime Streaming Server\" or any other trademarks,\nservice marks, logos or trade names belonging to Apple (collectively\n\"Apple Marks\") or to any trademark, service mark, logo or trade name\nbelonging to any Contributor. You agree not to use any Apple Marks in\nor as part of the name of products derived from the Original Code or\nto endorse or promote products derived from the Original Code other\nthan as expressly permitted by and in strict compliance at all times\nwith Apple's third party trademark usage guidelines which are posted\nat http://www.apple.com/legal/guidelinesfor3rdparties.html.\n\n11. Ownership. Subject to the licenses granted under this License,\neach Contributor retains all rights, title and interest in and to any\nModifications made by such Contributor. Apple retains all rights,\ntitle and interest in and to the Original Code and any Modifications\nmade by or on behalf of Apple (\"Apple Modifications\"), and such Apple\nModifications will not be automatically subject to this License. Apple\nmay, at its sole discretion, choose to license such Apple\nModifications under this License, or on different terms from those\ncontained in this License or may choose not to license them at all.\n\n12. Termination.\n\n12.1 Termination. This License and the rights granted hereunder will\nterminate:\n\n(a) automatically without notice from Apple if You fail to comply with\nany term(s) of this License and fail to cure such breach within 30\ndays of becoming aware of such breach;\n\n(b) immediately in the event of the circumstances described in Section\n13.5(b); or\n\n(c) automatically without notice from Apple if You, at any time during\nthe term of this License, commence an action for patent infringement\nagainst Apple; provided that Apple did not first commence\nan action for patent infringement against You in that instance.\n\n12.2 Effect of Termination. Upon termination, You agree to immediately\nstop any further use, reproduction, modification, sublicensing and\ndistribution of the Covered Code. All sublicenses to the Covered Code\nwhich have been properly granted prior to termination shall survive\nany termination of this License. Provisions which, by their nature,\nshould remain in effect beyond the termination of this License shall\nsurvive, including but not limited to Sections 3, 5, 8, 9, 10, 11,\n12.2 and 13. No party will be liable to any other for compensation,\nindemnity or damages of any sort solely as a result of terminating\nthis License in accordance with its terms, and termination of this\nLicense will be without prejudice to any other right or remedy of\nany party.\n\n13. Miscellaneous.\n\n13.1 Government End Users. The Covered Code is a \"commercial item\" as\ndefined in FAR 2.101. Government software and technical data rights in\nthe Covered Code include only those rights customarily provided to the\npublic as defined in this License. This customary commercial license\nin technical data and software is provided in accordance with FAR\n12.211 (Technical Data) and 12.212 (Computer Software) and, for\nDepartment of Defense purchases, DFAR 252.227-7015 (Technical Data --\nCommercial Items) and 227.7202-3 (Rights in Commercial Computer\nSoftware or Computer Software Documentation). Accordingly, all U.S.\nGovernment End Users acquire Covered Code with only those rights set\nforth herein.\n\n13.2 Relationship of Parties. This License will not be construed as\ncreating an agency, partnership, joint venture or any other form of\nlegal association between or among You, Apple or any Contributor, and\nYou will not represent to the contrary, whether expressly, by\nimplication, appearance or otherwise.\n\n13.3 Independent Development. Nothing in this License will impair\nApple's right to acquire, license, develop, have others develop for\nit, market and/or distribute technology or products that perform the\nsame or similar functions as, or otherwise compete with,\nModifications, Larger Works, technology or products that You may\ndevelop, produce, market or distribute.\n\n13.4 Waiver; Construction. Failure by Apple or any Contributor to\nenforce any provision of this License will not be deemed a waiver of\nfuture enforcement of that or any other provision. Any law or\nregulation which provides that the language of a contract shall be\nconstrued against the drafter will not apply to this License.\n\n13.5 Severability. (a) If for any reason a court of competent\njurisdiction finds any provision of this License, or portion thereof,\nto be unenforceable, that provision of the License will be enforced to\nthe maximum extent permissible so as to effect the economic benefits\nand intent of the parties, and the remainder of this License will\ncontinue in full force and effect. (b) Notwithstanding the foregoing,\nif applicable law prohibits or restricts You from fully and/or\nspecifically complying with Sections 2 and/or 3 or prevents the\nenforceability of either of those Sections, this License will\nimmediately terminate and You must immediately discontinue any use of\nthe Covered Code and destroy all copies of it that are in your\npossession or control.\n\n13.6 Dispute Resolution. Any litigation or other dispute resolution\nbetween You and Apple relating to this License shall take place in the\nNorthern District of California, and You and Apple hereby consent to\nthe personal jurisdiction of, and venue in, the state and federal\ncourts within that District with respect to this License. The\napplication of the United Nations Convention on Contracts for the\nInternational Sale of Goods is expressly excluded.\n\n13.7 Entire Agreement; Governing Law. This License constitutes the\nentire agreement between the parties with respect to the subject\nmatter hereof. This License shall be governed by the laws of the\nUnited States and the State of California, except that body of\nCalifornia law concerning conflicts of law.\n\nWhere You are located in the province of Quebec, Canada, the following\nclause applies: The parties hereby confirm that they have requested\nthat this License and all related documents be drafted in English. Les\nparties ont exige que le present contrat et tous les documents\nconnexes soient rediges en anglais.\n\nEXHIBIT A.\n\n\"Portions Copyright (c) 1999-2003 Apple Computer, Inc. All Rights\nReserved.\n\nThis file contains Original Code and/or Modifications of Original Code\nas defined in and that are subject to the Apple Public Source License\nVersion 2.0 (the 'License'). You may not use this file except in\ncompliance with the License. Please obtain a copy of the License at\nhttp://www.opensource.apple.com/apsl/ and read it before using this\nfile.\n\nThe Original Code and all software distributed under the License are\ndistributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER\nEXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,\nINCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.\nPlease see the License for the specific language governing rights and\nlimitations under the License.\"\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 0.822265625,
          "content": "if(CMAKE_GENERATOR STREQUAL \"Xcode\")\n    message(FATAL_ERROR \"PureDarwin cannot be compiled with Xcode.\")\nendif()\n\ncmake_minimum_required(VERSION 3.15.1)\nproject(PUREDARWIN)\n\nif((NOT CMAKE_C_COMPILER_ID MATCHES \"AppleClang\") AND (NOT CMAKE_C_COMPILER_ID MATCHES \"Clang\"))\n    message(FATAL_ERROR \"PureDarwin must be compiled with clang.\")\nendif()\n\ncmake_policy(SET CMP0114 NEW)\n\nset(CMAKE_INSTALL_PREFIX \"\")\nset(CMAKE_MACOSX_MIN_VERSION 11.0)\n\ninclude(ExternalProject)\ninclude(cmake/asm.cmake)\ninclude(cmake/bundle_resources.cmake)\ninclude(cmake/circular.cmake)\ninclude(cmake/crosscompile.cmake)\ninclude(cmake/get_target_dependencies.cmake)\ninclude(cmake/install_helpers.cmake)\ninclude(cmake/kext.cmake)\ninclude(cmake/mig.cmake)\ninclude(cmake/suppress_warnings.cmake)\n\nadd_subdirectory(projects)\nadd_subdirectory(src)\nadd_subdirectory(tools)\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 2.8701171875,
          "content": "## Contributor PureDarwin Code of Conduct\n\n### Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as contributors and maintainers pledge to making participation in our project and our community a harassment-free experience for everyone, regardless of age, body size, disability, ethnicity, gender identity and expression, level of experience, nationality, personal appearance, race, religion, or sexual identity and orientation.\n\n### Our Standards\n\nExamples of behavior that contributes to creating a positive environment include:\n\nUsing welcoming and inclusive language\nBeing respectful of differing viewpoints and experiences\nGracefully accepting constructive criticism\nFocusing on what is best for the community\nShowing empathy towards other community members\nExamples of unacceptable behavior by participants include:\n\nThe use of sexualized language or imagery and unwelcome sexual attention or advances\nTrolling, insulting/derogatory comments, and personal or political attacks\nPublic or private harassment\nPublishing others' private information, such as a physical or electronic address, without explicit permission\nOther conduct which could reasonably be considered inappropriate in a professional setting\n\n### Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable behavior and are expected to take appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, or to ban temporarily or permanently any contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful.\n\n### Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces when an individual is representing the project or its community. Examples of representing a project or community include using an official project e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event. Representation of a project may be further defined and clarified by project maintainers.\n\n### Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the project team at support@pd-devs.org. All complaints will be reviewed and investigated and will result in a response that is deemed necessary and appropriate to the circumstances. The project team is obligated to maintain confidentiality with regard to the reporter of an incident. Further details of specific enforcement policies may be posted separately.\n   \nProject maintainers who do not follow or enforce the Code of Conduct in good faith may face temporary or permanent repercussions as determined by other members of the project's leadership.\n"
        },
        {
          "name": "CODING_STYLE.md",
          "type": "blob",
          "size": 4.115234375,
          "content": "# PureDarwin Coding Style\n\nThis document is a work in progress. Please follow it at all times.\n\nIf you are editing anything that does not already conform\nto the below standards, please follow the formatting that is in use there instead.\nFeel free to clean up a file that you are editing; just make sure that your functional changes are in a separate commit.\nCleanup-only PRs are also welcome.\n\nAn editorconfig file is provided to help contributors to adhere to these rules.\n\n## All files\n\n* No trailing whitespace, including on blank lines. If your editor is programmed to automatically strip trailing whitespace when you save, please commit the whitespace changes separately from the functional changes for ease of review.\n* All files should always end with one (and only one) newline. No blank lines at the end of a file.\n\n## The Build\n\n* Final PRs as-merged must use the CMake build system only. The system is not fully implemented yet, but is designed to be a straight port from Xcode once you know what to put in CMakeLists.txt, while still abiding by standard CMake idioms.\n* As a corollary to the above: No Xcode projects in `main` branch. These are perfectly OK in topic branches and PRs, but please remove them before merging. This helps prevent noise in future diffs due to Xcode rewriting project files at its whim. The gitignore file will help to enforce this; note that you can easily override it using `git add -f`.\n* Contributions to PureDarwin that have dependencies not present in this repo are welcome, but are still subject to the above rules. The `USE_HOST_SDK` parameter can be used to enable use of the active Apple SDK if a file is not found in the local repo. Please use it in all targets unless otherwise specified.\n\n## CMake\n\n* Four-space indent; the editorconfig file should help enforce this.\n* Use single blank lines where appropriate to aid readability.\n* `add_subdirectory()` calls in CMakeLists.txt files should be sorted alphabetically, with uppercase letters coming before lowercase letters.\n* Always name targets after the name of their output binary. If you are building a Darwin component target, do include “lib” if it is present in the output filename; CMake will detect this and set the `PREFIX` property accordingly to prevent “lib” appearing twice in the filename. This will _not_ automatically occur for host tool targets, so omit “lib” from target names there.\n* When adding compiler definitions, keep them alphabetized unless it breaks something.\n* Try to keep include directories alphabetized in the CMakeLists file, but there are places where doing so will break the build.\n* Separate build rules for separate binaries with two blank lines. Put `install()` and `add_subdirectory()` calls together in their own sections at the end of the file, separated by two blank lines from the others.\n* Look in the source files in the scripts/cmake folder for documentation about what each function or macro does.\n* Binaries should be installed using the standard CMake `install()` command, using the BaseSystem component. Headers should be installed in DeveloperTools. Private headers use the DeveloperInternal component. Manpages go in either BaseSystem or DeveloperTools, depending on what they document.\n\n## Kernel Extensions\n\nWhen modifying kernel-mode C++ code keep your use of newer C++ features as minimal as possible, in line with the design of existing kext code. Remember that there is no STL or libcxxabi in kernel mode. Some more points:\n* `OSSharedPtr` is there for a reason; use it!\n* Passing objects by reference (`something_t &`) is OK, in implementation declarations only. Do not create declarations (parameters and return values) that use `OSSharedPtr` or by-reference arguments in the signature. This is not ABI-stable.\n* Do not bother to imitate any strange formatting you might see when editing existing files. Keep the indentation the same (incl. tabs-vs-spaces), but feel free to use whatever you believe to be good formatting is when writing new code or editing existing code.\n* We use C++11 to compile for all kexts, so use of features from that standard are OK. (And recommended! The use of newer C++ syntax is a good development pratice.)\n"
        },
        {
          "name": "PUREDARWIN_LICENSE.txt",
          "type": "blob",
          "size": 1.3828125,
          "content": "#\n# Copyright (c) 2007-Present The PureDarwin Project.\n# All rights reserved.\n#\n# @LICENSE_HEADER_START@\n#\n# Redistribution and use in source and binary forms, with or without\n# modification, are permitted provided that the following conditions\n# are met:\n# 1. Redistributions of source code must retain the above copyright\n#    notice, this list of conditions and the following disclaimer.\n# 2. Redistributions in binary form must reproduce the above copyright\n#    notice, this list of conditions and the following disclaimer in the\n#    documentation and/or other materials provided with the distribution.\n#\n# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\n# IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\n# THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n# PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n# CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n# EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\n# PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n# PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n# LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n# NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n# SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n#\n# @LICENSE_HEADER_END@\n#\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 0.9580078125,
          "content": "# PureDarwin   [![PureDarwin Discord](https://dcbadge.limes.pink/api/server/https://discord.gg/9kz8XXRRcT?style=flat)](https://discord.gg/9kz8XXRRcT)\n\n![logo-sm](https://github.com/user-attachments/assets/ea4bd560-3738-4486-80ab-2f313e4a33a1)\n\nDarwin is the Open Source operating system from Apple that forms the basis for Mac OS X and PureDarwin. PureDarwin is a community project that aims to make Darwin more usable (some people think of it as the informal successor to OpenDarwin).\n\nOne current goal of this project is to provide a useful bootable ISO/VM of some recent version of Darwin.\n\nSee the [Website](https://www.puredarwin.org) for more information.\n\n## Building PureDarwin\n\nTo build PureDarwin, you will need OpenSSL installed, which is used by xar and ld64.\nPureDarwin builds only on macOS. It is currently tested with Xcode 14, but should work\nwith any other modern Xcode.\n\nYou will also need zlib, which is used by the DTrace CTF tools used in building the kernel.\n"
        },
        {
          "name": "cmake",
          "type": "tree",
          "content": null
        },
        {
          "name": "projects",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}