{
  "metadata": {
    "timestamp": 1736709780566,
    "page": 227,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "intel/haxm",
      "stars": 3255,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0419921875,
          "content": "# macOS\r\n.DS_Store\r\n\r\n# Linux\r\n*.o\r\n*.cmd\r\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.1787109375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n  advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at haxm-team AT intel DOT com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.6650390625,
          "content": "# Contribution Guidelines\n\nAs an open-source project, we welcome and encourage the community to\nsubmit patches directly to project HAXM. In our collaborative open\nsource environment, standards and methods for submitting changes help\nreduce the chaos that can result from an active development community.\n\nThis document explains how to submit patches to the project so your\npatch will be accepted quickly in the codebase.\n\n## Licensing\n\nLicensing is very important to open source projects. It helps ensure the\nsoftware continues to be available under the terms that the author\ndesired.\n\nProject HAXM uses a BSD-3-Clause license, as found in the\n[LICENSE](https://github.com/intel/haxm/blob/master/LICENSE)\nin the project's GitHub repo.\n\nA license tells you what rights you have as a developer, as provided by\nthe copyright holder. It is important that the contributor fully\nunderstands the licensing rights and agrees to them. Sometimes the\ncopyright holder isn't the contributor, such as when the contributor is\ndoing work on behalf of a company.\n\n## Developer Certification of Origin (DCO)\n\nTo make a good faith effort to ensure licensing criteria are met,\nproject HAXM requires the Developer Certificate of Origin (DCO) process\nto be followed.\n\nThe DCO is an attestation attached to every contribution made by every\ndeveloper. In the commit message of the contribution (described more\nfully later in this document), the developer simply adds a\n``Signed-off-by`` statement and thereby agrees to the DCO.\n\nWhen a developer submits a patch, it is a commitment that the\ncontributor has the right to submit the patch per the license. The DCO\nagreement is shown below and at https://developercertificate.org.\n\n```\n    Developer's Certificate of Origin 1.1\n\n    By making a contribution to this project, I certify that:\n\n    (a) The contribution was created in whole or in part by me and I\n        have the right to submit it under the open source license\n        indicated in the file; or\n\n    (b) The contribution is based upon previous work that, to the\n        best of my knowledge, is covered under an appropriate open\n        source license and I have the right under that license to\n        submit that work with modifications, whether created in whole\n        or in part by me, under the same open source license (unless\n        I am permitted to submit under a different license), as\n        indicated in the file; or\n\n    (c) The contribution was provided directly to me by some other\n        person who certified (a), (b) or (c) and I have not modified\n        it.\n\n    (d) I understand and agree that this project and the contribution\n        are public and that a record of the contribution (including\n        all personal information I submit with it, including my\n        sign-off) is maintained indefinitely and may be redistributed\n        consistent with this project or the open source license(s)\n        involved.\n```\n\n### DCO Sign-Off Methods\n\nThe DCO requires that a sign-off message, in the following format,\nappears on each commit in the pull request:\n\n`Signed-off-by: Haxmus Jones <haxmusj@example.com>`\n\nYou are required to use your real name in the sign-off message.\n\nThe DCO text can either be manually added to your commit body, or you can add\neither ``-s`` or ``--signoff`` to your usual Git commit commands. If you forget\nto add the sign-off you can also amend a previous commit with the sign-off by\nrunning ``git commit --amend -s``. If you've pushed your changes to GitHub\nalready you'll need to force push your branch after this with ``git push -f``.\n\n\n**Note:**\n\nThe name and email address of the account you use to submit your PR must\nmatch the name and email address on the ``Signed-off-by`` line in\nyour commit message.\n"
        },
        {
          "name": "CheckTool",
          "type": "tree",
          "content": null
        },
        {
          "name": "HaxmLoader",
          "type": "tree",
          "content": null
        },
        {
          "name": "Installer",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.4814453125,
          "content": "BSD 3-Clause License\n\nCopyright (c) 2017, Intel Corporation\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.0693359375,
          "content": "# DISCONTINUATION OF PROJECT\n\nThis project will no longer be maintained by Intel.\n\nIntel has ceased development and contributions including, but not limited to, maintenance, bug fixes, new releases, or updates, to this project.\n\nIntel no longer accepts patches to this project.\n\nIf you have an ongoing need to use this project, are interested in independently developing it, or would like to maintain patches for the open source software community, please create your own fork of this project.\n\nContact: webadmin@linux.intel.com\n\n# Status\n\nHAXM was created to bring Intel Virtualization Technology to Windows and macOS\nusers. Today both Microsoft Hyper-V and macOS HVF have added support for Intel\nVirtual Machine Extensions. We have therefore decided to retire the HAXM\nproject. HAXM v7.8.0 is our last release and we will not accept pull requests or\nrespond to issues after this.\n\n# Intel Hardware Accelerated Execution Manager (HAXM)\n\n<img src=\"Installer/res/haxm_logo.ico\" height=\"176px\" align=\"right\">\n\nHAXM is a cross-platform hardware-assisted virtualization engine (hypervisor),\nwidely used as an accelerator for [Android Emulator][android-studio] and\n[QEMU][qemu]. It has always supported running on Windows and macOS, and has been\nported to other host operating systems as well, such as Linux and NetBSD.\n\nHAXM runs as a kernel-mode driver on the host operating system, and provides a\nKVM-like interface to user space, thereby enabling applications like QEMU to\nutilize the hardware virtualization capabilities built into modern Intel CPUs,\nnamely [Intel Virtualization Technology][intel-vt].\n\n## Downloads\nThe latest HAXM release for Windows and macOS hosts are available\n[here][github-haxm-releases].\n\n## Contributing\nDetailed instructions for building and testing HAXM can be found at:\n* [Manual for Linux](docs/manual-linux.md)\n* [Manual for macOS](docs/manual-macos.md)\n* [Manual for Windows](docs/manual-windows.md)\n\nIf you would like to contribute a patch to the code base, please also read\n[these guidelines](CONTRIBUTING.md).\n\n## Reporting an Issue\nYou are welcome to file a [GitHub issue][github-haxm-issues] if you discover a\ngeneral HAXM bug or have a feature request.\n\nHowever, please do not use the GitHub issue tracker to report security\nvulnerabilities. If you have information about a security issue or vulnerability\nwith HAXM, please send an email to [secure@intel.com][intel-security-email], and\nuse the PGP key located at https://www.intel.com/security to encrypt any\nsensitive information.\n\n## Code of Conduct\nThis project has adopted the Contributor Covenant, in the hope of building a\nwelcoming and inclusive community. All participants in the project should adhere\nto this [code of conduct](CODE_OF_CONDUCT.md).\n\n[intel-vt]: https://www.intel.com/content/www/us/en/virtualization/virtualization-technology/intel-virtualization-technology.html\n[android-studio]: https://developer.android.com/studio/index.html\n[qemu]: https://www.qemu.org/\n[github-haxm-releases]: https://github.com/intel/haxm/releases\n[github-haxm-issues]: https://github.com/intel/haxm/issues\n[intel-security-email]: mailto:secure@intel.com\n"
        },
        {
          "name": "core",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "include",
          "type": "tree",
          "content": null
        },
        {
          "name": "platforms",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}