{
  "metadata": {
    "timestamp": 1736709814864,
    "page": 271,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "google/eddystone",
      "stars": 3083,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.1015625,
          "content": "language: node_js\nnode_js:\n  - \"node\"\nbefore_install:\n  - cd libraries/javascript/eddystone-advertising\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.3056640625,
          "content": "# This is the official list of Eddystone authors for copyright purposes.\n# This file is distinct from the CONTRIBUTORS files.\n# See the latter for an explanation.\n\n# Names should be added to this file as:\n# Name or Organization <email address>\n# The email address is not required for organizations.\n\nGoogle Inc.\n\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.30078125,
          "content": "# How to contribute\n\nWe'd love to accept your patches and contributions to this project. There are\njust a few small guidelines you need to follow.\n\n## Contributor License Agreement\n\nContributions to any Google project must be accompanied by a Contributor\nLicense Agreement.  This is not a copyright _assignment_, it simply gives\nGoogle permission to use and redistribute your contributions as part of the\nproject.\n\n* If you are an individual writing original source code and you're sure you\n  own the intellectual property, then you'll need to sign an [individual CLA][].\n\n* If you work for a company that wants to allow you to contribute your work,\n  then you'll need to sign a [corporate CLA][].\n\nYou generally only need to submit a CLA once, so if you've already submitted\none (even if it was for a different project), you probably don't need to do it\nagain.\n\n[individual CLA]: https://developers.google.com/open-source/cla/individual\n[corporate CLA]: https://developers.google.com/open-source/cla/corporate\n\n## Submitting a patch\n\n1. It's generally best to start by opening a new issue describing the bug or\n   feature you're intending to fix.  Even if you think it's relatively minor,\n   it's helpful to know what people are working on.  Mention in the initial\n   issue that you are planning to work on that bug or feature so that it can\n   be assigned to you.\n\n1. Follow the normal process of [forking][] the project, and setup a new\n   branch to work in.  It's important that each group of changes be done in\n   separate branches in order to ensure that a pull request only includes the\n   commits related to that bug or feature.\n\n1. We have [style guides] for the languages we use; please follow them.\n\n1. Do your best to have [well-formed commit messages][] for each change.\n   This provides consistency throughout the project, and ensures that commit\n   messages are able to be formatted properly by various git tools.\n\n1. Finally, all submissions require review. We use pull requests for this, so\n   push the commits to your fork and submit a [pull request][].\n\n[forking]: https://help.github.com/articles/fork-a-repo\n[style guides]: https://github.com/google/styleguide\n\n[well-formed commit messages]: http://tbaggery.com/2008/04/19/a-note-about-git-commit-messages.html\n[pull request]: https://help.github.com/articles/creating-a-pull-request\n"
        },
        {
          "name": "CONTRIBUTORS",
          "type": "blob",
          "size": 0.75390625,
          "content": "# People who have agreed to one of the CLAs and can contribute patches.\n# The AUTHORS file lists the copyright holders; this file\n# lists people.  For example, Google employees are listed here\n# but not in AUTHORS, because Google holds the copyright.\n#\n# https://developers.google.com/open-source/cla/individual\n# https://developers.google.com/open-source/cla/corporate\n#\n# Names should be added to this file as:\n#     Name <email address>\n\nMichael Ashbridge <mashbridge@google.com>\nMarc Wandschneider <marcwan@google.com>\nPeet Sasaki <peet@google.com>\nMichal Mocny <mmocny@google.com>\nRoy Want <roywant@google.com>\nGiovanni Ortuno <ortuno@google.com>\nDave Smith <smith@wiresareobsolete.com>\nChristopher Dro <casheghian@gmail.com>\nShuichi Tsutsumi <shuichi0526@gmail.com>\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.3994140625,
          "content": "# Eddystone\n\n<img align=\"left\" src=\"res/logo/eddystone_logo.png\" hspace=\"15\" style=\"float: left\">Eddystone is a protocol specification that defines a Bluetooth low energy (BLE) message format for proximity beacon messages. It describes several different frame types that may be used individually or in combinations to create beacons that can be used for a variety of applications.\n\nAnnounced in April 2016, [Eddystone-EID](eddystone-eid) (Ephemeral ID) is a new frame type that defines a cryptographically secure method of configuring a beacon to broadcast information that only authorized people may decrypt. It includes support for a [secure transmission](eddystone-tlm/tlm-encrypted.md) of the TLM (Telemetry) information.\n\n## Design Goals\n\nThe design of Eddystone has been driven by several key goals:\n\n- Works well with Android and iOS Bluetooth developer APIs\n- Straightforward implementation on a wide range of existing BLE devices\n- Flexible architecture permitting development of new frame types\n- Fully compliant with the Bluetooth Core Specification\n\n## Protocol Specification\n\nThe common frame PDU types and the individual service data byte layouts for\nthe Eddystone frame formats are documented in the\n[Eddystone Protocol Specification](protocol-specification.md).\n\n## Configuration Service\n\nEddystone defines a [GATT configuration service](configuration-service/) to enable interoperability between hardware manufacturers and application developers. It allows the beacon to report its capabilities to apps, and for the beacon's broadcast data to be reconfigured. This service is also necessary for secure configuration and registration as an Eddystone-EID beacon.\n\n## Tools and Code Samples\n\nWe have a variety of tools and code samples to assist developers and implementors in working with Eddystone devices.\n\n- An Android app that performs non-exhaustive basic validation of the core Eddystone frame types is available at [tools/eddystone-validator](tools/eddystone-validator).\n\n- An Android app that can broadcast configurable Eddystone-UID frames is available at [eddystone-uid/tools/txeddystone-uid](eddystone-uid/tools/txeddystone-uid).\n\n- A validation tool for the dedicated Eddystone-URL configuration service is at\n[eddystone-url/tools/eddystone-url-config-validator](eddystone-url/tools/eddystone-url-config-validator).\n\n- A tool to aid in the implementation of Eddystone-EID devices is at [eddystone-eid/tools/](eddystone-eid/tools)\n"
        },
        {
          "name": "branding",
          "type": "tree",
          "content": null
        },
        {
          "name": "configuration-service",
          "type": "tree",
          "content": null
        },
        {
          "name": "eddystone-eid",
          "type": "tree",
          "content": null
        },
        {
          "name": "eddystone-tlm",
          "type": "tree",
          "content": null
        },
        {
          "name": "eddystone-uid",
          "type": "tree",
          "content": null
        },
        {
          "name": "eddystone-url",
          "type": "tree",
          "content": null
        },
        {
          "name": "implementations",
          "type": "tree",
          "content": null
        },
        {
          "name": "libraries",
          "type": "tree",
          "content": null
        },
        {
          "name": "protocol-specification.md",
          "type": "blob",
          "size": 3.7138671875,
          "content": "# Eddystone Protocol Specification\n\n## Common Elements\n\nEvery Eddystone frame type must contain the following PDU data types:\n\n- The _Complete List of 16-bit Service UUIDs_ as defined in The Bluetooth Core Specification Supplement (CSS) v5, Part A, § 1.1. The _Complete List of 16-bit Service UUIDs_ must contain the Eddystone Service UUID of `0xFEAA`. This is included to allow background scanning on iOS devices.\n- The _Service Data_ data type, _Ibid._, § 1.11. The _Service Data - 16 bit UUID_ data type must be the Eddystone Service UUID of `0xFEAA`.\n\nThe specific type of Eddystone frame is encoded in the high-order four bits of the first octet in the Service Data associated with the Service UUID. Permissible values are:\n\nFrame Type | High-Order 4 bits | Byte Value\n:----------|:-----------------:|:---------:\nUID | `0000` | `0x00`\nURL | `0001` | `0x10`\nTLM | `0010` | `0x20`\nEID | `0011` | `0x30`\nRESERVED | `0100` | `0x40`\n\n\nThe four low-order bits are reserved for future use and must be `0000`.\n\nNote: although the core Bluetooth data type are defined in the standard as\nlittle-endian, Eddystone's multi-value bytes defined in the Service Data are\nall big-endian.\n\nAn example frame type may look like:\n\nByte offset | Value | Description | Data Type\n-----|:-----:|-----------|------------\n 0 | `0x02` | Length | Flags. CSS v5, Part A, § 1.3\n 1 | `0x01` | Flags data type value\n 2 | `0x06` | Flags data\n 3 | `0x03` | Length | Complete list of 16-bit Service UUIDs. _Ibid._ § 1.1\n 4 | `0x03` | Complete list of 16-bit Service UUIDs data type value\n 5 | `0xAA` | 16-bit Eddystone UUID\n 6 | `0xFE` | ...\n 7 | `0x??` | Length | Service Data. _Ibid._ § 1.11\n 8 | `0x16` | Service Data data type value\n 9 | `0xAA` | 16-bit Eddystone UUID\n10 | `0xFE` | ...\n\nWith subsequent bytes comprising the frame-specific Service Data.\n\nThe individual frame types are listed below.\n\n## [Eddystone-UID](eddystone-uid)\n\nThe Eddystone-UID frame broadcasts an opaque, unique 16-byte Beacon ID composed of a 10-byte namespace and a 6-byte instance. The Beacon ID may be useful in mapping a device to a record in external storage. The namespace portion of the ID may be used to group a particular set of beacons, while the instance ID identifies individual devices in the group. The division of the ID into namespace and instance components may also be used to optimize BLE scanning strategies, e.g. by filtering only on the namespace.\n\n## [Eddystone-URL](eddystone-url)\n\nThe Eddystone-URL frame broadcasts a URL using a compressed encoding format in order to fit more within the limited advertisement packet.\n\nOnce decoded, the URL can be used by any client with access to the internet. For example, if an Eddystone-URL beacon were to broadcast the URL `https://goo.gl/Aq18zF`, then any client that received this packet could choose to [visit that url](https://goo.gl/Aq18zF).\n\nThe Eddystone-URL frame forms the backbone of the [Physical Web](http://physical-web.org), an effort to enable frictionless discovery of web content relating to one’s surroundings. Eddystone-URL incorporates all of the learnings from the [UriBeacon](http://uribeacon.org) format from which it evolved.\n\n## [Eddystone-TLM](eddystone-tlm)\n\nThe Eddystone-TLM frame broadcasts telemetry information about the beacon itself such as battery voltage, device temperature, and counts of broadcast packets.\n\n## [Eddystone-EID](eddystone-eid)\n\nThe Eddystone-EID frame broadcasts an encrypted ephemeral identifier that changes periodically at a rate determined during the initial registration with a web service. The broadcast ephemeral ID can be resolved remotely by the service with which it was registered, but to other observers appears to be changing randomly. This frame type is intended for use in security and privacy-enhanced devices.\n"
        },
        {
          "name": "res",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}