{
  "metadata": {
    "timestamp": 1736710148134,
    "page": 806,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "emsec/ChameleonMini",
      "stars": 1763,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "Doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "Drivers",
          "type": "tree",
          "content": null
        },
        {
          "name": "Dumps",
          "type": "tree",
          "content": null
        },
        {
          "name": "Firmware",
          "type": "tree",
          "content": null
        },
        {
          "name": "Hardware",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 2.380859375,
          "content": "Copyright 2016 Timo Kasper, Simon Küppers, David Oswald\n(\"ORIGINAL AUTHORS\"). All rights reserved.\n\nDEFINITIONS:\n\n\"WORK\": The material covered by this license includes the schematic\ndiagrams, designs, circuit or circuit board layouts, mechanical\ndrawings, documentation (in electronic or printed form), source code,\nbinary software, data files, assembled devices, and any additional\nmaterial provided by the ORIGINAL AUTHORS in the ChameleonMini project\n(https://github.com/emsec/ChameleonMini).\n\nLICENSE TERMS:\n\nRedistributions and use of this WORK, with or without modification, or\nof substantial portions of this WORK are permitted provided that the\nfollowing conditions are met:\n\nRedistributions and use of this WORK, with or without modification, or\nof substantial portions of this WORK must include the above copyright\nnotice, this list of conditions, the below disclaimer, and the following\nattribution:\n\n\"Based on the open-source NFC tool ChameleonMini:\nhttps://github.com/emsec/ChameleonMini\"\n\nThe attribution must be clearly visible to a user, for example, by being\nprinted on the circuit board and an enclosure, and by being displayed by\nsoftware (both in binary and source code form).\n\nAt any time, the majority of the ORIGINAL AUTHORS may decide to give\nwritten permission to an entity to use or redistribute the WORK (with or\nwithout modification) WITHOUT having to include the above copyright\nnotice, this list of conditions, the below disclaimer, and the above\nattribution.\n\nDISCLAIMER:\n\nTHIS PRODUCT IS PROVIDED BY THE ORIGINAL AUTHORS \"AS IS\" AND ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE ORIGINAL AUTHORS OR CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS PRODUCT, EVEN IF ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGE.\n\nThe views and conclusions contained in the hardware, software, and\ndocumentation should not be interpreted as representing official\npolicies, either expressed or implied, of the ORIGINAL AUTHORS.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.125,
          "content": "Chameleon-Mini\n==============\nThis is the official repository of ChameleonMini, a freely programmable, portable tool for NFC security analysis that can emulate and clone contactless cards, read RFID tags and sniff/log RF data. Thanks to over 1700 backers from our [Kickstarter project](https://www.kickstarter.com/projects/1980078555/chameleonmini-a-versatile-nfc-card-emulator-and-mo), the current Revision G has been realized by Kasper & Oswald GmbH.\n\nThe ChameleonMini RevG is now also available via the Kasper & Oswald [Webshop](https://shop.kasper.it/). Thank you for supporting the project!\n\nIMPORTANT: Third-party Clones\n------------------\nWe are aware of various third-party ChameleonMini clones or modified variants that are available on the Internet. Warning: We have evidence that some of these devices are defective or suffer from reading problems et cetera. Please understand that we cannot give support for these non-official devices, as we have no schematics / layout or other information, nor do we know the manufacturers. In case of problems, please contact the manufacturers of your device directly.\n\nNote to the manufacturers: Some of the third-party ChameleonMini are violating the ChameleonMini license, please obey the license (see LICENSE.txt)!\n\nFirst Steps\n-----------\nTo upgrade the firmware of your ChameleonMini, please visit the [Getting Started page](https://cdn.statically.io/gh/emsec/ChameleonMini/master/Doc/Doxygen/html/Page_GettingStarted.html) from the [doxygen documentation](https://cdn.statically.io/gh/emsec/ChameleonMini/master/Doc/Doxygen/html/index.html).\n\nSupported Cards and Codecs\n--------------------------\nSee [here](https://github.com/emsec/ChameleonMini/wiki/Supported-Cards-and--Codecs). The linked wiki page also includes notes on DESFire emulation and certain cases of application specific emulation (Gallagher).\n\nQuestions\n---------\nIf you have any questions, please visit the [Issues page](https://github.com/emsec/ChameleonMini/issues) and ask your questions there so everyone benefits from the answer.\n\n**Please note that we cannot give any support if you have issues with the RevE-rebooted hardware or any GUI. Please use this issues page only for problems with the RevG hardware as distributed by Kasper & Oswald and for problems with the firmware from this page.** \n\nExternal Contributions\n----------------------\nWe appreciate every contribution to the project. Have a look at the [External Contributions page](https://github.com/emsec/ChameleonMini/wiki/External-Contributions).\n\nRepository Structure\n--------------------\nThe code repository contains\n* Doc: A doxygen documentation\n* Drivers: Chameleon drivers for Windows and Linux\n* Dumps: Dumps of different smartcards\n* Hardware: The layout and schematics of the PCB\n* Firmware: The complete firmware including a modified Atmel DFU bootloader and LUFA\n* Software: Contains a python tool for an easy configuration (and more) of the ChameleonMini, Note that this is currently under construction\n* RevE: Contains the whole contents of the discontinued RevE repository.\n* RevE-light: Contains our development files for the RevE-light - **WARNING:** currently not supported / not functional\n"
        },
        {
          "name": "RevE-light",
          "type": "tree",
          "content": null
        },
        {
          "name": "RevE",
          "type": "tree",
          "content": null
        },
        {
          "name": "Software",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}