{
  "metadata": {
    "timestamp": 1736709821347,
    "page": 282,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "axel-download-accelerator/axel",
      "stars": 3055,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.3486328125,
          "content": "/ABOUT-NLS\n/autom4te.cache/\n/build-aux/\n/m4/\n/po/Makefile.in.in\n/po/Makevars.template\n/po/POTFILES\n/po/Rules-quot\n/po/axel.pot\n/po/remove-potcdate.sed\n/po/stamp-po\n/axel\n/aclocal.m4\n/config.h\n/config.h.in\n/config.log\n/config.status\n/configure\n/stamp-h1\n.deps/\n.dirstamp\nMakefile\n!/man/Makefile\nMakefile.in\nTAGS\n*.[1-8]\n*.gmo\n*.o\n*.tar.*\n.#*\n.*.swp\n\\#*#*\n*~\n"
        },
        {
          "name": ".indent.pro",
          "type": "blob",
          "size": 0.1025390625,
          "content": "-nbad\n-bap\n-nbc\n-br\n-c33\n-cd33\n-ncdb\n-ce\n-ci4\n-cli0\n-d0\n-di1\n-nfc1\n-i8\n-nip\n-l80\n-lp\n-npcs\n-sob\n-sc\n-psl\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 1.2783203125,
          "content": "language: c\n\ncache:\n  ccache: true\n  directories:\n    - autom4te.cache\n    - m4\n\naddons:\n  apt:\n    packages:\n      - autoconf-archive\n      - autopoint\n      - clang\n      - libssl-dev\n      - linux-libc-dev\n      - txt2man\n      - gettext\n  homebrew:\n    update: true\n    packages:\n      - autoconf-archive\n      - gettext\n      - openssl\n      - pkg-config\n\nenv:\n  global:\n    - G_CFLAGS=\"-O3 -fPIC\"\n    - MAKEFLAGS=\"-j4\"\n    - target=distcheck\n  matrix:\n    - CONF_FLAGS=\"--with-ssl\"\n    - CONF_FLAGS=\"--without-ssl\"\n\nos:\n  - linux\n  - osx\n\ndist: focal\n\narch:\n  - amd64\n  - arm64\n  - ppc64le\n\ncompiler:\n  - gcc\n  - clang\n\njobs:\n  include:\n    - os: linux\n      dist: bionic\n    - os: linux\n      dist: xenial\n  exclude:\n    - os: osx\n      compiler: gcc\n  allow_failures:\n    - os: osx\n\nscript:\n  - if [ \"${TRAVIS_OS_NAME}\" = osx ]; then\n      target=all\n      GETTEXT=\"/usr/local/opt/gettext\"\n      OPENSSL=\"/usr/local/opt/openssl\";\n      export LIBRARY_PATH=\"$GETTEXT/lib\"\n             ACLOCAL_PATH=\"$GETTEXT/share/aclocal\"\n             CPATH=\"$OPENSSL/include:$GETTEXT/include\"\n             PKG_CONFIG_PATH=\"$OPENSSL/lib/pkgconfig\"\n             PATH=\"$GETTEXT/bin:$PATH\";\n    fi\n  - autoreconf -fiv\n  - ./configure $CONF_FLAGS CFLAGS=\"$G_CFLAGS\"\n  - make DIST_TARGETS=dist-gzip GZIP_ENV=--fast $target\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.4990234375,
          "content": "## HOW TO CONTRIBUTE TO AXEL DEVELOPMENT\n\nAxel is available at https://github.com/axel-download-accelerator/axel\n\nIf you are interested in contribute to axel development, please, follow\nthese steps:\n\n1. Send a patch that fix an issue or that implement a new feature.\n   Alternatively, you can do a 'pull request'[1] in GitHub.\n\n[1]: https://help.github.com/articles/using-pull-requests\n\n2. Ask for join to the Axel project in GitHub, if you want to work\n   officially. Note that this second step is not compulsory. However,\n   to accept you in project, is needed a minimum previous collaboration.\n\n\nTo find issues and bugs to fix, you can check these addresses:\n\n   - https://github.com/axel-download-accelerator/axel/issues\n   - https://bugs.debian.org/cgi-bin/pkgreport.cgi?dist=unstable;package=axel\n   - https://bugs.launchpad.net/ubuntu/+source/axel/+bugs\n   - https://apps.fedoraproject.org/packages/axel/bugs\n   - https://bugs.archlinux.org/?project=5&cat[]=33&string=axel\n   - https://bugs.gentoo.org/buglist.cgi?quicksearch=net-misc%2Faxel\n\nIf you want to join, please make a contact.\n\nThere is a group here[2] to discuss and to coordinate the development.\nYou can also find other developers in the #axel channel on freenode.\n\n[2]: https://groups.google.com/forum/#!forum/axel-accelerator-dev\n\n  -- Eriberto, Sun, 20 Mar 2016 16:27:53 -0300,\n     updated on Sun, 08 Sep 2017 23:27:00 -0300.\n\n## Submitting Changes\n\n### Coding style\nAs of version 2.15, Axel adopted a new coding style, very similar to that of the\nLinux Kernel, with the additional requirement to insert a newline after the\nreturn type of procedure declarations.\n\nTo aid the transition for imported code, an `.indent.pro` file is provided in\nthe top level source directory.  It should work with both GNU and BSD\nimplementations of `indent`, although the results may be slightly different.\n\nSmall variations are acceptable, and *non-compliance* in existing code, by\nitself, *is not something to fix*.\n\n### Conditions\nBy making a contribution to the project you certify that either you hold\ncopyright to the work; or you have obtained permission, or are implicitly\npermitted by the work's licensing terms (to the best of your knowledge), to\nsubmit it under a license compatible with the licensing terms of the project\n(See the Licensing section in this document).\n\nYou also understand that this project is public, and agree your contribution and\nall personal information submitted with it will be kept indefinitely and may be\nredistributed with the project.\n\nIn order to keep track of the source of a contribution, each party involved in\nthe sumbission must sign-off the commit, meaning that they abide by the\naforementioned rules.\n\n### Licensing\nAxel is provided under the terms of the GNU General Public License version 2 or\n(at your option) any later version, as described in the COPYING file, plus an\nexception for linking against OpenSSL 1.x.\n\nBy submitting code for inclusion in the project you agree to license it under\nthese terms, or more permissive ones.\n\nContributions made with a different licensing must state it explicitly in the\nfile header.\n\nHere's the wording in the header of each file licensed under GPL-2.0:\n\n\tThis program is free software; you can redistribute it and/or\n\tmodify it under the terms of the GNU General Public License\n\tas published by the Free Software Foundation; either version 2\n\tof the License, or (at your option) any later version.\n\n\tIn addition, as a special exception, the copyright holders give\n\tpermission to link the code of portions of this program with the\n\tOpenSSL library under certain conditions as described in each\n\tindividual source file, and distribute linked combinations including\n\tthe two.\n\n\tYou must obey the GNU General Public License in all respects for all\n\tof the code used other than OpenSSL. If you modify file(s) with this\n\texception, you may extend this exception to your version of the\n\tfile(s), but you are not obligated to do so. If you do not wish to do\n\tso, delete this exception statement from your version. If you delete\n\tthis exception statement from all source files in the program, then\n\talso delete it here.\n\n\tThis program is distributed in the hope that it will be useful,\n\tbut WITHOUT ANY WARRANTY; without even the implied warranty of\n\tMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n\tGNU General Public License for more details.\n\n\tYou should have received a copy of the GNU General Public License\n\talong with this program; if not, write to the Free Software\n\tFoundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.5654296875,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "ChangeLog",
          "type": "blob",
          "size": 27.771484375,
          "content": "Version: 2.17.14, 2024-04-07\n\n  [ Ismael Luceno ]\n\n* Remove inclusion of <stdatomic.h>\n* configure: Fix handling of --with-ssl=yes\n* configure: Force C89-compliant return type of signal handlers\n* configure: Update to autoconf 2.72\n* conn: Fix potential buffer overrun\n\n  [ Peng-Yu Chen ]\n\n* http: Fix filename parsing from Content-Disposition\n\n\n\nVersion: 2.17.13, 2024-02-06\n\n  [ Ismael Luceno ]\n\n  * abuf: Fix realloc usage\n  * configure: Fix handling of --with-ssl\n  * random: Initialize fd at startup\n\n\n\nVersion: 2.17.12, 2024-01-29\n   \n   [ Ahmet Arda Kavakcı ]\n\n* Fixed a wrong translation for Turkish\n\n  [ Cody M. Jones ]\n\n* Implemented early redirect loop detection\n\n  [ Elms ]\n\n* Added LGTM.com support\n\n  [ Ismael Luceno ]\n\n* Buildsystem improvements\n* Added wolfSSL support\n* Fixed potential int overflow\n* Simplified configuration support code\n* Early redirect loop detection improvements\n* Fixed speed-limiting sleep delay overflow\n* Removed HTTP encoding of URLs on the CLI, should be pre-encoded\n\n  [ Temuri Doghonadze ]\n\n* Added Georgian translation\n\n\n\nVersion: 2.17.11, 2021-12-19\n\n  [ Ismael Luceno ]\n\n* Fixed a deadlock in conn_info\n* Fixed build on FreeBSD (workaround for hidden typedefs)\n* Added SPDX license information\n* Improved reporting of HTTP status codes\n* Source-code simplifications\n* Buildsystem improvements\n  - Check intmax_t >= int64_t on Mac OS X\n  - Improved output when pkg-config is unavailable\n\n  [ Sean E. Russell ]\n\n* Implemented percentage output mode for piping\n\n  [ Dimitris Apostolou ]\n\n* Fixed typos\n\n  [ Ahmet Arda Kavakcı ]\n\n* Added Turkish Translation\n\n\n\nVersion: 2.17.10, 2020-11-22\n\n  [ Ismael Luceno ]\n\n* Portability improvements\n  - Made the stop signal handler portable\n* Made build system improvements\n  - Now you can specify where OpenSSL is installed\n  - Fixed MinGW detection\n  - Further improved portability\n* Bug fixes\n  - Potential null pointer dereference\n  - Fixed incrementig procedure for delay_time\n* Optimized wildcard search in URLs\n* Added human-readable file size report at the begining of downloads\n* Reworked Request Range support check\n* Added \"Accept-Encoding\" header to requests\n* Cleanup of Source Code\n* Updated the documentation\n* Updated translations\n\n  [ Tianyi Wang ]\n\n* Fixed speed limiting\n* Fixed data type for sizes and offsets on 32-bit systems\n* Fixed duplicated non-default port when using proxy\n* Fixed request range comparison and overflow\n\n  [ WhiredPlanck ]\n\n* Fixed typos and warnings in Simplified Chinese translation\n\n\n\nVersion: 2.17.9, 2020-04-06\n\n  [ Ismael Luceno ]\n\n* Added coding style aid and licensing rules to CONTRIBUTING.md.\n* Fixed some race conditions with conn_t.\n* Updated and improved README.md.\n* Cleanup of code & build system.\n* Added a new buffer handling abstraction.\n* Removed limitations on state file name length.\n* Removed limitations on HTTP query length.\n* Added some missing function documentation.\n* Fixed insecure mode certificate checking error.\n* Fixed progress bar for large number of connections.\n* Made the help flag report axel's version number.\n\n  [ Jason ]\n\n* Fixed a memory leak when deleting the download state file.\n* Improved the new buffer handling abstraction and ported HTTP header\n  handling to it.\n* Code cleanup.\n* Updated Chinese translation.\n\n\n\nVersion: 2.17.8, 2020-04-06\n\n  [ Ismael Luceno ]\n\n* Code cleanup, documentation, and build system improvements\n* Hostname wildcard matching support\n* Replaced progressbar line clearing with terminal control sequence\n* Updated translations: German, Italian, Japanese, Portuguese, Spanish\n\n  [ Jason ]\n\n* Fixed parsing of Content-Disposition HTTP header\n\n  [ Joao Eriberto Mota Filho ]\n\n* Added missing copyrights to headers\n\n  [ Ted Reed ]\n\n* Added SSL Certificate Hostname verification support\n\n  [ vewupom ]\n\n* Check if custom HTTP headers fit into add_header\n* Fixed User-Agent HTTP header never being included\n\n\n\nVersion: 2.17.7, 2020-01-26\n\n  [ Ismael Luceno ]\n\n* Buildsystem fixes\n* Fixed release date for man-pages on BSD\n\n  [ Park Ju Hyung ]\n\n* Explicitly close TCP sockets on SSL connections too\n\n  [ Shankar ]\n\n* Fixed HTTP basic auth header generation\n\n  [ Terry ]\n\n* Changed the default progress report to \"alternate output mode\"\n\n  [ retnikt ]\n\n* Improved English in README.md\n\n\n\nVersion: 2.17.6, 2019-08-29\n\n  [ Ismael Luceno ]\n\n* Fixed handling of non-recoverable HTTP errors\n* Cleanup of connection setup code\n* Fixed manpage reproducibility issue\n\n  [ Joao Eriberto Mota Filho ]\n\n* Use tracker instead of PTS from Debian\n\n\n\nVersion: 2.17.5, 2019-07-23\n\n  [ Evangelos Foutras ]\n\n* Fixed progress indicator misalignment\n\n  [ Ismael Luceno ]\n\n* Cleaned up the wget-like progress output code\n* Improved progress output flushing\n\n\n\nVersion: 2.17.4, 2019-07-19\n\n  [ Ismael Luceno ]\n\n* Fixed build with bionic libc (Android)\n* TCP Fast Open support on Linux\n* TCP code cleanup\n* Removed dependency on libm\n* Data types and format strings cleanup\n* String handling cleanup\n* Format string checking GCC attributes added\n* Buildsystem fixes and improvements\n* Updates to the documentation\n* Updated all translations\n\n  [ Jeong Ukjae ]\n\n* Fixed Footnotes in documentation\n\n  [ Joao Eriberto Mota Filho ]\n\n* Fixed a typo in README.md\n\n  [ Andrew Mussey ]\n\n* Fixed a typo in README.md\n\n\n\nVersion: 2.17.3, 2019-05-20\n\n  [ Ismael Luceno ]\n\n* Builds now use canonical host triplet instead of `uname -s`\n* Fixed build on Darwin / Mac OS X\n* Fixed download loops caused by last byte pointer being off by one\n* Fixed linking issues (i18n and posix threads)\n* Updated build instructions\n* Code cleanup\n\n  [ Kun Ma ]\n\n* Added autoconf-archive to building instructions\n\n\n\nVersion: 2.17.2, 2019-05-14\n\n  [ Ismael Luceno ]\n\n* Fixed HTTP request-ranges to be zero-based\n* Fixed typo \"too may\" -> \"too many\"\n* Replaced malloc + memset calls with calloc\n\n  [ Kun Ma ]\n\n* Sanitize progress bar buffer len passed to memset\n\n\n\nVersion: 2.17.1, 2019-05-10\n\n  [ Evangelos Foutras ]\n\n* Fixed comparison error in axel_divide\n\n  [ Ismael Luceno ]\n\n* Make sure maxconns is at least 1\n\n\n\nVersion: 2.17, 2019-05-08\n\n  [ Ismael Luceno ]\n\n* Fixed composition of URLs in redirections\n* Fixed request range calculation\n* Updated all translations\n* Updated build documentation\n* Major code cleanup\n    - Cleanup of alternate progress output\n    - Removed global string buffers\n    - Fixed min and max macros\n    - Moved User-Agent header to conf->add_header\n    - Use integers for speed ratio and delay calculation\n\n  [ Shankar ]\n\n* Added support for parsing IPv6 literal hostname\n* Fixed filename extraction from URL\n* Fixed request-target message to proxy\n* Handle secure protocol's schema even with SSL disabled\n* Fixed Content-Disposition filename value decoding\n* Strip leading hyphens in extracted filenames\n\n\n\nVersion: 2.16.1, 2017-12-05\n\n  [ Ismael Luceno ]\n\n* Fixed building against static OpenSSL\n\n\n\nVersion: 2.16, 2017-11-25\n\n  [ Ismael Luceno ]\n\n* Buildsystem fixes and improvements\n* Fixed bug that produces empty files with -q/--quiet\n* Fixed build with --disable-nls\n* Fixed formatting of the version/copyright message\n* Header files reorganization\n* Spanish translation\n* Style fixes\n* Updated Portuguese translation\n\n\n\nVersion: 2.15, 2017-10-11\n\n  [ Antonio Quartulli ]\n\n* Added a 65K limit on the number of connections\n* Fixed progress report when total size isn't available\n* Fixed size sanity check in HTTP Resp Header\n* Fixes to the usage/help text\n* Lots of security bugfixes\n* Made dependency on axel->conn in axel_close() explicit\n* Respect file size even when range request is not supported\n* Return error if socket can't be created\n\n  [ Casa Taloyum ]\n\n* Added some missing Simplified Chinese translation strings\n\n  [ Ismael Luceno ]\n\n* Added \"Accept\" HTTP header to the requests, required by some sites\n* Code cleanups and small bugfixes\n* Fixed User-Agent, now it's \"Axel/{VERSION} ({ARCH})\"\n* Fixed a race condition in the speed testing code\n* Implemented connection and I/O timeouts\n* Improvements to the buildsystem and scripts\n* Updates to the documentation\n\n  [ Mahyuddin ]\n\n* Indonesian translation\n\n  [Nicol Dalla Longa]\n\n* Italian translation\n\n\n\nVersion 2.14.1, 2017-09-16\n\n  [ Antonio Quartulli ]\n\n* Avoid stall due to missing unlock.\n\n  [ Ismael Luceno ]\n\n* Added some automation to help update the ChangeLog (mkchangelog).\n\n  [ Joao Eriberto Mota Filho ]\n\n* Updated ChangeLog, CREDITS .po files and configure.ac.\n\n\n\nVersion 2.14, 2017-09-10\n\n  [ Antonio Quartulli ]\n\n* Fixed redirection from HTTP to FTP.\n* Added Travis-CI support.\n* Added --no-clobber option.\n* Added port to Host HTTP header when different from service default.\n* Added option to choose between IPv4 and IPv6.\n* Alternate-output: use better representation.\n* Avoid bad-free when deallocating multiple URLs.\n* Avoid segfault when quiet and alternate behaviour are both specified.\n* Convert usleep to nanosleep.\n* Fixed compilation without SSL.\n* Fixed linking in macOS (don't link pthread).\n* Ensure alternate output can be setup and prevent crash.\n* Ensure 'progress' has space for null terminator.\n* Fixed several memory leaks.\n* Fixed a NULL dereference.\n* Fixed use-after-free of axel->conn member.\n* Implemented HTTP proxy authentication.\n* Improved code in option parsing routine.\n* Increased default number of max redirects to 20 and made it configurable.\n* Made axel thread safe.\n* Made SSL initialization race free.\n* Fixed race segfault upon connection to HTTPS server.\n* Fixed racy access to last_transfer.\n* Added mention to IRC channel in README and CONTRIBUTING files.\n* Reset 'enabled' attribute in conn_disconnect().\n* Use boolean variables as such.\n* Some minor fixes and changes.\n* Fixed build warnings.\n\n  [ Ismael Luceno ]\n\n* Simplified http_header.\n* Made HTTP the default protocol.\n* Report truncated state file properly.\n* Fixed linking against libintl in non-standard path.\n* Improved http_auth_token to avoid buffering.\n* Improved configuration parsing code.\n* Build system improvements.\n* Miscellaneous fixes and improvements.\n* Fixed several function prototypes.\n\n  [ Joao Eriberto Mota Filho ]\n\n* Added i18n for new messages.\n* Updated general docs, as AUTHORS and ChangeLog files.\n* Updated project homepage in all files.\n* Updated the copyright notices in all headers.\n* Updated the manpage.\n* Updated the pt_BR translation.\n* Updated the README.md file.\n* Final tests, release and Debian packaging.\n\n  [ Sumit Agrawal ]\n\n* Added guard to header files.\n\n\n\nVersion 2.13.1, 2017-08-03\n\n  [ Joao Eriberto Mota Filho ]\n\n* Updated .po files.\n\n\n\nVersion 2.13, 2017-08-02\n\n  [ David Polverari ]\n\n* Fixed URI encoding implementation.\n\n  [ Ismael Luceno ]\n\n* Fixed NULL dereferences and buffer allocation\n  (based on patch by: nemermollon <nemeralbano@hotmail.com>).\n* Fixed size of string[] buffer in text.c.\n* Implemented percent encoding/decoding primitives.\n* Improved axel_message to work under memory pressure.\n* Improved message_t queuing.\n* Made axel_close more robust.\n* Print messages instead of discarding them on axel_close.\n* Fixed a couple of NULL derefs when OOM.\n* Fixed various memory leaks and fd leaks.\n* Code cleanup and simplification.\n\n  [ Joao Eriberto Mota Filho ]\n\n* Some updates in README file.\n* Updated the translation for Brazilian Portuguese.\n* Updated the manpage version and date.\n\n  [ Stephen Thirlwall ]\n\n* Set TLS hostname in ssl_connect.\n\n  [ Vlad Glagolev ]\n\n* Fixed '--with-openssl' flag in configure.ac file.\n\n\n\nVersion 2.12, 2016-12-25\n\n  [ Denis Denisov ]\n\n* Made some adjustments in README.md file.\n\n  [ Joao Eriberto Mota Filho ]\n\n* Little adjustment in Makefile.am.\n\n  [ Lion Yang ]\n\n* Updated the translation to ja.\n\n  [ Mingcong Bai ]\n\n* Updated and fixed translation to zh_CN.\n\n  [ Phillip Berndt ]\n\n* Added a feature to extract file sizes from the Content-Range header. This\n  fix Axel downloading the file one byte short.\n\n  [ Stephen Thirlwall ]\n\n* Fixed 'rpl_malloc not found' when cross-compiling.\n* Implemented a test on SSL_new rather than OPENSSL_init_ssl to avoid a fail\n  to build from source.\n\n\n\nVersion 2.11, 2016-06-05\n\n  [ Sjjad Hashemian ]\n\n* Set SSL auto-retry mode. This fixes SSL WANT_READ error which causes\n  'Connection gone' error sometimes.\n\n\n\nVersion 2.10, 2016-06-04\n\n  [ Joao Eriberto Mota Filho ]\n\n* Stephen implemented SSL/TLS. Consequently, the licensing for Axel from now on\n  will be GPL-2+ with OpenSSL exception. All previous authors agree with that.\n  For details, see https://github.com/axel-download-accelerator/axel/issues/15.\n* Downgraded gettext minimum version to 0.18 in configure.ac. It will produce a\n  message 'AM_PROG_MKDIR_P macro is deprecated' when building, but that is\n  normal.\n* Fixed some fuzzy translations.\n* New code for autogen.sh, now with clean to vanish the source code.\n* Updated manpage.\n\n  [ Denis Denisov ]\n\n* Implemented the reactivation of connections from state file, similar to\n  dynamic segmentation.\n\n  [ Osamu Aoki ]\n\n*  Clarified the usage of multiple URLs in manpage.\n\n  [ Sjjad Hashemian ]\n\n* Specify filename from http header Content-Disposition (RFC 2616, Sec. 19.5.1).\n\n  [ Stephen Thirlwall ]\n\n* HTTPS/FTPS support using OpenSSL. \\o/\n* Implemented the --without-openssl option to build without SSL/TLS.\n* Updated the manpage.\n\n\n\nVersion 2.7, 2016-05-01\n\n  [ Joao Eriberto Mota Filho ]\n\n* Added new architectures to configure.ac.\n* Updated some points in configure.ac and Makefile.am.\n\n  [ Mridul Malpotra ]\n\n* Fixed num_connections error when invalid values are given.\n\n  [ Stephen Thirlwall ]\n\n* Add missing m4 path to configure.ac file.\n* Added the autogen.sh script.\n* Cleaned the source code, removing auto generated files.\n\n\n\nVersion 2.6, 2016-03-20\n\n  [ Joao Eriberto Mota Filho ]\n\n* Added the Brazilian Portuguese translation.\n* Moved all .c and .h to new /src directory.\n* Moved all .po files to new /po directory.\n* Moved some files to doc/ directory.\n* Renamed README.to-contribute to CONTRIBUTING.md.\n* Switched the build and install system to autotools.\n* Updated all copyright notices.\n\n  [ Ivan Gimenez ]\n\n* Fix several compilation warnings.\n\n  [ Stephen Thirlwall ]\n\n* Alterate display expands to terminal width.\n\n\n\nVersion 2.5, 2015-11-01\n\n  [ Joao Eriberto Mota Filho ] 2015-11-01\n\n* Changed the homepage of the project in several files.\n* axel.h: bumped to 2.5 version.\n* configure:\n    - Changed the default prefix to /usr.\n    - Changed the default etc path to /etc.\n    - Changed CFLAGS and LDFLAGS definition lines to allow external values,\n* as GCC hardening sent by Debian.\n* gui/: removed. The binary axel-kapt depended on kaptain that is no longer\n*   available for QT5 (dead upstream development). For details, see\n*   https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=789819\n* http.c: fix a possible buffer overflow.\n* Makefile: disabled the .po regeneration/merge actions to avoid changes in\n    source code when building. I will try to fix it in future.\n* manpage:\n    - Moved to man/ directory.\n    - Using txt2man to generate the manpage.\n    - Updated the manpage.\n    - Removed some typos.\n    - Dropped the Chinese manpage (outdated now).\n* README.md: added to be the main file for GitHub.\n* README.to-contribute: added to explain how to contribute.\n\n  [ Barry deFreese ] 2009-06-11\n\n* Added Hurd (GNU) to configure file. It will allow Axel to build over\n  GNU/Hurd. This change was provided by Barry deFreese <bdefreese@debian.org>,\n  as a patch to Debian project, on 11 Jun 2009. For details, see\n  https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=532793\n\n  [ Mark Smith ] 2010-07-03\n\n* Added a support to IPv6. This change was provided by\n  Mark Smith <nanog@85d5b20a518b8f6864949bd940457dc124746ddc.nosense.org>,\n  as a patch to Debian project, on 03 Jul 2010. For details, see\n  https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=525290\n\n  [ unknown person ] 2010-08-19\n\n* Fixed incorrect unit of time in download summary. For details see\n  https://alioth.debian.org/tracker/index.php?func=detail&aid=312669&group_id=100070&atid=413085\n\n  [ unknown person ] 2011-04-12\n\n*  Fixed an issue that produces a Bad HTTP Request when 302 redirected link is\n   longer than 255 chars (like youtube). For details, see\n   https://alioth.debian.org/tracker/index.php?func=detail&aid=313080&group_id=100070&atid=413085\n\n  [ Osamu Aoki ] 2012-03-10\n\n* Added the translation to Japanese. See\n  https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=663286 and\n  https://alioth.debian.org/tracker/index.php?func=detail&aid=313565&group_id=100070&atid=413085\n* Changed the configure file to honor the noopt when building. So, was removed\n  the '-Os' option. See https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=645271\n\n  [ From original authors ]\n\n* Releasing this old block (written after 2.4 and before 2.5 versions):\n\n  - Make axel build on HP-UX, thanks Ciro Iriarte\n  - Fix Solaris support (Closes: #312092), thanks Sebastian Kayser\n  - Add PO-Revision-Date header to ru.po\n\n\n\nVersion 2.4\n\n- Fix a buffer overflow caused by wrong size limits  when copying strings (Closes: #311569), thanks Michael Schwendt and the Fedora project members\n- Fix thread hangups due to incorrect synchronization (Closes: #311469), thanks Yao Shi\n- Removed Fedora packaging file. axel will be available in the Fedora repositories soon.\n- Use /etc/ instead of /usr/etc/ as the default system-wide configuration location.\n- Respect environment CFLAGS in configure.\n- Allow special characters in arguments to configure.\n- Add MimeType and fix Categories in the desktop file.\n\n\n\nVersion 2.3\n\n- Wait for thread termination in axel.c:axel_do (Closes: #311255), thanks John Ripa\n- New Chinese translation and manpage, thanks Shuge Lee\n- Fix LFS support for FTP (Closes: #311320)\n- Fix LFS support (Closes: #311324), thanks Rodrigue Le Bayon\n\n\n\nVersion 2.2:\n\n- Fix a buffer overflow in http.c:http_encode.\n\n\n\nVersion 2.1:\n\n- Fix version string.  2.0 still reported 1.1, thanks Ajay R Ramjatan\n- Fix new MB/s display (was showing B/s).  Thanks Philipp Hagemeister\n\n\n\nVersion 2.0:\n\n- Large file support thanks thanks David Turnbull\n- Custom Header Support thanks Eli Yukelzon\n- New Russian translation thanks newhren\n- Fix segfault in -H option thanks Philipp Hagemeister\n- Honour http_proxy and prefer it over HTTP_PROXY\n- Add new RPM spec file thanks bbbush\n\nFinished Sep 12 2008\n\n\n\nVersion 1.1:\n\n- Compilation for GNU/kFreeBSD, thanks to Cyril Brulebois\n- Use simple pop-ups for Help and Bug Report buttons\n- Use strncpy instead of strcpy for length sensitive copies\n- Always compile with -g, disable -O3\n- Translation updates: de.po thanks Hermann J. Beckers\n- Update manpages axel.1 and axel-kapt.1\n- Prevent crash and raise error if FTP CWD fails\n- Prevent crash on long URLs and increase max length of URL to 1024\n- Fix segfaults on HTTP404 and HTTP401 responses\n\nFinished Jan 18 2008\n\n\n\nVersion 1.0b:\n- Removed spaces between -S[x] in man-pages, etc. They mess things up.\n- Fixed configure for OpenBSD.\n- Fixed configuration bug: s/alternate_interface/alternate_output/ in\n  axelrc.example, thanks to CLOTILDE Guy Daniel for the bug report!\n- Fixed weird behaviour when downloading from an unsupported server.\n- Fixed buffer overflow in conn.c. (CAN-2005-0390)\n\nFinished Apr 06 2005\n\n\nVersion 1.0a:\n- gstrip on Solaris/SPARC breaks the binary, so stripping is made optional\n  (but enabled by default!) and /usr/ccs/bin/strip is used instead of\n  gstrip.\n- Fixed a small (not harmful) errorcode interpretation bug in the ftp_size\n  code.\n- Downloading from unsupported sites works better now.\n- Added support for downloading using more than one local network interface.\n- Fixed a potential SIGSEGV bug. Would only happen with about more than 64\n  connections usually. Still strange things can happen with too many\n  connections when using Linux..\n- Hopefully fixed the problem with downloading from forwarding URL's.\n- HTTP %-escapes are handled now.\n- Alternate progress indicator with estimation of remaining download time\n- Changed the return-code a bit, see man-page for details.\n\nFinished Feb 19 2002\n\n\nVersion 1.0:\n- Fixed a reconnect problem: Check for stalled connections was skipped by\n  previous versions if there is no active connection.\n- Solaris does not have www in /etc/services which confused Axel. Fixed.\n- Created a new build system.\n- install utility not used anymore: Solaris' install does weird things.\n- Added support for Cygwin and Solaris.\n- Corrected a little problem in de.po.\n- Thrown out the packaging stuff.\n\nFinished Dec 6 2001\n\n\nVersion 0.99b brings you:\n- Debian package bugfix.\n- Restored i18n support.\n\nFinished Nov 16 2001\n\n\nVersion 0.99a brings you:\n- Small bugfix for dumb HTTP bug.\n\nFinished Nov 10 2001\n\n\nVersion 0.99 brings you:\n- Improved speed limiter. (For low speeds a smaller buffer works better,\n  so the buffer is resized automatically for low speeds.)\n- Some FTP servers don't ask for a password which confused ftp.c. Fixed.\n- Some HTTP servers send chunked data when using HTTP/1.1. So I went back\n  to HTTP/1.0.. (This also fixes the occasional filesearching.com problem)\n- Even more problems with FTP server reply codes, but they must be fixed\n  now, Axel's RFC compliant.\n- For HTTP downloads a Range: header is not sent when downloading starting\n  at byte 0. This is just a work-around for a problem with a weird webserver\n  which sends corrupted data when a Range: header is sent. It's just a\n  work-around for a rare problem, it does not really fix anything.\n- RPM package for axel-kapt added.\n\nFinished Nov 9 2001\n\n\nVersion 0.98 brings you:\n- Fixed the weird percentage indicator bug. (Was buggy for large files,\n  did not affect the downloaded data.)\n- For single connection downloads from Apache: Apache returns a 200 result\n  code when the specified file range is the complete file. Axel handles\n  this correctly now.\n- Roxen FTP servers return the address and port number without brackets\n  after a passive command. This is RFC-compliant but quite unique. But now\n  handled correctly.\n- Fixed some things to make it work on Darwin again.\n- 'Upgraded' HTTP requests to HTTP/1.1. Tried this to fix a download\n  corruption bug for downloads from archive.progeny.com, but it did not\n  work. wget's resume has exactly the same problem. But using HTTP/1.1 is\n  more compliant (because in fact HTTP/1.0 does not support Ranges) so I'll\n  keep it this way..\n- Previous version used to delete the statefile in some cases. Fixed.\n\nFinished Nov 3 2001\n\n\nVersion 0.97 (Bitcrusher) brings you:\n- Major redesign: Moved a lot of code from main() to separate functions,\n  it should make it easier to create different interfaces for the program.\n- All those ifdefs were a mess, they don't exist anymore. Separate threads\n  for setting up connections are used by default now. Version 0.96 will not\n  disappear, by the way.\n- HTTP HEAD request not used anymore: Squid's headers are incorrect when\n  using the HEAD request.\n- conn_disconnect did not work for FTP connections through HTTP proxies.\n- Documentation fix, sort of: The example configuration file still said\n  proxies are unsupported. But they are supported for quite some time\n  already.\n- Wrote a small (Small? Larger than any other doc.. :-) description of the\n  Axel API.\n- Added finish_time code. (Credits to sjoerd@huiswerkservice.nl)\n- Calling conn_setup without calling conn_init first also works when using\n  a proxy now.\n- A client for filesearching.com. You can use it to search for mirrors and\n  download from more than mirror at once.\n- Fixed another segfault bug which did not show up on my own system...\n  Also fixed by 0.96a.\n- Global error string is gone. Unusable in threaded programs.\n- The -V switch stopped working some time ago because I forgot to put it\n  in the getopt string. Now it's back, alive and kickin'...\n- TYPE I should be done quite early. Some servers return weird file sizes\n  when still in ASCII mode.\n- ftp.c (ftp_wait) sometimes resized conn->message to below MAX_STRING\n  which is Not Good(tm).\n- I18N support is a bit broken at this time, it'll be fixed later.\n- Tidied up the man-page a bit.\n- Removed config.h file, -D flags used again.\n- Added axel-kapt interface.\n- Changed syntax: Local file must be specified using the -o option now.\n  This allows the user to specify more than one URL and all of them will\n  be used for the download. A local directory can be passed as well, the\n  program will append the correct filename.\n- Fixed a bug which caused the program not to be able to download files\n  for which only one byte has to be downloaded for one of the connections.\n- Why bitcrusher? Just because I liked to have a code name for this\n  release... Bit crusher is a name of a musical group here in the\n  Netherlands, and it's a nice name for a downloader as well, I hope...\n\nFinished Oct 25 2001\n\n\nVersion 0.96 brings you:\n- Fixed a terrible bug which caused any FTP download to corrupt. I promise\n  I will test the program before any next release. :-(( HTTP did work in\n  0.95.\n\nFinished Aug 14 2001 (Why is this fix so late? Because the actual release\nof version 0.95 was only last Friday/Saturday...)\n\nAnd yes, I tested it now. It works now. HTTP and FTP.\n\n\nVersion 0.95 brings you:\n- An important bugfix: When bringing up the connection failed, the program\n  used to be unable to reconnect. :(\n- Small changes to make the program compile on FreeBSD and Darwin.\n- Support check for FTP servers is done only once now.\n- SIZE command is really used now.\n- Fixed a SIGINT-does-not-abort problem. Btw: Ctrl-\\ (SIGQUIT) always works!\n- Connection status messages are not displayed by default. You can enable\n  them with the verbose-option.\n\nFinished Aug 7 2001\n\n\nVersion 0.94 brings you:\n- 'make install' uses install instead of mkdir/cp now.\n- Added 'make uninstall' option.\n- Added more explanations to axelrc.example.\n- It uses the HTTP HEAD request now. Didn't know that one before. :)\n- Debian packaging stuff and RPM .spec file included by default.\n- select() problem now really understood... The real point was, that\n  sometimes select() was called with an empty fd set. Now I solved the\n  problem in a more 'useful' way.\n\nFinished Jun 26 2001\n\n\nVersion 0.93 brings you:\n- A compile-time option to remove all the multi-connection stuff. Program\n  works without state files then, and it's a bit smaller, just in case you\n  need a very small program and if you don't believe in acceleration. :)\n- The SIZE command is now used as long as the URL does not contain wildcards.\n  Because FTP servers are just too different. :(\n- You can do FTP downloads through HTTP proxies now.\n- The weird initial 1-second delay which happened sometimes does not exist\n  anymore: It was because of select(), which does not return immediately\n  if there's data on a socket before the call starts. My first solution\n  is using a lower timeout, I hope there's a better solution available...\n- Local file existence check.\n- Small bug fixed in conf.c.\n\nFinished May 22 2001\n\n\nVersion 0.92 brings you:\n- A credits file!! ;)\n- A German translation. Herrman J. Beckers: Thanks a lot!\n- ftp.c should understand weird Macintosh FTP servers too, now.\n- Connections are initialized in a different thread because then the program\n  can go on downloading data from other connections while setting up. Quick\n  hack, but it works.\n- config.h contains the configuration definitions now.\n- A URL - can be specified. The program will read a URL from stdin. Might\n  be useful if you don't want other people to see the URL in the 'ps aux'\n  output. (Think about passwords in URLs...)\n\nFinished May 11 2001\n\n\nVersion 0.91 brings you:\n- A man page.\n- A quiet mode.\n- A Debian package. (0.9 .deb exists too, but that was after the 'official'\n  0.9 release..)\n- Made the sizes/times displayed after downloading more human-readable.\n- Corrected some stupid things in the nl.po file.\n- No bug in ftp_wait anymore, (or at least one bug less ;) the program was a\n  bit too late with the realloc() sometimes. I just hate those multi-line\n  replies.. :(\n- HTTP proxy support. no_proxy configuration flag also in use.\n- Support for empty configuration strings.\n- URL parser understands wrongly formatted URLs like slashdot.org. (instead\n  of the correct http://slashdot.org/)\n\nFinished Apr 30 2001\n\n\nVersion 0.9 brings you:\n- See the README for all the old features.\n- Internationalization support.\n- Clearer error messages.\n- Probably some bug fixes too.\n- A highly sophisticated Makefile.. ;)\n\nFinished Apr 22 2001\n"
        },
        {
          "name": "INSTALL",
          "type": "blob",
          "size": 15.3828125,
          "content": "Installation Instructions\n*************************\n\nCopyright (C) 1994-1996, 1999-2002, 2004-2013 Free Software Foundation,\nInc.\n\n   Copying and distribution of this file, with or without modification,\nare permitted in any medium without royalty provided the copyright\nnotice and this notice are preserved.  This file is offered as-is,\nwithout warranty of any kind.\n\nBasic Installation\n==================\n\n   Briefly, the shell command `./configure && make && make install'\nshould configure, build, and install this package.  The following\nmore-detailed instructions are generic; see the `README' file for\ninstructions specific to this package.  Some packages provide this\n`INSTALL' file but do not implement all of the features documented\nbelow.  The lack of an optional feature in a given package is not\nnecessarily a bug.  More recommendations for GNU packages can be found\nin *note Makefile Conventions: (standards)Makefile Conventions.\n\n   The `configure' shell script attempts to guess correct values for\nvarious system-dependent variables used during compilation.  It uses\nthose values to create a `Makefile' in each directory of the package.\nIt may also create one or more `.h' files containing system-dependent\ndefinitions.  Finally, it creates a shell script `config.status' that\nyou can run in the future to recreate the current configuration, and a\nfile `config.log' containing compiler output (useful mainly for\ndebugging `configure').\n\n   It can also use an optional file (typically called `config.cache'\nand enabled with `--cache-file=config.cache' or simply `-C') that saves\nthe results of its tests to speed up reconfiguring.  Caching is\ndisabled by default to prevent problems with accidental use of stale\ncache files.\n\n   If you need to do unusual things to compile the package, please try\nto figure out how `configure' could check whether to do them, and mail\ndiffs or instructions to the address given in the `README' so they can\nbe considered for the next release.  If you are using the cache, and at\nsome point `config.cache' contains results you don't want to keep, you\nmay remove or edit it.\n\n   The file `configure.ac' (or `configure.in') is used to create\n`configure' by a program called `autoconf'.  You need `configure.ac' if\nyou want to change it or regenerate `configure' using a newer version\nof `autoconf'.\n\n   The simplest way to compile this package is:\n\n  1. `cd' to the directory containing the package's source code and type\n     `./configure' to configure the package for your system.\n\n     Running `configure' might take a while.  While running, it prints\n     some messages telling which features it is checking for.\n\n  2. Type `make' to compile the package.\n\n  3. Optionally, type `make check' to run any self-tests that come with\n     the package, generally using the just-built uninstalled binaries.\n\n  4. Type `make install' to install the programs and any data files and\n     documentation.  When installing into a prefix owned by root, it is\n     recommended that the package be configured and built as a regular\n     user, and only the `make install' phase executed with root\n     privileges.\n\n  5. Optionally, type `make installcheck' to repeat any self-tests, but\n     this time using the binaries in their final installed location.\n     This target does not install anything.  Running this target as a\n     regular user, particularly if the prior `make install' required\n     root privileges, verifies that the installation completed\n     correctly.\n\n  6. You can remove the program binaries and object files from the\n     source code directory by typing `make clean'.  To also remove the\n     files that `configure' created (so you can compile the package for\n     a different kind of computer), type `make distclean'.  There is\n     also a `make maintainer-clean' target, but that is intended mainly\n     for the package's developers.  If you use it, you may have to get\n     all sorts of other programs in order to regenerate files that came\n     with the distribution.\n\n  7. Often, you can also type `make uninstall' to remove the installed\n     files again.  In practice, not all packages have tested that\n     uninstallation works correctly, even though it is required by the\n     GNU Coding Standards.\n\n  8. Some packages, particularly those that use Automake, provide `make\n     distcheck', which can by used by developers to test that all other\n     targets like `make install' and `make uninstall' work correctly.\n     This target is generally not run by end users.\n\nCompilers and Options\n=====================\n\n   Some systems require unusual options for compilation or linking that\nthe `configure' script does not know about.  Run `./configure --help'\nfor details on some of the pertinent environment variables.\n\n   You can give `configure' initial values for configuration parameters\nby setting variables in the command line or in the environment.  Here\nis an example:\n\n     ./configure CC=c99 CFLAGS=-g LIBS=-lposix\n\n   *Note Defining Variables::, for more details.\n\nCompiling For Multiple Architectures\n====================================\n\n   You can compile the package for more than one kind of computer at the\nsame time, by placing the object files for each architecture in their\nown directory.  To do this, you can use GNU `make'.  `cd' to the\ndirectory where you want the object files and executables to go and run\nthe `configure' script.  `configure' automatically checks for the\nsource code in the directory that `configure' is in and in `..'.  This\nis known as a \"VPATH\" build.\n\n   With a non-GNU `make', it is safer to compile the package for one\narchitecture at a time in the source code directory.  After you have\ninstalled the package for one architecture, use `make distclean' before\nreconfiguring for another architecture.\n\n   On MacOS X 10.5 and later systems, you can create libraries and\nexecutables that work on multiple system types--known as \"fat\" or\n\"universal\" binaries--by specifying multiple `-arch' options to the\ncompiler but only a single `-arch' option to the preprocessor.  Like\nthis:\n\n     ./configure CC=\"gcc -arch i386 -arch x86_64 -arch ppc -arch ppc64\" \\\n                 CXX=\"g++ -arch i386 -arch x86_64 -arch ppc -arch ppc64\" \\\n                 CPP=\"gcc -E\" CXXCPP=\"g++ -E\"\n\n   This is not guaranteed to produce working output in all cases, you\nmay have to build one architecture at a time and combine the results\nusing the `lipo' tool if you have problems.\n\nInstallation Names\n==================\n\n   By default, `make install' installs the package's commands under\n`/usr/local/bin', include files under `/usr/local/include', etc.  You\ncan specify an installation prefix other than `/usr/local' by giving\n`configure' the option `--prefix=PREFIX', where PREFIX must be an\nabsolute file name.\n\n   You can specify separate installation prefixes for\narchitecture-specific files and architecture-independent files.  If you\npass the option `--exec-prefix=PREFIX' to `configure', the package uses\nPREFIX as the prefix for installing programs and libraries.\nDocumentation and other data files still use the regular prefix.\n\n   In addition, if you use an unusual directory layout you can give\noptions like `--bindir=DIR' to specify different values for particular\nkinds of files.  Run `configure --help' for a list of the directories\nyou can set and what kinds of files go in them.  In general, the\ndefault for these options is expressed in terms of `${prefix}', so that\nspecifying just `--prefix' will affect all of the other directory\nspecifications that were not explicitly provided.\n\n   The most portable way to affect installation locations is to pass the\ncorrect locations to `configure'; however, many packages provide one or\nboth of the following shortcuts of passing variable assignments to the\n`make install' command line to change installation locations without\nhaving to reconfigure or recompile.\n\n   The first method involves providing an override variable for each\naffected directory.  For example, `make install\nprefix=/alternate/directory' will choose an alternate location for all\ndirectory configuration variables that were expressed in terms of\n`${prefix}'.  Any directories that were specified during `configure',\nbut not in terms of `${prefix}', must each be overridden at install\ntime for the entire installation to be relocated.  The approach of\nmakefile variable overrides for each directory variable is required by\nthe GNU Coding Standards, and ideally causes no recompilation.\nHowever, some platforms have known limitations with the semantics of\nshared libraries that end up requiring recompilation when using this\nmethod, particularly noticeable in packages that use GNU Libtool.\n\n   The second method involves providing the `DESTDIR' variable.  For\nexample, `make install DESTDIR=/alternate/directory' will prepend\n`/alternate/directory' before all installation names.  The approach of\n`DESTDIR' overrides is not required by the GNU Coding Standards, and\ndoes not work on platforms that have drive letters.  On the other hand,\nit does better at avoiding recompilation issues, and works well even\nwhen some directory options were not specified in terms of `${prefix}'\nat `configure' time.\n\nOptional Features\n=================\n\n   If the package supports it, you can cause programs to be installed\nwith an extra prefix or suffix on their names by giving `configure' the\noption `--program-prefix=PREFIX' or `--program-suffix=SUFFIX'.\n\n   Some packages pay attention to `--enable-FEATURE' options to\n`configure', where FEATURE indicates an optional part of the package.\nThey may also pay attention to `--with-PACKAGE' options, where PACKAGE\nis something like `gnu-as' or `x' (for the X Window System).  The\n`README' should mention any `--enable-' and `--with-' options that the\npackage recognizes.\n\n   For packages that use the X Window System, `configure' can usually\nfind the X include and library files automatically, but if it doesn't,\nyou can use the `configure' options `--x-includes=DIR' and\n`--x-libraries=DIR' to specify their locations.\n\n   Some packages offer the ability to configure how verbose the\nexecution of `make' will be.  For these packages, running `./configure\n--enable-silent-rules' sets the default to minimal output, which can be\noverridden with `make V=1'; while running `./configure\n--disable-silent-rules' sets the default to verbose, which can be\noverridden with `make V=0'.\n\nParticular systems\n==================\n\n   On HP-UX, the default C compiler is not ANSI C compatible.  If GNU\nCC is not installed, it is recommended to use the following options in\norder to use an ANSI C compiler:\n\n     ./configure CC=\"cc -Ae -D_XOPEN_SOURCE=500\"\n\nand if that doesn't work, install pre-built binaries of GCC for HP-UX.\n\n   HP-UX `make' updates targets which have the same time stamps as\ntheir prerequisites, which makes it generally unusable when shipped\ngenerated files such as `configure' are involved.  Use GNU `make'\ninstead.\n\n   On OSF/1 a.k.a. Tru64, some versions of the default C compiler cannot\nparse its `<wchar.h>' header file.  The option `-nodtk' can be used as\na workaround.  If GNU CC is not installed, it is therefore recommended\nto try\n\n     ./configure CC=\"cc\"\n\nand if that doesn't work, try\n\n     ./configure CC=\"cc -nodtk\"\n\n   On Solaris, don't put `/usr/ucb' early in your `PATH'.  This\ndirectory contains several dysfunctional programs; working variants of\nthese programs are available in `/usr/bin'.  So, if you need `/usr/ucb'\nin your `PATH', put it _after_ `/usr/bin'.\n\n   On Haiku, software installed for all users goes in `/boot/common',\nnot `/usr/local'.  It is recommended to use the following options:\n\n     ./configure --prefix=/boot/common\n\nSpecifying the System Type\n==========================\n\n   There may be some features `configure' cannot figure out\nautomatically, but needs to determine by the type of machine the package\nwill run on.  Usually, assuming the package is built to be run on the\n_same_ architectures, `configure' can figure that out, but if it prints\na message saying it cannot guess the machine type, give it the\n`--build=TYPE' option.  TYPE can either be a short name for the system\ntype, such as `sun4', or a canonical name which has the form:\n\n     CPU-COMPANY-SYSTEM\n\nwhere SYSTEM can have one of these forms:\n\n     OS\n     KERNEL-OS\n\n   See the file `config.sub' for the possible values of each field.  If\n`config.sub' isn't included in this package, then this package doesn't\nneed to know the machine type.\n\n   If you are _building_ compiler tools for cross-compiling, you should\nuse the option `--target=TYPE' to select the type of system they will\nproduce code for.\n\n   If you want to _use_ a cross compiler, that generates code for a\nplatform different from the build platform, you should specify the\n\"host\" platform (i.e., that on which the generated programs will\neventually be run) with `--host=TYPE'.\n\nSharing Defaults\n================\n\n   If you want to set default values for `configure' scripts to share,\nyou can create a site shell script called `config.site' that gives\ndefault values for variables like `CC', `cache_file', and `prefix'.\n`configure' looks for `PREFIX/share/config.site' if it exists, then\n`PREFIX/etc/config.site' if it exists.  Or, you can set the\n`CONFIG_SITE' environment variable to the location of the site script.\nA warning: not all `configure' scripts look for a site script.\n\nDefining Variables\n==================\n\n   Variables not defined in a site shell script can be set in the\nenvironment passed to `configure'.  However, some packages may run\nconfigure again during the build, and the customized values of these\nvariables may be lost.  In order to avoid this problem, you should set\nthem in the `configure' command line, using `VAR=value'.  For example:\n\n     ./configure CC=/usr/local2/bin/gcc\n\ncauses the specified `gcc' to be used as the C compiler (unless it is\noverridden in the site shell script).\n\nUnfortunately, this technique does not work for `CONFIG_SHELL' due to\nan Autoconf limitation.  Until the limitation is lifted, you can use\nthis workaround:\n\n     CONFIG_SHELL=/bin/bash ./configure CONFIG_SHELL=/bin/bash\n\n`configure' Invocation\n======================\n\n   `configure' recognizes the following options to control how it\noperates.\n\n`--help'\n`-h'\n     Print a summary of all of the options to `configure', and exit.\n\n`--help=short'\n`--help=recursive'\n     Print a summary of the options unique to this package's\n     `configure', and exit.  The `short' variant lists options used\n     only in the top level, while the `recursive' variant lists options\n     also present in any nested packages.\n\n`--version'\n`-V'\n     Print the version of Autoconf used to generate the `configure'\n     script, and exit.\n\n`--cache-file=FILE'\n     Enable the cache: use and save the results of the tests in FILE,\n     traditionally `config.cache'.  FILE defaults to `/dev/null' to\n     disable caching.\n\n`--config-cache'\n`-C'\n     Alias for `--cache-file=config.cache'.\n\n`--quiet'\n`--silent'\n`-q'\n     Do not print messages saying which checks are being made.  To\n     suppress all normal output, redirect it to `/dev/null' (any error\n     messages will still be shown).\n\n`--srcdir=DIR'\n     Look for the package's source code in directory DIR.  Usually\n     `configure' can determine that directory automatically.\n\n`--prefix=DIR'\n     Use DIR as the installation prefix.  *note Installation Names::\n     for more details, including other options available for fine-tuning\n     the installation locations.\n\n`--no-create'\n`-n'\n     Run the configure checks, but stop before creating any output\n     files.\n\n`configure' also accepts some other, not widely useful, options.  Run\n`configure --help' for more details.\n"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 1.0908203125,
          "content": "AUTOMAKE_OPTIONS = foreign dist-bzip2 dist-xz\n\n# XXX Fix disagreement between aclocal and make\n# (aclocal doesn't update based on mtime)\nACLOCAL = touch $@; @ACLOCAL@\n\nSUBDIRS = po\n\nEXTRA_DIST = \\\n\tscripts/pocheck.awk \\\n\tREADME.md \\\n\tCONTRIBUTING.md\n\ninclude doc/Makefile.am\n\ndistclean-local:\n\t-rm -rf autom4te.cache\n\t-rm -f  *~ po/*~ po/*.gmo src/*~\n\ndist-hook:\n\trm -rf $(distdir)/.git\n\tread _ RELDATE _ < $(top_srcdir)/VERSION; \\\n\tTZ= find $(distdir) -exec touch -d \"$$RELDATE\" '{}' +\n\nMSG = echo '==>'\nERR = ! echo '!!! ERROR:'\n.PHONY: relcheck update-po\nupdate-po:\n\t$(MAKE) -C po update-po\nrelcheck: update-po\n\t@$(MSG) 'Checking for non-UTF8 translations...'\n\t@$(AWK) -f $(top_srcdir)/scripts/pocheck.awk $(top_srcdir)/po/*.po\n\t@$(MSG) 'Checking the state of the project...'\n\t@ m=`git status --porcelain=1 | wc -l`; \\\n\ttest \"$$m\" = 0 \\\n\t\t&& $(MSG) 'the working tree is clean' \\\n\t\t|| $(ERR) \"$$m\" 'modified files in the working tree'\n\t@test -f \"$(top_srcdir)/.git/refs/tags/v$(VERSION)\" \\\n\t\t&& $(MSG) 'v$(VERSION) tag found' \\\n\t\t|| $(ERR) 'v$(VERSION) tag missing'\n\t@$(MSG) Everything OK\n\n\ninclude src/Makefile.am\n"
        },
        {
          "name": "NEWS",
          "type": "blob",
          "size": 0.0625,
          "content": "Since 2.10 version, Axel supports HTTPS/FTPS downloads.\n\nEnjoy!\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.7939453125,
          "content": "# AXEL - Lightweight CLI download accelerator\n\n## About\n\nAxel tries to accelerate the download process by using multiple\nconnections per file, and can also balance the load between\ndifferent servers.\n\nAxel tries to be as light as possible, so it might be useful on\nbyte-critical systems.\n\nAxel supports HTTP, HTTPS, FTP and FTPS protocols.\n\nThanks to the original developer of Axel, Wilmer van der Gaast, and everyone\nelse who has contributed to it over the years.\n\n## Usage\n\nFor usage information, see the manual page:\n\n    man axel\n\n## How to help\nIf you can code and are interested in improving Axel, please read the\n[CONTRIBUTING.md](CONTRIBUTING.md) file; if you're looking for ideas check our\n[open tickets](https://github.com/axel-download-accelerator/axel/issues/).\n\nAdditionally, there is a\n[google group](https://groups.google.com/forum/#!forum/axel-accelerator-dev) to\ndiscuss and to coordinate development. You can also find other developers in the\n`#axel` channel on [Freenode](https://freenode.net/).\n\nThe sustainability of the project mainly depends on developers dedicating time,\nso if you want to contribute but can't code, there's also the option to fund\npaid development time through:\n\n- *Ismael Luceno*\n  + [Github Sponsors](https://github.com/sponsors/ismaell)\n  + [![Patreon](https://c5.patreon.com/external/logo/become_a_patron_button.png)](https://www.patreon.com/ismaell)\n  + [![Liberapay](https://liberapay.com/assets/widgets/donate.svg)](https://liberapay.com/ismael/donate)\n\n## Installing from binaries\nYour operating system may contain a precompiled version of Axel, and if so you\nshould probably use it.  If the package is outdated please get in touch with the\npackage maintainer or open a support ticket with your distro.\n\n## Building from source\nWARNING: Building from the source code repository is recommended only when doing\ndevelopment, otherwise only use release tarballs.\n\nAxel uses GNU autotools for it's buildsystem; instructions are provided in the\n[INSTALL](INSTALL) file. The basic actions for most users are:\n\n    ./configure && make && make install\n\nTo build without SSL/TLS support, pass to `configure` the `--without-ssl` flag.\n\nIf you're working from the source code repository instead of a release tarball,\nyou need to generate the buildsystem first with:\n\n    autoreconf -i\n\nWhen working from a git repository the build system will detect that and will\nadd -Werror to the CFLAGS if supported; so if you're not doing development you\nshould probably consider passing `--disable-Werror` to `configure` in order to\nprevent build failures due to mere warnings.\n\n### Dependencies\n* `gettext` (or `gettext-tiny`)\n* `pkg-config`\n\nOptional:\n\n* `libssl` (OpenSSL, LibreSSL or compatible) -- for SSL/TLS support.\n\n#### Extra dependencies for building from snapshots\n* `autoconf-archive`\n* `autoconf`\n* `automake`\n* `autopoint`\n* `txt2man`\n\n#### Packages on Debian-based systems\n* `build-essential`\n* `autoconf`\n* `autoconf-archive`\n* `automake`\n* `autopoint`\n* `gettext`\n* `libssl-dev`\n* `pkg-config`\n* `txt2man`\n\n\n#### Packages on Mac OS X (Homebrew)\n* `autoconf-archive`\n* `automake`\n* `gettext`\n* `openssl`\n\n### Building on Mac OS X (Homebrew)\n\nYou'll need to provide some extra options to autotools so it can find gettext\nand openssl.\n\n\tGETTEXT=/usr/local/opt/gettext\n\tOPENSSL=/usr/local/opt/openssl\n\tPATH=\"$GETTEXT/bin:$PATH\"\n\n\t[ -x configure ] || autoreconf -fiv -I$GETTEXT/share/aclocal/\n\n\tCFLAGS=\"-I$GETTEXT/include -I$OPENSSL/include\" \\\n\tLDFLAGS=-L$GETTEXT/lib ./configure\n\nYou can just run `make` as usual after these steps.\n\n## Related projects ##\n\n* [aria2](https://github.com/aria2/aria2)\n* [hget](https://github.com/huydx/hget)\n* [lftp](https://github.com/lavv17/lftp)\n* [nugget](https://github.com/maxogden/nugget)\n* [pget](https://github.com/Code-Hex/pget)\n\n## License ##\n\nAxel is licensed under GPL-2+ with the OpenSSL exception.\n"
        },
        {
          "name": "VERSION",
          "type": "blob",
          "size": 0.0283203125,
          "content": "2.17.14 2024-04-07T22:55:52Z\n"
        },
        {
          "name": "acinclude.m4",
          "type": "blob",
          "size": 3.8125,
          "content": "# TODO: we need a true replacement for AC_INIT...\n\n# _AXEL_ntsinc(FILE) - sinclude not to be tracked by automake\n# ---------------------------------------------------------------------\nm4_define([_AXEL_ntsinc], defn([m4_sinclude]))\n\n# _AXEL_READL(FILE, HARD-DEP?)\n# ---------------------------------------------------------------------\nm4_define([_AXEL_READL],\n[m4_bpatsubst(m4_quote(m4_if([$2],,\n  [_AXEL_ntsinc([$1])],\n  [m4_apply([m4_include], [[$1]])])), [ *\n])])\n\n# _AXEL_GIT_HEAD\n# ---------------------------------------------------------------------\nm4_define([_AXEL_GIT_HEAD],\n[m4_define([__HEAD], m4_quote(_AXEL_READL([.git/HEAD])))dnl\nm4_if(m4_substr(m4_quote(__HEAD), 0, 4), [ref:],\n  [m4_quote(_AXEL_READL([.git/]m4_bpatsubst(__HEAD, [^ref: *])))],\n  [m4_quote(__HEAD)])[]dnl\nm4_undefine([__HEAD])dnl\n])\n\n# _AXEL_GIT_TAG(TAG)\n# ---------------------------------------------------------------------\nm4_define([_AXEL_GIT_TAG],\n[m4_quote(_AXEL_READL([.git/refs/tags/$1]))])\n\n# AXEL_VER_READ(FILE)\n# ---------------------------------------------------------------------\nAC_DEFUN_ONCE([AXEL_VER_READ],\n[_AC_INIT_LITERAL([$1])\nm4_define([_AXEL_RELSTR],\n  m4_quote(_AXEL_READL([$1], 1)))\nm4_define([_AXEL_RELDATE],\n  m4_quote(\n    m4_bpatsubst(\n      m4_quote(\n        m4_bpatsubst(\n          m4_quote(_AXEL_RELSTR),\n          [[^ ]* ])), [ .*])))\nm4_define([_AXEL_VERSION],\n  m4_quote(m4_bpatsubst(m4_quote(_AXEL_RELSTR), [ .*])))\nm4_define([_AXEL_COMMIT], m4_quote(_AXEL_GIT_HEAD))\nm4_define([_AXEL_VERSUF],\n  [m4_if(m4_quote(_AXEL_COMMIT),,,\n    [m4_if(m4_quote(_AXEL_COMMIT), m4_quote(_AXEL_GIT_TAG([v]_AXEL_VERSION)),,\n      [[+g]m4_quote(m4_substr(_AXEL_COMMIT, 0, 6))])])])\nm4_define([AC_PACKAGE_STRING], m4_quote(AC_PACKAGE_NAME AC_PACKAGE_VERSION))\nm4_define([AC_PACKAGE_VERSION], m4_quote(_AXEL_VERSION[]_AXEL_VERSUF))\n])\n\n# AXEL_PKG(PACKAGE-NAME, BUG-REPORT, [TAR-NAME])\n# ---------------------------------------------------------------------\nAC_DEFUN_ONCE([AXEL_PKG],\n[_AC_INIT_LITERAL([$1])\n_AC_INIT_LITERAL([$2])\nAC_BEFORE([AXEL_VER_READ])\nm4_define([AC_PACKAGE_NAME], [$1])\nm4_define([AC_PACKAGE_TARNAME],\n  m4_default([$3], [m4_bpatsubst(m4_tolower([$1]),\n\t\t\t\t [[^_abcdefghijklmnopqrstuvwxyz0123456789]],\n\t\t\t\t [-])]))\nm4_define([AC_PACKAGE_BUGREPORT], [$2])\n])\n\n\n# MKINSTALLDIRS isn't needed; remove\nAC_DEFUN([AM_MKINSTALLDIRS], [])\n\n# AXEL_CHECK_MACRO(MACRO, HEADER, [ACTION-IF-FOUND], [ACTION-IF-NOT-FOUND])\n# ---------------------------------------------------------------------\nAC_DEFUN([AXEL_CHECK_MACRO],\n[_AC_INIT_LITERAL([$1])\n_AC_INIT_LITERAL([$2])\nAC_CACHE_CHECK([for $1], [axel_cv_macro_$1],\n  [AC_COMPILE_IFELSE(\n    [AC_LANG_PROGRAM([[#include <]$2[>]], [[(void)]$1;])],\n      [axel_cv_macro_$1=yes],\n      [axel_cv_macro_$1=no])\n  ])\nAS_IF([test \"x$axel_cv_macro_$1\" = \"xyes\"],\n  [$3], m4_default([$4], [\n    AC_MSG_ERROR([The $1 macro is required; it should be defined by $2.])\n  ]))\n])\n\n# AXEL_DEFAULT_TYPE(TYPE-ID, DEFAULT)\n# ---------------------------------------------------------------------\nAC_DEFUN([AXEL_DEFAULT_TYPE], [\n  _AC_INIT_LITERAL([$1])\n  AH_VERBATIM(AS_TR_CPP([HAVE_$1_default]),\n    [#ifndef ]AS_TR_CPP([HAVE_$1])[\ntypedef $2 $1;\n#endif])\n])\n\n# AXEL_CHECK_TYPE(TYPE-ID, COMPAT-TEST, [INCLUDES])\n# ---------------------------------------------------------------------\nAC_DEFUN([AXEL_CHECK_TYPE], [\n  _AC_INIT_LITERAL([$1])\n  AC_CHECK_TYPE([$1], [\n    AC_CACHE_CHECK([for $1 compatibility], [axel_cv_type_compat_$1], [\n      AC_COMPILE_IFELSE(\n        [AC_LANG_PROGRAM([AC_INCLUDES_DEFAULT([$3])],\n\t  [switch(0) case 0: case ($2):;])],\n\t[axel_cv_type_compat_$1=yes], [axel_cv_type_compat_$1=no])\n    ])\n    AS_IF([test \"x$axel_cv_type_compat_$1\" = xno],\n      [AC_MSG_ERROR([The $1 type is not fit ($2).])])\n    AC_DEFINE(AS_TR_CPP([HAVE_$1]), [1],\n              [Define to 1 if the system has the type `$1'.])\n  ],, [AC_INCLUDES_DEFAULT([$3])])\n])\n"
        },
        {
          "name": "compat-android.h",
          "type": "blob",
          "size": 2.060546875,
          "content": "/*\n  Axel -- A lighter download accelerator for Linux and other Unices\n\n  Copyright 2018      Ismael Luceno\n\n  This program is free software; you can redistribute it and/or\n  modify it under the terms of the GNU General Public License\n  as published by the Free Software Foundation; either version 2\n  of the License, or (at your option) any later version.\n\n  In addition, as a special exception, the copyright holders give\n  permission to link the code of portions of this program with the\n  OpenSSL library under certain conditions as described in each\n  individual source file, and distribute linked combinations including\n  the two.\n\n  You must obey the GNU General Public License in all respects for all\n  of the code used other than OpenSSL. If you modify file(s) with this\n  exception, you may extend this exception to your version of the\n  file(s), but you are not obligated to do so. If you do not wish to do\n  so, delete this exception statement from your version. If you delete\n  this exception statement from all source files in the program, then\n  also delete it here.\n\n  This program is distributed in the hope that it will be useful,\n  but WITHOUT ANY WARRANTY; without even the implied warranty of\n  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n  GNU General Public License for more details.\n\n  You should have received a copy of the GNU General Public License\n  along with this program; if not, write to the Free Software\n  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.\n *\n * SPDX-License-Identifier: GPL-2.0-or-later\n */\n\n/* Android compatibility stubs */\n\n#if !defined(AXEL_COMPAT_ANDROID) && defined(__ANDROID__)\n\ninline static\nint pthread_cancel(pthread_t h) {\n\treturn pthread_kill(h, 0);\n}\n\ninline static\nint pthread_setcancelstate(int state, int *oldstate)\n{\n\treturn 0;\n}\n\ninline static\nint pthread_setcanceltype(int type, int *oldtype)\n{\n\treturn 0;\n}\n\nenum {\n\tPTHREAD_CANCEL_DISABLE,\n\tPTHREAD_CANCEL_ENABLE,\n\tPTHREAD_CANCEL_DEFERRED,\n\tPTHREAD_CANCEL_ASYNCHRONOUS,\n};\n\n#endif /* !defined(AXEL_COMPAT_ANDROID) && defined(__ANDROID__) */\n"
        },
        {
          "name": "compat-bsd.h",
          "type": "blob",
          "size": 0.25,
          "content": "/*\n * Copyright 2019  Ismael Luceno <ismael@iodev.co.uk>\n * SPDX-License-Identifier: GPL-2.0-or-later\n */\n\n#ifndef HAVE_STRLCAT\nsize_t strlcat(char *, const char *, size_t);\n#endif\n\n#ifndef HAVE_STRLCPY\nsize_t strlcpy(char *, const char *, size_t);\n#endif\n"
        },
        {
          "name": "compat-ssl.h",
          "type": "blob",
          "size": 0.240234375,
          "content": "/*\n * Copyright 2020  Ismael Luceno <ismael@iodev.co.uk>\n * SPDX-License-Identifier: GPL-2.0-or-later\n */\n\n#if defined(HEADER_ASN1_H) && !defined(HAVE_ASN1_STRING_GET0_DATA)\nconst unsigned char *ASN1_STRING_get0_data(const ASN1_STRING *);\n#endif\n"
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 6.017578125,
          "content": "# SPDX-License-Identifier: GPL-2.0-or-later\n# Autoconf for axel\nAC_COPYRIGHT([\nCopyright 2016      Joao Eriberto Mota Filho\nCopyright 2016      Stephen Thirlwall\nCopyright 2017      Antonio Quartulli\nCopyright 2017-2020 Ismael Luceno\nCopyright 2017      Vlad Glagolev\n\nThis file is under the same license as Axel.\n])\n\nAC_PREREQ([2.72])\nPKG_PREREQ([0.29])\nm4_ifdef([AX_IS_RELEASE],, [\n    m4_fatal([autoconf-archive is required])\n])\n\nAXEL_PKG([axel], [https://github.com/axel-download-accelerator/axel/issues])\nAXEL_VER_READ([VERSION])\nAC_INIT\n\nAC_CONFIG_AUX_DIR([build-aux])\nAC_CONFIG_SRCDIR([src/conf.h])\nAC_CONFIG_HEADERS([config.h])\nAC_CONFIG_MACRO_DIR([m4])\nAC_CONFIG_LIBOBJ_DIR([lib])\n\ndnl Validate arguments; fail early\nAC_ARG_WITH([ssl], [\nAS_HELP_STRING(\n        [--with-ssl=@<:@openssl/wolfssl@:>@],\n        [Which TLS/SSL implementation to use, default: openssl])\nAS_HELP_STRING(\n        [--without-ssl], [disable TLS support])],\n    [AS_CASE([\"$withval\"],\n        [openssl|wolfssl|yes|no],,\n        [AC_MSG_ERROR([Invalid argument: --with-ssl=$withval])])],\n    [with_ssl=openssl])\n\nAM_INIT_AUTOMAKE([subdir-objects])\nPKG_PROG_PKG_CONFIG\nAS_IF([test -z \"$PKG_CONFIG\"],\n  [AC_MSG_WARN([pkg-config is needed for auto-configuration of dependencies])])\nexport PKG_CONFIG_PATH\n\nAM_SILENT_RULES([yes])\n\n# OS-specific stuff\nAC_CANONICAL_HOST\nAC_DEFINE_UNQUOTED([ARCH], [\"$host_os\"], [\"Define architecture\"])\n\n# Make system extensions available to the code\nAS_CASE([\"$host_os\"],\n  [freebsd*], [\n    AC_DEFINE([__BSD_VISIBLE], [1],\n              [Workaround to expose legacy BSD typedefs needed by sockets API])\n  ],\n  [darwin*], [\n    AC_DEFINE([_DARWIN_C_SOURCE], [1],\n              [Define on Darwin to expose all libc features])\n  ],\n  [solaris*], [\n    LIBS=\"$LIBS -lsocket -lnsl\"\n  ],\n  [hpux*], [\n    AS_IF([test -d /usr/local/lib/hpux32], [\n      LDFLAGS=\"$LDFLAGS -L/usr/local/lib/hpux32\"\n    ])\n  ],\n  [*mingw32], [\n    AC_DEFINE([_WIN32_WINNT], [0x0600],\n              [Request NT 6 API to expose AI_ADDRCONFIG in WinSock2])\n  ])\nAC_USE_SYSTEM_EXTENSIONS\n\n# Compiler checks\nAC_PROG_CC\nAS_CASE([$ac_prog_cc_stdc], [no|c89], [\n    AC_MSG_ERROR([C99 compiler required])\n])\n\n# Large file support\nAC_SYS_LARGEFILE\n\n# Compiler Warnings\nAX_IS_RELEASE([git-directory])\nAX_COMPILER_FLAGS()\n\n# Debugging code\nAC_ARG_ENABLE(debug,\n    AS_HELP_STRING([--enable-debug], [enable debugging, default: no]))\nAS_IF([! test \"x$enable_debug\" = xyes ], [\n    AC_DEFINE([NDEBUG], [1], [disable debugging code])\n])\n\n# GCC function attributes\nAX_GCC_FUNC_ATTRIBUTE([format])\n\n# Built-in functions\nAX_GCC_BUILTIN([__builtin_clzll])\n\nAS_IF([test \"x$ax_cv_have___builtin_clzll\" = xno], [\n    AC_MSG_ERROR([Support for __builtin_clzll is required])\n])\n\n\n# Checks for other programs.\nAC_PROG_INSTALL\n\n# Checks for libraries.\n\n# Checks for header files.\nAC_CHECK_HEADERS([ \\\n\tarpa/inet.h \\\n\tfcntl.h \\\n\tlimits.h \\\n\tlocale.h \\\n\tnetdb.h \\\n\tnetinet/in.h \\\n\tstdlib.h \\\n\tsys/ioctl.h \\\n\tsys/socket.h \\\n\tsys/time.h \\\n\tunistd.h \\\n],, [\n    AC_MSG_ERROR([$ac_header is required.])\n])\n\n# Checks for typedefs, structures, and compiler characteristics.\nAC_C_INLINE\n\n# Ensure optional C99 integer types we need\nAC_TYPE_INT8_T\nAC_TYPE_UINT8_T\nAC_TYPE_INT16_T\nAC_TYPE_UINT16_T\nAC_TYPE_INT32_T\nAC_TYPE_UINT32_T\nAC_TYPE_INT64_T\nAC_TYPE_UINT64_T\n\n# POSIX types\nAC_TYPE_SIZE_T\nAC_TYPE_SSIZE_T\nAC_TYPE_MODE_T\n\nAC_CACHE_CHECK([return type of signal handlers],[ac_cv_type_signal],[AC_COMPILE_IFELSE(\n[AC_LANG_PROGRAM([#include <sys/types.h>\n#include <signal.h>\n], [return *(signal (0, 0)) (0) == 1;])],\n  [ac_cv_type_signal=int],\n  [ac_cv_type_signal=void])])\nAS_IF([test \"x$ac_cv_type_signal\" = xint], [\n  AC_MSG_ERROR([return type of signal handlers is not compliant with C89])\n])\n\n# Custom type checks and replacements\nAXEL_CHECK_TYPE([off_t], [sizeof(off_t) >= sizeof(int64_t)])\nAXEL_DEFAULT_TYPE([off_t], [int64_t])\n\n# OS-specific issues\nAS_CASE([\"$host_os\"],\n  [darwin*], [\n    AXEL_CHECK_TYPE([intmax_t], [sizeof(intmax_t) >= sizeof(int64_t)])\n  ])\n\n# Checks for library functions.\nAC_CHECK_FUNCS([ \\\n\tgetaddrinfo \\\n\tgettimeofday \\\n\tinet_ntoa \\\n\tmalloc \\\n\tmemset \\\n\tnanosleep \\\n\trealloc \\\n\tselect \\\n\tsetlocale \\\n\tsocket \\\n\tstrcasecmp \\\n\tstrchr \\\n\tstrerror \\\n\tstrncasecmp \\\n\tstrpbrk \\\n\tstrrchr \\\n\tstrstr \\\n\tstrtoul \\\n\tstrtoll \\\n],, [\n    AC_MSG_ERROR([$ac_func is required; it should be part of libc.])\n])\n\nAC_REPLACE_FUNCS([ \\\n\tstrlcpy \\\n\tstrlcat \\\n])\n\n# Check for missing features/flags\nAXEL_CHECK_MACRO([O_NONBLOCK], [fcntl.h])\n\n# Optional (but included-by-default) ssl support\nAS_IF([test \"x$with_ssl\" = xyes], [with_ssl=openssl])\nAM_CONDITIONAL([WITH_SSL], [test \"x$with_ssl\" != xno])\nAC_ARG_VAR([SSL_PREFIX], [installation prefix of the TLS/SSL library])\nAS_IF([test \"x$with_ssl\" != xno], [\n    save_PKG_CONFIG_PATH=\"$PKG_CONFIG_PATH\"\n    AS_IF([test ${SSL_PREFIX+y}], [\n\tPKG_CONFIG_PATH=\"$SSL_PREFIX/lib/pkgconfig$PATH_SEPARATOR$PKG_CONFIG_PATH\"\n    ])\n    PKG_CHECK_MODULES([SSL], [$with_ssl])\n    AC_DEFINE([HAVE_SSL], [1], [SSL])\n    AS_CASE([\"$with_ssl\"],\n\t[openssl], [\n\t    save_LIBS=\"$LIBS\"\n\t    LIBS=\"$LIBS $SSL_LIBS\"\n\t    AC_REPLACE_FUNCS([ \\\n\t\tASN1_STRING_get0_data \\\n\t    ])\n\t    LIBS=\"$save_LIBS\"\n\t],\n\t[wolfssl], [\n\t    AC_CHECK_DECLS([\n\t\tX509_NAME_get_entry,\n\t\tX509_get_ext_d2i,\n\t        X509_V_OK\n\t    ],, [\n\t        AC_MSG_ERROR([wolfSSL with extra OpenSSL API compatibility required])\n\t    ], [\n\t        #include <wolfssl/options.h>\n\t\t#include <wolfssl/wolfcrypt/settings.h>\n\t\t#include <wolfssl/openssl/ssl.h>\n\t    ])\n\t    AC_DEFINE([HAVE_WOLFSSL], [1], [wolfSSL])\n\t])\n    PKG_CONFIG_PATH=\"$save_PKG_CONFIG_PATH\"\n], AC_MSG_NOTICE([TLS/SSL support disabled]))\n\n# Add Gettext\nAM_GNU_GETTEXT([external])\nAM_GNU_GETTEXT_VERSION([0.11.1])\n\n# POSIX threads\nAX_PTHREAD()\n\n#### Definitions ####\n\n\n# BSD vs GNU date\nAS_IF([date -j >/dev/null 2>&1], [\n  pdate() { date -j -f '%Y-%m-%dT%H:%M:%SZ' \"$@\"; }\n], [\n  pdate() { date -d \"$@\"; }\n])\nRELDATE_PRETTY=$(pdate '_AXEL_RELDATE' '+%B %e, %Y')\nAC_SUBST([RELDATE_PRETTY])\n\n# etc path\nAC_DEFINE_UNQUOTED([ETCDIR], [\"/etc\"], [\"Define /etc directory path\"])\n\n#####################\n\nAC_CONFIG_FILES([\n\tMakefile\n\tpo/Makefile.in\n])\nAC_OUTPUT\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "lgtm.yml",
          "type": "blob",
          "size": 0.2607421875,
          "content": "extraction:\n  cpp:\n    prepare:\n      packages:\n        - autoconf-archive\n        - autopoint\n        - clang\n        - libssl-dev\n        - linux-libc-dev\n        - txt2man\n        - gettext\n    configure:\n      command:\n      - autoreconf -ivf\n      - ./configure\n"
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "po",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}