{
  "metadata": {
    "timestamp": 1736709694608,
    "page": 66,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "flatpak/flatpak",
      "stars": 4331,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".devcontainer",
          "type": "tree",
          "content": null
        },
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.2265625,
          "content": "root = true\n\n[*]\ncharset = utf-8\nend_of_line = lf\n\n[*.[ch]]\nindent_size = 2\nindent_style = space\ninsert_final_newline = true\n# For any stray tabs that may sneak in:\ntab_width = 8\n\n[meson.build]\nindent_size = 2\nindent_style = space\n\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 3.037109375,
          "content": "*.la\n*.o\n*.lo\n.deps\n.libs\nABOUT-NLS\nINSTALL\nMakefile\nMakefile.in\naclocal.m4\nautom4te.cache/\ntest-driver\ncompile\nconfig.rpath\nconfig.guess\nconfig.h\nconfig.log\nconfig.status\nconfig.sub\nconfigure\ndepcomp\ninstall-sh\nlibtool\nltmain.sh\nm4/*.m4\n!m4/glibtests.m4\n!m4/attributes.m4\nmissing\nstamp-h1\nconfig.h.in\nstamp-*\ngtk-doc.make\nflatpak\nflatpak-*.tar.xz\n/flatpak-1.*/\nflatpak-session-helper\nflatpak-portal\nflatpak-validate-icon\nflatpak-oci-authenticator\n*~\nprofile/flatpak.sh\n*-dbus-generated.[ch]\nflatpak-variant-private.h\nflatpak-variant-impl-private.h\nflatpak-resources.[ch]\nflatpak-permission-dbus.[ch]\nflatpak-portal-dbus.[ch]\nflatpak-dbus-proxy\npermission-store-dbus.[ch]\nflatpak-system-helper\noci-authenticator/*.service\nportal/*.service\nsession-helper/*.service\nsystem-helper/*.service\nsideload-repos-systemd/flatpak-sideload-usb-repo.service\nsideload-repos-systemd/flatpak-sideload-usb-repo.path\nflatpak.conf\nflatpak.env\nflatpak.sh\ndocument-portal/xdp-dbus.[ch]\ndocument-portal/xdp-resources.[ch]\n.dirstamp\ntest-suite*.log\ncommon/flatpak-version-macros.h\nflatpak.pc\nflatpak.pp.bz2\ncommon/flatpak-enum-types.c\ncommon/flatpak-enum-types.h\ntest-libflatpak\nhttpcache\nrevokefs-fuse\nrevokefs-demo\nFlatpak-1.0.*\nlibglnx-config.h\n/app/parse-datetime.c\n/doc/reference/gtkdoc-check.log\n/doc/reference/gtkdoc-check.test\n/doc/reference/gtkdoc-check.trs\n/doc/reference/libflatpak-docs.html\n/doc/reference/version.xml\n/doc/flatpak-docs.html\n/doc/flatpak-docs.xml\n/doc/*.1\n/doc/*.5\n/tags\n/test-libglnx-errors\n/test-libglnx-errors.log\n/test-libglnx-errors.trs\n/test-libglnx-fdio\n/test-libglnx-fdio.log\n/test-libglnx-fdio.trs\n/test-libglnx-macros\n/test-libglnx-macros.log\n/test-libglnx-macros.trs\n/test-libglnx-shutil\n/test-libglnx-shutil.log\n/test-libglnx-shutil.trs\n/test-libglnx-xattrs\n/test-libglnx-xattrs.log\n/test-libglnx-xattrs.trs\n/testlibrary\n/testlibrary.log\n/testlibrary.trs\n/testcommon\n/testcommon.log\n/testcommon.trs\n/test-context\n/test-context.log\n/test-context.trs\n/test-exports\n/test-exports.log\n/test-exports.trs\n/test-instance\n/test-instance.log\n/test-instance.trs\n/test-portal\n/test-portal.log\n/test-portal.trs\n/tests/test-keyring/.gpg-v21-migrated\n/tests/test-keyring/private-keys-v1.d/\n/tests/test-keyring/trustdb.gpg\n/tests/test-keyring2/.gpg-v21-migrated\n/tests/test-keyring2/private-keys-v1.d/\n/tests/test-keyring2/trustdb.gpg\n/tests/hello*.flatpak\n/tests/platform*.flatpak\n/tests/repo\n/tests/runtime-repo\n/tests/runtime-repo.stamp\n/tests/package_version.txt\n/tests/test-authenticator\n/tests/test-update-portal\n/tests/test-portal-impl\n/tests/hold-lock\n/tests/list-unused\n/tests/mock-flatpak\n/tests/services/*.service\n/tests/share/xdg-desktop-portal/portals/*.portal\n/tests/try-syscall\n*.test\n/tests/*.sh.log\n/tests/*.sh.test\n/tests/*.sh.trs\n/tests/*.wrap.log\n/tests/*.wrap.test\n/tests/*.wrap.trs\npo/.intltool-merge-cache\npo/Makefile.in.in\npo/POTFILES\npo/Flatpak.pot\npo/Makevars.template\npo/Rules-quot\npo/flatpak.pot\npo/*.gmo\npo/*.sed\npo/*.header\npo/*.sin\n/subprojects/Makefile-*.am.inc\nsystem-helper/org.freedesktop.Flatpak.policy\nsystem-helper/org.freedesktop.Flatpak.rules\nflatpak-bwrap\npy-compile\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.3525390625,
          "content": "# Code of Conduct\n\n## 1. Purpose\n\nA primary goal of Flatpak is to be inclusive to the largest number of contributors, with the most varied and diverse backgrounds possible. As such, we are committed to providing a friendly, safe and welcoming environment for all, regardless of gender, sexual orientation, ability, ethnicity, socioeconomic status, and religion (or lack thereof).\n\nThis code of conduct outlines our expectations for all those who participate in our community, as well as the consequences for unacceptable behavior.\n\nWe invite all those who participate in Flatpak to help us create safe and positive experiences for everyone.\n\n## 2. Open Source Citizenship\n\nA supplemental goal of this Code of Conduct is to increase open source citizenship by encouraging participants to recognize and strengthen the relationships between our actions and their effects on our community.\n\nCommunities mirror the societies in which they exist and positive action is essential to counteract the many forms of inequality and abuses of power that exist in society.\n\nIf you see someone who is making an extra effort to ensure our community is welcoming, friendly, and encourages all participants to contribute to the fullest extent, we want to know.\n\n## 3. Expected Behavior\n\nThe following behaviors are expected and requested of all community members:\n\n*   Participate in an authentic and active way. In doing so, you contribute to the health and longevity of this community.\n*   Exercise consideration and respect in your speech and actions.\n*   Attempt collaboration before conflict.\n*   Refrain from demeaning, discriminatory, or harassing behavior and speech.\n*   Be mindful of your surroundings and of your fellow participants. Alert community leaders if you notice a dangerous situation, someone in distress, or violations of this Code of Conduct, even if they seem inconsequential.\n*   Remember that community event venues may be shared with members of the public; please be respectful to all patrons of these locations.\n\n## 4. Unacceptable Behavior\n\nThe following behaviors are considered harassment and are unacceptable within our community:\n\n*   Violence, threats of violence or violent language directed against another person.\n*   Sexist, racist, homophobic, transphobic, ableist or otherwise discriminatory jokes and language.\n*   Posting or displaying sexually explicit or violent material.\n*   Posting or threatening to post other people’s personally identifying information (\"doxing\").\n*   Personal insults, particularly those related to gender, sexual orientation, race, religion, or disability.\n*   Inappropriate photography or recording.\n*   Inappropriate physical contact. You should have someone’s consent before touching them.\n*   Unwelcome sexual attention. This includes, sexualized comments or jokes; inappropriate touching, groping, and unwelcomed sexual advances.\n*   Deliberate intimidation, stalking or following (online or in person).\n*   Advocating for, or encouraging, any of the above behavior.\n*   Sustained disruption of community events, including talks and presentations.\n\n## 5. Consequences of Unacceptable Behavior\n\nUnacceptable behavior from any community member, including sponsors and those with decision-making authority, will not be tolerated.\n\nAnyone asked to stop unacceptable behavior is expected to comply immediately.\n\nIf a community member engages in unacceptable behavior, the community organizers may take any action they deem appropriate, up to and including a temporary ban or permanent expulsion from the community without warning (and without refund in the case of a paid event).\n\n## 6. Reporting Guidelines\n\nIf you are subject to or witness unacceptable behavior, or have any other concerns, please notify a community organizer as soon as possible. alexander.larsson@gmail.com.\n\n\n\nAdditionally, community organizers are available to help community members engage with local law enforcement or to otherwise help those experiencing unacceptable behavior feel safe. In the context of in-person events, organizers will also provide escorts as desired by the person experiencing distress.\n\n## 7. Addressing Grievances\n\nIf you feel you have been falsely or unfairly accused of violating this Code of Conduct, you should notify Flatpak with a concise description of your grievance. Your grievance will be handled in accordance with our existing governing policies.\n\n\n\n## 8. Scope\n\nWe expect all community participants (contributors, paid or otherwise; sponsors; and other guests) to abide by this Code of Conduct in all community venues–online and in-person–as well as in all one-on-one communications pertaining to community business.\n\nThis code of conduct and its related procedures also applies to unacceptable behavior occurring outside the scope of community activities when such behavior has the potential to adversely affect the safety and well-being of community members.\n\n## 9. Contact info\n\nalexander.larsson@gmail.com\n\n## 10. License and attribution\n\nThis Code of Conduct is distributed under a [Creative Commons Attribution-ShareAlike license](http://creativecommons.org/licenses/by-sa/3.0/).\n\nPortions of text derived from the [Django Code of Conduct](https://www.djangoproject.com/conduct/) and the [Geek Feminism Anti-Harassment Policy](http://geekfeminism.wikia.com/wiki/Conference_anti-harassment/Policy).\n\nRetrieved on November 22, 2016 from [http://citizencodeofconduct.org/](http://citizencodeofconduct.org/)\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 6.72265625,
          "content": "## Compiling Flatpak\n\nIf you need to build Flatpak from source, you can do so with Meson or\nwith GNU Autotools. The recommended build system for this version of\nFlatpak is Meson, and the Autotools build system is likely to be removed\nfrom a future version of Flatpak.\n\nThe exact steps required depend on your distribution. Below are some\nsteps that should work on Debian and Fedora, based on the configure\noptions used to build those distributions' packages, These options will\ninstall into `/usr`, which will overwrite your distribution-provided\nsystem copy of Flatpak.\n**You should only do this if you understand the risks of it to the\nstability of your system, and you probably want to do it in a VM or on\na development machine that's expected to break sometimes!**\n\n### On Debian\n\n```\ngit clone https://github.com/flatpak/flatpak\ncd flatpak\nsudo apt build-dep flatpak\ngit submodule update --init\nmeson setup --prefix=/usr --sysconfdir=/etc --localstatedir=/var -Dselinux_module=disabled -Dinstalled_tests=true -Ddbus_config_dir=/usr/share/dbus-1/system.d -Dprivileged_group=sudo -Drun_media_dir=/media -Dsystem_bubblewrap=bwrap -Dsystem_dbus_proxy=xdg-dbus-proxy -Dsystemdsystemunitdir=/lib/systemd/system -Dsystemdsystemenvgendir=/lib/systemd/system-environment-generators -Dsystem_helper_user=_flatpak -Dgtkdoc=disabled _build\nmeson compile -C _build\nmeson test -C _build\nsudo meson install -C _build\n```\n\n### On Fedora\n\n```\ngit clone https://github.com/flatpak/flatpak\ncd flatpak\nsudo dnf builddep flatpak\nsudo dnf install gettext-devel socat\ngit submodule update --init\nmeson setup --prefix=/usr --sysconfdir=/etc --localstatedir=/var -Dinstalled_tests=true -Dselinux_module=enabled -Dsystem_bubblewrap=bwrap -Dsystem_dbus_proxy=xdg-dbus-proxy _build\nmeson compile -C _build\nmeson test -C _build\nsudo meson install -C _build\n```\n\n## Building with Autotools\n\nOlder branches of Flatpak used GNU Autotools. See\nhttps://github.com/flatpak/flatpak/blob/flatpak-1.14.x/CONTRIBUTING.md\nfor more details of that build system.\n\nThe Autotools build system is likely to be removed from a future version\nof Flatpak, leaving Meson as the only build system supported.\n\nNewer releases of Flatpak do not include Autotools-generated files in\nthe source archive. If it is necessary to build these releases with\nAutotools for some reason, the build system must be set up by running:\n\n    ./autogen.sh\n\nbefore proceeding as if for any other Autotools project.\n\n## How to run a specified set of tests\n\nSometimes you don't want to run the whole test suite but just one you're\nworking on. This can be accomplished with a command like:\n\n```\nmeson test -C _build test-info@user.wrap test-info@system.wrap\n```\n\n## More info\nDependencies you will need include: meson, bison,\ngettext, gtk-doc, gobject-introspection, libcap, libarchive, libxml2, libsoup,\ngpgme, polkit, libXau, ostree, json-glib, appstream, libseccomp (or their devel\npackages).\n\nMost configure arguments are documented in `meson_options.txt`. However,\nthere are some options that are a bit more complicated.\n\nFlatpak relies on a project called\n[Bubblewrap](https://github.com/containers/bubblewrap) for the low-level\nsandboxing. By default, an in-tree copy of this is built (distributed in the\ntarball or using git submodules in the git tree). This will build a helper\ncalled flatpak-bwrap. If your system has a recent enough version of Bubblewrap\nalready, you can use `-Dsystem_bubblewrap=bwrap` to use that instead.\n\nBubblewrap can run in two modes, either using unprivileged user\nnamespaces or setuid mode. This requires that the kernel supports this,\nwhich some distributions disable. For instance, Debian and Arch\n([linux](https://www.archlinux.org/packages/?name=linux) kernel v4.14.5\nor later), support user namespaces with the `kernel.unprivileged_userns_clone`\nsysctl enabled.\n\nIf unprivileged user namespaces are not available, then Bubblewrap must\nbe built as setuid root. This is believed to be safe, as it is\ndesigned to do this. Any build of Bubblewrap supports both\nunprivileged and setuid mode, you just need to set the setuid bit for\nit to change mode. The Meson build does not do this automatically.\n\nThere are some complications when building Flatpak to a different\nprefix than the system-installed version. First of all, the newly\nbuilt Flatpak will look for system-installed flatpaks in\n`$PREFIX/var/lib/flatpak`, which will not match existing installations.\nYou can use `-Dsystem_install_dir=/var/lib/flatpak` to make both\ninstallations use the same location.\n\nSecondly, Flatpak ships with a root-privileged PolicyKit helper for\nsystem-wide installation, called `flatpak-system-helper`. It is D-Bus\nactivated (on the system bus) and if you install in a non-standard\nlocation it is likely that D-Bus will not find it and PolicyKit\nintegration will not work. However, if the system installation is\nsynchronized, you can often use the system installed helper instead—\nat least if the two versions are close enough.\n\n## This repository\n\nThe Flatpak project consists of multiple pieces, and it can be\na bit challenging to find your way around at first. Here is a\nquick intro to each of the important subdirectories:\n* `app`: the commandline client. Each command has a `flatpak-builtins-` source file\n* `common`: contains the library, libflatpak. It also contains various pieces\n  of code that are shared between the library, the client and the services.\n  Non-public code can be recognized by having a `-private.h` header file.\n* `completion`: commandline auto completion support\n* `data`: D-Bus interface definition files and GVariant schemas\n* `doc`: The sources for the documentation, both man pages and library documentation\n* `icon-validator`: A small utility that is used to validate icons\n* `oci-authenticator`: service used for authenticating the user for installing\n  from oci remotes (e.g. for paid apps)\n* `po`: translations\n* `portal`: The Flatpak portal service, which lets sandboxed apps request the\n  creation of new sandboxes\n* `revokefs`: A FUSE filesystem that is used to transfer files downloaded by\n  the user to the system-helper without copying\n* `session-helper`: The flatpak-session-helper service, which provides various\n  helpers for the sandbox setup at runtime\n* `tests`: The testsuite\n* `subprojects/bubblewrap`: Flatpak's unprivileged sandboxing tool which is\n  developed separately and exists here as a submodule\n* `subprojects/libglnx`: a small utility library for projects that use GLib on\n  Linux, as a submodule\n* `subprojects/dbus-proxy`: a filtering proxy for D-Bus connections, as a submodule\n* `subprojects/variant-schema-compiler`: a tool for generating code to\n  efficiently access data encoded using GVariant, as a submodule\n* `system-helper`: The flatpak-system-helper service, which runs as root on the\n  system bus and allows non-root users to modify system installations\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 25.908203125,
          "content": "                  GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 2.1, February 1999\n\n Copyright (C) 1991, 1999 Free Software Foundation, Inc.\n 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n[This is the first released version of the Lesser GPL.  It also counts\n as the successor of the GNU Library Public License, version 2, hence\n the version number 2.1.]\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicenses are intended to guarantee your freedom to share and change\nfree software--to make sure the software is free for all its users.\n\n  This license, the Lesser General Public License, applies to some\nspecially designated software packages--typically libraries--of the\nFree Software Foundation and other authors who decide to use it.  You\ncan use it too, but we suggest you first think carefully about whether\nthis license or the ordinary General Public License is the better\nstrategy to use in any particular case, based on the explanations below.\n\n  When we speak of free software, we are referring to freedom of use,\nnot price.  Our General Public Licenses are designed to make sure that\nyou have the freedom to distribute copies of free software (and charge\nfor this service if you wish); that you receive source code or can get\nit if you want it; that you can change the software and use pieces of\nit in new free programs; and that you are informed that you can do\nthese things.\n\n  To protect your rights, we need to make restrictions that forbid\ndistributors to deny you these rights or to ask you to surrender these\nrights.  These restrictions translate to certain responsibilities for\nyou if you distribute copies of the library or if you modify it.\n\n  For example, if you distribute copies of the library, whether gratis\nor for a fee, you must give the recipients all the rights that we gave\nyou.  You must make sure that they, too, receive or can get the source\ncode.  If you link other code with the library, you must provide\ncomplete object files to the recipients, so that they can relink them\nwith the library after making changes to the library and recompiling\nit.  And you must show them these terms so they know their rights.\n\n  We protect your rights with a two-step method: (1) we copyright the\nlibrary, and (2) we offer you this license, which gives you legal\npermission to copy, distribute and/or modify the library.\n\n  To protect each distributor, we want to make it very clear that\nthere is no warranty for the free library.  Also, if the library is\nmodified by someone else and passed on, the recipients should know\nthat what they have is not the original version, so that the original\nauthor's reputation will not be affected by problems that might be\nintroduced by others.\n\f\n  Finally, software patents pose a constant threat to the existence of\nany free program.  We wish to make sure that a company cannot\neffectively restrict the users of a free program by obtaining a\nrestrictive license from a patent holder.  Therefore, we insist that\nany patent license obtained for a version of the library must be\nconsistent with the full freedom of use specified in this license.\n\n  Most GNU software, including some libraries, is covered by the\nordinary GNU General Public License.  This license, the GNU Lesser\nGeneral Public License, applies to certain designated libraries, and\nis quite different from the ordinary General Public License.  We use\nthis license for certain libraries in order to permit linking those\nlibraries into non-free programs.\n\n  When a program is linked with a library, whether statically or using\na shared library, the combination of the two is legally speaking a\ncombined work, a derivative of the original library.  The ordinary\nGeneral Public License therefore permits such linking only if the\nentire combination fits its criteria of freedom.  The Lesser General\nPublic License permits more lax criteria for linking other code with\nthe library.\n\n  We call this license the \"Lesser\" General Public License because it\ndoes Less to protect the user's freedom than the ordinary General\nPublic License.  It also provides other free software developers Less\nof an advantage over competing non-free programs.  These disadvantages\nare the reason we use the ordinary General Public License for many\nlibraries.  However, the Lesser license provides advantages in certain\nspecial circumstances.\n\n  For example, on rare occasions, there may be a special need to\nencourage the widest possible use of a certain library, so that it becomes\na de-facto standard.  To achieve this, non-free programs must be\nallowed to use the library.  A more frequent case is that a free\nlibrary does the same job as widely used non-free libraries.  In this\ncase, there is little to gain by limiting the free library to free\nsoftware only, so we use the Lesser General Public License.\n\n  In other cases, permission to use a particular library in non-free\nprograms enables a greater number of people to use a large body of\nfree software.  For example, permission to use the GNU C Library in\nnon-free programs enables many more people to use the whole GNU\noperating system, as well as its variant, the GNU/Linux operating\nsystem.\n\n  Although the Lesser General Public License is Less protective of the\nusers' freedom, it does ensure that the user of a program that is\nlinked with the Library has the freedom and the wherewithal to run\nthat program using a modified version of the Library.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.  Pay close attention to the difference between a\n\"work based on the library\" and a \"work that uses the library\".  The\nformer contains code derived from the library, whereas the latter must\nbe combined with the library in order to run.\n\f\n                  GNU LESSER GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License Agreement applies to any software library or other\nprogram which contains a notice placed by the copyright holder or\nother authorized party saying it may be distributed under the terms of\nthis Lesser General Public License (also called \"this License\").\nEach licensee is addressed as \"you\".\n\n  A \"library\" means a collection of software functions and/or data\nprepared so as to be conveniently linked with application programs\n(which use some of those functions and data) to form executables.\n\n  The \"Library\", below, refers to any such software library or work\nwhich has been distributed under these terms.  A \"work based on the\nLibrary\" means either the Library or any derivative work under\ncopyright law: that is to say, a work containing the Library or a\nportion of it, either verbatim or with modifications and/or translated\nstraightforwardly into another language.  (Hereinafter, translation is\nincluded without limitation in the term \"modification\".)\n\n  \"Source code\" for a work means the preferred form of the work for\nmaking modifications to it.  For a library, complete source code means\nall the source code for all modules it contains, plus any associated\ninterface definition files, plus the scripts used to control compilation\nand installation of the library.\n\n  Activities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning a program using the Library is not restricted, and output from\nsuch a program is covered only if its contents constitute a work based\non the Library (independent of the use of the Library in a tool for\nwriting it).  Whether that is true depends on what the Library does\nand what the program that uses the Library does.\n\n  1. You may copy and distribute verbatim copies of the Library's\ncomplete source code as you receive it, in any medium, provided that\nyou conspicuously and appropriately publish on each copy an\nappropriate copyright notice and disclaimer of warranty; keep intact\nall the notices that refer to this License and to the absence of any\nwarranty; and distribute a copy of this License along with the\nLibrary.\n\n  You may charge a fee for the physical act of transferring a copy,\nand you may at your option offer warranty protection in exchange for a\nfee.\n\f\n  2. You may modify your copy or copies of the Library or any portion\nof it, thus forming a work based on the Library, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) The modified work must itself be a software library.\n\n    b) You must cause the files modified to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    c) You must cause the whole of the work to be licensed at no\n    charge to all third parties under the terms of this License.\n\n    d) If a facility in the modified Library refers to a function or a\n    table of data to be supplied by an application program that uses\n    the facility, other than as an argument passed when the facility\n    is invoked, then you must make a good faith effort to ensure that,\n    in the event an application does not supply such function or\n    table, the facility still operates, and performs whatever part of\n    its purpose remains meaningful.\n\n    (For example, a function in a library to compute square roots has\n    a purpose that is entirely well-defined independent of the\n    application.  Therefore, Subsection 2d requires that any\n    application-supplied function or table used by this function must\n    be optional: if the application does not supply it, the square\n    root function must still compute square roots.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Library,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Library, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote\nit.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Library.\n\nIn addition, mere aggregation of another work not based on the Library\nwith the Library (or with a work based on the Library) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may opt to apply the terms of the ordinary GNU General Public\nLicense instead of this License to a given copy of the Library.  To do\nthis, you must alter all the notices that refer to this License, so\nthat they refer to the ordinary GNU General Public License, version 2,\ninstead of to this License.  (If a newer version than version 2 of the\nordinary GNU General Public License has appeared, then you can specify\nthat version instead if you wish.)  Do not make any other change in\nthese notices.\n\f\n  Once this change is made in a given copy, it is irreversible for\nthat copy, so the ordinary GNU General Public License applies to all\nsubsequent copies and derivative works made from that copy.\n\n  This option is useful when you wish to copy part of the code of\nthe Library into a program that is not a library.\n\n  4. You may copy and distribute the Library (or a portion or\nderivative of it, under Section 2) in object code or executable form\nunder the terms of Sections 1 and 2 above provided that you accompany\nit with the complete corresponding machine-readable source code, which\nmust be distributed under the terms of Sections 1 and 2 above on a\nmedium customarily used for software interchange.\n\n  If distribution of object code is made by offering access to copy\nfrom a designated place, then offering equivalent access to copy the\nsource code from the same place satisfies the requirement to\ndistribute the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  5. A program that contains no derivative of any portion of the\nLibrary, but is designed to work with the Library by being compiled or\nlinked with it, is called a \"work that uses the Library\".  Such a\nwork, in isolation, is not a derivative work of the Library, and\ntherefore falls outside the scope of this License.\n\n  However, linking a \"work that uses the Library\" with the Library\ncreates an executable that is a derivative of the Library (because it\ncontains portions of the Library), rather than a \"work that uses the\nlibrary\".  The executable is therefore covered by this License.\nSection 6 states terms for distribution of such executables.\n\n  When a \"work that uses the Library\" uses material from a header file\nthat is part of the Library, the object code for the work may be a\nderivative work of the Library even though the source code is not.\nWhether this is true is especially significant if the work can be\nlinked without the Library, or if the work is itself a library.  The\nthreshold for this to be true is not precisely defined by law.\n\n  If such an object file uses only numerical parameters, data\nstructure layouts and accessors, and small macros and small inline\nfunctions (ten lines or less in length), then the use of the object\nfile is unrestricted, regardless of whether it is legally a derivative\nwork.  (Executables containing this object code plus portions of the\nLibrary will still fall under Section 6.)\n\n  Otherwise, if the work is a derivative of the Library, you may\ndistribute the object code for the work under the terms of Section 6.\nAny executables containing that work also fall under Section 6,\nwhether or not they are linked directly with the Library itself.\n\f\n  6. As an exception to the Sections above, you may also combine or\nlink a \"work that uses the Library\" with the Library to produce a\nwork containing portions of the Library, and distribute that work\nunder terms of your choice, provided that the terms permit\nmodification of the work for the customer's own use and reverse\nengineering for debugging such modifications.\n\n  You must give prominent notice with each copy of the work that the\nLibrary is used in it and that the Library and its use are covered by\nthis License.  You must supply a copy of this License.  If the work\nduring execution displays copyright notices, you must include the\ncopyright notice for the Library among them, as well as a reference\ndirecting the user to the copy of this License.  Also, you must do one\nof these things:\n\n    a) Accompany the work with the complete corresponding\n    machine-readable source code for the Library including whatever\n    changes were used in the work (which must be distributed under\n    Sections 1 and 2 above); and, if the work is an executable linked\n    with the Library, with the complete machine-readable \"work that\n    uses the Library\", as object code and/or source code, so that the\n    user can modify the Library and then relink to produce a modified\n    executable containing the modified Library.  (It is understood\n    that the user who changes the contents of definitions files in the\n    Library will not necessarily be able to recompile the application\n    to use the modified definitions.)\n\n    b) Use a suitable shared library mechanism for linking with the\n    Library.  A suitable mechanism is one that (1) uses at run time a\n    copy of the library already present on the user's computer system,\n    rather than copying library functions into the executable, and (2)\n    will operate properly with a modified version of the library, if\n    the user installs one, as long as the modified version is\n    interface-compatible with the version that the work was made with.\n\n    c) Accompany the work with a written offer, valid for at\n    least three years, to give the same user the materials\n    specified in Subsection 6a, above, for a charge no more\n    than the cost of performing this distribution.\n\n    d) If distribution of the work is made by offering access to copy\n    from a designated place, offer equivalent access to copy the above\n    specified materials from the same place.\n\n    e) Verify that the user has already received a copy of these\n    materials or that you have already sent this user a copy.\n\n  For an executable, the required form of the \"work that uses the\nLibrary\" must include any data and utility programs needed for\nreproducing the executable from it.  However, as a special exception,\nthe materials to be distributed need not include anything that is\nnormally distributed (in either source or binary form) with the major\ncomponents (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, unless that component itself accompanies\nthe executable.\n\n  It may happen that this requirement contradicts the license\nrestrictions of other proprietary libraries that do not normally\naccompany the operating system.  Such a contradiction means you cannot\nuse both them and the Library together in an executable that you\ndistribute.\n\f\n  7. You may place library facilities that are a work based on the\nLibrary side-by-side in a single library together with other library\nfacilities not covered by this License, and distribute such a combined\nlibrary, provided that the separate distribution of the work based on\nthe Library and of the other library facilities is otherwise\npermitted, and provided that you do these two things:\n\n    a) Accompany the combined library with a copy of the same work\n    based on the Library, uncombined with any other library\n    facilities.  This must be distributed under the terms of the\n    Sections above.\n\n    b) Give prominent notice with the combined library of the fact\n    that part of it is a work based on the Library, and explaining\n    where to find the accompanying uncombined form of the same work.\n\n  8. You may not copy, modify, sublicense, link with, or distribute\nthe Library except as expressly provided under this License.  Any\nattempt otherwise to copy, modify, sublicense, link with, or\ndistribute the Library is void, and will automatically terminate your\nrights under this License.  However, parties who have received copies,\nor rights, from you under this License will not have their licenses\nterminated so long as such parties remain in full compliance.\n\n  9. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Library or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Library (or any work based on the\nLibrary), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Library or works based on it.\n\n  10. Each time you redistribute the Library (or any work based on the\nLibrary), the recipient automatically receives a license from the\noriginal licensor to copy, distribute, link with or modify the Library\nsubject to these terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties with\nthis License.\n\f\n  11. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Library at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Library by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply,\nand the section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  12. If the distribution and/or use of the Library is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Library under this License may add\nan explicit geographical distribution limitation excluding those countries,\nso that distribution is permitted only in or among countries not thus\nexcluded.  In such case, this License incorporates the limitation as if\nwritten in the body of this License.\n\n  13. The Free Software Foundation may publish revised and/or new\nversions of the Lesser General Public License from time to time.\nSuch new versions will be similar in spirit to the present version,\nbut may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Library\nspecifies a version number of this License which applies to it and\n\"any later version\", you have the option of following the terms and\nconditions either of that version or of any later version published by\nthe Free Software Foundation.  If the Library does not specify a\nlicense version number, you may choose any version ever published by\nthe Free Software Foundation.\n\f\n  14. If you wish to incorporate parts of the Library into other free\nprograms whose distribution conditions are incompatible with these,\nwrite to the author to ask for permission.  For software which is\ncopyrighted by the Free Software Foundation, write to the Free\nSoftware Foundation; we sometimes make exceptions for this.  Our\ndecision will be guided by the two goals of preserving the free status\nof all derivatives of our free software and of promoting the sharing\nand reuse of software generally.\n\n                            NO WARRANTY\n\n  15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO\nWARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR\nOTHER PARTIES PROVIDE THE LIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nLIBRARY IS WITH YOU.  SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY\nAND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU\nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nLIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\f\n           How to Apply These Terms to Your New Libraries\n\n  If you develop a new library, and you want it to be of the greatest\npossible use to the public, we recommend making it free software that\neveryone can redistribute and change.  You can do so by permitting\nredistribution under these terms (or, alternatively, under the terms of the\nordinary General Public License).\n\n  To apply these terms, attach the following notices to the library.  It is\nsafest to attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least the\n\"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the library's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This library is free software; you can redistribute it and/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 2.1 of the License, or (at your option) any later version.\n\n    This library is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    Lesser General Public License for more details.\n\n    You should have received a copy of the GNU Lesser General Public\n    License along with this library; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n\nAlso add information on how to contact you by electronic and paper mail.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the library, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the\n  library `Frob' (a library for tweaking knobs) written by James Random Hacker.\n\n  <signature of Ty Coon>, 1 April 1990\n  Ty Coon, President of Vice\n\nThat's all there is to it!\n"
        },
        {
          "name": "NEWS",
          "type": "blob",
          "size": 151.7109375,
          "content": "Changes in 1.16.1\n~~~~~~~~~~~~~~~~~~\nReleased: not yet\n\n...\n\nChanges in 1.16.0\n~~~~~~~~~~~~~~~~~~\nReleased: 2025-01-09\n\nBug fixes:\n\n * Update libglnx to 2024-12-06:\n    - Fix an assertion failure if creating a parent directory encounters a\n      dangling symlink (GNOME/libglnx#1)\n    - Fix a Meson warning\n\n* Don't emit terminal progress indicator escape sequences by default. They are\n  interpreted as notifications by some terminal emulators. (#6052)\n\n* Fix introspection annotations in libflatpak\n\nEnhancements:\n\n* Add the `FLATPAK_TTY_PROGRESS` environment variable, which re-enables the\n  terminal progress indicator escape sequences added in 1.15.91.\n\n* Document the `FLATPAK_FANCY_OUTPUT` environment variable, which allows\n  disabling the fancy formatting when outputting to a terminal.\n\nChanges in 1.15.91\n~~~~~~~~~~~~~~~~~~\nReleased: 2024-12-19\n\nEnhancements:\n\n * Add the `FLATPAK_DATA_DIR` environment variable, which allows overriding\n   at runtime the data directory location that Flatpak uses to search for\n   configuration files such as remotes. This is useful for running tests,\n   and for when installing using Flatpak in a chroot.\n\n * Add a `FLATPAK_DOWNLOAD_TMPDIR` variable. This allows using download\n   directories other than /var/tmp.\n\n * Emit progress escape sequence. This can be used by terminal emulators\n   to detect and display progress of Flatpak operations on their graphical\n   user interfaces.\n\nBug fixes:\n\n * Install missing test data. This should fix \"as-installed\" tests via\n   `ginsttest-runner`, used for example in Debian's autopkgtest framework.\n\n * Unify and improve how the Wayland socket is passed to the sandboxed app.\n   This should fix a regression that is triggered by compositors that both\n   implement the security-context-v1 protocol, and sets the `WAYLAND_DISPLAY`\n   environment variable when launching Flatpak apps. (#5863)\n\n * Fix the plural form of a translatable string.\n\nChanges in 1.15.12\n~~~~~~~~~~~~~~~~~~\nReleased: 2024-11-28\n\nBug fixes:\n\n * Return to using the process ID of the Flatpak app in the cgroup name.\n   Using the instance ID in 1.15.11 caused crashes when installing apps,\n   extensions or runtimes that use the \"extra data\" mechanism, which\n   does not set up an instance ID. (#6009)\n\nChanges in 1.15.11\n~~~~~~~~~~~~~~~~~~\nReleased: 2024-11-26\n\nDependencies:\n\n * In distributions that compile Flatpak to use a separate bubblewrap\n   executable, version 0.11.0 is recommended (but not required).\n   The minimum bubblewrap continues to be 0.10.0.\n\n * In distributions that compile Flatpak to use a separate xdg-dbus-proxy\n   executable, version 0.1.6 is recommended (but not required).\n   The minimum xdg-dbus-proxy continues to be 0.1.0.\n\nEnhancements:\n\n * Allow applications like WebKit to connect the AT-SPI accessibility tree\n   of processes in a sub-sandbox with the tree in the main process (#5898)\n\n     * New sandboxing parameter `flatpak run --a11y-own-name`, which is\n       like `--own-name` but for the accessibility bus\n\n     * flatpak-portal API v7: add new sandbox-a11y-own-names option, which\n       accepts names matching `${FLATPAK_ID}.*`\n\n     * Apps may call the `org.a11y.atspi.Socket.Embedded` method on names\n       matching `${FLATPAK_ID}.Sandboxed.*` by default\n\n * `flatpak run -vv $app_id` shows all applicable sandboxing parameters\n   and their source, including overrides, as debug messages (#5895)\n\n * Add --device=usb, a subset of --device=all\n\n * Introduce USB device listing\n\n   * Apps can list which USB devices they want to access ahead of time by\n     using the `--usb` parameter. Check the manpages for the more information\n     about the accepted syntax.\n\n   * Denying access to USB devices is also possible with the `--no-usb`\n     parameter. The syntax is equal to `--usb`.\n\n   * Both options merely store metadata, and aren't used by Flatpak itself.\n     This metadata is intended to be used by the (as of now, still in\n     progress) USB portal to decide which devices the app can enumerate and\n     request access.\n\n * Add support for KDE search completion\n\n * Use the instance id of the Flatpak app as part of the cgroup name. This\n   better matches the naming conventions for cgroup.\n\n * Preconfigured repositories can now be set up by OS vendors using\n   `${datadir}/flatpak/remotes.d` (typically /usr/share/flatpak/remotes.d),\n   in addition to `${sysconfdir}/flatpak/remotes.d` (typically\n   /etc/flatpak/remotes.d) which is intended for local sysadmin use\n\nBug fixes:\n\n * Update libglnx to 2024-08-23 (#5918)\n\n     * fix build in environments that use -Werror=return-type, such as\n       openSUSE Tumbleweed (#5778)\n\n     * add a fallback definition for G_PID_FORMAT with older GLib\n\n     * avoid warnings for g_steal_fd() with newer GLib\n\n     * improve compatibility of g_closefrom() backport with newer GLib\n\n * Update meson wrap file for bubblewrap to version 0.11.0:\n\n     * drop Autotools build system\n\n     * improve handling of EINTR\n\n     * improve handling of socket control messages\n\n     * improve compatibility with busybox\n\n     * improve compatibility with older Meson\n\n     * fix deprecation warnings\n\n * Update meson wrap file for xdg-dbus-proxy to version 0.1.6:\n\n     * compatibility with D-Bus implementations that pipeline the\n       authentication handshake, such as sd-bus and zbus\n\n     * compatibility with D-Bus implementations that use non-consecutive\n       serial numbers, such as godbus and zbus\n\n     * broadcast signals can be allowed without having to add TALK permission\n       (#5828)\n\n     * fix memory leaks\n\n * Fix some memory leaks\n\n * Translation updates: cs, pl, zh_CN\n\nInternal changes:\n\n * Better const-correctness (#5913)\n * Fix a shellcheck warning in the tests (#5914)\n\nChanges in 1.15.10\n~~~~~~~~~~~~~~~~~~\nReleased: 2024-08-14\n\nDependencies:\n\n * In distributions that compile Flatpak to use a separate bubblewrap (bwrap)\n   executable, version 0.10.0 is required.\n   This version adds a new feature which is required by the security fix\n   in this release.\n\nSecurity fixes:\n\n * Don't follow symbolic links when mounting persistent directories\n   (--persist option). This prevents a sandbox escape where a malicious or\n   compromised app could edit the symlink to point to a directory that\n   the app should not have been allowed to read or write.\n   (CVE-2024-42472, GHSA-7hgv-f2j8-xw87)\n\nDocumentation:\n\n * Mark the 1.12.x and 1.10.x branches as end-of-life (#5352)\n\nOther bug fixes:\n\n * Fix several memory leaks (#5883, #5884)\n\nInternal changes:\n\n * Record a log file when running build-time tests with\n   AddressSanitizer (#5884)\n\n * Add initial suppressions file for AddressSanitizer (#5884)\n\nChanges in 1.15.9\n~~~~~~~~~~~~~~~~~\nReleased: 2024-07-22\n\nDependencies:\n\n * bubblewrap and xdg-dbus-proxy are now provided by Meson wrap files\n   instead of being directly vendored via `git submodule`.\n   If downloading external software during build is not allowed in your\n   environment, please install suitable versions of bubblewrap and\n   xdg-dbus-proxy separately, then configure Flatpak with options similar to\n   `-Dsystem_bubblewrap=bwrap -Dsystem_dbus_proxy=xdg-dbus-proxy`\n   (most major distributions package it like this already).\n\nEnhancements:\n\n * If xdg-dbus-proxy is new enough (0.1.6 or later, not yet released),\n   allow two broadcast signals from AT-SPI by default, allowing bus\n   traffic to be reduced. If xdg-dbus-proxy is older, this change will\n   have no practical effect but is harmless. (#5828)\n\n * Install csh profile snippet (#5753)\n\nBug fixes:\n\n * Expand the list of environment variables that Flatpak apps do not\n   inherit from the host system (#5765, #5785)\n\n * Take time zone information from $TZDIR if set (#5850)\n\n * Fix a memory leak since 1.15.7 when reloading D-Bus configuration (#5856)\n\n * Fix a memory leak when running `flatpak permissions` (#5844)\n\n * Fix memory leaks in `flatpak update` (#5816)\n\n * Fix memory leaks when installing packages (#5811)\n\n * Use more similar translatable strings for some error messages (#5748)\n\n * Document `flatpak config --set languages '*all*'` correctly:\n   it is really `*all*` (or equivalently `*`), not just `all` (#5836)\n\n * Fix a misleading comment in the test for CVE-2024-32462 (#5779)\n\n * Fix a copy/paste error in the 1.15.7 release notes\n\n * On systems where subdirectories of /sys have been made inaccessible,\n   continue without them (#5138)\n\n * Make tests more compatible with non-GNU shell utilities (#5812)\n\n * Translation updates: ka (#5873), hi (#5838), pt_BR (#5877), zh_CN (#5843)\n\nInternal changes:\n\n * libglnx and variant-schema-compiler are now managed as `git subtree`\n   instead of `git submodule`.\n   Maintainers and contributors, please see `subprojects/README.md` for\n   details of how to interact with these.\n   In particular this means that submodules no longer need to be set up\n   before working on a git clone. (#5800, #5845)\n\n * Split library code into more, smaller translation units, reducing\n   internal circular dependencies (#5409, #5801, #5803)\n\n * Add some convenience macros in the test suite (#5693)\n\n * Minor internal robustness improvement (#5833)\n\n * Add configuration for Github Codespaces (#5767)\n\n * Improve CI configuration (#5791)\n\n * Work around infrastructure issues in third-party apt repositories\n   used by default in Github Workflows (#5786)\n\nChanges in 1.15.8\n~~~~~~~~~~~~~~~~~\nReleased: 2024-04-18\n\nSecurity fixes:\n\n * Don't allow an executable name to be misinterpreted as a command-line\n   option for bwrap(1). This prevents a sandbox escape where a malicious\n   or compromised app could ask xdg-desktop-portal to generate a .desktop\n   file with access to files outside the sandbox. (CVE-2024-32462)\n\nOther bug fixes:\n\n * Pass the -export-dynamic linker option as -Wl,-export-dynamic,\n   fixing build failures with clang 18 and lld 18 (#5760)\n\n * Fix a double-free when installation is cancelled (#5763)\n\n * Fix installed-tests failure with \"FUSERMOUNT: unbound variable\"\n   (#5751)\n\n * Translation updates: pt_BR (#5762), tr (#5761)\n\nChanges in 1.15.7\n~~~~~~~~~~~~~~~~~\nReleased: 2024-03-27\n\nDependencies:\n\n * The Meson build system is now required.\n   Compiling with Autotools is no longer possible.\n\n * In distributions that compile Flatpak to use a separate bubblewrap (bwrap)\n   executable, version 0.9.0 is recommended. Several of the bug fixes listed\n   below will not be active if an older version is used.\n\n * In distributions that compile Flatpak to use a separate xdg-dbus-proxy\n   executable, version 0.1.5 is recommended.\n\n * If libmalcontent (parental controls) is enabled, it must be version 0.5.0\n   or later.\n\nNew features:\n\n * Automatically remove obsolete driver versions and other autopruned refs\n   (#5632)\n\n * `--socket=inherit-wayland-socket` (#5614)\n\n * Automatically reload D-Bus session bus configuration after installing\n   or upgrading apps, to pick up any exported D-Bus services (#3342)\n\nBug fixes:\n\n * Update included copy of bubblewrap to version 0.9.0:\n\n     * `--symlink` is now idempotent, meaning it succeeds if the\n       symlink already exists and already has the desired target\n       (#2387, #3477, #5255)\n     * Report a better error message if `mount(2)` fails with `ENOSPC`\n     * Fix a double-close on error reading from `--args`, `--seccomp` or\n       `--add-seccomp-fd` argument\n     * Improve memory allocation behaviour\n     * Silence various compiler warnings\n\n * Update included copy of xdg-dbus-proxy to version 0.1.5:\n\n     * Fix handling of long object paths\n\n * Don't parse `<developer><name/></developer>` as the application name\n   (#5700)\n\n * Don't refuse to start apps when there is no D-Bus system bus available\n   (#5076)\n\n * Don't try to repeat migration of apps whose data was migrated to a new\n   name and then deleted (#5668)\n\n * Improve handling of mixed locales on systems with systemd-localed (#5497)\n\n * Improve display of ellipsized columns in wide terminals (#5722)\n\n * Make `flatpak info -e` look for extensions in all installations (#5670)\n\n * Fix warnings from newer GLib versions (#5660, #5737)\n\n * Always set the `container` environment variable (#5610)\n\n * Always let the app inherit redirected file descriptors (#5626)\n\n * In `flatpak ps`, add xdg-desktop-portal-gnome to the list of backends\n   we'll use to learn which apps are running in the background (#5729)\n\n * Don't use `WAYLAND_SOCKET` unless given `--socket=inherit-wayland-socket`\n   (#5614)\n\n * Use `fusermount3` if compiled with FUSE 3, overridable with\n   `-Dsystem_fusermount` compile-time option (#5104)\n\n * Avoid leaking a temporary variable from /etc/profile.d/flatpak.sh into\n   the shell environment (#5574)\n\n * Improve async-signal safety (#5687)\n\n * Fix various memory leaks (#5683, #5690, #5691)\n\n * Avoid undefined behaviour of signed left-shift when storing object IDs\n   in a hash table (#5738)\n\n * Detect the correct gtk-doc when cross-compiling (#5650)\n\n * Detect the correct wayland-scanner when cross-compiling (#5596)\n\n * Documentation improvements (#5659, #5677, #5682, #5664, #5719)\n\n * Skip more tests when FUSE isn't available (#5611)\n\n * Translation updates (#5602, #5707)\n\nChanges in 1.15.6\n~~~~~~~~~~~~~~~~~\nReleased: 2023-11-14\n\nDependencies:\n\n * In distributions that compile Flatpak to use a separate bubblewrap (bwrap)\n   executable, version 0.8.0 is now required.\n\n * Enabling the optional Wayland security context feature requires\n   libwayland-client, wayland-scanner >= 1.15 and wayland-protocols >= 1.32.\n\n * Ubuntu 18.04 is no longer routinely tested. Support for dependency\n   versions included in Ubuntu 18.04 should be considered \"at risk\".\n\nFeatures:\n\n * Add --device=input, for access to evdev devices in /dev/input (#5481)\n\n * Update bundled copy of bubblewrap to version 0.8.0, and rely on its\n   features:\n     * Improve error message if seccomp is disabled in kernel config\n     * Security hardening: set user namespace limit to 0, to prevent creation\n       of nested user namespaces in a more robust way (#5084)\n\n * For subsandboxes started by flatpak-portal, inherit environment\n   variables from the `flatpak run` that started the original instance\n   rather than from flatpak-portal, fixing behaviour of FLATPAK_GL_DRIVERS\n   and similar features (#5278)\n\n * Stop http transfers if a download in progress becomes very slow (#5519)\n\n * Make it easier to configure extra languages, by picking them up from\n   AccountsService if configured there (#5006)\n\n * Add new flatpak_transaction_add_rebase_and_uninstall() API,\n   allowing end-of-life apps to be replaced by their intended replacement\n   more reliably (#3991)\n\n * Create a private Wayland socket with the \"security context\" extension\n   if available, allowing the compositor to identify connections from\n   sandboxed apps as belonging to the sandbox (#4920, #5507, #5558)\n\n * Update libglnx to 2023-08-29\n     * Use features of newer GLib versions if available\n     * Turn off system-level crash reporting infrastructure during\n       some unit tests that involve intentional assertion failures\n\n * Add anchors to link to sections of flatpak-metadata documentation (#5582)\n\n * New translations: ka, nl.\n\nBug fixes:\n\n * Avoid warnings processing symbolic links with GLib >= 2.77.0, and\n   with GLib 2.76.0 (GLib 2.76.1 or later silences these warnings)\n\n * Bypass page cache for backend requests in revokefs, fixing installation\n   errors with libostree 2023.4 (#5452)\n\n * Show AppStream metadata in `flatpak remote-info` as intended\n   (#5523; regression in 1.9.1)\n\n * Don't let Flatpak apps inherit VK_DRIVER_FILES or VK_ICD_FILENAMES\n   from the host system, which would be wrong for the sandbox (#5553)\n\n * Fix build failure with prereleases of libappstream 0.17.x (#5472)\n\n * Forward-compatibility with libappstream 1.0 (#5563)\n\n * Fix installation with Meson if configured with -Dauto_sideloading=true\n   (#5495)\n\n * Fix a memory leak (#5329)\n\n * Fix compiler warnings (#5362, #5366)\n\n * Make the tests fail more comprehensibly if a required tool is missing\n   (#5020)\n\n * Clean up `/var/tmp/flatpak-cache-*` directories on boot (#1119)\n\n * Don't force `GIO_USE_VFS=local` for programs launched via flatpak-spawn\n   (#5567)\n\n * Clarify documentation for D-Bus name ownership (#5582)\n\n * Translation updates: id, tr, zh_CN\n   (#5332, #5565)\n\nInternal changes:\n\n * Split up large source files into smaller modules, reducing internal\n   circular dependencies (#5410, #5411, #5415, #5419, #5416, #5414)\n\n * Re-synchronize code backported from GLib with the version in GLib\n   (#5410)\n\n * Make the flags used to apply \"extra data\" clearer (#5466)\n\n * Use glnx_opendirat() where possible (#5527)\n\n * CI improvements (#5374, #5381)\n\nChanges in 1.15.4\n~~~~~~~~~~~~~~~~~\nReleased: 2023-03-16\n\nSecurity fixes:\n\n* Escape special characters when displaying permissions and metadata,\n  preventing malicious apps from manipulating the appearance of the\n  permissions list using crafted metadata (CVE-2023-28101).\n\n* If a Flatpak app is run on a Linux virtual console (tty1, tty2, etc.),\n  don't allow copy/paste via the TIOCLINUX ioctl (CVE-2023-28100).\n  Note that this is specific to virtual consoles: Flatpak is not\n  vulnerable to this if run from a graphical terminal emulator such as\n  xterm, gnome-terminal or Konsole.\n\nOther bug fixes:\n\n* Document the path used for `flatpak override`\n* Translation updates: oc, pl, ru, sv, tr\n\nChanges in 1.15.3\n~~~~~~~~~~~~~~~~~\nReleased: 2023-02-21\n\nBuild system:\n\n* Building this version of Flatpak with Meson is recommended. The source\n  release flatpak-1.15.3.tar.xz no longer contains Autotools-generated\n  files, although this version can still be built using Autotools after\n  running `./autogen.sh`. Future versions are likely to remove the\n  Autotools build system.\n\nBug fixes:\n\n* When splitting an upgrade into two steps (download without installing, and\n  then upgrade without allowing further downloads) like GNOME Software does,\n  if an app is marked EOL and superseded by a replacement, don't remove the\n  superseded app in the first step, which would result in the replacement\n  incorrectly not being installed (#5172)\n* Fix a crash when --socket=gpg-agent is used (#5095)\n* Fix a crash when listing apps if one of them is broken or misconfigured\n  (#5293)\n* If an app has invalid syntax in its overrides or metadata, mention the\n  filename in the error message (#5293)\n* Unset $GDK_BACKEND for apps, ensuring GTK apps with --socket=fallback-x11\n  can work (#5303)\n* Fix a deprecation warning when compiled with curl >= 7.85 (#5284)\n* Translation updates: es, ru (#5266, #5312, #5313)\n\nInternal changes:\n\n* Better diagnostic messages for why runtimes are or are not considered\n  unused (#5237)\n\nChanges in 1.15.2\n~~~~~~~~~~~~~~~~~\nReleased: 2023-02-06\n\nBug fixes:\n\n* Never try to export a parent of reserved directories as a --filesystem,\n  for example /run, which would prevent the app from starting (#5205, #5207)\n* Never try to export a --filesystem below /run/flatpak or /run/host,\n  which could similarly prevent the app from starting\n* The above change also fixes apps not starting if a --filesystem is a\n  symlink to the root directory (#1357)\n* Show a warning when the --filesystem exists but cannot be shared with\n  the sandbox (#1357, #5035, #5205, #5207)\n* Display the intended messages for `flatpak repair` (#5204)\n* Exporting an app to an existing repository on a CIFS filesystem\n  now works as intended (#5257)\n* Unset $GIO_EXTRA_MODULES for apps, avoiding misbehaviour in some GLib\n  apps when set to a path on the host (#5206)\n* Unset $XKB_CONFIG_ROOT for apps, avoiding crashes in GTK and Qt apps\n  under Wayland when this variable is set to a path not available in the\n  sandbox (#5194)\n* When using the fish shell, avoid duplicate XDG_DATA_DIRS entries if the\n  profile script is sourced more than once (#5198)\n* Update included copy of bubblewrap to 0.7.0 for better error messages\n* Install SELinux files correctly when building with Meson\n* Translation updates: ru, tr (#5256, #5262)\n\nInternal changes:\n\n* Update included copy of libglnx\n* flatpak -v now uses the INFO log level, and flatpak -vv uses the\n  DEBUG log level in the flatpak log domain. Previously, the extra\n  messages that were logged by flatpak -vv were in a separate \"flatpak2\"\n  log domain. G_MESSAGES_DEBUG=flatpak previously had an effect similar to\n  flatpak -v, and is now more similar to flatpak -vv. (#5001)\n\nChanges in 1.15.1\n~~~~~~~~~~~~~~~~~\nReleased: 2022-11-17\n\nDependencies:\n\n* When building with Meson, gpgme 1.8.0 is now required.\n  Older versions can still be used by building with Autotools.\n\nFeatures:\n\n* If an old temporary deploy directory was leaked by versions before #5146,\n  clean it up the next time the same app is updated (#5164)\n\nBug fixes:\n\n* If an app update is blocked by parental controls policies, clean up the\n  temporary deploy directory (#5146)\n* Fix Autotools build with versions of gpgme that no longer provide\n  gpgme-config(1) (#5173)\n* Fix a possible parallel build failure with Meson (#5165)\n* Fix a compiler warning on 32-bit architectures (#5148)\n* When building with Autotools, be more consistent about applying compiler\n  warning flags (#5149)\n* Unset $TEMP, $TEMPDIR and $TMP for apps, the same as $TMPDIR (#5168)\n* Treat /efi the same as /boot/efi (#5155)\n\nChanges in 1.15.0\n~~~~~~~~~~~~~~~~~\nReleased: 2022-10-24\n\nBuild system:\n\n* Flatpak can now be compiled using Meson instead of Autotools.\n  This requires Meson 0.53.0 or later, and Python 3.5 or later.\n  The Autotools build system is likely to be removed during either the\n  1.15.x or 1.17.x cycle. (#4845)\n\nNew features:\n\n* Allow the `modify_ldt` system call as part of `--allow=multiarch`.\n  This increases attack surface, but is required when running 16-bit\n  executables in some versions of Wine. (#4297)\n* Share gssproxy socket, which acts like a portal for Kerberos authentication.\n  This lets apps use Kerberos authentication without needing a sandbox hole.\n  (#4914)\n* Add a httpbackend variable to flatpak.pc, allowing dependent projects\n  like GNOME Software to detect whether they are compatible with libflatpak\n  (#5054)\n\nBug fixes:\n\n* Terminate the flatpak-session-helper and flatpak-portal services when the\n  session ends, so that applications will not inherit outdated Wayland\n  and X11 socket addresses (#5068)\n* When using `fish` shell, don't overwrite a previously-set XDG_DATA_DIRS\n  (#5123)\n* Don't try to enable HTTP 2 if linked to a libcurl version that doesn't\n  support it (#5074)\n* Stop systemd reporting the session-helper as failed when terminated by\n  a signal (#5129)\n* Fix a warning when listing a document with no permissions (#5055)\n* Fix compilation with GLib 2.66.x (as used in Debian 11) (#5062)\n* Fix compilation with GLib 2.58.x (as used in Debian 10) (#5066)\n* Make generated files more reproducible (#5085)\n* Translation updates: cs, id, pl, pt_BR (#5052, #5056, #5059, #5126)\n\nInternal changes:\n\n* Update project logo in README (#5119)\n* Update libglnx subproject (#5140)\n\nChanges in 1.14.0\n~~~~~~~~~~~~~~~~~\nReleased: 2022-08-22\n\nKnown issues:\n* There may be an issue where non-primary architecture builds don't show up\n  (https://github.com/flatpak/flatpak/issues/5045)\n* There is a new security advisory on Flatpak but all supported versions are\n  not affected due to using new enough versions of libostree\n  (https://github.com/flatpak/flatpak/security/advisories/GHSA-45jq-5658-v38x)\n\nDependencies:\n\n* Conditional on a build time option, revokefs will now use version 3 of the\n  FUSE API rather than version 2 (#4326)\n* Libappstream should be updated to at least 0.15.3 to avoid critical warning\n  messages when using the \"flatpak search\" command\n  (https://github.com/ximion/appstream/issues/384)\n\nNew features:\n\n* A new key \"DeploySideloadCollectionID\" is now supported in flatpakref and\n  flatpakrepo files, to allow setting a collection ID at the time a remote is\n  added from one of those files, rather than when metadata is pulled from the\n  remote, and without affecting versions of Flatpak with the older pre-sideload\n  P2P implementation (#4826)\n* Allow sub-sandboxes to own MPRIS names on the session bus (#5023)\n* Commands that accept \"--user\" will now also take \"-u\" as an alias for that\n  (#5014)\n* The CLI now properly informs the user of which apps are (indirectly) using\n  end-of-life runtime extensions in end-of-life info messages (#4835)\n* The CLI now takes into account operations in the pending transaction when\n  printing end-of-life messages (#4835)\n* The uninstall command now asks for confirmation before removing in-use\n  runtimes or runtime extensions (#4835)\n* A \"--socket=gpg-agent\" option is now recognized by \"flatpak run\" and related\n  commands (#4958)\n\nBug fixes:\n\n* Fix a memory corruption issue caused by use of libcurl in an unsafe way\n  (#5046)\n* Update selinux policy to cover symbolic links in /var/lib/flatpak (#4992)\n* Fix a crash in case a .desktop file processed by the build-export command has\n  no Exec= key, and some related fixes for handling such .desktop files (#4817)\n* Preserve the X11 display number rather than redirecting it to :99 (#5034)\n\nOther changes:\n\n* Various improvements to the unit tests, CI infra, and documentation\n* Some changes were made to ensure translators can work on full sentences\n  rather than fragments in several places\n* Translation updates: de, ru, sv, tr, uk, zh_CN\n\nChanges in 1.13.3\n~~~~~~~~~~~~~~~~~\nReleased: 2022-06-16\n\nDependencies:\n\n * Support curl 7.29 or later as an additional, and the default, HTTP backend\n   alongwith libsoup 2.x (#4943)\n * Clarify that glib 2.46 or later is now required (#4944)\n\nNew features:\n\n * Implement support for rewriting dynamic launchers when an app is renamed\n   (#4703)\n * Add --include-sdk/debug options to install command to install SDK/debuginfo\n   along with a ref (#4777)\n * Improve --sideload-repo option to take create-usb dirs (#4843)\n * Add a new library API flatpak_transaction_get_operation_for_ref() (#4947)\n\nBug fixes:\n\n * Update the SELinux module to explicitly permit the system helper have read\n   access to /etc/passwd and systemd-userdbd, read and lock access to\n   /var/lib/flatpak, and watch files inside $libexecdir (#4852, #4855, #4892)\n * Fix the error messages and the exit code of the 'uninstall' command when\n   non-existent refs are specified (#4857)\n * Be more careful with errors when creating directories and deleting files,\n   and address some memory errors (#4930)\n * Fix support for --noninteractive in the 'uninstall' command (#4947)\n\nOther changes:\n\n * Cosmetic improvements to end-of-life messages and other aspects of the CLI\n   output (#4947)\n * Speed up the tests by not installing the polkit agent (#4942)\n * Disable fuzzy ref matching when ID has a period or a slash, or when the\n   standard input or output is not a TTY (#4829, #4848)\n * Update the icon-validator to print the format and size for consumption by\n   the dynamic launcher portal (#4803, #4808)\n * Remove a pointless test (#4856)\n * Improve various details of the GitHub workflows (#4870)\n * Prepare for the addition of a Meson build (#4842, #4871, #4888, #4889, #4890)\n * Only add the specified 'summary-arches' to the compat summary. This is\n   important since we're nearing the 10MB size limit for Flathub's legacy\n   summary files. (#4880)\n * Translation updates: id, pt, sv, tr, uk\n\nChanges in 1.13.2\n~~~~~~~~~~~~~~~~~\nReleased: 2022-03-14\n\nBug fixes:\n\n * Consistently pass relative subpaths to libostree, working around a bug\n   in libostree < 2021.6 when used with GLib >= 2.71 (#4805)\n * Document have-kernel-module-* as having been added in 1.13.1\n * Fix some memory leaks in GVariant data processing\n\nChanges in 1.13.1\n~~~~~~~~~~~~~~~~~\nReleased: 2022-03-01\n\nDependencies:\n\n * libappstream 0.12.0 or later is now required\n * appstream-glib is no longer required\n * In distributions that compile Flatpak to use a separate bubblewrap (bwrap)\n   executable, version 0.5.0 is now required\n\nNew features:\n\n * Create a directory for XDG_STATE_HOME and set the environment variable\n   (#4477)\n   - Apps requiring a state directory without a dependency on this updated\n     Flatpak version can get similar functionality by using:\n     --persist=.local/state --unset-env=XDG_STATE_HOME\n     which will use the same storage location\n * Set HOST_XDG_STATE_HOME environment variable (#4477)\n * Add have-kernel-module-foo family of conditionals for extensions, a\n   generalization of have-intel-gpu (which is now mostly equivalent to\n   have-kernel-module-i915) (#4647)\n * Add `flatpak document-unexport --doc-id=...` (#1897)\n * Export Appstream metadata for host system to use (#4350, #4599)\n * Add command-line completion for the Fish shell (#3109)\n * Add FlatpakTransaction:no-interaction API (#4699)\n * We now allow networked access to X11 and PulseAudio services\n   if that is configured, and the application has network access.\n   (#397, #3908, #4702)\n * `flatpak build-init` automatically sets the build directory to be\n   ignored by git (#4741)\n\nOther changes:\n\n * Updated bundled xdg-dbus-proxy to 0.1.3 (#4737)\n * Updated bundled bubblewrap to 0.6.1 (#4779)\n * The default branch in the Github repository is now named 'main'\n * Don't offer options in CLI tab completion unless the user typed a '-'\n   (#4753)\n * Disable fancy output (e.g. progress bars that get redrawn) when\n   G_MESSAGES_DEBUG is set in the environment (#4767)\n * Most commands now work if /var/lib/flatpak exists but /var/lib/flatpak/repo\n   does not, and will automatically populate the repo directory if\n   possible (#4111)\n * Disable session bus access for `flatpak-spawn --sandbox` as intended\n   (#4630)\n * Make `sudo flatpak --user ...` fail with an error message, since acting\n   on root's per-user installation is unlikely to be what was intended\n   (#4638)\n * Don't mention \"negative\" permissions like !host in /.flatpak-info (#4691)\n * Improve performance when finding related refs\n * Use SHA256 instead of SHA1 to avoid false-positives from static analysis\n   (in fact the use of SHA1 was not security-sensitive here) (#4716)\n * Create sandbox's XDG_RUNTIME_DIR with 0700 permissions (#3397)\n * Always create /.flatpak-info with 0600 permissions\n * Absolute paths in WAYLAND_DISPLAY now work (#4752)\n * Improve reliability of detecting the current GTK theme (#4754)\n * Fix some error code paths when deploying malformed apps\n * Improve some error messages\n * Use URN for fontconfig DTD, consistent with fontconfig itself (#4617)\n * Use `type -P` or `command -v` in preference to which(1) (#4696)\n * Improve measurement of test coverage (#4681)\n * Translation updates: de, fr, hi, hr, id, oc, pl, pt_BR, sv, uk, zh_CN\n\nChanges in 1.12.6\n~~~~~~~~~~~~~~~~~\nReleased: 2022-02-21\n\n * Fix a bug that sometimes caused repo corruption in case downloads are\n   interrupted or canceled, necessitating a \"flatpak repair\" to recover\n   (#3479, #4258)\n * More reliably detect the GTK theme (#4754)\n * Fix history command unit test in some edge cases (#4764)\n * Improve NEWS for 1.12.5\n * Translation update: pt_BR\n\nChanges in 1.12.5\n~~~~~~~~~~~~~~~~~\nReleased: 2022-02-11\n\n * Fixed a case where temporary data was sometimes left in\n   /var/lib/flatpak/appstream, and we now detect such leftover data and\n   remove it. (#4735)\n * Fix regressions in `flatpak history` since 1.9.1 (#4121, #4332)\n   - Don't display the appstream branch used internally\n   - Don't display temporary repositories used internally\n   - Warn instead of failing if other non-app, non-runtime refs are found\n   - Don't set up an unnecessary polkit agent for `flatpak history`\n   - Add test coverage\n * Don't propagate GStreamer-related environment variables into\n   sandbox (#4728)\n * Fix a typo in an error message\n * Fix incorrect year in NEWS for 1.12.4 release\n * Translation update: pl\n\nChanges in 1.12.4\n~~~~~~~~~~~~~~~~~\nReleased: 2022-01-18\n\nThis is a regression fix update, reverting non-backwards-compatible\nbehaviour changes in the solution previously chosen for CVE-2022-21682.\n\nFlatpak 1.12.3 and 1.10.6 changed the behaviour of `--nofilesystem=host`\nand `--nofilesystem=home` in a way that was not backwards-compatible in\nall cases. For example, some Flatpak users previously used a global\n`flatpak override --nofilesystem=home` or\n`flatpak override --nofilesystem=host`, but expected that individual apps\nwould still be able to have finer-grained filesystem access granted by the\napp manifest, such as Zoom's `--filesystem=~/Documents/Zoom:create`. With\nthe changes in 1.12.3, this no longer had the intended result, because\n`--nofilesystem=home` was special-cased to disallow inheriting the\nfiner-grained `--filesystem`.\n\nFlatpak 1.12.4 and 1.10.7 return to the previous behaviour of\n`--nofilesystem=host` and `--nofilesystem=home`. Instead, CVE-2022-21682\nwill be resolved by a new 1.2.2 release of flatpak-builder, which will\nuse a new option `--nofilesystem=host:reset` introduced in Flatpak 1.12.4\nand 1.10.7. In addition to behaving like `--nofilesystem=host`, the new\noption prevents filesystem permissions from being inherited from the\napp manifest.\n\nOther changes:\n\n * Clarify documentation of `--nofilesystem`\n * Improve unit test coverage around `--filesystem` and `--nofilesystem`\n * Restore compatibility with older appstream-glib versions, fixing a\n   regression in 1.12.3\n\nChanges in 1.12.3\n~~~~~~~~~~~~~~~~~\nReleased: 2022-01-12\n\nThis is a security update that fixes two issues that were found in flatpak:\n\nhttps://github.com/flatpak/flatpak/security/advisories/GHSA-qpjc-vq3c-572j\n(also known as CVE-2021-43860)\n\nThis issue is about the possibility for a malicious repository to send\ninvalid application metadata in a way that hides some of the app\npermissions displayed during installation.\n\nhttps://github.com/flatpak/flatpak/security/advisories/GHSA-8ch7-5j3h-g4fx\n(also known as CVE-2022-21682)\n\nThis issue is a problem with how flatpak-builder uses flatpak, that\ncan cause `flatpak-builder --mirror-screenshots-url` commands to be\nallowed to create directories outside of the build directory.\n\nThe fix for this is done in flatpak by making the --nofilesystem=host\nand --nofilesystem=home more powerful. They previously only removed\naccess to the particular location, i.e. `--nofilesystem=host` negated\n`--filesystem=host`, but not `--filesytem=/some/dir`. This is a minor\nchange in behavior, as it may change the behavior of an override\nwith these specific options, however it is likely that the new\nbehavior was the expected one.\n\nOther changes:\n\n * Extra-data downloading now properly handles compressed content-encodings\n   which fixes checksum verification (see #4415)\n   Note: In some corner case server setups this may require the extra-data\n   checksum to be changed\n * Avoid unnecessary policy-kit dialog due to auto-pinning when installing runtimes\n * Better handling of updates of extensions that exist in multiple repositories\n * Fixed (initial) installation apps with renamed ids\n * Support more pulseaudio configuration, including the one used in WSL2\n * Fixed regression in updates from no-enumerate remotes\n * We now verify checksums of summary caches, to better handle local file\n   corruption\n * Improved cli output for non-terminal targets\n * Flatpak run --session-bus now works\n * Fix build with PyParsing >= 3.0.4\n * Fixed \"Since\" annotations on FlatpakTransaction signals\n * bash auto completion now doesn't complete on command name aliases\n * Minor improvements to the search command\n * Minor improvements to the list command\n * Minor improvements to the repair command\n * Add more tests\n * Updated translations and docs\n\nChanges in 1.12.2\n~~~~~~~~~~~~~~~~~\nReleased: 2021-10-12\n\n * Install translations referenced by LANG, LANGUAGE or LC_ALL\n * Fix error handling for the syscalls that are blocked when not using --devel\n * Improve diagnostic messages when seccomp rules cannot be applied\n * Update Polish translation\n\nChanges in 1.12.1\n~~~~~~~~~~~~~~~~~\nReleased: 2021-10-08\n\nThe security fix in the 1.12.0 release failed when used with some\nolder versions of libseccomp (that don't know about the new syscalls).\n\nMore specifically, installing modules that use extra-data would fail, and so\nwould running applications with the --allow=multiarch feature, such as Steam.\nThis release fixes those regressions.\n\nChanges in 1.12.0\n~~~~~~~~~~~~~~~~~\nReleased: 2021-10-08\n\nThis is the first stable release in the 1.12.x series. The major changes\nin this series is the support for better control of sub-sandboxes, as\nused by the Steam Flatpak app to run Windows games under Proton.\n\nIn addition, this release fixes a security vulnerability in the portal\nsupport. Some recently added syscalls were not blocked by the seccomp rules\nwhich allowed the application to create sub-sandboxes which can confuse\nthe sandboxing verification mechanisms of the portal. This has been\nfixed by extending the seccomp rules. (CVE-2021-41133)\nFor details, see:\n  https://github.com/flatpak/flatpak/security/advisories/GHSA-67h7-w3jq-vh4q\n\nOther changes in this version:\n * Some test fixes\n * Update translations\n * Support for specifying the flatpak binary to use during exports\n * Install translations for all languages in the locale, not just the ones in\n   LC_MESSAGES.\n * Fix progress reporting in flatpak fsck\n * Handle cases where /var/tmp is a symlink\n * Expose /etc/gai.conf to the sandbox\n * Fix the parental control checks for root\n * Handle missing /etc/ld.so.cache (musl)\n\nChanges in 1.11.3\n~~~~~~~~~~~~~~~~~\nReleased: 2021-08-25\n\nDependencies:\n\n* For Linux distributions that compile Flatpak to use a separate\n    bubblewrap (bwrap) executable, updating to version 0.5.0 is recommended,\n    but not required. The minimal version is still 0.4.0.\n\nBug fixes:\n\n* Don't inherit an unusual $XDG_RUNTIME_DIR setting into the sandbox, fixing\n  a regression introduced when CVE-2021-21261 was fixed in 1.8.5 and 1.10.0\n* Update the included copy of bubblewrap (flatpak-bwrap) to 0.5.0\n    - Better diagnostics when a --bind or other bind-mount fails\n    - Create non-directories with safer permissions\n    - Allow mounting an non-directory over an existing non-directory\n    - Silence kernel messages for our bind-mounts\n    - Improve ability to bind-mount directories on case-insensitive filesystems\n* Don't ask user which remote to download from if there is only one option\n* Improve robustness of autogen.sh\n\nInternal changes:\n\n* Improve test coverage\n* Spelling fixes\n\nTranslation updates: Brazilian Portuguese, Russian, Spanish, Ukrainian\n\nChanges in 1.11.2\n~~~~~~~~~~~~~~~~~\nReleased: 2021-06-17\n\nBug fixes:\n\n* Fix logic error when migrating AppStream XML\n* Improve error-checking\n* Fix various memory and file descriptor leaks, in particular with\n  flatpak-spawn --env=...\n* Fix fd confusion in flatpak-spawn --env=... --forward-fd=..., which\n  caused \"Steam Linux Runtime\" containers to fail to start\n* Avoid a crash when looking up summary for a ref without an arch\n* Improve handling of refs belonging to more than one architecture,\n  e.g. for cross-compilation\n* Don't abort uninstall if deploy metadata is missing\n* Don't fail transaction if searching for dependencies fails in one remote\n* Fix test failure when running tests as root\n* Improve error message for 'sudo flatpak run'\n\nInternal changes:\n\n* Improve printf format string validation\n* Improve test coverage\n* Reduce risk of accidentally hard-coding x86 in the tests\n\nTranslation updates: Danish, Indonesian, Russian\n\nChanges in 1.11.1\n~~~~~~~~~~~~~~~~~\nReleased: 2021-04-26\n\nThis is the first unstable release in the series that will lead to 1.12.\n\nNew features:\n\n* All instances of the same app-ID share their /tmp directory\n* All instances of the same app-ID share their $XDG_RUNTIME_DIR\n* Instances of the same app-ID can optionally share their /dev/shm directory\n  (enabled by a new --allow flag, --allow=per-app-dev-shm)\n* Allow a subsandbox to have a different /usr and/or /app.\n  Steam will use this to launch games with its own container runtime\n  as /usr (the \"Steam Linux Runtime\" mechanism).\n* enter: Improve support for TUI programs like gdb\n* build-update-repo: Add a higher-performance reimplementation of\n  `ostree prune` specialized for archive-mode repositories\n\nBug fixes:\n\n* Fix deploys of local remotes in system-helper\n* Fix test failures on non-x86_64 systems\n* Fix two intermittent test failures\n* Make polkit queries non-interactive when operating in non-interactive mode\n* Use a local main-context when using libsoup in a thread\n* create-usb: Skip copying extra-data flatpaks\n* OCI: Switch to pax-format tar archives\n* history: Handle transaction log entries with empty REF field\n* portal: Fix flatpak-spawn --clear-env on OSs where flatpak is not on\n  the fallback PATH, such as NixOS\n* Fix various issues detected by scan-build\n\nInternal changes:\n\n* Use GNU bison to build parse-datetime.y\n* Add information about security support and security vulnerability\n  reporting (see `SECURITY.md`)\n* Move all git submodules into subprojects/ directory\n* Several sockets are now created in /run/flatpak in the sandbox, with\n  symbolic links in $XDG_RUNTIME_DIR\n\nChanges in 1.10.2\n~~~~~~~~~~~~~~~~~\nReleased: 2021-03-10\n\nThis is a security update which fixes a potential attack where\na flatpak application could use custom formated .desktop files to\ngain access to files on the host system.\n\nOther changes:\n\n* Fix memory leaks\n* Some test fixes\n* Documentation updates\n* G_BEGIN/END_DECLS added to library headders for c++ use\n* Fix for X11 cookies on OpenSUSE\n* Spawn portal better handles non-utf8 filenames\n\nChanges in 1.10.1\n~~~~~~~~~~~~~~~~~\nReleased: 2021-01-21\n\n * Fix flatpak build on systems with setuid bwrap\n * Fix some compiler warnings\n * Add --enable-asan configure option\n * Fix crash on updating apps with no deploy data\n * Update translations\n\nChanges in 1.10.0\n~~~~~~~~~~~~~~~~~\nReleased: 2021-01-14\n\nThis is the first stable release after the 1.9.x unstable series.\nThe major new feature in this series compared to 1.8 is the support\nfor the new repo format which should make updates faster and download\nless data.\n\nThis release also contains the security fixes from 1.8.5, so everyone\non the 1.9.x series should update immediately. (CVE-2021-21261)\n\nOther changes since 1.9.3:\n\n * The systemd generator snippets now call flatpak --print-updated-env\n   in place of a bunch of shell for better login performance.\n * The .profile snippets now disable GVfs when calling flatpak to\n   avoid spawning a gvfs daemon when logging in via ssh.\n * Build fixes for GCC 11.\n * Flatpak now finds the pulseaudio sockets better in uncommon\n   configurations.\n * Sandboxes with network access it now also has access to the\n   systemd-resolved socket to do dns lookups.\n * Flatpak supports unsetting env vars in the sandbox using --unset-env,\n   and `--env=FOO=` now sets FOO to the empty string instead of\n   unsetting it.\n * Similarly the spawn portal has an option to unset an env var.\n * The spawn portal now has an option to share the pid namespace\n   with the sub-sandbox.\n\nChanges in 1.9.3\n~~~~~~~~~~~~~~~~\nReleased: 2020-12-22\n\nI expect this to be the final 1.9.x release, and we can expect 1.10.0\nearly next year, containing basically whats in this release in terms\nof features.\n\nA minor change in the new indexed summary format in this release. The\ngpg signature of the summary index is now stored in a filename indexed\nby the checksum of the index rather than a static filename. This fixes\nan update race between clients accessing the two files during and update.\nIt also helps in keeping mirrors and cached coherent. The old filename\nis still created/used for backwards compat with 1.9.1, but may go\naway in the future.\n\nOther changes:\n\n * --filesystem=host now exposed /var/usrlocal (as seen on ostree)\n * Better error messages in flatpak portal.\n * Rebases during update now install the new app before uninstalling\n   the old, which means failure during the first doesn't leave the app\n   uninstalled.\n * flatpak_installation_list_installed_refs_for_update() now handles\n   some case better when apps in the user installation depends on\n   runtimes in the system installation.\n * New version of the deploy files which guarantees the existance of\n   a bit more data. This is useful for eol detection of apps that were\n   installed with previous flatpak versions.\n * Some corner cases when installing an app with extra-data into a nonstandard\n   installation were fixed.\n * Fixed crashed when killing and entering running instance that have\n   was running a runtime, not an app.\n * The root user can now bypass parental controls.\n * Some fixes to library annotations.\n * Updated translations\n\nChanges in 1.9.2\n~~~~~~~~~~~~~~~~\nReleased: 2020-11-20\n\n * Some build fixes on non-x86-64 arches\n * Fix permission issue in endless installer\n * Fixed a bug where flatpak was accidentally clearing the summary cache\n   during updates in the user installation.\n * Fix handling of the multiarch permission.,\n * Add back the commit timestamp to the summary file.\n\nChanges in 1.9.1\n~~~~~~~~~~~~~~~~\nReleased: 2020-11-19\n\nThis is the first unstable release in the series that will lead to\n1.10. The main change in this version is a new format for the summary\nfile used when accessing an OSTree repository on the network. For this\nreason we now require OSTree version 2020.8.\n\nThe new format should make getting the initial metadata required for\nmost flatpak operations much faster, and use less network\nbandwidth. This will allow repositories to scale to more apps and more\narchitectures without affecting clients. The old format is still\ngenerated for compatibility with older clients.\n\nThe new format also allows repositories to publish named subsets, and\nfor clients to declare that they only want to see that subset. The\ngoal here is to allow for example flathub to mark all FOSS apps, and\nmake it possible for users to use a flathub-foss remote without\nflathub having to maintain two duplicated repositories. This is\naccessible by passing --subset=SUBSET to the build-commit-from and\nbuild-export commands.\n\nThe new repo option `flatpak.summary-arches` controls which architectures\nare put in the old format summary. This can be used to avoid newly added\narchitectures making old clients slower, at the cost of requiring a newer\nflatpak client version for the new architecture.\n\nOther major changes\n * There is a new `flatpak pin` command that lets you pin runtimes\n   so that they are not considered unused. Also, we now by default pin\n   runtimes that are installed explicitly (i.e. not as a dependency of an\n   app).\n * During a regular update or uninstall of an app, if the operation\n   makes a previously used runtime unused, and the runtime is marked\n   as end-of-lifed, then the runtime is automatically uninstalled.\n * During `flatpak update` (i.e. with no specific app given) flatpak\n   now automatically adds uninstall operations for end-of-life runtimes\n   that are unused.\n * The end-of-life warnings in the flatpak CLI are now better, showing\n   more useful details (like version and what apps are using the runtime)\n   and less unuseful details.\n * Some changes was made in which dconf paths were considered \"similar\"\n   to the app id, allowing for example `org.gnome.SoundJuicer` to\n   migrate from `/org/gnome/sound-juicer`.\n * Flatpak run now implements the new standard for os-release in containers\n   (https://www.freedesktop.org/software/systemd/man/os-release.html).\n * There is now a tcsh profile snippet\n * The origin remote for an app is now prioritized over other remotes with\n   the same priority when looking for dependencies.\n * We now allow extra-data apply_extra processes to run multiarch code.\n * A new internal representation for ostree ref strings was added which\n   is more efficient. This should not affect the behaviour of flatpak\n   but the large amounts of changes to use this may have accidentally\n   introduced regressions.\n * Some fixes to the in-memory summary cache make it more efficient.\n * --filesystem=/ is now explicitly forbidden as it doesn't work (and never\n   did).\n * Flatpak install/update now only prints `(partial)` for an update that\n   actually is partial (not just for all locales).\n * Flatpak remote-ls on a file: uri (for example a sideloaded repo) now\n   correctly lists the refs in the repo.\n * New library APIS: flatpak_installation_list_pinned_refs,\n   flatpak_transaction_set_disable_auto_pin,\n   flatpak_transaction_set_include_unused_uninstall_ops,\n   flatpak_transaction_operation_get_subpaths,\n   flatpak_transaction_operation_get_requires_authentication.\n * flatpak_installation_list_installed_refs_for_update() now returns\n   refs that have a end-of-life rebase that it could be updated to.\n * There is a new `ready-pre-auth` signal in FlatpakTransaction allowing\n   clients new ways to handling authentication.\n * Fix bug where extension sources were sometimes auto-installed\n\nChanges in 1.8.3\n~~~~~~~~~~~~~~~~\nReleased: 2020-11-17\n\n  * Fixed progress reporting for OCI and extra-data\n  * The in-memory summary cache is more efficient\n  * Fixed authentication getting stuck in a loop in some cases\n  * Fixed authentication error reporting\n  * We now extract OCI info for runtimes as well as apps\n  * Fixed crash if anonymous authentication fails and -y is specified\n  * flatpak info now only looks at the specified installation\n    if one is specified\n  * Better error reporting for server HTTP errors during download\n  * Uninstall now removes applications before the runtime it depends on\n  * Fixed test-suite to pass with the latest OSTree version\n  * Fixed dbus environment variables in flatpak enter\n  * Avoid updating metadata from the remote when uninstalling\n  * Fixed error message handling in various places\n  * FlatpakTransaction now verifies all passed in refs to avoid\n    potential issues with invalid names\n  * Updated translations\n\nChanges in 1.8.2\n================\n\n * Added validation of collection id settins for remotes\n * Fix seccomp filters on s390\n * Robustness fixes to the spawn portal\n * Fix support for masking update in the system installation\n * Better support for distros with uncommon models of merged /usr\n * Cache responses from localed/AccoutService\n * Fix hangs in cases where xdg-dbus-proxy fails to start\n * Fix double-free in cups socket detection\n * OCI authenticator now doesn't ask for auth in case of http errors\n\nChanges in 1.8.1\n================\n\n * Avoid calling authenticator in update if ref didn't change\n * Don't fail transaction if ref is already installed (after transaction start)\n * Fix flatpak run handling of userns in the --device=all case\n * Fix handling of extensions from different remotes\n * Fix flatpak run --no-session-bus\n * Updated translations\n\nChanges in 1.8.0\n================\n\nNew stable release series 1.8.\n\nChanges:\n * FlatpakTransaction has a new signal \"install-authenticator\" which clients can handle to\n   install authenticators needed for the transaction. This is done in the CLI commands.\n * We now always expose the host timezone data, allowing us the expose the host /etc/localtime\n   in a way that works better, fixing several apps that had timezone issues.\n * Fix flatpak enter which didn't work in some cases.\n * We now ship a systemd unit (not installed by default) to automatically detect plugged in\n   usb sticks with sideload repos.\n * By default we no longer install the gdm env.d file, as the systemd generators work better\n * create-usb now exports partial commits by default\n * Fix handling of docker media types in oci remotes\n * Fix subjects in remote-info --log output\n\nChanges in 1.7.3\n================\n\n * Allow direct ALSA device access if app has pulseaudio access.\n * Flatpak now ships a sysusers.d file for allowing systemd to create the required users.\n * Fix issue in remote-delete where it failed to delete system remotes if it had to uninstall\n   something first.\n * New library calls flatpak_transaction_operation_get_related_to_ops(), flatpak_transaction_operation_get_is_skipped() and\n   flatpak_transaction_set_no_interaction().\n * New options --[no-]follow-redirect in remote-add/modify\n * New spawn portal APIs to get real pid of launched app.\n * By default, all OCI remotes now use the flatpak-oci-authenticator.\n * Support flatpak remote-info and flatpak update --commit= to specific versions for OCI remotes.\n * Initial work in progress on using deltas for OCI remotes.\n * Fix race in the generation of ld.so.cache when starting copies of the same app at the same time.\n * Minor fix in what locales are installed on update.\n * Flatpak uninstall now doesn't fail if one ref (of many) was not installed.\n * Flatpak systemd transient units now have an app-prefix to match new XDG spec for\n   cgroup names.\n * In some cases we previously downloaded the summary twice.\n * flatpak upgrade is now an alias for flatpak update.\n * Fix to selinux module to work without unconfined module.\n * Respect user XDG basedirs when finding users fonts and icons.\n * Fix issue where thread were sometimes initialized causing flatpak enter to fail.\n * Better error reporting when authentication goes wrong.\n\nChanges in 1.7.2\n================\n\nThis fixes some regressions in progress reporting in 1.7.1, where it would report > 100%.\n\nOther changes:\n * Completion support for fish shell\n * Properly handle migration of remotes with collection ids\n * The summary now has some extra-data download size info which can make downloads slightly more efficient\n\nChanges in 1.7.1\n================\n\nThis is the first release in the 1.7.x unstable release series.\n\nA major change is that the support for the ostree peer-to-peer installation has been\nsimplified. Flatpak no longer supports installing from local network peers, and sideloading\nfrom local usb stick is no longer automatic. To enable sideloading you have to configure\na sideload repository by creating a symlink to it from /var/lib/flatpak/sideload-repos or\n/run/flatpak/sideload-repos. Due to this the flatpak code has been simplified internally\nand the p2p support is more efficient.\n\nOther major changes\n * If an app has filesystem access, the host /lib is accessible as /run/host/lib, etc.\n * New filesystem permission \"host-etc\" and \"host-os\" give access to system /usr and /etc.\n * Flatpak now uses variant-schema-compiler to generate more efficient code for\n   parsing GVariant files from ostreee.\n * libsystemd use is now optional in configure.\n * Journal sockets are mounted readonly\n * document-export now supports exporting directories (requires new portal version)\n * DConf migration now allows version numbers in object paths\n\nChanges in 1.6.3\n================\n\nThe main change in this version is a fix for a regression in the progress calculation\nfor applications using extra-data. Additionally the bundled version of bubblewrap\nis updated to 0.4.1 which fixes a security issue in some cases. See\n  https://github.com/containers/bubblewrap/security/advisories/GHSA-j2qp-rvxj-43vj\nfor details.\n\nOther changes:\n * Updated translations\n * Don't break if users primary gid is not in the nsswitch database\n * Fix crash in flatpak repair if no remotes are configured\n * Some updates to the oci authenticator\n * Retry downloads of extra data\n\nChanges in 1.6.2\n================\n\nDue to a combination of some behaviour in flatpak and recent versions of ostree we at some\npoint lost the use of deltas for the initial install case, instead always falling back\nto a full ostree operation which is a lot less efficient for pulls with many small files\nlike a runtime. This caused some very slow installs from e.g. flathub, so I recommend\neveryone update to this version to get better install performance.\n\nOther changes are:\n * We now correctly handle TMPDIR env var overrides when bwrap is setuid\n * Disallow running \"flatpak run\" under sudo (as it doesn't work and causes issues)\n * Fix build with older versions of glib\n * Minor documentation updates\n * Updated translations\n\nChanges in 1.6.1\n================\n\nThis is a (mild) security update. Flatpak 1.6.0 added the ability for an application to request it to be\nupdated, as long as the new version doesn't require new permissions. Unfortunately in some special cases,\nif an app had acces to the home directory, but not the rest of the filesystem it would still allow a\nself-update where the new version could access some files outside the home directory..\n\nThis is fixed in this version, and all users of 1.6.0 are recommended to update.\n\nOther changes are:\n\n * New permission --device=shm giving access to host /dev/shm, as needed for jack.\n * Generated correct download size in build-commit-from\n * sub-sandbox now allows the child to share the gpu of the caller has full device access\n * Fix crash with disabled remotes\n * Fix builds with older versions of glib\n * Update translations\n\nChanges in 1.6.0\n================\n\nThis is the first stable release in the 1.6 series, main changes\nsince 1.4 is the support for protected content and improvements\nin the self-sandboxing support.\n\nThere is one change in the support for OCI remotes, we now\nonly support the use of labels, not annotations, as labels\nwork with more registries. This means pre-existing OCI flatpak\nregistries (like fedora) may need some changes.\n\nChanges since 1.5.2:\n * New permissions --socket=cups for direct cups access\n * Fix some leaks\n * Fix reporting of progress with latest version of ostree\n * New no-interaction flag for authenticators\n * Support for auto-installing authenticators from a flatpak remote\n * Warn less about unset XDG_DATA_DIRS\n * Don't poll for updates in the portal when on a metered connection\n\nChanges in 1.5.2\n================\n\nThis version has further changes to the protocol and API for handing\nauthentication, in order to make it more flexible and futureproof. The\nsample authenticator has been updated to the new APIs. Flatpak now\nships with a OCI authenticator that can be used to access private OCI\nregistries.\n\nFlatpakTransaction now also has a callback for simple user/password\nauthentication for an authenticator (the basic-auth-start signal)\nmodeled on HTTP basic authentication. This is handled in the flatpak\nCLI by interactive prompts on the terminal. This is needed by the OCI\nauthenticator, but can also be used by other authenticators that have\nsimple authentication requirements.\n\nThere were also some fixes to the new self-sandboxing support of the\nflatpak spawn portal, allowing webkit to use it.\n\nOther changes:\n * Show background status in flatpak ps\n * Improved docs and help output\n * Fix support for fd forwarding and the allow_a11y flag in the sandboxing portal\n * Some improvements to the new permission-set command\n * New remote option that allows settting the default token type (mostly for debugging)\n\n\n\nChanges in 1.5.1\n================\n\nThe major new feature of this is the support for protected applications and the system\naround authenticting downloads to it. This is not considered stable yet, but this release\nhas the initial work to make it possible for developers to play around with this. I\nwill send out a separate mail about this later.\n\nOther changes:\n * Flatpak now bundles bubblewrap 0.4.0, and requires 0.4.0 to use the system bubblewrap.\n * Optional support for parental controls using libmalcontent.\n * Transaction now installs extensions before apps to ensure we have a working app immediately after install.\n * Changes in temporary file use makes flatpak run work better in low disk space situations.\n * flatpak enter now works without sudo, and works better in general.\n * New features for the flatpak portal:\n   * Support starting a sub-sandbox with the child processes visible in the original sandbox.\n   * Support adding some kinds of permissions to sub-sandboxes\n * New commands flatpak permission-set and permission-remove\n * flatpak install CLI now always shows what kind of operations everything is.\n * libflatpak now returns apps as updatable if doing so would auto-download missing extensions or runtimes.\n * new API: flatpak_transaction_get_no_(deploy|pull).\n * We can now store locale info in the extra-languages key (in addition to the country code).\n * remote-ls and list --app-runtime now only shows apps, no runtimes.\n * Stop using mirror refs and delete any useless mirror refs you might have in your repo.\n * Fix busy-loop regression in revokefs-fuse in 1.5.0\n\nChanges in 1.5.0\n================\n\n * New options flatpak install --or-update operation.\n * New command flatpak mask allows pinning version and avoiding auto-downloads.\n * Support self-updates and update monitoring in the flatpak portal.\n * Fix updates of exported services with dbus-broken.\n * Don't show arch columns in terminal outout if all are the same.\n * Fix some cases where origin remotes were not properly removed.\n * flatpak-session-helper now links to more libraries.\n * OCI: Support images tagged with labels as well as annotations.\n * OCI: Alway generate a history for images.\n * OCI: Support docker mimetypes in addition to OCI mimetypes.\n * Uninstall now always work, even if the remote it came from was force removed.\n * New config key default-languages that allows additions to the system list\n  instead of overriding it.\n * Various minor tweak to CLI behaviour and output.\n\nChanges in 1.4.3\n================\n * Fix crash in revokefs.\n * Handle 'versions' extension key (in addition to 'version') when\n   checking for local extensions, which was causing us to uninstall\n   some actually used extensions with uninstall --unused.\n * The 'required-flatpak' metadata key now supports listing multiple\n   versions to support backported features.\n * Fix crash with older versions of polkit.\n * Fix installation of bundles.\n * Fix crash on deploy error.\n * Support building bundles of apps installed from a remote.\n * OCI: Fix handling of locally cached icons.\n * Fix crash when listing unconfigured remotes.\n * Ignore differences in trailing slashes for repo uris.\n\nChanges in 1.4.2\n================\n\n * Support extra_data in extensions.\n * Handle double slashes (\"//\")in XDG_DATA_DIRS.\n * Fix detection of local related refs.\n\nChanges in 1.4.1\n================\n\n*WARNING* *WARNING* *WARNING*\n\nThere was an accidental ABI break in libflatpak in 1.4.0 compared to\nthe 1.2.x ABI which caused crashes in apps like gnome-software.\n\nThis has been fixed in this release so it is now ABI compatible with\n1.2.x, but *NOT* compatible with 1.4.0. It is recommended that all\ndistributions that shipped 1.4.0 update to 1.4.1 and rebuild all\ndependencies of libflatpak.\n\n * Make ABI compatible with 1.2.x\n * Update translations\n * Fix some potential crashes\n * Fix some corner case where it was impossible to remove a remote\n * Restore support for file: uris in the RuntimeRepo key in flatpakref files\n\nChanges in 1.4.0\n================\n\nThis is the new stable series, ending the 1.3.x series. The major changes\nsince the 1.2.x is the improved I/O use for system-installed applications,\nand the new format for pre-configured remotes.\n\n * Recalculate download-size when moving between repos in\n   build-commit-from.\n * New library error FLATPAK_ERROR_REF_NOT_FOUND returned instead of\n   G_IO_ERROR_NOT_FOUND.\n * Fix installed tests when running on a tty.\n * Fix a double-set of a GError.\n * Grant more permissions on the /run/host/monitor directory to\n   work with e.g. toolbox on the host.\n\nChanges in 1.3.4\n================\n\nThis version changes how default remotes are configured. We still\nuse files in /etc/flatpak/remotes.d, however instead of the old\n*.conf files we now use regular flatpakrepo files, and the first\ntime you use flatpak these are automatically imported.\n\nThe advantage of this new model is that the configuration is imported\nonce, but then becomes writable and removable, just like a manually\nadded remote. In the previous model the remote was always there and it\nwas impossible to change or remove.\n\nHowever, this means that anyone currently shipping a .conf file with\na distro needs to change this to a .flatpakrepo file.\n\n * Support for flatpakrepo files in /etc/flatpak/remotes.d\n * Support for client side filtering of a remote. This allows you\n   to limit what apps are seen from a remote, using either a whitelist\n   or a blacklist model.\n * Add library API to easily add remotes from flatpakref files.\n * Fix the dconf support.\n * Fix app updates in system-wide OCI remotes.\n * Fix CLI completion if G_MESSAGES_DEBUG is set\n * Add a docker seccomp profile for running flatpak inside a container.\n * Look for the new default dbus session socket at $XDG_RUNTIME_DIR/bus\n * Improve ability to pull from multiple p2p sources (needs latest ostree).\n\nChanges in 1.3.3\n================\n\n * Fixed a crash in the system helper that made installation via\n   the helper sometimes not work.\n * Fix build with older versions of glib\n * The list and remote-ls output is now less wide, not showing the\n   appdata summary by default and only showing the archtecture and\n   origin if necessary (i.e. not if its the same for all rows).\n * flatpak remote-ls now filters end-of-lifed apps by default.\n * flatpak permission-reset now supports --all\n * Flatpak now works will all set values of umask.\n * The flatpak profile.d snippet now works if flatpak is not installed\n   (in case it gets left over after deletion).\n * Fixed flatpak install --noninteractive still asking questions in some cases.\n * flatpak now returns a failure exit status if you abort the operation early.\n * flatpak remote-ls and remote-info now supports --cached to prefer\n   using locally cached data.\n * libflatpak grew a FLATPAK_QUERY_FLAGS_ONLY_CACHED that allows you to\n   get at locally cached data about remotes without doing network i/o.\n * Documentation updates\n\nChanges in 1.3.2\n================\n\nThis release contains a major change in how flatpak does system-wide\ninstallation as a user. We used to pull into a temporary user-owned\ndirectory and then ask the flatpak system-helper to import from this\ndirectory. Unfortunately, since we can't trust the user directory\nit had to copy these files as they were being imported, which caused\nunnecessary i/o, as well as temporarily using more diskspace.\n\nThe new setup uses a new custom fuse filesystem which the user writes\nto, and then when this is done we can safely revoke any access to this\nfrom the user, meaning the files can be directly imported into the\nsystem repository without needing to make a copy.\n\nHowever, this makes packaging flatpak a bit more complex, as we now\nrequire flatpak to have a user. By default flatpak will look for a user\ncalled \"flatpak\", and for the new feature to work you need to create\nit in your package. If you want to use a different name you can specify\nthat in configure as --with-system-helper-user=USERNAME.\n\nAdditionally, the new code passed a unix socket over the system bus, which\nis prohibited by the default selinux policy. To work around this flatpak\nnow ships with a custom selinux module (enable with --enable-selinux-module).\nFor the new feature to work you need to install this module and ensure\nthe flatpak-system-helper binary gets the proper selinux context.\n\nOther changes:\n\n * We now support specifying a rebasing version of end-of-life, where\n   the clients will be asked if they want to use the new version. At\n   runtime any old per-user application data will be migrated to the\n   new name. Note: This works for the CLI app, but needs some changes\n   for installers to take advantage of the automatic rebasing.\n * New permission --socket=pcsc for access to smart cards.\n * We now store the description, comment, icon and homepage fields from\n   the flatpakrepo files in the remote confiuration and have new library\n   APIs to read these back.\n * The fields above are now also settable in a repo and changes to these\n   can propagate to clients.\n * run now tries the determine what branch to use when you run a runtime.\n * Print maximum icon size when icon-validator fails.\n * flatpak override can now disallow access to a dbus name.\n * flatpak list now has a new runtime column\n\nChanges in 1.3.1\n================\n\nThis release fixes CVE-2019-10063.\n\nIt has been discovered that the previous fix for CVE-2017-5226, which uses\nseccomp to prevent sandboxed apps from using the (dangerous) TIOCSTI ioctl\nwas only incomplete on 64bit arches. This is now fixed.\n\n * seccomp: Only compare the low 32bit of the TIOCSTI ioctl args.\n * Fix the required runtime prompt during installation.\n * When installing, only check dependencies from the same installation.\n * flatpak list --arch now works correctly again.\n * Create origin symlinks in appstream branch for libappstream compat.\n\nChanges in 1.3.0\n================\n\nThis is the start of a new unstable series, targeting stable release\nas 1.4.0.\n\nMajor changes:\n\n * Support systems with multiple nvidia devices\n * Checks are update output are green again\n * Fix support for systems like gentoo where /var/run is a symlink.\n * Initial support for sandboxed dconf support.\n * build-update-repo: New options --no-update-[summary,appstream] and\n   --static-delta-ignore-ref=PATTERN.\n * Regenerating the appstream branch is now much faster for large\n   repositories.\n * We no longer limit the size of svgs in the icon validator.\n\nChanges in 1.2.3\n================\n\nThis release fixes CVE-2019-8308.\n\nThe CVE-2019-5736 runc vulnerability is about using /proc/self/exe\nto modify the host side binary from the sandbox. This mostly does not\naffect flatpak since the flatpak sandbox is not run with root permissions.\nHowever, there is one case (running the apply_extra script for system\ninstalls) where this happens, so this release contains a fix for that.\n\n * Don't expose /proc in apply_extra script sandbox.\n\nChanges in 1.2.2\n================\n\n * Reverted green checkbox as they caused table alignment issues\n * Fix a division by zero if the terminal reports a zero terminal\n   width (which happens in the flathub build environment).\n\nChanges in 1.2.1\n================\n\n * Ensure flatpak builds with older versions of glib and appstream-glib.\n * build-commit-from: Fix the new --extra-id option.\n * build-export: Allow disabling the sandboxing of the icon validator and\n   do so during the tests.\n * profile: Don't break if debug logging is enabled.\n * Better handling of the appdata release attribute.\n * Don't install polkit agent when not needed, avoiding some unnecessary\n   log lines in some cases.\n * Fix the output of the sandboxed icon validator not being visible.\n * builld-init: Allow specifying a full ref for the sdk, which is used to\n   select the branch name when checking sdk extensions.\n * Make the ok checks in the output green\n\nChanges in 1.2\n==============\n\n * Ensure DeployCollectionID works in flatpakrepo files in all cases.\n * Don't error out with empty installations in uninstall.\n * Add helper that validates icon files during export.\n * Don't allow root to modify the (non-root) per-user flatpak installation,\n   as this risks causing problems later.\n * Remove some incorrect warnings from flatpak repair.\n * Allow multiple name segments after prefix when exporting files.\n * Allow specification of ellipsization in --colums options.\n * Handle dates as well as timestamps in appdata\n * Fixed a bug where flatpak remote-delete removed too many refs.\n * Now we use raw terminal mode during a transaction to a avoid problems with input\n   during the operation causing problems with escape sequences.\n * Generate a fontconfig directory remapping snippet as will be needed\n   for newer versions of fontconfig.\n * Support --extra-collection-id in build-commit-from to bind the commit\n   to multiple collection ids. This is work in progress in ostree.\n\nChanges in 1.1.3\n================\n\n * Various fixes to the CLI output changes\n * New flatpak --installations option to list all installations\n * Extract license info from appdata among with the other fields.\n   This is shown in e.g. info and remote-info, and has library API.\n * install/update/uninstall now has --noninteractive option with less output\n   that is useful when called from scripts, etc.\n * --devel is now properly forwarded to sub-sandboxes using the flatpak portal.\n * Drop dependency on libappstream-glib from libflatpak.\n * Initial support for exposing the system dconf defaults to the sandbox.\n * We now create deploy refs for the deployed commits to avoid a prune removing\n   objects that are in use.\n * Ask about removing all refs when deleting a remote.\n * New environment generator that handles custom installations,\n   replacing the old dbus service config file.\n * Documentation updates\n * More robust completion\n * Try to report out-of-space errors better.\n * Add more tests.\n * Various improvements to the repair command.\n\nChanges in 1.1.2\n================\n\n * Refreshed the CLI output layout, in particular the install/update progress\n   and application list/info commands.\n * The host XDG_{DATA,CONFIG,CACHE}_HOME env vars are now available as\n   with the HOST_ prefix in the sandbox.\n * FLATPAK_ID is set to the app id in the sandbox (this previously\n   only happened in flatpak build).\n * The spawn portal command now has a kill with parent option.\n * Flatpak shells now have custom prompts\n * New library APIs: Access to deployed appstream data, list unused refs.\n * Flatpak run now has --cwd option.\n * New option --static-delta-jobs to limit number of parallel delta\n   generation jobs in build-update-repo.\n * Fixed critical warning with newer policykit versions.\n\nChanges in 1.1.1\n================\n\n * New libflatpak function: flatpak_remote_get_main_ref()\n * Various changes to the policykit rules in order to cause less, and\n   more understandable policykit authentication dialogs.\n * Give DRI apps access to more nvidia device nodes required for CUDA/OpenCL support.\n * search now doesn't search noenumerate remotes.\n * Renamed operations permission-list to permissions and document-list to\n   documents. The old names are still supported as aliases.\n * New property 'non-interactive' for installations that allow frontends\n   to do background updates without triggering policykit authentications.\n * New flag in HostCommand to allow killing the child process when\n   the spawner exits the session bus.\n * Flatpak now authenticates on the terminal in case there is no desktop-wide\n   policykit agent.\n * update with no arguments now updates all installations (i.e. also custom\n   systemwide installations).\n * Use system helper to generate summary files for OCI remotes.\n * Better progress reporting for OCI downloads.\n * New conditional extension download feature, 'on-xdg-desktop-FOO'  which downloads\n   when XDG_CURRENT_DESKTOP matches FOO.\n * More sockets are now mounted read-only in the sandbox\n * Updated docs, error messages and translations\n\n\nChanges in 1.1\n==============\n\nThis is the first release in the new unstable 1.1.x series, leading up to 1.2\nwhich is expected around the end of the year.\n\nChanges in this version:\n * New command flatpak kill to kill running flatpak instances.\n * The remote argument is now optional in the flatpak install in\n   interactive installs. Instead you are prompted for which\n   remote to install from.\n * All commands printing tables now support --columns option to specify\n   exactly what to output.\n * flatpak uninstall now supports --delete-data to delete the application\n   data directory in your homedirectory. If no application is specified\n   it will remove data from all uninstalled apps.\n * flatpak list now supports filtering by runtime with:\n   --app-runtime=org.gnome.Platform//3.24\n * flatpak remote-ls can now show the runtime used for each app.\n * flatpak repo now supports --info to show information\n   about a repository, and it is the default operation\n   for the flatpak repo.\n * flatpak repo now supports --commits to list commits in branch.\n * flatpak now logs transactions to the systemd journal if built\n   against libsystemd.\n * libflatpak now exposed FlatpakInstance for a running instance.\n * Better error output if a flatpak command is misspelled\n * Drop support for migration from xdg-app (previous name for flatpak).\n * New library function flatpak_installation_get_min_free_space_bytes.\n * In interactive mode \"yes\" is now the default in most prompts.\n * Bumped ostree requirement to 2018.9\n * Cleanups and improvements to the test suite.\n * Improvements to documentation.\n * buildsystem support for coverage generation.\n\nChanges in 1.0.6\n================\n\nThis release fixes an issue that lets system-wide installed\napplications create setuid root files inside their app dir (somewhere\nin /var/lib/flatpak/app). Setuid support is disabled inside flatpaks,\nso such files are only a risk if the user runs them manually outside\nflatpak.\n\nInstalling a flatpak system-wide is needs root access, so this isn't a\nprivilege elevation for non-root users, and allowing root to install\nsetuid files is something all traditional packaging systems\nallow. However flatpak tries to be better than that, in order to make\nit easier to trust third party repositories. Thus, it is recommended\nthat all distros update to this version, or backport commit\nb98e09b20dfab896616b4a65e15c31f684a5f9f2.\n\nChanges in this version:\n * The permissions of the files created by the apply_extra script is\n   canonicalized and the script itself is run without any capabilities.\n * Better matching of existing remotes when the local and remote configuration\n   differs wrt collection ids.\n * New flatpakrepo DeployCollectionID replaces CollectionID, doing the\n   same thing. It is recommended to use this instead because older versions\n   of flatpak has bugs in the support of collection ids, and this key\n   will only be respected in versions where it works.\n * The X11 socket is now mounted read-only.\n\nChanges in 1.0.5\n================\n\nThere was a sandbox bug in the previous version where parts of the runtime\n/etc was not mounted read-only. In case the runtime was installed as the\nuser (not the default) this means that the app could modify files on the\nruntime. Nothing in the host uses the runtime files, so this is not a direct\nsandbox escape, but it is possible that an app can confuse a different app\nthat has higher permissions and so gain privileges.\n\nSo, it is recommended that everyone shipping flatpak to update to\n1.0.5, or at least backport the change in commit\n6711d7ae99c50a9dca8e4e2e9e9989a8fa6c3f06.\n\nChanges in this version:\n\n * Make the /etc -> /usr/etc bind-mounts read-only.\n * Make various app-specific configuration files read-only.\n * flatpak is more picky about remote names to avoid problems with storing weird\n   names in the ostree config.\n * A segfault in libflatpak handling of bundles was fixed.\n * Updated translations\n * Fixed a regression in flatpak run that caused problems running user-installed\n   apps when the system installation was broken.\n\nChanges in 1.0.4\n================\n\n * Flatpak 0.99.1 removed the inheritance of permissions from the runtime due\n   to concerns with dynamic app permissions. Due to popular requests, this\n   version re-introduces such inheritance, but does it instead at build time.\n   This solved the issues with dynamic permissions while still allowing runtimes\n   to have default permissions. Apps can disable this by passing\n   --no-inherit-permissions to build-finish.\n * The sandbox now always includes a /etc/timezone file, following the (old)\n   debian standard for this. This is needed, because the more modern way\n   of exposing the timezone name by having /etc/localtime be a symlink\n   into /usr/share/zoneinfo doesn't work when exposing the host timezone.\n * All apps now have automatic permissions to own their own app id as a\n   subname of org.mpris.MediaPlayer2.\n * We now properly re-load remote state in FlatpakTransaction if the\n   metadata was updated for the remote.\n * The signature of the FlatpakTransaction::operation-done signal was wrong\n   in the header and has now been corrected to the signature that is actually\n   emitted.\n * A crash was fixed when reading invalid .flatpakref files.\n * A crash during updates when a local ref was unexpectedly missing was fixed.\n * An error case on uninstalling was incorrectly returning success even\n   thought there was an error.\n * flatpak_installation_modify_remote did not correctly save the nodeps state.\n * flatpak_installation_load_app_overrides() was improperly returning freed\n   memory.\n * The tarball now ships with an icon (flatpak.png).\n\nChanges in 1.0.3\n================\n\n * run: You can now use --system to run an app that otherwise would run the\n   user version.\n * New permission --allow=canbus that filters out access to AF_CAN sockets.\n * lib: New install flags FLATPAK_INSTALL_FLAGS_NO_TRIGGERS and new function\n   flatpak_installation_run_triggers()\n * lib: Better error reporting, including some new error values that\n   replace the generic FAILED.\n * uninstall --unused: Improve handling of which .Locale extensions are used\n * run: Make flatpak run on systems where $XDG_RUNTIME_DIR contains a symlink\n   beneath /var (commonly /var/run -> /run).\n * Don't export any desktop/dbus/mimetype files in subdirectories.\n * build-init: We now record the base ref (if used) in the metadata. Nothing\n   uses this atm, but it can be used by tools.\n * We now respect the upstream ostree.deploy-collection-id instead of the\n   flatpak-specific xa.collection-id metadata key to decide whether to switch\n   to collection ids for a remote. This is useful, because if you use the\n   new one, only new clients (that support it better) will use it.\n * create-usb: Fix assertion failure in some error cases\n * create-usb: Always create archive-z2 repos\n * create-usb: Don't create unnecessary summary in repo\n * permissions: Avoid errors if there is no permissions table\n * repo: Fix flatpak repo sometimes using the wrong ostree-metadata ref.\n * Avoid fsync when updating $installation/.changed.\n * Add the missing appstream2 ref to the xa.cache metadata\n * The test-suite got some modifications to make it easier to maintain.\n * Documentation updates\n * Translation updates\n\nChanges in 1.0.2\n================\n\n * The dbus proxy is now available in a separate git module, xdg-dbus-portal,\n   which is imported into flatpak as a submodule. It is possible to build\n   flatpak against the system xdg-dbus-portal instead, but this is not currently\n   very useful as no other applications yet depend on xdg-dbus-portal.\n * Build regressions with older versions of glib have been fixed.\n * Flatpak ps now also tracks the pid the main process inside the sandbox.\n * Added flatpak override --reset to reset overrides for an app.\n * Added flatpak override --show to show overrides for an app.\n * flatpak install now automatically pick user or system based on the remote\n   name given (unless the remote exists in both).\n * flatpak uninstall --unused now does not remove SDKs if some installed app\n   refers to them.\n * Fixed bug where flatpak uninstall --unused prompted for uninstall twice.\n * Set IO class on the system helper to \"idle\", which should cause backgroun\n   updates to affect the system less.\n * Fixed regression in flatpak uninstall --no-related.\n * Better handling of empty collection ids in flatpak bundles.\n * Cleaned up some error messages.\n * Various documentation fixes and cleanups.\n * Updated translations.\n\nChanges in 1.0.1\n================\n\nThis fixes various build and test failures that were detected when\npackaging 1.0, as well as translations and doc updates. It also\nhas some minor features, including a new subcommand \"flatpak ps\"\nto list the running flatpak instances for your user.\n\n * Print application tags in the prompt when installing/updating.\n * Make sure we don't accidentally leak the host /proc into\n   the sandbox.\n * Translation updates.\n * Added a \"flatpak ps\" command that lists running flatpak instances.\n * Improve error reporting when exporting documents.\n * Improve detection of dynamic p2p remotes.\n * Build fixes for older versions of glib.\n * Fix threading issue in the OCI support that was causing the\n   installed tests to sometimes fail.\n * Fix OCI AppStream support on 32bit architectures.\n * Fix utf8 issue in the dbus API description.\n * Some install fixes to make installed tests work\n * Make the tests work with python3 (as well as python2)\n * Improve introspection annotations in libflatpak\n * Improve libflatpak API docs\n\nChanges in 1.0\n==============\n\nFlatpak 1.0 is the first version in a new stable release series. This\nnew 1.x series is the successor to the 0.10.x series, which was first\nintroduced in October 2017. 1.0 is the new standard Flatpak version,\nand distributions are recommended to update to it as soon as possible.\n\nThe following release notes describe the major changes since\n0.10.0. For a complete overview of Flatpak, please see\n[docs.flatpak.org](http://docs.flatpak.org/en/latest/).\n\n## For users, app developers and distributors\n\nFlatpak 1.0 marks a significant improvement in performance and\nreliability, and includes a big collection of bug fixes. 1.0 also\nincludes a collection of new features, including:\n\n * Faster installation and updates.\n * Applications can now be marked as end-of-life. App centers and\n   desktops can use this information to warn users who have an end-of-life\n   version installed.\n * Permissions now use an up-front verification model: users are\n   asked to confirm app permissions at install time, if an update\n   requires additional permissions, the user must also confirm.\n * A [new portal](https://flatpak.github.io/xdg-desktop-portal/portal-docs.html#gdbus-org.freedesktop.portal.Flatpak)\n   allows apps to create sandboxes and restart themselves. This allows\n   applications to restart themselves after they have been updated (to\n   start using the new version), and to increase sandboxing for parts\n   of the application.\n * `flatpak-spawn` is a new tool for running host commands (if\n   permissions allow) and creating new sandboxes from an app (this\n   uses the above portals APIs).\n * Apps can now export D-Bus services for all the D-Bus names they are\n   privileged to own (rather than just the application ID).\n * Flatpak's support for OCI bundles has been updated to the latest\n   specification. Also, AppData can now be distributed through OCI\n   repositories.\n * Host TLS certificates are now exposed to applications, using\n   p11-kit-server. This removes a point of friction when accessing\n   network services in some environments.\n * Apps can now request access the host SSH agent to securely access\n   remote servers or Git repositories.\n * A new application permission can be used to grant access to\n   Bluetooth devices.\n * A new `fallback-x11` permission grants X11 access, but only if the\n   user is running in a X11 session. For applications that support\n   both Wayland and X11, this can be used to ensure that the app\n   doesn't have unnecessary X11 access while in Wayland, but still\n   works in an X11 session.\n * Peer-to-peer installation (via USB sticks or local network) is now\n   enabled and supported by default in all builds.\n\nThe Flatpak command line also introduces new commands and options, including:\n\n * `uninstall --unused` automatically removes unused runtimes and\n   extensions (if you've removed all apps that depend on a runtime, or\n   all the apps you had depending on it have upgraded to a newer\n   version).\n * New `info` options, including `--show-permissions`,\n   `--file-access`, `--show-location`, `--show-runtime`, `--show-sdk`.\n * `repair` - fixes broken installs by scanning for errors, removing\n   invalid objects and reinstalling anything that's missing.\n * `permission-*` - allows interaction with the portals permissions\n   store. This is useful for testing and for getting back to a clean\n   state.\n * `create-usb` - can be used to prepare an repository to be used as a\n   local updates source.\n\nFinally, the command line has a collection of other improvements, such as:\n\n * If `--system` or `--user` aren't specified, one is automatically\n   picked if it is obvious (or it will ask if the correct option isn't\n   obvious).\n * The `install`, `update` and `uninstall` commands now ask for\n   confirmation of changes before proceeding, in order to prevent\n   mistakes, and to show the required application permissions.\n * The `uninstall` command now does not allow you to remove a runtime\n   if some installed application requires it.\n * `flatpak remove` is now an alias for `flatpak uninstall`.\n\n## For Linux distributors, OS and platform developers\n\n * Flatpak no longer requires a filesystem that supports `xattr`.\n * Portals are now more cleanly separated from Flatpak, thanks to the\n   document portal and permission store having been moved to\n   `xdg-desktop-portal`. It is recommended that the flatpak package has\n   a weak dependency on `xdg-desktop-portal`.\n * `libflatpak` now has a transaction API for install, update and\n   uninstall operations. This means that it is much easier to use as\n   the basis of app centers and other graphical app management\n   software.\n * Flatpak now sets several HTTP headers when installing applications,\n   which make it easier for Flatpak repositories to log things like\n   app download statistics and Flatpak versions in use.\n * It is now recommended that Flatpak packages add a dependency on\n   p11-kit-server, as this allows apps to access host\n   certificates. However, this does not need to be a hard dependency.\n * Requires bubblewrap 0.2.1 or later, and comes bundled with 0.3.0.\n * Requires OSTree 2018.7.\n\nMajor changes in 0.99.3\n=======================\n\n * Fixed case where system install would sometimes fail\n   due to the system-helper idle exiting.\n * Support installing flatpakref files in FlatpakTransaction,\n   including a new signal add-new-remote for when remotes\n   might be added.\n * Added some new FlatpakError codes.\n * We now support .flatpakrepo files with no gpg signatures\n * Fix crash in system-helper when updating appstream\n * New command create-usb which can be used to prepare\n   an repo for offline updates.\n * Fix some non-handled cases of the CLI not working when\n   /var/lib/flatpak doesn't exist.\n * Fix crash when running with a gid that is not in\n   /etc/groups.\n * Add new permission-* commands to interact with the\n   permissions store from the portals.\n * Include appdata in OCI bundle.\n\nMajor changes in 0.99.2\n=======================\n\n * Fix race condition on instance id allocation\n * Translation updates\n * Build fixes for new glibc versions\n * Build fixes for new libsoup versions\n * Build fixes for old glib versions\n\nMajor changes in 0.99.1\n=======================\n\nThis is the first pre-release before flatpak 1.0. This is considered\nfeature-complete and we expect no features or major changes before\n1.0, only bugfixes.\n\nNote: There were some (minor) API changes in the FlatpakTransaction\nAPIs that were added in 0.11.8, so please don't use the old\nversion. (Note: I know of no user of this API).\n\nChanges since last minor release:\n * Ostree 2018.6 is required, and with this, the p2p code in\n   flatpak is made non-optional.\n * flatpak install/update/ininstall now lists all the operations\n   that it will do and asks for confirmation before starting.\n * In the above confirmation the permissions (new permissions\n   for updates) are shown for all applications.\n * The FlatpakTranscation API has a new ::ready signal that\n   allows users to do similar confirmation prompts.\n * P2P updates are more efficient\n * system-wide installation uses less fsync calls so should\n   installation should be faster.\n * New ssh agent permissions allows granting an app\n   ssh access.\n\nMajor changes in 0.11.8.3\n=========================\n\n * Fix a 25 second timeout on startup if using p11-kit < 0.23.10\n * Minor change in dbus proxy default filter, now broadcasts are\n   not accepted from portals.\n\nMajor changes in 0.11.8.2\n=========================\n\n * Fix crash when building some apps\n * Allow multiple appstream components per app\n * Fix handling of gl drivers in uninstall --unused\n * Don't prompt if nothing changed in uninstall --unused\n * Longer timeouts in test suite\n * Updated translations\n\nMajor changes in 0.11.8.1\n=========================\n\n * Fixed regression running apps with --own=* permissions\n\nMajor changes in 0.11.8\n=======================\n\n * Flatpak uninstall now accepts --all to remove everything and --unused to remove unused\n   runtimes.\n * New command \"flatpak repair\" allows checking and repairing a flatpak installation.\n * New permission --allow=bluetooth allows use of AF_BLUETOOTH sockets\n * If p11-kit-server is installed on the host, this is now used to forward the host\n   certificate trust store to the sandboxed app.\n * New transaction API in libflatpak that makes it much easier to implement\n  installation and updates in frontends.\n * Flatpak uninstall now does not allow you to remove a runtime if some installed app requires it.\n * We now have tab-completion for zsh.\n * New installations of flatpak now defaults to bare-user-only repos, which means\n   that it works with filesystems that don't support xattrs.\n * New flatpak info options: --show-location, --show-runtime, --show-sdk\n * New flatpak remote-info options: --show-runtime, --show-sdk\n * p2p operations now work when offline.\n * Work around hanging on app startup on blocking autofs mounts.\n * The dbus proxy filtering now works matches the new dbus containers filtering API.\n * Various optimizations make installation and updates faster. In particular\n   operations like running triggers and pruning only happens once per\n   install/update operation.\n * We now respect multiple extension versions matches when auto-downloading extensions.\n * New http header Flatpak-Upgrade-From sent when upgrading.\n * Commands like \"flatpak info/list/remotes/search\" now work properly if /var/lib/flatpak doesn't exist.\n * The bubblewrap version required for system-bwrap is now 0.2.1.\n\nMajor changes in 0.11.7\n=======================\n\n * Fix regression in installing .flatpak bundles\n\nMajor changes in 0.11.6\n=======================\n\n * Further work on the export filename regression, now also fixes the\n   same issue as in 0.11.5 but in flatpak build-finish.\n * Fix segfault when installing from .flatpakref in gnome-software\n * Build yacc parser from source.\n * Don't tab-complete Sources/Locale/Debug extension by default.\n * Fix tests on debian.\n\nMajor changes in 0.11.5\n=======================\n\n * Fix a regression which caused installation of epiphany and\n   other apps that export multiple .service files to fail.\n * Fix appstream updates in p2p mode.\n * Don't distribute generated gdbus code with tarball.\n * Add documentation for the flatpak portal\n\nMajor changes in 0.11.4\n=======================\n\n * flatpak remove is now an alias for flatpak uninstall.\n * flatpak uninstall now picks system or user automatically if not specified\n * New appstream branch format which is more efficient to distribute,\n   the old is still generated for backwards compat.\n * Appstream data now contains compatible arches (for applications\n   that doesn't exist for the primary arch). For example, an\n   i386-only app is now listed in the x86-64 appstream.\n * The flatpak version is included in the user agent when downloading.\n * The Flatpak-Ref http header is set to the currently installing ref when\n   downloading.\n * New argument --timestamp in build-commit-from.\n * When updating many apps we now only prune the local repo when all\n   updates are done, making multi-app updates faster.\n * flatpak build now always allows multiarch use.\n * flatpak build now mounts app extensions during build.\n * flatpak build-init now supports --extension to add extension points earlier\n   than build-finish. Also build-finish now supports --remove-extension.\n * New flatpak portal allows applications to sandbox themselves and restart a\n   newer version of themselves.\n * New flatpak run options: --no-a11y-bus, --no-documents-portal.\n * Initial support for end-of-life:ing applications.\n * New option X-Flatpak-RunOptions in exported desktop/files allow you to specify\n   no-a11y-bus and no-documents-portal.\n * Support for tagged extension points, which is useful if you want to use\n   the same extension id (but maybe different versions) multiple times in an app.\n * We now export .service files for names that the app is allowed to own on\n   the session bus.\n * libflatpak got new methods for listing remotes by type.\n * libflatpak now has support in FlatpakRemoteRef for getting remote metadata\n   such as end-of-life, download size, metadata etc.\n * There was some internal restructuring on how installs/updates are done\n   which should improve performance and maintainability.\n\nMajor changes in 0.11.3\n=======================\n\n * Fix \"open with\" and flatpak run --file-forwarding crash\n * Fix build with glibc 2.27\n\nMajor changes in 0.11.2\n=======================\n\n * Remove fuse dependency, since we don't ship document portal anymore\n * Fix various issues with /home being a symlink to /var/home (atomic)\n * Allow downgrades when using collection ids\n * Search on all supported architectures\n\nMajor changes in 0.11.1\n=======================\n\nThis release removes the document portal and the permission store as they\nhave been added to xdg-desktop-portal 0.10. Packagers need to update\nthese two in lock-step. Flatpak technically doesn't depend on\nxdg-desktop-portal, but it is recommended that the flatpak package\ndepends on xdg-desktop-portal in some way, because most flatpaks will\nwant it.\n\n * Remove document portal and permission store\n * Add --socket=fallback-x11 permission\n * Fix dbus proxy vulnerability in authentication phase\n * Allow personality syscall in devel mode\n * commit-from: Migrate static deltas with commit\n * Add \"network\" storage type for installations\n * Add flatpak info --show-permissions\n * Add flatpak info --file-access\n * search: Update appstream (if stale) before searching\n * Make libflatpak work when /var/lib/flatpak is empty\n * build-bundle: Add --from-commit option\n * Allow appstream ids that don't end in .desktop\n * Make permission handling ignore unknown permissions for forwards\n   compatibility\n * Removed incorrect error message in update --appdata when there\n   was no updates\n * Fix handling of abort in the duplicate remote prompt\n * Fix division by zero in progress calculation\n * Fix flatpak remote-info --show-metadata\n * Fixed crash when installing some flatpak bundle files\n * Fix installation of telegram\n * remote-ls -u only considers app from the origin remote\n * Fix assertion error in extra-data progress reporting\n * Report nicer errors when trying to downgrade as non-root\n * pulseaudio: Try to find pulseaudio socket better\n * Fixed some warnings reported by coverity\n * Cleaned up code by splitting up some large source files\n\nMajor changes in 0.10.2\n=======================\n\n * Flatpak now requires OSTree 2017.14\n * flatpak update now updates from both system and user installations\n   by default.\n * flatpak update is less noisy when updating appstream info.\n * All the remote-* commands now by default automatically decide to use\n   --user or --system based on the given remote name.\n * flatpak remote-ls with no remote lists the content of all remotes\n * Fixed regression that made xdg-user-dirs and theme selection\n   for kde apps break.\n * flatpak override with no argument now overrides globally, i.e. for\n   all apps.\n * flatpak override now supports --nofilesystem properly. For example\n   flatpak override --nofilesystem=~/.ssh hides the ssh dir for all\n   apps, even those who have homedir access.\n * flatpak install now takes a --reinstall argument which uninstalls\n   a previously installed version if necessary. This is very useful\n   when you want to install a new version from a different source.\n * flatpak install now allows you to pass an absolute pathname as\n   remote name, which will create a temporary remote and install\n   from that. The remote will be removed when the app is uninstalled.\n   This is very useful during development and testing.\n * Flatpak now creates CLI wrappers for all installed apps, so if you\n   add /var/lib/flatpak/exports/bin or ~/.local/share/flatpak/exports/bin\n   to your PATH you can easily  start flatpak apps by their application id.\n\nMajor changes in 0.10.1\n=======================\n\n * New command \"flatpak remote-info\" shows information about applications\n   in a remote. In particular the --log operation shows the history and\n   can be used in combination with flatpak update --commit=XYZ to roll\n   back to a previous version.\n * New command \"flatpak search\" which allows you to search the appstream\n   data from the commandline.\n * flatpak update now updates appstream data for all confured remotes, which\n   is important for search to work.\n * Allow automatic installation of gtk themes matching the active theme.\n * Handle the case when /etc/resolv.conf is a symlink\n * /usr an /etc are now expose in /run/host in the app if the app has\n   full filesystem access.\n * flatpak remote-add now works as a user when /var/lib/flatpak is empty,\n   allowing flatpak to work on stateless systems.\n * Add support for flatpak build --log-session/system-bus, similar to\n   what flatpak run already does.\n * flatpak build --readonly runs with the target directory (normally /app)\n   mounted read-only.\n * Fall back to LD_LIBRARY_PATH if a runtime doesn't have /usr/bin/ldconfig.\n * Updated the support for OCI remotes. This is work in progress and still\n   disabled by default though.\n\nMajor changes in 0.10\n=====================\n\nThis is the first release in a new series of stable releases called\n0.10.x. New features will be added to 0.11.x, and bugfixes will be\nbackported to 0.10.x. During the early phase of the 0.10.x series we\nmay also backport minor features, but we guarantee backwards\ncompatibility.\n\nChanges since 0.9.99\n * Added the flatpak config option which can set the language settings\n * Fix issue where sometimes ld.so.conf were not generated\n * /dev/mali0 is added to --device=dri\n * Work around ostree static delta issues in some cases\n\nMajor changes in 0.9.99\n=======================\n\n * Requires ostree 2017.12 for important pull stability fix\n * New libflatpak API: flatpak_dir_cleanup_undeployed_refs, flatpak_installation_prune_local_repo,\n    flatpak_installation_remove_local_ref_sync, flatpak_installation_cleanup_local_refs_sync\n * build: FLATPAK_ID and FLATPAK_ARCH are now set in the environment when building\n * update: Don't fail the entire update if some remote fails to update its metadata\n * run: /.flatpak-info now lists exact commits and extensions in use\n * run: We now use a per-app ld.so.cache file whenn running. This should speed things up,\n   and allows ldconfig to report the correct results.\n * The verbose mode was changed into two levels, use -vv to show the more detailed info, which\n   currently only contains the full bubblewrap argument lists.\n * run: Some common problematic host environment variables are now unset in the sandbox\n   (PYTHONPATH, PERLLIB, PERL5LIB and XCURSOR_PATH)\n * run: Fixed failure when a higher prio extensions depended on a lower prio one.\n * run: The extension ld path order is now: app extensions, app, runtime extension, runtime.\n   This was previously incorrect in that the app could override app extensions.\n * Extensions are now not downloaded if a matching unmaintained extension is already installed\n * Preemptive changes to handle new bubblewrap change which doesn't user /newroot\n * document portal: Disable debug spew that was accidentally enabled\n * build-finish: New --extension-priority option\n * run: Fix regression in --persist in 0.9.98\n * run: Use sealed memfds (instead of just temporary files) when passing data to bubblewrap\n\nMajor changes in 0.9.98.2\n=========================\n\n * Fix permission denied when using the system-helper\n\nMajor changes in 0.9.98.1\n=========================\n\n * run: Fix homedir access if the app has --filesystem=host access\n * build-update: Fix appstream update in case one arch didn't change\n\nMajor changes in 0.9.98\n=======================\n\n * libflatpak now correctly finds metadata for subset installations (like locale data)\n * flatpak build now supports --appdir which exposes the per-app directory in the\n   user homedir. This is useful when testing builds.\n * The host fontconfig caches are exposed to the sandbox, next to the fonts in /run/host.\n   This will (pending fontconfig work) allow sharing host fontconfig caches, allowing\n   much faster initial startup for flatpak apps.\n * flatpak install now supports --no-pull\n * Added new extension property \"locale-subset\", which makes the extension point\n   act like a locale extension (i.e. only install the subset configured by the\n   locale).\n * flatpak remote-add --oci is disabled for now, as this is not up to date with\n   the latest OCI work, and we don't want to break existing deployments if this\n   has to change when this lands.\n * Parallel installation/updates are now safe because we take a filesystem lock\n   whenever we prune the local ostree repo.\n * Flatpak run now works when important paths like $HOME, etc, are symlinks.\n * The ostree min-free-space property is is set to zero by default for the\n   flatpak repos. This was causing a lot of problems for people, but the feature\n   is still there if you manually enable it.\n\nMajor changes in 0.9.12\n=======================\n\n * Fixed a regression in extra-data installation\n * Don't expose the a11y bus in flatpak build\n\nMajor changes in 0.9.11\n=======================\n\n * You can now show all outstanding updates with: flatpak remote-ls --updates\n * The dbus filter \"org.name.*\" now means all subnames of org.name, not just\n   the first level. This matches how dbus arg0namespace works, and how the\n   coming dbus container support will work.\n * Fixed segfault on update\n * Better commandline tab completion\n * Flatpak now exposes host icons readonly as /run/host/share/icons to the sandbox.\n\nMajor changes in 0.9.10\n=======================\n\n Fix regression in dbus proxy that causes some apps to not\n work in 0.9.9.\n\nMajor changes in 0.9.9\n======================\n\nflatpak-builder was split out into its own module:\n  https://github.com/flatpak/flatpak-builder\n\n * When downloading to a temporary directory for later install to the\n   system repo we now write to /var/tmp instead of $HOME. This is more\n   likely to be the same filesystem as /var/lib/flatpak, and thus will\n   not run into issues with e.g. filesystem full.\n * We now get the default language list from AccountService if possible.\n * A regression that made --devel crash was fixed.\n * New feature for flatpakrefs, SuggestRemoteName=remotename will cause\n   flatpak to ask if you want to create a generic (not app specific)\n   remote for the repo url.\n * flatpak build now does not die with the parent by default, you have\n   to pass --die-with-parent. This was done because die-with-parent\n   uses PR_SET_PDEATHSIG which does not work well if the parent is\n   threaded, like e.g. gnome-software is.\n * We now always re-set the personality in the sandboxed process\n   in order to avoid inheriting weird settings.\n * We now share a single dbus proxy instance for all proxies for a sandbox.\n * dbus-proxy now properly disallows old-style eavesdropping.\n * We now support accessibility by starting a customized dbus proxy for the\n   a11y bus.\n\nMajor changes in 0.9.8\n======================\n\nCore:\n\n * Experimental support for peer2peer installation, enable with --enable-p2p\n * Add default language setting to flatpak config. Defaults to all locales for\n   system installs and the users locale for per-user installs.\n * build-update-repo: Now always keeps the *two* latest deltas around to avoid\n   race conditions with outstanding downloads at the time or running the update.\n * Support loading extra data from local lookaside cache.\n\nFlatpak-builder:\n\n * Set terminal title to the currently building module\n * Added ability to specify http url for sources mirror with --extra-sources-url.\n * --install-deps-from=REMOTE installs the dependencies needed for the\n   manifest.\n * New option --delete-build-dirs to always delete build directories,\n   even on a failed build.\n * New property \"add-extension\" makes it nicer to create extension points.\n\nMajor changes in 0.9.7\n======================\n\n * Don't re-download git repo when bundling sources\n * Build modules with no source if buildsystem is \"simple\"\n * Build cleanups\n\nMajor changes in 0.9.6\n======================\n\nThis version requires the latest ostree version (2017.7) because it\nuses a new feature that hardens the security of flatpak. Previously,\nif you installed to a system-wide repository, the files created for an\napplication were as specified by the remote repo, but owned by root,\nwhich could include problematic permissions like setuid or\nworld-writable. We now never create such problematic files or\ndirectories on disk. Flatpak export was also changed to never\ncreate problematic files in new apps.\n\nRelated to this, newly created flatpak installations also use the\nnew \"bare-user-only\" mode for the repositories, which means you\ncan now install applications even if your filesystem does not\nsupport extended attributes.\n\nOther changes:\n\n * flatpak info --show-metadata now only shows the metadata, in\n   a machine parseable way.\n * build-export now records the flatpak version in the commit message\n * builder: The .pyc timestamp fixer now allows .pyc files with no\n   corresponding .py file.\n * builder: New feature 'inherit-extensions' lets you copy extension\n   info from the parent runtime.\n * builder: Set ExtensionOf in auto-created extensions (like Locale\n   and Debug)\n * builder: Setting CPPFLAGS now works\n\nMajor changes in 0.9.5\n======================\n\n Changes in flatpak:\n\n * Fix installation of installed tests\n * Don't show an error when updating if a remote is disabled\n * Store the app id in the X-Flatpak key when exporting a\n   desktop file.\n * flatpak run: Handle paths when rewriting %u urls during\n   file forwarding.\n * builder: Always assume separate builddir when using meson, as\n   meson only works with this.\n * document-portal: The app-specific directory is always accessible\n   to the app, take this into consideration for AddFull.\n * builder: Don't warn for unknown keys if they start with x-\n * Fix a race condition when restarting the document portal\n * build-update-repo: Don't list removed deltas in the summary\n * list: Don't show .Locale/.Debug/.Sources by default. Show with -a.\n * remote-ls: Don't show .Locale/.Debug/.Sources, or non-primary\n   arches (unless the primary does not exist) by default.\n   Show with -a.\n * dbus-portal: Fix handling of NameHasOwner\n * builder: Add --export-only to export a previous build.\n * run: Allow regular files for --filesystem=xdg-config/path\n * run: Allow --filesystem=xdg-config/subdir:ro (previously\n   it needed to be writable).\n * build-commit-from: Properly handle xa.ref when rewriting\n   refnames.\n\nMajor changes in 0.9.4\n======================\n\n Changes in flatpak:\n\n * Now requires ostree 2017.6 and bubblewrap 0.1.8\n * Better progress reporting in CLI and UI\n * Improved output from commands info, list, remotes,\n   remote-ls: More detail, colors, nicer table formatting.\n * New command flatpak repo that lets you show information\n   about local repositories.\n * When launching exported desktop files, the paths\n   passed to it are automatically created as documents\n   to allow access to the arguments, if needed.\n * Flatpak install of an already installed application is\n   now a warning, not an error.\n * flatpak build now kills all the processes in the\n   sandbox when it exits.\n * flatpak update --subpath=... now updates the app event\n   if there is no new upstream version, but the subpath is\n   different from what is currently installed.\n * Exports are now whitelisted, and the only thing you can\n   export are:\n     desktop files, icons, dbus services, mime definitions, and\n     gnome-shell search providers\n * Exported gnome-shell search providers are automatically\n   disabled by default.\n * Exported mimetypes are rewritten to only allow globs, and to\n   make the globs have a low priority vs system mime info.\n * A remote can now redirect to a new URL and/or a new GPG key, by\n   using build-update-repo --redirect-url=URL --gpg-import=FILE.\n   When clients see this they permanently change the local configuration.\n   This is very useful when migrating official repositories.\n * flatpak caches in the homedir are now stored in ~/.cache\n   (or $XDG_CACHE_HOME) instead of ~/.local/share/flatpak/system-cache.\n * Added version field to all exported dbus interfaces.\n * New AddFull method in the Document Portal, which allows\n   exporting multiple files, as-needed by a particular target\n   app. This is useful for implementations of dbus activation\n   for desktop files.\n * New flag --no-static-deltas for install/update without\n   using static deltas. Mostly useful for debugging.\n * TMPDIR is now unset in the sandbox, if set on the\n   host. Each sandbox has a personal /tmp that is used.\n * Flatpak run now works if /tmp is a symlink on the\n   host.\n * /etc/hosts and /etc/hosts.conf from the host are now exposed\n   in the sandbox in addition to /etc/resolv.conf.\n * Titles and default branches are now automatically updated from\n   the remote unless they are explicitly set. You no longer have\n   to run flatpak remote-modify --update.\n * Some performance inprovements when installing apps.\n * When exporting a build, the commit objects now always include\n   the branchname, the metadata and install/download size.\n   The sizes are reused for faster summary building, and the\n   others changes are for future use. The fields are verified\n   against the deployed metadata during installation, so it\n   is trusted.\n * Fixed minor race condition in portal application identification.\n * lib: New  flatpak_installation_update_appstream_full_sync method\n   that allows progress reporting.\n * bash-completion: Fix out-of-bounds read that could produce\n   weird completion at times.\n\n Changes in flatpak-builder:\n\n * Added support for appdata screenshot mirroring.\n * New property \"install-rule\" lets you change what Makefile rule to\n   use in the install phase.\n * The git \"commit\" property can now specify both a tag object and the\n   commit object it refers to.\n * New cppflags property, similar to e.g. cflags.\n * The \"env\" property now overrides the cflags/cxxflags/ldflags\n   properties, to allow these to be reset.\n * Initial checkout of git/bzr to a temporary directory so that errors\n   during checkout do not persist.\n * Properly take the \"buildsystem\" field into account when calculating\n   cache freshness.\n * Don't crash if appstream-compose fails.\n * \"ldflags\" property now works  correctly.\n\nMajor changes in 0.9.3\n======================\n Changes in flatpak-builder:\n\n * \"rename-icon\" renames in translated icons too\n * Moved manifest format docs to own manpage, \"flatpak-manifest\".\n * \"bootstrap.sh\" is now recognized as an autogen.sh alternative\n * Fall back to not using rofiles-fuse if it is not available.\n * Make sure flatpak-builder --run grants the app access to dbus.\n * Make paths paths for module includes and module dependencies\n   relative to the included module rather than the \"base\" json file.\n * When cross-compiling 32bit apps on 64bit arches (like i386 on x86-64)\n   then we automatically set a linux32 personallity.\n * Print warnings for unhandled json properties.\n * Make sure flatpak-builder --run works if --extra-data is in the\n   finish args.\n * Take build-commands into consideration when considering if the\n   build cache is stale.\n * Support for --extra-sources= to pre-seed downloaded sources.\n * Support for --bundle-sources which creates a runtime with the sources\n   that were used to build the app.\n * Handle trailing whitespace in git submodule uris\n * Progress reporting while downloading files.\n\n Other changes:\n * build-export now always exports directories as readable and executable.\n * build-update-repo --generate-static-deltas now fork the work process\n   rather than using threads, which avoids problems with this using\n   a lot of memory in a single process in some cases.\n * Report flatpak version in HTTP request user agent.\n * New \"flatpak repo\" command added that has some options for maintaining\n   a repository.\n * flatpak info can now report more information and handles multiple\n   installed branches better.\n * Support non-default WAYLAND_DISPLAY environment var.\n * Handle application ids that end with .desktop when generating\n   appstream data.\n * Documentation updates\n\nMajor changes in 0.9.2\n======================\n\n * Fixed a use-after-free and some leaks in the dbus-proxy. This\n   is not currently believed to be exploitable, but the proxy is a\n   security boundary, so we still  recommend to update.\n * Regular updates now never allow updates to an older version\n   than what is currently installed (unless you explicitly specify\n   an old commit id). This closes a hole where a MITM attacker can\n   force clients to downgrade to an earlier (gpg-signed) version of\n   the application.\n * The automatic detection of --from in flatpak install now detects\n   flatpakref extensions even in URIs that end in a query string such as\n   https://git.gnome.org/browse/gnome-apps-nightly/plain/gedit.flatpakref?h=stable\n * OCI support now supports GPG signatures\n * OCI support now works with the system-helper for unprivileged systemwide\n   installation.\n * Experimental support for the new ostree bare-user-only repo mode that\n   allows flatpak to run on filesystems without xattrs. Set\n   FLATPAK_OSTREE_REPO_MODE=user-only in the environment to use this.\n * builder: New property disable-fsckobjects for git sources\n * builder: New property commit for git sources. This lets you specify\n   both a tag (for readability) and a commit id (to ensure the tag doesn't\n   change).\n * builder: The manifest file format docs have been split out into its\n   own manpage.\n * builder: App manifests now support specifying sdk-extensions that has\n   to be installed for the app to build.\n * builder: When creating the platform, remove all sdk-specific extensions,\n   allowing creation of sdk-specific extensions.\n * builder: Correctly handle absolute pathnames in the specified\n   command.\n * builder: Support --default-branch which defined the branch to build in\n   case the manifest doesn't specify one.\n * When exporting builds to ostree we now use the canonical permissions\n   for bare-user files, which means the resulting builds can safely\n   be used with the new ostree bare-user-only repository type.\n * The detection of \"unmaintained\" system extensions was broken, and\n   in some cases these extensions were not found. This now always\n   works.\n * Flatpak now builds with latest OSTree. This required some fixing for\n   multiple definitions of the g_auto* macros as OSTree now exports\n   those.\n * We no longer rely on ostree trivial-httpd for the tests, because\n   this is optional in later versions of ostree. Instead we use\n   they python SimpleHTTPServer.\n * The minimum glib version has been corrected to 2.44.\n * The minimum automake version has been increased to 1.13.4\n   because some older version didn't work.\n\nMajor changes in 0.9.1\n======================\n\nThis release mostly has changes to flatpak-builder and the build\nmachinery. All flatpaks built with this version can run\non flatpak 0.8.x, but there has been additions and minor\nchanges in flatpak-builder that may require minor changes\nto existing builder manifests, see below.\n\nThe flatpak-builder build cache now uses an ostree feature called\nrofiles-fuse. This allows the build to work directly against\nhardlinked checkouts of the cache, because rofiles-fuse disallows\nwrites to the hardlinked files (but allows replacing them). This makes\ncache commits and checkouts much faster. However, it also means that\ninstallation cannot do in-place modification of files in the\ninstallation directory. There is a new per-module property called\n\"ensure-writable\" that takes a list of patterns and ensures all files\nmatching them are writable (by manually breaking the hardlinks). This\nmay need to be added to some manifests to keep them building in the new\nversion.\n\nThe cflags and cxxflags module properties now work by appending,\nrather that replacing, when there are multiple values specified. For\ninstance, the per-arch or per-module cflags will be appended to the\nbase cflags. This may cause old json files do duplicate cflags in\nsome cases. Normally compiler flags are repeatable without problems\nthough, so it is unlikely to cause problems.\n\nHere are a short summary of the rest of the flatpak-builder changes:\n\n * The build cache was changed so that it is not invalidated if\n   the installed version of the SDK changed. This means that the app\n   will not rebuilt if you updated the SDK. This is generally the right\n   thing to do, as SDKs are meant to be compatible.  If you want\n   to avoid this (for instance when building against an unstable sdk)\n   you can use the --rebuild-on-sdk-change argument.\n * The build cache is now per-arch, so building on one arch doesn't\n   invalidate the cache for another arch.\n * New buildsystem \"cmake-ninja\" which works like \"cmake\", but builds\n   using ninja, rather than make.\n * New buildsystem \"simple\" which doesn't use configure or make, it\n   just runs a set of shell commands specified in the \"build-commands\"\n   property. Note: build-commands is also available to other buildsystems\n   and are run between make and make install.\n * flatpak-builder now has build-runtime and build-extension properties that\n   makes it easier to build runtimes and extensions.\n * FLATPAK_DEST is set in the build environment to the installation\n   destination (i.e. typically /app). It is particularly useful when\n   building an extension where the destination is more complex.\n * flatpak-builder now supports --from-git=URL which pulls the\n   json manifest and related files directly from a git repo.\n * modules have a new no-make-install property which skips\n   the make install step.\n * Modules and sources have only-arches and skip-arches properties,\n   which lets you enable/disable them based on the build architecture.\n * build-options has a new property ldflags, which is similar\n   to cflags and cxxflags.\n * flatpak build (and thus flatpak-builder --run) now supports\n    dbus proxies when needed.\n * All git repos are cloned with fsckObjects=true, which means\n   we verify that the repos are valid.\n * New flatpak-builder argument --build-shell=MODULE extracts and\n   prepares the sources for a specified module and then starts\n   a build sandbox inside it.\n\nThere are also some other changes:\n\n * build-export: Now supports --timestamp=ISO-8601-TIMESTAMP, which\n   allows you to create reproducible commits.\n * The OCI support has been updated to the latest version of the\n   OCI image specification format.\n * There is a new flatpak-bisect script that can be used to bisect\n   flatpak applications, looking for regressions.\n * flatpak list got a revamp. It now shows more information, and\n   shows both apps and runtimes by default.\n * flatpak remote-list was renamed flatpak remotes in order\n   to minimize confusion with flatpak remote-ls. The old name\n   is deprecated but still works.\n\nMajor changes in 0.8.4\n======================\n\nIn addition to the regular list of bugfixes this stable release\ninclude backports of one more feature required for making OpenGL work\nwell. Now extra-data using extensions (such as the nvidia driver) can\nspecify that it doesn't need a runtime to run its apply script. We use\nthis in the nvidia driver by making the script a static binary, which\nlets us use the nvidia driver for multiple runtimes without requering\nthat a particular one is installed. We also support an extension point\nsupporting multiple versions, which will be use for sharing the\nnvidia driver between different runtime versions.\n\nAdditional fixes:\n * Documentation fixes\n * Crash fixes\n * Fix xauth propagation in some cases\n * Don't remove origin remotes on uninstall if some other app\n   is installed from it.\n * Don't reset what locales are installed when updating a locale\n   extension\n * Disable splice for the documentation portal as it seems\n   to be broken in fuse\n * Append, don't override XDG_DATA_DIRS in profile script\n * Fix progress reporting in libflatpak to go from 0 to\n   100% once, merging the various phases.\n\nMajor changes in 0.8.3\n======================\n\nIn addition to the regular list of bugfixes this stable release\ninclude backports of a the updated OpenGL support from master.  This,\nin combination with the work in the runtime allows flatpak to work out\nof the box with out-of-tree OpenGL drivers, including the nvidia\ndriver.\n\nAdditionally, due to some complicated issues wrt ptrace and user\nnamespaces this version disables the use of user namespaces if\nbubblewrap is setuid, as it cause problems for the way flatpak\nportals identifies applications. (See issue #557 for details)\n\n * Better handling of errors for extra-data\n * Handle extra-data properly for runtimes (as well as apps)\n * Respect required version for runtimes (as well as apps)\n * flatpak list: Don't break if some local ref is not deployed\n * builder: Look for appstream data in /app/share/metadata also\n * builder: Fix buildsystem=cmake builds\n * Add progress reporting to extra-data download\n * Fix uid/gid for directories in document portal\n\nMajor changes in 0.8.2\n======================\n\nThis is a bugfix and security update.\n\nSome of the bind-mounts that flatpak sets up were not read-only as\nthey should have. This includes: extensions, system fonts,\nresolv.conf, localtime and machine-id. Many of thse are typically only\nwritable by root, but some, like the user-specific fonts and\nuser-installed extensions could be modified from the sandbox.\n\nEveryone using 0.8.x is recommended to update to this version.\n\nOther fixes:\n\n * There are new configure options for where to install dbus configuration\n * Broken symlinks in the root directory no longer break flatpak run\n * flatpak run with HOME in /var now works\n * dri access now also handles mali devices\n * install handles --arch when installing flatpakrefs\n * system-helper activation fixed on systemd-less setups\n * dbus-proxy now works without /run\n * During installation, failing to update a dependency is now not\n   fatal.\n * /etc is now fully writable when building runtimes\n * --filesystem=xdg-config/foo now sets up the bind-mount from the host dir\n   even when not using :create.\n\nMajor changes in 0.8.1\n======================\n\nThis is a bugfix and security update (CVE-2017-5226).\n\nFlatpak now uses seccomp to disallow the TIOCSTI ioctl in the sandbox,\nwhich works around the possibility to inject text on the controlling\ntty (CVE-2017-5226).\n\nThis was previously fixed in bubblewrap in 0.1.6, but that change has\nnow been reverted as it introduced other problems for flatpak.\n\n * Update bundled bubblewrap to 0.1.7\n * Fix writing new file with O_EXCL in the document portal.\n * Allow appstream data that doesn't have .desktop in the component id,\n   such as data for runtimes.\n * Drop json-glib dependency from 1.2 to 1.0\n * Builder: Fail if unable to read included file\n * OCI: Ensure exported layers are readable by everyone\n * Fix extra-data download in gnome-software\n * Fix update-mime-database trigger when installing via\n   the system helper.\n * Updating an app by installing a newer bundle now works\n   again.\n * Make /var/tmp not be on a tmpfs (it is now in\n   ~/.var/app/$appid/cache/tmp).\n * Documentation / translation updates\n\nMajor changes in 0.8.0\n======================\n\nThis is the first release in a new series of stable releases called\n0.8.x. New features will be added to 0.9.x, and only bugfixes will be\nbackported to 0.8.x. The featureset of this release is a good base to\ntarget if you're creating flatpaks that should be widely usable.\n\nThis release technically requires only OSTree 2016.14, and it build\nfine with this, but we recommend using OSTree 2016.15, because of the\nchange in how it verifies the checksums of commits in delta files.\n\n * Flatpakrepo files now support a RuntimeRepo= key which points to\n   a flatpakrepo file. This means the user don't have to manually\n   configure a remote for the runtime, just reply to the prompt\n   to automatically do this when installing the app.\n * We now support dependencies when installing bundles. This includes\n   required runtimes, related refs, and the equivalent of RuntimeRepo.\n * The support for OCI in flatpak has been updated to the latest\n   OCI spec version, and support has been added to directly install\n   flatpak applications from an OCI image.\n * In flatpak install, the --from and --bundle options are now optional\n   if the argument has the correct suffix (.flatpakref and .flatpak)\n * Flatpak install now supports -y to let you avoid interactive prompts.\n * build-finish: We now export mime type files with the right name.\n * build-finish: New --require-version option let you specify a particular\n   version of flatpak, and older version of flatpak will not install\n   or update to the new version.\n * build-sign: Allow signing all apps by omitting the id.\n * Fix regression in the document portal when adding named files.\n * build-import-bundle now signs the commit if you specify a gpg key.\n * Flatpak now reads configuration from /etc/flatpak/installations.d\n   which lets you support multiple system-level installation paths.\n   These can be accessed with new --installation=... arguments to\n   most of the commands.\n * flatpak-builder: Support --jobs=N to limit parallel builds\n * flatpak-builder: Patch source got new options property that lets\n   you pass arguments to patch.\n * flatpak-builder: New generic \"buildsystem: type\" option that\n   replace the (now deprecated) \"cmake: true\" option. This\n   supports \"autotools\", \"cmake\" and \"meson\".\n\nMajor changes in 0.6.14\n=======================\n * Update bundled bubblewrap to 0.1.4 which has some nice bugfixes.\n   If you are using an external bubblewrap it is recommended, but\n   not required to update.\n * Requires OSTree 2016.14, which allows us to drop some old\n   workarounds.\n * When installing an application system-wide, don't consider\n   dependencies that are installed for the user only.\n * Flatpak install --from now tries to re-use existing remotes to\n   avoid creating unnecessary origin remotes.\n * Using --filesystem=$dir when $dir is a symlink-to-directory now works.\n * Using --filesystem=$file to expose unix sockets to the app is now\n   allowed.\n * By default all the directories in ~/.var/app (except the app), as\n   well as ~/.local/share/flatpak are hidden in the sandbox.\n * New option --filesystem=$dir:create which will create the destination\n   if it did not previously exist.\n * --filesystem= now supports for xdg-[config|cache|data]. This\n   allows you access to the host versions of these xdg dirs. Additionally\n   if you use these with a subdirectory, like:\n     --filesystem=xdg-config/subdir\n   then that subdirectory on the host will be shared with the per-app\n   instance of the xdg-dir.\n * Builder now correctly handles app-ids that have dashes in them.\n   Previously this generated invalid ids for the debuginfo and locale\n   extensions.\n * The experimental OCI file format support was changed from creating an\n   OCI container to creating an OCI image.\n * Fix regression where \"flatpak update --appstream remotename\" broke\n\nMajor changes in 0.6.13\n=======================\n * The command line arguments for install/update/uninstall changed\n\n   These used to take an application id and an optional branch name as\n   two arguments. This meant you could not specify multiple apps\n   to install in a single command. So, instead of having the branch\n   as a separate argument we now support partial references.\n   If you only specify an id we try to match the rest as best we\n   can depending on what is installed/available, but if this\n   matches multiple things you have to specify more details.\n\n   For example you can use:\n     * org.my.App//stable - Any compatible arch, stable branch\n     * org.my.App/x86_64 - x86-64, look for available branch\n     * org.my.App/x86_64/stable - exact reference\n\n   This means install/update/uninstall can now install multiple apps\n   in a single operation.\n\n * Application runtime depencenies are checked/downloaded\n\n   Whenever you install or update an application we check that the\n   required runtime is installed. If not, we check if it is available\n   in any configured remote, and if found asks the user if/where to\n   install it from. If it is not found, the install/update fails.\n\n   You can mark remotes as --no-use-for-deps, which means flatpak will\n   never search for runtime dependencies in such remotes. This makes\n   the dependency search faster if you have app-only remotes.\n   It is recommended that app-only .flatpakrepo file define this\n   by specifying NoDeps=true.\n\n * remote-add and install --from now supports uris\n\n   This means you can install flatpakrefs and flatpakrepos in a\n   single command like so:\n\n    * flatpak remote-add --from gnome https://sdk.gnome.org/gnome.flatpakrepo\n    * flatpak install --from https://sdk.gnome.org/gedit.flatpakref\n\n * flatpak run can now launch a runtime directly\n\n   For example, \"flatpak run org.gnome.Platform//3.22\" will launch a shell\n   inside a sandboxy with the gnome 3.22 runtime and an empty /app.\n   This is useful for development and testing.\n\n * included bubblewrap was bumped to 0.1.3 which has a security fix\n * Support for defining the default branch per remote\n * remote-add/modify: --update-metadata pulls current title and default branch\n   from remote summary file\n * Applications can now list a set of URIs that will be downloaded with the\n   application. The app can then extract these and use as a part of the\n   application data. This is useful for applications using freely downloadable\n   parts that can't be redistributed elsewhere.\n * flatpak-builder: Support --finish-only and --allow-missing-runtimes\n * flatpak-builder: Support app layering\n\n   An app can define a \"base\" application which is used for the initial\n   content before the application is built. This way applications can\n   be built in a layered fashion.\n\n * dbus proxy: The filtering has been tightened up\n * build-finish: Now exports icons for themes other than hicolor too\n * There is support in the app metadata for generic policies.\n\n   These are read and propagated and supports overriding, but are\n   not otherwise interpreted by flatpak. They can be used by other\n   host services as static permissions for the application.\n\n * Support for extensions directories\n\n   In addition to using flatpak maintained runtime as an extensions\n   flatpak can now use raw directories in ~/.local/share/flatpak/extension\n   and /var/lib/flatpak/extension. For example, if you create a\n   directory called org.freedesktop.Platform.GStreamer.MyPlugins/x86_64/1.4\n   there it will be used as a source for gstreamer plugins for all\n   runtimes based on the freedesktop 1.4 runtime.\n\nMajor changes in 0.6.12\n=======================\n * Partial revert in application id rules. Application ids\n   can now only have dashes in the last element. This allows\n   apps to export files such as org.my.App-extra.desktop which\n   was used by the libreoffice builds.\n * By default the kernel keyring is not accessible, as it is\n   not containable.\n * Some robustness fixes for build-commit-from\n * Better error messages\n * flatpak update --appstream now updates for all remotes\n * Made flatpak enter work, and you can now use any pid in the sandbox.\n   However, it requires root permissions.\n * Support for --device=kvm for /dev/kvm access\n * Support for --allow=multiarch to support non-primary arch support.\n   For example running i686 code in an x86_64 app.\n * Add new default-branch setting for the remote configuration\n\nMajor changes in 0.6.11\n=======================\n\n * Dashes are now allowed in application ids. However, to still work  with\n   symbolic icon names, they may not end with \"-symbolic\".\n * HostCommand now handles ptys correctly\n * Various documentation updates\n * New FLATPAK_CHECK_VERSION macro in libflatpak\n * HostCommand now returns the real PID rather than a fake one.\n * Fix regression in flatpak update --appstream\n * Fix regression installing bundles without origin urls\n * New flatpak-builder option --show-deps lists all the files\n   the manifest depends on.\n\nMajor changes in 0.6.10\n=======================\n\n * Dropped requirement for systemd --user.\n   The way we detect if an process we're talking to is sandboxed, and\n   what application id it has doesn't use cgroups anymore, which means\n   that the dependency on systemd in the user session is now optional.\n   This also means the --no-desktop argument is not needed any more.\n   (It is still accepted but does nothing.)\n * Initial support has been added for .flatpakref files. These are simple key\n   value files similar to .flatpakrepo files, however they specify an application\n   to install in addition to the repo information. For example, gedit can be\n   installed by downloading https://sdk.gnome.org/gedit.flatpakref and running:\n     flatpak install --from gedit.flatpakref\n   There is also library support for this so it can be added to graphical\n   installers (such as gnome-software).\n * Requires OSTree 2016.10. The change in how OSTree handles mtimes in\n   checkouts that was introduced in 2016.7 has been reverted, and\n   the required changes in Flatpak has been made. This means that\n   flatpak now depends on OSTree 2016.10.\n * Requires Bubblewrap 0.1.2 for builds using the system bubblewrap.\n   Builds using the included copy need no changes.\n * The $XDG_RUNTIME_DIR/flatpak-info file has added information\n   about the running application, and is now also securely available\n   for a running application from the host as \"/proc/$fd/root/.flatpak-info\".\n   This is what is used to identify remote apps instead of the cgroup\n   info.\n * A new run permission --allow=devel has been added. An application with\n   this permission is allowed to use ptrace and perf. This was previously\n   only available during \"flatpak build\" and \"flatpak run -d\". This\n   is useful if you're packaging e.g. an IDE.\n * When an application is updated or removed a /app/.updated or /app/.removed\n   file is created for running instances. This can be used by applications to\n   trigger e.g. a restart for the new version.\n * A new dbus request \"HostCommand\" has been added to org.freedesktop.Flatpak.\n   This lets you run any command on the host, and is therefore clearly not\n   sandboxed, so access to this should be limited. However, it is very useful\n   if you're using flatpak mainly as a distribution mechanism, for a non-sandboxed\n   application.\n * flatpak-builder now supports running from inside a flatpak, by auto-detecting\n   this and using the HostCommand service to run recursive flatpaks.\n * Consecutive calls to flatpak build-update-repo has been speed up.\n * The document portal now allows sandboxed applications to create references\n   to files in /app and /usr (in the app/runtime).\n * The update process noew doesn't stop at the first failure.\n\nMajor changes in 0.6.9\n======================\n\n * Dropped dependency on libgsystem\n * Allow passing partial refs whenever a CLI command takes\n   an app or runtime name.\n * New command build-commit-from creates a new commit based\n   on the contents of another commit (optionally from another\n   local repo).\n * The sandbox now contains $XDG_RUNTIME_DIR/app/$APPID from the\n   host (and the directory is created if needed).\n * update: Better output, and faster for the no updates case\n * build-export: Don't make most validation errors fail, instead\n   just print a warning.\n * builder: Support local path references for git sources\n * builder: Better handling of recursive git submodules\n * builder: Fixed issues with the .pyc mtime rewriting\n * builder: Handle symbolic icons for rename-icon\n * builder: Add --stop-at=$module to do partial builds\n * builder: Add --sandbox flag to disable the build from escaping\n   from the sandbox via build-args.\n\nMajor changes in 0.6.8\n======================\n\n * Requires OSTree 2016.7, allowing us to enable use of static delta\n   for system downloads again.\n * Support --no-desktop which allows you to run a flatpak app outside\n   a desktop, with some loss of functionality (for example, there\n   will be no systemd --user scope created for the app)..\n * More documentation.\n * Memory leak fixes.\n * Initial support for rpms as flatpak-builder archive sources.\n * Start work on translating the CLI.\n * Install systemd config snippet to set the right XDG_DATA_DIRS path.\n * Support --arch in flatpak list.\n * Support access() in the document portal.\n * Validate exported desktop files.\n\nMajor changes in 0.6.7\n======================\n\n * Automatically download and update related references such\n   as locales when using the CLI.\n * lib: Support for getting related references\n * Document metadata format\n * Support build using system-installed bwrap\n * Allow access to the journal socket in the sandbox\n * builder: Support applying patches with git (useful for binary diffs)\n * Require ostree 2016.6\n\nMajor changes in 0.6.6\n======================\n\n * Better support for multi-arch (for instance, will automatically install\n   i386-only app on x86_64 without user having to specify --arch).\n * Support --device=all to access the full host /dev\n * More command line support for managing exported documents\n * Extended API for the document portal: Lookup, Info, List\n * flatpak-builder: Support initializing /var from a runtime\n   extension.\n * Disable static deltas when updating via the system helper to\n   work around bug in ostree.\n\nMajor changes in 0.6.5\n======================\n\n * Documentation improvements\n * builder: Check that the specified command exists after build is done\n * builder: Fix up mtime in headers for python precompiled files\n * builder: Allow submodules and including modules from other json files\n * system-helper builds are optional (--disable-system-helper)\n * system-helper: Support installing from local remotes and bundles\n * Improved support for --subpath installs, including libflatpak support\n * Improved command line completion\n\nMajor changes in 0.6.4\n======================\n\n * Fix an issue where flatpak sometimes created empty \"repo\"\n   directories in the CWD\n\nMajor changes in 0.6.3\n======================\n\n * Fix resolv.conf regression in `flatpak build`\n * Fix LD_LIBRARY_PATH override support in `flatpak build`\n * Support forwarding app permissions in `flatpak-builder --run`\n * Flatpak is now smarter about the default branch to use in most operations\n * update will not fail on the first error if updating several things\n * New much more complete bash completion system\n * Faster installations\n * Support new keyfile format for remote-add --from=file\n\nMajor changes in 0.6.2\n======================\n\n * Fixed no-network support regression in setuid mode.\n * Fixed creation of root-owned file in home dir when using sudo in some cases\n * New --with-privileged-group configure option\n\nMajor changes in 0.6.1\n======================\n\n * Fixed support for systems without user namespaces (default for Arch) or\n   unprivileged support for user namespaces (default for Debian).\n * Fix memory leak during install/update.\n * update: Fix support for --arch.\n * Set the right location for the system directory in the environment.\n * system-helper: Support updating without deploying (needed for\n   gnome-software support).\n * lib: Fix support for updates\n\nMajor changes in 0.6.0\n======================\n\nRenamed from xdg-app to Flatpak.  Existing repositories should keep\nworking, and locally user installed apps/runtime will be migrated\nautomatically. However, there are some things that you have to be\naware of:\n * The command names are now flatpak/flatpak-builder\n * System-wide installed apps/runtimes need to be reinstalled\n * flatpak-builder uses a \".flatpak-builder\" subdirectory instead\n   of \".xdg-app-builder\".\n * The bus name and interface name for the permission\n   store is changed, it was in org.freedesktop.XdgApp, but is\n   now in org.freedesktop.impl.portal.DesktopPortal.\n * The installation migration is a one-time operation so you can't\n   go back to xdg-app after updating.\n * The library API (and name) changed due to the rename.\n\nOther changes:\n * Flatpak now hard-requires ostree 2016.5\n * Switch from using xdg-app-helper to an included version of bubblewrap:\n   https://github.com/projectatomic/bubblewrap\n * Added a policykit-based system helper that allows you to authenticate\n   via polkit to install into the system repository.\n * Added an experimental command to export/import applications and runtimes\n   as an OCI tarball.\n * builder: Fix creation of locale extensions if there was no locale data in the\n   build.\n * It is now possible to disable/enable configured remotes.\n * A lot of new tests where added, and we now support installed tests.\n * builder now has an optional --arch argument for multiarch building.\n * Builder modules can be disabled with \"disabled\": true.\n * Using --filesystem=/tmp now hides the system X11 sockets.\n\n\nMajor changes in 0.5.2\n======================\n\n* The way locale extensions work has changed. Now we build a single extension\n  for all locales, but we allow you to specify a subset of it during installation\n  and update time using the --subpath commandline flag.\n  The main reason for this is that the many extensions didn't scale, both in\n  technical terms (large ostree summary file size), but also in terms of the\n  UI listing hundreds of uninteresting things.\n* We no longer use sizes in the commit objects to get installed and download size,\n  instead we store some extra metadata in the summary file. This allows us\n  to get much faster access to these, as with recent ostree versions we can\n  cache the summary file.\n* New command xdg-app build-sign that lets you sign a commit at any time.\n* New argument xdg-app build --force-clean that removes pre-existing build dirs.\n* xdg-app run now uses the \"current\" version as the default if you specify no\n  branch or arch. It used to default to the \"master\" branch. This will default\n  to the last installed version, but can be changed with xdg-app make-current.\n* Added config-opts to the build-options in xdg-app-builder. This allows you\n  to extend the configure flags in an arch dependent way.\n* Documentation updates\n\nMajor changes in 0.5.1\n=======================\n* Make xdg-app-builder --build-only not export the results\n* Create all-in-one Locale extension that combines all the locale extensions\n* Extract icons for all appdata nodes when creating appstream\n* Documentation updates\n* Better handling of metadata in xdg-app-builder cache\n* Respect the specified branch when exporting in xdg-app-builder\n* Fix support for multi-arch with i386 userspace and 64bit kernel\n* Avoid deprecated 32bit capabilities syscalls\n\nMajor changes in 0.5.0\n=======================\n* Some libxdg-app API additions for handling bundles\n* Default to /bin/sh as user shell in sandbox\n* Fix detection of which apps are in use during uninstall\n* New implementation of fuse filesystem for document portal.\n  It is now cleaner and works on 32bit.\n* Honor the noenumerate flag on remotes in CLI and libxdg-app.\n* Add change notification for permissions store\n* Require signed summaries for gpg-signed remotes\n* Fix summary signatures of deltas in xdg-app build-update.\n\nMajor changes in 0.4.13\n=======================\n* Fix misgeneration of appdata xml in some cases\n* Various improvements to bundles, and support in libxdgapp\n* Add sources to Debug extensions created by xdg-app-builder\n* Allow specifying subdirs of xdg-* dirs, for instance:\n   --filesystem=xdg-download/some-dir\n* Add support for --filesystem=xdg-run/subdir which means\n  XDG_RUNTIME_DIR dir, rather than xdg-user-dirs.\n* Add --generate-static-deltas option to build-update-repo.\n\nMajor changes in 0.4.12\n=======================\n* Fix crashes.\n* Update exports when removing apps.\n* Remove appstream and repo refs when removing a remote.\n* Add some build options to make libxdg-app usable inside a sandbox.\n* xdg-app-builder builds are now in the .xdg-app-builder/build subdir.\n* Make system repo bare-user to avoid creating any setuid binaries.\n* Add xdg-app-builder --run operation that runs a command with the\n  build environment set up.\n* Support creating locale extensions with xdg-app-builder.\n* Add support for tags to metadata.\n* Put runtime info and tags in the appstream data\n\nMajor changes in 0.4.11\n=======================\n* Fix assertion when installing runtime\n\nMajor changes in 0.4.10\n=======================\n* App desktop files and icons were not being exported to the desktop\n\nMajor changes in 0.4.9\n======================\n* Fix crash at end of runtime install.\n* xdg-app-builder has a new source type \"shell\" which lets you run arbitrary\n  shell commands.\n* Allow apps with writable homedir access to modify the xdg-app repos.\n* New xdg-app info command gives you status of an installed app or runtime.\n* The xdg-app-builder cache now contains the sdk commit id, so that a new\n  version of the sdk invalidates the cache.\n* Fixed a regression in the xdg-app install-app backwards compatibility\n  handling.\n* xdg-app now gives the application access to the deployment path, which can\n  be used to give host-side services access to app files (such as help\n  documents).\n* build-export no longer exports appstream files, and when generating appstream\n  files we don't need them to be.\n* The default architecture tag used by xdg-app is now made canonical when needed\n  (i.e. on arm/x86/mips).\n\nMajor changes in 0.4.8\n======================\n* Changed global installation directory to /var/lib/xdg-app (not /var/xdg-app).\n* Add support for a dbus filtering on the system bus.\n* Choosing user namespaces or setuid is now a runtime option, not build time.\n* Fix xml-escaping in the appstream generation.\n* Various build fixes.\n* Added some more documentation for the library.\n* Disable support for running apps on systems without a systemd user session.\n* Fix uninitialized memory read in xdg-app-builder during git checkouts.\n* Correctly handle disabled git submodules in xdg-app-builder\n* Fix hiding of non-exported symbols in libxdgapp\n\nMajor changes in 0.4.7\n======================\n* Enabled build of libxdg-app by default, now the API is stable\n  enough for e.g. gnome-software to use it.\n* Restructured the command line interface to xdg-app, it is now\n  more streamlined and easy to use. For instance, to install\n  both apps or runtimes, now use \"xdg-app install $name\".\n  The old commands still work, but are deprecated and not\n  in the docs.\n* xdg-app-builder has gotten a bunch of new features that\n  makes it easier to build apps, and some initial work to\n  make it possible to create runtimes using it\n* build-export now finds and export any app-info installed by\n  the app, and build-update-repo collects all such exports\n  into a per-repo branch for appstream and icons.\n* The client (and libs) support for locally mirroring the appstream\n  branch for each remote. This allows use to create graphical appstores\n  with user-readable information and icons.\n* On the client side one can now specify priorities for each\n  remote.\n\nMajor changes in 0.4.6\n======================\n* Added an initial version of libxdg-app, a highlevel library\n  intended to be used by user interface frontends to xdg-app.\n  It is not yet API stable, so it is disabled by default.\n  Enable with --enable-libxdgapp\n* Added xdg-app-builder, a separate tool that makes it easier to build\n  applications with external dependencies.\n* Add support for single-file bundles, which can be a useful way\n  to distribute apps on e.g. a usb stick. Only works with the\n  latest version of ostree.\n* Always allow apps to talk to the built-in portals\n* Support granting read-only access to the filesystem with e.g. --filesystem=host:ro\n* Add /run/user/$uid/xdg-app-info file that contains the current permissions of the app\n* Add --writable-sdk option to xdg-app build-init\n* Add file locking to better handle concurrent xdg-app operations like update and install\n* Various fixes\n\nMajor changes in 0.4.5\n======================\n* Support signing commits in build-export\n* Correctly handle symlinks in host root when app has host-fs access\n* Always regenerate summary after build-export\n* Make uninstall a bit more robust\n* Install the dbus introspection files\n* Add human readable size to build-export report\n* Add /dev/ptmx symlink in app\n* Fix apps not getting SIGCHILD\n* Only expose minimal /etc/[passwd|group] in app\n\nMajor changes in 0.4.4\n======================\n* Fix race condition in fuse fs\n* Don't save uid/gid/xattrs in build-export\n* run: Handle existing mounts with spaces in them\n* propagate xauth cookies to sandbox\n\nMajor changes in 0.4.3\n======================\n* Build with older ostree\n* Add --nofilesystem flag to e.g. xdg-app run\n* Add xdg-app dump-runtime command\n\nMajor changes in 0.4.2.1\n======================\n* Fix dbus proxy\n\nMajor changes in 0.4.2\n======================\n* Fix build with older versions of glib\n* Fix regression in filesystem access configuration\n* Make seccomp use optional (for arches without it)\n* Add xdg-app enter command to enter a running sandbox\n* Fix /var/cache being readonly\n* Add /var/data and /var/config shortcuts for per-app data\n* Minor fixes to bash completion\n\nMajor changes in 0.4.1\n======================\n* Fixed a parallel build issue\n* Fixed a build issue where openat() didn't get a mode passed\n* Don't block ptrace and perf in debug and build runs\n* Put nvidia drivers in sandbox if DRI allowed\n* Support specifying a version for runtime extensions\n\nMajor changes in 0.4.0\n======================\n* A new permissions store was added to the dbus api.\n  This can be used by portal implementations that want to store\n  per-app permissions for objects.\n* The document portal was added. This is a dbus api\n  which you can use to create document ids and assign\n  apps permissions to see these documents. The documents\n  themselves are accessed via a custom fuse filesystem.\n* perf and strace are now blocked via the seccomp filters\n* You can now override application metadata on a system\n  and per-user level, giving apps more or less access\n  than what they request.\n* New command modify-remote added which lets you change\n  configuration of a remote after it has been added with\n  add-remote.\n* Support for adding trusted gpg keys on a per-remote basis\n  has been added to add-remote and modify-remote.\n* The repo-contents command has been renamed to ls-remote\n  to better match the other commands.\n* The list-remotes command can now show more information\n  about the remotes.\n* The bash completion implementation has been improved.\n\nMajor changes in 0.3.6\n======================\n\n* Fix a typo in the socket seccomp rules that made ipv6 not work\n* Export the users fonts (~/.local/share/fonts or ~/.fonts) in the sandbox\n* Fix seccomp rules to work on i386\n* Make exposing xdg user dirs work right\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.9287109375,
          "content": "<p align=\"center\">\n  <img src=\"https://github.com/flatpak/flatpak/blob/main/flatpak.png?raw=true\" alt=\"Flatpak icon\"/>\n</p>\n\nFlatpak is a system for building, distributing, and running sandboxed\ndesktop applications on Linux.\n\nSee https://flatpak.org/ for more information.\n\nFlatpak is available in the package repositories of most Linux distributions\nand can be installed from there. See https://flatpak.org/setup/ for quick\nsetup instructions for many distributions.\n\nCommunity discussion happens in [#flatpak:matrix.org](https://matrix.to/#/#flatpak:matrix.org), on [the mailing list](https://lists.freedesktop.org/mailman/listinfo/flatpak), and on [the Flathub Discourse](https://discourse.flathub.org/).\n\nRead documentation for Flatpak [here](https://docs.flatpak.org/en/latest/index.html).\n\n# Contributing\n\nFlatpak welcomes contributions from anyone! Here are some ways you can help:\n* Fix [one of the issues](https://github.com/flatpak/flatpak/issues/) and submit a PR\n* Update flatpak's translations and submit a PR\n* Improve flatpak's documentation, hosted at http://docs.flatpak.org and developed over in [flatpak-docs](https://github.com/flatpak/flatpak-docs)\n* Find a bug and [submit a detailed report](https://github.com/flatpak/flatpak/issues/new) including your OS, flatpak version, and the steps to reproduce\n* Add your favorite application to [Flathub](https://flathub.org) by writing a flatpak-builder manifest and [submitting it](https://github.com/flathub/flathub/wiki/App-Submission)\n* Improve the [Flatpak support](https://github.com/flatpak/flatpak/wiki/Distribution) in your favorite Linux distribution\n\n# Hacking\nSee [CONTRIBUTING.md](CONTRIBUTING.md)\n\n# Related Projects\n\nHere are some notable projects in the Flatpak ecosystem:\n* [Flatseal](https://github.com/tchx84/flatseal): An app for managing permissions of Flatpak apps without using the CLI\n* [Flat-manager](https://github.com/flatpak/flat-manager): A tool for managing Flatpak repositories\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 2.0048828125,
          "content": "# Security policy for Flatpak\n\n * [Supported Versions](#Supported-Versions)\n * [Reporting a Vulnerability](#Reporting-a-Vulnerability)\n * [Security Announcements](#Security-Announcements)\n * [Acknowledgements](#Acknowledgements)\n\n## Supported Versions\n\nIn stable branches and released packages, this table is likely to be outdated;\nplease check\n[the latest version](https://github.com/flatpak/flatpak/blob/main/SECURITY.md).\n\n| Version  | Supported          | Status\n| -------- | ------------------ | -------------------------------------------------------------- |\n| 1.15.x   | :hammer:           | Development branch, releases may include non-security changes  |\n| 1.14.x   | :white_check_mark: | Stable branch, recommended for use in distributions            |\n| ≤ 1.13.x | :x:                | Older branches, no longer supported                            |\n\nThe latest stable branch (currently 1.14.x) is the highest priority for\nsecurity fixes.\nIf a security vulnerability is reported under embargo, having new releases\nfor older stable branches will not always be treated as a blocker for\nlifting the embargo.\n\n## Reporting a Vulnerability\n\nIf you think you've identified a security issue in Flatpak, please DO NOT\nreport the issue publicly via the GitHub issue tracker, mailing list,\nMatrix, IRC or any other public medium. Instead, send an email with as\nmany details as possible to\n[flatpak-security@lists.freedesktop.org](mailto:flatpak-security@lists.freedesktop.org).\nThis is a private mailing list for the Flatpak maintainers.\n\nPlease do **not** create a public issue.\n\n## Security Announcements\n\nThe [flatpak@lists.freedesktop.org](mailto:flatpak@lists.freedesktop.org) email list is used for messages about\nFlatpak security announcements, as well as general announcements and\ndiscussions.\nYou can join the list [here](https://lists.freedesktop.org/mailman/listinfo/flatpak).\n\n## Acknowledgements\n\nThis text was partially based on the [github.com/containers security policy](https://github.com/containers/common/blob/main/SECURITY.md).\n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "buildutil",
          "type": "tree",
          "content": null
        },
        {
          "name": "common",
          "type": "tree",
          "content": null
        },
        {
          "name": "completion",
          "type": "tree",
          "content": null
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "env.d",
          "type": "tree",
          "content": null
        },
        {
          "name": "flatpak.png",
          "type": "blob",
          "size": 5.0322265625,
          "content": null
        },
        {
          "name": "icon-validator",
          "type": "tree",
          "content": null
        },
        {
          "name": "meson.build",
          "type": "blob",
          "size": 15.5224609375,
          "content": "# Copyright 2022 Collabora Ltd.\n# SPDX-License-Identifier: LGPL-2.1-or-later\n\nproject(\n  'flatpak',\n  'c',\n  version : '1.16.1',\n  default_options: [\n    'warning_level=2',\n  ],\n  meson_version : '>=0.53.0',\n)\n\nflatpak_major_version = 1\nflatpak_minor_version = 16\nflatpak_micro_version = 1\nflatpak_extra_version = ''\n\nflatpak_interface_age = 0\nflatpak_binary_age = (\n  10000 * flatpak_major_version\n  + 100 * flatpak_minor_version\n  + flatpak_micro_version\n)\n\nif '@0@.@1@.@2@@3@'.format(\n  flatpak_major_version,\n  flatpak_minor_version,\n  flatpak_micro_version,\n  flatpak_extra_version,\n) != meson.project_version()\n  error('Project version does not match parts')\nendif\n\nrequired_glib = '2.46'\n# Before increasing this, update subprojects/bubblewrap.wrap\nrequired_bwrap = '0.10.0'\n# Before increasing this, update subprojects/dbus-proxy.wrap\nrequired_dbus_proxy = '0.1.0'\nrequired_libostree = '2020.8'\n\nfs = import('fs')\ngnome = import('gnome')\ni18n = import('i18n')\npkgconfig = import('pkgconfig')\n\n# TODO: We can replace these with meson.project_foo_root()\n# when we depend on meson 0.56\nproject_build_root = meson.current_build_dir()\nproject_source_root = meson.current_source_dir()\n\nif meson.version().version_compare('>=0.58')\n  global_source_root = meson.global_source_root()\nelse\n  global_source_root = meson.source_root()\nendif\n\nif meson.version().version_compare('>=0.55.0')\n  can_run_host_binaries = meson.can_run_host_binaries()\nelse\n  can_run_host_binaries = meson.has_exe_wrapper() or not meson.is_cross_build()\nendif\n\ncc = meson.get_compiler('c')\nadd_project_arguments('-include', 'config.h', language : 'c')\ncommon_include_directories = include_directories(\n  '.',\n  'common',\n)\n\n# Keep this in sync with ostree, except remove -Wall (part of Meson\n# warning_level 2) and -Werror=declaration-after-statement\nadd_project_arguments(\n  cc.get_supported_arguments([\n    '-Werror=shadow',\n    '-Werror=empty-body',\n    '-Werror=strict-prototypes',\n    '-Werror=missing-prototypes',\n    '-Werror=implicit-function-declaration',\n    '-Werror=pointer-arith',\n    '-Werror=init-self',\n    '-Werror=missing-declarations',\n    '-Werror=return-type',\n    '-Werror=overflow',\n    '-Werror=int-conversion',\n    '-Werror=parenthesis',\n    '-Werror=incompatible-pointer-types',\n    '-Werror=misleading-indentation',\n    '-Werror=missing-include-dirs',\n\n    # Meson warning_level=2 would do this, but we are not fully\n    # signedness-safe yet\n    '-Wno-sign-compare',\n    '-Wno-error=sign-compare',\n\n    # Meson warning_level=2 would do this\n    '-Wno-cast-function-type',\n    '-Wno-error=cast-function-type',\n\n    # Deliberately not warning about these, ability to zero-initialize\n    # a struct is a feature\n    '-Wno-missing-field-initializers',\n    '-Wno-error=missing-field-initializers',\n\n    # Deliberately not warning about these\n    '-Wno-unused-parameter',\n    '-Wno-error=unused-parameter',\n  ]),\n  language : 'c',\n)\n# Flatpak is Linux-specific, so for now we assume that -fvisibility=hidden\n# is always supported\nadd_project_arguments('-fvisibility=hidden', language : 'c')\n\nif (\n  cc.has_argument('-Werror=format=2')\n  and cc.has_argument('-Werror=format-security')\n  and cc.has_argument('-Werror=format-nonliteral')\n)\n  add_project_arguments([\n    '-Werror=format=2',\n    '-Werror=format-security',\n    '-Werror=format-nonliteral',\n  ], language : 'c')\nendif\n\ndbus_config_dir = get_option('dbus_config_dir')\nif dbus_config_dir == ''\n  dbus_config_dir = get_option('sysconfdir') / 'dbus-1' / 'system.d'\nendif\n\ndbus_service_dir = get_option('dbus_service_dir')\nif dbus_service_dir == ''\n  dbus_service_dir = get_option('datadir') / 'dbus-1' / 'services'\nendif\n\nprofile_dir = get_option('profile_dir')\nif profile_dir == ''\n  profile_dir = get_option('sysconfdir') / 'profile.d'\nendif\n\nsystem_install_dir = get_option('system_install_dir')\nif system_install_dir == ''\n  system_install_dir = get_option('localstatedir') / 'lib' / 'flatpak'\nendif\n\ndocdir = get_option('docdir')\nif docdir == ''\n  docdir = get_option('datadir') / 'doc' / 'flatpak'\nendif\n\nif not cc.check_header('sys/xattr.h')\n  error('You must have sys/xattr.h from glibc')\nendif\n\nlibglnx = subproject(\n  'libglnx',\n  default_options : [\n    'warning_level=1',\n    'tests=false',\n  ],\n)\n\nnot_found = dependency('', required : false)\nthreads_dep = dependency('threads')\nbison = find_program('bison')\nlibcap_dep = dependency('libcap')\nlibglnx_dep = libglnx.get_variable('libglnx_dep')\nlibglnx_testlib_dep = libglnx.get_variable('libglnx_testlib_dep')\nlibarchive_dep = dependency('libarchive', version : '>=2.8.0')\nglib_dep = dependency('glib-2.0', version : '>=' + required_glib)\ngio_dep = dependency('gio-2.0', version : '>=' + required_glib)\ngio_unix_dep = dependency('gio-unix-2.0', version : '>=' + required_glib)\n\nlibcurl_dep = not_found\nlibsoup_dep = not_found\n\nif get_option('http_backend') == 'soup'\n  libsoup_dep = dependency('libsoup-2.4')\nelse\n  libcurl_dep = dependency('libcurl', version : '>=7.29.0')\nendif\n\nlibxml_dep = dependency('libxml-2.0', version : '>=2.4')\nlibzstd_dep = dependency('libzstd', version : '>=0.8.1', required : get_option('libzstd'))\ndconf_dep = dependency('dconf', version : '>=0.26', required : get_option('dconf'))\nlibsystemd_dep = dependency('libsystemd', required : get_option('systemd'))\nmalcontent_dep = dependency('malcontent-0', version : '>=0.5.0', required : get_option('malcontent'))\npolkit_agent_dep = dependency('polkit-agent-1', version : '>=0.98', required : get_option('system_helper'))\nbuild_system_helper = polkit_agent_dep.found()\n\nfuse_dep = dependency('fuse3', version : '>=3.1.1', required : false)\nif fuse_dep.found()\n  fuse_api = 31\nelse\n  fuse_dep = dependency('fuse', version : '>=2.9.2')\n  fuse_api = 26\nendif\n\nfusermount = get_option('system_fusermount')\nif fusermount == ''\n  if fuse_api >= 30\n    fusermount_program = find_program('fusermount3', required: true)\n  else\n    fusermount_program = find_program('fusermount', required: true)\n  endif\n  if meson.version().version_compare('>=0.55')\n    fusermount = fusermount_program.full_path()\n  else\n    fusermount = fusermount_program.path()\n  endif\nendif\n\nxau_dep = dependency('xau', required : get_option('xauth'))\nlibostree_dep = dependency('ostree-1', version : '>=' + required_libostree)\njson_glib_dep = dependency('json-glib-1.0')\nappstream_dep = dependency('appstream', version : '>=0.12.0')\ngdk_pixbuf_dep = dependency('gdk-pixbuf-2.0')\nlibseccomp_dep = dependency('libseccomp', required : get_option('seccomp'))\ngir_dep = dependency('gobject-introspection-1.0', version : '>=1.40.0', required : get_option('gir'))\ngtkdoc_dep = dependency('gtk-doc', required : get_option('gtkdoc'), native : true)\nbuild_gtk_doc = gtkdoc_dep.found()\n\nwayland_client = dependency('wayland-client', required : get_option('wayland_security_context'))\nwayland_scanner = dependency('wayland-scanner', version : '>= 1.15', required : get_option('wayland_security_context'), native : true)\nwayland_protocols = dependency('wayland-protocols', version : '>= 1.32', required : get_option('wayland_security_context'))\nbuild_wayland_security_context = wayland_client.found() and wayland_scanner.found() and wayland_protocols.found()\n\nbase_deps = [glib_dep, gio_dep, gio_unix_dep]\n\ngpgme_dep = dependency('gpgme', version : '>=1.8.0')\n\nif get_option('selinux_module').disabled()\n  build_selinux_module = false\nelse\n  build_selinux_module = fs.is_file('/usr/share/selinux/devel/Makefile')\n\n  if get_option('selinux_module').enabled() and not build_selinux_module\n    error('selinux-policy-devel needed to build selinux module')\n  endif\nendif\n\nmanpages_xsl = 'http://docbook.sourceforge.net/release/xsl/current/manpages/docbook.xsl'\nxsltproc = find_program('xsltproc', required : get_option('man'))\nbuild_man_pages = false\n\nif xsltproc.found()\n  if run_command([\n    xsltproc, '--nonet', manpages_xsl,\n  ], check : false).returncode() == 0\n    message('Docbook XSL found')\n    build_man_pages = true\n  elif get_option('man').enabled()\n    error('Man page requested, but Docbook XSL stylesheets not found')\n  else\n    message('Docbook XSL not found, man page disabled automatically')\n  endif\nendif\n\nxmlto = find_program('xmlto', required : get_option('docbook_docs'))\n\nif run_command(\n  'python3', '-c', 'import pyparsing',\n  check : false\n).returncode() != 0\n  error('python3 \"pyparsing\" module is required')\nendif\n\nforeach system_executable : [\n  ['bubblewrap', required_bwrap, 'system_bubblewrap'],\n  ['xdg-dbus-proxy', required_dbus_proxy, 'system_dbus_proxy'],\n]\n  name = system_executable[0]\n  required = system_executable[1]\n  option_name = system_executable[2]\n  value = get_option(option_name)\n\n  if value != ''\n    version = ''\n\n    if can_run_host_binaries\n      result = run_command(\n        value, '--version',\n        capture : true,\n        check : true,\n      )\n      output = result.stdout()\n\n      if output.startswith(name + ' ')\n        version = output.split()[1]\n      endif\n    endif\n\n    if version == ''\n      # Cross-compiling, or unable to parse --version output\n      warning(\n        'Unable to determine version of @0@ (@1@), please ensure it is >= @2@'.format(\n          name, value, required,\n        )\n      )\n    elif version.version_compare('<' + required)\n      error(\n        '@0@ must be version >= @1@ (found: @2@)'.format(\n          option_name, required, version,\n        )\n      )\n    endif\n  endif\nendforeach\n\n# We don't actually need this, but we do need the polkit daemon itself,\n# and they're generally packaged together.\nfind_program('pkcheck', required : get_option('tests'))\n\nfind_program('socat', required : get_option('tests'))\n\nif get_option('installed_tests') and not get_option('tests')\n  error('-Dinstalled_tests=true is incompatible with -Dtests=false')\nendif\n\ncdata = configuration_data()\ncdata.set('_GNU_SOURCE', 1)\ncdata.set('FLATPAK_COMPILATION', 1)\ncdata.set('PACKAGE_MAJOR_VERSION', flatpak_major_version)\ncdata.set('PACKAGE_MINOR_VERSION', flatpak_minor_version)\ncdata.set('PACKAGE_MICRO_VERSION', flatpak_micro_version)\ncdata.set('PACKAGE_EXTRA_VERSION', flatpak_extra_version)\ncdata.set_quoted(\n  'PACKAGE_STRING',\n  'Flatpak @0@'.format(meson.project_version()),\n)\ncdata.set_quoted('PACKAGE_VERSION', meson.project_version())\ncdata.set_quoted(\n  'FLATPAK_BINDIR',\n  get_option('prefix') / get_option('bindir'),\n)\ncdata.set_quoted(\n  'FLATPAK_SYSTEMDIR',\n  get_option('prefix') / system_install_dir,\n)\ncdata.set_quoted(\n  'FLATPAK_CONFIGDIR',\n  get_option('prefix') / get_option('sysconfdir') / 'flatpak',\n)\ncdata.set_quoted(\n  'FLATPAK_DATADIR',\n  get_option('prefix') / get_option('datadir') / 'flatpak',\n)\ncdata.set_quoted('LIBEXECDIR', get_option('prefix') / get_option('libexecdir'))\ncdata.set_quoted('DATADIR', get_option('prefix') / get_option('datadir'))\ncdata.set_quoted('LOCALEDIR', get_option('prefix') / get_option('localedir'))\ncdata.set_quoted('SYSTEM_FONTS_DIR', get_option('system_fonts_dir'))\ncdata.set_quoted('SYSTEM_HELPER_USER', get_option('system_helper_user'))\ncdata.set_quoted(\n  'SYSTEM_FONT_CACHE_DIRS',\n  ':'.join(get_option('system_font_cache_dirs')),\n)\ncdata.set_quoted('G_LOG_DOMAIN', 'flatpak')\ncdata.set_quoted('GETTEXT_PACKAGE', 'flatpak')\ncdata.set('FUSE_USE_VERSION', fuse_api)\ncdata.set_quoted('FUSERMOUNT', fusermount)\n\nif get_option('system_bubblewrap') == ''\n  cdata.set_quoted('HELPER', get_option('prefix') / get_option('libexecdir') / 'flatpak-bwrap')\nelse\n  cdata.set_quoted('HELPER', get_option('system_bubblewrap'))\nendif\n\nif get_option('system_dbus_proxy') == ''\n  cdata.set_quoted('DBUSPROXY', get_option('prefix') / get_option('libexecdir') / 'flatpak-dbus-proxy')\nelse\n  cdata.set_quoted('DBUSPROXY', get_option('system_dbus_proxy'))\nendif\n\n# Flatpak is Linux-specific, so we assume this is always supported\ncdata.set('FLATPAK_EXTERN', '__attribute__((visibility(\"default\"))) extern')\n\nif glib_dep.version().version_compare('>=2.60')\n  # Ignore massive GTimeVal deprecation warnings in 2.62\n  cdata.set('GLIB_VERSION_MIN_REQUIRED', 'GLIB_VERSION_2_60')\nendif\n\nif dconf_dep.found()\n  cdata.set('HAVE_DCONF', 1)\nendif\n\nif libcurl_dep.found()\n  cdata.set('HAVE_CURL', 1)\nendif\n\nif libseccomp_dep.found()\n  cdata.set('ENABLE_SECCOMP', 1)\nendif\n\nif libsoup_dep.found()\n  cdata.set('HAVE_SOUP', 1)\nendif\n\nif libsystemd_dep.found()\n  cdata.set('HAVE_LIBSYSTEMD', 1)\nendif\n\nif libzstd_dep.found()\n  cdata.set('HAVE_ZSTD', 1)\nendif\n\nif malcontent_dep.found()\n  cdata.set('HAVE_LIBMALCONTENT', 1)\nendif\n\nif xau_dep.found()\n  cdata.set('ENABLE_XAUTH', 1)\nendif\n\nif build_wayland_security_context\n  cdata.set('ENABLE_WAYLAND_SECURITY_CONTEXT', 1)\nendif\n\nif not get_option('sandboxed_triggers')\n  cdata.set('DISABLE_SANDBOXED_TRIGGERS', 1)\nendif\n\nif cc.has_function(\n  'archive_read_support_filter_all',\n  dependencies : libarchive_dep,\n  prefix : '#include <archive.h>',\n)\n  cdata.set('HAVE_ARCHIVE_READ_SUPPORT_FILTER_ALL', 1)\nendif\n\nif build_system_helper\n  cdata.set('USE_SYSTEM_HELPER', '1')\nendif\n\nconfigure_file(\n  output : 'config.h',\n  configuration : cdata,\n)\n\n# TODO: When we depend on Meson >= 0.57.0, we can print dependencies\n# as themselves rather than as booleans if we want to.\nsummary(\n  {\n    'Build system helper' : build_system_helper,\n    'Build selinux module' : build_selinux_module,\n    'Build bubblewrap' : (get_option('system_bubblewrap') == ''),\n    'Build dbus-proxy' : (get_option('system_dbus_proxy') == ''),\n    'fusermount executable' : fusermount,\n    'Use sandboxed triggers' : get_option('sandboxed_triggers'),\n    'Use seccomp' : libseccomp_dep.found(),\n    'Privileged group' : get_option('privileged_group'),\n    'Use dconf' : dconf_dep.found(),\n    'Use libsystemd' : libsystemd_dep.found(),\n    'Use libmalcontent' : malcontent_dep.found(),\n    'Use libzstd' : libzstd_dep.found(),\n    'Use auto sideloading' : get_option('auto_sideloading'),\n    'Wayland security context' : build_wayland_security_context,\n  },\n  bool_yn : true,\n)\n\nif get_option('system_bubblewrap') == ''\n  subproject(\n    'bubblewrap',\n    default_options : [\n      'program_prefix=flatpak-',\n      'tests=false',\n    ],\n  )\nendif\n\nif get_option('system_dbus_proxy') == ''\n  subproject(\n    'dbus-proxy',\n    default_options : [\n      'warning_level=1',\n      'program_prefix=flatpak-',\n      'tests=false',\n    ],\n  )\nendif\n\n# Used for .service files in multiple subdirectories\nservice_conf_data = configuration_data()\nservice_conf_data.set('libexecdir', get_option('prefix') / get_option('libexecdir'))\nservice_conf_data.set('localstatedir', get_option('prefix') / get_option('localstatedir'))\nservice_conf_data.set('media_dir', get_option('prefix') / get_option('run_media_dir'))\nservice_conf_data.set('extraargs', '')\n\nsubdir('common')\nsubdir('data')\n\nsubdir('app')\nsubdir('env.d')\nsubdir('profile')\nsubdir('icon-validator')\nsubdir('oci-authenticator')\nsubdir('portal')\nsubdir('revokefs')\nsubdir('session-helper')\nsubdir('scripts')\n\nsubdir('completion')\nsubdir('doc')\nsubdir('po')\nsubdir('triggers')\n\nif get_option('auto_sideloading')\n  subdir('sideload-repos-systemd')\nendif\n\nif build_selinux_module\n  subdir('selinux')\nendif\n\nif build_system_helper\n  subdir('system-helper')\nendif\n\nif get_option('tests')\n  subdir('tests')\nendif\n\npkgconfig_variables = []\n\n# TODO: These can be dropped when we require Meson >= 0.62.0\npkgconfig_variables += 'exec_prefix=${prefix}'\npkgconfig_variables += 'datadir=' + ('${prefix}' / get_option('datadir'))\n\npkgconfig_variables += 'datarootdir=' + ('${prefix}' / get_option('datadir'))\npkgconfig_variables += 'interfaces_dir=${datadir}/dbus-1/interfaces/'\npkgconfig_variables += 'httpbackend=' + get_option('http_backend')\n\npkgconfig.generate(\n  libflatpak,\n  description : 'Application sandboxing framework',\n  subdirs : 'flatpak',\n  requires : [\n    'glib-2.0',\n    'gio-2.0',\n    'ostree-1',\n  ],\n  requires_private : [\n    'gio-unix-2.0',\n  ],\n  variables : pkgconfig_variables,\n)\n"
        },
        {
          "name": "meson_options.txt",
          "type": "blob",
          "size": 5.265625,
          "content": "# Copyright 2022 Collabora Ltd.\n# SPDX-License-Identifier: LGPL-2.1-or-later\n\noption(\n  'auto_sideloading',\n  type : 'boolean',\n  description : 'enable systemd units which make Flatpak sideload from inserted USB drives',\n  value : false,\n)\noption(\n  'dconf',\n  type : 'feature',\n  description : 'Use dconf?',\n  value : 'auto',\n)\noption(\n  'dbus_config_dir',\n  type : 'string',\n  description : 'directory for D-Bus system configuration [$sysconfdir/dbus-1/system.d]',\n  value : '',\n)\noption(\n  'dbus_service_dir',\n  type : 'string',\n  description : 'directory for D-Bus session service files [$datadir/dbus-1/services]',\n  value : '',\n)\noption(\n  'docbook_docs',\n  type : 'feature',\n  description : 'build documentation with xmlto',\n  value : 'auto',\n)\noption(\n  'docdir',\n  type : 'string',\n  description : 'documentation directory [$datadir/doc/flatpak]',\n  value : '',\n)\noption(\n  'gdm_env_file',\n  type : 'boolean',\n  description : 'install gdm env.d file (not needed if systemd generators work',\n  value : false,\n)\noption(\n  'gir',\n  type : 'feature',\n  description : 'build GObject-Introspection metadata',\n  value : 'auto',\n)\noption(\n  'gtkdoc',\n  type : 'feature',\n  description : 'build API reference documentation with gtk-doc',\n  value : 'auto',\n)\noption(\n  'http_backend',\n  type : 'combo',\n  description : 'library used to implement HTTP',\n  choices : ['curl', 'soup'],\n  value : 'curl',\n)\noption(\n  'installed_tests',\n  type : 'boolean',\n  description : 'install automated tests',\n  value : false,\n)\noption(\n  'internal_checks',\n  type : 'boolean',\n  description : 'enable internal checking',\n  value : false,\n)\noption(\n  'libzstd',\n  type : 'feature',\n  description : 'use libzstd?',\n  value : 'auto',\n)\noption(\n  'malcontent',\n  type : 'feature',\n  description : 'use libmalcontent for parental controls?',\n  value : 'auto',\n)\noption(\n  'man',\n  type : 'feature',\n  description : 'build man pages',\n  value : 'auto',\n)\noption(\n  'privileged_group',\n  type : 'string',\n  description : 'name of root-equivalent group',\n  value : 'wheel',\n)\noption(\n  'profile_dir',\n  type : 'string',\n  description : 'directory for profile.d files',\n  value : '',\n)\noption(\n  'run_media_dir',\n  type : 'string',\n  description : 'location of auto-mounted USB drives]',\n  value : '/run/media',\n)\noption(\n  'sandboxed_triggers',\n  type : 'boolean',\n  description : 'enable sandboxed triggers',\n  value : true,\n)\noption(\n  'seccomp',\n  type : 'feature',\n  description : 'enable seccomp',\n  value : 'enabled',\n)\noption(\n  'selinux_module',\n  type : 'feature',\n  description : 'enable selinux module for system-helper',\n  value : 'auto',\n)\noption(\n  'system_bubblewrap',\n  type : 'string',\n  description : 'system bwrap executable, or empty string to build subproject',\n  value : '',\n)\noption(\n  'system_dbus_proxy',\n  type : 'string',\n  description : 'system xdg-dbus-proxy executable, or empty string to build subproject',\n  value : '',\n)\noption(\n  'system_fusermount',\n  type : 'string',\n  description : 'system fusermount executable, or empty string to auto-select based on fuse version',\n  value : '',\n)\noption(\n  'system_font_cache_dirs',\n  type : 'array',\n  description : 'directory where the system font cache is',\n  value : ['/var/cache/fontconfig', '/usr/lib/fontconfig/cache'],\n)\noption(\n  'system_fonts_dir',\n  type : 'string',\n  description : 'Directory where system fonts are',\n  value : '/usr/share/fonts',\n)\noption(\n  'system_helper',\n  type : 'feature',\n  description : 'enable system helper',\n  value : 'enabled',\n)\noption(\n  'system_helper_user',\n  type : 'string',\n  description : 'name of the system helper user',\n  value : 'flatpak',\n)\noption(\n  'system_install_dir',\n  type : 'string',\n  description : 'location of system installation [$localstatedir/lib/flatpak]',\n  value : '',\n)\noption(\n  'systemdsystemenvgendir',\n  type : 'string',\n  description : 'directory for systemd system environment generators',\n  value : 'lib/systemd/system-environment-generators',\n)\noption(\n  'systemd',\n  type : 'feature',\n  description : 'build with systemd support',\n  value : 'auto',\n)\noption(\n  'systemdsystemunitdir',\n  type : 'string',\n  description : 'directory for systemd system service files',\n  # deliberately lib and not based on get_option('libdir'):\n  # this should not be lib64 or lib/x86_64-linux-gnu\n  value : 'lib/systemd/system',\n)\noption(\n  'systemduserenvgendir',\n  type : 'string',\n  description : 'directory for systemd user environment generators',\n  value : 'lib/systemd/user-environment-generators',\n)\noption(\n  'systemduserunitdir',\n  type : 'string',\n  description : 'directory for systemd user service files',\n  value : 'lib/systemd/user',\n)\noption(\n  'sysusersdir',\n  type : 'string',\n  description : 'directory for systemd sysusers.d configuration files',\n  value : 'lib/sysusers.d'\n)\noption(\n  'tmpfilesdir',\n  type : 'string',\n  description : 'directory for systemd tmpfiles.d configuration files',\n  value : 'lib/tmpfiles.d'\n)\noption(\n  'tests',\n  type : 'boolean',\n  description : 'build tests',\n  value : true,\n)\noption(\n  'xauth',\n  type : 'feature',\n  description : 'enable Xauth use',\n  value : 'enabled',\n)\noption(\n  'wayland_security_context',\n  type : 'feature',\n  description : 'enable wayland security-context protocol support',\n  value : 'auto',\n)\noption(\n  'xmlto_flags',\n  type : 'array',\n  description : 'options to pass to xmlto',\n  value : [],\n)\n"
        },
        {
          "name": "oci-authenticator",
          "type": "tree",
          "content": null
        },
        {
          "name": "po",
          "type": "tree",
          "content": null
        },
        {
          "name": "portal",
          "type": "tree",
          "content": null
        },
        {
          "name": "profile",
          "type": "tree",
          "content": null
        },
        {
          "name": "revokefs",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "selinux",
          "type": "tree",
          "content": null
        },
        {
          "name": "session-helper",
          "type": "tree",
          "content": null
        },
        {
          "name": "sideload-repos-systemd",
          "type": "tree",
          "content": null
        },
        {
          "name": "subprojects",
          "type": "tree",
          "content": null
        },
        {
          "name": "system-helper",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        },
        {
          "name": "tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "triggers",
          "type": "tree",
          "content": null
        },
        {
          "name": "uncrustify.cfg",
          "type": "blob",
          "size": 4.416015625,
          "content": "newlines                lf\n\ninput_tab_size          8\noutput_tab_size         8\n\nstring_escape_char      92\nstring_escape_char2     0\n\n# indenting\nindent_columns          2\nindent_with_tabs        0\nindent_align_string     True\nindent_brace            2\nindent_braces           false\nindent_braces_no_func   True\nindent_func_call_param  false\nindent_func_def_param   false\nindent_func_proto_param false\nindent_switch_case      0\nindent_case_brace       2\nindent_paren_close      1\n\n# spacing\nsp_arith                        Add\nsp_assign                       Add\nsp_enum_assign                  Add\nsp_bool                         Add\nsp_compare                      Add\nsp_inside_paren                 Remove\nsp_inside_fparens               Remove\nsp_func_def_paren               Force\nsp_func_proto_paren             Force\nsp_paren_paren                  Remove\nsp_balance_nested_parens        False\nsp_paren_brace                  Remove\nsp_before_square                Remove\nsp_before_squares               Remove\nsp_inside_square                Remove\nsp_before_ptr_star              Add\nsp_between_ptr_star             Remove\nsp_after_comma                  Add\nsp_before_comma                 Remove\nsp_after_cast                   Add\nsp_sizeof_paren                 Add\nsp_not                          Remove\nsp_inv                          Remove\nsp_addr                         Remove\nsp_member                       Remove\nsp_deref                        Remove\nsp_sign                         Remove\nsp_incdec                       Remove\nsp_attribute_paren              remove\nsp_macro                        Force\nsp_func_call_paren              Force\nsp_func_call_user_paren         Remove\nset func_call_user _ N_ C_ g_autoptr g_auto\nsp_brace_typedef                add\nsp_cond_colon                   add\nsp_cond_question                add\nsp_defined_paren                remove\n\n# alignment\nalign_keep_tabs                 False\nalign_with_tabs                 False\nalign_on_tabstop                False\nalign_number_left               True\nalign_func_params               True\nalign_var_def_span              0\nalign_var_def_amp_style         1\nalign_var_def_colon             true\nalign_enum_equ_span             0\nalign_var_struct_span           2\nalign_var_def_star_style        2\nalign_var_def_amp_style         2\nalign_typedef_span              2\nalign_typedef_func              0\nalign_typedef_star_style        2\nalign_typedef_amp_style         2\n\n# newlines\nnl_assign_leave_one_liners      True\nnl_enum_leave_one_liners        False\nnl_func_leave_one_liners        False\nnl_if_leave_one_liners          False\nnl_end_of_file                  Add\nnl_assign_brace                 Remove\nnl_fcall_brace                  Add\nnl_enum_brace                   Remove\nnl_struct_brace                 Force\nnl_union_brace                  Force\nnl_if_brace                     Force\nnl_brace_else                   Force\nnl_elseif_brace                 Force\nnl_else_brace                   Add\nnl_for_brace                    Force\nnl_while_brace                  Force\nnl_do_brace                     Force\nnl_brace_while                  Force\nnl_switch_brace                 Force\nnl_before_case                  True\nnl_after_case                   False\nnl_func_type_name               Force\nnl_func_proto_type_name         Remove\nnl_func_paren                   Remove\nnl_func_decl_start              Remove\nnl_func_decl_args               Force\nnl_func_decl_end                Remove\nnl_fdef_brace                   Force\nnl_after_return                 False\nnl_define_macro                 False\nnl_create_if_one_liner          False\nnl_create_for_one_liner         False\nnl_create_while_one_liner       False\nnl_after_semicolon              True\nnl_multi_line_cond              true\n\neat_blanks_after_open_brace     true\neat_blanks_before_close_brace   true\n\n# mod\n# I'd like these to be remove, but that removes brackets in if { if { foo } }, which i dislike\n# Not clear what to do about that...\n#mod_full_brace_for              Remove\n#mod_full_brace_if               Remove\n#mod_full_brace_if_chain         True\n#mod_full_brace_while            Remove\n#mod_full_brace_do               Remove\n#mod_full_brace_nl               3\n\nmod_paren_on_return             Remove\n\n# line splitting\n#code_width                     = 78\nls_for_split_full               True\nls_func_split_full              True\n\n# positioning\npos_bool                        Trail\npos_conditional                 Trail\n"
        },
        {
          "name": "uncrustify.sh",
          "type": "blob",
          "size": 0.1904296875,
          "content": "#!/bin/sh\nuncrustify -c uncrustify.cfg --no-backup `git ls-tree --name-only -r HEAD | grep \\\\\\.[ch]$ | grep -v common/valgrind-private.h | grep -v app/flatpak-polkit-agent-text-listener\\\\\\.[ch]`\n"
        }
      ]
    }
  ]
}