{
  "metadata": {
    "timestamp": 1736709885973,
    "page": 372,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM4MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "traviscross/mtr",
      "stars": 2741,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".dir-locals.el",
          "type": "blob",
          "size": 0.1142578125,
          "content": "((c-mode . ((indent-tabs-mode  . nil)\n            (c-file-style      . \"gnu\")\n            (c-basic-offset    . 4))))\n"
        },
        {
          "name": ".flake8",
          "type": "blob",
          "size": 0.1123046875,
          "content": "[flake8]\n\nselect =\n    E902,\n    E999,\n    S,\n    F,\n\nignore =\n    F821\n\nper-file-ignores =\n    test/*: S603,S404\n\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.5224609375,
          "content": "# .gitignore\n*.o\n*.pyc\n\nMakefile\nMakefile.in\naclocal.m4\nconfdefs.h\nconfig.*\nconfigure\nconfinc\nconfmf\nconftest.*\nstamp-h1*\n\n/build-aux/compile\n/build-aux/depcomp\n/build-aux/install-sh\n/build-aux/missing\n/build-aux/test-driver\n\n/autom4te.cache/\n/.deps/\n/packet/.deps/\n/packet/.dirstamp\n/packet/testpacket.py.log\n/packet/testpacket.py.trs\n/test-suite.log\n/ChangeLog\n/INSTALL\n/mtr\n/mtr-packet\n/mtr-packet-listen\n/mtr.8\n/mtr-packet.8\n/test/.deps/\n/test/.dirstamp\n/ui/.deps/\n/ui/.dirstamp\n\n/test/*.py.log\n/test/*.py.trs\n\n/mtr-*.tar.gz\n*.swp\n"
        },
        {
          "name": ".tarball-version",
          "type": "blob",
          "size": 0.0048828125,
          "content": "0.95\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 2.4619140625,
          "content": "\n  Matt Kimball <matt.kimball@gmail.com> is the primary author of mtr.\n\n  Roger Wolff <R.E.Wolff@BitWizard.nl> is currently maintaining mtr.\n\n\n  Bug reports and feature requests should be sent as described in\n  the README file.\n\n  Thanks to everyone who has provided feedback on mtr.\n\n  Thanks especially to those of you who have sent code:\n  (Reverse alphabetical order, and sometimes I just add people at\n   the end... )\n\n        Bohdan Vlasyuk <bohdan@cec.vstu.vinnica.ua>\n        Evgeniy Tretyak <evtr@ukr.net>\n        John Thacker <thacker@math.cornell.edu>\n        Juha Takala\n        David Sward <sward@clark.net>\n        David Stone <stone@AsIf.com>\n        Andrew Stesin\n        Greg Stark <gsstark@mit.edu>\n        Robert Sparks <rjsparks@nostrum.com>\n        Mike Simons <msimons@moria.simons-clan.com>\n        Aaron Scarisbrick\n        Craig Milo Rogers <Rogers@ISI.EDU>\n        Antonio Querubin <tony@lavanauts.org>\n        Russell Nelson <rn-mtr@crynwr.com>\n        Davin Milun\n        Josh Martin <jmartin@columbiaservices.net>\n        Alexander V. Lukyanov <lav@yars.free.net>\n        Charles Levert <charles@comm.polymtl.ca>\n        Bertrand Leconte <B.Leconte@mail.dotcom.fr>\n        Anand Kumria\n        Olav Kvittem <Olav.Kvittem@uninett.no>\n        Adam Kramer <l3zqc@qcunix1.acc.qc.edu>\n        Philip Kizer <pckizer@nostrum.com>\n        Simon Kirby\n        Sami Kerola <kerolasa@iki.fi>\n        Christophe Kalt\n        Steve Kann <stevek@spheara.horizonlive.com>\n        Brett Johnson <brett@jdacareers.com>\n        Roland Illig <roland.illig@gmx.de>\n        Damian Gryski <dgryski@uwaterloo.ca>\n        Rob Foehl <rwf@loonybin.net>\n        Mircea Damian\n        Cougar <cougar@random.ee>\n        Travis Cross <tc@traviscross.com>\n        Brian Casey <bcasey@imagiware.com>\n        Andrew Brown <atatat@atatdot.net>\n        Bill Bogstad <bogstad@pobox.com>\n        Marc Bejarano <marc.bejarano@openwave.com>\n        Moritz Barsnick <barsnick@gmx.net>\n        Thomas Klausner <wiz@NetBSD.org>\n        Roderick Groesbeek <mtr@roderick.triple-it.nl>\n        Kyle J. McKay <mackyle@gmail.com>\n        Joseph Carter\n        Thales <thales@paponline.net>\n        \"Min\"\n        Vaibhav Bajpai <contact@vaibhavbajpai.com>\n        Jürgen Schönwälder <j.schoenwaelder@jacobs-university.de>\n\n        and anyone who has slipped through the cracks of my mail file.\n\nAuthors: If you want your Email mentioned here, send it to me.\n         If you don't want your Email mentioned here, tell me.\n\n        -- REW\n"
        },
        {
          "name": "BSDCOPYING",
          "type": "blob",
          "size": 1.5576171875,
          "content": "Portions of this software have the following copyright.\n\n--\n\nCopyright (c) 1991, 1993\n\tThe Regents of the University of California.  All rights reserved.\n\n Redistribution and use in source and binary forms, with or without\n modification, are permitted provided that the following conditions\n are met:\n 1. Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n 2. Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in the\n    documentation and/or other materials provided with the distribution.\n 4. Neither the name of the University nor the names of its contributors\n    may be used to endorse or promote products derived from this software\n    without specific prior written permission.\n\n THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\n ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\n FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n SUCH DAMAGE.\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 17.66796875,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n"
        },
        {
          "name": "FORMATS",
          "type": "blob",
          "size": 3.2783203125,
          "content": "\nThe \"split\" format is for a separating the gui from the main program.\nThe main program can be installed setuid, and you don't want to link a\ngui-library with a setuid program.\n\n\nThe split format is:\n\n<pos> <host> <loss%> <rcvd pckts> <sent pckts> <best> <avg> <worst>\n\n\nThe \"raw\" format is:\n\nhostline|xmitline|pingline|dnsline|timestampline|mplsline\n\nhostline:\nh <pos> <host IP>\n\nxmitline:\nx <pos> <seqnum>\n\npingline:\np <pos> <pingtime (ms)> <seqnum>\n\ndnsline:\nd <pos> <hostname>\n\ntimestampline:\nt <pos> <pingtime> <timestamp>\n\nmplsline:\nm <pos> <label> <traffic_class> <bottom_stack> <ttl>\n\nTimestampline is not  yet implemented. Need to find out how to do\nICMP timestamping first. :-)\n\n\nSomeone suggested to put the following text here. As to context: Some\npeople are wondering why mtr sometimes reports hosts beyond the\ndestination host.\n\n\nThe FINAL host will occasionally be mentioned at position n, n+1, n+2\netc.\n\nYou know traceroute, right? It sends a packet, waits for the reply to\ncome back and when it comes back, it sends the next packet.\n\nIf say hosts 5-8 do not send \"time exceeded\" packets, you'll wait a\n4*3 = twelve seconds extra before you get any results on hosts 9 and\nfurther. MTR doesn't work like that.\n\nIn theory we could send out a probe for host 1-40 all at once. But\nthis would pose an unnecessary burden on the network. So what we do,\nis we send out probes for a max of 5 hosts beyond where we've seen a\nreply. So in the example above, we'd see a reply from router at\nposition 4, then we'd send out 5-9 (and because the max-host is now at\n9, we'll send them out at 1s/9 = 111ms intervals). When the reply from\nhost 9 comes back, we'll start probing for host 10-15 (at about 60ms\nintervals). But suppose the network delay up to host 9 is already 200ms\nand suppose our destination host is at position 11. Then by the time\nthe packet from host 11 comes back, we'll already have sent probe\npackets for position 12, 13, and 14! Those will come back as\n\"destination reached\" and be reported by the \"raw\" mode.\n\nCurses mode will stop showing hosts with position numbers beyond the\nfirst reply of the destination host. It could gather the information\nabout replies to packets sent as probes FURTHER than it actually is\ninto the line displayed at its true position, but it doesn't (yet).\n\nIn fact the above example is almost completely true:\n\n% mtr -r -n -c 2 152.179.99.218 | tail -5\n 13.|-- 144.232.18.238 0.0% 2 94.8 95.4 94.8 96.0 0.8\n 14.|-- 152.63.16.182 0.0% 2 95.1 95.5 95.1 95.8 0.5\n 15.|-- 152.63.64.106 0.0% 2 163.9 163.9 163.9 164.0 0.1\n 16.|-- 152.63.50.89 50.0% 2 163.7 163.7 163.7 163.7 0.0\n 17.|-- 152.179.99.218 50.0% 2 168.2 168.2 168.2 168.2 0.0\n% mtr -l -c 2 152.179.99.218 | grep -v \"^[dp]\" |tail -7\nh 10 144.232.1.41\nh 11 144.232.4.96\nh 16 152.179.99.218\nh 17 152.179.99.218\nh 18 152.179.99.218\nh 12 144.232.18.238\nh 13 152.63.16.182\n\nAs you can see we get the reply from the destination host at position\n16 AFTER we've sent probes for position 17 and 18. When those come\nback, they are reported. That's what raw mode does. It reports the raw\ninformation.\n\nIf you write a backend for the raw mode, it's up to you to\nfilter/display the results.\n\nh 10 144.232.1.41\nh 11 144.232.4.96\nh 12 144.232.18.238\nh 13 152.63.16.182\nh 14 152.63.64.106\nh 15 152.63.50.89\nh 16 152.179.99.218\nh 17 152.179.99.218\nh 18 152.179.99.218\n"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 4.0224609375,
          "content": "EXTRA_DIST = \\\n\tBSDCOPYING \\\n\tSECURITY \\\n\tbuild-aux/mtr.bat \\\n\timg/mtr_icon.xpm\n\t$(TEST_FILES)\n\nsbin_PROGRAMS = mtr mtr-packet\nTESTS = \\\n\ttest/cmdparse.py \\\n\ttest/param.py \\\n\ttest/probe.py\n\nTEST_FILES = \\\n\ttest/cmdparse.py \\\n\ttest/mtrpacket.py \\\n\ttest/param.py \\\n\ttest/probe.py \\\n\ttest/lint.sh\nEXTRA_DIST += $(TEST_FILES)\n\nPATHFILES =\nCLEANFILES = $(PATHFILES)\nEXTRA_DIST += $(PATHFILES:=.in)\n\n#\n#  We would use % pattern matching here, but that is a GNU make\n#  extension and doesn't work on FreeBSD.\n#\nmtr-packet.8: $(srcdir)/man/mtr-packet.8.in\n\t$(AM_V_GEN) $(srcdir)/build-aux/mangen.sh \"$(VERSION)\" \\\n\t\t$(srcdir)/man/mtr-packet.8.in $@\n\nmtr.8: $(srcdir)/man/mtr.8.in\n\t$(AM_V_GEN) $(srcdir)/build-aux/mangen.sh \"$(VERSION)\" \\\n\t\t$(srcdir)/man/mtr.8.in $@\n\n$(PATHFILES): Makefile\n\ndist_man_MANS = mtr.8 mtr-packet.8\nPATHFILES += man/mtr.8 man/mtr-packet.8\n\ninstall-exec-hook:\n\t`setcap cap_net_raw+ep $(DESTDIR)$(sbindir)/mtr-packet` \\\n\t|| chmod u+s $(DESTDIR)$(sbindir)/mtr-packet\n\nmtr_SOURCES = ui/mtr.c ui/mtr.h \\\n              ui/net.c ui/net.h \\\n              ui/cmdpipe.c ui/cmdpipe.h \\\n              ui/dns.c ui/dns.h \\\n              ui/raw.c ui/raw.h \\\n              ui/split.c ui/split.h \\\n              ui/display.c ui/display.h \\\n              ui/report.c ui/report.h \\\n              ui/select.c ui/select.h \\\n              ui/utils.c ui/utils.h \\\n              packet/cmdparse.c packet/cmdparse.h \\\n              packet/sockaddr.c packet/sockaddr.h \\\n              ui/mtr-curses.h \\\n              img/mtr_icon.xpm \\\n              ui/mtr-gtk.h\n\nif WITH_ERROR\nmtr_SOURCES += \\\n\tportability/error.h \\\n\tportability/error.c\nendif\n\nif WITH_GETOPT\nmtr_SOURCES += \\\n\tportability/getopt.h \\\n\tportability/getopt.c \\\n\tportability/getopt1.c\nendif\n\nif WITH_IPINFO\nmtr_SOURCES += ui/asn.c ui/asn.h\nendif\n\nif WITH_CURSES\nmtr_SOURCES += ui/curses.c\nendif\n\nif WITH_GTK\nmtr_SOURCES += ui/gtk.c\nendif\n\nif WITH_LIBASAN\nASAN_CFLAGS = -fno-omit-frame-pointer\nASAN_CFLAGS += -fsanitize=undefined\nASAN_CFLAGS += -fsanitize=address\nendif\n\nmtr_INCLUDES = $(GLIB_CFLAGS) -I$(top_builddir) -I$(top_srcdir)\nmtr_CFLAGS = $(GTK_CFLAGS) $(NCURSES_CFLAGS) $(ASAN_CFLAGS) $(JANSSON_CFLAGS)\nmtr_LDADD = $(GTK_LIBS) $(NCURSES_LIBS) $(RESOLV_LIBS) $(JANSSON_LIBS)\n\n\nmtr_packet_SOURCES = \\\n\tportability/queue.h \\\n\tpacket/packet.c \\\n\tpacket/cmdparse.c packet/cmdparse.h \\\n\tpacket/command.c packet/command.h \\\n\tpacket/platform.h \\\n\tpacket/probe.c packet/probe.h \\\n\tpacket/protocols.h \\\n\tpacket/timeval.c packet/timeval.h \\\n\tpacket/wait.h \\\n\tpacket/sockaddr.c packet/sockaddr.h\n\nmtr_packet_LDADD = $(CAP_LIBS)\n\n\nif WITH_ERROR\nmtr_packet_SOURCES += \\\n\tportability/error.h \\\n\tportability/error.c\nendif\n\n\nif CYGWIN\n\nmtr_packet_SOURCES += \\\n\tpacket/probe_cygwin.c packet/probe_cygwin.h \\\n\tpacket/wait_cygwin.c\nmtr_packet_LDADD += -lcygwin -liphlpapi -lws2_32\n\ndist_windows_aux = \\\n\t$(srcdir)/build-aux/mtr.bat \\\n\t$(srcdir)/AUTHORS \\\n\t$(srcdir)/BSDCOPYING \\\n\t$(srcdir)/COPYING \\\n\t$(srcdir)/README \\\n\t$(srcdir)/NEWS\n\ndistwindir = $(distdir)-win-$(host_cpu)\n\n#  Bundle necessary files for a Windows binary distribution\ndistdir-win: $(dist_windows_aux) mtr.exe mtr-packet.exe\n\trm -fr $(distwindir)\n\tmkdir -p $(distwindir) $(distwindir)/bin $(distwindir)/terminfo\n\tcp $(dist_windows_aux) -t $(distwindir)\n\tcp mtr.exe mtr-packet.exe -t $(distwindir)/bin\n\tldd mtr.exe | grep -v cygdrive | awk '{ print $$3 }' | xargs cp -t $(distwindir)/bin\n\tcp `find /usr/share/terminfo -name cygwin | xargs dirname` -r $(distwindir)/terminfo\n\n#  Zip up a Windows binary distribution\ndist-windows-bin: distdir-win\n\trm -f $(distwindir).zip\n\tzip -rq $(distwindir).zip $(distwindir)\n\trm -fr $(distwindir)\n\nelse  # if CYGWIN\n\ncheck_PROGRAMS = mtr-packet-listen\n\nmtr_packet_SOURCES += \\\n\tpacket/construct_unix.c packet/construct_unix.h \\\n\tpacket/deconstruct_unix.c packet/deconstruct_unix.h \\\n\tpacket/probe_unix.c packet/probe_unix.h \\\n\tpacket/wait_unix.c\n\nmtr_packet_listen_SOURCES = \\\n\ttest/packet_listen.c\n\nendif  # if CYGWIN\n\n\nif BUILD_BASH_COMPLETION\ndist_bashcompletion_DATA = bash-completion/mtr\nendif\n\ndist-hook:\n\t$(AM_V_GEN)echo $(VERSION) > $(distdir)/.tarball-version\n"
        },
        {
          "name": "NEWS",
          "type": "blob",
          "size": 39.484375,
          "content": "WHAT'S NEW?\n\nThe new release script will do a \"git shortlog\" to add \nthe commit messages here. \n\n#NEW_STUFF_HERE this is a tag my script looks for. \nV0.95\n   Aaron Lipinski (27):\n         move net_send_batch call to its caller\n         addr -> hostent for consistency\n         re-init source too\n         additional call from net_reopen\n         refactor - group local, remote inits\n         reset ctl address family at net_reopen\n         accept only value used in structure\n         tell dns process if we want 4 or 6\n         resolve ipv6 only if we have ipv6\n         remove wrapper only function\n         init structures correctly wired up\n         prepare host with h_addr_list\n         remove temporaries\n         extract convert_addrinfo_to_hostent function\n         move conversion call to caller\n         use addrinfo\n         remove conversion function\n         switch gui to addrinfo\n         export DEFAULT_AF\n         reset addr family before searching again\n         freeaddrinfo\n         export get_hostent_from_name\n         make Hostname as const\n         rename function\n         dont show json option if not available\n   \n   Egor Panov (1):\n         Updated Readme\n   \n   R.E. Wolff (2):\n         Slight cleanup, but no fix for code that came up in a bugreport.\n         increased max length suggested by YVS2014\n   \n   Roger Wolff (12):\n   \n   Rogier Wolff (2):\n         Code formatting for Zenithal pull\n         added clarification to readme suggested by Zenithal\n   \n   Sergei Trofimovich (1):\n         ui/curses: always use \"%s\"-style format for printf()-style functions\n   \n   Vincent Bernat (3):\n         ui: don't cast to void* when calling display_rawhost()\n         net: fix MPLS display for curses and report\n         report: fix display of MPLS labels when using --report\n   \n   Zenithal (1):\n         Add display of destination with resolved addr under curses mode\n   \n   a1346054 (5):\n         fix wrong bash completion flag\n         fix shellcheck warnings\n         unify codestyle\n         fix spelling\n         trim trailing whitespace\n   \n   gaamox@tutanota.com (1):\n         Report secondary servers when CSV + wide report is enabled\n   \nV0.94\n   Aaron Lipinski (10):\n         gtk_menu_append -> gtk_menu_shell_append\n         GTK_OBJECT -> G_OBJECT\n         gtk_button_new_from_stock -> gtk_button_new_with_label\n         gtk3\n         hbox/vbox -> gtk_box_new\n         gtk_menu_popup -> gtk_menu_popup_at_pointer\n         show resolved hostname in raw dnsline\n         rely on final return NULL\n         introduce libasan\n         avoid stack use after scope\n   \n   Alejandro Leal (2):\n         few updates to manual page and README.md\n         Updating some comments\n   \n   Chongyu Zhu (1):\n         probe: fix find_source_addr\n   \n   Konrad Bucheli (1):\n         fix segmentation fault if there is no IP address on an interface (fixes #320)\n   \n   Kulemin Alexander (1):\n         report: json: reworked with libjansson\n   \n   Mark Egan-Fuller (1):\n         Add display of destination.\n   \n   Markus Kötter (6):\n         simplification - remove sockaddrtop\n         simplification - remove addrcpy\n         simplification - remove rsa{4,6}\n         simplification - address addrcmp\n         simplification - improve readability\n         ip6 udp - fix probes with local or remote port\n   \n   R.E. Wolff (29):\n         fix warning on recent compilers.\n         Merge branch 'master' of github.com:traviscross/mtr\n         net find local address fix by meingtsla\n         proposed patch for bsd compile error\n         fix closing brace\n         Added include errno --obouizi\n         Merge branch 'master' of github.com:traviscross/mtr\n         More compilation warning fixes from obouizi\n         Added extra help text to configure --yvs\n         Changed MAXPATH to MAX_PATH for AIX compatibility. -- aixtools\n         make the code for gtk2/3 a bit nicer.\n         Merge branch 'gtk3_with_fallback' of https://github.com/krisl/mtr\n         Merge branch 'master' of github.com:traviscross/mtr\n         in hindsight my previous patch wasn't so nice. And nobody told me.\n   \n   Sean Wei (1):\n         Fix parameter in ui/net.c\n   \n   Siyuan Miao (1):\n         show mpls information in raw output\n   \n   atib (1):\n         Added code to print multiple addresses regitered on the same hop count\n   \n   atibdialpad (2):\n         Change TTL dynamically to adjust for path changes\n         TODO list changes\n   \n   meingtsla (2):\n         asn_{open,close}: Always initialize ipinfo hash table\n         Merge branch 'master' of https://github.com/traviscross/mtr into asn-open-always-hcreate\n   \nV0.93\n    Adam (1):\n          Update README\n    \n    Adrien Gallouët (1):\n          Add a help line for the t command in curses\n    \n    Alexander Blesius (1):\n          convert README to markdown\n    \n    Arkadiusz Miśkiewicz (2):\n          Also try SOCK_RAW/IPPROTO_ICMP when other fail.\n          mtr to a unreachable host is possible again.\n    \n    Ben Williams (2):\n          added UI hotkeys description (from internal help) to NOTES section in mtr man page\n          renamed NOTES to INTERACTIVE CONTROL as per discussion in pull request\n    \n    Chonggang Li (4):\n          mtr-packet: use ICMP and UDP without privilege on linux\n          mtr-packet: fix Windows compilation\n          mtr-packet: fix compilation on OS X\n          mtr-packet: fix a bug causing IPv6 raw socket not working\n    \n    Markus Kötter (7):\n          set udp checksum\n          automake - configure show build options\n          sockaddr - unify access to sockaddr_in/6 port & address\n          probe - use INET6_ADDRSTRLEN\n          probe - extend matching to src/dst host&port\n          sockaddr - save a cast accessing the port\n          construct - fix set port\n    \n    Matt Kimball (7):\n          mtr-packet: report ICMP destination unreachable probes as \"no route to host\"\n          ui: display \"no route to host\" error as host entry rather than abort\n          json: Fix malformed json when the \"hubs\" list is empty\n          commandline: Added --interface for using a named network interface\n          Link portability/error.c with mtr-packet when missing on MacOS\n          Mention Python mtrpacket package in mtr-packet man page\n          Rework Cygwin mtr-packet to respond to signals (such as SIGTERM)\n    \n    R.E. Wolff (15):\n          fixed some outdated text in README.\n          minor changes top help Windows compilation on 32 bit machines\n          fix #204 : added exec of mtr-packet in the place where mtr was started \n                from. Quick and dirty, There is probably a better place to declare variables.\n          Alternative 'skip uid 0 checks on cygwin' to adpoliak's implmentation\n          fix stupid typo. Thanks adpoliak!\n          possible fix for mac terminal 100% problem\n          Sami Kerola: prevent MTR reporting unknown revision\n          Merge branch 'master' of github.com:traviscross/mtr\n          fixed split like for macos\n          better fix. to dave's problem.\n          -f equals -m fix from yvs2014\n          rewritten weiyixuan's patch\n          fixed typo\n          Netbsd build fixes thanks to yvs2014\n          Merge branch 'master' of github.com:traviscross/mtr\n    \n    Robert Scheck (1):\n          Update incorrect FSF address\n    \n    Rogier Wolff (3):\n          Fixed issue #286\n          Manpage fix for Darwin by Matt. Rewritten by REW\n          Added parentheses\n    \n    SaintBol (9):\n          Update protocols.h\n          Update deconstruct_unix.c\n          Update probe.c\n          Update probe.h\n          Update cmdpipe.c\n          Update curses.c\n          Update mtr.h\n          Update report.c\n          Update mtr-packet.8.in\n    \n    Sami Kerola (1):\n          mtr-packet: make address-not-available errors less likely\n    \n    Samuel Henrique (1):\n          [typo]mtr.8.in: s/allows to/allows one to/\n    \n    Tobias Rittweiler (2):\n          Add a .dir-locals.el file for Emacs.\n          Replace perror(...); exit(...); by error(...);\n    \n    divinity76 (1):\n          use setup.exe's package manager mode, replacing apt-cyg\n    \n    tk (1):\n          Fix typo (resove -> resolve)\n    \n    weiyixuan (3):\n          Option -y can not work properly\n          Option --ipinfo 1 can not work properly\n          for tcp, fix : bind port failed, try next sequence\n    \nV0.92\n   added a few arguments to calls added by fmazu. Allows it to compile.\n\nV0.91\n   only made the tag point to the proper commit.  --REW\n   script now handles that situation (aborted release script) better. \n\nV0.90\n   only fixed the release script. Should now contain fmaxullo's \n   patch. --rew\n   fmazullo (1):\n         Add AS number to json output\n   \nV0.89\n   only made the tag point to the proper commit.  --REW\n\nV0.88\n   Antonio Querubin (3):\n         Merge remote-tracking branch 'origin/master' into newdns\n         Need to error check getnameinfo().\n         Merge remote-tracking branch 'origin/master' into newdns\n   \n   David Hill (1):\n         include <sys/select.h> for fd_set\n   \n   Jakub Wilk (1):\n         Fix typos\n   \n   Joe Bruggeman (2):\n         Replace all tabs tabs in net.c with spaces\n         cleanup the if blocks in net.c to improve readability\n   \n   Jürgen Weigert (1):\n         Mention + and - keys in the man page\n   \n   Kacper Michajłow (2):\n         Relax mtr-packet search rules.\n         Add missing errno.h include.\n   \n   Matt Kimball (20):\n         Added mtr-packet subprocess\n         test: Fix mtr-packet tests for Python 3\n         cmdline: multiple host names dropped all but one host  (issue #168)\n         mtr-packet: IPv6 support\n         mtr-packet: UDP probe support\n         mtr-packet: packet customization options (size, fill, mark, tos)\n         mtr-packet: TCP and SCTP probes\n         mtr-packet: MPLS decoding and local UDP port usage\n         mtr-packet: allow local address binding\n         Merge branch mtr-packet into 'master'\n         mtr-packet: drop capabilities + using BSD's linked lists for probes\n         build: moved front-end source into ui subdir\n         build: use AC_CHECK_LIB for ncurses, rather than pkg-tool\n         mtr-packet: Fall back to IPv4 only support if IPv6 sockets fail to open\n         build: if linking with ncurses fails, try curses  (for NetBSD)\n         build: Fix Solaris build issues\n         build: fix compiler warnings when for OpenBSD, NetBSD and Solaris\n         mtr-packet: Report probe status on host unreachable (Cygwin)\n         cleanup: Fix #ifdef structure which confuses 'ident'\n         cleanup: reindented C source with GNU indent\n   \n   Narthorn (2):\n         Initialize dns process before opening display\n         Add displaymode 2 back in\n   \n   R.E. Wolff (19):\n         Merge branch 'newdns' of https://github.com/traviscross/mtr into newdns\n         Merge branch 'newdns'\n         fixed double printout of start time, issue 131\n         Updated NEWS as in v0.87.1\n         format sent and rcvd fields correctly for big numbers #66\n         increased default unknownhosts #92 #132 #130     (I give in).\n         Merge branch 'master' of github.com:traviscross/mtr\n         fixed no-gtk build bug introduced with e2d898cc\n         more cleanup\n         Partial reverse of 6bb5b6b3b.\n         re-initialize ipinfo_no and -max. Fixes #161.\n         Merge branch 'master' of github.com:traviscross/mtr\n         fixed dynamic DNS on/off switch. Fixed #160\n         header alignment issue found&fixed by meingtsla. Fixes #164\n         Merge branch 'master' of github.com:traviscross/mtr\n         asn fix from meingtsla, fixes #163. Pong!\n         put ifdefs around IPV6 only part. Fixes #184\n         More whitespace mangling for consistency in net.c\n         The release script bumped the version number\n   \n   Roger Wolff (22):\n         New DNS works for IPV4....\n         moved towards IPV6 compatibilty...\n         removed the include mess...\n         merged antonios's bufsize fixes\n         Merge branch 'master' of github.com:traviscross/mtr into newdns\n         AQ: Added include for redhat, and fixed salen for BSD\n         removed last debug output from dns.c\n         One more patch to fix a getnameinfo corruption problem. -- AQ\n   \n   Rogier Wolff (5):\n         removed AC check for features newdns doesn't use\n         Fixed pull #133 another way....\n         fixed #27 and #35 where the fix was tested a long time ago.\n         fixed #141 compile without SCTP if not available\n         fixed typo.\n   \n   Sami Kerola (122):\n         warnings: remove unnecessary file\n         usage: add short and long options and descriptions to usage()\n         warnings: stop variable shadowing\n         dns: remove unnecessary dns_events() function\n         posix: replace bzero() and index() with modern equivelants\n         warnings: stop reassigning a value before the old one has been used\n         warnings: remove code that cannot be reached\n         warnings: fix printf data types\n         cleanup: remove unnecessary null check\n         build-sys; do not use subdirectory object\n         man: use url macro to urls and fix reference manual notations\n         build-sys: default to ,/configure --enable-silent-rules\n         warnings: do not take abs() when data type is unsigned\n         warnings: mark unused function input variables\n         warnings: fix couple unsigned vs signed variable comparisons\n         warnings: multiply timeval seconds only when the value is small\n         warnings: fix some missed unsigned vs signed variable comparisons\n         comment: add value range note to initialization\n         cast: do not downgrade to float when double should be used\n         warnings: remove dead code\n         build-sys: fix make distcheck\n         build-sys: remove old dist Makefile kludge\n         build-sys: use build version script from gnulib\n         build-sys: improve configure.am\n         build-sys: require automake 1.11.6 or newer\n         warnings: fix unused variable when ./configure --without-gtk is used\n         readability: always use EXIT_* definitions from stdlib.h\n         cleanup: remove unnecessary function\n         warnigns: add void to functions that do not take any arguments\n         build-sys: fix --without-ipinfo regressions\n         build-sys: fix ./configure --disable-ipv6\n         warnings: fix --disable-ipv6 --without-ipinfo compilation warnings\n         build-sys: check pkg-config availability\n         build-sys: use pkg-config to find gtk+-2.0\n         build-sys: use pkg-config to find ncurses\n         build-sys: get rid of double negative ipinfo autotools settings\n         cleanup: remove NO_SPLIT preprocessor check\n         build-sys: simplify finding resolver library\n         build-sys: remove unused autoconf check values\n         cleanup: remove obsolete herror() function\n         usage: reflect ./configure choices in available command line options\n         cleanup: remove preprocessor missing functions go-arounds\n         usage: be careful when parsing numeric user input\n         usage: use error(3) error-reporting function\n         cleanup: move max port number to be a define in net.h\n         build-sys: use system getopt_long() when it is available\n         build-sys: tell function locality explicitly\n         portability: fix float max check from values.h\n         portability: MacOS does not have error() function\n         portability: fix MacOS libresolv usage\n         data types: set static strings to be read-only\n         cleanup: remove redundant redeclaration\n         data types: move variable declaration from header to .c file\n         data types: check with smatch everything is in resonable scope\n         warnings: fix use of uninitialized warning\n         data types: get rid of all globals that are easy to remove\n         usability: fix --mark documentation\n         docs: make manual page versioning automatic\n         data types: move global data to control structures\n         data types: make control structure smaller\n         data types: move rest of the global variables to control structures\n         crash fix: make --xml not to dump core\n         warnings: correct function pointer prototype argument\n         warnings: do not use zero as NULL\n         warnings: avoid vla when malloc() is more appropriate\n         usability: print usage() if unknown options are used\n         cleanup: use definition for a magic value appearing twice in code\n         cleanup: remove commented out includes in dns.c\n         cleanup: avoid duplicating stdint.h\n         cleanup: use ICMP definitions from linux/icmp.h when possible\n         cleanup: move generic utility functions to a separate file\n         reliability: ensure string copy results to a null determined string\n         reliability: further removal of unsave string operation\n         reliability: always check malloc() return value\n         reliability: always check strdup() return value\n         reliability: check writing to stdout and stderr was successful\n         usability: use ISO-8601 timestamp\n         posix: do not use time(2) input argument\n         usability: add bash-completion file\n         bug fix: long option --gracetime is correct, --graceperiod is not\n         performance: use fewer printw() calls to center text\n         cleanup: merge two trim functions to one\n         crash fix: add ctl structure to gtk Pause_clicked() handler\n         crash fix: never return const string as address\n         crash fix: ctl->iiwidth_len was not initialized correctly\n         cleanup: make unused and const attributes to look the same\n         performance: make get_iiwidth() to be const function\n         cleanup: remove more/bottom labels header separation from mpls\n         cleanup: set variable only if it is used\n         cleanup: correct display_offset variable usage\n         cleanup: remove message duplicate\n         performance: set few variables read-only\n         docs: add Sami Kerola to authors\n         performance: make reset in net.c more effective\n         portability: fix bsd build\n         warnings: ensure printf will not overflow\n         misc: improve random initialization\n         net: fix net_reopen() initialization\n         warnings: fix warnings when everything possible is turned on\n         curses: simplify format_number()\n         curses: use switch case in mtr_curses_keyaction()\n         cleanup: remove dead code\n         style: convert c++ comment style to c style\n         display: avoid unnecessary switch case clauses\n         curses: convert magic numbers to an enum list\n         data types: move variables from a file to a function scope\n         cleanup: move file scope variables to the beginning of file\n         data types: move names list away from global scope\n         cleanup: move definitions and struct declarations to mtr.h\n         cleanup: clarify preprocessor nesting\n         build-sys: use proper check to find if time_t is defined\n         build-sys: enable all system extensions\n         regression: fix --displaymode=2 argument\n         user interface: do not allow out of range --ipinfo arguments\n         cleanup: use single logic to handle conditional options\n         docs: add very basic --sctp documentation to manual page\n         docs: improve mtr-packet(8) manual page\n         build-sys: update .gitignore file\n         smatch: extern keyword is needed only in header\n         smatch: fix couple warnings\n         build-sys: update .gitignore file\n         docs: FSF moved back in 2005\n   \n   Vlad Glagolev (1):\n         respect theme foreground color\n   \n   aquerubin (5):\n         Correct psize for IPv6.\n         Merge updates from branch 'master' into newdns\n         Merge branch 'master' into newdns\n         Merge branch 'newdns' of https://github.com/aquerubin/mtr into newdns\n         Fix standard deviation calculation.\n   \n   rewolff (22):\n   \n\nV0.87\nAntonio Querubin (1):\n      Use setcap instead of setuid when installing the binary.\n\nBaptiste Jonglez (4):\n      Allow enabling IP info and ASN lookup from the curses interface\n      Document the -y option in the manpage\n      Cosmetic cleanup of the option-parsing code\n      Fix wrap-around bug when displaying IP info (-y option)\n\nDanek Duvall (1):\n      Fix issue #76: rationalize the discovery of a terminal handling library\n\nGareth Randall (6):\n      Corrected the \"without gtk\" reference to \"./configure --without-gtk\",\n      Filled in some of the missing man page sections.\n      Remove a warning message at compile time.\n      Fix typos and update mailing list references.\n      Add a section about granting limited security capabilities.\n      State that Github is the preferred way to report bugs.\n\nGuo Yixuan (1):\n      Raw output: add x for a ping-packet-sent event.\n\nHajimu UMEMOTO (1):\n      Add aslookup support to gtk interface\n\nJakub Wilk (1):\n      Fix typos.\n\nKris Coward (1):\n      Added --displaymode option\n\nNarthorn (1):\n      curses: Fix background transparency in terminal\n\nNikolai R Kristiansen (1):\n      Add support for JSON as report output format\n\nR.E. Wolff (9):\n      explanation of the version numbers in NEWS.\n      Merge branch 'master' of github.com:traviscross/mtr\n      removed warning about IPV6 socket when IPV6 is not available at runtime\n      fix for printing space field in XML.\n      modified name of timeout variable to prevent warning on solaris.\n      changed the name of the ping timeout timer from 'tag' to 'ping timeout timer'\n      net.c fix from AQ.\n      issue 128: compile should be in .gitignore\n      The release script bumped the version number\n      added use-default-colors...\n\nTheo Baschak (1):\n      Update asn.c - 32bit asn widths\n\nTobias Rittweiler (5):\n      Fix typo in csv_close() that prevented any of the data columns from being printed.\n      --csv: Don't print spaces in columns.\n      --csv: Print a header line as the first line which names all columns.\n      asn.h: Guard against being included twice.\n      Fix setting length field of UDP header to broken value on BSD systems.\n\nVojtech Kurka (1):\n      Fixed behaviour of Pause button\n\naquerubin (3):\n      Correct psize for IPv6.\n      Fix Avg and Best column order to match column headers in GTK display.\n      Update Tony's email address in the GTK credits.\n\npenyu (1):\n      add max-unknown option\n\nrussor (10):\n      allow setting local and remote port for UDP probing\n      fix checksum for odd sized packets\n      set the local address for display if it was bound\n      automatically set udp address if needed\n      fix improper aliasing\n      fix placement of zeros when running alternate udp checksum\n      endian neutral placement of alternate checksum\n      copy odd byte into a 16-bit temp value; used bit-sized types for calrity\n      correct checksum calculation when adding the overflow overflows\n      add option to set graceperiod\n\nswordfeng (3):\n      Add SCTP support (same way with tcp)\n      remove comment\n      fix sctp header structure\n\n=======\n#this is a tag my script looks for. \n#NEW_STUFF_HERE\nV0.87\n   Antonio Querubin (1):\n         Use setcap instead of setuid when installing the binary.\n   \n   Baptiste Jonglez (4):\n         Allow enabling IP info and ASN lookup from the curses interface\n         Document the -y option in the manpage\n         Cosmetic cleanup of the option-parsing code\n         Fix wrap-around bug when displaying IP info (-y option)\n   \n   Danek Duvall (1):\n         Fix issue #76: rationalize the discovery of a terminal handling library\n   \n   Gareth Randall (6):\n         Corrected the \"without gtk\" reference to \"./configure --without-gtk\"\n         Filled in some of the missing man page sections.\n         Remove a warning message at compile time.\n         Fix typos and update mailing list references.\n         Add a section about granting limited security capabilities.\n         State that Github is the preferred way to report bugs.\n   \n   Guo Yixuan (1):\n         Raw output: add x for a ping-packet-sent event.\n   \n   Hajimu UMEMOTO (1):\n         Add aslookup support to gtk interface\n   \n   Jakub Wilk (1):\n         Fix typos.\n   \n   Kris Coward (1):\n         Added --displaymode option\n   \n   Narthorn (1):\n         curses: Fix background transparency in terminal\n   \n   Nikolai R Kristiansen (1):\n         Add support for JSON as report output format\n   \n   R.E. Wolff (9):\n         explanation of the version numbers in NEWS.\n         Merge branch 'master' of github.com:traviscross/mtr\n         removed warning about IPV6 socket when IPV6 is not available at runtime\n         fix for printing space field in XML.\n         modified name of timeout variable to prevent warning on solaris.\n         changed the name of the ping timeout timer from 'tag' to 'ping timeout timer'\n         net.c fix from AQ.\n         issue 128: compile should be in .gitignore\n         The release script bumped the version number\n   \n   Rogier Wolff (1):\n         added use-default-colors...\n   \n   Theo Baschak (1):\n         Update asn.c - 32bit asn widths\n   \n   Tobias Rittweiler (5):\n         Fix typo in csv_close() that prevented any of the data columns from being printed.\n         --csv: Don't print spaces in columns.\n         --csv: Print a header line as the first line which names all columns.\n         asn.h: Guard against being included twice.\n         Fix setting length field of UDP header to broken value on BSD systems.\n   \n   Vojtech Kurka (1):\n         Fixed behaviour of Pause button\n   \n   aquerubin (3):\n         Correct psize for IPv6.\n         Fix Avg and Best column order to match column headers in GTK display.\n         Update Tony's email address in the GTK credits.\n   \n   penyu (1):\n         add max-unknown option\n   \n   russor (10):\n         allow setting local and remote port for UDP probing\n         fix checksum for odd sized packets\n         set the local address for display if it was bound\n         automatically set udp address if needed\n         fix improper aliasing\n         fix placement of zeros when running alternate udp checksum\n         endian neutral placement of alternate checksum\n         copy odd byte into a 16-bit temp value; used bit-sized types for calrity\n         correct checksum calculation when adding the overflow overflows\n         add option to set graceperiod\n   \n   swordfeng (3):\n         Add SCTP support (same way with tcp)\n         remove comment\n         fix sctp header structure\n   \n\nV0.86 Fixed default hostname logic. \n      Fix for NetBSD: 64bit time_t -- Thomas Klausner\n      Fix unnecessary runtime dependency on glib from VSYakovetsky through \n           Thomas\n      Inverted IPINFO define in the code. Removes double negatives. \n         -- Vladimir Yakovetsky, REW.\n      Fixed failure on IPv4 only systems when IPv6 was available at\n         compile time. -- REW.\n      Fixed (longstanding) bug that mtr used 100% cpu when paused. \n      Cosmetic changes from Richard Hartman. \n\nV0.85 Fixed asn support. (better compile time detection of required features)\n      support for multiple hostnames. (fixed in 0.86)\n      support for TCP probes\n\nV0.84 Fix some glib things by Thomas. \n\nV0.83 Move to github. Mostly done by Travis.\n\nAuthor: Travis Cross <tc@traviscross.com>\n    Add autotools bootstrap script\n    Update README for building from git repository\n    Cleanup whitespace in the NEWS file\n    Resolve -Wunused-but-set-variable warnings\n    Resolve -Wnull-dereference clang warning\n    Add -z / --show-ip support\nAuthor: R.E. Wolff <R.E.Wolff@BitWizard.nl> (mostly from patches by others)\n    some running patches\n    Made report wide switch properly to displayreport mode. Bug #780647\n    fixed gtk field order. Bug #701513\n    added aslookup patch from bug #701514\n    added some extra clarifications to the SECURITY file.\n    enable ipv6 resolvers. By Antonio Querubin. Fixes bug #752583\n\n  V0.82 Removed old Changelog file appended at the end as oldest\n        changes.\n        2011-03-28  Mark Kamichoff <prox@prolixium.com>\n        Enable decoding of ICMP extensions for MPLS for curses and\n        report interfaces.  Use the -e flag or press 'e' to enable it.\n\n  V0.81 Moved to git. Testing git...\n\n  V0.80 Some compilation fixes for BSD by Jeremy Chadwick\n        <freebsd@jdc.parodius.com>\n\n  V0.78/0.79 some compilation fixes for BSD&others by\n        Thomas Klausner <wiz@NetBSD.org>\n\n  V0.76 display load sharing hosts in --raw output.\n        added about button in gui.\n\n  v0.75 Feelgood patch to move sprintf to snprintf. People might think\n        that sprintf might cause a buffer overflow. Now it's clean.\n        cut-paste patches: you can now copy an intermediate host to the\n        clipboard.\n\n  v0.74 Martin Pels' patch to allow UDP probes.\n        KES reported a build problem. Turns out I need to install gtk-1.2\n        on my development system, otherwise my release script causes the\n        build to break.\n        changed some docs to advertise the new mailing list.\n        added documentation for the Mac OS X compilation problem.\n        added -Wno-pointer-sign to the compiler options.\n        Nico Lichtmaier's cleanup-gtk patch. (now mtr uses a more modern\n        dialect of gtk).\n\n  v0.73 Some security patches. Although MTR drops privileges as soon\n        as possible after opening the sockets, it still had some\n        sprintf calls, which have now been converted into snprintf.\n\n  v0.72 Fix signed/unsigned bug in IPV6 part\n        improved random packet size behaviour. --REW\n\n  v0.71 Some IPV6 fixes, introduce packet size cmdline option.\n        (was already present as a cmdline argument)\n\n  v0.70 Antinio submitted a cumulative patch containing some\n        nice improvements. He also submitted an automake patch\n        that causes mtr to no longer compile on my system. I\n        refuse to have mtr \"in the dark\" that I can't test-compile\n        the dist.\n\n  v0.69 make distclean should now also remove \"rej\" files.\n        Antonio Querubin: update getopt.h . More cleanups using\n        new infrastructure.\n        rcw: Fixed IPV6 support: When compiled in an IPV6-supporting\n        environment, but when the kernel doesn't support IPV6, mtr would\n        fail to start.\n\n  v0.68 included some old patches.\n        included patch from Antonio Querubin for better IPV6 support\n        restructured some more whitespace.\n        added mtr.h where \"global\" things should go. Not finished\n        moving things around, but now that the infrastructure is there,\n        it should be easy.\n\n  v0.67 Bad keyboarding by REW caused this one out the door. Sorry.\n        No changes.\n\n  v0.66 Through the Debian bugtracking system a bug report and\n        fix was sent my way, that deals with stupid optimization\n        trying to save some 768 bytes of memory, sacrificing \"it\n        works\" on a different architecture... (default char signedness)\n\n  v0.65 Dancer Vesperman noted that mtr no longer traces past\n        a section of non-responding hosts. Apparently I added\n        a line in net.c that didn't make sense in mtr-0.56. I\n        can't find the reason for adding that line, so someone\n        who thinks (s)he needs it, should holler.\n\n  v0.64 Philippe suggests to do the time_t thingy before socket.h.\n        Apparently, MAC OS X doesn't compile socket.h otherwise.\n\n  v0.63 Suggestion by RCW: Add -lm at line 70 of Configure.in.\n        On my system no ill effects ensued, so this version released\n        so that he can test if it still works on his system.\n\n        Let me add that it's stupid that I have to specify that this\n        this program now requires Automake version 1.5 to build, where\n        Automake was intended to make software independent of different\n        versions of build software!\n\n        For those concerned about the above statement: If you're just\n        trying to compile and use MTR, there is no need for automake.\n        Just when you're messing with the configure and build system of\n        mtr is automake a tool you need.\n\n  v0.62 Apparently someone changed gethostbyname into gethostbyname2\n        in mtr.c in an attempt to add IPV6 support. For systems without\n        ipv6 support, the old gethostbyname should be used! Linux\n        has the call even if you don't enable IPV6. Thanks Gary (rsub)\n\n  v0.61 Attempt to get/print the local IP address. Now shows as\n        0.0.0.0 :-( Hints and tips appreciated! -- REW\n        Lots of blank space reformatting.\n        moved the interface address setting to net.c (where it\n        belongs).\n\n  v0.60 John Thacker submitted a surprisingly simple patch to\n        enable linking against GTK2.  (up to 2.4.0)\n\n  v0.59 Josh Martin suggested to add some bounds checking to\n        the dynamic field code. This caused me to delve in, and\n        rewrite some things. Now 50 lines of code less, but cleaner\n        code. :-)\n\n  v0.58 I don't remember. Forgot to update this. :-( Check the\n        patch.\n\n  v0.57 Lots of whitespace cleanups. And a DNS fix: Don't do DNS\n        lookups in raw mode with -n specified.\n\n  v0.56 Fixed compile warnings. Now compiles with -Wall. If your\n        compiler finds things mine didn't feel free to shout.\n\n  v0.55 Cleanup patch. I'm going to do some maintenance on MTR,\n        but I want to be able to say: Can you see which version\n        fixed/broke things for you, so you're going to see a\n        bunch of new releases soon.\n\n  v0.54 Added \"scrolling\" patch from Roland Illig, to allow\n        scrolling in text mode. I've always wanted this......\n\n  v0.53 Added fix for raw mode.\n\n  v0.52 Mostly cleanups from Brett Johnson on MacOS X. It may\n        clean up some compilation problems on MacOS X as well.\n\n  v0.51 Fixed the bug introduced by the previous select loop fix...\n        Thanks Evgeniy\n\n  v0.50 Make \"interface address\" option work.\n        Changes to \"select\" loop to allow window resizes (select\n        interruption) to work. Thanks Mike!\n\n  v0.49 Fix compilation problems on several platforms.\n\n  v0.48 Draw names in red (GTK) or bold (Curses) if host doesn't\n        respond.\n\n  v0.47 Fixed a (believed-) non-exploitable buffer overflow.\n        Thanks Damian.\n\n  v0.46 Included patch to be able to specify outgoing interface\n        address.\n\n  v0.45 People are pressuring me to release new versions with their\n        changes. That's fine. Now this version just adds dynamic\n        switching between numeric / dns names, and some minor\n        stuff I forgot. This release serves as a code-sync-release.\n        new version with even more new stuff in about two weeks!\n        I'm afraid I don't know how to fix the MacOS-X compilation\n        problems in the source. Help wanted...\n\n  v0.44 David Stone adds the \"last\" column to the gtk version.\n\n  v0.43 Compile fixes.\n\n  v0.41 Added afr's patch to allow disabling of gtk without Robn's hack.\n        Made report mode report the newly added extra resolution.\n\n  v0.40 Fixed some problems with HPUX and SunOS.\n        Included Olav Kvittem's patch to do packetsize option.\n        Made the timekeeping in micro seconds.\n\n  v0.39 Forgot the parentheses around the previous fix... :-(\n\n  v0.38 fixed some dubious code in dns.c (noted by someone's lint)\n\n  v0.37 Added Bill Bogstad's \"show the local host & time\" patch.\n        Added R. Sparks' show-last-ping patch, submitted by Philip Kizer.\n\n  v0.36 Added Craigs change-the-interval-on-the-fly patch.\n        Added Moritz Barsnick's \"do something sensible if host not found\"\n            patch.\n        Some cleanup of both Craigs and Moritz' patches.\n\n  v0.35 Added Craig Milo Rogers pause/resume for GTK patch.\n        Added Craig Milo Rogers cleanup of \"reset\". (restart at the beginning)\n        Net_open used to send a first packet. After that the display-driver\n            got a chance to distort the timing by taking its time to\n            initialize.\n\n  v0.34 Added Matt's nifty \"use the icmp unreachables to do the timing\" patch.\n        Added Steve Kann's pause/resume patch.\n\n  v0.33 Fixed the Linux glibc resolver problems.\n        Fixed the off-by-one problem with -c option.\n\n  v0.32 Fixed the FreeBSD bug detection stuff.\n\n  v0.31 Fixed a few documentation issues. -- Matt\n        Changed the autoconf stuff to find the resolver library on\n            Solaris. -- REW\n        Cleaned up the autoconf.in file a bit. -- Matt.\n\n  v0.30 Fixed a typo in the changelog (NEWS) entry for 0.27. :-)\n        added use of \"MTR_OPTIONS\" environment variable for defaults.\n\n  v0.29 Lots of stuff.\n        Neato overview display by David Sward.\n        FreeBSD does wrong in the kernel the same that Solaris/x86 (see\n            note for 0.27 does right. It forces mtr to send bad packets....\n        Adjusted \"not too much at once\" algorithm. Now probing\n           continues as long as not more than 5 hosts are unknown.\n           Returning packets usually allow us to do the first sweep\n           in one go.\n\n  v0.28 DNS lookups are now suppressed if you don't want them.\n\n  v0.27\n        Fixed bug that showed up on Solaris/x86.\n        GTK mainloop now runs as it's supposed to.\n\n  v0.26\n        Added \"-n\" flag for numeric output.\n        fixed IP numbers displaying backwards.\n        GTK mainloop now runs at 10 packets per second.\n          - That's too much if there are only 3 hosts\n          - that's too little if there are 20 hosts.\n        -> Someone tell me how to change the \"ping-timeout\"\n           callback time in gtk. Can't find it in the docs.\n        The default for \"hostname\" is now \"localhost\" so that\n        you can start mtr without any arguments and later\n        fill in the host you want to trace to.\n\n  v0.25\n        Included two \"raw\" formats. One for separating GUI from\n        the setuid program, and one suitable for later parsing and\n        displaying. Volunteers wanted to separate the GTK\n        backend. Thanks to Bertrand Leconte for contributing\n        the format that's now called \"split\".\n\n  v0.24\n        Fixed number of probes. Accidentally was counted per\n        packet sent instead of per round of packets.\n\n  v0.23\n        Fixed Sparc alignment problem with statmalloc\n\n  v0.22\n        Roger has take over maintenance.\n        mtr now uses an \"int\" to pass options to the kernel.\n        Makes things work on Solaris and *BSD I'm told.\n        mtr doesn't fire off a flurry of packets when a new\n        second comes around. Instead they are spaced evenly\n        around the whole second. This allows people with a\n        relatively slow first link to do meaningful measurements\n        of whatever is behind that.\n\n  v0.21\n        mtr now drops root permissions after it acquires the raw\n        sockets it needs.\n        mtr should be a bit happier about building under SCO and\n        Solaris.\n        Fixed the problem with packets arriving after a reset.\n\n  v0.20\n        The build process for mtr now uses automake.\n        Fixed a build problem for Irix.\n        Now uses non-blocking DNS code, so mtr can attempt\n        to do reverse lookup on multiple hosts at once.\n        Fewer packets are sent out each cycle, so mtr\n        doesn't hog quite so much bandwidth.\n\n  v0.19\n        Fixed a type-o in curses.c\n\n  v0.18\n        Fixed the network code to work properly under FreeBSD.\n        Hopefully this will fix some other operating systems too.\n        Also, fixed a build problem and the DNS hanging bug.\n\n  v0.17\n        Fixed the configure script to always like with the math\n        library.  Added an icon.\n\n  v0.16\n        Added one #include to select.c.  Some people were unable\n        to build mtr without this line.\n\n  v0.15\n        Both the build process and the networking code have\n        been cleaned up and reorganized.  mtr now builds\n        cleanly with GTK+ 0.99.8.\n\n--- Below is the contents of the old \"Changelog file\" that annoyed some\npeople as it didn't contain any recent changes/news.\n\n2002-03-06  Cougar <cougar@random.ee>\n        + If hop doesn't respond, draw its name in red (GTK) or bold (curses)\n\n2002-02-09  bodq  <bohdan@vstu.edu.ua>\n        + Added --address option to bind to given IP address\n\n2001-04-15  root  <alane@geeksrus.net>\n        + Added this file so that automake won't complain.\n        + Commented out the test for res_init in configure.in;\n        it does not work for GLIBC2 systems (e.g., RedHat 7+).\n        + Fixed the subordinate CHECK_LIBS on the test for res_mkquery,\n        so that they test for res_mkquery, not res_init.\n\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.1123046875,
          "content": "WHAT IS MTR?\n===\n\nmtr combines the functionality of the 'traceroute' and 'ping' programs\nin a single network diagnostic tool.\n\nAs mtr starts, it investigates the network connection between the host\nmtr runs on and a user-specified destination host.  After it\ndetermines the address of each network hop between the machines,\nit sends a sequence of ICMP ECHO requests to each one to determine the\nquality of the link to each machine.  As it does this, it prints\nrunning statistics about each machine.\n\nmtr is distributed under the GNU General Public License version 2.\nSee the COPYING file for details.\n\nINSTALLING\n===\n\nIf you're building this from a tarball, compiling mtr is as\nsimple as:\n\n\t./configure && make\n\nPlease note that this refers to the tarballs from\n https://www.bitwizard.nl/mtr/files/\nand not the tarballs that github can produce.\n\n(in the past, there was a Makefile in the distribution that did\nthe `./configure` for you and then ran make again with the generated\nMakefile, but this has suffered some bitrot. It didn't work well\nwith git.)\n\nIf you're building from the git repository, you'll need to run:\n\n\t./bootstrap.sh && ./configure && make\n\nWhen it looks as if the compilation was successful, you can\ntest mtr with\n\n\tsudo ./mtr <host>\n\n(fill in a hostname or IP address where it says <host>) or\nimmediately continue on to installing:\n\n\tmake install\n\nNote that mtr-packet must be suid-root because it requires access to\nraw IP sockets.  See SECURITY for security information.\n\nOlder versions used to require a non-existent path to GTK for a\ncorrect build of a non-gtk version while GTK was installed. This is\nno longer necessary. `./configure --without-gtk` should now work.\nIf it doesn't, try `make WITHOUT_X11=YES` as the make step.\n\nOn Solaris, you'll need to use GNU make to build.\n(Use `gmake` rather than `make`.)\n\nOn Solaris (and possibly other systems) the \"gtk\" library may be\ninstalled in a directory where the dynamic linker refuses to look when\na binary is setuid. Roman Shterenzon reports that adding\n        -Wl,-rpath=/usr/lib\nto the commandline will work if you are using gnu LD. He tells me that\nyou're out of luck when you use the sun LD. That's not quite true, as\nyou can move the gtk libraries to `/usr/lib` instead of leaving them in\n`/usr/local/lib`.  (when the ld tells you that `/usr/local/lib` is untrusted\nand `/usr/lib` is trusted, and you trust the gtk libs enough to want them\nin a setuid program, then there is something to say for moving them\nto the \"trusted\" directory.)\n\nBuilding on MacOS should not require any special steps.\n\nUSING MTR ON WINDOWS\n===\n\nUsing mtr on Windows requires Windows Subsystem for Linux (WSL).  \nTo install WSL with Ubuntu distribution (Default), see\n[How to install Linux on Windows with WSL](https://learn.microsoft.com/en-us/windows/wsl/install).\n\nAfter complete initial process,\nsimple as:\n\n\tsudo apt-get -y install mtr\n\n\n\nBUILDING FOR WINDOWS (TRADITIONAL METHOD)\n===\n\nIf you prefer traditional method.\nObtain Cygwin, see\nhttps://cygwin.com/install.html.\n\nNext, re-run cygwin's `setup-x86.exe` (or `setup-x86_64.exe` if you're using 64bit cygwin) with the following arguments,\n\nwhich will install the packages required for building:\n\n        setup-x86.exe --package-manager --wait --packages automake,pkg-config,make,gcc-core,libncurses-devel,libjansson-devel\n\nBuild as under Unix:\n\n        ./bootstrap.sh && ./configure && make\n\nFinally, install the built binaries:\n\n        make install\n\n\n\n\nWHERE CAN I GET THE LATEST VERSION OR MORE INFORMATION?\n===\n\nmtr is now hosted on github.\nhttps://github.com/traviscross/mtr\n\nSee the mtr web page at http://www.BitWizard.nl/mtr/\n\nBug reports and feature requests should be submitted to the Github bug tracking system.\n\nPatches can be submitted by cloning the Github repository and issuing\na pull request, or by email to me. Please use unified diffs. Usually\nthe diff is sort of messy, so please check that the diff is clean and\ndoesn't contain too much of your local stuff (for example, I don't\nwant/need the \"configure\" script that /your/ automake made for you).\n\n(There used to be a mailinglist, but all it got was spam. So\nwhen the server was upgraded, the mailing list died.)\n\n\nREW\n"
        },
        {
          "name": "SECURITY",
          "type": "blob",
          "size": 2.4208984375,
          "content": "SECURITY ISSUES RELATED TO MTR\n\nmtr invokes a sub-process, mtr-packet, which requires extra privileges\nto send custom packets, and there are security implications from\ngranting this.\n\nThere are several different ways to provide the privileges:\n\n1. Add limited privileges on systems that support this. (Preferred.)\n2. Run mtr as the root user.\n3. Make mtr-packet a setuid-root binary.\n\nDetails:\n\n1. Add limited privileges on systems that support this.\n\nSome operating systems allow binaries to be run with only the subset\nof security privileges that are actually needed.\n\nLinux:\nOn Linux, privileges are known as capabilities. The only additional\ncapability that mtr-packet needs is cap_net_raw. To give this\ncapability to the mtr-packet binary, run the following command as root:\n\n# setcap cap_net_raw+ep mtr-packet\n\n\n2. Run mtr as the root user.\n\nYou can limit mtr usage to the root user by not putting a setuid bit\non the mtr-packet binary. In that case, the security implications are\nminimal.\n\n\n3. Make mtr-packet a setuid-root binary.\n\nThe mtr-packet binary can be made setuid-root, which is what \"make install\"\ndoes only if using setcap (above) fails.  Using setcap is tried first.\n\nWhen mtr-packet is installed as suid-root, some concern over security is\njustified.  mtr-packet does the following two things after it is launched:\n\n*  mtr-packet open sockets for sending raw packets and for receiving\n   ICMP packets.\n*  mtr-packet drops root privileges by setting the effective uid to\n   match uid or the user calling mtr.\n*  If capabilities support is available, mtr-packet drops all privileged\n   capabilities.\n\nSee main() in packet.c and init_net_state_privileged() in probe_unix.c\nfor the details of this process.\n\nThis should limit the possibilities of using mtr to breach system security.\nThe worst case scenario is as follows:\n\nDue to some oversight in the mtr-packet code, a malicious user is able to\noverrun one of mtr-packets's internal buffers with binary code that is\neventually executed.  The malicious user is still not able to read\nfrom or write to any system files other than those normally accessible\nby the user running mtr.  The only privileges gained are access to the raw\nsocket, which would allow the malicious user to listen to all ICMP packets\narriving at the system, and to send forged packets with arbitrary contents.\n\n\nIf you have further questions or comments about security issues,\nplease see the README file for details on how to submit them.\n"
        },
        {
          "name": "TODO",
          "type": "blob",
          "size": 4.484375,
          "content": "Hi everyone,\n\nThis is the \"todo\" file for mtr. I just realized that some people\nmight think that this is all in MY queue to implement. That is not\ntrue: This is the \"for everybody\" todo list. Feel free to pick a\n\"project\" and implement something off this list.\n\nStudents: Feel free to take up one of these as a programming exercise\nfor one of your courses.\n\nEverybody: If you want to start on something, contact me first, so\nthat the effort isn't wasted by someone who finishes just a tad\nearlier. I'll happily provide \"coaching\" to anyone who wants to\nimplement something on this list. That way we get the design of\nthese things the way I like them. This should result in a better\nmaintainable mtr.\n\nOh, Feel free to provide suggestions for this list.\n\n\n-- REW\n\n----------------------------------------------------------------------\n\n- cleanup\n  - cleanup warnings that the newer GCC produces.\n\n- Stuff to implement:\n\n  - Allow mtr to log the return packets, for later analysis.\n    Done: 0.25 . Todo: allow the user interface(s) to work while\n    still logging to a file. Write a \"logfile displaying\" mode to\n    mtr.\n\n  - Request timestamping at the remote site.\n       Andreas Fasbender has an algorithm that will allow us to\n       convert these measurements into one-way measurements, not just\n       round-trip.\n\n  - allow \"keyboard navigation\" in the GTK version.\n\n  - Keep all packets and make the \"best\" and \"worst\" columns show the\n    xx-th percentile....\n\n  - Being able to expand the \"column width\" of the hosts listed would\n    be nice, too.\n\n  - Display per host stats when multiple servers respond at a particular\n    hop count.\n\n\n- Bugs to fix?\n\n  - Do something useful if host couldn't be resolved.\n       -- Done.\n\n  - Revert to curses mode even if DISPLAY is set, but a problem\n    prevents us from running in X11 mode.\n       -->  The problem is that gtk_init simply calls exit for us if\n            it finds a problem. Tricky! Suggestions welcome.\n       --> Call \"gtk_check_init\" when available. (i.e. new enough\n           (1.2?) GTK version).\n\n- Nice to have:\n\n  - stop sending packets when a new host is getting entered.\n\n  - Show state (\"looking up host\") while doing the DNS lookup for a new\n    host.\n\n  - to have a choice of icmp, tcp, and udp pings. -- Matt Martini\n\n  - Autoconf 2.13 has a neat function that can be used to find the\n    res_init function:\n\n\t   AC_SEARCH_LIBS(res_init, bind resolv, ,\n\t      AC_MSG_ERROR(No resolver library found))\n\n    At the moment (march 1999) autoconf 2.13 is still too new to require\n    everyone to upgrade. About a year from now we can put this in....\n\n  - Implement rfc2317 mechanism to do reverse lookups for networks that\n    have DNS delegations on non-octet boundaries. -- Daniel Bergstrom\n    (noa@melody.se)\n\n  - The longer MTR runs, the less meaningful the packet loss\n    statistic. Or more meaningful, depending on your point of view.\n    Perhaps MTR should use a circular buffer of some configurable\n    number of results, and calculate the loss against that. -- Jacob Elder\n\n  - It would be nice if the window size wasn't fixed. If I'm only 5\n    hops from the host I'm monitoring, MTR wastes a lot of screen real\n    estate. -- Jacob Elder\n\n  - Colors in the curses version. -- Amix\n\n  - If we run a mtr to monitor a connection it would be nice if the time at\n    which mtr was started is print somewhere. -- Sebastian Ganschow\n\n\n\n------------------------------------------------------------------------\n\nThings that shouldn't be on the TODO list because they're done. ;-)\n\n  - Allow a toggle between hostname/IP number display. (for example a\n    click on the hostname could revert to ip number display in gtk version.\n    curses: \"n\" key toggles hostnames/ipnumbers?)\n\n  - Allow mtr to also send larger packets.\n       This will enable us to get a feel for the speed of the links\n       we're traversing. (Van Jacobson was working on this His tool\n       was slow, mtr will rock with this feature.... :-)\n       (Anybody have the statistics experience to tell me how\n       to do the data analysis?)\n\t-- DONE. Thanks to Olav Kvittem ...\n\n  - The \"don't probe all hosts at once\" strategy can be improved a bit.\n    It should not probe more than 10 unknown hosts, but the counter need\n    not be reset at the start of the \"round\". This way if you probe\n    slowly (relative to the RTT time to the end host), it can probe\n    all hosts in the first \"round\".\n       -- DONE.\n\n  - Read environment variable \"MTR_DEFAULTS\" as a commandline before\n    parsing the commandline.  -- DONE. (ok it's MTR_OPTIONS.)\n"
        },
        {
          "name": "bash-completion",
          "type": "tree",
          "content": null
        },
        {
          "name": "bootstrap.sh",
          "type": "blob",
          "size": 0.0986328125,
          "content": "#!/bin/sh\n\naclocal $ACLOCAL_OPTS\nautoheader\nautomake --add-missing --copy --foreign\nautoconf --force\n"
        },
        {
          "name": "build-aux",
          "type": "tree",
          "content": null
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 8.1005859375,
          "content": "AC_PREREQ([2.59])\nAC_INIT([mtr],\n  [m4_esyscmd([build-aux/git-version-gen .tarball-version])],\n  [R.E.Wolff@BitWizard.nl], [],\n  [http://www.BitWizard.nl/mtr/])\nAC_CONFIG_SRCDIR([ui/mtr.c])\nAC_CONFIG_AUX_DIR([build-aux])\nAC_USE_SYSTEM_EXTENSIONS\nAM_INIT_AUTOMAKE([\n  1.7.9\n  foreign\n  subdir-objects\n])\n\n# --enable-silent-rules\nm4_ifdef([AM_SILENT_RULES],\n  [AM_SILENT_RULES([yes])],\n  [AC_SUBST([AM_DEFAULT_VERBOSITY], [1])])\n\nAC_CANONICAL_HOST\nAC_PROG_CC\n\n# Check pkg-config availability.\nm4_ifndef([PKG_CHECK_MODULES], [m4_defun([PKG_CHECK_MODULES], [AC_MSG_ERROR(\n[Could not locate the pkg-config autoconf macros.  These are usually located\nin /usr/share/aclocal/pkg.m4.  If your macros are in a different location,\ntry setting the environment variable ACLOCAL_OPTS=\"-I/other/macro/dir\"\nbefore running ./bootstrap.sh again, or configure --without-gtk --without-jansson ])])\n])\nPKG_PROG_PKG_CONFIG\n\nAM_CONDITIONAL([CYGWIN], [test \"$host_os\" = cygwin])\nAM_COND_IF([CYGWIN],\n           [AC_DEFINE([USING_CYGWIN], [1], [Building Under Cygwin.])],\n           [])\n\n# Check bytes in types.\nAC_CHECK_SIZEOF([unsigned char], [1])\nAC_CHECK_SIZEOF([unsigned short], [2])\nAC_CHECK_SIZEOF([unsigned int], [4])\nAC_CHECK_SIZEOF([unsigned long], [4])\n\n# Check headers.\nAC_CHECK_HEADERS([ \\\n  arpa/nameser_compat.h \\\n  curses.h \\\n  cursesX.h \\\n  error.h \\\n  fcntl.h \\\n  linux/icmp.h \\\n  linux/errqueue.h \\\n  ncurses.h \\\n  ncurses/curses.h \\\n  netinet/in.h \\\n  socket.h \\\n  sys/cdefs.h \\\n  sys/limits.h \\\n  sys/socket.h \\\n  stdio_ext.h \\\n  sys/types.h \\\n  sys/xti.h \\\n  values.h \\\n])\n\n# Check functions.\nAC_CHECK_FUNCS([ \\\n  __fpending \\\n  fcntl \\\n])\n\nAC_CHECK_FUNC([error], [with_error=no],\n  [AC_CHECK_FUNCS([verr verrx vwarn vwarnx], [with_error=yes],\n    [AC_MSG_ERROR([cannot find working error printing function])\n  ])\n])\nAM_CONDITIONAL([WITH_ERROR], [test \"x$with_error\" = \"xyes\"])\n\nAC_CHECK_FUNC([getopt_long], [with_getopt=no], [with_getopt=yes])\nAS_IF([test \"x$with_getopt\" = \"xno\"], [\n  AC_DEFINE([HAVE_GETOPT], [1], [Define if libc has getopt_long])\n])\nAM_CONDITIONAL([WITH_GETOPT], [test \"x$with_getopt\" = \"xyes\"])\n\nAC_CHECK_LIB([m], [floor], [], [AC_MSG_ERROR([No math library found])])\n\n# libasan\nAC_ARG_WITH([libasan],\n [AS_HELP_STRING([--with-libasan], [Build with AddressSanitizer])],\n [with_libasan=yes], [])\nAM_CONDITIONAL([WITH_LIBASAN], [test \"x$with_libasan\" = \"xyes\"])\n\n# Find GTK\nAC_ARG_WITH([gtk],\n  [AS_HELP_STRING([--without-gtk], [Build without the GTK+ interface])],\n  [], [with_gtk=yes])\nAS_IF([test \"x$with_gtk\" = \"xyes\"],\n  [PKG_CHECK_MODULES([GTK], [gtk+-3.0],\n    [AC_DEFINE([HAVE_GTK], [1], [Define if gtk+ library available])]\n      [AC_DEFINE([HAVE_GTK3], [1], [Define if gtk+-3.0 library available])],\n    [PKG_CHECK_MODULES([GTK], [gtk+-2.0],\n      [AC_DEFINE([HAVE_GTK], [1], [Define if gtk+ library available])],\n      [with_gtk=no])])\n])\nAM_CONDITIONAL([WITH_GTK], [test \"x$with_gtk\" = xyes])\n\nAC_ARG_WITH([jansson],\n  [AS_HELP_STRING([--without-jansson], [Build without JSON output])],\n  [], [with_jansson=yes])\nAS_IF([test \"x$with_jansson\" = \"xyes\"],\n  [PKG_CHECK_MODULES([JANSSON], [jansson],\n    [AC_DEFINE([HAVE_JANSSON], [1], [Define if jansson library available])],\n    [with_jansson=no])\n])\n\n# Find ncurses\nAC_ARG_WITH([ncurses],\n  [AS_HELP_STRING([--without-ncurses], [Build without the ncurses interface])],\n  [], [with_ncurses=yes])\nAS_IF([test \"x$with_ncurses\" = \"xyes\"],\n\n  # Prefer ncurses over curses, if both are available.\n  # (On Solaris 11.3, ncurses builds and links for us, but curses does not.)\n  [AC_SEARCH_LIBS(\n    [initscr], [ncurses curses],\n    [AC_DEFINE([HAVE_CURSES], [1], [Define if a curses library available])],\n    [with_ncurses=no])\n])\nAM_CONDITIONAL([WITH_CURSES], [test \"x$with_ncurses\" = xyes])\n\nhave_cap=\"yes\"\nAC_CHECK_LIB([cap], [cap_set_proc], [], [\n  have_cap=\"no\"\n  AS_IF([test \"$host_os\" = linux-gnu], [\n    AC_MSG_WARN([Capabilities support is strongly recommended for increased security.  See SECURITY for more information.])\n  ])\n])\n\n# Enable ipinfo\nAC_ARG_WITH([ipinfo],\n  [AS_HELP_STRING([--without-ipinfo], [Do not try to use ipinfo lookup at all])],\n  [], [with_ipinfo=yes])\nAM_CONDITIONAL([WITH_IPINFO], [test \"x$with_ipinfo\" = \"xyes\"])\nAS_IF([test \"x$with_ipinfo\" = \"xyes\"], [\n  AC_DEFINE([HAVE_IPINFO], [1], [Define when ipinfo lookups are in use])\n])\n\nAC_ARG_ENABLE([ipv6],\n  [AS_HELP_STRING([--disable-ipv6], [Do not enable IPv6])],\n  [WANTS_IPV6=$enableval], [WANTS_IPV6=yes])\n\nAS_IF([test \"x$WANTS_IPV6\" = \"xyes\"], [\n  AC_DEFINE([ENABLE_IPV6], [1], [Define to enable IPv6])\n  USES_IPV6=yes\n])\n\nAC_CHECK_FUNC([socket], [],\n  [AC_CHECK_LIB([socket], [socket], [], [AC_MSG_ERROR([No socket library found])])])\n\nAC_CHECK_FUNC([gethostbyname], [],\n  [AC_CHECK_LIB([nsl], [gethostbyname], [], [AC_MSG_ERROR([No nameservice library found])])])\n\n# Find resolver library.\nAC_CHECK_FUNC([res_query], [RESOLV_LIBS=\"\"], [\n  AC_CHECK_LIB([resolv], [__res_query], [RESOLV_LIBS=\"-lresolv\"], [\n    AC_CHECK_LIB([resolv], [res_query], [RESOLV_LIBS=\"-lresolv\"], [\n      AC_CHECK_LIB([bind], [res_query], [RESOLV_LIBS=\"-lbind\"], [\n        AC_MSG_ERROR([No resolver library found])\n      ])\n    ])\n  ])\n])\ndnl MacOS has res_query in libc, but needs libresolv for dn_expand().\nAS_IF([test \"x\" = \"x$RESOLV_LIBS\"], [\n  AC_CHECK_LIB([resolv], [dn_expand], [RESOLV_LIBS=\"-lresolv\"])\n])\nAC_SUBST([RESOLV_LIBS])\n\n# Check errno and socket data types.\nAC_CHECK_DECLS([errno], [], [], [[\n#include <errno.h>\n#include <sys/errno.h>\n  ]])\n\nAC_CHECK_TYPE([socklen_t],\n  [AC_DEFINE([HAVE_SOCKLEN_T], [], [Define if your system has socklen_t])], [],\n  [[#include <netinet/in.h>\n#ifdef HAVE_SOCKET_H\n#include <socket.h>\n#endif\n#ifdef HAVE_SYS_SOCKET_H\n#include <sys/socket.h>\n#endif]])\n\nAC_CHECK_TYPES([time_t], [], [], [[\n#include <time.h>\n]])\n\n# Add C flags to display more warnings\nAC_MSG_CHECKING([for C flags to get more warnings])\nac_save_CFLAGS=\"$CFLAGS\"\n\nAS_IF([test \"x$ac_cv_c_compiler_gnu\" = \"xyes\"], [\n  dnl gcc is the easiest C compiler\n  warning_CFLAGS=\"-Wall\"\n  # Check if compiler supports -Wno-pointer-sign and add it if supports\n  CFLAGS_saved=\"$CFLAGS\"\n  CFLAGS=\"$CFLAGS -Wno-pointer-sign\"\n  AC_COMPILE_IFELSE([AC_LANG_SOURCE([[int foo;]])],\n    [warning_CFLAGS=\"${warning_CFLAGS} -Wno-pointer-sign\"], [])\n  CFLAGS=\"$CFLAGS_saved\"\n], [\n  dnl Vendor supplied C compilers are a bit tricky\n  AS_CASE([$host_os],\n    dnl SGI IRIX with the MipsPRO C compiler\n    [irix*], [\n      CFLAGS=\"$CFLAGS -fullwarn\"\n      AC_COMPILE_IFELSE([\n        AC_LANG_PROGRAM(\n          [[#include <stdio.h>]],\n          [[printf(\"test\");]])],\n        [warning_CFLAGS=\"-fullwarn\"], []\n      )\n    ],\n    dnl SunOS 4.x with the SparcWorks(?) acc compiler\n    [sunos*], [\n      AS_IF([test \"$CC\" = \"acc\"], [\n        CFLAGS=\"$CFLAGS -vc\"\n        AC_COMPILE_IFELSE([\n          AC_LANG_PROGRAM(\n            [[#include <stdio.h>]],\n            [[printf(\"test\");]])],\n          [warning_CFLAGS=\"-vc\"], []\n        )\n      ])\n    ]\n    dnl Unknown, do nothing\n    [*], [\n      warning_CFLAGS=\"none\"\n    ]\n  )\n])\nCFLAGS=\"$ac_save_CFLAGS\"\n\nAS_IF([test \"$warning_CFLAGS\" = \"none\"], [\n  AC_MSG_RESULT([none])\n], [\n  CFLAGS=\"$CFLAGS $warning_CFLAGS\"\n  AC_MSG_RESULT([$warning_CFLAGS])\n])\n\n# bash-completion\nAC_ARG_WITH([bashcompletiondir],\n  AS_HELP_STRING([--with-bashcompletiondir=DIR], [Bash completions directory]),\n  [],\n  [AS_IF([`$PKG_CONFIG --exists bash-completion`], [\n    with_bashcompletiondir=`$PKG_CONFIG --variable=completionsdir bash-completion`\n  ], [\n    with_bashcompletiondir=${datadir}/bash-completion/completions\n  ])\n])\nAC_SUBST([bashcompletiondir], [$with_bashcompletiondir])\nAC_ARG_ENABLE([bash-completion],\n  AS_HELP_STRING([--disable-bash-completion], [do not install bash completion files]),\n  [], [enable_bash_completion=yes]\n)\nAM_CONDITIONAL([BUILD_BASH_COMPLETION], [test \"x$enable_bash_completion\" = xyes])\necho \"build options:\"\necho \"--------------\"\necho \"libasan :$with_libasan\"\necho \"ipv6    :$USES_IPV6\"\necho \"ipinfo  :$with_ipinfo\"\necho \"ncurses :$with_ncurses\"\necho \"gtk     :$with_gtk\"\necho \"jansson :$with_jansson\"\necho \"cap     :$have_cap\"\necho \"libs    :$LIBS\"\necho \"cflags  :$CFLAGS\"\necho \"--------------\"\n# Prepare config.h, Makefile, and output them.\nAC_CONFIG_HEADERS([config.h])\nAC_CONFIG_FILES([Makefile])\nAC_OUTPUT\n"
        },
        {
          "name": "img",
          "type": "tree",
          "content": null
        },
        {
          "name": "man",
          "type": "tree",
          "content": null
        },
        {
          "name": "packet",
          "type": "tree",
          "content": null
        },
        {
          "name": "portability",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "ui",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}