{
  "metadata": {
    "timestamp": 1736710146917,
    "page": 803,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "center-for-threat-informed-defense/adversary_emulation_library",
      "stars": 1763,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.421875,
          "content": ".DS_Store\n\n# NuGet Packages\n*.nupkg\n# NuGet Symbol Packages\n*.snupkg\n# The packages folder can be ignored because of Package Restore\n**/[Pp]ackages/*\n# except build/, which is used as an MSBuild target.\n!**/[Pp]ackages/build/\n# Uncomment if necessary however generally it will be regenerated when needed\n#!**/[Pp]ackages/repositories.config\n# NuGet v3's project.json files produces more ignorable files\n*.nuget.props\n*.nuget.targets"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.8017578125,
          "content": "# Contributors\n\n## How to contribute\n\nThanks for contributing to the Adversary Emulation Library!\n\nYou are welcome to comment on issues, open new issues, and open pull requests.\n\nPull requests should target the **[develop](https://github.com/center-for-threat-informed-defense/adversary_emulation_library/tree/develop)** branch of the repository.\n\nAlso, if you contribute any source code, we need you to agree to the following Developer's Certificate of Origin below.\n\n## Reporting issues with emulation procedures\n\n* Describe (in detail) what should have happened. Include any supporting information that may be helpful in resolving the issue.\n\n* Be sure to include any steps to replicate the issue.\n\n## Developer's Certificate of Origin v1.1\n\n```\nBy making a contribution to this project, I certify that:\n\n(a) The contribution was created in whole or in part by me and I\n    have the right to submit it under the open source license\n    indicated in the file; or\n\n(b) The contribution is based upon previous work that, to the best\n    of my knowledge, is covered under an appropriate open source\n    license and I have the right under that license to submit that\n    work with modifications, whether created in whole or in part\n    by me, under the same open source license (unless I am\n    permitted to submit under a different license), as indicated\n    in the file; or\n\n(c) The contribution was provided directly to me by some other\n    person who certified (a), (b) or (c) and I have not modified\n    it.\n\n(d) I understand and agree that this project and the contribution\n    are public and that a record of the contribution (including all\n    personal information I submit with it, including my sign-off) is\n    maintained indefinitely and may be redistributed consistent with\n    this project or the open source license(s) involved.\n```\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 22.1865234375,
          "content": "# Adversary Emulation Library\r\n\r\nIn collaboration with Center Participants, the [Center for Threat-Informed Defense\r\n(Center)](https://ctid.mitre-engenuity.org/) maintains a library of adversary emulation\r\nplans to allow organizations to evaluate their defensive capabilities against the\r\nreal-world threats they face. Emulation plans are an essential component in testing\r\ncurrent defenses for organizations that are looking to prioritize their defenses around\r\nactual adversary behavior. Focusing our energies on developing a set of common emulation\r\nplans that are available to all means that organizations can use their limited time and\r\nresources to focus on understanding how their defenses actually fare against real-world\r\nthreats.\r\n\r\nThe library contains two types of adversary emulation plans: full emulation and micro\r\nemulation.\r\n\r\n**Full emulation plans** are a comprehensive approach to emulating a specific adversary,\r\ne.g. [FIN6](/fin6/), from initial access to exfiltration. These plans emulate a wide\r\nrange of ATT&CK tactics & techniques and are designed to emulate a real breach from the\r\ndesignated adversary.\r\n\r\n**Micro emulation plans** are a focused approach to emulating compound behaviors seen\r\nacross multiple adversaries, e.g. [webshells](/micro_emulation_plans/src/webshell).\r\nThese plans emulate a small amount of ATT&CK techniques that are typically performed as\r\npart of one adversary action.\r\n\r\nAlso see our blogs on the [Adversary Emulation\r\nLibrary](https://medium.com/mitre-engenuity/introducing-the-all-new-adversary-emulation-plan-library-234b1d543f6b)\r\nand [Micro Emulation\r\nPlans](https://medium.com/mitre-engenuity/ahhh-this-emulation-is-just-right-introducing-micro-emulation-plans-7bf4c26451d3).\r\n\r\nAvailable adversary emulation plans are listed below:\r\n\r\n| Full Emulation Plans          | Intelligence Summary                                                                                                                                                                                                                                                                                                                                                                                                   |\r\n| ---------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\r\n| [APT29](/apt29/)             | [APT29 is thought to be an organized and well-resourced cyber threat actor whose collection objectives appear to align with the interests of the Russian Federation...](/apt29/Intelligence_Summary.md)                                                                                                                                                                                                                |\r\n| [Blind Eagle](/blind_eagle/) | [Blind Eagle is a South American threat actor focused on Colombia-based institutions, including entities in the financial, manufacturing, and petroleum sectors. Largely opportunistic in their motives, Blind Eagle leverages commodity RATs modified to fit the environment...](/blind_eagle/Intelligence_Summary/Intelligence_Summary.md)                                                                           |\r\n| [Carbanak Group](/carbanak/) | [Carbanak is a threat group who has been found to manipulate financial assets, such as by transferring funds from bank accounts or by taking over ATM infrastructures...](/carbanak/Intelligence_Summary.md)                                                                                                                                                                                                           |\r\n| [FIN6](/fin6/)               | [FIN6 is thought to be a financially motivated cyber-crime group. The group has aggressively targeted and compromised high-volume POS systems in the hospitality and retail sectors since at least 2015...](/fin6/Intelligence_Summary.md)                                                                                                                                                                             |\r\n| [FIN7](/fin7/)               | [FIN7 is a financially-motivated threat group that has been associated with malicious operations dating back to late 2015. The group is characterized by their persistent targeting and large-scale theft of payment card data from victim systems...](/fin7/Intelligence_Summary.md)                                                                                                                                  |\r\n| [menuPass](/menu_pass/)      | [menuPass is thought to be threat group motivated by collection objectives, with targeting that is consistent with Chinese strategic objectives...](/menu_pass/Intelligence_Summary.md)                                                                                                                                                                                                                                |\r\n| [OceanLotus](/ocean_lotus/)  | [OceanLotus is a cyber threat actor aligning to the interests of the Vietnamese government. First seen in 2012, OceanLotus targets private corporations in the manufacturing, consumer product, and hospitality sectors as well as foreign governments, political dissidents, and journalists....](/ocean_lotus/Intelligence_Summary/Intelligence_Summary.md)                                              |\r\n| [OilRig](/oilrig/)           | [OilRig is a cyber threat actor with operations aligning to the strategic objectives of the Iranian government. OilRig has been operational since at least 2014 and has a history of widespread impact, with operations directed against financial, government, energy, chemical, telecommunications and other sectors around the globe...](/oilrig/Intelligence_Summary/Intelligence_Summary.md)                      |\r\n| [Sandworm](/sandworm/)      | [Sandworm Team is a destructive threat group attributed to Russia's General Staff of the Armed Forces, Main Intelligence Directorate (GRU) that has been reportedly active since 2009. Sandworm is known for conducting large scale, well funded, destructive, and aggressive campaigns such as Olympic Destroyer, CrashOverride/Industroyer, and NotPetya...](/sandworm/Intelligence_Summary/Intelligence_Summary.md) |\r\n| [Turla](/turla/)             | [Active since at least the early 2000s, Turla is a sophisticated Russian-based threat group that has infected victims in more than 50 countries. Turla leverages novel techniques and custom tooling and open-source tools to elude defenses and persist on target networks...](/turla/Intelligence_Summary/Intelligence_Summary.md)                                                                                   |\r\n| [Wizard Spider](/wizard_spider/) | [Wizard Spider is a Russia-based e-crime group originally known for the Trickbot banking malware. In August 2018, Wizard Spider added capabilities to their Trickbot software enabling the deployment of the Ryuk ransomware. This resulted in \"big game hunting\" campaigns, focused on targeting large organizations for high-ransom return rates.](/wizard_spider/Intelligence_Summary/Intelligence_Summary.md)..    |\r\n\r\n\r\n|                            Micro Emulation Plans                             | Intelligence Summary                                                                                                                                                                                                                                                                                                                                                                                                                                                  |\r\n| --------------------------------------------------------------------------- | --------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\r\n| [Active Directory Enumeration](/micro_emulation_plans/src/ad_enum/)      | Emulate multiple [TA0007 Discovery](https://attack.mitre.org/tactics/TA0007/) behaviors through commonly abused interfaces and services such as Active Directory (AD)                                                                                                                                                                                                                                                                                                 |\r\n| [Data Exfiltration](/micro_emulation_plans/src/data_exfil/)          | Emulates the compound behaviors of an adversary finding, staging, archiving, and extracting sensitive files, as described in [TA0010 Exfiltration](https://attack.mitre.org/tactics/TA0010/)                                                                                                                                                                                                                                                                          |\r\n| [DLL Sideloading](/micro_emulation_plans/src/dll_sideloading/)        | Emulates an adversary executing an otherwise legitimate/benign application in order to hijack its modules/libraries to instead inject their malicious payload, as described in [T1574.002 Hijack Execution Flow: DLL Side-Loading](https://attack.mitre.org/techniques/T1574/002/)                                                                                                                                                                                    |\r\n| [File Access and File Modification](/micro_emulation_plans/src/file_access/) | Emulate file access and modification behaviors commonly associated with [TA0009 Collection](https://attack.mitre.org/tactics/TA0009/) as well as [T1486 Data Encrypted for Impact](https://attack.mitre.org/techniques/T1486/). (Data source: [DS0022 File](https://attack.mitre.org/datasources/DS0022/))                                                                                                                                                            |\r\n| [Log Clearing](/micro_emulation_plans/src/log_clearing)            | Emulates an adversary clearing Windows Event Log, as described in [T1070.001 Indicator Removal: Clear Windows Event Logs](https://attack.mitre.org/techniques/T1070/001/)                                                                                                                                                                                                                                                                                             |\r\n| [Named Pipes](/micro_emulation_plans/src/named_pipes/)            | Emulates the creation and use of named pipes [commonly abused by malware](https://labs.withsecure.com/blog/detecting-cobalt-strike-default-modules-via-named-pipe-analysis/) (Data source: [DS0023 Named Pipe](https://attack.mitre.org/datasources/DS0023/))                                                                                                                                                                                                         |\r\n| [Process Injection](/micro_emulation_plans/src/process_injection/)      | Emulates the compound behavior of [T1055 Process Injection](https://attack.mitre.org/techniques/T1055/) followed by execution of arbitrary commands ([T1059 Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/))                                                                                                                                                                                                                           |\r\n| [Reflective Loading](/micro_emulation_plans/src/reflective_loading/)     | Emulates an adversary performing running malicious code within an arbitrary process to perform [T1620 Reflective Code Loading](https://attack.mitre.org/techniques/T1620/)                                                                                                                                                                                                                                                                                            |\r\n| [Remote Code Execution](/micro_emulation_plans/src/apache_rce/)        | Emulates an adversary performing remote code execution against a vulnerable web server as documented in [T1190 Exploit Public-Facing Application](https://attack.mitre.org/techniques/T1190/)                                                                                                                                                                                                                                                                         |\r\n| [User Execution](/micro_emulation_plans/src/user_execution/)         | Emulates the compound behavior of delivering a malicious `.one`, `.doc`, `.lnk`, or `.iso` file (e.g. via [T1566.001 Phishing: Spearphishing Attachment](https://attack.mitre.org/techniques/T1566/001/)) and then executing arbitrary commands after a user invokes the file ([T1204.002 User Execution: Malicious File](https://attack.mitre.org/techniques/T1204/002/) and [T1059 Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/)). |\r\n| [Web Shells](/micro_emulation_plans/src/webshell/)              | Emulates the compound behavior of planting a web shell ([T1505.003 Server Software Component: Web Shell](https://attack.mitre.org/techniques/T1505/003/)) and then executing arbitrary commands through it ([T1059 Command and Scripting Interpreter](https://attack.mitre.org/techniques/T1059/))                                                                                                                                                                    |\r\n| [Windows Registry](/micro_emulation_plans/src/windows_registry/)       | Emulates a few common methods that adversaries use to modify the Windows Registry. (Data Source: [DS0024 Windows Registry](https://attack.mitre.org/datasources/DS0024/))                                                                                                                                                                                                                                                                                             |\r\n## Philosophy\r\n\r\nThese adversary emulation plans are based on known-adversary behaviors and designed to\r\nempower red teams to manually emulate a specific threat actor in order to test and\r\nevaluate defensive capabilities from a threat-informed perspective. This approach\r\nempowers defenders to operationalize cyber threat intelligence to better understand and\r\ncombat real-world adversaries. Rather than focusing on static signatures, these\r\nintelligence-driven emulation plans provide a repeatable means to test and tune\r\ndefensive capabilities and products against the evolving Tactics, Techniques, and\r\nProcedures (TTPs) of threat actors and malware.\r\n\r\n## Adversary Emulation Background\r\n\r\nAdversary emulation enables organizations to view their security through the eyes of a\r\ncyber adversary with the goal of improving defenses across the adversary’s lifecycle. As\r\ndefenders this expands our attention and focus beyond just the final actions of the\r\nadversary achieving their operational objective to rather understand and appreciate\r\nevery distinct behavior (that could have been detected and/or mitigated) leading up to\r\nthat point.\r\n\r\nEach emulation plan is rooted in intelligence reports and other artifacts that capture\r\nand describe breaches and campaigns publicly attributed to a specific named threat\r\nactor. To develop each plan, we research and model each threat actor, focusing not only\r\non what they do (ex: gather credentials from victims) but also how (using what specific\r\ntools/utilities/commands?) and when (during what stage of a breach?). We then develop\r\nemulation content that mimics the underlying behaviors utilized by the threat actor\r\n(i.e. not an exact representation, rather capturing the pertinent elements that\r\naccurately generate appropriate test telemetry for defenders). This approach results in\r\nnuanced emulation plans, each capturing unique scenarios and perspectives that we can\r\nleverage as threat-informed defenders.\r\n\r\n## Getting Started with Full Adversary Emulation Plans\r\n\r\nAs is the case with traditional red teaming and penetration testing, adversary emulation\r\nis a specific style of offensive assessment performed to help us test and tune our\r\ndefenses. In this case, our objective is to operationalize cyber threat intelligence\r\ndescribing behaviors observed in specific campaigns or malware samples. From this\r\nintelligence, we select and execute a subset of behaviors (and their variations) to\r\nassess our defenses from the perspective of the specific threat.\r\n\r\nAs described in the next section, each emulation plan captures specific threat\r\nscenarios. These scenarios can be executed end-to-end, or individual behaviors can be\r\ntested. Organizations can also choose to further customize the scenarios and/or\r\nbehaviors within each emulation plan to better fit their specific environment,\r\npriorities, or to be shaped by additional intelligence.\r\n\r\nIn summary, each full emulation plan should be perceived as input to an offensive\r\nassessment/red team. The content can be used as strict instructions to follow, or as\r\njust a starting point to be built upon and personalized.\r\n\r\n### Full Emulation Plan Structure\r\n\r\nEach emulation plan focuses on a specific named threat actor. The README of each\r\nindividual plan provides a curated summary of available cyber threat intelligence,\r\ncomposed of an intelligence overview of the actor (describing who they target, how, and\r\nwhy where possible) as well as the scope of their activity (i.e. breadth of techniques\r\nand malware used). All presented information is cited back to relevant publicly\r\navailable cyber threat intelligence and communicated and annotated via\r\n[ATT&CK](https://attack.mitre.org/).\r\n\r\nWithin each emulation plan, the operational flow provides a high-level summary of the\r\ncaptured scenario(s). These scenarios will vary based on the adversary and available\r\nintelligence, but typically follow a sequential progression of how the actor breaches\r\nthen works towards achieving their operational objectives within a victim environment\r\n(espionage, data/system destruction, etc.).\r\n\r\nThe content to execute the scenario(s) is broken down into step-by-step procedures\r\nprovided in both human and machine-readable formats. Scenarios can be executed\r\nend-to-end or as individual tests. The human-readable formats provide additional\r\nrelevant background where possible as well as any setup prerequisites, while the\r\nmachine-readable format is designed to be programmatically parsed (ex: read,\r\nreformatted, and ingested into an automated agent, such as\r\n[CALDERA](https://github.com/mitre/caldera) and/or breach simulation frameworks).\r\n\r\nDetailed documenation for our full emulation plan structure can be found\r\n[here.](/structure/emulation_plan_structure.md)\r\n\r\n## Getting Started with Micro Emulation Plans\r\n\r\nSimilar to full emulation plans, micro emulation plans are a type of adversary emulation\r\nthat is designed to help us test and tune our defenses. However, these plans can be\r\nexecuted without a red team and without the need for an offensive assessment. Each plan\r\nis still composed of an intelligence overview for the behaviors being emulated, however\r\nwe are emulating behaviors that are common across multiple adversaries as opposed to a\r\nsingular adversary.\r\n\r\nThese plans are easy to execute, with no dependencies needed or special configuration of\r\nyour environment. All plans can be executed from either a standalone or networked\r\nmachine. They can be executed manually or integrated into automation software. We have\r\nprovided an example of how to execute a plan with\r\n[CALDERA](/micro_emulation_plans/caldera-integration/), but these plans can be broadly\r\napplied to other platforms.\r\n\r\nEach micro plan has default runtime options, however, detailed instructions can be found\r\non the `README` for each plan on how to customize execution to fit your specific needs.\r\nWe have included the source code and `BUILD` instructions for each plan, so that they\r\ncan be modified and recompiled, as needed.\r\n\r\nThe micro plans can be downloaded from the [Releases\r\npage](https://github.com/center-for-threat-informed-defense/adversary_emulation_library/releases).\r\n\r\n## Future Work\r\n\r\nThe threat landscape changes every day, as new groups/malware emerge and known\r\nadversaries adapt and evolve. The Center will continue to populate and maintain this\r\nlibrary to match this growth curve through dedicated research efforts that aim to either\r\ncreate or update plans based on a specific adversary.\r\n\r\n## Questions and Feedback\r\n\r\nPlease submit issues for any technical questions/concerns or contact\r\nctid@mitre-engenuity.org directly for more general inquiries.\r\n\r\nAlso see the guidance for contributors if are interested in\r\n[contributing.](/CONTRIBUTING.md)\r\n\r\n## Liability / Responsible Usage\r\n\r\nThis content is only to be used with appropriate prior, explicit authorization for the\r\npurposes of assessing security posture and/or research.\r\n\r\n## Notice\r\n\r\nCopyright 2020-2021 MITRE Engenuity. Approved for public release. Document number CT0005\r\n\r\nLicensed under the Apache License, Version 2.0 (the \"License\"); you may not use this\r\nfile except in compliance with the License. You may obtain a copy of the License at\r\n\r\nhttp://www.apache.org/licenses/LICENSE-2.0\r\n\r\nUnless required by applicable law or agreed to in writing, software distributed under\r\nthe License is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY\r\nKIND, either express or implied. See the License for the specific language governing\r\npermissions and limitations under the License.\r\n\r\nThis project makes use of ATT&CK®\r\n\r\n[ATT&CK Terms of Use](https://attack.mitre.org/resources/terms-of-use/)\r\n"
        },
        {
          "name": "apt29",
          "type": "tree",
          "content": null
        },
        {
          "name": "blind_eagle",
          "type": "tree",
          "content": null
        },
        {
          "name": "carbanak",
          "type": "tree",
          "content": null
        },
        {
          "name": "fin6",
          "type": "tree",
          "content": null
        },
        {
          "name": "fin7",
          "type": "tree",
          "content": null
        },
        {
          "name": "menu_pass",
          "type": "tree",
          "content": null
        },
        {
          "name": "micro_emulation_plans",
          "type": "tree",
          "content": null
        },
        {
          "name": "ocean_lotus",
          "type": "tree",
          "content": null
        },
        {
          "name": "oilrig",
          "type": "tree",
          "content": null
        },
        {
          "name": "resources",
          "type": "tree",
          "content": null
        },
        {
          "name": "sandworm",
          "type": "tree",
          "content": null
        },
        {
          "name": "structure",
          "type": "tree",
          "content": null
        },
        {
          "name": "turla",
          "type": "tree",
          "content": null
        },
        {
          "name": "wizard_spider",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}