{
  "metadata": {
    "timestamp": 1736710006864,
    "page": 598,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "kiukotsu/ucore",
      "stars": 2111,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".dir-locals.el",
          "type": "blob",
          "size": 0.064453125,
          "content": "((c-mode . ((indent-tabs-mode . nil)\n\t    (c-basic-offset . 4))))\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1611328125,
          "content": "*~\nobj/\nbin/\n.gdb.in\n.qemu.out\ncscope.*\nncscope.*\ntags\n*swp\n.cproject\n.project\n*.bak\n*.org\n.codelite\n*.project\n*.workspace\na.out\n*.log\n*.exe\nchytesting\ndisk0\n*.orig\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 20.4638671875,
          "content": "\t\t    GNU GENERAL PUBLIC LICENSE\n\t\t       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.\n                       59 Temple Place, Suite 330, Boston, MA  02111-1307  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n\t\t\t    Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Library General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\f\n\t\t    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\f\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\f\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\f\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n\t\t\t    NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n\t\t     END OF TERMS AND CONDITIONS\n\f\n\t    How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) 19yy  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program; if not, write to the Free Software\n    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA\n\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) 19yy name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Library General\nPublic License instead of this License.\n--------------------------------------------------------------------------------------------\nCopyright (c) 2006-2007 Frans Kaashoek, Robert Morris, and Russ Cox\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n--------------------------------------------------------------------------------------------\nCopyright (c) 2000, 2001, 2002, 2003, 2004, 2005, 2008, 2009\n The President and Fellows of Harvard College.\n \n  Redistribution and use in source and binary forms, with or without\n  modification, are permitted provided that the following conditions\n  are met:\n  1. Redistributions of source code must retain the above copyright\n     notice, this list of conditions and the following disclaimer.\n  2. Redistributions in binary form must reproduce the above copyright\n     notice, this list of conditions and the following disclaimer in the\n     documentation and/or other materials provided with the distribution.\n  3. Neither the name of the University nor the names of its contributors\n     may be used to endorse or promote products derived from this software\n     without specific prior written permission.\n \n  THIS SOFTWARE IS PROVIDED BY THE UNIVERSITY AND CONTRIBUTORS ``AS IS'' AND\n  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n  ARE DISCLAIMED.  IN NO EVENT SHALL THE UNIVERSITY OR CONTRIBUTORS BE LIABLE\n  FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n  DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n  OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n  HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n  LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n  OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n  SUCH DAMAGE.\n-------------------------------------------------------------------------------------------"
        },
        {
          "name": "README-english.md",
          "type": "blob",
          "size": 5.642578125,
          "content": "INTRODUCTION(2015)\n============\nucore labs was used as OS Experiments in OS Course Of Dept. of Computer Science & Technology, Tsinghua University.\n\nucore is a teaching OS which is derived from xv6&jos in MIT, OS161 in Harvard and Linux.\nucore was developed and used in Department of Computer Science & Technology, Institute for Interdisciplinary Information Sciences, Tsinghua University.\nThe codes in the files that constitute xv6&jos are Copyright (2006-Current) Frans Kaashoek, Robert Morris, and Russ Cox and uses MIT License.\nThe codes in the files that constitute OS/161 are written by David A. Holland.\nThe codes in the files that constitute ucore are Copyright (2010-Current) Yu Chen, Naizheng Wang, Yong Xiang and uses GPL License.\nThe documents in the files that constitute ucore are Copyright (2010-Current) Yu Chen, Yong Xiang and uses Creative Commons Attribution/Share-Alike (CC-BY-SA) License. \n\nPEOPLES \n========\n\nOS course for Dept. CS. in Tsinghua Univ., and MOOC OS course\n-----------------------------------\nLectures: Chen, Yu   http://soft.cs.tsinghua.edu.cn/~chen\nTA: Qi, Xiao  qixiao0113@gmail.com\nTA: Mao, Junjie eternal.n08@gmail.com\n\nCONTENTS\n========\n\nos course info\n----------------\n* [newest os course summary materials](https://github.com/chyyuu/mooc_os)\n* [newest chinese README for ucore_lab](https://github.com/chyyuu/ucore_lab/)\n\nlabs info\n----------------\nlab0: preparing\nlab1: boot/protect mode/stack/interrupt\nlab2: physical memory management\nlab3: virtual memory management\nlab4: kernel thread management\nlab5: user process management\nlab6: scheduling\nlab7: mutex/sync\nlab8: filesystem\n\nWORK IN MS WINDOWS\n==================\nWorking in Linux is encouraged. But If you like to work in MS Windows, we provide virtual machine environment (Runnint Ubuntu in VirtualBox) in\nWindows to help you to finish the labs. If you don't want to install ubuntu and other softs to finish these labs in Windows, you can use \nVirtualBox soft (https://www.virtualbox.org/) and a virtual disk image with all these softs. Below example is shown how to setup lab environment in Windows.\nYou can download this virtual disk image -- oslabs_for_student_2012.zip (576.2MB,) from  http://pan.baidu.com/share/link?shareid=69868&uk=2585194235, which\nis an VirtualBox disk image (contains ubuntu 12.04 and needed softs, and is zipped with zip and xz format), and can be unzipped \nby haozip software (http://www.haozip.com). \nAfter unzip oslabs_for_student_XXX.zip, you will get \n---\nC:\\vms\\ubuntu-14.04.vbox.xz\nC:\\vms\\ubuntu-14.04.vmdk.vmdk.xz\nC:\\vms\\ubuntu-14.04.vmdk-flat.vmdk.xz\n---\nthen you will continue unzip all these files, and get\n---\nC:\\vms\\ubuntu-14.04.vbox\nC:\\vms\\ubuntu-14.04.vmdk.vmdk\nC:\\vms\\ubuntu-14.04.vmdk-flat.vmdk\n---\nIf you installed VirtualBox soft, then the last step is: double clik file \"ubuntu-12.04.vbox\" and run ubuntu 12.04 in VirtualBox.\nIn ubuntu 12.04 login Interface:\nusername: chy\npassword: <SPACE KEY>\n\nAfter you login, you will see the directory ucore_lab in HOME directory.\n\nTESTED ENVIRONMENT\n==================\nUBUNTU 14.04: GCC-4.8.2 CLANG-3.5\nFEDORA 20: GCC-4.8.2\n\nEXERCISE STEPS\n==============\n0 Get the newest os lab src codes/docs.(Insure you can connect to github in ubuntu running on VrtualBox)\n0.1 If you try to get all codes\n  $rm -rf ucore_lab\n  $git clone git://github.com/chyyuu/ucore_lab.git\n  $cd ucore_lab\n0.2 If you gloned ucore_lab and only try to get the updated codes\n  $cd ucore_lab\n  $git pull\n1 $cd labX  \n2 read codes (specially the modified or added files)\n3 add your code\n4 compile your code\n  $make\n5 check your code\n  $make qemu\nOR\n  $make grade\n\n6 debug your code\n  $make debug\n\n7 handin your code\n  $make handin\n\nOPTION\n==============\nNow, ucore suuport LLVM/Clang-3.5 + \nin step4:\n  $ USELLVM=1 make\nthen you will use clang to compile ucore\n\nGRADE/RANK\n==========\nSuperman: Finish all OS labs in one month by yourself\nMaster: Finish all OS labs in two month by yourself\nVeteran: Finish all OS labs in three month by yourself\nApprentice: Finish all OS labs in one semester with other guy's help\n \nRESOURCE REPOSITORY\n===================\nBasic OS labs (for students who learn OS course)\nThe newest lab codes and docs is in https://github.com/chyyuu/ucore_lab\n\nAdvanced OS labs (for OS geeks or hackers or guys with Superman/Master Rank)\nThe newest lab codes and docs is in https://github.com/chyyuu/ucore_plus\n\nLEARNING DISSCUSS GROUPS\n========================\n\nos learning group based on QQ \n-------------------------------\nQQ id: 181873534\n\ngeneral discuss\n--------------------------------\nIf you have any questions about ucore basic os labs, \nyou can subscribe to the Google Groups \"os-course\" group (http://groups.google.com/group/oscourse?hl=en.)\nTo post to this group, send email to oscourse@googlegroups.com.\nTo unsubscribe from this group, send email to oscourse+unsubscribe@googlegroups.com.\nFor more options, visit this group at http://groups.google.com/group/oscourse?hl=en.\n\nDEVELOPMENT DISCUSS GROUPS\n==========================\nIf you have any questions about ucore advanced os labs, \nIf you want to be a developer of ucore or pay attention to the development of ucore, \nyou can subscribe to the Google Groups \"ucore_dev\" group (http://groups.google.com/group/ucore_dev?hl=en.)\nTo post to this group, send email to ucore_dev@googlegroups.com.\nTo unsubscribe from this group, send email to ucore_dev+unsubscribe@googlegroups.com.\nFor more options, visit this group at http://groups.google.com/group/ucore_dev?hl=en.\n\nUCORERS (Contributors)\n======================\nJunjie Mao, Yuheng Chen, Cong Liu, Yang Yang, Zhun Qu, Shengwei Ren, Wenlei Zhu, Cao Zhang, Tong Sen, Xu Chen, \nCang Nan, Yujian Fang, Wentao Han, Kaichen Zhang, Xiaolin Guo, Tianfan Xue, Gang Hu, Cao Liu, Yu Su,Xinhao Yuan, ...\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.7177734375,
          "content": "# 介绍(2015)\n\nuCore OS Labs是用于清华大学计算机系本科操作系统课程的教学试验内容。\n\n# 提前测试\n[计算机基础导论实验](https://github.com/chyyuu/v8-cpu)是提供给清华大学计算机系大一新生必需课“计算机基础导论”的一个在线实验环境，适合初步了解计算机系统/编程/操作系统等基础知识，欢迎大家先看看。如果你觉得这些小练习你能够应对自如，欢迎挑战这门课程的实验！\n\n# 实验总体流程\n1. 在[学堂在线](https://www.xuetangx.com/courses/TsinghuaX/30240243X/2015_T1/about)查看OS相关原理和labX的视频；\n2. 可进一步在[学堂在线](https://www.xuetangx.com/courses/TsinghuaX/30240243X/2015_T1/info)或[在线操作系统课程练习题](https://www.gitbook.io/book/xuyongjiande/os_exercises)完成相关的练习题；如碰到问题，在[在线OS课程问题集](http://xuyongjiande.gitbooks.io/os-qa/)查找是否已经有解答；\n3. 在[实验指导书 on gitbook](http://objectkuan.gitbooks.io/ucore-docs/)上阅读实验指导书，并参考其内容完成练习和实验报告；\n4. 在实验环境中完成实验并提交实验到git server（清华学生需要在学校内部的git server上，其他同学可提交在其他git server上）；\n5. 每天（一周七日）都有助教或老师在piazza在线答疑。如在[在线OS课程问题集](http://xuyongjiande.gitbooks.io/os-qa/)没找到解答，可到[piazza在线OS课程问答和交流区](https://piazza.com/tsinghua.edu.cn/spring2015/30240243x/home)提问。（QQ群 181873534主要用于本课程和OS相关事件发布，以及各种一般性交流）；\n\n\n## 四种学习目标和对应手段\n1. 略知OS基本概念：看在线课程原理部分的视频，可大致知道OS的概念；\n2. 理解OS基本原理：在1的基础上，完成[学堂在线练习题](https://www.xuetangx.com/courses/TsinghuaX/30240243X/2015_T1/info)和[与OS原相关的在线操作系统课程练习题](https://www.gitbook.io/book/xuyongjiande/os_exercises)，可理解OS基本原理\n3. 掌握OS设计实现：在2的基础上，能够通过编程完成labcodes的8个lab实验中的基本练习和实验报告\n4. 深入OS核心功能：在3的基础上，能够通过编程完成labcodes的8个lab实验中的challenge练习\n5. 体验OS科学研究：在4的基础上，能够通过阅读论文、设计、编程、实验评价等过程来完成课程设计（大实验）\n\n【**注意**】\n  - **筑基内功**--请提前学习计算机原理、C语言、数据结构课程\n  - **工欲善其事，必先利其器**--请掌握七种武器  [实验常用工具列表](https://github.com/objectkuan/ucore_docs/blob/master/lab0/lab0_ref_ucore-tools.md)\n  - **学至于行之而止矣**--请在实验中体会操作系统的精髓\n  - **打通任督二脉**--lab1和lab2与x86硬件相关性较大，比较困难，有些同学由于畏难而止步与此，很可惜！仅仅熟读内功心法是不够的，通过实践lab1和lab2后，对计算机原理中的中断、段页表机制、特权级等的理解会更深入和贴近实际，这等同于打通了任督二脉，后面的实验将一片坦途。\n  \n \n# 实验内容\n## 实验指导书\n - [实验指导书 on gitbook](http://objectkuan.gitbooks.io/ucore-docs/) \n - [实验常用工具列表](https://github.com/objectkuan/ucore_docs/blob/master/lab0/lab0_ref_ucore-tools.md)\n\n> 【提醒】对于实验中的开发: `git`, `gcc`,`gdb`,`qemu`,`make`,`diff & patch`, `bash shell`这些重要工具的基本用法是需要提前掌握的.\n\n> [实验指导书 on gitbook](http://objectkuan.gitbooks.io/ucore-docs/)中会存在一些bug，欢迎在在[piazza在线OS课程问答和交流区](https://piazza.com/tsinghua.edu.cn/spring2015/30240243x/home)提出，会有奖分！\n\n## 实验题目\n\n1. lab0 ：熟悉实验环境\n1. lab1 ：启动操作系统\n1. lab2 ：物理内存管理\n1. lab3 ：虚拟内存管理\n1. lab4 ：内核线程\n1. lab5 ：用户进程\n1. lab6 ：处理器调度\n1. lab7 ：同步互斥\n1. lab8 ：文件系统\n\n\n## 实验环境\nucore OS实验主要在Linux环境下开发，有如下五种方法。\n\n### 一、[在线实验--基于\"实验楼\"在线平台](http://www.shiyanlou.com/courses/221)\n特点：不用在本机配置环境或安装虚拟机，你需要的是可以可以上网的网络浏览器，实验都可在网上完成！感谢[实验楼](http://www.shiyanlou.com/)提供的支持！\n\n### 二、Windows下基于MingW进行实验\n特点：可在Windows环境下完成实验。不用安装Linux，只需在Windows上安装相关软件即可。\n\n- [windows下的ucore实验环境安装包](http://pan.baidu.com/s/1qWPtHxy)：下载安装即可。感谢杨海宇同学提供！\n- [windows下手动配置ucore实验环境说明文档](http://pan.baidu.com/s/1i3JxZZR)：看你的安装能力。感谢“下来障”同学提供！\n\n[NOTICE] 没有足够的技术支持，希望有感兴趣的生成一个安装软件包和中文使用说明，方便大家使用！\n\n### 三、Windows下基于VirtualBox or VMWare进行实验\n特点：可在Windows环境下完成实验。不用安装Linux，安装VirtualBox等虚拟机软件即可，可以用已经配好环的虚拟硬盘。安装简单，但性能受一定影响。\n\n#### 1. 安装VirtualBox or VMWare软件\n\nVirtualBox虚拟机软件\n\n  https://www.virtualbox.org/\n\n[NOTICE] 也可以安装vmware虚拟机软件\n\n#### 2.使用已经预先安装好相关实验环境所需软件的虚拟硬盘\n\n并下载已经安装好ubuntu 14.04  x86-64的虚拟硬盘文件压缩包。\n[VirtualBox的虚拟硬盘文件压缩包2015版](http://pan.baidu.com/s/11zjRK)\n\n--------------\n\n压缩包可以用[haozip for windows软件](http://www.haozip.com)解压。解压压缩包后，可得到如下内容（大约6GB多）。 \n```\nmooc-os-2015-2.vdi\n```\n\n如果此时你已经安装好了VirtualBox, 就可以在VirtualBox模拟的x86-64计算机中新建一个虚拟机(配置为ubuntu linux x86 64bit），并指定此虚拟机的虚拟硬盘为你刚才解压的vdi文件。创建完虚拟机后，就可以运行此虚拟幻镜，并可以开始学习\nucore OS实验了。\n```\n用户名是 moocos\n口令是 <空格键>\n```\n\n> [NOTICE]  如果正确安装了virtualbox并配置好虚拟机，但无法运行虚拟机或无法加入虚拟硬盘， 可以尝试删除virtualbox的一些配置目录，比如：\n```\nC:\\Users\\VirtualBox VMs\\\n```\n\n建议a: 设置虚拟硬盘的大小为8GB以上，虚拟内存在1B以上。\n建议b: 如果你的机器安装的是32位的windows，则下载32位的ubuntu 14.04 32bit img镜像。\n\n\n### 四、在MAC OS下进行实验\n\n感谢 altkatz！\n\nUsing gcc49\n\n#### 1.install [homebrew](http://brew.sh/)\n\n#### 2.install binutils, gcc, gdb targeting i386-elf\n\n* `brew tap altkatz/homebrew-gcc_cross_compilers` \n* `brew install i386-elf-gcc` # may take an hour\n* `brew install i386-elf-gdb` \n\n#### 3. install qemu-system-i386\n\n* `brew install qemu`\n\n### 五、手动在物理PC中安装环境\n\n\n-------------------------------------\n特点：性能最好，但安装有一定难度，需要对Linux比较熟悉\n\n（这里假定安装的要是ubuntu14.04 x86-64的系统）\n\n1) 在物理PC上安装ubuntu \n\n下载ubuntu 14.04 64bit img镜像，需要把镜像刻录到可启动的光盘或闪盘中,把光盘或闪盘放入物理PC，并在物理PC上重启安装。\n\n2) 在ubuntu系统中安装实验环境相关软件\n在shell（比如gnome-terminal）下可执行如下命令来安装相关软件 (“$”是shell的提示符，不用输入)\n```\n  $ sudo apt-get update\n  $ sudo apt-get upgrade\n  $ sudo apt-get install build-essential git qemu-system-x86 vim-gnome gdb cgdb eclipse-cdt make diffutils exuberant-ctags tmux openssh-server cscope meld qgit gitg gcc-multilib gcc-multilib g++-multilib\n```\n[NOTICE] 最小需要的安装包： build-essential git qemu-system-x86 gdb make diffutils gcc-multilib\n\n[NOTICE] 如要源码编译qemu,需要执行  `apt-get install zlib1g-dev libsdl1.2-dev libesd0-dev automake`\n\n## 实验中的练习步骤\n以VirtualBox为例，进入VirtualBox中运行的ubuntu，点击左侧的gnome-terminal软件图标，可启动gnome-terminal\n软件。在此软件中，执行如下命令：\n\n1) 目前环境中已经有ucore lab源码，可进一步取得最新ucore lab源码\n```\n  $cd  moocos/ucore_lab  #到ucore lab所在目录\n  $git pull   #取得最新的ucore lab源代码\n  $cd\n```\n\n2) 学习源码\n```\n  $cd labX  #X为 1--8\n```\n\n3) 阅读，修改源码，可以用eclipse-cdt, understand, gedit或vim软件\n```\n  $eclipse\nOR\n  $understand\n```\n\n4) 修改完毕后，编译实验代码\n```\n  $make\n``` \n\n5) 如果编译无误，则可以运行测试一下\n```\n  $make qemu\n```\n\n6) 如果需要调试，\n  \n  a. 可基于cgdb的字符方式(以lab1_ans为例)\n```\n  $cd labcodes_answer/lab1_ans\n  $make debug\n```\n可以看到弹出两个窗口，一个是qemu,一个是cgdb\n可以看到在bootloader的bootmain函数处停了下来。\n然后我们就可以进一步在cgdb中用gdb的命令进行调试了\n```\n (gdb)file bin/kernel   #加载ucore kernel的符号信息\n (gdb)break kern_init   #在函数kern_init处（即 0x100000地址处）设置断点\n (gdb)continue          #继续执行\n```\n这时就可以看到在kern_init处停了下来，可进一步调试。\n\n  b. 基于eclipse-CDT的debug view进行调试，如果安装了zylin debug插件，则完成初步配置后，\n     也可很方便地进行调试。\n\n7) 可以运行如下命令，看看自己的得分\n```\n  $make grade\n```\n\n## 在线交流\n- [piazza，OS课程技术交流的主要在线QA平台](https://piazza.com/tsinghua.edu.cn/spring2015/30240243x/home)\n- QQ群 181873534  主要用于事件通知，聊天等\n\n## 开发维护人员 \n- [陈渝](http://soft.cs.tsinghua.edu.cn/~chen)  yuchen AT tsinghua.edu.cn\n- 茅俊杰 eternal.n08 AT gmail.com\n\n## 课程汇总信息\n - [课程汇总](https://github.com/chyyuu/mooc_os)\n\n## UCORERS (代码贡献者)\n\n茅俊杰、陈宇恒、刘聪、杨扬、渠准、任胜伟、朱文雷、\n曹正、沈彤、陈旭、蓝昶、方宇剑、韩文涛、张凯成、\nS郭晓林、薛天凡、胡刚、刘超、粟裕、袁昕颢...\n欢迎加入我们的OS兴趣小组，共同进步！\n\n## 版权信息\n\nucore OS起源于MIT CSAIL PDOS课题组开发的xv6&jos、哈佛大学开发的\nOS161教学操作系统、以及Linux-2.4内核。\n\nucore OS中包含的xv6&jos代码版权属于Frans Kaashoek, Robert Morris,\nand Russ Cox，使用MIT License。ucore OS中包含的OS/161代码版权属于\nDavid A. Holland。包含的ostep练习的版权属于Remzi H. Arpaci-Dusseau and Andrea C. Arpaci-Dusseau。其他内部开发的ucore OS和相关练习的代码版权属于\n陈渝、王乃铮、向勇，并采用GPL License. ucore OS相关的文档版权属于\n陈渝、向勇，并采用 \nCreative Commons Attribution/Share-Alike (CC-BY-SA) License. \n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "labcodes",
          "type": "tree",
          "content": null
        },
        {
          "name": "labcodes_answer",
          "type": "tree",
          "content": null
        },
        {
          "name": "opensource_os_list.md",
          "type": "blob",
          "size": 0.732421875,
          "content": "# open source OSes\n\n## elastos (china)\n - site: http://elastos.org/\n - code: https://github.com/elastos/ElastosRDK5_0 \n - code: https://github.com/elastos/HD-Elastos\n - code: https://github.com/elastos/ElastosOS_HomeHub\n\n## rt-thread (china)\n - site: http://www.rt-thread.org/\n - code: https://github.com/RT-Thread/rt-thread\n - docs: https://github.com/RT-Thread/rtthread-manual-doc\n  \n## Sylix OS(china)\n - site: http://www.sylixos.com/\n - code: http://git.sylixos.com/cgit/\n \n## Fast OS (china)\n - code: https://github.com/yangshanjin/fos\n - docs: http://blog.csdn.net/oYangShanJin\n \n## Do Jian Yan OS (china)\n - site: http://www.djyos.com/\n - code: http://www.djyos.com/download/djysdkV1.1.1-20150420.rar\n - docs: http://www.djyos.com/?page_id=50\n"
        },
        {
          "name": "related_info",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}