{
  "metadata": {
    "timestamp": 1736709702038,
    "page": 79,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Netflix/dynomite",
      "stars": 4200,
      "defaultBranch": "dev",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.9345703125,
          "content": "# IDE\n.idea\nCMakeLists.txt\n\n# Compiled Object files\n*.lo\n*.o\n\n# Compiled Dynamic libraries\n*.so\n\n# Compiled Static libraries\n*.la\n*.a\n\n# Compiled misc\n*.dep\n*.gcda\n*.gcno\n*.gcov\n*.pyc\n\n# Packages\n*.tar.gz\n*.tar.bz2\n\n# Logs\n*.log\n\n# Temporary\n*.swp\n*.~\n*~\n*.project\n*.cproject\nnbproject/*\nTAGS\nTODO\n\n# Core and executable\ncore*\nnutcracker\ndynomite\ndynomite-test\ndyno-hash-tool\n\n# extracted yaml\n!/contrib/yaml-0.1.4.tar.gz\n\n# Autotools\n.deps\n.libs\n\n/aclocal.m4\n/autom4te.cache\n/stamp-h1\n/autoscan.log\n/libtool\n\n/config/config.guess\n/config/config.sub\n/config/depcomp\n/config/install-sh\n/config/ltmain.sh\n/config/missing\n/config\n\n/config.h\n/config.h.in\n/config.h.in~\n/config.log\n/config.status\n/configure.scan\n/configure\n\nMakefile\nMakefile.in\n/Debug\n/src/.dirstamp\n/src/test\n/src/tools\n/src/dynomite-test\ncscope.out\n/src/cscope.out\n/src/.dirstamp\n/src/tools/dyn_hash_tool\n/src/tools/dynomite-hash-tool\n/test/*.pyc\n/test/_binaries/*\n/test/_binaries\n/test/conf\n"
        },
        {
          "name": ".travis.yml",
          "type": "blob",
          "size": 0.294921875,
          "content": "language: c\nscript: bash ./travis.sh\n\nbefore_install:\n  - sudo apt remove --purge python3-pip\n  - curl -O https://bootstrap.pypa.io/pip/3.5/get-pip.py\n  - sudo -E python3 get-pip.py\n  - sudo -E python3 -m pip install --upgrade \"pip < 22.3\"\n  \naddons:\n  apt:\n   update: true\n   packages:\n   - python3.9\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.5986328125,
          "content": "# Contributing to Dynomite\n\nDocumentation for Dynomite is available in the following locations:\n- <a href=\"http://www.dynomitedb.com/docs/\" target=\"_blank\">Dynomite docs</a>\n- [wiki]( https://github.com/Netflix/dynomite/wiki )\n\nThe Dynomite team is following the Gitflow workflow. The active development branch is [dev](https://github.com/Netflix/dynomite/tree/dev), the stable branch is [master](https://github.com/Netflix/dynomite/tree/master).\n\nContributions will be accepted to the [dev](https://github.com/Netflix/dynomite/tree/dev) only.\n\n\n## How to provide a patch for a new feature\n\n1. If it is a major feature, please create an [Issue]( https://github.com/Netflix/dynomite/issues ) and discuss with the project leaders. \n\n2. If in step 1 you get an acknowledge from the project leaders, use the\n   following procedure to submit a patch:\n\n    a. Fork Dynomite on github ( http://help.github.com/fork-a-repo/ )\n\n    b. Create a topic branch (git checkout -b my_branch)\n\n    c. Push to your branch (git push origin my_branch)\n\n    d. Initiate a pull request on github ( http://help.github.com/en/articles/creating-a-pull-request/ )\n\n    e. Done :)\n\nFor minor fixes just open a pull request to the [dev]( https://github.com/Netflix/dynomite/tree/dev ) branch on Github.\n\n## Questions\n\nIf you have questions or want to report a bug please create an [Issue]( https://github.com/Netflix/dynomite/issues ) or chat with us on [![Dev chat at https://gitter.im/Netflix/dynomite](https://badges.gitter.im/Netflix/dynomite.svg)](https://gitter.im/Netflix/dynomite?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 9.9345703125,
          "content": "\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS"
        },
        {
          "name": "Makefile.am",
          "type": "blob",
          "size": 0.224609375,
          "content": "MAINTAINERCLEANFILES = Makefile.in aclocal.m4 configure config.h.in config.h.in~ stamp-h.in\n\nACLOCAL_AMFLAGS = -I m4\n\nSUBDIRS = contrib src\n\ndist_man_MANS = man/dynomite.8\n\nEXTRA_DIST = README.md NOTICE LICENSE conf scripts notes\n"
        },
        {
          "name": "NOTICE",
          "type": "blob",
          "size": 6.376953125,
          "content": "Dynomite is a thin replacation layer for multi storages\nCopyright (C) 2014 Netflix, Inc.\n\nDictionary implementation, dyn_dict.c and dyn_dict.h, comes from redis: redis.io\n\nPortions of Dynomite were derived from twemproxy\n\ntwemproxy is a fast and lightweight proxy for memcached protocol\nCopyright (C) 2012 Twitter, Inc.\n\nPortions of twemproxy were inspired from nginx: http://nginx.org/\n\nThe implementation of generic array (dn_array.[ch]) and red black tree\n(dn_rbtree.[ch]) also comes from nginx-0.8.55.\n\n/*\n * Copyright (C) 2002-2010 Igor Sysoev\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n *\n * THIS SOFTWARE IS PROVIDED BY AUTHOR AND CONTRIBUTORS ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED.  IN NO EVENT SHALL AUTHOR OR CONTRIBUTORS BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.\n */\n\nThe generic queue implementation comes from BSD <sys/queue.h>\n\n/*\n * Copyright (c) 1991, 1993\n *   The Regents of the University of California.  All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. All advertising materials mentioning features or use of this software\n *    must display the following acknowledgement:\n *\tThis product includes software developed by the University of\n *\tCalifornia, Berkeley and its contributors.\n * 4. Neither the name of the University nor the names of its contributors\n *    may be used to endorse or promote products derived from this software\n *    without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.\n */\n\nThe implementation of consistent hashing and individual hash algorithms were\nborrowed from libmemcached.\n\nCopyright (c) 2011, Data Differential (http://datadifferential.com/)\nCopyright (c) 2007-2010, TangentOrg (Brian Aker)\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n    * Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n    * Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n\n    * Neither the name of TangentOrg nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe source also includes libyaml (yaml-0.1.4) in contrib/ directory\n\nCopyright (c) 2006 Kirill Simonov\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal in\nthe Software without restriction, including without limitation the rights to\nuse, copy, modify, merge, publish, distribute, sublicense, and/or sell copies\nof the Software, and to permit persons to whom the Software is furnished to do\nso, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "OSSMETADATA",
          "type": "blob",
          "size": 0.01953125,
          "content": "osslifecycle=active\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.8486328125,
          "content": "\n![dynomite logo](images/dynomite-logo.png)\n\n\n# Dynomite \n\n[![Build Status](https://travis-ci.com/Netflix/dynomite.svg)](http://travis-ci.com/Netflix/dynomite)\n[![Dev chat at https://gitter.im/Netflix/dynomite](https://badges.gitter.im/Netflix/dynomite.svg)](https://gitter.im/Netflix/dynomite?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge)\n[![Apache V2 License](http://img.shields.io/badge/license-Apache%20V2-blue.svg)](https://github.com/Netflix/dynomite/blob/dev/LICENSE)\n\n**Dynomite**, inspired by [Dynamo whitepaper](http://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf), is a thin, distributed dynamo layer for different storage engines and protocols. Currently these include [Redis](http://redis.io) and [Memcached](http://www.memcached.org/).  Dynomite supports multi-datacenter replication and is designed for high availability.\n\nThe ultimate goal with Dynomite is to be able to implement high availability and cross-datacenter replication on storage engines that do not inherently provide that functionality. The implementation is efficient, not complex (few moving parts), and highly performant.\n\n## Workflow\n\nEvery branch numbered like v0.5.9, v0.5.8 etc is stable and safe to use in production unless marked as pre-release. The [dev]( https://github.com/Netflix/dynomite/tree/dev ) branch is the development unstable branch. Over time master branch has fallen behind and is not maintained. We will eventually delete it and may or may not recreate it.\n\nFor questions or contributions, please consider reading [CONTRIBUTING.md](CONTRIBUTING.md).\n\n## Build\n\nTo build Dynomite from source with _debug logs enabled_ and _assertions disabled_:\n\n    $ git clone git@github.com:Netflix/dynomite.git\n    $ cd dynomite\n    $ autoreconf -fvi\n    $ ./configure --enable-debug=yes\n    $ make\n    $ src/dynomite -h\n\nTo build Dynomite in _debug mode_:\n\n    $ git clone git@github.com:Netflix/dynomite.git\n    $ cd dynomite\n    $ autoreconf -fvi\n    $ CFLAGS=\"-ggdb3 -O0\" ./configure --enable-debug=full\n    $ make\n    $ sudo make install\n\n## Help\n\n    Usage: dynomite [-?hVdDt] [-v verbosity level] [-o output file]\n                      [-c conf file] [-p pid file] \n\n    Options:\n      -h, --help              : this help\n      -V, --version           : show version and exit\n      -t, --test-conf         : test configuration for syntax errors and exit\n      -g, --gossip            : enable gossip (default: disabled)\n      -d, --daemonize         : run as a daemon\n      -D, --describe-stats    : print stats description and exit\n      -v, --verbosity=N       : set logging level (default: 5, min: 0, max: 11)\n      -o, --output=S          : set logging file (default: stderr)\n      -c, --conf-file=S       : set configuration file (default: conf/dynomite.yml)\n      -p, --pid-file=S        : set pid file (default: off)\n      -x, --admin-operation=N : set size of admin operation (default: 0)\n\n\n## Configuration\n\nDynomite can be configured through a YAML 1.1 (YAML 1.1 is not JSON compatible) file specified by the -c or --conf-file command-line argument on process start. The configuration files parses and understands the following keys:\n\n+ **env**: Specify environment of a node.  Currently supports aws and network (for physical datacenter).\n+ **datacenter**: The name of the datacenter.  Please refer to [architecture document](https://github.com/Netflix/dynomite/wiki/Architecture).\n+ **rack**: The name of the rack.  Please refer to [architecture document](https://github.com/Netflix/dynomite/wiki/Architecture).\n+ **dyn_listen**: The port that dynomite nodes use to inter-communicate and gossip.\n+ **enable_gossip**: enable gossip instead of static tokens (default: false). Gossip is experimental.\n+ **gos_interval**: The sleeping time in milliseconds at the end of a gossip round.\n+ **tokens**: The token(s) owned by a node.  Currently, we don't support vnode yet so this only works with one token for the time being.\n+ **dyn_seed_provider**: A seed provider implementation to provide a list of seed nodes.\n+ **dyn_seeds**: A list of seed nodes in the format: address:port:rack:dc:tokens (note that vnode is not supported yet)\n+ **listen**: The listening address and port (name:port or ip:port) for this server pool.\n+ **timeout**: The timeout value in msec that we wait for to establish a connection to the server or receive a response from a server. By default, we wait indefinitely.\n+ **preconnect**: A boolean value that controls if dynomite should preconnect to all the servers in this pool on process start. Defaults to false.\n+ **data_store**: An integer value that controls if a server pool speaks redis (0) or memcached (1) or other protocol. Defaults to redis (0).\n+ **auto_eject_hosts**: A boolean value that controls if server should be ejected temporarily when it fails consecutively server_failure_limit times. See [liveness recommendations](notes/recommendation.md#liveness) for information. Defaults to false.\n+ **server_retry_timeout**: The timeout value in msec to wait for before retrying on a temporarily ejected server, when auto_eject_host is set to true. Defaults to 30000 msec.\n+ **server_failure_limit**: The number of consecutive failures on a server that would lead to it being temporarily ejected when auto_eject_host is set to true. Defaults to 2.\n+ **servers**: A list of local server address, port and weight (name:port:weight or ip:port:weight) for this server pool. Currently, there is just one.\n+ **secure_server_option**: Encrypted communication. Must be one of 'none', 'rack', 'datacenter', or 'all'. ```datacenter``` means all communication between datacenters is encrypted but within a datacenter it is not. ```rack``` means all communication between racks and regions is encrypted however communication between nodes within the same rack is not encrypted. ```all``` means all communication between all nodes is encrypted. And ```none``` means none of the communication is encrypted. \n+ **stats_listen**: The address and port number for the REST endpoint and for accessing statistics.\n+ **stats_interval**: set stats aggregation interval in msec (default: 30000 msec).\n+ **mbuf_size**: size of mbuf chunk in bytes (default: 16384 bytes).\n+ **max_msgs**: max number of messages to allocate (default: 200000).\n+ **datastore_connections**: Maximum number of connections to the local datastore.\n+ **local_peer_connections**: Maximum number of connections to a local DC peer.\n+ **remote_peer_connections**: Maximum number of connections to a remote DC peer.\n+ **dyn_port**: Port used by Dynomite servers to talk to each other.\n\nFor example, the configuration file in [conf/dynomite.yml](conf/dynomite.yml)\n\nFinally, to make writing syntactically correct configuration files easier, dynomite provides a command-line argument -t or --test-conf that can be used to test the YAML configuration file for any syntax error.\n\n\n## License\n\nLicensed under the Apache License, Version 2.0: http://www.apache.org/licenses/LICENSE-2.0\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.sh",
          "type": "blob",
          "size": 0.5986328125,
          "content": "#!/bin/bash\n\n#\n# Dear Mac user, remember to setup your development environment. Install XCode\n# then run the following commands:\n#\n# xcode-select --install\n# brew install cmake autoconf libtool gcc automake openssl\n# brew link openssl --force\n#\n\nOS=`uname -s`\n\nif [ $OS == \"Darwin\" ] ; then\n    SSL_LIBDIR=`pkg-config --variable=libdir openssl`\n    SSL_INCLUDEDIR=`pkg-config --variable=includedir openssl`\nfi\n\n#make clean\n\nautoreconf -fvi\n\nif [ $OS == \"Darwin\" ] ; then\n    ./configure --enable-debug=yes LDFLAGS=\"-L${SSL_LIBDIR}\" CPPFLAGS=\"-I${SSL_INCLUDEDIR}\"\nelse\n    ./configure --enable-debug=full\nfi\n\nmake\n"
        },
        {
          "name": "conf",
          "type": "tree",
          "content": null
        },
        {
          "name": "configure.ac",
          "type": "blob",
          "size": 5.96875,
          "content": "# Add support for m4_esyscmd_s to autoconf-2.63 (used in RHEL/CentOS 6.7)\nm4_ifndef([m4_esyscmd_s], [m4_define([m4_chomp_all], [m4_format([[%.*s]], m4_bregexp(m4_translit([[$1]], [/], [/ ]), [/*$]), [$1])])])\nm4_ifndef([m4_esyscmd_s], [m4_define([m4_esyscmd_s], [m4_chomp_all(m4_esyscmd([$1]))])])\n\n# Define the bug reporting address and package version\nm4_define([DN_BUGS], [dynomite@netflix.com])\nm4_define([DN_VERSION_STRING], m4_esyscmd_s([git describe --dirty --always --tags]))\n\n# Initialize autoconf\nAC_PREREQ([2.63])\nAC_INIT([dynomite], [DN_VERSION_STRING], [DN_BUGS])\nAC_CONFIG_SRCDIR([src/dynomite.c])\nAC_CONFIG_AUX_DIR([config])\nAC_CONFIG_HEADERS([config.h:config.h.in])\nAC_CONFIG_MACRO_DIR([m4])\n\n# Initialize automake\nAM_INIT_AUTOMAKE([1.11 foreign])\n\n# Checks for language\nAC_LANG([C])\n\n# Checks for programs\nAC_PROG_AWK\nAC_PROG_CC\nAC_PROG_CPP\nAC_PROG_CXX\nAC_PROG_INSTALL\nAC_PROG_LN_S\nAC_PROG_MAKE_SET\nLT_INIT\nAC_PROG_LIBTOOL\n\n# Checks for typedefs, structures, and compiler characteristics\nAC_C_INLINE\nAC_TYPE_INT8_T\nAC_TYPE_INT16_T\nAC_TYPE_INT32_T\nAC_TYPE_INT64_T\nAC_TYPE_INTMAX_T\nAC_TYPE_INTPTR_T\nAC_TYPE_UINT8_T\nAC_TYPE_UINT16_T\nAC_TYPE_UINT32_T\nAC_TYPE_UINT64_T\nAC_TYPE_UINTMAX_T\nAC_TYPE_UINTPTR_T\nAC_TYPE_OFF_T\nAC_TYPE_PID_T\nAC_TYPE_SIZE_T\nAC_TYPE_SSIZE_T\n\nAC_C_BIGENDIAN(\n  [],\n  [AC_DEFINE(HAVE_LITTLE_ENDIAN, 1, [Define to 1 if machine is little endian])],\n  [AC_MSG_ERROR([endianess of this machine is unknown])],\n  [AC_MSG_ERROR([universial endianess not supported])]\n)\n\n# Checks for header files\nAC_HEADER_STDBOOL\nAC_CHECK_HEADERS([fcntl.h float.h limits.h stddef.h stdlib.h string.h unistd.h])\nAC_CHECK_HEADERS([inttypes.h stdint.h])\nAC_CHECK_HEADERS([sys/ioctl.h sys/time.h sys/uio.h])\nAC_CHECK_HEADERS([sys/socket.h sys/un.h netinet/in.h arpa/inet.h netdb.h])\nAC_CHECK_HEADERS([execinfo.h],\n  [AC_DEFINE(HAVE_BACKTRACE, [1], [Define to 1 if backtrace is supported])], [])\nAC_CHECK_HEADERS([sys/epoll.h], [], [])\nAC_CHECK_HEADERS([sys/event.h], [], [])\n\n# Checks for libraries\nAC_CHECK_LIB([m], [pow])\nAC_CHECK_LIB([pthread], [pthread_create])\nAC_CHECK_LIB([ssl], [SSL_read])\nAC_CHECK_LIB([crypto], [OPENSSL_init])\n\n\n# Checks for library functions\nAC_FUNC_FORK\nAC_FUNC_MALLOC\nAC_FUNC_REALLOC\nAC_CHECK_FUNCS([dup2 gethostname gettimeofday strerror])\nAC_CHECK_FUNCS([socket])\nAC_CHECK_FUNCS([memchr memmove memset])\nAC_CHECK_FUNCS([strchr strndup strtoul])\n\nAC_CACHE_CHECK([if epoll works], [ac_cv_epoll_works],\n  AC_TRY_RUN([\n#include <stdio.h>\n#include <stdlib.h>\n#include <sys/epoll.h>\nint\nmain(int argc, char **argv)\n{\n    int fd;\n\n    fd = epoll_create(256);\n    if (fd < 0) {\n        perror(\"epoll_create:\");\n        exit(1);\n    }\n    exit(0);\n}\n  ], [ac_cv_epoll_works=yes], [ac_cv_epoll_works=no]))\nAS_IF([test \"x$ac_cv_epoll_works\" = \"xyes\"],\n  [AC_DEFINE([HAVE_EPOLL], [1], [Define to 1 if epoll is supported])], [])\n\nAC_CACHE_CHECK([if kqueue works], [ac_cv_kqueue_works],\n  AC_TRY_RUN([\n#include <stdio.h>\n#include <stdlib.h>\n#include <sys/types.h>\n#include <sys/event.h>\n#include <sys/time.h>\nint\nmain(int argc, char **argv)\n{\n    int fd;\n\n    fd = kqueue();\n    if (fd < 0) {\n        perror(\"kqueue:\");\n        exit(1);\n    }\n    exit(0);\n}\n  ], [ac_cv_kqueue_works=yes], [ac_cv_kqueue_works=no]))\nAS_IF([test \"x$ac_cv_kqueue_works\" = \"xyes\"],\n  [AC_DEFINE([HAVE_KQUEUE], [1], [Define to 1 if kqueue is supported])], [])\n\nAC_CACHE_CHECK([if event ports works], [ac_cv_evports_works],\n  AC_TRY_RUN([\n#include <stdio.h>\n#include <stdlib.h>\n#include <port.h>\nint\nmain(int argc, char **argv)\n{\n    int fd;\n\n    fd = port_create();\n    if (fd < 0) {\n        perror(\"port_create:\");\n        exit(1);\n    }\n    exit(0);\n}\n  ], [ac_cv_evports_works=yes], [ac_cv_evports_works=no]))\nAS_IF([test \"x$ac_cv_evports_works\" = \"xyes\"],\n  [AC_DEFINE([HAVE_EVENT_PORTS], [1], [Define to 1 if event ports is supported])], [])\n\nAS_IF([test \"x$ac_cv_epoll_works\" = \"xno\" &&\n       test \"x$ac_cv_kqueue_works\" = \"xno\" &&\n       test \"x$ac_cv_evports_works\" = \"xno\"],\n  [AC_MSG_ERROR([either epoll or kqueue or event ports support is required])], [])\n\nAM_CONDITIONAL([OS_LINUX], [test \"x$ac_cv_epoll_works\" = \"xyes\"])\nAM_CONDITIONAL([OS_BSD], [test \"x$ac_cv_kqueue_works\" = \"xyes\"])\nAM_CONDITIONAL([OS_SOLARIS], [test \"x$ac_cv_evports_works\" = \"xyes\"])\n\n# Package options\nAC_MSG_CHECKING([whether to enable debug logs and asserts])\nAC_ARG_ENABLE([debug],\n  [AS_HELP_STRING(\n    [--enable-debug=@<:@full|yes|log|no@:>@],\n    [enable debug logs and asserts @<:@default=no@:>@])\n  ],\n  [],\n  [enable_debug=no])\nAS_CASE([x$enable_debug],\n  [xfull], [AC_DEFINE([HAVE_ASSERT_PANIC], [1],\n                      [Define to 1 if panic on an assert is enabled])\n            AC_DEFINE([HAVE_DEBUG_LOG], [1], [Define to 1 if debug log is enabled])\n           ],\n  [xyes], [AC_DEFINE([HAVE_ASSERT_LOG], [1],\n                     [Define to 1 if log on an assert is enabled])\n           AC_DEFINE([HAVE_DEBUG_LOG], [1], [Define to 1 if debug log is enabled])\n          ],\n  [xlog], [AC_DEFINE([HAVE_DEBUG_LOG], [1], [Define to 1 if debug log is enabled])],\n  [xno], [],\n  [AC_MSG_FAILURE([invalid value ${enable_debug} for --enable-debug])])\nAC_MSG_RESULT($enable_debug)\n\nAC_MSG_CHECKING([whether to disable stats])\nAC_ARG_ENABLE([stats],\n  [AS_HELP_STRING(\n    [--disable-stats],\n    [disable stats])\n  ],\n  [disable_stats=yes],\n  [disable_stats=no])\nAS_IF([test \"x$disable_stats\" = xyes],\n  [],\n  [AC_DEFINE([HAVE_STATS], [1], [Define to 1 if stats is not disabled])])\nAC_MSG_RESULT($disable_stats)\n\n# Untar the yaml-0.1.4 in contrib/ before config.status is rerun\nAC_CONFIG_COMMANDS_PRE([tar xvfz contrib/yaml-0.1.4.tar.gz -C contrib])\n\n# Call yaml-0.1.4 ./configure recursively\nAC_CONFIG_SUBDIRS([contrib/yaml-0.1.4])\n\n# Define Makefiles\nAC_CONFIG_FILES([Makefile\n                 contrib/Makefile\n                 src/Makefile\n                 src/hashkit/Makefile\n                 src/proto/Makefile\n                 src/entropy/Makefile\n                 src/seedsprovider/Makefile\n                 src/event/Makefile\n                 src/tools/Makefile])\n\n# Generate the \"configure\" script\nAC_OUTPUT\n"
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "init",
          "type": "tree",
          "content": null
        },
        {
          "name": "m4",
          "type": "tree",
          "content": null
        },
        {
          "name": "man",
          "type": "tree",
          "content": null
        },
        {
          "name": "notes",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "travis.sh",
          "type": "blob",
          "size": 0.626953125,
          "content": "#!/bin/bash\n\nif [ -n \"$TRAVIS\" ]; then\n    sudo pip3 install redis plumbum pyyaml\nfi\n\n\n# parse options\nrebuild=true\ndebug=false\nwhile [ \"$#\" -gt 0 ]; do\n    arg=$1\n    case $1 in\n        -n|--no-rebuild) shift; rebuild=false;;\n        -d|--debug) shift; debug=true;;\n        -*) usage_fatal \"unknown option: '$1'\";;\n        *) break;; # reached the list of file names\n    esac\ndone\n\nset -o errexit\nset -o nounset\nset -o pipefail\n\n\n#build Dynomite\nif [[ \"${rebuild}\" == \"true\" ]]; then\n    CFLAGS=\"-ggdb3 -O0\" autoreconf -fvi && ./configure --enable-debug=log && make\nelse\n    echo \"not rebuilding Dynomite\"\nfi\n\nexec test/cluster_generator.py\n"
        }
      ]
    }
  ]
}