{
  "metadata": {
    "timestamp": 1736710164715,
    "page": 841,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "opsengine/cpulimit",
      "stars": 1719,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0458984375,
          "content": "*.o\n*~\nsrc/cpulimit\nbusy\nprocess_iterator_test\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 0.791015625,
          "content": "cpulimit - a CPU usage limiter for Linux\nCopyright (C) 2005-2012, by:  Angelo Marletta <angelo dot marletta at gmail dot com> \n\nThis program is free software; you can redistribute it and/or\nmodify it under the terms of the GNU General Public License\nas published by the Free Software Foundation; either version 2\nof the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, write to the Free Software\nFoundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 0.068359375,
          "content": "default: all\n\n.DEFAULT:\n\tcd src && $(MAKE) $@\n\tcd tests && $(MAKE) $@\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.32421875,
          "content": "CPULIMIT\n========\n\nCpulimit is a tool which limits the CPU usage of a process (expressed in percentage, not in CPU time). It is useful to control batch jobs, when you don't want them to eat too many CPU cycles. The goal is prevent a process from running for more than a specified time ratio. It does not change the nice value or other scheduling priority settings, but the real CPU usage. Also, it is able to adapt itself to the overall system load, dynamically and quickly.\nThe control of the used CPU amount is done sending SIGSTOP and SIGCONT POSIX signals to processes.\nAll the children processes and threads of the specified process will share the same percentage of CPU.\n\nDeveloped by Angelo Marletta.\nPlease send your feedback, bug reports, feature requests or just thanks.\n\n\nGet the latest source code\n--------------------------\n\nThe latest available code is here:\n\nhttps://github.com/opsengine/cpulimit\n\n\nInstall instructions\n--------------------\n\nOn Linux/OS X:\n\n    $ make\n    # cp src/cpulimit /usr/bin\n\nOn FreeBSD:\n\n    $ gmake\n    # cp src/cpulimit /usr/bin\n\nRun unit tests:\n\n    $ ./tests/process_iterator_test\n\n\nContributions\n-------------\n\nYou are welcome to contribute to cpulimit with bugfixes, new features, or support for a new OS.\nIf you want to submit a pull request, please do it on the branch develop and make sure all tests pass.\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}