{
  "metadata": {
    "timestamp": 1736710663499,
    "page": 1,
    "hasNextPage": false,
    "endCursor": "Y3Vyc29yOjM=",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "AppFlowy-IO/AppFlowy",
      "stars": 59301,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0048828125,
          "content": ".git\n"
        },
        {
          "name": ".githooks",
          "type": "tree",
          "content": null
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.818359375,
          "content": "# Generated by Cargo\n# will have compiled files and executables\n# Remove Cargo.lock from gitignore if creating an executable, leave it for libraries\n# More information here https://doc.rust-lang.org/cargo/guide/cargo-toml-vs-cargo-lock.html\n# backend\n/target/\n\n# These are backup files generated by rustfmt\n**/*.rs.bk\n**/target/\n**/*.db\n.idea/\n**/temp/**\n.ruby-version\npackage-lock.json\nyarn.lock\nnode_modules\n**/.proto_cache\n**/.cache\n**/.DS_Store\n\n**/resources/proto\n\n# ignore settings.json\nfrontend/.vscode/settings.json\n\n# Commit the highest level pubspec.lock, but ignore the others\npubspec.lock\n!frontend/appflowy_flutter/pubspec.lock\n\n# ignore tool used for commit linting\n.githooks/gitlint\n.githooks/gitlint.exe\n.fvm/\n\n**/AppFlowy-Collab/\n\n# ignore generated assets\nfrontend/package\nfrontend/*.deb\n\n**/Cargo.toml.bak\n\n**/.cargo/**"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 34.373046875,
          "content": "# Release Notes\n## Version 0.8.0 - 06/01/2025\n### Bug Fixes\n- Fixed error displaying in the page style menu\n- Fixed filter logic in the icon picker\n- Fixed error displaying in the Favorite/Recent page\n- Fixed the color picker displaying when tapping down\n- Fixed icons not being supported in subpage blocks\n- Fixed recent icon functionality in the space icon menu\n- Fixed \"Insert Below\" not auto-scrolling the table\n- Fixed a to-do item with an emoji automatically creating a soft break\n- Fixed header row/column tap areas being too small\n- Fixed simple table alignment not working for items that wrap\n- Fixed web content reverting after removing the inline code format on desktop\n- Fixed inability to make changes to a row or column in the table when opening a new tab\n- Fixed changing the language to CKB-KU causing a gray screen on mobile\n\n## Version 0.7.9 - 30/12/2024\n### New Features\n- Meet AppFlowy Web (Lite): Use AppFlowy directly in your browser.\n  - Create beautiful documents with 22 content types and markdown support\n  - Use Quick Note to save anything you want to remember—like meeting notes, a grocery list, or to-dos\n  - Invite members to your workspace for seamless collaboration\n  - Create multiple public/private spaces to better organize your content\n- Simple Table is now available on Mobile, designed specifically for mobile devices.\n  - Create and manage Simple Table blocks on Mobile with easy-to-use action menus.\n  - Use the '+' button in the fixed toolbar to easily add a content block into a table cell on Mobile\n  - Use '/' to insert a content block into a table cell on Desktop\n- Add pages as AI sources in AI chat, enabling you to ask questions about the selected sources\n- Add messages to an editable document while chatting with AI side by side\n- The new Emoji menu now includes Icons with a Recent section for quickly reusing emojis/icons\n- Drag a page from the sidebar into a document to easily mention the page without typing its title\n- Paste as plain text, a new option in the right-click paste menu\n### Bug Fixes\n- Fixed misalignment in numbered lists\n- Resolved several bugs in the emoji menu\n- Fixed a bug with checklist items\n\n## Version 0.7.8 - 18/12/2024\n### New Features\n<img width=\"1068\" alt=\"image\" src=\"https://github.com/user-attachments/assets/cf8bd287-f370-4291-8638-76e2bbf4aaac\" />\n\n- Meet Simple Table 2.0:\n   - Insert a list into a table cell\n   - Insert images, quotes, callouts, and code blocks into a table cell\n   - Drag to move rows or columns\n   - Toggle header rows or columns on/off\n   - Distribute columns evenly\n   - Adjust to page width\n- Enjoy a new UI/UX for a seamless experience\n- Revamped mention page interactions in AI Chat\n- Improved AppFlowy AI service\n\n### Bug Fixes\n- Fixed an error when opening files in the database in local mode\n- Fixed arrow up/down navigation not working for selecting a language in Code Block\n- Fixed an issue where deleting multiple blocks using the drag button on the document page didn’t work\n  \n## Version 0.7.7 - 09/12/2024\n### Bug Fixes\n- Fixed sidebar menu resize regression\n- Fixed AI chat loading issues\n- Fixed inability to open local files in database\n- Fixed mentions remaining in notifications after removal from document\n- Fixed event card closing when clicking on empty space\n- Fixed keyboard shortcut issues\n\n## Version 0.7.6 - 03/12/2024\n### New Features\n- Revamped the simple table UI\n- Added support for capturing images from camera on mobile\n### Bug Fixes\n- Improved markdown rendering capabilities in AI writer\n- Fixed an issue where pressing Enter on a collapsed toggle list would add an unnecessary new line\n- Fixed an issue where creating a document from slash menu could insert content at incorrect position\n\n## Version 0.7.5 - 25/11/2024\n### Bug Fixes\n- Improved chat response parsing\n- Fixed toggle list icon direction for RTL mode\n- Fixed cross blocks formatting not reflecting in float toolbar\n- Fixed unable to click inside the toggle list to create a new paragraph\n- Fixed open file error 50 on macOS\n- Fixed upload file exceed limit error\n\n## Version 0.7.4 - 19/11/2024\n### New Features\n- Support uploading WebP and BMP images\n- Support managing workspaces on mobile\n- Support adding toggle headings on mobile\n- Improve the AI chat page UI\n### Bug Fixes\n- Optimized the workspace menu loading performance\n- Optimized tab switching performance\n- Fixed searching issues in Document page\n\n## Version 0.7.3 - 07/11/2024\n### New Features\n- Enable custom URLs for published pages\n- Support toggling headings\n- Create a subpage by typing in the document\n- Turn selected blocks into a subpage\n- Add a manual date picker for the Date property\n\n### Bug Fixes\n- Fixed an issue where the workspace owner was unable to delete spaces created by others\n- Fixed cursor height inconsistencies with text height\n- Fixed editing issues in Kanban cards\n- Fixed an issue preventing images or files from being dropped into empty paragraphs\n\n## Version 0.7.2 - 22/10/2024\n### New Features\n- Copy link to block\n- Support turn into in document\n- Enable sharing links and publishing pages on mobile\n- Enable drag and drop in row documents\n- Right-click on page in sidebar to open more actions\n- Create new subpage in document using `+` character\n- Allow reordering checklist item\n\n### Bug Fixes\n- Fixed issue with inability to cancel inline code format in French IME\n- Fixed delete with Shift or Ctrl shortcuts not working in documents\n- Fixed the issues with incorrect time zone being used in filters.\n\n## Version 0.7.1 - 07/10/2024\n### New Features\n- Copy link to share and open it in a browser\n- Enable the ability to edit the page title within the body of the document\n- Filter by last modified, created at, or a date range\n- Allow customization of database property icons\n- Support CTRL/CMD+X to delete the current line when the selection is collapsed in the document\n- Support window tiling on macOS\n- Add filters to grid views on mobile\n- Create and manage workspaces on mobile\n- Automatically convert property types for imported CSV files\n\n### Bug Fixes\n- Fixed calculations with filters applied\n- Fixed issues with importing data folders into a cloud account\n- Fixed French IME backtick issues\n- Fixed selection gesture bugs on mobile\n\n## Version 0.7.0 - 19/09/2024\n### New Features\n- Support reordering blocks in document with drag and drop\n- Support for adding a cover to a row/card in databases\n- Added support for accessing settings on the sign-in page\n- Added \"Move to\" option to the document menu in top right corner\n- Support for adjusting the document width from settings\n- Show full name of a group on hover\n- Colored group names in kanban boards\n- Support \"Ask AI\" on multiple lines of text\n- Support for keyboard gestures to move cursor on Mobile\n- Added markdown support for quickly inserting a code block using three backticks\n\n### Bug Fixes\n- Fixed a critical bug where the backtick character would crash the application\n- Fixed an issue with signing-in from the settings dialog where the dialog would persist\n- Fixed a visual bug with icon alignment in primary cell of database rows\n- Fixed a bug with filters applied where new rows were inserted in wrong position\n- Fixed a bug where \"Untitled\" would override the name of the row\n- Fixed page title not updating after renaming from \"More\"-menu\n- Fixed File block breaking row detail document\n- Fixed issues with reordering rows with sorting rules applied\n- Improvements to the File & Media type in Database\n- Performance improvement in Grid view\n- Fixed filters sometimes not applying properly in databases\n\n## Version 0.6.9 - 09/09/2024\n### New Features\n- Added a new property type, 'Files & media'\n- Supported Apple Sign-in\n- Displayed the page icon next to the row name when the row page contains nested notes\n- Enabled Delete Account in Settings\n- Included a collapsible navigation menu in your published site\n\n### Bug Fixes\n- Fixed the space name color issue in the community themes\n- Fixed database filters and sorting issues\n- Fixed the issue of not being able to fully display the title on Kanban cards\n- Fixed the inability to see the entire text of a checklist item when it's more than one line long\n- Fixed hide/unhide buttons in the No Status group\n- Fixed the inability to edit group names on Kanban boards\n- Made error codes more user-friendly\n- Added leading zeros to day and month in date format\n\n## Version 0.6.8 - 22/08/2024\n### New Features\n- Enabled viewing data inside a database record on mobile.\n- Added the ability to invite members to a workspace on mobile.\n- Introduced Ask AI in the Home tab on mobile.\n- Import CSV files with up to 1,000 rows.\n- Convert properties from one type to another while preserving the data.\n- Optimized the speed of opening documents and databases.\n- Improved syncing performance across devices.\n- Added support for a monochrome app icon on Android.\n\n### Bug Fixes\n- Removed the Wayland header from the AppImage build.\n- Fixed the issue where pasting a web image on mobile failed.\n- Corrected the Local AI state when switching between different workspaces.\n- Fixed high CPU usage when opening large databases.\n\n## Version 0.6.7 - 13/08/2024\n### New Features\n- Redesigned the icon picker design on Desktop.\n- Redesigned the notification page on Mobile.\n\n### Bug Fixes\n- Enhance the toolbar tooltip functionality on Desktop.\n- Enhance the slash menu user experience on Desktop.\n- Fixed the issue where list style overrides occurred during text pasting.\n- Fixed the issue where linking multiple databases in the same document could cause random loss of focus.\n\n## Version 0.6.6 - 30/07/2024\n### New Features\n- Upgrade your workspace to a premium plan to unlock more features and storage.\n- Image galleries and drag-and-drop image support in documents.\n\n### Bug Fixes\n- Fix minor UI issues on Desktop and Mobile.\n\n## Version 0.6.5 - 24/07/2024\n### New Features\n- Publish a Database to the Web\n\n## Version 0.6.4 - 16/07/2024\n### New Features\n- Enhanced the message style on the AI chat page.\n- Added the ability to choose cursor color and selection color from a palette in settings page.\n### Bug Fixes\n- Optimized the performance for loading recent pages.\n- Fixed an issue where the cursor would jump randomly when typing in the document title on mobile.\n\n## Version 0.6.3 - 08/07/2024\n### New Features\n- Publish a Document to the Web\n\n## Version 0.6.2 - 01/07/2024\n### New Features\n- Added support for duplicating spaces.\n- Added support for moving pages across spaces.\n- Undo markdown formatting with `Ctrl + Z` or `Cmd + Z`.\n- Improved shortcuts settings UI.\n### Bug Fixes\n- Fixed unable to zoom in with `Ctrl` and `+` or `Cmd` and `+` on some keyboards.\n- Fixed unable to paste nested lists in existing lists.\n\n## Version 0.6.1 - 22/06/2024\n### New Features\n- Introduced the \"Space\" feature to help you organize your pages more efficiently.\n### Bug Fixes\n- Resolved shortcut conflicts on the board page.\n- Resolved an issue where underscores could cause the editor to freeze.\n\n## Version 0.6.0 - 19/06/2024\n### New Features\n- Introduced the \"Space\" feature to help you organize your pages more efficiently.\n### Bug Fixes\n- Resolved shortcut conflicts on the board page.\n- Resolved an issue where underscores could cause the editor to freeze.\n\n## Version 0.5.9 - 06/06/2024\n### New Features\n- Revamped the sidebar for both Desktop and Mobile.\n- Added support for embedding videos in documents.\n- Introduced a hotkey (Cmd/Ctrl + 0) to reset the app scale.\n- Supported searching the workspace by page title.\n### Bug Fixes\n- Fixed the issue preventing the use of Backspace to delete words in Kanban boards.\n\n## Version 0.5.8 - 05/20/2024\n### New Features\n- Improvement to the Callout block to insert new lines\n- New settings page \"Manage data\" replaced the \"Files\" page\n- New settings page \"Workspace\" replaced the \"Appearance\" and \"Language\" pages\n- A custom implementation of a title bar for Windows users\n- Added support for selecting Cards in kanban and performing grouped keyboard shortcuts\n- Added support for default system font family\n- Support for scaling the application up/down using a keyboard shortcut (CMD/CTRL + PLUS/MINUS)\n\n### Bug Fixes\n- Resolved and refined the UI on Mobile\n- Resolved issue with text editing in database\n- Improved appearance of empty text cells in kanban/calendar\n- Resolved an issue where a page's more actions (delete, duplicate) did not work properly\n- Resolved and inconsistency in padding on get started screen on Desktop\n\n## Version 0.5.7 - 05/10/2024\n### Bug Fixes\n- Resolved page opening issue on Android.\n- Fixed text input inconsistency on Kanban board cards.\n\n## Version 0.5.6 - 05/07/2024\n### New Features\n- Team collaboration is live! Add members to your workspace to edit and collaborate on pages together.\n- Collaborate in real time on the same page with other members. Edits made by others will appear instantly.\n- Create multiple workspaces for different kinds of content.\n- Customize your entire page on mobile through the Page Style menu with options for layout, font, font size, emoji, and cover image.\n- Open a row record as a full page.\n### Bug Fixes\n- Resolved issue with setting background color for the Simple Table block.\n- Adjusted toolbar for various screen sizes.\n- Added a request for photo permission before uploading images on mobile.\n- Exported creation and last modification timestamps to CSV.\n\n## Version 0.5.5 - 04/24/2024\n### New Features\n- Improved the display of code blocks with line numbers\n- Added support for signing in using Magic Link\n### Bug Fixes\n- Fixed the database synchronization indicator issue\n- Resolved the issue with opening the mentioned page on mobile\n- Cleared the collaboration status when the user exits AppFlowy\n\n## Version 0.5.4 - 04/08/2024\n### New Features\n- Introduced support for displaying a synchronization indicator within documents and databases to enhance user awareness of data sync status\n- Revamped the select option cell editor in database\n- Improved translations for Spanish, German, Kurdish, and Vietnamese\n- Supported Android 6 and newer versions\n### Bug Fixes\n- Resolved an issue where twelve-hour time formats were not being parsed correctly in databases\n- Fixed a bug affecting the user interface of the single select option filter\n- Fixed various minor UI issues\n\n## Version 0.5.3 - 03/21/2024\n### New Features\n- Added build support for 32-bit Android devices\n- Introduced filters for KanBan boards for enhanced organization\n- Introduced the new \"Relations\" column type in Grids\n- Expanded language support with the addition of Greek\n- Enhanced toolbar design for Mobile devices\n- Introduced a command palette feature with initial support for page search\n### Bug Fixes\n- Rectified the issue of incomplete row data in Grids when adding new rows with active filters\n- Enhanced the logic governing the filtering of number and select/multi-select fields for improved accuracy\n- Implemented UI refinements on both Desktop and Mobile platforms, enriching the overall user experience of AppFlowy\n\n## Version 0.5.2 - 03/13/2024\n### Bug Fixes\n- Import csv file.\n\n## Version 0.5.1 - 03/11/2024\n### New Features\n- Introduced support for performing generic calculations on databases.\n- Implemented functionality for easily duplicating calendar events.\n- Added the ability to duplicate fields with cell data, facilitating smoother data management.\n- Now supports customizing font styles and colors prior to typing.\n- Enhanced the checklist user experience with the integration of keyboard shortcuts.\n- Improved the dark mode experience on mobile devices.\n### Bug Fixes\n- Fixed an issue with some pages failing to sync properly.\n- Fixed an issue where links without the http(s) scheme could not be opened, ensuring consistent link functionality.\n- Fixed an issue that prevented numbers from being inserted before heading blocks.\n- Fixed the inline page reference update mechanism to accurately reflect workspace changes.\n- Fixed an issue that made it difficult to resize images in certain cases.\n- Enhanced image loading reliability by clearing the image cache when images fail to load.\n- Resolved a problem preventing the launching of URLs on some Linux distributions.\n\n## Version 0.5.0 - 02/26/2024\n### New Features\n- Added support for scaling text on mobile platforms for better readability.\n- Introduced a toggle for favorites directly from the documents' top bar.\n- Optimized the image upload process and added error messaging for failed uploads.\n- Implemented depth control for outline block components.\n- New checklist task creation is now more intuitive, with prompts appearing on hover over list items in the row detail page.\n- Enhanced sorting capabilities, allowing reordering and addition of multiple sorts.\n- Expanded sorting and filtering options to include more field types like checklist, creation time, and modification time.\n- Added support for field calculations within databases.\n### Bug Fixes\n- Fixed an issue where inserting an image from Unsplash in local mode was not possible.\n- Fixed undo/redo functionality in lists.\n- Fixed data loss issues when converting between block types.\n- Fixed a bug where newly created rows were not being automatically sorted.\n- Fixed issues related to deleting a sorting field or sort not removing existing sorts properly.\n### Notes\n- Windows 7, Windows 8, and iOS 11 are not yet supported due to the upgrade to Flutter 3.22.0.\n\n## Version 0.4.9 - 02/17/2024\n### Bug Fixes\n- Resolved the issue that caused users to be redirected to the Sign In page\n\n## Version 0.4.8 - 02/13/2024\n### Bug Fixes\n- Fixed a possible error when loading workspaces\n\n## Version 0.4.6 - 02/03/2024\n### Bug Fixes\n- Fixed refresh token bug\n\n## Version 0.4.5 - 02/01/2024\n### Bug Fixes\n- Fixed WebSocket connection issue\n\n## Version 0.4.4 - 01/31/2024\n### New Features\n- Added functionality for uploading images to cloud storage.\n- Enabled anonymous sign-in option for mobile platform users.\n- Introduced the ability to customize cloud settings directly from the startup page.\n- Added support for inserting reminders on the mobile platform.\n- Overhauled the user interface on mobile devices, including improvements to the action bottom sheet, editor toolbar, database details page, and app bar.\n- Implemented a shortcut (F2 key) to rename the current view.\n\n### Bug Fixes\n- Fixed an issue where the font family was not displaying correctly on the mobile platform.\n- Resolved a problem with the mobile row detail title not updating correctly.\n- Fixed issues related to deleting images and refactored the image actions menu for better usability.\n- Fixed other known issues.\n\n# Release Notes\n## Version 0.4.3 - 01/16/2024\n### Bug Fixes\n- Fixed file name too long issue\n\n## Version 0.4.2 - 01/15/2024\nAppFlowy for Android is available to download on GitHub.\nIf you’ve been using our desktop app, it’s important to read [this guide](https://docs.appflowy.io/docs/guides/sync-desktop-and-mobile) before logging into the mobile app.\n### New Features\n- Enhanced RTL (Right-to-Left) support for mobile platforms.\n- Optimized selection gesture system on mobile.\n- Optimized the mobile toolbar menu.\n- Improved reference menu (‘@’ menu).\n- Updated privacy policy.\n- Improved the data import process for AppFlowy by implementing a progress indicator and compressing the data to enhance efficiency.\n- Enhanced the utilization of local disk space to optimize storage consumption.\n### Bug Fixes\n- Fixed sign-in cancellation issue on mobile.\n- Resolved keyboard close bug on Android.\n\n\n## Version 0.4.1 - 01/03/2024\n### Bug fixes\n- Fix import AppFlowy data folder\n\n## Version 0.4.0 - 12/30/2023\n1. Added capability to import data from an AppFlowy data folder. For detailed information, please see [AppFlowy Data Storage Documentation](https://docs.appflowy.io/docs/appflowy/product/data-storage).\n2. Enhanced user interface and fixed various bugs.\n3. Improved the efficiency of data synchronization in AppFlowy Cloud\n\n## Version 0.3.9.1 - 12/07/2023\n\n### Bug fixes\n- Fix potential blank pages that may occur in an empty document\n\n## Version 0.3.9 - 12/07/2023\n\n### New Features\n- Support inserting a new field to the left or right of an existing one\n\n### Bug fixes\n- Fix some emojis are shown in black/white\n- Fix unable to rename a subpage of subpage\n\n## Version 0.3.8 - 11/13/2023\n\n### New Features\n- Support hiding any stack in a board\n- Support customizing page icons in menu\n- Display visual hint when card contains notes\n- Quick action for adding new stack to a board\n- Support more ways of inserting page references in documents\n- Shift + click on a checkbox to power toggle its children\n\n### Bug fixes\n- Improved color of the \"Share\"-button text\n- Text overflow issue in Calendar properties\n- Default font (Roboto) added to application\n- Placeholder added for the editor inside a Card\n- Toggle notifications in settings have been fixed\n- Dialog for linking board/grid/calendar opens in correct position\n- Quick add Card in Board at top, correctly adds a new Card at the top\n\n## Version 0.3.7 - 10/30/2023\n\n### New Features\n- Support showing checklist items inline in row page.\n- Support inserting date from slash menu.\n- Support renaming a stack directly by clicking on the stack name.\n- Show the detailed reminder content in the notification center.\n- Save card order in Board view.\n- Allow to hide the ungrouped stack.\n- Segmented the checklist progress bar.\n\n### Bug fixes\n- Optimize side panel animation.\n- Fix calendar with hidden date or title doesn't show options correctly.\n- Fix the horizontal scroll bar disappears in Grid view.\n- Improve setting tab UI in Grid view.\n- Improve theme of the code block.\n- Fix some UI issues.\n\n## Version 0.3.6 - 10/16/2023\n\n### New Features\n- Support setting Markdown styles through keyboard shortcuts.\n- Added Ukrainian language.\n- Support auto-hiding sidebar feature, ensuring a streamlined view even when resizing to a smaller window.\n- Support toggling the notifitcation on/off.\n- Added Lemonade theme.\n\n### Bug fixes\n- Improve Vietnamese translations.\n- Improve reminder feature.\n- Fix some UI issues.\n\n## Version 0.3.5 - 10/09/2023\n\n### New Features\n- Added support for browsing and inserting images from Unsplash.\n- Revamp and unify the emoji picker throughout AppFlowy.\n\n### Bug fixes\n- Improve layout of the settings page.\n- Improve design of the restore page banner.\n- Improve UX of the reminders.\n- Other UI fixes.\n\n## Version 0.3.4 - 10/02/2023\n\n### New Features\n- Added support for creating a reminder.\n- Added support for finding and replacing in the document page.\n- Added support for showing the hidden fields in row detail page.\n- Adjust the toolbar style in RTL mode.\n\n### Bug fixes\n- Improve snackbar UI design.\n- Improve dandelion theme.\n- Improve id-ID and pl-PL language translations.\n\n## Version 0.3.3 - 09/24/2023\n\n### New Features\n- Added an end date field to the time cell in the database.\n- Added Support for customizing the font family from GoogleFonts in the editor.\n- Set the uploaded image to cover by default.\n- Added Support for resetting the user icon on settings page\n- Add Urdu language translations.\n\n### Bug fixes\n- Default colors for the blocks except for the callout were not transparent.\n- Option/Alt + click to add a block above didn't work on the first line.\n- Unable to paste HTML content containing `<mark>` tag.\n- Unable to select the text from anywhere in the line.\n- The selection in the editor didn't clear when editing the inline database.\n- Added a bottom border to new property column in the database.\n- Set minimum width of 50px for grid fields.\n\n## Version 0.3.2 - 09/18/2023\n\n### New Features\n\n- Improve the performance of the editor, now it is much faster when editing a large document.\n- Support for reordering the rows of the database on Windows.\n- Revamp the row detail page of the database.\n- Revamp the checklist cell editor of the database.\n\n### Bug fixes\n\n- Some UI issues\n\n## Version 0.3.1 - 09/04/2023\n\n### New Features\n\n- Improve CJK (Chinese, Japanese, Korean) input method support.\n- Share a database in CSV format.\n- Support for aligning the block component with the toolbar.\n- Support for editing name when creating a new page.\n- Support for inserting a table in the document page.\n- Database views allow for independent field visibility toggling.\n\n### Bug fixes\n\n- Paste multiple lines in code block.\n- Some UI issues\n\n## Version 0.3.0 - 08/22/2023\n\n### New Features\n\n- Improve paste features:\n  - Paste HTML content from website.\n  - Paste image from clipboard.\n\n- Support Group by Date in Kanban Board.\n- Notarize the macOS package, which is now verified by Apple.\n- Add Persian language translations.\n\n### Bug fixes\n\n- Some UI issues\n\n## Version 0.2.9 - 08/08/2023\n\n### New Features\n\n- Improve tab and shortcut, click with alt/option to open a page in new tab.\n- Improve database tab bar UI.\n\n### Bug fixes\n\n- Add button and more action button of the favorite section doesn't work.\n- Fix euro currency number format.\n- Some UI issues\n\n## Version 0.2.8 - 08/03/2023\n\n### New Features\n\n- Nestable personal folder that supports drag and drop\n- Support for favorite folders.\n- Support for sorting by date in Grid view.\n- Add a duplicate button in the Board context menu.\n\n### Bug fixes\n\n- Improve readability in Callout\n- Some UI issues\n\n## Version 0.2.7 - 07/18/2023\n\n### New Features\n\n<img width=\"1147\" src=\"https://github.com/AppFlowy-IO/AppFlowy/assets/11863087/ac464740-c685-4a85-ae99-1074c1c607e5\">\n\n- Open page in new tab\n- Create toggle lists to keep things tidy in your pages\n- Alt/Option + click to add a text block above\n\n### Bug fixes\n\n- Pasting into a Grid property crashed on Windows\n- Double-click a link to open\n\n## Version 0.2.6 - 07/11/2023\n\n### New Features\n\n- Dynamic load themes\n- Inline math equation\n\n\n## Version 0.2.5 - 07/02/2023\n\n### New Features\n\n- Insert local images\n- Mention a page\n- Outlines (Table of contents)\n- Added support for aligning the image by image menu\n\n### Bug fixes\n\n- Some UI issues\n\n## Version 0.2.4 - 06/23/2023\n\n### Bug fixes:\n\n- Unable to copy and paste a word\n- Some UI issues\n\n## Version 0.2.3 - 06/21/2023\n\n### New Features\n\n- Added support for creating multiple database views for existing database\n\n## Version 0.2.2 - 06/15/2023\n\n### New Features\n\n- Added support for embedding a document in the database's row detail page\n- Added support for inserting an emoji in the database's row detail page\n\n### Other Updates\n\n- Added language selector on the welcome page\n- Added support for importing multiple markdown files all at once\n\n## Version 0.2.1 - 06/11/2023\n\n### New Features\n\n- Added support for creating or referencing a calendar in the document\n- Added `+` icon in grid's add field\n\n### Other Updates\n\n- Added vertical padding for progress bar\n- Hide url cell accessory when the content is empty\n\n### Bug fixes:\n\n- Fixed unable to export markdown\n- Fixed adding vertical padding for progress bar\n- Fixed database view didn't update after the database layout changed.\n\n## Version 0.2.0 - 06/08/2023\n\n### New Features\n\n- Improved checklists to support each cell having its own list\n- Drag and drop calendar events\n- Switch layouts (calendar, grid, kanban) of a database\n- New database properties: 'Updated At' and 'Created At'\n- Enabled hiding properties on the row detail page\n- Added support for reordering and saving row order in different database views.\n- Enabled each database view to have its own settings, including filter and sort options\n- Added support to convert `“` (double quote) into a block quote\n- Added support to convert `***` (three stars) into a divider\n- Added support for an 'Add' button to insert a paragraph in a document and display the slash menu\n- Added support for an 'Option' button to delete, duplicate, and customize block actions\n\n### Other Updates\n\n- Added support for importing v0.1.x documents and databases\n- Added support for database import and export to CSV\n- Optimized scroll behavior in documents.\n- Redesigned the launch page\n\n### Bug fixes\n\n- Fixed bugs related to numbers\n- Fixed issues with referenced databases in documents\n- Fixed menu overflow issues in documents\n\n### Data migration\n\nThe data format of this version is not compatible with previous versions. Therefore, to migrate your data to the new version, you need to use the export and import functions. Please follow the guide to learn how to export and import your data.\n\n#### Export files in v0.1.6\n\nhttps://github.com/AppFlowy-IO/AppFlowy/assets/11863087/0c89bf2b-cd97-4a7b-b627-59df8d2967d9\n\n#### Import files in v0.2.0\n\nhttps://github.com/AppFlowy-IO/AppFlowy/assets/11863087/7b392f35-4972-497a-8a7f-f38efced32e2\n\n## Version 0.1.5 - 11/05/2023\n\n### Bug Fixes\n\n- Fix: calendar dates don't match with weekdays.\n- Fix: sort numbers in Grid.\n\n## Version 0.1.4 - 04/05/2023\n\n### New features\n\n- Use AppFlowy’s calendar views to plan and manage tasks and deadlines.\n- Writing can be improved with the help of OpenAI.\n\n## Version 0.1.3 - 24/04/2023\n\n### New features\n\n- Launch the official Dark Mode.\n- Customize the font color and highlight color by setting a hex color value and an opacity level.\n\n### Bug Fixes\n\n- Fix: the slash menu can be triggered by all other keyboards than English.\n- Fix: convert the single asterisk to italic text and the double asterisks to bold text.\n\n## Version 0.1.2 - 03/28/2023\n\n### Bug Fixes\n\n- Fix: update calendar selected range.\n- Fix: duplicate view.\n\n## Version 0.1.1 - 03/21/2023\n\n### New features\n\n- AppFlowy brings the power of OpenAI into your AppFlowy pages. Ask AI to write anything for you in AppFlowy.\n- Support adding a cover image to your page, making your pages beautiful.\n- More shortcuts become available. Click on '?' at the bottom right to access our shortcut guide.\n\n### Bug Fixes\n\n- Fix some bugs\n\n## Version 0.1.0 - 02/09/2023\n\n### New features\n\n- Support linking a Board or Grid into the Document page\n- Integrate a callout plugin implemented by community members\n- Optimize user interface\n\n### Bug Fixes\n\n- Fix some bugs\n\n## Version 0.0.9.1 - 01/03/2023\n\n### New features\n\n- New theme\n- Support changing text color of editor\n- Optimize user interface\n\n### Bug Fixes\n\n- Fix some grid bugs\n\n## Version 0.0.9 - 12/21/2022\n\n### New features\n\n- Enable the user to define where to store their data\n- Support inserting Emojis through the slash command\n\n### Bug Fixes\n\n- Fix some bugs\n\n## Version 0.0.8.1 - 12/09/2022\n\n### New features\n\n- Support following your default system theme\n- Improve the filter in Grid\n\n### Bug Fixes\n\n- Copy/Paste\n\n## Version 0.0.8 - 11/30/2022\n\n### New features\n\n- Table-view database\n  - support column type: Checklist\n- Board-view database\n  - support column type: Checklist\n- Customize font size: small, medium, large\n\n## Version 0.0.7.1 - 11/30/2022\n\n### Bug Fixes\n\n- Fix some bugs\n\n## Version 0.0.7 - 11/27/2022\n\n### New features\n\n- Support adding filters by the text/checkbox/single-select property in Grid\n\n## Version 0.0.6.2 - 10/30/2022\n\n- Fix some bugs\n\n## Version 0.0.6.1 - 10/26/2022\n\n### New features\n\n- Optimize appflowy_editor dark mode style\n\n### Bug Fixes\n\n- Unable to copy the text with checkbox or link style\n\n## Version 0.0.6 - 10/23/2022\n\n### New features\n\n- Integrate **appflowy_editor**\n\n## Version 0.0.5.3 - 09/26/2022\n\n### New features\n\n- Open the next page automatically after deleting the current page\n- Refresh the Kanban board after altering a property type\n\n### Bug Fixes\n\n- Fix switch board bug\n- Fix delete the Kanban board's row error\n- Remove duplicate time format\n- Fix can't delete field in property edit panel\n- Adjust some display UI issues\n\n## Version 0.0.5.2 - 09/16/2022\n\n### New features\n\n- Enable adding a new card to the \"No Status\" group\n- Fix some bugs\n\n### Bug Fixes\n\n- Fix cannot open AppFlowy error\n- Fix delete the Kanban board's row error\n\n## Version 0.0.5.1 - 09/14/2022\n\n### New features\n\n- Enable deleting a field in board\n- Fix some bugs\n\n## Version 0.0.5 - 09/08/2022\n\n### New features - Kanban Board like Notion and Trello beta\n\nBoards are the best way to manage projects & tasks. Use them to group your databases by select, multiselect, and checkbox.\n\n<p align=\"left\"><img src=\"https://user-images.githubusercontent.com/12026239/190055984-6efa2d7a-ee38-4551-859e-ee56388e1859.gif\" width=\"1000px\" /></p>\n\n- Set up columns that represent a specific phase of the project cycle and use cards to represent each project/task\n- Drag and drop a card from one phase/column to another phase/column\n- Update database properties in the Board view by clicking on a property and making edits on the card\n\n### Other Features & Improvements\n\n- Settings allow users to change avatars\n- Click and drag the right edge to resize your sidebar\n- And many user interface improvements (link)\n\n## Version 0.0.5 - beta.2 - beta.1 - 09/01/2022\n\n### New features\n\n- Board-view database\n  - Support start editing after creating a new card\n  - Support editing the card directly by clicking the edit button\n  - Add the `No Status` column to display the cards while their status is empty\n\n### Bug Fixes\n\n- Optimize insert card animation\n- Fix some UI bugs\n\n## Version 0.0.5 - beta.1 - 08/25/2022\n\n### New features\n\n- Board-view database\n  - Group by single select\n  - drag and drop cards\n  - insert / delete cards\n\n![Aug-25-2022 16-22-38](https://user-images.githubusercontent.com/86001920/186614248-23186dfe-410e-427a-8cc6-865b1f79e074.gif)\n\n## Version 0.0.4 - 06/06/2022\n\n- Drag to adjust the width of a column\n- Upgrade to Flutter 3.0\n- Native support for M1 chip\n- Date supports time formats\n- New property: URL\n- Keyboard shortcuts support for Grid: press Enter to leave the edit mode; control c/v to copy-paste cell values\n\n### Bug Fixes\n\n- Fixed some bugs\n\n## Version 0.0.4 - beta.3 - 05/02/2022\n\n- Drag to reorder app/ view/ field\n- Row record opens as a page\n- Auto resize the height of the row in the grid\n- Support more number formats\n- Search column options, supporting Single-select, Multi-select, and number format\n\n![May-03-2022 10-03-00](https://user-images.githubusercontent.com/86001920/166394640-a8f1f3bc-5f20-4033-93e9-16bc308d7005.gif)\n\n### Bug Fixes & Improvements\n\n- Improved row/cell data cache\n- Fixed some bugs\n\n## Version 0.0.4 - beta.2 - 04/11/2022\n\n- Support properties: Text, Number, Date, Checkbox, Select, Multi-select\n- Insert / delete rows\n- Add / delete / hide columns\n- Edit property\n  ![](https://user-images.githubusercontent.com/12026239/162753644-bf2f4e7a-2367-4d48-87e6-35e244e83a5b.png)\n\n## Version 0.0.4 - beta.1 - 04/08/2022\n\nv0.0.4 - beta.1 is pre-release\n\n### New features\n\n- Table-view database\n  - support column types: Text, Checkbox, Single-select, Multi-select, Numbers\n  - hide / delete columns\n  - insert rows\n\n## Version 0.0.3 - 02/23/2022\n\nv0.0.3 is production ready, available on Linux, macOS, and Windows\n\n### New features\n\n- Dark Mode\n- Support new languages: French, Italian, Russian, Simplified Chinese, Spanish\n- Add Settings: Toggle on Dark Mode; Select a language\n- Show device info\n- Add tooltip on the toolbar icons\n\nBug fixes and improvements\n\n- Increased height of action\n- CPU performance issue\n- Fix potential data parser error\n- More foundation work for online collaboration"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.287109375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to make participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n  advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies within all project spaces, and it also applies when\nan individual is representing the project or its community in public spaces.\nExamples of representing a project or community include using an official\nproject e-mail address, posting via an official social media account, or acting\nas an appointed representative at an online or offline event. Representation of\na project may be further defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at annie@appflowy.io. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 33.7138671875,
          "content": "                    GNU AFFERO GENERAL PUBLIC LICENSE\n                       Version 3, 19 November 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\n  A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate.  Many developers of free software are heartened and\nencouraged by the resulting cooperation.  However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\n  The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community.  It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server.  Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\n  An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals.  This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing under\nthis license.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU Affero General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Remote Network Interaction; Use with the GNU General Public License.\n\n  Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your version\nsupports such interaction) an opportunity to receive the Corresponding\nSource of your version by providing access to the Corresponding Source\nfrom a network server at no charge, through some standard or customary\nmeans of facilitating copying of software.  This Corresponding Source\nshall include the Corresponding Source for any work covered by version 3\nof the GNU General Public License that is incorporated pursuant to the\nfollowing paragraph.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU Affero General Public License from time to time.  Such new versions\nwill be similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as published\n    by the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source.  For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code.  There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for the\nspecific requirements.\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU AGPL, see\n<https://www.gnu.org/licenses/>.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.560546875,
          "content": "<h1 align=\"center\" style=\"border-bottom: none\">\n    <b>\n        <a href=\"https://www.appflowy.io\">AppFlowy.IO</a><br>\n    </b>\n    ⭐️  The Open Source Alternative To Notion  ⭐️ <br>\n</h1>\n\n<p align=\"center\">\nAppFlowy is the AI workspace where you achieve more without losing control of your data\n</p>\n\n<p align=\"center\">\n<a href=\"https://discord.gg/9Q2xaN37tV\"><img src=\"https://img.shields.io/badge/AppFlowy.IO-discord-orange\"></a>\n<a href=\"https://github.com/AppFlowy-IO/appflowy\"><img src=\"https://img.shields.io/github/stars/AppFlowy-IO/appflowy.svg?style=flat&logo=github&colorB=deeppink&label=stars\"></a>\n<a href=\"https://github.com/AppFlowy-IO/appflowy\"><img src=\"https://img.shields.io/github/forks/AppFlowy-IO/appflowy.svg\"></a>\n<a href=\"https://opensource.org/licenses/AGPL-3.0\"><img src=\"https://img.shields.io/badge/license-AGPL-purple.svg\" alt=\"License: AGPL\"></a>\n\n</p>\n\n<p align=\"center\">\n    <a href=\"https://www.appflowy.io\"><b>Website</b></a> •\n    <a href=\"https://forum.appflowy.io/\"><b>Forum</b></a> •\n    <a href=\"https://discord.gg/9Q2xaN37tV\"><b>Discord</b></a> •\n    <a href=\"https://www.reddit.com/r/AppFlowy\"><b>Reddit</b></a> •\n    <a href=\"https://twitter.com/appflowy\"><b>Twitter</b></a>\n</p>\n\n<p align=\"center\"><img src=\"https://appflowy.io/_next/static/media/tasks.796c753e.png\" alt=\"AppFlowy Kanban Board for To-dos\"  /></p>\n<p align=\"center\"><img src=\"https://appflowy.io/_next/static/media/Grid.9e30484b.png\" alt=\"AppFlowy Databases for Tasks and Projects\"  /></p>\n<p align=\"center\"><img src=\"https://appflowy.io/_next/static/media/sites.a8d5b2b9.png\" alt=\"AppFlowy Sites for Beautiful documentation\"  /></p>\n<p align=\"center\"><img src=\"https://appflowy.io/_next/static/media/ai.e1460982.png\" alt=\"AppFlowy AI\" /></p>\n<p align=\"center\"><img src=\"https://appflowy.io/_next/static/media/template.9ea13c3b.png\" alt=\"AppFlowy Templates\"  /></p>\n\n<br></br>\n<p align=\"center\" >\n    <img src=\"https://github.com/user-attachments/assets/5841c491-b564-4a26-b9b6-191def430911\" alt=\"Work across devices\" width=\"1040px\" /></p>\n<p align=\"center\" >\n    <img src=\"https://github.com/user-attachments/assets/c2ba6bb8-746c-4743-9393-d008a669be95\" alt=\"Work across devices\" width=\"1040px\" /></p>\n<p align=\"center\" >\n    <img src=\"https://github.com/user-attachments/assets/e83dd1a3-4975-4d0e-91a1-9eb6e0d248cd\" alt=\"Work across devices\" width=\"1040px\" /></p>\n\n## User Installation\n\n- [Download AppFlowy Desktop (macOS, Windows, and Linux)](https://github.com/AppFlowy-IO/AppFlowy/releases)\n- Other\n  channels: [FlatHub](https://flathub.org/apps/io.appflowy.AppFlowy), [Snapcraft](https://snapcraft.io/appflowy), [Sourceforge](https://sourceforge.net/projects/appflowy/)\n- Available on\n    - [App Store](https://apps.apple.com/app/appflowy/id6457261352): iPhone\n    - [Play Store](https://play.google.com/store/apps/details?id=io.appflowy.appflowy): Android 10 or above; ARMv7 is\n      not supported\n- [Self-hosting AppFlowy](https://docs.appflowy.io/docs/guides/appflowy/self-hosting-appflowy)\n- [Source](https://docs.appflowy.io/docs/documentation/appflowy/from-source)\n\n## Built With\n\n- [Flutter](https://flutter.dev/)\n\n- [Rust](https://www.rust-lang.org/)\n\n## Stay Up-to-Date\n\n<p align=\"center\"><img src=\"https://github.com/AppFlowy-IO/appflowy/blob/main/doc/imgs/howtostar.gif\" alt=\"AppFlowy Github - how to star the repo\" width=\"100%\" /></p>\n\n## Getting Started with development\n\nPlease view the [documentation](https://docs.appflowy.io/docs/documentation/appflowy/from-source) for OS specific\ndevelopment instructions\n\n## Roadmap\n\n- [AppFlowy Roadmap ReadMe](https://docs.appflowy.io/docs/appflowy/roadmap)\n- [AppFlowy Public Roadmap](https://github.com/orgs/AppFlowy-IO/projects/5/views/12)\n\nIf you'd like to propose a feature, submit a feature\nrequest [here](https://github.com/AppFlowy-IO/AppFlowy/issues/new?assignees=&labels=&template=feature_request.yaml&title=%5BFR%5D+) <br/>\nIf you'd like to report a bug, submit a bug\nreport [here](https://github.com/AppFlowy-IO/AppFlowy/issues/new?assignees=&labels=&template=bug_report.yaml&title=%5BBug%5D+)\n\n## **Releases**\n\nPlease see the [changelog](https://www.appflowy.io/whatsnew) for more details about a given release.\n\n## Contributing\n\nContributions make the open-source community a fantastic place to learn, inspire, and create. Any contributions you make\nare **greatly appreciated**. Please look\nat [Contributing to AppFlowy](https://docs.appflowy.io/docs/documentation/software-contributions/contributing-to-appflowy)\nfor details.\n\nIf your Pull Request is accepted as it fixes a bug, adds functionality, or makes AppFlowy's codebase significantly\neasier to use or understand, **Congratulations!** If your administrative and managerial work behind the scenes sustains\nthe community, **Congratulations!** You are now an official contributor to AppFlowy. Get in touch with\nus ([link](https://tally.so/r/mKP5z3)) to receive the very special Contributor T-shirt!\nProudly wear your T-shirt and show it to us by tagging [@appflowy](https://twitter.com/appflowy) on Twitter.\n\n## Translations 🌎🗺\n\n[![translation badge](https://inlang.com/badge?url=github.com/AppFlowy-IO/AppFlowy)](https://inlang.com/editor/github.com/AppFlowy-IO/AppFlowy?ref=badge)\n\nTo add translations, you can manually edit the JSON translation files in `/frontend/resources/translations`, use\nthe [inlang online editor](https://inlang.com/editor/github.com/AppFlowy-IO/AppFlowy), or\nrun `npx inlang machine translate` to add missing translations.\n\n## Join the community to build AppFlowy together\n\n<a href=\"https://github.com/AppFlowy-IO/AppFlowy/graphs/contributors\">\n  <img src=\"https://contrib.rocks/image?repo=AppFlowy-IO/AppFlowy\" />\n</a>\n\n## Why Are We Building This?\n\nNotion has been our favourite project and knowledge management tool in recent years because of its aesthetic appeal and\nfunctionality. Our team uses it daily, and we are on its paid plan. However, as we all know, Notion has its limitations.\nThese include weak data security and poor compatibility with mobile devices. Likewise, alternative collaborative\nworkplace management tools also have their constraints.\n\nThe limitations we encountered using these tools and our past work experience with collaborative productivity tools have\nled to our firm belief that there is a glass ceiling on what's possible for these tools in the future. This emanates\nfrom the fact that these tools will probably struggle to scale horizontally at some point and be forced to prioritize a\nproportion of customers whose needs differ from the rest. While decision-makers want a workplace OS, it is impossible to\ncome up with a one-size fits all solution in such a fragmented market.\n\nWhen a customer's evolving core needs are not satisfied, they either switch to another or build one from the ground up,\nin-house. Consequently, they either go under another ceiling or buy an expensive ticket to learn a hard lesson. This is\na requirement for many resources and expertise, building a reliable and easy-to-use collaborative tool, not to mention\nthe speed and native experience. The same may apply to individual users as well.\n\nAll these restrictions necessitate our mission - to make it possible for anyone to create apps that suit their needs\nwell.\n\n- To individuals, we would like to offer Notion's functionality, data security, and cross-platform native experience.\n- To enterprises and hackers, AppFlowy is dedicated to offering building blocks and collaboration infra services to\n  enable you to make apps on your own. Moreover, you have 100% control of your data. You can design and modify AppFlowy\n  your way, with a single codebase written in Flutter and Rust supporting multiple platforms armed with long-term\n  maintainability.\n\nWe decided to achieve this mission by upholding the three most fundamental values:\n\n- Data privacy first\n- Reliable native experience\n- Community-driven extensibility\n\nWe do not claim to outperform Notion in terms of functionality and design, at least for now. Besides, our priority\ndoesn't lie in more functionality at the moment. Instead, we would like to cultivate a community to democratize the\nknowledge and wheels of making complex workplace management tools while enabling people and businesses to create\nbeautiful things on their own by equipping them with a versatile toolbox of building blocks.\n\n## License\n\nDistributed under the AGPLv3 License. See [`LICENSE.md`](https://github.com/AppFlowy-IO/AppFlowy/blob/main/LICENSE) for\nmore information.\n\n## Acknowledgments\n\nSpecial thanks to these amazing projects which help power AppFlowy.IO:\n\n- [cargo-make](https://github.com/sagiegurari/cargo-make)\n- [contrib.rocks](https://contrib.rocks)\n- [flutter_chat_ui](https://pub.dev/packages/flutter_chat_ui)"
        },
        {
          "name": "ROADMAP.md",
          "type": "blob",
          "size": 0.359375,
          "content": "## Our [roadmap](https://github.com/orgs/AppFlowy-IO/projects/5/views/12) is where you can learn about the features we’re working on, their status, when we expect to release them, and how you can help us. \n\n## Find more information about how to use our official AppFlowy public roadmap on [Gitbook](https://appflowy.gitbook.io/docs/essential-documentation/roadmap).\n"
        },
        {
          "name": "codemagic.yaml",
          "type": "blob",
          "size": 1.2783203125,
          "content": "workflows:\n  ios-workflow:\n    name: iOS Workflow\n    instance_type: mac_mini_m2\n    max_build_duration: 30\n    environment:\n      flutter: 3.22.3\n      xcode: latest\n      cocoapods: default\n\n    scripts:\n      - name: Build Flutter\n        script: |\n          curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh -s -- -y\n          source \"$HOME/.cargo/env\"\n          rustc --version\n          cargo --version\n\n          cd frontend\n\n          rustup target install aarch64-apple-ios-sim\n          cargo install --force cargo-make\n          cargo install --force --locked duckscript_cli\n          cargo install --force cargo-lipo\n\n          cargo make appflowy-flutter-deps-tools\n          cargo make --profile development-ios-arm64-sim appflowy-core-dev-ios\n          cargo make --profile development-ios-arm64-sim code_generation\n\n      - name: iOS integration tests\n        script: |\n          cd frontend/appflowy_flutter\n          flutter emulators --launch apple_ios_simulator\n          flutter -d iPhone test integration_test/runner.dart\n\n    artifacts:\n      - build/ios/ipa/*.ipa\n      - /tmp/xcodebuild_logs/*.log\n      - flutter_drive.log\n\n    publishing:\n      email:\n        recipients:\n          - lucas.xu@appflowy.io\n        notify:\n          success: true\n          failure: true\n"
        },
        {
          "name": "commitlint.config.js",
          "type": "blob",
          "size": 0.77734375,
          "content": "// module.exports = {extends: ['@commitlint/config-conventional']}\nmodule.exports = {\n    rules: {\n        'header-max-length': [2, 'always', 100],\n\n        'type-enum': [2, 'always', ['build', 'chore', 'ci', 'docs', 'feat', 'feature', 'fix', 'refactor', 'style', 'test']],\n        'type-empty': [2, 'never'],\n        'type-case': [2, 'always', 'lower-case'],\n\n        'subject-empty': [2, 'never'],\n        'subject-case': [\n            0,\n            'never',\n            ['sentence-case', 'start-case', 'pascal-case', 'upper-case'],\n        ],\n\n        'body-leading-blank': [2, 'always'],\n        'body-max-line-length': [2, 'always', 200],\n        'body-case': [0, 'never', []],\n\n        'footer-leading-blank': [1, 'always'],\n        'footer-max-line-length': [2, 'always', 100]\n    },\n};\n\n"
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "frontend",
          "type": "tree",
          "content": null
        },
        {
          "name": "install.sh",
          "type": "blob",
          "size": 9.01953125,
          "content": "#!/bin/sh\n\nset -e\n\nusage() {\n  this=$1\n  cat <<EOF\n$this: download latest archive file for AppFlowy-IO/AppFlowy\nUsage: $this [-b] bindir [-d] [tag]\n  -b sets bindir or installation directory, Defaults to /opt\n  -d turns on debug logging\n   [tag] is a tag from\n   https://github.com/AppFlowy-IO/AppFlowy/releases\n   If tag is missing, then the latest will be used.\nEOF\n  exit 2\n}\n\nparse_args() {\n  #BINDIR is /opt unless set be ENV\n  # over-ridden by flag below\n  BINDIR=${BINDIR:-/opt}\n  while getopts \"b:dh?\" arg; do\n    case \"$arg\" in\n      b) BINDIR=\"$OPTARG\" ;;\n      d) log_set_priority 10 ;;\n      h | \\?) usage \"$0\" ;;\n    esac\n  done\n  shift $((OPTIND - 1))\n  TAG=$1\n}\n\n# this function wraps all the destructive operations\n# if a curl|bash cuts off the end of the script due to\n# network, either nothing will happen or will syntax error\n# out preventing half-done work\nexecute() {\n  tmpdir=$(mktmpdir)\n  log_debug \"downloading files into ${tmpdir}\"\n  http_download \"${tmpdir}/${TARBALL}\" \"${TARBALL_URL}\"\n  srcdir=\"${tmpdir}\"\n  (cd \"${tmpdir}\" && tar -xzvf \"${TARBALL}\")\n  install -d \"${BINDIR}\"\n  sudo mv \"${srcdir}/${PROJECT_NAME}\" /opt\n  log_info \"installed ${BINDIR}/${PROJECT_NAME}\"\n  (cd \"/opt/${PROJECT_NAME}\" && ./AppFlowy)\n}\n\nis_supported_platform() {\n  platform=$1\n  found=1\n  case \"$platform\" in\n    windows/amd64) found=0 ;;\n    darwin/amd64) found=0 ;;\n    darwin/arm64) found=0 ;;\n    linux/amd64) found=0 ;;\n    linux/arm64) found=0 ;;\n    linux/armv6) found=0 ;;\n    linux/armv7) found=0 ;;\n  esac\n  return $found\n}\n\ncheck_platform() {\n  if is_supported_platform \"$PLATFORM\"; then\n    # optional logging goes here\n    true\n  else\n    log_crit \"platform $PLATFORM is not supported.  Make sure this script is up-to-date and file request at https://github.com/${PREFIX}/issues/new\"\n    exit 1\n  fi\n}\n\ntag_to_version() {\n  if [ -z \"${TAG}\" ]; then\n    log_info \"checking GitHub for latest tag\"\n  else\n    log_info \"checking GitHub for tag '${TAG}'\"\n  fi\n  REALTAG=$(github_release \"$OWNER/$REPO\" \"${TAG}\") && true\n  if test -z \"$REALTAG\"; then\n    log_crit \"unable to find '${TAG}' - use 'latest' or see https://github.com/${PREFIX}/releases for details\"\n    exit 1\n  fi\n  # if version starts with 'v', remove it\n  TAG=\"$REALTAG\"\n  VERSION=${TAG#v}\n}\n\nadjust_format() {\n  # change format (tar.gz or zip) based on ARCH\n  true\n}\n\nadjust_os() {\n  # adjust archive name based on OS\n  true\n}\n\nadjust_arch() {\n  # adjust archive name based on ARCH\n  true\n}\n\ncat /dev/null <<EOF\n------------------------------------------------------------------------\nhttps://github.com/client9/shlib - portable posix shell functions\nPublic domain - http://unlicense.org\nhttps://github.com/client9/shlib/blob/master/LICENSE.md\nbut credit (and pull requests) appreciated.\n------------------------------------------------------------------------\nEOF\n\nis_command() {\n  command -v \"$1\" >/dev/null\n}\n\nechoerr() {\n  echo \"$@\" 1>&2\n}\n\nlog_prefix() {\n  echo \"$0\"\n}\n\n_logp=6\nlog_set_priority() {\n  _logp=\"$1\"\n}\n\nlog_priority() {\n  if test -z \"$1\"; then\n    echo \"$_logp\"\n    return\n  fi\n  [ \"$1\" -le \"$_logp\" ]\n}\n\nlog_tag() {\n  case $1 in\n    0) echo \"emerg\" ;;\n    1) echo \"alert\" ;;\n    2) echo \"crit\" ;;\n    3) echo \"err\" ;;\n    4) echo \"warning\" ;;\n    5) echo \"notice\" ;;\n    6) echo \"info\" ;;\n    7) echo \"debug\" ;;\n    *) echo \"$1\" ;;\n  esac\n}\n\nlog_debug() {\n  log_priority 7 || return 0\n  echoerr \"$(log_prefix)\" \"$(log_tag 7)\" \"$@\"\n}\n\nlog_info() {\n  log_priority 6 || return 0\n  echoerr \"$(log_prefix)\" \"$(log_tag 6)\" \"$@\"\n}\n\nlog_err() {\n  log_priority 3 || return 0\n  echoerr \"$(log_prefix)\" \"$(log_tag 3)\" \"$@\"\n}\n\nlog_crit() {\n  log_priority 2 || return 0\n  echoerr \"$(log_prefix)\" \"$(log_tag 2)\" \"$@\"\n}\n\nuname_os() {\n  os=$(uname -s | tr '[:upper:]' '[:lower:]')\n  case \"$os\" in\n    msys_nt) os=\"windows\" ;;\n  esac\n  echo \"$os\"\n}\n\nuname_arch() {\n  arch=$(uname -m)\n  case $arch in\n    x86_64) arch=\"amd64\" ;;\n    x86) arch=\"386\" ;;\n    i686) arch=\"386\" ;;\n    i386) arch=\"386\" ;;\n    aarch64) arch=\"arm64\" ;;\n    armv5*) arch=\"armv5\" ;;\n    armv6*) arch=\"armv6\" ;;\n    armv7*) arch=\"armv7\" ;;\n  esac\n  echo ${arch}\n}\n\nuname_os_check() {\n  os=$(uname_os)\n  case \"$os\" in\n    darwin) return 0 ;;\n    dragonfly) return 0 ;;\n    freebsd) return 0 ;;\n    linux) return 0 ;;\n    android) return 0 ;;\n    nacl) return 0 ;;\n    netbsd) return 0 ;;\n    openbsd) return 0 ;;\n    plan9) return 0 ;;\n    solaris) return 0 ;;\n    windows) return 0 ;;\n  esac\n  log_crit \"uname_os_check '$(uname -s)' got converted to '$os' which is not a GOOS value. Please file bug at https://github.com/client9/shlib\"\n  return 1\n}\n\nuname_arch_check() {\n  arch=$(uname_arch)\n  case \"$arch\" in\n    386) return 0 ;;\n    amd64) return 0 ;;\n    arm64) return 0 ;;\n    armv5) return 0 ;;\n    armv6) return 0 ;;\n    armv7) return 0 ;;\n    ppc64) return 0 ;;\n    ppc64le) return 0 ;;\n    mips) return 0 ;;\n    mipsle) return 0 ;;\n    mips64) return 0 ;;\n    mips64le) return 0 ;;\n    s390x) return 0 ;;\n    amd64p32) return 0 ;;\n  esac\n  log_crit \"uname_arch_check '$(uname -m)' got converted to '$arch' which is not a GOARCH value.  Please file bug report at https://github.com/client9/shlib\"\n  return 1\n}\n\nuntar() {\n  tarball=$1\n  case \"${tarball}\" in\n    *.tar.gz | *.tgz) tar -xzf \"${tarball}\" ;;\n    *.tar) tar -xf \"${tarball}\" ;;\n    *.zip) unzip \"${tarball}\" ;;\n    *)\n      log_err \"untar unknown archive format for ${tarball}\"\n      return 1\n      ;;\n  esac\n}\n\nmktmpdir() {\n  test -z \"$TMPDIR\" && TMPDIR=\"$(mktemp -d)\"\n  mkdir -p \"${TMPDIR}\"\n  echo \"${TMPDIR}\"\n}\n\nhttp_download_curl() {\n  local_file=$1\n  source_url=$2\n  header=$3\n  if [ -z \"$header\" ]; then\n    code=$(curl -w '%{http_code}' -sL -o \"$local_file\" \"$source_url\")\n  else\n    code=$(curl -w '%{http_code}' -sL -H \"$header\" -o \"$local_file\" \"$source_url\")\n  fi\n  if [ \"$code\" != \"200\" ]; then\n    log_debug \"http_download_curl received HTTP status $code\"\n    return 1\n  fi\n  return 0\n}\n\nhttp_download_wget() {\n  local_file=$1\n  source_url=$2\n  header=$3\n  if [ -z \"$header\" ]; then\n    wget -q -O \"$local_file\" \"$source_url\"\n  else\n    wget -q --header \"$header\" -O \"$local_file\" \"$source_url\"\n  fi\n}\n\nhttp_download() {\n  log_debug \"http_download $2\"\n  if is_command curl; then\n    http_download_curl \"$@\"\n    return\n  elif is_command wget; then\n    http_download_wget \"$@\"\n    return\n  fi\n  log_crit \"http_download unable to find wget or curl\"\n  return 1\n}\n\nhttp_copy() {\n  tmp=$(mktemp)\n  http_download \"${tmp}\" \"$1\" \"$2\" || return 1\n  body=$(cat \"$tmp\")\n  rm -f \"${tmp}\"\n  echo \"$body\"\n}\n\ngithub_release() {\n  owner_repo=$1\n  version=$2\n  test -z \"$version\" && version=\"latest\"\n  giturl=\"https://github.com/${owner_repo}/releases/${version}\"\n  json=$(http_copy \"$giturl\" \"Accept:application/json\")\n  test -z \"$json\" && return 1\n  version=$(echo \"$json\" | tr -s '\\n' ' ' | sed 's/.*\"tag_name\":\"//' | sed 's/\".*//')\n  test -z \"$version\" && return 1\n  echo \"$version\"\n}\n\nhash_sha256() {\n  TARGET=${1:-/dev/stdin}\n  if is_command gsha256sum; then\n    hash=$(gsha256sum \"$TARGET\") || return 1\n    echo \"$hash\" | cut -d ' ' -f 1\n  elif is_command sha256sum; then\n    hash=$(sha256sum \"$TARGET\") || return 1\n    echo \"$hash\" | cut -d ' ' -f 1\n  elif is_command shasum; then\n    hash=$(shasum -a 256 \"$TARGET\" 2>/dev/null) || return 1\n    echo \"$hash\" | cut -d ' ' -f 1\n  elif is_command openssl; then\n    hash=$(openssl -dst openssl dgst -sha256 \"$TARGET\") || return 1\n    echo \"$hash\" | cut -d ' ' -f a\n  else\n    log_crit \"hash_sha256 unable to find command to compute sha-256 hash\"\n    return 1\n  fi\n}\n\nhash_sha256_verify() {\n  TARGET=$1\n  checksums=$2\n  if [ -z \"$checksums\" ]; then\n    log_err \"hash_sha256_verify checksum file not specified in arg2\"\n    return 1\n  fi\n  BASENAME=${TARGET##*/}\n  want=$(grep -i \"${BASENAME}\" \"${checksums}\" 2>/dev/null | tr '\\t' ' ' | cut -d ' ' -f 1)\n  if [ -z \"$want\" ]; then\n    log_err \"hash_sha256_verify unable to find checksum for '${TARGET}' in '${checksums}'\"\n    return 1\n  fi\n  got=$(hash_sha256 \"$TARGET\")\n  if [ \"$want\" != \"$got\" ]; then\n    log_err \"hash_sha256_verify checksum for '$TARGET' did not verify ${want} vs $got\"\n    return 1\n  fi\n}\n\ncat /dev/null <<EOF\n------------------------------------------------------------------------\nEnd of functions from https://github.com/client9/shlib\n------------------------------------------------------------------------\nEOF\n\nPROJECT_NAME=\"AppFlowy\"\nSHORTHAND_PROJECT_NAME=\"AppFlowy\"\nOWNER=AppFlowy-IO\nREPO=\"AppFlowy\"\nBINARY=AppFlowy\nFORMAT=tar.gz\nOS=$(uname_os)\nARCH=$(uname_arch)\nLIBC=$(ldd --version | head -n 1)\nPREFIX=\"$OWNER/$REPO\"\n\n# use in logging routines\nlog_prefix() {\n\techo \"$PREFIX\"\n}\n\nPLATFORM=\"${OS}/${ARCH}\"\nGITHUB_DOWNLOAD=https://github.com/${OWNER}/${REPO}/releases/download\n\nuname_os_check \"$OS\"\nuname_arch_check \"$ARCH\"\nparse_args \"$@\"\ncheck_platform\ntag_to_version\nadjust_format\nadjust_os\nadjust_arch\nlog_info \"found version: ${VERSION} for ${TAG}/${OS}/${ARCH}\"\n\nNAME=\"${SHORTHAND_PROJECT_NAME}_v${VERSION}_${OS}_${ARCH}\"\nTARBALL=${NAME}.${FORMAT}\n\nif [ \"$OS\" = \"linux\" ]; then\n  OS=\"unknown-linux-gnu\"\n  ARCH=\"x86_64\"\n  DISTRO='ubuntu-20.04'\n  TARBALL=\"${SHORTHAND_PROJECT_NAME}_${ARCH}-${OS}_${DISTRO}.\"tar.gz\"\"\nfi\nTARBALL_URL=${GITHUB_DOWNLOAD}/${TAG}/${TARBALL}\n\nexecute # line: 38"
        },
        {
          "name": "project.inlang.json",
          "type": "blob",
          "size": 1.0654296875,
          "content": "{\n  \"$schema\": \"https://inlang.com/schema/project-settings\",\n  \"sourceLanguageTag\": \"en\",\n  \"languageTags\": [\n    \"en\",\n    \"ar-SA\",\n    \"ca-ES\",\n    \"ckb-KU\",\n    \"cs-CZ\",\n    \"de-DE\",\n    \"es-VE\",\n    \"eu-ES\",\n    \"el-GR\",\n    \"fa\",\n    \"fr-CA\",\n    \"fr-FR\",\n    \"hu-HU\",\n    \"id-ID\",\n    \"it-IT\",\n    \"ja-JP\",\n    \"ko-KR\",\n    \"pl-PL\",\n    \"pt-BR\",\n    \"pt-PT\",\n    \"ru-RU\",\n    \"sv-SE\",\n    \"tr-TR\",\n    \"vi\",\n    \"vi-VN\",\n    \"zh-CN\",\n    \"zh-TW\"\n  ],\n  \"modules\": [\n    \"https://cdn.jsdelivr.net/npm/@inlang/plugin-i18next@4/dist/index.js\",\n    \"https://cdn.jsdelivr.net/npm/@inlang/message-lint-rule-empty-pattern@1/dist/index.js\",\n    \"https://cdn.jsdelivr.net/npm/@inlang/message-lint-rule-identical-pattern@1/dist/index.js\",\n    \"https://cdn.jsdelivr.net/npm/@inlang/message-lint-rule-without-source@1/dist/index.js\",\n    \"https://cdn.jsdelivr.net/npm/@inlang/message-lint-rule-missing-translation@1/dist/index.js\"\n  ],\n  \"plugin.inlang.i18next\": {\n    \"pathPattern\": \"./frontend/resources/translations/{languageTag}.json\",\n    \"variableReferencePattern\": [\n      \"@:\"\n    ]\n  }\n}\n"
        },
        {
          "name": "project.inlang",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}