{
  "metadata": {
    "timestamp": 1736563202269,
    "page": 150,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "wg-easy/wg-easy",
      "stars": 16765,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.0166015625,
          "content": "/src/node_modules"
        },
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.408203125,
          "content": "# http://editorconfig.org\nroot = true\n\n[*]\nindent_style = space\nindent_size = 2\nend_of_line = lf\ncharset = utf-8\ntrim_trailing_whitespace = true\ninsert_final_newline = true\n\n# The JSON files contain newlines inconsistently\n[*.json]\ninsert_final_newline = ignore\n\n# Minified JavaScript files shouldn't be changed\n[**.min.js]\nindent_style = ignore\ninsert_final_newline = ignore\n\n[*.md]\ntrim_trailing_whitespace = false\n\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.060546875,
          "content": "/config\n/wg0.conf\n/wg0.json\n/src/node_modules\n.DS_Store\n*.swp\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 1.5087890625,
          "content": "# As a workaround we have to build on nodejs 18\n# nodejs 20 hangs on build with armv6/armv7\nFROM docker.io/library/node:18-alpine AS build_node_modules\n\n# Copy Web UI\nCOPY src /app\nWORKDIR /app\nRUN npm ci --omit=dev &&\\\n    mv node_modules /node_modules\n\n# Copy build result to a new image.\n# This saves a lot of disk space.\nFROM docker.io/library/node:lts-alpine\nHEALTHCHECK CMD /usr/bin/timeout 5s /bin/sh -c \"/usr/bin/wg show | /bin/grep -q interface || exit 1\" --interval=1m --timeout=5s --retries=3\nCOPY --from=build_node_modules /app /app\n\n# Move node_modules one directory up, so during development\n# we don't have to mount it in a volume.\n# This results in much faster reloading!\n#\n# Also, some node_modules might be native, and\n# the architecture & OS of your development machine might differ\n# than what runs inside of docker.\nCOPY --from=build_node_modules /node_modules /node_modules\n\n# Copy the needed wg-password scripts\nCOPY --from=build_node_modules /app/wgpw.sh /bin/wgpw\nRUN chmod +x /bin/wgpw\n\n# Install Linux packages\nRUN apk add --no-cache \\\n    dpkg \\\n    dumb-init \\\n    iptables \\\n    iptables-legacy \\\n    wireguard-tools\n\n# Use iptables-legacy\nRUN update-alternatives --install /usr/sbin/iptables iptables /usr/sbin/iptables-legacy 10 --slave /usr/sbin/iptables-restore iptables-restore /usr/sbin/iptables-legacy-restore --slave /usr/sbin/iptables-save iptables-save /usr/sbin/iptables-legacy-save\n\n# Set Environment\nENV DEBUG=Server,WireGuard\n\n# Run Web UI\nWORKDIR /app\nCMD [\"/usr/bin/dumb-init\", \"node\", \"server.js\"]\n"
        },
        {
          "name": "How_to_generate_an_bcrypt_hash.md",
          "type": "blob",
          "size": 1.5283203125,
          "content": "# wg-password\n\n`wg-password` (wgpw) is a script that generates bcrypt password hashes for use with `wg-easy`, enhancing security by requiring passwords.\n\n## Features\n\n- Generate bcrypt password hashes.\n- Easily integrate with `wg-easy` to enforce password requirements.\n\n## Usage with Docker\n\nTo generate a bcrypt password hash using docker, run the following command :\n\n```sh\ndocker run --rm -it ghcr.io/wg-easy/wg-easy wgpw 'YOUR_PASSWORD'\nPASSWORD_HASH='$2b$12$coPqCsPtcFO.Ab99xylBNOW4.Iu7OOA2/ZIboHN6/oyxca3MWo7fW' // literally YOUR_PASSWORD\n```\nIf a password is not provided, the tool will prompt you for one :\n```sh\ndocker run --rm -it ghcr.io/wg-easy/wg-easy wgpw\nEnter your password:      // hidden prompt, type in your password\nPASSWORD_HASH='$2b$12$coPqCsPtcFO.Ab99xylBNOW4.Iu7OOA2/ZIboHN6/oyxca3MWo7fW'\n```\n\n**Important** : make sure to enclose your password in **single quotes** when you run `docker run` command :\n\n```bash\n$ echo $2b$12$coPqCsPtcF <-- not correct\nb2\n$ echo \"$2b$12$coPqCsPtcF\" <-- not correct\nb2\n$ echo '$2b$12$coPqCsPtcF' <-- correct\n$2b$12$coPqCsPtcF\n```\n\n**Important** : Please note: don't wrap the generated hash password in single quotes when you use `docker-compose.yml`. Instead, replace each `$` symbol with two `$$` symbols. For example:\n\n``` yaml\n- PASSWORD_HASH=$$2y$$10$$hBCoykrB95WSzuV4fafBzOHWKu9sbyVa34GJr8VV5R/pIelfEMYyG\n```\n\nThis hash is for the password 'foobar123', obtained using the command `docker run ghcr.io/wg-easy/wg-easy wgpw 'foobar123'` and then inserted an additional `$` before each existing `$` symbol.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 20.3603515625,
          "content": "Attribution-NonCommercial-ShareAlike 4.0 International\n\n=======================================================================\n\nCreative Commons Corporation (\"Creative Commons\") is not a law firm and\ndoes not provide legal services or legal advice. Distribution of\nCreative Commons public licenses does not create a lawyer-client or\nother relationship. Creative Commons makes its licenses and related\ninformation available on an \"as-is\" basis. Creative Commons gives no\nwarranties regarding its licenses, any material licensed under their\nterms and conditions, or any related information. Creative Commons\ndisclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\nUsing Creative Commons Public Licenses\n\nCreative Commons public licenses provide a standard set of terms and\nconditions that creators and other rights holders may use to share\noriginal works of authorship and other material subject to copyright\nand certain other rights specified in the public license below. The\nfollowing considerations are for informational purposes only, are not\nexhaustive, and do not form part of our licenses.\n\n     Considerations for licensors: Our public licenses are\n     intended for use by those authorized to give the public\n     permission to use material in ways otherwise restricted by\n     copyright and certain other rights. Our licenses are\n     irrevocable. Licensors should read and understand the terms\n     and conditions of the license they choose before applying it.\n     Licensors should also secure all rights necessary before\n     applying our licenses so that the public can reuse the\n     material as expected. Licensors should clearly mark any\n     material not subject to the license. This includes other CC-\n     licensed material, or material used under an exception or\n     limitation to copyright. More considerations for licensors:\n    wiki.creativecommons.org/Considerations_for_licensors\n\n     Considerations for the public: By using one of our public\n     licenses, a licensor grants the public permission to use the\n     licensed material under specified terms and conditions. If\n     the licensor's permission is not necessary for any reason--for\n     example, because of any applicable exception or limitation to\n     copyright--then that use is not regulated by the license. Our\n     licenses grant only permissions under copyright and certain\n     other rights that a licensor has authority to grant. Use of\n     the licensed material may still be restricted for other\n     reasons, including because others have copyright or other\n     rights in the material. A licensor may make special requests,\n     such as asking that all changes be marked or described.\n     Although not required by our licenses, you are encouraged to\n     respect those requests where reasonable. More considerations\n     for the public:\n    wiki.creativecommons.org/Considerations_for_licensees\n\n=======================================================================\n\nCreative Commons Attribution-NonCommercial-ShareAlike 4.0 International\nPublic License\n\nBy exercising the Licensed Rights (defined below), You accept and agree\nto be bound by the terms and conditions of this Creative Commons\nAttribution-NonCommercial-ShareAlike 4.0 International Public License\n(\"Public License\"). To the extent this Public License may be\ninterpreted as a contract, You are granted the Licensed Rights in\nconsideration of Your acceptance of these terms and conditions, and the\nLicensor grants You such rights in consideration of benefits the\nLicensor receives from making the Licensed Material available under\nthese terms and conditions.\n\n\nSection 1 -- Definitions.\n\n  a. Adapted Material means material subject to Copyright and Similar\n     Rights that is derived from or based upon the Licensed Material\n     and in which the Licensed Material is translated, altered,\n     arranged, transformed, or otherwise modified in a manner requiring\n     permission under the Copyright and Similar Rights held by the\n     Licensor. For purposes of this Public License, where the Licensed\n     Material is a musical work, performance, or sound recording,\n     Adapted Material is always produced where the Licensed Material is\n     synched in timed relation with a moving image.\n\n  b. Adapter's License means the license You apply to Your Copyright\n     and Similar Rights in Your contributions to Adapted Material in\n     accordance with the terms and conditions of this Public License.\n\n  c. BY-NC-SA Compatible License means a license listed at\n     creativecommons.org/compatiblelicenses, approved by Creative\n     Commons as essentially the equivalent of this Public License.\n\n  d. Copyright and Similar Rights means copyright and/or similar rights\n     closely related to copyright including, without limitation,\n     performance, broadcast, sound recording, and Sui Generis Database\n     Rights, without regard to how the rights are labeled or\n     categorized. For purposes of this Public License, the rights\n     specified in Section 2(b)(1)-(2) are not Copyright and Similar\n     Rights.\n\n  e. Effective Technological Measures means those measures that, in the\n     absence of proper authority, may not be circumvented under laws\n     fulfilling obligations under Article 11 of the WIPO Copyright\n     Treaty adopted on December 20, 1996, and/or similar international\n     agreements.\n\n  f. Exceptions and Limitations means fair use, fair dealing, and/or\n     any other exception or limitation to Copyright and Similar Rights\n     that applies to Your use of the Licensed Material.\n\n  g. License Elements means the license attributes listed in the name\n     of a Creative Commons Public License. The License Elements of this\n     Public License are Attribution, NonCommercial, and ShareAlike.\n\n  h. Licensed Material means the artistic or literary work, database,\n     or other material to which the Licensor applied this Public\n     License.\n\n  i. Licensed Rights means the rights granted to You subject to the\n     terms and conditions of this Public License, which are limited to\n     all Copyright and Similar Rights that apply to Your use of the\n     Licensed Material and that the Licensor has authority to license.\n\n  j. Licensor means the individual(s) or entity(ies) granting rights\n     under this Public License.\n\n  k. NonCommercial means not primarily intended for or directed towards\n     commercial advantage or monetary compensation. For purposes of\n     this Public License, the exchange of the Licensed Material for\n     other material subject to Copyright and Similar Rights by digital\n     file-sharing or similar means is NonCommercial provided there is\n     no payment of monetary compensation in connection with the\n     exchange.\n\n  l. Share means to provide material to the public by any means or\n     process that requires permission under the Licensed Rights, such\n     as reproduction, public display, public performance, distribution,\n     dissemination, communication, or importation, and to make material\n     available to the public including in ways that members of the\n     public may access the material from a place and at a time\n     individually chosen by them.\n\n  m. Sui Generis Database Rights means rights other than copyright\n     resulting from Directive 96/9/EC of the European Parliament and of\n     the Council of 11 March 1996 on the legal protection of databases,\n     as amended and/or succeeded, as well as other essentially\n     equivalent rights anywhere in the world.\n\n  n. You means the individual or entity exercising the Licensed Rights\n     under this Public License. Your has a corresponding meaning.\n\n\nSection 2 -- Scope.\n\n  a. License grant.\n\n       1. Subject to the terms and conditions of this Public License,\n          the Licensor hereby grants You a worldwide, royalty-free,\n          non-sublicensable, non-exclusive, irrevocable license to\n          exercise the Licensed Rights in the Licensed Material to:\n\n            a. reproduce and Share the Licensed Material, in whole or\n               in part, for NonCommercial purposes only; and\n\n            b. produce, reproduce, and Share Adapted Material for\n               NonCommercial purposes only.\n\n       2. Exceptions and Limitations. For the avoidance of doubt, where\n          Exceptions and Limitations apply to Your use, this Public\n          License does not apply, and You do not need to comply with\n          its terms and conditions.\n\n       3. Term. The term of this Public License is specified in Section\n          6(a).\n\n       4. Media and formats; technical modifications allowed. The\n          Licensor authorizes You to exercise the Licensed Rights in\n          all media and formats whether now known or hereafter created,\n          and to make technical modifications necessary to do so. The\n          Licensor waives and/or agrees not to assert any right or\n          authority to forbid You from making technical modifications\n          necessary to exercise the Licensed Rights, including\n          technical modifications necessary to circumvent Effective\n          Technological Measures. For purposes of this Public License,\n          simply making modifications authorized by this Section 2(a)\n          (4) never produces Adapted Material.\n\n       5. Downstream recipients.\n\n            a. Offer from the Licensor -- Licensed Material. Every\n               recipient of the Licensed Material automatically\n               receives an offer from the Licensor to exercise the\n               Licensed Rights under the terms and conditions of this\n               Public License.\n\n            b. Additional offer from the Licensor -- Adapted Material.\n               Every recipient of Adapted Material from You\n               automatically receives an offer from the Licensor to\n               exercise the Licensed Rights in the Adapted Material\n               under the conditions of the Adapter's License You apply.\n\n            c. No downstream restrictions. You may not offer or impose\n               any additional or different terms or conditions on, or\n               apply any Effective Technological Measures to, the\n               Licensed Material if doing so restricts exercise of the\n               Licensed Rights by any recipient of the Licensed\n               Material.\n\n       6. No endorsement. Nothing in this Public License constitutes or\n          may be construed as permission to assert or imply that You\n          are, or that Your use of the Licensed Material is, connected\n          with, or sponsored, endorsed, or granted official status by,\n          the Licensor or others designated to receive attribution as\n          provided in Section 3(a)(1)(A)(i).\n\n  b. Other rights.\n\n       1. Moral rights, such as the right of integrity, are not\n          licensed under this Public License, nor are publicity,\n          privacy, and/or other similar personality rights; however, to\n          the extent possible, the Licensor waives and/or agrees not to\n          assert any such rights held by the Licensor to the limited\n          extent necessary to allow You to exercise the Licensed\n          Rights, but not otherwise.\n\n       2. Patent and trademark rights are not licensed under this\n          Public License.\n\n       3. To the extent possible, the Licensor waives any right to\n          collect royalties from You for the exercise of the Licensed\n          Rights, whether directly or through a collecting society\n          under any voluntary or waivable statutory or compulsory\n          licensing scheme. In all other cases the Licensor expressly\n          reserves any right to collect such royalties, including when\n          the Licensed Material is used other than for NonCommercial\n          purposes.\n\n\nSection 3 -- License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the\nfollowing conditions.\n\n  a. Attribution.\n\n       1. If You Share the Licensed Material (including in modified\n          form), You must:\n\n            a. retain the following if it is supplied by the Licensor\n               with the Licensed Material:\n\n                 i. identification of the creator(s) of the Licensed\n                    Material and any others designated to receive\n                    attribution, in any reasonable manner requested by\n                    the Licensor (including by pseudonym if\n                    designated);\n\n                ii. a copyright notice;\n\n               iii. a notice that refers to this Public License;\n\n                iv. a notice that refers to the disclaimer of\n                    warranties;\n\n                 v. a URI or hyperlink to the Licensed Material to the\n                    extent reasonably practicable;\n\n            b. indicate if You modified the Licensed Material and\n               retain an indication of any previous modifications; and\n\n            c. indicate the Licensed Material is licensed under this\n               Public License, and include the text of, or the URI or\n               hyperlink to, this Public License.\n\n       2. You may satisfy the conditions in Section 3(a)(1) in any\n          reasonable manner based on the medium, means, and context in\n          which You Share the Licensed Material. For example, it may be\n          reasonable to satisfy the conditions by providing a URI or\n          hyperlink to a resource that includes the required\n          information.\n       3. If requested by the Licensor, You must remove any of the\n          information required by Section 3(a)(1)(A) to the extent\n          reasonably practicable.\n\n  b. ShareAlike.\n\n     In addition to the conditions in Section 3(a), if You Share\n     Adapted Material You produce, the following conditions also apply.\n\n       1. The Adapter's License You apply must be a Creative Commons\n          license with the same License Elements, this version or\n          later, or a BY-NC-SA Compatible License.\n\n       2. You must include the text of, or the URI or hyperlink to, the\n          Adapter's License You apply. You may satisfy this condition\n          in any reasonable manner based on the medium, means, and\n          context in which You Share Adapted Material.\n\n       3. You may not offer or impose any additional or different terms\n          or conditions on, or apply any Effective Technological\n          Measures to, Adapted Material that restrict exercise of the\n          rights granted under the Adapter's License You apply.\n\n\nSection 4 -- Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that\napply to Your use of the Licensed Material:\n\n  a. for the avoidance of doubt, Section 2(a)(1) grants You the right\n     to extract, reuse, reproduce, and Share all or a substantial\n     portion of the contents of the database for NonCommercial purposes\n     only;\n\n  b. if You include all or a substantial portion of the database\n     contents in a database in which You have Sui Generis Database\n     Rights, then the database in which You have Sui Generis Database\n     Rights (but not its individual contents) is Adapted Material,\n     including for purposes of Section 3(b); and\n\n  c. You must comply with the conditions in Section 3(a) if You Share\n     all or a substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not\nreplace Your obligations under this Public License where the Licensed\nRights include other Copyright and Similar Rights.\n\n\nSection 5 -- Disclaimer of Warranties and Limitation of Liability.\n\n  a. UNLESS OTHERWISE SEPARATELY UNDERTAKEN BY THE LICENSOR, TO THE\n     EXTENT POSSIBLE, THE LICENSOR OFFERS THE LICENSED MATERIAL AS-IS\n     AND AS-AVAILABLE, AND MAKES NO REPRESENTATIONS OR WARRANTIES OF\n     ANY KIND CONCERNING THE LICENSED MATERIAL, WHETHER EXPRESS,\n     IMPLIED, STATUTORY, OR OTHER. THIS INCLUDES, WITHOUT LIMITATION,\n     WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR\n     PURPOSE, NON-INFRINGEMENT, ABSENCE OF LATENT OR OTHER DEFECTS,\n     ACCURACY, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\n     KNOWN OR DISCOVERABLE. WHERE DISCLAIMERS OF WARRANTIES ARE NOT\n     ALLOWED IN FULL OR IN PART, THIS DISCLAIMER MAY NOT APPLY TO YOU.\n\n  b. TO THE EXTENT POSSIBLE, IN NO EVENT WILL THE LICENSOR BE LIABLE\n     TO YOU ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\n     NEGLIGENCE) OR OTHERWISE FOR ANY DIRECT, SPECIAL, INDIRECT,\n     INCIDENTAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY, OR OTHER LOSSES,\n     COSTS, EXPENSES, OR DAMAGES ARISING OUT OF THIS PUBLIC LICENSE OR\n     USE OF THE LICENSED MATERIAL, EVEN IF THE LICENSOR HAS BEEN\n     ADVISED OF THE POSSIBILITY OF SUCH LOSSES, COSTS, EXPENSES, OR\n     DAMAGES. WHERE A LIMITATION OF LIABILITY IS NOT ALLOWED IN FULL OR\n     IN PART, THIS LIMITATION MAY NOT APPLY TO YOU.\n\n  c. The disclaimer of warranties and limitation of liability provided\n     above shall be interpreted in a manner that, to the extent\n     possible, most closely approximates an absolute disclaimer and\n     waiver of all liability.\n\n\nSection 6 -- Term and Termination.\n\n  a. This Public License applies for the term of the Copyright and\n     Similar Rights licensed here. However, if You fail to comply with\n     this Public License, then Your rights under this Public License\n     terminate automatically.\n\n  b. Where Your right to use the Licensed Material has terminated under\n     Section 6(a), it reinstates:\n\n       1. automatically as of the date the violation is cured, provided\n          it is cured within 30 days of Your discovery of the\n          violation; or\n\n       2. upon express reinstatement by the Licensor.\n\n     For the avoidance of doubt, this Section 6(b) does not affect any\n     right the Licensor may have to seek remedies for Your violations\n     of this Public License.\n\n  c. For the avoidance of doubt, the Licensor may also offer the\n     Licensed Material under separate terms or conditions or stop\n     distributing the Licensed Material at any time; however, doing so\n     will not terminate this Public License.\n\n  d. Sections 1, 5, 6, 7, and 8 survive termination of this Public\n     License.\n\n\nSection 7 -- Other Terms and Conditions.\n\n  a. The Licensor shall not be bound by any additional or different\n     terms or conditions communicated by You unless expressly agreed.\n\n  b. Any arrangements, understandings, or agreements regarding the\n     Licensed Material not stated herein are separate from and\n     independent of the terms and conditions of this Public License.\n\n\nSection 8 -- Interpretation.\n\n  a. For the avoidance of doubt, this Public License does not, and\n     shall not be interpreted to, reduce, limit, restrict, or impose\n     conditions on any use of the Licensed Material that could lawfully\n     be made without permission under this Public License.\n\n  b. To the extent possible, if any provision of this Public License is\n     deemed unenforceable, it shall be automatically reformed to the\n     minimum extent necessary to make it enforceable. If the provision\n     cannot be reformed, it shall be severed from this Public License\n     without affecting the enforceability of the remaining terms and\n     conditions.\n\n  c. No term or condition of this Public License will be waived and no\n     failure to comply consented to unless expressly agreed to by the\n     Licensor.\n\n  d. Nothing in this Public License constitutes or may be interpreted\n     as a limitation upon, or waiver of, any privileges and immunities\n     that apply to the Licensor or You, including from the legal\n     processes of any jurisdiction or authority.\n\n=======================================================================\n\nCreative Commons is not a party to its public\nlicenses. Notwithstanding, Creative Commons may elect to apply one of\nits public licenses to material it publishes and in those instances\nwill be considered the “Licensor.” The text of the Creative Commons\npublic licenses is dedicated to the public domain under the CC0 Public\nDomain Dedication. Except for the limited purpose of indicating that\nmaterial is shared under a Creative Commons public license or as\notherwise permitted by the Creative Commons policies published at\ncreativecommons.org/policies, Creative Commons does not authorize the\nuse of the trademark \"Creative Commons\" or any other trademark or logo\nof Creative Commons without its prior written consent including,\nwithout limitation, in connection with any unauthorized modifications\nto any of its public licenses or any other arrangements,\nunderstandings, or agreements concerning use of licensed material. For\nthe avoidance of doubt, this paragraph does not form part of the\npublic licenses.\n\nCreative Commons may be contacted at creativecommons.org.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.935546875,
          "content": "# WireGuard Easy\n\n[![Build & Publish Docker Image to Docker Hub](https://github.com/wg-easy/wg-easy/actions/workflows/deploy.yml/badge.svg?branch=production)](https://github.com/wg-easy/wg-easy/actions/workflows/deploy.yml)\n[![Lint](https://github.com/wg-easy/wg-easy/actions/workflows/lint.yml/badge.svg?branch=master)](https://github.com/wg-easy/wg-easy/actions/workflows/lint.yml)\n![Docker](https://img.shields.io/docker/pulls/weejewel/wg-easy.svg)\n[![Sponsor](https://img.shields.io/github/sponsors/weejewel)](https://github.com/sponsors/WeeJeWel)\n![GitHub Stars](https://img.shields.io/github/stars/wg-easy/wg-easy)\n\nYou have found the easiest way to install & manage WireGuard on any Linux host!\n\n<p align=\"center\">\n  <img src=\"./assets/screenshot.png\" width=\"802\" />\n</p>\n\n## Features\n\n* All-in-one: WireGuard + Web UI.\n* Easy installation, simple to use.\n* List, create, edit, delete, enable & disable clients.\n* Show a client's QR code.\n* Download a client's configuration file.\n* Statistics for which clients are connected.\n* Tx/Rx charts for each connected client.\n* Gravatar support.\n* Automatic Light / Dark Mode\n* Multilanguage Support\n* Traffic Stats (default off)\n* One Time Links (default off)\n* Client Expiry (default off)\n* Prometheus metrics support\n\n## Requirements\n\n* A host with a kernel that supports WireGuard (all modern kernels).\n* A host with Docker installed.\n\n## Versions\n\n> 💡 For the **stable** version please read instructions on the\n> [**production** branch](https://github.com/wg-easy/wg-easy/tree/production)!\n\nWe provide more than 1 docker image tag, the following will help you decide\nwhich one suites the best for you.\n\n| tag | Branch | Example | Description |\n| - | - | - | - |\n| `latest` | [`production`](https://github.com/wg-easy/wg-easy/tree/production) | `ghcr.io/wg-easy/wg-easy:latest` or `ghcr.io/wg-easy/wg-easy` | stable as possbile get bug fixes quickly when needed, deployed against [`production`](https://github.com/wg-easy/wg-easy/tree/production). |\n| `14` | [`production`](https://github.com/wg-easy/wg-easy/tree/production) | `ghcr.io/wg-easy/wg-easy:14` | same as latest, stick to a version tag. |\n| `nightly` | [`master`](https://github.com/wg-easy/wg-easy/tree/master) | `ghcr.io/wg-easy/wg-easy:nightly` | mostly unstable gets frequent package and code updates, deployed against [`master`](https://github.com/wg-easy/wg-easy/tree/master). |\n| `development` | pull requests | `ghcr.io/wg-easy/wg-easy:development` | used for development, testing code from PRs before landing into [`master`](https://github.com/wg-easy/wg-easy/tree/master). |\n\n## Installation\n\n### 1. Install Docker\n\nIf you haven't installed Docker yet, install it by running:\n\n```shell\ncurl -sSL https://get.docker.com | sh\nsudo usermod -aG docker $(whoami)\nexit\n```\n\nAnd log in again.\n\n### 2. Run WireGuard Easy\n\nTo automatically install & run wg-easy, simply run:\n\n```shell\ndocker run --detach \\\n  --name wg-easy \\\n  --env LANG=de \\\n  --env WG_HOST=<🚨YOUR_SERVER_IP> \\\n  --env PASSWORD_HASH='<🚨YOUR_ADMIN_PASSWORD_HASH>' \\\n  --env PORT=51821 \\\n  --env WG_PORT=51820 \\\n  --volume ~/.wg-easy:/etc/wireguard \\\n  --publish 51820:51820/udp \\\n  --publish 51821:51821/tcp \\\n  --cap-add NET_ADMIN \\\n  --cap-add SYS_MODULE \\\n  --sysctl 'net.ipv4.conf.all.src_valid_mark=1' \\\n  --sysctl 'net.ipv4.ip_forward=1' \\\n  --restart unless-stopped \\\n  ghcr.io/wg-easy/wg-easy\n```\n\n> 💡 Replace `<🚨YOUR_SERVER_IP>` with your WAN IP, or a Dynamic DNS hostname.\n>\n> 💡 Replace `<🚨YOUR_ADMIN_PASSWORD_HASH>` with a bcrypt password hash to log in on the Web UI. See [How_to_generate_an_bcrypt_hash.md](./How_to_generate_an_bcrypt_hash.md) for instructions on how to generate a hashed password.\n\nThe Web UI will now be available on `http://0.0.0.0:51821`.\n\nThe Prometheus metrics will now be available on `http://0.0.0.0:51821/metrics`. Grafana dashboard [21733](https://grafana.com/grafana/dashboards/21733-wireguard/)\n\n> 💡 Your configuration files will be saved in `~/.wg-easy`\n\nWireGuard Easy can be launched with Docker Compose as well - just download\n[`docker-compose.yml`](docker-compose.yml), make necessary adjustments and\nexecute `docker compose up --detach`.\n\n### 3. Sponsor\n\nAre you enjoying this project? [Buy Emile a beer!](https://github.com/sponsors/WeeJeWel) 🍻 <br>\nDonation to core component: [WireGuard](https://www.wireguard.com/donations/)\n\n## Options\n\nThese options can be configured by setting environment variables using `-e KEY=\"VALUE\"` in the `docker run` command.\n\n| Env | Default | Example | Description                                                                                                                                          |\n| - | - | - |------------------------------------------------------------------------------------------------------------------------------------------------------|\n| `PORT` | `51821` | `6789` | TCP port for Web UI.                                                                                                                                 |\n| `WEBUI_HOST` | `0.0.0.0` | `localhost` | IP address web UI binds to.                                                                                                                          |\n| `PASSWORD_HASH` | - | `$2y$05$Ci...` | When set, requires a password when logging in to the Web UI. See [How to generate an bcrypt hash.md](\"https://github.com/wg-easy/wg-easy/blob/master/How_to_generate_an_bcrypt_hash.md\") for know how generate the hash. |\n| `WG_HOST` | - | `vpn.myserver.com` | The public hostname of your VPN server.                                                                                                              |\n| `WG_DEVICE` | `eth0` | `ens6f0` | Ethernet device the wireguard traffic should be forwarded through.                                                                                   |\n| `WG_PORT` | `51820` | `12345` | The public UDP port of your VPN server. WireGuard will listen on that (othwise default) inside the Docker container.                                 |\n| `WG_CONFIG_PORT`| `51820` | `12345` | The UDP port used on [Home Assistant Plugin](https://github.com/adriy-be/homeassistant-addons-jdeath/tree/main/wgeasy)\n| `WG_MTU` | `null` | `1420` | The MTU the clients will use. Server uses default WG MTU.                                                                                            |\n| `WG_PERSISTENT_KEEPALIVE` | `0` | `25` | Value in seconds to keep the \"connection\" open. If this value is 0, then connections won't be kept alive.                                            |\n| `WG_DEFAULT_ADDRESS` | `10.8.0.x` | `10.6.0.x` | Clients IP address range. |\n| `WG_DEFAULT_DNS` | `1.1.1.1` | `8.8.8.8, 8.8.4.4` | DNS server clients will use. If set to blank value, clients will not use any DNS. |\n| `WG_ALLOWED_IPS` | `0.0.0.0/0, ::/0` | `192.168.15.0/24, 10.0.1.0/24` | Allowed IPs clients will use. |\n| `WG_PRE_UP` | `...` | - | See [config.js](https://github.com/wg-easy/wg-easy/blob/master/src/config.js#L19) for the default value.                                             |\n| `WG_POST_UP` | `...` | `iptables ...` | See [config.js](https://github.com/wg-easy/wg-easy/blob/master/src/config.js#L20) for the default value.                                             |\n| `WG_PRE_DOWN` | `...` | - | See [config.js](https://github.com/wg-easy/wg-easy/blob/master/src/config.js#L27) for the default value.                                             |\n| `WG_POST_DOWN` | `...` | `iptables ...` | See [config.js](https://github.com/wg-easy/wg-easy/blob/master/src/config.js#L28) for the default value.                                             |\n| `WG_ENABLE_EXPIRES_TIME` | `false` | `true`                         | Enable expire time for clients |\n| `LANG` | `en` | `de` | Web UI language (Supports: en, ua, ru, tr, no, pl, fr, de, ca, es, ko, vi, nl, is, pt, chs, cht, it, th, hi, ja, si).                                        |\n| `UI_TRAFFIC_STATS` | `false` | `true` | Enable detailed RX / TX client stats in Web UI |\n| `UI_CHART_TYPE` | `0` | `1` | UI_CHART_TYPE=0 # Charts disabled, UI_CHART_TYPE=1 # Line chart, UI_CHART_TYPE=2 # Area chart, UI_CHART_TYPE=3 # Bar chart |\n| `WG_ENABLE_ONE_TIME_LINKS` | `false` | `true` | Enable display and generation of short one time download links (expire after 5 minutes) |\n| `MAX_AGE` | `0` | `1440` | The maximum age of Web UI sessions in minutes. `0` means that the session will exist until the browser is closed. |\n| `UI_ENABLE_SORT_CLIENTS` | `false` | `true`                         | Enable UI sort clients by name   |\n| `ENABLE_PROMETHEUS_METRICS` | `false` | `true`                       | Enable Prometheus metrics `http://0.0.0.0:51821/metrics` and `http://0.0.0.0:51821/metrics/json`|\n| `PROMETHEUS_METRICS_PASSWORD` | - | `$2y$05$Ci...` | If set, Basic Auth is required when requesting metrics. See [How to generate an bcrypt hash.md](\"https://github.com/wg-easy/wg-easy/blob/master/How_to_generate_an_bcrypt_hash.md\") for know how generate the hash. |\n\n> If you change `WG_PORT`, make sure to also change the exposed port.\n\n## Updating\n\nTo update to the latest version, simply run:\n\n```shell\ndocker stop wg-easy\ndocker rm wg-easy\ndocker pull ghcr.io/wg-easy/wg-easy\n```\n\nAnd then run the `docker run -d \\ ...` command above again.\n\nWith Docker Compose WireGuard Easy can be updated with a single command:\n`docker compose up --detach --pull always` (if an image tag is specified in the\nCompose file and it is not `latest`, make sure that it is changed to the desired\none; by default it is omitted and\n[defaults to `latest`](https://docs.docker.com/engine/reference/run/#image-references)). \\\nThe WireGuared Easy container will be automatically recreated if a newer image\nwas pulled.\n\n## Common Use Cases\n\n* [Using WireGuard-Easy with Pi-Hole](https://github.com/wg-easy/wg-easy/wiki/Using-WireGuard-Easy-with-Pi-Hole)\n* [Using WireGuard-Easy with nginx/SSL](https://github.com/wg-easy/wg-easy/wiki/Using-WireGuard-Easy-with-nginx-SSL)\n\nFor less common or specific edge-case scenarios, please refer to the detailed information provided in the [Wiki](https://github.com/wg-easy/wg-easy/wiki).\n"
        },
        {
          "name": "assets",
          "type": "tree",
          "content": null
        },
        {
          "name": "contributing.md",
          "type": "blob",
          "size": 5.904296875,
          "content": "# Contributing to wg-easy\n\nFirst and foremost, thank you! We appreciate that you want to contribute to wg-easy, your time is valuable, and your contributions mean a lot to us.\n\n\n## Important!\n\nBy contributing to this project, you:\n\n* Agree that you have authored 100% of the content\n* Agree that you have the necessary rights to the content\n* Agree that you have received the necessary permissions from your employer to make the contributions (if applicable)\n* Agree that the content you contribute may be provided under the Project license(s)\n* Agree that, if you did not author 100% of the content, the appropriate licenses and copyrights have been added along with any other necessary attribution.\n\n\n## Getting started\n\n**What does \"contributing\" mean?**\n\nCreating an issue is the simplest form of contributing to a project. But there are many ways to contribute, including the following:\n\n- Updating or correcting documentation\n- Feature requests\n- Bug reports\n\n\n## Showing support for wg-easy\n\nPlease keep in mind that open source software is built by people like you, who spend their free time creating things the rest the community can use.\n\nDon't have time to contribute? No worries, here are some other ways to show your support for wg-easy:\n\n- star the [project](https://github.com/wg-easy/wg-easy)\n- tweet your support for wg-easy\n\n\n## Issues\n\nPlease only create issues for bug reports or feature requests. Issues discussing any other topics may be closed by the project's maintainers without further explanation.\n\nDo not create issues about bumping dependencies unless a bug has been identified and you can demonstrate that it effects this library.\n\n**Help us to help you**\n\nRemember that we’re here to help, but not to make guesses about what you need help with:\n\n- Whatever bug or issue you're experiencing, assume that it will not be as obvious to the maintainers as it is to you.\n- Spell it out completely. Keep in mind that maintainers need to think about _all potential use cases_ of a library. It's important that you explain how you're using a library so that maintainers can make that connection and solve the issue.\n\n_It can't be understated how frustrating and draining it can be to maintainers to have to ask clarifying questions on the most basic things, before it's even possible to start debugging. Please try to make the best use of everyone's time involved, including yourself, by providing this information up front._\n\n### Before creating an issue\n\nPlease try to determine if the issue is caused by an underlying library, and if so, create the issue there. Sometimes this is difficult to know. We only ask that you attempt to give a reasonable attempt to find out. Oftentimes the readme will have advice about where to go to create issues.\n\nTry to follow these guidelines:\n\n- **Avoid creating issues for implementation help** - It's much better for discoverability, SEO, and semantics - to keep the issue tracker focused on bugs and feature requests - to ask implementation-related questions on [stackoverflow.com][so]\n- **Investigate the issue** - Search for exising issues (open or closed) that address the issue, and might have even resolved it already.\n- **Check the readme** - oftentimes you will find notes about creating issues, and where to go depending on the type of issue.\n- Create the issue in the appropriate repository.\n\n### Creating an issue\n\nPlease be as descriptive as possible when creating an issue. Give us the information we need to successfully answer your question or address your issue by answering the following in your issue:\n\n- **description**: (required) What is the bug you're experiencing? How are you using this library/app?\n- **OS**: (required) what operating system are you on?\n- **version**: (required) please note the version of wg-easy are you using\n- **error messages**: (required) please paste any error messages into the issue, or a [gist](https://gist.github.com/)\n- **extensions, plugins, helpers, etc** (if applicable): please list any extensions you're using\n\n\n### Closing issues\n\nThe original poster or the maintainers of wg-easy may close an issue at any time. Typically, but not exclusively, issues are closed when:\n\n- The issue is resolved\n- The project's maintainers have determined the issue is out of scope\n- An issue is clearly a duplicate of another issue, in which case the duplicate issue will be linked.\n- A discussion has clearly run its course\n\n\n## Next steps\n\n**Tips for creating idiomatic issues**\n\nSpending just a little extra time to review best practices and brush up on your contributing skills will, at minimum, make your issue easier to read, easier to resolve, and more likely to be found by others who have the same or similar issue in the future. At best, it will open up doors and potential career opportunities by helping you be at your best.\n\nThe following resources were hand-picked to help you be the most effective contributor you can be:\n\n- The [Guide to Idiomatic Contributing](https://github.com/jonschlinkert/idiomatic-contributing) is a great place for newcomers to start, but there is also information for experienced contributors there.\n- Take some time to learn basic markdown. We can't stress this enough. Don't start pasting code into GitHub issues before you've taken a moment to review this [markdown cheatsheet](https://gist.github.com/jonschlinkert/5854601)\n- The GitHub guide to [basic markdown](https://help.github.com/articles/markdown-basics/) is another great markdown resource.\n- Learn about [GitHub Flavored Markdown](https://help.github.com/articles/github-flavored-markdown/). And if you want to really go above and beyond, read [mastering markdown](https://guides.github.com/features/mastering-markdown/).\n\nAt the very least, please try to:\n\n- Use backticks to wrap code. This ensures that it retains its formatting and isn't modified when it's rendered by GitHub, and makes the code more readable to others\n- When applicable, use syntax highlighting by adding the correct language name after the first \"code fence\"\n"
        },
        {
          "name": "docker-compose.dev.yml",
          "type": "blob",
          "size": 0.3349609375,
          "content": "services:\n  wg-easy:\n    build:\n      dockerfile: ./Dockerfile\n    command: npm run serve\n    volumes:\n      - ./src/:/app/\n      # - ./data/:/etc/wireguard\n    ports:\n      - \"51820:51820/udp\"\n      - \"51821:51821/tcp\"\n    cap_add:\n      - NET_ADMIN\n      - SYS_MODULE\n    environment:\n      # - PASSWORD_HASH=p\n      - WG_HOST=192.168.1.233\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 1.91015625,
          "content": "volumes:\n  etc_wireguard:\n\nservices:\n  wg-easy:\n    environment:\n      # Change Language:\n      # (Supports: en, ua, ru, tr, no, pl, fr, de, ca, es, ko, vi, nl, is, pt, chs, cht, it, th, hi, ja, si)\n      - LANG=en\n      # ⚠️ Required:\n      # Change this to your host's public address\n      - WG_HOST=raspberrypi.local\n\n      # Optional:\n      # - PASSWORD_HASH=$$2y$$10$$hBCoykrB95WSzuV4fafBzOHWKu9sbyVa34GJr8VV5R/pIelfEMYyG # (needs double $$, hash of 'foobar123'; see \"How_to_generate_an_bcrypt_hash.md\" for generate the hash)\n      # - PORT=51821\n      # - WG_PORT=51820\n      # - WG_CONFIG_PORT=92820\n      # - WG_DEFAULT_ADDRESS=10.8.0.x\n      # - WG_DEFAULT_DNS=1.1.1.1\n      # - WG_MTU=1420\n      # - WG_ALLOWED_IPS=192.168.15.0/24, 10.0.1.0/24\n      # - WG_PERSISTENT_KEEPALIVE=25\n      # - WG_PRE_UP=echo \"Pre Up\" > /etc/wireguard/pre-up.txt\n      # - WG_POST_UP=echo \"Post Up\" > /etc/wireguard/post-up.txt\n      # - WG_PRE_DOWN=echo \"Pre Down\" > /etc/wireguard/pre-down.txt\n      # - WG_POST_DOWN=echo \"Post Down\" > /etc/wireguard/post-down.txt\n      # - UI_TRAFFIC_STATS=true\n      # - UI_CHART_TYPE=0 # (0 Charts disabled, 1 # Line chart, 2 # Area chart, 3 # Bar chart)\n      # - WG_ENABLE_ONE_TIME_LINKS=true\n      # - UI_ENABLE_SORT_CLIENTS=true\n      # - WG_ENABLE_EXPIRES_TIME=true\n      # - ENABLE_PROMETHEUS_METRICS=false\n      # - PROMETHEUS_METRICS_PASSWORD=$$2a$$12$$vkvKpeEAHD78gasyawIod.1leBMKg8sBwKW.pQyNsq78bXV3INf2G # (needs double $$, hash of 'prometheus_password'; see \"How_to_generate_an_bcrypt_hash.md\" for generate the hash)\n\n    image: ghcr.io/wg-easy/wg-easy\n    container_name: wg-easy\n    volumes:\n      - etc_wireguard:/etc/wireguard\n    ports:\n      - \"51820:51820/udp\"\n      - \"51821:51821/tcp\"\n    restart: unless-stopped\n    cap_add:\n      - NET_ADMIN\n      - SYS_MODULE\n      # - NET_RAW # ⚠️ Uncomment if using Podman\n    sysctls:\n      - net.ipv4.ip_forward=1\n      - net.ipv4.conf.all.src_valid_mark=1\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "package-lock.json",
          "type": "blob",
          "size": 0.1484375,
          "content": "{\n  \"name\": \"wg-easy\",\n  \"version\": \"1.0.1\",\n  \"lockfileVersion\": 3,\n  \"requires\": true,\n  \"packages\": {\n    \"\": {\n      \"version\": \"1.0.1\"\n    }\n  }\n}\n"
        },
        {
          "name": "package.json",
          "type": "blob",
          "size": 0.7783203125,
          "content": "{\n  \"version\": \"1.0.1\",\n  \"scripts\": {\n    \"sudobuild\": \"DOCKER_BUILDKIT=1 sudo docker build --tag wg-easy .\",\n    \"build\": \"DOCKER_BUILDKIT=1 docker build --tag wg-easy .\",\n    \"serve\": \"docker compose -f docker-compose.yml -f docker-compose.dev.yml up\",\n    \"sudostart\": \"sudo docker run --env WG_HOST=0.0.0.0 --name wg-easy --cap-add=NET_ADMIN --cap-add=SYS_MODULE --sysctl=\\\"net.ipv4.conf.all.src_valid_mark=1\\\" --mount type=bind,source=\\\"$(pwd)\\\"/config,target=/etc/wireguard -p 51820:51820/udp -p 51821:51821/tcp wg-easy\",\n    \"start\": \"docker run --env WG_HOST=0.0.0.0 --name wg-easy --cap-add=NET_ADMIN --cap-add=SYS_MODULE --sysctl=\\\"net.ipv4.conf.all.src_valid_mark=1\\\" --mount type=bind,source=\\\"$(pwd)\\\"/config,target=/etc/wireguard -p 51820:51820/udp -p 51821:51821/tcp wg-easy\"\n  }\n}"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "wg-easy.service",
          "type": "blob",
          "size": 1.1240234375,
          "content": "[Unit]\nDescription=Wireguard VPN + Web-based Admin UI\nAfter=network-online.target nss-lookup.target\n\n[Service]\nEnvironment=\"WG_HOST=raspberrypi.local\" # Change this to your host's public address or static public ip.\nEnvironment=\"PASSWORD=REPLACEME\" # When set, requires a password when logging in to the Web UI, to disable add a hashtag\n#Environment=\"WG_DEFAULT_ADDRESS=10.0.8.x\" #Clients IP address range.\n#Environment=\"WG_DEFAULT_DNS=10.0.8.1, 1.1.1.1\" #DNS server clients will use. If set to blank value, clients will not use any DNS.\n#Environment=\"WG_ALLOWED_IPS=0.0.0.0/0,::/0\" #Allowed IPs clients will use.\n#Environment=\"WG_DEVICE=ens1\" #Ethernet device the wireguard traffic should be forwarded through.\n#Environment=\"PORT=80\" #TCP port for Web UI. Default : 51821\n#Environment=\"WG_MTU=1420\" #The MTU the clients will use. Server uses default WG MTU\n#Environment=\"WG_PERSISTENT_KEEPALIVE=25\" #Value in seconds to keep the \"connection\" open. If this value is 0, then connections won't be kept alive.\nType=simple\nRemainAfterExit=no\nExecStart=/usr/bin/env node /app/server.js\nRestart=on-failure\nRestartSec=1\n\n[Install]\nWantedBy=multi-user.target\n"
        }
      ]
    }
  ]
}