{
  "metadata": {
    "timestamp": 1736559729214,
    "page": 427,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "hudson-and-thames/mlfinlab",
      "stars": 4023,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".bumpversion.cfg",
          "type": "blob",
          "size": 0.154296875,
          "content": "[bumpversion]\ncurrent_version = 1.2.0\ncommit = True\ntag = True\ntag_name = {new_version}\n\n[bumpversion:file:setup.cfg]\n\n[bumpversion:file:docs/source/conf.py]\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.134765625,
          "content": ".idea/*\n*.pyc\n__pycache__\ntest_reports\n.coverage\n.DS_Store\ndocs/build/\n.local/\ncover/\n*.pickle\n*/.ipynb_checkpoints/*\nmlfinlab.egg-info/*\n"
        },
        {
          "name": ".readthedocs.yml",
          "type": "blob",
          "size": 0.4912109375,
          "content": "# .readthedocs.yml\n# Read the Docs configuration file\n# See https://docs.readthedocs.io/en/stable/config-file/v2.html for details\n\n# Required\nversion: 2\n\n# Build documentation in the docs/ directory with Sphinx\nsphinx:\n   configuration: docs/source/conf.py\n\n# Optionally build your docs in additional formats such as PDF\nformats: []\n\n# Optionally set the version of Python and requirements required to build your docs\npython:\n   version: 3.8\n   install:\n   - requirements: docs/source/requirements.txt\n\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.27734375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at hudsonthames19@gmail.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 1.5263671875,
          "content": "# Contributing to MlFinLab:\n\nFirst off we wanted to thank you for taking the time to contribute to the project. \n\nWe make use of a [Apprenticeship Program](https://hudsonthames.org/mentorship/), which caters to ambitious students looking \nto make an impact on open-source and develop a portfolio of work based on financial machine learning.\n\nThis allows us to establish organised collaboration and control the level of code quality. \n\n## External Contributions: \n\nWe do encourage external contributions which are sourced by members of our community, [Slack Channel](https://www.patreon.com/HudsonThames), \n\nWe have quite a rigorous process of unit testing, code style checks, and documentation.  \n\n\n## Raise an Issue\nWe have created [templates](https://github.com/hudson-and-thames/mlfinlab/issues/new/choose) to help aid in creating issues and PRs:\n* Bug report\n* Feature request\n* Custom issue template\n* Pull Request Template\n\n---\n\n## Contact us\nWe host a booming community of like minded data scientists and quants, join the \n[Slack Channel](https://www.patreon.com/HudsonThames) now! Open to sponsors of our package. \n\nThe channel has the following benefits: \n\n* Community of like minded individuals.\n* Ask questions about the package implementations and get community feedback.\n* Occasional presentations on topics within financial machine learning.\n* A papers channel where we share the papers which are freely available.\n* Access to members of our research group.\n \nYou can also email us at research@hudsonthames.org\n \nLooking forward to hearing from you!"
        },
        {
          "name": "LICENSE.txt",
          "type": "blob",
          "size": 22.580078125,
          "content": "Copyright 2019, Hudson and Thames Quantitative Research\n\nCopyright Protection Notice and Licensing Agreement\n\nLAST UPDATED November 2021\n\nIMPORTANT NOTICE! THE USER OF THIS CODEBASE IS SUBJECT TO ALL THE TERMS AND CONDITIONS IN THIS AGREEMENT. THEREFORE,\nPLEASE SCROLL THROUGH AND READ ALL OF THE TERMS AND CONDITIONS IN THIS AGREEMENT CAREFULLY BEFORE MAKING USE THEREOF.\nTHIS DOCUMENT IS A LEGALLY BINDING AGREEMENT BETWEEN YOU AND HUDSON AND THAMES FOR YOUR CONTINUED USE OF THE CODEBASE.\n\nYOU WILL INDICATE YOUR ACCEPTANCE OF THIS AGREEMENT, INCLUDING ANY TERMS AND CONDITIONS, BY DOING ONE OR MORE OF THE\nFOLLOWING. OR ALLOWING OR AUTHORISING A THIRD PARTY TO DO ONE OR MORE OF THE FOLLOWING FOR YOU:\n\n* CLICKING “I AGREE” OR A SIMILAR AFFIRMATION AS APPLICABLE WHICH APPEARS DURING THE ACTIVATION OR INSTALLATION OF THE CODEBASE, OR\n* ACCESSING, INSTALLING OR USING THE CODEBASE, OR\n* SIGNING UP TO ANY SUBSCRIPTION BASED LICENSE CONCERNING THE CODEBASE.\n\nIF YOU DISAGREE TO BE LEGALLY BOUND BY THE TERMS OF THIS AGREEMENT, THEN YOU SHOULD IMMEDIATELY CEASE MAKING USE OF THE\nCODEBASE IN ANY WAY AFTER THAT.\n\nAS THIS IS A PERPETUAL LICENSE AGREEMENT, HUDSON AND THAMES MAY UPDATE THE LICENSE AGREEMENT TERMS AT ANY TIME. THE MOST\nRECENT VERSION OF THIS AGREEMENT CAN BE ACCESSED ON THE HUDSON AND THAMES WEBSITE.\n\nHUDSON AND THAMES WILL MAKE REASONABLE EFFORTS TO COMMUNICATE ANY CHANGES TO THIS AGREEMENT BY SENDING AN EMAIL TO YOUR\nUSER ADDRESS OR BY NOTICE ON ITS WEBSITE. THE ONUS HOWEVER REMAINS ON THE USER TO ENSURE THAT THEY REGULARLY CHECK, READ,\nUNDERSTAND AND AGREE TO THE MOST RECENT VERSION OF THE LICENSE AGREEMENT AS THEY WILL BE DEEMED TO ACCEPT ANY SUBSEQUENT\nAMENDMENTS TO IT IF THEY CONTINUE TO ACCESS AND USE THE CODEBASE.\n\nPLEASE NOTE THAT A BUSINESS OR ENTERPRISE LICENSE AGREEMENT OVERRIDES THIS AGREEMENT BUT THIS LICENSE IS THE DEFAULT FOR\nNON BUSINESS LICENSE AND ENTERPRISE LICENSE HOLDERS. THESE LICENSES CAN BE PURCHASED FROM HUDSON AND THAMES QUANTITATIVE\nRESEARCH.\n\n\nDEFINITIONS\n\nIn this agreement, unless otherwise specified, the words hereunder shall have the following meaning:\n\n1.1\t\"Addendum\" means any other Agreement signed by both parties and made part of this Agreement.\n\n1.2\t\"Add-on\" means any development that adds new and independent functionality but does not modify existing License\nMaterial functionality developed by the Company.\n\n1.3\t\"Affiliate\" means, depending on the context, any legal entity connected with or controlled by the Company or the\nLicensee as the case may be.\n\n1.4\t\"Agreement\" means ArbitrageLab Business License Agreement as well as any Addendums hereto.\n\n1.5\t\"Breach\" means a breach of this Agreement, which within context could refer to a breach by the Licensee or the\nCompany.\n\n1.6\t\"Business Day\" means Monday to Friday excluding Saturday, Sunday, or any other official public holiday of the\nCountry.\n\n1.7\t\"Business Environment\" means all internal and external factors of the Licensee's or Company's businesses, such\nas the business's premises, operations, employees, management, and owners.\n\n1.8\t\"Company\" means Hudson and Thames Quantitative Research.\n\n1.9\t\"Country\" means the Country of jurisdiction and whose laws apply to the Agreement as per clause 1.3.8.\n\n1.10\t\"Documentation\" means any official Company documentation detailing the appropriate use or operation of the\nLicensed Materials.\n\n1.11\t\"Effective Date\" means the commencement date of this Agreement as specified in clause 1.3.3.\n\n1.12\t\"Expiry Date\" means the date the license expires as per clause 1.3.4; alternatively, the date either party\ncancels the Agreement in\n\nterms of their rights in this Agreement, alternatively, any legislation.\n\n1.13\t\"License Fees\" means the license fees payable by the Licensee to the Company as referred to in clause 1.3.7.\n\n1.14\t\"Licensed Materials\" means the ArbitrageLab Python library (including source code) comprising a collection of\nproduction-ready algorithms.\n\n1.15\t\"Licensee(s)\" means the party specified in clause 1.2 hereof.\n\n1.16\t\"Modification\" means a change to the delivered source code or data; or any development, other than a change\nto the provided source code that customises, enhances, or changes existing functionality of the Licensed Materials\nincluding, but not limited to, the creation of any new libraries or the extension of the Company's data structures;\nor any other change to the Licensed Materials (other than an Add-on) utilising or incorporating any of the Company's\nLicensed Materials.\n\n1.17\t\"Month\" means a full calendar month beginning on the 1st day and ending on the last day of the particular month.\n\n1.18\t\"Notice Address\" means the chosen address where all notices, including Legal notices, are served in the event\nof service of such notices are necessary.\n\n1.19\t\"Parties\" means the Company and the Licensee to this Agreement.\n\n1.20\t\"User\" means the End User of the Licensed Materials referred in the Agreement as the \"End-User\".\n\n1.21\t\"VAT\" means the Value Added Tax rates for goods and services applicable.\n\n1.22\t\"Webhooks\" means an HTTP callback triggered within the Licensed Material when a specific event has occurred.\n\n\nINTERPRETATION\n\n3.1\tAny reference to the singular shall be deemed to include a reference to the plural, and the other way around.\n\n3.2\tAny reference to a natural person shall include a reference to a legal person/juristic entity (Company,\ncorporation, or trust) and the other way around where relevant.\n\n3.3\tA reference to a clause in this Agreement shall refer to the specific numbered clause referred to and contained\nwithin this Agreement, or any Addendum forming part of this Agreement.\n\n3.4\tParagraph headings are for reference purposes only.\n\n3.5\tAny reference to \"writing\" or \"written\" in this Agreement shall be viewed to include a reference to any letter,\nemail, or other electronically delivered messages (such as SMS or other electronic messaging services) where receipt\nhas been acknowledged by the recipient, alternatively proof of receipt offered by the sender.\n\n\nINTRODUCTION\n\n4.1\tWhereas the Company is in the business of implementing algorithms in quantitative finance and developing various\nlibraries used by its client base worldwide. These algorithms are created using several graduate-level textbooks and\ndozens of papers from several of the world's leading academic journals.\n\n4.2\tWhereas the Company has compiled, collected, and assembled the collection of algorithms into Python libraries which\nis accessible via a Python package install command. These library collections are referred to as ArbitrageLab.\n\n4.2\tWhereas the Licensee is desirous of using the Company's ArbitrageLab algorithms within its internal Business\nEnvironment.\n\n4.3\tWhereas the Company is desirous of granting the Licensee a non-exclusive license to have access to the Company's\nArbitrageLab libraries.\n\n4.4\tWhereas the Licensee agrees as from the effective date of this Agreement, to enjoy the non-exclusive right to use\nthe Licensed Material on the terms and conditions set out in this Agreement.\n\n\nGRANT OF LICENSE\n\n5.1\tSubject to the terms and conditions hereof, the Company hereby grants to the Licensee a non-exclusive license\nto use, access, inspect, install and implement the Licensed Materials in the Licensees internal Business Environment,\nunless terminated or withdrawn under the terms of this Agreement.\n\n\nTERMS OF USE OF LICENSE\n\n6.1\tThe Licensee may use the Licensed Material in furtherance of its permitted use under this Agreement and shall be\nallowed to use the Licensed Material under the provisions of this clause 6 hereof unless otherwise set out in this\nAgreement.\n\n6.2\tThe Licensed Material may only be used and adapted by the Licensee Users within their internal Business Environment,\nincluding the licensees' projects and applications. The Licensee shall not use the Licensed Materials to provide\ninformation or services to third parties other than affiliated or authorised persons within its Business Environment\n(i.e., traders).\n\n6.3\tThe Licensee acknowledges the Company's proprietary rights in the Licensed Material, and that the copying, or even\nobservation by un-related parties of the Licensed Material for any reason other than the intended use thereof within\nits Business Environment, or without the explicit written consent by the Company, is prohibited.\n\n6.4\tThe Licensee is not permitted to create API endpoints or create data or forecast services using the Licensed\nMaterial without the Company's explicit written authorization, other than solely for Licensee’s internal business\nactivities (which expressly excludes dissemination or provision of access to the Licensed Material to any third party).\n\n6.6\tThe Licensee shall not lease, loan, resell, sublicense or otherwise distribute the Licensed Materials to any other\nparty or distribute or publish the source code or perform any acts concerning the Licensed Materials other than as\nexpressly permitted under the terms of this Agreement.\n\n6.7\tThe Licensee and its Users undertake not to reverse engineer the Licensed Materials and agrees not to set up in\nbusiness as a direct competitor of the Company using the Company's Proprietary Information. The Licensee will be\nresponsible for damages suffered by the Company for any violation of this paragraph if it is proved or admitted.\n\n6.8\tThe Licensee agrees to install the Licensed Materials only on the maximum number of designated Users as specified\nin clause 1.3.6 hereof and on devices which may be located in the business premises of a User or be in the Users'\ndirect possession. The Licensee shall not install the Licensed Materials on any other third-party workstations\noperating outside of the Licensees Business Environment.\n\n6.9\tThe Licensed Material may be installed by way of a package installer for Python on the Licensees preferred\ninterface or any other system within the Licensees Business Environment.\n\n\nCOMPANY WARRANTY\n\n7.1\tThe Company warrants that the Licensed Material will be available and substantially conform to the standards\nrequired for an Integrated Development Environment Python Deployment Package for the license term's duration.\n\n7.2\tThe Company warrants that the source code will be protected by sound source control principles and changelog\nindexes for all tools, allowing for protection against any breaking changes in the source code and reverting to the\nsoftware's previous version, should the need arise.\n\n7.3\tThe warranty does not apply:\n\n    7.3.1\tif the Licensed Material is not used under the Documentation or Tutorials provided by the Company;\n\n    7.3.2\tif the nonconformance of the Licensed Material is caused by any Modification or Add-on (other than any\n    Modifications, updates, or Add-ons made by the Company provided through the Company's package update or support\n    system), the Licensee, another third party, third- party software, third party database or any other software or\n    system not affiliated to the Company;\n\n7.4\tThe Company does not warrant that the Licensed Materials will be free from minor defects or errors that do not\nmaterially affect its performance, or that the libraries and documentation contained in the Licensed Materials are\ndesigned to meet all of Licensee's business requirements.\n\n7.5\tThe Licensee undertakes to notify the Company in writing with a specific description of the Licensed Materials\nerrors during the terms of the license. If the Company confirms the existence of such errors, the Company will, to its\nbest endeavours, repair or replace the Licensed Materials within 14 (fourteen) days from date of such confirmation.\n\n7.6\tThe Licensee's written notification of any software bugs must include sufficient detail for the Company to analyse\nthe alleged nonconformance. Licensee must also provide all reasonable assistance to the Company to diagnose and remedy\nany Licensed Materials' nonconformance.\n\n\nLIMITATION OF LIABILITY\n\n8.1\tThe Company shall not be responsible under this Agreement\n\n    8.1.1\tif the Licensed Material is not used as per the documentation and tutorials provided;\n\n    8.1.2\tif the nonconformance of the Licensed Material is caused by any Modification or Add-on (other than any\n    Modifications, updates or Add-ons made by the Company provided through the Company's package update or support\n    system), the Licensee, another third party, third- party software, third party database or any other software or\n    system not affiliated to the Company;\n\n8.2\tSubject to the provisions of clause 8.3 and 8.4 below and regardless of the basis of liability (whether arising out\nof liability under breach of contract, damages (including gross negligence), misrepresentations, breach of warranty,\nor claims by any unrelated parties arising from any breach of this Agreement) neither the Company nor Licensee shall\nbe liable to each other or any other party for any loss or damages arising concerning this Agreement to the extent\nthat such loss or damage is:\n\n    8.2.1\tloss of profits or revenue, loss of business, loss of or damage to data, loss of goodwill, losses from\n    computer failure or malfunction, legal fees, loss of anticipated profits or savings, and regardless of whether any\n    such loss or damage listed in this sub-section is direct, indirect, special, incidental or consequential;\n\n    8.2.2\tis indirect, special, incidental, or consequential and whether or not the other party is advised of the\n    possibility of such loss or damage;\n\n8.3\tSubject to the provisions of clause 8.2 above and regardless of the basis of liability (whether arising out of\nliability under breach of contract, damages (including gross negligence), misrepresentations, breach of warranty,\nor claims by any unrelated parties arising from any breach of this Agreement) the aggregate liability of each party\nto the other or any other party for any loss or damage arising under or concerning this Agreement shall not exceed the\nlicense fees paid to the Company in respect of this Agreement.\n\n8.4\tNothing in this Agreement shall exclude or limit either party's liability which cannot be excluded or limited by\nany applicable law in the Country of Jurisdiction.\n\n8.5\tAny limitations to the Company's liability and obligations according to this clause 8 will also apply for the\nbenefit of any member or affiliate of the Company and their respective licensors.\n\n\nBREACH OF CONTRACT BY THE LICENSEE\n\n9.1\tIf the Licensee:\n\n    9.1.1\tfails to pay any fees due in terms of this Agreement on the due date thereof; or\n\n    9.1.2\tbreaches this Agreement in any other way;\n\nand fails to remedy such breach within 5 (Five) days after service of a written notice to the Licensee calling for such\nremedy, alternatively\n\n    9.1.3\tis placed under provisional or final sequestration during the term of this Agreement;\n\n    9.1.4\tcommits any unlawful act, or is found guilty of a crime in any country anywhere in the world,\n\n\nthe Company shall have the right, without prejudice to any alternative or additional right of action or remedy\navailable to the Company under the circumstances (including the right to claim specific performance), to\n\n    9.1.5\tcancel this Agreement and forthwith.\n\n9.2\tAny termination or declaration of termination of this Agreement shall not have the effect of cancelling any of the\nCompany's rights that accrued before the termination or any other obligation of the Licensee which arises on termination\nof this Agreement.\n\n\nBREACH OF CONTRACT BY THE COMPANY\n\n10.1\tIf the Company commits any breach of contract and fails to remedy the breach within 5 (Five) days after\nreceiving notice by the Licensee at the chosen notice address, the Licensee shall have the right to:\n\n    10.1.1\tterminate this Agreement without any liability for early termination;\n\n10.2\tNotwithstanding the provisions stipulated in clause 10.1, the Licensee shall remain liable for any fees which\nmay be due as at the date of terminating this Agreement in terms thereof.\n\n\nNOTICES BETWEEN PARTIES\n\n11.1\tAny notice required to be sent to either party shall be delivered to either party in writing to their respective\nphysical addresses (as set out in 1.1 and 1.2 hereof) alternatively transmitted by electronic email to the specified\nemail address stipulated in this Agreement.\n\n11.2\tAny notice, order, acceptance, demand, or other communication addressed by either party to this Agreement to\nthe other party at its notice address or email address in terms hereof for the time being shall be deemed received by\nthe addressee:\n\n    11.2.1\ton the date of receipt of service of the notice if the notice is served by hand;\n\n    11.2.2\ton the 5th Business Day after dispatching the notice by prepaid registered post;\n\n    11.2.3\ton the date of transmission of the notice if electronically transmitted by email;\n\n11.3\tThis provision shall not be construed as precluding the other party using any other delivery methods of notices,\norders, acceptances, demands, and other communications that the parties can prove.\n\n11.4\tAll legal processes shall be regarded as validly served if served at a party's notice address, whether the party\nis present at the notice address at the time of service or not.\n\n\nJURISDICTION OF COURTS AND GOVERNING LAWS\n\n12.1\tThis Agreement is governed by the laws of the Country specified in clause 1.3.8.\n\n\nCONSENT AND THE PROTECTION OF PERSONAL INFORMATION\n\n13.1\tConsent, Acknowledgment, and acceptance is given to the Company by the Licensee for the following conditions of\npersonal information usage.\n\n13.2\tThe Company will only with the explicit consent of the Licensee or that of the individual Users (either\nsubmitted electronically, verbally, or in writing) share the personal information of the Licensee or individual\nUsers with any employees and personnel, selected partners, subsidiaries, and contracted third parties. The consent\nprovided may be used to:\n\n    13.2.1\tshare personal contact information electronically with the parties aforementioned;\n\n    13.2.2\tstore personal information in secure storage (either on-site or online) for record-keeping purposes;\n\n    13.2.3\tuse personal information for the purposes recording same into the Company's software systems for the purposes\n    required to run and manage any aspect of its business activities, including but not limited to user registrations and\n    User identifiers;\n\n    13.2.4\tuse personal information for marketing purposes;\n\n    13.2.5\tretain personal information for the required periods as required by the applicable laws at the time;\n\n\n13.3\tThe Licensee and User information may be electronically transferred and shared with the parties above who will\naccess, view, and store this personal information.\n\n13.4\tAlthough the Company undertakes to take all reasonable steps to protect this personal information and maintain\nthe Licensee and User information confidentiality, the Company cannot guarantee the security or integrity of any information transmitted (either electronically, verbally, or in writing) and that any information so submitted shall be at the Licensee and Users own risk.\n\n13.5\tThe Licensee acknowledges that once the Company shares any personal information to any parties above (as per\nclause 13.2 hereof), the Company shall not have any control over this personal information once shared and will not be\nresponsible for the security of any personal information after that.\n\n13.6\tThe Company confirms compliance with the relevant and necessary data protection laws applicable to the Country\nfrom time to time commit to applying all safety and security measures whilst this information is under the Company's\ncontrol.\n\n\nPROPRIETARY INFORMATION\n\n14.1\tThis Agreement creates a relationship of confidence and trust between the Licensee, the Users, and the Company\nrelating to information which may be made known, presented or accessed by the Licensee and its Users during the term of\nthis Agreement.\n\n14.2\tThe Company possesses information that has been created, researched, or developed by the Company (including\ninformation created, researched or developed or made known to the Licensee during the term of this Agreement or in which\nintellectual property rights may have been assigned to the Company from other sources), which information has commercial\nvalue to the business in which the Company is engaged and is treated by the Company as confidential. All such\ninformation referred to as \"Proprietary Information\". This term shall also include systems, algorithms, data, source\ncode, computer programs, improvements, discoveries, developments, techniques, new products, and licenses; The term\n\"Proprietary Information\" does not include any of the information herein that is already part of the public domain.\n\n14.3\tAll Proprietary Information herein shall be the Company's property and its assigns, who shall remain the sole\nowner of all rights, including any patents, copyrights, trademarks, and other rights obtained in connection therewith.\n\nUnauthorised use\n\n14.4\tHaving regard to the terms of use of the Licensed Material as per clause 6 hereof as well as clause 14.1,\n14.2, and 14.3 hereof, and subject to the provisions of clause 9 and 10 hereof, the Licensee acknowledges that it may\nmake any modifications or alterations to the Source Code at their discretion; however, such right does not include the\nright to distribute or create other commercially available products containing substantial portions of the original\nLicensed Materials of the Company.\n\n14.5\tThe Licensee agrees not to lease, loan, resell, sublicense or otherwise distribute any software or product\nbased on improvements or alterations made to the Licensed Materials to any other party or distribute or publish the\nsource code or perform any acts concerning improvements containing substantial portions of the original Licensed\nMaterials of the Company.\n\nWebhooks\n\n14.6\tThe Licensee acknowledges that the Company has created webhooks to verify Licensee and user authentications,\nuser, installations, daily usage information, and track function calls and source code modifications.\n\n14.7\tWebhooks trigger upon installation of the Licensed Material and during specific function calls. During these\nevents, no proprietary data from the Licensee passes through any of the Company Servers.\n\n14.8\tThe Webhooks are contained in the Licensed Material source code and can be inspected to analyse where the\nCompany uses analytics, tracks function calls.\n\n\nNON-WAIVER\n\n15.1\tNo relaxation or indulgence which the Company may show to the Licensee shall in any way prejudice their rights\nhereunder.\n\n\nSEVERABILITY\n\nIf any provision of this Agreement is unenforceable for whatever reason, the Company shall be entitled to elect, at any\ntime, that such provision is severed from the remaining provisions of this Agreement, the result of which shall not\naffect the remaining provisions of this Agreement which shall remain of full force and effect.\n\n\nWHOLE AGREEMENT\n\nThis Agreement constitutes the entire Agreement between the parties. No modification, variation, alteration, or\nconsensual cancellation shall be of any force or effect unless reduced to writing and signed by the parties.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.6181640625,
          "content": "<div align=\"center\">\n   <a href=\"https://hudsonthames.org/mlfinlab\">\n   <img src=\"https://hudsonthames.org/wp-content/uploads/2021/11/mlfinlab_github_header_v2.jpg\" width=\"100%\" \n   style=\"margin-left: auto; margin-right: auto; display:block;\">\n   \n   </a>\n  </br>\n</div>\n\n\n# Welcome to Machine Learning Financial Laboratory! \n\n<div align=\"center\">\n    <br>\n</div>\n\n>This repo is public facing and exists for the sole purpose of providing users with an easy way to raise bugs, feature requests, and other issues.\n\n<div align=\"center\">\n    <br>\n</div>\n\n## What is MlFinLab?\nMlFinlab python library is a perfect toolbox that every financial machine learning researcher needs. \n\nIt covers every step of the ML strategy creation, starting from data structures generation and finishing with backtest statistics.\nWe pride ourselves in the robustness of our codebase - every line of code existing in the modules is extensively tested and \ndocumented.\n\n\n## Documentation, Example Notebooks and Lecture Videos\nFor every technique present in the library we not only provide extensive documentation, with both theoretical explanations\nand detailed descriptions of available functions, but also supplement the modules with ever-growing array of lecture videos and slides \non the implemented methods.\n \nWe want you to be able to use the tools right away. To achieve that, every module comes with a number of example notebooks \nwhich include detailed examples of the usage of the algorithms. Our goal is to show you the whole pipeline, starting from \nimporting the libraries and ending with strategy performance metrics so you can get the added value from the get-go.\n\n<div align=\"left\">\n   <a href=\"https://portal.hudsonthames.org/sign-in\">\n   <img src=\"https://hudsonthames.org/wp-content/uploads/2021/11/purchase_mlfinlab_v2.png\" height=\"100px\" \n   style=\"margin-left: auto; margin-right: auto; display:inline-block;\">\n   </a>\n   <a href=\"https://hudsonthames.org/\">\n   <img src=\"https://hudsonthames.org/wp-content/uploads/2021/11/website_link_m.png\" height=\"100px\">\n   </a>\n   <a href=\"https://www.youtube.com/channel/UC8hI87gt0dmTAIEupEcsckA\">\n   <img src=\"https://hudsonthames.org/wp-content/uploads/2021/11/youtube_mlfinlab.png\" height=\"100px\">\n   </a>\n</div>\n\n\n### Included modules:\n\n- Backtest Overfitting Tools\n- Data Structures\n- Labeling\n- Sampling\n- Feature Engineering\n- Models\n- Clustering\n- Cross-Validation\n- Hyper-Parameter Tuning\n- Feature Importance\n- Bet Sizing\n- Synthetic Data Generation\n- Networks\n- Measures of Codependence\n- Useful Financial Features\n\n\n## Licensing options\nThis project is licensed under an all rights reserved [licence](https://github.com/hudson-and-thames/mlfinlab/blob/master/LICENSE.txt).\n\n* Business\n* Enterprise\n\n\n## Community\nWith the purchase of the library, our clients get access to the Hudson & Thames Slack community, where our engineers and other quants \nare always ready to answer your questions.\n\nAlternatively, you can email us at: research@hudsonthames.org.\n\n<div align=\"center\">\n   <a>\n   <img src=\"https://hudsonthames.org/wp-content/uploads/2021/11/header_github_ht.jpg\" width=\"100%\" \n   style=\"margin-left: auto; margin-right: auto; display:block;\">\n   </a>\n</div>\n\n\n## Who is Hudson & Thames?\nHudson and Thames Quantitative Research is a company with the goal of bridging the gap between the advanced research developed in \nquantitative finance and its practical application. We have created three premium python libraries so you can effortlessly access the\nlatest techniques and focus on what matters most: **creating your own winning strategy**.\n\n\n### What was only possible with the help of huge R&D teams is now at your disposal, anywhere, anytime.\n"
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "mlfinlab",
          "type": "tree",
          "content": null
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 0.51171875,
          "content": "# Production\nnumpy>=0.16.0\nmatplotlib>=3.0.0\npandas>=1.0.0\nscikit-learn>=0.20.0\nscipy>=1.2.0\nstatsmodels>=0.9.0\ncython>=0.29\nPOT>=0.7.0\nnumba>=0.40.0\nnetworkx>=2.2, <2.6\ndash>=1.0.0\ndash-cytoscape>=0.1.0\ndash-bootstrap-components>=0.10.0\njupyter-dash>=0.2.0\ntensorflow>=2.0.0\njoblib>=1.0.0\ndecorator>=4.0.0, <5.0.0\nanalytics-python>=1.2.7\ngetmac>=0.8.0\n\n\n# Develop\ncodecov==2.1.11\ncoverage==5.4\npylint==2.6.0\nsphinx==3.4.3 # Docs\nhudsonthames-sphinx-theme==0.1.5 # Docs\nsphinx-rtd-theme==0.5.2 # Docs\nreleases==1.6.3 # Docs\n"
        },
        {
          "name": "setup.cfg",
          "type": "blob",
          "size": 2.2080078125,
          "content": "[metadata]\nname = mlfinlab\nversion = 1.3.0\nauthor = Hudson and Thames Quantitative Research\nauthor_email = research@hudsonthames.org\nlicence = All Rights Reserved\nlicence-file = LICENSE.txt\ndescription = MlFinlab helps portfolio managers and traders who want to leverage the power of machine learning by providing reproducible, interpretable, and easy to use tools.\nlong_description = file: README.md\nlong_description_content_type = text/markdown\nplatform = any\nurl = https://www.hudsonthames.org/\nproject_urls =\n    Documentation = https://mlfinlab.readthedocs.io/en/latest/\n    Bug Reports = https://github.com/hudson-and-thames/mlfinlab/issues\n    Project Boards = https://github.com/orgs/hudson-and-thames/projects\n    Source = https://github.com/hudson-and-thames/mlfinlab\n    Blog = https://hudsonthames.org/blog/\n    Apprenticeship Program = https://hudsonthames.org/apprenticeship-program/\nclassifiers =\n    Development Status :: 5 - Production/Stable\n    Intended Audience :: Developers\n    Intended Audience :: Education\n    Intended Audience :: Science/Research\n    Intended Audience :: Financial and Insurance Industry\n    License :: Other/Proprietary License\n    Operating System :: OS Independent\n    Programming Language :: Python\n    Programming Language :: Python :: 3.6\n    Programming Language :: Python :: 3.7\n    Programming Language :: Python :: 3.8\n    Topic :: Scientific/Engineering\n    Topic :: Scientific/Engineering :: Artificial Intelligence\n    Topic :: Office/Business :: Financial :: Investment\nkeywords =\n    machinelearning\n    finance\n    investment\n    education\n\n[options]\ninclude_package_data = True\npackages = find:\npython_requires =\n    >=3.6, <3.9\nsetup_requires =\n    setuptools\n    cython\ninstall_requires =\n    numpy>=0.16.0\n    matplotlib>=3.0.0\n    pandas>=1.0.0\n    scikit-learn>=0.20.0\n    scipy>=1.2.0\n    statsmodels>=0.9.0\n    cython>=0.29\n    POT>=0.7.0\n    numba>=0.40.0\n    networkx>=2.2, <2.6\n    dash>=1.0.0\n    dash-cytoscape>=0.1.0\n    dash-bootstrap-components>=0.10.0\n    jupyter-dash>=0.2.0\n    tensorflow>=2.0.0\n    joblib>=1.0.0\n    decorator>=4.0.0, <5.0.0\n    analytics-python>=1.2.7\n    getmac>=0.8.0\n\n\n[options.packages.find]\npackage_dir =\n    mlfinlab\nexclude =\n    contrib\n    docs\n    tests\n"
        },
        {
          "name": "setup.py",
          "type": "blob",
          "size": 0.2734375,
          "content": "# Always prefer setuptools over distutils\nfrom setuptools import setup\n\nsetup()\n\n# Create package\n# python setup.py bdist_wheel\n# python3 -m twine upload --repository-url https://test.pypi.org/legacy/ dist/*  (This is the test repo)\n# twine upload dist/*  (This is official repo)\n"
        }
      ]
    }
  ]
}