{
  "metadata": {
    "timestamp": 1736559994919,
    "page": 791,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjgwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "jorisschellekens/borb",
      "stars": 3433,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 4.376953125,
          "content": "\n# Created by https://www.toptal.com/developers/gitignore/api/python,pycharm\n# Edit at https://www.toptal.com/developers/gitignore?templates=python,pycharm\n\n### PyCharm ###\n# Covers JetBrains IDEs: IntelliJ, RubyMine, PhpStorm, AppCode, PyCharm, CLion, Android Studio, WebStorm and Rider\n# Reference: https://intellij-support.jetbrains.com/hc/en-us/articles/206544839\n\n# User-specific stuff\n.idea/**/workspace.xml\n.idea/**/tasks.xml\n.idea/**/usage.statistics.xml\n.idea/**/dictionaries\n.idea/**/shelf\n\n# Generated files\n.idea/**/contentModel.xml\n\n# Sensitive or high-churn files\n.idea/\n.idea/**/dataSources/\n.idea/**/dataSources.ids\n.idea/**/dataSources.local.xml\n.idea/**/sqlDataSources.xml\n.idea/**/dynamic.xml\n.idea/**/uiDesigner.xml\n.idea/**/dbnavigator.xml\n\n# Gradle\n.idea/**/gradle.xml\n.idea/**/libraries\n\n# Gradle and Maven with auto-import\n# When using Gradle or Maven with auto-import, you should exclude module files,\n# since they will be recreated, and may cause churn.  Uncomment if using\n# auto-import.\n# .idea/artifacts\n# .idea/compiler.xml\n# .idea/jarRepositories.xml\n# .idea/modules.xml\n# .idea/*.iml\n# .idea/modules\n# *.iml\n# *.ipr\n\n# CMake\ncmake-build-*/\n\n# Mongo Explorer plugin\n.idea/**/mongoSettings.xml\n\n# File-based project format\n*.iws\n\n# IntelliJ\nout/\n\n# mpeltonen/sbt-idea plugin\n.idea_modules/\n\n# JIRA plugin\natlassian-ide-plugin.xml\n\n# Cursive Clojure plugin\n.idea/replstate.xml\n\n# Crashlytics plugin (for Android Studio and IntelliJ)\ncom_crashlytics_export_strings.xml\ncrashlytics.properties\ncrashlytics-build.properties\nfabric.properties\n\n# Editor-based Rest Client\n.idea/httpRequests\n\n# Android studio 3.1+ serialized cache file\n.idea/caches/build_file_checksums.ser\n\n### PyCharm Patch ###\n# Comment Reason: https://github.com/joeblau/gitignore.io/issues/186#issuecomment-215987721\n\n# *.iml\n# modules.xml\n# .idea/misc.xml\n# *.ipr\n\n# Sonarlint plugin\n# https://plugins.jetbrains.com/plugin/7973-sonarlint\n.idea/**/sonarlint/\n\n# SonarQube Plugin\n# https://plugins.jetbrains.com/plugin/7238-sonarqube-community-plugin\n.idea/**/sonarIssues.xml\n\n# Markdown Navigator plugin\n# https://plugins.jetbrains.com/plugin/7896-markdown-navigator-enhanced\n.idea/**/markdown-navigator.xml\n.idea/**/markdown-navigator-enh.xml\n.idea/**/markdown-navigator/\n\n# Cache file creation bug\n# See https://youtrack.jetbrains.com/issue/JBR-2257\n.idea/$CACHE_FILE$\n\n# CodeStream plugin\n# https://plugins.jetbrains.com/plugin/12206-codestream\n.idea/codestream.xml\n\n### Python ###\n# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# Distribution / packaging\n.Python\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\npip-wheel-metadata/\nshare/python-wheels/\n*.egg-info/\n.installed.cfg\n*.egg\nMANIFEST\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit text / coverage reports\nhtmlcov/\n.tox/\n.nox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*.cover\n*.py,cover\n.hypothesis/\n.pytest_cache/\npytestdebug.log\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\ndb.sqlite3\ndb.sqlite3-journal\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\ndoc/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# IPython\nprofile_default/\nipython_config.py\n\n# pyenv\n.python-version\n\n# pipenv\n#   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.\n#   However, in case of collaboration, if having platform-specific dependencies or dependencies\n#   having no cross-platform support, pipenv may install dependencies that don't work, or not\n#   install all needed dependencies.\n#Pipfile.lock\n\n# PEP 582; used by e.g. github.com/David-OConnor/pyflow\n__pypackages__/\n\n# Celery stuff\ncelerybeat-schedule\ncelerybeat.pid\n\n# SageMath parsed files\n*.sage.py\n\n# Environments\n.env\n.venv\nenv/\nvenv/\nENV/\nenv.bak/\nvenv.bak/\npythonenv*\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n.dmypy.json\ndmypy.json\n\n# Pyre type checker\n.pyre/\n\n# pytype static type analyzer\n.pytype/\n\n# profiling data\n.prof\n\n# secrets\ntests/secrets.py\n\n# End of https://www.toptal.com/developers/gitignore/api/python,pycharm"
        },
        {
          "name": "BORB_CONTRIBUTOR_LICENSE_AGREEMENT.md",
          "type": "blob",
          "size": 10.396484375,
          "content": "# borb Contributor License Agreement\n\nIn order for borb to have a clear understanding with respect to its ownership of and rights in the intellectual property rights associated with the borb software library (hereinafter “borb Project”) and to clearly determine the responsibilities and obligations associated with the Contributions (as defined hereinafter), borb must receive a signed borb Contributor License Agreement from the Contributor (as defined hereinafter) indicating the Contributor’s agreement with the terms and conditions set forth herein. This borb Contributor License Agreement (hereinafter “the Agreement”) intends to protect the Contributor as well as borb.\n\nThe Contributor hereby accepts and agrees to the following terms and conditions with regard to past, current and future Contributions submitted by the Contributor to borb.\n\n## Definitions\n\nWhen used in this Agreement the following words and or expressions shall have the meaning as stated hereunder unless the context expressly requires otherwise:\n\n1.1. **“Contributor”** means any individual and/or legal entity that voluntarily submits one or more Contribution to the borb Project.\n\n1.2. **“Contribution”** means any original work of authorship, including any modification and/or addition to the existing work that is submitted for introduction in, or documentation of, any of the products owned or managed by borb, where such work originates from a Contributor. A Contribution may be submitted in any form of electronic, verbal and/or written communication or documentation, including without limitation, communication on electronic mailing lists, source code control systems and issue tracking systems that are managed by or on behalf of borb for the purpose of discussion and improving the results of the borb Project.\n\n##  Article 2: Granted Rights - Representations\n\n2.1. For the benefit of borb, the Contributor hereby agrees to the following:\n\n- The Contributor irrevocably, automatically, unconditionally and without compensation assigns, transfers and conveys to borb all right, title and interest in and to the Contributions. Such assignment includes copyrights (to the extent permitted by applicable mandatory law) and all other intellectual property rights other than patents and patent applications (“Patent”), together with all causes of actions accrued in favor for infringement thereof, recognized by any jurisdiction (“Proprietary Rights”). This assignment and transfer is applicable worldwide, for existing as well as future works and lasts for the entire term of copyright protection. As for future works and Contributions the transfer will be considered to have been made for all software related to the PDF library code and the applications thereof (genre: e.g. writing books, software and manuals as well as the development of the library). Without limiting the foregoing, borb shall determine in its sole discretion whether or not to use the Contribution and to use, sell, distribute, license, reproduce, re-use, modify, update, edit or otherwise make available the Contribution(s) as it sees fit, in any manner currently known or in the future discovered and for any and all purposes.\n- The Contributor grants (to the extent that under applicable mandatory law, Proprietary Rights cannot be assigned, transferred or conveyed) to borb and to the recipients of the software incorporating the Contribution(s) a perpetual, irrevocable, worldwide, non-exclusive, fully paid-up and royalty-free copyright license to reproduce, modify, prepare derivative works of, (publicly) display, perform, sublicense (through multiple tiers of sublicensees), and distribute the Contribution.\n- The Contributor grants to borb and to recipients of software distributed by borb a perpetual, worldwide, non-exclusive, fully paid-up, royalty-free, irrevocable (except as stated in this Agreement) Patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Contribution, where such license applies only to the Patent claims licensable by the Contributor that are necessarily infringed by the Contributor’s Contribution(s) alone or by combination of such Contribution(s) with other work of borb.\n- The Contributor furthermore agrees to immediately notify borb of any patents that the Contributor knows or comes to know are likely infringed by the Contribution(s) and/or are not licensable by the Contributor. If any entity institutes patent litigation against the Contributor or any other entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Contributor’s Contribution(s) or the borb Project work to which the Contributor has contributed constitutes direct or contributory patent infringement, then any Patent licenses granted under this Agreement for that Contribution or the borb Project work shall immediately terminate as of the date such litigation is filed.\n\n2.2. Upon the assignment of the Proprietary Rights and the grant of the license as set forth in this article 2, borb hereby grants to the Contributor a perpetual, non-exclusive, worldwide, fully-paid up, royalty-free license to make, use, reproduce, distribute, modify and prepare derivative works based on the Contributions of the Contributor.\n\n2.3. The Contributor hereby represents and warrants that:\n\n- The Contributor is legally entitled to assign the Proprietary Rights and to grant the above licenses. If the Contributor’s employer(s) or consultant(s) has rights to intellectual property that the Contributor creates that includes the Contributor’s Contributions, the Contributor represents and warrants that the Contributor has received permission to make Contributions on behalf of its employer or consultant, as the case may be, and that its employer or consultant, as the case may be, has waived such rights for such Contributions to borb.\n- Each Contribution is the original creation of the Contributor. The Contributor represents that each submission of a contribution includes complete details of any third party license or other restrictions of which you are aware and which are associated with any part of the Contribution(s).\n- No claim or dispute has been filed or, to the best of your knowledge, threatened in connection with the ownership, use or distribution of the Contribution(s).\n- The execution of this Agreement does not constitute a breach under any other agreement to which the Contributor and/or its employer is a party, does not require the consent, approval or waiver from or notice to any third party and does not violate any law or regulation. The Contributor shall immediately inform borb of any facts and/or circumstances of which the Contributor becomes aware that would make the representations and warranties inaccurate or untrue in any respect.\n- The Contributor further agrees that the Contributor shall at no time hereafter dispute, contest or aid or assist any third party in disputing and/or contesting, either directly or indirectly, the right, title and interest in or to any and all Contributions of borb as detailed in this Agreement.\n\n2.4. In case under applicable law the Contributor retains the moral rights or other inalienable rights to the Contributions, the Contributor agrees not to exercise such rights without the prior written permission of borb. To the maximum extent permitted by law, the Contributor further waives and agrees not to assert such moral rights (if any) against borb or its successors in interest, or any of its licensees, either direct or indirect.\n\n2.5. In order to ensure that borb will be able to acquire, use and protect its Proprietary Rights as detailed in this article 2, the Contributor will:\n\n- Sign any documents to assist borb in the documentation, perfection and enforcement of its rights.\n- Provide borb with support and reasonable access to information for applying, securing, protecting, perfecting and enforcing its rights.\n\n##  Article 3: Warranties\n\nEXCEPT FOR THE EXPRESS WARRANTIES DETAILED IN ARTICLE 2, THE CONTRIBUTIONS ARE PROVIDED “AS IS” AND NEITHER THE CONTRIBUTOR NOR BORB MAKES ANY WARRANTIES OF ANY KIND TO THE OTHER PARTY, EITHER EXPRESS OR IMPLIED, INCLUDING WITHOUT LIMITATION OF ANY WARRANTY OF MERCHANTAIBILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\n## Article 4: Miscellaneous\n\n4.1. This Agreement shall enter into force upon execution of this document by the Contributor. This Agreement may be terminated by either party if the other party commits a breach of this Agreement, provided that if the breach is capable of remedy termination shall not occur if the breach shall have been remedied within 90 days of such other party having been given notice in writing specifying the breach and requiring it to be remedied. Notwithstanding any termination of this Agreement, this Agreement shall remain in full force and effect with respect to any Contribution submitted prior to the termination date of the Agreement.\n\n4.2. This Agreement contains the entire agreement between the parties and supersedes all prior or contemporaneous agreements or understanding, whether written or oral, relating to its subject matter. If any provision of this Agreement shall be deemed invalid or unenforceable, the validity and enforceability of the remaining provisions of this Agreement shall not be affected and such provision shall be deemed modified only to the extent necessary to make such provision consistent with applicable law.\n\n4.3. The Agreement is governed by the laws of Belgium, without reference to its conflict of law principles.\n\n4.4. borb shall have the right to assign its rights and obligations hereunder, including (without limitation) to any successor or assignee of its business or assets to which this Agreement relates, whether by merger, establishment of a legal entity, acquisition, operation of law or otherwise without the prior written consent of the Contributor. The Contributor may not assign its rights and obligations under this Agreement, including by operation of law, without the prior written consent of borb, and as a condition to any such assignment, the Contributor's assignee must agree in writing to abide by all of the rights and obligations of the Contributor set forth in the Agreement. Please execute two (2) original copies of the above document and send this to the following recipient: \n\n**The recipient:**  \nJoris Schellekens  \nGentbruggestraat 76  \n9040 Sint-Amandsberg  \nBELGIUM  \n\n**The Contributor:**  \nName:  \nTitle (if applicable in case of legal entity):  \nFull name of legal entity and address registered office (if applicable):  \nDate:  \nSignature:\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.2841796875,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, sex characteristics, gender identity and expression,\nlevel of experience, education, socio-economic status, nationality, personal\nappearance, race, religion, or sexual identity and orientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\n advances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at joris.schellekens.1989@gmail.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at https://www.contributor-covenant.org/version/1/4/code-of-conduct.html\n\n[homepage]: https://www.contributor-covenant.org\n\nFor answers to common questions about this code of conduct, see\nhttps://www.contributor-covenant.org/faq"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 8.025390625,
          "content": "# Contributing to borb\n\nWe'd love for you to contribute to our source code and to make **borb** even better than it is\ntoday! Here are the guidelines we'd like you to follow:\n\n - [Question or Problem?](#question)\n - [Issues and Bugs](#issue)\n - [New Features](#feature)\n - [Submission Guidelines](#submit)\n - [Coding Rules](#rules)\n - [Commit Message Guidelines](#commit)\n - [Signing the bCLA](#cla)\n - [Contributor Code of Conduct](#coc)\n\n\n## <a name=\"question\">Got a Question or Problem?</a>\n\nIf you have questions about how to use **borb**, please direct these to [Stack Overflow][stackoverflow].\n\nIf you are a customer with a [support agreement][support], you also have direct access to our JIRA and/or our developers.\n\n\n## <a name=\"issue\">Found an Issue?</a>\nIf you find a bug in the source code or a mistake in the documentation, you can help us by\nsubmitting a [Pull Request][pull] with a fix.\n\n**Please see the [Submission Guidelines](#submit) below**.\n\n\n## <a name=\"feature\">Want to implement a Feature?</a>\nIf you would like to implement a new feature then consider what kind of change it is:\n\n* **Major Changes** that you wish to contribute to the project should be discussed first so that we can better\ncoordinate our efforts, prevent duplication of work, and help you to craft the change so that it is successfully\naccepted into the project. Contact us at [borbpdf@gmail.com](mailto:borbpdf@gmail.com).\n* **Small Changes** can be crafted and submitted to the [GitHub Repository][github] as a [Pull Request][pull].\n\n\n## <a name=\"submit\">Submission Guidelines</a>\n\n### Submitting a Question or an Issue\nBefore you submit your question or issue, search [Stack Overflow][stackoverflow], maybe your question was already answered.\n\nIf your issue appears to be a bug, and hasn't been reported, ask a question on [Stack Overflow][stackoverflow] to verify that is indeed a bug and not a mistake in your own code.\nHelp us to maximize the effort we can spend fixing issues and adding new\nfeatures, by not reporting duplicate issues. Providing the following information will increase the\nchances of your issue being dealt with quickly:\n\n* **[How to ask good questions][good-questions]**\n* **Overview of the Issue** - if an error is being thrown a non-minified stack trace helps\n* **Motivation for or Use Case** - explain why this is a bug for you\n* **borb Version(s)** - is it a regression?\n* **Operating System** - is this a problem on Windows or Linux, maybe on Mac?\n* **Reproduce the Error** - provide a [Short, Self Contained, Correct (Compilable), Example][sscce], also known as a [Minimal, Complete, and Verifiable example][mcve].\n* **Related Issues** - has a similar issue been reported before?\n* **Suggest a Fix** - if you can't fix the bug yourself, perhaps you can point to what might be\n  causing the problem (line of code or commit)\n* **Tag the question** - add the tag `borb` to your question so we can find it.\n\n### Submitting a Pull Request\nBefore you submit your pull request consider the following guidelines:\n\n* Search [GitHub][pull] for an open or closed Pull Request\n  that relates to your submission. You don't want to duplicate effort.\n* Verify that your proposed change hasn't already been addressed in the develop branch.\n* Don't send a separate pull request for every single file you change.  \n* Please sign the [borb Contributor License Agreement (bCLA)](#cla) before sending pull\n  requests. We cannot accept code without this agreement.\n* Fork the borb repository on GitHub.\n* Clone your borb fork to your local machine.\n* Make your changes, **including appropriate test cases**.\n* Follow our [Coding Rules](#rules).\n* Commit your changes using a descriptive commit message that follows our\n  [commit message conventions](#commit-message-format).\n* Now would be a good time to fix up your commits (if you want or need to) with `git rebase --interactive`.\n* Build your changes locally to ensure all the tests pass.\n* Push your changes to your GitHub account.\n* Create a pull request in GitHub.\n\"Head fork\" should be your repository, and the \"base fork\" should be the borb official repository.\n* If we suggest changes then:\n  * Make the required updates.\n  * Fix up your commits if needed, with an interactive rebase.\n  * Re-run the tests and make sure that they are still passing.\n  * Force push to your GitHub repository. This will update your Pull Request.\n\nThat's it! Thank you for your contribution!\n\n#### After your pull request is merged\n\nAfter your pull request is merged, you can safely delete your fork and pull the changes\nfrom the main (upstream) repository.\n\n\n## <a name=\"rules\">Coding Rules</a>\nTo ensure consistency throughout the source code, keep these rules in mind as you are working:\n\n* All features or bug fixes **must be tested** by one or more unit tests.\n* All public API methods **must be documented**.\n* All code must be **formatted using black**.\n* All code must be **type-checked using MyPy**.\n\n\n## <a name=\"commit\">Git Commit Guidelines</a>\n\nWe have guidelines on how our git commit messages should be formatted. This leads to **more\nreadable messages** that are easy to follow when looking through the **project history**.\n\nThese guidelines were taken from Chris Beams' blog post [How to Write a Git Commit Message][git-commit].\n\n### Commit Message Format\nEach commit message consists of a **subject**, a **body** and a **footer**:\n\n```\n<subject>\n<BLANK LINE>\n<body>\n<BLANK LINE>\n<footer>\n```\n\nAny line of the commit message should not be longer 72 characters! This allows the message to be easier\nto read on GitHub as well as in various git tools.\n\n### Subject\nThe subject contains succinct description of the change:\n\n* [Separate subject from body with a blank line][git-commit-separate]\n* [Limit the subject line to 50 characters][git-commit-limit-50]\n* [Capitalize the subject line][git-commit-capitalize]\n* [Do not end the subject line with a period][git-commit-end]\n* [Use the imperative mood in the subject line][git-commit-imperative]\n\n### Body\n* [Wrap the body at 72 characters][git-commit-wrap-72]\n* [Use the body to explain _what_ and _why_ vs. _how_][git-commit-why-not-how]\n\n### Footer\nThe footer contains any information about **Breaking Changes** and is also the place to\nreference JIRA or GitHub issues that this commit **Closes**.\n\n\n## <a name=\"cla\">Signing the bCLA</a>\n\nPlease sign the [**borb Contributor License Agreement (bCLA)**][cla] before sending pull requests. For any code changes to be accepted, the bCLA must be signed. It's a quick process, we promise!\n\nWe'll need you to [(digitally) sign and then email, fax or mail the form][cla].\n\n\n## <a name=\"coc\">Contributor Code of Conduct</a>\nPlease note that this project is released with a [Contributor Code of Conduct][coc]. By participating in this project you agree to abide by its terms.\n\nWe use the [Stack Exchange][stackoverflow] network for free support and [GitHub][github] for code hosting. By using these services, you agree to abide by their terms:\n\n* StackExchange: [http://stackexchange.com/legal](http://stackexchange.com/legal)\n* Github: [https://help.github.com/articles/github-terms-of-service/](https://help.github.com/articles/github-terms-of-service/)\n\n[cla]: https://github.com/jorisschellekens/borb/BORB_CONTRIBUTOR_LICENSE_AGREEMENT.md\n[coc]: CODE_OF_CONDUCT.md\n[support]: https://borbpdf.com/\n[github]: https://github.com/jorisschellekens/borb\n[pull]: https://github.com/jorisschellekens/borb/pulls\n[sscce]: http://sscce.org/\n[stackoverflow]: https://stackoverflow.com/questions/tagged/borb\n[good-questions]: https://stackoverflow.com/help/how-to-ask\n[mcve]: https://stackoverflow.com/help/mcve\n[git-commit]: https://chris.beams.io/posts/git-commit/\n[git-commit-separate]: https://chris.beams.io/posts/git-commit/#separate\n[git-commit-limit-50]: https://chris.beams.io/posts/git-commit/#limit-50\n[git-commit-capitalize]: https://chris.beams.io/posts/git-commit/#capitalize\n[git-commit-end]: https://chris.beams.io/posts/git-commit/#end\n[git-commit-imperative]: https://chris.beams.io/posts/git-commit/#imperative\n[git-commit-wrap-72]: https://chris.beams.io/posts/git-commit/#wrap-72\n[git-commit-why-not-how]: https://chris.beams.io/posts/git-commit/#why-not-how"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 0.794921875,
          "content": "This program is offered under a commercial and under the AGPL license.\nFor commercial licensing, contact us at https://borbpdf.com.  For AGPL licensing, see below.\n\nAGPL licensing:\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU Affero General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU Affero General Public License for more details.\n\nYou should have received a copy of the GNU Affero General Public License\nalong with this program.  If not, see <https://www.gnu.org/licenses/>."
        },
        {
          "name": "MANIFEST.in",
          "type": "blob",
          "size": 0.3984375,
          "content": "include borb/io/write/document/resources/*.icm\ninclude borb/license/public_keys/*.pem\ninclude borb/pdf/canvas/font/composite_font/cmaps/*\ninclude borb/pdf/canvas/font/simple_font/afm/*.afm\ninclude borb/pdf/canvas/layout/emoji/resources/*.png\ninclude borb/pdf/canvas/layout/geography/geojson/*.geojson\ninclude borb/pdf/canvas/layout/hyphenation/resources/*.json\ninclude borb/pdf/canvas/lipsum/resources/*.json"
        },
        {
          "name": "PRIVACY_POLICY.md",
          "type": "blob",
          "size": 3.3701171875,
          "content": "# Privacy Policy\n\nWhen you use `borb`, you’re trusting us with your information. \nWe understand this is a big responsibility and work hard to protect your information and put you in control.\n\nThis **Privacy Policy** is meant to help you understand what information we collect, \nwhy we collect it, and how you can update, manage, export, and delete your information.\n\n## 1. Information we collect as you use our services\n\nWhen you use `borb`, you are (by default) sending anonymous usage information to one of our servers.\n`borb` sends information upon creating and upon reading a PDF (although this may change in future releases). \nThese are roughly the steps followed:\n\n1. Upon installing `borb`, a random user ID is generated\n2. This user ID is stored in the installation directory of `borb` (assuming the right file-permissions, etc)\n3. Whenever a read/write operation is performed, `borb` sends the following data:\n   1. **anonymous_user_id** (A randomly generated ID, associated with your user/installation of `borb`)\n   2. **event** (The action that triggered sending statistics, this could be `PDF::loads` or `PDF::dumps`)\n   3. **number_of_pages** (the number of pages read/written)\n   4. **sys_platform** (which operating system you are using `borb` on)\n   5. **utc_time_in_ms**\n   6. **version** (which version of `borb` you are using)\n\n***Note:** In order to determine your location (city, country_code, country_name, latitude, longitude, state) a free online API is used*\n\n## 2. We use data to build better services\n\nWe use this data to ensure our services are top-quality.\nFor instance, knowing which versions of `borb` are currently in use enables to decide which versions to continue to support.\nSimilarly, we may also decide to invest extra developer-time in supporting arabic scripts should we see a market in this. \nAnd then there is the big split of investing effort into the \"reading PDF documents\" versus \"writing PDF documents\" code. \nThis is yet another example of where having user data helps.\n\n### 2.1 Provide, maintain and improve our services\n\nBy being able to measure specific usages of `borb` (e.g. \"reading a PDF\", \"writing a PDF\", etc) we are able to determine where to invest\ndeveloper-time. This in turn improves your experience with `borb` as we are continually orienting ourselves to the user-demands.\n\n### 2.3 Develop new services\n\nBy knowing our customers, we may develop new products and services that are tailored towards a specific market.\n\n### 2.4 Measure performance\n\nBy knowing the amount of PDF documents created/read with each version, we can get idea of the popularity and adoption rate of each version of `borb`.\nThis gives us the opportunity to fine-tune our release-cycle.\n\n### 2.6 Protect `borb`, our users, and the public\n\nWe want to ensure developer-effort is spent on those issues that impact the most users. In order to ensure this, we need to know how many people are using\na given version of `borb`.\n\n## 3. You have choices regarding the information we collect and how it's used\n\nYou can disable the gathering of anonymous usage statistics, all you need to do is call `UsageStatistics.disable()`.\nThis in turn will call `AnonymousUserID.disable()` which will replace the file (containing your user ID) with a 0 byte file.\nThis is the signal to the rest of `borb` not to send the usage statistics anymore.\n\nShould you so desire, you can (re-) enable them by calling `UsageStatistics.enable()`.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.044921875,
          "content": "\n# ![borb logo](https://github.com/jorisschellekens/borb/raw/master/logo/borb_64.png) borb\n\n\n[![Code style: black](https://img.shields.io/badge/code%20style-black-000000.svg)](https://github.com/psf/black)\n[![Corpus Coverage : 100.0%](https://img.shields.io/badge/corpus%20coverage-100.0%25-green)]()\n[![Text Extraction : 93.1%](https://img.shields.io/badge/text%20extraction-93.1%25-green)]()\n[![Public Method Documentation : 100%](https://img.shields.io/badge/public%20method%20documentation-100%25-green)]()\n[![Number of Tests : 760](https://img.shields.io/badge/number%20of%20tests-760-green)]()\n[![Python : 3.8 | 3.9 | 3.10 ](https://img.shields.io/badge/python-3.8%20&#124;%203.9%20&#124;%203.10-green)]()\n[![Type Checking : 98%](https://img.shields.io/badge/type%20checking-98%25-green)]()\n\n\n[![Downloads](https://pepy.tech/badge/borb)](https://pepy.tech/project/borb)\n[![Downloads](https://pepy.tech/badge/borb/month)](https://pepy.tech/project/borb)\n\n`borb` is a library for creating and manipulating PDF files in python.\n\n## 0. About borb\n\n`borb` is a pure python library to read, write and manipulate PDF documents. \nIt represents a PDF document as a JSON-like datastructure of nested lists, dictionaries and primitives (numbers, string, booleans, etc)\n\nThis is currently a one-man project, so the focus will always be to support those use-cases that are more common in favor of those that are rare.\n\n📣 **Next (major) release**: You can track the status of the next release on a dedicated [GitHub Pages](https://jorisschellekens.github.io/borb-3-status/).\n\n## 1. About the Examples\n\nThe examples can be found in a separate repository.\nThis ensures the `borb` repository stays relatively small, whilst still providing a thorough knowledgebase of code-samples, screenshots and explanatory text.\n\n[Check out the examples repository here!](https://github.com/jorisschellekens/borb-examples)\n\nThey include; \n\n- Reading a PDF and extracting meta-information\n- Changing meta-information  \n- Extracting text from a PDF\n- Extracting images from a PDF\n- Changing images in a PDF\n- Adding annotations (notes, links, etc) to a PDF\n- Adding text to a PDF\n- Adding tables to a PDF\n- Adding lists to a PDF\n- Using a PageLayout manager\n\n and much more\n \n### 1.0 Installing `borb`\n\n`borb` can be installed using `pip`\n\n    pip install borb\n\nIf you have installed `borb` before, and you want to ensure `pip` downloads the latest version (rather than using its internal cache) you can use the following commands:\n\n    pip uninstall borb\n    pip install --no-cache borb\n\n### 1.1 Hello World\n\nTo give you an immediate idea of the way `borb` works, \nthis is the classic `Hello World` example, in `borb`:\n\n```python\nfrom pathlib import Path\n\nfrom borb.pdf import Document\nfrom borb.pdf import Page\nfrom borb.pdf import SingleColumnLayout\nfrom borb.pdf import Paragraph\nfrom borb.pdf import PDF\n\n# create an empty Document\npdf = Document()\n\n# add an empty Page\npage = Page()\npdf.add_page(page)\n\n# use a PageLayout (SingleColumnLayout in this case)\nlayout = SingleColumnLayout(page)\n\n# add a Paragraph object\nlayout.add(Paragraph(\"Hello World!\"))\n    \n# store the PDF\nwith open(Path(\"output.pdf\"), \"wb\") as pdf_file_handle:\n    PDF.dumps(pdf_file_handle, pdf)\n```\n\n## 2. License\n\n`borb` is dual licensed as AGPL/Commercial software.\n\nAGPL is a free / open source software license.\nThis doesn't mean the software is [gratis](https://en.wikipedia.org/wiki/Gratis_versus_libre)!\n\nBuying a license is mandatory as soon as you develop commercial activities distributing the borb software inside your product or deploying it on a network without disclosing the source code of your own applications under the AGPL license. \nThese activities include:\n\n- Offering paid services to customers as an ASP\n- Serving PDFs on the fly in the cloud or in a web application\n- Shipping `borb` with a closed source product\n\n[Contact sales](https://borbpdf.com/) for more information.\n\n## 3. Acknowledgements\n\nI would like to thank the following people, for their contributions / advice with regards to developing `borb`:\n- Aleksander Banasik\n- Benoît Lagae\n- Michael Klink\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.7412109375,
          "content": "# Reporting Security Issues\n\nThe `borb` team and community take security bugs in ``borb seriously. We appreciate your efforts to responsibly disclose your findings, and will make every effort to acknowledge your contributions.\n\nTo report a security issue, please use the GitHub Security Advisory [\"Report a Vulnerability\"](https://github.com/jorisschellekens/borb/security/advisories/new) tab.\n\nThe `borb` team will send a response indicating the next steps in handling your report. After the initial reply to your report, the security team will keep you informed of the progress towards a fix and full announcement, and may ask for additional information or guidance.\n\nReport security bugs in third-party modules to the person or team maintaining the module."
        },
        {
          "name": "borb",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "logo",
          "type": "tree",
          "content": null
        },
        {
          "name": "release_notes.md",
          "type": "blob",
          "size": 0.1171875,
          "content": "\n# :mega: borb release notes\n\nThis release features a minor bugfix in `Paragraph` related to text-alignment `JUSTIFIED`."
        },
        {
          "name": "requirements.txt",
          "type": "blob",
          "size": 0.125,
          "content": "cryptography>=41.0.1\nfonttools>=4.38.0\nPillow==9.5.0\npython-barcode>=0.14.0\nqrcode[pil]>=6.1\nrequests>=2.31.0\nsetuptools>=68.0.0"
        },
        {
          "name": "setup.py",
          "type": "blob",
          "size": 1.24609375,
          "content": "#!/usr/bin/env python\n# -*- coding: utf-8 -*-\n\n\"\"\"\n    This module contains the build information for this project\n\"\"\"\nimport setuptools\n\nfrom borb.license.version import Version\n\n# open readme\nwith open(\"README.md\", \"r\", encoding=\"utf-8\") as fh:\n    long_description = fh.read()\n\n# requirements\nrequired = [\n    \"cryptography>=37.0.4\",     # license handling\n    \"fonttools>=4.22.1\",        # TTF fonts\n    \"lxml>=4.9.1\",              # XML processing\n    \"Pillow>=7.1.0\",            # image processing\n    \"python-barcode>=0.13.1\",   # generating barcodes\n    \"qrcode[pil]>=6.1\",         # generating QR codes\n    \"requests>=2.24.0\",         # generating images from a URL\n    \"setuptools>=51.1.1\",       # standard\n]\n\nsetuptools.setup(\n    name=\"borb\",\n    version=Version.get_version(),\n    author=Version.get_author(),\n    author_email=\"joris.schellekens.1989@gmail.com\",\n    description=\"borb is a library for reading, creating and manipulating PDF files in python.\",\n    long_description=long_description,\n    long_description_content_type=\"text/markdown\",\n    url=\"https://github.com/jorisschellekens/borb\",\n    packages=setuptools.find_packages(include=[\"borb\", \"borb.*\"]),\n    include_package_data=True,\n    install_requires=required,\n    python_requires=\">=3.6\",\n)\n"
        },
        {
          "name": "test-requirements.txt",
          "type": "blob",
          "size": 0.2177734375,
          "content": "cryptography>=41.0.1\nfonttools>=4.38.0\ngTTS>=2.4.0\nlxml>=4.9.2\nmarkdown-it-py>=3.0.0\nmatplotlib>=3.8.2\npandas>=2.1.3\nPillow==9.5.0\npygments>=2.17.2\npython-barcode>=0.14.0\nqrcode[pil]>=6.1\nrequests>=2.31.0\nsetuptools>=68.0.0"
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}