{
  "metadata": {
    "timestamp": 1736559520761,
    "page": 110,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjExMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ct-Open-Source/tuya-convert",
      "stars": 4722,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".env-template",
          "type": "blob",
          "size": 0.462890625,
          "content": "#Attention: \"host\" means your computer where you are running docker on \n\nWLAN=wlan0                          #must match the name of your wlan-interface on your host, you may find it with ifconfig \nAP=vtrust-flash                     #the name of the created AP, can be anything you want\nGATEWAY=10.42.42.1                  #gateway address, leave it here\nLOCALBACKUPDIR=./data/backups       #location on your host where you want to store backuos of the old firmware & logs\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.33984375,
          "content": "# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# Distribution / packaging\n.Python\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\n*.egg-info/\n.installed.cfg\n*.egg\nMANIFEST\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test / coverage reports\nhtmlcov/\n.tox/\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\n*.cover\n.hypothesis/\n.pytest_cache/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\ndb.sqlite3\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# pyenv\n.python-version\n\n# celery beat schedule file\ncelerybeat-schedule\n\n# SageMath parsed files\n*.sage.py\n\n# Environments\n.env\n.venv\nenv/\nvenv/\nENV/\nenv.bak/\nvenv.bak/\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n\n# Node\nnode_modules/\n*.bin\ndevice-info.txt\nscripts/smartconfig/package-lock.json\n\n# firmware backups directory and data-file\nbackups/\ndata\n\n# flag files\neula_accepted\n\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0.4384765625,
          "content": "FROM alpine:3.13\n\nRUN apk add --update bash git iw dnsmasq hostapd screen curl py3-pip py3-wheel python3-dev mosquitto haveged net-tools openssl openssl-dev gcc musl-dev linux-headers sudo coreutils grep iproute2 ncurses\n\nRUN python3 -m pip install --upgrade paho-mqtt tornado git+https://github.com/drbild/sslpsk.git pycryptodomex\n\nCOPY docker/bin /usr/bin/\n\nCOPY . /usr/bin/tuya-convert\n\nWORKDIR \"/usr/bin/tuya-convert\"\n\nENTRYPOINT [\"tuya-start\"]\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0380859375,
          "content": "MIT License\n\nCopyright (c) 2019 VTRUST\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.619140625,
          "content": "ï»¿\n# TUYA-CONVERT\n\nA Chinese company named Tuya offers a free-to-brand turnkey smart home solution to anyone. Using their offer is dead-simple, since everything can be done by clicking through the [Tuya web page](https://en.tuya.com/), from choosing your pre-designed products or pre-programmed wifi-modules (mostly ESP8266) to building your own app. In the end, this has resulted in as they claim over 11 000 devices 'made' by over 10 000 vendors using Tuyas firmware and cloud services.\n\nAside from that, they claim their cloud solution has 'military grade security'. Michael Steigerwald, founder of the German IT security startup VTRUST, was able to disprove this claim and presented his results in the \"Smart home - Smart hack\" talk at 35C3 in Leipzig: https://media.ccc.de/v/35c3-9723-smart_home_-_smart_hack\n\nIn the following days, VTRUST and the German tech magazine c't decided to work together. Since reflashing devices using the ESP8266/85 is widespread among DIY smart home enthusiasts, we wanted to provide an easy way for everyone to free their devices from the cloud without the need for a soldering iron.\n\nPlease make sure to visit VTRUST (https://www.vtrust.de/), since the hack is their work.\n\n## ðŸš¨WARNINGðŸš¨\nPlease be sure that you understand what you're doing before using this software. Flashing an alternative firmware can lead to unexpected behavior and/or render the device unusable, so that it might be permanently damaged (highly unlikely) or require soldering a serial connection to the processor in order to reflash it (likely).\n\n### âš ï¸ Be aware that you use this software at your own risk so neither VTRUST nor c't/heise can be held accountable for any damage done or loss of functionality. âš ï¸\n\nTUYA-CONVERT only provides with the means to backup the original and flash an alternative firmware. Please do not ask for hardware support for your favorite alternative firmware in this repository, rather open an issue in the corresponding repository.\n\n## DOCUMENTATION\nSince Tuya devices are spread around the world with likely a vast amount of different brand names, please tell the community if you find one! There is a device list in the wiki that you can help extend. Please at least add the device model number, brand name, geographical area where you have bought the device and its flash mode (as seen in the device information). Add the GPIO assignments as well if you have found them to save the developers of alternative firmwares some time. Please note that we do not develop or maintain alternative firmwares and so post installation issues should be directed to the respective project.\n\n[![asciicast](https://asciinema.org/a/2aDZweVGfliwc9TjB1ncwmKvm.png)](https://asciinema.org/a/2aDZweVGfliwc9TjB1ncwmKvm\n)\n\n## REQUIREMENTS\n* Linux computer with a wifi adapter\n* Secondary wifi device (e.g. smartphone)\n* Dependencies will be installed by `install_prereq.sh`\n\nThese scripts were tested in\n* Kali-Linux 2018.4 in VMWARE\n* a Raspberry Pi Zero W with Rasbian\n* a Raspberry Pi 3B / 3B+ / 4B with Raspbian Stretch and its internal Wifi chip\n* a Raspberry Pi 3B / 3B+ Raspberry Pi OS Buster (previously called Raspbian) and its internal Wifi chip\n* a Raspberry Pi 3B+ + USB-WIFI with an image from [here](https://www.offensive-security.com/kali-linux-arm-images/)\n* Ubuntu 18.04.3 64Bit in VirtualBox on Win10 with a cheap RTL8188CU Wifi Adapter connected to the VM\n* Ubuntu Mate 18.04.5 32bit in VirtualBox on Win 10 with cheap Ralink 802.11n WLAN (MediaTek RT5370) WiFi Adapter connected to VM\n\nAny Linux with a Wifi adapter which can act as an Access Point should also work. Please note that we have tested the Raspberry Pi with clean installations only. If you use your Raspberry Pi for anything else, we recommend using another SD card with a clean installation.\n\n## PROCEDURE\n\nOn January 28th, 2019, Tuya started [distributing a patch](https://www.heise.de/newsticker/meldung/Smart-Home-Hack-Tuya-veroeffentlicht-Sicherheitsupdate-4292028.html) that prevented older versions of tuya-convert from completing successfully. We have since developed a work around to enable OTA flashing on some newer devices, but Tuya has since released [yet another patch](https://github.com/ct-Open-Source/tuya-convert/issues/483).\n\nTo ensure the best chance of success, **do not connect your device with the official app** as it may automatically update the device, preventing you from flashing with tuya-convert. It is up to the individual brands to update their firmware, so some devices may be affected sooner than others.\n\nUnfortunately many devices have already been shipping with the new patched firmware, evident by a PSK ID beginning with 02 in smarthack-psk.log. There is no workaround at this time. Additionally, manufacturers have been silently switching from the ESP82xx based modules to other chipsets, making it impossible to install alternative ESP firmware on these devices.\n\n### INSTALLATION\n    # git clone https://github.com/ct-Open-Source/tuya-convert\n    # cd tuya-convert\n    # ./install_prereq.sh\n\n### FLASH third-party firmware\nBE SURE THE FIRMWARE FITS YOUR DEVICE!\n1. Place your binary file in the `/files/` directory or use one of the included firmware images.\n\n\tCurrently a [Tasmota](https://github.com/arendst/Tasmota) `tasmota-lite.bin` build is included in the Tuya-Convert package. You can easily update to the [current maintenance release](http://thehackbox.org/tasmota) via OTA **after** the flashing process completes successfully. The included binary does not have any specific hardware configured. Once flashed using Tuya-Convert you will need to configure your device(s) properly. Please note that while we include this firmware for your convenience, we are not affiliated with the Tasmota project and cannot provide support for post installation issues. Please refer to the [Tasmota project](https://github.com/arendst/Tasmota) and [its documentation](http://tasmota.com) for configuration and support. **IMPORTANT:** If you still want to update the tasmota binary before using Tuya-Convert, always pickup `tasmota-lite.bin`. **Never ever** use `tasmota-minimal.bin` as you will brick your device.\n\n\tAn ESPurna [1.13.5](https://github.com/xoseperez/espurna/releases/tag/1.13.5) binary is also included (`espurna-base.bin`). Like before, the binary included does not have any specific hardware defined. Once flashed using Tuya-Convert you can update to the device-specific version via any of the means that ESPurna provides (OTA, web interface update, update via telnet or MQTT). Please refer to the [ESPurna project page](http://espurna.io) for more info and support.\n\n\tBinary requirements:\n\t* full binary including first-stage bootloader (tested with Arduino eboot and Open-RTOS rBoot)\n\t* maximum filesize 512KB for first flash\n\n2. Start flashing process\n\n\tExecute `./start_flash.sh` and follow the instructions.\n\tIt will install our flash loader onto the ESP and connect to the access point created by your wifi adapter.\n\tA backup of the original firmware will be automatically downloaded and stored locally.\n\tYou can then proceed to flash your desired firmware or revert to the stock firmware.\n\n3. Initial Configuration\n\n\tIf you flashed the included Tasmota firmware file, it will broadcast a `tasmota-xxxx` access point (AP) when the device boots. Connect to this AP and open the browser to 192.168.4.1 to configure the device's Wi-Fi credentials. When entering the Wi-Fi password, click the checkbox to view the password you enter to ensure that it is correct and that your mobile device has not inadvertently capitalized the first letter if it is supposed to be lower case nor autocorrected what you entered. ~~Double~~ **Triple check the Wi-Fi credentials** before clicking **Save** to apply the settings.\n\n\tIf you flashed the included ESPurna firmware file, the procedure will be very similar. The device will broadcast a `ESPURNA-XXXXXX` access point. You will have to connect to it using the default password: `fibonacci`. Once connected open the browser to 192.168.4.1 and follow the initial configuration instructions. Then go to the WIFI tab and configure your home WiFi connection (remember to save) or go to the ADMIN tab to upgrade the firmware to the device-specific image.\n\n## USING DOCKER\nYou may want to use a docker image instead. Advantage of this solution: You don't have to install anything on your host (except docker), everything goes into the docker image.\nRequirements:\n* Linux computer with a wifi adapter\n* Secondary wifi device (e.g. smartphone)\n* docker is installed\n* docker-compose is installed\n\nPreparations:\n* git clone https://github.com/ct-Open-Source/tuya-convert\n* cd tuya-convert\n* if you have already cloned this repo just cd into the directory and execute `git pull`\n* cp .env-template .env \n* adjust the created .env-file, it contains usage information as comments\n\nBuilding and running your container:\n* `docker-compose build && docker-compose run --rm tuya`\n* This directly starts into tuya. If you press ctrl+break or exit tuya after flashing, your container is closed and deleted\n\nTroubleshooting:\n* Q: Where are my logs after flashing? A: The folder can be adjusted in .env with LOCALBACKUPDIR, the path here may be relative or absolute\n* Q: I don't want that my container is deleted after running tuya, I need this for troubleshooting! How do I accomplish this? A: Just remove --rm from `docker-compose run --rm tuya`\n* Q: I want to start the container, but instead of starting tuya immediately I want to get into bash. Is this possible? A: Yes just start the container with `docker-compose run --entrypoint bash tuya`.\n* Q: I want to rebuild my docker-image, even if there are no changes. Is this possible? A: Just start `docker-compose build --no-cache` instead of `docker-compose build`! Don't do this all the time, this is a time consuming process ...\n* Q: I can't connect to my USB, PCI, ... network card. How do I get this working? A: You may have an error in your .env-File. The WLAN-variable should reflect the name of your network interface on your host. Execute ifconfig and look through your interfaces.\n* Q: I can't get an IP-address and or connection on my phone, what's the problem? A: You may look into smarthack-wifi.log (location is set in .env with LOCALBACKUPDIR) or possible stop your firewall (e.g. NixOS seems to have a problem here). It may be a problem with a wrongly set network interface (see previous question)\n\n## CONTRIBUTING\n\nThis project is currently maintained by Colin Kuebler @kueblc\n\nSignificant time and resources are devoted to supporting and maintaining this project. Research, development, and testing requires obtaining and often breaking IoT devices and related hardware. To help offset costs and support the developers who make this project possible, please consider making a one-time or recurring donation. This allows us to spend less time worrying about putting food on the table and more time making great software accessible to everyone.\n\n- [Become a Patron](https://www.patreon.com/kueblc)\n- [Buy Me A Coffee](https://www.buymeacoffee.com/kueblc)\n- [PayPal](https://paypal.me/kueblc)\n\nYou can also give back by providing or improving documentation, tutorials, issue support, bug reports, feature requests, and pull requests. When planning to contribute major code changes, please post your intention beforehand so we can coordinate, avoid redundant contributions and ensure the changes match project philosophy. Any major PR should be made against the `development` branch.\n\n## RELATED WORKS\n- [TuyAPI](https://github.com/codetheweb/tuyapi) NPM library for LAN control of Tuya devices with stock firmware\n- [TuyOTA](https://github.com/SynAckFin/TuyOTA) Perl based Tuya flashing script using a similar strategy\n- [MockTuyaCloud](https://github.com/kueblc/mocktuyacloud) Framework replicating much of the Tuya cloud functionality\n"
        },
        {
          "name": "config.txt",
          "type": "blob",
          "size": 0.2841796875,
          "content": "# Please input the wlan device to be used (most of the time it is wlan0 or wlan1)\nWLAN=wlan0\n\n# Here you could change the WIFI-name but most likely most scripts won't work after\n# Because the WIFI-credentials are hardcoded in the esp8266-ota-flash-convert\nAP=vtrust-flash\nGATEWAY=10.42.42.1\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 0.236328125,
          "content": "version: '3'\nservices:\n  tuya:\n    build: .\n    privileged: true\n    network_mode: \"host\"\n    environment:\n        WLAN: ${WLAN}\n        AP: ${AP}\n        GATEWAY: ${GATEWAY}\n    volumes:\n      - $LOCALBACKUPDIR:/usr/bin/tuya-convert/backups\n"
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "files",
          "type": "tree",
          "content": null
        },
        {
          "name": "install_prereq.sh",
          "type": "blob",
          "size": 1.2626953125,
          "content": "#!/usr/bin/env bash\nset -euo pipefail\n\ndebianInstall() {\n\tsudo apt-get update\n\tsudo apt-get install -y git iw dnsmasq rfkill hostapd screen curl build-essential python3-pip python3-setuptools python3-wheel python3-dev mosquitto haveged net-tools libssl-dev iproute2 iputils-ping\n\tsudo python3 -m pip install --user --upgrade paho-mqtt tornado git+https://github.com/drbild/sslpsk.git pycryptodomex\n}\n\narchInstall() {\n\tsudo pacman -S --needed git iw dnsmasq hostapd screen curl python-pip python-wheel python-pycryptodomex python-paho-mqtt python-tornado mosquitto haveged net-tools openssl\n\tsudo python -m pip install --user --upgrade git+https://github.com/drbild/sslpsk.git\n}\n\nif [[ -e /etc/os-release ]]; then\n\tsource /etc/os-release\nelse\n\techo \"/etc/os-release not found! Assuming debian-based system, but this will likely fail!\"\n\tID=debian\nfi\n\nif [[ ${ID} == 'debian' ]] || [[ ${ID_LIKE-} == 'debian' ]]; then\n\tdebianInstall\nelif [[ ${ID} == 'arch' ]] || [[ ${ID_LIKE-} == 'arch' ]]; then\n\tarchInstall\nelse\n\tif [[ -n ${ID_LIKE-} ]]; then\n\t\tprintID=\"${ID}/${ID_LIKE}\"\n\telse\n\t\tprintID=\"${ID}\"\n\tfi\n\techo \"/etc/os-release found but distribution ${printID} is not explicitly supported. Assuming debian-based system, but this will likely fail!\"\n\tdebianInstall\nfi\n\necho \"Ready to start upgrade\"\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "start_flash.sh",
          "type": "blob",
          "size": 4.5498046875,
          "content": "#!/usr/bin/env bash\nbold=$(tput bold)\nnormal=$(tput sgr0)\n. ./config.txt\n\nsetup () {\n\techo \"tuya-convert $(git describe --tags)\"\n\tpushd scripts >/dev/null || exit\n\t. ./setup_checks.sh\n\tscreen_minor=$(screen --version | cut -d . -f 2)\n\tif [ \"$screen_minor\" -gt 5 ]; then\n\t\tscreen_with_log=\"sudo screen -L -Logfile\"\n\telse\n\t\tscreen_with_log=\"./old_screen_with_log.sh ${screen_minor}\"\n\tfi\n\techo \"======================================================\"\n\techo -n \"  Starting AP in a screen\"\n\t$screen_with_log smarthack-wifi.log -S smarthack-wifi -m -d ./setup_ap.sh\n\twhile ! ping -c 1 -W 1 -n \"$GATEWAY\" &> /dev/null; do\n\t\tprintf .\n\tdone\n\techo\n\tsleep 5\n\techo \"  Starting web server in a screen\"\n\t$screen_with_log smarthack-web.log -S smarthack-web -m -d ./fake-registration-server.py\n\techo \"  Starting Mosquitto in a screen\"\n\t$screen_with_log smarthack-mqtt.log -S smarthack-mqtt -m -d mosquitto -v -c $PWD/mosquitto.conf\n\techo \"  Starting PSK frontend in a screen\"\n\t$screen_with_log smarthack-psk.log -S smarthack-psk -m -d ./psk-frontend.py -v\n\techo \"  Starting Tuya Discovery in a screen\"\n\t$screen_with_log smarthack-udp.log -S smarthack-udp -m -d ./tuya-discovery.py\n\techo\n}\n\ncleanup () {\n\techo \"======================================================\"\n\techo \"Cleaning up...\"\n\tsudo screen -S smarthack-web          -X stuff '^C'\n\tsudo screen -S smarthack-mqtt         -X stuff '^C'\n\tsudo screen -S smarthack-psk          -X stuff '^C'\n\tsudo screen -S smarthack-udp          -X stuff '^C'\n\techo \"Closing AP\"\n\tsudo pkill hostapd\n\techo \"Exiting...\"\n\tpopd >/dev/null || exit\n}\n\ntrap cleanup EXIT\nsetup\n\nwhile true; do\n\techo \"======================================================\"\n\techo\n\techo \"IMPORTANT\"\n\techo \"1. Connect any other device (a smartphone or something) to the WIFI $AP\"\n\techo \"   This step is IMPORTANT otherwise the smartconfig may not work!\"\n\techo \"2. Put your IoT device in autoconfig/smartconfig/pairing mode (LED will blink fast). This is usually done by pressing and holding the primary button of the device\"\n\techo \"   Make sure nothing else is plugged into your IoT device while attempting to flash.\"\n\techo \"3. Press ${bold}ENTER${normal} to continue\"\n\tread -r\n\techo\n\techo \"======================================================\"\n\n\techo \"Starting smart config pairing procedure\"\n\t./smartconfig/main.py &\n\n\techo \"Waiting for the device to install the intermediate firmware\"\n\n\ti=120\n\t# !!! IMPORTANT !!!\n\t# Did your device get an IP address other than 10.42.42.42?\n\t# That is because it is not running the intermediate firmware\n\t# The intermediate firmware will request 10.42.42.42\n\t# Do NOT change this address!!!\n\t# It will NOT make it install and will break this script\n\twhile ! ping -c 1 -W 1 -n 10.42.42.42 -I 10.42.42.1 &> /dev/null; do\n\t\tprintf .\n\t\tif (( --i == 0 )); then\n\t\t\techo\n\t\t\techo \"Timed out while waiting for the device to (re)connect\"\n\t\t\tpkill -f smartconfig/main.py && echo \"Stopping smart config\"\n\t\t\techo \"======================================================\"\n\t\t\techo \"Attempting to diagnose the issue...\"\n\t\t\t./dr_tuya.sh\n\t\t\techo \"======================================================\"\n\t\t\tread -p \"Do you want to try flashing another device? [y/N] \" -n 1 -r\n\t\t\techo\n\t\t\t[[ \"$REPLY\" =~ ^[Yy]$ ]] || break 2\n\t\t\tcontinue 2\n\t\tfi\n\tdone\n\n\techo\n\techo \"IoT-device is online with ip 10.42.42.42\"\n\n\tpkill -f smartconfig/main.py && echo \"Stopping smart config\"\n\n\techo \"Fetching firmware backup\"\n\tsleep 2\n\ttimestamp=$(date +%Y%m%d_%H%M%S)\n\tbackupfolder=\"../backups/$timestamp\"\n\tmkdir -p \"$backupfolder\"\n\tpushd \"$backupfolder\" >/dev/null || exit\n\n\tif ! curl -JOm 90 http://10.42.42.42/backup; then\n\t\techo \"Could not fetch a complete backup\"\n\t\tread -p \"Do you want to continue anyway? [y/N] \" -n 1 -r\n\t\techo\n\t\t[[ \"$REPLY\" =~ ^[Yy]$ ]] || break\n\t\tsleep 2\n\tfi\n\n\techo \"======================================================\"\n\techo \"Getting Info from IoT-device\"\n\tcurl -s http://10.42.42.42 | tee device-info.txt\n\tpopd >/dev/null || exit\n\n\techo \"======================================================\"\n\techo \"Ready to flash third party firmware!\"\n\techo\n\techo \"For your convenience, the following firmware images are already included in this repository:\"\n\techo \"  Tasmota v9.2.0 (wifiman)\"\n\techo \"  ESPurna 1.5 (base)\"\n\techo\n\techo \"You can also provide your own image by placing it in the /files directory\"\n\techo \"Please ensure the firmware fits the device and includes the bootloader\"\n\techo \"MAXIMUM SIZE IS 512KB\"\n\n\t./firmware_picker.sh\n\tsudo mv *.log \"$backupfolder/\"\n\n\techo \"======================================================\"\n\tread -p \"Do you want to flash another device? [y/N] \" -n 1 -r\n\techo\n\t[[ \"$REPLY\" =~ ^[Yy]$ ]] || break\ndone\n"
        }
      ]
    }
  ]
}