{
  "metadata": {
    "timestamp": 1736559676608,
    "page": 348,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "maziarraissi/PINNs",
      "stars": 4143,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.0439453125,
          "content": "MIT License\n\nCopyright (c) 2018 maziarraissi\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.4072265625,
          "content": "# [Physics Informed Neural Networks](https://maziarraissi.github.io/PINNs/)\n\n> **Notice:** This repository is no longer under active maintenance. It is highly recommended to utilize implementations of Physics-Informed Neural Networks (PINNs) available in [PyTorch](https://github.com/rezaakb/pinns-torch), [JAX](https://github.com/rezaakb/pinns-jax), and [TensorFlow v2](https://github.com/rezaakb/pinns-tf2).\n\nWe introduce physics informed neural networks – neural networks that are trained to solve supervised learning tasks while respecting any given law of physics described by general nonlinear partial differential equations. We present our developments in the context of solving two main classes of problems: data-driven solution and data-driven discovery of partial differential equations. Depending on the nature and arrangement of the available data, we devise two distinct classes of algorithms, namely continuous time and discrete time models. The resulting neural networks form a new class of data-efficient universal function approximators that naturally encode any underlying physical laws as prior information. In the first part, we demonstrate how these networks can be used to infer solutions to partial differential equations, and obtain physics-informed surrogate models that are fully differentiable with respect to all input coordinates and free parameters. In the second part, we focus on the problem of data-driven discovery of partial differential equations.\n\nFor more information, please refer to the following: (https://maziarraissi.github.io/PINNs/)\n\n  - Raissi, Maziar, Paris Perdikaris, and George E. Karniadakis. \"[Physics-informed neural networks: A deep learning framework for solving forward and inverse problems involving nonlinear partial differential equations](https://www.sciencedirect.com/science/article/pii/S0021999118307125).\" Journal of Computational Physics 378 (2019): 686-707.\n\n  - Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. \"[Physics Informed Deep Learning (Part I): Data-driven Solutions of Nonlinear Partial Differential Equations](https://arxiv.org/abs/1711.10561).\" arXiv preprint arXiv:1711.10561 (2017).\n\n  - Raissi, Maziar, Paris Perdikaris, and George Em Karniadakis. \"[Physics Informed Deep Learning (Part II): Data-driven Discovery of Nonlinear Partial Differential Equations](https://arxiv.org/abs/1711.10566).\" arXiv preprint arXiv:1711.10566 (2017).\n\n## Citation\n\n    @article{raissi2019physics,\n      title={Physics-informed neural networks: A deep learning framework for solving forward and inverse problems involving nonlinear partial differential equations},\n      author={Raissi, Maziar and Perdikaris, Paris and Karniadakis, George E},\n      journal={Journal of Computational Physics},\n      volume={378},\n      pages={686--707},\n      year={2019},\n      publisher={Elsevier}\n    }\n\n    @article{raissi2017physicsI,\n      title={Physics Informed Deep Learning (Part I): Data-driven Solutions of Nonlinear Partial Differential Equations},\n      author={Raissi, Maziar and Perdikaris, Paris and Karniadakis, George Em},\n      journal={arXiv preprint arXiv:1711.10561},\n      year={2017}\n    }\n\n    @article{raissi2017physicsII,\n      title={Physics Informed Deep Learning (Part II): Data-driven Discovery of Nonlinear Partial Differential Equations},\n      author={Raissi, Maziar and Perdikaris, Paris and Karniadakis, George Em},\n      journal={arXiv preprint arXiv:1711.10566},\n      year={2017}\n    }\n"
        },
        {
          "name": "Utilities",
          "type": "tree",
          "content": null
        },
        {
          "name": "appendix",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "main",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}