{
  "metadata": {
    "timestamp": 1736560364406,
    "page": 901,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjkxMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "osm-search/Nominatim",
      "stars": 3306,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".codespellrc",
          "type": "blob",
          "size": 0.38671875,
          "content": "# https://github.com/codespell-project/codespell\n\n[codespell]\nskip = ./man/nominatim.1,data,./docs/styles.css,lib-php,module,munin,osm2pgsql,./test,./settings/*.lua,./settings/*.yaml,./settings/**/*.yaml,./settings/icu-rules,./nominatim/tokenizer/token_analysis/config_variants.py\n# Need to be lowercase in the list\n# Unter = Unter den Linden (an example address)\nignore-words-list = inout,unter\n"
        },
        {
          "name": ".flake8",
          "type": "blob",
          "size": 0.1748046875,
          "content": "[flake8]\nmax-line-length = 100\nmax-doc-length = 100\nextend-ignore =\n    # something == None constructs are needed for SQLAlchemy\n    E711\nper-file-ignores =\n    __init__.py: F401\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.1064453125,
          "content": "*.log\n*.pyc\n*.swp\n\ndocs/develop/*.png\nsite-html\n\nbuild\ndist\n.coverage\n\n.vagrant\ndata/country_osm_grid.sql.gz\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": ".mypy.ini",
          "type": "blob",
          "size": 0.37109375,
          "content": "[mypy]\nplugins = sqlalchemy.ext.mypy.plugin\n\n[mypy-sanic_cors.*]\nignore_missing_imports = True\n\n[mypy-icu.*]\nignore_missing_imports = True\n\n[mypy-asyncpg.*]\nignore_missing_imports = True\n\n[mypy-datrie.*]\nignore_missing_imports = True\n\n[mypy-dotenv.*]\nignore_missing_imports = True\n\n[mypy-falcon.*]\nignore_missing_imports = True\n\n[mypy-geoalchemy2.*]\nignore_missing_imports = True\n"
        },
        {
          "name": "AUTHORS",
          "type": "blob",
          "size": 0.2626953125,
          "content": "Nominatim was written by:\n\n* Brian Quinion\n* Sarah Hoffmann\n* Marc Tobias Metten\n\n* markigail\n* AntoJvlt\n* gemo1011\n* darkshredder\n\nand many more.\n\nFor a full list of contributors see the Git logs or visit\nhttps://github.com/openstreetmap/Nominatim/graphs/contributors\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 4.423828125,
          "content": "# Nominatim contribution guidelines\n\n## Reporting Bugs\n\nBugs can be reported at https://github.com/openstreetmap/Nominatim/issues.\nPlease always open a separate issue for each problem. In particular, do\nnot add your bugs to closed issues. They may looks similar to you but\noften are completely different from the maintainer's point of view.\n\n## Workflow for Pull Requests\n\nWe love to get pull requests from you. We operate the \"Fork & Pull\" model\nexplained at\n\nhttps://help.github.com/articles/using-pull-requests\n\nYou should fork the project into your own repo, create a topic branch\nthere and then make one or more pull requests back to the openstreetmap repository.\nYour pull requests will then be reviewed and discussed. Please be aware\nthat you are responsible for your pull requests. You should be prepared\nto get change requests because as the maintainers we have to make sure\nthat your contribution fits well with the rest of the code. Please make\nsure that you have time to react to these comments and amend the code or\nengage in a conversion. Do not expect that others will pick up your code,\nit will almost never happen.\n\nPlease open a separate pull request for each issue you want to address.\nDon't mix multiple changes. In particular, don't mix style cleanups with\nfeature pull requests. If you plan to make larger changes, please open\nan issue first or comment on the appropriate issue already existing so\nthat duplicate work can be avoided.\n\n### Using AI-assisted code generators\n\nPRs that include AI-generated content, may that be in code, in the PR\ndescription or in documentation need to\n\n1. clearly mark the AI-generated sections as such, for example, by\n   mentioning all use of AI in the PR description, and\n2. include proof that you have run the generated code on an actual\n   installation of Nominatim. Adding and excuting tests will not be\n   sufficient. You need to show that the code actually solves the problem\n   the PR claims to solve.\n\n\n## Coding style\n\nNominatim historically hasn't followed a particular coding style but we\nare in process of consolidating the style. The following rules apply:\n\n * Python code uses the official Python style\n * indentation\n   * SQL use 2 spaces\n   * all other file types use 4 spaces\n   * [BSD style](https://en.wikipedia.org/wiki/Indent_style#Allman_style) for braces\n * spaces\n   * spaces before and after equal signs and operators\n   * no trailing spaces\n   * no spaces after opening and before closing bracket\n   * leave out space between a function name and bracket\n     but add one between control statement(if, while, etc.) and bracket\n\nThe coding style is enforced with flake8. It can be tested with:\n\n```\nmake lint\n```\n\n## Testing\n\nBefore submitting a pull request make sure that the tests pass:\n\n```\n  make tests\n```\n\n## Releases\n\nNominatim follows semantic versioning. Major releases are done for large changes\nthat require (or at least strongly recommend) a reimport of the databases.\nMinor releases can usually be applied to existing databases. Patch releases\ncontain bug fixes only and are released from a separate branch where the\nrelevant changes are cherry-picked from the master branch.\n\nChecklist for releases:\n\n* [ ] increase versions in\n  * `src/nominatim_api/version.py`\n  * `src/nominatim_db/version.py`\n  * CMakeLists.txt\n* [ ] update `ChangeLog` (copy information from patch releases from release branch)\n* [ ] complete `docs/admin/Migration.md`\n* [ ] update EOL dates in `SECURITY.md`\n* [ ] commit and make sure CI tests pass\n* [ ] update OSMF production repo and release new version -post1 there\n* [ ] test migration\n  * download, build and import previous version\n  * migrate using master version\n  * run updates using master version\n* [ ] prepare tarball:\n  * `git clone https://github.com/osm-search/Nominatim` (switch to right branch!)\n  * `rm -r .git*`\n  * copy country data into `data/`\n  * add version to base directory and package\n* [ ] upload tarball to https://nominatim.org\n* [ ] prepare documentation\n  * check out new docs branch\n  * change git checkout instructions to tarball download instructions or adapt version on existing ones\n  * build documentation and copy to https://github.com/osm-search/nominatim-org-site\n  * add new version to history\n* [ ] check release tarball\n  * download tarball as per new documentation instructions\n  * compile and import Nominatim\n  * run `nominatim --version` to confirm correct version\n* [ ] tag new release and add a release on github.com\n* [ ] build pip packages and upload to pypi\n"
        },
        {
          "name": "COPYING",
          "type": "blob",
          "size": 33.861328125,
          "content": "GNU GENERAL PUBLIC LICENSE\nVersion 3, 29 June 2007\n\nCopyright © 2007 Free Software Foundation, Inc. <https://fsf.org/>\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThe GNU General Public License is a free, copyleft license for software and other kinds of works.\n\nThe licenses for most software and other practical works are designed to take away your freedom to share and change the works. By contrast, the GNU General Public License is intended to guarantee your freedom to share and change all versions of a program--to make sure it remains free software for all its users. We, the Free Software Foundation, use the GNU General Public License for most of our software; it applies also to any other work released this way by its authors. You can apply it to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for them if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you these rights or asking you to surrender the rights. Therefore, you have certain responsibilities if you distribute copies of the software, or if you modify it: responsibilities to respect the freedom of others.\n\nFor example, if you distribute copies of such a program, whether gratis or for a fee, you must pass on to the recipients the same freedoms that you received. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps: (1) assert copyright on the software, and (2) offer you this License giving you legal permission to copy, distribute and/or modify it.\n\nFor the developers' and authors' protection, the GPL clearly explains that there is no warranty for this free software. For both users' and authors' sake, the GPL requires that modified versions be marked as changed, so that their problems will not be attributed erroneously to authors of previous versions.\n\nSome devices are designed to deny users access to install or run modified versions of the software inside them, although the manufacturer can do so. This is fundamentally incompatible with the aim of protecting users' freedom to change the software. The systematic pattern of such abuse occurs in the area of products for individuals to use, which is precisely where it is most unacceptable. Therefore, we have designed this version of the GPL to prohibit the practice for those products. If such problems arise substantially in other domains, we stand ready to extend this provision to those domains in future versions of the GPL, as needed to protect the freedom of users.\n\nFinally, every program is threatened constantly by software patents. States should not allow patents to restrict development and use of software on general-purpose computers, but in those that do, we wish to avoid the special danger that patents applied to a free program could make it effectively proprietary. To prevent this, the GPL assures that patents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and modification follow.\n\nTERMS AND CONDITIONS\n\n0. Definitions.\n\n“This License” refers to version 3 of the GNU General Public License.\n\n“Copyright” also means copyright-like laws that apply to other kinds of works, such as semiconductor masks.\n\n“The Program” refers to any copyrightable work licensed under this License. Each licensee is addressed as “you”. “Licensees” and “recipients” may be individuals or organizations.\n\nTo “modify” a work means to copy from or adapt all or part of the work in a fashion requiring copyright permission, other than the making of an exact copy. The resulting work is called a “modified version” of the earlier work or a work “based on” the earlier work.\n\nA “covered work” means either the unmodified Program or a work based on the Program.\n\nTo “propagate” a work means to do anything with it that, without permission, would make you directly or secondarily liable for infringement under applicable copyright law, except executing it on a computer or modifying a private copy. Propagation includes copying, distribution (with or without modification), making available to the public, and in some countries other activities as well.\n\nTo “convey” a work means any kind of propagation that enables other parties to make or receive copies. Mere interaction with a user through a computer network, with no transfer of a copy, is not conveying.\n\nAn interactive user interface displays “Appropriate Legal Notices” to the extent that it includes a convenient and prominently visible feature that (1) displays an appropriate copyright notice, and (2) tells the user that there is no warranty for the work (except to the extent that warranties are provided), that licensees may convey the work under this License, and how to view a copy of this License. If the interface presents a list of user commands or options, such as a menu, a prominent item in the list meets this criterion.\n\n1. Source Code.\nThe “source code” for a work means the preferred form of the work for making modifications to it. “Object code” means any non-source form of a work.\n\nA “Standard Interface” means an interface that either is an official standard defined by a recognized standards body, or, in the case of interfaces specified for a particular programming language, one that is widely used among developers working in that language.\n\nThe “System Libraries” of an executable work include anything, other than the work as a whole, that (a) is included in the normal form of packaging a Major Component, but which is not part of that Major Component, and (b) serves only to enable use of the work with that Major Component, or to implement a Standard Interface for which an implementation is available to the public in source code form. A “Major Component”, in this context, means a major essential component (kernel, window system, and so on) of the specific operating system (if any) on which the executable work runs, or a compiler used to produce the work, or an object code interpreter used to run it.\n\nThe “Corresponding Source” for a work in object code form means all the source code needed to generate, install, and (for an executable work) run the object code and to modify the work, including scripts to control those activities. However, it does not include the work's System Libraries, or general-purpose tools or generally available free programs which are used unmodified in performing those activities but which are not part of the work. For example, Corresponding Source includes interface definition files associated with source files for the work, and the source code for shared libraries and dynamically linked subprograms that the work is specifically designed to require, such as by intimate data communication or control flow between those subprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users can regenerate automatically from other parts of the Corresponding Source.\n\nThe Corresponding Source for a work in source code form is that same work.\n\n2. Basic Permissions.\nAll rights granted under this License are granted for the term of copyright on the Program, and are irrevocable provided the stated conditions are met. This License explicitly affirms your unlimited permission to run the unmodified Program. The output from running a covered work is covered by this License only if the output, given its content, constitutes a covered work. This License acknowledges your rights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not convey, without conditions so long as your license otherwise remains in force. You may convey covered works to others for the sole purpose of having them make modifications exclusively for you, or provide you with facilities for running those works, provided that you comply with the terms of this License in conveying all material for which you do not control copyright. Those thus making or running the covered works for you must do so exclusively on your behalf, under your direction and control, on terms that prohibit them from making any copies of your copyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under the conditions stated below. Sublicensing is not allowed; section 10 makes it unnecessary.\n\n3. Protecting Users' Legal Rights From Anti-Circumvention Law.\nNo covered work shall be deemed part of an effective technological measure under any applicable law fulfilling obligations under article 11 of the WIPO copyright treaty adopted on 20 December 1996, or similar laws prohibiting or restricting circumvention of such measures.\n\nWhen you convey a covered work, you waive any legal power to forbid circumvention of technological measures to the extent such circumvention is effected by exercising rights under this License with respect to the covered work, and you disclaim any intention to limit operation or modification of the work as a means of enforcing, against the work's users, your or third parties' legal rights to forbid circumvention of technological measures.\n\n4. Conveying Verbatim Copies.\nYou may convey verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all notices stating that this License and any non-permissive terms added in accord with section 7 apply to the code; keep intact all notices of the absence of any warranty; and give all recipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey, and you may offer support or warranty protection for a fee.\n\n5. Conveying Modified Source Versions.\nYou may convey a work based on the Program, or the modifications to produce it from the Program, in the form of source code under the terms of section 4, provided that you also meet all of these conditions:\n\n     a) The work must carry prominent notices stating that you modified it, and giving a relevant date.\n\n     b) The work must carry prominent notices stating that it is released under this License and any conditions added under section 7. This requirement modifies the requirement in section 4 to “keep intact all notices”.\n\n     c) You must license the entire work, as a whole, under this License to anyone who comes into possession of a copy. This License will therefore apply, along with any applicable section 7 additional terms, to the whole of the work, and all its parts, regardless of how they are packaged. This License gives no permission to license the work in any other way, but it does not invalidate such permission if you have separately received it.\n\n     d) If the work has interactive user interfaces, each must display Appropriate Legal Notices; however, if the Program has interactive interfaces that do not display Appropriate Legal Notices, your work need not make them do so.\n\nA compilation of a covered work with other separate and independent works, which are not by their nature extensions of the covered work, and which are not combined with it such as to form a larger program, in or on a volume of a storage or distribution medium, is called an “aggregate” if the compilation and its resulting copyright are not used to limit the access or legal rights of the compilation's users beyond what the individual works permit. Inclusion of a covered work in an aggregate does not cause this License to apply to the other parts of the aggregate.\n\n6. Conveying Non-Source Forms.\nYou may convey a covered work in object code form under the terms of sections 4 and 5, provided that you also convey the machine-readable Corresponding Source under the terms of this License, in one of these ways:\n\n     a) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by the Corresponding Source fixed on a durable physical medium customarily used for software interchange.\n\n     b) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by a written offer, valid for at least three years and valid for as long as you offer spare parts or customer support for that product model, to give anyone who possesses the object code either (1) a copy of the Corresponding Source for all the software in the product that is covered by this License, on a durable physical medium customarily used for software interchange, for a price no more than your reasonable cost of physically performing this conveying of source, or (2) access to copy the Corresponding Source from a network server at no charge.\n\n     c) Convey individual copies of the object code with a copy of the written offer to provide the Corresponding Source. This alternative is allowed only occasionally and noncommercially, and only if you received the object code with such an offer, in accord with subsection 6b.\n\n     d) Convey the object code by offering access from a designated place (gratis or for a charge), and offer equivalent access to the Corresponding Source in the same way through the same place at no further charge. You need not require recipients to copy the Corresponding Source along with the object code. If the place to copy the object code is a network server, the Corresponding Source may be on a different server (operated by you or a third party) that supports equivalent copying facilities, provided you maintain clear directions next to the object code saying where to find the Corresponding Source. Regardless of what server hosts the Corresponding Source, you remain obligated to ensure that it is available for as long as needed to satisfy these requirements.\n\n     e) Convey the object code using peer-to-peer transmission, provided you inform other peers where the object code and Corresponding Source of the work are being offered to the general public at no charge under subsection 6d.\n\nA separable portion of the object code, whose source code is excluded from the Corresponding Source as a System Library, need not be included in conveying the object code work.\n\nA “User Product” is either (1) a “consumer product”, which means any tangible personal property which is normally used for personal, family, or household purposes, or (2) anything designed or sold for incorporation into a dwelling. In determining whether a product is a consumer product, doubtful cases shall be resolved in favor of coverage. For a particular product received by a particular user, “normally used” refers to a typical or common use of that class of product, regardless of the status of the particular user or of the way in which the particular user actually uses, or expects or is expected to use, the product. A product is a consumer product regardless of whether the product has substantial commercial, industrial or non-consumer uses, unless such uses represent the only significant mode of use of the product.\n\n“Installation Information” for a User Product means any methods, procedures, authorization keys, or other information required to install and execute modified versions of a covered work in that User Product from a modified version of its Corresponding Source. The information must suffice to ensure that the continued functioning of the modified object code is in no case prevented or interfered with solely because modification has been made.\n\nIf you convey an object code work under this section in, or with, or specifically for use in, a User Product, and the conveying occurs as part of a transaction in which the right of possession and use of the User Product is transferred to the recipient in perpetuity or for a fixed term (regardless of how the transaction is characterized), the Corresponding Source conveyed under this section must be accompanied by the Installation Information. But this requirement does not apply if neither you nor any third party retains the ability to install modified object code on the User Product (for example, the work has been installed in ROM).\n\nThe requirement to provide Installation Information does not include a requirement to continue to provide support service, warranty, or updates for a work that has been modified or installed by the recipient, or for the User Product in which it has been modified or installed. Access to a network may be denied when the modification itself materially and adversely affects the operation of the network or violates the rules and protocols for communication across the network.\n\nCorresponding Source conveyed, and Installation Information provided, in accord with this section must be in a format that is publicly documented (and with an implementation available to the public in source code form), and must require no special password or key for unpacking, reading or copying.\n\n7. Additional Terms.\n“Additional permissions” are terms that supplement the terms of this License by making exceptions from one or more of its conditions. Additional permissions that are applicable to the entire Program shall be treated as though they were included in this License, to the extent that they are valid under applicable law. If additional permissions apply only to part of the Program, that part may be used separately under those permissions, but the entire Program remains governed by this License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option remove any additional permissions from that copy, or from any part of it. (Additional permissions may be written to require their own removal in certain cases when you modify the work.) You may place additional permissions on material, added by you to a covered work, for which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you add to a covered work, you may (if authorized by the copyright holders of that material) supplement the terms of this License with terms:\n\n     a) Disclaiming warranty or limiting liability differently from the terms of sections 15 and 16 of this License; or\n\n     b) Requiring preservation of specified reasonable legal notices or author attributions in that material or in the Appropriate Legal Notices displayed by works containing it; or\n\n     c) Prohibiting misrepresentation of the origin of that material, or requiring that modified versions of such material be marked in reasonable ways as different from the original version; or\n\n     d) Limiting the use for publicity purposes of names of licensors or authors of the material; or\n\n     e) Declining to grant rights under trademark law for use of some trade names, trademarks, or service marks; or\n\n     f) Requiring indemnification of licensors and authors of that material by anyone who conveys the material (or modified versions of it) with contractual assumptions of liability to the recipient, for any liability that these contractual assumptions directly impose on those licensors and authors.\n\nAll other non-permissive additional terms are considered “further restrictions” within the meaning of section 10. If the Program as you received it, or any part of it, contains a notice stating that it is governed by this License along with a term that is a further restriction, you may remove that term. If a license document contains a further restriction but permits relicensing or conveying under this License, you may add to a covered work material governed by the terms of that license document, provided that the further restriction does not survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you must place, in the relevant source files, a statement of the additional terms that apply to those files, or a notice indicating where to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the form of a separately written license, or stated as exceptions; the above requirements apply either way.\n\n8. Termination.\nYou may not propagate or modify a covered work except as expressly provided under this License. Any attempt otherwise to propagate or modify it is void, and will automatically terminate your rights under this License (including any patent licenses granted under the third paragraph of section 11).\n\nHowever, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice.\n\nTermination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License. If your rights have been terminated and not permanently reinstated, you do not qualify to receive new licenses for the same material under section 10.\n\n9. Acceptance Not Required for Having Copies.\nYou are not required to accept this License in order to receive or run a copy of the Program. Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance. However, nothing other than this License grants you permission to propagate or modify any covered work. These actions infringe copyright if you do not accept this License. Therefore, by modifying or propagating a covered work, you indicate your acceptance of this License to do so.\n\n10. Automatic Licensing of Downstream Recipients.\nEach time you convey a covered work, the recipient automatically receives a license from the original licensors, to run, modify and propagate that work, subject to this License. You are not responsible for enforcing compliance by third parties with this License.\n\nAn “entity transaction” is a transaction transferring control of an organization, or substantially all assets of one, or subdividing an organization, or merging organizations. If propagation of a covered work results from an entity transaction, each party to that transaction who receives a copy of the work also receives whatever licenses to the work the party's predecessor in interest had or could give under the previous paragraph, plus a right to possession of the Corresponding Source of the work from the predecessor in interest, if the predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the rights granted or affirmed under this License. For example, you may not impose a license fee, royalty, or other charge for exercise of rights granted under this License, and you may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.\n\n11. Patents.\nA “contributor” is a copyright holder who authorizes use under this License of the Program or a work on which the Program is based. The work thus licensed is called the contributor's “contributor version”.\n\nA contributor's “essential patent claims” are all patent claims owned or controlled by the contributor, whether already acquired or hereafter acquired, that would be infringed by some manner, permitted by this License, of making, using, or selling its contributor version, but do not include claims that would be infringed only as a consequence of further modification of the contributor version. For purposes of this definition, “control” includes the right to grant patent sublicenses in a manner consistent with the requirements of this License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.\n\nIn the following three paragraphs, a “patent license” is any express agreement or commitment, however denominated, not to enforce a patent (such as an express permission to practice a patent or covenant not to sue for patent infringement). To “grant” such a patent license to a party means to make such an agreement or commitment not to enforce a patent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license, and the Corresponding Source of the work is not available for anyone to copy, free of charge and under the terms of this License, through a publicly available network server or other readily accessible means, then you must either (1) cause the Corresponding Source to be so available, or (2) arrange to deprive yourself of the benefit of the patent license for this particular work, or (3) arrange, in a manner consistent with the requirements of this License, to extend the patent license to downstream recipients. “Knowingly relying” means you have actual knowledge that, but for the patent license, your conveying the covered work in a country, or your recipient's use of the covered work in a country, would infringe one or more identifiable patents in that country that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or arrangement, you convey, or propagate by procuring conveyance of, a covered work, and grant a patent license to some of the parties receiving the covered work authorizing them to use, propagate, modify or convey a specific copy of the covered work, then the patent license you grant is automatically extended to all recipients of the covered work and works based on it.\n\nA patent license is “discriminatory” if it does not include within the scope of its coverage, prohibits the exercise of, or is conditioned on the non-exercise of one or more of the rights that are specifically granted under this License. You may not convey a covered work if you are a party to an arrangement with a third party that is in the business of distributing software, under which you make payment to the third party based on the extent of your activity of conveying the work, and under which the third party grants, to any of the parties who would receive the covered work from you, a discriminatory patent license (a) in connection with copies of the covered work conveyed by you (or copies made from those copies), or (b) primarily for and in connection with specific products or compilations that contain the covered work, unless you entered into that arrangement, or that patent license was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting any implied license or other defenses to infringement that may otherwise be available to you under applicable patent law.\n\n12. No Surrender of Others' Freedom.\nIf conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot convey a covered work so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not convey it at all. For example, if you agree to terms that obligate you to collect a royalty for further conveying from those to whom you convey the Program, the only way you could satisfy both those terms and this License would be to refrain entirely from conveying the Program.\n\n13. Use with the GNU Affero General Public License.\nNotwithstanding any other provision of this License, you have permission to link or combine any covered work with a work licensed under version 3 of the GNU Affero General Public License into a single combined work, and to convey the resulting work. The terms of this License will continue to apply to the part which is the covered work, but the special requirements of the GNU Affero General Public License, section 13, concerning interaction through a network will apply to the combination as such.\n\n14. Revised Versions of this License.\nThe Free Software Foundation may publish revised and/or new versions of the GNU General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program specifies that a certain numbered version of the GNU General Public License “or any later version” applies to it, you have the option of following the terms and conditions either of that numbered version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of the GNU General Public License, you may choose any version ever published by the Free Software Foundation.\n\nIf the Program specifies that a proxy can decide which future versions of the GNU General Public License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Program.\n\nLater license versions may give you additional or different permissions. However, no additional obligations are imposed on any author or copyright holder as a result of your choosing to follow a later version.\n\n15. Disclaimer of Warranty.\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n16. Limitation of Liability.\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n17. Interpretation of Sections 15 and 16.\nIf the disclaimer of warranty and limitation of liability provided above cannot be given local legal effect according to their terms, reviewing courts shall apply local law that most closely approximates an absolute waiver of all civil liability in connection with the Program, unless a warranty or assumption of liability accompanies a copy of the Program in return for a fee.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program. It is safest to attach them to the start of each source file to most effectively state the exclusion of warranty; and each file should have at least the “copyright” line and a pointer to where the full notice is found.\n\n     <one line to give the program's name and a brief idea of what it does.>\n     Copyright (C) <year>  <name of author>\n\n     This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\n     This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\n     You should have received a copy of the GNU General Public License along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program does terminal interaction, make it output a short notice like this when it starts in an interactive mode:\n\n     <program>  Copyright (C) <year>  <name of author>\n     This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n     This is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License. Of course, your program's commands might be different; for a GUI interface, you would use an “about box”.\n\nYou should also get your employer (if you work as a programmer) or school, if any, to sign a “copyright disclaimer” for the program, if necessary. For more information on this, and how to apply and follow the GNU GPL, see <https://www.gnu.org/licenses/>.\n\nThe GNU General Public License does not permit incorporating your program into proprietary programs. If your program is a subroutine library, you may consider it more useful to permit linking proprietary applications with the library. If this is what you want to do, use the GNU Lesser General Public License instead of this License. But first, please read <https://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "ChangeLog",
          "type": "blob",
          "size": 24.1728515625,
          "content": "4.5.0\n * allow building Nominatim as a pip package\n * make osm2pgsql building optional\n * switch importer to psycopg3\n * allow output format of web search to be customized in self-installations\n * look up potential postcode areas for postcode results\n * add word usage statistics for address terms\n * implement more light-weight CSV format for wiki importance tables\n * rewrite SQL for place search to use window functions\n * increase search radius when filtering by postcode\n * prefer POI points over POI areas\n * reintroduce full terms for address terms in search_name table\n * reindex postcodes when their parent is deleted\n * indexing: precompute counts of affected rows\n * ensure consistent country assignments for overlapping countries\n * make Nominatim[Async]API context manager to ensure proper calling of\n   close()\n * make usage of project dir optional for library\n * drop interpolations when no parent can be found\n * style tweaks to reflect OSM usage (man_made, highway and others)\n * deprecation of: bundled osm2pgsql, legacy tokenizer, PHP frontend\n * make documentation buildable without CMake\n * various fixes and improvements to documentation\n\n4.4.1\n * fix geocodejson output: admin level output should only print boundaries\n * updating: restrict invalidation of child objects on large street features\n * restrict valid interpolation house numbers to 0-999999\n * fix import error when SQLAlchemy 1.4 and psycopg3 are installed\n * various typo fixes in the documentation\n\n4.4.0\n * add export to SQLite database and SQLite support for the frontend\n * switch to Python frontend as the default frontend\n * update to osm2pgsql 1.11.0\n * add support for new osm2pgsql middle table format\n * simplify geometry for large polygon objects not used in addresses\n * various performance tweaks for search in Python frontend\n * fix regression in search with categories where it was confused with near\n   search\n * partially roll back use of SQLAlchemy lambda statements due to bugs\n   in SQLAlchemy\n * fix handling of timezones for timestamps from the database\n * fix handling of full address searches in connection with a viewbox\n * fix postcode computation of highway areas\n * fix handling of timeout errors for Python <= 3.10\n * fix address computation for postcode areas\n * fix variable shadowing in osm2pgsql flex script, causing bugs with LuaJIT\n * make sure extratags are always null when empty\n * reduce importance of places without wikipedia reference\n * improve performance of word count computations\n * drop support for wikipedia tags with full URLs\n * replace get_addressdata() SQL implementation with a Python function\n * improve display name for non-address features\n * fix postcode validation for postcodes with country code\n   (thanks @pawel-wroniszewski)\n * add possibility to run imports without superuser database rights\n   (thanks @robbe-haesendonck)\n * new CLI command for cleaning deleted relations (thanks @lujoh)\n * add check for database version in the CLI check command\n * updates to import styles ignoring more unused objects\n * various typo fixes (thanks @kumarUjjawal)\n\n4.3.2\n * fix potential SQL injection issue for 'nominatim admin --collect-os-info'\n * PHP frontend: fix on-the-fly lookup of postcode areas near boundaries\n * Python frontend: improve handling of viewbox\n * Python frontend: correct deployment instructions\n\n4.3.1\n * reintroduce result rematching\n * improve search of multi-part names\n * fix accidentally switched meaning of --reverse-only and --search-only in\n   warm command\n\n4.3.0\n * fix failing importance recalculation command\n * fix merging of linked names into unnamed boundaries\n * fix a number of corner cases with interpolation splitting resulting in\n   invalid geometries\n * fix failure in website generation when password contains curly brackets\n * fix broken use of ST_Project in PostGIS 3.4\n * new NOMINATIM_SEARCH_WITHIN_COUNTRIES setting to restrict reverse lookups\n   to known countries (thanks @alfmarcua)\n * allow negative OSM IDs (thanks @alfmarcua)\n * disallow import of Tiger data in a frozen DB\n * avoid UPDATE to change settings to be compatible with r/o DBs (thanks @t-tomek)\n * update bundled osm2pgsql to 1.9.2\n * reorganise osm2pgsql flex style and make it the default\n * exclude names ending in :wikipedia from indexing\n * no longer accept comma as a list separator in name tags\n * process forward dependencies on update to catch updates in geometries\n   of ways and relations\n * fix handling of isolated silent letters during transliteration\n * no longer assign postcodes to large linear features like rivers\n * introduce nominatim.paths module for finding data and libraries\n * documentation layout changed to material theme\n * new documentation section for library\n * various smaller fixes to existing documentation\n   (thanks @woodpeck, @bloom256, @biswajit-k)\n * updates to vagrant install scripts, drop support for Ubuntu 18\n   (thanks @n-timofeev)\n * removed obsolete configuration variables from env.defaults\n * add script for generating a taginfo description (thanks @biswajit-k)\n * modernize Python code around BDD test and add testing of Python frontend\n * lots of new BDD tests for API output\n\n4.2.3\n\n * fix deletion handling for 'nominatim add-data'\n * adapt place_force_delete() to new deletion handling\n * flex style: avoid dropping of postcode areas\n * fix update errors on address interpolation handling\n\n4.2.2\n\n * extend flex-style library to fully support all default styles\n * fix handling of Hebrew aleph\n * do not assign postcodes to rivers\n * fix string matching in PHP code\n * update osm2pgsql (various updates to flex)\n * fix slow query when deleting places on update\n * fix CLI details query\n * fix recalculation of importance values\n * fix polygon simplification in reverse results\n * add class/type information to reverse geocodejson result\n * minor improvements to default tokenizer configuration\n * various smaller fixes to documentation\n\n4.2.1\n\n * fix XSS vulnerability in debug view\n\n4.2.0\n\n * add experimental support for osm2pgsql flex style\n * introduce secondary importance value to be retrieved from a raster data file\n   (currently still unused, to replace address importance, thanks to @tareqpi)\n * add new report tool `nominatim admin --collect-os-info`\n   (thanks @micahcochran, @tareqpi)\n * reorganise index to improve lookup performance and size\n * run index creation after import in parallel\n * run ANALYZE more selectively to speed up continuation of indexing\n * fix crash on update when addr:interpolation receives an illegal value\n * fix minimum number of retrieved results to be at least 10\n * fix search for combinations of special term + name (e.g Hotel Bellevue)\n * do not return interpolations without a parent street on reverse search\n * improve invalidation of linked places on updates\n * fix address parsing for interpolation lines\n * make sure socket timeouts are respected during replication\n   (working around a bug in some versions of pyosmium)\n * update bundled osm2pgsql to 1.7.1\n * add support for PostgreSQL 15\n * typing fixes to work with latest type annotations from typeshed\n * smaller improvements to documentation (thanks to @mausch)\n\n4.1.1\n\n * fix XSS vulnerability in debug view\n\n4.1.0\n\n * switch to ICU tokenizer as default\n * add housenumber normalization and support optional spaces during search\n * add postcode format checking and support optional spaces during search\n * add function for cleaning housenumbers in word table\n * add updates/deletion of country names imported from OSM\n * linked places no longer overwrite names from a place permanently\n * move default country name configuration into yaml file (thanks @tareqpi)\n * more compact layout for interpolation and TIGER tables\n * introduce mutations to ICU tokenizer (used for German umlauts)\n * support reinitializing a full project directory with refresh --website\n * fix various issues with linked places on updates\n * add support for external sanitizers and token analyzers\n * add CLI commands for forced indexing\n * add CLI command for version report\n * add offline import mode\n * change geocodejson to return a feature class in the 'type' field\n * add ISO3166-2 to address output (thanks @I70l0teN4ik)\n * improve parsing and matching of addr: tags\n * support relations as street members of associatedStreet\n * better ranking for address results from TIGER data\n * adapt rank classification to changed tag usage in OSM\n * update bundled osm2pgsql to 1.6.0\n * add typing information to Python code\n * improve unit test coverage\n * reorganise and speed up code for BDD tests, drop support for scenes\n * move PHP unit tests to PHP 9.5\n * extensive typo fixes in documentation (thanks @woodpeck,@StephanGeorg,\n   @amandasaurus, @nslxndr, @stefkiourk, @Luflosi, @kianmeng)\n * drop official support for installation on CentOS\n * add installation instructions for Ubuntu 22.04\n * add support for PHP8\n * add setup instructions for updates and systemd\n * drop support for PostgreSQL 9.5\n\n4.0.2\n\n * fix XSS vulnerability in debug view\n\n4.0.1\n\n * fix initialisation error in replication script\n * ICU tokenizer: avoid any special characters in word tokens\n * better error message when API php script does not exist\n * fix quoting of house numbers in SQL queries\n * small fixes and improvements in search query parsing\n * add documentation for moving the database to a different machine\n\n4.0.0\n\n * refactor name token computation and introduce ICU tokenizer\n   * name processing now happens in the indexer outside the DB\n   * reorganizes abbreviation handling and moves it to the indexing phases\n   * adds preprocessing of names\n * add country-specific ranking for Spain, Slovakia\n * partially switch to using SP-GIST indexes\n * better updating of dependent addresses for name changes in streets\n * remove unused/broken tables for external housenumbers\n * move external postcodes to CSV format and no longer save them in tables\n   (adds support for postcodes for arbitrary countries)\n * remove postcode helper entries from placex (thanks @AntoJvlt)\n * change required format for TIGER data to CSV\n * move configuration of default languages from wiki into config file\n * expect customized configuration files in project directory by default\n * disable search API for reverse-only import (thanks @darkshredder)\n * port most of maintenance/import code to Python and remove PHP utils\n * add catch-up mode for replication\n * add updating of special phrases (thanks @AntoJvlt)\n * add support for special phrases in CSV files (thanks @AntoJvlt)\n * switch to case-independent matching between place and boundary names\n * remove disabling of reverse query parsing\n * minor tweaks to search algorithm to avoid more false positives\n * major overhaul of the administrator and developer documentation\n * add security disclosure policy\n * add testing of installation scripts via CI\n * drop support for Python < 3.6 and Postgresql < 9.5\n\n3.7.3\n\n * fix XSS vulnerability in debug view\n\n3.7.2\n\n * fix database check for reverse-only imports\n * do not error out in status API result when import date is missing\n * add array_key_last function for PHP < 7.3 (thanks to @woodpeck)\n * fix more url when server name is unknown (thanks to @mogita)\n * commit changes to replication log table\n\n3.7.1\n\n * fix smaller issues with special phrases import (thanks @AntoJvlt)\n * add index to speed up continued indexing during import\n * fix index on location_property_tiger(parent_place_id) (thanks @changpingc)\n * make sure Python code is backward-compatible with Python 3.5\n * various documentation fixes\n\n3.7.0\n\n * switch to dotenv for configuration file\n * introduce 'make install' (reorganising most of the code)\n * introduce nominatim tool as replacement for various php scripts\n * introduce project directories and allow multiple installations from same build\n * clean up BDD tests: drop nose, reorganise step code\n * simplify test database for API BDD tests and autoinstall database\n * port most of the code for command-line tools to Python\n   (thanks to @darkshredder and @AntoJvlt)\n * add tests for all tooling\n * replace pyosmium-get-changes with custom internal implementation using\n   pyosmium\n * improve search for queries with housenumber and partial terms\n * add database versioning\n * use jinja2 for preprocessing SQL files\n * introduce automatic migrations\n * reverse fix preference of interpolations over housenumbers\n * parallelize indexing of postcodes\n * add non-key indexes to speed up housenumber + street searches\n * switch housenumber field in placex to save transliterated names\n\n3.6.0\n\n * add full support for searching by and displaying of addr:* tags\n * improve address output for large-area objects\n * better use of country names from OSM data for search and display\n * better debug output for reverse call\n * add support for addr:place links without an place equivalent in OSM\n * improve finding postcodes with normalisation artefacts\n * batch object to index for rank 30, avoiding a wrap-around of transaction\n   IDs in PostgreSQL\n * introduce dynamic address rank computation for administrative boundaries\n   depending on linked objects and their place in the admin level hierarchy\n * add country-specific address ranking for Indonesia, Russia, Belgium and\n   the Netherlands (thanks @hendrikmoree)\n * make sure wikidata/wikipedia tags are imported for all styles\n * make POIs searchable by name and housenumber (thanks @joy-yyd)\n * reverse geocoding now ignores places without an address rank (rivers etc.)\n * installation of a webserver is no longer mandatory, for development\n   use the php internal webserver via 'make serve\n * reduce the influence of place nodes in addresses\n * drop support for the unspecific is_in tag\n * various minor tweaks to supplied styles\n * move HTML web frontend into its own project\n * move scripts for processing external data sources into separate directories\n * introduce separate configuration for website (thanks @krahulreddy)\n * update documentation, in particular, clean up development docs\n * update osm2pgsql to 1.4.0\n\n3.5.2\n\n * ensure that wikipedia tags are imported for all styles\n * reinstate verbosity for indexing during updates\n * make house number reappear in display name on named POIs\n * introduce batch processing in indexer to avoid transaction ID overrun\n * increase splitting for large geometries to improve indexing speed\n * remove deprecated get_magic_quotes_gpc() function\n * make sure that all postcodes have an entry in word and are thus searchable\n * remove use of ST_Covers in conjunction with ST_Intersects,\n   causes bad query planning and slow updates in Postgis3\n * update osm2pgsql\n\n3.5.1\n\n * disable jit and parallel processing in PostgreSQL for osm2pgsql\n * update libosmium to 2.15.6 (fixes an issue with processing hanging\n   on large multipolygons)\n\n3.5.0\n\n * structured select on HTML search page\n * new PHP Nominatim\\Shell class to wrap shell escaping\n * remove polygon parameter from all API calls\n * improve handling of postcode areas\n * reorganise place linking algorithm, now using wikidata tag as well\n * remove linkees from search_name and larger_area tables\n * introduce country-specific address ranks\n * reorganise rank address computation\n * cleanup of partition function\n * improve parenting for large POIs\n * add support for Postgresql 12 and Postgis 3\n * add earlier cleanup when --drop is given, to reduce memory usage\n * remove use of place_id in URLs\n * replace C nominatim indexer with a simpler Python implementation\n * split up the huge sql/functions.sql file\n * move osm2pgsql tests to osm2pgsql\n * add new extratags style which imports all tags from OSM\n * add new script for checking the import after completion\n * update osm2pgsql, reducing memory usage\n * use new wikipedia importance and add processing of wikidata tags\n * add search form for details page\n * use ExtraDataPath for country_grid table\n * remove short_name from list of names to be displayed\n * split up CMakeFile, so that all parts can be built separately\n * update installation instructions for CentOS and Ubuntu\n * add script for importing/updating multiple country extracts\n * various documentation improvements\n\n3.4.2\n\n * fix security bug in /details endpoint where user input was not\n   properly sanitized\n\n3.4.1\n\n * update osm2pgsql to fix hans during updates and lost address numbers\n   during updates\n\n3.4.0\n\n * increase required version for PostgreSQL(9.3), PostGIS(2.2) and PHP(7.0)\n * better error reporting for out-of-memory errors\n * exclude postcode ranges separated by colon from centre point calculation\n * update osm2pgsql, better handling of imports without flatnode file\n * switch to more efficient algorithm for word set computation\n * use only boundaries for country and state parts of addresses\n * improve updates of addresses with housenumbers and interpolations\n * remove country from place_addressline table and use country_code instead\n * optimise indexes on search_name partition tables\n * improve searching of attached streets for large objects like airports\n * drop support for python 2\n * new scripts for importing Wikidata for importance\n * create and drop indexes concurrently to not clash with auto vacuum\n * various documentation improvements\n\n\n3.3.0\n\n * zoom 17 in reverse now zooms in on minor streets\n * fix use of postcode relations in address\n * support for housenumber 0 on interpolations\n * replace database abstraction DB with PDO and switch to using exceptions\n * exclude line features at rank 30 from reverse geocoding\n * remove self-reference and country from place_addressline\n * make json output more readable (less escaping)\n * update conversion scripts for postcodes\n * scripts in utils/ are no longer executable (always use scripts in build dir)\n * remove Natural Earth country fallback (OSM is complete enough)\n * make rank assignments configurable\n * allow accept languages with underscore\n * new reverse-only import mode (without search index table)\n * rely on boundaries only for states and countries\n * update osm2pgsql, now using a configurable style\n * provide multiple import styles\n * improve search when house number and postcodes are dropped\n * overhaul of setup code\n * add support for PHPUnit 6\n * update test database\n * various documentation improvements\n\n3.2.0\n\n * complete rewrite of reverse search algorithm\n * add new geojson and geocodejson output formats\n * add simple export script to export addresses to CSV\n * remove is_in terms from address computation\n * remove unused search_name_country tables\n * various smaller fixes to query parsing\n * convert Tokens and token types to class types\n * correctly handle update when boundary object type is changed\n * improve debug output for /search endpoint\n * update to latest osm2pgsql and leaflet.js\n * overhaul of /details endpoint:\n     * new class parameter when using osmtype/osmid parameters\n     * permalink to instance-independent osmtype/osmid parameter format\n     * new json output format\n * update CentOS vagrant machine to use SELinux\n * add vagrant scripts for Ubuntu 18.04\n * fix build process for BSD\n * enable running the database on a different host than the setup scripts\n * allow to configure use of custom PHP binaries (PHP_BIN)\n * extensive coding style improvements to PHP code\n * more PHP unit tests for new classes\n * increase coverage for API tests\n * add documentation for API\n\n3.1.0\n\n * rework postcode handling and introduce location_postcode table\n * make setup less verbose and print a summary in the end\n * setup: error out when web site user does not exist\n * add more API tests to complete code coverage\n * reinstate key-value amenity search (special term [key=value])\n * fix detection of coordinates in query\n * various smaller tweaks to ranking of search interpretations\n * complete overhaul of PHP frontend code using OOP\n * add address rank to details page\n * update Tiger scripts for 2017 data and clean up unused code\n * various bug fixes and improvements to UI\n * improve reverse geocoding performance close to coasts\n * more PHP style cleanup (quoting)\n * allow unnamed road in reverse geocoding to avoid too far off results\n * add function to recalculate counts for full-word search term\n * add function to check if new updates are available\n * update documentation and switch to mkdocs for generating HTML\n\n3.0.1\n\n * fix bug in geometry building algorithm in osm2pgsql\n * fix typos in build instructions\n\n3.0.0\n\n * move to cmake build system\n * various fixes to HTML output\n * reverse endpoint now can return geometries\n * add support for PHP7\n * move to on-the-fly computation of interpolations\n * improve handling of linked places (updating)\n * improve test framework:\n    * replace lettuce with behave\n    * use smaller database for API tests\n * drop support for postgres < 9.1, postgis < 2.0 and PHP < 5.4\n * make external data use optional (useful for imports without US)\n * detect postgres and postgis versions automatically\n * clean up query logging and remove unused tables\n * move installation documentation into this repo\n * add self-documenting vagrant scripts\n * remove --create-website, recommend to use website directory in build\n * add accessor functions for URL parameters and improve error checking\n * remove IP blocking and rate-limiting code\n * enable CI via travis\n * reformatting for more consistent coding style\n * make country search term creation part of setup\n * update country names and country grid\n * handle roads that cross boundaries better\n * keep full information on address tags\n * update to refactored osm2pgsql which use libosmium based types\n * switch from osmosis to pyosmium for updates\n * be more strict when matching against special search terms\n * handle postcode entries with multiple values correctly\n\n2.5\n\n * reverse geocoding includes looking up housenumbers from Tiger data\n * added parameter to return simplified geometries\n * new lookup call for getting address information for OSM objects\n * new namedetails and extratags parameters that expose the name and extratags\n   fields of the placex table\n * mobile website\n * reverse web view\n\n2.4\n\n * drop support for postgres 8.4\n * rewrite address interpolation\n * switch to C++ version of osm2pgsql and rewrite tag filtering\n * support for bridge:name and tunnel:name, man_made, junction\n * drop way-node index (reduces database size by about 15%)\n * add support for configuring tablespaces and webserver user\n * better evaluation of search queries in right-to-left notation\n * improve house number search for streets with many duplicate entries\n * code cleanup (remove unused functions and tables)\n\n2.3\n\n * further improve ordering of results\n * support for more lat/lon formats in search-as-reverse\n * fix handling of GB postcodes\n * new functional test suite\n * support for waterway relations\n * inherit postcodes from street to poi\n * fix housenumber normalisation to find non-latin house numbers\n * take viewbox into account for ordering of results\n * pois may now inherit address tags from surrounding buildings\n * improve what objects may participate in an address\n * clean up handled class/type combinations to current OSM usage\n * lots of bug fixes\n\n2.2\n\n * correct database rights for www-data\n * add timestamps for update output\n * load postgis via extension for postgis >= 2.0\n * remove non-admin boundaries from addresses\n * further improve ordering of results with same importance\n * merge addr:postcode tags into object addresses\n * include rank and importance in reverse geocode output\n * replace ST_Line_Interpolate_Point with ST_LineInterpolatePoint\n  (for postgis >= 2.1)\n * update osm2pgsql to latest version\n * properly detect changes of admin_level\n * remove landuses when name is removed\n * smaller fixes\n\n2.1\n\n * update to openlayers 2.12 (now custom built)\n * update fallback OSM boundaries\n * add support for postgresql 9.2/9.3 and postgis 2.x\n * add structured queries\n * add options for polygon output in various formats\n   (geojson, svg, kml, postgis text)\n * maintenance functions for deleting objects and updating regions\n   (plcae_force_update/place_force_delete)\n * web view for polygons that need deleting\n * rate limiting using memcache\n * improve layout of details page\n * add support for boundary:postal_code\n * full CORS support\n * improve parenting of POIs\n * support for extract daily diffs from Geofabrik\n * support for addresses without a street\n   (addr:place and conscription number house numbers)\n * improve layout of word and search_name_* tables\n * support for US ZIP+4 codes\n * refactoring of front-end PHP code\n * lots of smaller bug fixes\n\n2.0.1\n\n * delete outdated entries from location_area_country\n * remove remaining uses of INTEGER, to allow node ids larger than 2^31\n"
        },
        {
          "name": "LICENSES",
          "type": "tree",
          "content": null
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 0.7822265625,
          "content": "all:\n\n# Building of wheels\n\nbuild: clean-build build-db build-api\n\nclean-build:\n\trm -f dist/*\n\nbuild-db:\n\tpython3 -m build packaging/nominatim-db --outdir dist/\n\nbuild-api:\n\tpython3 -m build packaging/nominatim-api --outdir dist/\n\n# Tests\n\ntests: mypy lint pytest bdd\n\nmypy:\n\tmypy --strict --python-version 3.8 src\n\npytest:\n\tpytest test/python\n\nlint:\n\tflake8 src\n\nbdd:\n\tcd test/bdd; behave -DREMOVE_TEMPLATE=1\n\n# Documentation\n\ndoc:\n\tmkdocs build\n\nserve-doc:\n\tmkdocs serve\n\nmanpage:\n\targparse-manpage --pyfile man/create-manpage.py --function get_parser --project-name Nominatim --url https://nominatim.org  > man/nominatim.1 --author 'the Nominatim developer community' --author-email info@nominatim.org\n\n\n.PHONY: tests mypy pytest lint bdd build clean-build build-db build-api doc serve-doc manpage\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.796875,
          "content": "[![Build Status](https://github.com/osm-search/Nominatim/workflows/CI%20Tests/badge.svg)](https://github.com/osm-search/Nominatim/actions?query=workflow%3A%22CI+Tests%22)\n\nNominatim\n=========\n\nNominatim (from the Latin, 'by name') is a tool to search OpenStreetMap data\nby name and address (geocoding) and to generate synthetic addresses of\nOSM points (reverse geocoding). An instance with up-to-date data can be found\nat https://nominatim.openstreetmap.org. Nominatim is also used as one of the\nsources for the Search box on the OpenStreetMap home page.\n\nDocumentation\n=============\n\nThe documentation of the latest development version is in the\n`docs/` subdirectory. A HTML version can be found at\nhttps://nominatim.org/release-docs/develop/ .\n\nInstallation\n============\n\nThe latest stable release can be downloaded from https://nominatim.org.\nThere you can also find [installation instructions for the release](https://nominatim.org/release-docs/latest/admin/Installation), as well as an extensive [Troubleshooting/FAQ section](https://nominatim.org/release-docs/latest/admin/Faq/).\n\n[Detailed installation instructions for current master](https://nominatim.org/release-docs/develop/admin/Installation)\ncan be found at nominatim.org as well.\n\nA quick summary of the necessary steps:\n\n1. Create a Python virtualenv and install the packages:\n\n        python3 -m venv nominatim-venv\n        ./nominatim-venv/bin/pip install packaging/nominatim-{api,db}\n\n2. Create a project directory, get OSM data and import:\n\n        mkdir nominatim-project\n        cd nominatim-project\n        ../nominatim-venv/bin/nominatim import --osm-file <your planet file>\n\n3. Start the webserver:\n\n        ./nominatim-venv/bin/pip install uvicorn falcon\n        ../nominatim-venv/bin/nominatim serve\n\n\nLicense\n=======\n\nThe Python source code is available under a GPL license version 3 or later.\nThe Lua configuration files for osm2pgsql are released under the\nApache License, Version 2.0. All other files are under a GPLv2 license.\n\n\nContributing\n============\n\nContributions, bug reports and pull requests are welcome. When reporting a\nbug, please use one of the\n[issue templates](https://github.com/osm-search/Nominatim/issues/new/choose)\nand make sure to provide all the information requested. If you are not\nsure if you have really found a bug, please ask for help in the forums\nfirst (see 'Questions' below).\n\nFor details on contributing, have a look at the\n[contribution guide](CONTRIBUTING.md).\n\n\nQuestions and help\n==================\n\nIf you have questions about search results and the OpenStreetMap data\nused in the search, use the [OSM Forum](https://community.openstreetmap.org/).\n\nFor questions, community help and discussions around the software and\nyour own installation of Nominatim, use the\n[Github discussions forum](https://github.com/osm-search/Nominatim/discussions).\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.7919921875,
          "content": "# Security Policy\n\n## Supported Versions\n\nAll Nominatim releases receive security updates for two years.\n\nThe following table lists the end of support for all currently supported\nversions.\n\n| Version | End of support for security updates |\n| ------- | ----------------------------------- |\n| 4.5.x   | 2026-09-12                          |\n| 4.4.x   | 2026-03-07                          |\n| 4.3.x   | 2025-09-07                          |\n| 4.2.x   | 2024-11-24                          |\n\n## Reporting a Vulnerability\n\nIf you believe, you have found an issue in Nominatim that has implications on\nsecurity, please send a description of the issue to **security@nominatim.org**.\nYou will receive an acknowledgement of your mail within 3 work days where we\nalso notify you of the next steps.\n\n## How we Disclose Security Issues\n\n** The following section only applies to security issues found in released\nversions. Issues that concern the master development branch only will be\nfixed immediately on the branch with the corresponding PR containing the\ndescription of the nature and severity of the issue. **\n\nPatches for identified security issues are applied to all affected versions and\nnew minor versions are released. At the same time we release a statement at\nthe [Nominatim blog](https://nominatim.org/blog/) describing the nature of the\nincident. Announcements will also be published at the\n[geocoding mailinglist](https://lists.openstreetmap.org/listinfo/geocoding).\n\n## List of Previous Incidents\n\n* 2023-11-20 - [SQL injection vulnerability](https://nominatim.org/2023/11/20/release-432.html)\n* 2023-02-21 - [cross-site scripting vulnerability](https://nominatim.org/2023/02/21/release-421.html)\n* 2020-05-04 - [SQL injection issue on /details endpoint](https://lists.openstreetmap.org/pipermail/geocoding/2020-May/002012.html)\n"
        },
        {
          "name": "VAGRANT.md",
          "type": "blob",
          "size": 4.6142578125,
          "content": "# Install Nominatim in a virtual machine for development and testing\n\nThis document describes how you can install Nominatim inside a Ubuntu 24\nvirtual machine on your desktop/laptop (host machine). The goal is to give\nyou a development environment to easily edit code and run the test suite\nwithout affecting the rest of your system. \n\nThe installation can run largely unsupervised. You should expect 1h from\nstart to finish depending on how fast your computer and download speed\nis.\n\n## Prerequisites\n\n1. [Virtualbox](https://www.virtualbox.org/wiki/Downloads)\n\n2. [Vagrant](https://www.vagrantup.com/downloads.html)\n\n3. Nominatim\n\n        git clone https://github.com/openstreetmap/Nominatim.git\n\n## Installation\n\n1. Start the virtual machine\n\n        vagrant up ubuntu24-nginx\n\n2. Log into the virtual machine\n\n        vagrant ssh ubuntu24-nginx\n\n3. Import a small country (Monaco)\n\n    See the FAQ how to skip this step and point Nominatim to an existing database.\n\n      ```\n      # inside the virtual machine:\n      cd nominatim-project\n      wget --no-verbose --output-document=monaco.osm.pbf http://download.geofabrik.de/europe/monaco-latest.osm.pbf\n      nominatim import --osm-file monaco.osm.pbf 2>&1 | tee monaco.$$.log\n      ```\n\n    To repeat an import you'd need to delete the database first\n\n        dropdb --if-exists nominatim\n\n\n\n## Development\n\nVagrant maps the virtual machine's port 8089 to your host machine. Thus you can\nsee Nominatim in action on [localhost:8089](http://localhost:8089/nominatim/).\n\nYou edit code on your host machine in any editor you like. There is no need to\nrestart any software: just refresh your browser window.\n\nUse the functions of the `log()` object to create temporary debug output.\nAdd `&debug=1` to the URL to see the output.\n\nIn the Python BDD test you can use `logger.info()` for temporary debug\nstatements.\n\nFor more information on running tests, see\nhttps://nominatim.org/release-docs/develop/develop/Testing/\n\n\n## FAQ\n\n##### Will it run on Windows?\n\nYes, Vagrant and Virtualbox can be installed on MS Windows just fine. You need\na 64bit version of Windows.\n\n##### Will it run on Apple Silicon?\n\nYou might need to replace Virtualbox with [Parallels](https://www.parallels.com/products/desktop/).\nThere is no free/open source version of Parallels.\n\n##### Why Monaco, can I use another country?\n\nOf course! The Monaco import takes less than 10 minutes and works with 2GB RAM.\n\n##### Will the results be the same as those from nominatim.openstreetmap.org?\n\nNo. Long-running Nominatim installations will differ once new import features (or\nbug fixes) get added since those usually only get applied to new/changed data.\n\nAlso this document skips the optional Wikipedia data import which affects ranking\nof search results. See [Nominatim installation](https://nominatim.org/release-docs/latest/admin/Installation)\nfor details.\n\n##### Why Ubuntu? Can I test CentOS/Fedora/CoreOS/FreeBSD?\n\nThere used to be a Vagrant script for CentOS available, but the Nominatim directory\nisn't symlinked/mounted to the host which makes development trickier. We used\nit mainly for debugging installation with SELinux.\n\nIn general Nominatim will run in the other environments. The installation steps\nare slightly different, e.g. the name of the package manager, Apache2 package\nname, location of files. We chose Ubuntu because that is closest to the\nnominatim.openstreetmap.org production environment.\n\nYou can configure/download other Vagrant boxes from\n[https://app.vagrantup.com/boxes/search](https://app.vagrantup.com/boxes/search).\n\n##### How can I connect to an existing database?\n\nLet's say you have a Postgres database named `nominatim_it` on server `your-server.com`\nand port `5432`. The Postgres username is `postgres`. You can edit the `.env` in your\nproject directory and point Nominatim to it.\n\n    NOMINATIM_DATABASE_DSN=\"pgsql:host=your-server.com;port=5432;user=postgres;dbname=nominatim_it\n\nNo data import or restarting necessary.\n\nIf the Postgres installation is behind a firewall, you can try\n\n    ssh -L 9999:localhost:5432 your-username@your-server.com\n\ninside the virtual machine. It will map the port to `localhost:9999` and then\nyou edit `.env` file with\n\n    NOMINATIM_DATABASE_DSN=\"pgsql:host=localhost;port=9999;user=postgres;dbname=nominatim_it\"\n\nTo access postgres directly remember to specify the hostname,\ne.g. `psql --host localhost --port 9999 nominatim_it`\n\n\n##### My computer is slow and the import takes too long. Can I start the virtual machine \"in the cloud\"?\n\nYes. It's possible to start the virtual machine on [Amazon AWS (plugin)](https://github.com/mitchellh/vagrant-aws)\nor [DigitalOcean (plugin)](https://github.com/smdahlen/vagrant-digitalocean).\n"
        },
        {
          "name": "Vagrantfile",
          "type": "blob",
          "size": 3.1943359375,
          "content": "# -*- mode: ruby -*-\n# vi: set ft=ruby :\n\nVagrant.configure(\"2\") do |config|\n  # Apache webserver\n  config.vm.network \"forwarded_port\", guest: 80, host: 8089\n  config.vm.network \"forwarded_port\", guest: 8088, host: 8088\n\n  # If true, then any SSH connections made will enable agent forwarding.\n  config.ssh.forward_agent = true\n\n  # Never sync the current directory to /vagrant.\n  config.vm.synced_folder \".\", \"/vagrant\", disabled: true\n\n  checkout = \"yes\"\n  if ENV['CHECKOUT'] != 'y' then\n    checkout = \"no\"\n  end\n\n  config.vm.provider \"hyperv\" do |hv, override|\n    hv.memory = 2048\n    hv.linked_clone = true\n    if ENV['CHECKOUT'] != 'y' then\n      override.vm.synced_folder \".\", \"/home/vagrant/Nominatim\", type: \"smb\", smb_host: ENV['SMB_HOST'] || ENV['COMPUTERNAME']\n    end\n  end\n\n  config.vm.provider \"virtualbox\" do |vb, override|\n    vb.gui = false\n    vb.memory = 2048\n    vb.customize [\"setextradata\", :id, \"VBoxInternal2/SharedFoldersEnableSymlinksCreate//vagrant\",\"0\"]\n    if ENV['CHECKOUT'] != 'y' then\n      override.vm.synced_folder \".\", \"/home/vagrant/Nominatim\"\n    end\n  end\n\n  config.vm.provider \"parallels\" do |prl, override|\n    prl.update_guest_tools = false\n    prl.memory = 2048\n    if ENV['CHECKOUT'] != 'y' then\n      override.vm.synced_folder \".\", \"/home/vagrant/Nominatim\"\n    end\n  end\n\n  config.vm.provider \"libvirt\" do |lv, override|\n    lv.memory = 2048\n    lv.nested = true\n    if ENV['CHECKOUT'] != 'y' then\n      override.vm.synced_folder \".\", \"/home/vagrant/Nominatim\", type: 'nfs', nfs_udp: false\n    end\n  end\n\n  config.vm.define \"ubuntu22\", primary: true do |sub|\n      sub.vm.box = \"generic/ubuntu2204\"\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-22.sh\"\n        s.privileged = false\n        s.args = [checkout]\n      end\n  end\n\n  config.vm.define \"ubuntu22-apache\" do |sub|\n      sub.vm.box = \"generic/ubuntu2204\"\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-22.sh\"\n        s.privileged = false\n        s.args = [checkout, \"install-apache\"]\n      end\n  end\n\n  config.vm.define \"ubuntu22-nginx\" do |sub|\n      sub.vm.box = \"generic/ubuntu2204\"\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-22.sh\"\n        s.privileged = false\n        s.args = [checkout, \"install-nginx\"]\n      end\n  end\n\n  config.vm.define \"ubuntu24\" do |sub|\n      sub.vm.box = \"bento/ubuntu-24.04\"\n      if RUBY_PLATFORM.include?('darwin') && RUBY_PLATFORM.include?('arm64')\n        # Apple M processor\n        sub.vm.box = 'gutehall/ubuntu24-04'\n      end\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-24.sh\"\n        s.privileged = false\n        s.args = [checkout]\n      end\n  end\n\n  config.vm.define \"ubuntu24-apache\" do |sub|\n      sub.vm.box = \"bento/ubuntu-24.04\"\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-24.sh\"\n        s.privileged = false\n        s.args = [checkout, \"install-apache\"]\n      end\n  end\n\n  config.vm.define \"ubuntu24-nginx\" do |sub|\n      sub.vm.box = \"bento/ubuntu-24.04\"\n      sub.vm.provision :shell do |s|\n        s.path = \"vagrant/Install-on-Ubuntu-24.sh\"\n        s.privileged = false\n        s.args = [checkout, \"install-nginx\"]\n      end\n  end\nend\n"
        },
        {
          "name": "data",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib-lua",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib-sql",
          "type": "tree",
          "content": null
        },
        {
          "name": "man",
          "type": "tree",
          "content": null
        },
        {
          "name": "mkdocs.yml",
          "type": "blob",
          "size": 3.431640625,
          "content": "site_name: Nominatim Manual\ntheme:\n  font: false\n  name: material\n  features:\n    - navigation.tabs\n    - toc.integrate\n  plugins:\n    - privacy\ncopyright: Copyright &copy; Nominatim developer community\ndocs_dir: docs\nsite_url: https://nominatim.org\nrepo_url: https://github.com/openstreetmap/Nominatim\nnav:\n    - 'Introduction' : 'index.md'\n    - 'API Reference':\n        - 'Overview': 'api/Overview.md'\n        - 'Search': 'api/Search.md'\n        - 'Reverse': 'api/Reverse.md'\n        - 'Address Lookup': 'api/Lookup.md'\n        - 'Details' : 'api/Details.md'\n        - 'Status' : 'api/Status.md'\n        - 'Place Output Formats': 'api/Output.md'\n        - 'FAQ': 'api/Faq.md'\n    - 'Administration Guide':\n        - 'Basic Installation': 'admin/Installation.md'\n        - 'Import' : 'admin/Import.md'\n        - 'Update' : 'admin/Update.md'\n        - 'Deploy' : 'admin/Deployment-Python.md'\n        - 'Nominatim UI'  : 'admin/Setup-Nominatim-UI.md'\n        - 'Advanced Installations' : 'admin/Advanced-Installations.md'\n        - 'Maintenance' : 'admin/Maintenance.md'\n        - 'Migration from older Versions' : 'admin/Migration.md'\n        - 'Troubleshooting' : 'admin/Faq.md'\n        - 'Installation on Ubuntu 22' : 'admin/Install-on-Ubuntu-22.md'\n        - 'Installation on Ubuntu 24' : 'admin/Install-on-Ubuntu-24.md'\n    - 'Customization Guide':\n        - 'Overview': 'customize/Overview.md'\n        - 'Import Styles': 'customize/Import-Styles.md'\n        - 'Configuration Settings': 'customize/Settings.md'\n        - 'API Result Formatting': 'customize/Result-Formatting.md'\n        - 'Per-Country Data': 'customize/Country-Settings.md'\n        - 'Place Ranking' : 'customize/Ranking.md'\n        - 'Importance' : 'customize/Importance.md'\n        - 'Tokenizers' : 'customize/Tokenizers.md'\n        - 'Special Phrases': 'customize/Special-Phrases.md'\n        - 'External data: US housenumbers from TIGER': 'customize/Tiger.md'\n        - 'External data: Postcodes': 'customize/Postcodes.md'\n        - 'Conversion to SQLite': 'customize/SQLite.md'\n    - 'Library Guide':\n        - 'Getting Started': 'library/Getting-Started.md'\n        - 'Nominatim API class': 'library/NominatimAPI.md'\n        - 'Configuration': 'library/Configuration.md'\n        - 'Input Parameter Types': 'library/Input-Parameter-Types.md'\n        - 'Result Handling': 'library/Result-Handling.md'\n        - 'Low-level DB Access': 'library/Low-Level-DB-Access.md'\n    - 'Developers Guide':\n        - 'Architecture Overview' : 'develop/overview.md'\n        - 'Database Layout' : 'develop/Database-Layout.md'\n        - 'Indexing' : 'develop/Indexing.md'\n        - 'Tokenizers' : 'develop/Tokenizers.md'\n        - 'Custom modules for ICU tokenizer': 'develop/ICU-Tokenizer-Modules.md'\n        - 'Setup for Development' : 'develop/Development-Environment.md'\n        - 'Testing' : 'develop/Testing.md'\n        - 'External Data Sources': 'develop/data-sources.md'\nmarkdown_extensions:\n    - codehilite\n    - admonition\n    - pymdownx.superfences\n    - pymdownx.tabbed:\n        alternate_style: true\n    - def_list\n    - toc:\n        toc_depth: 4\n        permalink: 🔗\nextra_css: [extra.css, styles.css]\nexclude_docs: |\n    mk_install_instructions.py\nsite_dir: site-html\nplugins:\n    - search\n    - mkdocstrings:\n        handlers:\n          python:\n            paths: [\"src\"]\n            options:\n              show_source: False\n              show_bases: False\n    - gen-files:\n        scripts:\n          - docs/mk_install_instructions.py\n"
        },
        {
          "name": "munin",
          "type": "tree",
          "content": null
        },
        {
          "name": "nominatim-cli.py",
          "type": "blob",
          "size": 0.4970703125,
          "content": "#!/usr/bin/env python3\n# SPDX-License-Identifier: GPL-3.0-or-later\n#\n# This file is part of Nominatim. (https://nominatim.org)\n#\n# Copyright (C) 2024 by the Nominatim developer community.\n# For a full list of authors see the git log.\n\"\"\"\nHelper script for development to run nominatim from the source directory.\n\"\"\"\nfrom pathlib import Path\nimport sys\n\nsys.path.insert(1, str((Path(__file__) / '..' / 'src').resolve()))\n\nfrom nominatim_db import cli\n\nexit(cli.nominatim(module_dir=None, osm2pgsql_path=None))\n"
        },
        {
          "name": "packaging",
          "type": "tree",
          "content": null
        },
        {
          "name": "settings",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "utils",
          "type": "tree",
          "content": null
        },
        {
          "name": "vagrant",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}