{
  "metadata": {
    "timestamp": 1736568584658,
    "page": 637,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYzOQ==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "nrlquaker/winbox-mac",
      "stars": 1458,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.06640625,
          "content": "Winbox-mac.app/Contents/Resources/wine/** linguist-detectable=false\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.01953125,
          "content": "Releases/\n.DS_Store\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 5.056640625,
          "content": "# Changelog\n\n# 3.41.0\n- update winbox to [3.41](https://mt.lv/winbox64).\n- fix sha512 checksum check \n  - This was fixed by using Mikrotik's redirected URL to download and check latest Winbox, as Mikrotik has blocked direct linking. Unfortunately, this also means that the ability to repoduce older builds is lost, but this is out of our control.\n- Add Justfile for easier updates. (Depends on [Just](https://github.com/casey/just))\n## 3.40.1\n\n- update `Wine` to `stable 9.0`.\n\n## 3.40.0\n\n- update winbox to [3.40](https://download.mikrotik.com/winbox/3.40/winbox64.exe).\n\n## 3.39.0\n\n- update winbox to [3.39](https://download.mikrotik.com/winbox/3.39/winbox64.exe);\n- update `Wine` to `devel 8.10`.\n\n## 3.38.0\n\n- update winbox to [3.38](https://download.mikrotik.com/winbox/3.38/winbox64.exe).\n\n## 3.37.0\n\n- update winbox to [3.37](https://download.mikrotik.com/winbox/3.37/winbox64.exe).\n\n## 3.36.1\n\n- update `Wine` to `stable 7.0`.\n\n## 3.36.0\n\n- update winbox to [3.36](https://download.mikrotik.com/winbox/3.36/winbox64.exe).\n\n## 3.35.0\n\n- update winbox to [3.35](https://download.mikrotik.com/winbox/3.35/winbox64.exe).\n\n## 3.34.0\n\n- update winbox to [3.34](https://download.mikrotik.com/winbox/3.34/winbox64.exe).\n\n## 3.32.0\n\n- update winbox to [3.32](https://download.mikrotik.com/winbox/3.32/winbox64.exe).\n\n## 3.31.0\n\n- update winbox to [3.31](https://download.mikrotik.com/winbox/3.31/winbox64.exe).\n\n## 3.30.0\n\n- update winbox to [3.30](https://download.mikrotik.com/winbox/3.30/winbox64.exe).\n\n## 3.28.1\n\n- map <kbd>option</kbd> to <kbd>alt</kbd> and <kbd>command</kbd> to <kbd>ctrl</kbd>;\n- enable retina mode by default.\n\n## 3.28.0\n\n- update winbox to [3.28](https://download.mikrotik.com/winbox/3.28/winbox64.exe).\n\n## 3.27.1\n\n- update `Wine` to `devel 6.2`;\n- use custom `Wine` build to greatly reduce size;\n- add support running under Rosetta2.\n\n## 3.27.0\n\n- update winbox to [3.27](https://download.mikrotik.com/winbox/3.27/winbox64.exe).\n\n## 3.25.0\n\n- update winbox to [3.25](https://download.mikrotik.com/winbox/3.25/winbox64.exe).\n\n## 3.24.1\n\n- add `DYLD_FALLBACK_LIBRARY_PATH`.\n\n## 3.24.0\n\n- update winbox to [3.24](https://download.mikrotik.com/winbox/3.24/winbox64.exe);\n- update `Wine` to `staging 5.7`.\n\n## 3.23.0\n\n- update winbox to [3.23](https://download.mikrotik.com/winbox/3.23/winbox64.exe).\n\n## 3.22.0\n\n- update winbox to [3.22](https://download.mikrotik.com/winbox/3.22/winbox64.exe);\n- drop `dmg` support.\n\n## 3.21.1\n\n- add ability to pass command line arguments;\n- add `libpng15.15.dylib`;\n- remove fixme-esync from log;\n- rename executable to `winbox-mac`.\n\n## 3.21.0\n\n- update winbox to [3.21](https://download.mikrotik.com/winbox/3.21/winbox64.exe).\n\n## 3.20.5\n\n- use `com.mikrotik.winbox` folder in `Application Support` for all versions;\n- update `Wine` to `staging 5.1`;\n- remove `winbox-mac-addresses`;\n- remove `Freetype` and `xQuartz` dependencies;\n- fix issue that app opens again after closing main window.\n\n## 3.20.4\n\n- use plutil instead of defaults;\n- remove quarantine flag from Application Support folder;\n- update `winbox-mac-addresses` to `0.1.1`.\n\n## 3.20.3\n\n- remove `Winetricks.app` and just copy wineprefix to `Application Support`.\n\n## 3.20.2\n\n- add `winbox-mac-addresses`. Its a [simple script](https://github.com/nrlquaker/winbox-mac-addresses) for copying Winbox-mac managed addresses from old versions to current. Valid for versions `>= 3.20.1`.\n\n## 3.20.1\n\n- new [versioning system](VERSIONING.md);\n- fix font rendering in some cases;\n- fix ability to run app on non English OS;\n- change winbox64.exe location from winebottler to winbox.\n\n## 3.20\n\n- update winbox to [3.20 64-bit](https://download.mikrotik.com/winbox/3.20/winbox64.exe);\n- package app manually instead of WineBottler;\n- use 64-bit Wine compiled by [Mike Kronenberg](http://winebottler.kronenberg.org/specifications). Remove a lot of unneeded for Winbox files to greatly reduce its size;\n- use 64-bit Wine prefix;\n- change icon to the new one provided by [Lucas di Lucca](https://github.com/luccaccine).\n\n## 3.19\n\n- update winbox to [3.19](https://download2.mikrotik.com/routeros/winbox/3.19/winbox.exe).\n- add empty folders in prefix to repo;\n- change user to winbox in prefix and reg files;\n- use icon from [mriza/winbox-installer](https://github.com/mriza/winbox-installer/tree/master/icons). This fixes visual bugs of the old one in Mojave.\n\n## 3.18\n\n- update winbox to [3.18](https://download2.mikrotik.com/routeros/winbox/3.18/winbox.exe).\n\n## 3.17\n\n- update winbox to [3.17](https://download2.mikrotik.com/routeros/winbox/3.17/winbox.exe).\n\n## 3.16\n\n- update winbox to [3.16](https://download2.mikrotik.com/routeros/winbox/3.16/winbox.exe).\n\n## 3.15\n\n- update winbox to [3.15](https://download2.mikrotik.com/routeros/winbox/3.15/winbox.exe).\n\n## 3.14\n\n- update winbox to [3.14](https://download2.mikrotik.com/routeros/winbox/3.14/winbox.exe).\n\n## 3.13\n\n- update winbox to [3.13](https://download2.mikrotik.com/routeros/winbox/3.13/winbox.exe).\n\n## 3.12-fix\n\n- add user folder to prefix. Without it it wasn't possible to save configuration.\n\n## 3.12\n\n- update winbox to [3.12](https://download2.mikrotik.com/routeros/winbox/3.12/winbox.exe).\n"
        },
        {
          "name": "CHANGELOG_WINBOX.md",
          "type": "blob",
          "size": 11.1474609375,
          "content": "# Winbox changelog\n\n# 3.41\n- added support for new internal WinBox protocol fields\nMore info: https://forum.mikrotik.com/viewtopic.php?t=209520\nImportant note: https://forum.mikrotik.com/viewtopic.php?t=209520#p1087391\n\n\n# 3.40\n\n- fix BTH code into default settings window;\n- fixed WinBox upgrade procedure (introduced in v3.39).\n\n# 3.39\n\n- added support for QR code field.\n\n## 3.38\n\n- fixed connecting to wireless network from QuickSet when there was no password specified;\n- fixed date and time value representation in the User Manager;\n- fixed skin file reading.\n\n## 3.37\n\n- do not update interface window layout all the time;\n- do not send value for empty multi-option field;\n- fixed VPLS \"cisco-id\" field with \"&\" prefix (introduced v3.36);\n- fixed ability to set options that can be hidden;\n- fixed floating point field's negative value in `-0.***` format.\n\n## 3.36\n\n- fix issue with non existing records still in winbox ros7;\n- fix Graphing and Quickset graphs;\n- fix neighbour table filter \"all\" storage if other was stored previously;\n- fix filter combobox saving/restoring;\n- fix wifiwave2 Frequency field;\n- show error if file upload not enough space;\n- fix some vpls fields with required \"&\" prefix;\n- fix sent default value for disabled wireless EAP Methods field;\n- do not set some firewall fields by not sending their values when hidden;\n- fix managed list category grouping when value is ip with port;\n- do not dump connection info to stdout when disconnected;\n- fix some field update if it was changed and disabled;\n- fix menu missing icon if some submenus are hidden in skin;\n- fix skin for Add button with dropdown.\n\n## 3.35\n\n- fixed F4 and F7 keys in Terminal;\n- fixed automatic reconnect issues for RoMON;\n- fixed crash when connecting in new window (introduced in v3.33);\n- show correct data rate for file upload/download.\n\n## 3.34:\n\n- fixed WinBox crash on startup (introduced in v3.33).\n\n## 3.33:\n\n- added support for hex type fields;\n- enabled \"Stop\" button on auto start actions;\n- fixed error messages for start, stop and cancel actions;\n- fixed skin when opening in new window;\n- fixed time zone offset support for some fields;\n- improved interface name sorting;\n- properly display all packets captured by sniffer.\n\n## 3.32\n\n- added \"Auto Reconnect\" feature;\n- added fast selection of column checkboxes in \"Columns\" window by simply typing column name without spaces;\n- added support for \"Tools->Telnet/SSH\" extra parameters;\n- alert if there was error executing \"Cancel\" action;\n- fixed MAC connection in new window;\n- fixed WinBox when started by Windows \"runas\" tool with different user;\n- fixed crash on \"Netwatch\" entry \"host\" field;\n- fixed crash when table window was closed before its \"Columns\" window;\n- fixed delayed session window open with \"Change Password Now\" prompt;\n- fixed filter type \"contains\" for network fields;\n- fixed focus marker in checkboxes;\n- fixed graphs with values higher than 2^31;\n- fixed large text paste in \"Terminal\" window;\n- fixed some fields with empty IPv6 value;\n- fixed tables with max entry count feature;\n- fixed time value fields in \"Scheduler\" menu;\n- keep terminal lines intact when resizing \"Terminal\" window;\n- properly show all fields which depend on other field;\n- release \"Safe Mode\" with info message, when other user took it;\n- restore \"Managed\" table when toggling \"Advanced\" mode;\n- sort \"Columns\" window alphabetically;\n- use router's time in graphs;\n- use router's time in last link up/down fields.\n\n## 3.31\n\n- ask to close all WinBox instances before WinBox upgrade, otherwise upgrade will fail;\n- fixed table to properly show and hide columns and remember its widths;\n- made MAC-telnet work if SSH or telnet was used before;\n- update file path after changing its location with drag&drop.\n\n## 3.30\n\n- added support for mouse wheel scroll in field & table show columns windows;\n- double click on word in \"Terminal\" now automatically selects and copies it to clipboard;\n- fixed WinBox disconnect when selecting entries in QuickSet's \"WiFi Clients\" table;\n- fixed crash when all inner windows were closed;\n- fixed crash when opening some of interfaces;\n- fixed glitches while resizing column widths or reordering table entries;\n- fixed visual glitch when showing table filters and categories;\n- fixed visual glitches when scrolling \"Terminal\" window and Zoom In or Zoom Out is used;\n- made Ctrl++ & Ctrl+- still work if focus is on checkbox;\n- made Ctrl+C and Enter right after text selection in \"Terminal\" window work as copy to clipboard;\n- made Ctrl+D pass-through to \"Terminal\", so it is possible to terminate inner telnet or SSH sessions;\n- made Ctrl+V work as paste from clipboard;\n- made double click in \"Torch\" window work again;\n- properly show \"I\" flag for invalid entries;\n- use router's time when filling default time in \"Scheduler\" items.\n\n## 3.29\n\n- added \"Windows\" menu for list of all currently opened windows;\n- added separate \"Show Columns\" window for list of visible columns;\n- allow changing column order by using drag and drop;\n- made \"Terminal\" window titles unique.\n\n## 3.28\n\n- added support for \"contains\" and \"contains not\" filtering in IPv4 address ranges;\n- allow to modify DHCPv6 server binding settings;\n- do not show newly created elements as invalid (in red);\n- expand table flag column to show all possible flags;\n- fixed IPv6 prefix column sorting in tables;\n- fixed WinBox crash after saving current session;\n- fixed WinBox crash when accessing v7 routes with VRF set;\n- fixed WinBox crash when some opened element was removed;\n- fixed WinBox disconnect when large text was pasted into terminal window;\n- fixed problem where optional field disappeared if window was maximized;\n- fixed table row selection with keyboard to match Windows behavior;\n- keep inner maximized window maximized when changing WinBox window size;\n- show missing Security Profile field in WiFi simple mode.\n\n## 3.27\n\n- fixed content drawing of read-only tables (introduced in v3.26).\n\n## 3.26\n\n- fixed CAPsMAN service failure when viewing Radios table;\n- fixed Hotspot service failure when viewing Hosts table;\n- support Ctrl++ & Ctrl+- on keypad for quick access to Zoom In/Zoom Out.\n\n## 3.25\n\n- added \"Find Next - F3\" tooltip for Find field;\n- added support for CTRL+ and CTRL- keyboard shortcuts for Zoom in and Zoom out;\n- added support for DNS names in address type fields;\n- do not scroll to first log entry when minimizing WinBox if Log window was open;\n- fixed crash when an active Terminal window was opened when WinBox was minimized;\n- fixed crash when opening session with Health window open;\n- fixed multiple \"peer\" parameter presence when editing an IPsec policy;\n- fixed secure connection establishment after trying to connect to legacy mode devices;\n- fixed session file size increase with each WinBox usage;\n- improved window resizing and scaling behavior on systems that include high DPI monitors;\n- show disabled item icons in gray.\n\n## 3.24\n\n- fixed WinBox crash when viewing firewall rule with src/dst-address-type configured;\n- fixed checkbox group disabled state inheritance;\n- fixed dates and times in interface link up/down properties (RouterOS v6.47 required);\n- fixed system comment message display;\n- fixed vertical font alignment in optional fields;\n- fixed window size inheritance from the previous session;\n- keep advanced and simple mode table settings separately;\n- make WinBox upgrade work with wine 5.0 or newer;\n- properly show popup windows on top.\n\n## 3.23\n\n- added support for Ctrl+C and Ctrl+A shortcuts in read-only fields;\n- always use fixed width font in terminal window;\n- do not resize inner windows when main window is resized;\n- fixed default configuration approval window disappearing when using \"Show Script\" button;\n- fixed main window size saving between sessions;\n- improved large table loading speed in RouterOS v7.\n\n## 3.22\n\n- added 24x24 and 32x32 icon support (RouterOS v6.47 required);\n- added Legacy Mode (disabled by default) to allow using older, less secure connections to RouterOS older than v6.43;\n- added scroll bar support in item property windows;\n- added support for super low DPI - 72, accessible by Zoom Out;\n- fixed Log window drawing on HiDPI displays;\n- fixed Zoom In/Zoom Out setting persistence after window is closed;\n- made table row height 15px by default;\n- use monospace font for big pop-up messages.\n\n## 3.21\n\n- added support for HiDPI displays;\n- download WinBox specific files from router only into AppData folder and not anywhere else (CVE-2020-5720);\n- enabled Drag and Drop support on 64-bit WinBox in Wine;\n- font size can be increased/decreased under \"Settings/Zoom In\" or \"Zoom Out\";\n- improved MikroTik signature checking on WinBox update.\n\n## 3.20\n\n- allow to filter by IPv6 addresses and prefixes;\n- build 64-bit Winbox as well (https://mikrotik.com/download);\n- do not leave files locked on computer when uploading files to router;\n- fixed problem where some fields were not shown for read only users;\n- fixed Winbox crash when copying multiple files between routers;\n- make Ctrl+A work in script fields and other multiline fields;\n- make DLL hijacking attack not work: Winbox will not look at the directory it resides in, when looking for system DLLs;\n- on update, Winbox will check that code is signed by MikroTik and not somebody else;\n- removed Drag and Drop support on 64-bit Winbox in Wine;\n- show system note at login.\n\n## 3.19\n\n- fixed problem where Winbox could not login into RouterOS v6.45 (or later) router;\n- fixed DHCP lease sorting by \"last seen\" column.\n\n## 3.18\n\n- fixed problem where winbox could not login in RouterOS v6.43 router for some users.\n\n## 3.17\n\n- fixed sudden disconnects from router (introduced in v3.15).\n\n## 3.16\n\n- added back support for connecting to older RouterOS v6 versions;\n- fixed crash when connecting to newest RouterOS on MacOS wine.\n\n## 3.15\n\n- fixed problem where connecting through RoMON agent with incomplete package set not all menus were available on the target router;\n- fixed arrow keys in table filter fields;\n- when connected to romon agent mark session as romon one.\n\n## 3.14\n\n- added support for new style authentication and encryption for connections to RouterOS v6.43;\n- make all connections in secure mode (all data is encrypted with AES128-CBC-SHA);\n- make winbox self upgrade check .exe signature;\n- make up/down keys select previous/next entry in address/neighbors list in connect window while login name or password fields are in focus;\n- make mouse wheel work anywere in connect window if login or password fields are in focus;\n- remember Romon Neighbours Table column widths;\n- fixed problem where selected table items were moved to the top if the table filters dropdown button was clicked twice.\n\n## 3.13\n\n- abandoned support for connecting to older RouterOS versions (older than v6), no DLLs will ever be downloaded;\n- winbox.exe is now signed executable.\n\n## 3.12\n\n- added new menu entry - \"Export Without Passwords\";\n- make Enter start filtering in Connect window if some of the filters are changed instead of connecting to router;\n- do not keep old passwords if user unselected Keep-Password later;\n- make file copy & paste work between routers again;\n- make Enter key activate Connect if one of connect fields were active even when master password field has not been entered yet;\n- fixed Reconnect in RoMON mode with \"Open In New Window\" enabled;\n- other fixes.\n"
        },
        {
          "name": "Justfile",
          "type": "blob",
          "size": 0.3740234375,
          "content": "update-winbox:\n    wget -O Winbox-mac.app/Contents/Resources/winbox64.exe https://mt.lv/winbox64\n\nbump-version VERSION:\n    ./scripts/bump_version {{VERSION}}\n\nmake-release: \n    ./scripts/release\n\nupdate VERSION: update-winbox (bump-version VERSION) make-release\n    echo \"Updated Winbox and bumped version\"\n    echo \"You will need to update the README.md and CHANGELOG's manually.\""
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.041015625,
          "content": "MIT License\n\nCopyright (c) 2021 nrlquaker\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.7548828125,
          "content": "# winbox-mac\n\n![Downloads count](https://img.shields.io/github/downloads/nrlquaker/winbox-mac/total.svg)\n\n<p align=\"center\">\n  <img src=\"icon.png\" width=\"200\">\n</p>\n\nwinbox-mac is [MikroTik](https://mikrotik.com) Winbox bundled into macOS app with [Wine](https://www.winehq.org).\nWine is compiled by [Gcenx](https://github.com/Gcenx) with minimal set of dependencies.\nIcon is provided by [Lucas di Lucca](https://github.com/lucasdelucca).\nThis is not official [MikroTik](https://mikrotik.com) build and is not related to Mikrotik in any way.\n\n<p align=\"center\">\n  <img src=\"screenshot.png\" width=\"650\">\n</p>\n\n## Winbox 4 and how it relates to this project\nMikrotik has released a preview of Winbox that is cross platform native for Windows, Mac, and Linux! We are tracking its development, and the implications of future support of this project in this issue: https://github.com/nrlquaker/winbox-mac/issues/155. Please see this issue for discussion regarding missing features between Winbox 3 and 4. \n\n## Installation\n\nCan be easily installed with [Homebrew Cask](https://caskroom.github.io):\n\n```sh\nbrew install --cask nrlquaker-winbox\n```\n\n## Update\n\nRecommended way to update is to use [Homebrew Cask](https://caskroom.github.io):\n```\nbrew update\nbrew upgrade --cask nrlquaker-winbox\n```\n\n## Command line arguments\n\nYou can pass command line arguments as follow:\n\n```\nopen /Applications/Winbox-mac.app --args ip login password\n```\n\n## Note\n\nTo properly import/export addresses or use upload/download you have to run `Winbox-mac.app/Contents/MacOS/startwine` from CLI or add `/usr/bin/env` to Security & Privacy → Privacy → Full Disk Access. To be able to see hidden files in file choosing dialog press <kbd>Cmd</kbd> + <kbd>Shift</kbd> + <kbd>.</kbd>. Or you can use `/tmp` folder.\n\n## Reporting bugs\n\nPlease make sure that you are using [bug report template](https://github.com/nrlquaker/winbox-mac/issues/new?assignees=nrlquaker&labels=&template=bug_report.md&title=) and checklist is complete. Otherwise it may be closed without review.\n\n## Contributions are welcomed\n\nIf you like this project and you find it useful help me to improve it. First of all check if there are some [help needed issues](https://github.com/nrlquaker/winbox-mac/issues?q=is%3Aissue+is%3Aopen+label%3A%22help+wanted%22). Or you can improve code or documentation.\n\n## Version\n\nCurrent version is based on [Winbox 3.41](https://mt.lv/winbox64).\nWine version is `9.0 stable`.\n\nPlease check [versioning](VERSIONING.md) for versioning scheme explanation.\n\n## Changelog\n\nThere are two changelogs in this project. [One](CHANGELOG.md) related to `Winbox-mac`, the [other one](CHANGELOG_WINBOX.md) is for original `Winbox`.\n\n## License\n\nwinbox-mac is released under the [MIT License](https://github.com/nrlquaker/winbox-mac/blob/master/LICENSE)\n"
        },
        {
          "name": "VERSIONING.md",
          "type": "blob",
          "size": 0.3544921875,
          "content": "# Versioning\n\nA version number uses the following scheme `MAJOR.MINOR.PATCH`.\n\n`MAJOR` and `MINOR` versions are always taken from original Windows Winbox. For example, if version of original Winbox is `3.21` then Winbox-mac version will be `3.21.x`.\n\n`PATCH` version will be incremented only when some changed are done to macOS related stuff (not in Winbox.exe).\n"
        },
        {
          "name": "Winbox-mac.app",
          "type": "tree",
          "content": null
        },
        {
          "name": "icon.png",
          "type": "blob",
          "size": 274.884765625,
          "content": null
        },
        {
          "name": "screenshot.png",
          "type": "blob",
          "size": 303.33984375,
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}