{
  "metadata": {
    "timestamp": 1736568387156,
    "page": 330,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjM0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "swizzin/swizzin",
      "stars": 2140,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.279296875,
          "content": "root = true\n\n[*]\nindent_style = space\nindent_size = 4\nend_of_line = lf\ncharset = utf-8\ntrim_trailing_whitespace = true\ninsert_final_newline = true\n\n# Use 2 spaces for json\n[*.json]\nindent_size = 2\n\n[*.md]\ntrim_trailing_whitespace = false\n\n# use 2 spaces for YML\n[*.yml]\nindent_size = 2\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2255859375,
          "content": "*.bash text eol=lf\n*.fish text eol=lf\n*.sh text eol=lf\n\nsources/functions/* diff=bash\n\n# To disable checking modes, run `git config core.fileMode false`\n\n.gitattributes export-ignore\n.gitignore export-ignore\n.gitkeep export-ignore\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0859375,
          "content": ".dev.lock\n.test.lock\ndev.env\n\n# Ignore JetBrains IDE's project settings folder\n.idea/**\n"
        },
        {
          "name": ".gitlint",
          "type": "blob",
          "size": 0.0244140625,
          "content": "[general]\nignore=B6, CC1\n"
        },
        {
          "name": ".pre-commit-config.yaml",
          "type": "blob",
          "size": 0.44921875,
          "content": "repos:\n  - repo: https://github.com/maxwinterstein/shfmt-py\n    rev: v3.7.0.1\n    hooks:\n      - id: shfmt\n        args: [\"-w\", \"-ci\", \"-sr\", \"-i\", \"4\"]\n  - repo: https://github.com/shellcheck-py/shellcheck-py\n    rev: v0.9.0.6\n    hooks:\n      - id: shellcheck\n        args: [\"--severity=error\"]\n  - repo: https://github.com/pre-commit/pre-commit-hooks\n    rev: v4.5.0 # Use the ref you want to point at\n    hooks:\n      - id: check-executables-have-shebangs\n"
        },
        {
          "name": ".shellcheckrc",
          "type": "blob",
          "size": 0.1923828125,
          "content": "enable=add-default-case\nenable=avoid-nullary-conditions\nenable=avoid-deprecate-which\nenable=avoid-quote-safe-variables\ndisable=SC2068 # Double quote array expansions to avoid re-splitting elements."
        },
        {
          "name": ".vscode",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 55.98046875,
          "content": "# Changelog\n\n## [3.13.0]\n\n## Nov 15, 2024\n\n### New:\n- qBittorrent 5 support for Bookwork+ and Noble+ distributions\n- rTorrent 0.10.0 support\n\n### Removed:\n- Buster support\n\n### Fixed:\n- deps: ensure cron is installed\n- ruTorrent: v5 compatibility\n- noble: box update bug\n- sonarr: fix long interactive searches\n- qBittorrent: Backport ssl validation fix to v4.6.7\n\n\n## [3.12.0]\n\n## June 22, 2024\n\n### New:\n- Ubuntu Noble support\n\n### Fixed:\n- Libtorrent will use boost 1.85 on bookworm and newer distros\n- Libtorrent version string grep\n- Install rsyslog explicitly for fail2ban\n- qbittorrent: add qt6-base-private-dev depedency\n\n## [3.11.1]\n\n## March 12, 2024\n\n### SECURITY:\n - Pyload has been removed from installation due to a Remote Code Execution vulnerability (CVE-2023-0297). Existing users will be encouraged to uninstall the software with every box update. This is a major issue, please remove. You've been warned!\n\n### Fixed:\n - curl: scripts may use the wrong path (/usr/bin/curl) if curl has been previously primed during execution of the scripts and which caches its path. Clear the hash table for curl after we compile it ourselves to prevent odd errors.\n\n## [3.11.0]\n\n## Feb 17, 2024\n\n### New:\n- Sonarr v4 support :tada:\n\n### Changed:\n- nginx: stop version emission\n- boost: more robust mirror fallback mechanisms\n- curl: upgrade to 8.4\n- box: package descriptions have been updated\n- node: bump to 20.x LTS\n\n### Fixed:\n- rutorrent: country flags\n- autobrr: issue with package selection during install\n- navidrome: fails to download on arm64\n- netdata: install/remove url\n- nzbhydra: java variable resolution\n- nzbhydra: use python wrapper for launching\n- nzbhydra: upgrader issues\n- rtorrent: build flag issues\n- rtorrent: remove piece boundary fix\n- rtorrent: pin xmlrpc to rev 3212\n- fpm: fix dotenv dependency issue in focal/buster\n- nginx: fancyindex installation (note, it should fix existing installs if you haven't touched anything)\n\n\n## [3.10.0]\n\n## November 6, 2023\n\n## SECURITY\n\n> [!WARNING]\n> All btsync/rslsync users are encouraged to check their installations to ensure they have a Web UI password set. You can do so from the Settings > Web UI. This issue should be resolved moving forward. New installations should once more prompt username/password generation on first setup.\n\n- btsync/rslsync: we were made aware that new installs of resilio haven't been prompting users to create passwords. To be clear, this is a regression, as previous behavior prompted the user to create a password on first setup. It was identified the the \"Skip EULA\" config option was causing this behavior and has been removed. An update script will run to remove this option from existing configs, but it may not trigger password creation.\n\n### Changed:\n- rtorrent: stickz commited a bunch of performance related patches. Enjoy!\n- qbittorrent: builds for 4.6 have been enabled but not thoroughly tested. Feel free to report any issues\n\n### Fixed\n- qbittorrent: overzealous grep will continue to warn you of \"misconfigurations\" despite having the desired bind config set.\n- npm: swapped from script to repo method of initializing npm and nodejs\n- calibre-web: don't set proxy_bind (fixes issue with ipv6)\n\n## [3.9.2]\n\n## September 16, 2023\n\n### Meta/Development:\n- Update pre-commit.ci integrations\n- Update contributing.md\n- Remove feathub link from issue template\n\n### Changed:\n- nginx: dhparam generation will now happen asyncronously\n- tautulli: now uses a venv, updated buster to use pyenv\n- rtorrent: xmlrpc will now track super-stable\n- rtorrent: added PGO build option\n\n### Fixed:\n- curl: regression with gcc12 on jammy\n- curl: fix potential unzip issue\n- qbit: expand qt6 deps (packages were split)\n- qbit: fix deps for focal\n- qbit: don't bind to `*` if nginx is installed. Warn existing users of this (mis)config\n- arrs: allow access for /feed/calendar via nginx\n- nginx: maintained update code\n- nginx: fix package errors during remove\n- pyload: fix pycurl install\n- rtorrent: various fixes\n- jfago: will no longer run as root\n\n## [3.9.1]\n\n## July 16, 2023\n\n### Development:\n- add pre-commit.ci integration\n\n### Fixed:\n- mango: stop offering to install mango on arm because it's unsupported\n- updates: add echos to all update actions\n- rtorrent: build shared libs for curl (should fix compile errors related to zlib)\n- rtorrent: autoremove after repo clean (should fix segfaults related to xmlrpc-c)\n\n## [3.9.0]\n\n## June 26, 2023\n\n### New:\n\n- os: bookworm support\n- os: use gcc-12 in Jammy\n\n### Changed:\n\n- deluge: compile flags are more optmized\n- qbittorrent: use O3 compile flag\n\n### Fixed:\n\n- nzbhydra: broken variable\n- mylar: urllib3 pip depends\n- curl: use cmake\n- curl: don't use curl to install curl\n- rtorrent: udns can't use ipv6\n\n## [3.8.0]\n\n## May 4, 2023\n\n### New:\n\n- rtorrent: add UDNS install option\n- rtorrent: compile a fancier, featureful version of curl\n\n### Changed:\n\n- rutorrent: enable localhostedmode (will load much faster now!)\n- autodl: change some downloading logic\n- rutorrent: install ffmpeg by default\n- rutorrent: update config for v4.1.4\n\n### Fixed:\n\n- let's encrypt: respects ecc certs for hooks\n- sabnzbd: python packaging logic for v4 (python3 < 3.8)\n- bazarr: python packing logic improvements and remove EOL support (python3 < 3.8)\n- rtorrent: limit piece preloading to torrents uploading at 50KB/s+ (no updater script for this. [It's a simple config change if you want this](https://github.com/swizzin/swizzin/commit/cd3519824a8b7dc631d2d709533024533c87aac8))\n- nginx: remove duplicate packages from install params\n- rutorrent: arm64 support for filemanager (reinstall the plugin if this is you)\n\n## [3.7.1]\n\n## April 15, 2023\n\n### Updated\n- rutorrent: version 4.0.2, 4.0.3 compatibility\n\n### Fixed\n- rtorrent:\n  - resolve lockfile crash\n  - patch xmlrpc-c for newer architectures\n  - support 10gbit throttles\n  - lower repo priority on the installation options\n- nextcloud: version pinned everything except jammy\n- lounge: remove problematic `npm config set`\n\n## [3.7.0]\n\n## April 2, 2023\n\nThis release is mainly aimed at improving the ruTorrent issues as a result of a recent surge in development, but a few other improvements made it in as well.\n\n### New\n- New application: jfa-go\n\n### Changed\n- qbittorrent: disabled 4.5 branch on buster due to gcc incompatibilities\n- rtorrent: compiliation improvements and better LTO settings thanks to @stickz\n- rtorrent: installation speed improvements thanks to @stickz\n- php: will now set path in the pool config, avoiding the need to manually set path in ruTorrent configs\n- readme: removed more feathub links\n\n### Fixed\n- rtx: revert to filemanager pinning on 4.0 rutorrent version\n- rtx: better tag detection of your current installation\n- rtx: ensure rutorrent directory is a git safe.dir\n- rutorrent: better version matching, avoid beta releases now that 4.0 is stable\n- rutorrent: botched scgi creation\n- quota: fix rutorrent diskspace creation (use existing function rather than duplicate code)\n- wireguard: finally found the pesky bug causing rt kernel to be installed in buster (should be generally more functional in buster now as well)\n- box list: not showing package names\n\n## [3.6.0]\n\n## January 21, 2023\n\n### Changed\n - Do not use git.io links for quick setup. Bespoke s5n.sh links have been setup for this\n - Stretch and Bionic have officially been EOL'd. The current commit will be retagged for eol-bionic and eol-stretch. Please update your OS to something that isn't 5+ years old\n - rtx now supports some rudimentary cli options for installing plugins and themes without the GUI\n - qBittorrent now supports version 4.5\n - Deluge 2.1 is supported\n - Node version has been bumped to version 18 LTS\n\n### Fixed\n - qBittorrent now has some better error handling\n - Deluge Automat version has been pinned\n\n\n## [3.5.3]\n\n## October 15, 2022\n\n### Changed\n - qbittorrent: installs now default to RC_1_2 libtorrent branch for 4.4.x (following upstream). You may choose to compile with RC_2_0 if you `export LIBTORRENT_VERSION=RC_2_0` before install.\n - panel: added proper log management/levels\n\n\n### Fixed\n - fpm: fixed installation on stretch, bionic and buster\n - netdata: uninstall now exists (again)\n - mango: fixed dl links\n - calibre: libopengl0\n - nginx/php: add zip module\n - rutorrent: fix version sorting, install latest\n - rtx: fix version grepping for tag support in many plugins\n - rutorrent: un-pin filemanager plugin\n - deluge: don't chmod deluge.UpdateTracker.py\n - qbit: removed useless code\n - panel: fixed log spam of missing profiles (nginx, vsftp, quota, rclone, ffmpeg, etc)\n\n## [3.5.2]\n\n## September 2, 2022\n\n### New\n - rtorrent: add user patch support\n\n### Fixed\n\n - transmission: add support for nginx fancy index download endpoint\n - jellyfin: support new install settings/locations\n - wireguard: postdown script was adding the nat rule instead of deleting it\n\n## [3.5.1]\n\n## July 10, 2022\n\n### Fixed\n - x2go: debian keychain quirk\n - prevent log clobbering from certain commands\n - rtx: DarkBetter and MaterialDesign themes are ruTorrent submodules now\n - jellyfin: fix apt dependency resolution\n\n## [3.5.0]\n\n### New\n - Ubuntu Jammy Support (22.04)\n - Add b to funding. Toss him some money.\n\n### Updated\n - The Lounge will now use yarn for the install method. Existing installs will be swapped to the new method.\n - ruTorrent installs will no longer install club-quickbox theme by default. The theme needs work to be compatible with v4\n\n### Fixed\n - Pull git repo updates as user owning repo (Ubuntu CVE fix)\n - Update the *arr nginx configs\n - apt-key is deprecated, use current best practices for pulling in keys\n    - Existing keys won't be updated. You will only start to see noisy warnings starting in Jammy, so this will only potentially affect you if you dist-upgrade, but keys previously via apt-key will still work\n - hold rtorrent/qbittorrent packages when compiled\n - wireguard wasn't installing iptables even though it depends on it\n - emby upgrader qol fixes and suspiciously missing arm support\n - qbittorrent 4.4.3.1 update broke version matching because it was fuzzy, now it is not.\n\n### Upstream issues\n - Jellyfin builds are known not to work under Jammy. This is not our fault. Track here for info on when this is resolved.\n    - https://github.com/jellyfin/jellyfin/issues/7742\n\n## [3.4.0]\n\n### New\n - Readarr has finally left beta\n\n### Fixed\n - rtorrent: optimize performance (thanks stickz!)\n - qbittorrent: fix git tagging for qttools compiles\n - bazarr: fix proxy setup bad sed\n\n## [3.3.2]\n\n## Feb 18, 2022\n\nHotfix release\n\n### Fixed\n - radarr: properly setting host variable in the reverse proxy (todo: lidarr, etc)\n - flood: fixed an issue which was causing an unresolvable issue during `box update`\n - sabnzbd: bump pyenv version requirements\n - rutorrent(filemanager): pinned filemanager-share/media packages to match fm\n\n## [3.3.1]\n\n## Feb 13, 2022\n\nHotfix release\n\n### Fixed\n - grep in check_installed function will now make a more reliable check. It was sometimes greedily matching the string \"not-installed\" causing apt_install to skip the package.\n - Pinned filemanager-rutorrent to last known working commit as the latest commit is broken and causing ruTorrent to not load.\n - Mango pushed another config change which caused the app to break.\n\n## [3.3.0]\n\n## Feb 12, 2022\n\nSome good fixes in this release that have been some glaring issues for a little while now. Major improvements to the ruTorrent install-flow, enabling qbit 4.4 builds and fixing broken flood compiles.\n\nAlso, lots of first time contributors in this release. Thank you for your contributions!\n\n### Updated\n - qBittorrent\n   - qBittorrent now has support for version 4.4.*\n     - These builds utilize libtorrent 2.0 and QT6\n     - Thanks to @userdocs and their contributions to providing us a github workflow to produce the deb builds used in the new version for cmake/qt6 automagically\n   - qBittorrent reverse proxy will now properly write the cookie path\n - ruTorrent\n   - ruTorrent will now pin to the latest version tag on install. Master has become a bit unstable so this should provide a better experience for everybody. swizzin has generated some logic to keep installs rolling with the most recent tag.\n   - `rtx` is now version aware when you install plugins will do its best to install a plugin from a matching version tag\n   - pulled the autodl-plugin into our organization and applied the patches to make it work with ruTorrent 4\n   - If you are still having version issues and plugin problems, please uninstall and reinstall ruTorrent -- we don't officially support upgrades, so a reinstallation would be the best way to resolve outstanding issues at this point. Be aware some settings/traffic data may be lost. I would encourage you to backup your ruTorrent folder (/srv/rutorrent) first if you value this data and would like to attempt to restore it.\n - rTorrent\n   - Community members have provided patches to help fix some instabilities to rTorrent:\n     - bencode dos vulnerabilities in rTorrent 0.9.6 (@static53)\n     - fix a crash in rTorrent when xmlrpc receives invalid data (@stickz)\n   - rTorrent has internally received some TLC and code updates as the rtorrent code is some of the first that was ever contributed to this repo\n - Flood\n   - We now use jesec's fork and npm install this package globally. Existing users of flood will need to reinstall their package to receive updates moving forward. We no longer compile flood on a per-user basis. Regretfully some double authentication issues remain; however, I determined this to be the best solution since we have support for all the backends flood supports. If you take issue with the new layout, see the reasoning [here](https://github.com/swizzin/swizzin/pull/579#issuecomment-1030685911)\n - mango\n   - updated the default config and push new config on mango upgrades (@rubysamurai)\n - mylar\n   - cleaned up some issues preventing a clean experience on a fresh installation\n - `box`\n   - The box management script has received some TLC in the form of refactoring\n   - `apt_install` function will now do some checks and only inform you about the packages it is actually installing\n\n### Internal/Development notes\n - New function `github_latest_version` in the utils functions\n   - `github_latest_version mylar3/mylar3` queries the release page of the org/project and returns the latest version of a package. You can then use this version to generate your case statement to download stuff based on architecture.\n - Restructured patches to live in `sources/patches/appname`\n\n\n## [3.2.0]\n\n## January 1, 2022\n\nHappy new year! Due to some recent, major bugs, swizzin is getting an update today to fix some issues with AutoDL and Deluge 1.3. Also a few new apps and some other fixes.\n\nEnjoy!\n\n### Added\n - Navidrome\n - Mylar\n - Debug functions\n\n### Updated\n  - Node to 16 LTS\n\n### Fixed\n - Some bazarr variables were returning as null and creating chatter\n - Incorrect python version being used during `box chpasswd` with Deluge 1.3 installed\n - Branch used when installing 1.3-stable of Deluge\n - Calibre-web installer to update venv requirements on upgrade and remove the deprecated `-f` flag\n - Pinned ruTorrent to a known working commit to prevent a fatal error with outdated autodl\n - Nextcloud broke download links for older versions\n\n## [3.1.1]\n\n## October 14, 2021\n\n### Added\n - `populate_var` function for swizdb toolkit\n\n### Updated\n - Node version bump to 14 LTS.\n   - We will no longer clobber your choices if you are running a newer node version than is required by swizzin packages\n\n### Fixed\n - apt function `check_install` was sometimes improperly returning the installed status of dependencies\n\n## [3.1.0]\n\n## September 20, 2021\n\n### Added\n - New app: Autobrr\n   - A torrent client agnostic replacement for Autodl-irssi written in go.\n   - Still in active development. The author was kind enough to contribute the entire flow to swizzin, which is why it has been included despite being in active development.\n   - Consider not using it quite yet if you are afraid of potentially having to reinstall the application and reset-up your filters in the event an app upgrade requires a full database wipe. That said, the application currently does what it says on the box.\n - Checking out the `develop` branch will keep you on `develop` over future runs of `box update`\n\n### Updated\n - Sonarr installations will now use the tarball method of install rather than the apt repo (fixes Bullseye \"no repo found\" for Sonarr)\n - Include arm64 in official support during install\n - nginx will now default to TLS1.3 and http/2 connections\n - made tests a bit less noisy\n - Offer to remove mysql database when removing nextcloud\n\n### Fixed\n - Autodl grepping for gui/server ports could accidentally return the wrong port if your client was fully setup.\n - `/home/${user}/.config` will now be generated when creating/adding a user to prevent scenarios in which `~/.config` is created and owned by `root`\n - Parsing `--test` and `--env` arguments during setup\n - enable pre-allocation in qbittorrent by default (XFS users rejoice)\n - Calibre: `os_arch` command not found during upgrade\n - Filebrowser arm compatibility was broken on upgrades\n\n## [3.0.0] was technically months ago edition\n\n## August 16, 2021\n\n### Added\n - develop branch\n - Styled echos (@flying-sausages)\n   - We are working to make the installers more quiet and streamlined. If you notice anything odd or out of place, feel free to bring it up!\n - ARMv64 support\n - Radarr v3 (dotnet)\n   - #diemono\n - Prowlarr (@bakerboy448)\n - Ombi v4 -- ombi v3 is no more\n - Airsonic (@flying-sausages)\n - Calibre, Content server and Calibre-web (@flying-sausages)\n - `sources/globals.sh` loads the most commonly used functions. Useful for writing your own scripts or debugging swizzin or reasons\n - Actually upgrade plex if you run `box upgrade plex` after the install installation of the update script\n - `box upgrade lounge`\n - `touch /etc/swizzin/.dev.lock` to prevent `box update` from forcing you to git head. Useful for troubleshooting or saying \"stop updating my swizz\"\n - Reboot required detection at the end of `setup.sh`\n - Unattended setup. Please see related docs for info on how to use (accepts arguments and env files)\n - cracklib is now mandatory when choosing an account password, unless you can read the docs\n   - Please make sure you elevate to root properly `su -` is the correct command, not `su`. A note has been added to the readme.\n - Echo ports at the end of installers if nginx is not installed\n - bash completion (@userdocs)\n - `swizdb`: functions for a persistent storage of swizzin application-related config options\n - `box test` (mostly for dev QoL)\n\n### Removed\n - Xenial support (stretch life support notice ~ June 2022)\n   - Last commit supporting xenial lives at tag: xenial-eol. Please consider upgrading your server!\n - Sonarr v2 (old stable)\n - Couchpotato\n - Headphones\n - Subsonic\n - Revert: Add Komga -- it's probably not coming back\n\n### Updated\n - Libtorrent static libraries: any version of qBittorrent can be installed with any version of Deluge.\n   - Deluge and qBittorrent now use static libraries built directly into the apps themselves. This allows them to be version agnostic which will be important for retaining compatibility with upcoming qBittorrent versions while maintaining compatibility with the slower pace of Deluge development.\n   - Libtorrent will accept a patch at `/root/libtorrent-${libtorrent_branch}.patch` if you would like to change the settings of libtorrent before compilation\n      - During upgrades Deluge and qBittorrent will ask to continue to use the existing version of libtorrent if it deems the current version acceptable for the requested change\n   - Bullseye will likely be the last OS supporting Deluge 1.3.15 as steps will not be taken to maintain python2 compatibility if/when distros purge python2 packages\n - Jellyfin: Use apt-get to install the jellyfin packages from the officially maintained repositories\n - Quick start: Made the quick-start command shorter and more memorable. Added the `source` to help prevent `box` post-install confusion.\n - Librespeed: update nginx config\n - Refined global depends (added things like `jq`)\n - Some usernames cannot be used when adding a user\n - pip2 is install from getpip if using bullseye or focal\n - Websocket support for Mango\n - rar/unrar install function\n - update sabnzbd:\n   - Support 3.2.0\n   - Update python version requirements\n   - Pre-write config template to prevent infinite `sleep`\n - Update backports management\n - Pin nextcloud to v20 on Bionic\n - Code quality cleanups\n - Allow subdirectories in `/etc/nginx/apps`\n - Removed ungraceful ExecStop command for `deluged`\n - \\*arr scripts are becoming more uniform\n - Ensure swizzin directory perms stay correct between updates\n - Moved to opt:\n   - Lounge\n   - sabnzbd\n - Add config purging to ombi\n - Use upstream removal script for netdata\n - Add equivalent of apt-get install --only-upgrade to `apt_install`\n - Moved unzip to global depends\n\n### Fixed\n - qBittorrent depends were getting a bit too heavy. All deps are installed without use of recommends for qBittorrent and qt-related libraries.\n   - ***FOCAL ERRATA:*** By default, focal recommended to install an entire x server, mesa, gnome3 and a display manager, gdm, simply for requesting two qt development packages. If you find your server \"crashing\" or stop responding, it's probably suspending due to power management provided by `gdm`. Gnome 3 is an entire desktop package and the entire x11 server along with gnome3 and gdm can be safely purged if you run a headless server. If you installed gnome or a gui on purpose, you know who you are.\n   - It does not appear Debian has ever had this issue.\n - Fixed an issue with nginx + remote torrent adder extension & php\n - Lots of bug fixes all throughout qbit and deluge scripts during rewrite\n - Refine panel (`swizzin`) user permissions and abilities\n - Circumstances in which transmission did not install nginx proxy (all of them)\n - Cat and mouse with python2/pip2 and focal\n - `box upgrade curl` broke a couple times but we fixed it (it's been a long time since we posted a changelog...)\n - jellyfin:\n   - cache and metadata paths\n   - nginx proxy ip\n - fixed an issue with pyload and setuptools>45 (aka python3 only setuptools)\n - qBittorrent: made the systemd service more graceful\n - Emby and JF cannot be installed side by side, so you will be prevented of this scenario.\n - organizr v21 fixes\n - various pyenv fixes\n - fixed ~/.config permissions to ensure the user always owns this\n - fpm compilation in focal\n - typo in jackett updater script that was causing it to fire unconditionally\n - stretch-related pip maintenance\n - typos in various echos\n - Hotfix jellyfin baseurl and bind ip settings during setup\n - Basic auth was protecting emby for some reason\n - Ensure sonarr is using the correct branch when running its nginx config\n - Fix sonarr timeout when waiting for heartbeat\n - boost mirror died, updated main and added a backup\n - rtorrent mirror died\n   - recreated approximate patch-set of the tarball shipped from rtorrent.net for 0.9.6 and patched rtorrent for bullseye\n - ruTorrent: Ensure /srv is created, get rid of cds, remove cloudscraper and python dep\n - Don't spam syslogs with trasmission chatter\n - python2 virtualenv installation of focal/bullseye\n - ensure users can read their own wireguard configs\n - set Let's Encrypt as the default certificate authority (acme.sh now defaults to zerossl)\n - fixed bazarr config for sonarrv3\n - Fixed a few erroneous paths in lounge scripts\n - Fixed a scenario which would cause `box upgrade sabnzbd` to fail\n - bad service name in resilio sync updater\n - kill `box chpasswd` if user does not exist\n - bazarr deployment method has been moved to github releases due to compiled translations\n\n### GitHub Meta\n - Updated issue template that we hope is easier to fill out\n - No longer auto closing issues\n\n### Developer Meta\n - PR Template\n - Use conventional commits to explain changes\n - Utilize CI to make PRs easier\n - Contributing guidelines updated\n - Code is linted for formatting\n   - We format with spaces. I can't help if spaces make you feel some kinda way.\n - Editorconfig and workspace preferences for development\n - vscode snippets to make life easier for repetitive functions\n - Recommended extensions to ensure your code is formatted properly\n\n## [2.6.0]\n\n## October 8, 2020\n\n### Added\n- Sonarr v3. Rejoice!\n- A couple new global depends (`box update` to get these)\n- `apt_install` now accepts `--no-recommends` as a parameter\n\n### Fixed\n- qBittorrent was going a little *too* happy when installing depends. qBit will not install recommended pacakges anymore when building.\n  - For folks running qbit already, three packages were identified as starting unnecessary services. The following packages are safe to stop their services and/or remove them as well if you had them installed through the qBit build pipeline. ***PLEASE DOUBLE CHECK THESE YOURSELF AND IF IN DOUBT DISABLE SERVICES BEFORE REMOVING THEM!!!!***\n    - avahi-daemon (Bonjour, aka, LAN Device Discovery)\n    - wpasupplicant (Used for configuring wifi access points)\n    - modemmanager (Used for configuring modems)\n- Fixed qBit password changing with `chpasswd`\n- Fixed force reannounce in the libtorrent 1.2 python binding\n- Transmission was improperly setting RPC port when adding multiple users\n- Fixed transmission watch directory creation\n- Wireguard will now output some debug info in the event of a `modprobe` failure\n- Ported python helper scripts to python3\n- Jackett complete removal\n- Specify `python2.7` as `python` and `python2` are not guaranteed to work under Ubuntu Focal Fossa\n- Usernames identified as causing conflicts have been blocked during setup. (i.e. `swizzin` and `admin`)\n\n## [2.5.1]\n\n## September 25, 2020\n\nThis is a maintenance release for bugs discovered within the past few days\n\n### Fixed\n- Added a check for whether or not the new `apt_install` function is correctly sourced during updates. The updater will prompt you to restart if needed.\n  - This is because apt functions are now sourced in `box` rather than individual scripts. When running the update for the first time, box is using the outdated version which doesn't source `apt`. `apt` is correctly sourced on the next run.\n- Ensure Deluge and qBittorrent have nginx upstreams configured correctly when adding a new user. Deluge was a regression, qBittorrent was an oversight\n- Apt keys are now appropriately imported when installing x2go (apt function regression)\n- Removed `--skip-update` flag from apt function (it was made redundant)\n- Fixed the `skip_libtorrent_rasterbar` function for Deluge 1.3.* users\n- Various update script fixes and improvements (less apt spam, less random app restarts)\n- ruTorrent installer has been restructured to do less work when adding a new user\n- Wireguard fixes and improvements:\n  - Buster will now use backports. Stretch still uses unstable with adjusted pin priority.\n  - Improved default interface recognition\n  - Fixed non-default interface selection showing only one interface\n  - Install wireguard with recommended packages to ensure kernel headers are also installed (required for dkms builds)\n- rclone will now use `--allow-other` by default\n- rclone removal is now a bit more complete (will leave rclone config though)\n\n## [2.5.0]\n\n## September 22, 2020\n\nLots has happened in the past few months, thus the relatively arbitrary 4 minor version jump.\n\nAs a point of business, both myself and flying-sausage are now accepting donations for the project through github sponsors. Please do consider donating to either of us as your contributions help us stay motivated to keep bringing you new features and work on maintaining the project.\n\n[liaralabs](https://github.com/sponsors/liaralabs)\n[flying-sausages](https://github.com/sponsors/flying-sausages)\n\n### Meta (Repo) Changes\n- [Discussions](https://github.com/liaralabs/swizzin/discussions) have been enabled! Please use this area instead of Issues for general project related chat and help. Otherwise, we can be found in Discord\n- Issue links have been reworked to prevent folks from opening tickets without the bug report template\n- Issues will be automatically closed if they are stale or do not follow the template.\n- README badges. Fancy!\n- Codefactor and Codacy support to help keep our repository well-coded.\n- flying-sausages has been hard at work to bring you things like the [Contributing Guidelines](https://github.com/liaralabs/swizzin/blob/master/CONTRIBUTING.md). If you are interesting in creating a pull request, please make sure you read these so your work is in line with the rest of the repository\n\n### Added\n- Transmission\n- Webmin\n- qBittorrent\n- Organizr\n- Mango\n- DuckDNS\n- Libtorrent will now run some checks to see if you can skip compiling libtorrent when upgrading/installing Deluge or qBittorrent. You can force a skip of the libtorrent compile by using `export SKIP_LT=True` before running a script which calls the libtorrent functions (Deluge/qBittorrent)\n- Libtorrent can be patched during compile (e.g. settings pack). Just make sure the file `/root/libtorrent.patch` is present and it will be applied during libtorrent compiles.\n- NZBHydra2 and an automated migration assistant. (`box upgrade nzbhydra`)\n- Many new functions have been added for utility and apt purposes. This only concerns folks who intend to write contributions to the project. Mostly `apt` and `utils`\n\n\n### Updated\n- SABnzbd now has an upgrade script and will install `sabyenc` with pip\n- Python applications have been moved from home directories to `/opt`. The majority of python packages now rely on virtual environments so that their packaging does not affect your system. Virtual environments are typically found at `/opt/.venv`.\n- `setdisk` (the quota setting tool) has been rewritten\n- `box` won't keep changing permissions on the swizzin repo now, so `box update` will be quieter\n- `letsencrypt` will now run some checks for supported tlds when using the CloudFlare option\n- `letsnecrypt` will not automatically stop/start nginx when certs are issued in standalone mode (i.e. not the default domain)\n- Setup now is a bit more explicit about master user creation, whiptail dialogs are a bit bigger\n- vsftpd and ZNC let's encrypt hooks are now smarter and more resilient\n- Tautulli now uses Python3\n- SickChill now uses Python3\n- Wireguard is now multi-user friendly\n- XMLRPC has been pinned to a stable version for rTorrent stability\n- Filebrowser now has an upgrade mechanism. `box upgrade filebrowser`\n- setup will error and quit if for any reason the initial adduser or password creation fails\n- rclone install script is now actually useful\n- ZNC PPA for Focal\n\n### Removed\n- Changes to `/etc/skel` have been removed. Your skel is safe now.\n- NZBHydra 1 has been deprecated.\n\n### Fixed\n- Link the fancyindex module directly if it doesn't exist in the nginx directory\n- Fix bazarr working directory on updates\n- Ensure Deluge-web files are removed with Deluge\n- Python2 virtualenv functions on Focal\n- Don't attempt to downoad mono 5.18 on Focal (new version in focal repos)\n- php restart uses the detected version rather than whatever was defined in your nginx conf\n- irssi/autodl was not properly being destroyed if a user was deleted\n- Remove screen-related directories when removing a user\n- deluge-web.lock is now properly created during install\n- rTorrent logging during upgrade actions\n- SABnzbd 3.0.* is incompatible with feedparser 6.0.0\n- Quassel core installs on Buster\n- Ensure held packages are changed if we want to make changes to them\n- Deluge install would mess up permissions on the `~/torrents` directory if the installer created that directory.\n- Deluge install now adds users to the `www-data` group which fixes web access if rTorrent wasn't installed.\n- Jellyfin repo location was changed\n- Bazarr pip install was causing issues\n- Lidarr now installs libchromafp\n- vsftpd didn't have a remove script\n- Bazarr logging would clobber the log file\n- An issue with the order of operations in x2go install\n\n## [2.1.0]\n\n## April 28, 2020\n\nThis is a **massive** release! Over 100 files have been touched and updated with new standards and new ways of handling things like python packages. Special thanks to [@flying-sausages](https://github.com/flying-sausages) for all their help in getting this release ready and offering help with code review.\n\n### Added\n- Support for Ubuntu 20.04. This includes marginal python2 support and support for Deluge 1.3.15. Please be advised this may be the last LTS release which supports 1.3.15.\n- Jellyfin media server ([@userdocs](https://github.com/userdocs))\n- Librespeed speedtest page for your server ([@hwcltjn](https://github.com/hwcltjn))\n- New functions for python2 virtual environments, PHP version management ([@flying-sausages](https://github.com/flying-sausages)) and a general place for repeated utils.\n- pyenv has been added to add support for python versions which aren't natively supported by the OS\n- pyLoad will now automatically configure itself, removing the need for user setup\n- `box upgrade curl` will compile the latest version of curl on your server to help combat the curl bug present in Debian Buster.\n- sabnzbd now has an upgrade script: `box upgrade sabnzbd`\n\n### Updated\n- Most python applications will now utilize a virtual environment in the master user's home directory\n- Applications which support Python3 have been upgraded to use it.\n- `service` commands have been removed in favour of `systemctl` to create a standard of service management\n- `nginx-extras` will no longer be installed. `nginx-full` + the fancy index modules is enough and requires less packages (`extras` modules that are unused were causing new bugs in focal)\n\n### Removed\n- Support for Debian Jessie has been officially removed\n- The CSF package has been removed. You may still remove the package with `box remove csf` but you can no longer install it.\n- python-pip is not a global depend and has been removed from the initial setup\n\n### Fixed\n- Version 3.7.7 was accidentally hard-coded into the pyenv virtualenv function\n- Lounge lockfile was incorrectly named\n- `setfacl` was incorrectly called as `setacl`\n- Update scripts should not start services if they were left in a disabled/stopped state\n- An issue in the panel update script was resetting custom profiles, this has been fixed.\n- `box update` now updates the panel again\n\n## [2.0.0]\n\n### March 30,2020\n\n### Added\n- swizzin no longer uses the quickbox_dashboard for system and service information. Introducing a new in-house panel for swizzin by swizzin with <3.\n\n### Updated\n- bazarr will now use python3\n\n### Removed\n- quickbox_dashboard has been permanently removed.\n\n### Fixed\n- GitHub API changed the output of some of their commands. Autodl was having some issues as a result, but the API change has been worked around.\n- Some services which were stopped by the user were restarted erroneously during `box update`\n- Deluge 1.3 installs will no longer utilize the `-dev` tag\n- Ensure rapidleech sets group permissions for www-data\n- Ensure rapidleech nginx conf is actually removed\n- SickGear had some install issues\n- Libtorrent lock was not properly detected in deluge installation\n\n\n## [1.7.0]\n\n### February 3, 2020\n\n### Added\n- xmr-stak has been deprecated and xmrig has been added in its place. The next time you run `box update`, the script will force an upgrade as long as the `/install/.xmr-stak.lock` continues to exist\n\n### Fixed\n- acme.sh (the let's encrypt backend) recently added some checks which could make using the let's encrypt script impossible if calling it by sudo. All acme.sh commands are now \"forced\" to bypass this.\n- Some users have connection issues with certain clients, over SSL. This change should help fix that.\n- Fixed a permission issue on new Jackett installations that was causing configuration parameters to not be saved and persist across restarts.\n- Removed duplicate proxy headers for Jackett nginx config\n- Fixed an issue with jackett failing to automatically update properly.\n- Tautulli's internal updater was broken, it is now fixed.\n- Update nextcloud nginx configuration for CVE-2019-11043\n- Radarr permissions on `~/.config/Radarr` were a bit too permissive.\n- Ensure user belongs to emby group.\n- A few uninstall packages were leaving crumbs.\n- Various `quota` package issues (#239)\n- Bazarr package was slightly (mostly) broken\n- Mono update logic\n- Plex claim token wasn't quite claiming properly\n\n### Changed\n- ZNC will search for a backports/PPA version before using the main repo.\n- Panel `sudo` commands will no longer log output to `/var/log/auth.log`\n- Added the AdoptOpenJDK repo to ensure buster supports Java 8 for subsonic.\n- Emby scripts will utilize github for all actions now\n\n## [1.6.0]\n\n### September 2, 2019\n\n### Added\n\n- Support for Deluge v2 for all OS except Debian Jessie\n- \"Repo\" install option for rTorrent\n- Option to claim plex server during installation\n\n### Changed\n\n- Nodejs will now install version 10 LTS\n\n### Fixed\n\n- Sonarr apt repo signing key\n- npm installation\n\n## [1.5.1]\n\n### August 2, 2019\n\n### Changed\n- Refactored code to remove useless cats\n- Disable automatic updates for Jackett due to broken updater (for now)\n\n### Fixed\n- Changed SSL function password name to prevent variable clobbering on first setups\n- Disable lightdm to prevent circumstances where servers might suspend after installing x2go\n\n## [1.5.0]\n\n### July 23, 2019\n\n### Added\n\n- Documentation :boom: Please visit https://swizzin.ltd/docs. The wiki has been deprecated. Pull requests on the docs are welcome at https://github.com/liaralabs/docs.swizzin.ltd. Merge requests will automatically rebuild.\n- Support for Debian 10 (may still be bugs)\n- Support for PHP7.3\n- Bug report templates. Please use these for creating descriptive bug reports the first time, every time.\n- Spanish language support for panel\n\n#### Package Additions:\n\n- Filebrowser 2 (thanks to userdocs)\n- Bazarr\n- Lidarr\n- rTorrent 0.9.8 enabled\n\n### Changed\n\n- Many long-winded and re-used functions have been branched to separate function files for ease of future updates. Update the code in one place rather than 3. (eg. mono, rtorrent, deluge)\n- Debian 10 did not ship with checkinstall, thus a new package mangaement application has been pulled in: `fpm`\n- Split libtorrent compile function from deluge to prep further applications requiring libtorrent.\n- Migrated jackett to non-mono version.\n  - Beware, known issue: https://github.com/Jackett/Jackett/issues/5208\n- Update `ip` variable for `iproute2` version 5 compatibility (for use with xanmod custom kernels)\n- Update mono snapshot to 5.18. Less memory leaks! :tada:\n- Nextcloud version support has been limited to v15 for operating systems which will not upgrade beyond PHP7.0, as nextcloud has dropped support for 7.0 in its latest versions.\n- SickRage is now SickChill\n- Update sabnzbd to stable branch (khnielsen)\n- Update ruTorrent script for new plugin depends\n- rTorrent builds other than feature-bind have been re-enabled for all supported operating systems due to instability in `feature-bind`\n- Lounge script has been updated for v3 features\n- Plexpy is now Tautulli (I still can't spell that)\n\n### Fixed\n\n- Permissions on the `/etc/nginx/ssl` directory were global readable. This has been resolved.\n- Longstanding typo in Jessie for adding the dotdeb php repo key\n- Stuck jackett install :tada:\n- Added checks to `box adduser` and `box deluser` to prevent clobbering and potential data loss issues.\n- Removing flood will no longer remove ruTorrent (oops!)\n- xmr-stak build script for new PoW algorithms\n- systemd nofiles limit was too low\n- Emby install location\n- GPG key add for x2go on Debian\n- sabnzbd dependency issues during install\n- Stray exit 0 in update scripts was causing the update process to terminate early.\n\n## [1.4.0]\n\n### November 15, 2018\n\n### Added\n\n- Wireguard VPN package. Rejoice!\n- VSFTPD and ZNC will now use your Let's Encrypt certificate. (d2dyno)\n\n### Changed\n\n- Simplified the rclone install script. (d2dyno)\n- Plexpy is not Tautulli. (ooohhh)\n- deluge-console will now be installed if choosing a \"repo\" install. (quarreldazzle)\n- Ubuntu installer will now enable universe/multiverse repos\n- xmlrpc now uses the advanced version to fix message flooding in the rtorrent gui (kennydeckers)\n- Mono will use snapshot v5.8 to prevent issues arising from new versions (\\#fuckmono)\n\n\n### Fixed\n\n- Fixed xmr-stak to use the new Monero PoW algorithm\n- Radarr archive names changed slightly, fixed to ensure they still unarchive proper\n- Fixed Ombi not starting\n- Libtorrent sometimes failed to create a .deb file during compile (quarreldazzle)\n- Emby URL structures to prevent install errors (kennydeckers)\n- Jackett issues due to their new webserver implementation\n- quota.lock wasn't created during install sometimes\n- Make /opt if not existing\n- `box deluser` will forcefully kill processes of users who are being deleted\n- Headphones reverse proxy\n\n### Removed\n\n- clean_log function was useless\n\n## [1.3.0]\n\n### April 27, 2018\n\n### Added\n\n- Support for Ubuntu 18.04 (Bionic Beaver). Compatibility has not been thoroughly tested; however popular apps (rtorrent, nginx, deluge, mono-based, sickrage, etc) have been tested and should be working. Please report any issue you may have.\n- Upgrades from 16.04 to 18.04 should in theory be possible. The biggest change at this time is the transfer to php7.2 from php7.0. The update script accounts for this, but it might not be perfect!\n\n### Removed\n\n- Support for EOL Ubuntu 17.04.\n\n### Changed\n\n- Mono will now utilize the 4.8.1 snapshot for all mono-based applications. This will hopefully prevent breakage due to bleeding edge mono updates and reduce frequency of updates. It became clear that there were some issues in general with Debian Jessie and these compatiblity issues should now be fixed as well.\n- RPC mount (/{username}) will now be configured for Flood as well, even if ruTorrent is not installed (Compatibility for Sonarr/Radarr)\n- Updated the xmr-stak script to account for the PoW changes from the recent hard fork.\n- Added env_keep home for Ubuntu installs to negate the need to use `sudo -H` to reset your home folder to root every time.\n- swizzin custom path reverted back to being set in .bashrc as .profile was causing issues for the majority\n- btsync now runs as master user to prevent permission issues\n\n### Fixed\n\n- Only run ruTorrent plugin initialization on first install\n- Ombi install/upgrade issues (upgrade to v3 should be soon)\n- Update headphones PID path to prevent permission errors after reboot\n- Emby repository issues under Ubuntu\n- Removed some unneeded commands in rTorrent that might throw (ignorable) errors\n- Panel update script should now respect your diskspace widget settings (home or root)\n- Panel update script should now respect your custom.menu.php\n- Small issue with the shellinabox systemd script\n- Ensure ruTorrent plugins are properly initialized during rtorrent start\n- Cleaned up a few straggling files that might've been left behind when deleting a user\n- Fixed an issue where deluge configs for nginx weren't being generated for sub-users\n- Fix an issue where php files in rtorrent/deluge download folders were being returned as a 404 -- this fix allows them to be served directly as downloads (php will not be executed in these folders as it is a security issue)\n\n## [1.2.0]\n\n### March 3rd 2018\n\n### Added\n\n- `rtx` or `box rtx` command for ruTorrent extras management like themes and plugins. The interface should feel similar to the installer/traditional box interface as it basically reuses the same code ;) Also added a few new plugins not currently included (fileshare, pausewebui, etc) that can be installed post-setup.\n\n### Changed\n\n- rTorrent will now use unix sockets rather than TCP sockets. While the TCP implementation was secured properly to prevent external access, there was still an issue of trust for local users (any user could access a TCP socket and execute arbitrary commands). This allows a finer grain of control for permissions and is ultimately the more secure/better way to implement the RPC layer.\n- Some under the hood improvements for box add/remove user functions\n- Added bold-red post install info to help people better understand that box will not function unless you `source /root/.profile`\n- Cleaned up some old references to xmr-stak-cpu in the xmr-stak script\n- Removed some unused permissions\n\n### Fixed\n\n- npm permissions for global installs\n- Ensure all ruTorrent nginx confs are removed if ruTorrent is removed.\n- systemd execstart for nzbget to be compatible with older versions of systemd (Ubuntu 16.04)\n- Ensure .master.info is rewritten with current password info if master user password is changed with `box`\n- Netdata appstatus in panel\n- Let's Encrypt installer was overwritting the default config certificates even when told not to.\n- Nextcloud compatibilty for Debian Jessie\n- Ensure home folders are not readable for \"Others\"\n- Ensure user's lounge accounts are also removed during `deluser`\n\n## [1.1.1]\n\n### January 21st, 2018\n\n### Changed\n\n- Nginx reverse proxies will now default to the $host header rather than $proxy_host\n- Don't use apt in scripted scenarios, use apt-get\n\n### Fixed\n\n- Ubuntu 17.10 compatibilty for Emby Media Server, Plex Media Server and NextCloud\n  - NOTE: Plex's apt repository is technically not compliant with the new version of Ubuntu and thus you **will** see warnings on Ubuntu 17.10 each time you `apt update`. This is not in my control. I suggest you comment out the repository in `/etc/apt/sources.list.d/plexmediaserver.list` and `box upgrade plex` to use the update script to avoid warnings.\n- Better sed matching for potential changes in the fancyindex naming\n- Updated depends in various packages to improve stand-alone functionality\n\n## [1.1.1]\n\n###January 10th, 2018\n\n### Fixed\n\n- Full compatibility for php7.1 (Ubuntu 17.10)\n  - Ubuntu 17.10+ now defaults to php7.1. The installer will now attempt to detect which php version you are running and compensate as needed.\n  - There is now an update nginx script (run with `box update` that will future-proof your installs by installing the appropriate metapackages (php-fpm vs php7.0-fpm) and  update your nginx configs to use php7.1 (if needed), so that if/when you update Ubuntu 16.04 to the next LTS version in a few months, you'll be covered! After running dist-upgrade, simply run the `box update` or `box upgrade nginx` command to reconfigure your confs.\n\n### Changed\n\n- rTorrent installs will now default to the \"feature-bind\" branch (git development version) if you are using Debian 9 or Ubuntu 17.10+. If issues arise, I may re-enable the patch route; however at the moment no patches are needed to compile rTorrent on Stretch or Artful. Additionally, feature-bind has been enabled on older branches (Ubuntu 16/Debian 8) as well.\n  - PLEASE NOTE: rTorrent has deprecated certain RPC calls in the new version. If you use filebot a post-processing script with rTorrent, rTorrent may fail to start because your configuration holds deprecated values. Please see [here](https://www.filebot.net/forums/viewtopic.php?f=4&t=4765) for info about updating your post-process command.\n\n## [1.1.0]\n\n### December 28th, 2017\n\n### Added\n\n- [xmr-stak](https://github.com/fireice-uk/xmr-stak) xmr-stak-cpu has been deprecated. New dev fee minimum is 1.0. If you find this fee appaling, compile xmr-stak yourself and consider donating to the xmr-stak project.\n- [The Lounge](https://thelounge.github.io/) - An IRC web client\n- [nzbget](https://nzbget.net) - The most efficient usenet downloader (their words, not mine)\n- [SickGear](https://github.com/SickGear/SickGear) - An alternative fork of SickRage/pyMedusa\n- Standalone mode for Let's Encrypt -- run the installer as many times as you like\n- grsec kernel removal to the initial setup and by `box rmgrsec` in the event you have an ovh server and would like to remove it (recommended for panel and xmr-stak)\n\n### Changed\n\n- autodl2.cfg has been deprecated in the autodl package, removed dependency upon this file.\n- Fancyindex updated with a light and dark theme. Default to dark\n- A few things in the way the panel handled nzbget/sickgear and added The Lounge\n- rtorrent ExecStop method in systemd is now slightly more graceful than killall\n\n### Fixed\n\n- Certain cases where lib-fcgi might not have gotten installed\n- An autodl update caused button overflow to the club-QuickBox theme which broke the filters tab\n- New users weren't displaying passwords if automatically generated\n- Jackett is no longer finicky about the trailing slash in its URI (/jackett)\n- Certain conditional error logic might not have exited a script when it should have (e.g. Let's Encrypt)\n- New users didn't have permission to manipulate their flood service with systemctl\n- Bugs seemed to have wormed their way into the SickRage reverse proxy. This is fixed.\n\n### Removed\n\n- xmr-stak-cpu install script. The remove script has been left so that you may remove it before upgrading to xmr-stak\n\n## [1.0.1]\n\n### December 9th, 2017\n\n### Added\n\n- Update sub-scripts to fix errors that may be present in existing installs. Will take two runs of `box update` to run for the first time.\n- Support for Ubuntu 17.10\n\n### Fixed\n\n- Updated dependencies for a few packages to prevent installation errors during minimal installs\n- Fixed an issue in the QuickBox dashboard that prevented installed applications from appearing the service manager\n- Sudo permissions sub-users (to restart rtorrent, chpasswd and the like)\n- PID permission issues in pyLoad\n\n\n## [1.0 Stable]\n\n### November 18th, 2017\n\n### Changed\n- Flood now requires node-gyp to build\n- ruTorrent now ships with a spectrogram plugin. sox is now installed as a dependency for ruTorrent\n\n### Fixed\n- `box chpasswd {user}` wasn't printing the password if it was generated randomly\n- Certain fringe ruTorrent installs might not have a required dependency for geo-ip resolution\n\n### November 13th, 2017\n\n### Added\n- ruTorrent now ships with a spectrogram plugin for analyzing audio files. Thus, installer now installs sox and applies the correct config for binary location\n\n### Changed\n- Default proxy addresses to 127.0.0.1 to avoid DNS resolution errors for localhost\n- Fixed flood installer for new build steps\n- `box help` is now a bit more helpful\n\n### Fixed\n- Subsonic install/reverse proxy issues\n- pyLoad install and configuration should now run properly\n- Fringe scenarios in which quotas might not apply fstab edits correctly\n- rtorrent download folder permissions for subusers\n- libfcgi binary wasn't being installed on Debian 9 and newer Ubuntu versions\n- `box upgrade plex` -- this command should not be run as root\n\n## [1.0.0 Pre-Stable]\n\n### October 9th, 2017\n\n### Added\n- php7.0-mbstring was missing from the nginx installer. This may have caused php errors in ruTorrent under rare circumstances.\n\n### Changed\n- Refactored keyserver calls for mono, sonarr and sabnzbd-extras repositories\n- Removed python-software-properties in favour of allowing it to be marked for installation automatically with software-properties-common\n\n### Fixed\n- Certain do or die commands were missing parenthesis causing the exit to trigger unconditionally. These have been fixed.\n- Removed reference to removed function _ruconf in scripts/install/rtorrent.sh\n- `box panel fix-disk root/home` will now function properly again (the refactor of quickbox_dashboard left it non-functional)\n- Quota installer may have failed due to the installer's inability to match a pattern. Pattern has now been expanded to include tab characters and should fix any issues.\n\n### September 29th, 2017\n\n### Changed\n- Disabled HSTS in nginx SSL params. [Why?](https://github.com/liaralabs/swizzin/commit/5f9af8d3dea9ebd06fa072c322f8fa7b54b431b2)\n- Moved swizzin PATH variables from bashrc to profile\n- Moved panel installation script to nginx directory and left a wrapper in its place\n- `box update` will now update the panel as well. In the event that `git reset HEAD --hard` fails to reset the panel repo to a pullable state, a backup and restore function will run.\n\n### Fixed\n- Updated Plex repository location\n- Flood script cleanup\n- box chpasswd was using an incorrect variable to insert the password into deluge-web hostlists\n- rTorrent removal script had a syntax error\n- Added a github mirror for xmlrpc-c in the event that SourceForge goes down for an extended period again\n- Cleaned up the new GUIs function in the installer to ensure that the autodl plugin for ruTorrent installs properly if it should be installed\n- Panel: lang_de script attempted to cat its config into the wrong file.\n- Other minor fixes\n\n## [1.0.0-RC2]\n\n### September 21st, 2017\n\n### Added\n- Flood is now available!\n  - If you have nginx installed, you can access it from the web at /flood. Otherwise, flood port will be printed upon install. Please note, SSL is not currently configured for non-proxied configurations. If you need SSL without nginx, you will have to configure it yourself.\n  - Flood has a complimentary upgrade script. `box upgrade flood`\n  - Please note that there are currently some bugs when using both Flood's authentication and nginx basic authentication. You might need to complete nginx authentication a couple times. Flood authentication will be disabled once the option exists. Until then there is no fix.\n- box now has an upgrade function to run scripts in the scripts/upgrade directory\n  - Current scripts: deluge, flood, nginx, ombi, plex, rtorrent, rutorrent\n- Logoff plugin for ruTorrent\n\n### Changed\n- ruTorrent has been decoupled from the rTorrent installation. (run `box upgrade rutorrent` or `touch /install/.rutorrent.lock` if you already have ruTorrent installed.)\n  - If you need ruTorrent please be sure to check both nginx and ruTorrent during the initial installation. A web interface will *NOT* be installed by default.\n- rTorrent uninstall will now purge *ALL* related packages (ruTorrent and Flood). Be careful!\n- Quickbox Dashboard has been rebased with the latest changes\n- Made error for usernames with capital letters more noticeable.\n\n### Fixed\n- Let's encrypt script now checks for nginx before running\n- Master user is now given sudo permission in setup.sh not install/rtorrent.sh (oops!)\n- Upstreams in /etc/nginx/conf.d were not being removed if extra users were deleted\n- Fixed a bad else statement in xmr-stak-cpu installer\n\n### September 13th, 2017\n\n### Added\n- Dynamic Deluge reverse proxies (/deluge)\n- Dynamic Deluge and rTorrent download directories for nginx (/rtorrent.downloads & /deluge.downloads)\n- Upgrade scripts (these are not tied into box yet. Please run them manually at this time)\n  - nginx (resets configurations to swizzin defaults)\n  - rtorrent (recompile and change version if wanted; refresh depends)\n  - deluge (recompile and change version if wanted)\n  - plex ([updateplex](https://github.com/mrworf/plexupdate) by mrworf)\n  - ombi\n- Compile mktorrent from source for -s flag (19c823362fb69743a5b6178fecbedffb781ace74)\n- Add panel fix-disk to box `box panel fix-disk` (for root or home disk widget) (c45f9ae6a269b3a97d9511bca74ac0cea9fab691)\n\n### Changed\n- Removed package management from the quickbox panel. Please use box for everything.\n- irssi systemd ExecStop method gentler (73f2ca8c19f083e692efef71a0eae69b395dda0b)\n- Package sources for ZNC (1fa52d8c3c809fa00527b0760ecea0b8bf40a748)\n- Move stop/start functions in nginx configuration scripts to inside the script to support stand-alone install (for example, if you chose to install nginx after your initial install) (4d92eea4443e4d3f84f47e8df71bdc1a582ec27f)\n- Under-the-hood improvements for box (475aadadd71d8ab4990607e4493e40ffbbe10423)\n- Current subsonic version is now determined automatically (6be077e7fec1b62516086a1fe546a2d9595e8152)\n\n### Fixed\n- Overzealous sed function in nzbHydra (9b9635a1083333ec55bd867c185445c172ff6a59)\n- box adduser will no longer ask for the rtorrent version when adding a user (98502de5a6e5f0a833729e84e419ebda7f943834)\n- Lots of other bugs\n\n## [1.0.0-RC1]\n\n### Added\n- pyMedusa package\n- netdata package\n- shellinabox package\n- xmr-stak-cpu package (monero miner or dev donation method)\n- php-fpm-cli to allow functions like clearing opcache without needing to disconnect current web sessions\n\n### Changed\n- ZNC now uses systemd\n- Deluge-web will now automatically connect to the default daemon (you will still need to connect the first time)\n- vsftpd intial config (3af310d4d73301a0c896610a412cbcc2adf5ad4c)\n\n### Fixed\n- Fix for providers who ship noexec on temp (Leaseweb)\n- Ensure scripts which use PPAs install software-properties-common before attempting to add\n- Add php directive to ruTorrent to ensure plugins like httprpc are actually functioning for their intended usage (6e4f9c8c697efc838928ba4d0d45dbe9d705659d)\n- Nextcloud is functional\n- quota installer is more useful\n- proxy_redirect will no longer attempt to redirect to localhost\n- prevent nested while loops creating infinite loops\n- emby install issues\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 14.142578125,
          "content": "# TL;DR:\n\n1. Familiarize yourself with the documentation and code available at [swizzin Dev Docs](https://swizzin.ltd/dev/).\n1. Make sure your PRs are from and targeted to the `develop` branch.\n1. PRs should meet specific criteria, including a completed checklist\n    - If your PR doesn't meet the criteria, mark it as \"Draft PR\" and optionally prepend the title with `WIP:`.\n1. Follow the 4-space indentation style in bash code, use `shellcheck` to catch errors, and add helpful comments for reusable code.\n    - Use recommended VSCode extensions, and install required plugins/tools using `pre-commit install`.\n1. Place new software installations in `/opt`, configurations in `~/.config/`, and logs in `/root/logs`.\n1. Ensure scripts are compatible with unattended installations through environment variables.\n1. Use the provided `apt` handling functions and override default behaviors using available options.\n1. Use the functions exported from `sources/functions/color_echo` for terminal prints and logging.\n1. Use service files for application management \n1. Describe user management for your application when necessary.\n1. Create documentation pages on the [Swizzin Docs](https://github.com/liaralabs/docs.swizzin.ltd) repo for new applications.\n\n----\n# Contributing guidelines\nHere are a couple things to take into account when contributing to swizzin.\n\nThere is a large amount of further documentation and guidance available in our docs https://swizzin.ltd/dev/. You are expected to familiarise yourself with the documentation and the code.\n\nIn case anything is not clear, we're always happy to explain and teach why/how these things are done; feel free to come talk to us in our Discord.\n\n## Merging against the `develop` branch\nAs we use the git flow, please make sure to make your PRs from the `develop` branch, and target the `develop` branch for the PRs.\n\nChanges will make it to the master in releases.\n\n## Requirements for consideration\nWe expect the following criteria from a PR. You're more than welcome to ask us how to achieve any of these that you are not familiar with, and we'll be happy to help.\n- A completed checklist\n- No `shellcheck`/`shfmt` errors or warnings.\n- A proof of the changes being tested\n\nYou are welcome to submit PRs that do not fit this spec, but they are required to be marked as Draft PRs and preferrably pre-pended with `WIP: ` at the beginning of the PR title. If that is the case, please mention what your outstanding TODOs for the PR are.\n\n## Editor plugins and tooling\nPlease note that Extensions for VSCode should pop up as \"recommended extensions\", so just open it up and install them in one click!\n\n### Required\nPlease make sure that you have the following plugins and tools installed and working correctly.\n\n**NOTE**: You can install these with [`pre-commit install`](https://pre-commit.com/#install) and they will be applied before you make your commit\n\n- `shellcheck` [VSCode Plugin](https://marketplace.visualstudio.com/items?itemName=timonwong.shellcheck) and [Binary](https://www.shellcheck.net/) (**version 0.7.1 or higher**)\n  - If you are not using VS Code with the plugin above, please make sure to catch **anything** that `shellcheck` does not like.\n  - Wherever you deem appropriate, add `#shellcheck disable=...` _inline_ to suppress the warnings.\n- `shell-format` [VSCode Plugin](https://marketplace.visualstudio.com/items?itemName=foxundermoon.shell-format) (auto-installs binary) and [Binary](https://github.com/mvdan/sh)\n  - If you are not using VS Code with the plugin above, please make sure to apply formatting with the flags mentioned in [`settings.json`](.vscode/settings.json)\n\n### Suggested\nThese are just some super useful ones we really like that you should give a shot\n- `shellman` [VSCode Plugin](https://marketplace.visualstudio.com/items?itemName=Remisa.shellman)\n    - It's just a collection of super useful snippets\n- `Bash IDE` [VSCode Plugin](https://marketplace.visualstudio.com/items?itemName=mads-hartmann.bash-ide-vscode)\n    - Offers a lot of the Intellisense features that make VSCode worth using\n\n\n## Directories and files\n- Please use `/opt` to install any new software. **Avoid using home directories to install application binaries/source**\n- When creating configuration for users, please add it to an appropriate folder under `~/.config/` when possible\n- Please make sure to put any necessary code output into the default log files for swizzin, (i.e. `swizzin.log` and `install.log` under `/root/logs`) *including* the `stderr`\n- Make sure to create `.lock` files for your application under `/install/`\n  - Record any application information that might need to be dynamically retrieved into the .lock file above.\n\n## Bash code styleguide\n\n### Formatting\nWe are a 4-space gang. Please make sure to run your code through `shfmt` with the right flags specified. Check the first chapter here.\n\n### Shellcheck\nPlease use `shellcheck` and its IDE plugins and resolve any warnings for the code you have contributed.\n\n### Code re-use\nPlease familiarise yourself with the functions available under `sources/functions` as they handle a large amount of steps you might need to do manually.\n\nA list of the files that are included on a `box` or a `setup.sh` by default are in `sources/globals.sh`\n\nWhenever you are contributing code that might be generalized and useful for other applications, please add the functions to this location. When doing so, please give a quick comment into the file on what the purpose and possible return output is. e.g:\n```bash\n# Retrieves all users that are managed by swizzin\n# Returns usernames separated by newline\n```\n\n#### Snippets\nWe have made a couple snippet definitions in the `.vscode` folder that should be getting loaded into your project whenever you open the workspace.\n\nThese should cover most of the functions included in `globals.sh`, but feel free to add yours if you have any suggestions\n\n### Return codes\nPlease use `exit 1` or `return 1` when handling exiting due to some run-time errors\n\n### Codename-based logic\nWhen making logic based on distribution codenames, please structure it in such a way that introduces as little need for maintenance in the future as possible.\n\nA practical example for this is handling packages that are no longer packaged for newer LTS releases. In such scenarios, please make it so that the \"default\" behaviour is for newer LTS releases, and the older LTS releases are treated as the outliers. e.g.:\n```bash\nif [[ $codename =~ (\"buster\"|\"stretch\") ]]; then\n  mcrypt=php-mcrypt\nelse\n  mcrypt=\nfi\n\n# Apt install line which has $mcrypt in the package list\n\n```\nIn this example, the default (`else`) behaviour triggers for current releases, and only the old ones have the modified behaviour\n\n## Handling interactivity\nPlease make sure your scripts are compatible with the custom/unattended installation options through environment variables. This means that there should be a scenario in your script, where no interaction is necessary if necessary variables are available before the script started.\n\nPlease stick to the following:\n- Pre-fix your variables with the name of the application to prevent collisions, e.g. `$APPLICATION_VARIABLE`\n- Ensure your script is checking the existance of the variable before triggering anything interactive, so that the scripts can skip over things if they are supplied through options.\n  - e.g. `if [[ -z $APPLICATION_VARIABLE ]]; then read $APPLICATION_VARIABLE; fi`\n  - e.g. `while [[ -z $APPLICATION_VARIABLE ]]; do [...] APPLICATION_VARIABLE=$verified-value [...] ; done`\n- Appropriately document the varaibles in the docs repo\n\n## APT handling\nWe have developed our own internal set of functions for handling `apt` packages in a predictable and uniform way. In the event any of these functions encounter an error, they will (with default behaviour) ensure the rest of the script will not continue. Please use the following functions and see the available options. **Refrain from calling the raw apt equivalents of the functions below.** \n\n### Functions\n* Exported and box-wide available functions. By default, the functions perform `apt-get update`s for you if the database is too old (more than 1h), runs sanity checks before installs, and checks logs for errors so the script is killed in case something went wrong. These can all be overrode with the options below.\n  * `apt_install [options] $1, $2, $3 ... [options]`\n  * `apt_remove [options] $1, $2, $3 ... [options]`\n  * `apt_autoremove`\n  * `apt_upgrade [options]`\n  * `apt_update [options]`\n* Non-exported functions which need a `source` or a `. .../apt`. Please consult the `sources/functions/apt` file to see what they do and how they work.\n  * `get_candidate_version`\n  * `_get_apt_last_log`\n  * `check_installed`\n  * ... and a couple others\n\n**FYI the default behaviour in most of the functions is to not issue `apt update` in case the last update was within an hour** with the exception of `apt_update`, which will always perform an update. It is therefore fine to issue an `apt_update` and an `apt_install`, as the update will only run once.\n\n### Options\nThe following options can be used with any of the exported functions above to override their default behaviour.\n\n* `--interactive`\n  * Run the installation stdout in the forefront and allow any end-user interaction if necessary\n  * WARNING: This is not yet fully tested\n* `--skip-check`\n  * Skips integrity checks during the command such as `dpkg` lock checking, `apt --simulate`, and a couple others.\n* `--ignore-errors`\n  * Allows script to continue in case an error was encountered, instead of killing the job script by default\n* `--purge`\n  * _Only for `apt_remove`_: performs the removal with the `--purge` flag sent to the `apt-get remove` command.\n* `--recommends`\n  * _Only for `apt_install`_: performs the installation with the `--install-recommends` flag sent to the `apt-get install` command.\n\n## Printing into the terminal\nPlease use the functions exported from `sources/functions/color_echo` that are available whenever something is ran from the context of either `box` or `setup.sh`.\n\n### Formatting prints\n* Instead of making a sequence of the same exact echo calls to make new line separation, please use the `\\n`, or make your quoted text span multiple lines (with no pre-pending white spaces) instead. THe output will be nicely indented. as a result.\n* In general, there should be no un-styled prints thrown at the end-user.\n\n### Logging\n* The `echo_...` calls mentioned below will automatically make a copy of the messages.\n* Please make sure that your `$log` variable is only used to refer to the path of the log (imported from either `setup.sh` or `box`)\n* Any application return/verbose(-ish) print should go into the log file\n  * Please make sure your `apt` calls are not `-q/--quiet` when forwarding to the log file, for example\n\n### Available functions and uses\nThe file mentioned above has a function embedded to show a couple examples of how will the resulting echo look like, please consult these in your own terminal by running the following code below. Smaller test units are available for `echo_test_wrap`, `echo_test_log` and `echo_test_basic`\n```bash\n. /etc/swizzin/sources/functions/color_echo\necho_tests\n```\nThere is a wide choice of \"styles\" to choose from, please use them appropriately. Here is a small guide on their use\n* Ensure you are correctly outputting to the log\n* Make sure the `echo_...` calls are on the \"inside of the function\", not outside and around it.\n  * TODO Clarify what his means\n* `echo_success` is meant to be the final echo printed in the event an installation was successful.\n* `echo_error` is meant to be the final echo printed in the event something irrecoverable happens, or an abortion is encountered.\n* `echo_warn` is meant to alert the user to some of the following examples:\n  * Something irrecoverable is about to happen\n  * A user-recoverable error has been encountered\n  * Basic problems with\n* `echo_info` is meant to highlight to user some important information such as the following examples:\n  * ports that have been chosen\n  * Important generated values that should be recorded\n  * necessary follow up steps\n  * pointers to documentation, etc\n* `echo_query` is meant to highlight the fact user interaction is required\n* `echo_progress_start` and `echo_progress_done` are meant to be used to \"wrap\" a chunk of code that can take a while to complete. If it takes more than 0.1s, you should probably wrap it in this. Examples could be:\n  * Doing `apt` calls like `install`, `update`, `upgrade`, etc.\n  * Generating ciphers/keys\n  * Git pulls/clones\n  * Downloads of larger files\n  * Recursive `chown`s/`chmod`s on large directories\n* `echo_log_only` is meant to store input directly into the logfile, and bypass the end user terminal entirely. Please log anything of note that could help troubleshoot anything when a user has problems, such as the following:\n  * Any generated unique values that need to match some specification (e.g. ports)\n  * Any variables that are getting assigned from either the user or from the return of a command/function\n\n\n\n## Logging\nAs mentioned above, please ensure any relevant information/print that is generated during the script is corretly forwarded to the destination of the `$log` file.\n\nIf necessary, please append the `$log` forward with `2>&1` to redirect all `stderr` to `stdout`, and therefore into the log as well. If you expect these possibilities to happen, please make sure to catch this within your script and error out too, you know.\n\n## Python applications\nAs a principle, please avoid installing Python2 applications. \n\nDue to how Python is being versioned, please see the python functions available in `sources/function/python`.\n\nPlease use virtual environments only for applications that require a specific or an outdated version of Python.\n\n## Service files\nPlease include service files for application management. Use the `%i` feature for multi-user applications, avoid for single-instance applications.\n\n## User management\nWhenever possible, please describe how is user management done within your application, and how you have adjusted `box` to handle this.\n\n## Documentation\nFor new applications, please make sure to make the necessary documentation pages on the [Swizzin Docs](https://github.com/liaralabs/docs.swizzin.ltd) repo. It's nice and convenient when you include the link to the Documentation repo PR in the PR here.\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 34.3173828125,
          "content": "                    GNU GENERAL PUBLIC LICENSE\n                       Version 3, 29 June 2007\n\n Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/>\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The GNU General Public License is a free, copyleft license for\nsoftware and other kinds of works.\n\n  The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works.  By contrast,\nthe GNU General Public License is intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains free\nsoftware for all its users.  We, the Free Software Foundation, use the\nGNU General Public License for most of our software; it applies also to\nany other work released this way by its authors.  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\n  To protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights.  Therefore, you have\ncertain responsibilities if you distribute copies of the software, or if\nyou modify it: responsibilities to respect the freedom of others.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must pass on to the recipients the same\nfreedoms that you received.  You must make sure that they, too, receive\nor can get the source code.  And you must show them these terms so they\nknow their rights.\n\n  Developers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\n\n  For the developers' and authors' protection, the GPL clearly explains\nthat there is no warranty for this free software.  For both users' and\nauthors' sake, the GPL requires that modified versions be marked as\nchanged, so that their problems will not be attributed erroneously to\nauthors of previous versions.\n\n  Some devices are designed to deny users access to install or run\nmodified versions of the software inside them, although the manufacturer\ncan do so.  This is fundamentally incompatible with the aim of\nprotecting users' freedom to change the software.  The systematic\npattern of such abuse occurs in the area of products for individuals to\nuse, which is precisely where it is most unacceptable.  Therefore, we\nhave designed this version of the GPL to prohibit the practice for those\nproducts.  If such problems arise substantially in other domains, we\nstand ready to extend this provision to those domains in future versions\nof the GPL, as needed to protect the freedom of users.\n\n  Finally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish to\navoid the special danger that patents applied to a free program could\nmake it effectively proprietary.  To prevent this, the GPL assures that\npatents cannot be used to render the program non-free.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                       TERMS AND CONDITIONS\n\n  0. Definitions.\n\n  \"This License\" refers to version 3 of the GNU General Public License.\n\n  \"Copyright\" also means copyright-like laws that apply to other kinds of\nworks, such as semiconductor masks.\n\n  \"The Program\" refers to any copyrightable work licensed under this\nLicense.  Each licensee is addressed as \"you\".  \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\n  To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of an\nexact copy.  The resulting work is called a \"modified version\" of the\nearlier work or a work \"based on\" the earlier work.\n\n  A \"covered work\" means either the unmodified Program or a work based\non the Program.\n\n  To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy.  Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\n  To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies.  Mere interaction with a user through\na computer network, with no transfer of a copy, is not conveying.\n\n  An interactive user interface displays \"Appropriate Legal Notices\"\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License.  If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n  1. Source Code.\n\n  The \"source code\" for a work means the preferred form of the work\nfor making modifications to it.  \"Object code\" means any non-source\nform of a work.\n\n  A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\n  The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form.  A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\n  The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities.  However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work.  For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\n  The Corresponding Source need not include anything that users\ncan regenerate automatically from other parts of the Corresponding\nSource.\n\n  The Corresponding Source for a work in source code form is that\nsame work.\n\n  2. Basic Permissions.\n\n  All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met.  This License explicitly affirms your unlimited\npermission to run the unmodified Program.  The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work.  This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\n  You may make, run and propagate covered works that you do not\nconvey, without conditions so long as your license otherwise remains\nin force.  You may convey covered works to others for the sole purpose\nof having them make modifications exclusively for you, or provide you\nwith facilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright.  Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies of\nyour copyrighted material outside their relationship with you.\n\n  Conveying under any other circumstances is permitted solely under\nthe conditions stated below.  Sublicensing is not allowed; section 10\nmakes it unnecessary.\n\n  3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n  No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\n  When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such circumvention\nis effected by exercising rights under this License with respect to\nthe covered work, and you disclaim any intention to limit operation or\nmodification of the work as a means of enforcing, against the work's\nusers, your or third parties' legal rights to forbid circumvention of\ntechnological measures.\n\n  4. Conveying Verbatim Copies.\n\n  You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\n  You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n  5. Conveying Modified Source Versions.\n\n  You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these conditions:\n\n    a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n\n    b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under section\n    7.  This requirement modifies the requirement in section 4 to\n    \"keep intact all notices\".\n\n    c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy.  This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged.  This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n\n    d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\n  A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit.  Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n  6. Conveying Non-Source Forms.\n\n  You may convey a covered work in object code form under the terms\nof sections 4 and 5, provided that you also convey the\nmachine-readable Corresponding Source under the terms of this License,\nin one of these ways:\n\n    a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n\n    b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the\n    Corresponding Source from a network server at no charge.\n\n    c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source.  This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n\n    d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge.  You need not require recipients to copy the\n    Corresponding Source along with the object code.  If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source.  Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n\n    e) Convey the object code using peer-to-peer transmission, provided\n    you inform other peers where the object code and Corresponding\n    Source of the work are being offered to the general public at no\n    charge under subsection 6d.\n\n  A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\n  A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal, family,\nor household purposes, or (2) anything designed or sold for incorporation\ninto a dwelling.  In determining whether a product is a consumer product,\ndoubtful cases shall be resolved in favor of coverage.  For a particular\nproduct received by a particular user, \"normally used\" refers to a\ntypical or common use of that class of product, regardless of the status\nof the particular user or of the way in which the particular user\nactually uses, or expects or is expected to use, the product.  A product\nis a consumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses represent\nthe only significant mode of use of the product.\n\n  \"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to install\nand execute modified versions of a covered work in that User Product from\na modified version of its Corresponding Source.  The information must\nsuffice to ensure that the continued functioning of the modified object\ncode is in no case prevented or interfered with solely because\nmodification has been made.\n\n  If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information.  But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\n  The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or updates\nfor a work that has been modified or installed by the recipient, or for\nthe User Product in which it has been modified or installed.  Access to a\nnetwork may be denied when the modification itself materially and\nadversely affects the operation of the network or violates the rules and\nprotocols for communication across the network.\n\n  Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n  7. Additional Terms.\n\n  \"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law.  If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\n  When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit.  (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.)  You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\n  Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders of\nthat material) supplement the terms of this License with terms:\n\n    a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n\n    b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n\n    c) Prohibiting misrepresentation of the origin of that material, or\n    requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n\n    d) Limiting the use for publicity purposes of names of licensors or\n    authors of the material; or\n\n    e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n\n    f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions of\n    it) with contractual assumptions of liability to the recipient, for\n    any liability that these contractual assumptions directly impose on\n    those licensors and authors.\n\n  All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10.  If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term.  If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\n  If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\n  Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions;\nthe above requirements apply either way.\n\n  8. Termination.\n\n  You may not propagate or modify a covered work except as expressly\nprovided under this License.  Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\n  However, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly and\nfinally terminates your license, and (b) permanently, if the copyright\nholder fails to notify you of the violation by some reasonable means\nprior to 60 days after the cessation.\n\n  Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\n  Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License.  If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n  9. Acceptance Not Required for Having Copies.\n\n  You are not required to accept this License in order to receive or\nrun a copy of the Program.  Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance.  However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work.  These actions infringe copyright if you do\nnot accept this License.  Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n  10. Automatic Licensing of Downstream Recipients.\n\n  Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License.  You are not responsible\nfor enforcing compliance by third parties with this License.\n\n  An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations.  If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\n  You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License.  For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n  11. Patents.\n\n  A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based.  The\nwork thus licensed is called the contributor's \"contributor version\".\n\n  A contributor's \"essential patent claims\" are all patent claims\nowned or controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version.  For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\n  Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\n  In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement).  To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\n  If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients.  \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\n  If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\n  A patent license is \"discriminatory\" if it does not include within\nthe scope of its coverage, prohibits the exercise of, or is\nconditioned on the non-exercise of one or more of the rights that are\nspecifically granted under this License.  You may not convey a covered\nwork if you are a party to an arrangement with a third party that is\nin the business of distributing software, under which you make payment\nto the third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\n\n  Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n  12. No Surrender of Others' Freedom.\n\n  If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you may\nnot convey it at all.  For example, if you agree to terms that obligate you\nto collect a royalty for further conveying from those to whom you convey\nthe Program, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n\n  13. Use with the GNU Affero General Public License.\n\n  Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into a single\ncombined work, and to convey the resulting work.  The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the special requirements of the GNU Affero General Public License,\nsection 13, concerning interaction through a network will apply to the\ncombination as such.\n\n  14. Revised Versions of this License.\n\n  The Free Software Foundation may publish revised and/or new versions of\nthe GNU General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\n  Each version is given a distinguishing version number.  If the\nProgram specifies that a certain numbered version of the GNU General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation.  If the Program does not specify a version number of the\nGNU General Public License, you may choose any version ever published\nby the Free Software Foundation.\n\n  If the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\n  Later license versions may give you additional or different\npermissions.  However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n  15. Disclaimer of Warranty.\n\n  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM\nIS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF\nALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. Limitation of Liability.\n\n  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS\nTHE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE\nUSE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF\nDATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD\nPARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS),\nEVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\n\n  17. Interpretation of Sections 15 and 16.\n\n  If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    {one line to give the program's name and a brief idea of what it does.}\n    Copyright (C) {year}  {name of author}\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation, either version 3 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License\n    along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\n  If the program does terminal interaction, make it output a short\nnotice like this when it starts in an interactive mode:\n\n    {project}  Copyright (C) {year}  {fullname}\n    This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, your program's commands\nmight be different; for a GUI interface, you would use an \"about box\".\n\n  You should also get your employer (if you work as a programmer) or school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.\nFor more information on this, and how to apply and follow the GNU GPL, see\n<http://www.gnu.org/licenses/>.\n\n  The GNU General Public License does not permit incorporating your program\ninto proprietary programs.  If your program is a subroutine library, you\nmay consider it more useful to permit linking proprietary applications with\nthe library.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.  But first, please read\n<http://www.gnu.org/philosophy/why-not-lgpl.html>.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 7.529296875,
          "content": "![swizzin](http://i.imgur.com/JZlDKP1.png)\n\n[![CodeFactor](https://www.codefactor.io/repository/github/liaralabs/swizzin/badge)](https://www.codefactor.io/repository/github/liaralabs/swizzin) [![Discord](https://img.shields.io/discord/577667871727943696?logo=discord&logoColor=white)](https://discord.gg/sKjs9UM)  ![GitHub](https://img.shields.io/github/license/liaralabs/swizzin) ![GitHub commit activity](https://img.shields.io/github/commit-activity/m/liaralabs/swizzin) ![GitHub code size in bytes](https://img.shields.io/github/languages/code-size/liaralabs/swizzin)\n\n# 3.13.0 Stable\n\n[website](https://swizzin.ltd) \\| [docs](https://swizzin.ltd/getting-started) \\| [discord](https://discord.gg/bDFqAUF)\n\nPlease use [Discord](https://discord.gg/bDFqAUF) for all community functions, and [GitHub discussions](https://github.com/swizzin/swizzin/discussions) for feature requests and to raise issues.\n\n## What is swizzin?\nSwizzin is a light, modular seedbox solution that can be installed on Debian 11/12 or Ubuntu 20.04/22.04/24.04. The QuickBox package repo has been ported over for your installing pleasure, including the panel -- if you so choose!\n\nBox has been revamped to reduce and consolidate the amount of commands you need to remember to manage your seedbox. More on this below. In addition to that, additional add-on packages can be installed during installation. No need to wait until the installer finishes! Now with unattended installs!\n\n## Installation\nYou can either use the quick installation method (recommended) or you can wile out with installations options using the advanced setup.\n### Quick Start\nJust paste this in your terminal as root and go! This will ask you all the necessary questions to get you set up. Use your arrow keys, tab (to go to next field), space (to select) and enter (to confirm) to navigate the interactive boxes.\n\nYou can see what that looks like here:\n\n<!-- [![asciicast](https://asciinema.org/a/iz7DBvcNXcgbYWddIJmzoWMCv.svg)](https://asciinema.org/a/iz7DBvcNXcgbYWddIJmzoWMCv) -->\n\nUsing `wget`:\n```shell\nbash <(wget -qO - s5n.sh) && . ~/.bashrc\n```\n\nUsing `curl`:\n```shell\nbash <(curl -sL s5n.sh) && . ~/.bashrc\n```\n\n### Make sure you are root\n\nEither login directly as root or elevate to root with proper login settings with either `su -` or `sudo -i`.\n\nDon't use `su` or something like `sudo -s` (which is the default under Ubuntu when using sudo). You won't be fully logged in as root and certain environment variables not having the full perspective of root will cause failures.\n\n#### You can't tell me how to `su`! (`su` vs `su -`)\nSince the inclusion of mandatory cracklib checks, we've seen an uptick in users having an issue passing the cracklib check as the installer can't seem to find the `cracklib-check` binary despite it being installed. This is because `/sbin` and derivative paths have not been properly set due to your chosen method of escalation. If you have troubles passing cracklib, then there's a very good chance you escalated to root with `su` instead of `su -`. `su` simply changes you to root user while `su -` goes through the entire login process and correctly resets all environmental variables as if you had logged in directly as root. Please always use `su -` when interacting with swizzin if this is your chosen method of privilege escalation.\n\nMore info [here](https://unix.stackexchange.com/questions/7013/why-do-we-use-su-and-not-just-su)\n\n\n### Advanced setup\n\n_This feature is fresh AF! If you'd like to help us improve this, please chat with us in the Discord_\n\nThere's a whole bunch of options for the setup.sh to achieve custom/unattended setups, which you can read all about [in this article](https://swizzin.ltd/guides/advanced-setup). Here are a couple of examples what you can do with it.\n\nWant to use your local swizzin clone instead of cloning upstream? Use the `--local` flag!\n```bash\ngit clone https://github.com/<your-fork>/swizzin.git\nsudo bash swizzin/setup.sh --local\n```\n\nWant to specify the user and their password? And the packages to have installed? Use the `--user` and `--pass` flags, and add packages as arguments!\n```bash\nbash <(curl -sL git.io/swizzin) --unattend qbittorrent nginx panel --user tester --pass test1234\n```\n\nWant something a bit more complex, specify package install variables, don't want a super long command to type, and store the configuration? Use the `--env` flag with your custom `env` file! (see the [unattended.example.env](unattended.example.env) file for an example)\n```bash\nbash <(curl -sL git.io/swizzin) --env /path/to/your/env/file/here.env\n```\n\n### Supported Operating Systems\n\nLong-term support branches only:\n\n-   Debian 11/12\n-   Ubuntu 20.04/22.04/24.04\n\n## Support and Help\n\nIf you have any questions, please read the [documentation](https://swizzin.ltd/getting-started) first. If you still have questions or would like to bounce some ideas off other humans, feel free to join us in [discord](https://discord.gg/bDFqAUF).\n\nDo not use GitHub issues for technical support or feature requests. GitHub issues are only to be used to report bugs and other issues with the project\n\n## This is my box. There are many like it, but this one is mine\nBox is a great tool, but it didn't quite do everything I wanted it to. That's why I've upgraded it and added a few commands intended to make your life a bit easier.\n\nBox functions:\n\n-   list - list all available packages in the repo and a description, if available.\n    -   Usage: `box list`\n-   install - installs a package from the script repository. Accepts one or more package.\n    -   Usage: `box install sickrage couchpotato plex`\n-   remove - removes an installed package. Accepts one or more package\n    -   Usage: `box remove sonarr radarr`\n-   adduser - adds a new user. Define a single user with the command.\n    -   Usage: `box adduser freeloadingfriend`\n-   deluser - deletes the specified user. Define a single user with the command.\n    -   Usage: `box deluser exgirlfriend`\n-   chpasswd - changes the password for a user. Define a single user with the command.\n    -   Usage: `box chpasswd forgetfulfriend`\n-   update - use this command to update your box with the newest changes from github\n    -   Usage: `box update`\n-   upgrade - upgrade the given package (available scripts are in scripts/upgrade)\n    -   Usage: `box upgrade nginx`\n-   rmgrsec - removes grsec kernels installed by ovh\n    -   Usage: `box rmgrsec`\n-   rtx - starts the r(u)Torrent extras management interface (`rtx` alone will also do)\n    -   Usage: `box rtx` or `rtx`\n\n\n## Contributing\nWe welcome any bug fixes, improvements or new applications submitted through Pull Requests. We have a short [Contributing guideline](CONTRIBUTING.md) that we'd like you to consult before so that we can keep our code clean and organized and keep your submissions supported properly.\n\nWe're more than happy to talk about any changes to our codebase on the Discord server which you can find an invite link to on the top of this page.\n\n## Donations\n\nDonations are accepted through the [GitHub Sponsors](https://github.com/sponsors/liaralabs) program. If you are a vendor who profits off the project by deploying the project in a commercial setting, please consider sponsoring the project. Contributions from single users are also greatly appreciated!\n\nIf you don't have spare funds, then you might consider donating the idle cycles on your CPU to my mining pool. Setting it up is easy and will cost you nothing. Simply issue the command:\n\n```shell\nbox install xmrig\n```\n\nThe amount you choose to donate to me is up to you, though the minimum is 1.0. If you need help in setting up your own wallet, check out the [Monero Project](https://getmonero.org).\n"
        },
        {
          "name": "commitlint.config.js",
          "type": "blob",
          "size": 0.0625,
          "content": "module.exports = {extends: ['@commitlint/config-conventional']}\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "setup.sh",
          "type": "blob",
          "size": 15.416015625,
          "content": "#!/bin/bash\n#################################################################################\n# Installation script for swizzin\n# Many credits to QuickBox for the package repo\n#\n# Package installers copyright QuickBox.io (2017) where applicable.\n# All other work copyright Swizzin (2017)\n# Licensed under GNU General Public License v3.0 GPL-3 (in short)\n#\n#   You may copy, distribute and modify the software as long as you track\n#   changes/dates in source files. Any modifications to our software\n#   including (via compiler) GPL-licensed code must also be made available\n#   under the GPL along with build & install instructions.\n#\n#################################################################################\n\necho \"Starting Swizzin installation\"\n\nif [[ $EUID -ne 0 ]]; then\n    echo \"Swizzin setup requires user to be root. su or sudo -s and run again ...\"\n    exit 1\nfi\n\nexport log=/root/logs/swizzin.log\nmkdir -p /root/logs\ntouch $log\n\n# Setting up /etc/swizzin\n#shellcheck disable=SC2120\nfunction _source_setup() {\n    echo -e \"...\\tInstalling git\"      # The one true dependency\n    apt-get update -q >> $log 2>&1     # Force update just in case sources were never pulled\n    apt-get install git -y -qq >> $log # DO NOT PUT MORE DEPENDENCIES HERE\n    echo -e \"\\tGit Installed\"          # All dependencies go to scripts/update/10-dependencies.sh\n\n    if [[ \"$*\" =~ '--local' ]]; then\n        RelativeScriptPath=$(dirname \"${BASH_SOURCE[0]}\")\n        if [[ ! -e /etc/swizzin ]]; then # If there is no valid file or dir there...\n            ln -sr \"$RelativeScriptPath\" /etc/swizzin\n            echo \"The directory where the setup script is located is symlinked to /etc/swizzin\"\n        else\n            touch /etc/swizzin/.dev.lock\n            echo \"/etc/swizzin/.dev.lock created\"\n        fi\n        echo \"Best of luck and please follow the contribution guidelines cheerio\"\n    else\n        echo -e \"...\\tCloning swizzin repo to localhost\"\n        git clone https://github.com/swizzin/swizzin.git /etc/swizzin >> ${log} 2>&1\n        echo -e \"\\tSwizzin cloned!\"\n    fi\n\n    ln -s /etc/swizzin/scripts/ /usr/local/bin/swizzin\n    #shellcheck source=sources/globals.sh\n    . /etc/swizzin/sources/globals.sh\n\n    # Set correct permissions on swizzin files\n    bash /etc/swizzin/scripts/update/04-setpermissions.sh\n    echo\n}\n_source_setup \"$@\"\n\nfunction _arch_check() {\n    if [[ ! $(uname -m) =~ (\"x86_64\"|\"aarch64\") ]]; then\n        echo_warn \"$(_os_arch) detected!\"\n        echo_warn \"This is an unsupported architecture and THINGS MIGHT BREAK.\\nDO NOT CREATE ISSUES ON GITHUB.\"\n        ask \"Agree with the above and continue?\" N || exit 1\n        echo\n    else\n        echo_log_only \"Arch detected as $(_os_arch)\"\n    fi\n}\n_arch_check\nfunction _option_parse() {\n    while test $# -gt 0; do\n        case \"$1\" in\n            --user)\n                shift\n                user=\"$1\"\n                echo_info \"User = $user\"\n                ;;\n            --pass | --password)\n                shift\n                pass=\"$1\"\n                echo -e \"\\tPass = $pass\" #Not an echo_info as we don't want this to hit the logs\n                ;;\n            --skip-cracklib)\n                if check_installed libpam-cracklib; then\n                    echo_warn \"Can't skip password check as libpam-cracklib is installed\"\n                else\n                    export SKIPCRACKLIB=true\n                    echo_info \"Cracklib will be skipped\"\n                fi\n                ;;\n            --domain)\n                shift\n                export LE_HOSTNAME=\"$1\"\n                export LE_DEFAULTCONF=yes\n                export LE_BOOL_CF=no\n                echo_info \"Domain = $LE_HOSTNAME, Used in default nginx config = $LE_DEFAULTCONF\"\n                ;;\n            --local)\n                LOCAL=true\n                echo_info \"Local = $LOCAL\"\n                ;;\n            --test)\n                export test=true\n                echo_info \"test = $test\"\n                ;;\n            --rmgrsec)\n                rmgrsec=yes\n                echo_info \"OVH Kernel nuke = $rmgrsec\"\n                ;;\n            --env)\n                shift\n                if [[ ! -f $1 ]]; then\n                    echo_error \"File does not exist\"\n                    exit 1\n                fi\n                envfile=\"$1\"\n                echo_info \"Parsing env variables from $envfile:\\n$(grep -v '^#' \"$envfile\")\"\n\n                # anything which begins with a cap is exported\n                if grep -v '^#' \"$envfile\" | grep '^[A-Z]' -q; then\n                    export $(grep -v '^#' \"$envfile\" | grep '^[A-Z]' | tr '\\n' ' ')\n                fi\n\n                # anything with a lowercase will get sourced\n                if grep -v '^#' \"$envfile\" | grep '^[a-z]' -q; then\n                    source <(grep -v '^#' \"$envfile\" | grep '^[a-z]') # | read -d $'\\x04' name -\n                fi\n\n                # If packages were in env, make the installArray\n                if [[ -n $packages ]]; then\n                    readarray -td: installArray < <(printf '%s' \"$packages\")\n                fi\n                unattend=true\n                export SKIPCRACKLIB=true\n                ;;\n            --unattend)\n                unattend=true\n                ;;\n            --post-command)\n                shift\n                postcommand=\"$1\"\n                echo_info \"Post-install command = \\\"$postcommand\\\"\"\n                ;;\n            -*)\n                echo_error \"Error: Invalid option: $1\"\n                exit 1\n                ;;\n            *)\n                installArray+=(\"$1\")\n                ;;\n        esac\n        shift\n    done\n\n    if [[ -z $pass && \"${pass+x}\" ]]; then # Generate a password if it is specifically empty\n        pass=\"$(head /dev/urandom | tr -dc A-Za-z0-9 | head -c16)\"\n        echo_info \"Generating random password\"\n        echo -e \"\\tPass = $pass\"\n    fi\n\n    if [[ $unattend = \"true\" ]]; then\n        # hushes errors that happen when no package is being\n        touch /root/results\n        touch /root/results2\n    fi\n\n    if [[ ${#installArray[@]} -gt 0 ]]; then\n        echo_info \"Application install picker will be skipped\"\n        priority=(nginx rtorrent deluge qbittorrent)\n        for i in \"${installArray[@]}\"; do\n            #shellcheck disable=SC2199,SC2076\n            if [[ \" ${priority[@]} \" =~ \" ${i} \" ]]; then\n                echo \"$i\" >> /root/results\n                echo_log_only \"$i added to install queue 1\"\n                touch /tmp/.\"$i\".lock\n            else\n                echo \"$i\" >> /root/results2\n                echo_log_only \"$i added to install queue 2\"\n            fi\n        done\n    fi\n}\n_option_parse \"$@\"\n\n_os() {\n    if [ ! -d /install ]; then mkdir /install; fi\n    if [ ! -d /root/logs ]; then mkdir /root/logs; fi\n    if ! which lsb_release > /dev/null; then\n        echo -e \"...\\tInstalling lsb-release\"      # Okay MAYBE there's one more depend until we gut this app in favour of /etc/os-release\n        apt-get install lsb-release -y -qq >> $log # DO NOT PUT MORE DEPENDENCIES HERE\n    fi\n    distribution=$(lsb_release -is)\n    codename=$(lsb_release -cs)\n    if [[ ! $distribution =~ ^(Debian|Ubuntu)$ ]]; then\n        echo_error \"Your distribution ($distribution) is not supported. Swizzin requires Ubuntu or Debian.\"\n        exit 1\n    fi\n    if [[ ! $codename =~ ^(focal|bullseye|jammy|bookworm|noble)$ ]]; then\n        echo_error \"Your release ($codename) of $distribution is not supported.\"\n        exit 1\n    fi\n}\n\nfunction _preparation() {\n    echo_info \"Preparing system\"\n    apt-get install uuid-runtime -yy >> $log 2>&1\n    apt_update # Do this because sometimes the system install is so fresh it's got a good stam but it is \"empty\"\n    apt_upgrade\n\n    if ! bash /etc/swizzin/scripts/update/10-dependencies.sh; then\n        echo_error \"Dependencies failed to install\\nPlease reveiw the log file and try again.\\nFeel free to visit our Discord in case you need assistance.\"\n        exit 1\n    fi\n\n    nofile=$(grep \"DefaultLimitNOFILE=500000\" /etc/systemd/system.conf)\n    if [[ ! \"$nofile\" ]]; then echo \"DefaultLimitNOFILE=500000\" >> /etc/systemd/system.conf; fi\n    echo_progress_done \"Setup succesful\"\n    echo\n}\n\n#FYI code duplication from `box rmgrsec`\nfunction _nukeovh() {\n    bash /etc/swizzin/scripts/nukeovh\n}\n\nfunction _intro() {\n    whiptail --title \"Swizzin seedbox installer\" --msgbox \"Yo, what's up? Let's install this swiz.\" 7 43\n}\n\nfunction _adduser() {\n    echo_info \"Creating master user\"\n    export SETUP_USER=true                                     # This sets whiptail in box adduser\n    bash /etc/swizzin/scripts/box adduser \"$user\" \"$pass\" || { # TODO make it so that the password does not hit the logs\n        echo_error \"Installation aborted!\"\n        exit 1\n    }\n    unset SETUP_USER\n    pass=\n    unset pass\n    echo_log_only \"User initialised\"\n}\n\nfunction _choices() {\n    packages=()\n    extras=()\n    guis=()\n    locks=(nginx rtorrent deluge qbittorrent autodl panel vsftpd ffmpeg quota transmission)\n    for i in \"${locks[@]}\"; do\n        app=${i}\n        if [[ ! -f /install/.$app.lock ]]; then\n            packages+=(\"$i\" '\"\"')\n        fi\n    done\n    whiptail --title \"Install Software\" --checklist --noitem --separate-output \"Choose your clients and core features.\" 15 26 7 \"${packages[@]}\" 2> /root/results || exit 1\n    results=/root/results\n    if grep -q rtorrent \"$results\"; then\n        gui=(rutorrent flood)\n        for i in \"${gui[@]}\"; do\n            app=${i}\n            if [[ ! -f /install/.$app.lock ]]; then\n                guis+=(\"$i\" '\"\"')\n            fi\n        done\n        whiptail --title \"rTorrent GUI\" --checklist --noitem --separate-output \"Optional: Select a GUI for rtorrent\" 15 26 7 \"${guis[@]}\" 2> /root/guis || exit 1\n        readarray -t guis < /root/guis\n        for gui in \"${guis[@]}\"; do\n            sed -i \"/rtorrent/a $gui\" /root/results\n        done\n        rm -f /root/guis\n    fi\n    while IFS= read -r result; do\n        touch /tmp/.$result.lock\n    done < \"$results\"\n\n    locksextra=($(find /usr/local/bin/swizzin/install -type f -printf \"%f\\n\" | cut -d \".\" -f 1 | sort -d))\n    for i in \"${locksextra[@]}\"; do\n        app=${i}\n        if [[ ! -f /tmp/.$app.lock ]]; then\n            extras+=(\"$i\" '\"\"')\n        fi\n    done\n    whiptail --title \"Install Software\" --checklist --noitem --separate-output \"Make some more choices ^.^ Or don't. idgaf\" 15 26 7 \"${extras[@]}\" 2> /root/results2 || exit 1\n}\n\nfunction _check_results() {\n    results=/root/results\n    if grep -q nginx \"$results\"; then\n        if [[ -n $(pidof apache2) ]]; then\n            if (whiptail --title \"apache2 conflict\" --yesno --yes-button \"Purge it!\" --no-button \"Disable it\" \"WARNING: The installer has detected that apache2 is already installed. To continue, the installer must either purge apache2 or disable it.\" 8 78); then\n                export apache2=purge\n            else\n                export apache2=disable\n            fi\n        fi\n    fi\n    if grep -q rtorrent \"$results\"; then\n        . /etc/swizzin/sources/functions/rtorrent\n        whiptail_rtorrent\n    fi\n    if grep -q deluge \"$results\"; then\n        . /etc/swizzin/sources/functions/deluge\n        whiptail_deluge\n    fi\n    if grep -q qbittorrent \"$results\"; then\n        . /etc/swizzin/sources/functions/qbittorrent\n        whiptail_qbittorrent\n    fi\n    if grep -q transmission \"$results\"; then\n        #shellcheck source=sources/functions/transmission\n        . /etc/swizzin/sources/functions/transmission\n        whiptail_transmission_source\n    fi\n\n    if [[ $(grep -s rutorrent \"$gui\") ]] && [[ ! $(grep -s nginx \"$results\") ]]; then # Check nginx requirement for more than rutorrent\n        if (whiptail --title \"nginx conflict\" --yesno --yes-button \"Install nginx\" --no-button \"Remove ruTorrent\" \"WARNING: The installer has detected that ruTorrent is to be installed without nginx. To continue, the installer must either install nginx or remove ruTorrent from the packages to be installed.\" 8 78); then\n            sed -i '1s/^/nginx\\n/' /root/results\n            touch /tmp/.nginx.lock\n        else\n            sed -i '/rutorrent/d' /root/results\n        fi\n    fi\n}\n\nfunction _prioritize_results() {\n    if grep -q nginx \"$results\"; then\n        sed -i '/nginx/d' /root/results\n        echo \"\" >> /root/results\n        sed -i '1s/^/nginx\\n/' /root/results\n    fi\n}\n\nfunction _install() {\n    begin=$(date +\"%s\")\n    if [[ -s /root/results ]]; then\n        bash /etc/swizzin/scripts/box install $(< /root/results) && rm /root/results\n        showTimer=true\n    fi\n    if [[ -s /root/results2 ]]; then\n        bash /etc/swizzin/scripts/box install $(< /root/results2) && rm /root/results2\n        showTimer=true\n    fi\n    termin=$(date +\"%s\")\n    difftimelps=$((termin - begin))\n    [[ $showTimer = true ]] && echo_info \"Package installation took $((difftimelps / 60)) minutes and $((difftimelps % 60)) seconds\"\n}\n\nfunction _post() {\n    echo\n    echo\n\n    user=$(_get_master_username)\n\n    ip=$(ip route get 1 | sed -n 's/^.*src \\([0-9.]*\\) .*$/\\1/p')\n    if ! grep -q -ow '^export PATH=$PATH:/usr/local/bin/swizzin$' ~/.bashrc; then\n        echo \"export PATH=\\$PATH:/usr/local/bin/swizzin\" >> /root/.bashrc\n    fi\n    #echo \"export PATH=\\$PATH:/usr/local/bin/swizzin\" >> /home/$user/.bashrc\n    #chown ${user}: /home/$user/.profile\n    echo \"Defaults    secure_path = /usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/local/bin/swizzin\" > /etc/sudoers.d/secure_path\n    if [[ $distribution = \"Ubuntu\" ]]; then\n        echo 'Defaults  env_keep -=\"HOME\"' > /etc/sudoers.d/env_keep\n    fi\n\n    ring_the_bell\n    echo_success \"Swizzin installation complete!\"\n    if [[ -f /install/.nginx.lock ]]; then\n        echo_info \"Seedbox can be accessed at https://${ip}\"\n        if [[ ! -f /install/.panel.lock ]]; then\n            echo_info \"Expect a 403 forbidden error on the root domain, since you did not install the panel.\"\n        fi\n    fi\n\n    if [[ -f /install/.deluge.lock ]]; then\n        delugewebport=$(grep port /home/\"${user}\"/.config/deluge/web.conf | cut -d: -f2 | cut -d\",\" -f1)\n        delugedaemonport=$(grep daemon_port /home/\"${user}\"/.config/deluge/core.conf | cut -d: -f2 | cut -d\",\" -f1)\n        echo_info \"Your deluge daemon port is $delugedaemonport\\nYour deluge web port is $delugewebport\"\n    fi\n\n    if [[ -f /var/run/reboot-required ]]; then\n        echo_warn \"The server requires a reboot to finalise this installation. Please reboot now.\"\n    else\n        echo_info \"You can now use the box command to manage swizzin features, e.g. \\`box install nginx panel\\`\"\n    fi\n    echo_docs getting-started/box-basics\n    #\n    # Run the bash_completion installer from the update folder\n    bash /etc/swizzin/scripts/update/bash_completion.sh\n}\n\n_run_tests() {\n    if [[ $test = \"true\" ]] || [ -f /etc/swizzin/.test.lock ]; then\n        bash /etc/swizzin/scripts/box test || return 1\n    fi\n\n}\n\n_run_post() {\n    if [[ -z $postcommand ]]; then\n        echo_progress_start \"Executing post-install commands\"\n        $postcommand\n        echo_progress_done \"Post-install commands finished\"\n    fi\n}\n\n_os\n_preparation\n## If install is attended, do the nice intro\nif [[ $unattend != \"true\" ]]; then\n    if [[ -z \"$user\" ]] && [[ -z \"$pass\" ]]; then # If password AND username are empty\n        _intro\n    fi\nfi\n\n## If the user asked for rmgrsec or the install is not being attended, get into the kernel business\nif [[ -n $rmgrsec ]] || [[ $unattend != \"true\" ]]; then _nukeovh; fi\n_adduser\n#If setup is attended and there are no choices, go get some apps\nif [[ $unattend != \"true\" ]] && [[ ${#installArray[@]} -eq 0 ]]; then _choices; fi\n_check_results\n_prioritize_results\n_install\n_post\n_run_post\n_run_tests || exit 1\n"
        },
        {
          "name": "sources",
          "type": "tree",
          "content": null
        },
        {
          "name": "unattended.example.env",
          "type": "blob",
          "size": 0.958984375,
          "content": "# SETUP.SH OPTIONS\n\n## master user setup\nuser=test\npass=test123\n\n## packages to install separated by colons. \npackages=nginx:panel:transmission:letsencrypt\n\n\n# PACKAGE SPECIFIC OPTIONS\n\n## Deluge flags (https://swizzin.ltd/applications/deluge#unattended-variables)\nDELUGE_VERSION=\"master\"\n\n## qBittorrent flags (https://swizzin.ltd/applications/qbittorrent#unattended-variables)\nQBITTORRENT_VERSION=\"latest\"\n\n## transmission flags (https://docs.swizzin.ltd/applications/transmission#install-options)\nTRANSMISSION_VERSION=\"Repo\"\n\n## rtorrent flags (https://swizzin.ltd/applications/rtorrent/#initial-setup)\nRTORRENT_VERSION=\"0.9.8\"\n\n## LetsEncrypt options ((https://docs.swizzin.ltd/applications/letsencrypt#install-options))\nLE_HOSTNAME=\"domain.tld\"\nLE_DEFAULTCONF=yes\n# LE_BOOL_CF=no if you don't want to use any cloudflare\nLE_CF_API=aaapppiiiikkkeeeeeyyyyyyyy\nLE_CF_EMAIL=\"email@blach.lol\"\nLE_CF_ZONE=\"some.zone.asdasdasdasd\" # or LE_CF_ZONEEXISTS=yes if you don't need it created"
        }
      ]
    }
  ]
}