{
  "metadata": {
    "timestamp": 1736568758656,
    "page": 867,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjg3OQ==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "timsutton/osx-vm-templates",
      "stars": 1130,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0771484375,
          "content": ".DS_Store\npacker_cache\n*.dmg\n*.box\nAutoPartition-*\npacker/output-*\n*.pvm\n*.pyc\n"
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 1.060546875,
          "content": "The MIT License (MIT)\n\nCopyright (c) 2013-2017 Timothy Sutton\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 14.8798828125,
          "content": "# OS X templates for Packer and VeeWee\n\nThis is a set of Packer templates and support scripts that will prepare an OS X installer media that performs an unattended install for use with [Packer](http://packer.io) and [VeeWee](http://github.com/jedi4ever/veewee). These were originally developed for VeeWee, but support for the VeeWee template has not been maintained since Packer's release and so it is only provided for historical purposes. I plan on removing VeeWee support from this repo soon, but VeeWee can still make use of the preparation script and the [OS X template](https://github.com/jedi4ever/veewee/tree/master/templates/OSX) remains in the core VeeWee repo.\n\nThe machine built by this Packer template defaults to being configured for use with [Vagrant](http://www.vagrantup.com), and supports three Vagrant providers by using Packer's respective builders:\n\n- The [Hashicorp VMware Fusion provider](http://www.vagrantup.com/vmware) (recommended)\n- Vagrant's included [VirtualBox provider](http://docs.vagrantup.com/v2/virtualbox/index.html)\n- [Parallels](https://github.com/Parallels/vagrant-parallels)\n\nIt's possible to build a machine with different admin account settings, and without the vagrant ssh keys, for use with other systems, e.g. continuous integration.\n\nUse with the Fusion provider requires Vagrant 1.3.0, and use with the VirtualBox provider Vagrant 1.6.3 if using the Rsync file sync mechanism. Note that the VeeWee template also does not have any VirtualBox or Parallels support.\n\nProvisioning steps that are defined in the template via items in the [scripts](https://github.com/timsutton/osx-vm-templates/tree/master/scripts) directory:\n- [Vagrant-specific configuration](https://www.vagrantup.com/docs/boxes/base.html)\n- VM guest tools installation if on VMware\n- Xcode CLI tools installation\n- Chef installation via the [Chef Omnitruck method](https://docs.chef.io/install_omnibus.html)\n- Puppet installation via [Puppetlabs Mac installers](https://downloads.puppetlabs.com/mac), both legacy and 4\n- Disk shrinking for VMware\n\n## Supported guest OS versions\n\nCurrently this prepare script and template supports all versions of OS X that are distributed through the App Store: OS X Lion (10.7) through El Capitan (10.11), and macOS Sierra (10.12).\n\nThis project currently only supplies a single Packer template (`template.json`), so the hypervisor's configured guest OS version (i.e. `darwin12-64`) does not accurately reflect the actual installed OS. I haven't found there to be any functional differences depending on these configured guest versions.\n\nTo build a VMware box of an OS version less than El Capitan (10.11), note that as of VMare Fusion 8.5.4, you will need to change the `tools_upload_flavor` from `darwin` to `darwinPre15`.\n\n## Issue with 10.12.4\n\n**Important note:** The Sierra 10.12.4 installer seems to no longer support including custom packages as part of the installer, unless they are signed by Apple. This produces an error with the text, \"macOS could not be installed on your computer.. The package veewee-config.pkg is not signed.\"\n\nThe `prepare_iso.sh` script in this repo makes use of functionality Apple supports as part of a [NetInstall workflow](https://help.apple.com/systemimageutility/mac/10.12/#/sysmb1457f0b), but because of this (undocumented) additional requirement of additional packages needing to be signed by Apple as of 10.12.4, these tools can't currently install the necessary configuration for Packer to log in to perform additional configuration, installing guest tools, etc. The rest of the OS install still completes successfully.\n\nIt may be possible to work around this by modifying the rc script directly with the contents of our postinstall script.\n\nThe `prepare_vdi.sh` script uses [AutoDMG](https://github.com/MagerValp/AutoDMG)'s approach running the installer's ```OSInstall.pkg``` creating a fresh install in a temporary DMG sparse disk image which is converted into a VDI disk image using VirtualBox's command line tools.\n\n## Preparing the ISO\n\nOS X's installer cannot be bootstrapped as easily as can Linux or Windows, and so exists the [prepare_iso.sh](https://github.com/timsutton/osx-vm-templates/blob/master/prepare_iso/prepare_iso.sh) script to perform modifications to it that will allow for an automated install and ultimately allow Packer and later, Vagrant, to have SSH access.\n\n**Note:** VirtualBox users currently have to disable Remote Management to avoid [periodic freezing](https://github.com/timsutton/osx-vm-templates/issues/43) of the VM by adding `-D DISABLE_REMOTE_MANAGEMENT` to the `prepare_iso.sh` options. See [Remote Management freezing issue](#remote-management-freezing-issue) for more information.\n\nRun the `prepare_iso.sh` script with two arguments: the path to an `Install OS X.app` or the `InstallESD.dmg` contained within, and an output directory. Root privileges are required in order to write a new DMG with the correct file ownerships. For example, with a 10.8.4 Mountain Lion installer:\n\n`sudo prepare_iso/prepare_iso.sh \"/Applications/Install OS X Mountain Lion.app\" out`\n\n...should output progress information ending in something this:\n\n```\n-- MD5: dc93ded64396574897a5f41d6dd7066c\n-- Done. Built image is located at out/OSX_InstallESD_10.8.4_12E55.dmg. Add this iso and its checksum to your template.\n```\n\n`prepare_iso.sh` accepts command line switches to modify the details of the admin user installed by the script.\n\n* `-u` modifies the name of the admin account, defaulting to `vagrant`\n* `-p` modifies the password of the same account, defaulting to `vagrant`\n* `-i` sets the path of the account's avatar image, defaulting to `prepare_iso/support/vagrant.jpg`\n\nFor example:\n\n`sudo prepare_iso/prepare_iso.sh -u admin -p password -i /path/to/image.jpg \"/Applications/Install OS X Mountain Lion.app\" out`\n\nAdditionally, flags can be set to disable certain default configuration options.\n\n* `-D DISABLE_REMOTE_MANAGEMENT` disables the Remote Management service.\n* `-D DISABLE_SCREEN_SHARING` disables the Screen Sharing service.\n\n#### Clone this repository\n\nThe `prepare_iso.sh` script needs the `support` directory and its content. In other words, the easiest way to run the script is after cloning this repository.\n\n## Use with Packer\n\nThe path can now be added to your Packer template or provided as [user variables](http://www.packer.io/docs/templates/user-variables.html). The `packer` directory contains a template that can be used with the `vmware-iso` and `virtualbox-iso` builders. The checksum does not need to be added because the `iso_checksum_type` has been set to \"none\". The `veewee` directory contains a definition, though as mentioned above it is not currently being maintained.\n\nThe Packer template adds some additional VM options required for OS X guests. Note that the paths given in the Packer template's `iso_url` builder key accepts file paths, both absolute and relative (to the current working directory).\n\nGiven the above output, we could run then run packer:\n\n```sh\ncd packer\npacker build \\\n  -var iso_url=../out/OSX_InstallESD_10.8.4_12E55.dmg \\\n  template.json\n```\n\nYou might also use the `-only` option to restrict to either the `vmware-iso` or `virtualbox-iso` builders.\n\nIf you modified the name or password of the admin account in the `prepare_iso` stage, you'll need to pass in the modified details as packer variables. You can also prevent the vagrant SSH keys from being installed for that user.\n\nFor example:\n\n```\npacker build \\\n  -var iso_url=../out/OSX_InstallESD_10.8.4_12E55.dmg \\\n  -var username=youruser \\\n  -var password=yourpassword \\\n  -var install_vagrant_keys=false \\\n  template.json\n```\n\n### Building to a device with more space\n\nLocal VM builds take up a lot of space. It's possible to make packer work in different directories.\n\n* [`PACKER_CACHE_DIR`](https://www.packer.io/docs/other/environment-variables.html#packer_cache_dir) is an out-of-the-box environment variable that configures where it will cache ISOs etc.\n* `PACKER_OUTPUT_DIR`: configure where packer will build artifacts (like OVF files) to\n* `PACKER_VAGRANT_BOX_DIR`: configure where packer will build vagrant boxes via the post-processor to.\n\n**Note:** don't make `PACKER_OUTPUT_DIR` and `PACKER_VAGRANT_BOX_DIR` the same place. `keep_input_artifacts` in the post-processor defaults to `false`, and it removes them by removing the directory, not the individual files. So if you use the same place, you'll end up with no output at all (packer `v1.0.0`).\n\n## Automated installs on OS X\n\nOS X's installer supports a kind of bootstrap install functionality similar to Linux and Windows, however it must be invoked using pre-existing files placed on the booted installation media. This approach is roughly equivalent to that used by Apple's System Image Utility for deploying automated OS X installations and image restoration.\n\nThe `prepare_iso.sh` script in this repo takes care of mounting and modifying a vanilla OS X installer downloaded from the Mac App Store. The resulting .dmg file can then be added to the Packer template. Because the preparation is done up front, no boot command sequences, attached devices or web server access is required.\n\nMore details as to the modifications to the installer media are provided in the comments of the script.\n\n\n## Automated GUI logins\n\nFor some kinds of automated tasks, it may be necessary to have an active GUI login session (for example, test suites requiring a GUI, or Jenkins SSH slaves requiring a window server for their tasks). The Packer templates support enabling this automatically by using the `autologin` user variable, which can be set to `1` or `true`, for example:\n\n`packer build -var autologin=true template.json`\n\nThis was easily made possible thanks to Per Olofsson's [CreateUserPkg](http://magervalp.github.com/CreateUserPkg) utility, which was used to help create the box's vagrant user in the `prepare_iso` script, and which also supports generating the magic kcpassword file with a particular hash format to set up the auto-login.\n\n## Configuration management\n\nBy default, the packer template does not install the Chef or Puppet configuration management tools. You can enable the installation of configuration management by setting the `chef_version`, `puppet_agent_version`, `puppet_version`, `facter_version`, and `hiera_version` variables to `latest`, or to a specific version.\n\nTo install the latest version of Chef:\n\n```\npacker build -var chef_version=latest template.json\n```\n\nTo install the last version of Puppet Agent:\n\n```\npacker build -var pupet_agent_version=latest template.json\n```\n\nTo install the last versions of the deprecated standalone Puppet, Facter and Hiera packages:\n\n```\npacker build -var puppet_version=latest facter_version=latest hiera_version=latest template.json\n```\n\n## Xcode Command Line Tools\n\nThe Xcode CLI tools are installed by the packer template by default. To disable the installation, set the `install_xcode_cli_tools` variable to `false`:\n\n```\npacker build -var install_xcode_cli_tools=false template.json\n```\n\n## System updates\n\nPacker will instruct the system to download and install all available OS X updates, if you want to disable this default behaviour, use `update_system` variable:\n\n```\npacker build -var update_system=0 template.json\n```\n\n## Provisioning delay\n\nIn some cases, it may be helpful to insert a delay into the beginning of the provisioning process. Adding a delay of about 30 seconds may help subsequent provisioning steps that install software from the internet complete successfully. By default, the delay is set to `0`, but you can change the delay by setting the `provisioning_delay` variable:\n\n```\npacker build -var provisioning_delay=30 template.json`\n```\n\n## VirtualBox support\n\nVirtualBox support is thanks entirely to contributions by [Matt Behrens (@zigg)](https://github.com/zigg) to this repo, Vagrant and Packer.\n\n### Caveats\n\n#### Remote Management freezing issue\n\nThe default `prepare_iso.sh` configuration enables Remote Management during installation, which causes the resulting virtual machine to [periodically freeze](https://github.com/timsutton/osx-vm-templates/issues/43). You can avoid enabling Remote Management when using `prepare_iso.sh` by passing `-D DISABLE_REMOTE_MANAGEMENT` this:\n\n```\nsudo ./prepare_iso/prepare_iso.sh -D DISABLE_REMOTE_MANAGEMENT \"/Applications/Install OS X El Capitan.app\" out\n```\n\n\n#### Shared folders\n\nOracle's support for OS X in VirtualBox is very limited, including the lack of guest tools to provide a shared folder mechanism. If using the VirtualBox provider in Vagrant, you will need to configure the shared folder that's set up by default (current folder mapped to `/vagrant`) to use either the `rsync` or `nfs` synced folder mechanisms. You can do this like any other synced folder config in your Vagrantfile:\n\n```ruby\nVagrant.configure(\"2\") do |config|\n  config.vm.provider \"virtualbox\" do |vb|\n    config.vm.synced_folder \".\", \"/vagrant\", type: \"rsync\"\n  end\nend\n```\n\n## Alternative method using ```prepare_vdi.sh```, ```prepare_ovf.sh``` and packer virtualbox-ovf\n\nThis approach requires VirtualBox and unfortunately almost 30GB of free space.\n\n#### Installing and exporting to a VirtualBox virtual disk image.\n\nThe ```prepare_vdi.sh``` command will run the installer's ```OSInstall.pkg``` creating a fresh install in a temporary disk image which is converted into a VDI disk image.\n\n```\ncd packer\nsudo ../prepare_iso/prepare_vdi.sh \\\n  -D DISABLE_REMOTE_MANAGEMENT \\\n  -o macOS_10.12.vdi \\\n   /Applications/Install\\ macOS\\ Sierra.app/ \\\n  .\n```\n\n#### Generating a VirtualBox machine and exporting it into packed virtual machine OVF\n\nThe ```prepare_ovf.sh``` command takes a virtual image disk and adds it into a temporary VirtualBox machine which is exported into a packed virtual machine using the OVF (Open Virtualization Format).\n\n```\n../prepare_iso/prepare_ovf.sh \\\n  macOS_10.12.vdi\n```\n\n#### Generating a packer box using the virtualbox-ovf builder\n\nFinally the virtualbox-ovf allows to use the previously generated exported virtual machine to generate the provisioned packer box.\n\n```\npacker build \\\n  -var provisioning_delay=30 \\\n  -var source_path=macOS_10.12.ovf \\\n  template.json\n```\n\n## Box sizes\n\nA built box with CLI tools, Puppet and Chef is over 5GB in size. It might be advisable to remove (with care) some unwanted applications in an additional postinstall script. It should also be possible to modify the OS X installer package to install fewer components, but this is non-trivial. One can also supply a custom \"choice changes XML\" file to modify the installer choices in a supported way, but from my testing, this only allows removing several auxiliary packages that make up no more than 6-8% of the installed footprint (for example, multilingual voices and dictionary files).\n\n\n## Alternate approaches to VM provisioning\n\nJoe Chilcote has written a tool, [vfuse](https://github.com/chilcote/vfuse), which converts a never-booted OS X image (such as created with a tool like [AutoDMG](https://github.com/MagerValp/AutoDMG)) into a VMDK and configures a VMware Fusion VM. vfuse can also configure a Packer template alongside the VM, configured with the `vmware-vmx` builder.\n"
        },
        {
          "name": "packer",
          "type": "tree",
          "content": null
        },
        {
          "name": "prepare_iso",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "veewee",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}