{
  "metadata": {
    "timestamp": 1736568697140,
    "page": 784,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjc4OQ==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "barrykn/big-sur-micropatcher",
      "stars": 1244,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.009765625,
          "content": ".DS_Store\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 32.958984375,
          "content": "# big-sur-micropatcher (Version 0.5.1)\nA primitive USB patcher for installing macOS Big Sur on unsupported Macs\n\nBy the way, if you have a Mac Pro, [Big Mac](https://github.com/StarPlayrX/bigmac) by StarPlayrX is another patcher worth considering. For 2008 Mac Pros (MacPro3,1) in particular, Big Mac is clearly a better option than this patcher (at least for now).\n\nThanks to the following people for their hard work to get Big Sur running on unsupported Macs:\n\n- ASentientBot for developing the Hax series of installer patches which are so incredibly helpful for installing Big Sur on unsupported Macs, as well as for his patch to NVDAResmanTesla.kext which allows the GeForce Tesla (9400M/320M) framebuffer to work in Big Sur.\n- jackluke for figuring out how to patch the Recovery USB to bypass compatibility checks and AMFI enforcement in the absence of NVRAM boot-args settings.\n- highvoltage12v for developing the first 802.11n Wi-Fi patches for Big Sur (no longer used by default, but still available through the `--wifi=hv12v-old` and `--wifi=hv12v-new` options for `patch-kexts.sh`), as well as patches used for Metal GPU support on 2011 iMacs.\n- ParrotGeek for developing the LegacyUSBInjector kernel extension that allows USB to work on various pre-2011 Mac models, and for creating the \"trampoline\" that allows the installer to be patched at runtime without first running Terminal commands.\n- testheit for describing how to use a kmutil feature that I was previously unaware of. This turned out to be a good way to make LegacyUSBInjector function under Big Sur, and more generally and more importantly, it was absolutely essential for improving overall patcher reliability.\n- Ausdauersportler for integrating patches for iMac Metal GPU support.\n\nIn addition, thanks to Ben Sova, MachInit, johncaling40, and Travis Parker for their contributions to this patcher.\n\nThis documentation is more thorough than for previous versions of this patcher, but it may still be incomplete. Remember that you *do this at your own risk*, you could lose all your data (it's your responsibility to do a Time Machine backup *first*!), expect bugs and crashes, and this patcher is still under development.\n\nI repeat, do a Time Machine backup *before* upgrading!! Big Sur changes how Time Machine backups are done, and I have heard that it is not possible to use previous versions of macOS to recover data from Big Sur's Time Machine backups. (I have created Time Machine backups with Big Sur, and I have restored them using Big Sur, but I have not yet tried to access Big Sur Time Machine backups using previous macOS releases.)\n\nKeep in mind, Mojave and Catalina will probably receive security updates until roughly September 2021 and September 2022 respectively (give or take a month), so you can continue using Mojave or Catalina for now. If you are currently running High Sierra, it probably makes more sense to upgrade to Mojave (or maybe Catalina) for now, rather than Big Sur. This patcher definitely needs more time to mature, and considering that Big Sur is the first x.0 release of macOS in roughly 20 years, it would also be a good idea to give Apple more time to fix Big Sur bugs.\n\n## Compatibility between different releases of this patcher and different Big Sur beta releases\n- v0.5.1: Tested with 11.0.1 Release Candidate 2 (20B28), for fresh installs. Upgrades should also work on 2012 and newer Macs (and 2009-2012 Mac Pros), but with 11.0.1 beta (20B5012d) there were reports of problems with upgrades on 2011 Macs. A future patcher release will likely fix the upgrade problems, if they have not arleady been fixed with changes in Big Sur itself.\n- v0.5.0: Tested with 11.0 beta 10 (20A5395g) and 11.0.1 Release Candidate 2 (20B28), for fresh installs. Upgrades should also work on 2012 and newer Macs (and 2009-2012 Mac Pros), but with 11.0.1 beta (20B5012d) there were reports of problems with upgrades on 2011 Macs. A future patcher release will likely fix the upgrade problems, if they have not arleady been fixed with changes in Big Sur itself.\n- v0.4.2-v0.4.4: Tested with beta 10 (20A5395g). Almost certainly compatible with beta 9 (20A5384c) as well. Compatibility with previous betas is unknown. Compatible with 11.0.1 beta 1 (20B5012d) for fresh installs; upgrades generally work but there are some reports of problems on 2011 Macs (especially MacBook Pros). A future patcher release will likely fix the upgrade problems.\n- For earlier releases of this patcher, check the README for v0.5.0 or earlier. Patcher releases before v0.4.2 will definitely have compatibility problems with Big Sur 11.0.1 Release Candidate 2 (20B28) or later, including the final Big Sur release.\n\n## Compatibility of various Mac models\nNote that this information is incomplete and may not be 100% correct yet, but I'll add more information over time and fix any errors as I learn about them.\n\nAlso, note that Macs without Metal GPUs (basically 2011 and earlier Macs, except for Mac Pros and iMacs with upgraded GPUs), \"no graphics acceleration\" is a tremendous, almost exponential, slowdown. For instance, consider a simple benchmark, simply minimizing a Safari window:\n- Late 2012 13\" MacBook Pro: <1 second\n- Early 2011 13\" MacBook Pro: 13 seconds\n- Late 2009 13\" MacBook: 23 seconds\n\nMostly compatible Mac models:\n- If you have a 2013 or later Mac, please check [Apple's official list of supported Mac models](https://www.apple.com/macos/big-sur/) (search the page for \"See if\") first, to make sure that you actually need this patcher.\n- By the way, with the exception of Mac Pros, all of the Macs in this section officially support Catalina. This section is basically \"Macs without official Big Sur support but with Metal support\", with the exception of pre-2012 iMacs that have upgraded GPUs. (In fact, a 2011 iMac with upgraded GPU is almost equivalent to this category. Earlier iMacs may have compatibility problems caused by other components; see below.)\n- Late 2013 iMac: Everything should work (and, after step 14, you're finished -- no need for step 15 and later). Note that there have been some reports of very poor performance with Fusion Drives on this model when running Big Sur, which may be why Apple does not support Big Sur on this model.\n- 2010/2012 Mac Pro: You should first upgrade the graphics card, as you would for official compatibility with macOS Mojave. Once you have done that, everything should work after installation except for WiFi (which should work after post-installation patching in step 15) and possibly USB (there were some reports of USB problems with Big Sur betas, and I need to see if they are still happening and, if so, if they are patchable).\n- 2009 Mac Pro: Once it's flashed to MacPro5,1 firmware, it should be equivalent to a 2010/2012 Mac Pro. (As with those, you will want to upgrade to a Mojave-compatible graphics card.) However, note that some people have had their flashed MacPro4,1s enter boot loops during installation. We don't yet know what causes this or why it only happens sometimes.\n- Other 2012/2013 Macs: Most things should work after the initial installation, except for Wi-Fi (unless you have upgraded to an 802.11ac Wi-Fi card) or possibly GPU switching (on 15\" MacBook Pros). Step 15 of the installation process fixes Wi-Fi support, but GPU switching may not yet be a solved problem.\n\nPartially compatible Mac models:\n- Most models that officially support High Sierra, but not Mojave, fall into this category. The exceptions are the Mid 2010 15\" and 17\" MacBook Pros (see the Incompatible category below), and possibly the Late 2009/Mid 2010 iMacs (see the \"Unknown status\" category below).\n- Note that 2009-2010 iMacs that have been upgraded with Metal GPUs also need certain kext patches which are not (yet?) provided by this patcher.\n- 2011 Macs: Several features may not work after initial installation (after step 14 finishes), including sleep, screen brightness control, Wi-Fi (unless you have upgraded to an 802.11ac Wi-Fi card), and graphics acceleration (unless you have upgraded the GPU in a 2011 iMac). With the exception of a 2011 iMac with upgraded GPU, no 2011 Mac models have graphics acceleration under Big Sur. The post-install patching in step 15 fixes sound and Wi-Fi on all 2011 Macs. On 13\" MacBook Pros it also fixes sleep and brightness control, and installs the correct Intel framebuffer driver (this is still unaccelerated, but it still increases speed somewhat -- enough to make full-screen YouTube in Safari work with very few frame drops, although this pegs both CPU cores). For 15\" and 17\" MacBook Pros, disabling the discrete GPU will probably increase performance, and sleep and brightness control probably won't work without disabling it. (That isn't to say that sleep and brightness control will necessarily work even with the discrete GPU disabled -- but it might possibly work if you have a way of disabling the GPU that also keeps sleep and display brightness functional in a dosdude-patched Mojave or Catalina.) MacBook Airs should be equivalent to the 13\" MacBook Pro in terms of compatibility with Big Sur and this patcher.\n- Mid 2010 white MacBook, 2010 13\" MacBook Pro, 2010 MacBook Air: In addition to the features which don't work after initial installation on the 2011 13\" MacBook Pros (Wi-Fi, sound, graphics acceleration, sleep, display brightness control), Ethernet doesn't work. The `--2010` option for patch-kexts.sh (step 15) installs fixes for Wi-Fi, sound, and Ethernet, as well as drivers that enable the GeForce Tesla (9400M/320M) framebuffer (thereby fixing sleep and display brightness control). The framebuffer driver does not provide acceleration; the lack of graphics acceleration plus the relatively slow Penryn CPU means performance is sluggish. On at least some of these models, step 6 may fail with errors.\n- Late 2009 white MacBook, Late 2009 21.5\" iMac, 2010 Mac Mini, (if equipped with Core 2 Duo) Late 2009 27\" iMac: In addition to the features which don't work after initial installation on the 2011 13\" MacBook Pros (Wi-Fi, sound, graphics acceleration, sleep, display brightness control), Ethernet and USB 1.1 also don't work. The `--2010` option for patch-kexts.sh (step 15) installs fixes for Wi-Fi, sound, Ethernet, and USB, as well as drivers that enable the GeForce Tesla (9400M/320M) framebuffer (thereby fixing sleep and display brightness control). The framebuffer driver does not provide acceleration; the lack of graphics acceleration plus the relatively slow Penryn CPU means performance is sluggish. Also, the installation has to be performed on a newer Mac first (basically a 2010 or newer Mac, or a 2009 or later Mac Pro), with patch-kexts.sh --2010 run on that same newer Mac, *then* moved over to the old Mac (via either a hard drive/SSD transplant or by using a USB enclosure or USB hard drive/SSD). Otherwise, the installer will boot because USB 2.0 works, but the keyboard and trackpad won't work because USB 1.1 doesn't work. USB support in the installer for these Macs is planned for a future patcher release.\n\nPotentially incompatible Mac models: \n- Late 2009 27\" iMac: Compatibility will vary based on the CPU. If your Late 2009 27\" iMac has a Core 2 Duo CPU, then it is equivalent to a Late 2009 21.5\" iMac (see above). If it has a Core i5 or i7, CPU, then it is equivalent to a 2010 iMac (see below).\n\nIncompatible Mac models:\n- Any Macs with a pre-Penryn CPU. Basically, this means the original MacBook Air as well as all 2006/2007 Macs (except for iMacs with upgraded CPUs).\n\nCurrently not supported by this patcher, but future support may be possible:\n- 2010 15\"/17\" MacBook Pro, 2010 iMac, (if equipped with a Core i5/i7) Late 2009 27\" iMac: A fix has been created, but it requires OpenCore. Even if OpenCore eventually turns out to be absolutely required for these Macs, a future release of this patcher may still be helpful in providing support for these Macs' hardware.\n- Macs which have a Penryn CPU but which do not officially support High Sierra: These include pre-2008 iMacs with upgraded CPUs, as well as all 2008 and most 2009 Mac models (any 2009 models not listed above). All of these require \"legacy USB\" support, just like (for instance) 2010 white MacBooks. Once support for those MacBooks is improved in a future patcher release, perhaps support for some of these Macs will be worth revisiting.\n- Without a Metal GPU upgrade (certainly possible on 2008 Mac Pros and possibly iMacs, but not possible on the MacBooks and Mac Minis), these are expected to be unusably slow.\n- As mentioned at the top of this README, 2008 Mac Pro owners should use StarPlayrX's Big Mac patcher instead of this patcher.\n\n## Other important information to know before upgrading or installing\nI *strongly recommend* that you create, and hold onto, an [installer USB for an older version of macOS](https://support.apple.com/en-us/HT201372), ideally one that is supported on your Mac (so that it can run without the use of a patcher). Or, at the absolute minimum, *practice* booting into Internet Recovery (boot while holding down Command-Option-R) so that you know it actually works. Once it boots, try starting Safari and (as a test) see if it can visit GitHub.com. If not, then it may have booted into OS X Lion, which is also old enough that attempting to install it through Internet Recovery will fail. (Internet Recovery tends to be especially likely to boot into Lion if you have only 4GB of RAM. Also, if you have upgraded to an 802.11ac WiFi card, Internet Recovery will fail completely unless you plug into Ethernet. In addition, with the possible exception of flashed 2009 Mac Pros, Internet Recovery is not available on any Mac models prior to 2010.)\n\nIn any case, if you are unable to start Internet Recovery, or it has a version of Safari too old to visit GitHub.com, then it is *vital* that you create an installer USB for an older macOS version and hold onto it in case of emergency.\n\nOnce you create the patched installer USB for Big Sur, hold onto it as well. If you ever reset your Mac's NVRAM, then you will need to use the patched installer USB to repeat step 9 of the installation instructions.\n\nIf you have installed any 3rd-party antivirus program or security suite, make sure to uninstall it before installing Big Sur (or do a fresh installation instead of an upgrade). It is not sufficient to turn the antivirus program off -- it must be uninstalled. If you do not uninstall it, you may have no Internet connection after Big Sur is installed, and the Wi-Fi patch may fail to work.\n\nOn a Mac without a Metal GPU, several programs, including Maps and Photos, will not work. Perhaps there may be patches in the future to provide partial fixes, but upgrading to a Metal GPU is the only actual solution.\n\nFileVault has been buggy throughout the entire Big Sur development cycle. For maximum stability, disable FileVault before upgrading to Big Sur. Once you upgrade to Big Sur, bugs may make it impossible to disable FileVault and may make it impossible to unlock your FileVault volumes when applying updates or booting from the installer USB. (Not to mention, FileVault bugs may also make it impossible to open Terminal on the installer USB.) The best way out of this conundrum is probably to back up the entire Big Sur installation using Time Machine (Time Machine encryption, unlike FileVault, appears to be stable), erase and reinstall Big Sur, and use the Setup Assistant to restore the Time Machine backup.\n\nUpgrading from a Catalina installation which has been patched using dosdude's macOS Catalina Patcher results in an unstable system. The instability is not fixed by running the Big Sur installer again. So far, the only fix seems to be similar to the method for disabling FileVault: Back up the entire Big Sur installation using Time Machine, erase and reinstall Big Sur, and use the Setup Assistant to restore the Time Machine backup. In my testing, this appears to correct the instability.\n\nTime Machine backups must be restored by first performing a fresh Big Sur installation and then doing the Time Machine restore from the Setup Assistant. Attempting to do the restore from the installer USB fails. I do not yet know if this is inherent to Big Sur, inherent to the patching process, or a bug in this patcher.\n\nIf you encounter \"com.apple.DiskManagement.disenter error 49168\" during installation, try rebooting and see if the installation process continues, or try erasing the volume and starting installation over. This appears to be an error that also happens sometimes on supported Macs. If all else fails, a possible workaround is to try formatting the volume as Mac OS Extended instead of APFS in step 8 or 11; it will still be converted to APFS during the installation process, but this may perturb the installation process enough to avoid the error.\n\n## Instructions for use\n\n1. Make sure you have a 16GB or larger USB stick to use for creating the installer.\n2. Obtain a copy of macOS Big Sur.\n3. Download a copy of this patcher. If you are viewing this on GitHub, and you probably are, then click the green \"Code\" button then \"Download ZIP\".\n4. Use Disk Utility to erase the USB stick using \"Mac OS Extended (Journaled)\" format and \"GUID Partition Map\" scheme. (You may need to choose \"Show All Devices\" before Disk Utility will allow you to do this.) In order for this patcher to run optimally, the USB stick must use GUID Partition Map and not Master Boot Record. (This is a new requirement as of micropatcher v0.2.0.) Note that the volume name does not particularly matter, since it will be renamed by `createinstallmedia` in the next step. (If this USB stick already contains a patched Big Sur installer created using micropatcher v0.2.0 or later, and you are re-creating it with a newer version of the micropatcher or a newer version of Big Sur, you may skip this step.) \n5. Use [`createinstallmedia`](https://support.apple.com/en-us/HT201372) as usual to create a bootable USB stick with the installer and recovery environment, as you would on a supported Mac. (This patcher is easier to use if the installer USB stick is not renamed after `createinstallmedia` is used, but it can still work if the USB stick has been renamed.)\n6. Run `micropatcher.sh` to patch the USB stick. If micropatcher.sh is unable to find the USB stick, then try specifying the pathname of the USB stick to micropatcher.sh. The easiest way to do that is to open a Terminal window, drag and drop micropatcher.sh into the Terminal window, go back to Finder, choose Computer from the Go menu, drag and drop the USB stick into the Terminal window, then press Return.\n7.\n    - Another program also needs to be patched onto the USB stick, so run `install-setvars.sh`. If necessary, the same Finder/Terminal drag-and-drop instructions that work in step 6 for `micropatcher.sh` will also work in this step for `install-setvars.sh`.\n    - Unlike `micropatcher.sh`, `install-setvars.sh` needs root permissions (since it accesses the normally hidden EFI partition on the USB stick), so it uses `sudo` to obtain root permissions. Typically this means it will ask for your user account password when it starts.\n    - If you want the patched USB stick to configure your Mac to boot in Verbose Mode, run `install-setvars.sh -v` instead of just `install-setvars.sh`. However, the \"Verbose\" in \"Verbose Mode\" is not a joke, and most users will want to avoid this.\n    - As of Big Sur Micropatcher v0.4, `install-setvars.sh` will now install a version of setvars which enables Apple's System Integrity Protection (SIP) and Authenticated Root Volume (ARV) security features if it is run on a Late 2013 iMac, or a version of setvars which disables both of these features if it is run on any other model of Mac. You may add a `-d` option to force the installation of the setvars version which disables these features (for instance, if you are creating the USB on a Late 2013 iMac but you will be using it on another Mac). You may also add a `-e` option to for the installation of the setvars version which enables these features (for instance, if you are installing Big Sur on a 2012 or 2013 Mac that has been upgraded with an 802.11ac WiFi card and therefore does not need a WiFi patch).\n8. Since Disk Utility in Big Sur may have new bugs, this may be a good time to use Disk Utility in High Sierra/Mojave/Catalina to do any partitioning or formatting you may need.\n9. (Try repeating this step if you see a prohibited/no-entry sign during boot) Restart the Mac while holding down the Option key to use the Startup Selector. The installer USB will actually show up as *two* different drives with the same icon, \"Install macOS Big Sur Beta\" (or similar) and \"EFI Boot\". (If you have multiple \"EFI Boot\" drives, it's the one with the yellow icon. If more than one has a yellow icon and you cannot tell which one is the one on the installer USB, try unplugging the installer USB, observing the set of icons on the screen, then plugging the installer USB back in and watching how the icons change.) Start up from \"EFI Boot\". Within a few seconds, although most likely in under a second, the Mac will suddenly power down. This indicates that the setvars EFI utility has finished making the necessary changes to the Mac's NVRAM settings. (These changes include disabling SIP, disabling authenticated root, and enabling TRIM on non-Apple SSDs.)\n10. Turn the Mac back on (or reboot it if you skipped step 9), with the Option key down again, to use the Startup Selector again. This time, boot from \"Install macOS Big Sur Beta\" (or similar). (If the Startup Selector is not showing your USB stick this time, try unplugging and replugging the USB stick.) If you see a prohibited/no-entry sign, then try repeating step 9.\n11. If you need to do any partitioning or formatting with Disk Utility, and you didn't do it in step 8, now is the time to do it.\n12. (Optional, for very advanced users only, 99.9% of users should just pretend this step doesn't even exist) This patcher normally disables APFS system volume sealing, except when both SIP and ARV are enabled (see step 7 for more information about that). If you wish to unconditionally enable APFS system volume sealing, then open Terminal, run the command `/Volumes/Image\\ Volume/insert-hax.sh --seal` and quit Terminal. If you have no idea what any of this means, just skip this step. (Also, note that even though *volume sealing* is disabled by default with this patcher, *snapshot root* is still enabled. Just mentioning this because people sometimes confuse the two issues. If you have some need to disable snapshot root, that is beyond the scope of this README. Personally, I would suggest learning to live in harmony with snapshot root rather than declaring war on it; the section \"Modifying the System volume yourself\" at the end of this README may help in that regard.)\n13. Start the Installer as you would on a supported Mac.\n14. Once installation is underway, come back in an hour or so, and you should be at the macOS Setup Assistant! It may take less time if you're installing on a 2012/2013 Mac, or more time (possibly 2-3 hours) if you're installing on a hard drive/SSD connected via USB 2.0, or if you're upgrading instead of a fresh install. (If you actually watch the installation process, don't be surprised if it seems to get stuck at \"Less than a minute remaining...\" for a long time. Allow it well over half an hour. It should eventually reboot on its own and keep going. Likewise, don't worry if it reboots with 10-12 minutes remaining; that is also often normal.)\n    - On many pre-2011 Macs, such as 2010 MacBooks, it will start crashing repeatedly with kernel panics shortly before the Setup Assistant would normally show up. Once this happens, boot from the installer USB and perform step 15 (the next step), with the `--2010` option. That will fix the kernel panic.\n15.\n    - If you're on a Late 2013 iMac, or you've replaced the 802.11n card in your 2012/2013 Mac with an 802.11ac card, you're done.\n    - Otherwise, press Command-Q and wait a few seconds, then the Setup Assistant should let you shut down. After you shut down, boot from the patched installer USB again (as in step 10), then open Terminal. Next, run the `patch-kexts.sh` command to do post-install patching (such as fixing Wi-Fi). There are several ways of formatting this command. For example, for a system volume named `Macintosh HD`, try one of the following:\n        - `/Volumes/Image\\ Volume/patch-kexts.sh /Volumes/Macintosh\\ HD`\n        - `'/Volumes/Image Volume/patch-kexts.sh' '/Volumes/Macintosh HD'`\n        - `\"/Volumes/Image Volume/patch-kexts.sh\" \"/Volumes/Macintosh HD\"`\n        - You can also mix-and-match quotation/escaping formats, such as `/Volumes/Image\\ Volume/patch-kexts.sh \"/Volumes/Macintosh HD\"`\n        - Backslashes may work better with tab completion (see below), but many users will find quotation marks to be easier.\n    - Don't forget that tab completion is your friend! For instance, you can type `/V<tab>/Im<tab>/p<tab> /V<tab>/Mac<tab>` at the command prompt -- that's much less typing than `/Volumes/Image\\ Volume/patch-kexts.sh /Volumes/Macintosh\\ HD`!\n    - If you're going to use the installation on a 2010 or older Mac (except for 2009-2010 Mac Pro), add a \"--2010\" command line option, for example `/Volumes/Image\\ Volume/patch-kexts.sh --2010 /Volumes/Macintosh\\ HD`.\n    - Normally `patch-kexts.sh` installs the `mojave-hybrid` WiFi patch (used since micropatcher v0.2.1), but if you need to try a different WiFi patch for any reason, try adding the `--wifi=hv12v-old` (same as v0.0.6-v0.0.20) or `--wifi=hv12v-new` (same as v0.1.0 or v0.2.0) option.\n    - `patch-kexts.sh` tries to automatically detect whether it should create a new APFS snapshot if it is running in a live system, and it defaults to creating a new snapshot if it is running from the patched installer USB. If you need to override this, there are now `--create-snapshot` and `--no-create-snapshot` command line options, as of micropatcher v0.3.0.\n    - It is also possible to do this step without booting from the patched installer USB -- just open Terminal and run `/Volumes/Install\\ macOS\\ Big\\ Sur\\ Beta/patch-kexts.sh` with any command line options if needed (such as `/Volumes/Install\\ macOS\\ Big\\ Sur\\ Beta/patch-kexts.sh --2011`), but do not specify a volume name, and patch-kexts.sh will automatically default to the boot drive.\n16. (This step is unnecessary for most users.) If you will be using the Big Sur installation on a different Mac (for instance, installing on a 2011 or later Mac and using it on a 2009 or 2010 Mac), it is possible that the other Mac (the one not used for installation) may try to boot off the wrong APFS snapshot. To prevent this, run zap-snapshots.sh on your System volume, to remove all but the most recent snapshot. For instance, `/Volumes/Image\\ Volume/zap-snapshots.sh /Volumes/Macintosh\\ HD`. (Or you can also do this if you are running low on disk space on an older beta of Big Sur.) This is basically the same as step 15, but with `zap-snapshots` instead of `patch-kexts`, and without any command line options like `--2010` or `--2011`.\n17. After step 15 (and 16 if necessary), reboot into your Big Sur installation and complete the Setup Assistant if you have not already done so. Pay particular attention to the screen that asks if you want to transfer information from another Mac or PC; if you want to restore a Time Machine backup, you must do it from this screen. The previous method of restoring it from the macOS Installer USB is still visible in the Installer USB's menu, but it no longer works.\n18. On Macs which do not support Metal (many 2011 and older models), make sure to enable Reduce Transparency to eliminate many seemingly random crashes, and if icons on the right-hand side of the menu bar are invisible afterward, try Dark mode. Enabling Reduce Motion will increase performance a little more, and so might Increase Contrast. (If you will be using the installation on a 2009/2010 Mac, it would be a good idea to finish the Setup Assistant on a 2011 or later Mac and enable Reduce Transparency before moving the installation over.)\n19. Optional (but can greatly improve performance for Macs that do not support Metal): Once booted in your Big Sur installation, run `disable-animations.sh` from the patched installer USB to disable most animations. If you want to reenable them, run `reenable-animations.sh`. (Thanks to johncaling40 for these contributed scripts.)\n\nIf you reset your Mac's NVRAM, attempts to boot Big Sur afterward will fail with a prohibited/no-entry sign on the screen. To fix this, repeat step 9 (booting the \"EFI Boot\" partition of the patched installer USB). Likewise, if you transplant the hard drive with the Big Sur installation from one Mac to another, or you move an external hard drive/SSD with Big Sur from one Mac to another, you will need to repeat step 9 on the destination Mac before it can boot Big Sur.\n\nTo update from one beta to the next, you may create a bootable USB for the new beta (using createinstallmedia), patch it with this patcher, then follow the directions above (except skip Disk Utility, i.e. skip steps 8 and 11) to boot from the patched USB and install it on top of the previous beta. (Allow something like 1-3 hours for the update, even if it looks like it froze up at some point, especially on a 2011 or older Mac.) This will uninstall the Wi-Fi, etc. kexts that were installed in step 15 on the previous beta, so you will need to redo that step as well. There are other methods of updating using delta updaters, but they are more difficult (and you will need to run `patch-kexts.sh -u`, described below, to remove all kext patches before attepting that type of update).\n\nFor what it's worth, `patch-kexts.sh` has a `-u` command line option for undoing the kext patches (such as 802.11n Wi-Fi). It can only undo kext changes applied through `patch-kexts.sh` and not any kext changes applied through other means. (A more time-consuming but potentially more thorough alternative is to reinstall Big Sur on top of your existing installation, as if you were using the method described in the previous paragraph to update to a new Big Sur beta.)\n\nIf you want to undo the setvars EFI utility's changes to boot-args and csrutil settings, then boot from the USB stick, open Terminal, and run `/Volumes/Image\\ Volume/reset-vars.sh`. (Or you can just start your Mac while holding down Command-Option-P-R to reset NVRAM. That is probably a better way of doing it.)\n\nThe best way to remove the patch from the USB stick is to redo `createinstallmedia`, but if you are working on patcher development or otherwise need a faster way to do it, you can run `unpatch.sh`.\n\n## Modifying the System volume yourself\n\nAfter you finish installation, you may want to modify the System volume yourself. For various reasons you may want to install kext patches other than those which are part of this patcher. Or there may be other changes you want to make to the System volume. However, Big Sur normally boots from a read-only snapshot of the System volume, so making changes is typically not as simple as remounting the volume as read-write. Two shell scripts to assist with this, `remount-sysvol.sh` and `rebuild-kc.sh` are provided. For now, `remount-sysvol.sh` should be run from the patched installer USB (but after booting from your Big Sur installation). \n\n1. Run `/Volumes/Install\\ macOS\\ Big\\ Sur\\ Beta/remount-sysvol.sh`. Due to a bug which will be fixed in a future patcher release, it must be run like that, with the full pathname.\n2. The script will either remount `/` as read-write (if your system somehow started directly off the System volume), or it will create a temporary mount point and mount the underlying System volume at that temporary mount point. Then it will change the current directory to `/System/Library/Extensions` wherever the System volume is mounted read-write (probably on the temporary mount point), and it will start a subshell.\n3. At this point, you can make whatever changes you want to the kexts in `/System/Library/Extensions`, or whatever other changes you want to make on the System volume for that matter. These changes can be made using whatever means you prefer -- they do not need to be done through the subshell (although they can be). You may also run `/Volumes/Install\\ macOS\\ Big\\ Sur\\ Beta/zap-snapshots.sh` to delete all APFS system snapshots except for the most recent (this script must be run inside the subshell).\n4. Once you are done modifying the System volume, run `\"$REBUILD_KC\"` (including the quotation marks). This must be run inside the subshell. This will rebuild the kernel/kext collections that Big Sur uses as its kernel cache. Note that if you try to install a kext which is incompatible with Big Sur, this may fail; in that case, you will need to undo the incompatible kext change and try `\"$REBUILD_KC\"` again. (If you ran zap-snapshots.sh in step 3 without making any other changes to your System volume, then this step is not required. For most Big Sur systems, this step will be required if any other changes are made to the System volume, to create and \"bless\" a new snapshot. If your Big Sur system boots directly from the System volume rather than using snapshot booting -- this is rare -- then this step is only needed if you make kext changes, and it will not create any snapshots.)\n5. Once `\"$REBUILD_KC\"` finishes successfully, run the `exit` command in the subshell. The `remount-sysvol.sh` script will then attempt to unmount the temporary mount point. The unmount attempt may fail, but if so, it's no big deal because macOS will unmount it when restarting anyway.\n"
        },
        {
          "name": "install-setvars.sh",
          "type": "blob",
          "size": 7.3720703125,
          "content": "#!/bin/bash\n\n### begin function definitions ###\n\n# Check that we can access the directory that ocntains this script, as well\n# as the root directory of the installer USB. Access to both of these\n# directories is vital, and Catalina's TCC controls for Terminal are\n# capable of blocking both. Therefore we must check access to both\n# directories before proceeding.\ncheckDirAccess() {\n    # List the two directories, but direct both stdout and stderr to\n    # /dev/null. We are only interested in the return code.\n    ls \"$VOLUME\" . &> /dev/null\n}\n\n### end function definitions ###\n\n# Make sure there isn't already an \"EFI\" volume mounted.\nif [ -d \"/Volumes/EFI\" ]\nthen\n    echo 'An \"EFI\" volume is already mounted. Please unmount it then try again.'\n    echo \"If you don't know what this means, then restart your Mac and try again.\"\n    echo\n    echo \"install-setvars cannot continue.\"\n    exit 1\nfi\n\n# For this script, root permissions are vital.\n[ $UID = 0 ] || exec sudo \"$0\" \"$@\"\n\nwhile [[ $1 = -* ]]\ndo\n    case $1 in\n    -v | --verbose)\n        VERBOSEBOOT=\"YES\"\n        #echo 'Verbose boot option enabled.'\n        ;;\n    -e | --enable*)\n        SIPARV=\"YES\"\n        ;;\n    -d | --disable*)\n        SIPARV=\"NO\"\n        ;;\n    *)\n        echo \"Unknown command line option: $1\"\n        exit 1\n        ;;\n    esac\n\n    shift\ndone\n\n# Allow the user to drag-and-drop the USB stick in Terminal, to specify the\n# path to the USB stick in question. (Otherwise it will try hardcoded paths\n# for a presumed Big Sur Golden Master/public release, beta 2-or-later,\n# and beta 1, in that order.)\nif [ -z \"$1\" ]\nthen\n    for x in \"Install macOS Big Sur\" \"Install macOS Big Sur Beta\" \"Install macOS Beta\"\n    do\n        if [ -d \"/Volumes/$x/$x.app\" ]\n        then\n            VOLUME=\"/Volumes/$x\"\n            APPPATH=\"$VOLUME/$x.app\"\n            break\n        fi\n    done\n\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick.\"\n        echo \"Remember to create it using createinstallmedia, and do not rename it.\"\n        echo \"If all else fails, try specifying the path to the USB stick\"\n        echo \"as a command line parameter to this script.\"\n        echo\n        echo \"install-setvars cannot continue and will now exit.\"\n        exit 1\n    fi\nelse\n    VOLUME=\"$1\"\n    # The use of `echo` here is to force globbing.\n    APPPATH=`echo -n \"$VOLUME\"/Install\\ macOS*.app`\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick for patching.\"\n        echo \"Make sure you specified the correct volume. You may also try\"\n        echo \"not specifying a volume and allowing the patcher to find\"\n        echo \"the volume itself.\"\n        echo\n        echo \"install-setvars cannot continue and will now exit.\"\n        exit 1\n    fi\nfi\n\n# Check if the payloads directory is inside the current directory. If not,\n# it's probably inside the same directory as this script, so find that\n# directory.\nif [ ! -d payloads ]\nthen\n    BASEDIR=\"`echo $0|sed -E 's@/[^/]*$@@'`\"\n    [ -z \"$BASEDIR\" ] || cd \"$BASEDIR\"\nfi\n\n# Check again in case we changed directory after the first check\nif [ ! -d payloads ]\nthen\n    echo '\"payloads\" folder was not found.'\n    echo\n    echo \"install-setvars cannot continue and will now exit.\"\n    exit 1\nfi\n\n# Check to make sure we can access both our own directory and the root\n# directory of the USB stick. Terminal's TCC permissions in Catalina can\n# prevent access to either of those two directories. However, only do this\n# check on Catalina or higher. (I can add an \"else\" block later to handle\n# Mojave and earlier, but Catalina is responsible for every single bug\n# report I've received due to this script lacking necessary read permissions.)\nif [ `uname -r | sed -e 's@\\..*@@'` -ge 19 ]\nthen\n    echo 'Checking read access to necessary directories...'\n    if ! checkDirAccess\n    then\n        echo 'Access check failed.'\n        tccutil reset All com.apple.Terminal\n        echo 'Retrying access check...'\n        if ! checkDirAccess\n        then\n            echo\n            echo 'Access check failed again. Giving up.'\n            echo 'Next time, please give Terminal permission to access removable drives,'\n            echo 'as well as the location where this patcher is stored (for example, Downloads).'\n            exit 1\n        else\n            echo 'Access check succeeded on second attempt.'\n            echo\n        fi\n    else\n        echo 'Access check succeeded.'\n        echo\n    fi\nfi\n\nMOUNTEDPARTITION=`mount | fgrep \"$VOLUME\" | awk '{print $1}'`\nif [ -z \"$MOUNTEDPARTITION\" ]\nthen\n    echo Failed to find the partition that\n    echo \"$VOLUME\"\n    echo is mounted from. install-setvars cannot proceed.\n    exit 1\nfi\n\nDEVICE=`echo -n $MOUNTEDPARTITION | sed -e 's/s[0-9]*$//'`\nPARTITION=`echo -n $MOUNTEDPARTITION | sed -e 's/^.*disk[0-9]*s//'`\necho \"$VOLUME found on device $MOUNTEDPARTITION\"\n\nif [ \"x$PARTITION\" = \"x1\" ]\nthen\n    echo \"The volume $VOLUME\"\n    echo \"appears to be on partition 1 of the USB stick, therefore the stick is\"\n    echo \"incorrectly partitioned (possibly MBR instead of GPT?).\"\n    echo\n    echo 'Please use Disk Utility to erase the USB stick as \"Mac OS Extended'\n    echo '(Journaled)\" format on \"GUID Partition Map\" scheme and start over with'\n    echo '\"createinstallmedia\". Or for other methods, please refer to the micropatcher'\n    echo \"README for more information.\"\n    echo\n    echo \"install-setvars cannot continue.\"\n    exit 1\nfi\n\ndiskutil mount ${DEVICE}s1\nif [ ! -d \"/Volumes/EFI\" ]\nthen\n    echo \"Partition 1 of the USB stick does not appear to be an EFI partition, or\"\n    echo \"mounting of the partition somehow failed.\"\n    echo\n    echo 'Please use Disk Utility to erase the USB stick as \"Mac OS Extended'\n    echo '(Journaled)\" format on \"GUID Partition Map\" scheme and start over with'\n    echo '\"createinstallmedia\". Or for other methods, please refer to the micropatcher'\n    echo \"README for more information.\"\n    echo\n    echo \"install-setvars cannot continue.\"\n    exit 1\nfi\n\n# Before proceeding with the actual installation, see if we were provided\n# a command line option for SIP/ARV, and if not, make a decision based\n# on what Mac model this is.\nif [ -z \"$SIPARV\" ]\nthen\n    MACMODEL=`sysctl -n hw.model`\n    echo \"Detected Mac model is:\" $MACMODEL\n    case $MACMODEL in\n    \"iMac14,1\" | \"iMac14,2\" | \"iMac14,3\")\n        echo \"Late 2013 iMac detected, so enabling SIP/ARV.\"\n        echo \"(Use -d option to disable SIP/ARV if necessary.)\"\n        SIPARV=\"YES\"\n        ;;\n    *)\n        echo \"This Mac is not a Late 2013 iMac, so disabling SIP/ARV.\"\n        echo \"(Use -e option to enable SIP/ARV if necessary.)\"\n        SIPARV=\"NO\"\n        ;;\n    esac\n\n    echo\nfi\n\n# Now do the actual installation\necho \"Installing setvars EFI utility.\"\nrm -rf /Volumes/EFI/EFI\nif [ \"x$VERBOSEBOOT\" = \"xYES\" ]\nthen\n    if [ \"x$SIPARV\" = \"xYES\" ]\n    then\n        echo 'Verbose boot enabled, SIP/ARV enabled'\n        cp -r setvars/EFI-enablesiparv-vb /Volumes/EFI/EFI\n    else\n        echo 'Verbose boot enabled, SIP/ARV disabled'\n        cp -r setvars/EFI-verboseboot /Volumes/EFI/EFI\n    fi\nelif [ \"x$SIPARV\" = \"xYES\" ]\nthen\n    echo 'Verbose boot disabled, SIP/ARV enabled'\n    cp -r setvars/EFI-enablesiparv /Volumes/EFI/EFI\nelse\n    echo 'Verbose boot disabled, SIP/ARV disabled'\n    cp -r setvars/EFI /Volumes/EFI/EFI\nfi\n\necho \"Unmounting EFI volume (if this fails, just eject in Finder afterward).\"\numount /Volumes/EFI || diskutil unmount /Volumes/EFI\n\necho\necho 'install-setvars finished.'\n"
        },
        {
          "name": "micropatcher.sh",
          "type": "blob",
          "size": 7.1396484375,
          "content": "#!/bin/bash\nVERSIONNUM=0.5.1\nVERSION=\"BarryKN Big Sur Micropatcher v$VERSIONNUM\"\n\n### begin function definitions ###\n\n# Handle permissions failure that happened during a copy (cp). This has\n# usually been due to the user needing root permissions for some reason.\n# (It used to be possible to hit this code path for other reasons, but\n# I believe I have fixed that now.)\nhandleCopyPermissionsFailure() {\n    if [ $UID != 0 ]\n    then\n        echo 'cp failed. Probably a permissions error. This is not expected, but'\n        echo 'patcher will attempt workaround by trying again as root.'\n        echo\n        exec sudo \"$0\" \"$@\"\n    else\n        echo 'cp failed, even as root. This is unexpected.'\n        echo 'Patcher cannot continue.'\n        exit 1\n    fi\n}\n\n# Check that we can access the directory that ocntains this script, as well\n# as the root directory of the installer USB. Access to both of these\n# directories is vital, and Catalina's TCC controls for Terminal are\n# capable of blocking both. Therefore we must check access to both\n# directories before proceeding.\ncheckDirAccess() {\n    # List the two directories, but direct both stdout and stderr to\n    # /dev/null. We are only interested in the return code.\n    ls \"$VOLUME\" . &> /dev/null\n}\n\n### end function definitions ###\n\n\necho $VERSION\necho 'Thanks to jackluke, ASentientBot, highvoltage12v, testheit, and'\necho 'ParrotGeek for their hard work to get Big Sur running on unsupported'\necho 'Macs! (See the README for more information.)'\n# Add a blank line of output to make things easier on the eyes.\necho\n\n# Check for --force option on the command line\n# (currently does nothing, but that will change in the near future)\nif [ \"x$1\" = \"x--force\" ]\nthen\n    FORCE=\"YES\"\n    shift\nfi\n\n# Allow the user to drag-and-drop the USB stick in Terminal, to specify the\n# path to the USB stick in question. (Otherwise it will try hardcoded paths\n# for a presumed Big Sur Golden Master/public release, beta 2-or-later,\n# and beta 1, in that order.)\nif [ -z \"$1\" ]\nthen\n    for x in \"Install macOS Big Sur\" \"Install macOS Big Sur Beta\" \"Install macOS Beta\"\n    do\n        if [ -d \"/Volumes/$x/$x.app\" ]\n        then\n            VOLUME=\"/Volumes/$x\"\n            APPPATH=\"$VOLUME/$x.app\"\n            break\n        fi\n    done\n\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick.\"\n        echo \"Remember to create it using createinstallmedia, and do not rename it.\"\n        echo \"If all else fails, try specifying the path to the USB stick\"\n        echo \"as a command line parameter to this script.\"\n        echo\n        echo \"Patcher cannot continue and will now exit.\"\n        exit 1\n    fi\nelse\n    VOLUME=\"$1\"\n    # The use of `echo` here is to force globbing.\n    APPPATH=`echo -n \"$VOLUME\"/Install\\ macOS*.app`\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick for patching.\"\n        echo \"Make sure you specified the correct volume. You may also try\"\n        echo \"not specifying a volume and allowing the patcher to find\"\n        echo \"the volume itself.\"\n        echo\n        echo \"Patcher cannot continue and will now exit.\"\n        exit 1\n    fi\nfi\n\n# Check if the payloads directory is inside the current directory. If not,\n# it's probably inside the same directory as this script, so find that\n# directory.\nif [ ! -d payloads ]\nthen\n    BASEDIR=\"`echo $0|sed -E 's@/[^/]*$@@'`\"\n    [ -z \"$BASEDIR\" ] || cd \"$BASEDIR\"\nfi\n\n# Check again in case we changed directory after the first check\nif [ ! -d payloads ]\nthen\n    echo '\"payloads\" folder was not found.'\n    echo\n    echo \"Patcher cannot continue and will now exit.\"\n    exit 1\nfi\n\n# Check to make sure we can access both our own directory and the root\n# directory of the USB stick. Terminal's TCC permissions in Catalina can\n# prevent access to either of those two directories. However, only do this\n# check on Catalina or higher. (I can add an \"else\" block later to handle\n# Mojave and earlier, but Catalina is responsible for every single bug\n# report I've received due to this script lacking necessary read permissions.)\nif [ `uname -r | sed -e 's@\\..*@@'` -ge 19 ]\nthen\n    echo 'Checking read access to necessary directories...'\n    if ! checkDirAccess\n    then\n        echo 'Access check failed.'\n        tccutil reset All com.apple.Terminal\n        echo 'Retrying access check...'\n        if ! checkDirAccess\n        then\n            echo\n            echo 'Access check failed again. Giving up.'\n            echo 'Next time, please give Terminal permission to access removable drives,'\n            echo 'as well as the location where this patcher is stored (for example, Downloads).'\n            exit 1\n        else\n            echo 'Access check succeeded on second attempt.'\n            echo\n        fi\n    else\n        echo 'Access check succeeded.'\n        echo\n    fi\nfi\n\nif [ -e \"$VOLUME/Patch-Version.txt\" ]\nthen\n     echo \"USB stick has already been patched. Running unpatch.sh to remove the\"\n     echo \"existing patches before continuing.\"\n     echo\n     if ./unpatch.sh --no-sync \"$VOLUME\"\n     then\n         echo 'Patcher is now continuing.'\n     else\n         echo 'Unpatcher failed. Patcher cannot continue.'\n         exit 1\n     fi\nfi\n\n\n# Patch com.apple.Boot.plist\necho 'Patching com.apple.Boot.plist...'\n# It would seem more obvious to do mv then cp, but doing cp then cat lets us\n# use cat as a permissions-preserving Unix trick, just to be extra cautious.\nif [ ! -e \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist.original\" ]\nthen\n    cp \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist\" \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist.original\" || handleCopyPermissionsFailure\nfi\ncat payloads/com.apple.Boot.plist > \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist\"\n\n# Add the trampoline.\necho 'Installing trampoline...'\nTEMPAPP=\"$VOLUME/tmp.app\"\nmv -f \"$APPPATH\" \"$TEMPAPP\"\ncp -r payloads/trampoline.app \"$APPPATH\"\nmv -f \"$TEMPAPP\" \"$APPPATH/Contents/MacOS/InstallAssistant.app\"\ncp \"$APPPATH/Contents/MacOS/InstallAssistant\" \"$APPPATH/Contents/MacOS/InstallAssistant_plain\"\ncp \"$APPPATH/Contents/MacOS/InstallAssistant\" \"$APPPATH/Contents/MacOS/InstallAssistant_springboard\"\npushd \"$APPPATH/Contents\" > /dev/null\nfor item in `cd MacOS/InstallAssistant.app/Contents;ls -1 | fgrep -v MacOS`\ndo\n    ln -s MacOS/InstallAssistant.app/Contents/$item .\ndone\npopd > /dev/null\ntouch \"$APPPATH\"\n\n# Copy the shell scripts into place so that they may be used once the\n# USB stick is booted.\necho 'Copying shell scripts...'\ncp -f payloads/*.sh \"$VOLUME\"\n\n# Copy Hax dylibs into place\necho \"Adding Hax dylibs...\"\ncp -f payloads/ASentientBot-Hax/BarryKN-fork/Hax*.dylib \"$VOLUME\"\n\necho 'Adding kexts and other binaries...'\ncp -rf payloads/kexts payloads/bin \"$VOLUME\"\n\n# Let's play it safe and ensure the shell scripts, dylibs, etc. are executable.\nchmod -R u+x \"$VOLUME\"/*.sh \"$VOLUME\"/Hax*.dylib \"$VOLUME\"/bin\n\n# Save a file onto the USB stick that says what patcher & version was used,\n# so it can be identified later (e.g. for troubleshooting purposes).\necho 'Saving patcher version info...'\necho \"$VERSION\" > \"$VOLUME/Patch-Version.txt\"\n\necho\necho 'Syncing.'\nsync\n\necho\necho 'Micropatcher finished.'\n"
        },
        {
          "name": "misc-scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "payloads",
          "type": "tree",
          "content": null
        },
        {
          "name": "setvars",
          "type": "tree",
          "content": null
        },
        {
          "name": "unpatch.sh",
          "type": "blob",
          "size": 3.8173828125,
          "content": "#!/bin/bash\necho 'Unpatcher starting. If this fails, try recreating the installer USB using'\necho 'createinstallmedia.'\necho\n\n# Check for --no-sync option\nif [ \"x$1\" = \"x--no-sync\" ]\nthen\n    SKIP_SYNC=\"YES\"\n    shift\nfi\n\n# Allow the user to drag-and-drop the USB stick in Terminal, to specify the\n# path to the USB stick in question. (Otherwise it will try hardcoded paths\n# for a presumed Big Sur Golden Master/public release, beta 2-or-later,\n# and beta 1, in that order.)\nif [ -z \"$1\" ]\nthen\n    for x in \"Install macOS Big Sur\" \"Install macOS Big Sur Beta\" \"Install macOS Beta\"\n    do\n        if [ -d \"/Volumes/$x/$x.app\" ]\n        then\n            VOLUME=\"/Volumes/$x\"\n            APPPATH=\"$VOLUME/$x.app\"\n            break\n        fi\n    done\n\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick for unpatching.\"\n        echo \"If all else fails, try specifying the path to the USB stick\"\n        echo \"as a command line parameter to this script.\"\n        echo\n        echo \"Unpatcher cannot continue and will now exit.\"\n        exit 1\n    fi\nelse\n    VOLUME=\"$1\"\n    # The use of `echo` here is to force globbing.\n    APPPATH=`echo -n \"$VOLUME\"/Install\\ macOS*.app`\n    if [ ! -d \"$APPPATH\" ]\n    then\n        echo \"Failed to locate Big Sur recovery USB stick for unpatching.\"\n        echo \"Make sure you specified the correct volume. You may also try\"\n        echo \"not specifying a volume and allowing the unpatcher to find\"\n        echo \"the volume itself.\"\n        echo\n        echo \"Unpatcher cannot continue and will now exit.\"\n        exit 1\n    fi\nfi\n\nif [ ! -e \"$VOLUME/Patch-Version.txt\" ]\nthen\n    echo 'Patch not detected on USB stick, but proceeding with unpatch anyway.'\n    echo 'This should do no harm. Any subsequent error messages are,'\n    echo 'in all likelihood, harmless.'\n    echo\nfi\n\n# Undo the boot-time compatibility check patch, if present\necho 'Checking for boot-time compatibility check patch (v0.0.1/v0.0.2).'\nif [ -e \"$VOLUME/System/Library/CoreServices/PlatformSupport.plist.inactive\" ]\nthen\n    echo 'Removing boot-time compatibility check patch.'\n    mv \"$VOLUME/System/Library/CoreServices/PlatformSupport.plist.inactive\" \\\n       \"$VOLUME/System/Library/CoreServices/PlatformSupport.plist\"\nelse\n    echo 'Boot-time compatibility check patch not present; continuing.'\nfi\n\necho\n\n# Undo the com.apple.Boot.plist patch, if present\necho 'Checking for com.apple.Boot.plist patch (v0.0.3+).'\nif [ -e \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist.original\" ]\nthen\n    echo 'Removing com.apple.Boot.plist patch.'\n    cat \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist.original\" > \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist\"\n    rm \"$VOLUME/Library/Preferences/SystemConfiguration/com.apple.Boot.plist.original\"\nelse\n    echo 'com.apple.Boot.plist patch not present; continuing.'\nfi\n\necho\nif [ -d \"$APPPATH/Contents/MacOS/InstallAssistant.app\" ]\nthen\n    echo 'Removing trampoline.'\n    TEMPAPP=\"$VOLUME/tmp.app\"\n    mv -f \"$APPPATH/Contents/MacOS/InstallAssistant.app\" \"$TEMPAPP\"\n    rm -rf \"$APPPATH\"\n    mv -f \"$TEMPAPP\" \"$APPPATH\"\nelse\n    echo 'Looked for trampoline (v0.2.0+) but trampoline is not present. Continuing...'\nfi\n\necho 'Removing kexts, shell scripts, patcher version info, etc.'\n# For v0.0.9 and earlier\nrm -rf \"$VOLUME\"/*.kext\nrm -f \"$VOLUME\"/*.kext.zip\n# For v0.0.10 and later\nrm -rf \"$VOLUME\"/kexts\n# For v0.3.3 and later\nrm -f \"$VOLUME\"/kmutil*\n# For v0.4.2 and later\nrm -f \"$VOLUME\"/bless*\n# For v0.4.5pre\nrm -f \"$VOLUME\"/patch.*\n# For v0.5.0 and later\nrm -rf \"$VOLUME\"/bin\n# For all versions\nrm -f \"$VOLUME\"/*.sh \"$VOLUME/Patch-Version.txt\"\n\necho 'Remvoing Hax dylibs...'\nrm -f \"$VOLUME\"/Hax*.dylib\nrm -rf \"$VOLUME\"/Hax*.app\n\nif [ \"x$SKIP_SYNC\" != \"xYES\" ]\nthen\n    echo\n    echo 'Syncing.'\n    sync\nfi\n\necho\necho 'Unpatcher finished.'\n"
        }
      ]
    }
  ]
}