{
  "metadata": {
    "timestamp": 1736568553101,
    "page": 578,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjU3OQ==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "ninjudd/drip",
      "stars": 1545,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.052734375,
          "content": "*~\n*.class\n*.jar\n*.tgz\nbin/drip_*\ntest/scala\nrepl-port"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 10.95703125,
          "content": "THE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC\nLICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM\nCONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and\ndocumentation distributed under this Agreement, and\n\nb) in the case of each subsequent Contributor:\n\ni) changes to the Program, and\n\nii) additions to the Program;\n\nwhere such changes and/or additions to the Program originate from and are\ndistributed by that particular Contributor. A Contribution 'originates' from\na Contributor if it was added to the Program by such Contributor itself or\nanyone acting on such Contributor's behalf. Contributions do not include\nadditions to the Program which: (i) are separate modules of software\ndistributed in conjunction with the Program under their own license\nagreement, and (ii) are not derivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents\" mean patent claims licensable by a Contributor which are\nnecessarily infringed by the use or sale of its Contribution alone or when\ncombined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this\nAgreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement,\nincluding all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free copyright license to\nreproduce, prepare derivative works of, publicly display, publicly perform,\ndistribute and sublicense the Contribution of such Contributor, if any, and\nsuch derivative works, in source code and object code form.\n\nb) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free patent license under\nLicensed Patents to make, use, sell, offer to sell, import and otherwise\ntransfer the Contribution of such Contributor, if any, in source code and\nobject code form.  This patent license shall apply to the combination of the\nContribution and the Program if, at the time the Contribution is added by the\nContributor, such addition of the Contribution causes such combination to be\ncovered by the Licensed Patents. The patent license shall not apply to any\nother combinations which include the Contribution. No hardware per se is\nlicensed hereunder.\n\nc) Recipient understands that although each Contributor grants the licenses\nto its Contributions set forth herein, no assurances are provided by any\nContributor that the Program does not infringe the patent or other\nintellectual property rights of any other entity. Each Contributor disclaims\nany liability to Recipient for claims brought by any other entity based on\ninfringement of intellectual property rights or otherwise. As a condition to\nexercising the rights and licenses granted hereunder, each Recipient hereby\nassumes sole responsibility to secure any other intellectual property rights\nneeded, if any. For example, if a third party patent license is required to\nallow Recipient to distribute the Program, it is Recipient's responsibility\nto acquire that license before distributing the Program.\n\nd) Each Contributor represents that to its knowledge it has sufficient\ncopyright rights in its Contribution, if any, to grant the copyright license\nset forth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form under\nits own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\n\nb) its license agreement:\n\ni) effectively disclaims on behalf of all Contributors all warranties and\nconditions, express and implied, including warranties or conditions of title\nand non-infringement, and implied warranties or conditions of merchantability\nand fitness for a particular purpose;\n\nii) effectively excludes on behalf of all Contributors all liability for\ndamages, including direct, indirect, special, incidental and consequential\ndamages, such as lost profits;\n\niii) states that any provisions which differ from this Agreement are offered\nby that Contributor alone and not by any other party; and\n\niv) states that source code for the Program is available from such\nContributor, and informs licensees how to obtain it in a reasonable manner on\nor through a medium customarily used for software exchange.\n\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\n\nb) a copy of this Agreement must be included with each copy of the Program.\n\nContributors may not remove or alter any copyright notices contained within\nthe Program.\n\nEach Contributor must identify itself as the originator of its Contribution,\nif any, in a manner that reasonably allows subsequent Recipients to identify\nthe originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities with\nrespect to end users, business partners and the like. While this license is\nintended to facilitate the commercial use of the Program, the Contributor who\nincludes the Program in a commercial product offering should do so in a\nmanner which does not create potential liability for other Contributors.\nTherefore, if a Contributor includes the Program in a commercial product\noffering, such Contributor (\"Commercial Contributor\") hereby agrees to defend\nand indemnify every other Contributor (\"Indemnified Contributor\") against any\nlosses, damages and costs (collectively \"Losses\") arising from claims,\nlawsuits and other legal actions brought by a third party against the\nIndemnified Contributor to the extent caused by the acts or omissions of such\nCommercial Contributor in connection with its distribution of the Program in\na commercial product offering.  The obligations in this section do not apply\nto any claims or Losses relating to any actual or alleged intellectual\nproperty infringement. In order to qualify, an Indemnified Contributor must:\na) promptly notify the Commercial Contributor in writing of such claim, and\nb) allow the Commercial Contributor tocontrol, and cooperate with the\nCommercial Contributor in, the defense and any related settlement\nnegotiations. The Indemnified Contributor may participate in any such claim\nat its own expense.\n\nFor example, a Contributor might include the Program in a commercial product\noffering, Product X. That Contributor is then a Commercial Contributor. If\nthat Commercial Contributor then makes performance claims, or offers\nwarranties related to Product X, those performance claims and warranties are\nsuch Commercial Contributor's responsibility alone. Under this section, the\nCommercial Contributor would have to defend claims against the other\nContributors related to those performance claims and warranties, and if a\ncourt requires any other Contributor to pay any damages as a result, the\nCommercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON\nAN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER\nEXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR\nCONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A\nPARTICULAR PURPOSE. Each Recipient is solely responsible for determining the\nappropriateness of using and distributing the Program and assumes all risks\nassociated with its exercise of rights under this Agreement , including but\nnot limited to the risks and costs of program errors, compliance with\napplicable laws, damage to or loss of data, programs or equipment, and\nunavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY\nCONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION\nLOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE\nEXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under\napplicable law, it shall not affect the validity or enforceability of the\nremainder of the terms of this Agreement, and without further action by the\nparties hereto, such provision shall be reformed to the minimum extent\nnecessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Program itself\n(excluding combinations of the Program with other software or hardware)\ninfringes such Recipient's patent(s), then such Recipient's rights granted\nunder Section 2(b) shall terminate as of the date such litigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to\ncomply with any of the material terms or conditions of this Agreement and\ndoes not cure such failure in a reasonable period of time after becoming\naware of such noncompliance. If all Recipient's rights under this Agreement\nterminate, Recipient agrees to cease use and distribution of the Program as\nsoon as reasonably practicable. However, Recipient's obligations under this\nAgreement and any licenses granted by Recipient relating to the Program shall\ncontinue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but in\norder to avoid inconsistency the Agreement is copyrighted and may only be\nmodified in the following manner. The Agreement Steward reserves the right to\npublish new versions (including revisions) of this Agreement from time to\ntime. No one other than the Agreement Steward has the right to modify this\nAgreement. The Eclipse Foundation is the initial Agreement Steward. The\nEclipse Foundation may assign the responsibility to serve as the Agreement\nSteward to a suitable separate entity. Each new version of the Agreement will\nbe given a distinguishing version number. The Program (including\nContributions) may always be distributed subject to the version of the\nAgreement under which it was received. In addition, after a new version of\nthe Agreement is published, Contributor may elect to distribute the Program\n(including its Contributions) under the new version. Except as expressly\nstated in Sections 2(a) and 2(b) above, Recipient receives no rights or\nlicenses to the intellectual property of any Contributor under this\nAgreement, whether expressly, by implication, estoppel or otherwise. All\nrights in the Program not expressly granted under this Agreement are\nreserved.\n\nThis Agreement is governed by the laws of the State of Washington and the\nintellectual property laws of the United States of America. No party to this\nAgreement will bring a legal action under this Agreement more than one year\nafter the cause of action arose. Each party waives its rights to a jury trial\nin any resulting litigation.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 1.732421875,
          "content": "prefix=~/bin\njava_src=$(wildcard src/org/flatland/drip/*.java)\nc_src=$(wildcard src/*.c)\nclasses=$(subst src,classes,$(java_src:.java=.class))\nbinaries=$(subst src,bin,$(c_src:.c=))\njar=drip.jar\njavac=javac -source 1.5 -target 1.5\n\nall: compile jar\n\nclasses/%.class: src/%.java\n\tmkdir -p classes/\n\t${javac} ${java_src} -d classes/\n\nbin/%: src/%.c\n\tgcc $< -o $@\n\n${jar}: ${classes}\n\tjar cf ${jar} -C src/ org\n\tjar uf ${jar} -C classes/ org\n\njar: ${jar}\n\ncompile: ${binaries} ${classes}\n\nclean:\n\trm -rf classes\n\trm -f ${binaries}\n\trm -f ${jar}\n\ninstall: jar compile\n\tmkdir -p ${prefix}\n\tln -sf $$PWD/bin/drip ${prefix}/drip\n\ntag:\n\t@[ -n \"${version}\" ] ||\\\n          (echo \"Version variable required.\" && exit 1)\n\t@(git diff-files --quiet && git diff-index --cached --quiet HEAD) ||\\\n          (echo \"Working directory must be clean.\" && exit 1)\n\tsed -i~ 's/<version>.*<\\/version>/<version>${version}<\\/version>/' pom.xml\n\tsed -i~ 's/DRIP_VERSION=.*/DRIP_VERSION=${version}/' bin/drip\n\tgit commit -am \"${version}\"\n\tgit push origin\n\tgit tag ${version}\n\tgit push origin ${version}\n\nrelease: jar\n\tscp ${jar} pom.xml clojars@clojars.org:\n\ntest: jar test/clojure.jar test/jruby.jar test/scala test/test/Main.class\n\ttest/run\n\ntest/test/Main.class: test/test/Main.java\n\t${javac} $<\n\nclojure_url=http://repo1.maven.org/maven2/org/clojure/clojure/1.4.0/clojure-1.4.0.jar\njruby_url=http://jruby.org.s3.amazonaws.com/downloads/1.7.0/jruby-complete-1.7.0.jar\nscala_url=http://www.scala-lang.org/downloads/distrib/files/scala-2.9.2.tgz\n\ntest/clojure.jar:\n\tcurl -# ${clojure_url} > $@\n\ntest/jruby.jar:\n\tcurl -# ${jruby_url} > $@\n\ntest/scala.tgz:\n\tcurl -# ${scala_url} > $@\n\ntest/scala: test/scala.tgz\n\ttar xzf $< -m -C test\n\tmv test/scala-* $@\n\n.PHONY: all jar compile clean install release\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.4384765625,
          "content": "Drip is a launcher for the Java Virtual Machine that provides much faster\nstartup times than the `java` command. The `drip` script is intended to be a\ndrop-in replacement for the `java` command, only faster.\n\nDrip is a single bash script and a little bit of C and Java code. It is intended\nto work with any JVM-based language and anywhere bash is available.\n\n# How does it work?\n\nUnlike other tools intended to solve the JVM startup problem (e.g. Nailgun,\nCake), Drip does not use a persistent JVM. There are many pitfalls to using a\npersistent JVM, which we discovered while working on the Cake build tool for\nClojure. The main problem is that the state of the persistent JVM gets dirty\nover time, producing strange errors and requiring liberal use of `cake kill`\nwhenever any error is encountered, *just in case* dirty state is the cause.\n\nInstead of going down this road, Drip uses a different strategy. It keeps a\nfresh JVM spun up in reserve with the correct classpath and other JVM options\nso you can quickly connect and use it when needed, then throw it away. Drip\nhashes the JVM options and stores information about how to connect to the JVM\nin a directory with the hash value as its name.\n\n# Installation\n\nThe following instructions assume that `~/bin` is on your `$PATH`. If that is\nnot the case, you can substitute your favorite location.\n\n**Standalone** &mdash; *We recommend this to get started quickly.*\n\n    curl -L https://raw.githubusercontent.com/ninjudd/drip/master/bin/drip > ~/bin/drip\n    chmod 755 ~/bin/drip\n\n**Checkout** &mdash; *If you want to hack on Drip or follow the latest\ndevelopment, this is the way to go.*\n\n    git clone https://github.com/ninjudd/drip.git\n    cd drip && make prefix=~/bin install\n\n**Homebrew** &mdash; *This is a convenient way to brew drip on OS X.*\n\n    brew install drip\n\nNote: Installing brew requires `gcc`. Here are [instructions](http://stackoverflow.com/questions/9353444)\nfor how to install it on OS X Mountain Lion.\n\n# Usage\n\nYou can call `drip` with the same arguments as `java`. Try it. The first time\nyou execute `drip` with new arguments, it will take as long as a plain `java`\ncommand, because it has to spin up a JVM from scratch, but after that it will be\nfast.\n\nFor example, to start a Clojure repl with drip:\n\n    drip -cp clojure.jar clojure.main\n\nThe Drip JVM will eventually shut itself down if you never connect to it. The\ntime limit defaults to four hours, but you can change this by setting the\n`DRIP_SHUTDOWN` environment variable before calling `drip` to set a timeout, in\nminutes:\n\n    DRIP_SHUTDOWN=30 drip -cp clojure.jar clojure.main\n\nThis creates a Clojure repl as usual, either by starting up a new one or\nconnecting to a waiting JVM. But the JVM that is spun up to serve future\nrequests with the same classpath will have a 30-minute timeout to deactivation.\n\n### JVM Language Integration\n\nFor more information about how to integrate Drip with your favorite JVM\nlanguage, check out the [wiki](https://github.com/ninjudd/drip/wiki).\n\n# Advanced settings\n\nDrip supports the following advanced settings.\n\n## Pre-Initialization\n\nBy default, Drip only loads your main class at startup, but you can tell Drip to\nrun additional code at startup. This can be used to load classes or execute any\ninitialization code you like. For a language like Clojure, which compiles code\non-the-fly, this can be used to precompile commonly used code by requiring it.\n\nTo tell Drip how to initialize a new JVM, use the `DRIP_INIT` and\n`DRIP_INIT_CLASS` environment variables. `DRIP_INIT` should be a\nnewline-separated list of args to be passed to the `main()` function of\n`DRIP_INIT_CLASS`. `DRIP_INIT_CLASS` defaults to the main class the JVM was\nstarted with.\n\n## System Properties\n\nSometimes, you need to set Java system properties, but you don't want them to be\nincluded in the JVM options used for hashing. In this case, use two dashes\ninstead of one, and the options won't be passed to the JVM at startup, instead\nthey will be passed at runtime. Keep in mind that any system properties passed\nthis way will not be set during initialization.\n\n## Environment Variables\n\nDrip passes all environment variables exported at runtime to the JVM and merges\nthem into the map returned by `System.getenv`. Keep in mind that the environment\nisn't modified until we connect to the JVM; during initialization, the\nenvironment will be derived from the previous process that launched the spare\nJVM. \n\n# License\n\nDrip is licensed under the EPL Eclipse Public License. See LICENSE for\ndetails.\n"
        },
        {
          "name": "bin",
          "type": "tree",
          "content": null
        },
        {
          "name": "pom.xml",
          "type": "blob",
          "size": 0.9404296875,
          "content": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<project xmlns=\"http://maven.apache.org/POM/4.0.0\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xsi:schemaLocation=\"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd\">\n  <modelVersion>4.0.0</modelVersion>\n  <groupId>org.flatland</groupId>\n  <artifactId>drip</artifactId>\n  <packaging>jar</packaging>\n  <version>0.2.5</version>\n  <name>drip</name>\n  <description>Fast JVM launching without the hassle of persistent JVMs.</description>\n  <url>https://github.com/flatland/drip</url>\n  <licenses>\n    <license>\n      <name>Eclipse Public License - v 1.0</name>\n      <url>http://www.eclipse.org/legal/epl-v10.html</url>\n    </license>\n  </licenses>\n  <scm>\n    <connection>scm:git:git://github.com/flatland/drip.git</connection>\n    <developerConnection>scm:git:ssh://git@github.com/flatland/drip.git</developerConnection>\n    <url>https://github.com/flatland/drip</url>\n  </scm>\n</project>\n"
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}