{
  "metadata": {
    "timestamp": 1736568298481,
    "page": 198,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "aws-samples/aws-workshop-for-kubernetes",
      "stars": 2665,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.25,
          "content": ".DS_STORE\n**/*.iml\n**/target\n**/.idea\n**/dependency-reduced-pom.xml\n**/journal.json\n**/chaostoolkit.log\n03-path-application-development/306-app-management-with-helm/sample/*.tgz\n03-path-application-development/309-deploying-a-chart-repository/sample/*.tgz\n"
        },
        {
          "name": "01-path-basics",
          "type": "tree",
          "content": null
        },
        {
          "name": "02-path-working-with-clusters",
          "type": "tree",
          "content": null
        },
        {
          "name": "03-path-application-development",
          "type": "tree",
          "content": null
        },
        {
          "name": "04-path-security-and-networking",
          "type": "tree",
          "content": null
        },
        {
          "name": "05-path-next-steps",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.adoc",
          "type": "blob",
          "size": 0.3076171875,
          "content": "== Code of Conduct\nThis project has adopted the link:https://aws.github.io/code-of-conduct[Amazon Open Source Code of Conduct].\nFor more information see the link:https://aws.github.io/code-of-conduct-faq[Code of Conduct FAQ] or contact\nopensource-codeofconduct@amazon.com with any additional questions or comments.\n"
        },
        {
          "name": "CONTRIBUTING.adoc",
          "type": "blob",
          "size": 7.822265625,
          "content": "= Contributing to Kubernetes the AWSome Way\nThank you for your interest in contributing to Kubernetes the AWSome Way! We work hard to provide a high quality and useful workshop for our customers, and we appreciate your interest in helping us and the rest of our community of users. We welcome bug reports, enhancements, and contributions.\n\n__Jump To:__\n\n* link:#bug-reports[Bug Reports]\n* link:#enhancements[Enhancements]\n* link:#contributions[Contributions]\n* link:#getting-in-contact[Getting in Contact]\n\n== Bug Reports\nBug reports are accepted through the link:https://github.com/aws-samples/aws-workshop-for-kubernetes/issues[Issues] page.\n\nThe following labels are used to track bug related issues: link:https://github.com/aws-samples/aws-workshop-for-kubernetes/labels/Bug[Bug].\n\n=== Before Submitting a Bug Report\nBefore submitting a bug report, please do the following:\n\n1. Do a search through the existing issues to make sure it has not already been reported. If there's an existing one, be sure to give a +1 reaction which will help us prioritize which issues to address first.\n\n2. Provide as much information about your environment, software version, and relevant dependencies as possible. For example, let us know what version of kubernetes you are using, which launch type for the kubernetes cluster (e.g. EKS or kops), and the environment your code is running in. (e.g Cloud9).\n\nIf, after doing the above steps, you determine that you need to submit a bug report, refer to the next section.\n\n=== Submitting a Bug Report\nSo that we are able to assist you as effectively as possible with the issue, please ensure that your bug report has the following:\n\n* A short, descriptive title. Ideally, other community members should be able to get a good idea of the issue just from reading the title.\n* A detailed description of the problem you're experiencing. This should include:\n  * Expected behavior of the workshop and the actual behavior exhibited.\n  * Any details of your application environment that may be relevant.\n  * Commands and output used to reproduce the issue.\n* link:https://guides.github.com/features/mastering-markdown/[Markdown] formatting as appropriate to make the report easier to read; for example use code blocks when pasting a code snippet and exception stacktraces.\n\n=== Tracking your Bug Report\nYou will automatically be notified of any changes to a bug report. Either a maintainer or a community member may comment on the bug report requiring further input. We encourage all contributors to stay active on their bug reports reports. This helps the community to focus on issues with more influence and activity.\n\nAny input to the workshop is always appreciated. Our maintainers cannot devote 100% of their time to this project, but will try to respond in a timely manner. We want to squash bugs as often as we can, but sometimes require comments from the submitter or community in order to proceed.\n\nIf a bug report has been inactive (waiting on comment from submitter or community) for 14 days, a maintainer may label the issue as stale.  Once a bug report has been inactive for more than 28 days, the issue will be administratively closed. Issues can be re-opened after being administratively closed by commenting on the issue requesting to re-open and providing the necessary comment.\n\n== Enhancements\nLike bug reports, enhancements are submitted through the link:https://github.com/aws-samples/aws-workshop-for-kubernetes/issues[Issues] page.\n\nAs with Bug Reports, please do a search of the open requests first before submitting a new one to avoid duplicates. If you find an existing one, give it a +1.\n\n[NOTE]\nIf this is an enhancement you intend to implement, please be sure to submit the enhancement *before* working on any code changes. This will allow members on the workshop team to have a discussion with you to ensure that it's the right design and that it makes sense to include in the workshop.\n\nEnhancements are labeled with link:https://github.com/aws-samples/aws-workshop-for-kubernetes/labels/Enhancement[Enhancement].\n\n=== Submitting an Enhancement\nOpen an link:https://github.com/aws-samples/aws-workshop-for-kubernetes/issues[issue] with the following:\n\n* A short, descriptive title. Ideally, other community members should be able to get a good idea of the enhancement just from reading the title.\n* A detailed description of the the proposed enhancement. Include justification for why it should be added to the workshop, and possibly example code to illustrate how it should work.\n* link:https://guides.github.com/features/mastering-markdown/[Markdown] formatting as appropriate to make the request easier to read.\n* If you intend to implement this enhancement, indicate that you'd like to the issue to be assigned to you.\n\n== Contributions\nContributions to the workshop are done through link:https://github.com/aws-samples/aws-workshop-for-kubernetes/pulls[Pull Requests]. Please keep the following in mind when considering a contribution:\n\n* The workshop is released under the link:https://github.com/aws-samples/aws-workshop-for-kubernetes/blob/master/LICENSE[Apache 2.0 License]. Any code you submit will be released under this license. If you are contributing a large/substantial enhancement, you may be asked to sign a link:https://github.com/aws/aws-cla[Contributor License Agreement (CLA)].\n\n* You should always start by checking the link:https://github.com/aws-samples/aws-workshop-for-kubernetes/issues[Issues] page to see if the work is already being done by another person. We require that pull requests reference an issue.\n\n[NOTE]\nIf you're working on a bug fix, check to see if the bug has already been reported. If it has but no one is assigned to it, comment that you are assigning it to yourself before beginning work.  If you're confident the bug hasn't been reported yet, create a new link:#bug-reports[Bug Report] then comment that you are assigning it to yourself.\n\n[NOTE]\nIf you are thinking about adding entirely new functionality, open an link:#enhancements[Enhancements] or link:https://gitter.im/aws-samples/aws-workshop-for-kubernetes[ping] the maintainers to ask for feedback first before beginning work; again this is to make sure that no one else is already working on it, and also that it makes sense to be included in the workshop.\n\n=== Pull Request Readiness\nBefore submitting your pull request, refer to the pull request readiness checklist below:\n\n* [ ] Includes tests to exercise the new behavior\n* [ ] Code is documented, especially public and user-facing constructs\n* [ ] Git commit message is detailed and includes context behind the change\n* [ ] The issue number for the bug report or enhancement is referenced\n\n[NOTE]\nSome changes have additional requirements. Refer to the section below to see if your change will require additional work to be accepted.\n\n=== Getting Your Pull Request Merged\nAll Pull Requests must be reviewed and approved by at least two other contributors or one maintainer before it can be merged in. Additionally, maintainers will strive to not merge their own pull requests unless 72 hours has passed, though extenuating circumstances may apply. The members only have limited bandwidth to review Pull Requests so it's not unusual for a Pull Request to go unreviewed for a few days, especially if it's a large or complex one. If, after a week, your Pull Request has not had any engagement from the workshop team, feel free to link:https://gitter.im/aws-samples/aws-workshop-for-kubernetes[ping] a member to ask for a review.\n\nIf your branch has more than one commit when it's approved, you may also be asked to link:https://git-scm.com/book/en/v2/Git-Tools-Rewriting-History[squash] them into a single commit before it is merged in.\n\n== Getting in Contact\nCome chat with us on:\n* link:https://gitter.im/aws-samples/aws-workshop-for-kubernetes[Gitter]!\n* **#eks** channel in **Kubernetes** Slack workspace\n* **#containers** and **#kubernetes** channels in **aws-developers** Slack workspace\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "NOTICE",
          "type": "blob",
          "size": 0.0986328125,
          "content": "AWS Workshop for Kubernetes\nCopyright 2018 Amazon.com, Inc. or its affiliates. All Rights Reserved. \n"
        },
        {
          "name": "developer-path.adoc",
          "type": "blob",
          "size": 3.2392578125,
          "content": "= Kubernetes the AWSome Way!\n:icons:\n:linkattrs:\n:imagesdir: resources/images\n\nimage:kubernetes-aws-smile.png[alt=\"kubernetes and aws logos\", align=\"left\",width=420]\n\n== Developer Path Index\n\nThis path is suitable for individual developers or development teams interested in deploying, managing, and scaling cloud-native applications on Kubernetes.\n\n:frame: none\n:grid: none\n:valign: top\n:halign: center\n\n[cols=\"1*^\",grid=\"cols\",options=\"header\"]\n|=====\n|anchor:dev[Developer Path]Developer Path\n|link:01-path-basics/101-start-here[101: Start Here]\n|link:01-path-basics/102-your-first-cluster[102: Create a Kubernetes cluster using kops]\n|link:01-path-basics/103-kubernetes-concepts[103: Introduction to the Kubernetes CLI]\n|link:03-path-application-development/301-local-development[301: Setting up a Local Development Environment]\n|link:03-path-application-development/302-app-discovery[302: Service Discovery for Microservices]\n|link:03-path-application-development/303-app-update[303: Updating Applications on Kubernetes]\n|link:03-path-application-development/304-app-scaling[304: Scaling Applications on Kubernetes]\n|link:03-path-application-development/305-app-tracing-with-jaeger-and-x-ray[305: Tracing Applications with Jaeger and X-Ray]\n|link:03-path-application-development/306-app-management-with-helm[306: Manage Applications with Helm]\n|link:03-path-application-development/307-statefulsets-and-pvs[307: Store Persistent Data with StatefulSets and PVs]\n|link:03-path-application-development/310-chaos-engineering[310: Applying Chaos Engineering]\n|link:04-path-security-and-networking/401-configmaps-and-secrets[401: ConfigMaps and Secrets]\n|link:04-path-security-and-networking/402-authentication-and-authorization[402: Authentication, Authorization, and Access]\n|link:04-path-security-and-networking/403-admission-policy[403: Admission Control for Kubernetes on AWS]\n|link:04-path-security-and-networking/404-network-policies[404: Network Policies]\n|link:04-path-security-and-networking/405-ingress-controllers[405: Ingress Controllers]\n|link:04-path-security-and-networking/406-coredns[406: CoreDNS]\n|link:05-path-next-steps/501-k8s-best-practices[501: Best Practices]\n|link:05-path-next-steps/502-for-further-reading[502: For Further Reading]\n|=====\n\n== Workshop Cleanup\n\nOnce you have finished with the workshop, please don't forget to spin down your cluster or you will incur additional charges.\n(We will also remind you at the end!)\n\n==== Delete Kubernetes cluster resources\n\nIn your Cloud9 IDE, check if there are any running kubernetes cluster\n\n   $ kops get cluster\n\nDelete kubernetes cluster\n\n   $ kops delete cluster example.cluster.k8s.local --yes\n\nWait until all resources are deleted by kops\n\n==== Delete Cloud9 Envionment\n\nGo to CloudFormation console, right click template with name 'k8s-workshop' and select 'Delete Stack'\n\nThis should delete all the resources associated with this workshop\n\nNOTE: You will incur charges as you go through these workshop guides as it will exceed the link:http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/free-tier-limits.html[limits of AWS free tier]. An estimate of charges (<$20/day) can be seen at this link:https://calculator.s3.amazonaws.com/index.html#r=FRA&s=EC2&key=calc-E6DBD6F1-C45D-4827-93F8-D9B18C5994B0[simple monthly calculator]\n"
        },
        {
          "name": "operations-path.adoc",
          "type": "blob",
          "size": 2.9716796875,
          "content": "= Kubernetes the AWSome Way!\n:icons:\n:linkattrs:\n:imagesdir: resources/images\n\nimage:kubernetes-aws-smile.png[alt=\"kubernetes and aws logos\", align=\"left\",width=420]\n\n== Operations Path Index\n\nThis path is suitable for operations teams interested in deploying, managing, and scaling clusters with Kubernetes.\n\n:frame: none\n:grid: none\n:valign: top\n:halign: center\n\n[cols=\"1*^\",grid=\"cols\",options=\"header\"]\n|=====\n|anchor:ops[Operations Path]Operations Path\n|link:01-path-basics/101-start-here[101: Start Here]\n|link:01-path-basics/102-your-first-cluster[102: Create a Kubernetes cluster using kops]\n|link:01-path-basics/103-kubernetes-concepts[103: Introduction to the Kubernetes CLI]\n|link:02-path-working-with-clusters/201-cluster-monitoring[201: Monitoring a Kubernetes Cluster]\n|link:02-path-working-with-clusters/202-service-mesh[202: Leveraging a Service Mesh]\n|link:02-path-working-with-clusters/203-cluster-upgrades[203: Upgrading a Kubernetes Cluster]\n|link:02-path-working-with-clusters/204-cluster-logging-with-EFK[204: Logging with an EFK Stack]\n|link:02-path-working-with-clusters/205-cluster-autoscaling[205: Autoscaling a Kubernetes Cluster]\n|link:02-path-working-with-clusters/206-cloudformation-and-terraform[206: Deploy Kubernetes with Terraform and CloudFormation]\n|link:04-path-security-and-networking/401-configmaps-and-secrets[401: ConfigMaps and Secrets]\n|link:04-path-security-and-networking/402-authentication-and-authorization[402: Authentication, Authorization, and Access]\n|link:04-path-security-and-networking/403-admission-policy[403: Admission Control for Kubernetes on AWS]\n|link:04-path-security-and-networking/404-network-policies[404: Network Policies]\n|link:04-path-security-and-networking/405-ingress-controllers[405: Ingress Controllers]\n|link:04-path-security-and-networking/406-coredns[406: CoreDNS]\n|link:05-path-next-steps/501-k8s-best-practices[501: Best Practices]\n|link:05-path-next-steps/502-for-further-reading[502: For Further Reading]\n|=====\n\n== Workshop Cleanup\n\nOnce you have finished with the workshop, please don't forget to spin down your cluster or you will incur additional charges.\n(We will also remind you at the end!)\n\n==== Delete Kubernetes cluster resources\n\nIn your Cloud9 IDE, check if there are any running kubernetes cluster\n\n   $ kops get cluster\n\nDelete kubernetes cluster\n\n   $ kops delete cluster example.cluster.k8s.local --yes\n\nWait until all resources are deleted by kops\n\n==== Delete Cloud9 Envionment\n\nGo to CloudFormation console, right click template with name 'k8s-workshop' and select 'Delete Stack'\n\nThis should delete all the resources associated with this workshop\n\nNOTE: You will incur charges as you go through these workshop guides as it will exceed the link:http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/free-tier-limits.html[limits of AWS free tier]. An estimate of charges (<$20/day) can be seen at this link:https://calculator.s3.amazonaws.com/index.html#r=FRA&s=EC2&key=calc-E6DBD6F1-C45D-4827-93F8-D9B18C5994B0[simple monthly calculator]\n"
        },
        {
          "name": "readme.adoc",
          "type": "blob",
          "size": 2.1328125,
          "content": "= Kubernetes the AWSome Way!\n:icons:\n:linkattrs:\n:imagesdir: resources/images\n\nimage:stop_sign01.png[align=\"left\",width=120]\n\n**This content is outdated and is no longer maintained. Please go to https://www.eksworkshop.com/ for newest EKS tutorials!**\n\nimage:kubernetes-aws-smile.png[alt=\"kubernetes and aws logos\", align=\"left\",width=420]\n\nThis is a self-paced workshop designed for Development and Operations teams who would like to leverage Kubernetes on Amazon Web Services (AWS).\n\nThis workshop provides instructions to create, manage, and scale a Kubernetes cluster on AWS, as well as how to deploy applications, scale them, run stateless and stateful containers, perform service discovery between different microservices, and other similar concepts.\n\nIt also shows deep integration with several AWS technologies.\n\nWe recommend at least 2 hours to complete the workshop.\n\nClick the button below to start!\n\nimage::button-start-standard.png[link=01-path-basics/101-start-here/]\n\n== Extended Paths\n\nThe workshop also contains extended paths for Developers or Operations Engineers.\nThe extended paths go into much greater detail regarding features and capabilities of Kubernetes specifically for those Teams.\nWe recommend at least 4 hours for each of the extended paths.\n\nClick on one of the two buttons below to start!\n\n:frame: none\n:grid: none\n:valign: top\n\n[align=\"center\", cols=\"2*\", grid=\"none\", frame=\"none\"]\n|=====\n|image:button-start-developer.png[link=01-path-basics/101-start-here]\n|image:button-start-operations.png[link=01-path-basics/101-start-here]\n|=====\n\n\nNOTE: You will incur charges as you go through these workshop guides as it will exceed the link:http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/free-tier-limits.html[limits of AWS free tier]. An estimate of charges (<$20/day) can be seen at this link:https://calculator.s3.amazonaws.com/index.html#r=FRA&s=EC2&key=calc-E6DBD6F1-C45D-4827-93F8-D9B18C5994B0[simple monthly calculator]\n\n=== Participation\n\nYou can share this workshop via https://amzn.to/k8s-on-aws. We encourage participation; if you find anything, please submit an issue. However, if you want to help raise the bar, **submit a PR**!\n"
        },
        {
          "name": "resources",
          "type": "tree",
          "content": null
        },
        {
          "name": "standard-path.adoc",
          "type": "blob",
          "size": 2.212890625,
          "content": "= Kubernetes the AWSome Way!\n:icons:\n:linkattrs:\n:imagesdir: resources/images\n\nimage:kubernetes-aws-smile.png[alt=\"kubernetes and aws logos\", align=\"left\",width=420]\n\n== Standard Path Index\n\n:frame: none\n:grid: none\n:valign: top\n:halign: center\n\n[cols=\"1*^\",grid=\"cols\",options=\"header\"]\n|=====\n|anchor:standard[Standard Path]Standard Path\n|link:01-path-basics/101-start-here[101: Start Here]\n|link:01-path-basics/102-your-first-cluster[102: Create a Kubernetes cluster using kops]\n|link:01-path-basics/103-kubernetes-concepts[103: Introduction to the Kubernetes CLI]\n|link:02-path-working-with-clusters/201-cluster-monitoring[201: Monitoring a Kubernetes Cluster]\n|link:02-path-working-with-clusters/202-service-mesh[202: Leveraging a Service Mesh]\n|link:02-path-working-with-clusters/203-cluster-upgrades[203: Upgrading a Kubernetes Cluster]\n|link:03-path-application-development/302-app-discovery[302: Service Discovery for Microservices]\n|link:03-path-application-development/303-app-update[303: Updating Applications on Kubernetes]\n|link:03-path-application-development/304-app-scaling[304: Scaling Applications on Kubernetes]\n|link:05-path-next-steps/502-for-further-reading[502: For Further Reading]\n|=====\n\n\n== Workshop Cleanup\n\nOnce you have finished with the workshop, please don't forget to spin down your cluster or you will incur additional charges.\n(We will also remind you at the end!)\n\n==== Delete Kubernetes cluster resources\n\nIn your Cloud9 IDE, check if there are any running kubernetes cluster\n\n   $ kops get cluster\n\nDelete kubernetes cluster\n\n   $ kops delete cluster example.cluster.k8s.local --yes\n\nWait until all resources are deleted by kops\n\n==== Delete Cloud9 Envionment\n\nGo to CloudFormation console, right click template with name 'k8s-workshop' and select 'Delete Stack'\n\nThis should delete all the resources associated with this workshop\n\nNOTE: You will incur charges as you go through these workshop guides as it will exceed the link:http://docs.aws.amazon.com/awsaccountbilling/latest/aboutv2/free-tier-limits.html[limits of AWS free tier]. An estimate of charges (<$20/day) can be seen at this link:https://calculator.s3.amazonaws.com/index.html#r=FRA&s=EC2&key=calc-E6DBD6F1-C45D-4827-93F8-D9B18C5994B0[simple monthly calculator]\n"
        },
        {
          "name": "wip-modules",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}