{
  "metadata": {
    "timestamp": 1736568261956,
    "page": 144,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE1MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "hoverbike1/TOTK-Mods-collection",
      "stars": 3051,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 13.3056640625,
          "content": "# Changelog\n\nv4.69\n- TOTK Optimizer 2.1\n\nv4.20\n- TOTK Optimizer 2.0\n\nv3.1\n- Hotfix\n\nv3.0\n- New TOTK Optimizer & Ultracam by @MaxLastBreath\n- Updated cheats to 1.2.1\n- Updated Linux Pack Generator\n\nv2.6:\n- Updated most graphics mods to 1.2.1\n\nv2.5.3\n- Hotfix Aspect Ratio Mods (Thanks @Fruithapje21)\n\nv2.5.2\n- Updated Aspect Ratio Mods (Thanks @Fruithapje21)\n\nv2.5.1\n- Hotfix for Yuzu ML 1504 / EA 3770\n\nv2.5\n- Updated Lazy Pack Generator\nNew Design, fixed shadow resolutions, far more settings being adjusted automatically.\n- Updated Aspect Ratio mods (Thanks @Fruithapje21)\n- Fixed DynamicFPS Shadow settings (Fixes broken Gloom and game hangs at startup at certain resolutions)\n\nv2.4.1\n- Hotfix of Lazy Pack Generator (Webpage & 3xFHD was broken, and missing config.yaml files)\n- Linux version of Lazy Pack generator\n- Added DynamicFPS - v1.5.5 - 1280x720 resolution\n\nv2.4\n- Renamed Resolutions \"Chucks 1008p\" and \"Chucks 1080p\" to \"1008p - ExeFS\" and \"1080p - ExeFS\"\n- Added [ChucksFeedAndSeed](https://www.reddit.com/user/ChucksFeedAndSeed/)'s DynamicFPS v1.5.5 beta 3\n- **New Lazy Pack \"Generator\"!**\n- Added PixelKiri's (@alexkiri) Improved Sky Island Fix\n- Added [Father_Of_Egg](https://www.reddit.com/user/Father_Of_Egg/)'s \"Free Aubobuild Alternate\"\n- Deleted the old Free Aubobuild due the infinite loading bug.\n- Added [Father_Of_Egg](https://www.reddit.com/user/Father_Of_Egg/)'s ports for cheats Swim 3x, Swim 2x, Show Korok, and Infinite Rupee\n- General fixes on Cheats\n\nv2.3\n- Added [ChucksFeedAndSeed's](https://www.reddit.com/user/ChucksFeedAndSeed/) DynamicFPS 1.5.4 and its 20/30/45/60fps config companions.\n- \"Disable LOD Quality Reduction\" name changed to just \"Disable Quality Reduction\". It was also ported to TOTK 1.2.0 by @StevensND\n- Updated 56 cheats from @bad1dea's to TOTK 1.2.0\n- Added [igic's](https://gamebanana.com/members/2722002) Free Autobuild cheat\n- Updated @Fruithapje21 Aspect Ratios 16/10, 2/1, 18/9, 19,5/9, 20/9, 21/9, 21.5/9, 32/9, 48/9 and 256/135 to v2.1.1\n- Aspect Ratios 1/1 (VR), 3/2, 4/3 and 5/4 ported to TOTK 1.2.0 by @StevensND\n- 20/30/60fps Static ported to TOTK 1.2.0 by @StevensND\n- Disable Internal FSR downscaling ported to TOTK 1.2.0 by @StevensND\n- Disable Internal FXAA ExeFS ported to TOTK 1.2.0 by @StevensND\n- Disable Targeting DOF ported to TOTK 1.2.0 by @StevensND\n- Increased Camera Speed ported to TOTK 1.2.0 by @StevensND\n- Island Fix ported to TOTK 1.2.0 by @StevensND\n- LOD Improvement ported to TOTK 1.2.0 by @StevensND\n- Remove Len's Flare ported to TOTK 1.2.0 by @StevensND\n- Shadows 256/512/1024x ported to TOTK 1.2.0 by @StevensND\n- Chuck's 1080p ported to TOTK 1.2.0 by @StevensND\n- Chuck's 1008p ported to TOTK 1.2.0 by @StevensND\n- Anisotropic Filtering Fix ported to TOTK 1.2.0 by @StevensND\n- Sweetmini 1008p FXAA On/Off ported to TOTK 1.2.0\n- Sweetmini 1080p FXAA On/Off ported to TOTK 1.2.0\n- Lazy Packs updated to 1.2.0\n- Identified mods that are still working on TOTK 1.2.0\n- Removed outdated mods\n\nv2.2.1 - Hotfix\n- **Fixed several bugs that were breaking mod managers**\n- Fixed Shadow 1024x NSO Build ID for 1.0.0\n- Added narrow 70 fov version of max fpv mod\n- Updated UI mods\n\nv2.2\n- <b> Added @MaxLastBreath's brand new 'First Person +' First Person View mod!</b>\n- All new Aspect Ratios, now with built in HUD fixes, and Blackscreenfix! (Thanks @Fruithapje21)\n- Added DynamicFPS 1.5.3 (Thanks @chucksfeedandseed)\n- Added DynamicFPS 1.5.3 to Lazy Packs\n- Added new 'Increased Camera Speed' exefs patch, which doubles camera sensitivity. (Thanks @theboy181)\n- Added new 1.0.0 version of Blackscreen-fix\n- Fixed issues with 1.0.0 FSR and 1008p (Thanks @MaxLastBreath)\n- Fixed same issues in Lazy Packs \n- Lots of new cheats for 1.0.0, and a few for 1.1.0/1.1.1/1.1.2\n\nv2.1\n- <b>Lazy Packs now supports 1.0.0! Every game version is now supported by Lazy Packs! And not just with some crappy, lacklustre pack either, all of them feature all of the same patches, and gives the same lovely picture - game updates only dictate the performance now. </b>\n- Included Disable Internal FXAA ExeFS.\n- Fixed bugs with mod managers.\n- 1.1.0 ports by @StevensND of Island Fix, Remove Lens Flare and LOD Improvements patches.\n- 1.0.0 ports by @MaxLastBreath of Island Fix, Remove Lens Flare and 1080p & 1008p Resolution patches.\n- Fixed issue with FXAA in 1.1.0 Lazy Packs.\n- Added new Remove Lens Flare, LOD Improvements and Island Fix to appropriate 1.1.0 Lazy Packs.\n- Added 1.0.0 versions of 512/256 Shadow Patches.\n- Updated the PDF guide accordingly.\n\nv2.0\n- <b> Mod Managers released by both 89Pleasure and Vasilvestre! Check them out above!</b>\n- <b>Lazy packs now support game version 1.1.2!</b>\n<details>\n<summary> Click to view lazy pack changes</summary>\n\n  - Now compatible with game version 1.1.2! All of the best patches, combined <b>correctly</b> into a single patch solution.\n  - Scaling specific versions. Some patches used when scaling above 1X, are not desirable <b>at 1X.</b>\n  - Updated a number of patches, such as dynamicFPS.\n  - Generally cleaned everything up, made it real nice, mostly for my own sanity moving forward, as these patches update.\n\n</details>\n\n- Included ChucksFeedAndSeed's \"Camera JPEG Quality Increase\" mod.\n- Major additions to cheats! Over 50 new cheats for 1.1.1!\n- Fixed missing/bugged mods.\n- Deleted \"Disable Dynamic Resolution\" Mod. When Low FPS it was causing crashes and Disable LOD Quality Reduction have similar effects.\n- Renamed some mods and edited guide/recommendations with latest EA update in mind.\n- **We are moving to weekly releases to improve stability.**\n\nv1.9.2.3 :\n- Fixed files for mods managers.\n\nv1.9.2.2 :\n- Graphics, Aspect Ratio, FPS and Resolution rebuilt with the same strategy as Cheats.\n\nv1.9.2.1 :\n - Cheats folder structure rebuilt for better reading legibility.\n\nv1.9.2 : \n- Over 50 new cheats, for version 1.1.2 only.\n- Updated Readme and Guide with new recommendations.\n\nv1.9.1 : \n- Updated ChucksFeedAndSeed's DynamicFPS to 1.5.2.\nChangelog of the mod : \n  -  added hitch detection similar to FPS++ (thanks to SomeRandomPeople)\n  -  added game-speed smoothing, helps with jittery gliding animations, likely other animations too\n  -  added sensitivity fixes when in conversations, sensitivity should now remain the same as 30FPS across all framerates\n  -  extended conversation fix to innkeeper conversations too (likely other kinds still need sensitivity fixes too, let me know if you find any)\n  -  changed max framerate limit from 288FPS to 145FPS, appears to help with shrine out-of-bounds glitches when using limiter disabled\n  -  minor fix to framelimiter code, might help make 30FPS video playback smoother\n  -  code reorganization, very minor tweaks (will try and setup a repo for it soon)\n\nv1.9 :\n- Now you can get mods specifically for your game version!\n- Added @Socats s Install Guide PDF and @SpockBauru Recommended Settings page.\n- Added Alerion's Xbox, Playstation & Steam Deck 'Controller UI Mods' - \"Normal, white\" versions.\n- Added Sweetmini's 10**80**p FXAA On/Off, with FSR Disabler and DynRes Disabler (breaks AO with resolution scale above 1x on Yuzu).\n- Updated Sweetmini's Improved LOD to v2.0 (improved performance compared to v1.0).\n- Renamed MarethyuX's \"Over 30fps Blackscreen Fix\" to \"UI Blackscreen Fix\" since is needed even for 30fps if you use DynamicFPS mods.\n- Cleaned outdated/broken mods.\n\nv1.8.5 :\n- Updated DynamicFPS++ (old FPS++) to version 0.5\n\nv1.8.4 :\n- Upgraded FPS++ to the new DynamicFPS++\n\nv1.8.3 :\n- Added 1.1.2 versions of SweetMini 1008p mod and Standalone FXAA. Please update if you were using the older version on 1.1.2.\n- Updated folder structure, and removed old patches\n- Updated Lazy Packs with most recent version of FPS++ and removed redundant patches.\n\nv1.8.2 :\n- Updated FPS++ to latest version, which adds Ultrahand Y axis fix and works on 1.1.2\n\nv1.8.1 :\n- Added 1.1.2 support for Time of Day cheat mods.  \n\nv1.8 :\n- Added a file in every mod folders called \"Compatible versions.txt\" and removed the versions in the mods name prefix.  \n- Renamed two mods.  \n- Added Ratio mods 1.1.2 support.  \n- Added missing Ratio mods.\n\nv1.7.5 :\n- Updated remaining mods to 1.1.2 and 1.0.0, at this point pretty much everything important is covered.  \n\nv1.7.4 : \n- Added Remove Lens Flare 1.1.1 and 1.1.2 - Credit: SweetMini.  \n\nv1.7.3 : \n- Updated 1.1.2 static 30 fps and 20 fps.  \n- Added Sky Island Fix for 1.1.1 and 1.1.2 - Credit: SweetMini.  \n- Added LOD Improvement for 1.1.1 and 1.1.2 - Credit: SweetMini.  \n- Updated Lazy Packs.  \n\nv1.7.2 : \n- Added 1.1.2 support for OldManKain's 1080p and Disable Targeting DOF mods.  \n\nv1.7.1 : \n- Added some Time of day cheats for 1.1.0.  \n\nv1.7 : \n- Added 1.1.2 support for some mods. \n\nv1.6.6 : \n- Add 1.1.1 support for 1080p.  \n- Added @OldManKain 1080p + Disable FXAA & FSR scaler patch (Still bugged AO for Yuzu above 1x scaling).  \n- Updated 1.1.1 Lazy Packs.  \n\nv1.6.5 : \n- Fixed 60fps static again\n\nv1.6.4 : \n- Fixed 60fps static mod being duplicated from 20fps static mod.\n\nv1.6.3 : \n- Updated Lazy packs to be compatible with update 1.1.1.\n      Notes: still subject to change. Please reach out to @hoverbike1 (discord: hoverbike#8377) with feedback or issues.\n- Static FPS mods updated to their latest versions.\n- Renamed 1008P and 1026p mods to be less confusing hopefully.\n \nv1.6.2 : \nfps++ Updated\n- Number of frames used for averaging correlates to target framerate now (should make FPS++30 feel consistent with FPS++60)\n- Some logic slightly simplified\n- Avoid a potential divide by zero error (due to entropy)\n- Add an extra safety check, where the dynamic timestep will be skipped if you hitch for an unusually long period of time\n- Improve unlocked fps behavior\n- Behavior while performance is improving is potentially smoother. Tell me how this feels!\n\nv1.6.1 : \n- Replaced the 1008p FXAA on/off mods with FSR and DynRes disabled for a new method that should be safer and less stressful on the GPU.\n- Deleted some more outdated/useless mods.\n- Changed some file names to be clearer.\n\nv1.6 : \n- Changed Mods organisation to be more streamlined\n- Deleted some outdated/useless mods\n- Changed the name formatting so mods are displayed by version correctly when opening the files.\n\nv1.5.7 : \n- Replaced buggy FXAA disable mod with new version. Make sure to download the specific one for your game version.\n\nv1.5.6 :\n- Updated FPS++ to v0.4.3.1\n- Added Cutscene-fix patches for game versions 1.0.0 and 1.1.1\n\nv.1.5.5 :\n- Updated LOD Patch to work with 1.1.1 \n- Renamed to \"Graphics - Disable LOD Quality Reduction\"\n- Removed \"improve LOD\" code that was proven as a placebo\n\nv.1.5.4 :\n- Added 30fps version of FPS++.\n\nv.1.5.3 :\n- Added new 1008p Mod that includes disable FSR and disable dynamic res built in, with a choice of FXAA on or off\n- Renamed 1026p Mod to indicate a minor visual bug\n\nv.1.5.2 : \n- Updated FPS++, now fix cinematics\n\nv.1.5.1 : \n- Fixed Shadow mods names\n- Fixed 60fps v4 mod don't working with 1.0.0 and 1.1.1\n\nv.1.5 : \n- Renamed Potato Patches to Lazy Packs.\n- Updated several mods to be compatible with 1.0.0 and 1.1.1.\n- Updated Dynamic FPS.\n- Added FPS+++ and DOF Remover.\n- Added 1026p resolution mods.\n\nv.1.4.5 : \n- Fixed some missings in new combo packs.  \n\nv.1.4.4:\n- New series of combo patches - \"Lazy Packs\"!\n<br>A single patch containing all patches that you want \n<br>Simply choose a \"lazy pack\" with the desired resolution, framerate, and UI mod compatibility.  \n<br>UI compatibility means that the patch is compatible with mods such as the Xbox UI mod above.  \n<br>Otherwise, blackscreenfix is enabled in the non-compatible versions, for use with normal Nintendo UI.\n- Updated guide! Click the fourth, bottom arrow in this release post to see\n\nv1.4.3 : \n- Added Cheat - Durability (10x) Mod\n- Updated \"1.1.0 - FPS - 60fps v3 - BUGGY\" with cutscene-fix compatibility fixes.\n- Updated \"Combo - 60fps v3 + DynamicFPS v1.3 - OLD\" with cutscene-fix compatibility fixes.\n- Updated \"Combo - 60fps v3 + DynamicFPS v1.41 - NEW\" with cutscene-fix compatibility fixes.\n- Renamed \"1.1.0 - FPS - 60fps v3 - BUGGY\" to \"1.1.0 - FPS - 60fps v3.7.2, now cutscene-fix compatible\"\n- Renamed \"1.1.0 - Combo - 60fps v3 + DynamicFPS v1.31 - OLD\" to \"1.1.0 - Combo - 60fps v3 + DynamicFPS v1.31 + Cutscene-Fix - OLD\"\n- Renamed \"1.1.0 - Combo - 60fps v3 + DynamicFPS v1.41 - NEW\" to 1.1.0 - \"Combo - 60fps v3.7.2 + DynamicFPS v1.41 + Cutscene-Fix - NEW\"\n\nv1.4.2 : \n- Added Combo - 120fps v3 + DynamicFPS v1.41 Mod\n- Added Cutscene-Fix Mod\n- Added Over 30FPS Blackscreen Fix Mod\n\nv1.4.1 :\n- Added Anisotropic Filtering Fix\n\nv1.4 :\n- Updated DynamicFPS to 1.41\n- Splited FSR Downscaling and Sharpening remover into 2 different mods\n- Updated FSR Sharpening remover\n- Updated FXAA remover\n- Updated LOD Reduction disabler\n- Removed VisualFixes Combo, use splited mods instead\n- Removed Potato Patch Combo that don't really increase performances, use splited mods instead\n- Edited documentation about Shadow mods, please read\n\nv1.3 :\n- Updated DynamicFPS mod from 1.31 to 1.4.  \n\nv1.2.3 :\n- Added 360p Mod and Light pack and Unlimited FPS Combo mod, read the documentation to setup correctly.  \n\nv1.2.2 :\n- Added 30/60fps + Dynamic FPS Combo mods.  \n\nv1.2.1 :\n- Added 18:9 and 16:10 Experimental Ratio mods.  \n\nv1.2 : \n- Experimental 21:9 and 32:9 mods, read informations on the main page : https://github.com/HolographicWings/TOTK-Mods-collection.  \n\nv1.1 : \n- \"Potato Patch\" by Hoverbike, a collection of patches, is the only patch you need. Just enable it, along with the TOTK 1.1.0 update, and you're off to the races.  \n\nv1.0 : \n- Main release.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.33984375,
          "content": "<img width=100% src=\"https://capsule-render.vercel.app/api?type=waving&color=6c7086&height=120&section=header\"/>\n\n# <p align=center> [<img src=\"https://github.com/hoverbike1/TOTK-Mods-collection/assets/57139770/b3b91e38-c01c-46cb-9ff9-23ef9a69c0a1\">](https://github.com/MaxLastBreath/TOTK-mods/) </p>\n\n# <p align=center> [![Download](https://img.shields.io/github/downloads/hoverbike1/TOTK-Mods-collection/total.svg?style=for-the-badge)](https://github.com/HolographicWings/TOTK-Mods-collection/releases/latest/) - [![Discord](https://img.shields.io/badge/Discord-%235865F2.svg?style=for-the-badge&logo=discord&logoColor=white)](https://discord.com/invite/7MMv4yGfhM)  - [![Ko-Fi](https://img.shields.io/badge/Ko--fi-F16061?style=for-the-badge&logo=ko-fi&logoColor=white)](https://ko-fi.com/maxlastbreath#) - [![YouTube](https://img.shields.io/badge/YouTube-%23FF0000.svg?style=for-the-badge&logo=YouTube&logoColor=white)](https://www.youtube.com/channel/UC9-81HNX9HfWHUsXBz5xYsQ) - [![Reddit](https://img.shields.io/badge/Reddit-%23FF4500.svg?style=for-the-badge&logo=Reddit&logoColor=white)](https://www.reddit.com/user/Maxlastbreath) </p>\n\n### <p align=center> [Get Access to new Features Early.](https://ko-fi.com/maxlastbreath) </p>\n\n# <p align=center> 🐾 Quick Installation Guide 🐾 </p>\n\n**Download the Provided AppImage or .exe File from [releases](https://github.com/hoverbike1/TOTK-Mods-collection/releases)**\n- Run the executable.\n   - Simply select a preset suitable for your PC configuration. The following presets are for.\n     - **Default (1080P)** GTX 1060(6GB). AMD Rx 5600+\n     - **Very Low (720P)**: For devices slower than listed below.\n     - **Low (900P)**: GTX 1050/1050ti/1060(3GB). AMD Rx 570/580\n     - **Medium (1440P)**: GTX 1070/1660ti/2060. AMD Rx 5700+\n     - **High (4K)**: GTX 1080/2070/3070/3080+. AMD Rx 6700/6800/7800 (AT LEAST 8GB VRAM)\n     - **Ultra (6K)**: 3080ti/3090+. Rx 6800/7800/7800xt. (AT LEAST 12gb+ VRAM)\n     - **EXTREME (8k)**: 3090/4090. Rx 7900xt/7900xtx. (AT LEAST 16gb+ VRAM)\n   - If you desire further changes, feel free to tweak the settings.\n- (WARNING) Select Yuzu.exe or Ryujinx.exe if you are using them in portable MODE.\n- Click **apply and open TOTK from yuzu.exe/ryujinx.exe**!\n\n**If you can't get the AppImage to Open for Linux**\n- Right click, properties, permissions, run as executable\n\n# <p align=center> [Benchmark of performance using Ultracam Benchmarking feature, please participate!](https://github.com/hoverbike1/TOTK-Mods-collection/issues/169)\n\n## <p align=center> 🎮 Control Schematics 🎮 </p>\n\n### ***UltraCam Beyond Controls***\n- Left Trigger (HOLD), Pad Down (PRESS) - Unlocks Freecam. - (U)\n- L (PRESS) and R (PRESS) - Move UP/Down. - (CNTRL) (SPACE)\n- Pad Left (PRESS), Pad Right (PRESS) - Camera Speed. - (1) (2)\n- Pad Down (PRESS)(TOGGLE) - Allows Control over link. - (L)\n- Plus (PRESS), Minus (PRESS) - Controls Time. - (NONE)\n- ZL (HOLD) Or ZR (HOLD) - Acceleration/De-Acceleration for Movement and Time. - (SHIFT) (ALT)\n- ZR (HOLD) + Plus (Press) - Change Weather. (Takes a few seconds) - (NONE)\n- ZR (HOLD) + Down (PRESS) - Teleport Link. (Opens Glider) - (O)\n- Pad Down (HOLD) - Y (HOLD) or A (HOLD) - Changes FOV. - (J) (K)\n- Y (PRESS) or A (PRESS) - Controls Tilt. - (3) (4)\n- Left Stick (PRESS) - Resets FOV, Tilt. - (5)\n- Hide UI - (H)\n\n### ***Sequencer Beyond Controls***\n- G (PRESS) - Start benchmark\n- X (PRESS) - Create Keyframe. - (6)\n- B (PRESS) - Delete Keyframe. - (7)\n- Right Stick (PRESS) - Play Sequence. - (8)\n- Delete Sequence. - (0)\n- L (PRESS)(SEQUENCE) - Pause. - (SPACE)\n- L (PRESS)(SEQUENCE) - Reverse. - (BACKSPACE)\n- Pad Left (PRESS) - Slow Down. - (1)\n- Pad Right (PRESS) - Speed Up. - (2)\n- ZL (HOLD) or ZR (HOLD) - Accelerate/De-accelerate. - (SHIFT) (ALT)\n\n### [EARLY ACCESS FEATURES (with more to come)](https://ko-fi.com/maxlastbreath)\n#### [Ultracam 2.0+ EA features](https://ko-fi.com/maxlastbreath)\n- [ZL (HOLD) + Minus (PRESS) - Pause Game. - (P)](https://ko-fi.com/maxlastbreath)\n- [UP (PRESS) - Lock camera to any chosen OBJECT or NPC. - (V)](https://ko-fi.com/maxlastbreath)\n\n#### [UltraCam 3.0](https://ko-fi.com/maxlastbreath)\n[A full Custom Console!](https://ko-fi.com/maxlastbreath)\n- [Currently working commands](https://ko-fi.com/maxlastbreath)\n    - [teleport](https://ko-fi.com/maxlastbreath)\n    - [cords](https://ko-fi.com/maxlastbreath)\n    - [settime](https://ko-fi.com/maxlastbreath)\n    - [gettime](https://ko-fi.com/maxlastbreath)\n    - [timespeed](https://ko-fi.com/maxlastbreath)\n    - [pause](https://ko-fi.com/maxlastbreath)\n    - [godmode](https://ko-fi.com/maxlastbreath)\n    - [kill](https://ko-fi.com/maxlastbreath)\n    - [heal](https://ko-fi.com/maxlastbreath)\n    - [healthregen](https://ko-fi.com/maxlastbreath)\n    - [fps](https://ko-fi.com/maxlastbreath)\n    - [fov](https://ko-fi.com/maxlastbreath)\n    - [shadow (changes shadow res)](https://ko-fi.com/maxlastbreath)\n    - [resolution (changes resolution)](https://ko-fi.com/maxlastbreath)\n    - [hideui](https://ko-fi.com/maxlastbreath)\n    - [benchmark](https://ko-fi.com/maxlastbreath)\n\n[ALL IN REAL TIME!](https://ko-fi.com/maxlastbreath)\n\n#### [BOTW UltraCam Beta 1 DFPS](https://ko-fi.com/maxlastbreath)\n[Tackling the same challenges as Tears of the Kingdom presented, but in Breath of the Wild.\nThis is still a very early WIP, but here are some of the current functionality, soon to be expanded.](https://ko-fi.com/maxlastbreath)\n- [FPS up to (120/480)](https://ko-fi.com/maxlastbreath)\n- [Averages Delta-FPS based on 6 delta times.](https://ko-fi.com/maxlastbreath)\n- [Acts as a Static FPS mod when set a certain FPS cap](https://ko-fi.com/maxlastbreath)\n- [Locks Movie Menus to 30 FPS (VSYNC ON ONLY FOR RYUJINX!)](https://ko-fi.com/maxlastbreath)\n- [Menu FPS cap](https://ko-fi.com/maxlastbreath)\n- [Fixes Blackscreen in Quick Menus.](https://ko-fi.com/maxlastbreath)\n- [Menu Animation speeds.](https://ko-fi.com/maxlastbreath)\n- [Fixes Menu speeds (partially, maps too fast still)](https://ko-fi.com/maxlastbreath)\n- [Fixes Hud Animations](https://ko-fi.com/maxlastbreath)\n- [Fixes Link's animations.](https://ko-fi.com/maxlastbreath)\n- [Fixes Link's Speed.](https://ko-fi.com/maxlastbreath)\n- [Fixes Enemy's Speed and attacks.](https://ko-fi.com/maxlastbreath)\n- [Fixes Stamina Drain- Fixes Stamina Speed](https://ko-fi.com/maxlastbreath)\n- [Ladder Climbing (no problems on botw weird)](https://ko-fi.com/maxlastbreath)\n- [Connected a Custom Controller (For the future)](https://ko-fi.com/maxlastbreath)\n\n\n\n# <p align=center> 🐬 More Information 🐬 </p>\n## <p align=center> 🐋 Mod Settings and More 🐋 </p>\n### **Presets and Preset Settings**\n- Select Preset\n  - A one click setup for all your needs.\n     - **Default (1080P)** GTX 1060(6GB). AMD Rx 5600+\n     - **Very Low (720P)**: For devices slower than listed below.\n     - **Low (900P)**: GTX 1050/1050ti/1060(3GB). AMD Rx 570/580\n     - **Medium (1440P)**: GTX 1070/1660ti/2060. AMD Rx 5700+\n     - **High (4K)**: GTX 1080/2070/3070/3080+. AMD Rx 6700/6800/7800 (AT LEAST 8GB VRAM)\n     - **Ultra (6K)**: 3080ti/3090+. Rx 6800/7800/7800xt. (AT LEAST 12gb+ VRAM)\n     - **EXTREME (8k)**: 3090/4090. Rx 7900xt/7900xtx. (AT LEAST 16gb+ VRAM)\n- Select Settings\n  - Optimized settings for TOTK only.\n\n### **UltraCam Beyond**\n- Beyond UltraCam (Freecam)\n  - Completely reworked MATH.\n- Sequencer Beyond.\n  - Allows for the placement of keyframes and creation of custom animations with FOV controls and speed controls.\n  - Now also has a fadeout setting.\n  - Now also interpolates FOV.\n- Resolution Beyond\n   - Internal resolution, forces the game to RENDER. not upscale to different resolutions.\n   - Automatically adjusts the Memory in the game to allocate for different resolutions.\n   - Requires extended Memory or a switch with more than 4gb for resolutions over 1440p\n   - Improves SSAO and OTHER visual effects as well.\n- Shadow Resolution Beyond\n  - Internal shadow resolution can now go up to 8K even with 1080p :). (IT LOOKS INSANE)\n- FPS Beyond (Hybrid DFPS)\n   - UltraCam Beyond improves upon the dynamically adjusting game speed algorithm, completely rewrites it\n   - Prioritizes static delta time over dynamic delta time when FPS target is reached. Please cap FPS to your FPS target.\n   - Fixes multiple physics and FPS issues.\n   - Fixes Menu and Map speeds.\n   - Dynamic FPS cap. Allows the game to cap FPS depending on different circumstances.\n   - Allows for up to 480 FPS dynamically adjusted for menus AND the main game.\n- Triple Buffer\n   - Forces TOTK Double Buffer to a Triple Buffer helping eliminate stuttering and makes the game run smoother.\n- Improve Fog\n   - Removes the weird haze around Link.\n- FOV Beyond \n   - Adjusts all the FOVS based on an algorithm.\n- Camera Speed Beyond\n  - (Under Advanced Settings)\n  - Allows for the adjustment to horizontal and vertical speeds to your liking.\n- Render Distance\n  - Adjusts the game's far camera render distance.\n  - Using a value too low will make the game look a bit foggy, similar to Minecraft, up to 20% FPS increase at low.\n- Quality Improvements Beyond\n  - Removes FSR, FXAA and Dynamic Resolution making the game look way better.\n- Depth of Field\n  - Reduces the depth of field.\n- Lensflare\n  - Removes the lensflare from the game.\n- Override Handheld Resolution\n  - Forces handheld resolution to be the same as docked.\n  - UltraCam Beyond also allows for adjusting each resolution individually (This setting has been disabled currently)\n- Aspect Ratios Beyond. (Automatic)\n  - Adjust's the game's aspect ratio's and resolution, allowing for a much cleaner image on UltraWide monitors.\n- Memory Allocation\n  - UltraCam Beyond adjusts multiple different memories in the game to allow for smoother experience on PC (Auto).\n- Benchmarks\n  - UltraCam Beyond has it's own custom benchmark built in. Press G with virtual Keyboard on.\n    - Currently supports 5 different benchmarks.\n    - Benchmarks are saved on switch's SD card (sdmc yuzu)\n\n### **Aspect Ratios & Ui**\n- Aspect ratios are section of combined mod files with certain UI and an Aspect Ratio mod.\n- UI mods are mods that change the look of your buttons (PS4, Xbox, Steamdeck)\n\n### **Camera Mods** (TO BE REPLACED)\n- First Person, completely transforms the game into First Person! Horses, Steering stick and more!\n\n\n## <p align=center> 🔧 Optimizer Settings 🔧 </p>\n### Text Settings\n- Custom Background\n  - Make a folder named **custom**, put any image (16:9 or 2:1, AR) rename it to bg.png or bg.jpg. Enjoy a newly fresh custom background!\n- Select Font\n  - Changes the font of the text, to your desired font, it does require the font to be installed.\n- Text Color, Shadow Color, Active Color\n  - Changes the Color of the text, it's shadow and it's active color (Hover)\n- Choose GUI style\n  - Let's you choose button style from TTKbootstrap.\n- Scale with Windows\n  - Different Scaling options, ON - scales based on algorithm, OFF - puts it to 1080p default, 1.0 is 1080p, 1.5x = 1440p, 2.0 = 4k...\n- Auto backup & Auto Backup(Cheats)\n  - Automatically backups your game, when you use apply on (Main or Cheats) canvases.\n- Gui Animation\n  - Animations for the GUI(Moving Backgrounds) - Shouldn't affect performance as it turns off automatically when not focused.\n\n# <p align=center> ⭐ [Changelogs](https://github.com/MaxLastBreath/TOTK-mods/releases) ⭐ </p>\n\n# Copyright Source & Credits\n- [UltraCam/DFPS/TOTK Optimizer (MaxLastBreath, developer of this software)](https://linktr.ee/maxlastbreath)\n- [Triple Buffering - MasaGratoR](https://github.com/masagrator)\n- [Help With Internal Res](https://linktr.ee/keatonthebot)\n- [Controller UI mods](https://gamebanana.com/members/1944248)\n- [Cheats bad1dea](https://github.com/bad1dea/NXCheats/tree/main/The%20Legend%20of%20Zelda%20Tears%20of%20the%20Kingdom)\n\n# Special Thanks to\n- [Jake for testing the Mod Manager on Linux and reformatting and cleaning readme.](https://github.com/JakeDystopia/)\n- [u/Pixelkiri for Workflow and testing!](https://github.com/alexkiri/)\n- [MaxAnimatior for some insight and testing](https://github.com/D-Maxwell)\n- [Fruithapje21 for helping with UI Aspect Ratios](https://github.com/Fruithapje21)\n- LotP, great friend and teacher :) also lots of help with UltraCam.\n- Meeko on my Discord Server for testing Steamdeck.\n\n# Switch modders, I'm thankful to.\n- [StevensND](https://linktr.ee/stevensmods)\n- [MasaGratoR](https://github.com/masagrator)\n- [KeatonTheBot](https://linktr.ee/keatonthebot)\n- [Fl4sh](https://github.com/Fl4sh9174)\n- [fayaz12g](https://github.com/fayaz12g)\n- [the5thtear](https://github.com/The5thTear)\n"
        },
        {
          "name": "TOTK Optimizer",
          "type": "tree",
          "content": null
        },
        {
          "name": "config.yaml",
          "type": "blob",
          "size": 0.1328125,
          "content": "root: TOTK Optimizer # Tool directory\nteam:\n  - MaxLastBreath\n  - Hoverbike\n  - Darktalon\n  - Socats\n  - Spockbauru\n  - HolographicWings"
        },
        {
          "name": "schema.yaml",
          "type": "blob",
          "size": 0.6572265625,
          "content": "id: regex('^[0-9a-f]{8}-[0-9a-f]{4}-[0-5][0-9a-f]{3}-[089ab][0-9a-f]{3}-[0-9a-f]{12}$')\ntitle: str()\nsubtitle: str(required=False)\ndescription: str(required=False)\nversion: any(regex('^\\d+\\.\\d+.\\d+$'), required=False)\ncategory: int()\ngame:\n  titleId: str()\n  version: list(str())\nemulator: list(int())\ncompatibility:\n  whitelist: list(regex('^[0-9a-f]{8}-[0-9a-f]{4}-[0-5][0-9a-f]{3}-[089ab][0-9a-f]{3}-[0-9a-f]{12}$'), required=False)\n  blacklist: list(regex('^[0-9a-f]{8}-[0-9a-f]{4}-[0-5][0-9a-f]{3}-[089ab][0-9a-f]{3}-[0-9a-f]{12}$'), required=False)\nauthor: list(include('author_element'), required=False)\n---\nauthor_element:\n  name: str()\n  link: str(required=False)\n"
        },
        {
          "name": "zip_script.sh",
          "type": "blob",
          "size": 1.07421875,
          "content": "#!/bin/bash\n\nversion=\"$1\"\nformat=\"$2\"\nzip_file=\"$3\"\n\n# Create a temporary directory to store the compatible config files\ntemp_dir=$(mktemp -d)\n\n# Find folders containing config.yaml within the Mods directory and its subdirectories\nIFS=$'\\n' # Set the IFS (Internal Field Separator) to handle folder names with spaces\nfolders=($(find . -type f -name \"config.yaml\" -exec dirname {} \\;))\n\n# Iterate through the folders\nfor folder in \"${folders[@]}\"; do\n  # Read the game versions using yq and store them in an array using mapfile\n  result=$(yq e \".game.version[] | select(. == \\\"$version\\\")\" \"$folder/config.yaml\")\n  if [[ -n $result ]]; then\n    # Copy the folder to the temporary directory\n    mkdir -p \"$temp_dir/$folder\" && cp -r \"$folder\" \"$temp_dir/$folder/../\"\n  fi\ndone\n\n# Create a zip file containing the compatible folders\n7z a -t\"$format\" -mx9 \"$zip_file\" \"$temp_dir/*\"\n7z a -t\"$format\" -mx9 \"$zip_file\" \"README.md\"\n7z a -t\"$format\" -mx9 \"$zip_file\" \"LICENSE\"\n7z a -t\"$format\" -mx9 \"$zip_file\" \"Guide\"\n\n# Clean up the temporary directory\nrm -rf \"$temp_dir\"\n\necho \"Zip file created: $zip_file\""
        }
      ]
    }
  ]
}