{
  "metadata": {
    "timestamp": 1736568384350,
    "page": 326,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMzMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "GloriousEggroll/wine-ge-custom",
      "stars": 2155,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0341796875,
          "content": "/.vagrant/\n/vagrant_share/\n/builds\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0.291015625,
          "content": "[submodule \"proton-wine\"]\n\tpath = proton-wine\n\turl = http://github.com/gloriouseggroll/proton-wine/\n[submodule \"wine-staging\"]\n\tpath = wine-staging\n\turl = https://github.com/wine-staging/wine-staging/\n[submodule \"buildbot\"]\n        path = buildbot\n        url = https://github.com/lutris/buildbot/\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 11.9697265625,
          "content": "# wine-ge-custom\n\nThis is my build of WINE based on/forked from the most recent bleeding-edge proton experimental wine repo. This is meant to be used with non-steam games outside of Steam.\n\nFor Steam games, I provide Proton-GE for usage with Lutris, found here:\n\nhttps://github.com/gloriouseggroll/proton-ge-custom\n\n## Occasionally, I also release League of Legends builds -- These builds will specifically have 'lol' or 'LoL' in the name. Please note these 'LoL' builds are for specific use with League of Legends, and NO other games.\n\n## If you have an issue that happens with my Wine-GE or Wine-LoL-GE builds, provided FROM this repository, please contact me on Discord about the issue:\n\nhttps://discord.gg/6y3BdzC\n\n## Table of contents\n\n- [Overview](#overview)\n\t- [Media Foundation Fixes (fully working or playable)](#media-foundation-fixes-fully-working-or-playable)\n\t- [Notes](#notes)\n- [Installation](#installation)\n\t- [Manual](#manual)\n- [Building](#building)\n- [Modification](#modification)\n- [Credits](#credits)\n\t- [TKG (Etienne Juvigny)](#tkg-etienne-juvigny)\n\t- [Guy1524 (Derek Lesho)](#guy1524-derek-lesho)\n\t- [Joshie (Joshua Ashton)](#joshie-joshua-ashton)\n\t- [doitsujin/ドイツ人 (Philip Rebohle)](#doitsujinドイツ人-philip-rebohle)\n\t- [HansKristian/themaister (Hans-Kristian Arntzen)](#hanskristianthemaister-hans-kristian-arntzen)\n\t- [flibitijibibo (Ethan Lee)](#flibitijibibo-ethan-lee)\n\t- [simmons-public (Chris Simmons)](#simmons-public-chris-simmons)\n\t- [Sporif (Amine Hassane)](#sporif-amine-hassane)\n\t- [wine-staging maintainers](#wine-staging-maintainers)\n\t- [Reporters](#reporters)\n\t- [Patrons](#patrons)\n- [Donations](#donations)\n## Overview\n\nThings it contains that Valve's proton does not:\n\n- Additional media foundation patches for better video playback support\n- AMD FSR patches added directly to fullscreen hack that can be toggled with WINE_FULLSCREEN_FSR=1\n- FSR Fake resolution patch (details here: https://github.com/GloriousEggroll/proton-ge-custom/pull/52)\n- Nvidia CUDA support for phsyx and nvapi\n- Raw input mouse support\n- fix for Mech Warrior Online\n- fix for Asseto Corsa HUD\n- fix for MK11 crash in single player\n- fix for Killer Instinct Vulkan related crash\n- fix for Cities XXL patches\n- various upstream WINE patches backported\n- various wine-staging patches applied as they become needed\n\n## Media Foundation fixes (Fully working or playable)\n\n- Spyro Reignited Trilogy\n- Mortal Kombat 11\n- Injustice 2\n- Power Rangers: Battle for the Grid\n- Borderlands 3\n- Resident Evil 0\n- Resident Evil\n- Resident Evil 2 Remastered\n- Resident Evil 3 Remastered\n- Resident Evil 5\n- Resident Evil 6\n- Resident Evil 7\n- Resident Evil 8\n- Resident Evil Revalations\n- Resident Evil Revalations 2\n- Persona 4 Golden\n- PC Building Simulator\n- Dangonronpa V3\n- Super Lucky's Tale\n- Remnant: From the Ashes\n- BlazBlue Centralfiction\n- Bloodstained: Ritual of the Night\n- Crazy Machines 3\n- Devil May Cry 5\n- Wasteland 3\n- Mutant Year Zero\n- Ultimate Marvel Vs. Capcom 3\n- Industry of Titan\n- Call of Duty Black Ops III\n- Tokyo Xanadu eX+\n- Haven\n- Nier Replicant\n- Scrap Mechanic\n- Aven Colony\n- American Fugitive\n- Asrtonner\n- Soul Caliber VI\n- Monster Hunter Rise\n- Seven: Days Gone\n\n## Notes\n\n- Warframe is problematic with VSync. Turn it off or on in game, do not set to `Auto`\n- Warframe needs a set a frame limit in game. Unlimited framerate can cause slowdowns\n- Warframe on Nvidia: you may need to disable GPU Particles in game otherwise the game can freeze randomly. On AMD they work fine\n\n## Installation\n\nPLEASE NOTE: There are prerequisites for using this version of wine:\n\n1. You must have wine installed on your system\n2. You must have winetricks installed on your system\n3. You must have wine dependencies installed on your system. See https://www.gloriouseggroll.tv/how-to-get-out-of-wine-dependency-hell/\n4. You must have vulkan gpu drivers/packages installed properly on your system. See https://github.com/lutris/docs/blob/master/InstallingDrivers.md\n\n### Manual\n\nThis section is for manual installation of wine-ge for usage with Lutris.\n\n1. Extract `wine-name-branch-x86_64.tar.gz` to `/home/USERNAME/.local/share/lutris/runners/wine/`\n2. Restart lutris. You can now choose `wine-name-branch-x86_64` from the runners list in configuration options for any game.\n\n\n## Building\n\nInstall docker/podman:  \n\n    On Ubuntu: sudo apt install podman\n    On Arch:   sudo pacman -S podman\n    On Fedora: sudo dnf install podman\n\nBuild wine:\n\n    usage:             ./makebuild.sh name winerepo branch\n    example:           ./makebuild.sh lutris-GE https://github.com/GloriousEggroll/proton-wine Proton8-15\n    build name output: builds/runners/wine/wine-lutris-GE-Proton8-15-x86_64.tar.xz\n\nAdditional tips:\n\n  To access the container:\n\n    docker start buildbot\n    docker exec -it buildbot bash\n\n  To exit the container:\n\n    exit\n    docker stop buildbot\n\n  To delete the container and view containers list:\n\n    docker container rm buildbot\n    docker container list -a\n\n  To delete the container image and view images list:\n\n    docker rmi docker.io/gloriouseggroll/lutris_buildbot\n    docker images\n\n* IMPORTANT NOTES: \n- wine, wine-staging and patches repos/folders are here for my personal use. The build bot does -NOT- pull from any of these folders directly.__\n- GloriousEggroll/proton-wine Proton* branches are PRE-PATCHED, meaning it is ready to compile, no patching needed.\n\nIf you need to make changes to the wine build it is recommended to:\n\n  1. Fork the ValveSoftware/wine repository\n  2. Clone your fork of the ValveSoftware/wine repository\n  3. Add official ValveSoftware/wine repository as a remote branch in your clone/fork\n  4. Checkout the latest experimental-wine-bleeding-edge tree and make a new branch from it.\n  5. then run `./patches/protonprep.sh` to apply my changes to your own wine repository\n  6. then commit + push those changes to your new branch on your -own- repository.\n  7. THEN follow the makebuild.sh instructions from above, using your own repository URL and branch.\n\n\n## Modification\n\nEnvironment variable options:\n\n| Compat config string  | Environment Variable           | Description  |\n| :-------------------- | :----------------------------- | :----------- |\n|                       | <tt>WINE_FULLSCREEN_FSR</tt>   | Enable AMD FidelityFX Super Resolution (FSR), use in conjunction with `WINE_FULLSCREEN_FSR_STRENGTH` Only works in vulkan games (dxvk and vkd3d-proton included).|\n|                       | <tt>WINE_FULLSCREEN_FSR_STRENGTH</tt> | AMD FidelityFX Super Resolution (FSR), the default sharpening of 5 is enough without needing modification, but can be changed with 0-5 if wanted. 0 is the maximum sharpness, higher values mean less sharpening. 2 is the AMD recommended default and is set by proton-ge |\n\n## Credits\n\nAs many of you may or may not already know, there is a Credits section in the README for this Git repository. My proton-ge project contains some of my personal tweaks to Proton, but a large amount of the patches, rebases and fixes come from numerous people's projects. While I tend to get credited for my builds, a lot of the work that goes into it are from other people as well. I'd like to take some time to point a few of these people out of recognition. In future builds, I plan to make clearer and more informative Git commits, as well as attempt to give these people further crediting, as my README may not be sufficient in doing so.\n\n### TKG (Etienne Juvigny)\n\n- https://www.patreon.com/tkglitch\n- https://github.com/Frogging-Family/wine-tkg-git\n\nI and many others owe TKG. In regards to both WINE and Proton. He has dedicated a lot of time (2+ years at least) to rebasing WINE and Proton patches, as well as making his own contributions. Before he came along, I did some rebasing work, and mainly only released things for Arch. These days he almost always beats me to rebasing, and it saves myself and others a **lot** of work.\n\n### Guy1524 (Derek Lesho)\n\n- https://github.com/Guy1524\n\nDerek was responsible for the original rawinput patches, as well as several various game fixes in the past, just to name a few: MK11, FFXV, MHW, Steep, AC Odyssey FS fix. He has also done a massive amount of work on media foundation/mfplat, which should be hopefully working very soon.\n\n### Joshie (Joshua Ashton)\n\n- https://github.com/Joshua-Ashton/d9vk\n\nJoshua is the creator of D9VK and also a huge contributor of DXVK. He is also known for his recent DOOM Eternal WINE fixes and also many of the Vulkan tweaks and fixes used, such as FS hack interger scaling.\n\n### doitsujin/ドイツ人 (Philip Rebohle)\n\n- https://github.com/doitsujin/dxvk\n\nPhilip is the creator of DXVK and a heavy contributor of VKD3D. He also put up a lot of my bug reporting for Warframe years ago, when DXVK started.\n\n### HansKristian/themaister (Hans-Kristian Arntzen)\n\n- https://github.com/HansKristian-Work\n\nHans-Kristian is a heavy contributor of VKD3D and he also created a lot of WINE patches that allowed WoW to work.\n\n### flibitijibibo (Ethan Lee)\n\n- https://github.com/sponsors/flibitijibibo\n- https://fna-xna.github.io/\n\nEthan is the creator of FAudio, and he also listened to my Warframe bug reports years ago.\n\n### simmons-public (Chris Simmons)\n\n- https://github.com/simons-public\n\nChris is the creator of the original Protonfixes project. The portions of Protonfixes I've imported are what allow customizations to be made to prefixes for various Proton games. without Proton fixes many games would still be broken and/or require manual prefix modification. Huge thanks to Chris.\n\n### Sporif (Amine Hassane)\n\n- https://github.com/Sporif\n\nAmine is the current maintainer of dxvk-async. This is a feature that was originally removed from dxvk as it happened around the same time a few overwatch bans happened. It was thought, but never confirmed whether or not this feature caused the bans, so the feature was removed as a safety precaution. It is still safe to use in many single player games, and games that do not have competitive anti-cheats. It has also been confirmed to work safely in Warframe and Path of Exile.\n\n### wine-staging maintainers\n\nI also of course need to thank my fellow wine-staging maintainers: Alistair Leslie-Hughes, Zebediah Figura and Paul Gofman\n\nThey have contributed MANY patches to staging, far beyond what I have done, as well as kept up with regular rebasing. A lot of times when bug reports come to me, if it has to do with staging I end up testing and relaying information to these guys in order to get issues resolved.\n\n### Reporters\n\nAdditionally, a thank you is owed to Andrew Aeikum (aeikum), and kisak (kisak-valve) for regularly keeping me in the loop with Proton and fsync patches, as well as accepting PRs I've made to fix Proton build system issues, or listening to bug reports on early Proton patches before they reach Proton release.\n\n### Patrons\n\nAnd finally - To all of my patrons that have supported me, thank you so much. It's because of you that I've been able to keep this project going, getting bug fixes reported, getting Proton/WINE issues fixed, getting various hardware and/or game fixes handled, and so on. Thanks to you, I have been able to use the spare budget in order to both help support the other people that make my project possible, as well as get things necessary for testing such as new game releases or specific hardware that hits odd issues. It's had a huge effect not just for this project, but a large trickle down effect.\n\nMy wine-staging co-maintainers are often able to ask me for testing games, or testing on different hardware if they don't have access to it. This also trickles into both Proton bug reporting AND Lutris bug reporting, as I'm able to provide bug testing and feedback and custom builds and upgrades to them as well. I'm also able to test driver related issues for things such as mesa and getting things reported + patched. This in turn leads to early patches for Mesa, the kernel, VKD3D, and other packages on my copr repos as well. The trickle down effect is just one gigantic awesome rabbit hole for getting things fixed. Thank you once again.\n\n## Donations\n\nFor anyone else interested, my Patreon can be found here:\n\nhttps://www.patreon.com/gloriouseggroll\n"
        },
        {
          "name": "VERSION",
          "type": "blob",
          "size": 0.025390625,
          "content": "Lutris Wine GE-Proton8-26\n"
        },
        {
          "name": "buildbot",
          "type": "commit",
          "content": null
        },
        {
          "name": "makebuild.sh",
          "type": "blob",
          "size": 1.0244140625,
          "content": "#!/bin/bash\n\n# usage: ./makebuild.sh name winerepo branch\n# example: ./makebuild.sh lutris-GE https://github.com/GloriousEggroll/proton-wine Proton8-15\n# build name output: builds/runners/wine/wine-lutris-GE-Proton8-15-x86_64.tar.xz\n\nif [[ ! -d builds ]]; then\n\tmkdir -p builds\nfi\nif [[ -z $(podman container list -a | grep buildbot) ]]; then\n\tdocker create --interactive --name buildbot --mount type=bind,source=\"$PWD\"/builds,destination=/builds,readonly=false --mount type=bind,source=\"$PWD\"/buildbot,destination=/home/vagrant/buildbot,readonly=false docker.io/gloriouseggroll/lutris_buildbot:bullseye\nfi\n\ndocker start buildbot\n\n# cleanup any old builds first\ndocker exec buildbot bash -c \"rm -Rf /home/vagrant/buildbot/runners/wine/wine-src/\"\n\n# start build\ndocker exec buildbot bash -c \"cd /home/vagrant/buildbot/runners/wine && ./build.sh --as $1 --version $3 --with $2 --branch $3\"\n\ndocker stop buildbot\n\ncd builds/runners/wine\nexport SHA512NAME=$(ls | grep tar.xz | sed -r 's/tar.xz/sha512sum/g'); sha512sum $(ls | grep tar.xz) > $SHA512NAME\n"
        },
        {
          "name": "patches",
          "type": "tree",
          "content": null
        },
        {
          "name": "proton-wine",
          "type": "commit",
          "content": null
        },
        {
          "name": "wine-staging",
          "type": "commit",
          "content": null
        }
      ]
    }
  ]
}