{
  "metadata": {
    "timestamp": 1736568633826,
    "page": 715,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjcxOQ==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "taigaio/taiga-docker",
      "stars": 1338,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".env",
          "type": "blob",
          "size": 1.95703125,
          "content": "\n# Taiga's URLs - Variables to define where Taiga should be served\nTAIGA_SCHEME=http  # serve Taiga using \"http\" or \"https\" (secured) connection\nTAIGA_DOMAIN=localhost:9000  # Taiga's base URL\nSUBPATH=\"\" # it'll be appended to the TAIGA_DOMAIN (use either \"\" or a \"/subpath\")\nWEBSOCKETS_SCHEME=ws  # events connection protocol (use either \"ws\" or \"wss\")\n\n# Taiga's Secret Key - Variable to provide cryptographic signing\nSECRET_KEY=\"taiga-secret-key\"  # Please, change it to an unpredictable value!!\n\n# Taiga's Database settings - Variables to create the Taiga database and connect to it\nPOSTGRES_USER=taiga  # user to connect to PostgreSQL\nPOSTGRES_PASSWORD=taiga  # database user's password\n\n# Taiga's SMTP settings - Variables to send Taiga's emails to the users\nEMAIL_BACKEND=console  # use an SMTP server or display the emails in the console (either \"smtp\" or \"console\")\nEMAIL_HOST=smtp.host.example.com  # SMTP server address\nEMAIL_PORT=587   # default SMTP port\nEMAIL_HOST_USER=user  # user to connect the SMTP server\nEMAIL_HOST_PASSWORD=password  # SMTP user's password\nEMAIL_DEFAULT_FROM=changeme@example.com  # default email address for the automated emails\n# EMAIL_USE_TLS/EMAIL_USE_SSL are mutually exclusive (only set one of those to True)\nEMAIL_USE_TLS=True  # use TLS (secure) connection with the SMTP server\nEMAIL_USE_SSL=False  # use implicit TLS (secure) connection with the SMTP server\n\n# Taiga's RabbitMQ settings - Variables to leave messages for the realtime and asynchronous events\nRABBITMQ_USER=taiga  # user to connect to RabbitMQ\nRABBITMQ_PASS=taiga  # RabbitMQ user's password\nRABBITMQ_VHOST=taiga  # RabbitMQ container name\nRABBITMQ_ERLANG_COOKIE=secret-erlang-cookie  # unique value shared by any connected instance of RabbitMQ\n\n# Taiga's Attachments - Variable to define how long the attachments will be accesible\nATTACHMENTS_MAX_AGE=360  # token expiration date (in seconds)\n\n# Taiga's Telemetry - Variable to enable or disable the anonymous telemetry\nENABLE_TELEMETRY=True\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.01953125,
          "content": "db-data\nstatic-data\n"
        },
        {
          "name": "AUTHORS.rst",
          "type": "blob",
          "size": 1.0654296875,
          "content": "Currently, PRIMARY AUTHORS are:\n\n- Carlos Goce <carlos.goce@revelio.dev>\n- Carlos Letamendia <carlos.letamendia@revelio.dev>\n- David Barragán Merino <dbarragan@dbarragan.com>\n- Daniel Herrero <daniel.herrero@kaleidos.net>\n- Juanfran Alcántara <juanfran.alcantara@kaleidos.net>\n- Miguel González <miguel.gonzalez@revelio.dev>\n- Miryam González <miryam.gonzalez@kaleidos.net>\n- Natacha Menjibar <natacha.menjibar@kaleidos.net>\n- Pablo Ruiz <pablo.ruiz@kaleidos.net>\n- Ramiro Sánchez <ramiro.sanchez@kaleidos.net>\n- Teresa de la Torre <teresa.delatorre@kaleidos.net>\n- Xavi Julian <xavier.julian@kaleidos.net>\n- Yamila Moreno <yamila.moreno@kaleidos.net>\n\nOther previous core team members:\n\n- Alejandro Alonso <alejandro.alonso@kaleidos.net>\n- Alex Hermida <alexhermida@gmail.com>\n- Andrey Antukh <niwi@niwi.nz>\n- Anler Hernández <hello@anler.me>\n- Daniel García <dangarbar@gmail.com>\n- Esther Moreno <esther.moreno@kaleidos.net>\n- Jesus Espino Garcia <jespinog@gmail.com>\n\nSpecial thanks to `Kaleidos Open Source S.L. <https://kaleidos.net/>`_ for providing time for Taiga development.\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 1.6357421875,
          "content": "# Changelog\n\n## 6.8.1 (Unreleased)\n\n- ...\n\n## 6.8.0 (2024-04-03)\n\n- Compatible with Taiga 6.8.0\n\n## 6.7.2 (2024-02-12)\n\n- Add some missed settings (email service and instance domain) to docker-compose-inits.yml\n\n## 6.7.1 (2023-08-08)\n\n- Fixes high CPU peaks for rabbitmq services\n\n## 6.7.0 (2023-06-12)\n\n- Compatible with Taiga 6.7.0\n\n## 6.6.0 (2023-03-06)\n\n- New .env based configuration docker\n- Control services startup based on healthchecks\n- Thanks to @tibroc for adding hostnames to rabbitmq services\n- Thanks to @ralfyang for updating shell scripts to use latest docker version\n\n## 6.5.0 (2022-01-24)\n\n- Compatible with Taiga 6.5.0\n\n## 6.4.0 (2021-09-06)\n\n- Serve Taiga in subpath\n\n## 6.3.0 (2021-08-10)\n\n- Temporary fix specifying latest valid image of RabbitMQ (issue #tg-4700)\n\n## 6.2.2 (2021-07-15)\n\n- Compatible with Taiga 6.2.2\n\n## 6.2.1 (2021-06-22)\n\n- Compatible with Taiga 6.2.1\n\n## 6.2.0 (2021-06-09)\n\n- Compatible with Taiga 6.2.0\n\n## 6.1.1 (2021-05-18)\n\n- Compatible with Taiga 6.1.1\n\n## 6.1.0 (2021-05-04)\n\n- Update github templates\n\n## 6.0.4 (2021-04-06)\n\n- Add named volumes for rabbit services\n- Improve docker configuration with `POSTGRES_PORT`.\n\n## 6.0.3 (2021-02-22)\n\n- Improve docker configuration with `EVENTS_PUSH_BACKEND_URL` and `CELERY_BROKER_URL` variables. Thanks to @ginuerzh.\n- Simplify and improve docker configuration\n\n## 6.0.2 (2021-02-15)\n\nAdd `ENABLE_SLACK`, `ENABLE_GITHUB_AUTH` and `ENABLE_GITLAB_AUTH` environment variables\n\n\n## 6.0.1 (2021-02-08)\n\nAdatp to latest\n\n\n## 6.0.0 (2021-02-02)\n\n### Features\n\n- main `docker-compose.yml` for Taiga installation\n\n- `docker-compose-inits.yml` to run `python manage.py` with docker-compose\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 2.0361328125,
          "content": "# How can I contribute to Taiga?\n\nThank you for your interest in contributing to Taiga. As a contributor, here are the guidelines we would like you to follow. For more information check out our [Taiga community page](https://community.taiga.io/t/how-can-i-contribute/159).\n\n## Code of Conduct\n\nHelp us keep the Taiga Community open and inclusive. Please read and follow our [Code of Conduct](https://www.taiga.io/code-of-conduct).\n\n## Code patches, enhacements\n\nThere are many different ways to contribute to Taiga's platform, from patches, to documentation and enhancements, just find the one that best fits with your skills. Check out our detailed [contribution guide](https://community.taiga.io/t/how-can-i-contribute/159#code-patches-enhacements-3).\n\n## Issues\n\nIf you find a bug in the source code, you can help us by [submitting an issue](https://github.com/taigaio/taiga-docker/issues/new/choose). Even better, you can submit a Pull Request with a fix.\n\n## Commit Message Guidelines\n\nTaiga follows the [conventional commits format](https://www.conventionalcommits.org/en/v1.0.0/).\n\n## Developer Certificate of Origin + License\n\nBy contributing to Kaleidos INC, You accept and agree to the following terms and conditions for Your present and future Contributions submitted to Kaleidos INC Except for the license granted herein to Kaleidos INC and recipients of software distributed by Kaleidos INC, You reserve all right, title, and interest in and to Your Contributions.\n\nAll Contributions are subject to the following DCO + License terms.\n\n[DCO + License](DCOLICENSE)\n\n## Translation\n\nAccess our team of translators with the link below, set up an account in Transifex and start contributing. Join us to make sure your language is covered! [Help Taiga to translate content](https://hosted.weblate.org/projects/taiga/)\n\nLocalization Bugs: Taiga use Weblate to manage the i18n files so don’t submit a pull request to those files (except -en.json). To fix a translation, just access our team of translators, set up an account in the Taiga Weblate project and start contributing.\n"
        },
        {
          "name": "DCOLICENSE",
          "type": "blob",
          "size": 17.4599609375,
          "content": "Developer's Certificate of Origin 1.1\n\nBy making a contribution to this project, I certify that:\n\n(a) The contribution was created in whole or in part by me and I have the right\nto submit it under the open source license indicated in the file; or\n\n(b) The contribution is based upon previous work that, to the best of my\nknowledge, is covered under an appropriate open source license and I have the\nright under that license to submit that work with modifications, whether\ncreated in whole or in part by me, under the same open source license\n(unless I am permitted to submit under a different license), as indicated\nin the file; or\n\n(c) The contribution was provided directly to me by some other person who\ncertified (a), (b) or (c) and I have not modified it.\n\n(d) I understand and agree that this project and the contribution are public\nand that a record of the contribution (including all personal information I\nsubmit with it, including my sign-off) is maintained indefinitely and may be\nredistributed consistent with this project or the open source license(s)\ninvolved.\n\nAll Contributions to this project are licensed under the following license:\n\nMozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in\n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE\nfile in a relevant directory) where a recipient would be likely to look\nfor such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n---------------------------------------------------------\n\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\n  defined by the Mozilla Public License, v. 2.0.\n\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 16.3330078125,
          "content": "Mozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in\n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE\nfile in a relevant directory) where a recipient would be likely to look\nfor such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n---------------------------------------------------------\n\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\n  defined by the Mozilla Public License, v. 2.0.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 19.685546875,
          "content": "# Taiga Docker\n\n| :information_source: | If you're already using taiga-docker, follow this [migration guide](https://docs.taiga.io/upgrades-docker-migrate.html) to use the new `.env` based deployment. |\n|---------------|:----|\n\n> **Note:**\n> You can access the [older docker installation guide](https://docs.taiga.io/setup-production.old.html#setup-prod-with-docker-old) for documentation purposes, intended just for earlier versions of Taiga (prior to ver. 6.6.0)\n\n\n## Getting Started\n\nThis section intends to explain how to get Taiga up and running in a simple two steps, using **docker** and **docker compose**.\n\nIf you don't have docker installed, please follow installation instructions from [docker.com](https://docs.docker.com/engine/install/) (**version 19.03.0+**)\n\nAdditionally, it's necessary to have familiarity with Docker, docker compose and Docker repositories.\n\n> **Note**\n> branch `stable` should be used to deploy Taiga in production and `main` branch for development purposes.\n\n### Start the application\n\n```sh\n$ ./launch-taiga.sh\n```\n\nAfter some instants, when the application is started you can proceed to create the superuser with the following script:\n\n```sh\n$ ./taiga-manage.sh createsuperuser\n```\n\nThe `taiga-manage.sh` script lets launch manage.py commands on the\nback instance:\n\n```sh\n$ ./taiga-manage.sh [COMMAND]\n```\n\nIf you're testing it in your own machine, you can access the application in **http://localhost:9000**. If you're deploying in a server, you'll need to configure hosts and nginx as described later.\n\n![Taiga screenshot](imgs/taiga.jpg)\n\n## Documentation\n\nCurrently, we have authored three main documentation hubs:\n\n- **[API](https://docs.taiga.io/api.html)**: Our API documentation and reference for developing from Taiga API.\n- **[Documentation](https://docs.taiga.io/)**: If you need to install Taiga on your own server, this is the place to find some guides.\n- **[Taiga Community](https://community.taiga.io/)**: This page is intended to be the support reference page for the users.\n\n## Bug reports\n\nIf you **find a bug** in Taiga you can always report it:\n\n- in [Taiga issues](https://tree.taiga.io/project/taiga/issues). **This is the preferred way**\n- in [Github issues](https://github.com/taigaio/taiga-docker/issues)\n- send us a mail to support@taiga.io if is a bug related to [tree.taiga.io](https://tree.taiga.io)\n- send us a mail to security@taiga.io if is a **security bug**\n\nOne of our fellow Taiga developers will search, find and hunt it as soon as possible.\n\nPlease, before reporting a bug, write down how can we reproduce it, your operating system, your browser and version, and if it's possible, a screenshot. Sometimes it takes less time to fix a bug if the developer knows how to find it.\n\n## Community\n\nIf you **need help to setup Taiga**, want to **talk about some cool enhancemnt** or you have **some questions**, please go to [Taiga community](https://community.taiga.io/).\n\nIf you want to be up to date about announcements of releases, important changes and so on, you can subscribe to our newsletter (you will find it by scrolling down at [https://taiga.io](https://www.taiga.io/)) and follow [@taigaio](https://twitter.com/taigaio) on Twitter.\n\n## Contribute to Taiga\n\nThere are many different ways to contribute to Taiga's platform, from patches, to documentation and UI enhancements, just find the one that best fits with your skills. Check out our detailed [contribution guide](https://community.taiga.io/t/how-can-i-contribute/159#code-patches-enhacements-3).\n\n## Code of Conduct\n\nHelp us keep the Taiga Community open and inclusive. Please read and follow our [Code of Conduct](https://github.com/taigaio/code-of-conduct/blob/main/CODE_OF_CONDUCT.md).\n\n## License\n\nEvery code patch accepted in Taiga codebase is licensed under [MPL 2.0](LICENSE). You must be careful to not include any code that can not be licensed under this license.\n\nPlease read carefully [our license](LICENSE) and ask us if you have any questions as well as the [Contribution policy](https://github.com/taigaio/taiga-docker/blob/main/CONTRIBUTING.md).\n\n## Configuration\n\nWe've exposed the **Basic configuration** settings in Taiga to an `.env` file. We strongly recommend you to change it, or at least review its content, to avoid using the default values.\n\nBoth `docker-compose.yml` and `docker-compose-inits.yml` will read from this file to populate their environment variables, so, initially you don't need to change them. Edit these files just in case you require to enable **Additional customization**, or an **Advanced configuration**.\n\nRefer to these sections for further information.\n\n## Basic Configuration\n\nYou will find basic **configuration variables** in the `.env` file. As stated before, we encourage you to edit these values, especially those affecting the security.\n\n### Database settings\n\nThese vars are used to create the database for Taiga and connect to it.\n\n```bash\nPOSTGRES_USER=taiga  # user to connect to PostgreSQL\nPOSTGRES_PASSWORD=taiga  # database user's password\n```\n\n### URLs settings\n\nThese vars set where your Taiga instance should be served, and the security protocols to use in the communication layer.\n\n```bash\nTAIGA_SCHEME=http  # serve Taiga using \"http\" or \"https\" (secured) connection\nTAIGA_DOMAIN=localhost:9000  # Taiga's base URL\nSUBPATH=\"\"  # it'll be appended to the TAIGA_DOMAIN (use either \"\" or a \"/subpath\")\nWEBSOCKETS_SCHEME=ws  # events connection protocol (use either \"ws\" or \"wss\")\n```\n\nThe default configuration assumes Taiga is being served in a **subdomain**. For example:\n\n```bash\nTAIGA_SCHEME=https\nTAIGA_DOMAIN=taiga.mycompany.com\nSUBPATH=\"\"\nWEBSOCKETS_SCHEME=wss\n```\n\nIf Taiga is being served in a **subpath**, instead of a subdomain, the configuration should be something like this:\n\n```bash\nTAIGA_SCHEME=https\nTAIGA_DOMAIN=mycompany.com\nSUBPATH=\"/taiga\"\nWEBSOCKETS_SCHEME=wss\n```\n\n### Secret Key settings\n\nThis variable allows you to set the secret key in Taiga, used in the cryptographic signing.\n\n```bash\nSECRET_KEY=\"taiga-secret-key\"  # Please, change it to an unpredictable value!\n```\n\n### Email Settings\n\nBy default, emails will be printed in the standard output (`EMAIL_BACKEND=console`). If you have your own SMTP service, change it to `EMAIL_BACKEND=smtp` and configure the rest of these variables with the values supplied by your SMTP provider:\n\n```bash\nEMAIL_BACKEND=console  # use an SMTP server or display the emails in the console (either \"smtp\" or \"console\")\nEMAIL_HOST=smtp.host.example.com  # SMTP server address\nEMAIL_PORT=587   # default SMTP port\nEMAIL_HOST_USER=user  # user to connect the SMTP server\nEMAIL_HOST_PASSWORD=password  # SMTP user's password\nEMAIL_DEFAULT_FROM=changeme@example.com  # email address for the automated emails\n\n# EMAIL_USE_TLS/EMAIL_USE_SSL are mutually exclusive (only set one of those to True)\nEMAIL_USE_TLS=True  # use TLS (secure) connection with the SMTP server\nEMAIL_USE_SSL=False  # use implicit TLS (secure) connection with the SMTP server\n```\n\n### Queue manager settings\n\nThese variables are used to leave messages in the rabbitmq services.\n\n```bash\nRABBITMQ_USER=taiga  # user to connect to RabbitMQ\nRABBITMQ_PASS=taiga  # RabbitMQ user's password\nRABBITMQ_VHOST=taiga  # RabbitMQ container name\nRABBITMQ_ERLANG_COOKIE=secret-erlang-cookie  # unique value shared by any connected instance of RabbitMQ\n```\n\n### Attachments settings\n\nYou can configure how long the attachments will be accessible by changing the token expiration timer. After that amount of seconds the token will expire, but you can always get a new attachment url with an active token.\n\n```bash\nATTACHMENTS_MAX_AGE=360  # token expiration date (in seconds)\n```\n\n### Telemetry Settings\n\nTelemetry anonymous data is collected in order to learn about the use of Taiga and improve the platform based on real scenarios. You may want to enable this to help us shape future Taiga.\n\n```bash\nENABLE_TELEMETRY=True\n```\n\nYou can opt out by setting this variable to False. By default, it's True.\n\n## Additional customization\n\nAll these customization options are by default disabled and require you to edit `docker-compose.yml`.\n\nYou should add the corresponding environment variables in the proper services (or in `&default-back-environment` group) with a valid value in order to enable them. Please, do not modify it unless you know what you’re doing.\n\n### Session cookies in Django Admin\n\nTaiga doesn't use session cookies in its API as it stateless. However, the Django Admin (`/admin/`) uses session cookie for authentication. By default, Taiga is configured to work behind HTTPS. If you're using HTTP (despite the strong recommendations against it), you'll need to configure the following environment variables so you can access the Admin:\n\nAdd to `&default-back-environment` environments\n```yml\nSESSION_COOKIE_SECURE: \"False\"\nCSRF_COOKIE_SECURE: \"False\"\n```\n\nMore info about those variables can be found [here](https://docs.djangoproject.com/en/3.1/ref/settings/#csrf-cookie-secure).\n\n### Public registration\n\nPublic registration is disabled by default. If you want to allow a public register, you have to enable public registration on both, frontend and backend.\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\n\nAdd to `&default-back-environment` environments\n```yml\nPUBLIC_REGISTER_ENABLED: \"True\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nPUBLIC_REGISTER_ENABLED: \"true\"\n```\n\n> **Important**:\n>\n> Taiga (in its default configuration) disables both Gitlab or Github oauth buttons whenever the public registration option hasn't been activated. To be able to use Github/Gitlab login/registration, make sure you have public registration activated on your Taiga instance.\n\n### GitHub OAuth login\n\nUsed for login with Github. This feature is disabled by default.\n\nFollow the documentation ([GitHub - Creating an OAuth App](https://docs.github.com/en/apps/oauth-apps/building-oauth-apps/creating-an-oauth-app)) in Github, when save application Github displays the ID and Secret.\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\n> **Note**\n> `GITHUB_API_CLIENT_ID / GITHUB_CLIENT_ID` should have the same value.\n\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_GITHUB_AUTH: \"True\"\nGITHUB_API_CLIENT_ID: \"github-client-id\"\nGITHUB_API_CLIENT_SECRET: \"github-client-secret\"\nPUBLIC_REGISTER_ENABLED: \"True\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_GITHUB_AUTH: \"true\"\nGITHUB_CLIENT_ID: \"github-client-id\"\nPUBLIC_REGISTER_ENABLED: \"true\"\n````\n\n### Gitlab OAuth login\n\nUsed for login with GitLab. This feature is disabled by default.\n\nFollow the documentation ([Configure GitLab as an OAuth 2.0 authentication identity provider](https://docs.gitlab.com/ee/integration/oauth_provider.html)) in Gitlab to get the _gitlab-client-id_ and the _gitlab-client-secret_.\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\n> **Note**\n> `GITLAB_API_CLIENT_ID / GITLAB_CLIENT_ID` and `GITLAB_URL` should have the same value.\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_GITLAB_AUTH: \"True\"\nGITLAB_API_CLIENT_ID: \"gitlab-client-id\"\nGITLAB_API_CLIENT_SECRET: \"gitlab-client-secret\"\nGITLAB_URL: \"gitlab-url\"\nPUBLIC_REGISTER_ENABLED: \"True\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_GITLAB_AUTH: \"true\"\nGITLAB_CLIENT_ID: \"gitlab-client-id\"\nGITLAB_URL: \"gitlab-url\"\nPUBLIC_REGISTER_ENABLED: \"true\"\n```\n\n### Slack integration\n\nEnable Slack integration in your Taiga instance. This feature is disabled by default.\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_SLACK: \"True\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_SLACK: \"true\"\n```\n\n### GitHub importer\n\nActivating this feature, you will be able to import projects from GitHub.\n\nFollow this documentation ([GitHub - Creating an OAuth App](https://docs.github.com/en/apps/oauth-apps/building-oauth-apps/creating-an-oauth-app)) to obtain the _client id_ and the _client secret_ from GitHun.\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_GITHUB_IMPORTER: \"True\"\nGITHUB_IMPORTER_CLIENT_ID: \"client-id-from-github\"\nGITHUB_IMPORTER_CLIENT_SECRET: \"client-secret-from-github\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_GITHUB_IMPORTER: \"true\"\n```\n\n### Jira Importer\n\nActivating this feature, you will be able to import projects from Jira.\n\nFollow this documentation ([Jira - OAuth 1.0a for REST APIs](https://developer.atlassian.com/cloud/jira/platform/jira-rest-api-oauth-authentication/)) to obtain the _consumer key_ and the _public/private certificate key_.\n\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_JIRA_IMPORTER: \"True\"\nJIRA_IMPORTER_CONSUMER_KEY: \"consumer-key-from-jira\"\nJIRA_IMPORTER_CERT: \"cert-from-jira\"\nJIRA_IMPORTER_PUB_CERT: \"pub-cert-from-jira\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_JIRA_IMPORTER: \"true\"\n```\n\n### Trello importer\n\nActivating this feature, you will be able to import projects from Trello.\n\nFor configure Trello, you have two options:\n- go to [https://trello.com/app-key](https://trello.com/app-key) (you must login first) and obtaing your development _API key_ and your _secret key_.\n- or with the new method, [create a new Power-Up](https://developer.atlassian.com/cloud/trello/guides/rest-api/api-introduction/#managing-your-api-key) and generate an _API key_ and a _secret key_\n\n> **Note**\n> Be careful with the upper and lower case in these settiings. We will use 'True' for the backend and 'true' for the frontend (this is not a typo, otherwise it won't work).\n\nAdd to `&default-back-environment` environments\n```yml\nENABLE_TRELLO_IMPORTER: \"True\"\nTRELLO_IMPORTER_API_KEY: \"api-key-from-trello\"\nTRELLO_IMPORTER_SECRET_KEY: \"secret-key-from-trello\"\n```\n\nAdd to `taiga-front` service environments\n```yml\nENABLE_TRELLO_IMPORTER: \"true\"\n```\n\n## Advanced configuration\n\nThe advanced configuration **will ignore** the environment variables in `docker-compose.yml` or `docker-compose-inits.yml`. Skip this section if you're using env vars.\n\nIt requires you to map the configuration files of `taiga-back` and `taiga-front` services to local files in order to unlock further configuration options.\n\n**Map a `config.py` file**\n\nFrom [taiga-back](https://github.com/taigaio/taiga-back) download the file `settings/config.py.prod.example` and rename it:\n\n```bash\nmv settings/config.py.prod.example settings/config.py\n```\n\nEdit `config.py` with your own configuration:\n\n- Taiga secret key: **it's important** to change it. It must have the same value as the secret key in `taiga-events` and `taiga-protected`\n- Taiga urls: configure where Taiga would be served using `TAIGA_URL`, `SITES` and `FORCE_SCRIPT_NAME` (see examples below)\n- Connection to PostgreSQL; check `DATABASES` section in the file\n- Connection to RabbitMQ for `taiga-events`; check \"EVENTS\" section in the file\n- Connection to RabbitMQ for `taiga-async`; check \"TAIGA ASYNC\" section in the file\n- Credentials for email; check \"EMAIL\" section in the file\n- Enable/disable anonymous telemetry; check \"TELEMETRY\" section in the file\n\nExample to configure Taiga in **subdomain**:\n```python\nTAIGA_SITES_SCHEME = \"https\"\nTAIGA_SITES_DOMAIN = \"taiga.mycompany.com\"\nFORCE_SCRIPT_NAME = \"\"\n```\n\nExample to configure Taiga in **subpath**:\n```python\nTAIGA_SITES_SCHEME = \"https\"\nTAIGA_SITES_DOMAIN = \"taiga.mycompany.com\"\nFORCE_SCRIPT_NAME = \"/taiga\"\n```\n\nCheck as well the rest of the configuration if you need to enable some advanced features.\n\nMap the file into `/taiga-back/settings/config.py`. Have in mind that you have to map it both in `docker-compose.yml` and `docker-compose-inits.yml`. You can check the `x-volumes` section in docker-compose.yml with an example.\n\n**Map a `conf.json` file**\n\nFrom [taiga-front](https://github.com/taigaio/taiga-front) download the file `dist/conf.example.json` and rename it:\n\n```bash\nmv dist/conf.example.json dist/conf.json\n```\n\nEdit it with your own configuration:\n\n- Taiga urls: configure where Taiga would be served using `api`, `eventsUrl` and `baseHref` (see examples below)\n\nExample of `conf.json` to serve Taiga in a **subdomain**:\n```json\n{\n    \"api\": \"https://taiga.mycompany.com/api/v1/\",\n    \"eventsUrl\": \"wss://taiga.mycompany.com/events\",\n    \"baseHref\": \"/\",\n```\n\nExample of `conf.json` to serve Taiga in **subpath**:\n```json\n{\n    \"api\": \"https://mycompany.com/taiga/api/v1/\",\n    \"eventsUrl\": \"wss://mycompany.com/taiga/events\",\n    \"baseHref\": \"/taiga/\",\n```\n\nCheck as well the rest of the configuration if you need to enable some advanced features.\n\nMap the file into `/taiga-front/dist/config.py`.\n\n## Configure an admin user\n\n```bash\n$ docker compose up -d\n\n$ docker compose -f docker-compose.yml -f docker-compose-inits.yml run --rm taiga-manage createsuperuser\n```\n\n## Up and running\n\nOnce everything has been installed, launch all the services and check the result:\n\n```bash\n$ docker compose up -d\n```\n\n## Configure the proxy\n\nYour host configuration needs to make a proxy to `http://localhost:9000`.\n\nIf Taiga is being served in a **subdomain**:\n```\n  server {\n      server_name taiga.mycompany.com;\n\n      location / {\n        proxy_set_header Host $http_host;\n        proxy_set_header X-Real-IP $remote_addr;\n        proxy_set_header X-Scheme $scheme;\n        proxy_set_header X-Forwarded-Proto $scheme;\n        proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n        proxy_redirect off;\n        proxy_pass http://localhost:9000/;\n      }\n\n      # Events\n      location /events {\n        proxy_pass http://localhost:9000/events;\n        proxy_http_version 1.1;\n        proxy_set_header Upgrade $http_upgrade;\n        proxy_set_header Connection \"upgrade\";\n        proxy_set_header Host $host;\n        proxy_connect_timeout 7d;\n        proxy_send_timeout 7d;\n        proxy_read_timeout 7d;\n      }\n\n      # TLS: Configure your TLS following the best practices inside your company\n      # Logs and other configurations\n  }\n```\n\nIf Taiga is being served in a **subpath** instead of a subdomain, the configuration should be something like:\n```\nserver {\n  server_name mycompany.com;\n\n  location /taiga/ {\n    proxy_set_header Host $http_host;\n    proxy_set_header X-Real-IP $remote_addr;\n    proxy_set_header X-Scheme $scheme;\n    proxy_set_header X-Forwarded-Proto $scheme;\n    proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;\n    proxy_redirect off;\n    proxy_pass http://localhost:9000/;\n  }\n\n  # Events\n  location /taiga/events {\n    proxy_pass http://localhost:9000/events;\n    proxy_http_version 1.1;\n    proxy_set_header Upgrade $http_upgrade;\n    proxy_set_header Connection \"upgrade\";\n    proxy_set_header Host $host;\n    proxy_connect_timeout 7d;\n    proxy_send_timeout 7d;\n    proxy_read_timeout 7d;\n  }\n\n  # TLS: Configure your TLS following the best practices inside your company\n  # Logs and other configurations\n}\n```\n\n## Change between subpath and subdomain\n\nIf you're changing Taiga configuration from default subdomain (https://taiga.mycompany.com) to subpath (http://mycompany.com/subpath) or vice versa, on top of adjusting the configuration as said above, you should consider changing the TAIGA_SECRET_KEY so the refresh works properly for the end user.\n"
        },
        {
          "name": "VERSION.md",
          "type": "blob",
          "size": 0.005859375,
          "content": "6.8.0\n"
        },
        {
          "name": "docker-compose-inits.yml",
          "type": "blob",
          "size": 1.1240234375,
          "content": "version: \"3.5\"\n\nx-environment:\n  &default-back-environment\n  POSTGRES_DB: \"taiga\"\n  POSTGRES_USER: \"${POSTGRES_USER}\"\n  POSTGRES_PASSWORD: \"${POSTGRES_PASSWORD}\"\n  POSTGRES_HOST: \"taiga-db\"\n\n  TAIGA_SECRET_KEY: \"${SECRET_KEY}\"\n  TAIGA_SITES_SCHEME: \"${TAIGA_SCHEME}\"\n  TAIGA_SITES_DOMAIN: \"${TAIGA_DOMAIN}\"\n\n  EMAIL_BACKEND: \"django.core.mail.backends.${EMAIL_BACKEND}.EmailBackend\"\n  DEFAULT_FROM_EMAIL: \"${EMAIL_DEFAULT_FROM}\"\n  EMAIL_USE_TLS: \"${EMAIL_USE_TLS}\"\n  EMAIL_USE_SSL: \"${EMAIL_USE_SSL}\"\n  EMAIL_HOST: \"${EMAIL_HOST}\"\n  EMAIL_PORT: \"${EMAIL_PORT}\"\n  EMAIL_HOST_USER: \"${EMAIL_HOST_USER}\"\n  EMAIL_HOST_PASSWORD: \"${EMAIL_HOST_PASSWORD}\"\n\n  RABBITMQ_USER: \"${RABBITMQ_USER}\"\n  RABBITMQ_PASS: \"${RABBITMQ_PASS}\"\n  CELERY_ENABLED: \"False\"\n\nx-volumes:\n  &default-back-volumes\n  - taiga-static-data:/taiga-back/static\n  - taiga-media-data:/taiga-back/media\n  # - ./config.py:/taiga-back/settings/config.py\n\nservices:\n  taiga-manage:\n    image: taigaio/taiga-back:latest\n    environment: *default-back-environment\n    depends_on:\n      - taiga-db\n    entrypoint: \"python manage.py\"\n    volumes: *default-back-volumes\n    networks:\n      - taiga\n"
        },
        {
          "name": "docker-compose.yml",
          "type": "blob",
          "size": 4.4833984375,
          "content": "version: \"3.5\"\n\nx-environment:\n  &default-back-environment\n  # These environment variables will be used by taiga-back and taiga-async.\n  # Database settings\n  POSTGRES_DB: \"taiga\"\n  POSTGRES_USER: \"${POSTGRES_USER}\"\n  POSTGRES_PASSWORD: \"${POSTGRES_PASSWORD}\"\n  POSTGRES_HOST: \"taiga-db\"\n  # Taiga settings\n  TAIGA_SECRET_KEY: \"${SECRET_KEY}\"\n  TAIGA_SITES_SCHEME: \"${TAIGA_SCHEME}\"\n  TAIGA_SITES_DOMAIN: \"${TAIGA_DOMAIN}\"\n  TAIGA_SUBPATH: \"${SUBPATH}\"\n  # Email settings.\n  EMAIL_BACKEND: \"django.core.mail.backends.${EMAIL_BACKEND}.EmailBackend\"\n  DEFAULT_FROM_EMAIL: \"${EMAIL_DEFAULT_FROM}\"\n  EMAIL_USE_TLS: \"${EMAIL_USE_TLS}\"\n  EMAIL_USE_SSL: \"${EMAIL_USE_SSL}\"\n  EMAIL_HOST: \"${EMAIL_HOST}\"\n  EMAIL_PORT: \"${EMAIL_PORT}\"\n  EMAIL_HOST_USER: \"${EMAIL_HOST_USER}\"\n  EMAIL_HOST_PASSWORD: \"${EMAIL_HOST_PASSWORD}\"\n  # Rabbitmq settings\n  RABBITMQ_USER: \"${RABBITMQ_USER}\"\n  RABBITMQ_PASS: \"${RABBITMQ_PASS}\"\n  # Telemetry settings\n  ENABLE_TELEMETRY: \"${ENABLE_TELEMETRY}\"\n  # ...your customizations go here\n\nx-volumes:\n  &default-back-volumes\n  # These volumens will be used by taiga-back and taiga-async.\n  - taiga-static-data:/taiga-back/static\n  - taiga-media-data:/taiga-back/media\n  # - ./config.py:/taiga-back/settings/config.py\n\nservices:\n  taiga-db:\n    image: postgres:12.3\n    environment:\n      POSTGRES_DB: \"taiga\"\n      POSTGRES_USER: \"${POSTGRES_USER}\"\n      POSTGRES_PASSWORD: \"${POSTGRES_PASSWORD}\"\n    healthcheck:\n      test: [\"CMD-SHELL\", \"pg_isready -U ${POSTGRES_USER}\"]\n      interval: 2s\n      timeout: 15s\n      retries: 5\n      start_period: 3s\n    volumes:\n      - taiga-db-data:/var/lib/postgresql/data\n    networks:\n      - taiga\n\n  taiga-back:\n    image: taigaio/taiga-back:latest\n    environment: *default-back-environment\n    volumes: *default-back-volumes\n    networks:\n      - taiga\n    depends_on:\n      taiga-db:\n        condition: service_healthy\n      taiga-events-rabbitmq:\n        condition: service_started\n      taiga-async-rabbitmq:\n        condition: service_started\n\n  taiga-async:\n    image: taigaio/taiga-back:latest\n    entrypoint: [\"/taiga-back/docker/async_entrypoint.sh\"]\n    environment: *default-back-environment\n    volumes: *default-back-volumes\n    networks:\n      - taiga\n    depends_on:\n      taiga-db:\n        condition: service_healthy\n      taiga-events-rabbitmq:\n        condition: service_started\n      taiga-async-rabbitmq:\n        condition: service_started\n\n  taiga-async-rabbitmq:\n    image: rabbitmq:3.8-management-alpine\n    environment:\n      RABBITMQ_ERLANG_COOKIE: \"${RABBITMQ_ERLANG_COOKIE}\"\n      RABBITMQ_DEFAULT_USER: \"${RABBITMQ_USER}\"\n      RABBITMQ_DEFAULT_PASS: \"${RABBITMQ_PASS}\"\n      RABBITMQ_DEFAULT_VHOST: \"${RABBITMQ_VHOST}\"\n    hostname: \"taiga-async-rabbitmq\"\n    volumes:\n      - taiga-async-rabbitmq-data:/var/lib/rabbitmq\n    networks:\n      - taiga\n\n  taiga-front:\n    image: taigaio/taiga-front:latest\n    environment:\n      TAIGA_URL: \"${TAIGA_SCHEME}://${TAIGA_DOMAIN}\"\n      TAIGA_WEBSOCKETS_URL: \"${WEBSOCKETS_SCHEME}://${TAIGA_DOMAIN}\"\n      TAIGA_SUBPATH: \"${SUBPATH}\"\n      # ...your customizations go here\n    networks:\n      - taiga\n    # volumes:\n    #   - ./conf.json:/usr/share/nginx/html/conf.json\n\n  taiga-events:\n    image: taigaio/taiga-events:latest\n    environment:\n      RABBITMQ_USER: \"${RABBITMQ_USER}\"\n      RABBITMQ_PASS: \"${RABBITMQ_PASS}\"\n      TAIGA_SECRET_KEY: \"${SECRET_KEY}\"\n    networks:\n      - taiga\n    depends_on:\n      taiga-events-rabbitmq:\n        condition: service_started\n\n  taiga-events-rabbitmq:\n    image: rabbitmq:3.8-management-alpine\n    environment:\n      RABBITMQ_ERLANG_COOKIE: \"${RABBITMQ_ERLANG_COOKIE}\"\n      RABBITMQ_DEFAULT_USER: \"${RABBITMQ_USER}\"\n      RABBITMQ_DEFAULT_PASS: \"${RABBITMQ_PASS}\"\n      RABBITMQ_DEFAULT_VHOST: \"${RABBITMQ_VHOST}\"\n    hostname: \"taiga-events-rabbitmq\"\n    volumes:\n      - taiga-events-rabbitmq-data:/var/lib/rabbitmq\n    networks:\n      - taiga\n\n  taiga-protected:\n    image: taigaio/taiga-protected:latest\n    environment:\n      MAX_AGE: \"${ATTACHMENTS_MAX_AGE}\"\n      SECRET_KEY: \"${SECRET_KEY}\"\n    networks:\n      - taiga\n\n  taiga-gateway:\n    image: nginx:1.19-alpine\n    ports:\n      - \"9000:80\"\n    volumes:\n      - ./taiga-gateway/taiga.conf:/etc/nginx/conf.d/default.conf\n      - taiga-static-data:/taiga/static\n      - taiga-media-data:/taiga/media\n    networks:\n      - taiga\n    depends_on:\n      - taiga-front\n      - taiga-back\n      - taiga-events\n\nvolumes:\n  taiga-static-data:\n  taiga-media-data:\n  taiga-db-data:\n  taiga-async-rabbitmq-data:\n  taiga-events-rabbitmq-data:\n\nnetworks:\n  taiga:\n"
        },
        {
          "name": "imgs",
          "type": "tree",
          "content": null
        },
        {
          "name": "launch-taiga.sh",
          "type": "blob",
          "size": 0.3134765625,
          "content": "#!/usr/bin/env sh\n\n# This Source Code Form is subject to the terms of the Mozilla Public\n# License, v. 2.0. If a copy of the MPL was not distributed with this\n# file, You can obtain one at http://mozilla.org/MPL/2.0/.\n#\n# Copyright (c) 2021-present Kaleidos INC\n\nset -x\nexec docker compose -f docker-compose.yml up -d $@\n"
        },
        {
          "name": "taiga-gateway",
          "type": "tree",
          "content": null
        },
        {
          "name": "taiga-manage.sh",
          "type": "blob",
          "size": 0.3564453125,
          "content": "#!/usr/bin/env sh\n\n# This Source Code Form is subject to the terms of the Mozilla Public\n# License, v. 2.0. If a copy of the MPL was not distributed with this\n# file, You can obtain one at http://mozilla.org/MPL/2.0/.\n#\n# Copyright (c) 2021-present Kaleidos INC\n\nset -x\nexec docker compose -f docker-compose.yml -f docker-compose-inits.yml run --rm taiga-manage $@\n"
        }
      ]
    }
  ]
}