{
  "metadata": {
    "timestamp": 1736568207388,
    "page": 53,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjYw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "hendricius/the-bread-code",
      "stars": 4081,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".aspell.en.prepl",
          "type": "blob",
          "size": 0.0673828125,
          "content": "personal_repl-1.1 en 0 \nrepo repository\nsourdoughsourdough sourdough\n"
        },
        {
          "name": ".aspell.en.pws",
          "type": "blob",
          "size": 0.1396484375,
          "content": "personal_ws-1.1 en 16 \nportuguese\nryish\ntldr\nKitchenAid\nmd\nbroa\nbavarian\nspelt\nacrylamides\nfaq\nTODO\nAutolyse\ngerman\ndoughs\nbanneton\nautolysing\n"
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.013671875,
          "content": "*.bak\n.vscode\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.052734375,
          "content": "MIT License\n\nCopyright (c) 2018 Hendrik Kleinwaechter\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.0478515625,
          "content": "![logotype b](./images/logo/logotype_b.png)\n# Cracking The Bread Code\n\nDEPRECATED. Please see [the sourdough framework](https://github.com/hendricius/the-sourdough-framework) for\na complete rewrite.\n\nLearn how to master the art of baking the programmer way.\nIf you love programming, you will also enjoy breaking some bread.\nA/B test, iterate and ultimately become a self-taught baker.\nThis repository is dedicated to becoming your bread manifesto with\nuseful tricks and hacks. Furthermore, the goal is to illustrate\nhow easy making bread is and that you can get started\ntoday without expensive tools.\n\nThis repository is still work in progress and will be updated continuously.\nFeel free open up issues when facing problems. Pull-requests with custom\nrecipes are welcome too! Happy baking.\n\n[![A sourdough bread about to be inhaled 🤣](/images/last-sourdough-recipe-1.jpg)](/images/last-sourdough-recipe-1.jpg)\n\n## Yeast based bread\n\nYeast is the easiest way to get started baking bread. You can use either dry yeast or fresh yeast.\nYeast ferments your dough by converting parts of the dough into gas. This gas inflates your dough.\n\n* [Basic bread](recipes/savory/basic-bread.md)\n* [Banana bread](recipes/sweet/banana-bread.md)\n* [Burger buns](recipes/savory/burger-buns.md)\n\n## Sourdough based bread\n\nSourdough bread is an all natural bread without any added yeast.\nThe dough gives the bread an amazing, you guessed it, sour taste.\nAny yeast bread can also be made with sourdough instead of yeast.\n\nAll of those recipes assume that you have made your own sourdough starter. The\nprocess takes approximately 7 days to complete:\n\n* [Make your own sourdough starter](recipes/sourdough/make-sourdough-starter.md)\n\nOnce you have your sourdough starter you can proceed with the next recipes.\n\n* [Basic sourdough bread](recipes/sourdough/basic-sour-dough.md)\n* [Portuguese inspired Broa corn bread](recipes/sourdough/portuguese-broa-corn-bread.md)\n* [Mischbrot aka. Graubrot](recipes/sourdough/mischbrot-aka-graubrot.md)\n* [Franconian bread](recipes/sourdough/franconian-bread.md)\n* [Sourdough Pizza](recipes/sourdough/sourdough-pizza.md)\n* [Sourdough Pasta](recipes/sourdough/sourdough-pasta.md)\n* [Sourdough Sandwich Loaf](recipes/sourdough/sourdough-sandwich.md)\n\n## Common Problems / FAQ\n\n[See the guide Common problems / FAQ](basics/common-problems-faq.md) for strategies to deal with frequent pitfalls that arise when baking.\n\n## Experiments\n\nThis section contains experiments where N breads are baked with only one\nparameter change each. This helps to visualize what impact a change of a single \nparameter has on the final product. Feel free to submit your own experiments as a PR.\nThe more experiments there the merrier.\n\n* [Different hydration levels on yeast bread](experiments/different-hydration-levels.md)\n* [Proofing Sourdough at room temperature for 3 hours vs. 10 hours fridge](experiments/proofing-sourdough-3-hours-room-temperature-vs-10-hours-fridge.md)\n* [Oiled loaf pan vs. parchment papered loaf pan](experiments/parchment-paper-vs-oiled-loaf-pan.md)\n\nIdeas for custom experiments? Please make a PR and share them.\n\n## Tools\n\n* [Which tools should you buy for baking?](basics/tools.md) Busting some of the tooling myths here. TLDR - you don't need any tools except a bowl and heat source.\n\n## Motivation\n\nHave you ever relished the taste of a fresh and warm bread with a crispy crust?\nDo you know the sound of the crispy crust when you take a bite?\nHave you ever experienced the delicious and homey scent of a bread coming right out of the oven?\n\nWhen baking bread, you experience a whole variety of emotions and sensations.\nFurthermore, you step into a world where simplicity can become very complex.\nHowever, reaching perfection is amazing! The feeling of having crafted\na perfect combination of all natural ingredients is unique and so special.\nI say “a perfect combination”, not “_the_ perfect combination” because\nthat is the secret. There is no such thing as the perfect bread.\nThere are so many different possibilities, combinations,\ningredients, parameters — every bread is unique!\n\nBeing a programmer myself, I lacked scientific resources on the internet.\nIn my daytime job, we use A/B testing for almost everything.\nWhy not apply the same proven methodologies to baking?\n\nAll the recipes I provide have been A/B tested by myself with different variations.\nI encourage you to do the same. Try to recreate the same bread with only one\nparameter changing at the time. That way you can iterate to find your personal\npreferred bread combination. Make notes and log all the different types\nbread you made. Slowly, bread by bread you will become better.\n\nYou will fail, in fact, you will fail often.\nWith every fail, ask yourself what you could have done better.\nThat's how I have learned and still learn with every bread I bake.\nThat's what I call `The Bread Code`. I hope this repository motivates people\naround the world to try and become better bakers.\n\n## Links\n\n* [YouTube Account](https://www.youtube.com/c/TheBreadCode)\n* [Reddit](https://www.reddit.com/user/the_bread_code)\n* [Instagram](https://instagram.com/the_bread_code)\n"
        },
        {
          "name": "aspell-check-all.sh",
          "type": "blob",
          "size": 0.06640625,
          "content": "#!/bin/bash\n\nfor f in **/*.md; do\n\taspell --home-dir=. check $f\ndone"
        },
        {
          "name": "basics",
          "type": "tree",
          "content": null
        },
        {
          "name": "experiments",
          "type": "tree",
          "content": null
        },
        {
          "name": "images",
          "type": "tree",
          "content": null
        },
        {
          "name": "recipes",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}