{
  "metadata": {
    "timestamp": 1736568360317,
    "page": 288,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI5MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "LCTT/TranslateProject",
      "stars": 2285,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.06640625,
          "content": "*.md~\nmembers.md\n*.html\n*.bak\n.DS_Store\nsources/*/.*\ntranslated/*/.*"
        },
        {
          "name": "Dict.md",
          "type": "blob",
          "size": 5.66015625,
          "content": "LCTT 术语词典\n======\n\n本文收录了 LCTT 自创和选用的翻译词汇。\n\n为什么要自创翻译词汇？在翻译过程中，我们发现一些非缩写的英语术语沿袭使用了英语单词/短语，而没有得体的、公认的、正式的对应中文翻译。我们认为，中英文混杂是对原生语言的一种污染（英文缩写除外，这是为了减少冗长的语句），按照本地化的宗旨，应该对这些词汇进行翻译，并在必要时创造新的词汇。故此，我们在几年的翻译中，逐渐推敲和形成了一些新的译法，并在我们翻译的文章中使用和推广。\n\n对这些译法，我们尽量遵循“信达雅”的原则。但鉴于水平所及，肯定会有所不足，虽然也有不断的调整和改进，但仍希望得到大家的反馈和指正。\n\n我们采用的方法是：\n\n- 音似：中文读音近似于英文原词\n- 意近：中文字的意思接近英文原意\n- 组词：根据上述两条组成新的词汇，以避免和原有词汇混淆\n\n此外，需要说明的是，有些译法可能已经被其他人在别的地方更早提出，但限于我们的学识和搜索能力，并未发现和了解到，并非我们故意剽窃。\n\n顺便说一句，2014 年对 “Shebang”（`#!`）一词翻译时，来自于 LCTT 早期重要贡献者 GOLinux 提出的 “[释伴](https://linux.cn/article-3664-1.html)” 译法，是我们第一次创造新的翻译词汇，也是我们形成这样的想法的起点。\n\n除了自创的翻译词汇外，这里还收录了一些选用的翻译词汇。有一些词汇存在多种译法，我们在翻译和使用过程中，采用了某个译法，在此列出以保持一致。\n\n### F\n\n#### Fork：复刻\n\nFork 行为/操作广泛用于进程管理、版本管理和软件衍生方面。此词汇也长期缺乏确定的译法。\n\n此前，提议者对 Fork 给出了 “复刻” 的译法。基本意思是，根据上游/父本复制一份，然后在此基础上进行修改，从而形成“衍生品”。\n\n有趣的是，我们发现 GitHub 的 [部分中文文档](https://docs.github.com/zh/actions/managing-workflow-runs/approving-workflow-runs-from-public-forks) 中也采用了此译法，不知道是不是受到了我们的影响。\n\n- 提议者：wxy\n- 首次链接：https://linux.cn/article-7877-1.html\n\n### L\n\n#### Live：立付\n\nLive 原意多指“现场”、“实时”，在计算机环境中使用时也多引用此意。但对它的翻译就颇费神，因为无论是在 Live Patch，还是更多见的 Live USB/CD、Live Session，其实都不好翻译为“现场”、“实时”。\n\n提议者之前曾经尝试创造了新的“[临场](https://linux.cn/article-12854-1.html)”词汇，但是感觉有些不够达意。经过推敲，提议者再次推荐使用“立付”，在照顾发音的同时，取其“立时交付”之意。这样，Live USB/CD 可以译做 “立付 USB/CD”，Live Session 可以译做 “立付会话”。\n\n而对于 Live Stream，提议者建议依旧翻译为“直播”、“实时流”。对于 Live Patch，还是采用 “热补丁” 这样的意译。\n\n- 提议者：wxy\n- 首次链接（临场）：https://linux.cn/article-12854-1.html\n- 首次链接（立付）：https://linux.cn/article-15499-1.html\n\n### P\n\n#### Pod：容器荚\n\n在容器环境中使用 Pod 来代表一组容器。最初，我根据 Kubernetes 中大量采用了航海相关的比喻，而将其译为“吊舱”。但根据 Kubernetes [文档](https://kubernetes.io/docs/concepts/workloads/pods/#:~:text=A%20Pod%20(as%20in%20a,run%20in%20a%20shared%20context.)，其来自对 “<ruby>鲸鱼荚<rt>Pod of Whales</rt></ruby>”、“<ruby>豌豆荚<rt>pea pod</rt></ruby>” 的比喻。因此这个词翻译为“容器荚”。也有有将其翻译为“容器组”。\n\n- 提议者：wxy\n- 首次链接：https://linux.cn/article-14591-1.html\n\n### R\n\n#### Repo/Repository：代码仓库、软件仓库\n\nRepository 主要用于两个场景，一个是用于版本管理的代码仓库，一个是用于分发软件/组件/制品的软件仓库。\n\n鉴于两种场景的差异，建议在使用时，分别注明“代码仓库”或“软件仓库”，也可简称为 “代码仓”或“软件仓”。\n\n### S\n\n#### Shebang [ʃɪ'bæŋ]：释伴\n\nShebang（也称为 Hashbang）是一个由井号和叹号构成的字符序列（`#!`），出现在脚本文件的第一行的前两个字符，后跟解释器路径，如：`#!/bin/sh`，这通常是 Linux 中 shell 脚本的标准起始行。\n\n长期以来，Shebang 都没有正式的中文名称。提议者将其翻译为：“释伴”，即解释伴随行的简称，同时又是 Shebang 的音译。（关于这个词汇的翻译，在下面的首次链接中有其它的建议和讨论。）\n\n- 提议者：GoLinux\n- 首次链接：https://linux.cn/article-3664-1.html\n\n#### Shell ：交互界面\n\nShell 是 Unix/Linux 等系统的 `sh`、`bash` 等命令行的接口程序，包括 DOS/Windows 的 `command.com`/`cmd.exe` 等其实也属于此类，只是通常不这样称呼。\n\n这个词汇也是一个一直没有翻译而径直使用的计算机词汇。我们也没有见到（找到）合适的翻译。但是我们在 LCTT 译者 CanYellow 翻译的一篇文章中见到他将其翻译为 “交互界面”，我们认为这是一种好的翻译。\n\n注：有些人对此次条的翻译持反对意见，此词条建议尝试性在部分语境中使用。\n\n- 提议者：CanYellow\n- 首次链接：https://linux.cn/article-15469-1.html\n\n### 说明\n\n此文档会根据建议不断更新，其固定地址为： https://github.com/LCTT/TranslateProject/blob/master/Dict.md ，欢迎大家提交议题或拉取请求来完善它。\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 10.0322265625,
          "content": "Apache License\nVersion 2.0, January 2004\nhttp://www.apache.org/licenses/\n\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n1. Definitions.\n\n\"License\" shall mean the terms and conditions for use, reproduction, and\ndistribution as defined by Sections 1 through 9 of this document.\n\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright\nowner that is granting the License.\n\n\"Legal Entity\" shall mean the union of the acting entity and all other entities\nthat control, are controlled by, or are under common control with that entity.\nFor the purposes of this definition, \"control\" means (i) the power, direct or\nindirect, to cause the direction or management of such entity, whether by\ncontract or otherwise, or (ii) ownership of fifty percent (50%) or more of the\noutstanding shares, or (iii) beneficial ownership of such entity.\n\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising\npermissions granted by this License.\n\n\"Source\" form shall mean the preferred form for making modifications, including\nbut not limited to software source code, documentation source, and configuration\nfiles.\n\n\"Object\" form shall mean any form resulting from mechanical transformation or\ntranslation of a Source form, including but not limited to compiled object code,\ngenerated documentation, and conversions to other media types.\n\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made\navailable under the License, as indicated by a copyright notice that is included\nin or attached to the work (an example is provided in the Appendix below).\n\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that\nis based on (or derived from) the Work and for which the editorial revisions,\nannotations, elaborations, or other modifications represent, as a whole, an\noriginal work of authorship. For the purposes of this License, Derivative Works\nshall not include works that remain separable from, or merely link (or bind by\nname) to the interfaces of, the Work and Derivative Works thereof.\n\n\"Contribution\" shall mean any work of authorship, including the original version\nof the Work and any modifications or additions to that Work or Derivative Works\nthereof, that is intentionally submitted to Licensor for inclusion in the Work\nby the copyright owner or by an individual or Legal Entity authorized to submit\non behalf of the copyright owner. For the purposes of this definition,\n\"submitted\" means any form of electronic, verbal, or written communication sent\nto the Licensor or its representatives, including but not limited to\ncommunication on electronic mailing lists, source code control systems, and\nissue tracking systems that are managed by, or on behalf of, the Licensor for\nthe purpose of discussing and improving the Work, but excluding communication\nthat is conspicuously marked or otherwise designated in writing by the copyright\nowner as \"Not a Contribution.\"\n\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf\nof whom a Contribution has been received by Licensor and subsequently\nincorporated within the Work.\n\n2. Grant of Copyright License.\n\nSubject to the terms and conditions of this License, each Contributor hereby\ngrants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable copyright license to reproduce, prepare Derivative Works of,\npublicly display, publicly perform, sublicense, and distribute the Work and such\nDerivative Works in Source or Object form.\n\n3. Grant of Patent License.\n\nSubject to the terms and conditions of this License, each Contributor hereby\ngrants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable (except as stated in this section) patent license to make, have\nmade, use, offer to sell, sell, import, and otherwise transfer the Work, where\nsuch license applies only to those patent claims licensable by such Contributor\nthat are necessarily infringed by their Contribution(s) alone or by combination\nof their Contribution(s) with the Work to which such Contribution(s) was\nsubmitted. If You institute patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Work or a\nContribution incorporated within the Work constitutes direct or contributory\npatent infringement, then any patent licenses granted to You under this License\nfor that Work shall terminate as of the date such litigation is filed.\n\n4. Redistribution.\n\nYou may reproduce and distribute copies of the Work or Derivative Works thereof\nin any medium, with or without modifications, and in Source or Object form,\nprovided that You meet the following conditions:\n\nYou must give any other recipients of the Work or Derivative Works a copy of\nthis License; and\nYou must cause any modified files to carry prominent notices stating that You\nchanged the files; and\nYou must retain, in the Source form of any Derivative Works that You distribute,\nall copyright, patent, trademark, and attribution notices from the Source form\nof the Work, excluding those notices that do not pertain to any part of the\nDerivative Works; and\nIf the Work includes a \"NOTICE\" text file as part of its distribution, then any\nDerivative Works that You distribute must include a readable copy of the\nattribution notices contained within such NOTICE file, excluding those notices\nthat do not pertain to any part of the Derivative Works, in at least one of the\nfollowing places: within a NOTICE text file distributed as part of the\nDerivative Works; within the Source form or documentation, if provided along\nwith the Derivative Works; or, within a display generated by the Derivative\nWorks, if and wherever such third-party notices normally appear. The contents of\nthe NOTICE file are for informational purposes only and do not modify the\nLicense. You may add Your own attribution notices within Derivative Works that\nYou distribute, alongside or as an addendum to the NOTICE text from the Work,\nprovided that such additional attribution notices cannot be construed as\nmodifying the License.\nYou may add Your own copyright statement to Your modifications and may provide\nadditional or different license terms and conditions for use, reproduction, or\ndistribution of Your modifications, or for any such Derivative Works as a whole,\nprovided Your use, reproduction, and distribution of the Work otherwise complies\nwith the conditions stated in this License.\n\n5. Submission of Contributions.\n\nUnless You explicitly state otherwise, any Contribution intentionally submitted\nfor inclusion in the Work by You to the Licensor shall be under the terms and\nconditions of this License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify the terms of\nany separate license agreement you may have executed with Licensor regarding\nsuch Contributions.\n\n6. Trademarks.\n\nThis License does not grant permission to use the trade names, trademarks,\nservice marks, or product names of the Licensor, except as required for\nreasonable and customary use in describing the origin of the Work and\nreproducing the content of the NOTICE file.\n\n7. Disclaimer of Warranty.\n\nUnless required by applicable law or agreed to in writing, Licensor provides the\nWork (and each Contributor provides its Contributions) on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied,\nincluding, without limitation, any warranties or conditions of TITLE,\nNON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A PARTICULAR PURPOSE. You are\nsolely responsible for determining the appropriateness of using or\nredistributing the Work and assume any risks associated with Your exercise of\npermissions under this License.\n\n8. Limitation of Liability.\n\nIn no event and under no legal theory, whether in tort (including negligence),\ncontract, or otherwise, unless required by applicable law (such as deliberate\nand grossly negligent acts) or agreed to in writing, shall any Contributor be\nliable to You for damages, including any direct, indirect, special, incidental,\nor consequential damages of any character arising as a result of this License or\nout of the use or inability to use the Work (including but not limited to\ndamages for loss of goodwill, work stoppage, computer failure or malfunction, or\nany and all other commercial damages or losses), even if such Contributor has\nbeen advised of the possibility of such damages.\n\n9. Accepting Warranty or Additional Liability.\n\nWhile redistributing the Work or Derivative Works thereof, You may choose to\noffer, and charge a fee for, acceptance of support, warranty, indemnity, or\nother liability obligations and/or rights consistent with this License. However,\nin accepting such obligations, You may act only on Your own behalf and on Your\nsole responsibility, not on behalf of any other Contributor, and only if You\nagree to indemnify, defend, and hold each Contributor harmless for any liability\nincurred by, or claims asserted against, such Contributor by reason of your\naccepting any such warranty or additional liability.\n\nEND OF TERMS AND CONDITIONS\n\nAPPENDIX: How to apply the Apache License to your work\n\nTo apply the Apache License to your work, attach the following boilerplate\nnotice, with the fields enclosed by brackets \"[]\" replaced with your own\nidentifying information. (Don't include the brackets!) The text should be\nenclosed in the appropriate comment syntax for the file format. We also\nrecommend that a file or class name and description of purpose be included on\nthe same \"printed page\" as the copyright notice for easier identification within\nthird-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n     http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "LinuxChina-End.md",
          "type": "blob",
          "size": 7.6611328125,
          "content": "“Linux 中国” 开源社区，停止运营\n======\n\n这是一个艰难的决定 —— 这不是调侃，而是当你真正做出改变了你十几年生活轨迹的决定时，你就会明白这个决定确实艰难。\n\n在写这篇告别信之前，我久久停笔不前。然而，要说的话，其实在我心里已经反复思考了好几遍。\n\n**从即日起，“Linux 中国” 这个社区，包括它的主网（ https://linux.cn/ ）、公众号、视频号，以及下属的《硬核观察》栏目，将无限期停止更新和运营。**\n\n停止运营的原因其实很平常，大抵包括以下几个方面：\n\n### “Linux 中国” 已经完成了其历史使命\n\n最初，我们的愿望是想把 “Linux 中国” 建设成一个传播开源技术的公益型社区。但是经过十几年的发展，目前开源文化和 Linux 相关的开源技术已经得到了广泛传播（在这期间，我们或许也做了一些小小的贡献）。因此，继续运营所能起到的作用并没有那么大了。\n\n出于偶然原因，“Linux 中国” 其实并未按照我们的最初设想发展，这么多年下来，真正坚持下来的项目也就是一个翻译团队 LCTT，翻译了数千篇文章，引导数百人参与了开源贡献。然而，近年来，随着计算机翻译技术的进步，尤其是 ChatGPT 的出现，翻译工作的必要性大为降低。自去年以来，我一直使用 ChatGPT 来翻译一些文章，尽管还需要一至两次校对，但基本没什么大问题。所以，LCTT 的存在也显得不那么重要了。\n\n事实上，LCTT 已经陷入了一种半死亡状态，数百名贡献者基本上都处于休眠了状态，甚至由于技术原因，连自动化选题工作都难以维持。唯一能持续翻译的，除了我，就是我们的首席译者 geekpi 了。从这个角度来看，这已经不再是一个社区化的翻译组织了。\n\n### 最初的方向选择和理想主义无法避免的结果\n\n2003 年，在创立 “Linux 中国” 之前，我还创立过另外一个叫做 “炎黄角马（CNGNU）” 的开源技术社区。但后来因为我创业失败，这个社区就关闭了。随后，我的弟弟王兴江利用我手中闲置的域名 **linux.cn** 建立了一个新的网站，我们给它起了一个狂妄的名字 “Linux 中国” —— 实际上，需要澄清的是，我们和 Linux 的官方机构没有任何关联，也不代表 Linux 官方。\n\n建立这个网站（社区）的初衷是为了传播知识和文化，并没有考虑过未来的盈利模式，这也导致我们后来排斥将社区变成一个商业网站，去做一些培训、会议之类的商业活动。\n\n但这带来了巨大的资金压力，尤其是在托管服务器价格高昂的那段时期。幸运的是，我们得到了七牛云在 CDN 方面的赞助、阿里云在 PR 方面的投放，让我们得以发展。当然，还有一些其它的广告主和朋友的赞助，稍后容我一一致谢。\n\n2015 年，我离开了中国电信，成为了一名自由人，没有人再给我发工资了。这些年，“Linux 中国” 有一些收入，主要是为广告商撰写和发布的一些文章，但是收入不太稳定。而在众所周知的那三年里，收入状况甚至更惨淡。说实话，过去几年，我大致处于一种个人经济上的慢性失血状态。\n\n所以，现在，当整体经济不佳时，压力更大。\n\n### 个人疲惫和人生的交叉路口\n\n近些年，“Linux 中国” 越来越像是一个 “个人” 网站，几乎所有的流程都需要我亲自来完成。“Linux 中国” 的公众号自从开设的第一天起，就没有任何一天停止过更新 —— 无论是年三十还是我的身体抱恙，无论是在出差路上还是带家人出游。这两年，我又开始了《硬核观察》栏目，这需要我每天花费数小时采编、录制和发布视频，如今也有了 1263 期，从未停歇。\n\n累吗？累，但更累的是，没有尽头的累。\n\n我今年正好五十岁了，对我来说，这个年龄是我需要重新定位人生的一个标志点。当我三十岁时，我颇有一种 “顿觉昨日非” 的感觉，从此改变了人生轨迹；当我四十岁时，经历了父亲去世、稍后几年弟弟及其他亲人陆续去世的打击；今年，我再次站在人生的交叉口，我想我应该有所改变了。\n\n幸运的是，我一直非常担心的身体健康，目前还算还没有出现大问题。前段时间去做了好几年没敢做的体检，基本上没太大的问题。\n\n### 没有别的选择了吗？\n\n坦白说，我认真反复想过。\n\n但是，我没有找到合适托付 “Linux 中国” 的人或机构。一个不盈利、持续亏损的社区，很难找到能保持其独立性和原则的托付人。\n\n我也不愿意将 “Linux 中国” 所有的资产都卖给商业机构。有人曾经愿意出高价买我们的域名，但是，他们出的价远远买不起我为此出售良心和名誉的代价。\n\n总的来说，就是因为这些大大小小的原因，我做出了艰难的决定，结束这些年的坚持。对不起了，大家。\n\n### 对不起\n\n做这个决定前，我最无法放下的不是我投入的那么多精力，而是那些始终坚定支持 “Linux 中国” 的朋友们。包括那 174 位在微信公众号上“几乎看过你所有的内容”的读者，也包括经常在 B 站上给《硬核观察》留言数百字、期期不落都观看和点评的观众，以及 “Linux 中国” 主网上那些熟悉的评论者的 ID 和定位，他们让我倍感感动和内疚。对不起，是我让你们失望了，辜负了大家的期待和支持。\n\n### 感谢\n\n除了道歉，我还需要感谢很多人。\n\n首先，我要感谢参与过社区的许多人，包括 LCTT 的五百多位贡献者和社区的朋友们。特别要感谢 bestony、geekpi、oska874、lujun9976、vizv、lkxed 等主要贡献者。“Linux 中国” 开源社区，其实是你们的，是大家的，而不是我的。能与大家共同拥有这样一段美好回忆，是我的荣幸。在此，我不能一一尽数所有贡献者，你可以在 https://linux.cn/lctt-list 看到 LCTT 全部贡献者的名单和贡献量。\n\n其次，要感谢在 “Linux 中国” 成长过程中帮助过我们的许多公司。这包括七牛云、阿里云、UCloud、腾讯云、EasyStack、华为、字节跳动、青云、马哥教育、刘遄老师等等，以及我一时无法全部记起的朋友们。他们都是我们这些年得以一路走来的助力。\n\n最后，我要感谢那些我可能完全不知道名字的支持过 “Linux 中国” 的人，就像我说的，“你的每次点击和分享都是对我们的支持” 的读者，以及那些在社区活动中总能认出来我的人。\n\n### 接下来\n\n这篇告别信发出后，除非有特殊情况，我将停止在 “Linux 中国” 的主网、公众号、视频号、B 站等所有渠道的内容发布。\n\n我会在春节期间将 “Linux 中国” 所有发布的文章都打包成一份电子书，供大家收藏留用，所以大家不必自己用网络爬虫来抓取了。当然，我们的主网和公众号都会保持相当长的时间的访问，只是我可能不再更新了。\n\n### 至于我个人呢？\n\n我今年计划躺平几个月，然后准备一个人出门走走，或许是自驾，或许是摩旅，去寻找一下人生的意义。我可能会在我的视频号 “**硬核老王**” 中发布我的行程，也可能会停留在某个地方，可能会经过你的城市，也许我们可以把~~酒~~（水）言欢。\n\n江湖再见，诸位。\n\n*（题图：DA/c42007de-fab5-48c9-9976-3c4ca97bcf6e）*\n\n---\n\n“Linux 中国”创始人 硬核老王\n\n2024/2/1\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.416015625,
          "content": "\n[![待翻译](https://lctt.github.io/TranslateProject/badge/sources.svg)](https://lctt.github.io/new)\n[![翻译中](https://lctt.github.io/TranslateProject/badge/translating.svg)](https://lctt.github.io/translating)\n[![待校正](https://lctt.github.io/TranslateProject/badge/translated.svg)](https://github.com/LCTT/TranslateProject/tree/master/translated)\n[![已发布](https://lctt.github.io/TranslateProject/badge/published.svg)](https://github.com/LCTT/TranslateProject/tree/master/published) \n\n[![Travis](https://img.shields.io/travis/LCTT/TranslateProject.svg)](https://travis-ci.com/LCTT/TranslateProject)\n[![GitHub contributors](https://img.shields.io/github/contributors/LCTT/TranslateProject.svg)](https://github.com/LCTT/TranslateProject/graphs/contributors)\n[![GitHub closed pull requests](https://img.shields.io/github/issues-pr-closed/LCTT/TranslateProject.svg)](https://github.com/LCTT/TranslateProject/pulls?q=is%3Apr+is%3Aclosed)\n\n简介\n-------------------------------\n\n[LCTT](https://linux.cn/lctt/) 是“Linux 中国”（[https://linux.cn/](https://linux.cn/)）的翻译组，负责从国外优秀媒体翻译 Linux 相关的技术、资讯、杂文等内容。\n\nLCTT 已经拥有几百名活跃成员，并欢迎更多的 Linux 志愿者加入我们的团队。\n\n![LCTT](https://lctt.github.io/wiki/images/lctt_logo.png)\n\n- LCTT 官网： [https://linux.cn/lctt/](https://linux.cn/lctt/)\n- LCTT 状态： [https://lctt.github.io/](https://lctt.github.io/)\n\n**LCTT 已经伴随 Linux 中国开源社区 [停止运营](LinuxChina-End.md) 而停止运作。**\n\n历史\n-------------------------------\n\n* 2013/09/10 倡议并得到了大家的积极响应，成立翻译组。\n* 2013/09/11 采用 GitHub 进行翻译协作，并开始进行选题翻译。\n* 2013/09/16 公开发布了翻译组成立消息后，又有新的成员申请加入了。并从此建立见习成员制度。\n* 2013/09/24 鉴于大家使用 GitHub 的水平不一，容易导致主仓库的一些错误，因此换成了常规的 fork+PR 的模式来进行翻译流程。\n* 2013/10/11 根据对 LCTT 的贡献，划分了 Core Translators 组，最先的加入成员是 vito-L 和 tinyeyeser。\n* 2013/10/12 取消对 LINUX.CN 注册用户的关联，在 QQ 群内、文章内都采用 GitHub 的注册 ID。\n* 2013/10/18 正式启动 man 翻译计划。\n* 2013/11/10 举行第一次北京线下聚会。\n* 2014/01/02 增加了 Core Translators 成员: geekpi。\n* 2014/05/04 更换了新的 QQ 群：198889102\n* 2014/05/16 增加了 Core Translators 成员: will.qian、vizv。\n* 2014/06/18 由于 GOLinux 令人惊叹的翻译速度和不错的翻译质量，升级为 Core Translators 成员。\n* 2014/09/09 LCTT 一周年，做一年[总结](http://linux.cn/article-3784-1.html)。并将曾任 CORE 的成员分组为 Senior，以表彰他们的贡献。\n* 2014/10/08 提升 bazz2 为 Core Translators 成员。\n* 2014/11/04 提升 zpl1025 为 Core Translators 成员。\n* 2014/12/25 提升 runningwater 为 Core Translators 成员。\n* 2015/04/19 发起 LFS-BOOK-7.7-systemd 项目。\n* 2015/06/09 提升 ictlyh 和 dongfengweixiao 为 Core Translators 成员。\n* 2015/11/10 提升 strugglingyouth、FSSlc、Vic020、alim0x 为 Core Translators 成员。\n* 2016/02/18 由于选题 DeadFire 重病，任命 oska874 接手选题工作。\n* 2016/02/29 选题 DeadFire 病逝。\n* 2016/05/09 提升 PurlingNayuki 为校对。\n* 2016/09/10 LCTT 三周年。\n* 2016/12/24 拟定 LCTT [Core 规则](core.md)，并增加新的 Core 成员： ucasFL、martin2011qi，及调整一些组。\n* 2017/03/13 制作了 LCTT 主页、成员列表和成员主页，LCTT 主页将移动至 https://linux.cn/lctt 。\n* 2017/03/16 提升 GHLandy、bestony、rusking 为新的 Core 成员。创建 Comic 小组。\n* 2017/04/11 启用头衔制，为各位重要成员颁发头衔。\n* 2017/11/21 鉴于 qhwdw 快速而上佳的翻译质量，提升 qhwdw 为新的 Core 成员。\n* 2017/11/19 wxy 在上海交大举办的 2017 中国开源年会上做了演讲：《[如何以翻译贡献参与开源社区](https://linux.cn/article-9084-1.html)》。\n* 2018/01/11 提升 lujun9972 成为核心成员，并加入选题组。\n* 2018/02/20 遭遇 DMCA 仓库被封。\n* 2018/05/15 提升 MjSeven 为核心成员。\n* 2018/08/01 [发布 Linux 中国通证：LCCN](https://linux.cn/article-9886-1.html)。\n* 2018/08/17 提升 pityonline 为核心成员，担任校对，并接受他的建议采用 PR 审核模式。\n* 2018/09/10 [LCTT 五周年](https://linux.cn/article-9999-1.html)。\n* 2018/10/25 重构了 CI，感谢 vizv、lujun9972、bestony。\n* 2018/11/13 [成立了项目管理委员会（PMC）](https://linux.cn/article-10279-1.html)，初始成员为：@wxy （主席）、@oska874、@lujun9972、@bestony、@pityonline、@geekpi、@qhwdw。\n* 2020/09/10 Linux 中国旗下贡献者组织 [LCTT 七年回顾和展望](https://linux.cn/article-12600-1.html)\n* 2022/09/10 开源贡献者翻译组 [LCTT 九岁](https://linux.cn/article-15017-1.html) 啦\n* 2023/01/31 发布《[LCTT 术语词典](https://linux.cn/article-15496-1.html)》\n* 2023/09/10 [LCTT 10 年，迎来新蜕变](https://linux.cn/article-16178-1.html)\n* 2024/02/01 [Linux 中国及 LCTT 停止运营](https://linux.cn/article-16602-1.html)\n\n项目管理委员及核心成员\n-------------------------------\n\nLCTT 现由项目管理委员会（PMC）进行管理，成员如下：\n\n- 🎩 主席 @wxy\n- 🎩 选题 @oska874\n- 🎩 选题 @lujun9972\n- 🎩 技术 @bestony\n- 🎩 校对 @pityonline\n- 🎩 译者 @geekpi\n- 🎩 译者 @qhwdw\n\n目前 LCTT 核心成员有：\n\n- ❤️ 核心成员 @vizv\n- ❤️ 核心成员 @zpl1025\n- ❤️ 核心成员 @runningwater\n- ❤️ 核心成员 @FSSlc\n- ❤️ 核心成员 @Vic020\n- ❤️ 核心成员 @alim0x\n- ❤️ 核心成员 @martin2011qi\n- ❤️ 核心成员 @Locez\n- ❤️ 核心成员 @ucasFL\n- ❤️ 核心成员 @MjSeven\n\n曾经做出了巨大贡献的核心成员，被列入荣誉榜：\n\n- 🏆 前任选题 @DeadFire\n- 🏆 前任校对 @reinoir222\n- 🏆 前任校对 @PurlingNayuki\n- 🏆 前任校对 @carolinewuyan\n- 🏆 前任校对 @jasminepeng\n- 🏆 功勋成员 @tinyeyeser\n- 🏆 功勋成员 @vito-L\n- 🏆 功勋成员 @willqian\n- 🏆 功勋成员 @GOLinux\n- 🏆 功勋成员 @bazz2\n- 🏆 功勋成员 @ictlyh\n- 🏆 功勋成员 @dongfengweixiao\n- 🏆 功勋成员 @strugglingyouth\n- 🏆 功勋成员 @GHLandy\n- 🏆 功勋成员 @rusking\n\n全部成员列表请参见： https://linux.cn/lctt-list/ 。\n\n谢谢大家的支持！\n"
        },
        {
          "name": "core.md",
          "type": "blob",
          "size": 1.537109375,
          "content": "给核心成员的一封信\n===================\n\n鉴于您的卓越贡献，我邀请您成为 LCTT 的核心（Core）成员。\n\n作为核心成员，您拥有如下权利：\n\n- 您能够合并您以及其它普通成员的 PR\n- 您能够校对其它普通成员的文章，并提交校对 PR\n- 您能够建议或反对将某位普通成员升级为核心成员\n- 您能够自主添加符合 LCTT 定位的选题并翻译\n- 您能够以 LCTT 核心成员名义宣称、署名\n- 在得到 LCTT 同意后，以 LCTT 身份出席活动\n- 在得到 LCTT 同意后，创建 LCTT 名下的其它仓库并管理（及邀请其它成员参与）\n- 成为 LinuxCN 管理团队的一员\n- 参与 LCTT 及 LinuxCN 决策投票\n\n以下是不允许的行为，虽然您可能有这样的权限：\n\n- 直接在 LCTT 主仓库上提交修改\n- 在 LCTT 主仓库上创建分支\n \n除此以外，您有以下义务：\n\n- 为您的 GitHub 账户创建安全的密码\n- 为您的 GitHub 账户创建 2FA 验证\n- 不得外借您的 GitHub 账户，您需要为您的账户负责\n- 保持参与度，如长期不能参与，会转换身份为荣誉成员，并放弃相应权限\n- 接待新加入的成员，并做好引导个工作\n- 维护 Wiki\n\n作为核心成员，您会执行一些管理工作，以下是一些惯例：\n\n- 合并 PR 时，要按时间顺序，从最早的（最下方）的开始合并\n- 合并 PR 时，如果与仓库或前面的 PR 冲突，则关闭该 PR，并提醒 PR 发起人修改处理\n- 除非必要，合并 PR 时不要 squash-merge\n\nwxy@LCTT \n2016/12/24"
        },
        {
          "name": "lctt2014.md",
          "type": "blob",
          "size": 6.6044921875,
          "content": "LCTT 2014 ： LCTT 成立一年总结\n============================\n\n### 缘起 ###\n\n一年前，我因为开发 Linux 中国的微信公众号，想着在公众号里面提供 Linux 的 man 手册应该是个不错的主意，因此在网上遍寻中文 man 手册。虽然我之前也寻找过中文的 man 手册，知道颇多不全和错漏，但是这次仔细搜寻之下，却发现还远较我预计的还差。\n\n无奈之下，只能先使用了英文版本作为 man 的内容，并因此萌发了组织一个翻译 man 手册的活动或组织的想法。说干就干，当时我就在 Linux 中国的 QQ 群里面发起了倡议，还真得到了大家响应。\n\n于是，2013 年 9 月 10日，草草而就的 LCTT 就成立了，很快就创建了一个 QQ 群作为交流，并确定了名称为“Linux.CN Translate Team”，简称 LCTT。考虑到需要多人协作，几乎没有多想，就决定了采用 GITHUB 作为翻译平台——虽然现在看起来，GITHUB 作为主要工作平台，有利也有弊，但是，总体来说还是不错的。LCTT 就这样启动了。\n\n### 发展 ###\n\n次日，我们就组织起来了翻译，并初步拟定了翻译流程、分工之类的内容。\n\nLCTT 草创，各种方面都没有经验，也出现过一些失误。比如说，开始时对于 GITHUB 以及 GIT，大部分人，包括我，都不是很熟悉，因此并未采用 Pull-Request 模式，而是共同控制的方式，也由于一些协调和经验的原因，出现过版本错误和回滚，甚至回滚得更乱。还有，初期还要求 LINUX 中国网站 的注册身份，但是后来发现这完全不必要。\n\n本来成立 LCTT 的目标是为了 man 手册的翻译，但是经过研究，我发现翻译 man 手册还有一些困难：\n\n1. man 手册是二进制的 groff 格式，因此生成和解析需要一些额外的过程，甚至需要一些特定的环境；\n2. man 手册对翻译的能力要求较高，并且应该对 man 手册所对应的命令有足够的了解，才能翻译得当，因为一字之差就可能导致很多误解。\n\n所以，当时商量决定，先期启动普通的 Linux 方面、开源方面的文章翻译，以此来摸索翻译流程和锻炼协作，并作为翻译 man 手册的人员筛选环节。\n\n我安排 Linux 中国站长，原本经常独自翻译发表来自国外文章的 DeadFire 来做选题。他负责将选题从英文的页面，转换成 Markdown 格式。我又找了朋友 jasminepeng 和 carolinewuyan 帮忙做校对，我自己则主要承担发布的工作。\n\n初期，很快就涌现出了一些积极参与的人员，如 tinyeyeser、vito-L、boredivanivan等等，不一一列举了，他们不但积极参与翻译，而且还帮助撰写了第一批的翻译组 Wiki 文档，对引导新人起到了很大作用。\n\n伴随着 LCTT 的逐步运作，一个月之后，我和大家感觉时间比较成熟了，就启动了 man 翻译计划。\n\n### man 翻译计划的夭折 ###\n\n_写下这个标题时，我也颇感觉惭愧的，这也算是我正视这个结果吧。不管怎么说，现在还是深夜，未过零点，我终究是在 LCTT 一周年之前正视了失败。_\n\n其实，前面提到过，我检索过各种可以找到的中文 man 翻译项目的结果，但种种结果让人无法满意，因此我觉得，我应该能吸取其中的教训，为 Linux、为开源做点实事出来。\n\n我总结的之前的 man 翻译项目失败的原因大概如下：\n\n1. 缺乏足够的驱动力，翻译者无论从利益还是荣誉，都得不到鼓励，因此往往难以为继。\n2. 由于依赖个人热情，没有形成流动机制，因此，当某个人热情耗尽之后，就没有人继续接手维护。\n3. 翻译流程简单，没有形成初译、校对、发布等流程，无法保证质量，也没有保持同步更新的流程。\n\n因此，我觉得，通过建立一个翻译的公益组织（即 LCTT）、建立翻译流程、翻译后保留翻译和校对等人员的署名，可以解决一些以上的问题。\n\n但是，其实我还忽视了一点，翻译 man 手册，其实无论是环境还是流程，比较复杂，因此限制了参与者。参与门槛高，导致发展不能持续。\n\n因此，实际上，man 翻译项目，在大概运作了一个月之后，就逐渐停滞下来了，虽然后期，willqian 独立完成了很多篇，但是总体来说，man 翻译项目算是失败了。\n\n### 总结这一年 ###\n\n抛开 man 翻译项目的失败不说，其实，LCTT 还是成果累累。\n\n这一年，我们完成了 5820 次提交，发起了 1482 个 PR，翻译了 805 篇文章。\n\n这一年，我们有了 98 个贡献者，得到了 162 个 fork。\n\n我使用了一个工具，根据这一年来我们 LCTT 翻译项目的 git 日志，生成了一段[视频](http://img.linux.net.cn/static/video/lctt2014.mp4)。看着视频中如辛勤的工蜂一样忙忙碌碌的志愿者们；看着如穿花蝴蝶一样，承担了更多工作量的选题、校对们；看着归档时如同施展魔法一样，瞬间变出了一朵朵花，我感觉我们这一年是有收获的一年！\n\n请大家观赏我们这一年： http://img.linux.net.cn/static/video/lctt2014.mp4 （213M，720p）\n\n这是我用 kdenlive 合成配音的。虽然我的乐感很差，只能选择一首自己觉得还算配的音乐；虽然我根本不会用 kdenlive，连配音淡出都琢磨半天；虽然我编译用于生成这个视频的 gource 都花费了几个小时来解决问题；但是，看到这份视频，我为我们 LCTT 这一年来的工作感到骄傲。\n\n### 感谢你们 ###\n\n虽然很俗套，但是此刻，已经是 2014 年 9 月 10 日凌晨00:50了，我心情很激动，真心感谢所有的参与者、贡献者。几乎每个 LCTT 的成员我都知道，也有几个我特别熟悉；LCTT 的成员有新来的，也有逐渐淡出的，但是不论是那种，我都记得你们。\n\n名单太长，我就不一一列举了： https://github.com/LCTT/TranslateProject/graphs/contributors \n\n### 接下来 ###\n\n我会说，man 计划我不会放弃么？\n\n是的，man 计划是 LCTT 之所以发起的原因，也是 LCTT 能够持久发展的基础，而 man 翻译也是真正对国内的 Linux 、开源发展有实在意义的事情，所以，我不会放弃。\n\n我会投入精力开发一个翻译平台，用于 man 项目的翻译、校对和发布，将复杂的翻译环境配置和使用方法隐藏在后面；并增加可视化的图表和进度显示，明了的体现翻译工作进展；对接 man7.org 的最新更新，保持 man 内容的及时更新等等。\n\n期待 LCTT 的下一个年度的发展吧！\n\n----\n\nLCTT wxy\n\n2014 年 9 月 10 日"
        },
        {
          "name": "lctt2016.md",
          "type": "blob",
          "size": 3.630859375,
          "content": "LCTT 2016：LCTT 成立三周年了！\n===========================\n\n不知不觉，LCTT 已经成立三年了，对于我这样已经迈过四张的人来说，愈发的感觉时间过得真快。\n\n这三年来，我们 LCTT 经历了很多事情，有些事情想起来仍恍如昨日。\n\n三年前的这一天，我的一个偶发的想法促使我在 Linux 中国的 QQ 群里面发了一则消息，具体的消息内容已经不可考了，大意是鉴于英文 man 手册的中文翻译太差，想组织一些人来重新翻译。不料发出去之后很快赢得一些有热情、有理想的小伙伴们的响应。于是我匆匆建了一个群，拉了一些人进来，甚至当时连翻译组的名称都没有确定。LCTT （Linux.Cn Translation Team）这个名称都是后来逐步定下来的。\n\n关于 LCTT 的早期发展情况，可以参考 LCTT 2014 年周年[总结](http://linux.cn/article-3784-1.html)。\n\n虽然说“翻译 man 手册”这个最初建群的目标因为种种原因搁浅而一直未能重启，但是，这三年来，我们组织了 [213 位志愿者](https://github.com/LCTT/TranslateProject/graphs/contributors)翻译了 2155 篇文章，接受了 [4263 个 PR](https://github.com/LCTT/TranslateProject/pulls?q=is%3Apr+is%3Aclosed)，得到了 476 个星。\n\n这三年来，我们经历了 man 项目的流产、 LFS 手册的翻译发布、选题 DeadFire 的离去。得益于 Linux 中国的网站和微博，乃至微信的兴起后的传播，志愿者们的译文传播很广，切实的为国内的开源社区做出了贡献（当然，与此同时，Linux 中国社区也随之更加壮大）。\n\n这些年间，LCTT 来了很多人，也有人慢慢淡出，这里面涌现了不少做出了卓越贡献的人，比如：\n\n- geekpi，作为整个 LCTT 项目中翻译量最大贡献者，却鲜少在群内说话，偶尔露面，被戏称为“鸡排兄”。\n- GOLinux，紧追“鸡排兄”的第二位强人，嗯，群内大部分人的昵称都是他起的，包括楼上。\n- tinyeyeser，“小眼儿”以翻译风趣幽默著称，是 LCTT 早期初创成员之一。\n- Vito-L，早期成员，LCTT 的多数 Wiki 出自于其手。\n- DeadFire，创始成员，从最开始到其离世，一直负责 LCTT 的所有选题工作。\n- oska874，在接过选题工作的重任后，全面主持 LCTT 的工作。\n- carolinewuyan，承担了相当多的校对工作。\n- alim0x，独立完成了 Android 编年史系列的翻译（多达 26 篇，现在还没发布完）等等。\n\n其它还有 ictlyh、strugglingyouth、FSSlc、zpl1025、runningwater、bazz2、Vic020、dongfengweixiao、jasminepeng、willqian、vizv、ZTinoZ、martin2011qi、felixonmars、su-kaiyao、GHLandy、flsf、H-mudcup、StdioA、crowner、vim-kakali 等等，以及还有很多这里没有提到名字的人，都对 LCTT 做出不可磨灭的贡献。\n\n具体的贡献排行榜，可以看[这里](https://github.com/LCTT/TranslateProject/graphs/contributors)。\n\n每年写总结时，我都需要和 gource 以及 ffmpeg 搏斗半天，今年，我又用 gource 重新制作了一份 LCTT 的 GitHub 版本仓库的变迁视频，以飨众人。\n\n本来想写很多，或许 LCTT 和 Linux 中国已经成了我的生活的一部分，竟然不知道该写点什么了，那就此搁笔罢。\n\n另外，为 LCTT 的诸位兄弟姐妹们献上我及管理团队的祝福，也欢迎更多的志愿者加入 LCTT ，传送门在此：\n\n- 项目网站：https://lctt.github.io/ ，请先访问此处了解情况。\n- “Linux中国”开源社区：https://linux.cn/ ，所有翻译的文章都在这里以及它的同名微博、微信发布。\n\nLCTT 组长 wxy\n\n2016/9/10"
        },
        {
          "name": "lctt2018.md",
          "type": "blob",
          "size": 5.8212890625,
          "content": "LCTT 2018：五周年纪念日\n======\n\n我是老王，可能大家有不少人知道我，由于历史原因，我有好几个生日（;o），但是这些年来，我又多了一个生日，或者说纪念日——每过两年，我就要严肃认真地写一篇 [LCTT](https://linux.cn/lctt) 生日纪念文章。\n\n喏，这一篇，就是今年的了，LCTT 如今已经五岁了！\n\n或许如同小孩子过生日总是比较快乐，而随着年岁渐长，过生日往往有不少负担——比如说，每次写这篇纪念文章时，我就需要回忆、反思这两年的做了些什么，往往颇为汗颜。\n\n不过不管怎么说，总要总结一下这两年我们做了什么，有什么不足，也发一些展望吧。\n\n### 江山代有英豪出\n\nLCTT，如同一般的开源贡献组织，总是有不断的新老传承。我们的翻译组，也有不少成员，由于工作学习的原因，慢慢淡出，但同时，也不断有新的成员加入并接过前辈手中的旗帜（就是没人接我的）。\n\n> **加入方式**\n\n> 请首先加入翻译组的 QQ 群，群号是：**198889102**，加群时请说明是“**志愿者**”。加入后记得修改您的群名片为您的 GitHub 的 ID。\n\n> 加入的成员，请先阅读 [WIKI 如何开始](https://github.com/LCTT/TranslateProject/wiki/01-%E5%A6%82%E4%BD%95%E5%BC%80%E5%A7%8B)。\n\n比如说，我们这两年来，oska874 承担了主要的选题工作，然后 lujun9972 适时的出现接过了不少选题工作；再比如说，qhwdw 出现后承担了大量繁难文章的翻译，pityonline 则专注于校对，甚至其校对的严谨程度让我都甘拜下风。还有 MjSeven 也同 qhwdw 一样，以极高的翻译频率从一星译者迅速登顶五星译者。当然，还有 Bestony、Locez、VizV 等人为 LCTT 提供了不少技术支持和开发工作。\n\n### 硕果累累\n\n我们并没有特别的招新渠道，但是总是时不时会有新的成员慕名而来，到目前为止，我们已经有 [331](https://linux.cn/lctt-list) 位做过贡献的成员，已经翻译发布了 3885 篇译文，合计字节达 33MB 之多！\n\n这两年，我们不但翻译了很多技术、新闻和评论类文章，也新增了新的翻译类型：[漫画](https://linux.cn/talk/comic/)，其中一些漫画得到了很多好评。\n\n我们发布的文章有一些达到了 100000+ 的访问量，这对于我们这种技术垂直内容可不容易。\n\n而同时，[Linux 中国](https://linux.cn/)也发布了近万篇文章，而这一篇，应该就是第 [9999](https://linux.cn/article-9999-1.html) 篇文章，我们将在明天，进入新的篇章。\n\n### 贡献者主页和贡献者证书\n\n为了彰显诸位贡献者的贡献，我们为每位贡献者创立的自己的专页，并据此建立了[排行榜](https://linux.cn/lctt-list)。\n\n同时，我们还特意请 Bestony 和“一一”设计开发和”贡献者证书”，大家可以在 [LCTT 贡献平台](https://lctt.linux.cn/)中领取。\n\n### 规则进化\n\nLCTT 最初创立时，甚至都没有采用 PR 模式。但是随着贡献者的增多，我们也逐渐在改善我们的流程、方法。\n\n之前采用了很粗糙的 PR 模式，对 PR 中的文件、提交乃至于信息都没有进行硬性约束。后来在 VizV 的帮助下，建立了对 PR 的合规性检查；又在 pityonline 的督促下，采用了更为严格的 PR 审查机制。\n\nLCTT 创立几年来，我们的一些流程和规范，已经成为其它一些翻译组的参考范本，我们也希望我们的这些经验，可以进一步帮助到其它的开源社区。\n\n### 仓库重建和版权问题\n\n今年还发生一次严重的事故，由于对选题来源把控不严和对版权问题没有引起足够的重视，我们引用的一篇文章违背了原文的版权规定，结果被原文作者投诉到 GitHub。而我并没有及时看到 GitHub 给我发的 DMCA 处理邮件，因此错过了处理窗口期，从而被 GitHub 将整个库予以删除。\n\n出现这样的重大失误之后，经过大家的帮助，我们历经周折才将仓库基本恢复。这要特别感谢 VizV 的辛苦工作。\n\n在此之后，我们对译文选文的规则进行了梳理，并全面清查了文章版权。这个教训对我们来说弥足沉重。\n\n### 通证时代\n\n在 Linux 中国及 LCTT 发展过程中，我一直小心翼翼注意商业化的问题。严格来说，没有经济支持的开源组织如同无根之木，无源之水，是长久不了的。而商业化的技术社区又难免为了三斗米而折腰。所以往往很多技术社区要么渐渐凋零，要么就变成了商业机构。\n\n从中国电信辞职后，我专职运营 Linux 中国这个开源社区已经近三年了，其间也有一些商业性收入，但是仅能勉强承担基本的运营费用。\n\n这种尴尬的局面，使我，以及其它的开源社区同仁们纷纷寻求更好的发展之路。\n\n去年参加中国开源年会时，在闭门会上，大家的讨论启发了我和诸位同仁，我们认为，开源社区结合通证经济，似乎是一条可行的开源社区发展之路。\n\n今年 8 月 1 日，我们经过了半年的论证和实验，[发布了社区通证 LCCN](https://linux.cn/article-9886-1.html)，并已经初步发放到了各位译者手中。我们还在继续建设通证生态各种工具，如合约、交易商城等。\n\n我们希望能够通过通证为开源社区转入新的活力，也愿意将在探索道路上遇到的问题和解决的思路、工具链分享给更多的社区。\n\n### 总结\n\n从上一次总结以来，这又是七百多天，时光荏苒，而 LCTT 的创立也近两千天了。我希望，我们的翻译组以及更多的贡献者可以在通证经济的推动下，找到自洽、自治的发展道路；也希望能有更多的贡献者涌现出来接过我们的大旗，将开源发扬光大。\n\nwxy\n2018/9/9 夜\n"
        },
        {
          "name": "lctt2020.md",
          "type": "blob",
          "size": 5.4892578125,
          "content": "# Linux 中国旗下贡献者组织 LCTT 七年回顾和展望\n\n> 这是一篇 LCTT 七周年的纪念文章，也是 LCTT 承前启后的一个里程碑。\n\n### 写在 LCTT 七年之际\n\n在 7 年前的今天，我并没有想到，在一个偶然的机会下诞生的 LCTT，它能走过这么长的时间，留下这么多的印痕。是的，一些老朋友或许记得，LCTT 这个 Linux 中国旗下的最主要的开源活动/组成部分，最初只是我发心想完善 man 的中文翻译而产生的副产品。结果，man 中文翻译项目没有做成，而 LCTT 却持续地运营了下来。\n\n虽然，这些年 LCTT 屡有改进和完善，但是总体来说还是相对保守。当然，LCTT 这些年已经陆续有 400 多位贡献者实质性的参与了贡献，并在此基础上创建了几个 SIG（特别兴趣小组），如[红帽代码英雄 SIG](https://linux.cn/article-12436-1.html)、漫画 SIG、LFS SIG 等。\n\n作为回顾，我来介绍一下 LCTT 这 7 年间在主项目（TranslateProject）上取得的成就：\n\n- 贡献者： [435 位](https://linux.cn/lctt-list)\n- 翻译文章：[5687 篇](https://linux.cn/)\n- GitHub 提交：[54629 次](https://github.com/LCTT/TranslateProject)\n- GitHub 拉取请求：[19243 次](https://github.com/LCTT/TranslateProject/pulls)\n\n这是 LCTT 主项目的提交图：\n\n![](https://postimg.aliavv.com/mbp/uglsc.png)\n\n这其中，[钻石级的贡献者有 5 名，五星级贡献者有 6 名，13 位 4 星贡献者](https://linux.cn/lctt-list)。那么，请让我来用一段视频展示一下 LCTT 七年来的历程：\n\n![](https://img.linux.net.cn/static/video/LCTT%207%20Years.mp4)\n\n当然，整体的贡献水平呈现长尾分布，大部分贡献者浅尝辄止，我想除了贡献者存在着体验的心态之外，也与 LCTT 没有建立起来合适的社区引导和激励机制有关。此外，就开源社区/开源项目而言，我们也存在一些不足，比如，按 GitHub 建议，我们在如下社区建设方面还缺乏：\n\n- 社区行为准则\n- 贡献指南\n- 议题模板\n- 拉取请求模板\n\n因此，在写这篇文章时，我也要宣布一件事，就是我会逐渐淡出 LCTT 的日常管理，改组 LCTT 管理团队，将更多未来的可能交给社区成员来建设，也希望新的社区管理团队可以为 LCTT 创造出一个不同的明天。\n\n以下，请我们的 Linux 中国的核心合伙人 Bestony 来介绍一下今后 LCTT 的发展计划。\n\n---\n\n大家好，我是 Bestony，感谢老王数年来的坚持不懈的投入，正是有老王的坚守，才能有我们如今的成就。在接下来的时间里，我将会帮助老王，更好的运作 LCTT，让老王可以喘口气，也为 LCTT 带来一些新的气象。\n\n在过去的七年里，我们 LCTT 做了很多事情，我们翻译了数千篇文章，有数百位技能精湛的贡献者。如今，到了 7 年的这个节点上，我也在思考，我们下一步应该怎么走。\n\n其实，在过去的一年里，LCTT 的问题在不断的浮现：选题方向单一、译者进入门槛较高、大家翻译的质量水平参差不齐、校对的人手不足、译稿外发的反馈不足，这些问题都是我们在过去遇见，但一直没有足够的精力和人力来解决的问题。不过，如今我将加入到 LCTT 的管理团队中，配合老王，一起一个个的解决这些过去遇见的问题。\n\n![](https://postimg.aliavv.com/mbp/3kfwy.png)\n\n对于这些问题，有一些我们已经在解决，比如“**选题方向单一**”，在今年的年初，LCTT 与红帽公司（RedHat）[联合建立了 LCRH SIG](https://linux.cn/article-12436-1.html)，面向红帽旗下的原创播客《<ruby>[代码英雄](https://www.redhat.com/en/command-line-heroes) <rt>Command Line Heroes</rt></ruby>》进行定向的翻译，目前，第一季度的翻译成功已经全部在 Linux 中国公众号上发布，而第二、三季度的内容，也正在不断的发布过程中。\n\n![](https://postimg.aliavv.com/mbp/71eup.png)\n\nLCTT - SIG 将是后续的新的发展方向。**我们将会在保留 LCTT 主体的基础上，鼓励各位译者探索更多的兴趣方向，通过建立起不同的 SIG，引入更多的翻译内容，来帮助大家更好的达成自己想要的翻译目标。** 并且，通过 LCTT 的技术和经验，赋能每一位译者，帮助译者更好的学习、了解各种不同领域的知识。\n\n而在“**进入门槛较高**”方面，一直以来 Github 的访问慢问题、Git 的概念不熟悉等问题，都是困扰不少新同学的点。而也正是这些点，在不断制约着 LCTT 的发展。在将来，我希望 LCTT 可以打造出自己的翻译工具（也将会为之而奋斗），通过工具辅助的方式，帮助更多人走上翻译的道路，让更多的爱好者们，可以为中文的技术环境贡献一份力。\n\n![](https://postimg.aliavv.com/mbp/8183e.png)\n\n后续，我们将会引入翻译工具、自建关键词表、多轮校对手段等方案，帮助更多的译者完成自己的翻译文章，通过翻译，学到自己想要的知识。\n\n当然，问题并不止我点出来的这些，我们能发展到今天，一定有很多做对了的地方，但同样，我们也有做错了的地方。欢迎你随时联系我，讨论你对于 LCTT 下一步的想法，我相信，你的意见能够帮助 LCTT 变得更好。\n\n![](https://postimg.aliavv.com/mbp/aq5m9.png)\n\n最后，**千里之行，始于足下**，刚刚走过 7 年的 LCTT， 希望我们可以在下一个七年，再次相遇。\n\n"
        },
        {
          "name": "lctt2022.md",
          "type": "blob",
          "size": 8.5126953125,
          "content": "开源贡献者翻译组 LCTT 九岁啦\n======\n\n九年前，也是这个上午，我创建了 LCTT 及其第一个项目 [TranslateProject](https://github.com/LCTT/TranslateProject/)。从最初只是有感于 Unix/Linux 上的中文手册页实在太糟糕，希望做一些事情；到最后变成了一个以翻译国外各个开源社区的技术文章和开源资讯/讨论的“流水”式项目，LCTT 已经走过了令我自己都非常吃惊的九年。\n\n人的一生，几十年而已，能在一件事上持续投入九年时光，这是我从未想过的事情。驻足回望，LCTT 其实并没有完成我最初的想法，这是缺憾；但是 LCTT 就这样变成了另外一种并非在我计划中的样子，或许也有其必然性。现在看来，LCTT 做了一些事情，也有一些存在的意义。我试着总结一下：\n\nLCTT 的主项目 TranslateProject，选题广泛，参与门槛低，从某种意义上，为初识开源的小伙伴提供一种成为开源贡献者的方式。一些人就是通过这个项目，迈出了成为开源贡献者的第一步，并在日后的学习和工作中，成为了开源爱好者、专业技术人员。\n\nLCTT 持续翻译了数千篇（截至今日，已经翻译发布了 6395 篇文章），这些文章的专业程度横跨了入门到精通等不同难度，内容方向涉猎了开发、运维、使用和文化等各个方面。虽然，有些文章仅堪一读，但也有不少文章值得收藏、一再细读。我屡屡能从读者那里得到反馈，这些文章对他们提供了很大的帮助，我想这就是 LCTT 的存世价值之一吧。唯独可惜的是，这些文章，没有以很好的方式组织起来，甚憾。\n\nLCTT 有数百成员（截至今日，成功地在仓库中进行了贡献的贡献者有 311 位），他们的年龄不等，最年轻的有初中的学生、最老的，嗯这个不需要说了；他们的职业各异，比较多的是大学生，也有很多从事技术工作的专业人员，甚至还有完全不从事技术工作的贡献者。但是，他们都有一个共同的身份就是 LCTT 贡献者，因此，他们都有很多开源兄弟姐妹。\n\n按照惯例，每两年，我会写一篇 LCTT 总结。今年又快到这个时间了，我却有些不知道该如何下笔。恍惚间，我突然想到，LCTT 是一个贡献者组织，是大家的 LCTT，那么，为什么不让大家来为 LCTT 写两句话呢？于是，我在 LCTT 群内发起了号召，请诸位成员写写自己参与 LCTT 的经历、感受或收获，也可以是祝愿、建议。下面，是我收集到的其中一些成员的留言（以留言时的顺序列出）：\n\n- **译者-acyanbird**：Linux 中国是我的开源引路人，让我有机会从零开始参与开源社区，认识到了开源精神，见到了世界的另一个可能性。也借此机会参与不少活动，认识了很多开源人士。目前在组长的帮助下，我也开始自己建立社区，十分感谢您给我这个机会~希望我们都越来越好，有更多的人也来一起参与开源\n- **译者-mandeler**：LCTT community forever！\n- **译者-Kira-Pgr**：For a better open source world!\n- **译者-mengxinayan**：LCTT 不仅可以用来锻炼翻译能力，同时有专人进行校对，能有效找到自身不足。此外还可以用来接触新知新方向，最重要的是可以培养自身英文阅读的习惯。Thanks LCTT！\n- **译者-aftermath0703**：从 LCTT 我收获到了许多知识，有时间我就会去 GitHub 上读读新的文章，有更多时间我就会去翻译一篇。翻译过程中先自己翻译一遍，再用翻译网站翻译一遍，有偏差的地方相互比对，我觉得这对我的各项英语能力都有很大的帮助。希望 LCTT 蓬勃发展，越办越好！\n- **译者-MFGJT**：虽然因为工作原因很久没有翻译了，但是还是每天在看微信公众号。感觉到大家都很努力，希望今年有机会继续参加翻译 🌹\n- **译者-stevending1st**：加入 LCTT 最大的惊叹是核心贡献者能够做到维护一个几百人的贡献者群体，背后是他们巨大的努力。希望能在 LCTT 不断学习，努力提升自己的能力。也祝愿 LCTT 越来越好。\n- **译者-aREversez**：作为一个学翻译的学生，能参与到 LCTT 这样一个项目，了解更多关于开源与技术的知识，见识更宽阔的世界和更深远的历史，让自己能尽己所能为开源贡献一份力量，实属荣幸之至。希望咱们社区能够一直繁荣下去，传播更加丰富多彩的开源技术与思想！\n- **译者-mcfd**：LCTT 翻译的许多实用的技术文章，能够简明、易懂地为广大小白答疑解惑，扫除学习、日常中遇到的坑，间接且不断地为开源社区注入生机。清风不解凌云志，明月无声照九州​。\n- **核心-lkxed**：在裸辞考研失败之后，我曾一度陷入迷茫。偶然间读到老王写的《如何以翻译贡献参与开源社区》，决心加入进来。自此，我从一个连 Git 和 GitHub 都搞不大懂的小白，成长为一名熟练的译者，又成长为一名熟练的选题。踏踏实实地做好一件小事，每天如此，不正是对抗焦虑和迷茫的好办法吗？感谢开源，给了我这个成长的机会；感谢 LCTT，领着我敲开了开源的大门；感谢老王，在我困惑时指点迷津。祝愿 LCTT 越办越好，我们一路与你同行！\n- **核心-bestony**：刚刚专门回到网站上看了一下，我参与 LCTT 已经 8 年了，8 年来，LCTT 见证了我从小透明到半透明，也经历了我人生的三分之一。希望在未来的时间里，我可以和 LCTT 共成长，也可以与 LCTT 共人生。\n- **核心-Locez**：今天是 LCTT 的生日，也是我的生日，一种奇妙的缘分。LCTT 是我接触 LC，接触开源以后第一个比较正式贡献的项目，对我来说意义比较非凡，重要的是通过这个项目在 LC 以及 LCTT 结识到了热爱分享的大家，特别是老王，viz，bestony 等人，很感谢大家在我学生时代起，就对我的一些耐心引导与帮助。\n- **译者-robsean**：科教兴国，实干兴邦\n- **译者-TravinDreek**：作为一位自由软件活动者，我主要从事技术伦理相关文章的翻译。我在 LCTT 的翻译动机，不止在于增进自己对当今技术伦理问题的认识，更在于让人们有机会了解到并利用自由（和开源）软件来应对这些问题。希望 LCTT 今后能在传播 FLOSS 方面起到更大的作用。Happy hacking.\n- **译者-Wlzzzz-del**：之前备考考研时，偶然接触到 LCTT。为了多了解一些 Linux 知识，同时提高自己的英语水平，因此选择加入了 LCTT，这也是我第一次参与开源项目。虽然因为很多原因，翻译的文章不多，但是 LCTT 发布的文章我都会认真阅读。在未来我希望能多抽出时间来，参与到翻译活动中来。\n- **译者-Veryzzj**：今年年初在朋友的介绍下认识了 LCTT 并参与到了其中，仔细回想 LCTT 的意义于我是什么？是打破开源项目于我的神秘面纱，是从申领到翻译每一篇收获的成就感，是发布了文章感受到的正反馈，是在翻译群中和大家交流时的友好气氛。正是这些点滴，是我对抗生命无意义感的武器。我们用语言打破边界，也用语言拓宽世界。预祝 LCTT 越来越好！\n- **译者-Chao-zhi**：加入 LCTT 已经六年了，我已经不记得自己是怎么加入 LCTT 了。但我一直记得我是通过 LCTT 的 wiki 学会使用 GitHub 的。也是通过 LCTT 慢慢了解开源世界的。希望能继续和 LCTT 一起成长。\n- **核心-MjSeven**：但愿 LCTT 长久，千里共婵娟\n- **译者-mudongliang**：LCTT 是早期我参与的开源项目，通过这个项目我学会了很多开源知识，熟练使用 Git 使用，为后期在内核项目贡献，奠定了坚实基础 😁\n- **译者-Northurland**：感谢 LC 治好了我的网友见面恐惧症（笑）。这是我在校园外参与的第一个项目，很感谢组长和 LC 的大家给予我这个机会。希望我们珍视的这个社区在未来能让更多人了解开源、参与开源。\n\n说实话，LCTT 和 Linux 中国能走到今天，全赖这些贡献者的支持，这让我每每感觉吃力时，都有了不能放弃的理由。\n\n那么，你是不是也想加入 LCTT 呢？很简单，访问 LCTT 官网：https://linux.cn/lctt/ 即可了解如何成为一名 LCTT 贡献者了。\n\n最后，感谢大家九年来的支持和信任！顺祝大家中秋节、教师节快乐！\n\n"
        },
        {
          "name": "lctt2023.md",
          "type": "blob",
          "size": 3.8408203125,
          "content": "LCTT 10 年，迎来新蜕变\n======\n\n按惯例，LCTT 每两年会做一次总结，在[第一年](lctt2014.md)、[第三年](lctt2016.md)、[第五年](lctt2018.md)、[第七年](lctt2020.md)、[第九年](lctt2022.md)都分别做了陈文。今年本来不必再赘述，但是，一方面今年是第十年了，这是个有意义的年份；另外一方面，今年以来，生成式 AI 的横空出世也深切影响到了翻译这件事。因此，我觉得有必要写点什么。\n\n十年前的这一天上午，在没有经过预先安排和详细计划的情况下，我在 QQ 群内[发起](https://linux.cn/article-1970-1.html)了 LCTT。原本的初心是翻译 Linux 上的手册页，因为现存的中文手册页实在残破不堪。由于没有协作翻译的经验，当时先建立了一个实验性项目 [TranslateProject](https://github.com/LCTT/TranslateProject/)，收集了一些英文文章来翻译。果然，在这个过程中，我们发现并改正了不少流程上的不足。这些经验甚至成为了其它类似翻译活动的基础。\n\n但是，遗憾的是，作为我们最初的目标，中文手册页项目，却由于种种原因，中道烂尾。至今叹息。\n\n好了，作为十年总结，我应该将过去十年的成绩做个总结。\n\n这十年间，我们总计有 547 位贡献者参与了从选题、翻译、校对到发布等多种贡献；这些贡献者翻译超过 10 篇的译者中有 117 位，超过 100 篇的有 8 位，而最大贡献者 geekpi 一个人就翻译了 2015.5 篇；所有的贡献者们总共翻译了 7929 篇文章。这些文章，仅在我们官方的官网、微信公众号、知乎等内容渠道就获得了上亿次阅读。\n\n通过翻译这些文章，很多人第一次接触了开源，并亲自参与了贡献，学会了使用 GitHub 和 Git，有的人还在日后的学习和工作中，成为了开源贡献者、布道者。\n\n现在回头看，这十年，LCTT 至少还是做了一些**有意义的事情**的。\n\n表完了成绩之后，我谈谈对将来的看法。\n\n可能有的同学已经在我们近期的文章中发现，有部分文章是由 AI（ChatGPT）翻译的。这件事其实给我带来了很大的触动。\n\n之前，我们在翻译过程中，并不排斥译者们使用计算机辅助翻译（CAT）来帮助翻译，比如谷歌翻译、DeepL 等，只要译者能够尽职审阅校对就好，甚至有时候，这些平台会给出一些比手译更合适的参照译法。在这个过程中，这些平台基本上处于参照的地位，并不能有效的形成“信达雅”的译文。\n\n在 OpenAI 的 ChatGPT 横空出世之后，一个最常见的用例就是用来翻译外文内容。我们也做了一些尝试，令我吃惊的是，在经过调校之后，ChatGPT（3.5）可以形成通顺、合理、可信的译文。并且，在经过它的再次润色后，可以更进一步提高译文的可读性。甚至，在个别情况下，它还能找出原文中存在的错误，比如误用的命令。\n\n当然，出于负责的角度，我们会对这些文章进行专门的校对，以免出现被 AI 愚弄的情况。\n\n那么，LCTT 还有存在的必要吗？我认为是有的，一方面，在短期看来，AI 翻译还没有足够成熟，至少在 AI 幻觉没解决之前，并不能完全依赖 AI，尤其是在专业技术领域。另外一方面，AI 确实可以极大地加速翻译过程，提升翻译质量，我们完全可以在相同的贡献者基础上，贡献更多的专业内容。\n\n所以，之后的 LCTT 可能要从“翻译为主，校对为辅”转变为“AI 翻译为辅，专业校对为主”的贡献模式了。顺便说一句，在 Bestony 的努力下，我们已经在开发一个新的 AI 辅助翻译平台，到时候会极大地提升翻译的质量和数量。\n\n那么，让我们期待 LCTT 的下一个十年，一个蜕变的十年吧！"
        },
        {
          "name": "published",
          "type": "tree",
          "content": null
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "sources",
          "type": "tree",
          "content": null
        },
        {
          "name": "translated",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}