{
  "metadata": {
    "timestamp": 1736568319042,
    "page": 238,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjI0MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "robcowart/elastiflow",
      "stars": 2494,
      "defaultBranch": "master",
      "files": [
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 11.787109375,
          "content": "# ROBERT COWART PUBLIC LICENSE\n\t\n1. Definitions\n\n1.1 \"Commercial Use\" means covered code utilized by USER to generate a\n  revenue stream, including but not limited to, embedding the source\n  code in USER's proprietary software, executable software, consulting\n  utilizing the source code, providing commercial support for the\n  source code or product in which it is embedded, or advertisement,\n  demonstration or marketing activities involving the covered code in\n  any manner.\n\n1.2 \"Contributor\" means each entity that creates or contributes to the\n  creation of Modifications.\n\n1.3 \"Covered Code\" means the Original Source Code, Modifications, or\n  the combination of the Original Source Code and Modifications, in\n  each case including portions thereof. The Original Source Code,\n  developed by Robert Cowart is described in the Source Code notice\n  required by Exhibit A.\n\n1.4 \"Source Code\" means the preferred form of the Covered Code for\n  making modifications to it, including all modules it contains, plus\n  any associated interface definition files, scripts used to control\n  compilation and installation of an Executable, or a list of source\n  code differential comparisons against either the Original Source\n  Code or another well known, available Covered Code of the\n  Contributor's choice. The Source Code can be in a compressed or\n  archival form, provided the appropriate decompression or\n  de-archiving software is widely available for no charge.\n\n1.5 \"Electronic Distribution Mechanism\" means a mechanism generally\n  accepted in the software development community for the electronic\n  transfer of data.\n\n1.6 \"Larger Work\" means a work, which combines Covered Code or\n  portions thereof with code not governed by the terms of this\n  License.\n\n1.7 \"License\" means this document.\n\n1.8 \"Licensable\" means having the right to grant, to the maximum\n  extent possible, whether at the time of the initial grant or\n  subsequently acquired, any and all rights conveyed herein.\n\n1.9 \"Modifications\" means any addition to or deletion from the\n  substance or structure of either the Original Source Code or any\n  previous Modifications. When Covered Code is released as a series of\n  files, a Modification is:\n\n  (a) Any addition to or deletion from the contents of a file\n      containing Original Code or previous Modifications.\n\n  (b) Any new file that contains any part of the Original Code or\n      previous Modifications\n\n1.10 \"USER\" (or \"YOU\") means an individual or a legal entity\n  exercising rights under, and complying with all of the terms of this\n  License. For legal entities, USER includes any entity, which\n  controls, is controlled by, or is under common control with You. For\n  purposes of this definition, \"control\" means (a) the power, direct\n  or indirect, to cause the direction or management of such entity,\n  whether by contract or otherwise, or (b) ownership of fifty percent\n  (50%) or more of the outstanding shares or beneficial ownership of\n  such entity.\n\n2. Source Code License.\n\n2.1 The Initial Developer Grant. Robert Cowart hereby grants USER a\n  world-wide, royalty-free, non-exclusive license, subject to third\n  party intellectual property claims:\n\n  (a) to use, reproduce, modify, display, and perform, the Covered\n  Code (or portions thereof) with or without Modifications, or as part\n  of a Larger Work.; and\n\n  (b) under patents now or hereafter owned or controlled by\n  Robert Cowart, to make, have made, and use (\"Utilize\") the Covered\n  Code(or portions thereof), but solely to the extent that any such\n  patent is reasonably necessary to enable USER to Utilize the Covered\n  Code (or portions thereof) and not to any greater extent that may be\n  necessary to Utilize further Modifications or combinations.\n\n  (c) the licenses granted in this Section 2.1(a) and (b) are\n  effective on the date the USER first receives Covered Code.\n\n  (d) No License is granted by Robert Cowart for the Commercial Use of\n  Covered Code under this License.\n\n  (e) No License is granted by Robert Cowart for the distribution of\n  Covered Code under this License.\n\n\n2.2. Contributor Grant. Each Contributor hereby grants Robert Cowart a\n  world-wide, royalty-free, non-exclusive license, subject to third\n  party intellectual property claims:\n\n  (a) to use, reproduce, modify, display, perform, sublicense and\n  distribute the Modifications created by such Contributor (or\n  portions thereof) either on an unmodified basis, with other\n  Modifications, as Covered Code or as part of a Larger Work; and\n\n  (b) under patents now or hereafter owned or controlled by\n  Contributor, to Utilize the Covered Code (or portions thereof), but\n  solely to the extent that any such patent is reasonably necessary to\n  enable USER to Utilize the Contributor Version (or portions\n  thereof), and not to any greater extent that may be necessary to\n  Utilize further Modifications or combinations.\n\n  (c) the licenses granted in this Section 2.2(a) and (b) are\n  effective on the date Robert Cowart first receives the Covered Code.\n\n3. Contributor Obligations\n\n3.1. Intellectual Property Matters\n\n  (a) Third Party Claims. If USER has knowledge that a party claims an\n  intellectual property right in particular functionality or code (or\n  its utilization under this License), USER must include a text file\n  with the source code provided to Robert Cowart titled \"LEGAL\" which\n  describes the claim and the party making the claim in sufficient\n  detail that Robert Cowart will know whom to contact. If USER obtains\n  such knowledge after USER makes the Modification available to\n  Robert Cowart, USER shall promptly modify the LEGAL file in all copies\n  USER makes available thereafter and shall notify Robert Cowart that\n  new knowledge has been obtained.\n\n  (b) Contributor APIs. If Your Modification is an application\n  programming interface and USER owns or controls patents, which are\n  reasonably necessary to implement that API, you must also include\n  this information in the LEGAL file.\n\n3.2. Required Notices. USER must duplicate the notice in Exhibit A in\n  each file or repository of the Source Code, and this License in any\n  documentation for the Source Code, where USER describes recipients'\n  rights relating to Covered Code. If USER created one or more\n  Modification(s), USER may add name as a Contributor to the notice\n  described in Exhibit A. If it is not possible to put such notice in\n  a particular Source Code file due to its structure, then USER must\n  include such notice in a location (such as a relevant directory\n  file) where a user would be likely to look for such a notice.\n\n3.3. Distribution of Executable Versions. This license does not allow\n  distribution of the Covered Code by USER or Contributor.\n\n3.4. Larger Works. USER may create a Larger Work by combining Covered\n  Code with other code not governed by the terms of this License. In\n  such a case, USER must make sure the requirements of this License\n  are fulfilled for the Covered Code including 2.1d and 2.1e.\n\n4. Inability to Comply Due to Statute or Regulation.\n\n  If it is impossible for USER to comply with any of the terms of this\n  License with respect to some or all of the Covered Code due to\n  statute or regulation then USER must:\n\n  (a) comply with the terms of this License to the maximum extent\n  possible; and\n\n  (b) describe the limitations and the code they affect. Such\n  description must be included in the LEGAL file described in Section\n  3.1 and must be included with all distributions of the Source\n  Code. Except to the extent prohibited by statute or regulation, such\n  description must be sufficiently detailed for a recipient of\n  ordinary skill to be able to understand it.\n\n5. Application of this License.\n\n  This License applies to Covered Code attached to the notice in Exhibit A.\n\n6. DISCLAIMER OF WARRANTY.\n\n  COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS,\n  WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\n  INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE COVERED CODE IS\n  FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR\n  NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF\n  THE COVERED CODE IS WITH USER. SHOULD ANY COVERED CODE PROVE\n  DEFECTIVE IN ANY RESPECT, YOU (NOT ROBERT COWART OR ANY OTHER\n  CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR\n  CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL\n  PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED\n  HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n7. TERMINATION.\n\n  This License and the rights granted hereunder will terminate\n  automatically if USER fails to comply with terms herein. All\n  sublicenses to the Covered Code which are properly granted shall\n  survive any termination of this License. Provisions which, by their\n  nature, must remain in effect beyond the termination of this License\n  shall survive.\n\n8. LIMITATION OF LIABILITY.\n\n  UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT\n  (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL ROBERT\n  COWART, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED\n  CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO USER OR\n  ANY OTHER PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR\n  CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT\n  LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER\n  FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR\n  LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE\n  POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT\n  APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH\n  PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH\n  LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR\n  LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION\n  AND LIMITATION MAY NOT APPLY TO USER.\n\n\n9. U.S. GOVERNMENT END USERS,\n\n  The Covered Code is a \"commercial item,\" as that term is defined in\n  48 C.F.R. 2.101 (Oct. 1995). consisting of \"commercial computer\n  software\" and \"commercial computer software documentation,\" as such\n  terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48\n  C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June\n  1995), all U.S. Government End Users acquire Covered Code with only\n  those rights set forth herein.\n\n10. MISCELLANEOUS.\n\n  This License represents the complete agreement concerning subject\n  matter hereof. Nothing in this AGREEMENT shall be construed as\n  conferring by implication, estoppel or otherwise any license or\n  rights other than those granted in this License. If any provision of\n  this License is held to be unenforceable, such provision shall be\n  reformed only to the extent necessary to make it enforceable. This\n  License shall be governed by German law provisions (except to the\n  extent applicable law, if any, provides otherwise). The application\n  of the United Nations Convention on Contracts for the International\n  Sale of Goods is expressly excluded. Any law or regulation which\n  provides that the language of a contract shall be construed against\n  the drafter shall not apply to this License.\n\nEXHIBIT A.\n\nThe contents of this file and/or repository are subject to the Robert\nCowart Public License (the \"License\") and may not be used or\ndistributed except in compliance with the License.\n\nSoftware distributed under the License is distributed on an \"AS IS\"\nbasis, WITHOUT WARRANTY OF ANY KIND, either express or implied.  See\nthe License for the specific language governing rights and limitations\nunder the License.\n\nThe Original Source Code was developed by Robert Cowart.\nPortions created by Robert Cowart are Copyright (C)2018 Robert Cowart.\nAll Rights Reserved.\n\n# GeoIP Databases\n\nThis product includes GeoLite data created by MaxMind, available from (http://www.maxmind.com). The GeoLite databases are distributed under the [Creative Commons Attribution-ShareAlike 4.0 International](https://creativecommons.org/licenses/by-sa/4.0/legalcode) License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 10.1533203125,
          "content": "# This legacy version of ElastiFlow&trade; is now deprecated.\n\n# [Try the new ElastiFlow&trade;!!!](https://www.elastiflow.com)\n\n## PLEASE NOTE: This repository remains for historical purposes, however no part of this legacy solution is shared with the next generation of ElastiFlow&trade;. To install the new solution please refer to the documentation at [docs.elastiflow.com](https://docs.elastiflow.com). For assistance with the new solution, please join the [ElastiFlow Community Slack](https://join.slack.com/t/elastiflowcommunity/shared_invite/zt-23jpnlw9g-Q4nKOwKKOE1N2MjfA2mXpg).\n\nNow that the new ElastiFlow&trade; Unified Flow Collector is generally available, the legacy Logstash-based solution in this repository is deprecated. It will remain here for historical purposes, but will not receive updates. You are encouraged to try out the new collector. See more details below.\n\n# We have released the next generation of ElastiFlow&trade; which introduces the new ElastiFlow Unified Flow Collector for Netflow, IPFIX and sFlow.\n\n### Some of the enhancements included in the all-new collector include:\n\n* **Proper management templates from different devices. - NO MORE template conflicts!**\n* **Improved Scalability - Over 10x more flows/sec than Logstash, over 3x more than Filebeat!**\n* **Support for Option Templates - Dynamic enrichment of network interface name and application names and more!**\n* **Telemetry Support - sFlow Counter Samples and other metrics from Cisco, Calix and more!**\n* **Gracefully handles “unknown” Fields - No more dropped flows when a single unsupported field is encountered.**\n* **Fully decodes and translates all available data - DSCP, TCP Options, ECN, Fragmentation Flags, and more.**\n\n### Get Started with the next generation of ElastiFlow... [HERE](https://docs.elastiflow.com)\n\n### You can also join the ElastiFlow community Slack... [HERE](https://join.slack.com/t/elastiflowcommunity/shared_invite/zt-23jpnlw9g-Q4nKOwKKOE1N2MjfA2mXpg)\n\nElastiFlow&trade; provides network flow data collection and visualization using the Elastic Stack (Elasticsearch, Logstash and Kibana). It supports Netflow v5/v9, sFlow and IPFIX flow types (1.x versions support only Netflow v5/v9).\n\n![ElastiFlow&trade;](https://user-images.githubusercontent.com/10326954/89781356-727ede00-db13-11ea-8130-73562a8593f8.png)\n\nI was inspired to create ElastiFlow&trade; following the overwhelmingly positive feedback received to an article I posted on Linkedin... [WTFlow?! Are you really still paying for commercial solutions to collect and analyze network flow data?](https://www.linkedin.com/pulse/wtflow-you-really-still-paying-commercial-solutions-collect-cowart)\n\n## User Testimonials\n\nOrganization | Feedback\n--- | ---\n![Uber](https://user-images.githubusercontent.com/10326954/81165240-f44df100-8f91-11ea-94e5-24da16db801b.png) | ***\"ElastiFlow has significantly reduced our network flow monitoring costs. The flexibility and extensibility inherent to ElastiFlow was essential for an easy integration with our infrastructure monitoring suite.\"***\n![ESnet](https://user-images.githubusercontent.com/10326954/44616427-b2c5f280-a84f-11e8-8add-1a458bffec68.png) | ***“Right now this is my personal favorite analytics tool. I use it extensively and am always finding a new way to leverage it.\"***\n![Payback](https://user-images.githubusercontent.com/10326954/44616291-64afef80-a84d-11e8-804f-6537897bfe85.png) | ***\"We're using it since two months in our new datacenter and our network admins are very happy and impressed.\"***\n![Catapult Systems](https://user-images.githubusercontent.com/10326954/44616396-2c111580-a84f-11e8-92dd-a509064d02f8.png) | ***\"Of all the netflow tools I’ve tested it has, by far, the best visualizations.\"***\n![Imagine Software](https://user-images.githubusercontent.com/10326954/44616477-ee14f100-a850-11e8-9133-26917020e685.png) | ***\"We absolutely love ElastiFlow and recently stood it up in production. Looking forward to new functionality and dashboards.\"***\n\n## Getting Started\n\n> **NOTE** - Please refer to `INSTALL.md` for installation instructions.\n\nElastiFlow&trade; is built using the Elastic Stack, including Elasticsearch, Logstash and Kibana. Please refer to [INSTALL.md](https://github.com/robcowart/elastiflow/blob/master/INSTALL.md) for instructions on how to install and configure ElastiFlow&trade;.\n\nIf you are new to the Elastic Stack, this video goes beyond a simple default installation of Elasticsearch and Kibana. It discusses real-world best practices for hardware sizing and configuration, providing production-level performance and reliability.\n\n[![0003_es_install](https://user-images.githubusercontent.com/10326954/76195457-9ea2d580-61e8-11ea-8578-8fb39908afec.png)](https://www.youtube.com/watch?v=gZb7HpVOges)\n\nAdditionally local SSD storage should be considered as _*mandatory*_! For an in-depth look at how different storage options compare, and in particular how bad HDD-based storage is for Elasticsearch (even in multi-drive RAID0 configurations) you should watch this video...\n\n[![0001_es_storage](https://user-images.githubusercontent.com/10326954/76195348-61d6de80-61e8-11ea-951d-1694d2e0392b.png)](https://www.youtube.com/watch?v=nKUpfJCBiS4)\n\n> NOTE: Please make sure that have reviewed [KNOWN_ISSUES.md](https://github.com/robcowart/elastiflow/blob/master/KNOWN_ISSUES.md) prior to getting started.\n\n## Kibana App Compatibility\n\n### SIEM\n\n![SIEM: Hosts](https://user-images.githubusercontent.com/10326954/89768012-4ce5da80-dafb-11ea-8184-e443569f8de6.png)\n\n![SIEM: Network Map](https://user-images.githubusercontent.com/10326954/89768129-7e5ea600-dafb-11ea-9ca5-dc8c3946a2ce.png)\n\n![SIEM: Network Statistics](https://user-images.githubusercontent.com/10326954/89778819-71977d80-db0e-11ea-8671-4d1847220294.png)\n\n### Logs\n\n![Logs](https://user-images.githubusercontent.com/10326954/89778984-bae7cd00-db0e-11ea-9a78-9a765b9a6cec.png)\n\n## Provided Dashboards\n\nThe following dashboards are provided.\n\n> NOTE: The dashboards are optimized for a monitor resolution of 1920x1080.\n\n### Overview\n\n![Overview](https://user-images.githubusercontent.com/10326954/89779068-e79be480-db0e-11ea-8c02-8342d0eddd16.png)\n\n### Top-N\n\nThere are separate Top-N dashboards for Top Talkers, Services, Conversations and Applications.\n\n#### Top Talkers\n\n![Top Talkers](https://user-images.githubusercontent.com/10326954/89779132-04d0b300-db0f-11ea-9552-52e86233bff1.png)\n\n#### Top Services\n\n![Top Services](https://user-images.githubusercontent.com/10326954/89779155-0ef2b180-db0f-11ea-8fec-425a09bf46ab.png)\n\n#### Top Conversations\n\n![Top Conversations](https://user-images.githubusercontent.com/10326954/89779190-1ca83700-db0f-11ea-9328-596bb2aca807.png)\n\n#### Top Applications\n\n![Top Applications](https://user-images.githubusercontent.com/10326954/89779238-32b5f780-db0f-11ea-8499-b45916d551f7.png)\n\n### Threats\n\nElastiFlow&trade; includes a dictionary of public IP addresses that are known to have a poor reputation. This dictionary is built from many OSINT data sources, normalized to a common taxonomy. The Threats dashboard uses this IP reputation information to highlight three threat/risk types.\n\n1. Public Threats - Public clients with a poor IP reputation that are reaching private addresses.\n2. At-Risk Servers - Private Servers that are being reached by clients with a poor IP reputation.\n3. High-Risk Clients - Private clients that are accessing public servers which have a poor reputation.\n\n![Threats](https://user-images.githubusercontent.com/10326954/89779418-95a78e80-db0f-11ea-9e80-7cf070bd1678.png)\n\n### Flows\n\nThere are separate Sankey dashboards for Client/Server, Source/Destination and Autonomous System perspectives. The sankey visualizations are built using the new Vega visualization plugin.\n\n#### Client/Server Flows\n\n![Client/Server Flows](https://user-images.githubusercontent.com/10326954/89767564-7a7e5400-dafa-11ea-8ed6-2fa105b92b83.png)\n\n#### Source/Destination Flows\n\n![Source/Destination Flows](https://user-images.githubusercontent.com/10326954/89767666-b0233d00-dafa-11ea-80f0-b0f6622c587d.png)\n\n#### Autonomous System Flows\n\n![Autonomous System Flows](https://user-images.githubusercontent.com/10326954/89767825-fd9faa00-dafa-11ea-9c8e-7990d42df9f7.png)\n\n### Geo IP\n\nThere are separate Geo Location dashboards for Client/Server and Source/Destination perspectives.\n\n#### Client/Server Geo IP\n\n![Client/Server Geo IP](https://user-images.githubusercontent.com/10326954/89779669-30a06880-db10-11ea-84f3-8e47567ea406.png)\n\n#### Source/Destination Geo IP\n\n![Source/Destination Geo IP](https://user-images.githubusercontent.com/10326954/89779620-18304e00-db10-11ea-94cb-742f82131847.png)\n\n### AS Traffic\n\nProvides a view of traffic to and from Autonomous Systems (public IP ranges)\n\n![AS Traffic](https://user-images.githubusercontent.com/10326954/89780350-90e3da00-db11-11ea-9a5d-d267c7efec8f.png)\n\n### Flow Exporters\n\n![Flow Exporters](https://user-images.githubusercontent.com/10326954/89780532-e7e9af00-db11-11ea-8790-011b55ba70cd.png)\n\n### Traffic Details\n\nProvides more detailed breakdown of various network traffic characteristics.\n\n#### Traffic Types\n\n![Traffic Types](https://user-images.githubusercontent.com/10326954/89780642-23847900-db12-11ea-8e89-534a5a123f7b.png)\n\n#### Traffic Attributes\n\n![Traffic Attributes](https://user-images.githubusercontent.com/10326954/89780668-3008d180-db12-11ea-9853-b71cb62f87b9.png)\n\n#### Traffic Locality\n\n![Traffic Locality](https://user-images.githubusercontent.com/10326954/89780691-3c8d2a00-db12-11ea-89a8-23676a8b0d31.png)\n\n### Flow Records\n\n#### Client/Server\n\n![Client/Server](https://user-images.githubusercontent.com/10326954/89780818-752d0380-db12-11ea-9e9b-ab0f1cf02b06.png)\n\n#### Source/Destination\n\n![Source/Destination](https://user-images.githubusercontent.com/10326954/89780834-7d853e80-db12-11ea-9c3f-44524093e1f1.png)\n\n### Ziften ZFlow\n\nElastiFlow&trade; v3.4.0 added support for IPFIX records from Ziften's ZFlow agent. In addition to being fully integrated with the standard dashboards, a stand-alone ZFlow dashboards displays network traffic based on user and command data provided by ZFlow.\n![Ziften ZFlow](https://user-images.githubusercontent.com/10326954/89780960-b32a2780-db12-11ea-8a29-4fff55a343e7.png)\n\n## Attribution\n\nThis product includes GeoLite2 data created by MaxMind, available from (http://www.maxmind.com)\n"
        },
        {
          "name": "www.elastiflow.com",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}