{
  "metadata": {
    "timestamp": 1736712270402,
    "page": 32,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "fuzzdb-project/fuzzdb",
      "stars": 8328,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0107421875,
          "content": "*.DS_Store\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 6.41015625,
          "content": "FuzzDB was created to increase the likelihood of finding application security vulnerabilities through dynamic application security testing. It's the first and most comprehensive open dictionary of fault injection patterns, predictable resource locations, and regex for matching server responses.  \r\n\r\n**Attack Patterns -**\r\nFuzzDB contains comprehensive lists of [attack payload](https://github.com/fuzzdb-project/fuzzdb/tree/master/attack) primitives for fault injection testing. \r\nThese patterns, categorized by attack and where appropriate platform type, are known to cause issues like OS command injection, directory listings, directory traversals, source exposure, file upload bypass, authentication bypass, XSS, http header crlf injections, SQL injection, NoSQL injection, and more. For example, FuzzDB catalogs 56 patterns that can potentially be interpreted as a null byte and contains lists of [commonly used methods](https://github.com/fuzzdb-project/fuzzdb/blob/master/attack/business-logic/CommonMethodNames.txt) such as \"get, put, test,\" and name-value pairs than [trigger debug modes](https://github.com/fuzzdb-project/fuzzdb/blob/master/attack/business-logic/CommonDebugParamNames.txt).<br>\r\n\r\n**Discovery -**\r\nThe popularity of standard software packaging distribution formats and installers resulted in resources like [logfiles and administrative directories](http://www.owasp.org/index.php/Forced_browsing) frequently being located in a small number of [predictable locations](https://github.com/fuzzdb-project/fuzzdb/tree/master/discovery/predictable-filepaths).\r\nFuzzDB contains a comprehensive dictionary, sorted by platform type, language, and application, making brute force testing less brutish.<br>\r\nhttps://github.com/fuzzdb-project/fuzzdb/tree/master/discovery\r\n\r\n**Response Analysis -**\r\nMany interesting server responses are [predictable strings](https://github.com/fuzzdb-project/fuzzdb/tree/master/regex). \r\nFuzzDB contains a set of regex pattern dictionaries to match against server responses. In addition to common server error messages, FuzzDB contains regex for credit cards, social security numbers, and more.<br>\r\n\r\n**Other useful stuff -**\r\nWebshells in different languages, common password and username lists, and some handy wordlists.\r\n\r\n**Documentation -**\r\nMany directories contain a README.md file with usage notes.\r\nA collection of [documentation](https://github.com/fuzzdb-project/fuzzdb/tree/master/docs) from around the web that is helpful for using FuzzDB to construct test cases is also included. <br>\r\n\r\n### Usage tips for pentesting with FuzzDB ###\r\nhttps://github.com/fuzzdb-project/fuzzdb/wiki/usagehints\r\n\r\n### How people use FuzzDB ###\r\nFuzzDB is like an application security scanner, without the scanner. \r\nSome ways to use FuzzDB:\r\n  * Website and application service black-box penetration testing with \r\n   * [OWASP Zap](https://www.owasp.org/index.php/OWASP_Zed_Attack_Proxy_Project) proxy's FuzzDB Zap Extension \r\n   * Burp Proxy's [intruder](http://portswigger.net/intruder/) tool and scanner\r\n   * [PappyProxy](http://www.pappyproxy.com/), a console-based intercepting proxy\r\n  * To identify interesting service responses using grep patterns for PII, credit card numbers, error messages, and more\r\n  * Inside custom tools for testing software and application protocols\r\n  * Crafting security test cases for GUI or command line software with standard test automation tools\r\n  * Incorporating into other Open Source software or commercial products\r\n  * In training materials and documentation\r\n  * To learn about software exploitation techniques\r\n  * To improve your security testing product or service\r\n \r\n### How were the patterns collected? ###\r\nMany, many hours of research and pentesting. And\r\n  * analysis of default app installs\r\n  * analysis of system and application documentation\r\n  * analysis of error messages\r\n  * researching old web exploits for repeatable attack strings\r\n  * scraping scanner payloads from  http logs\r\n  * various books, articles, blog posts, mailing list threads\r\n  * other open source fuzzers and pentest tools\r\nand the input of contributors: https://github.com/fuzzdb-project/fuzzdb/graphs/contributors\r\n\r\n### Places you can find FuzzDB ###\r\nOther security tools and projects that incorporate FuzzzDB in whole or part\r\n  * OWASP Zap Proxy fuzzdb plugin https://www.owasp.org/index.php/OWASP_Zed_Attack_Proxy_Project\r\n  * SecLists https://github.com/danielmiessler/SecLists\r\n  * TrustedSec Pentesters Framework https://github.com/trustedsec/ptf\r\n  * Rapid7 Metasploit https://github.com/rapid7/metasploit-framework\r\n  * Portswigger Burp Suite http://portswigger.net\r\n  * Protofuzz https://github.com/trailofbits/protofuzz\r\n  * BlackArch Linux https://www.blackarch.org/\r\n  * ArchStrike Linux https://archstrike.org/\r\n\r\n### Download ###\r\n**Preferred method is to check out sources via git, new payloads are added frequently**\r\n\r\n```\r\ngit clone https://github.com/fuzzdb-project/fuzzdb.git --depth 1\r\n\r\n```\r\nWhile in the FuzzDB dir, you can update your local repo with the command\r\n```\r\ngit pull\r\n```\r\nThis Stackoverflow gives ideas on how to keep a local repository tidy: https://stackoverflow.com/questions/38171899/how-to-reduce-the-depth-of-an-existing-git-clone/46004595#46004595\r\n\r\nYou can also browse the [FuzzDB github sources](https://github.com/fuzzdb-project/fuzzdb/) and there is always a fresh [zip file](https://github.com/fuzzdb-project/fuzzdb/archive/master.zip)\r\n\r\nNote: Some antivirus/antimalware software will alert on FuzzDB. To resolve, the filepath should be whitelisted. There is nothing in FuzzDB that can harm your computer as-is, however due to the risk of local file include attacks it's not recommended to store this repository on a server or other important system. Use at your own risk. \r\n\r\n### Who ###\r\nFuzzDB was created by Adam Muntner (amuntner @ gmail.com)\r\nFuzzDB (c) Copyright Adam Muntner, 2010-2019\r\nPortions copyrighted by others, as noted in commit comments and README.md files. \r\n\r\nThe FuzzDB license is New BSD and Creative Commons by Attribution. The ultimate goal of this project is to make the patterns contained within obsolete. If you use this project in your work, research, or commercial product, you are required to cite it. That's it. I always enjoy hearing about how people are using it to find an interesting bug or in a tool, send me an email and let me know. \r\n\r\nSubmissions are always welcome!\r\n\r\nOfficial FuzzDB project page: [https://github.com/fuzzdb-project/fuzzdb/](https://github.com/fuzzdb-project/fuzzdb/)\r\n"
        },
        {
          "name": "_copyright.txt",
          "type": "blob",
          "size": 3.20703125,
          "content": "Copyright (c) 2010-2019, Adam Muntner\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\nNeither the name of fuzzdb  nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nLicensed under Creative Commons - By Attribution\n\nsee\n\nhttp://creativecommons.org/licenses/by/3.0/legalcode\n\n----\n\ncontains dictionaries from Skipfish\n Copyright 2010 Michal Zalewski\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n----\n\nThe MIT License (MIT)\n\nCopyright (c) 2015 Max Woolf\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n"
        },
        {
          "name": "attack",
          "type": "tree",
          "content": null
        },
        {
          "name": "discovery",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "fuzzdb-icon.png",
          "type": "blob",
          "size": 5.294921875,
          "content": null
        },
        {
          "name": "fuzzdb.png",
          "type": "blob",
          "size": 23.982421875,
          "content": null
        },
        {
          "name": "regex",
          "type": "tree",
          "content": null
        },
        {
          "name": "web-backdoors",
          "type": "tree",
          "content": null
        },
        {
          "name": "wordlists-misc",
          "type": "tree",
          "content": null
        },
        {
          "name": "wordlists-user-passwd",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}