{
  "metadata": {
    "timestamp": 1736712278890,
    "page": 47,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjUw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "DevinVinson/WordPress-Plugin-Boilerplate",
      "stars": 7699,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.37109375,
          "content": "# Numerous always-ignore extensions\n*.diff\n*.err\n*.orig\n*.log\n*.rej\n*.swo\n*.swp\n*.vi\n*~\n*.sass-cache\n\n# OS or Editor folders\n.DS_Store\nThumbs.db\n.cache\n.project\n.settings\n.tmproj\n*.esproj\nnbproject\n*.sublime-project\n*.sublime-workspace\n\n# Dreamweaver added files\n_notes\ndwsync.xml\n\n# Komodo\n*.komodoproject\n.komodotools\n\n# Folders to ignore\n.hg\n.svn\n.CVS\nintermediate\n.idea\ncache\n"
        },
        {
          "name": "CHANGELOG.md",
          "type": "blob",
          "size": 0.3046875,
          "content": "# Changelog\n* (3 July 2015). Flattened the folder structure so there is no .org repo parent folder.\n* (4 September 2014). Updating the `README` with Windows symbolic link instructions.\n* (3 September 2014). Updating the `README` to describe how to install the Boilerplate.\n* (1 September 2014). Initial Release.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 5.91015625,
          "content": "# WordPress Plugin Boilerplate\n\nA standardized, organized, object-oriented foundation for building high-quality WordPress Plugins.\n\n## Contents\n\nThe WordPress Plugin Boilerplate includes the following files:\n\n* `.gitignore`. Used to exclude certain files from the repository.\n* `CHANGELOG.md`. The list of changes to the core project.\n* `README.md`. The file that you’re currently reading.\n* A `plugin-name` directory that contains the source code - a fully executable WordPress plugin.\n\n## Features\n\n* The Boilerplate is based on the [Plugin API](http://codex.wordpress.org/Plugin_API), [Coding Standards](http://codex.wordpress.org/WordPress_Coding_Standards), and [Documentation Standards](https://make.wordpress.org/core/handbook/best-practices/inline-documentation-standards/php/).\n* All classes, functions, and variables are documented so that you know what you need to change.\n* The Boilerplate uses a strict file organization scheme that corresponds both to the WordPress Plugin Repository structure, and that makes it easy to organize the files that compose the plugin.\n* The project includes a `.pot` file as a starting point for internationalization.\n\n## Installation\n\nThe Boilerplate can be installed directly into your plugins folder \"as-is\". You will want to rename it and the classes inside of it to fit your needs. For example, if your plugin is named 'example-me' then:\n\n* rename files from `plugin-name` to `example-me`\n* change `plugin_name` to `example_me`\n* change `plugin-name` to `example-me`\n* change `Plugin_Name` to `Example_Me`\n* change `PLUGIN_NAME_` to `EXAMPLE_ME_`\n\nIt's safe to activate the plugin at this point. Because the Boilerplate has no real functionality there will be no menu items, meta boxes, or custom post types added until you write the code.\n\n## WordPress.org Preparation\n\nThe original launch of this version of the boilerplate included the folder structure needed for using your plugin on WordPress.org. That folder structure has been moved to its own repo here: https://github.com/DevinVinson/Plugin-Directory-Boilerplate\n\n## Recommended Tools\n\n### i18n Tools\n\nThe WordPress Plugin Boilerplate uses a variable to store the text domain used when internationalizing strings throughout the Boilerplate. To take advantage of this method, there are tools that are recommended for providing correct, translatable files:\n\n* [Poedit](http://www.poedit.net/)\n* [makepot](http://i18n.svn.wordpress.org/tools/trunk/)\n* [i18n](https://github.com/grappler/i18n)\n\nAny of the above tools should provide you with the proper tooling to internationalize the plugin.\n\n## License\n\nThe WordPress Plugin Boilerplate is licensed under the GPL v2 or later.\n\n> This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License, version 2, as published by the Free Software Foundation.\n\n> This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\n> You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA\n\nA copy of the license is included in the root of the plugin’s directory. The file is named `LICENSE`.\n\n## Important Notes\n\n### Licensing\n\nThe WordPress Plugin Boilerplate is licensed under the GPL v2 or later; however, if you opt to use third-party code that is not compatible with v2, then you may need to switch to using code that is GPL v3 compatible.\n\nFor reference, [here's a discussion](http://make.wordpress.org/themes/2013/03/04/licensing-note-apache-and-gpl/) that covers the Apache 2.0 License used by [Bootstrap](http://twitter.github.io/bootstrap/).\n\n### Includes\n\nNote that if you include your own classes, or third-party libraries, there are three locations in which said files may go:\n\n* `plugin-name/includes` is where functionality shared between the admin area and the public-facing parts of the site reside\n* `plugin-name/admin` is for all admin-specific functionality\n* `plugin-name/public` is for all public-facing functionality\n\nNote that previous versions of the Boilerplate did not include `Plugin_Name_Loader` but this class is used to register all filters and actions with WordPress.\n\nThe example code provided shows how to register your hooks with the Loader class.\n\n### What About Other Features?\n\nThe previous version of the WordPress Plugin Boilerplate included support for a number of different projects such as the [GitHub Updater](https://github.com/afragen/github-updater).\n\nThese tools are not part of the core of this Boilerplate, as I see them as being additions, forks, or other contributions to the Boilerplate.\n\nThe same is true of using tools like Grunt, Composer, etc. These are all fantastic tools, but not everyone uses them. In order to  keep the core Boilerplate as light as possible, these features have been removed and will be introduced in other editions, and will be listed and maintained on the project homepage.\n\n# Credits\n\nThe WordPress Plugin Boilerplate was started in 2011 by [Tom McFarlin](http://twitter.com/tommcfarlin/) and has since included a number of great contributions. In March of 2015 the project was handed over by Tom to Devin Vinson.\n\nThe current version of the Boilerplate was developed in conjunction with [Josh Eaton](https://twitter.com/jjeaton), [Ulrich Pogson](https://twitter.com/grapplerulrich), and [Brad Vincent](https://twitter.com/themergency).\n\nThe homepage is based on a design as provided by [HTML5Up](http://html5up.net), the Boilerplate logo was designed by Rob McCaskill of [BungaWeb](http://bungaweb.com), and the site `favicon` was created by [Mickey Kay](https://twitter.com/McGuive7).\n\n## Documentation, FAQs, and More\n\nIf you’re interested in writing any documentation or creating tutorials please [let me know](http://devinvinson.com/contact/) .\n"
        },
        {
          "name": "plugin-name",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}