{
  "metadata": {
    "timestamp": 1736710478533,
    "page": 12,
    "hasNextPage": false,
    "endCursor": "Y3Vyc29yOjE5",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "cfenollosa/os-tutorial",
      "stars": 27680,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.04296875,
          "content": "*.bin\n*.o\n*.swp\n*.dis\n*.elf\n*.sym\n.DS_STORE\n"
        },
        {
          "name": "00-environment",
          "type": "tree",
          "content": null
        },
        {
          "name": "01-bootsector-barebones",
          "type": "tree",
          "content": null
        },
        {
          "name": "02-bootsector-print",
          "type": "tree",
          "content": null
        },
        {
          "name": "03-bootsector-memory",
          "type": "tree",
          "content": null
        },
        {
          "name": "04-bootsector-stack",
          "type": "tree",
          "content": null
        },
        {
          "name": "05-bootsector-functions-strings",
          "type": "tree",
          "content": null
        },
        {
          "name": "06-bootsector-segmentation",
          "type": "tree",
          "content": null
        },
        {
          "name": "07-bootsector-disk",
          "type": "tree",
          "content": null
        },
        {
          "name": "08-32bit-print",
          "type": "tree",
          "content": null
        },
        {
          "name": "09-32bit-gdt",
          "type": "tree",
          "content": null
        },
        {
          "name": "10-32bit-enter",
          "type": "tree",
          "content": null
        },
        {
          "name": "11-kernel-crosscompiler",
          "type": "tree",
          "content": null
        },
        {
          "name": "12-kernel-c",
          "type": "tree",
          "content": null
        },
        {
          "name": "13-kernel-barebones",
          "type": "tree",
          "content": null
        },
        {
          "name": "14-checkpoint",
          "type": "tree",
          "content": null
        },
        {
          "name": "15-video-ports",
          "type": "tree",
          "content": null
        },
        {
          "name": "16-video-driver",
          "type": "tree",
          "content": null
        },
        {
          "name": "17-video-scroll",
          "type": "tree",
          "content": null
        },
        {
          "name": "18-interrupts",
          "type": "tree",
          "content": null
        },
        {
          "name": "19-interrupts-irqs",
          "type": "tree",
          "content": null
        },
        {
          "name": "20-interrupts-timer",
          "type": "tree",
          "content": null
        },
        {
          "name": "21-shell",
          "type": "tree",
          "content": null
        },
        {
          "name": "22-malloc",
          "type": "tree",
          "content": null
        },
        {
          "name": "23-fixes",
          "type": "tree",
          "content": null
        },
        {
          "name": "24-el-capitan",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.48046875,
          "content": "BSD 3-Clause License\n\nCopyright (c) 2018, Carlos Fenollosa\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the copyright holder nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 4.0771484375,
          "content": "os-tutorial\n===========\n\n_⚠️ Hey! This is an old, abandoned project, with both technical and design issues [listed here](https://github.com/cfenollosa/os-tutorial/issues/269). Please have fun with this tutorial but do look for more modern and authoritative sources if you want to learn about OS design. ⚠️_\n\nHow to create an OS from scratch!\n\nI have always wanted to learn how to make an OS from scratch. In college I was taught\nhow to implement advanced features (pagination, semaphores, memory management, etc)\nbut:\n\n- I never got to start from my own boot sector\n- College is hard so I don't remember most of it.\n- I'm fed up with people who think that reading an already existing kernel, even if small, is \na good idea to learn operating systems.\n\nInspired by [this document](http://www.cs.bham.ac.uk/~exr/lectures/opsys/10_11/lectures/os-dev.pdf)\nand the [OSDev wiki](http://wiki.osdev.org/), I'll try to make short step-by-step READMEs and\ncode samples for anybody to follow. Honestly, this tutorial is basically the first document but\nsplit into smaller pieces and without the theory.\n\nUpdated: more sources: [the little book about OS development](https://littleosbook.github.io),\n[JamesM's kernel development tutorials](https://web.archive.org/web/20160412174753/http://www.jamesmolloy.co.uk/tutorial_html/index.html)\n\n\nFeatures\n--------\n\n- This course is a code tutorial aimed at people who are comfortable with low level computing. For example,\nprogrammers who have curiosity on how an OS works but don't have the time or willpower to start reading the Linux kernel\ntop to bottom.\n- There is little theory. Yes, this is a feature. Google is your theory lecturer. Once you pass college, \nexcessive theory is worse than no theory because it makes things seem more difficult than they really are.\n- The lessons are tiny and may take 5-15 minutes to complete. Trust me and trust yourself. You can do it!\n\n\nHow to use this tutorial\n------------------------\n\n1. Start with the first folder and go down in order. They build on previous code, so if \nyou jump right to folder 05 and don't know why there is a `mov ah, 0x0e`, it's because you missed lecture 02.\nReally, just go in order. You can always skip stuff you already know.\n\n2. Open the README and read the first line, which details the concepts you should be familiar with\nbefore reading the code. Google concepts you are not familiar with. The second line states the goals for each lesson. \nRead them, because they explain why we do what we do. The \"why\" is as important as the \"how\".\n \n3. Read the rest of the README. It is **very concise**.\n\n4. (Optional) Try to write the code files by yourself after reading the README.\n\n5. Look at the code examples. They are extremely well commented.\n\n6. (Optional) Experiment with them and try to break things. The only way to make sure you understood something is\ntrying to break it or replicate it with different commands.\n\n\nTL;DR: First read the README on each folder, then the code files. If you're brave, try to code them yourself.\n\n\nStrategy\n--------\n\nWe will want to do many things with our OS:\n\n- Boot from scratch, without GRUB - DONE!\n- Enter 32-bit mode - DONE\n- Jump from Assembly to C - DONE!\n- Interrupt handling - DONE!\n- Screen output and keyboard input - DONE!\n- A tiny, basic `libc` which grows to suit our needs - DONE!\n- Memory management\n- Write a filesystem to store files\n- Create a very simple shell\n- User mode\n- Maybe we will write a simple text editor\n- Multiple processes and scheduling\n\nProbably we will go through them in that order, however it's soon to tell.\n\nIf we feel brave enough:\n\n- A BASIC interpreter, like in the 70s!\n- A GUI\n- Networking\n\n\n\nContributing\n------------\n\nThis is a personal learning project, and even though it hasn't been updated for a long time, I still have hopes to get into it at some point.\n\nI'm thankful to all those who have pointed out bugs and submitted pull requests. I will need some time to review everything and I cannot guarantee that at this moment.\n\nPlease feel free to fork this repo. If many of you are interested in continuing the project, let me know and I'll link the \"main fork\" from here.\n"
        }
      ]
    }
  ]
}