{
  "metadata": {
    "timestamp": 1736710481658,
    "page": 18,
    "hasNextPage": false,
    "endCursor": "Y3Vyc29yOjE5",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "nginx/nginx",
      "stars": 25760,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 5.0927734375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nWe as members, contributors, and leaders pledge to make participation in our\ncommunity a harassment-free experience for everyone, regardless of age, body\nsize, visible or invisible disability, ethnicity, sex characteristics, gender\nidentity and expression, level of experience, education, socio economic status,\nnationality, personal appearance, race, caste, color, religion, or sexual\nidentity and orientation.\n\nWe pledge to act and interact in ways that contribute to an open, welcoming,\ndiverse, inclusive, and healthy community.\n\n## Our Standards\n\nExamples of behavior that contributes to a positive environment for our\ncommunity include:\n\n- Demonstrating empathy and kindness toward other people\n- Being respectful of differing opinions, viewpoints, and experiences\n- Giving and gracefully accepting constructive feedback\n- Accepting responsibility and apologizing to those affected by our mistakes\nand learning from the experience\n- Focusing on what is best not just for us as individuals, but for the\noverall community\n\nExamples of unacceptable behavior include:\n\n- The use of sexualized language or imagery, and sexual attention or advances\nof any kind\n- Trolling, insulting or derogatory comments, and personal or political attacks\n- Public or private harassment\n- Publishing others' private information, such as a physical or email address,\nwithout their explicit permission\n- Other conduct which could reasonably be considered inappropriate in a\nprofessional setting\n\n## Enforcement Responsibilities\n\nCommunity leaders are responsible for clarifying and enforcing our standards\nof acceptable behavior and will take appropriate and fair corrective action\nin response to any behavior that they deem inappropriate, threatening,\noffensive, or harmful.\n\nCommunity leaders have the right and responsibility to remove, edit, or reject\ncomments, commits, code, wiki edits, issues, and other contributions that are\nnot aligned to this Code of Conduct, and will communicate reasons for\nmoderation decisions when appropriate.\n\n## Scope\n\nThis Code of Conduct applies within all community spaces, and also applies when\nan individual is officially representing the community in public spaces.\nExamples of representing our community include using an official email address,\nposting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported to the community leaders responsible for enforcement at\n<nginx-oss-community@f5.com>. All complaints will be reviewed and investigated\npromptly and fairly.\n\nAll community leaders are obligated to respect the privacy and security of the\nreporter of any incident.\n\n## Enforcement Guidelines\n\nCommunity leaders will follow these Community Impact Guidelines in determining\nthe consequences for any action they deem in violation of this Code of Conduct:\n\n### 1. Correction\n\n**Community Impact**: Use of inappropriate language or other behavior deemed\nunprofessional or unwelcome in the community.\n\n**Consequence**: A private, written warning from community leaders, providing\nclarity around the nature of the violation and an explanation of why the\nbehavior was inappropriate. A public apology may be requested.\n\n### 2. Warning\n\n**Community Impact**: A violation through a single incident or series of actions.\n\n**Consequence**: A warning with consequences for continued behavior. No\ninteraction with the people involved, including unsolicited interaction with\nthose enforcing the Code of Conduct, for a specified period of time. This\nincludes avoiding interactions in community spaces as well as external\nchannels like social media. Violating these terms may lead to a temporary or\npermanent ban.\n\n### 3. Temporary Ban\n\n**Community Impact**: A serious violation of community standards, including\nsustained inappropriate behavior.\n\n**Consequence**: A temporary ban from any sort of interaction or public\ncommunication with the community for a specified period of time. No public or\nprivate interaction with the people involved, including unsolicited interaction\nwith those enforcing the Code of Conduct, is allowed during this period.\nViolating these terms may lead to a permanent ban.\n\n### 4. Permanent Ban\n\n**Community Impact**: Demonstrating a pattern of violation of community\nstandards, including sustained inappropriate behavior, harassment of an\nindividual, or aggression toward or disparagement of classes of individuals.\n\n**Consequence**: A permanent ban from any sort of public interaction within\nthe community.\n\n## Attribution\n\nThis Code of Conduct is adapted from the\n[Contributor Covenant](https://www.contributor-covenant.org), version 2.1,\navailable at\n<https://www.contributor-covenant.org/version/2/1/code_of_conduct.html>.\n\nCommunity Impact Guidelines were inspired by\n[Mozilla's code of conduct enforcement ladder](https://github.com/mozilla/inclusion).\n\nFor answers to common questions about this code of conduct, see the FAQ at\n<https://www.contributor-covenant.org/faq>. Translations are available at\n<https://www.contributor-covenant.org/translations>.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 3.9541015625,
          "content": "# Contributing Guidelines\n\nThe following is a set of guidelines for contributing to nginx project.\nWe really appreciate that you are considering contributing!\n\n## Table of Contents\n\n- [Ask a Question](#ask-a-question)\n- [Report a Bug](#report-a-bug)\n- [Suggest a Feature or Enhancement](#suggest-a-feature-or-enhancement)\n- [Open a Discussion](#open-a-discussion)\n- [Submit a Pull Request](#submit-a-pull-request)\n- [Issue Lifecycle](#issue-lifecycle)\n\n## Ask a Question\n\nTo ask a question, open an issue on GitHub with the label `question`.\n\n## Report a Bug\n\nTo report a bug, open an issue on GitHub with the label `bug` using the\navailable bug report issue template. Before reporting a bug, make sure the\nissue has not already been reported.\n\n## Suggest a Feature or Enhancement\n\nTo suggest a feature or enhancement, open an issue on GitHub with the label\n`feature` or `enhancement` using the available feature request issue template.\nPlease ensure the feature or enhancement has not already been suggested.\n\n## Open a Discussion\n\nIf you want to engage in a conversation with the community and maintainers,\nwe encourage you to use\n[GitHub Discussions](https://github.com/nginx/nginx/discussions).\n\n## Submit a Pull Request\n\nFollow this plan to contribute a change to NGINX source code:\n\n- Fork the NGINX repository\n- Create a branch\n- Implement your changes in this branch\n- Submit a pull request (PR) when your changes are tested and ready for review\n\nRefer to\n[NGINX Development Guide](https://nginx.org/en/docs/dev/development_guide.html)\nfor questions about NGINX programming.\n\n### Formatting Changes\n\n- Changes should be formatted according to the\n[code style](https://nginx.org/en/docs/dev/development_guide.html#code_style)\nused by NGINX; sometimes, there is no clear rule, in which case examine how\nexisting NGINX sources are formatted and mimic this style; changes will more\nlikely be accepted if style corresponds to the surrounding code\n\n- Keep a clean, concise and meaningful commit history on your branch, rebasing\nlocally and breaking changes logically into commits before submitting a PR\n\n- Each commit message should have a single-line subject line followed by verbose\ndescription after an empty line\n\n- Limit the subject line to 67 characters, and the rest of the commit message\nto 76 characters\n\n- Use subject line prefixes for commits that affect a specific portion of the\ncode; examples include \"Upstream:\", \"QUIC:\", or \"Core:\"; see the commit history\nto get an idea of the prefixes used\n\n- Reference issues in the the subject line; if the commit fixes an issue,\n[name it](https://docs.github.com/en/issues/tracking-your-work-with-issues/linking-a-pull-request-to-an-issue)\naccordingly\n\n### Before Submitting\n\n- The proposed changes should work properly on a wide range of\n[supported platforms](https://nginx.org/en/index.html#tested_os_and_platforms)\n\n- Try to make it clear why the suggested change is needed, and provide a use\ncase, if possible\n\n- Passing your changes through the test suite is a good way to ensure that they\ndo not cause a regression; the repository with tests can be cloned with the\nfollowing command:\n\n```bash\ngit clone https://github.com/nginx/nginx-tests.git\n```\n\n- Submitting a change implies granting project a permission to use it under the\n[BSD-2-Clause license](https://github.com/nginx/nginx/blob/master/LICENSE)\n\n## Issue Lifecycle\n\nTo ensure a balance between work carried out by the NGINX engineering team\nwhile encouraging community involvement on this project, we use the following\nissue lifecycle:\n\n- A new issue is created by a community member\n\n- An owner on the NGINX engineering team is assigned to the issue; this\nowner shepherds the issue through the subsequent stages in the issue lifecycle\n\n- The owner assigns one or more\n[labels](https://github.com/nginx/nginx/issues/labels) to the issue\n\n- The owner, in collaboration with the wider team (product management and\nengineering), determines what milestone to attach to an issue;\ngenerally, milestones correspond to product releases\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 1.2880859375,
          "content": "Copyright (C) 2002-2021 Igor Sysoev\nCopyright (C) 2011-2025 Nginx, Inc.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\nOR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\nOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 13.88671875,
          "content": "<picture>\n  <source media=\"(prefers-color-scheme: dark)\" srcset=\"https://github.com/user-attachments/assets/9335b488-ffcc-4157-8364-2370a0b70ad0\">\n  <source media=\"(prefers-color-scheme: light)\" srcset=\"https://github.com/user-attachments/assets/3a7eeb08-1133-47f5-859c-fad4f5a6a013\">\n  <img alt=\"NGINX Banner\">\n</picture>\n\nNGINX (pronounced \"engine x\" or \"en-jin-eks\") is the world's most popular Web Server, high performance Load Balancer, Reverse Proxy, API Gateway and Content Cache.\n\nNGINX is free and open source software, distributed under the terms of a simplified [2-clause BSD-like license](LICENSE).\n\nEnterprise distributions, commercial support and training are available from [F5, Inc](https://www.f5.com/products/nginx).\n\n> [!IMPORTANT]\n> The goal of this README is to provide a basic, structured introduction to NGINX for novice users. Please refer to the [full NGINX documentation](https://nginx.org/en/docs/) for detailed information on [installing](https://nginx.org/en/docs/install.html), [building](https://nginx.org/en/docs/configure.html), [configuring](https://nginx.org/en/docs/dirindex.html), [debugging](https://nginx.org/en/docs/debugging_log.html), and more. These documentation pages also contain a more detailed [Beginners Guide](https://nginx.org/en/docs/beginners_guide.html), How-Tos, [Development guide](https://nginx.org/en/docs/dev/development_guide.html), and a complete module and [directive reference](https://nginx.org/en/docs/dirindex.html).\n\n# Table of contents\n- [How it works](#how-it-works)\n  - [Modules](#modules)\n  - [Configurations](#configurations)\n  - [Runtime](#runtime)\n- [Downloading and installing](#downloading-and-installing)\n  - [Stable and Mainline binaries](#stable-and-mainline-binaries)\n  - [Linux binary installation process](#linux-binary-installation-process)\n  - [FreeBSD installation process](#freebsd-installation-process)\n  - [Windows executables](#windows-executables)\n  - [Dynamic modules](#dynamic-modules)\n- [Getting started with NGINX](#getting-started-with-nginx)\n  - [Installing SSL certificates and enabling TLS encryption](#installing-ssl-certificates-and-enabling-tls-encryption)\n  - [Load Balancing](#load-balancing)\n  - [Rate limiting](#rate-limiting)\n  - [Content caching](#content-caching)\n- [Building from source](#building-from-source)\n  - [Installing dependencies](#installing-dependencies)\n  - [Cloning the NGINX GitHub repository](#cloning-the-nginx-github-repository)\n  - [Configuring the build](#configuring-the-build)\n  - [Compiling](#compiling)\n  - [Location of binary and installation](#location-of-binary-and-installation)\n  - [Running and testing the installed binary](#running-and-testing-the-installed-binary)\n- [Asking questions and reporting issues](#asking-questions-and-reporting-issues)\n- [Contributing code](#contributing-code)\n- [Additional help and resources](#additional-help-and-resources)\n- [Changelog](#changelog)\n- [License](#license)\n\n# How it works\nNGINX is installed software with binary packages available for all major operating systems and Linux distributions. See [Tested OS and Platforms](https://nginx.org/en/#tested_os_and_platforms) for a full list of compatible systems.\n\n> [!IMPORTANT]\n> While nearly all popular Linux-based operating systems are distributed with a community version of nginx, we highly advise installation and usage of official [packages](https://nginx.org/en/linux_packages.html) or sources from this repository. Doing so ensures that you're using the most recent release or source code, including the latest feature-set, fixes and security patches.\n\n## Modules\nNGINX is comprised of individual modules, each extending core functionality by providing additional, configurable features. See \"Modules reference\" at the bottom of [nginx documentation](https://nginx.org/en/docs/) for a complete list of official modules.\n\nNGINX modules can be built and distributed as static or dynamic modules. Static modules are defined at build-time, compiled, and distributed in the resulting binaries. See [Dynamic Modules](#dynamic-modules) for more information on how they work, as well as, how to obtain, install, and configure them.\n\n> [!TIP]\n> You can issue the following command to see which static modules your NGINX binaries were built with:\n```bash\nnginx -V\n```\n> See [Configuring the build](#configuring-the-build) for information on how to include specific Static modules into your nginx build.\n\n\n## Configurations\nNGINX is highly flexible and configurable. Provisioning the software is achieved via text-based config file(s) accepting parameters called \"[Directives](https://nginx.org/en/docs/dirindex.html)\". See [Configuration File's Structure](https://nginx.org/en/docs/beginners_guide.html#conf_structure) for a comprehensive description of how NGINX configuration files work.\n\n> [!NOTE]\n> The set of directives available to your distribution of NGINX is dependent on which [modules](#modules) have been made available to it.\n\n## Runtime\nRather than running in a single, monolithic process, NGINX is architected to scale beyond Operating System process limitations by operating as a collection of processes. They include:\n- A \"master\" process that maintains worker processes, as well as, reads and evaluates configuration files.\n- One or more \"worker\" processes that process data (eg. HTTP requests).\n\nThe number of [worker processes](https://nginx.org/en/docs/ngx_core_module.html#worker_processes) is defined in the configuration file and may be fixed for a given configuration or automatically adjusted to the number of available CPU cores. In most cases, the latter option optimally balances load across available system resources, as NGINX is designed to efficiently distribute work across all worker processes.\n\n> [!TIP]\n> Processes synchronize data through shared memory. For this reason, many NGINX directives require the allocation of shared memory zones. As an example, when configuring [rate limiting](https://nginx.org/en/docs/http/ngx_http_limit_req_module.html#limit_req), connecting clients may need to be tracked in a [common memory zone](https://nginx.org/en/docs/http/ngx_http_limit_req_module.html#limit_req_zone) so all worker processes can know how many times a particular client has accessed the server in a span of time.\n\n# Downloading and installing\nFollow these steps to download and install precompiled NGINX binaries. You may also choose to [build NGINX locally from source code](#building-from-source).\n\n## Stable and Mainline binaries\nNGINX binaries are built and distributed in two versions: stable and mainline. Stable binaries are built from stable branches and only contain critical fixes backported from the mainline version. Mainline binaries are built from the [master branch](https://github.com/nginx/nginx/tree/master) and contain the latest features and bugfixes. You'll need to [decide which is appropriate for your purposes](https://docs.nginx.com/nginx/admin-guide/installing-nginx/installing-nginx-open-source/#choosing-between-a-stable-or-a-mainline-version).\n\n## Linux binary installation process\nThe NGINX binary installation process takes advantage of package managers native to specific Linux distributions. For this reason, first-time installations involve adding the official NGINX package repository to your system's package manager. Follow [these steps](https://nginx.org/en/linux_packages.html) to download, verify, and install NGINX binaries using the package manager appropriate for your Linux distribution.\n\n### Upgrades\nFuture upgrades to the latest version can be managed using the same package manager without the need to manually download and verify binaries.\n\n## FreeBSD installation process\nFor more information on installing NGINX on FreeBSD system, visit https://nginx.org/en/docs/install.html\n\n## Windows executables\nWindows executables for mainline and stable releases can be found on the main [NGINX download page](https://nginx.org/en/download.html). Note that the current implementation of NGINX for Windows is at the Proof-of-Concept stage and should only be used for development and testing purposes. For additional information, please see [nginx for Windows](https://nginx.org/en/docs/windows.html).\n\n## Dynamic modules\nNGINX version 1.9.11 added support for [Dynamic Modules](https://nginx.org/en/docs/ngx_core_module.html#load_module). Unlike Static modules, dynamically built modules can be downloaded, installed, and configured after the core NGINX binaries have been built. [Official dynamic module binaries](https://nginx.org/en/linux_packages.html#dynmodules) are available from the same package repository as the core NGINX binaries described in previous steps.\n\n> [!TIP]\n> [NGINX JavaScript (njs)](https://github.com/nginx/njs), is a popular NGINX dynamic module that enables the extension of core NGINX functionality using familiar JavaScript syntax.\n\n> [!IMPORTANT]\n> If desired, dynamic modules can also be built statically into NGINX at compile time.\n\n# Getting started with NGINX\nFor a gentle introduction to NGINX basics, please see our [Beginner’s Guide](https://nginx.org/en/docs/beginners_guide.html).\n\n## Installing SSL certificates and enabling TLS encryption\nSee [Configuring HTTPS servers](https://nginx.org/en/docs/http/configuring_https_servers.html) for a quick guide on how to enable secure traffic to your NGINX installation.\n\n## Load Balancing\nFor a quick start guide on configuring NGINX as a Load Balancer, please see [Using nginx as HTTP load balancer](https://nginx.org/en/docs/http/load_balancing.html).\n\n## Rate limiting\nSee our [Rate Limiting with NGINX](https://blog.nginx.org/blog/rate-limiting-nginx) blog post for an overview of core concepts for provisioning NGINX as an API Gateway.\n\n## Content caching\nSee [A Guide to Caching with NGINX and NGINX Plus](https://blog.nginx.org/blog/nginx-caching-guide) blog post for an overview of how to use NGINX as a content cache (e.g. edge server of a content delivery network).\n\n# Building from source\nThe following steps can be used to build NGINX from source code available in this repository.\n\n## Installing dependencies\nMost Linux distributions will require several dependencies to be installed in order to build NGINX. The following instructions are specific to the `apt` package manager, widely available on most Ubuntu/Debian distributions and their derivatives.\n\n> [!TIP]\n> It is always a good idea to update your package repository lists prior to installing new packages.\n> ```bash\n> sudo apt update\n> ```\n\n### Installing compiler and make utility\nUse the following command to install the GNU C compiler and Make utility.\n\n```bash\nsudo apt install gcc make\n```\n\n### Installing dependency libraries\n\n```bash\nsudo apt install libpcre3-dev zlib1g-dev\n```\n\n> [!WARNING]\n> This is the minimal set of dependency libraries needed to build NGINX with rewriting and gzip capabilities. Other dependencies may be required if you choose to build NGINX with additional modules. Monitor the output of the `configure` command discussed in the following sections for information on which modules may be missing. For example, if you plan to use SSL certificates to encrypt traffic with TLS, you'll need to install the OpenSSL library. To do so, issue the following command.\n\n>```bash\n>sudo apt install libssl-dev\n\n## Cloning the NGINX GitHub repository\nUsing your preferred method, clone the NGINX repository into your development directory. See [Cloning a GitHub Repository](https://docs.github.com/en/repositories/creating-and-managing-repositories/cloning-a-repository) for additional help.\n\n```bash\ngit clone https://github.com/nginx/nginx.git\n```\n\n## Configuring the build\nPrior to building NGINX, you must run the `configure` script with [appropriate flags](https://nginx.org/en/docs/configure.html). This will generate a Makefile in your NGINX source root directory that can then be used to compile NGINX with [options specified during configuration](https://nginx.org/en/docs/configure.html).\n\nFrom the NGINX source code repository's root directory:\n\n```bash\nauto/configure\n```\n\n> [!IMPORTANT]\n> Configuring the build without any flags will compile NGINX with the default set of options. Please refer to https://nginx.org/en/docs/configure.html for a full list of available build configuration options.\n\n## Compiling\nThe `configure` script will generate a `Makefile` in the NGINX source root directory upon successful execution. To compile NGINX into a binary, issue the following command from that same directory:\n\n```bash\nmake\n```\n\n## Location of binary and installation\nAfter successful compilation, a binary will be generated at `<NGINX_SRC_ROOT_DIR>/objs/nginx`. To install this binary, issue the following command from the source root directory:\n\n```bash\nsudo make install\n```\n\n> [!IMPORTANT]\n> The binary will be installed into the `/usr/local/nginx/` directory.\n\n## Running and testing the installed binary\nTo run the installed binary, issue the following command:\n\n```bash\nsudo /usr/local/nginx/sbin/nginx\n```\n\nYou may test NGINX operation using `curl`.\n\n```bash\ncurl localhost\n```\n\nThe output of which should start with:\n\n```html\n<!DOCTYPE html>\n<html>\n<head>\n<title>Welcome to nginx!</title>\n```\n\n# Asking questions and reporting issues\nWe encourage you to engage with us.\n- [NGINX GitHub Discussions](https://github.com/nginx/nginx/discussions), is the go-to place to start asking questions and sharing your thoughts.\n- Our [GitHub Issues](https://github.com/nginx/nginx/issues) page offers space to submit and discuss specific issues, report bugs, and suggest enhancements.\n\n# Contributing code\nPlease see the [Contributing](CONTRIBUTING.md) guide for information on how to contribute code.\n\n# Additional help and resources\n- See the [NGINX Community Blog](https://blog.nginx.org/) for more tips, tricks and HOW-TOs related to NGINX and related projects.\n- Access [nginx.org](https://nginx.org/), your go-to source for all documentation, information and software related to the NGINX suite of projects.\n\n# Changelog\nSee our [changelog](https://nginx.org/en/CHANGES) to keep track of updates.\n\n# License\n[2-clause BSD-like license](LICENSE)\n\n---\nAdditional documentation available at: https://nginx.org/en/docs\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 4.7431640625,
          "content": "# Security Policy\n\nThis document provides an overview of security concerns related to nginx\ndeployments, focusing on confidentiality, integrity, availability, and the\nimplications of configurations and misconfigurations.\n\n## Reporting a Vulnerability\n\nPlease report any vulnerabilities via one of the following methods\n(in order of preference):\n\n1. [Report a vulnerability](https://docs.github.com/en/code-security/security-advisories/guidance-on-reporting-and-writing-information-about-vulnerabilities/privately-reporting-a-security-vulnerability)\nwithin this repository. We are using the GitHub workflow that allows us to\nmanage vulnerabilities in a private manner and interact with reporters\nsecurely.\n\n2. [Report directly to F5](https://www.f5.com/services/support/report-a-vulnerability).\n\n3. Report via email to security-alert@nginx.org.\nThis method will be deprecated in the future.\n\n### Vulnerability Disclosure and Fix Process\n\nThe nginx team expects that all suspected vulnerabilities be reported\nprivately via the\n[Reporting a Vulnerability](SECURITY.md#reporting-a-vulnerability) guidelines.\nIf a publicly released vulnerability is reported, we\nmay request to handle it according to the private disclosure process.\nIf the reporter agrees, we will follow the private disclosure process.\n\nSecurity fixes will be applied to all supported stable releases, as well\nas the mainline version, as applicable. We recommend using the most recent\nmainline or stable release of nginx. Fixes are created and tested by the core\nteam using a GitHub private fork for security. If necessary, the reporter\nmay be invited to contribute to the fork and assist with the solution.\n\nThe nginx team is committed to responsible information disclosure with\nsufficient detail, such as the CVSS score and vector. Privately disclosed\nvulnerabilities are embargoed by default until the fix is released.\nCommunications and fixes remain private until made public. As nginx is\nsupported by F5, we generally follow the\n[F5 security vulnerability response policy](https://my.f5.com/manage/s/article/K4602).\n\n### Vulnerability Disclosure and Fix Service Level Objectives\n\n- We will acknowledge all vulnerability reports within 1 to 3 days.\n- Fixes will be developed and released within 90 days from the date of\ndisclosure. If an extension is needed, we will work with the disclosing person.\n- Publicly disclosed (i.e., Zero-Day vulnerabilities) will be addressed ASAP.\n\n## Confidentiality, Integrity, and Availability\n\n### Confidentiality and Integrity\n\nVulnerabilities compromising data confidentiality or integrity are considered\nthe highest priority. Any issue leading to unauthorized data access, leaks, or\nmanipulation will trigger the security release process.\n\n### Availability\n\nAvailability issues must meet the following criteria to trigger the security\nrelease process:\n- Is present in a standard module included with nginx.\n- Arises from traffic that the module is designed to handle.\n- Resource exhaustion issues are not mitigated by existing timeout, rate\nlimiting, or buffer size configurations, or applying changes is impractical.\n- Results in highly asymmetric, extreme resource consumption.\n\nAvailability issues excluded from the security release process:\n- Local file content or upstream response content resulting only in worker\nprocess termination.\n- Issues with experimental features which result only in availability impact.\n\n## Trusted Configurations and Misconfigurations\n\nIn nginx, configuration files, modules, certificate/key pairs, nginx JavaScript,\nand local file content are considered trusted sources. Issues arising from\nloading or execution of these trusted components are not considered\nvulnerabilities. Operators are responsible for securing and maintaining the\nintegrity of these sources. Misconfigurations can create vulnerabilities, and\noperators should implement configurations according to best practices, review\nthem regularly, and apply security updates.\n\n## Data Plane vs. Control Plane\n\nThe data plane handles traffic through nginx, directly interacting with user\ndata. nginx inherently trusts the content and instructions from upstream\nservers. The control plane governs configuration, management, and orchestration.\nMisconfigurations or vulnerabilities in the control plane can cause improper\nbehavior in the data plane.\n\n## Modules Under Scope\n\nThe policy applies to all nginx modules included in this repository. Security\nconsiderations and attack vectors for each module will be identified, with\nrecommended configurations to mitigate risks.\n\n## Debug Logging and Core Files\n\nDebug logs and core files produced by nginx may contain un-sanitized data,\nincluding sensitive information like client requests, server configurations,\nand private key material. These artifacts must be handled carefully to avoid\nexposing confidential data.\n"
        },
        {
          "name": "auto",
          "type": "tree",
          "content": null
        },
        {
          "name": "conf",
          "type": "tree",
          "content": null
        },
        {
          "name": "contrib",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "misc",
          "type": "tree",
          "content": null
        },
        {
          "name": "src",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}