{
  "metadata": {
    "timestamp": 1736711236711,
    "page": 39,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Unity-Technologies/UnityCsReference",
      "stars": 11988,
      "defaultBranch": "master",
      "files": [
        {
          "name": "Editor",
          "type": "tree",
          "content": null
        },
        {
          "name": "External",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE.md",
          "type": "blob",
          "size": 0.083984375,
          "content": "For terms of use, see https://unity3d.com/legal/licenses/Unity_Reference_Only_License\n"
        },
        {
          "name": "Modules",
          "type": "tree",
          "content": null
        },
        {
          "name": "Projects",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 1.3076171875,
          "content": "## Unity 6000.1.0b1 C# reference source code\n\nThe C# part of the Unity engine and editor source code.\nMay be used for reference purposes only.\n\nFor terms of use, see\nhttps://unity3d.com/legal/licenses/Unity_Reference_Only_License\n\nThe repository includes third-party code subject to [third-party\nnotices](third-party-notices.txt).\n\nThe terms of use do not permit you to modify or redistribute the C#\ncode (in either source or binary form). If you want to modify Unity's\nsource code (C# and C++), contact Unity sales for a commercial source\ncode license: https://store.unity.com/contact?type=source-code\n\nWe do not take pull requests at this time (sorry). But if you find\nsomething that looks like a bug, we'd appreciate it if you'd file it\nusing the Unity Bug Reporter. For more information, see our blog post:\nhttps://blogs.unity3d.com/2018/03/26/releasing-the-unity-c-source-code/\n\nUnless expressly provided otherwise, the software under this\nlicense is made available strictly on an \"AS IS\" BASIS WITHOUT\nWARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the\nlicense for details on these and other terms and conditions.\n\nThe C# solution is in Projects/CSharp/UnityReferenceSource.sln\n\nThe folder and file layout of the reference source matches\nthe Unity source tree layout; it can and will change between\ndifferent Unity versions."
        },
        {
          "name": "Runtime",
          "type": "tree",
          "content": null
        },
        {
          "name": "Tools",
          "type": "tree",
          "content": null
        },
        {
          "name": "artifacts",
          "type": "tree",
          "content": null
        },
        {
          "name": "third-party-notices.txt",
          "type": "blob",
          "size": 3.7734375,
          "content": "Files under External/ folder are third party code under their own\nrespective licenses:\n\nExternal/CSSLayout and/or External/Yoga:\n\n    https://github.com/facebook/yoga\n    Copyright (c) 2014-present, Facebook, Inc. All rights reserved\n    BSD 3-Clause License\n\nExternal/JsonParsers/MiniJson\n\n    https://gist.github.com/darktable/1411710\n    Copyright (c) 2013 Calvin Rien\n    MIT license\n\nExternal/JsonParsers/SimpleJson\n\n    https://github.com/facebook-csharp-sdk/simple-json\n    Copyright (c) 2011, The Outercurve Foundation\n    MIT license\n\nExternal/Mono.Cecil\n\n    https://github.com/jbevain/cecil\n    Copyright (c) 2008-2015 Jb Evain.  Copyright (c) 2008-2011 Novell, Inc.\n    MIT license\n\nExternal/Mono:\n\n    https://github.com/boo-lang/boo\n    Copyright (c) 2003-2008 Rodrigo B. Oliveira\n    BSD 3-Clause License\n\n    https://github.com/mono/mono/tree/master/mcs\n    Copyright (c) 2005-2008 Novell, Inc.\n    MIT License\n\n    https://github.com/bamboo/unityscript\n    Copyright (c) 2005-2008 Rodrigo B. Oliveira\n    BSD 3-Clause License\n\nExternal/NRefactory:\n    https://github.com/icsharpcode/NRefactory\n    Copyright (c) 2010-2014 AlphaSierraPapa, Xamarin\n    MIT license\n\nAppendix: Referenced Licenses\n\nBSD 3-Clause License\n\n    Redistribution and use in source and binary forms, with or without\n    modification, are permitted provided that the following conditions\n    are met:\n\n    1. Redistributions of source code must retain the above copyright\n       notice, this list of conditions and the following disclaimer.\n    2. Redistributions in binary form must reproduce the above copyright\n       notice, this list of conditions and the following disclaimer in the\n       documentation and/or other materials provided with the distribution.\n    3. Neither the name of the copyright holder nor the names of its\n       contributors may be used to endorse or promote products derived\n       from this software without specific prior written permission.\n\n    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n    \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n    LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n    FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n    COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n    INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n    BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS\n    OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\n    ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n    TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n    USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nMIT License\n\n    Permission is hereby granted, free of charge, to any person obtaining a\n    copy of this software and associated documentation files (the\n    \"Software\"), to deal in the Software without restriction, including\n    without limitation the rights to use, copy, modify, merge, publish,\n    distribute, sublicense, and/or sell copies of the Software, and to permit\n    persons to whom the Software is furnished to do so, subject to the\n    following conditions:\n\n    The above copyright notice and this permission notice shall be included\n    in all copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n    OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n    MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n    IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\n    CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT\n    OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR\n    THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n"
        }
      ]
    }
  ]
}