{
  "metadata": {
    "timestamp": 1736564798767,
    "page": 15,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjIw",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "invoke-ai/InvokeAI",
      "stars": 24126,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".dev_scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": ".dockerignore",
          "type": "blob",
          "size": 0.1083984375,
          "content": "*\n!invokeai\n!pyproject.toml\n!docker/docker-entrypoint.sh\n!LICENSE\n\n**/node_modules\n**/__pycache__\n**/*.egg-info"
        },
        {
          "name": ".editorconfig",
          "type": "blob",
          "size": 0.1748046875,
          "content": "# All files\n[*]\ncharset = utf-8\nend_of_line = lf\nindent_size = 2\nindent_style = space\ninsert_final_newline = true\ntrim_trailing_whitespace = true\n\n# Python\n[*.py]\nindent_size = 4\n"
        },
        {
          "name": ".git-blame-ignore-revs",
          "type": "blob",
          "size": 0.080078125,
          "content": "b3dccfaeb636599c02effc377cdd8a87d658256c\n218b6d0546b990fc449c876fb99f44b50c4daa35\n"
        },
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.2763671875,
          "content": "# Auto normalizes line endings on commit so devs don't need to change local settings.\n# Only affects text files and ignores other file types.\n# For more info see: https://www.aleksandrhovhannisyan.com/blog/crlf-vs-lf-normalizing-line-endings-in-git/\n* text=auto\ndocker/** text eol=lf"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 3.3828125,
          "content": ".idea/\n\n# Byte-compiled / optimized / DLL files\n__pycache__/\n*.py[cod]\n*$py.class\n\n# C extensions\n*.so\n\n# emacs autosave and recovery files\n*~\n.#*\n\n# Distribution / packaging\n.Python\nbuild/\ndevelop-eggs/\ndist/\ndownloads/\neggs/\n.eggs/\nlib64/\nparts/\nsdist/\nvar/\nwheels/\npip-wheel-metadata/\nshare/python-wheels/\n*.egg-info/\n.installed.cfg\n*.egg\nMANIFEST\n\n# PyInstaller\n#  Usually these files are written by a python script from a template\n#  before PyInstaller builds the exe, so as to inject date/other infos into it.\n*.manifest\n*.spec\n\n# Installer logs\npip-log.txt\npip-delete-this-directory.txt\n\n# Unit test / coverage reports\nhtmlcov/\n.tox/\n.nox/\n.coveragerc\n.coverage\n.coverage.*\n.cache\nnosetests.xml\ncoverage.xml\ncov.xml\n*.cover\n*.py,cover\n.hypothesis/\n.pytest_cache/\n.pytest.ini\ncover/\njunit/\nnotes/\n\n# Translations\n*.mo\n*.pot\n\n# Django stuff:\n*.log\nlocal_settings.py\ndb.sqlite3\ndb.sqlite3-journal\n\n# Flask stuff:\ninstance/\n.webassets-cache\n\n# Scrapy stuff:\n.scrapy\n\n# Sphinx documentation\ndocs/_build/\n\n# PyBuilder\n.pybuilder/\ntarget/\n\n# Jupyter Notebook\n.ipynb_checkpoints\n\n# IPython\nprofile_default/\nipython_config.py\n\n# pyenv\n#   For a library or package, you might want to ignore these files since the code is\n#   intended to run in multiple environments; otherwise, check them in:\n# .python-version\n.python-version\n\n# pipenv\n#   According to pypa/pipenv#598, it is recommended to include Pipfile.lock in version control.\n#   However, in case of collaboration, if having platform-specific dependencies or dependencies\n#   having no cross-platform support, pipenv may install dependencies that don't work, or not\n#   install all needed dependencies.\n#Pipfile.lock\n\n# poetry\n#   Similar to Pipfile.lock, it is generally recommended to include poetry.lock in version control.\n#   This is especially recommended for binary packages to ensure reproducibility, and is more\n#   commonly ignored for libraries.\n#   https://python-poetry.org/docs/basic-usage/#commit-your-poetrylock-file-to-version-control\n#poetry.lock\n\n# pdm\n#   Similar to Pipfile.lock, it is generally recommended to include pdm.lock in version control.\n#pdm.lock\n#   pdm stores project-wide configurations in .pdm.toml, but it is recommended to not include it\n#   in version control.\n#   https://pdm.fming.dev/#use-with-ide\n.pdm.toml\n\n# PEP 582; used by e.g. github.com/David-OConnor/pyflow\n__pypackages__/\n\n# Celery stuff\ncelerybeat-schedule\ncelerybeat.pid\n\n# SageMath parsed files\n*.sage.py\n\n# Environments\n.env\n.venv*\nenv/\nvenv/\nENV/\n\n# Spyder project settings\n.spyderproject\n.spyproject\n\n# Rope project settings\n.ropeproject\n\n# mkdocs documentation\n/site\n\n# mypy\n.mypy_cache/\n.dmypy.json\ndmypy.json\n\n# Pyre type checker\n.pyre/\n\n# pytype static type analyzer\n.pytype/\n\n# Cython debug symbols\ncython_debug/\n\n# PyCharm\n#  JetBrains specific template is maintained in a separate JetBrains.gitignore that can\n#  be found at https://github.com/github/gitignore/blob/main/Global/JetBrains.gitignore\n#  and can be added to the global gitignore or merged into this file.  For a more nuclear\n#  option (not recommended) you can uncomment the following to ignore the entire idea folder.\n#.idea/\n\n**/__pycache__/\n\n# If it's a Mac\n.DS_Store\n\n# Let the frontend manage its own gitignore\n!invokeai/frontend/web/*\n\n# Scratch folder\n.scratch/\n.vscode/\n\n# source installer files\ninstaller/*zip\ninstaller/install.bat\ninstaller/install.sh\ninstaller/update.bat\ninstaller/update.sh\ninstaller/InvokeAI-Installer/\n"
        },
        {
          "name": ".gitmodules",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": ".pre-commit-config.yaml",
          "type": "blob",
          "size": 0.40234375,
          "content": "# See https://pre-commit.com/ for usage and config\nrepos:\n- repo: local\n  hooks:\n  - id: black\n    name: black\n    stages: [commit]\n    language: system\n    entry: black\n    types: [python]\n\n  - id: flake8\n    name: flake8\n    stages: [commit]\n    language: system\n    entry: flake8\n    types: [python]\n\n  - id: isort\n    name: isort\n    stages: [commit]\n    language: system\n    entry: isort\n    types: [python]"
        },
        {
          "name": ".prettierrc.yaml",
          "type": "blob",
          "size": 0.2431640625,
          "content": "endOfLine: lf\ntabWidth: 2\nuseTabs: false\nsingleQuote: true\nquoteProps: as-needed\nembeddedLanguageFormatting: auto\noverrides:\n  - files: '*.md'\n    options:\n      proseWrap: preserve\n      printWidth: 80\n      parser: markdown\n      cursorOffset: -1\n"
        },
        {
          "name": "InvokeAI_Statement_of_Values.md",
          "type": "blob",
          "size": 4.9306640625,
          "content": "<img src=\"docs/assets/invoke_ai_banner.png\" align=\"center\">\n\nInvoke-AI is a community of software developers, researchers, and user\ninterface experts who have come together on a voluntary basis to build\nsoftware tools which support cutting edge AI text-to-image\napplications. This community is open to anyone who wishes to\ncontribute to the effort and has the skill and time to do so.\n\n# Our Values\n\nThe InvokeAI team is a diverse community which includes individuals\nfrom various parts of the world and many walks of life. Despite our\ndifferences, we share a number of core values which we ask prospective\ncontributors to understand and respect. We believe:\n\n1. That Open Source Software is a positive force in the world. We\ncreate software that can be used, reused, and redistributed, without\nrestrictions, under a straightforward Open Source license (MIT). We\nbelieve that Open Source benefits society as a whole by increasing the\navailability of high quality software to all.\n\n2. That those who create software should receive proper attribution\nfor their creative work. While we support the exchange and reuse of\nOpen Source Software, we feel strongly that the original authors of a\npiece of code should receive credit for their contribution, and we\nendeavor to do so whenever possible.\n\n3. That there is moral ambiguity surrounding AI-assisted art. We are\naware of the moral and ethical issues surrounding the release of the\nStable Diffusion model and similar products. We are aware that, due to\nthe composition of their training sets, current AI-generated image\nmodels are biased against certain ethnic groups, cultural concepts of\nbeauty, ethnic stereotypes, and gender roles.\n\n      1. We recognize the potential for harm to these groups that these biases\n       represent and trust that future AI models will take steps towards\n       reducing or eliminating the biases noted above, respect and give due\n       credit to the artists whose work is sourced, and call on developers\n       and users to favor these models over the older ones as they become\n       available.\n\n4. We are deeply committed to ensuring that this technology benefits\neveryone, including artists. We see AI art not as a replacement for\nthe artist, but rather as a tool to empower them. With that\nin mind, we are constantly debating how to build systems that put\nartists’ needs first: tools which can be readily integrated into an\nartist’s existing workflows and practices, enhancing their work and\nhelping them to push it further. Every decision we take as a team,\nwhich includes several artists, aims to build towards that goal.\n\n5. That artificial intelligence can be a force for good in the world,\nbut must be used responsibly. Artificial intelligence technologies\nhave the potential to improve society, in everything from cancer care,\nto customer service, to creative writing.\n\n     1. While we do not believe that software should arbitrarily limit what\n     users can do with it, we recognize that when used irresponsibly, AI\n     has the potential to do much harm. Our Discord server is actively\n     moderated in order to minimize the potential of harm from\n     user-contributed images. In addition, we ask users of our software to\n     refrain from using it in any way that would cause mental, emotional or\n     physical harm to individuals and vulnerable populations including (but\n     not limited to) women; minors; ethnic minorities; religious groups;\n     members of LGBTQIA communities; and people with disabilities or\n     impairments.\n\n     2. Note that some of the image generation AI models which the Invoke-AI\n     toolkit supports carry licensing agreements which impose restrictions\n     on how the model is used. We ask that our users read and agree to\n     these terms if they wish to make use of these models. These agreements\n     are distinct from the MIT license which applies to the InvokeAI\n     software and source code.\n\n6. That mutual respect is key to a healthy software development\ncommunity. Members of the InvokeAI community are expected to treat\neach other with respect, beneficence, and empathy. Each of us has a\ndifferent background and a unique set of skills. We strive to help\neach other grow and gain new skills, and we apportion expectations in\na way that balances the members' time, skillset, and interest\narea. Disputes are resolved by open and honest communication.\n\n## Signature\n\nThis document has been collectively crafted and approved by the current InvokeAI team members, as of 28 Nov 2022: **lstein** (Lincoln Stein), **blessedcoolant**, **hipsterusername** (Kent Keirsey), **Kyle0654** (Kyle Schouviller), **damian0815**, **mauwii** (Matthias Wild), **Netsvetaev** (Artur Netsvetaev), **psychedelicious**, **tildebyte**, **keturn**, and **ebr** (Eugene Brodsky). Although individuals within the group may hold differing views on particular details and/or their implications, we are all in agreement about its fundamental statements, as well as their significance and importance to this project moving forward.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 9.908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   \n"
        },
        {
          "name": "LICENSE-SD1+SD2.txt",
          "type": "blob",
          "size": 14.2138671875,
          "content": "Copyright (c) 2022 Robin Rombach and Patrick Esser and contributors\n\nCreativeML Open RAIL-M\ndated August 22, 2022\n\nSection I: PREAMBLE\n\nMultimodal generative models are being widely adopted and used, and\nhave the potential to transform the way artists, among other\nindividuals, conceive and benefit from AI or ML technologies as a tool\nfor content creation.\n\nNotwithstanding the current and potential benefits that these\nartifacts can bring to society at large, there are also concerns about\npotential misuses of them, either due to their technical limitations\nor ethical considerations.\n\nIn short, this license strives for both the open and responsible\ndownstream use of the accompanying model. When it comes to the open\ncharacter, we took inspiration from open source permissive licenses\nregarding the grant of IP rights. Referring to the downstream\nresponsible use, we added use-based restrictions not permitting the\nuse of the Model in very specific scenarios, in order for the licensor\nto be able to enforce the license in case potential misuses of the\nModel may occur. At the same time, we strive to promote open and\nresponsible research on generative models for art and content\ngeneration.\n\nEven though downstream derivative versions of the model could be\nreleased under different licensing terms, the latter will always have\nto include - at minimum - the same use-based restrictions as the ones\nin the original license (this license). We believe in the intersection\nbetween open and responsible AI development; thus, this License aims\nto strike a balance between both in order to enable responsible\nopen-science in the field of AI.\n\nThis License governs the use of the model (and its derivatives) and is\ninformed by the model card associated with the model.\n\nNOW THEREFORE, You and Licensor agree as follows:\n\n1. Definitions\n\n- \"License\" means the terms and conditions for use, reproduction, and\n  Distribution as defined in this document.\n\n- \"Data\" means a collection of information and/or content extracted\n  from the dataset used with the Model, including to train, pretrain,\n  or otherwise evaluate the Model. The Data is not licensed under this\n  License.\n\n- \"Output\" means the results of operating a Model as embodied in\n  informational content resulting therefrom.\n\n- \"Model\" means any accompanying machine-learning based assemblies\n  (including checkpoints), consisting of learnt weights, parameters\n  (including optimizer states), corresponding to the model\n  architecture as embodied in the Complementary Material, that have\n  been trained or tuned, in whole or in part on the Data, using the\n  Complementary Material.\n\n- \"Derivatives of the Model\" means all modifications to the Model,\n  works based on the Model, or any other model which is created or\n  initialized by transfer of patterns of the weights, parameters,\n  activations or output of the Model, to the other model, in order to\n  cause the other model to perform similarly to the Model, including -\n  but not limited to - distillation methods entailing the use of\n  intermediate data representations or methods based on the generation\n  of synthetic data by the Model for training the other model.\n\n- \"Complementary Material\" means the accompanying source code and\n  scripts used to define, run, load, benchmark or evaluate the Model,\n  and used to prepare data for training or evaluation, if any. This\n  includes any accompanying documentation, tutorials, examples, etc,\n  if any.\n\n- \"Distribution\" means any transmission, reproduction, publication or\n  other sharing of the Model or Derivatives of the Model to a third\n  party, including providing the Model as a hosted service made\n  available by electronic or other remote means - e.g. API-based or\n  web access.\n\n- \"Licensor\" means the copyright owner or entity authorized by the\n  copyright owner that is granting the License, including the persons\n  or entities that may have rights in the Model and/or distributing\n  the Model.\n\n- \"You\" (or \"Your\") means an individual or Legal Entity exercising\n  permissions granted by this License and/or making use of the Model\n  for whichever purpose and in any field of use, including usage of\n  the Model in an end-use application - e.g. chatbot, translator,\n  image generator.\n\n- \"Third Parties\" means individuals or legal entities that are not\n  under common control with Licensor or You.\n\n- \"Contribution\" means any work of authorship, including the original\n  version of the Model and any modifications or additions to that\n  Model or Derivatives of the Model thereof, that is intentionally\n  submitted to Licensor for inclusion in the Model by the copyright\n  owner or by an individual or Legal Entity authorized to submit on\n  behalf of the copyright owner. For the purposes of this definition,\n  \"submitted\" means any form of electronic, verbal, or written\n  communication sent to the Licensor or its representatives, including\n  but not limited to communication on electronic mailing lists, source\n  code control systems, and issue tracking systems that are managed\n  by, or on behalf of, the Licensor for the purpose of discussing and\n  improving the Model, but excluding communication that is\n  conspicuously marked or otherwise designated in writing by the\n  copyright owner as \"Not a Contribution.\"\n\n- \"Contributor\" means Licensor and any individual or Legal Entity on\n  behalf of whom a Contribution has been received by Licensor and\n  subsequently incorporated within the Model.\n\nSection II: INTELLECTUAL PROPERTY RIGHTS\n\nBoth copyright and patent grants apply to the Model, Derivatives of\nthe Model and Complementary Material. The Model and Derivatives of the\nModel are subject to additional terms as described in Section III.\n\n2. Grant of Copyright License. Subject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\ncopyright license to reproduce, prepare, publicly display, publicly\nperform, sublicense, and distribute the Complementary Material, the\nModel, and Derivatives of the Model.\n\n3. Grant of Patent License. Subject to the terms and conditions of\nthis License and where and as applicable, each Contributor hereby\ngrants to You a perpetual, worldwide, non-exclusive, no-charge,\nroyalty-free, irrevocable (except as stated in this paragraph) patent\nlicense to make, have made, use, offer to sell, sell, import, and\notherwise transfer the Model and the Complementary Material, where\nsuch license applies only to those patent claims licensable by such\nContributor that are necessarily infringed by their Contribution(s)\nalone or by combination of their Contribution(s) with the Model to\nwhich such Contribution(s) was submitted. If You institute patent\nlitigation against any entity (including a cross-claim or counterclaim\nin a lawsuit) alleging that the Model and/or Complementary Material or\na Contribution incorporated within the Model and/or Complementary\nMaterial constitutes direct or contributory patent infringement, then\nany patent licenses granted to You under this License for the Model\nand/or Work shall terminate as of the date such litigation is asserted\nor filed.\n\nSection III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION\n\n4. Distribution and Redistribution. You may host for Third Party\nremote access purposes (e.g. software-as-a-service), reproduce and\ndistribute copies of the Model or Derivatives of the Model thereof in\nany medium, with or without modifications, provided that You meet the\nfollowing conditions: Use-based restrictions as referenced in\nparagraph 5 MUST be included as an enforceable provision by You in any\ntype of legal agreement (e.g. a license) governing the use and/or\ndistribution of the Model or Derivatives of the Model, and You shall\ngive notice to subsequent users You Distribute to, that the Model or\nDerivatives of the Model are subject to paragraph 5. This provision\ndoes not apply to the use of Complementary Material.  You must give\nany Third Party recipients of the Model or Derivatives of the Model a\ncopy of this License; You must cause any modified files to carry\nprominent notices stating that You changed the files; You must retain\nall copyright, patent, trademark, and attribution notices excluding\nthose notices that do not pertain to any part of the Model,\nDerivatives of the Model.  You may add Your own copyright statement to\nYour modifications and may provide additional or different license\nterms and conditions - respecting paragraph 4.a. - for use,\nreproduction, or Distribution of Your modifications, or for any such\nDerivatives of the Model as a whole, provided Your use, reproduction,\nand Distribution of the Model otherwise complies with the conditions\nstated in this License.\n\n5. Use-based restrictions. The restrictions set forth in Attachment A\nare considered Use-based restrictions. Therefore You cannot use the\nModel and the Derivatives of the Model for the specified restricted\nuses. You may use the Model subject to this License, including only\nfor lawful purposes and in accordance with the License. Use may\ninclude creating any content with, finetuning, updating, running,\ntraining, evaluating and/or reparametrizing the Model. You shall\nrequire all of Your users who use the Model or a Derivative of the\nModel to comply with the terms of this paragraph (paragraph 5).\n\n6. The Output You Generate. Except as set forth herein, Licensor\nclaims no rights in the Output You generate using the Model. You are\naccountable for the Output you generate and its subsequent uses. No\nuse of the output can contravene any provision as stated in the\nLicense.\n\nSection IV: OTHER PROVISIONS\n\n7. Updates and Runtime Restrictions. To the maximum extent permitted\nby law, Licensor reserves the right to restrict (remotely or\notherwise) usage of the Model in violation of this License, update the\nModel through electronic means, or modify the Output of the Model\nbased on updates. You shall undertake reasonable efforts to use the\nlatest version of the Model.\n\n8. Trademarks and related. Nothing in this License permits You to make\nuse of Licensors’ trademarks, trade names, logos or to otherwise\nsuggest endorsement or misrepresent the relationship between the\nparties; and any rights not expressly granted herein are reserved by\nthe Licensors.\n\n9. Disclaimer of Warranty. Unless required by applicable law or agreed\nto in writing, Licensor provides the Model and the Complementary\nMaterial (and each Contributor provides its Contributions) on an \"AS\nIS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either\nexpress or implied, including, without limitation, any warranties or\nconditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR\nA PARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Model, Derivatives of\nthe Model, and the Complementary Material and assume any risks\nassociated with Your exercise of permissions under this License.\n\n10. Limitation of Liability. In no event and under no legal theory,\nwhether in tort (including negligence), contract, or otherwise, unless\nrequired by applicable law (such as deliberate and grossly negligent\nacts) or agreed to in writing, shall any Contributor be liable to You\nfor damages, including any direct, indirect, special, incidental, or\nconsequential damages of any character arising as a result of this\nLicense or out of the use or inability to use the Model and the\nComplementary Material (including but not limited to damages for loss\nof goodwill, work stoppage, computer failure or malfunction, or any\nand all other commercial damages or losses), even if such Contributor\nhas been advised of the possibility of such damages.\n\n11. Accepting Warranty or Additional Liability. While redistributing\nthe Model, Derivatives of the Model and the Complementary Material\nthereof, You may choose to offer, and charge a fee for, acceptance of\nsupport, warranty, indemnity, or other liability obligations and/or\nrights consistent with this License. However, in accepting such\nobligations, You may act only on Your own behalf and on Your sole\nresponsibility, not on behalf of any other Contributor, and only if\nYou agree to indemnify, defend, and hold each Contributor harmless for\nany liability incurred by, or claims asserted against, such\nContributor by reason of your accepting any such warranty or\nadditional liability.\n\n12. If any provision of this License is held to be invalid, illegal or\nunenforceable, the remaining provisions shall be unaffected thereby\nand remain valid as if such provision had not been set forth herein.\n\nEND OF TERMS AND CONDITIONS\n\n\n\n\nAttachment A\n\nUse Restrictions\n\nYou agree not to use the Model or Derivatives of the Model:\n\n- In any way that violates any applicable national, federal, state,\n  local or international law or regulation;\n\n- For the purpose of exploiting, harming or attempting to exploit or\n  harm minors in any way;\n\n- To generate or disseminate verifiably false information and/or\n  content with the purpose of harming others;\n\n- To generate or disseminate personal identifiable information that\n  can be used to harm an individual;\n\n- To defame, disparage or otherwise harass others;\n\n- For fully automated decision making that adversely impacts an\n  individual’s legal rights or otherwise creates or modifies a\n  binding, enforceable obligation;\n\npp- For any use intended to or which has the effect of discriminating\n  against or harming individuals or groups based on online or offline\n  social behavior or known or predicted personal or personality\n  characteristics;\n\n- To exploit any of the vulnerabilities of a specific group of persons\n  based on their age, social, physical or mental characteristics, in\n  order to materially distort the behavior of a person pertaining to\n  that group in a manner that causes or is likely to cause that person\n  or another person physical or psychological harm;\n\n- For any use intended to or which has the effect of discriminating\n  against individuals or groups based on legally protected\n  characteristics or categories;\n\n- To provide medical advice and medical results interpretation;\n\n- To generate or disseminate information for the purpose to be used\n  for administration of justice, law enforcement, immigration or\n  asylum processes, such as predicting an individual will commit\n  fraud/crime commitment (e.g. by text profiling, drawing causal\n  relationships between assertions made in documents, indiscriminate\n  and arbitrarily-targeted use).\n"
        },
        {
          "name": "LICENSE-SDXL.txt",
          "type": "blob",
          "size": 13.8798828125,
          "content": "Copyright (c) 2023 Stability AI\nCreativeML Open RAIL++-M License dated July 26, 2023\n\nSection I: PREAMBLE\n\nMultimodal generative models are being widely adopted and used, and\nhave the potential to transform the way artists, among other\nindividuals, conceive and benefit from AI or ML technologies as a tool\nfor content creation.\n\nNotwithstanding the current and potential benefits that these\nartifacts can bring to society at large, there are also concerns about\npotential misuses of them, either due to their technical limitations\nor ethical considerations.\n\nIn short, this license strives for both the open and responsible\ndownstream use of the accompanying model. When it comes to the open\ncharacter, we took inspiration from open source permissive licenses\nregarding the grant of IP rights. Referring to the downstream\nresponsible use, we added use-based restrictions not permitting the\nuse of the model in very specific scenarios, in order for the licensor\nto be able to enforce the license in case potential misuses of the\nModel may occur. At the same time, we strive to promote open and\nresponsible research on generative models for art and content\ngeneration.\n\nEven though downstream derivative versions of the model could be\nreleased under different licensing terms, the latter will always have\nto include - at minimum - the same use-based restrictions as the ones\nin the original license (this license). We believe in the intersection\nbetween open and responsible AI development; thus, this agreement aims\nto strike a balance between both in order to enable responsible\nopen-science in the field of AI.\n\nThis CreativeML Open RAIL++-M License governs the use of the model\n(and its derivatives) and is informed by the model card associated\nwith the model.\n\nNOW THEREFORE, You and Licensor agree as follows:\n\nDefinitions\n\n\"License\" means the terms and conditions for use, reproduction, and\nDistribution as defined in this document.\n\n\"Data\" means a collection of information and/or content extracted from\nthe dataset used with the Model, including to train, pretrain, or\notherwise evaluate the Model. The Data is not licensed under this\nLicense.\n\n\"Output\" means the results of operating a Model as embodied in\ninformational content resulting therefrom.\n\n\"Model\" means any accompanying machine-learning based assemblies\n(including checkpoints), consisting of learnt weights, parameters\n(including optimizer states), corresponding to the model architecture\nas embodied in the Complementary Material, that have been trained or\ntuned, in whole or in part on the Data, using the Complementary\nMaterial.\n\n\"Derivatives of the Model\" means all modifications to the Model, works\nbased on the Model, or any other model which is created or initialized\nby transfer of patterns of the weights, parameters, activations or\noutput of the Model, to the other model, in order to cause the other\nmodel to perform similarly to the Model, including - but not limited\nto - distillation methods entailing the use of intermediate data\nrepresentations or methods based on the generation of synthetic data\nby the Model for training the other model.\n\n\"Complementary Material\" means the accompanying source code and\nscripts used to define, run, load, benchmark or evaluate the Model,\nand used to prepare data for training or evaluation, if any. This\nincludes any accompanying documentation, tutorials, examples, etc, if\nany.\n\n\"Distribution\" means any transmission, reproduction, publication or\nother sharing of the Model or Derivatives of the Model to a third\nparty, including providing the Model as a hosted service made\navailable by electronic or other remote means - e.g. API-based or web\naccess.\n\n\"Licensor\" means the copyright owner or entity authorized by the\ncopyright owner that is granting the License, including the persons or\nentities that may have rights in the Model and/or distributing the\nModel.\n\n\"You\" (or \"Your\") means an individual or Legal Entity exercising\npermissions granted by this License and/or making use of the Model for\nwhichever purpose and in any field of use, including usage of the\nModel in an end-use application - e.g. chatbot, translator, image\ngenerator.\n\n\"Third Parties\" means individuals or legal entities that are not under\ncommon control with Licensor or You.\n\n\"Contribution\" means any work of authorship, including the original\nversion of the Model and any modifications or additions to that Model\nor Derivatives of the Model thereof, that is intentionally submitted\nto Licensor for inclusion in the Model by the copyright owner or by an\nindividual or Legal Entity authorized to submit on behalf of the\ncopyright owner. For the purposes of this definition, \"submitted\"\nmeans any form of electronic, verbal, or written communication sent to\nthe Licensor or its representatives, including but not limited to\ncommunication on electronic mailing lists, source code control\nsystems, and issue tracking systems that are managed by, or on behalf\nof, the Licensor for the purpose of discussing and improving the\nModel, but excluding communication that is conspicuously marked or\notherwise designated in writing by the copyright owner as \"Not a\nContribution.\"\n\n\"Contributor\" means Licensor and any individual or Legal Entity on\nbehalf of whom a Contribution has been received by Licensor and\nsubsequently incorporated within the Model.\n\nSection II: INTELLECTUAL PROPERTY RIGHTS\n\nBoth copyright and patent grants apply to the Model, Derivatives of\nthe Model and Complementary Material. The Model and Derivatives of the\nModel are subject to additional terms as described in\n\nSection III.\n\nGrant of Copyright License. Subject to the terms and conditions of\nthis License, each Contributor hereby grants to You a perpetual,\nworldwide, non-exclusive, no-charge, royalty-free, irrevocable\ncopyright license to reproduce, prepare, publicly display, publicly\nperform, sublicense, and distribute the Complementary Material, the\nModel, and Derivatives of the Model.\n\nGrant of Patent License. Subject to the terms and conditions of this\nLicense and where and as applicable, each Contributor hereby grants to\nYou a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable (except as stated in this paragraph) patent license to\nmake, have made, use, offer to sell, sell, import, and otherwise\ntransfer the Model and the Complementary Material, where such license\napplies only to those patent claims licensable by such Contributor\nthat are necessarily infringed by their Contribution(s) alone or by\ncombination of their Contribution(s) with the Model to which such\nContribution(s) was submitted. If You institute patent litigation\nagainst any entity (including a cross-claim or counterclaim in a\nlawsuit) alleging that the Model and/or Complementary Material or a\nContribution incorporated within the Model and/or Complementary\nMaterial constitutes direct or contributory patent infringement, then\nany patent licenses granted to You under this License for the Model\nand/or Work shall terminate as of the date such litigation is asserted\nor filed.\n\nSection III: CONDITIONS OF USAGE, DISTRIBUTION AND REDISTRIBUTION\n\nDistribution and Redistribution. You may host for Third Party remote\naccess purposes (e.g. software-as-a-service), reproduce and distribute\ncopies of the Model or Derivatives of the Model thereof in any medium,\nwith or without modifications, provided that You meet the following\nconditions: Use-based restrictions as referenced in paragraph 5 MUST\nbe included as an enforceable provision by You in any type of legal\nagreement (e.g. a license) governing the use and/or distribution of\nthe Model or Derivatives of the Model, and You shall give notice to\nsubsequent users You Distribute to, that the Model or Derivatives of\nthe Model are subject to paragraph 5. This provision does not apply to\nthe use of Complementary Material. You must give any Third Party\nrecipients of the Model or Derivatives of the Model a copy of this\nLicense; You must cause any modified files to carry prominent notices\nstating that You changed the files; You must retain all copyright,\npatent, trademark, and attribution notices excluding those notices\nthat do not pertain to any part of the Model, Derivatives of the\nModel. You may add Your own copyright statement to Your modifications\nand may provide additional or different license terms and conditions -\nrespecting paragraph 4.a. - for use, reproduction, or Distribution of\nYour modifications, or for any such Derivatives of the Model as a\nwhole, provided Your use, reproduction, and Distribution of the Model\notherwise complies with the conditions stated in this License.\n\nUse-based restrictions. The restrictions set forth in Attachment A are\nconsidered Use-based restrictions. Therefore You cannot use the Model\nand the Derivatives of the Model for the specified restricted\nuses. You may use the Model subject to this License, including only\nfor lawful purposes and in accordance with the License. Use may\ninclude creating any content with, finetuning, updating, running,\ntraining, evaluating and/or reparametrizing the Model. You shall\nrequire all of Your users who use the Model or a Derivative of the\nModel to comply with the terms of this paragraph (paragraph 5).\n\nThe Output You Generate.  Except as set forth herein, Licensor claims\nno rights in the Output You generate using the Model. You are\naccountable for the Output you generate and its subsequent uses. No\nuse of the output can contravene any provision as stated in the\nLicense.\n\nSection IV: OTHER PROVISIONS\n\nUpdates and Runtime Restrictions. To the maximum extent permitted by\nlaw, Licensor reserves the right to restrict (remotely or otherwise)\nusage of the Model in violation of this License.\n\nTrademarks and related. Nothing in this License permits You to make\nuse of Licensors’ trademarks, trade names, logos or to otherwise\nsuggest endorsement or misrepresent the relationship between the\nparties; and any rights not expressly granted herein are reserved by\nthe Licensors.\n\nDisclaimer of Warranty. Unless required by applicable law or agreed to\nin writing, Licensor provides the Model and the Complementary Material\n(and each Contributor provides its Contributions) on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied, including, without limitation, any warranties or conditions\nof TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\nPARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Model, Derivatives of\nthe Model, and the Complementary Material and assume any risks\nassociated with Your exercise of permissions under this License.\n\nLimitation of Liability. In no event and under no legal theory,\nwhether in tort (including negligence), contract, or otherwise, unless\nrequired by applicable law (such as deliberate and grossly negligent\nacts) or agreed to in writing, shall any Contributor be liable to You\nfor damages, including any direct, indirect, special, incidental, or\nconsequential damages of any character arising as a result of this\nLicense or out of the use or inability to use the Model and the\nComplementary Material (including but not limited to damages for loss\nof goodwill, work stoppage, computer failure or malfunction, or any\nand all other commercial damages or losses), even if such Contributor\nhas been advised of the possibility of such damages.\n\nAccepting Warranty or Additional Liability. While redistributing the\nModel, Derivatives of the Model and the Complementary Material\nthereof, You may choose to offer, and charge a fee for, acceptance of\nsupport, warranty, indemnity, or other liability obligations and/or\nrights consistent with this License. However, in accepting such\nobligations, You may act only on Your own behalf and on Your sole\nresponsibility, not on behalf of any other Contributor, and only if\nYou agree to indemnify, defend, and hold each Contributor harmless for\nany liability incurred by, or claims asserted against, such\nContributor by reason of your accepting any such warranty or\nadditional liability.\n\nIf any provision of this License is held to be invalid, illegal or\nunenforceable, the remaining provisions shall be unaffected thereby\nand remain valid as if such provision had not been set forth herein.\n\n\nEND OF TERMS AND CONDITIONS\n\nAttachment A\n\nUse Restrictions\n\nYou agree not to use the Model or Derivatives of the Model:\n\n* In any way that violates any applicable national, federal, state,\nlocal or international law or regulation;\n\n* For the purpose of exploiting, harming or attempting to exploit or\nharm minors in any way;\n\n* To generate or disseminate verifiably false information and/or\n  content with the purpose of harming others;\n\n* To generate or disseminate personal identifiable information that\n  can be used to harm an individual;\n\n* To defame, disparage or otherwise harass others;\n\n* For fully automated decision making that adversely impacts an\n  individual’s legal rights or otherwise creates or modifies a\n  binding, enforceable obligation;\n\n* For any use intended to or which has the effect of discriminating\n  against or harming individuals or groups based on online or offline\n  social behavior or known or predicted personal or personality\n  characteristics;\n\n* To exploit any of the vulnerabilities of a specific group of persons\n  based on their age, social, physical or mental characteristics, in\n  order to materially distort the behavior of a person pertaining to\n  that group in a manner that causes or is likely to cause that person\n  or another person physical or psychological harm;\n\n* For any use intended to or which has the effect of discriminating\n  against individuals or groups based on legally protected\n  characteristics or categories;\n\n* To provide medical advice and medical results interpretation;\n\n* To generate or disseminate information for the purpose to be used\n  for administration of justice, law enforcement, immigration or\n  asylum processes, such as predicting an individual will commit\n  fraud/crime commitment (e.g. by text profiling, drawing causal\n  relationships between assertions made in documents, indiscriminate\n  and arbitrarily-targeted use).\n\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 2.8564453125,
          "content": "# simple Makefile with scripts that are otherwise hard to remember\n# to use, run from the repo root `make <command>`\n\ndefault: help\n\nhelp:\n\t@echo Developer commands:\n\t@echo\n\t@echo \"ruff                     Run ruff, fixing any safely-fixable errors and formatting\"\n\t@echo \"ruff-unsafe              Run ruff, fixing all fixable errors and formatting\"\n\t@echo \"mypy                     Run mypy using the config in pyproject.toml to identify type mismatches and other coding errors\"\n\t@echo \"mypy-all                 Run mypy ignoring the config in pyproject.tom but still ignoring missing imports\"\n\t@echo \"test                     Run the unit tests.\"\n\t@echo \"update-config-docstring  Update the app's config docstring so mkdocs can autogenerate it correctly.\"\n\t@echo \"frontend-install         Install the pnpm modules needed for the front end\"\n\t@echo \"frontend-build           Build the frontend in order to run on localhost:9090\"\n\t@echo \"frontend-dev             Run the frontend in developer mode on localhost:5173\"\n\t@echo \"frontend-typegen         Generate types for the frontend from the OpenAPI schema\"\n\t@echo \"installer-zip            Build the installer .zip file for the current version\"\n\t@echo \"tag-release              Tag the GitHub repository with the current version (use at release time only!)\"\n\t@echo \"openapi                  Generate the OpenAPI schema for the app, outputting to stdout\"\n\t@echo \"docs                     Serve the mkdocs site with live reload\"\n\n# Runs ruff, fixing any safely-fixable errors and formatting\nruff:\n\truff check . --fix\n\truff format .\n\n# Runs ruff, fixing all errors it can fix and formatting\nruff-unsafe:\n\truff check . --fix --unsafe-fixes\n\truff format .\n\n# Runs mypy, using the config in pyproject.toml\nmypy:\n\tmypy scripts/invokeai-web.py\n\n# Runs mypy, ignoring the config in pyproject.toml but still ignoring missing (untyped) imports\n# (many files are ignored by the config, so this is useful for checking all files)\nmypy-all:\n\tmypy scripts/invokeai-web.py --config-file= --ignore-missing-imports\n\n# Run the unit tests\ntest:\n\tpytest ./tests\n\n# Update config docstring\nupdate-config-docstring:\n\tpython scripts/update_config_docstring.py\n\n# Install the pnpm modules needed for the front end\nfrontend-install:\n\trm -rf invokeai/frontend/web/node_modules\n\tcd invokeai/frontend/web && pnpm install\n\n# Build the frontend\nfrontend-build:\n\tcd invokeai/frontend/web && pnpm build\n\n# Run the frontend in dev mode\nfrontend-dev:\n\tcd invokeai/frontend/web && pnpm dev\n\nfrontend-typegen:\n\tcd invokeai/frontend/web && python ../../../scripts/generate_openapi_schema.py | pnpm typegen\n\n# Installer zip file\ninstaller-zip:\n\tcd installer && ./create_installer.sh\n\n# Tag the release\ntag-release:\n\tcd installer && ./tag_release.sh\n\n# Generate the OpenAPI Schema for the app\nopenapi:\n\tpython scripts/generate_openapi_schema.py\n\n# Serve the mkdocs site w/ live reload\n.PHONY: docs\ndocs:\n\tmkdocs serve"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 8.1826171875,
          "content": "<div align=\"center\">\n\n![project hero](https://github.com/invoke-ai/InvokeAI/assets/31807370/6e3728c7-e90e-4711-905c-3b55844ff5be)\n\n# Invoke - Professional Creative AI Tools for Visual Media\n\n#### To learn more about Invoke, or implement our Business solutions, visit [invoke.com]\n\n[![discord badge]][discord link] [![latest release badge]][latest release link] [![github stars badge]][github stars link] [![github forks badge]][github forks link] [![CI checks on main badge]][CI checks on main link] [![latest commit to main badge]][latest commit to main link] [![github open issues badge]][github open issues link] [![github open prs badge]][github open prs link] [![translation status badge]][translation status link]\n\n</div>\n\nInvoke is a leading creative engine built to empower professionals and enthusiasts alike. Generate and create stunning visual media using the latest AI-driven technologies. Invoke offers an industry leading web-based UI, and serves as the foundation for multiple commercial products.\n\nInvoke is available in two editions:\n\n| **Community Edition**                                                                                                      | **Professional Edition**                                                                            |\n|----------------------------------------------------------------------------------------------------------------------------|-----------------------------------------------------------------------------------------------------|\n| **For users looking for a locally installed, self-hosted and self-managed service**                                         | **For users or teams looking for a cloud-hosted, fully managed service**                            |\n| - Free to use under a commercially-friendly license                                                                         | - Monthly subscription fee with three different plan levels                                         |\n| - Download and install on compatible hardware                                                                               | - Offers additional benefits, including multi-user support, improved model training, and more                          |\n| - Includes all core studio features: generate, refine, iterate on images, and build workflows                               | - Hosted in the cloud for easy, secure model access and scalability                                               |\n| Quick Start -> [Installation and Updates][installation docs]                                                                     | More Information -> [www.invoke.com/pricing](https://www.invoke.com/pricing)                        |\n\n\n![Highlighted Features - Canvas and Workflows](https://github.com/invoke-ai/InvokeAI/assets/31807370/708f7a82-084f-4860-bfbe-e2588c53548d)\n\n# Documentation\n| **Quick Links**                                                                                                      | \n|----------------------------------------------------------------------------------------------------------------------------|\n|  [Installation and Updates][installation docs] - [Documentation and Tutorials][docs home] - [Bug Reports][github issues] - [Contributing][contributing docs]  | \n\n# Installation\n\nTo get started with Invoke, [Download the Installer](https://www.invoke.com/downloads).\n\nFor detailed step by step instructions, or for instructions on manual/docker installations, visit our documentation on [Installation and Updates][installation docs]\n\n\n## Troubleshooting, FAQ and Support\n\nPlease review our [FAQ][faq] for solutions to common installation problems and other issues.\n\nFor more help, please join our [Discord][discord link].\n\n## Features\n\nFull details on features can be found in [our documentation][features docs].\n\n### Web Server & UI\n\nInvoke runs a locally hosted web server & React UI with an industry-leading user experience.\n\n### Unified Canvas\n\nThe Unified Canvas is a fully integrated canvas implementation with support for all core generation capabilities, in/out-painting, brush tools, and more. This creative tool unlocks the capability for artists to create with AI as a creative collaborator, and can be used to augment AI-generated imagery, sketches, photography, renders, and more.\n\n### Workflows & Nodes\n\nInvoke offers a fully featured workflow management solution, enabling users to combine the power of node-based workflows with the easy of a UI. This allows for customizable generation pipelines to be developed and shared by users looking to create specific workflows to support their production use-cases.\n\n### Board & Gallery Management\n\nInvoke features an organized gallery system for easily storing, accessing, and remixing your content in the Invoke workspace. Images can be dragged/dropped onto any Image-base UI element in the application, and rich metadata within the Image allows for easy recall of key prompts or settings used in your workflow.\n\n### Other features\n\n- Support for both ckpt and diffusers models\n- SD1.5, SD2.0, SDXL, and FLUX support\n- Upscaling Tools\n- Embedding Manager & Support\n- Model Manager & Support\n- Workflow creation & management\n- Node-Based Architecture\n\n## Contributing\n\nAnyone who wishes to contribute to this project - whether documentation, features, bug fixes, code cleanup, testing, or code reviews - is very much encouraged to do so.\n\nGet started with contributing by reading our [contribution documentation][contributing docs], joining the [#dev-chat] or the GitHub discussion board.\n\nWe hope you enjoy using Invoke as much as we enjoy creating it, and we hope you will elect to become part of our community.\n\n## Thanks\n\nInvoke is a combined effort of [passionate and talented people from across the world][contributors]. We thank them for their time, hard work and effort.\n\nOriginal portions of the software are Copyright © 2024 by respective contributors.\n\n[features docs]: https://invoke-ai.github.io/InvokeAI/features/database/\n[faq]: https://invoke-ai.github.io/InvokeAI/faq/\n[contributors]: https://invoke-ai.github.io/InvokeAI/contributing/contributors/\n[invoke.com]: https://www.invoke.com/about\n[github issues]: https://github.com/invoke-ai/InvokeAI/issues\n[docs home]: https://invoke-ai.github.io/InvokeAI\n[installation docs]: https://invoke-ai.github.io/InvokeAI/installation/\n[#dev-chat]: https://discord.com/channels/1020123559063990373/1049495067846524939\n[contributing docs]: https://invoke-ai.github.io/InvokeAI/contributing/\n[CI checks on main badge]: https://flat.badgen.net/github/checks/invoke-ai/InvokeAI/main?label=CI%20status%20on%20main&cache=900&icon=github\n[CI checks on main link]: https://github.com/invoke-ai/InvokeAI/actions?query=branch%3Amain\n[discord badge]: https://flat.badgen.net/discord/members/ZmtBAhwWhy?icon=discord\n[discord link]: https://discord.gg/ZmtBAhwWhy\n[github forks badge]: https://flat.badgen.net/github/forks/invoke-ai/InvokeAI?icon=github\n[github forks link]: https://useful-forks.github.io/?repo=invoke-ai%2FInvokeAI\n[github open issues badge]: https://flat.badgen.net/github/open-issues/invoke-ai/InvokeAI?icon=github\n[github open issues link]: https://github.com/invoke-ai/InvokeAI/issues?q=is%3Aissue+is%3Aopen\n[github open prs badge]: https://flat.badgen.net/github/open-prs/invoke-ai/InvokeAI?icon=github\n[github open prs link]: https://github.com/invoke-ai/InvokeAI/pulls?q=is%3Apr+is%3Aopen\n[github stars badge]: https://flat.badgen.net/github/stars/invoke-ai/InvokeAI?icon=github\n[github stars link]: https://github.com/invoke-ai/InvokeAI/stargazers\n[latest commit to main badge]: https://flat.badgen.net/github/last-commit/invoke-ai/InvokeAI/main?icon=github&color=yellow&label=last%20dev%20commit&cache=900\n[latest commit to main link]: https://github.com/invoke-ai/InvokeAI/commits/main\n[latest release badge]: https://flat.badgen.net/github/release/invoke-ai/InvokeAI/development?icon=github\n[latest release link]: https://github.com/invoke-ai/InvokeAI/releases/latest\n[translation status badge]: https://hosted.weblate.org/widgets/invokeai/-/svg-badge.svg\n[translation status link]: https://hosted.weblate.org/engage/invokeai/\n[nvidia docker docs]: https://docs.nvidia.com/datacenter/cloud-native/container-toolkit/latest/install-guide.html\n[amd docker docs]: https://rocm.docs.amd.com/projects/install-on-linux/en/latest/how-to/docker.html\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 0.4287109375,
          "content": "# Security Policy\n\n## Supported Versions\n\nOnly the latest version of Invoke will receive security updates. \nWe do not currently maintain multiple versions of the application with updates.\n\n## Reporting a Vulnerability\n\nTo report a vulnerability, contact the Invoke team directly at security@invoke.ai\n\nAt this time, we do not maintain a formal bug bounty program. \n\nYou can also share identified security issues with our team on huntr.com\n"
        },
        {
          "name": "Stable_Diffusion_v1_Model_Card.md",
          "type": "blob",
          "size": 8.3857421875,
          "content": "# Stable Diffusion v1 Model Card\nThis model card focuses on the model associated with the Stable Diffusion model, available [here](https://github.com/CompVis/stable-diffusion).\n\n## Model Details\n- **Developed by:** Robin Rombach, Patrick Esser\n- **Model type:** Diffusion-based text-to-image generation model\n- **Language(s):** English\n- **License:** [Proprietary](LICENSE)\n- **Model Description:** This is a model that can be used to generate and modify images based on text prompts. It is a [Latent Diffusion Model](https://arxiv.org/abs/2112.10752) that uses a fixed, pretrained text encoder ([CLIP ViT-L/14](https://arxiv.org/abs/2103.00020)) as suggested in the [Imagen paper](https://arxiv.org/abs/2205.11487).\n- **Resources for more information:** [GitHub Repository](https://github.com/CompVis/stable-diffusion), [Paper](https://arxiv.org/abs/2112.10752).\n- **Cite as:**\n\n      @InProceedings{Rombach_2022_CVPR,\n          author    = {Rombach, Robin and Blattmann, Andreas and Lorenz, Dominik and Esser, Patrick and Ommer, Bj\\\"orn},\n          title     = {High-Resolution Image Synthesis With Latent Diffusion Models},\n          booktitle = {Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)},\n          month     = {June},\n          year      = {2022},\n          pages     = {10684-10695}\n      }\n\n# Uses\n\n## Direct Use\nThe model is intended for research purposes only. Possible research areas and\ntasks include\n\n- Safe deployment of models which have the potential to generate harmful content.\n- Probing and understanding the limitations and biases of generative models.\n- Generation of artworks and use in design and other artistic processes.\n- Applications in educational or creative tools.\n- Research on generative models.\n\nExcluded uses are described below.\n\n ### Misuse, Malicious Use, and Out-of-Scope Use\n_Note: This section is taken from the [DALLE-MINI model card](https://huggingface.co/dalle-mini/dalle-mini), but applies in the same way to Stable Diffusion v1_.\n\n\nThe model should not be used to intentionally create or disseminate images that create hostile or alienating environments for people. This includes generating images that people would foreseeably find disturbing, distressing, or offensive; or content that propagates historical or current stereotypes.\n#### Out-of-Scope Use\nThe model was not trained to be factual or true representations of people or events, and therefore using the model to generate such content is out-of-scope for the abilities of this model.\n#### Misuse and Malicious Use\nUsing the model to generate content that is cruel to individuals is a misuse of this model. This includes, but is not limited to:\n\n- Generating demeaning, dehumanizing, or otherwise harmful representations of people or their environments, cultures, religions, etc.\n- Intentionally promoting or propagating discriminatory content or harmful stereotypes.\n- Impersonating individuals without their consent.\n- Sexual content without consent of the people who might see it.\n- Mis- and disinformation\n- Representations of egregious violence and gore\n- Sharing of copyrighted or licensed material in violation of its terms of use.\n- Sharing content that is an alteration of copyrighted or licensed material in violation of its terms of use.\n\n## Limitations and Bias\n\n### Limitations\n\n- The model does not achieve perfect photorealism\n- The model cannot render legible text\n- The model does not perform well on more difficult tasks which involve compositionality, such as rendering an image corresponding to “A red cube on top of a blue sphere”\n- Faces and people in general may not be generated properly.\n- The model was trained mainly with English captions and will not work as well in other languages.\n- The autoencoding part of the model is lossy\n- The model was trained on a large-scale dataset\n  [LAION-5B](https://laion.ai/blog/laion-5b/) which contains adult material\n  and is not fit for product use without additional safety mechanisms and\n  considerations.\n\n### Bias\nWhile the capabilities of image generation models are impressive, they can also reinforce or exacerbate social biases.\nStable Diffusion v1 was trained on subsets of [LAION-2B(en)](https://laion.ai/blog/laion-5b/),\nwhich consists of images that are primarily limited to English descriptions.\nTexts and images from communities and cultures that use other languages are likely to be insufficiently accounted for.\nThis affects the overall output of the model, as white and western cultures are often set as the default. Further, the\nability of the model to generate content with non-English prompts is significantly worse than with English-language prompts.\n\n\n## Training\n\n**Training Data**\nThe model developers used the following dataset for training the model:\n\n- LAION-2B (en) and subsets thereof (see next section)\n\n**Training Procedure**\nStable Diffusion v1 is a latent diffusion model which combines an autoencoder with a diffusion model that is trained in the latent space of the autoencoder. During training,\n\n- Images are encoded through an encoder, which turns images into latent representations. The autoencoder uses a relative downsampling factor of 8 and maps images of shape H x W x 3 to latents of shape H/f x W/f x 4\n- Text prompts are encoded through a ViT-L/14 text-encoder.\n- The non-pooled output of the text encoder is fed into the UNet backbone of the latent diffusion model via cross-attention.\n- The loss is a reconstruction objective between the noise that was added to the latent and the prediction made by the UNet.\n\nWe currently provide three checkpoints, `sd-v1-1.ckpt`, `sd-v1-2.ckpt` and `sd-v1-3.ckpt`,\nwhich were trained as follows,\n\n- `sd-v1-1.ckpt`: 237k steps at resolution `256x256` on [laion2B-en](https://huggingface.co/datasets/laion/laion2B-en).\n  194k steps at resolution `512x512` on [laion-high-resolution](https://huggingface.co/datasets/laion/laion-high-resolution) (170M examples from LAION-5B with resolution `>= 1024x1024`).\n- `sd-v1-2.ckpt`: Resumed from `sd-v1-1.ckpt`.\n  515k steps at resolution `512x512` on \"laion-improved-aesthetics\" (a subset of laion2B-en,\nfiltered to images with an original size `>= 512x512`, estimated aesthetics score `> 5.0`, and an estimated watermark probability `< 0.5`. The watermark estimate is from the LAION-5B metadata, the aesthetics score is estimated using an [improved aesthetics estimator](https://github.com/christophschuhmann/improved-aesthetic-predictor)).\n- `sd-v1-3.ckpt`: Resumed from `sd-v1-2.ckpt`. 195k steps at resolution `512x512` on \"laion-improved-aesthetics\" and 10\\% dropping of the text-conditioning to improve [classifier-free guidance sampling](https://arxiv.org/abs/2207.12598).\n\n\n- **Hardware:** 32 x 8 x A100 GPUs\n- **Optimizer:** AdamW\n- **Gradient Accumulations**: 2\n- **Batch:** 32 x 8 x 2 x 4 = 2048\n- **Learning rate:** warmup to 0.0001 for 10,000 steps and then kept constant\n\n## Evaluation Results\nEvaluations with different classifier-free guidance scales (1.5, 2.0, 3.0, 4.0,\n5.0, 6.0, 7.0, 8.0) and 50 PLMS sampling\nsteps show the relative improvements of the checkpoints:\n\n![pareto](assets/v1-variants-scores.jpg)\n\nEvaluated using 50 PLMS steps and 10000 random prompts from the COCO2017 validation set, evaluated at 512x512 resolution.  Not optimized for FID scores.\n## Environmental Impact\n\n**Stable Diffusion v1** **Estimated Emissions**\nBased on that information, we estimate the following CO2 emissions using the [Machine Learning Impact calculator](https://mlco2.github.io/impact#compute) presented in [Lacoste et al. (2019)](https://arxiv.org/abs/1910.09700). The hardware, runtime, cloud provider, and compute region were utilized to estimate the carbon impact.\n\n- **Hardware Type:** A100 PCIe 40GB\n- **Hours used:** 150000\n- **Cloud Provider:** AWS\n- **Compute Region:** US-east\n- **Carbon Emitted (Power consumption x Time x Carbon produced based on location of power grid):** 11250 kg CO2 eq.\n## Citation\n    @InProceedings{Rombach_2022_CVPR,\n        author    = {Rombach, Robin and Blattmann, Andreas and Lorenz, Dominik and Esser, Patrick and Ommer, Bj\\\"orn},\n        title     = {High-Resolution Image Synthesis With Latent Diffusion Models},\n        booktitle = {Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR)},\n        month     = {June},\n        year      = {2022},\n        pages     = {10684-10695}\n    }\n\n*This model card was written by: Robin Rombach and Patrick Esser and is based on the [DALL-E Mini model card](https://huggingface.co/dalle-mini/dalle-mini).*\n\n"
        },
        {
          "name": "coverage",
          "type": "tree",
          "content": null
        },
        {
          "name": "docker",
          "type": "tree",
          "content": null
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "flake.lock",
          "type": "blob",
          "size": 0.49609375,
          "content": "{\n  \"nodes\": {\n    \"nixpkgs\": {\n      \"locked\": {\n        \"lastModified\": 1727955264,\n        \"narHash\": \"sha256-lrd+7mmb5NauRoMa8+J1jFKYVa+rc8aq2qc9+CxPDKc=\",\n        \"owner\": \"NixOS\",\n        \"repo\": \"nixpkgs\",\n        \"rev\": \"71cd616696bd199ef18de62524f3df3ffe8b9333\",\n        \"type\": \"github\"\n      },\n      \"original\": {\n        \"id\": \"nixpkgs\",\n        \"type\": \"indirect\"\n      }\n    },\n    \"root\": {\n      \"inputs\": {\n        \"nixpkgs\": \"nixpkgs\"\n      }\n    }\n  },\n  \"root\": \"root\",\n  \"version\": 7\n}\n"
        },
        {
          "name": "flake.nix",
          "type": "blob",
          "size": 2.7265625,
          "content": "# Important note: this flake does not attempt to create a fully isolated, 'pure'\n# Python environment for InvokeAI. Instead, it depends on local invocations of\n# virtualenv/pip to install the required (binary) packages, most importantly the\n# prebuilt binary pytorch packages with CUDA support.\n# ML Python packages with CUDA support, like pytorch, are notoriously expensive\n# to compile so it's purposefuly not what this flake does.\n\n{\n  description = \"An (impure) flake to develop on InvokeAI.\";\n\n  outputs = { self, nixpkgs }:\n    let\n      system = \"x86_64-linux\";\n      pkgs = import nixpkgs {\n        inherit system;\n        config.allowUnfree = true;\n      };\n\n      python = pkgs.python310;\n\n      mkShell = { dir, install }:\n        let\n          setupScript = pkgs.writeScript \"setup-invokai\" ''\n            # This must be sourced using 'source', not executed.\n            ${python}/bin/python -m venv ${dir}\n            ${dir}/bin/python -m pip install ${install}\n            # ${dir}/bin/python -c 'import torch; assert(torch.cuda.is_available())'\n            source ${dir}/bin/activate\n          '';\n        in\n        pkgs.mkShell rec {\n          buildInputs = with pkgs; [\n            # Backend: graphics, CUDA.\n            cudaPackages.cudnn\n            cudaPackages.cuda_nvrtc\n            cudatoolkit\n            pkg-config\n            libconfig\n            cmake\n            blas\n            freeglut\n            glib\n            gperf\n            procps\n            libGL\n            libGLU\n            linuxPackages.nvidia_x11\n            python\n            (opencv4.override {\n              enableGtk3 = true;\n              enableFfmpeg = true;\n              enableCuda = true;\n              enableUnfree = true;\n            })\n            stdenv.cc\n            stdenv.cc.cc.lib\n            xorg.libX11\n            xorg.libXext\n            xorg.libXi\n            xorg.libXmu\n            xorg.libXrandr\n            xorg.libXv\n            zlib\n\n            # Pre-commit hooks.\n            black\n\n            # Frontend.\n            pnpm_8\n            nodejs\n          ];\n          LD_LIBRARY_PATH = pkgs.lib.makeLibraryPath buildInputs;\n          CUDA_PATH = pkgs.cudatoolkit;\n          EXTRA_LDFLAGS = \"-L${pkgs.linuxPackages.nvidia_x11}/lib\";\n          shellHook = ''\n            if [[ -f \"${dir}/bin/activate\" ]]; then\n              source \"${dir}/bin/activate\"\n              echo \"Using Python: $(which python)\"\n            else\n              echo \"Use 'source ${setupScript}' to set up the environment.\"\n            fi\n          '';\n        };\n    in\n    {\n      devShells.${system} = rec {\n        develop = mkShell { dir = \"venv\"; install = \"-e '.[xformers]' --extra-index-url https://download.pytorch.org/whl/cu118\"; };\n        default = develop;\n      };\n    };\n}\n"
        },
        {
          "name": "installer",
          "type": "tree",
          "content": null
        },
        {
          "name": "invokeai",
          "type": "tree",
          "content": null
        },
        {
          "name": "mkdocs.yml",
          "type": "blob",
          "size": 5.4140625,
          "content": "# yaml-language-server: $schema=https://squidfunk.github.io/mkdocs-material/schema.json\n\n# General\nsite_name: Invoke\nsite_url: https://invoke-ai.github.io/InvokeAI\nsite_author: mauwii\ndev_addr: '127.0.0.1:8080'\n\n# Repository\nrepo_name: 'invoke-ai/InvokeAI'\nrepo_url: 'https://github.com/invoke-ai/InvokeAI'\nedit_uri: edit/main/docs/\n\n# Copyright\ncopyright: Copyright &copy; 2022-2024 InvokeAI Team\n\n# Configuration\ntheme:\n  name: material\n  font:\n    text: 'Inter'\n    code: 'JetBrains Mono'\n  logo: img/invoke-symbol-wht-lrg.svg\n  icon:\n    repo: fontawesome/brands/github\n    edit: material/file-document-edit-outline\n  favicon: img/favicon.ico\n  palette:\n    scheme: slate\n    primary: black\n  features:\n    - navigation.instant\n    - navigation.tabs\n    - navigation.tabs.sticky\n    - navigation.tracking\n    - navigation.indexes\n    - navigation.path\n    - search.highlight\n    - search.suggest\n    - toc.integrate\n\n# Extensions\nmarkdown_extensions:\n  - abbr\n  - admonition\n  - attr_list\n  - def_list\n  - footnotes\n  - md_in_html\n  - toc:\n      permalink: '#'\n  - pymdownx.arithmatex:\n      generic: true\n  - pymdownx.betterem:\n      smart_enable: all\n  - pymdownx.caret\n  - pymdownx.details\n  - pymdownx.emoji:\n      emoji_index: !!python/name:material.extensions.emoji.twemoji\n      emoji_generator: !!python/name:material.extensions.emoji.to_svg\n  - pymdownx.highlight:\n      anchor_linenums: true\n  - pymdownx.inlinehilite\n  - pymdownx.keys\n  - pymdownx.magiclink:\n      repo_url_shorthand: true\n      user: 'invoke-ai'\n      repo: 'InvokeAI'\n  - pymdownx.mark\n  - pymdownx.smartsymbols\n  - pymdownx.superfences:\n      custom_fences:\n        - name: mermaid\n          class: mermaid\n          format: !!python/name:pymdownx.superfences.fence_code_format\n  - pymdownx.snippets\n  - pymdownx.tabbed:\n      alternate_style: true\n  - pymdownx.tasklist:\n      custom_checkbox: true\n  - pymdownx.tilde\n  - tables\n\nplugins:\n  - search\n  - git-revision-date-localized:\n      enable_creation_date: true\n  - redirects:\n      redirect_maps:\n        'installation/index.md': 'installation/quick_start.md'\n        'installation/INSTALL_AUTOMATED.md': 'installation/quick_start.md'\n        'installation/installer.md': 'installation/quick_start.md'\n        'installation/INSTALL_MANUAL.md': 'installation/manual.md'\n        'installation/INSTALL_SOURCE.md': 'installation/manual.md'\n        'installation/INSTALL_DOCKER.md': 'installation/docker.md'\n        'installation/INSTALLING_MODELS.md': 'installation/models.md'\n        'installation/INSTALL_PATCHMATCH.md': 'installation/patchmatch.md'\n        'installation/060_INSTALL_PATCHMATCH.md': 'installation/patchmatch.md'\n  - mkdocstrings:\n      handlers:\n        python:\n          options:\n            separate_signature: true\n            show_signature_annotations: true\n            parameter_headings: false\n            signature_crossrefs: true\n            show_source: false\n            summary: true\n            show_root_heading: true\n            show_root_full_path: false\n            show_bases: false\n\nextra:\n  analytics:\n    provider: google\n    property: G-2X4JR4S4FB\n\nnav:\n  - Home: 'index.md'\n  - Installation:\n      - Quick Start: 'installation/quick_start.md'\n      - Detailed Requirements: 'installation/requirements.md'\n      - Manual Install: 'installation/manual.md'\n      - Docker: 'installation/docker.md'\n      - PatchMatch: 'installation/patchmatch.md'\n      - Models: 'installation/models.md'\n      - Legacy Scripts: 'installation/legacy_scripts.md'\n  - Workflows & Nodes:\n      - Nodes Overview: 'nodes/overview.md'\n      - Workflow Editor Basics: 'nodes/NODES.md'\n      - List of Default Nodes: 'nodes/defaultNodes.md'\n      - Community Nodes: 'nodes/communityNodes.md'\n      - ComfyUI to InvokeAI: 'nodes/comfyToInvoke.md'\n      - Facetool Node: 'nodes/detailedNodes/faceTools.md'\n      - Contributing Nodes: 'nodes/contributingNodes.md'\n      - Migrating from v3 to v4: 'nodes/NODES_MIGRATION_V3_V4.md'\n      - Invocation API: 'nodes/invocation-api.md'\n  - Configuration: 'configuration.md'\n  - Features:\n      - Low VRAM mode: 'features/low-vram.md'\n      - Database: 'features/database.md'\n      - New to InvokeAI?: 'help/gettingStartedWithAI.md'\n  - Contributing:\n      - Overview: 'contributing/index.md'\n      - Code of Conduct: 'CODE_OF_CONDUCT.md'\n      - Dev Environment: 'contributing/dev-environment.md'\n      - Development:\n          - Overview: 'contributing/contribution_guides/development.md'\n          - New Contributors: 'contributing/contribution_guides/newContributorChecklist.md'\n          - Model Manager v2: 'contributing/MODEL_MANAGER.md'\n          - Local Development: 'contributing/LOCAL_DEVELOPMENT.md'\n          - Testing: 'contributing/TESTS.md'\n      - Frontend:\n          - Overview: 'contributing/frontend/index.md'\n          - State Management: 'contributing/frontend/state-management.md'\n          - Workflows - Design and Implementation: 'contributing/frontend/workflows.md'\n      - Documentation: 'contributing/contribution_guides/documentation.md'\n      - Nodes: 'contributing/INVOCATIONS.md'\n      - Model Manager: 'contributing/MODEL_MANAGER.md'\n      - Download Queue: 'contributing/DOWNLOAD_QUEUE.md'\n      - Translation: 'contributing/contribution_guides/translation.md'\n      - Tutorials: 'contributing/contribution_guides/tutorials.md'\n  - Help:\n      - Getting Started: 'help/gettingStartedWithAI.md'\n      - Diffusion Overview: 'help/diffusion.md'\n      - Sampler Convergence: 'help/SAMPLER_CONVERGENCE.md'\n  - FAQ: 'faq.md'\n"
        },
        {
          "name": "pyproject.toml",
          "type": "blob",
          "size": 10.509765625,
          "content": "[build-system]\nrequires = [\"setuptools\", \"pip\", \"wheel\"]\nbuild-backend = \"setuptools.build_meta\"\n\n[project]\nname = \"InvokeAI\"\ndescription = \"An implementation of Stable Diffusion which provides various new features and options to aid the image generation process\"\nrequires-python = \">=3.10, <3.12\"\nreadme = { content-type = \"text/markdown\", file = \"README.md\" }\nkeywords = [\"stable-diffusion\", \"AI\"]\ndynamic = [\"version\"]\nlicense = { file = \"LICENSE\" }\nauthors = [{ name = \"The InvokeAI Project\", email = \"lincoln.stein@gmail.com\" }]\nclassifiers = [\n  'Development Status :: 4 - Beta',\n  'Environment :: GPU',\n  'Environment :: GPU :: NVIDIA CUDA',\n  'Environment :: MacOS X',\n  'Intended Audience :: End Users/Desktop',\n  'Intended Audience :: Developers',\n  'License :: OSI Approved :: MIT License',\n  'Operating System :: POSIX :: Linux',\n  'Operating System :: MacOS',\n  'Operating System :: Microsoft :: Windows',\n  'Programming Language :: Python :: 3 :: Only',\n  'Programming Language :: Python :: 3.10',\n  'Topic :: Artistic Software',\n  'Topic :: Internet :: WWW/HTTP :: WSGI :: Application',\n  'Topic :: Internet :: WWW/HTTP :: WSGI :: Server',\n  'Topic :: Multimedia :: Graphics',\n  'Topic :: Scientific/Engineering :: Artificial Intelligence',\n  'Topic :: Scientific/Engineering :: Image Processing',\n]\ndependencies = [\n  # Core generation dependencies, pinned for reproducible builds.\n  \"accelerate==1.0.1\",\n  \"bitsandbytes==0.45.0; sys_platform!='darwin'\",\n  \"clip_anytorch==2.6.0\",       # replacing \"clip @ https://github.com/openai/CLIP/archive/eaa22acb90a5876642d0507623e859909230a52d.zip\",\n  \"compel==2.0.2\",\n  \"controlnet-aux==0.0.7\",\n  \"diffusers[torch]==0.31.0\",\n  \"gguf==0.10.0\",\n  \"invisible-watermark==0.2.0\", # needed to install SDXL base and refiner using their repo_ids\n  \"mediapipe==0.10.14\",         # needed for \"mediapipeface\" controlnet model\n  \"numpy<2.0.0\",\n  \"onnx==1.16.1\",\n  \"onnxruntime==1.19.2\",\n  \"opencv-python==4.9.0.80\",\n  \"pytorch-lightning==2.1.3\",\n  \"safetensors==0.4.3\",\n  # sentencepiece is required to load T5TokenizerFast (used by FLUX).\n  \"sentencepiece==0.2.0\",\n  \"spandrel==0.3.4\",\n  \"timm==0.6.13\",               # needed to override timm latest in controlnet_aux, see  https://github.com/isl-org/ZoeDepth/issues/26\n  \"torch<2.5.0\",                # torch and related dependencies are loosely pinned, will respect requirement of `diffusers[torch]`\n  \"torchmetrics\",\n  \"torchsde\",\n  \"torchvision\",\n  \"transformers==4.46.3\",\n\n  # Core application dependencies, pinned for reproducible builds.\n  \"fastapi-events==0.11.1\",\n  \"fastapi==0.111.0\",\n  \"huggingface-hub==0.26.1\",\n  \"pydantic-settings==2.2.1\",\n  \"pydantic==2.7.2\",\n  \"python-socketio==5.11.1\",\n  \"uvicorn[standard]==0.28.0\",\n\n  # Auxiliary dependencies, pinned only if necessary.\n  \"albumentations\",\n  \"blake3\",\n  \"click\",\n  \"datasets\",\n  \"Deprecated\",\n  \"dnspython\",\n  \"dynamicprompts\",\n  \"einops\",\n  \"facexlib\",\n  # Exclude 3.9.1 which has a problem on windows, see https://github.com/matplotlib/matplotlib/issues/28551\n  \"matplotlib!=3.9.1\",\n  \"npyscreen\",\n  \"omegaconf\",\n  \"picklescan\",\n  \"pillow\",\n  \"prompt-toolkit\",\n  \"pympler\",\n  \"pypatchmatch\",\n  \"pyperclip\",\n  \"pyreadline3\",\n  \"python-multipart\",\n  \"requests\",\n  \"rich~=13.3\",\n  \"scikit-image\",\n  \"semver~=3.0.1\",\n  \"test-tube\",\n  \"windows-curses; sys_platform=='win32'\",\n]\n\n[project.optional-dependencies]\n\"xformers\" = [\n  # Core generation dependencies, pinned for reproducible builds.\n  \"xformers>=0.0.28.post1; sys_platform!='darwin'\",\n  # Auxiliary dependencies, pinned only if necessary.\n  \"triton; sys_platform=='linux'\",\n]\n\"onnx\" = [\"onnxruntime\"]\n\"onnx-cuda\" = [\"onnxruntime-gpu\"]\n\"onnx-directml\" = [\"onnxruntime-directml\"]\n\"dist\" = [\"pip-tools\", \"pipdeptree\", \"twine\"]\n\"docs\" = [\n  \"mkdocs-material>=9.5.36\",\n  \"mkdocs-git-revision-date-localized-plugin\",\n  \"mkdocs-redirects\",\n  \"mkdocstrings[python]>=0.26.1\",\n]\n\"dev\" = [\"jurigged\", \"pudb\", \"snakeviz\", \"gprof2dot\"]\n\"test\" = [\n  \"ruff>=0.3.3\",\n  \"ruff-lsp>=0.0.53\",\n  \"mypy\",\n  \"pre-commit\",\n  \"pytest>6.0.0\",\n  \"pytest-cov\",\n  \"pytest-timeout\",\n  \"pytest-datadir\",\n  \"requests_testadapter\",\n  \"httpx\",\n]\n\n[project.scripts]\n\"invokeai-web\" = \"invokeai.app.run_app:run_app\"\n\n[project.urls]\n\"Homepage\" = \"https://invoke-ai.github.io/InvokeAI/\"\n\"Documentation\" = \"https://invoke-ai.github.io/InvokeAI/\"\n\"Source\" = \"https://github.com/invoke-ai/InvokeAI/\"\n\"Bug Reports\" = \"https://github.com/invoke-ai/InvokeAI/issues\"\n\"Discord\" = \"https://discord.gg/ZmtBAhwWhy\"\n\n[tool.setuptools.dynamic]\nversion = { attr = \"invokeai.version.__version__\" }\n\n[tool.setuptools.packages.find]\n\"where\" = [\".\"]\n\"include\" = [\n  \"invokeai.assets.fonts*\",\n  \"invokeai.version*\",\n  \"invokeai.generator*\",\n  \"invokeai.backend*\",\n  \"invokeai.frontend*\",\n  \"invokeai.frontend.web.dist*\",\n  \"invokeai.frontend.web.static*\",\n  \"invokeai.configs*\",\n  \"invokeai.app*\",\n  \"invokeai.invocation_api*\",\n]\n\n[tool.setuptools.package-data]\n\"invokeai.app.assets\" = [\"**/*.png\"]\n\"invokeai.app.services.workflow_records.default_workflows\" = [\"*.json\"]\n\"invokeai.app.services.style_preset_records\" = [\"*.json\"]\n\"invokeai.app.services.style_preset_images.default_style_preset_images\" = [\n  \"*.png\",\n]\n\"invokeai.assets.fonts\" = [\"**/*.ttf\"]\n\"invokeai.backend\" = [\"**.png\", \"**/*.icc\"]\n\"invokeai.configs\" = [\"*.example\", \"**/*.yaml\", \"*.txt\"]\n\"invokeai.frontend.web.dist\" = [\"**\"]\n\"invokeai.frontend.web.static\" = [\"**\"]\n\"invokeai.app.invocations\" = [\"**\"]\n\n#=== Begin: PyTest and Coverage\n[tool.pytest.ini_options]\naddopts = \"--cov-report term --cov-report html --cov-report xml --strict-markers -m \\\"not slow\\\"\"\nmarkers = [\n  \"slow: Marks tests as slow. Disabled by default. To run all tests, use -m \\\"\\\". To run only slow tests, use -m \\\"slow\\\".\",\n  \"timeout: Marks the timeout override.\",\n]\n[tool.coverage.run]\nbranch = true\nsource = [\"invokeai\"]\nomit = [\"*tests*\", \"*migrations*\", \".venv/*\", \"*.env\"]\n[tool.coverage.report]\nshow_missing = true\nfail_under = 85     # let's set something sensible on Day 1 ...\n[tool.coverage.json]\noutput = \"coverage/coverage.json\"\npretty_print = true\n[tool.coverage.html]\ndirectory = \"coverage/html\"\n[tool.coverage.xml]\noutput = \"coverage/index.xml\"\n#=== End: PyTest and Coverage\n\n#=== Begin: Ruff\n[tool.ruff]\nline-length = 120\nexclude = [\n  \".git\",\n  \"__pycache__\",\n  \"build\",\n  \"dist\",\n  \"invokeai/frontend/web/node_modules/\",\n  \".venv*\",\n  \"*.ipynb\",\n  \"invokeai/backend/image_util/mediapipe_face/\", # External code\n  \"invokeai/backend/image_util/mlsd/\", # External code\n  \"invokeai/backend/image_util/normal_bae/\", # External code\n  \"invokeai/backend/image_util/pidi/\", # External code\n]\n\n[tool.ruff.lint]\nignore = [\n  \"E501\", # https://docs.astral.sh/ruff/rules/line-too-long/\n  \"C901\", # https://docs.astral.sh/ruff/rules/complex-structure/\n  \"B008\", # https://docs.astral.sh/ruff/rules/function-call-in-default-argument/\n  \"B904\", # https://docs.astral.sh/ruff/rules/raise-without-from-inside-except/\n]\nselect = [\"B\", \"C\", \"E\", \"F\", \"W\", \"I\", \"TID\"]\n\n[tool.ruff.lint.flake8-tidy-imports]\n# Disallow all relative imports.\nban-relative-imports = \"all\"\n\n#=== End: Ruff\n\n#=== Begin: MyPy\n\n# global mypy config\n[tool.mypy]\nignore_missing_imports = true # ignores missing types in third-party libraries\nstrict = true\nplugins = \"pydantic.mypy\"\nexclude = [\"tests/*\"]\n\n# overrides for specific modules\n[[tool.mypy.overrides]]\nfollow_imports = \"skip\" # skips type checking of the modules listed below\nmodule = [\n  \"invokeai.app.api.routers.models\",\n  \"invokeai.app.invocations.compel\",\n  \"invokeai.app.invocations.denoise_latents\",\n  \"invokeai.app.services.invocation_stats.invocation_stats_default\",\n  \"invokeai.app.services.model_manager.model_manager_base\",\n  \"invokeai.app.services.model_manager.model_manager_default\",\n  \"invokeai.app.services.model_manager.store.model_records_sql\",\n  \"invokeai.app.util.controlnet_utils\",\n  \"invokeai.backend.image_util.txt2mask\",\n  \"invokeai.backend.image_util.safety_checker\",\n  \"invokeai.backend.image_util.patchmatch\",\n  \"invokeai.backend.image_util.invisible_watermark\",\n  \"invokeai.backend.install.model_install_backend\",\n  \"invokeai.backend.ip_adapter.ip_adapter\",\n  \"invokeai.backend.ip_adapter.resampler\",\n  \"invokeai.backend.ip_adapter.unet_patcher\",\n  \"invokeai.backend.model_management.convert_ckpt_to_diffusers\",\n  \"invokeai.backend.model_management.lora\",\n  \"invokeai.backend.model_management.model_cache\",\n  \"invokeai.backend.model_management.model_manager\",\n  \"invokeai.backend.model_management.model_merge\",\n  \"invokeai.backend.model_management.model_probe\",\n  \"invokeai.backend.model_management.model_search\",\n  \"invokeai.backend.model_management.models.*\",                            # this is needed to ignore the module's `__init__.py`\n  \"invokeai.backend.model_management.models.base\",\n  \"invokeai.backend.model_management.models.controlnet\",\n  \"invokeai.backend.model_management.models.ip_adapter\",\n  \"invokeai.backend.model_management.models.lora\",\n  \"invokeai.backend.model_management.models.sdxl\",\n  \"invokeai.backend.model_management.models.stable_diffusion\",\n  \"invokeai.backend.model_management.models.vae\",\n  \"invokeai.backend.model_management.seamless\",\n  \"invokeai.backend.model_management.util\",\n  \"invokeai.backend.stable_diffusion.diffusers_pipeline\",\n  \"invokeai.backend.stable_diffusion.diffusion.shared_invokeai_diffusion\",\n  \"invokeai.backend.util.hotfixes\",\n  \"invokeai.backend.util.mps_fixes\",\n  \"invokeai.backend.util.util\",\n  \"invokeai.frontend.install.model_install\",\n]\n#=== End: MyPy\n\n[tool.pyright]\n# Start from strict mode\ntypeCheckingMode = \"strict\"\n# This errors whenever an import is missing a type stub file - way too noisy\nreportMissingTypeStubs = \"none\"\n# These are the rest of the rules enabled by strict mode - enable them @ warning\nreportConstantRedefinition = \"warning\"\nreportDeprecated = \"warning\"\nreportDuplicateImport = \"warning\"\nreportIncompleteStub = \"warning\"\nreportInconsistentConstructor = \"warning\"\nreportInvalidStubStatement = \"warning\"\nreportMatchNotExhaustive = \"warning\"\nreportMissingParameterType = \"warning\"\nreportMissingTypeArgument = \"warning\"\nreportPrivateUsage = \"warning\"\nreportTypeCommentUsage = \"warning\"\nreportUnknownArgumentType = \"warning\"\nreportUnknownLambdaType = \"warning\"\nreportUnknownMemberType = \"warning\"\nreportUnknownParameterType = \"warning\"\nreportUnknownVariableType = \"warning\"\nreportUnnecessaryCast = \"warning\"\nreportUnnecessaryComparison = \"warning\"\nreportUnnecessaryContains = \"warning\"\nreportUnnecessaryIsInstance = \"warning\"\nreportUnusedClass = \"warning\"\nreportUnusedImport = \"warning\"\nreportUnusedFunction = \"warning\"\nreportUnusedVariable = \"warning\"\nreportUntypedBaseClass = \"warning\"\nreportUntypedClassDecorator = \"warning\"\nreportUntypedFunctionDecorator = \"warning\"\nreportUntypedNamedTuple = \"warning\"\n"
        },
        {
          "name": "scripts",
          "type": "tree",
          "content": null
        },
        {
          "name": "tests",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}