{
  "metadata": {
    "timestamp": 1736564933011,
    "page": 161,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "githubnext/monaspace",
      "stars": 14763,
      "defaultBranch": "main",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.0166015625,
          "content": ".DS_STORE\n.vscode"
        },
        {
          "name": "AUTHORS.txt",
          "type": "blob",
          "size": 0.0283203125,
          "content": "GitHub Next <next@github.com>"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 3.1552734375,
          "content": "# Contributor Covenant Code of Conduct\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as\ncontributors and maintainers pledge to making participation in our project and\nour community a harassment-free experience for everyone, regardless of age, body\nsize, disability, ethnicity, gender identity and expression, level of experience,\nnationality, personal appearance, race, religion, or sexual identity and\norientation.\n\n## Our Standards\n\nExamples of behavior that contributes to creating a positive environment\ninclude:\n\n* Using welcoming and inclusive language\n* Being respectful of differing viewpoints and experiences\n* Gracefully accepting constructive criticism\n* Focusing on what is best for the community\n* Showing empathy towards other community members\n\nExamples of unacceptable behavior by participants include:\n\n* The use of sexualized language or imagery and unwelcome sexual attention or\nadvances\n* Trolling, insulting/derogatory comments, and personal or political attacks\n* Public or private harassment\n* Publishing others' private information, such as a physical or electronic\n  address, without explicit permission\n* Other conduct which could reasonably be considered inappropriate in a\n  professional setting\n\n## Our Responsibilities\n\nProject maintainers are responsible for clarifying the standards of acceptable\nbehavior and are expected to take appropriate and fair corrective action in\nresponse to any instances of unacceptable behavior.\n\nProject maintainers have the right and responsibility to remove, edit, or\nreject comments, commits, code, wiki edits, issues, and other contributions\nthat are not aligned to this Code of Conduct, or to ban temporarily or\npermanently any contributor for other behaviors that they deem inappropriate,\nthreatening, offensive, or harmful.\n\n## Scope\n\nThis Code of Conduct applies both within project spaces and in public spaces\nwhen an individual is representing the project or its community. Examples of\nrepresenting a project or community include using an official project e-mail\naddress, posting via an official social media account, or acting as an appointed\nrepresentative at an online or offline event. Representation of a project may be\nfurther defined and clarified by project maintainers.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be\nreported by contacting the project team at opensource@github.com. All\ncomplaints will be reviewed and investigated and will result in a response that\nis deemed necessary and appropriate to the circumstances. The project team is\nobligated to maintain confidentiality with regard to the reporter of an incident.\nFurther details of specific enforcement policies may be posted separately.\n\nProject maintainers who do not follow or enforce the Code of Conduct in good\nfaith may face temporary or permanent repercussions as determined by other\nmembers of the project's leadership.\n\n## Attribution\n\nThis Code of Conduct is adapted from the [Contributor Covenant][homepage], version 1.4,\navailable at [https://contributor-covenant.org/version/1/4][version]\n\n[homepage]: https://contributor-covenant.org\n[version]: https://contributor-covenant.org/version/1/4/"
        },
        {
          "name": "CONTRIBUTORS.txt",
          "type": "blob",
          "size": 0.2724609375,
          "content": "Riley Cran <riley@lettermatic.com>\nHeather Cran Arrow <heather@lettermatic.com>\nDanelle Cheney <danelle@lettermatic.com>\nIdan Gazit <idan@github.com>\nCole Bemis <colebemis@github.com>\nAmelia Wattenberger <wattenberger@github.com>\nKrzysztof Cieślak <krzysztof-cieslak@github.com>"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 4.3740234375,
          "content": "Copyright (c) 2023, GitHub https://github.com/githubnext/monaspace\nwith Reserved Font Name \"Monaspace\", including subfamilies: \"Argon\", \"Neon\", \"Xenon\", \"Radon\", and \"Krypton\"\n\nThis Font Software is licensed under the SIL Open Font License, Version 1.1.\nThis license is copied below, and is also available with a FAQ at:\nhttp://scripts.sil.org/OFL\n\n-----------------------------------------------------------\nSIL OPEN FONT LICENSE Version 1.1 - 26 February 2007\n-----------------------------------------------------------\n\nPREAMBLE\nThe goals of the Open Font License (OFL) are to stimulate worldwide\ndevelopment of collaborative font projects, to support the font creation\nefforts of academic and linguistic communities, and to provide a free and\nopen framework in which fonts may be shared and improved in partnership\nwith others.\n\nThe OFL allows the licensed fonts to be used, studied, modified and\nredistributed freely as long as they are not sold by themselves. The\nfonts, including any derivative works, can be bundled, embedded, \nredistributed and/or sold with any software provided that any reserved\nnames are not used by derivative works. The fonts and derivatives,\nhowever, cannot be released under any other type of license. The\nrequirement for fonts to remain under this license does not apply\nto any document created using the fonts or their derivatives.\n\nDEFINITIONS\n\"Font Software\" refers to the set of files released by the Copyright\nHolder(s) under this license and clearly marked as such. This may\ninclude source files, build scripts and documentation.\n\n\"Reserved Font Name\" refers to any names specified as such after the\ncopyright statement(s).\n\n\"Original Version\" refers to the collection of Font Software components as\ndistributed by the Copyright Holder(s).\n\n\"Modified Version\" refers to any derivative made by adding to, deleting,\nor substituting — in part or in whole — any of the components of the\nOriginal Version, by changing formats or by porting the Font Software to a\nnew environment.\n\n\"Author\" refers to any designer, engineer, programmer, technical\nwriter or other person who contributed to the Font Software.\n\nPERMISSION & CONDITIONS\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the Font Software, to use, study, copy, merge, embed, modify,\nredistribute, and sell modified and unmodified copies of the Font\nSoftware, subject to the following conditions:\n\n1) Neither the Font Software nor any of its individual components,\nin Original or Modified Versions, may be sold by itself.\n\n2) Original or Modified Versions of the Font Software may be bundled,\nredistributed and/or sold with any software, provided that each copy\ncontains the above copyright notice and this license. These can be\nincluded either as stand-alone text files, human-readable headers or\nin the appropriate machine-readable metadata fields within text or\nbinary files as long as those fields can be easily viewed by the user.\n\n3) No Modified Version of the Font Software may use the Reserved Font\nName(s) unless explicit written permission is granted by the corresponding\nCopyright Holder. This restriction only applies to the primary font name as\npresented to the users.\n\n4) The name(s) of the Copyright Holder(s) or the Author(s) of the Font\nSoftware shall not be used to promote, endorse or advertise any\nModified Version, except to acknowledge the contribution(s) of the\nCopyright Holder(s) and the Author(s) or with their explicit written\npermission.\n\n5) The Font Software, modified or unmodified, in part or in whole,\nmust be distributed entirely under this license, and must not be\ndistributed under any other license. The requirement for fonts to\nremain under this license does not apply to any document created\nusing the Font Software.\n\nTERMINATION\nThis license becomes null and void if any of the above conditions are\nnot met.\n\nDISCLAIMER\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE\nCOPYRIGHT HOLDER BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE."
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 12.6474609375,
          "content": "# Monaspace\n\nThe Monaspace type system is a monospaced type superfamily with some modern tricks up its sleeve. It consists of five variable axis typefaces. Each one has a distinct voice, but they are all metrics-compatible with one another, allowing you to mix and match them for a more expressive typographical palette.\n\nLetters on a grid is how we see our code. Why not make those letters better?\n\n✨ An exploration from [GitHub Next](https://githubnext.com). ✨ See the full story of Monaspace at [monaspace.githubnext.com](https://monaspace.githubnext.com).\n\n🔤 **[Download the latest release](https://github.com/githubnext/monaspace/releases/latest)** 🔤\n\n![image](https://github.com/githubnext/monaspace/assets/22723/301020e0-f138-44af-abb1-48efa610be08)\n\n\n## Overview\n\nMonaspace is five interchangable type families, each of which is packaged into three distinct formats. You can install all of them side-by-side; their family names are distinct by family and format. For example:\n\n- `Monaspace _____`: the static family.\n- `Monaspace _____ Var` or `VF`: the variable family\n- `Monaspace _____ Frozen`: the \"frozen\" TTF family. These fonts enable all of the typographical features in Monaspace by default. They are intended to be used in environments where you might not be able to configure stylistic sets or character variants, like XCode or IntelliJ IDEs. See more about how the frozen fonts work below.\n\nThe variable fonts have one file per family (Neon, Argon, etc.). Modern and convenient!\n\nThe static fonts have one file per cut, per family. The variable axes have named stops for each axis, like `light` or `bold` for weight, `italic` for italics, and `semiwide` or `wide` for width. The combinatorial explosion of all these properties means the complete installation of static fonts involves hundreds of font files. But for situations that don't yet support variable fonts, the static builds give you a wide variety of stops throughout the range of each axis.\n\n## Texture Healing\n\nMonaspace pioneered the technique of \"texture healing\" for monospaced fonts: \n\n![Texture Healing Example](<docs/images/ReadmeTextureHealing.png>)\n\nTexture healing is enabled when the `calt` font feature setting is turned on in your editor. The location for this setting varies across applications, and not all applications support it. See the [Editors](#editors) section below for specific guidance.\n\nYou can read more about how it works on the [Monaspace website](http://monaspace.githubnext.com), and learn how it is implemented in the [documentation](https://github.com/githubnext/monaspace/blob/main/docs/Texture%20Healing.md).\n\n## Nerd Fonts\n\nAs of Monaspace 1.2, the static font builds (both OTF and WOFF/WOFF2) include [Nerd Fonts](https://www.nerdfonts.com/)!\n\nMonaspace gives a lot of consideration to horizontal and vertical metrics of a font, and Nerd Fonts are thousands of icons which don't necessarily respect those considerations. Monaspace makes a best-effort attempt to optically align the size and placement of the icons so that they feel compatible with the other Monaspace glyphs.\n\nThere is such a broad variety of environments and terminals and often solving for one breaks another! Some Nerd Fonts glyphs may not render correctly in every environment.\n\n> [!NOTE]\n> Monaspace uses the [Nerd Fonts implementation from Cascadia Code](https://github.com/microsoft/cascadia-code/tree/main/sources/nerdfonts/full/processed) as our starting point. Each icon was resized to fit the max advance width of the given Monaspace font, and centered vertically between the baseline and cap height of Monaspace's vertical metrics.\n\n\n## Coding Ligatures\n\n> [!WARNING]\n> Ligature handling has changed significantly in Monaspace point releases.\n> If you're upgrading, check the release notes to learn what changes you might need to make to your editor configuration:\n> - [v1.1](https://github.com/githubnext/monaspace/releases/tag/v1.100)\n> - [v1.101](https://github.com/githubnext/monaspace/releases/tag/v1.101)\n> - [v1.2](https://github.com/githubnext/monaspace/releases/tag/v1.200)\n\n\nThe `liga` font feature enables customized spacing of repeating characters, like `///` or `||`. It is designed to avoid activating inside longer sequences like `////`.\n\nThere are ten groups of coding ligatures, separated into stylistic sets. You may be able to enable or disable individual sets selectively:\n\n* `ss01`: ligatures related to the equals glyph like `!=` and `===`.\n* `ss02`: ligatures for greater/less or equal (`<=`, `>=`).\n* `ss03`: ligatures related to arrows like `->` and `~>`.\n* `ss04`: ligatures related to markup, like `</` and `/>`. \n* `ss05`: ligatures related to the F# programming language, like `|>`.\n* `ss06`: ligatures related to repeated uses of `#`, `+`, and `&`.\n* `ss07`: ligatures related to colons like `::` or `=:=`.\n* `ss08`: ligatures related to combinations of periods with other glyphs like `..=` or `.-`.\n* `ss09`: ligatures related to combinations of the greater/less than and equals signs, like  `<=>`,`>>`, and `=<<`.\n* `ss10`: other tags, like `#[` and `#(`\n\n👉 You can see an interactive display of all the ligatures [on the Monaspace website](http://monaspace.githubnext.com/#code-ligatures)\n\n## Character Variants\n\nSpecific characters have variants that you can optionally enable using the `cvNN` opentype feature:\n\n#### cv01-cv09: figure variants\n- `cv01`: `0` alternates\n  - 1: plain\n  - 2: slash\n  - 3: reverse slash\n  - 4: cut-out slash\n- `cv02`: `1` alternate (no serif)\n\n#### cv10-cv29: letter variants\n- `cv10`: `l` `i` alternates (Neon, Argon, Xenon, Radon)\n- `cv11`: `j` `f` `r` `t` alternates (Neon, Argon)\n\n#### cv30-cv59: symbol variants\n- `cv30`: `*` vertically aligned closer to the top of the space, similar to how the asterisk was in Monaspace 1.0\n- `cv31`: `*` 6-pointed asterisk\n- `cv32`: `≥` `≤` angled lower line\n\n#### cv60-cv79: optional ligatures\n- `cv60`: forces the `<=` pair to render in a fashion that matches `=>` instead of swapping for `≤`.\n- `cv61`: enables the optional closed square ligature for `[]`. This can be distracting when authoring arrays in many editors, because they automatically insert the closing bracket, which immediately produces the closed square ligature upon typing the open bracket.\n- `cv62`: `@_` ligature\n\n\n### cv80-cv99: reserved for future use\n- none (yet!)\n\n## Special Characters Galore\n\nIn addition to the ligatures, character variants, and Nerd Fonts, Monaspace includes a wealth of special characters.\n\n![Special Characters](https://github.com/user-attachments/assets/c925585b-db09-45e2-ac75-911e89419a47)\n\n## Desktop Installation\n\n### Upgrading\n\nFont caching on operating systems is an inscrutable mess dating back thirty years, and not something we can fix in Monaspace. Generally speaking, you should:\n\n- First delete the old fonts…\n- Then install the new fonts…\n- Then restart applications that use the fonts…\n- … and maybe restart your entire computer. \n\nRestarting is usually the only way to be 100% sure that the underlying machinery in the operating system picks up the new fonts.\n\n### MacOS\nYou can manually drag the fonts from the `fonts/otf`, `fonts/variable`, and `fonts/frozen` directories into Font Book.\n\nThere is also a script that automates the deletion of all Monaspace fonts from `~/Library/Fonts` and then copies over the latest versions. Invoke it from the root of the repo like:\n\n```bash\n$ bash util/install_macos.sh\n```\n\nYou can also use [Homebrew](https://brew.sh/) as an alternative:\n\n```bash\nbrew install --cask font-monaspace\n```\n\n### Windows\nYou can manually drag the fonts from the `fonts/otf`, `fonts/variable`, and `fonts/frozen` directories into `C:\\Windows\\Fonts`. Alternatively, right-click the fonts you want and click Install.\n\n### Linux\nYou can manually drag the fonts from the `fonts/otf`, `fonts/variable`, and `fonts/frozen` directories into `~/.local/share/fonts`.\n\nThere is also a script which automates the deletion of all Monaspace fonts from `~/.local/share/fonts` and then copies over the latest versions. Invoke it from the root of the repo like:\n\n```bash\n$ bash util/install_linux.sh\n```\n\n### Webfonts\n\nAll files with a `.woff` or `.woff2` suffix are intended for use on the web. You do not install them with your operating system but add them to your web development project.\n\nAs with the desktop fonts, they are available in variable and static versions.\n\nThe webfonts do not come in a \"frozen\" format; you can easily control Opentype features on the web using the [`font-feature-settings`](https://developer.mozilla.org/en-US/docs/Web/CSS/font-feature-settings) CSS property.\n\n## Editors\n\n### Visual Studio Code\n\n> [!WARNING]\n> Ligature handling has changed significantly in Monaspace point releases.\n> If you're upgrading, check the release notes to learn what changes you might need to make to your editor configuration:\n> - [v1.1](https://github.com/githubnext/monaspace/releases/tag/v1.100)\n> - [v1.101](https://github.com/githubnext/monaspace/releases/tag/v1.101)\n> - [v1.2](https://github.com/githubnext/monaspace/releases/tag/v1.200)\n\nSet the font family:\n\n```json\n    \"editor.fontFamily\": \"'Monaspace Neon', monospace\",\n```\n\n> [!NOTE]\n> Variable fonts are not yet well-supported in VS Code, and it is not yet possible to mix multiple fonts. Stay tuned, we're talking with the VS Code team about it!\n\nYou must use the `editor.fontLigatures` setting to enable the various features (texture healing, ligatures, and character variants). The setting is a comma-separated list of font features to be enabled.\n\n> [!NOTE]\n> This setting is unavailable from the graphical settings editor; you must create it manually.\n\n- `calt`: enables texture healing\n- `liga`: enables dynamic spacing for certain repeating character patterns like `///`\n- `ss01`, `ss02`, etc: enables the specific stylistic set\n- `cv30`, `cv60`, etc: enables the specific character variants\n\nPutting it all together, a setting string which enables everything but the character variants would look like this:\n```json\n  \"editor.fontLigatures\": \"'calt', 'liga', 'ss01', 'ss02', 'ss03', 'ss04', 'ss05', 'ss06', 'ss07', 'ss08', 'ss09'\"\n```\n\nSpecific character variants are also enabled using the [`font-feature-settings`](https://developer.mozilla.org/en-US/docs/Web/CSS/font-feature-settings) syntax. To enable slashed zeroes (with `cv01`) and six-pointed asterisks (with `cv31`), you might use the following settings:\n```json\n  \"editor.fontLigatures\": \"'calt', 'liga', 'ss01', 'cv01' 2, 'cv31' 1\"\n```\n\nNote that some character variants have several possible values. For any variants that are either on or off, setting them to `1` should enable them, and omitting the variant (or setting them to `0`) will disable them.\n\n## Contribution\n\nThere's no formal contribution guide yet! If you're interested in contributing to the typefaces, you should read the [Texture Healing](https://github.com/githubnext/monaspace/blob/main/docs/Texture%20Healing.md) guide, as it explains how to produce the necessary alternate glyphs.\n\n### Renamer utility\n\nThis convenience utility renames and moves the built fonts into their respective directories. You will need [Deno](https://deno.land) installed, and invoke it thus:\n\n```bash\n$ ./util/renamer.ts --src=\"~/path/to/the/built/fonts\"\n```\n\n## License\n\nSIL OFL. See [LICENSE](https://github.com/githubnext/monaspace/blob/main/LICENSE).\n\n## Support\n\nPlease file issues in this repo. Monaspace is not a supported product; do not contact GitHub support with questions, as they do not support GitHub Next explorations.\n\n## Contributors\n\nMonaspace was made to improve all code for all developers. [GitHub Next](https://githubnext.com) set out on this journey in 2022, and we were fortunate to find a type foundry that shares our passion for improving software in [Lettermatic](https://lettermatic.com/). The result is a marriage of form and function that opens the door to new developer experiences, and that would not have been possible without the domain expertise and skill of the Lettermatic team and the time they invested in working with GitHub Next on figuring out how typography ought to work for code.\n\n\n#### Lettermatic\n\n![lettermatic logo](https://github.com/githubnext/monaspace/assets/22723/36280a3a-ed6f-45a9-8e74-44c9d005794d)\n\n- [Riley Cran](https://github.com/rileycran)\n- Danelle Cheney\n- Heather Cran\n\n#### GitHub Next\n\n![GitHub Next Logo](https://github.com/githubnext/monaspace/assets/22723/744f8ba3-6dd7-4c67-b7e3-8e7d408d9dd9)\n\n- [Cole Bemis](https://github.com/colebemis)\n- [Amelia Wattenberger](https://github.com/wattenberger)\n- [Krzysztof Cieślak](https://github.com/krzysztof-cieslak)\n- [Idan Gazit](https://github.com/idan)\n\n#### Special Thanks To\n- Anna Thomas\n- Marg Chronister\n- Jane Solomon\n\n\n## Star History\n\n[![Star History Chart](https://api.star-history.com/svg?repos=githubnext/monaspace&type=Date)](https://star-history.com/#githubnext/monaspace&Date)\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.6923828125,
          "content": "Thanks for helping make GitHub safe for everyone.\n\n## Security\n\nGitHub takes the security of our software products and services seriously, including all of the open source code repositories managed through our GitHub organizations, such as [GitHub](https://github.com/GitHub).\n\nEven though [open source repositories are outside of the scope of our bug bounty program](https://bounty.github.com/index.html#scope) and therefore not eligible for bounty rewards, we will ensure that your finding gets passed along to the appropriate maintainers for remediation. \n\n## Reporting Security Issues\n\nIf you believe you have found a security vulnerability in any GitHub-owned repository, please report it to us through coordinated disclosure.\n\n**Please do not report security vulnerabilities through public GitHub issues, discussions, or pull requests.**\n\nInstead, please send an email to opensource-security[@]github.com.\n\nPlease include as much of the information listed below as you can to help us better understand and resolve the issue:\n\n  * The type of issue (e.g., buffer overflow, SQL injection, or cross-site scripting)\n  * Full paths of source file(s) related to the manifestation of the issue\n  * The location of the affected source code (tag/branch/commit or direct URL)\n  * Any special configuration required to reproduce the issue\n  * Step-by-step instructions to reproduce the issue\n  * Proof-of-concept or exploit code (if possible)\n  * Impact of the issue, including how an attacker might exploit the issue\n\nThis information will help us triage your report more quickly.\n\n## Policy\n\nSee [GitHub's Safe Harbor Policy](https://docs.github.com/en/github/site-policy/github-bug-bounty-program-legal-safe-harbor#1-safe-harbor-terms)"
        },
        {
          "name": "SUPPORT.md",
          "type": "blob",
          "size": 0.345703125,
          "content": "# Support \n\n## How to file issues and get help\n\nThis project uses GitHub issues to track bugs and feature requests. Please search the existing issues before filing new issues to avoid duplicates. For new issues, file your bug or feature request as a new issue.\n\n## GitHub Support Policy\n\nSupport for this project is limited to the resources listed above."
        },
        {
          "name": "docs",
          "type": "tree",
          "content": null
        },
        {
          "name": "fonts",
          "type": "tree",
          "content": null
        },
        {
          "name": "sources",
          "type": "tree",
          "content": null
        },
        {
          "name": "util",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}