{
  "metadata": {
    "timestamp": 1736564878643,
    "page": 101,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjExMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "Lissy93/personal-security-checklist",
      "stars": 17682,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": "CHECKLIST.md",
          "type": "blob",
          "size": 88.3701171875,
          "content": "\n[![Awesome](https://awesome.re/badge-flat2.svg)](https://github.com/zbetcheckin/Security_list)\n[![PRs Welcome](https://img.shields.io/badge/PRs-welcome-brightgreen.svg?style=flat-square)](http://makeapullrequest.com)\n[![License](https://img.shields.io/badge/LICENSE-CC_BY_4.0-00a2ff?&style=flat-square)](https://creativecommons.org/licenses/by/4.0/)\n[![Contributors](https://img.shields.io/github/contributors/lissy93/personal-security-checklist?color=%23ffa900&style=flat-square)](https://github.com/Lissy93/personal-security-checklist/graphs/contributors)\n\n<p align=\"center\"><img src=\"https://i.ibb.co/rGQK71g/personal-security-checklist-6.png\" /></p>\n\n*<p align=\"center\">A curated checklist of tips to protect your digital security and privacy</p>*\n\n### Contents\n\n[<img src=\"https://i.ibb.co/XbyGTrP/1-authentication-2-36x36.png\" width=\"28\" height=\"28\" /> Authentication](#authentication)<br>\n[<img src=\"https://i.ibb.co/8KMrdbX/2-internet-36x36.png\" width=\"28\" height=\"28\" /> Browsing the Web](#web-browsing)<br>\n[<img src=\"https://i.ibb.co/7NrXW3L/5-email-36x36.png\" width=\"28\" height=\"28\" /> Email](#emails)<br>\n[<img src=\"https://i.ibb.co/DrWJBT9/13-messaging-36x36.png\" width=\"28\" height=\"28\" /> Secure Messaging](#secure-messaging)<br>\n[<img src=\"https://i.ibb.co/GFYyXMd/6-social-media-36x36.png\" width=\"28\" height=\"28\" /> Social Media](#social-media)<br>\n[<img src=\"https://i.ibb.co/0VTZQpH/3-networking-36x36.png\" width=\"28\" height=\"28\" /> Networks](#networking)<br>\n[<img src=\"https://i.ibb.co/F3WwqsV/7-phones-36x36.png\" width=\"28\" height=\"28\" /> Mobile Phones](#mobile-devices)<br>\n[<img src=\"https://i.ibb.co/ZftcgJq/8-computers-36x36.png\" width=\"28\" height=\"28\" /> Personal Computers](#personal-computers)<br>\n[<img src=\"https://i.ibb.co/b2S9372/9-smart-home-36x36.png\" width=\"28\" height=\"28\" /> Smart Home](#smart-home)<br>\n[<img src=\"https://i.ibb.co/4JTqL5y/12-finance-36x36.png\" width=\"28\" height=\"28\" /> Personal Finance](#personal-finance)<br>\n[<img src=\"https://i.ibb.co/KVPV1Lk/10-human-36x36.png\" width=\"28\" height=\"28\" /> Human Aspect](#sensible-computing)<br>\n[<img src=\"https://i.ibb.co/9NbhBww/11-physical-36x36.png\" width=\"28\" height=\"28\" /> Physical Security](#physical-security)<br>\n\nToo long? 🦒 See the [TLDR version](https://github.com/Lissy93/personal-security-checklist/blob/HEAD/articles/2_TLDR_Short_List.md) instead.\n\nFor a list of privacy-respecting software, check out [Awesome-Privacy](https://github.com/lissy93/awesome-privacy).\n\nA mirror of this repo is available at [codeberg.org/alicia/personal-security-checklist](https://codeberg.org/alicia/personal-security-checklist).\n\n---\n\n<!-- checklist-start -->\n## Authentication\n\nMost reported data breaches are caused by the use of weak, default or stolen passwords (according to [this Verizon report](http://www.verizonenterprise.com/resources/reports/rp_dbir-2016-executive-summary_xg_en.pdf)). Use long, strong and unique passwords, manage them in a secure password manager, enable 2-factor authentication, keep on top of breaches and take care while logging into your accounts.\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Use a Strong Password** | Essential | If your password is too short, or contains dictionary words, places or names- then it can be easily cracked through brute force, or guessed by someone. The easiest way to make a strong password, is by making it long (12+ characters)- consider using a 'passphrase', made up of many words. Alternatively, use a password generator to create a long, strong random password. Have a play with [Security.org's How Secure Is My Password?](https://www.security.org/how-secure-is-my-password/), to get an idea of how quickly common passwords can be cracked. Read more about creating strong passwords: [securityinabox.org](https://securityinabox.org/en/passwords/passwords-and-2fa/)\n**Don't reuse Passwords** | Essential | If someone was to reuse a password, and one site they had an account with suffered a leak, then a criminal could easily gain unauthorized access to their other accounts. This is usually done through large-scale automated login requests, and it is called Credential Stuffing. Unfortunately this is all too common, but it's simple to protect against- use a different password for each of your online accounts\n**Use a Secure Password Manager** | Essential | For most people it is going to be near-impossible to remember hundreds of strong and unique passwords. A password manager is an application that generates, stores and auto-fills your login credentials for you. All your passwords will be encrypted against 1 master passwords (which you must remember, and it should be very strong). Most password managers have browser extensions and mobile apps, so whatever device you are on, your passwords can be auto-filled. A good all-rounder is [Bitwarden](https://awesome-privacy.xyz/essentials/password-managers/bitwarden), or see [Recommended Password Managers](https://awesome-privacy.xyz/essentials/password-managers)\n**Avoid sharing passwords** | Essential | While there may be times that you need to share access to an account with another person, you should generally avoid doing this because it makes it easier for the account to become compromised. If you absolutely do need to share a password for example when working on a team with a shared account this should be done via features built into a password manager.\n**Enable 2-Factor Authentication** | Essential | 2FA is where you must provide both something you know (a password) and something you have (such as a code on your phone) to log in. This means that if anyone has got your password (e.g. through phishing, malware or a data breach), they will not be able to log into your account. It's easy to get started, download [an authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) onto your phone, and then go to your account security settings and follow the steps to enable 2FA. Next time you log in on a new device, you will be prompted for the code that displays in the app on your phone (it works without internet, and the code usually changes every 30-seconds)\n**Keep Backup Codes Safe** | Essential | When you enable multi-factor authentication, you will usually be given several codes that you can use if your 2FA method is lost, broken or unavailable. Keep these codes somewhere safe to prevent loss or unauthorized access. You should store these on paper or in a safe place on disk (e.g. in offline storage or in an encrypted file/drive). Don't store these in your Password Manager as 2FA sources and passwords and should be kept separately.\n**Sign up for Breach Alerts** | Optional | After a website suffers a significant data breach, the leaked data often ends up on the internet. There are several websites that collect these leaked records, and allow you to search your email address to check if you are in any of their lists. [Firefox Monitor](https://monitor.firefox.com), [Have I been pwned](https://haveibeenpwned.com) and [DeHashed](https://dehashed.com) allow you to sign up for monitoring, where they will notify you if your email address appears in any new data sets. It is useful to know as soon as possible when this happens, so that you can change your passwords for the affected accounts. [Have i been pwned](https://awesome-privacy.xyz/security-tools/online-tools/have-i-been-pwned) also has domain-wide notification, where you can receive alerts if any email addresses under your entire domain appear (useful if you use aliases for [anonymous forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding))\n**Shield your Password/ PIN** | Optional | When typing your password in public places, ensure you are not in direct line of site of a CCTV camera and that no one is able to see over your shoulder. Cover your password or pin code while you type, and do not reveal any plain text passwords on screen\n**Update Critical Passwords Periodically** | Optional | Database leaks and breaches are common, and it is likely that several of your passwords are already somewhere online. Occasionally updating passwords of security-critical accounts can help mitigate this. But providing that all your passwords are long, strong and unique, there is no need to do this too often- annually should be sufficient. Enforcing mandatory password changes within organisations is [no longer recommended](https://duo.com/decipher/microsoft-will-no-longer-recommend-forcing-periodic-password-changes), as it encourages colleagues to select weaker passwords\n**Don’t save your password in browsers** | Optional | Most modern browsers offer to save your credentials when you log into a site. Don’t allow this, as they are not always encrypted, hence could allow someone to gain access into your accounts. Instead use a dedicated password manager to store (and auto-fill) your passwords\n**Avoid logging in on someone else’s device** | Optional | Avoid logging on other people's computer, since you can't be sure their system is clean. Be especially cautious of public machines, as malware and tracking is more common here. Using someone else's device is especially dangerous with critical accounts like online banking. When using someone else's machine, ensure that you're in a private/ incognito session (Use Ctrl+Shift+N/ Cmd+Shift+N). This will request browser to not save your credentials, cookies and browsing history.\n**Avoid password hints** | Optional | Some sites allow you to set password hints. Often it is very easy to guess answers. In cases where password hints are mandatory use random answers and record them in password manager (`Name of the first school: 6D-02-8B-!a-E8-8F-81`)\n**Never answer online security questions truthfully** | Optional | If a site asks security questions (such as place of birth, mother's maiden name or first car etc), don't provide real answers. It is a trivial task for hackers to find out this information online or through social engineering. Instead, create a fictitious answer, and store it inside your password manager. Using real-words is better than random characters, [explained here](https://news.ycombinator.com/item?id=29244870)\n**Don’t use a 4-digit PIN** | Optional | Don’t use a short PIN to access your smartphone or computer. Instead, use a text password or much longer pin. Numeric passphrases are easy crack, (A 4-digit pin has 10,000 combinations, compared to 7.4 million for a 4-character alpha-numeric code)\n**Avoid using SMS for 2FA** | Optional | When enabling multi-factor authentication, opt for app-based codes or a hardware token, if supported. SMS is susceptible to a number of common threats, such as [SIM-swapping](https://www.maketecheasier.com/sim-card-hijacking) and [interception](https://secure-voice.com/ss7_attacks). There's also no guarantee of how securely your phone number will be stored, or what else it will be used for. From a practical point of view, SMS will only work when you have signal, and can be slow. If a website or service requires the usage of a SMS number for recovery consider purchasing a second pre-paid phone number only used for account recovery for these instances.\n**Avoid using your PM to Generate OTPs** | Advanced | Many password managers are also able to generate 2FA codes. It is best not to use your primary password manager as your 2FA authenticator as well, since it would become a single point of failure if compromised. Instead use a dedicated [authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) on your phone or laptop\n**Avoid Face Unlock** | Advanced | Most phones and laptops offer a facial recognition authentication feature, using the camera to compare a snapshot of your face with a stored hash. It may be very convenient, but there are numerous ways to [fool it](https://www.forbes.com/sites/jvchamary/2017/09/18/security-apple-face-id-iphone-x/) and gain access to the device, through digital photos and reconstructions from CCTV footage. Unlike your password- there are likely photos of your face on the internet, and videos recorded by surveillance cameras\n**Watch out for Keyloggers** | Advanced | A hardware [keylogger](https://en.wikipedia.org/wiki/Hardware_keylogger) is a physical device planted between your keyboard and the USB port, which intercepts all key strokes, and sometimes relays data to a remote server. It gives a hacker access to everything typed, including passwords. The best way to stay protected, is just by checking your USB connection after your PC has been unattended. It is also possible for keyloggers to be planted inside the keyboard housing, so look for any signs that the case has been tampered with, and consider bringing your own keyboard to work. Data typed on a virtual keyboard, pasted from the clipboard or auto-filled by a password manager can not be intercepted by a hardware keylogger.\n**Consider a Hardware Token** | Advanced | A U2F/ FIDO2 security key is a USB (or NFC) device that you insert while logging in to an online service, in to verify your identity, instead of entering a OTP from your authenticator. [SoloKey](https://solokeys.com) and [NitroKey](https://www.nitrokey.com) are examples of such keys. They bring with them several security benefits, since the browser communicates directly with the device and cannot be fooled as to which host is requesting authentication, because the TLS certificate is checked. [This post](https://security.stackexchange.com/a/71704) is a good explanation of the security of using FIDO U2F tokens. Of course it is important to store the physical key somewhere safe, or keep it on your person. Some online accounts allow for several methods of 2FA to be enabled\n**Consider Offline Password Manager** | Advanced | For increased security, an encrypted offline password manager will give you full control over your data. [KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass) is a popular choice, with lots of [plugins](https://[KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass).info/plugins.html) and community forks with additional compatibility and functionality. Popular clients include: [KeePassXC](https://keepassxc.org) (desktop), [KeePassDX](https://www.keepassdx.com) (Android) and [StrongBox](https://apps.apple.com/us/app/strongbox-password-safe/id897283731) (iOS). The drawback being that it may be slightly less convenient for some, and it will be up to you to back it up, and store it securely\n**Consider Unique Usernames** | Advanced | Having different passwords for each account is a good first step, but if you also use a unique username, email or phone number to log in, then it will be significantly harder for anyone trying to gain unauthorised access. The easiest method for multiple emails, is using auto-generated aliases for anonymous mail forwarding. This is where [anything]@yourdomain.com will arrive in your inbox, allowing you to use a different email for each account (see [Mail Alias Providers](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding)). Usernames are easier, since you can use your password manager to generate, store and auto-fill these. Virtual phone numbers can be generated through your VOIP provider\n\n### Recommended Software\n- [Password Managers](https://github.com/Lissy93/awesome-privacy#password-managers)\n- [2-Factor Authentication](https://github.com/Lissy93/awesome-privacy#2-factor-authentication)\n\n\n## Web Browsing\n\nMost websites on the internet will use some form of tracking, often to gain insight into their users behaviour and preferences. This data can be incredibly detailed, and so is extremely valuable to corporations, governments and intellectual property thieves. Data breaches and leaks are common, and deanonymizing users web activity is often a trivial task.\n\nThere are two primary methods of tracking; stateful (cookie-based), and stateless (fingerprint-based). Cookies are small pieces of information, stored in your browser with a unique ID that is used to identify you. Browser fingerprinting is a highly accurate way to identify and track users wherever they go online. The information collected is quite comprehensive, and often includes browser details, OS, screen resolution, supported fonts, plugins, time zone, language and font preferences, and even hardware configurations.\n\nThis section outlines the steps you can take, to be better protected from threats, minimise online tracking and improve privacy.\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Block Ads** | Essential | Using an ad-blocker can help improve your privacy, by blocking the trackers that ads implement. [uBlock Origin](https://awesome-privacy.xyz/networking/ad-blockers/ublock-origin) is a very efficient and open source browser addon, developed by Raymond Hill. When 3rd-party ads are displayed on a webpage, they have the ability to track you, gathering personal information about you and your habits, which can then be sold, or used to show you more targeted ads, and some ads are plain malicious or fake. Blocking ads also makes pages load faster, uses less data and provides a less cluttered experience.\n**Ensure Website is Legitimate** | Basic | It may sound obvious, but when you logging into any online accounts, double check the URL is correct. Storing commonly visited sites in your bookmarks is a good way to ensure the URL is easy to find. When visiting new websites, look for common signs that it could be unsafe: Browser warnings, redirects, on-site spam and pop-ups. You can also check a website using a tool, such as: [Virus Total](https://awesome-privacy.xyz/security-tools/online-tools/virus-total), [IsLegitSite](https://www.islegitsite.com), [Google Safe Browsing Status](https://transparencyreport.google.com/safe-browsing/search) if you are unsure.\n**Watch out for Browser Malware** | Basic | Your system or browser can be compromised by spyware, miners, browser hijackers, malicious redirects, adware etc. You can usually stay protected, just by: ignoring pop-ups, be wary of what your clicking, don't proceed to a website if your browser warns you it may be malicious. Common signs of browser malware include: default search engine or homepage has been modified, toolbars, unfamiliar extensions or icons, significantly more ads, errors and pages loading much slower than usual. These articles from Heimdal explain [signs of browser malware](https://heimdalsecurity.com/blog/warning-signs-operating-system-infected-malware), [how browsers get infected](https://heimdalsecurity.com/blog/practical-online-protection-where-malware-hides) and [how to remove browser malware](https://heimdalsecurity.com/blog/malware-removal).\n**Use a Privacy-Respecting Browser** | Essential | [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox) (with a few tweaks) and [Brave](https://awesome-privacy.xyz/essentials/browsers/brave-browser) are secure, private-respecting browsers. Both are fast, open source, user-friendly and available on all major operating systems. Your browser has access to everything that you do online, so if possible, avoid Google Chrome, Edge and Safari as (without correct configuration) all three of them, collect usage data, call home and allow for invasive tracking. Firefox requires a few changes to achieve optimal security, for example - [arkenfox](https://github.com/arkenfox/user.js/wiki) or [12byte](https://12bytes.org/firefox-configuration-guide-for-privacy-freaks-and-performance-buffs/)'s user.js configs. See more: [Privacy Browsers](https://github.com/Lissy93/awesome-privacy#browsers).\n**Use a Private Search Engine** | Essential | Using a privacy-preserving, non-tracking search engine, will reduce risk that your search terms are not logged, or used against you. Consider [DuckDuckGo](https://awesome-privacy.xyz/essentials/search-engines/duckduckgo), or [Qwant](https://awesome-privacy.xyz/essentials/search-engines/qwant). Google implements some [incredibly invasive](https://hackernoon.com/data-privacy-concerns-with-google-b946f2b7afea) tracking policies, and have a history of displaying [biased search results](https://www.businessinsider.com/evidence-that-google-search-results-are-biased-2014-10). Therefore Google, along with Bing, Baidu, Yahoo and Yandex are incompatible with anyone looking to protect their privacy. It is recommended to update your [browsers default search](https://duckduckgo.com/install) to a privacy-respecting search engine.\n**Remove Unnecessary Browser Addons** | Essential | Extensions are able to see, log or modify anything you do in the browser, and some innocent looking browser apps, have malicious intentions. Websites can see which extensions you have installed, and may use this to enhance your fingerprint, to more accurately identify/ track you. Both [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox) and Chrome web stores allow you to check what permissions/access rights an extension requires before you install it. Check the reviews. Only install extensions you really need, and removed those which you haven't used in a while.\n**Keep Browser Up-to-date** | Essential | Browser vulnerabilities are constantly being [discovered](https://cve.mitre.org/cgi-bin/cvekey.cgi?keyword=browser) and patched, so it’s important to keep it up to date, to avoid a zero-day exploit. You can [see which browser version you're using here](https://www.whatismybrowser.com/), or follow [this guide](https://www.whatismybrowser.com/guides/how-to-update-your-browser/) for instructions on how to update. Some browsers will auto-update to the latest stable version.\n**Check for HTTPS** | Essential | If you enter information on a non-HTTPS website, this data is transported unencrypted and can therefore be read by anyone who intercepts it. Do not enter any data on a non-HTTPS website, but also do not let the green padlock give you a false sense of security, just because a website has SSL certificate, does not mean that it is legitimate or trustworthy. [HTTPS-Everywhere](https://www.eff.org/https-everywhere) (developed by the [EFF](https://www.eff.org/)) used to be a browser extension/addon that automatically enabled HTTPS on websites, but as of 2022 is now deprecated. In their [accouncement article](https://www.eff.org/) the EFF explains that most browsers now integrate such protections. Additionally, it provides instructions for [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox), Chrome, Edge and Safari browsers on how to enable their HTTPS secure protections.\n**Use DNS-over-HTTPS** | Essential | Traditional DNS makes requests in plain text for everyone to see. It allows for eavesdropping and manipulation of DNS data through man-in-the-middle attacks. Whereas DNS-over-HTTPS performs DNS resolution via the HTTPS protocol, meaning data between you and your DNS resolver is encrypted. A popular option is [CloudFlare](https://awesome-privacy.xyz/networking/dns-providers/cloudflare)'s [1.1.1.1](https://awesome-privacy.xyz/security-tools/mobile-apps/1.1.1.1), or compare providers- it is simple to enable in-browser. Note that DoH comes with its own issues, mostly preventing web filtering.\n**Multi-[Session](https://awesome-privacy.xyz/communication/encrypted-messaging/session) Containers** | Essential | Compartmentalisation is really important to keep different aspects of your browsing separate. For example, using different profiles for work, general browsing, social media, online shopping etc will reduce the number associations that data brokers can link back to you. One option is to make use of [Firefox Containers](https://awesome-privacy.xyz/security-tools/browser-extensions/firefox-multi-account-containers) which is designed exactly for this purpose. Alternatively, you could use different browsers for different tasks ([Brave](https://awesome-privacy.xyz/essentials/browsers/brave-browser), [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox), [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor) etc).\n**Use Incognito** | Essential | When using someone else's machine, ensure that you're in a private/ incognito session. This will prevent browser history, cookies and some data being saved, but is not fool-proof- you can still be tracked.\n**Understand Your Browser Fingerprint** | Essential | Browser Fingerprinting is an incredibly accurate method of tracking, where a website identifies you based on your device information. You can view your fingerprint at amiunique.org- The aim is to be as un-unique as possible.\n**Manage Cookies** | Essential | Clearing cookies regularly is one step you can take to help reduce websites from tracking you. Cookies may also store your session token, which if captured, would allow someone to access your accounts without credentials. To mitigate this you should clear cookies often.\n**Block Third-Party Cookies** | Essential | Third-party cookies placed on your device by a website other than the one you’re visiting. This poses a privacy risk, as a 3rd entity can collect data from your current session. This guide explains how you can disable 3rd-party cookies, and you can check here ensure this worked.\n**Block Third-Party Trackers** | Essential | Blocking trackers will help to stop websites, advertisers, analytics and more from tracking you in the background. [Privacy Badger](https://awesome-privacy.xyz/security-tools/browser-extensions/privacy-badger), [DuckDuckGo Privacy Essentials](https://awesome-privacy.xyz/security-tools/browser-extensions/privacy-essentials), [uBlock Origin](https://awesome-privacy.xyz/networking/ad-blockers/ublock-origin) and uMatrix (advanced) are all very effective, open source tracker-blockers available for all major browsers.\n**Beware of Redirects** | Optional | While some redirects are harmless, others, such as Unvalidated redirects are used in phishing attacks, it can make a malicious link seem legitimate. If you are unsure about a redirect URL, you can check where it forwards to with a tool like RedirectDetective.\n**Do Not Sign Into Your Browser** | Optional | Many browsers allow you to sign in, in order to sync history, bookmarks and other browsing data across devices. However this not only allows for further data collection, but also increases attack surface through providing another avenue for a malicious actor to get hold of personal information.\n**Disallow Prediction Services** | Optional | Some browsers allow for prediction services, where you receive real-time search results or URL auto-fill. If this is enabled then data is sent to Google (or your default search engine) with every keypress, rather than when you hit enter.\n**Avoid G Translate for Webpages** | Optional | When you visit a web page written in a foreign language, you may be prompted to install the Google Translate extension. Be aware that Google collects all data (including input fields), along with details of the current user. Instead use a translation service that is not linked to your browser.\n**Disable Web Notifications** | Optional | Browser push notifications are a common method for criminals to encourage you to click their link, since it is easy to spoof the source. Be aware of this, and for instructions on disabling browser notifications, see this article.\n**Disable Automatic Downloads** | Optional | Drive-by downloads is a common method of getting harmful files onto a users device. This can be mitigated by disabling auto file downloads, and be cautious of websites which prompt you to download files unexpectedly.\n**Disallow Access to Sensors** | Optional | Mobile websites can tap into your device sensors without asking. If you grant these permissions to your browser once, then all websites are able to use these capabilities, without permission or notification.\n**Disallow Location** | Optional | Location Services lets sites ask for your physical location to improve your experience. This should be disabled in settings. Note that there are still other methods of determining your approximate location.\n**Disallow Camera/ Microphone access** | Optional | Check browser settings to ensure that no websites are granted access to webcam or microphone. It may also be beneficial to use physical protection such as a webcam cover and microphone blocker.\n**Disable Browser Password Saves** | Optional | Do not allow your browser to store usernames and passwords. These can be easily viewed or accessed. Instead use a password manager.\n**Disable Browser Autofill** | Optional | Turn off autofill for any confidential or personal details. This feature can be harmful if your browser is compromised in any way. Instead, consider using your password manager's Notes feature.\n**Protect from Exfil Attack** | Optional | The CSS Exfiltrate attack is a method where credentials and other sensitive details can be snagged with just pure CSS. You can stay protected, with the [CSS Exfil Protection](https://awesome-privacy.xyz/security-tools/browser-extensions/css-exfil-protection) plugin.\n**Deactivate ActiveX** | Optional | ActiveX is a browser extension API that built into Microsoft IE, and enabled by default. It's not commonly used anymore, but since it gives plugins intimate access rights, and can be dangerous, therefore you should disable it.\n**Disable WebRTC** | Optional | WebRTC allows high-quality audio/video communication and peer-to-peer file-sharing straight from the browser. However it can pose as a privacy leak. To learn more, check out this guide.\n**Spoof HTML5 Canvas Sig** | Optional | Canvas Fingerprinting allows websites to identify and track users very accurately. You can use the Canvas-Fingerprint-Blocker extension to spoof your fingerprint or use [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor).\n**Spoof User Agent** | Optional | The user agent tells the website what device, browser and version you are using. Switching user agent periodically is one small step you can take to become less unique.\n**Disregard DNT** | Optional | Enabling Do Not Track has very limited impact, since many websites do not respect or follow this. Since it is rarely used, it may also add to your signature, making you more unique.\n**Prevent HSTS Tracking** | Optional | HSTS was designed to help secure websites, but privacy concerns have been raised as it allowed site operators to plant super-cookies. It can be disabled by visiting chrome://net-internals/#hsts in Chromium-based browsers.\n**Prevent Automatic Browser Connections** | Optional | Even when you are not using your browser, it may call home to report on usage activity, analytics and diagnostics. You may wish to disable some of this, which can be done through the settings.\n**Enable 1st-Party Isolation** | Optional | [First Party Isolation](https://awesome-privacy.xyz/security-tools/browser-extensions/first-party-isolation) means that all identifier sources and browser state are scoped using the URL bar domain, this can greatly reduce tracking.\n**Strip Tracking Params from URLs** | Advanced | Websites often append additional GET parameters to URLs that you click, to identify information like source/referrer. You can sanitize manually, or use an extension like [ClearURLs](https://awesome-privacy.xyz/security-tools/browser-extensions/clearurls) to strip tracking data from URLs automatically.\n**First Launch Security** | Advanced | After installing a web browser, the first time you launch it (prior to configuring its privacy settings), most browsers will call home. Therefore, after installing a browser, you should first disable your internet connection, then configure privacy options before reenabling your internet connectivity.\n**Use The Tor Browser** | Advanced | The [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor) Project provides a browser that encrypts and routes your traffic through multiple nodes, keeping users safe from interception and tracking. The main drawbacks are speed and user experience.\n**Disable JavaScript** | Advanced | Many modern web apps are JavaScript-based, so disabling it will greatly decrease your browsing experience. But if you really want to go all out, then it will really reduce your attack surface.\n\n### Recommended Software\n- [Privacy Browsers](https://github.com/Lissy93/awesome-privacy#browsers)\n- [Browser Extensions](https://github.com/Lissy93/awesome-privacy#browser-extensions)\n- [Browser & Bookmark Sync](https://github.com/Lissy93/awesome-privacy#browser-sync)\n\n\n## Email\n\nNearly 50 years since the first email was sent, it's still very much a big part of our day-to-day life, and will continue to be for the near future. So considering how much trust we put in them, it's surprising how fundamentally insecure this infrastructure is. Email-related fraud [is on the up](https://www.csoonline.com/article/3247670/email/email-security-in-2018.html), and without taking basic measures you could be at risk.\n\nIf a hacker gets access to your emails, it provides a gateway for your other accounts to be compromised (through password resets), therefore email security is paramount for your digital safety.\n\nThe big companies providing \"free\" email service, don't have a good reputation for respecting users privacy: Gmail was caught giving [third parties full access](https://www.wsj.com/articles/techs-dirty-secret-the-app-developers-sifting-through-your-gmail-1530544442) to user emails and also [tracking all of your purchases](https://www.cnbc.com/2019/05/17/google-gmail-tracks-purchase-history-how-to-delete-it.html). Yahoo was also caught scanning emails in real-time [for US surveillance agencies](http://news.trust.org/item/20161004170601-99f8c) Advertisers [were granted access](https://thenextweb.com/insider/2018/08/29/both-yahoo-and-aol-are-scanning-customer-emails-to-attract-advertisers) to Yahoo and AOL users messages to “identify and segment potential customers by picking up on contextual buying signals, and past purchases.”\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Have more than one email address** | Essential | Consider using a different email address for security-critical communications from trivial mail such as newsletters. This compartmentalization could reduce the amount of damage caused by a data breach, and also make it easier to recover a compromised account.\n**Keep Email Address Private** | Essential | Do not share your primary email publicly, as mail addresses are often the starting point for most phishing attacks.\n**Keep your Account Secure** | Essential | Use a long and unique password, enable 2FA and be careful while logging in. Your email account provides an easy entry point to all your other online accounts for an attacker.\n**Disable Automatic Loading of Remote Content** | Essential | Email messages can contain remote content such as images or stylesheets, often automatically loaded from the server. You should disable this, as it exposes your IP address and device information, and is often used for tracking. For more info, see [this article](https://www.theverge.com/2019/7/3/20680903/email-pixel-trackers-how-to-stop-images-automatic-download).\n**Use Plaintext** | Optional | There are two main types of emails on the internet: plaintext and HTML. The former is strongly preferred for privacy & security as HTML messages often include identifiers in links and inline images, which can collect usage and personal data. There's also numerous risks of remote code execution targeting the HTML parser of your mail client, which cannot be exploited if you are using plaintext. For more info, as well as setup instructions for your mail provider, see [UsePlaintext.email](https://useplaintext.email/).\n**Don’t connect third-party apps to your email account** | Optional | If you give a third-party app or plug-in full access to your inbox, they effectively have full unhindered access to all your emails and their contents, which poses significant security and privacy risks.\n**Don't Share Sensitive Data via Email** | Optional | Emails are very easily intercepted. Furthermore, you can’t be sure of how secure your recipient's environment is. Therefore, emails cannot be considered safe for exchanging confidential information, unless it is encrypted.\n**Consider Switching to a Secure Mail Provider** | Optional | Secure and reputable email providers such as [Forward Email](https://awesome-privacy.xyz/communication/encrypted-email/forward-email), [ProtonMail](https://awesome-privacy.xyz/communication/mail-forwarding/protonmail), and [Tutanota](https://awesome-privacy.xyz/communication/encrypted-email/tuta) allow for end-to-end encryption, full privacy as well as more security-focused features. Unlike typical email providers, your mailbox cannot be read by anyone but you, since all messages are encrypted.\n**Use Smart Key** | Advanced | OpenPGP does not support Forward secrecy, which means if either your or the recipient's private key is ever stolen, all previous messages encrypted with it will be exposed. Therefore, you should take great care to keep your private keys safe. One method of doing so, is to use a USB Smart Key to sign or decrypt messages, allowing you to do so without your private key leaving the USB device.\n**Use Aliasing / Anonymous Forwarding** | Advanced | Email aliasing allows messages to be sent to [anything]@my-domain.com and still land in your primary inbox. Effectively allowing you to use a different, unique email address for each service you sign up for. This means if you start receiving spam, you can block that alias and determine which company leaked your email address.\n**Subaddressing** | Optional | An alternative to aliasing is subaddressing, where anything after the `+` symbol is omitted during mail delivery. This enables you to keep track of who shared/ leaked your email address, but unlike aliasing, it will not protect against your real address being revealed.\n**Use a Custom Domain** | Advanced | Using a custom domain means that you are not dependent on the address assigned by your mail provider. So you can easily switch providers in the future and do not need to worry about a service being discontinued.\n**Sync with a client for backup** | Advanced | To avoid losing temporary or permanent access to your emails during an unplanned event (such as an outage or account lock), Thunderbird can sync/ backup messages from multiple accounts via IMAP and store locally on your primary device.\n**Be Careful with Mail Signatures** | Advanced | You do not know how secure of an email environment the recipient of your message may have. There are several extensions that automatically crawl messages, and create a detailed database of contact information based upon email signatures.\n**Be Careful with Auto-Replies** | Advanced | Out-of-office automatic replies are very useful for informing people there will be a delay in replying, but all too often people reveal too much information- which can be used in social engineering and targeted attacks.\n**Choose the Right Mail Protocol** | Advanced | Do not use outdated protocols (below IMAPv4 or POPv3), both have known vulnerabilities and out-dated security.\n**Self-Hosting** | Advanced | Self-hosting your own mail server is not recommended for non-advanced users, since correctly securing it is critical yet requires strong networking knowledge.\n**Always use TLS Ports** | Advanced | There are SSL options for POP3, IMAP, and SMTP as standard TCP/IP ports. They are easy to use, and widely supported so should always be used instead of plaintext email ports.\n**DNS Availability** | Advanced | For self-hosted mail servers, to prevent DNS problems impacting availability- use at least 2 MX records, with secondary and tertiary MX records for redundancy when the primary MX record fails.\n**Prevent DDoS and Brute Force Attacks** | Advanced | For self-hosted mail servers (specifically SMTP), limit your total number of simultaneous connections, and maximum connection rate to reduce the impact of attempted bot attacks.\n**Maintain IP Blacklist** | Advanced | For self-hosted mail servers, you can improve spam filters and harden security, through maintaining an up-to-date local IP blacklist and a spam URI realtime block lists to filter out malicious hyperlinks.\n\n### Recommended Software\n- [Secure Email Providers](https://github.com/Lissy93/awesome-privacy#encrypted-email)\n- [Mail Forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding)\n- [Pre-Configured Mail Servers](https://github.com/Lissy93/awesome-privacy#pre-configured-mail-servers)\n- [Email Clients](https://github.com/Lissy93/awesome-privacy#email-clients)\n\n\n## Messaging\n\n\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Only Use Fully End-to-End Encrypted Messengers** | Essential | End-to-end encryption is a system of communication where messages are encrypted on your device and not decrypted until they reach the intended recipient. This ensures that any actor who intercepts traffic cannot read the message contents, nor can anybody with access to the central servers where data is stored.\n**Use only Open Source Messaging Platforms** | Essential | If code is open source then it can be independently examined and audited by anyone qualified to do so, to ensure that there are no backdoors, vulnerabilities, or other security issues.\n**Use a \"Trustworthy\" Messaging Platform** | Essential | When selecting an encrypted messaging app, ensure it's fully open source, stable, actively maintained, and ideally backed by reputable developers.\n**Check Security Settings** | Essential | Enable security settings, including contact verification, security notifications, and encryption. Disable optional non-security features such as read receipt, last online, and typing notification.\n**Ensure your Recipients Environment is Secure** | Essential | Your conversation can only be as secure as the weakest link. Often the easiest way to infiltrate a communications channel is to target the individual or node with the least protection.\n**Disable Cloud Services** | Essential | Some mobile messaging apps offer a web or desktop companion. This not only increases attack surface but it has been linked to several critical security issues, and should therefore be avoided, if possible.\n**Secure Group Chats** | Essential | The risk of compromise rises exponentially, the more participants are in a group, as the attack surface increases. Periodically check that all participants are legitimate.\n**Create a Safe Environment for Communication** | Essential | There are several stages where your digital communications could be monitored or intercepted. This includes: your or your participants' device, your ISP, national gateway or government logging, the messaging provider, the servers.\n**Agree on a Communication Plan** | Optional | In certain situations, it may be worth making a communication plan. This should include primary and backup methods of securely getting in hold with each other.\n**Strip Meta-Data from Media** | Optional | Metadata is \"Data about Data\" or additional information attached to a file or transaction. When you send a photo, audio recording, video, or document you may be revealing more than you intended to.\n**Defang URLs** | Optional | Sending links via various services can unintentionally expose your personal information. This is because, when a thumbnail or preview is generated- it happens on the client-side.\n**Verify your Recipient** | Optional | Always ensure you are talking to the intended recipient, and that they have not been compromised. One method for doing so is to use an app which supports contact verification.\n**Enable Ephemeral Messages** | Optional | Self-destructing messages is a feature that causes your messages to automatically delete after a set amount of time. This means that if your device is lost, stolen, or seized, an adversary will only have access to the most recent communications.\n**Avoid SMS** | Optional | SMS may be convenient, but it's not secure. It is susceptible to threats such as interception, sim swapping, manipulation, and malware.\n**Watch out for Trackers** | Optional | Be wary of messaging applications with trackers, as the detailed usage statistics they collect are often very invasive, and can sometimes reveal your identity as well as personal information that you would otherwise not intend to share.\n**Consider Jurisdiction** | Advanced | The jurisdictions where the organisation is based, and data is hosted should also be taken into account.\n**Use an Anonymous Platform** | Advanced | If you believe you may be targeted, you should opt for an anonymous messaging platform that does not require a phone number, or any other personally identifiable information to sign up or use.\n**Ensure Forward Secrecy is Supported** | Advanced | Opt for a platform that implements forward secrecy. This is where your app generates a new encryption key for every message.\n**Consider a Decentralized Platform** | Advanced | If all data flows through a central provider, you have to trust them with your data and meta-data. You cannot verify that the system running is authentic without back doors.\n\n### Recommended Software\n- [Secure Messaging Apps](https://github.com/Lissy93/awesome-privacy#encrypted-messaging)\n- [P2P Messaging Platforms](https://github.com/Lissy93/awesome-privacy#p2p-messaging)\n\n\n## Social Media\n\nOnline communities have existed since the invention of the internet, and give people around the world the opportunity to connect, communicate and share. Although these networks are a great way to promote social interaction and bring people together, that have a dark side - there are some serious [Privacy Concerns with Social Networking Services](https://en.wikipedia.org/wiki/Privacy_concerns_with_social_networking_services), and these social networking sites are owned by private corporations, and that they make their money by collecting data about individuals and selling that data on, often to third party advertisers.\nSecure your account, lock down your privacy settings, but know that even after doing so, all data intentionally and non-intentionally uploaded is effectively public. If possible, avoid using conventional social media networks.\n\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Secure your Account** | Essential | Social media profiles get stolen or taken over all too often. To protect your account: use a unique and strong password, and enable 2-factor authentication.\n**Check Privacy Settings** | Essential | Most social networks allow you to control your privacy settings. Ensure that you are comfortable with what data you are currently exposing and to whom.\n**Think of All Interactions as Public** | Essential | There are still numerous methods of viewing a users 'private' content across many social networks. Therefore, before uploading, posting or commenting on anything, think \"Would I mind if this was totally public?\"\n**Think of All Interactions as Permanent** | Essential | Pretty much every post, comment, photo etc is being continuously backed up by a myriad of third-party services, who archive this data and make it indexable and publicly available almost forever.\n**Don't Reveal too Much** | Essential | Profile information creates a goldmine of info for hackers, the kind of data that helps them personalize phishing scams. Avoid sharing too much detail (DoB, Hometown, School etc).\n**Be Careful what you Upload** | Essential | Status updates, comments, check-ins and media can unintentionally reveal a lot more than you intended them to. This is especially relevant to photos and videos, which may show things in the background.\n**Don't Share Email or Phone Number** | Essential | Posting your real email address or mobile number, gives hackers, trolls and spammers more munition to use against you, and can also allow separate aliases, profiles or data points to be connected.\n**Don't Grant Unnecessary Permissions** | Essential | By default many of the popular social networking apps will ask for permission to access your contacts, call log, location, messaging history etc. If they don’t need this access, don’t grant it.\n**Be Careful of 3rd-Party Integrations** | Essential | Avoid signing up for accounts using a Social Network login, revoke access to social apps you no longer use.\n**Avoid Publishing Geo Data while still Onsite** | Essential | If you plan to share any content that reveals a location, then wait until you have left that place. This is particularly important when you are taking a trip, at a restaurant, campus, hotel/resort, public building or airport.\n**Remove metadata before uploading media** | Optional | Most smartphones and some cameras automatically attach a comprehensive set of additional data (called EXIF data) to each photograph. Remove this data before uploading.\n**Implement Image Cloaking** | Advanced | Tools like Fawkes can be used to very subtly, slightly change the structure of faces within photos in a way that is imperceptible by humans, but will prevent facial recognition systems from being able to recognize a given face.\n**Consider Spoofing GPS in home vicinity** | Advanced | Even if you yourself never use social media, there is always going to be others who are not as careful, and could reveal your location.\n**Consider False Information** | Advanced | If you just want to read, and do not intend on posting too much- consider using an alias name, and false contact details.\n**Don’t have any social media accounts** | Advanced | Social media is fundamentally un-private, so for maximum online security and privacy, avoid using any mainstream social networks.\n\n### Recommended Software\n- [Alternative Social Media](https://github.com/Lissy93/awesome-privacy#social-networks)\n- [Alternative Video Platforms](https://github.com/Lissy93/awesome-privacy#video-platforms)\n- [Alternative Blogging Platforms](https://github.com/Lissy93/awesome-privacy#blogging-platforms)\n- [News Readers and Aggregation](https://github.com/Lissy93/awesome-privacy#news-readers-and-aggregation)\n\n\n## Networks\n\nThis section covers how you connect your devices to the internet securely, including configuring your router and setting up a VPN.\n\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Use a VPN** | Essential | Use a reputable, paid-for VPN. This can help protect sites you visit from logging your real IP, reduce the amount of data your ISP can collect, and increase protection on public WiFi.\n**Change your Router Password** | Essential | After getting a new router, change the password. Default router passwords are publicly available, meaning anyone within proximity would be able to connect.\n**Use WPA2, and a strong password** | Essential | There are different authentication protocols for connecting to WiFi. Currently, the most secure options are WPA2 and WPA3 (on newer routers).\n**Keep router firmware up-to-date** | Essential | Manufacturers release firmware updates that fix security vulnerabilities, implement new standards, and sometimes add features or improve the performance of your router.\n**Implement a Network-Wide VPN** | Optional | If you configure your VPN on your router, firewall, or home server, then traffic from all devices will be encrypted and routed through it, without needing individual VPN apps.\n**Protect against DNS leaks** | Optional | When using a VPN, it is extremely important to exclusively use the DNS server of your VPN provider or secure service.\n**Use a secure VPN Protocol** | Optional | OpenVPN and WireGuard are open source, lightweight, and secure tunneling protocols. Avoid using PPTP or SSTP.\n**Secure DNS** | Optional | Use DNS-over-HTTPS which performs DNS resolution via the HTTPS protocol, encrypting data between you and your DNS resolver.\n**Avoid the free router from your ISP** | Optional | Typically they’re manufactured cheaply in bulk in China, with insecure propriety firmware that doesn't receive regular security updates.\n**Whitelist MAC Addresses** | Optional | You can whitelist MAC addresses in your router settings, disallowing any unknown devices to immediately connect to your network, even if they know your credentials.\n**Change the Router’s Local IP Address** | Optional | It is possible for a malicious script in your web browser to exploit a cross-site scripting vulnerability, accessing known-vulnerable routers at their local IP address and tampering with them.\n**Don't Reveal Personal Info in SSID** | Optional | You should update your network name, choosing an SSID that does not identify you, include your flat number/address, and does not specify the device brand/model.\n**Opt-Out Router Listings** | Optional | WiFi SSIDs are scanned, logged, and then published on various websites, which is a serious privacy concern for some.\n**Hide your SSID** | Optional | Your router's Service Set Identifier is simply the network name. If it is not visible, it may receive less abuse.\n**Disable WPS** | Optional | Wi-Fi Protected Setup provides an easier method to connect, without entering a long WiFi password, but WPS introduces a series of major security issues.\n**Disable UPnP** | Optional | Universal Plug and Play allows applications to automatically forward a port on your router, but it has a long history of serious security issues.\n**Use a Guest Network for Guests** | Optional | Do not grant access to your primary WiFi network to visitors, as it enables them to interact with other devices on the network.\n**Change your Router's Default IP** | Optional | Modifying your router admin panel's default IP address will make it more difficult for malicious scripts targeting local IP addresses.\n**Kill unused processes and services on your router** | Optional | Services like Telnet and SSH that provide command-line access to devices should never be exposed to the internet and should also be disabled on the local network unless they're actually needed.\n**Don't have Open Ports** | Optional | Close any open ports on your router that are not needed. Open ports provide an easy entrance for hackers.\n**Disable Unused Remote Access Protocols** | Optional | When protocols such as PING, Telnet, SSH, UPnP, and HNAP etc are enabled, they allow your router to be probed from anywhere in the world.\n**Disable Cloud-Based Management** | Optional | You should treat your router's admin panel with the utmost care, as considerable damage can be caused if an attacker is able to gain access.\n**Manage Range Correctly** | Optional | It's common to want to pump your router's range to the max, but if you reside in a smaller flat, your attack surface is increased when your WiFi network can be picked up across the street.\n**Route all traffic through [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor)** | Advanced | VPNs have their weaknesses. For increased security, route all your internet traffic through the [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor) network.\n**Disable WiFi on all Devices** | Advanced | Connecting to even a secure WiFi network increases your attack surface. Disabling your home WiFi and connect each device via Ethernet.\n\n### Recommended Software\n- [Virtual Private Networks](https://github.com/Lissy93/awesome-privacy#virtual-private-networks)\n- [Mix Networks](https://github.com/Lissy93/awesome-privacy#mix-networks)\n- [Router Firmware](https://github.com/Lissy93/awesome-privacy#router-firmware)\n- [Open Source Proxies](https://github.com/Lissy93/awesome-privacy#proxies)\n- [DNS Providers](https://github.com/Lissy93/awesome-privacy#dns)\n- [Firewalls](https://github.com/Lissy93/awesome-privacy#firewalls)\n- [Network Analysis Tools](https://github.com/Lissy93/awesome-privacy#network-analysis)\n- [Self-Hosted Network Security Tools](https://github.com/Lissy93/awesome-privacy#self-hosted-network-security)\n\n\n## Mobile Devices\n\nSmart phones have revolutionized so many aspects of life and brought the world to our fingertips. For many of us, smart phones are our primary means of communication, entertainment and access to knowledge. But while they've brought convenience to whole new level, there's some ugly things going on behind the screen.\nGeo-tracking is used to trace our every move, and we have little control over who has this data- your phone is even able to [track your location without GPS](https://gizmodo.com/how-to-track-a-cellphone-without-gps-or-consent-1821125371). Over the years numerous reports that surfaced, outlining ways in which your phone's [mic can eavesdrop](https://www.independent.co.uk/life-style/gadgets-and-tech/news/smartphone-apps-listening-privacy-alphonso-shazam-advertising-pool-3d-honey-quest-a8139451.html), and the [camera can watch you](https://www.businessinsider.com/hackers-governments-smartphone-iphone-camera-wikileaks-cybersecurity-hack-privacy-webcam-2017-6)- all without your knowledge or consent. And then there's the malicious apps, lack of security patches and potential/ likely backdoors.\nUsing a smart phone generates a lot of data about you- from information you intentionally share, to data silently generated from your actions. It can be scary to see what Google, Microsoft, Apple and Facebook know about us- sometimes they know more than our closest family. It's hard to comprehend what your data will reveal, especially in conjunction with other data.\nThis data is used for [far more than just advertising](https://internethealthreport.org/2018/the-good-the-bad-and-the-ugly-sides-of-data-tracking/) - more often it's used to rate people for finance, insurance and employment. Targeted ads can even be used for fine-grained surveillance (see [ADINT](https://adint.cs.washington.edu))\nMore of us are concerned about how [governments use collect and use our smart phone data](https://www.statista.com/statistics/373916/global-opinion-online-monitoring-government/), and rightly so, federal agencies often [request our data from Google](https://www.statista.com/statistics/273501/global-data-requests-from-google-by-federal-agencies-and-governments/), [Facebook](https://www.statista.com/statistics/287845/global-data-requests-from-facebook-by-federal-agencies-and-governments/), Apple, Microsoft, Amazon, and other tech companies. Sometimes requests are made in bulk, returning detailed information on everybody within a certain geo-fence, [often for innocent people](https://www.nytimes.com/interactive/2019/04/13/us/google-location-tracking-police.html). And this doesn't include all of the internet traffic that intelligence agencies around the world have unhindered access to.\n\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Encrypt your Device** | Essential | In order to keep your data safe from physical access, use file encryption. This will mean if your device is lost or stolen, no one will have access to your data.\n**Turn off connectivity features that aren’t being used** | Essential | When you're not using WiFi, Bluetooth, NFC etc, turn those features off. There are several common threats that utilise these features.\n**Keep app count to a minimum** | Essential | Uninstall apps that you don’t need or use regularly. As apps often run in the background, slowing your device down, but also collecting data.\n**App Permissions** | Essential | Don’t grant apps permissions that they don’t need. For Android, [Bouncer](https://awesome-privacy.xyz/security-tools/mobile-apps/bouncer) is an app that allows you to grant temporary/ 1-off permissions.\n**Only install Apps from official source** | Essential | Applications on Apple App Store and Google Play Store are scanned and cryptographically signed, making them less likely to be malicious.\n**Be Careful of Phone Charging Threats** | Optional | Juice Jacking is when hackers use public charging stations to install malware on your smartphone or tablet through a compromised USB port.\n**Set up a mobile carrier PIN** | Essential | SIM hijacking is when a hacker is able to get your mobile number transferred to their sim. The easiest way to protect against this is to set up a PIN through your mobile provider.\n**Opt-out of Caller ID Listings** | Optional | To keep your details private, you can unlist your number from caller ID apps like TrueCaller, CallApp, SyncMe, and Hiya.\n**Use Offline Maps** | Optional | Consider using an offline maps app, such as OsmAnd or Organic Maps, to reduce data leaks from map apps.\n**Opt-out of personalized ads** | Optional | You can slightly reduce the amount of data collected by opting-out of seeing personalized ads.\n**Erase after too many login attempts** | Optional | To protect against an attacker brute forcing your pin, set your device to erase after too many failed login attempts.\n**Monitor Trackers** | Optional | [εxodus](https://awesome-privacy.xyz/security-tools/online-tools/εxodus) is a great service which lets you search for any app and see which trackers are embedded in it.\n**Use a Mobile Firewall** | Optional | To prevent applications from leaking privacy-sensitive data, you can install a firewall app.\n**Reduce Background Activity** | Optional | For Android, SuperFreeze makes it possible to entirely freeze all background activities on a per-app basis.\n**Sandbox Mobile Apps** | Optional | Prevent permission-hungry apps from accessing your private data with [Island](https://awesome-privacy.xyz/security-tools/mobile-apps/island), a sandbox environment.\n**Tor Traffic** | Advanced | [Orbot](https://awesome-privacy.xyz/security-tools/mobile-apps/orbot) provides a system-wide Tor connection, which will help protect you from surveillance and public WiFi threats.\n**Avoid Custom Virtual Keyboards** | Optional | It is recommended to stick with your device's stock keyboard. If you choose to use a third-party keyboard app, ensure it is reputable.\n**Restart Device Regularly** | Optional | Restarting your phone at least once a week will clear the app state cached in memory and may run more smoothly after a restart.\n**Avoid SMS** | Optional | SMS should not be used to receive 2FA codes or for communication, instead use an encrypted messaging app, such as [Signal](https://awesome-privacy.xyz/communication/encrypted-messaging/signal).\n**Keep your Number Private** | Optional | [MySudo](https://awesome-privacy.xyz/finance/virtual-credit-cards/mysudo) allows you to create and use virtual phone numbers for different people or groups. This is great for compartmentalisation.\n**Watch out for Stalkerware** | Optional | Stalkerware is malware that is installed directly onto your device by someone you know. The best way to get rid of it is through a factory reset.\n**Favor the Browser, over Dedicated App** | Optional | Where possible, consider using a secure browser to access sites, rather than installing dedicated applications.\n**Consider running a custom ROM (Android)** | Advanced | If you're concerned about your device manufacturer collecting too much personal information, consider a privacy-focused custom ROM.\n\n### Recommended Software\n- [Mobile Apps, for Security + Privacy](https://github.com/Lissy93/awesome-privacy#mobile-apps)\n- [Encrypted Messaging](https://github.com/Lissy93/awesome-privacy#encrypted-messaging)\n- [Mobile Operation Systems](https://github.com/Lissy93/awesome-privacy#mobile-operating-systems)\n\n\n## Personal Computers\n\nAlthough Windows and OS X are easy to use and convenient, they both are far from secure. Your OS provides the interface between hardware and your applications, so if compromised can have detrimental effects.\n\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Keep your System up-to-date** | Essential | System updates contain fixes/patches for security issues, improve performance, and sometimes add new features. Install new updates when prompted.\n**Encrypt your Device** | Essential | Use BitLocker for Windows, FileVault on MacOS, or LUKS on Linux, to enable full disk encryption. This prevents unauthorized access if your computer is lost or stolen.\n**Backup Important Data** | Essential | Maintaining encrypted backups prevents loss due to ransomware, theft, or damage. Consider using [Cryptomator](https://awesome-privacy.xyz/security-tools/mobile-apps/cryptomator) for cloud files or [VeraCrypt](https://awesome-privacy.xyz/essentials/file-encryption/veracrypt) for USB drives.\n**Be Careful Plugging USB Devices into your Computer** | Essential | USB devices can pose serious threats. Consider making a USB sanitizer with CIRCLean to safely check USB devices.\n**Activate Screen-Lock when Idle** | Essential | Lock your computer when away and set it to require a password on resume from screensaver or sleep to prevent unauthorized access.\n**Disable Cortana or Siri** | Essential | Voice-controlled assistants can have privacy implications due to data sent back for processing. Disable or limit their listening capabilities.\n**Review your Installed Apps** | Essential | Keep installed applications to a minimum to reduce exposure to vulnerabilities and regularly clear application caches.\n**Manage Permissions** | Essential | Control which apps have access to your location, camera, microphone, contacts, and other sensitive information.\n**Disallow Usage Data from being sent to the Cloud** | Essential | Limit the amount of usage information or feedback sent to the cloud to protect your privacy.\n**Avoid Quick Unlock** | Essential | Use a strong password instead of biometrics or short PINs for unlocking your computer to enhance security.\n**Power Off Computer, instead of Standby** | Essential | Shut down your device when not in use, especially if your disk is encrypted, to keep data secure.\n**Don't link your PC with your Microsoft or Apple Account** | Optional | Use a local account only to prevent data syncing and exposure. Avoid using sync services that compromise privacy.\n**Check which Sharing Services are Enabled** | Optional | Disable network sharing features you are not using to close gateways to common threats.\n**Don't use Root/Admin Account for Non-Admin Tasks** | Optional | Use an unprivileged user account for daily tasks and only elevate permissions for administrative changes to mitigate vulnerabilities.\n**Block Webcam + Microphone** | Optional | Cover your webcam when not in use and consider blocking unauthorized audio recording to protect privacy.\n**Use a Privacy Filter** | Optional | Use a screen privacy filter in public spaces to prevent shoulder surfing and protect sensitive information.\n**Physically Secure Device** | Optional | Use a Kensington Lock to secure your laptop in public spaces and consider port locks to prevent unauthorized physical access.\n**Don't Charge Devices from your PC** | Optional | Use a power bank or AC wall charger instead of your PC to avoid security risks associated with USB connections.\n**Randomize your hardware address on Wi-Fi** | Optional | Modify or randomize your MAC address to protect against tracking across different WiFi networks.\n**Use a Firewall** | Optional | Install a firewall app to monitor and block unwanted internet access by certain applications, protecting against remote access attacks and privacy breaches.\n**Protect Against Software Keyloggers** | Optional | Use key stroke encryption tools to protect against software keyloggers recording your keystrokes.\n**Check Keyboard Connection** | Optional | Be vigilant for hardware keyloggers when using public or unfamiliar computers by checking keyboard connections.\n**Prevent Keystroke Injection Attacks** | Optional | Lock your PC when away and consider using USBGuard or similar tools to protect against keystroke injection attacks.\n**Don't use commercial \"Free\" Anti-Virus** | Optional | Rely on built-in security tools and avoid free anti-virus applications due to their potential for privacy invasion and data collection.\n**Periodically check for Rootkits** | Advanced | Regularly check for rootkits to detect and mitigate full system control threats using tools like [chkrootkit](https://awesome-privacy.xyz/operating-systems/linux-defenses/chkrootkit).\n**BIOS Boot Password** | Advanced | Enable a BIOS or UEFI password to add an additional security layer during boot-up, though be aware of its limitations.\n**Use a Security-Focused Operating System** | Advanced | Consider switching to Linux or a security-focused distro like QubeOS or [Tails](https://awesome-privacy.xyz/operating-systems/desktop-operating-systems/tails) for enhanced privacy and security.\n**Make Use of VMs** | Advanced | Use virtual machines for risky activities or testing suspicious software to isolate potential threats from your primary system.\n**Compartmentalize** | Advanced | Isolate different programs and data sources from one another as much as possible to limit the extent of potential breaches.\n**Disable Undesired Features (Windows)** | Advanced | Disable unnecessary Windows \"features\" and services that run in the background to reduce data collection and resource use.\n**Secure Boot** | Advanced | Ensure that Secure Boot is enabled to prevent malware from replacing your boot loader and other critical software.\n**Secure SSH Access** | Advanced | Take steps to protect SSH access from attacks by changing the default port, using SSH keys, and configuring firewalls.\n**Close Un-used Open Ports** | Advanced | Turn off services listening on external ports that are not needed to protect against remote exploits and improve security.\n**Implement Mandatory Access Control** | Advanced | Restrict privileged access to limit the damage that can be done if a system is compromised.\n**Use Canary Tokens** | Advanced | Deploy canary tokens to detect unauthorized access to your files or emails faster and gather information about the intruder.\n\n### Recommended Software\n- [Secure Operating Systems](https://github.com/Lissy93/awesome-privacy#desktop-operating-systems)\n- [Linux Defenses](https://github.com/Lissy93/awesome-privacy#linux-defences)\n- [Windows Defenses](https://github.com/Lissy93/awesome-privacy#windows-defences)\n- [Mac OS Defenses](https://github.com/Lissy93/awesome-privacy#mac-os-defences)\n- [Anti-Malware](https://github.com/Lissy93/awesome-privacy#anti-malware)\n- [Firewalls](https://github.com/Lissy93/awesome-privacy#firewalls-1)\n- [File Encryption](https://github.com/Lissy93/awesome-privacy#file-encryption)\n\n\n## Smart Home\n\nHome assistants (such as Google Home, Alexa and Siri) and other internet connected devices collect large amounts of personal data (including voice samples, location data, home details and logs of all interactions). Since you have limited control on what is being collected, how it's stored, and what it will be used for, this makes it hard to recommend any consumer smart-home products to anyone who cares about privacy and security.\nSecurity vs Privacy: There are many smart devices on the market that claim to increase the security of your home while being easy and convenient to use (Such as Smart Burglar Alarms, Internet Security Cameras, Smart Locks and Remote access Doorbells to name a few). These devices may appear to make security easier, but there is a trade-off in terms of privacy: as they collect large amounts of personal data, and leave you without control over how this is stored or used. The security of these devices is also questionable, since many of them can be (and are being) hacked, allowing an intruder to bypass detection with minimum effort.\nThe most privacy-respecting option, would be to not use \"smart\" internet-connected devices in your home, and not to rely on a security device that requires an internet connection. But if you do, it is important to fully understand the risks of any given product, before buying it. Then adjust settings to increase privacy and security. The following checklist will help mitigate the risks associated with internet-connected home devices.\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Rename devices to not specify brand/model** | Essential | Change default device names to something generic to prevent targeted attacks by obscuring brand or model information.\n**Disable microphone and camera when not in use** | Essential | Use hardware switches to turn off microphones and cameras on smart devices to protect against accidental recordings or targeted access.\n**Understand what data is collected, stored and transmitted** | Essential | Research and ensure comfort with the data handling practices of smart home devices before purchase, avoiding devices that share data with third parties.\n**Set privacy settings, and opt out of sharing data with third parties** | Essential | Adjust app settings for strictest privacy controls and opt-out of data sharing with third parties wherever possible.\n**Don't link your smart home devices to your real identity** | Essential | Use anonymous usernames and passwords, avoiding sign-up/log-in via social media or other third-party services to maintain privacy.\n**Keep firmware up-to-date** | Essential | Regularly update smart device firmware to apply security patches and enhancements.\n**Protect your Network** | Essential | Secure your home WiFi and network to prevent unauthorized access to smart devices.\n**Be wary of wearables** | Optional | Consider the extensive data collection capabilities of wearable devices and their implications for privacy.\n**Don't connect your home's critical infrastructure to the Internet** | Optional | Evaluate the risks of internet-connected thermostats, alarms, and detectors due to potential remote access by hackers.\n**Mitigate Alexa/ Google Home Risks** | Optional | Consider privacy-focused alternatives like [Mycroft](https://awesome-privacy.xyz/smart-home-and-iot/voice-assistants/mycroft) or use Project Alias to prevent idle listening by voice-activated assistants.\n**Monitor your home network closely** | Optional | Use tools like FingBox or router features to monitor for unusual network activity.\n**Deny Internet access where possible** | Advanced | Use firewalls to block internet access for devices that don't need it, limiting operation to local network use.\n**Assess risks** | Advanced | Consider the privacy implications for all household members and adjust device settings for security and privacy, such as disabling devices at certain times.\n\n### Recommended Software\n- [Home Automation](https://github.com/Lissy93/awesome-privacy#home-automation)\n- [AI Voice Assistants](https://github.com/Lissy93/awesome-privacy#ai-voice-assistants)\n\n\n## Personal Finance\n\nCredit card fraud is the most common form of identity theft (with [133,015 reports in the US in 2017 alone](https://www.experian.com/blogs/ask-experian/identity-theft-statistics/)), and a total loss of $905 million, which was a 26% increase from the previous year. The with a median amount lost per person was $429 in 2017. It's more important than ever to take basic steps to protect yourself from falling victim\nNote about credit cards: Credit cards have technological methods in place to detect and stop some fraudulent transactions. Major payment processors implement this, by mining huge amounts of data from their card holders, in order to know a great deal about each persons spending habits. This data is used to identify fraud, but is also sold onto other data brokers. Credit cards are therefore good for security, but terrible for data privacy.\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Sign up for Fraud Alerts and Credit Monitoring** | Essential | Enable fraud alerts and credit monitoring through Experian, TransUnion, or Equifax to be alerted of suspicious activity.\n**Apply a Credit Freeze** | Essential | Prevent unauthorized credit inquiries by freezing your credit through Experian, TransUnion, and Equifax.\n**Use Virtual Cards** | Optional | Utilize virtual card numbers for online transactions to protect your real banking details. Services like [Privacy.com](https://awesome-privacy.xyz/finance/virtual-credit-cards/privacy.com) and [MySudo](https://awesome-privacy.xyz/finance/virtual-credit-cards/mysudo) offer such features.\n**Use Cash for Local Transactions** | Optional | Pay with [Cash](https://awesome-privacy.xyz/finance/other-payment-methods/cash) for local and everyday purchases to avoid financial profiling by institutions.\n**Use Cryptocurrency for Online Transactions** | Optional | Opt for privacy-focused cryptocurrencies like [Monero](https://awesome-privacy.xyz/finance/cryptocurrencies/monero) for online transactions to maintain anonymity. Use cryptocurrencies wisely to ensure privacy.\n**Store Crypto Securely** | Advanced | Securely store cryptocurrencies using offline wallet generation, hardware wallets like [Trezor](https://awesome-privacy.xyz/finance/crypto-wallets/trezor) or [ColdCard](https://awesome-privacy.xyz/finance/crypto-wallets/coldcard), or consider long-term storage solutions like [CryptoSteel](https://awesome-privacy.xyz/finance/crypto-wallets/cryptosteel).\n**Buy Crypto Anonymously** | Advanced | Purchase cryptocurrencies without linking to your identity through services like [LocalBitcoins](https://awesome-privacy.xyz/finance/crypto-exchanges/localbitcoins), [Bisq](https://awesome-privacy.xyz/finance/crypto-exchanges/bisq), or Bitcoin ATMs.\n**Tumble/ Mix Coins** | Advanced | Use a bitcoin mixer or CoinJoin before converting Bitcoin to currency to obscure transaction trails.\n**Use an Alias Details for Online Shopping** | Advanced | For online purchases, consider using alias details, forwarding email addresses, VOIP numbers, and secure delivery methods to protect your identity.\n**Use alternate delivery address** | Advanced | Opt for deliveries to non-personal addresses such as PO Boxes, forwarding addresses, or local pickup locations to avoid linking purchases directly to you.\n\n### Recommended Software\n- [Virtual Credit Cards](https://github.com/Lissy93/awesome-privacy#virtual-credit-cards)\n- [Cryptocurrencies](https://github.com/Lissy93/awesome-privacy#cryptocurrencies)\n- [Crypto Wallets](https://github.com/Lissy93/awesome-privacy#crypto-wallets)\n- [Crypto Exchanges](https://github.com/Lissy93/awesome-privacy#crypto-exchanges)\n- [Other Payment Methods](https://github.com/Lissy93/awesome-privacy#other-payment-methods)\n- [Budgeting Tools](https://github.com/Lissy93/awesome-privacy#budgeting-tools)\n\n\n## Human Aspect\n\nMany data breaches, hacks and attacks are caused by human error. The following list contains steps you should take, to reduce the risk of this happening to you. Many of them are common sense, but it's worth takin note of.\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Verify Recipients** | Essential | Emails can be easily spoofed. Verify the sender's authenticity, especially for sensitive actions, and prefer entering URLs manually rather than clicking links in emails.\n**Don't Trust Your Popup Notifications** | Essential | Fake pop-ups can be deployed by malicious actors. Always check the URL before entering any information on a popup.\n**Never Leave Device Unattended** | Essential | Unattended devices can be compromised even with strong passwords. Use encryption and remote erase features like Find My Phone for lost devices.\n**Prevent Camfecting** | Essential | Protect against camfecting by using webcam covers and microphone blockers. Mute home assistants when not in use or discussing sensitive matters.\n**Stay protected from shoulder surfers** | Essential | Use privacy screens on laptops and mobiles to prevent others from reading your screen in public spaces.\n**Educate yourself about phishing attacks** | Essential | Be cautious of phishing attempts. Verify URLs, context of received messages, and employ good security practices like using 2FA and not reusing passwords.\n**Watch out for Stalkerware** | Essential | Be aware of stalkerware installed by acquaintances for spying. Look out for signs like unusual battery usage and perform factory resets if suspected.\n**Install Reputable Software from Trusted Sources** | Essential | Only download software from legitimate sources and check files with tools like [Virus Total](https://awesome-privacy.xyz/security-tools/online-tools/virus-total) before installation.\n**Store personal data securely** | Essential | Ensure all personal data on devices or in the cloud is encrypted to protect against unauthorized access.\n**Obscure Personal Details from Documents** | Essential | When sharing documents, obscure personal details with opaque rectangles to prevent information leakage.\n**Do not assume a site is secure, just because it is `HTTPS`** | Essential | HTTPS does not guarantee a website's legitimacy. Verify URLs and exercise caution with personal data.\n**Use Virtual Cards when paying online** | Optional | Use virtual cards for online payments to protect your banking details and limit transaction risks.\n**Review application permissions** | Optional | Regularly review and manage app permissions to ensure no unnecessary access to sensitive device features.\n**Opt-out of public lists** | Optional | Remove yourself from public databases and marketing lists to reduce unwanted contacts and potential risks.\n**Never Provide Additional PII When Opting-Out** | Optional | Do not provide additional personal information when opting out of data services to avoid further data collection.\n**Opt-out of data sharing** | Optional | Many apps and services default to data sharing settings. Opt out to protect your data from being shared with third parties.\n**Review and update social media privacy** | Optional | Regularly check and update your social media settings due to frequent terms updates that may affect your privacy settings.\n**Compartmentalize** | Advanced | Keep different areas of digital activity separate to limit data exposure in case of a breach.\n**WhoIs Privacy Guard** | Advanced | Use WhoIs Privacy Guard for domain registrations to protect your personal information from public searches.\n**Use a forwarding address** | Advanced | Use a PO Box or forwarding address for mail to prevent companies from knowing your real address, adding a layer of privacy protection.\n**Use anonymous payment methods** | Advanced | Opt for anonymous payment methods like cryptocurrencies to avoid entering identifiable information online.\n\n\n## Physical Security\n\nPublic records often include sensitive personal data (full name, date of birth, phone number, email, address, ethnicity etc), and are gathered from a range of sources (census records, birth/ death/ marriage certificates, voter registrants, marketing information, customer databases, motor vehicle records, professional/ business licenses and all court files in full detail). This sensitive personal information is [easy and legal to access](https://www.consumerreports.org/consumerist/its-creepy-but-not-illegal-for-this-website-to-provide-all-your-public-info-to-anyone/), which raises some [serious privacy concerns](https://privacyrights.org/resources/public-records-internet-privacy-dilemma) (identity theft, personal safety risks/ stalkers, destruction of reputations, dossier society)\n\nCCTV is one of the major ways that the corporations, individuals and the government tracks your movements. In London, UK the average person is caught on camera about 500 times per day. This network is continuing to grow, and in many cities around the world, facial recognition is being rolled out, meaning the state can know the identity of residents on the footage in real-time.\nStrong authentication, encrypted devices, patched software and anonymous web browsing may be of little use if someone is able to physically compromise you, your devices and your data. This section outlines some basic methods for physical security\n\n**Security** | **Priority** | **Details and Hints**\n--- | --- | ---\n**Destroy Sensitive Documents** | Essential | Shred or redact sensitive documents before disposal to protect against\nidentity theft and maintain confidentiality.\n\n**Opt-Out of Public Records** | Essential | Contact people search websites to opt-out from listings that show persona\ninformation, using guides like Michael Bazzell's Personal Data Removal Workbook.\n\n**Watermark Documents** | Essential | Add a watermark with the recipient's name and date to digital copies of\npersonal documents to trace the source of a breach.\n\n**Don't Reveal Info on Inbound Calls** | Essential | Only share personal data on calls you initiate and verify the recipient's phone number.\n\n**Stay Alert** | Essential | Be aware of your surroundings and assess potential risks in new environments.\n**Secure Perimeter** | Essential | Ensure physical security of locations storing personal info devices, minimizing external access and using intrusion detection systems.\n**Physically Secure Devices** | Essential | Use physical security measures like Kensington locks, webcam covers, and privacy screens for devices.\n**Keep Devices Out of Direct Sight** | Essential | Prevent devices from being visible from outside to mitigate risks from lasers and theft.\n**Protect your PIN** | Essential | Shield your PIN entry from onlookers and cameras, and clean touchscreens after use.\n**Check for Skimmers** | Essential | Inspect ATMs and public devices for skimming devices and tampering signs before use.\n**Protect your Home Address** | Optional | Use alternative locations, forwarding addresses, and anonymous payment methods to protect your home address.\n**Use a PIN, Not Biometrics** | Advanced | Prefer PINs over biometrics for device security in situations where legal coercion to unlock devices may occur.\n**Reduce exposure to CCTV** | Advanced | Wear disguises and choose routes with fewer cameras to avoid surveillance.\n**Anti-Facial Recognition Clothing** | Advanced | Wear clothing with patterns that trick facial-recognition technology.\n**Reduce Night Vision Exposure** | Advanced | Use IR light sources or reflective glasses to obstruct night vision cameras.\n**Protect your DNA** | Advanced | Avoid sharing DNA with heritage websites and be cautious about leaving DNA traces.\n\n\n\n<!-- checklist-end -->\n\n----\n\n#### There's an interactive version!\n- [Digital Defense](https://digital-defense.io) - View details, check items of, and track your progress\n\n#### Other Awesome Security Lists\n- @sbilly/[awesome-security](https://github.com/sbilly/awesome-security)\n- @0x4D31/[awesome-threat-detection](https://github.com/0x4D31/awesome-threat-detection)\n- @hslatman/[awesome-threat-intelligence](https://github.com/hslatman/awesome-threat-intelligence)\n- @PaulSec/[awesome-sec-talks](https://github.com/PaulSec/awesome-sec-talks)\n- @Lissy93/[awesome-privacy](https://github.com/lissy93/awesime-privacy)\n- @Zbetcheckin/[security_list](https://github.com/zbetcheckin/Security_list)\n- Michael Horowitz / [defensivecomputingchecklist.com](https://defensivecomputingchecklist.com/)\n\n[See More](/4_Privacy_And_Security_Links.md#other-github-security-lists)\n\n----\n\n## Notes\n\n*Thanks for visiting, hope you found something useful here :) Contributions are welcome, and much appreciated - to propose an edit [raise an issue](https://github.com/Lissy93/personal-security-checklist/issues/new/choose), or [open a PR](https://github.com/Lissy93/personal-security-checklist/pull/new/master). See: [`CONTRIBUTING.md`](/.github/CONTRIBUTING.md).*\n\n*Disclaimer: This is not an exhaustive list, and aims only to be taken as guide.*\n\n*Licensed under [Creative Commons, CC BY 4.0](https://creativecommons.org/licenses/by/4.0/), © [Alicia Sykes](https://aliciasykes.com) 2020*\n\n[![Attribution 4.0 International](https://licensebuttons.net/l/by/3.0/88x31.png)](/LICENSE.md)\n\n---\n\nHelp support the continued development of this project 💖\n\n[![Sponsor Lissy93 on GitHub](https://img.shields.io/badge/Sponsor_on_GitHub-Lissy93-%23ff4dda?style=for-the-badge&logo=githubsponsors&logoColor=ff4dda)](https://github.com/sponsors/Lissy93)\n\n----\n\nFound this helpful? Consider sharing it with others, to help them also improve their digital security 😇\n\n[![Share on Twitter](https://img.shields.io/badge/Share-Twitter-17a2f3?style=for-the-badge&logo=Twitter)](http://twitter.com/share?text=Check%20out%20the%20Personal%20Cyber%20Security%20Checklist-%20an%20ultimate%20list%20of%20tips%20for%20protecting%20your%20digital%20security%20and%20privacy%20in%202020%2C%20with%20%40Lissy_Sykes%20%F0%9F%94%90%20%20%F0%9F%9A%80&url=https://github.com/Lissy93/personal-security-checklist)\n[![Share on LinkedIn](https://img.shields.io/badge/Share-LinkedIn-0077b5?style=for-the-badge&logo=LinkedIn)](\nhttp://www.linkedin.com/shareArticle?mini=true&url=https://github.com/Lissy93/personal-security-checklist&title=The%20Ultimate%20Personal%20Cyber%20Security%20Checklist&summary=%F0%9F%94%92%20A%20curated%20list%20of%20100%2B%20tips%20for%20protecting%20digital%20security%20and%20privacy%20in%202020&source=https://github.com/Lissy93)\n[![Share on Facebook](https://img.shields.io/badge/Share-Facebook-4267b2?style=for-the-badge&logo=Facebook)](https://www.linkedin.com/shareArticle?mini=true&url=https%3A//github.com/Lissy93/personal-security-checklist&title=The%20Ultimate%20Personal%20Cyber%20Security%20Checklist&summary=%F0%9F%94%92%20A%20curated%20list%20of%20100%2B%20tips%20for%20protecting%20digital%20security%20and%20privacy%20in%202020&source=)\n[![Share on Mastodon](https://img.shields.io/badge/Share-Mastodon-56a7e1?style=for-the-badge&logo=Mastodon)](https://mastodon.social/web/statuses/new?text=Check%20out%20the%20Ultimate%20Personal%20Cyber%20Security%20Checklist%20by%20%40Lissy93%20on%20%23GitHub%20%20%F0%9F%94%90%20%E2%9C%A8)\n\n---\n\nGet in touch 📬\n\n[![Alicia Sykes on Twitter](https://img.shields.io/twitter/follow/Lissy_Sykes?style=social&logo=twitter)](https://twitter.com/Lissy_Sykes)\n[![Alicia Sykes on GitHub](https://img.shields.io/github/followers/lissy93?label=Lissy93&style=social)](https://github.com/Lissy93)\n[![Alicia Sykes on Mastodon](https://img.shields.io/mastodon/follow/1032965?domain=https%3A%2F%2Fmastodon.social)](https://mastodon.social/web/accounts/1032965)\n[![Alicia Sykes on Keybase](https://img.shields.io/badge/aliciasykes--lightgrey?style=social&logo=Keybase)](https://keybase.io/aliciasykes)\n[![Alicia Sykes's PGP](https://img.shields.io/badge/PGP--lightgrey?style=social&logo=Let%E2%80%99s%20Encrypt)](https://keybase.io/aliciasykes/pgp_keys.asc)\n[![Alicia Sykes's Website](https://img.shields.io/badge/aliciasykes.com--lightgrey?style=social&logo=Tencent%20QQ)](https://aliciasykes.com)\n\n---\n"
        },
        {
          "name": "Dockerfile",
          "type": "blob",
          "size": 0,
          "content": ""
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 17.357421875,
          "content": "# Creative Commons Attribution 4.0 International Public License (\"CC BY 4.0\")\n\n> © [Alicia Sykes](http://aliciasykes.com/legal) 2020, Licensed under [Creative Commons Attribution 4.0](https://creativecommons.org/licenses/by/4.0/)\n\nCreative Commons Corporation (“Creative Commons”) is not a law firm and does not\nprovide legal services or legal advice. Distribution of Creative Commons public\nlicenses does not create a lawyer-client or other relationship. Creative Commons\nmakes its licenses and related information available on an “as-is” basis.\nCreative Commons gives no warranties regarding its licenses, any material\nlicensed under their terms and conditions, or any related information. Creative\nCommons disclaims all liability for damages resulting from their use to the\nfullest extent possible.\n\n## USING CREATIVE COMMONS PUBLIC LICENSES\n\nCreative Commons public licenses provide a standard set of terms and conditions\nthat creators and other rights holders may use to share original works of\nauthorship and other material subject to copyright and certain other rights\nspecified in the public license below. The following considerations are for\ninformational purposes only, are not exhaustive, and do not form part of our\nlicenses.\n\n### Considerations for licensors:\n\nOur public licenses are intended for use by those authorized to give the public\npermission to use material in ways otherwise restricted by copyright and certain\nother rights. Our licenses are irrevocable. Licensors should read and understand\nthe terms and conditions of the license they choose before applying it.\nLicensors should also secure all rights necessary before applying our licenses\nso that the public can reuse the material as expected. Licensors should clearly\nmark any material not subject to the license. This includes other CC-licensed\nmaterial, or material used under an exception or limitation to copyright.\n\n### Considerations for the public:\n\nBy using one of our public licenses, a licensor grants the public permission to\nuse the licensed material under specified terms and conditions. If the\nlicensor’s permission is not necessary for any reason–for example, because of\nany applicable exception or limitation to copyright–then that use is not\nregulated by the license. Our licenses grant only permissions under copyright\nand certain other rights that a licensor has authority to grant. Use of the\nlicensed material may still be restricted for other reasons, including because\nothers have copyright or other rights in the material. A licensor may make\nspecial requests, such as asking that all changes be marked or described.\nAlthough not required by our licenses, you are encouraged to respect those\nrequests where reasonable.\n\n---\n\n## Creative Commons Attribution 4.0 International Public License\n\nBy exercising the Licensed Rights (defined below), You accept and agree to be\nbound by the terms and conditions of this Creative Commons Attribution 4.0\nInternational Public License (\"Public License\"). To the extent this Public\nLicense may be interpreted as a contract, You are granted the Licensed Rights in\nconsideration of Your acceptance of these terms and conditions, and the Licensor\ngrants You such rights in consideration of benefits the Licensor receives from\nmaking the Licensed Material available under these terms and conditions.\n\n### Section 1 – Definitions.\n\n   a. Adapted Material means material subject to Copyright and Similar Rights\n      that is derived from or based upon the Licensed Material and in which the\n      Licensed Material is translated, altered, arranged, transformed, or\n      otherwise modified in a manner requiring permission under the Copyright\n      and Similar Rights held by the Licensor. For purposes of this Public\n      License, where the Licensed Material is a musical work, performance, or\n      sound recording, Adapted Material is always produced where the Licensed\n      Material is synched in timed relation with a moving image.\n\n   b. Adapter's License means the license You apply to Your Copyright and\n      Similar Rights in Your contributions to Adapted Material in accordance\n      with the terms and conditions of this Public License.\n\n   c. Copyright and Similar Rights means copyright and/or similar rights closely\n      related to copyright including, without limitation, performance,\n      broadcast, sound recording, and Sui Generis Database Rights, without\n      regard to how the rights are labeled or categorized. For purposes of this\n      Public License, the rights specified in Section 2(b)(1)-(2) are not\n      Copyright and Similar Rights.\n\n   d. Effective Technological Measures means those measures that, in the absence\n      of proper authority, may not be circumvented under laws fulfilling\n      obligations under Article 11 of the WIPO Copyright Treaty adopted on\n      December 20, 1996, and/or similar international agreements.\n\n   e. Exceptions and Limitations means fair use, fair dealing, and/or any other\n      exception or limitation to Copyright and Similar Rights that applies to\n      Your use of the Licensed Material.\n\n   f. Licensed Material means the artistic or literary work, database, or other\n   material to which the Licensor applied this Public License.\n\n   g. Licensed Rights means the rights granted to You subject to the terms and\n      conditions of this Public License, which are limited to all Copyright and\n      Similar Rights that apply to Your use of the Licensed Material and that\n      the Licensor has authority to license.\n\n   h. Licensor means the individual(s) or entity(ies) granting rights under this\n      Public License.\n\n   i. Share means to provide material to the public by any means or process that\n      requires permission under the Licensed Rights, such as reproduction,\n      public display, public performance, distribution, dissemination,\n      communication, or importation, and to make material available to the\n      public including in ways that members of the public may access the\n      material from a place and at a time individually chosen by them.\n\n   j. Sui Generis Database Rights means rights other than copyright resulting\n      from Directive 96/9/EC of the European Parliament and of the Council of 11\n      March 1996 on the legal protection of databases, as amended and/or\n      succeeded, as well as other essentially equivalent rights anywhere in the\n      world.\n\n   k. You means the individual or entity exercising the Licensed Rights under\n      this Public License. Your has a corresponding meaning.\n\n### Section 2 – Scope.\n\na. License grant\n\n  1. Subject to the terms and conditions of this Public License, the\n     Licensor hereby grants You a worldwide, royalty-free,\n     non-sublicensable, non-exclusive, irrevocable license to exercise the\n     Licensed Rights in the Licensed Material to:\n\n     A. reproduce and Share the Licensed Material, in whole or in part; and\n\n     B. produce, reproduce, and Share Adapted Material.\n\n  2. Exceptions and Limitations. For the avoidance of doubt, where\n     Exceptions and Limitations apply to Your use, this Public License does\n     not apply, and You do not need to comply with its terms and conditions.\n\n  3. Term. The term of this Public License is specified in Section 6(a).\n\n  4. Media and formats; technical modifications allowed. The Licensor\n     authorizes You to exercise the Licensed Rights in all media and formats\n     whether now known or hereafter created, and to make technical\n     modifications necessary to do so. The Licensor waives and/or agrees not\n     to assert any right or authority to forbid You from making technical\n     modifications necessary to exercise the Licensed Rights, including\n     technical modifications necessary to circumvent Effective Technological\n     Measures. For purposes of this Public License, simply making\n     modifications authorized by this Section 2(a)(4) never produces Adapted\n     Material.\n\n  5. Downstream recipients.\n\n     A. Offer from the Licensor – Licensed Material. Every recipient of the\n        Licensed Material automatically receives an offer from the Licensor\n        to exercise the Licensed Rights under the terms and conditions of\n        this Public License.\n\n     B. No downstream restrictions. You may not offer or impose any\n        additional or different terms or conditions on, or apply any\n        Effective Technological Measures to, the Licensed Material if doing\n        so restricts exercise of the Licensed Rights by any recipient of the\n        Licensed Material.\n\n  6. No endorsement. Nothing in this Public License constitutes or may be\n     construed as permission to assert or imply that You are, or that Your\n     use of the Licensed Material is, connected with, or sponsored,\n     endorsed, or granted official status by, the Licensor or others\n     designated to receive attribution as provided in Section 3(a)(1)(A)(i).\n\nb. Other rights\n\n  1. Moral rights, such as the right of integrity, are not licensed under\n     this Public License, nor are publicity, privacy, and/or other similar\n     personality rights; however, to the extent possible, the Licensor\n     waives and/or agrees not to assert any such rights held by the Licensor\n     to the limited extent necessary to allow You to exercise the Licensed\n     Rights, but not otherwise.\n\n  2. Patent and trademark rights are not licensed under this Public License.\n\n  3. To the extent possible, the Licensor waives any right to collect\n     royalties from You for the exercise of the Licensed Rights, whether\n     directly or through a collecting society under any voluntary or\n     waivable statutory or compulsory licensing scheme. In all other cases\n     the Licensor expressly reserves any right to collect such royalties.\n\n### Section 3 – License Conditions.\n\nYour exercise of the Licensed Rights is expressly made subject to the following conditions.\n\na. Attribution\n\n  1. If You Share the Licensed Material (including in modified form), You\n     must:\n\n     A. retain the following if it is supplied by the Licensor with the\n        Licensed Material:\n\n        i. identification of the creator(s) of the Licensed Material and any\n           others designated to receive attribution, in any reasonable\n           manner requested by the Licensor (including by pseudonym if\n           designated);\n\n        ii. a copyright notice;\n\n        iii. a notice that refers to this Public License;\n\n        iv. a notice that refers to the disclaimer of warranties;\n\n        v. a URI or hyperlink to the Licensed Material to the extent\n           reasonably practicable;\n\n     B. indicate if You modified the Licensed Material and retain an\n        indication of any previous modifications; and\n\n     C. indicate the Licensed Material is licensed under this Public\n        License, and include the text of, or the URI or hyperlink to, this\n        Public License.\n\n  2. You may satisfy the conditions in Section 3(a)(1) in any reasonable\n     manner based on the medium, means, and context in which You Share the\n     Licensed Material. For example, it may be reasonable to satisfy the\n     conditions by providing a URI or hyperlink to a resource that includes\n     the required information.\n\n  3. If requested by the Licensor, You must remove any of the information\n     required by Section 3(a)(1)(A) to the extent reasonably practicable.\n\n  4. If You Share Adapted Material You produce, the Adapter's License You\n     apply must not prevent recipients of the Adapted Material from\n     complying with this Public License.\n      \n### Section 4 – Sui Generis Database Rights.\n\nWhere the Licensed Rights include Sui Generis Database Rights that apply to Your\nuse of the Licensed Material:\n\n   a. for the avoidance of doubt, Section 2(a)(1) grants You the right to\n      extract, reuse, reproduce, and Share all or a substantial portion of the\n      contents of the database;\n\n   b. if You include all or a substantial portion of the database contents in a\n      database in which You have Sui Generis Database Rights, then the database\n      in which You have Sui Generis Database Rights (but not its individual\n      contents) is Adapted Material; and\n   \n   c. You must comply with the conditions in Section 3(a) if You Share all or a\n      substantial portion of the contents of the database.\n\nFor the avoidance of doubt, this Section 4 supplements and does not replace Your\nobligations under this Public License where the Licensed Rights include other\nCopyright and Similar Rights.\n\n### Section 5 – Disclaimer of Warranties and Limitation of Liability.\n\n   a. Unless otherwise separately undertaken by the Licensor, to the extent\n      possible, the Licensor offers the Licensed Material as-is and\n      as-available, and makes no representations or warranties of any kind\n      concerning the Licensed Material, whether express, implied, statutory, or\n      other. This includes, without limitation, warranties of title,\n      merchantability, fitness for a particular purpose, non-infringement,\n      absence of latent or other defects, accuracy, or the presence or absence\n      of errors, whether or not known or discoverable. Where disclaimers of\n      warranties are not allowed in full or in part, this disclaimer may not\n      apply to You.\n\n   b. To the extent possible, in no event will the Licensor be liable to You on\n      any legal theory (including, without limitation, negligence) or otherwise\n      for any direct, special, indirect, incidental, consequential, punitive,\n      exemplary, or other losses, costs, expenses, or damages arising out of\n      this Public License or use of the Licensed Material, even if the Licensor\n      has been advised of the possibility of such losses, costs, expenses, or\n      damages. Where a limitation of liability is not allowed in full or in\n      part, this limitation may not apply to You.\n\n   c. The disclaimer of warranties and limitation of liability provided above\n      shall be interpreted in a manner that, to the extent possible, most\n      closely approximates an absolute disclaimer and waiver of all liability.\n\n### Section 6 – Term and Termination.\n\n a. This Public License applies for the term of the Copyright and Similar\n    Rights licensed here. However, if You fail to comply with this Public\n    License, then Your rights under this Public License terminate\n    automatically.\n\n b. Where Your right to use the Licensed Material has terminated under\n    Section 6(a), it reinstates:\n\n    1. automatically as of the date the violation is cured, provided it is\n       cured within 30 days of Your discovery of the violation; or\n\n    2. upon express reinstatement by the Licensor.\n\n    For the avoidance of doubt, this Section 6(b) does not affect any right\n    the Licensor may have to seek remedies for Your violations of this Public\n    License.\n\n c. For the avoidance of doubt, the Licensor may also offer the Licensed\n    Material under separate terms or conditions or stop distributing the\n    Licensed Material at any time; however, doing so will not terminate this\n    Public License.\n\n d. Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n\n### Section 7 – Other Terms and Conditions.\n\n   a. The Licensor shall not be bound by any additional or different terms or\n      conditions communicated by You unless expressly agreed.\n\n   b. Any arrangements, understandings, or agreements regarding the Licensed\n      Material not stated herein are separate from and independent of the terms\n      and conditions of this Public License.\n\n### Section 8 – Interpretation.\n\n   a. For the avoidance of doubt, this Public License does not, and shall not be\n      interpreted to, reduce, limit, restrict, or impose conditions on any use\n      of the Licensed Material that could lawfully be made without permission\n      under this Public License.\n\n   b. To the extent possible, if any provision of this Public License is deemed\n      unenforceable, it shall be automatically reformed to the minimum extent\n      necessary to make it enforceable. If the provision cannot be reformed, it\n      shall be severed from this Public License without affecting the\n      enforceability of the remaining terms and conditions.\n\n   c. No term or condition of this Public License will be waived and no failure\n      to comply consented to unless expressly agreed to by the Licensor.\n\n   d. Nothing in this Public License constitutes or may be interpreted as a\n      limitation upon, or waiver of, any privileges and immunities that apply to\n      the Licensor or You, including from the legal processes of any\n      jurisdiction or authority.\n\nCreative Commons is not a party to its public licenses. Notwithstanding,\nCreative Commons may elect to apply one of its public licenses to material it\npublishes and in those instances will be considered the “Licensor.” The text of\nthe Creative Commons public licenses is dedicated to the public domain under the\nCC0 Public Domain Dedication. Except for the limited purpose of indicating that\nmaterial is shared under a Creative Commons public license or as otherwise\npermitted by the Creative Commons policies published at\ncreativecommons.org/policies, Creative Commons does not authorize the use of the\ntrademark “Creative Commons” or any other trademark or logo of Creative Commons\nwithout its prior written consent including, without limitation, in connection\nwith any unauthorized modifications to any of its public licenses or any other\narrangements, understandings, or agreements concerning use of licensed material.\nFor the avoidance of doubt, this paragraph does not form part of the public\nlicenses.\n\nCreative Commons may be contacted at creativecommons.org.\n"
        },
        {
          "name": "articles",
          "type": "tree",
          "content": null
        },
        {
          "name": "lib",
          "type": "tree",
          "content": null
        },
        {
          "name": "personal-security-checklist.yml",
          "type": "blob",
          "size": 95.5693359375,
          "content": "- title: Authentication\n  slug: authentication\n  description: Securing your online account login credentials\n  icon: password\n  color: yellow\n  intro: >-\n    Most reported data breaches are caused by the use of weak, default or stolen passwords\n    (according to [this Verizon report](http://www.verizonenterprise.com/resources/reports/rp_dbir-2016-executive-summary_xg_en.pdf)).\n    Use long, strong and unique passwords, manage them in a secure password manager, enable\n    2-factor authentication, keep on top of breaches and take care while logging into your accounts.\n  checklist:\n  - point: Use a Strong Password\n    priority: Essential\n    details: >-\n      If your password is too short, or contains dictionary words, places or names- then it can be easily\n      cracked through brute force, or guessed by someone. The easiest way to make a strong password, is by\n      making it long (12+ characters)- consider using a 'passphrase', made up of many words. Alternatively,\n      use a password generator to create a long, strong random password. Have a play with\n      [HowSecureIsMyPassword.net](https://howsecureismypassword.net), to get an idea of how quickly common\n      passwords can be cracked. Read more about creating strong passwords:\n      [securityinabox.org](https://securityinabox.org/en/passwords/passwords-and-2fa/)\n\n  - point: Don't reuse Passwords\n    priority: Essential\n    details: >-\n      If someone was to reuse a password, and one site they had an account with suffered a leak, then a\n      criminal could easily gain unauthorized access to their other accounts. This is usually done through\n      large-scale automated login requests, and it is called Credential Stuffing. Unfortunately this is all\n      too common, but it's simple to protect against- use a different password for each of your online accounts\n\n  - point: Use a Secure Password Manager\n    priority: Essential\n    details: >-\n      For most people it is going to be near-impossible to remember hundreds of strong and unique passwords.\n      A password manager is an application that generates, stores and auto-fills your login credentials for you.\n      All your passwords will be encrypted against 1 master passwords (which you must remember, and it should be\n      very strong). Most password managers have browser extensions and mobile apps, so whatever device you are on,\n      your passwords can be auto-filled. A good all-rounder is\n      [Bitwarden](https://awesome-privacy.xyz/essentials/password-managers/bitwarden), or see\n      [Recommended Password Managers](https://awesome-privacy.xyz/essentials/password-managers)\n\n  - point: Avoid sharing passwords\n    priority: Essential\n    details: >-\n      While there may be times that you need to share access to an account with another person, you should\n      generally avoid doing this because it makes it easier for the account to become compromised. If you\n      absolutely do need to share a password for example when working on a team with a shared account this\n      should be done via features built into a password manager.\n\n  - point: Enable 2-Factor Authentication\n    priority: Essential\n    details: >-\n      2FA is where you must provide both something you know (a password) and something you have (such as a\n      code on your phone) to log in. This means that if anyone has got your password (e.g. through phishing,\n      malware or a data breach), they will not be able to log into your account. It's easy to get started,\n      download [an authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication)\n      onto your phone, and then go to your account security settings and follow the steps to enable 2FA. Next\n      time you log in on a new device, you will be prompted for the code that displays in the app on your phone\n      (it works without internet, and the code usually changes every 30-seconds)\n\n  - point: Keep Backup Codes Safe\n    priority: Essential\n    details: >-\n      When you enable multi-factor authentication, you will usually be given several codes that you can use if\n      your 2FA method is lost, broken or unavailable. Keep these codes somewhere safe to prevent loss or\n      unauthorized access. You should store these on paper or in a safe place on disk (e.g. in offline storage\n      or in an encrypted file/drive). Don't store these in your Password Manager as 2FA sources and passwords\n      and should be kept separately.\n\n  - point: Sign up for Breach Alerts\n    priority: Optional\n    details: >-\n      After a website suffers a significant data breach, the leaked data often ends up on the internet. There\n      are several websites that collect these leaked records, and allow you to search your email address to check\n      if you are in any of their lists. [Firefox Monitor](https://monitor.firefox.com), [Have I been pwned](https://haveibeenpwned.com)\n      and [DeHashed](https://dehashed.com) allow you to sign up for monitoring, where they will notify you if your\n      email address appears in any new data sets. It is useful to know as soon as possible when this happens, so\n      that you can change your passwords for the affected accounts. [Have i been pwned](https://awesome-privacy.xyz/security-tools/online-tools/have-i-been-pwned) also has domain-wide\n      notification, where you can receive alerts if any email addresses under your entire domain appear (useful if\n      you use aliases for [anonymous forwarding](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding))\n\n  - point: Shield your Password/ PIN\n    priority: Optional\n    details: >-\n      When typing your password in public places, ensure you are not in direct line of site of a CCTV camera and\n      that no one is able to see over your shoulder. Cover your password or pin code while you type, and do not\n      reveal any plain text passwords on screen\n\n  - point: Update Critical Passwords Periodically\n    priority: Optional\n    details: >-\n      Database leaks and breaches are common, and it is likely that several of your passwords are already somewhere\n      online. Occasionally updating passwords of security-critical accounts can help mitigate this. But providing\n      that all your passwords are long, strong and unique, there is no need to do this too often- annually should be\n      sufficient. Enforcing mandatory password changes within organisations is [no longer recommended](https://duo.com/decipher/microsoft-will-no-longer-recommend-forcing-periodic-password-changes),\n      as it encourages colleagues to select weaker passwords\n\n  - point: Don’t save your password in browsers\n    priority: Optional\n    details: >-\n      Most modern browsers offer to save your credentials when you log into a site. Don’t allow this, as they are\n      not always encrypted, hence could allow someone to gain access into your accounts. Instead use a dedicated\n      password manager to store (and auto-fill) your passwords\n\n  - point: Avoid logging in on someone else’s device\n    priority: Optional\n    details: >-\n      Avoid logging on other people's computer, since you can't be sure their system is clean. Be especially cautious\n      of public machines, as malware and tracking is more common here. Using someone else's device is especially\n      dangerous with critical accounts like online banking. When using someone else's machine, ensure that you're in a\n      private/ incognito session (Use Ctrl+Shift+N/ Cmd+Shift+N). This will request browser to not save your credentials,\n      cookies and browsing history.\n\n  - point: Avoid password hints\n    priority: Optional\n    details: >-\n      Some sites allow you to set password hints. Often it is very easy to guess answers. In cases where password hints\n      are mandatory use random answers and record them in password manager (`Name of the first school: 6D-02-8B-!a-E8-8F-81`)\n\n  - point: Never answer online security questions truthfully\n    priority: Optional\n    details: >-\n      If a site asks security questions (such as place of birth, mother's maiden name or first car etc), don't provide\n      real answers. It is a trivial task for hackers to find out this information online or through social engineering.\n      Instead, create a fictitious answer, and store it inside your password manager. Using real-words is better than\n      random characters, [explained here](https://news.ycombinator.com/item?id=29244870)\n\n  - point: Don’t use a 4-digit PIN\n    priority: Optional\n    details: >-\n      Don’t use a short PIN to access your smartphone or computer. Instead, use a text password or much longer pin.\n      Numeric passphrases are easy crack, (A 4-digit pin has 10,000 combinations, compared to 7.4 million for a\n      4-character alpha-numeric code)\n\n  - point: Avoid using SMS for 2FA\n    priority: Optional\n    details: >-\n      When enabling multi-factor authentication, opt for app-based codes or a hardware token, if supported. SMS is\n      susceptible to a number of common threats, such as [SIM-swapping](https://www.maketecheasier.com/sim-card-hijacking)\n      and [interception](https://secure-voice.com/ss7_attacks). There's also no guarantee of how securely your phone\n      number will be stored, or what else it will be used for. From a practical point of view, SMS will only work when\n      you have signal, and can be slow. If a website or service requires the usage of a SMS number for recovery consider\n      purchasing a second pre-paid phone number only used for account recovery for these instances.\n\n  - point: Avoid using your PM to Generate OTPs\n    priority: Advanced\n    details: >-\n      Many password managers are also able to generate 2FA codes. It is best not to use your primary password manager\n      as your 2FA authenticator as well, since it would become a single point of failure if compromised. Instead use a\n      dedicated [authenticator app](https://github.com/Lissy93/awesome-privacy#2-factor-authentication) on your phone or laptop\n\n  - point: Avoid Face Unlock\n    priority: Advanced\n    details: >-\n      Most phones and laptops offer a facial recognition authentication feature, using the camera to compare a snapshot\n      of your face with a stored hash. It may be very convenient, but there are numerous ways to [fool it](https://www.forbes.com/sites/jvchamary/2017/09/18/security-apple-face-id-iphone-x/)\n      and gain access to the device, through digital photos and reconstructions from CCTV footage. Unlike your password-\n      there are likely photos of your face on the internet, and videos recorded by surveillance cameras\n\n  - point: Watch out for Keyloggers\n    priority: Advanced\n    details: >-\n      A hardware [keylogger](https://en.wikipedia.org/wiki/Hardware_keylogger) is a physical device planted between\n      your keyboard and the USB port, which intercepts all key strokes, and sometimes relays data to a remote server.\n      It gives a hacker access to everything typed, including passwords. The best way to stay protected, is just by\n      checking your USB connection after your PC has been unattended. It is also possible for keyloggers to be planted\n      inside the keyboard housing, so look for any signs that the case has been tampered with, and consider bringing your\n      own keyboard to work. Data typed on a virtual keyboard, pasted from the clipboard or auto-filled by a password\n      manager can not be intercepted by a hardware keylogger.\n\n  - point: Consider a Hardware Token\n    priority: Advanced\n    details: >-\n      A U2F/ FIDO2 security key is a USB (or NFC) device that you insert while logging in to an online service, in to\n      verify your identity, instead of entering a OTP from your authenticator. [SoloKey](https://solokeys.com) and\n      [NitroKey](https://www.nitrokey.com) are examples of such keys. They bring with them several security benefits,\n      since the browser communicates directly with the device and cannot be fooled as to which host is requesting\n      authentication, because the TLS certificate is checked. [This post](https://security.stackexchange.com/a/71704) is\n      a good explanation of the security of using FIDO U2F tokens. Of course it is important to store the physical key\n      somewhere safe, or keep it on your person. Some online accounts allow for several methods of 2FA to be enabled\n\n  - point: Consider Offline Password Manager\n    priority: Advanced\n    details: >-\n      For increased security, an encrypted offline password manager will give you full control over your data.\n      [KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass) is a popular choice, with lots of [plugins](https://[KeePass](https://awesome-privacy.xyz/essentials/password-managers/keepass).info/plugins.html) and\n      community forks with additional compatibility and functionality. Popular clients include: [KeePassXC](https://keepassxc.org)\n      (desktop), [KeePassDX](https://www.keepassdx.com) (Android) and [StrongBox](https://apps.apple.com/us/app/strongbox-password-safe/id897283731)\n      (iOS). The drawback being that it may be slightly less convenient for some, and it will be up to you to back it up,\n      and store it securely\n\n  - point: Consider Unique Usernames\n    priority: Advanced\n    details: >-\n      Having different passwords for each account is a good first step, but if you also use a unique username, email or\n      phone number to log in, then it will be significantly harder for anyone trying to gain unauthorised access. The easiest\n      method for multiple emails, is using auto-generated aliases for anonymous mail forwarding. This is where\n      [anything]@yourdomain.com will arrive in your inbox, allowing you to use a different email for each account (see\n      [Mail Alias Providers](https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding)). Usernames are easier,\n      since you can use your password manager to generate, store and auto-fill these. Virtual phone numbers can be generated\n      through your VOIP provider\n  softwareLinks:\n    - title: Password Managers\n      url: https://github.com/Lissy93/awesome-privacy#password-managers\n    - title: 2-Factor Authentication\n      url: https://github.com/Lissy93/awesome-privacy#2-factor-authentication\n\n- title: Web Browsing\n  slug: web-browsing\n  description: Avoiding tracking, censorship, and data collection online\n  icon: browser\n  intro: >-\n    Most websites on the internet will use some form of tracking, often to gain\n    insight into their users behaviour and preferences. This data can be incredibly\n    detailed, and so is extremely valuable to corporations, governments and intellectual\n    property thieves. Data breaches and leaks are common, and deanonymizing users web\n    activity is often a trivial task.\n\n\n    There are two primary methods of tracking; stateful (cookie-based), and stateless\n    (fingerprint-based). Cookies are small pieces of information, stored in your browser\n    with a unique ID that is used to identify you. Browser fingerprinting is a highly\n    accurate way to identify and track users wherever they go online. The information\n    collected is quite comprehensive, and often includes browser details, OS, screen\n    resolution, supported fonts, plugins, time zone, language and font preferences,\n    and even hardware configurations.\n\n\n    This section outlines the steps you can take, to be better protected from threats,\n    minimise online tracking and improve privacy.\n  checklist:\n  - point: Block Ads\n    priority: Essential\n    details: >-\n      Using an ad-blocker can help improve your privacy, by blocking the trackers that ads implement.\n      [uBlock Origin](https://awesome-privacy.xyz/networking/ad-blockers/ublock-origin) is a very\n      efficient and open source browser addon,\n      developed by Raymond Hill. When 3rd-party ads are displayed on a webpage, they have the ability to\n      track you, gathering personal information about you and your habits, which can then be sold, or used\n      to show you more targeted ads, and some ads are plain malicious or fake. Blocking ads also makes pages\n      load faster, uses less data and provides a less cluttered experience.\n\n  - point: Ensure Website is Legitimate\n    priority: Basic\n    details: >-\n      It may sound obvious, but when you logging into any online accounts, double check the URL is correct.\n      Storing commonly visited sites in your bookmarks is a good way to ensure the URL is easy to find. When\n      visiting new websites, look for common signs that it could be unsafe: Browser warnings, redirects,\n      on-site spam and pop-ups. You can also check a website using a tool, such as:\n      [Virus Total](https://awesome-privacy.xyz/security-tools/online-tools/virus-total),\n      [IsLegitSite](https://www.islegitsite.com), [Google Safe Browsing Status](https://transparencyreport.google.com/safe-browsing/search)\n      if you are unsure.\n\n  - point: Watch out for Browser Malware\n    priority: Basic\n    details: >-\n      Your system or browser can be compromised by spyware, miners, browser hijackers, malicious redirects,\n      adware etc. You can usually stay protected, just by: ignoring pop-ups, be wary of what your clicking,\n      don't proceed to a website if your browser warns you it may be malicious. Common signs of browser malware\n      include: default search engine or homepage has been modified, toolbars, unfamiliar extensions or icons,\n      significantly more ads, errors and pages loading much slower than usual. These articles from Heimdal\n      explain [signs of browser malware](https://heimdalsecurity.com/blog/warning-signs-operating-system-infected-malware),\n      [how browsers get infected](https://heimdalsecurity.com/blog/practical-online-protection-where-malware-hides)\n      and [how to remove browser malware](https://heimdalsecurity.com/blog/malware-removal).\n\n  - point: Use a Privacy-Respecting Browser\n    priority: Essential\n    details: >-\n      [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox) (with a few tweaks)\n      and [Brave](https://awesome-privacy.xyz/essentials/browsers/brave-browser)\n      are secure, private-respecting browsers. Both are fast, open source, user-friendly and available on all\n      major operating systems. Your browser has access to everything that you do online, so if possible, avoid\n      Google Chrome, Edge and Safari as (without correct configuration) all three of them, collect usage data,\n      call home and allow for invasive tracking. Firefox requires a few changes to achieve optimal security,\n      for example - [arkenfox](https://github.com/arkenfox/user.js/wiki) or [12byte](https://12bytes.org/firefox-configuration-guide-for-privacy-freaks-and-performance-buffs/)'s\n      user.js configs. See more: [Privacy Browsers](https://github.com/Lissy93/awesome-privacy#browsers).\n\n  - point: Use a Private Search Engine\n    priority: Essential\n    details: >-\n      Using a privacy-preserving, non-tracking search engine, will reduce risk that your search terms are not\n      logged, or used against you. Consider [DuckDuckGo](https://awesome-privacy.xyz/essentials/search-engines/duckduckgo),\n      or [Qwant](https://awesome-privacy.xyz/essentials/search-engines/qwant).\n      Google implements some [incredibly invasive](https://hackernoon.com/data-privacy-concerns-with-google-b946f2b7afea)\n      tracking policies, and have a history of displaying [biased search results](https://www.businessinsider.com/evidence-that-google-search-results-are-biased-2014-10).\n      Therefore Google, along with Bing, Baidu, Yahoo and Yandex are incompatible with anyone looking to protect\n      their privacy. It is recommended to update your [browsers default search](https://duckduckgo.com/install)\n      to a privacy-respecting search engine.\n\n  - point: Remove Unnecessary Browser Addons\n    priority: Essential\n    details: >-\n      Extensions are able to see, log or modify anything you do in the browser, and some innocent looking\n      browser apps, have malicious intentions. Websites can see which extensions you have installed, and may\n      use this to enhance your fingerprint, to more accurately identify/ track you. Both [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox) and Chrome\n      web stores allow you to check what permissions/access rights an extension requires before you install it.\n      Check the reviews. Only install extensions you really need, and removed those which you haven't used in a while.\n\n  - point: Keep Browser Up-to-date\n    priority: Essential\n    details: >-\n      Browser vulnerabilities are constantly being [discovered](https://cve.mitre.org/cgi-bin/cvekey.cgi?keyword=browser)\n      and patched, so it’s important to keep it up to date, to avoid a zero-day exploit. You can [see which browser\n      version you're using here](https://www.whatismybrowser.com/), or follow [this guide](https://www.whatismybrowser.com/guides/how-to-update-your-browser/)\n      for instructions on how to update. Some browsers will auto-update to the latest stable version.\n\n  - point: Check for HTTPS\n    priority: Essential\n    details: >-\n      If you enter information on a non-HTTPS website, this data is transported unencrypted and can therefore\n      be read by anyone who intercepts it. Do not enter any data on a non-HTTPS website, but also do not let\n      the green padlock give you a false sense of security, just because a website has SSL certificate, does\n      not mean that it is legitimate or trustworthy. [HTTPS-Everywhere](https://www.eff.org/https-everywhere)\n      (developed by the [EFF](https://www.eff.org/)) used to be a browser extension/addon that automatically\n      enabled HTTPS on websites, but as of 2022 is now deprecated. In their [accouncement article](https://www.eff.org/)\n      the EFF explains that most browsers now integrate such protections. Additionally, it provides instructions\n      for [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox), Chrome, Edge and Safari browsers on how to enable their HTTPS secure protections.\n\n  - point: Use DNS-over-HTTPS\n    priority: Essential\n    details: >-\n      Traditional DNS makes requests in plain text for everyone to see. It allows for eavesdropping and\n      manipulation of DNS data through man-in-the-middle attacks. Whereas DNS-over-HTTPS performs DNS\n      resolution via the HTTPS protocol, meaning data between you and your DNS resolver is encrypted.\n      A popular option is [CloudFlare](https://awesome-privacy.xyz/networking/dns-providers/cloudflare)'s [1.1.1.1](https://awesome-privacy.xyz/security-tools/mobile-apps/1.1.1.1), or compare providers- it is simple to enable in-browser.\n      Note that DoH comes with its own issues, mostly preventing web filtering.\n\n  - point: Multi-[Session](https://awesome-privacy.xyz/communication/encrypted-messaging/session) Containers\n    priority: Essential\n    details: >-\n      Compartmentalisation is really important to keep different aspects of your browsing separate. For\n      example, using different profiles for work, general browsing, social media, online shopping etc\n      will reduce the number associations that data brokers can link back to you. One option is to make\n      use of [Firefox Containers](https://awesome-privacy.xyz/security-tools/browser-extensions/firefox-multi-account-containers)\n      which is designed exactly for this purpose.\n      Alternatively, you could\n      use different browsers for different tasks\n      ([Brave](https://awesome-privacy.xyz/essentials/browsers/brave-browser),\n      [Firefox](https://awesome-privacy.xyz/essentials/browsers/firefox),\n      [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor) etc).\n\n  - point: Use Incognito\n    priority: Essential\n    details: >-\n      When using someone else's machine, ensure that you're in a private/ incognito session. This will\n      prevent browser history, cookies and some data being saved, but is not fool-proof- you can still\n      be tracked.\n\n  - point: Understand Your Browser Fingerprint\n    priority: Essential\n    details: >-\n      Browser Fingerprinting is an incredibly accurate method of tracking, where a website identifies you\n      based on your device information. You can view your fingerprint at amiunique.org- The aim is to be\n      as un-unique as possible.\n\n  - point: Manage Cookies\n    priority: Essential\n    details: >-\n      Clearing cookies regularly is one step you can take to help reduce websites from tracking you.\n      Cookies may also store your session token, which if captured, would allow someone to access your\n      accounts without credentials. To mitigate this you should clear cookies often.\n\n  - point: Block Third-Party Cookies\n    priority: Essential\n    details: >-\n      Third-party cookies placed on your device by a website other than the one you’re visiting. This\n      poses a privacy risk, as a 3rd entity can collect data from your current session. This guide explains\n      how you can disable 3rd-party cookies, and you can check here ensure this worked.\n\n  - point: Block Third-Party Trackers\n    priority: Essential\n    details: >-\n      Blocking trackers will help to stop websites, advertisers, analytics and more from tracking you in\n      the background. [Privacy Badger](https://awesome-privacy.xyz/security-tools/browser-extensions/privacy-badger),\n      [DuckDuckGo Privacy Essentials](https://awesome-privacy.xyz/security-tools/browser-extensions/privacy-essentials),\n      [uBlock Origin](https://awesome-privacy.xyz/networking/ad-blockers/ublock-origin) and uMatrix (advanced)\n      are all very effective, open source tracker-blockers available for all major browsers.\n\n  - point: Beware of Redirects\n    priority: Optional\n    details: >-\n      While some redirects are harmless, others, such as Unvalidated redirects are used in phishing attacks,\n      it can make a malicious link seem legitimate. If you are unsure about a redirect URL, you can check\n      where it forwards to with a tool like RedirectDetective.\n\n  - point: Do Not Sign Into Your Browser\n    priority: Optional\n    details: >-\n      Many browsers allow you to sign in, in order to sync history, bookmarks and other browsing data across\n      devices. However this not only allows for further data collection, but also increases attack surface\n      through providing another avenue for a malicious actor to get hold of personal information.\n\n  - point: Disallow Prediction Services\n    priority: Optional\n    details: >-\n      Some browsers allow for prediction services, where you receive real-time search results or URL auto-fill.\n      If this is enabled then data is sent to Google (or your default search engine) with every keypress,\n      rather than when you hit enter.\n\n  - point: Avoid G Translate for Webpages\n    priority: Optional\n    details: >-\n      When you visit a web page written in a foreign language, you may be prompted to install the Google Translate\n      extension. Be aware that Google collects all data (including input fields), along with details of the current\n      user. Instead use a translation service that is not linked to your browser.\n\n  - point: Disable Web Notifications\n    priority: Optional\n    details: >-\n      Browser push notifications are a common method for criminals to encourage you to click their link, since\n      it is easy to spoof the source. Be aware of this, and for instructions on disabling browser notifications,\n      see this article.\n\n  - point: Disable Automatic Downloads\n    priority: Optional\n    details: >-\n      Drive-by downloads is a common method of getting harmful files onto a users device. This can be mitigated\n      by disabling auto file downloads, and be cautious of websites which prompt you to download files unexpectedly.\n\n  - point: Disallow Access to Sensors\n    priority: Optional\n    details: >-\n      Mobile websites can tap into your device sensors without asking. If you grant these permissions to your\n      browser once, then all websites are able to use these capabilities, without permission or notification.\n\n  - point: Disallow Location\n    priority: Optional\n    details: >-\n      Location Services lets sites ask for your physical location to improve your experience. This should be\n      disabled in settings. Note that there are still other methods of determining your approximate location.\n\n  - point: Disallow Camera/ Microphone access\n    priority: Optional\n    details: >-\n      Check browser settings to ensure that no websites are granted access to webcam or microphone. It may also\n      be beneficial to use physical protection such as a webcam cover and microphone blocker.\n\n  - point: Disable Browser Password Saves\n    priority: Optional\n    details: >-\n      Do not allow your browser to store usernames and passwords. These can be easily viewed or accessed.\n      Instead use a password manager.\n\n  - point: Disable Browser Autofill\n    priority: Optional\n    details: >-\n      Turn off autofill for any confidential or personal details. This feature can be harmful if your browser\n      is compromised in any way. Instead, consider using your password manager's Notes feature.\n\n  - point: Protect from Exfil Attack\n    priority: Optional\n    details: >-\n      The CSS Exfiltrate attack is a method where credentials and other sensitive details can be snagged with\n      just pure CSS. You can stay protected,\n      with the [CSS Exfil Protection](https://awesome-privacy.xyz/security-tools/browser-extensions/css-exfil-protection) plugin.\n\n  - point: Deactivate ActiveX\n    priority: Optional\n    details: >-\n      ActiveX is a browser extension API that built into Microsoft IE, and enabled by default. It's not commonly\n      used anymore, but since it gives plugins intimate access rights, and can be dangerous, therefore you should\n      disable it.\n\n  - point: Disable WebRTC\n    priority: Optional\n    details: >-\n      WebRTC allows high-quality audio/video communication and peer-to-peer file-sharing straight from the\n      browser. However it can pose as a privacy leak. To learn more, check out this guide.\n\n  - point: Spoof HTML5 Canvas Sig\n    priority: Optional\n    details: >-\n      Canvas Fingerprinting allows websites to identify and track users very accurately. You can use the\n      Canvas-Fingerprint-Blocker extension to spoof your fingerprint or\n      use [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor).\n\n  - point: Spoof User Agent\n    priority: Optional\n    details: >-\n      The user agent tells the website what device, browser and version you are using. Switching user agent\n      periodically is one small step you can take to become less unique.\n\n  - point: Disregard DNT\n    priority: Optional\n    details: >-\n      Enabling Do Not Track has very limited impact, since many websites do not respect or follow this. Since\n      it is rarely used, it may also add to your signature, making you more unique.\n\n  - point: Prevent HSTS Tracking\n    priority: Optional\n    details: >-\n      HSTS was designed to help secure websites, but privacy concerns have been raised as it allowed site\n      operators to plant super-cookies. It can be disabled by visiting chrome://net-internals/#hsts in\n      Chromium-based browsers.\n\n  - point: Prevent Automatic Browser Connections\n    priority: Optional\n    details: >-\n      Even when you are not using your browser, it may call home to report on usage activity, analytics and\n      diagnostics. You may wish to disable some of this, which can be done through the settings.\n\n  - point: Enable 1st-Party Isolation\n    priority: Optional\n    details: >-\n      [First Party Isolation](https://awesome-privacy.xyz/security-tools/browser-extensions/first-party-isolation) means\n      that all identifier sources and browser state are scoped using the URL bar\n      domain, this can greatly reduce tracking.\n\n  - point: Strip Tracking Params from URLs\n    priority: Advanced\n    details: >-\n      Websites often append additional GET parameters to URLs that you click, to identify information like\n      source/referrer. You can sanitize manually,\n      or use an extension like [ClearURLs](https://awesome-privacy.xyz/security-tools/browser-extensions/clearurls) to strip tracking data\n      from URLs automatically.\n\n  - point: First Launch Security\n    priority: Advanced\n    details: >-\n      After installing a web browser, the first time you launch it (prior to configuring its privacy settings),\n      most browsers will call home. Therefore, after installing a browser, you should first disable your internet\n      connection, then configure privacy options before reenabling your internet connectivity.\n\n  - point: Use The Tor Browser\n    priority: Advanced\n    details: >-\n      The [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor) Project provides a browser that encrypts and routes your traffic through multiple nodes, keeping\n      users safe from interception and tracking. The main drawbacks are speed and user experience.\n\n  - point: Disable JavaScript\n    priority: Advanced\n    details: >-\n      Many modern web apps are JavaScript-based, so disabling it will greatly decrease your browsing experience.\n      But if you really want to go all out, then it will really reduce your attack surface.\n  softwareLinks:\n    - title: Privacy Browsers\n      url: https://github.com/Lissy93/awesome-privacy#browsers\n    - title: Search Engines\n      utl: https://github.com/Lissy93/awesome-privacy#search-engines\n    - title: Browser Extensions\n      url: https://github.com/Lissy93/awesome-privacy#browser-extensions\n    - title: Browser & Bookmark Sync\n      url: https://github.com/Lissy93/awesome-privacy#browser-sync\n  color: emerald\n\n- title: Email\n  slug: email\n  description: Protecting the gateway to your online accounts\n  icon: email\n  intro: >-\n    Nearly 50 years since the first email was sent, it's still very much a big part\n    of our day-to-day life, and will continue to be for the near future. So considering\n    how much trust we put in them, it's surprising how fundamentally insecure this\n    infrastructure is. Email-related fraud\n    [is on the up](https://www.csoonline.com/article/3247670/email/email-security-in-2018.html),\n    and without taking basic measures you could be at risk.\n    \n\n    If a hacker gets access to your emails, it provides a gateway for your other\n    accounts to be compromised (through password resets), therefore email security\n    is paramount for your digital safety.\n\n\n    The big companies providing \"free\" email service, don't have a good reputation\n    for respecting users privacy: Gmail was caught giving\n    [third parties full access](https://www.wsj.com/articles/techs-dirty-secret-the-app-developers-sifting-through-your-gmail-1530544442)\n    to user emails and also [tracking all of your purchases](https://www.cnbc.com/2019/05/17/google-gmail-tracks-purchase-history-how-to-delete-it.html).\n    Yahoo was also caught scanning emails in real-time [for US surveillance agencies](http://news.trust.org/item/20161004170601-99f8c)\n    Advertisers [were granted access](https://thenextweb.com/insider/2018/08/29/both-yahoo-and-aol-are-scanning-customer-emails-to-attract-advertisers)\n    to Yahoo and AOL users messages to “identify and segment potential customers by picking up on contextual buying signals, and past purchases.”\n\n  checklist:\n  - point: Have more than one email address\n    priority: Essential\n    details: >-\n      Consider using a different email address for security-critical communications from trivial mail such\n      as newsletters. This compartmentalization could reduce the amount of damage caused by a data breach,\n      and also make it easier to recover a compromised account.\n\n  - point: Keep Email Address Private\n    priority: Essential\n    details: >-\n      Do not share your primary email publicly, as mail addresses are often the starting point for most\n      phishing attacks.\n\n  - point: Keep your Account Secure\n    priority: Essential\n    details: >-\n      Use a long and unique password, enable 2FA and be careful while logging in. Your email account\n      provides an easy entry point to all your other online accounts for an attacker.\n\n  - point: Disable Automatic Loading of Remote Content\n    priority: Essential\n    details: >-\n      Email messages can contain remote content such as images or stylesheets, often automatically loaded\n      from the server. You should disable this, as it exposes your IP address and device information, and\n      is often used for tracking. For more info, see [this article](https://www.theverge.com/2019/7/3/20680903/email-pixel-trackers-how-to-stop-images-automatic-download).\n\n  - point: Use Plaintext\n    priority: Optional\n    details: >-\n      There are two main types of emails on the internet: plaintext and HTML. The former is strongly preferred\n      for privacy & security as HTML messages often include identifiers in links and inline images, which can\n      collect usage and personal data. There's also numerous risks of remote code execution targeting the HTML\n      parser of your mail client, which cannot be exploited if you are using plaintext. For more info, as well\n      as setup instructions for your mail provider, see [UsePlaintext.email](https://useplaintext.email/).\n\n  - point: Don’t connect third-party apps to your email account\n    priority: Optional\n    details: >-\n      If you give a third-party app or plug-in full access to your inbox, they effectively have full unhindered\n      access to all your emails and their contents, which poses significant security and privacy risks.\n\n  - point: Don't Share Sensitive Data via Email\n    priority: Optional\n    details: >-\n      Emails are very easily intercepted. Furthermore, you can’t be sure of how secure your recipient's\n      environment is. Therefore, emails cannot be considered safe for exchanging confidential information,\n      unless it is encrypted.\n\n  - point: Consider Switching to a Secure Mail Provider\n    priority: Optional\n    details: >-\n      Secure and reputable email providers such as [Forward Email](https://awesome-privacy.xyz/communication/encrypted-email/forward-email),\n      [ProtonMail](https://awesome-privacy.xyz/communication/mail-forwarding/protonmail),\n      and [Tutanota](https://awesome-privacy.xyz/communication/encrypted-email/tuta) allow for end-to-end\n      encryption, full privacy as well as more security-focused features. Unlike typical email providers, your\n      mailbox cannot be read by anyone but you, since all messages are encrypted.\n\n  - point: Use Smart Key\n    priority: Advanced\n    details: >-\n      OpenPGP does not support Forward secrecy, which means if either your or the recipient's private key is\n      ever stolen, all previous messages encrypted with it will be exposed. Therefore, you should take great\n      care to keep your private keys safe. One method of doing so, is to use a USB Smart Key to sign or decrypt\n      messages, allowing you to do so without your private key leaving the USB device.\n\n  - point: Use Aliasing / Anonymous Forwarding\n    priority: Advanced\n    details: >-\n      Email aliasing allows messages to be sent to [anything]@my-domain.com and still land in your primary inbox.\n      Effectively allowing you to use a different, unique email address for each service you sign up for. This means\n      if you start receiving spam, you can block that alias and determine which company leaked your email address.\n\n  - point: Subaddressing\n    priority: Optional\n    details: >-\n      An alternative to aliasing is subaddressing, where anything after the `+` symbol is omitted during mail delivery.\n      This enables you to keep track of who shared/ leaked your email address, but unlike aliasing, it will not protect\n      against your real address being revealed.\n\n  - point: Use a Custom Domain\n    priority: Advanced\n    details: >-\n      Using a custom domain means that you are not dependent on the address assigned by your mail provider. So you can\n      easily switch providers in the future and do not need to worry about a service being discontinued.\n\n  - point: Sync with a client for backup\n    priority: Advanced\n    details: >-\n      To avoid losing temporary or permanent access to your emails during an unplanned event (such as an outage or\n      account lock), Thunderbird can sync/ backup messages from multiple accounts via IMAP and store locally on your\n      primary device.\n\n  - point: Be Careful with Mail Signatures\n    priority: Advanced\n    details: >-\n      You do not know how secure of an email environment the recipient of your message may have. There are several\n      extensions that automatically crawl messages, and create a detailed database of contact information based upon\n      email signatures.\n\n  - point: Be Careful with Auto-Replies\n    priority: Advanced\n    details: >-\n      Out-of-office automatic replies are very useful for informing people there will be a delay in replying, but all\n      too often people reveal too much information- which can be used in social engineering and targeted attacks.\n\n  - point: Choose the Right Mail Protocol\n    priority: Advanced\n    details: >-\n      Do not use outdated protocols (below IMAPv4 or POPv3), both have known vulnerabilities and out-dated security.\n\n  - point: Self-Hosting\n    priority: Advanced\n    details: >-\n      Self-hosting your own mail server is not recommended for non-advanced users, since correctly securing it is\n      critical yet requires strong networking knowledge.\n\n  - point: Always use TLS Ports\n    priority: Advanced\n    details: >-\n      There are SSL options for POP3, IMAP, and SMTP as standard TCP/IP ports. They are easy to use, and widely\n      supported so should always be used instead of plaintext email ports.\n\n  - point: DNS Availability\n    priority: Advanced\n    details: >-\n      For self-hosted mail servers, to prevent DNS problems impacting availability- use at least 2 MX records, with\n      secondary and tertiary MX records for redundancy when the primary MX record fails.\n\n  - point: Prevent DDoS and Brute Force Attacks\n    priority: Advanced\n    details: >-\n      For self-hosted mail servers (specifically SMTP), limit your total number of simultaneous connections, and maximum\n      connection rate to reduce the impact of attempted bot attacks.\n\n  - point: Maintain IP Blacklist\n    priority: Advanced\n    details: >-\n      For self-hosted mail servers, you can improve spam filters and harden security, through maintaining an up-to-date\n      local IP blacklist and a spam URI realtime block lists to filter out malicious hyperlinks.\n  color: teal\n  softwareLinks:\n    - title: Secure Email Providers\n      url: https://github.com/Lissy93/awesome-privacy#encrypted-email\n    - title: Mail Forwarding\n      url: https://github.com/Lissy93/awesome-privacy#anonymous-mail-forwarding\n    - title: Pre-Configured Mail Servers\n      url: https://github.com/Lissy93/awesome-privacy#pre-configured-mail-servers\n    - title: Email Clients\n      url: https://github.com/Lissy93/awesome-privacy#email-clients\n\n- title: Messaging\n  slug: messaging\n  description: Keeping your communications private and secure\n  icon: messaging\n  intro: ''\n  checklist:\n  - point: Only Use Fully End-to-End Encrypted Messengers\n    priority: Essential\n    details: >-\n      End-to-end encryption is a system of communication where messages are encrypted on your device and\n      not decrypted until they reach the intended recipient. This ensures that any actor who intercepts\n      traffic cannot read the message contents, nor can anybody with access to the central servers where\n      data is stored.\n\n  - point: Use only Open Source Messaging Platforms\n    priority: Essential\n    details: >-\n      If code is open source then it can be independently examined and audited by anyone qualified to do\n      so, to ensure that there are no backdoors, vulnerabilities, or other security issues.\n\n  - point: Use a \"Trustworthy\" Messaging Platform\n    priority: Essential\n    details: >-\n      When selecting an encrypted messaging app, ensure it's fully open source, stable, actively maintained,\n      and ideally backed by reputable developers.\n\n  - point: Check Security Settings\n    priority: Essential\n    details: >-\n      Enable security settings, including contact verification, security notifications, and encryption.\n      Disable optional non-security features such as read receipt, last online, and typing notification.\n\n  - point: Ensure your Recipients Environment is Secure\n    priority: Essential\n    details: >-\n      Your conversation can only be as secure as the weakest link. Often the easiest way to infiltrate a\n      communications channel is to target the individual or node with the least protection.\n\n  - point: Disable Cloud Services\n    priority: Essential\n    details: >-\n      Some mobile messaging apps offer a web or desktop companion. This not only increases attack surface but\n      it has been linked to several critical security issues, and should therefore be avoided, if possible.\n\n  - point: Secure Group Chats\n    priority: Essential\n    details: >-\n      The risk of compromise rises exponentially, the more participants are in a group, as the attack surface\n      increases. Periodically check that all participants are legitimate.\n\n  - point: Create a Safe Environment for Communication\n    priority: Essential\n    details: >-\n      There are several stages where your digital communications could be monitored or intercepted. This includes:\n      your or your participants' device, your ISP, national gateway or government logging, the messaging provider,\n      the servers.\n\n  - point: Agree on a Communication Plan\n    priority: Optional\n    details: >-\n      In certain situations, it may be worth making a communication plan. This should include primary and backup\n      methods of securely getting in hold with each other.\n\n  - point: Strip Meta-Data from Media\n    priority: Optional\n    details: >-\n      Metadata is \"Data about Data\" or additional information attached to a file or transaction. When you send a\n      photo, audio recording, video, or document you may be revealing more than you intended to.\n\n  - point: Defang URLs\n    priority: Optional\n    details: >-\n      Sending links via various services can unintentionally expose your personal information. This is because,\n      when a thumbnail or preview is generated- it happens on the client-side.\n\n  - point: Verify your Recipient\n    priority: Optional\n    details: >-\n      Always ensure you are talking to the intended recipient, and that they have not been compromised. One method\n      for doing so is to use an app which supports contact verification.\n\n  - point: Enable Ephemeral Messages\n    priority: Optional\n    details: >-\n      Self-destructing messages is a feature that causes your messages to automatically delete after a set amount\n      of time. This means that if your device is lost, stolen, or seized, an adversary will only have access to the\n      most recent communications.\n\n  - point: Avoid SMS\n    priority: Optional\n    details: >-\n      SMS may be convenient, but it's not secure. It is susceptible to threats such as interception, sim swapping,\n      manipulation, and malware.\n\n  - point: Watch out for Trackers\n    priority: Optional\n    details: >-\n      Be wary of messaging applications with trackers, as the detailed usage statistics they collect are often very\n      invasive, and can sometimes reveal your identity as well as personal information that you would otherwise not\n      intend to share.\n\n  - point: Consider Jurisdiction\n    priority: Advanced\n    details: >-\n      The jurisdictions where the organisation is based, and data is hosted should also be taken into account.\n\n  - point: Use an Anonymous Platform\n    priority: Advanced\n    details: >-\n      If you believe you may be targeted, you should opt for an anonymous messaging platform that does not require\n      a phone number, or any other personally identifiable information to sign up or use.\n\n  - point: Ensure Forward Secrecy is Supported\n    priority: Advanced\n    details: >-\n      Opt for a platform that implements forward secrecy. This is where your app generates a new encryption key\n      for every message.\n\n  - point: Consider a Decentralized Platform\n    priority: Advanced\n    details: >-\n      If all data flows through a central provider, you have to trust them with your data and meta-data. You cannot\n      verify that the system running is authentic without back doors.\n  softwareLinks:\n    - title: Secure Messaging Apps\n      url: https://github.com/Lissy93/awesome-privacy#encrypted-messaging\n    - title: P2P Messaging Platforms\n      url: https://github.com/Lissy93/awesome-privacy#p2p-messaging\n  color: cyan\n\n- title: Social Media\n  slug: social-media\n  description: Minimizing the risks associated with using online communities\n  icon: social\n  intro: >\n    Online communities have existed since the invention of the internet, and give\n    people around the world the opportunity to connect, communicate and share.\n    Although these networks are a great way to promote social interaction and\n    bring people together, that have a dark side - there are some serious\n    [Privacy Concerns with Social Networking Services](https://en.wikipedia.org/wiki/Privacy_concerns_with_social_networking_services),\n    and these social networking sites are owned by private corporations,\n    and that they make their money by collecting data about individuals and\n    selling that data on, often to third party advertisers.\n\n    Secure your account, lock down your privacy settings, but know that even\n    after doing so, all data intentionally and non-intentionally uploaded is\n    effectively public. If possible, avoid using conventional social media networks.\n  checklist:\n  - point: Secure your Account\n    priority: Essential\n    details: >-\n      Social media profiles get stolen or taken over all too often. To protect your account: use a unique\n      and strong password, and enable 2-factor authentication.\n\n  - point: Check Privacy Settings\n    priority: Essential\n    details: >-\n      Most social networks allow you to control your privacy settings. Ensure that you are comfortable with\n      what data you are currently exposing and to whom.\n\n  - point: Think of All Interactions as Public\n    priority: Essential\n    details: >-\n      There are still numerous methods of viewing a users 'private' content across many social networks.\n      Therefore, before uploading, posting or commenting on anything, think \"Would I mind if this was totally public?\"\n\n  - point: Think of All Interactions as Permanent\n    priority: Essential\n    details: >-\n      Pretty much every post, comment, photo etc is being continuously backed up by a myriad of third-party\n      services, who archive this data and make it indexable and publicly available almost forever.\n\n  - point: Don't Reveal too Much\n    priority: Essential\n    details: >-\n      Profile information creates a goldmine of info for hackers, the kind of data that helps them personalize\n      phishing scams. Avoid sharing too much detail (DoB, Hometown, School etc).\n\n  - point: Be Careful what you Upload\n    priority: Essential\n    details: >-\n      Status updates, comments, check-ins and media can unintentionally reveal a lot more than you intended\n      them to. This is especially relevant to photos and videos, which may show things in the background.\n\n  - point: Don't Share Email or Phone Number\n    priority: Essential\n    details: >-\n      Posting your real email address or mobile number, gives hackers, trolls and spammers more munition to\n      use against you, and can also allow separate aliases, profiles or data points to be connected.\n\n  - point: Don't Grant Unnecessary Permissions\n    priority: Essential\n    details: >-\n      By default many of the popular social networking apps will ask for permission to access your contacts,\n      call log, location, messaging history etc. If they don’t need this access, don’t grant it.\n\n  - point: Be Careful of 3rd-Party Integrations\n    priority: Essential\n    details: >-\n      Avoid signing up for accounts using a Social Network login, revoke access to social apps you no longer\n      use.\n\n  - point: Avoid Publishing Geo Data while still Onsite\n    priority: Essential\n    details: >-\n      If you plan to share any content that reveals a location, then wait until you have left that place.\n      This is particularly important when you are taking a trip, at a restaurant, campus, hotel/resort, public\n      building or airport.\n\n  - point: Remove metadata before uploading media\n    priority: Optional\n    details: >-\n      Most smartphones and some cameras automatically attach a comprehensive set of additional data (called\n      EXIF data) to each photograph. Remove this data before uploading.\n\n  - point: Implement Image Cloaking\n    priority: Advanced\n    details: >-\n      Tools like Fawkes can be used to very subtly, slightly change the structure of faces within photos in a\n      way that is imperceptible by humans, but will prevent facial recognition systems from being able to recognize\n      a given face.\n\n  - point: Consider Spoofing GPS in home vicinity\n    priority: Advanced\n    details: >-\n      Even if you yourself never use social media, there is always going to be others who are not as careful,\n      and could reveal your location.\n\n  - point: Consider False Information\n    priority: Advanced\n    details: >-\n      If you just want to read, and do not intend on posting too much- consider using an alias name, and false\n      contact details.\n\n  - point: Don’t have any social media accounts\n    priority: Advanced\n    details: >-\n      Social media is fundamentally un-private, so for maximum online security and privacy, avoid using any\n      mainstream social networks.\n\n  softwareLinks:\n    - title: Alternative Social Media\n      url: https://github.com/Lissy93/awesome-privacy#social-networks\n    - title: Alternative Video Platforms\n      url: https://github.com/Lissy93/awesome-privacy#video-platforms\n    - title: Alternative Blogging Platforms\n      url: https://github.com/Lissy93/awesome-privacy#blogging-platforms\n    - title: News Readers and Aggregation\n      url: https://github.com/Lissy93/awesome-privacy#news-readers-and-aggregation\n  color: blue\n\n- title: Networks\n  slug: networks\n  description: Safeguarding your network traffic\n  icon: network\n  intro: >\n    This section covers how you connect your devices to the internet securely,\n    including configuring your router and setting up a VPN.\n  checklist:\n  - point: Use a VPN\n    priority: Essential\n    details: >-\n      Use a reputable, paid-for VPN. This can help protect sites you visit from logging your real IP, reduce\n      the amount of data your ISP can collect, and increase protection on public WiFi.\n\n  - point: Change your Router Password\n    priority: Essential\n    details: >-\n      After getting a new router, change the password. Default router passwords are publicly available,\n      meaning anyone within proximity would be able to connect.\n\n  - point: Use WPA2, and a strong password\n    priority: Essential\n    details: >-\n      There are different authentication protocols for connecting to WiFi. Currently, the most secure options\n      are WPA2 and WPA3 (on newer routers).\n\n  - point: Keep router firmware up-to-date\n    priority: Essential\n    details: >-\n      Manufacturers release firmware updates that fix security vulnerabilities, implement new standards, and\n      sometimes add features or improve the performance of your router.\n\n  - point: Implement a Network-Wide VPN\n    priority: Optional\n    details: >-\n      If you configure your VPN on your router, firewall, or home server, then traffic from all devices will\n      be encrypted and routed through it, without needing individual VPN apps.\n\n  - point: Protect against DNS leaks\n    priority: Optional\n    details: >-\n      When using a VPN, it is extremely important to exclusively use the DNS server of your VPN provider or\n      secure service.\n\n  - point: Use a secure VPN Protocol\n    priority: Optional\n    details: >-\n      OpenVPN and WireGuard are open source, lightweight, and secure tunneling protocols. Avoid using PPTP\n      or SSTP.\n\n  - point: Secure DNS\n    priority: Optional\n    details: >-\n      Use DNS-over-HTTPS which performs DNS resolution via the HTTPS protocol, encrypting data between you\n      and your DNS resolver.\n\n  - point: Avoid the free router from your ISP\n    priority: Optional\n    details: >-\n      Typically they’re manufactured cheaply in bulk in China, with insecure propriety firmware that doesn't\n      receive regular security updates.\n\n  - point: Whitelist MAC Addresses\n    priority: Optional\n    details: >-\n      You can whitelist MAC addresses in your router settings, disallowing any unknown devices to immediately\n      connect to your network, even if they know your credentials.\n\n  - point: Change the Router’s Local IP Address\n    priority: Optional\n    details: >-\n      It is possible for a malicious script in your web browser to exploit a cross-site scripting vulnerability,\n      accessing known-vulnerable routers at their local IP address and tampering with them.\n\n  - point: Don't Reveal Personal Info in SSID\n    priority: Optional\n    details: >-\n      You should update your network name, choosing an SSID that does not identify you, include your flat\n      number/address, and does not specify the device brand/model.\n\n  - point: Opt-Out Router Listings\n    priority: Optional\n    details: >-\n      WiFi SSIDs are scanned, logged, and then published on various websites, which is a serious privacy\n      concern for some.\n\n  - point: Hide your SSID\n    priority: Optional\n    details: >-\n      Your router's Service Set Identifier is simply the network name. If it is not visible, it may receive\n      less abuse.\n\n  - point: Disable WPS\n    priority: Optional\n    details: >-\n      Wi-Fi Protected Setup provides an easier method to connect, without entering a long WiFi password, but\n      WPS introduces a series of major security issues.\n\n  - point: Disable UPnP\n    priority: Optional\n    details: >-\n      Universal Plug and Play allows applications to automatically forward a port on your router, but it has\n      a long history of serious security issues.\n\n  - point: Use a Guest Network for Guests\n    priority: Optional\n    details: >-\n      Do not grant access to your primary WiFi network to visitors, as it enables them to interact with other\n      devices on the network.\n\n  - point: Change your Router's Default IP\n    priority: Optional\n    details: >-\n      Modifying your router admin panel's default IP address will make it more difficult for malicious scripts\n      targeting local IP addresses.\n\n  - point: Kill unused processes and services on your router\n    priority: Optional\n    details: >-\n      Services like Telnet and SSH that provide command-line access to devices should never be exposed to the\n      internet and should also be disabled on the local network unless they're actually needed.\n\n  - point: Don't have Open Ports\n    priority: Optional\n    details: >-\n      Close any open ports on your router that are not needed. Open ports provide an easy entrance for hackers.\n\n  - point: Disable Unused Remote Access Protocols\n    priority: Optional\n    details: >-\n      When protocols such as PING, Telnet, SSH, UPnP, and HNAP etc are enabled, they allow your router to be\n      probed from anywhere in the world.\n\n  - point: Disable Cloud-Based Management\n    priority: Optional\n    details: >-\n      You should treat your router's admin panel with the utmost care, as considerable damage can be caused\n      if an attacker is able to gain access.\n\n  - point: Manage Range Correctly\n    priority: Optional\n    details: >-\n      It's common to want to pump your router's range to the max, but if you reside in a smaller flat, your\n      attack surface is increased when your WiFi network can be picked up across the street.\n\n  - point: Route all traffic through [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor)\n    priority: Advanced\n    details: >-\n      VPNs have their weaknesses. For increased security, route all your internet traffic through the [Tor](https://awesome-privacy.xyz/networking/mix-networks/tor)\n      network.\n\n  - point: Disable WiFi on all Devices\n    priority: Advanced\n    details: >-\n      Connecting to even a secure WiFi network increases your attack surface. Disabling your home WiFi and\n      connect each device via Ethernet.\n  color: violet\n  softwareLinks:\n  - title: Virtual Private Networks\n    url: https://github.com/Lissy93/awesome-privacy#virtual-private-networks\n  - title: Mix Networks\n    url: https://github.com/Lissy93/awesome-privacy#mix-networks\n  - title: Router Firmware\n    url: https://github.com/Lissy93/awesome-privacy#router-firmware\n  - title: Open Source Proxies\n    url: https://github.com/Lissy93/awesome-privacy#proxies\n  - title: DNS Providers\n    url: https://github.com/Lissy93/awesome-privacy#dns\n  - title: Firewalls\n    url: https://github.com/Lissy93/awesome-privacy#firewalls\n  - title: Network Analysis Tools\n    url: https://github.com/Lissy93/awesome-privacy#network-analysis\n  - title: Self-Hosted Network Security Tools\n    url: https://github.com/Lissy93/awesome-privacy#self-hosted-network-security\n\n- title: Mobile Devices\n  slug: mobile-devices\n  description: Reduce invasive tracking for cells, smartphones and tablets\n  icon: mobile\n  intro: >\n    Smart phones have revolutionized so many aspects of life and brought the world\n    to our fingertips. For many of us, smart phones are our primary means of communication,\n    entertainment and access to knowledge. But while they've brought convenience\n    to whole new level, there's some ugly things going on behind the screen.\n\n    Geo-tracking is used to trace our every move, and we have little control over\n    who has this data- your phone is even able to\n    [track your location without GPS](https://gizmodo.com/how-to-track-a-cellphone-without-gps-or-consent-1821125371).\n    Over the years numerous reports that surfaced, outlining ways in which your\n    phone's [mic can eavesdrop](https://www.independent.co.uk/life-style/gadgets-and-tech/news/smartphone-apps-listening-privacy-alphonso-shazam-advertising-pool-3d-honey-quest-a8139451.html),\n    and the [camera can watch you](https://www.businessinsider.com/hackers-governments-smartphone-iphone-camera-wikileaks-cybersecurity-hack-privacy-webcam-2017-6)- all without your knowledge or consent.\n    And then there's the malicious apps, lack of security patches and potential/ likely backdoors.\n\n    Using a smart phone generates a lot of data about you- from information you\n    intentionally share, to data silently generated from your actions.\n    It can be scary to see what Google, Microsoft, Apple and Facebook know about\n    us- sometimes they know more than our closest family. It's hard to comprehend\n    what your data will reveal, especially in conjunction with other data.\n\n    This data is used for\n    [far more than just advertising](https://internethealthreport.org/2018/the-good-the-bad-and-the-ugly-sides-of-data-tracking/) -\n    more often it's used to rate people for finance, insurance and employment.\n    Targeted ads can even be used for fine-grained surveillance (see [ADINT](https://adint.cs.washington.edu))\n\n    More of us are concerned about how\n    [governments use collect and use our smart phone data](https://www.statista.com/statistics/373916/global-opinion-online-monitoring-government/),\n    and rightly so, federal agencies often\n    [request our data from Google](https://www.statista.com/statistics/273501/global-data-requests-from-google-by-federal-agencies-and-governments/),\n    [Facebook](https://www.statista.com/statistics/287845/global-data-requests-from-facebook-by-federal-agencies-and-governments/),\n    Apple, Microsoft, Amazon, and other tech companies. Sometimes requests are\n    made in bulk, returning detailed information on everybody within a certain geo-fence,\n    [often for innocent people](https://www.nytimes.com/interactive/2019/04/13/us/google-location-tracking-police.html).\n    And this doesn't include all of the internet traffic that intelligence agencies around the world have unhindered access to.\n  checklist:\n  - point: Encrypt your Device\n    priority: Essential\n    details: >-\n      In order to keep your data safe from physical access, use file encryption. This will mean if your\n      device is lost or stolen, no one will have access to your data.\n\n  - point: Turn off connectivity features that aren’t being used\n    priority: Essential\n    details: >-\n      When you're not using WiFi, Bluetooth, NFC etc, turn those features off. There are several common threats\n      that utilise these features.\n\n  - point: Keep app count to a minimum\n    priority: Essential\n    details: >-\n      Uninstall apps that you don’t need or use regularly. As apps often run in the background, slowing your\n      device down, but also collecting data.\n\n  - point: App Permissions\n    priority: Essential\n    details: >-\n      Don’t grant apps permissions that they don’t need. For Android, [Bouncer](https://awesome-privacy.xyz/security-tools/mobile-apps/bouncer) is an app that allows you to grant\n      temporary/ 1-off permissions.\n\n  - point: Only install Apps from official source\n    priority: Essential\n    details: >-\n      Applications on Apple App Store and Google Play Store are scanned and cryptographically signed, making them\n      less likely to be malicious.\n\n  - point: Be Careful of Phone Charging Threats\n    priority: Optional\n    details: >-\n      Juice Jacking is when hackers use public charging stations to install malware on your smartphone or tablet\n      through a compromised USB port.\n\n  - point: Set up a mobile carrier PIN\n    priority: Essential\n    details: >-\n      SIM hijacking is when a hacker is able to get your mobile number transferred to their sim. The easiest way\n      to protect against this is to set up a PIN through your mobile provider.\n\n  - point: Opt-out of Caller ID Listings\n    priority: Optional\n    details: >-\n      To keep your details private, you can unlist your number from caller ID apps like TrueCaller, CallApp, SyncMe,\n      and Hiya.\n\n  - point: Use Offline Maps\n    priority: Optional\n    details: >-\n      Consider using an offline maps app, such as OsmAnd or Organic Maps, to reduce data leaks from map apps.\n\n  - point: Opt-out of personalized ads\n    priority: Optional\n    details: >-\n      You can slightly reduce the amount of data collected by opting-out of seeing personalized ads.\n\n  - point: Erase after too many login attempts\n    priority: Optional\n    details: >-\n      To protect against an attacker brute forcing your pin, set your device to erase after too many failed\n      login attempts.\n\n  - point: Monitor Trackers\n    priority: Optional\n    details: >-\n      [εxodus](https://awesome-privacy.xyz/security-tools/online-tools/εxodus) is a great service which\n      lets you search for any app and see which trackers are embedded in it.\n\n  - point: Use a Mobile Firewall\n    priority: Optional\n    details: >-\n      To prevent applications from leaking privacy-sensitive data, you can install a firewall app.\n\n  - point: Reduce Background Activity\n    priority: Optional\n    details: >-\n      For Android, SuperFreeze makes it possible to entirely freeze all background activities on a per-app basis.\n\n  - point: Sandbox Mobile Apps\n    priority: Optional\n    details: >-\n      Prevent permission-hungry apps from accessing your private data with [Island](https://awesome-privacy.xyz/security-tools/mobile-apps/island), a sandbox environment.\n\n  - point: Tor Traffic\n    priority: Advanced\n    details: >-\n      [Orbot](https://awesome-privacy.xyz/security-tools/mobile-apps/orbot) provides\n      a system-wide Tor connection, which will help protect you from surveillance and public WiFi threats.\n\n  - point: Avoid Custom Virtual Keyboards\n    priority: Optional\n    details: >-\n      It is recommended to stick with your device's stock keyboard. If you choose to use a third-party keyboard app,\n      ensure it is reputable.\n\n  - point: Restart Device Regularly\n    priority: Optional\n    details: >-\n      Restarting your phone at least once a week will clear the app state cached in memory and may run more smoothly\n      after a restart.\n\n  - point: Avoid SMS\n    priority: Optional\n    details: >-\n      SMS should not be used to receive 2FA codes or for communication, instead use an encrypted messaging app,\n      such as [Signal](https://awesome-privacy.xyz/communication/encrypted-messaging/signal).\n\n  - point: Keep your Number Private\n    priority: Optional\n    details: >-\n      [MySudo](https://awesome-privacy.xyz/finance/virtual-credit-cards/mysudo) allows\n      you to create and use virtual phone numbers for different people or groups. This is great for\n      compartmentalisation.\n\n  - point: Watch out for Stalkerware\n    priority: Optional\n    details: >-\n      Stalkerware is malware that is installed directly onto your device by someone you know.\n      The best way to get rid of it is through a factory reset.\n\n  - point: Favor the Browser, over Dedicated App\n    priority: Optional\n    details: >-\n      Where possible, consider using a secure browser to access sites,\n      rather than installing dedicated applications.\n\n  - point: Consider running a custom ROM (Android)\n    priority: Advanced\n    details: >-\n      If you're concerned about your device manufacturer collecting too much\n      personal information, consider a privacy-focused custom ROM.\n  color: fuchsia\n  softwareLinks:\n  - title: Mobile Apps, for Security + Privacy\n    url: https://github.com/Lissy93/awesome-privacy#mobile-apps\n  - title: Encrypted Messaging\n    url: https://github.com/Lissy93/awesome-privacy#encrypted-messaging\n  - title: Mobile Operation Systems\n    url: https://github.com/Lissy93/awesome-privacy#mobile-operating-systems\n\n- title: Personal Computers\n  slug: personal-computers\n  description: Securing your PC's operating system, data & activity\n  icon: computer\n  intro: >\n    Although Windows and OS X are easy to use and convenient, they both are far from secure.\n    Your OS provides the interface between hardware and your applications, so if\n    compromised can have detrimental effects.\n  checklist:\n  - point: Keep your System up-to-date\n    priority: Essential\n    details: >-\n      System updates contain fixes/patches for security issues, improve performance, and sometimes add new\n      features. Install new updates when prompted.\n\n  - point: Encrypt your Device\n    priority: Essential\n    details: >-\n      Use BitLocker for Windows, FileVault on MacOS, or LUKS on Linux, to enable full disk encryption. This\n      prevents unauthorized access if your computer is lost or stolen.\n\n  - point: Backup Important Data\n    priority: Essential\n    details: >-\n      Maintaining encrypted backups prevents loss due to ransomware, theft, or damage. Consider using\n      [Cryptomator](https://awesome-privacy.xyz/security-tools/mobile-apps/cryptomator)\n      for cloud files or [VeraCrypt](https://awesome-privacy.xyz/essentials/file-encryption/veracrypt) for USB drives.\n\n  - point: Be Careful Plugging USB Devices into your Computer\n    priority: Essential\n    details: >-\n      USB devices can pose serious threats. Consider making a USB sanitizer with CIRCLean to safely check USB\n      devices.\n\n  - point: Activate Screen-Lock when Idle\n    priority: Essential\n    details: >-\n      Lock your computer when away and set it to require a password on resume from screensaver or sleep to\n      prevent unauthorized access.\n\n  - point: Disable Cortana or Siri\n    priority: Essential\n    details: >-\n      Voice-controlled assistants can have privacy implications due to data sent back for processing. Disable\n      or limit their listening capabilities.\n\n  - point: Review your Installed Apps\n    priority: Essential\n    details: >-\n      Keep installed applications to a minimum to reduce exposure to vulnerabilities and regularly clear\n      application caches.\n\n  - point: Manage Permissions\n    priority: Essential\n    details: >-\n      Control which apps have access to your location, camera, microphone, contacts, and other sensitive\n      information.\n\n  - point: Disallow Usage Data from being sent to the Cloud\n    priority: Essential\n    details: >-\n      Limit the amount of usage information or feedback sent to the cloud to protect your privacy.\n\n  - point: Avoid Quick Unlock\n    priority: Essential\n    details: >-\n      Use a strong password instead of biometrics or short PINs for unlocking your computer to enhance\n      security.\n\n  - point: Power Off Computer, instead of Standby\n    priority: Essential\n    details: >-\n      Shut down your device when not in use, especially if your disk is encrypted, to keep data secure.\n\n  - point: Don't link your PC with your Microsoft or Apple Account\n    priority: Optional\n    details: >-\n      Use a local account only to prevent data syncing and exposure. Avoid using sync services that compromise\n      privacy.\n\n  - point: Check which Sharing Services are Enabled\n    priority: Optional\n    details: >-\n      Disable network sharing features you are not using to close gateways to common threats.\n\n  - point: Don't use Root/Admin Account for Non-Admin Tasks\n    priority: Optional\n    details: >-\n      Use an unprivileged user account for daily tasks and only elevate permissions for administrative changes\n      to mitigate vulnerabilities.\n\n  - point: Block Webcam + Microphone\n    priority: Optional\n    details: >-\n      Cover your webcam when not in use and consider blocking unauthorized audio recording to protect privacy.\n\n  - point: Use a Privacy Filter\n    priority: Optional\n    details: >-\n      Use a screen privacy filter in public spaces to prevent shoulder surfing and protect sensitive\n      information.\n\n  - point: Physically Secure Device\n    priority: Optional\n    details: >-\n      Use a Kensington Lock to secure your laptop in public spaces and consider port locks to prevent\n      unauthorized physical access.\n\n  - point: Don't Charge Devices from your PC\n    priority: Optional\n    details: >-\n      Use a power bank or AC wall charger instead of your PC to avoid security risks associated with USB\n      connections.\n\n  - point: Randomize your hardware address on Wi-Fi\n    priority: Optional\n    details: >-\n      Modify or randomize your MAC address to protect against tracking across different WiFi networks.\n\n  - point: Use a Firewall\n    priority: Optional\n    details: >-\n      Install a firewall app to monitor and block unwanted internet access by certain applications, protecting\n      against remote access attacks and privacy breaches.\n\n  - point: Protect Against Software Keyloggers\n    priority: Optional\n    details: >-\n      Use key stroke encryption tools to protect against software keyloggers recording your keystrokes.\n\n  - point: Check Keyboard Connection\n    priority: Optional\n    details: >-\n      Be vigilant for hardware keyloggers when using public or unfamiliar computers by checking keyboard\n      connections.\n\n  - point: Prevent Keystroke Injection Attacks\n    priority: Optional\n    details: >-\n      Lock your PC when away and consider using USBGuard or similar tools to protect against keystroke\n      injection attacks.\n\n  - point: Don't use commercial \"Free\" Anti-Virus\n    priority: Optional\n    details: >-\n      Rely on built-in security tools and avoid free anti-virus applications due to their potential for\n      privacy invasion and data collection.\n\n  - point: Periodically check for Rootkits\n    priority: Advanced\n    details: >-\n      Regularly check for rootkits to detect and mitigate full system control threats using tools like\n      [chkrootkit](https://awesome-privacy.xyz/operating-systems/linux-defenses/chkrootkit).\n\n  - point: BIOS Boot Password\n    priority: Advanced\n    details: >-\n      Enable a BIOS or UEFI password to add an additional security layer during boot-up, though be aware of\n      its limitations.\n\n  - point: Use a Security-Focused Operating System\n    priority: Advanced\n    details: >-\n      Consider switching to Linux or a security-focused distro like QubeOS or\n      [Tails](https://awesome-privacy.xyz/operating-systems/desktop-operating-systems/tails)\n      for enhanced privacy and\n      security.\n\n  - point: Make Use of VMs\n    priority: Advanced\n    details: >-\n      Use virtual machines for risky activities or testing suspicious software to isolate potential threats\n      from your primary system.\n\n  - point: Compartmentalize\n    priority: Advanced\n    details: >-\n      Isolate different programs and data sources from one another as much as possible to limit the extent of\n      potential breaches.\n\n  - point: Disable Undesired Features (Windows)\n    priority: Advanced\n    details: >-\n      Disable unnecessary Windows \"features\" and services that run in the background to reduce data collection\n      and resource use.\n\n  - point: Secure Boot\n    priority: Advanced\n    details: >-\n      Ensure that Secure Boot is enabled to prevent malware from replacing your boot loader and other critical\n      software.\n\n  - point: Secure SSH Access\n    priority: Advanced\n    details: >-\n      Take steps to protect SSH access from attacks by changing the default port, using SSH keys, and\n      configuring firewalls.\n\n  - point: Close Un-used Open Ports\n    priority: Advanced\n    details: >-\n      Turn off services listening on external ports that are not needed to protect against remote exploits and\n      improve security.\n\n  - point: Implement Mandatory Access Control\n    priority: Advanced\n    details: >-\n      Restrict privileged access to limit the damage that can be done if a system is compromised.\n\n  - point: Use Canary Tokens\n    priority: Advanced\n    details: >-\n      Deploy canary tokens to detect unauthorized access to your files or emails faster and gather\n      information about the intruder.\n  color: pink\n  softwareLinks:\n  - title: Secure Operating Systems\n    url: https://github.com/Lissy93/awesome-privacy#desktop-operating-systems\n  - title: Linux Defenses\n    url: https://github.com/Lissy93/awesome-privacy#linux-defences\n  - title: Windows Defenses\n    url: https://github.com/Lissy93/awesome-privacy#windows-defences\n  - title: Mac OS Defenses\n    url: https://github.com/Lissy93/awesome-privacy#mac-os-defences\n  - title: Anti-Malware\n    url: https://github.com/Lissy93/awesome-privacy#anti-malware\n  - title: Firewalls\n    url: https://github.com/Lissy93/awesome-privacy#firewalls-1\n  - title: File Encryption\n    url: https://github.com/Lissy93/awesome-privacy#file-encryption\n\n- title: Smart Home\n  slug: smart-home\n  description: Using IoT devices without compromising your privacy\n  icon: home\n  intro: >-\n    Home assistants (such as Google Home, Alexa and Siri) and other internet connected\n    devices collect large amounts of personal data (including voice samples, location data,\n    home details and logs of all interactions). Since you have limited control on what is\n    being collected, how it's stored, and what it will be used for, this makes it hard to\n    recommend any consumer smart-home products to anyone who cares about privacy and security.\n\n    Security vs Privacy: There are many smart devices on the market that claim to increase\n    the security of your home while being easy and convenient to use (Such as Smart Burglar\n    Alarms, Internet Security Cameras, Smart Locks and Remote access Doorbells to name a few).\n    These devices may appear to make security easier, but there is a trade-off in terms of\n    privacy: as they collect large amounts of personal data, and leave you without control\n    over how this is stored or used. The security of these devices is also questionable,\n    since many of them can be (and are being) hacked, allowing an intruder to bypass\n    detection with minimum effort.\n\n    The most privacy-respecting option, would be to not use \"smart\" internet-connected\n    devices in your home, and not to rely on a security device that requires an internet\n    connection. But if you do, it is important to fully understand the risks of any given\n    product, before buying it. Then adjust settings to increase privacy and security.\n    The following checklist will help mitigate the risks associated with\n    internet-connected home devices.\n  checklist:\n  - point: Rename devices to not specify brand/model\n    priority: Essential\n    details: >-\n      Change default device names to something generic to prevent targeted attacks by obscuring brand or model information.\n\n  - point: Disable microphone and camera when not in use\n    priority: Essential\n    details: >-\n      Use hardware switches to turn off microphones and cameras on smart devices to protect against accidental recordings or targeted access.\n\n  - point: Understand what data is collected, stored and transmitted\n    priority: Essential\n    details: >-\n      Research and ensure comfort with the data handling practices of smart home devices before purchase, avoiding devices that share data with third parties.\n\n  - point: Set privacy settings, and opt out of sharing data with third parties\n    priority: Essential\n    details: >-\n      Adjust app settings for strictest privacy controls and opt-out of data sharing with third parties wherever possible.\n\n  - point: Don't link your smart home devices to your real identity\n    priority: Essential\n    details: >-\n      Use anonymous usernames and passwords, avoiding sign-up/log-in via social media or other third-party services to maintain privacy.\n\n  - point: Keep firmware up-to-date\n    priority: Essential\n    details: >-\n      Regularly update smart device firmware to apply security patches and enhancements.\n\n  - point: Protect your Network\n    priority: Essential\n    details: >-\n      Secure your home WiFi and network to prevent unauthorized access to smart devices.\n\n  - point: Be wary of wearables\n    priority: Optional\n    details: >-\n      Consider the extensive data collection capabilities of wearable devices and their implications for privacy.\n\n  - point: Don't connect your home's critical infrastructure to the Internet\n    priority: Optional\n    details: >-\n      Evaluate the risks of internet-connected thermostats, alarms, and detectors due to potential remote access by hackers.\n\n  - point: Mitigate Alexa/ Google Home Risks\n    priority: Optional\n    details: >-\n      Consider privacy-focused alternatives like\n      [Mycroft](https://awesome-privacy.xyz/smart-home-and-iot/voice-assistants/mycroft) or use\n      Project Alias to prevent idle listening by voice-activated assistants.\n\n  - point: Monitor your home network closely\n    priority: Optional\n    details: >-\n      Use tools like FingBox or router features to monitor for unusual network activity.\n\n  - point: Deny Internet access where possible\n    priority: Advanced\n    details: >-\n      Use firewalls to block internet access for devices that don't need it, limiting operation to local network use.\n\n  - point: Assess risks\n    priority: Advanced\n    details: >-\n      Consider the privacy implications for all household members and adjust device settings for security and privacy, such as disabling devices at certain times.\n  color: red\n  softwareLinks:\n  - title: Home Automation\n    url: https://github.com/Lissy93/awesome-privacy#home-automation\n  - title: AI Voice Assistants\n    url: https://github.com/Lissy93/awesome-privacy#ai-voice-assistants\n\n- title: Personal Finance\n  slug: personal-finance\n  description: Protecting your funds, financial accounts and transactions\n  icon: finance\n  intro: >-\n    Credit card fraud is the most common form of identity theft (with [133,015 reports in the\n    US in 2017 alone](https://www.experian.com/blogs/ask-experian/identity-theft-statistics/)),\n    and a total loss of $905 million, which was a 26% increase from the previous year.\n    The with a median amount lost per person was $429 in 2017.\n    It's more important than ever to take basic steps to protect yourself from falling victim\n\n    Note about credit cards: Credit cards have technological methods in place to\n    detect and stop some fraudulent transactions. Major payment processors implement\n    this, by mining huge amounts of data from their card holders, in order to know\n    a great deal about each persons spending habits. This data is used to identify\n    fraud, but is also sold onto other data brokers. Credit cards are therefore good\n    for security, but terrible for data privacy.\n  checklist:\n  - point: Sign up for Fraud Alerts and Credit Monitoring\n    priority: Essential\n    details: >-\n      Enable fraud alerts and credit monitoring through Experian, TransUnion, or Equifax to be alerted of suspicious activity.\n\n  - point: Apply a Credit Freeze\n    priority: Essential\n    details: >-\n      Prevent unauthorized credit inquiries by freezing your credit through Experian, TransUnion, and Equifax.\n\n  - point: Use Virtual Cards\n    priority: Optional\n    details: >-\n      Utilize virtual card numbers for online transactions to protect your real banking details. Services like [Privacy.com](https://awesome-privacy.xyz/finance/virtual-credit-cards/privacy.com) and [MySudo](https://awesome-privacy.xyz/finance/virtual-credit-cards/mysudo) offer such features.\n\n  - point: Use Cash for Local Transactions\n    priority: Optional\n    details: >-\n      Pay with [Cash](https://awesome-privacy.xyz/finance/other-payment-methods/cash) for local and everyday purchases to avoid financial profiling by institutions.\n\n  - point: Use Cryptocurrency for Online Transactions\n    priority: Optional\n    details: >-\n      Opt for privacy-focused cryptocurrencies like\n      [Monero](https://awesome-privacy.xyz/finance/cryptocurrencies/monero) for\n      online transactions to maintain anonymity. Use cryptocurrencies wisely to ensure privacy.\n\n  - point: Store Crypto Securely\n    priority: Advanced\n    details: >-\n      Securely store cryptocurrencies using offline wallet generation, hardware wallets\n      like [Trezor](https://awesome-privacy.xyz/finance/crypto-wallets/trezor) or\n      [ColdCard](https://awesome-privacy.xyz/finance/crypto-wallets/coldcard), or\n      consider long-term storage solutions like\n      [CryptoSteel](https://awesome-privacy.xyz/finance/crypto-wallets/cryptosteel).\n\n  - point: Buy Crypto Anonymously\n    priority: Advanced\n    details: >-\n      Purchase cryptocurrencies without linking to your identity through services\n      like [LocalBitcoins](https://awesome-privacy.xyz/finance/crypto-exchanges/localbitcoins),\n      [Bisq](https://awesome-privacy.xyz/finance/crypto-exchanges/bisq), or Bitcoin ATMs.\n\n  - point: Tumble/ Mix Coins\n    priority: Advanced\n    details: >-\n      Use a bitcoin mixer or CoinJoin before converting Bitcoin to currency to obscure transaction trails.\n\n  - point: Use an Alias Details for Online Shopping\n    priority: Advanced\n    details: >-\n      For online purchases, consider using alias details, forwarding email addresses, VOIP numbers, and secure delivery methods to protect your identity.\n\n  - point: Use alternate delivery address\n    priority: Advanced\n    details: >-\n      Opt for deliveries to non-personal addresses such as PO Boxes, forwarding addresses, or local pickup locations to avoid linking purchases directly to you.\n  color: purple\n  softwareLinks:\n  - title: Virtual Credit Cards\n    url: https://github.com/Lissy93/awesome-privacy#virtual-credit-cards\n  - title: Cryptocurrencies\n    url: https://github.com/Lissy93/awesome-privacy#cryptocurrencies\n  - title: Crypto Wallets\n    url: https://github.com/Lissy93/awesome-privacy#crypto-wallets\n  - title: Crypto Exchanges\n    url: https://github.com/Lissy93/awesome-privacy#crypto-exchanges\n  - title: Other Payment Methods\n    url: https://github.com/Lissy93/awesome-privacy#other-payment-methods\n  - title: Budgeting Tools\n    url: https://github.com/Lissy93/awesome-privacy#budgeting-tools\n\n- title: Human Aspect\n  slug: human-aspect\n  description: Avoiding social engineering security risks\n  icon: human\n  intro: >-\n    Many data breaches, hacks and attacks are caused by human error.\n    The following list contains steps you should take, to reduce the risk of this\n    happening to you. Many of them are common sense, but it's worth takin note of.\n\n  checklist:\n  - point: Verify Recipients\n    priority: Essential\n    details: >-\n      Emails can be easily spoofed. Verify the sender's authenticity, especially for sensitive actions, and prefer entering URLs manually rather than clicking links in emails.\n\n  - point: Don't Trust Your Popup Notifications\n    priority: Essential\n    details: >-\n      Fake pop-ups can be deployed by malicious actors. Always check the URL before entering any information on a popup.\n\n  - point: Never Leave Device Unattended\n    priority: Essential\n    details: >-\n      Unattended devices can be compromised even with strong passwords. Use encryption and remote erase features like Find My Phone for lost devices.\n\n  - point: Prevent Camfecting\n    priority: Essential\n    details: >-\n      Protect against camfecting by using webcam covers and microphone blockers. Mute home assistants when not in use or discussing sensitive matters.\n\n  - point: Stay protected from shoulder surfers\n    priority: Essential\n    details: >-\n      Use privacy screens on laptops and mobiles to prevent others from reading your screen in public spaces.\n\n  - point: Educate yourself about phishing attacks\n    priority: Essential\n    details: >-\n      Be cautious of phishing attempts. Verify URLs, context of received messages, and employ good security practices like using 2FA and not reusing passwords.\n\n  - point: Watch out for Stalkerware\n    priority: Essential\n    details: >-\n      Be aware of stalkerware installed by acquaintances for spying. Look out for signs like unusual battery usage and perform factory resets if suspected.\n\n  - point: Install Reputable Software from Trusted Sources\n    priority: Essential\n    details: >-\n      Only download software from legitimate sources and check files with tools\n      like [Virus Total](https://awesome-privacy.xyz/security-tools/online-tools/virus-total) before installation.\n\n  - point: Store personal data securely\n    priority: Essential\n    details: >-\n      Ensure all personal data on devices or in the cloud is encrypted to protect against unauthorized access.\n\n  - point: Obscure Personal Details from Documents\n    priority: Essential\n    details: >-\n      When sharing documents, obscure personal details with opaque rectangles to prevent information leakage.\n\n  - point: Do not assume a site is secure, just because it is `HTTPS`\n    priority: Essential\n    details: >-\n      HTTPS does not guarantee a website's legitimacy. Verify URLs and exercise caution with personal data.\n\n  - point: Use Virtual Cards when paying online\n    priority: Optional\n    details: >-\n      Use virtual cards for online payments to protect your banking details and limit transaction risks.\n\n  - point: Review application permissions\n    priority: Optional\n    details: >-\n      Regularly review and manage app permissions to ensure no unnecessary access to sensitive device features.\n\n  - point: Opt-out of public lists\n    priority: Optional\n    details: >-\n      Remove yourself from public databases and marketing lists to reduce unwanted contacts and potential risks.\n\n  - point: Never Provide Additional PII When Opting-Out\n    priority: Optional\n    details: >-\n      Do not provide additional personal information when opting out of data services to avoid further data collection.\n\n  - point: Opt-out of data sharing\n    priority: Optional\n    details: >-\n      Many apps and services default to data sharing settings. Opt out to protect your data from being shared with third parties.\n\n  - point: Review and update social media privacy\n    priority: Optional\n    details: >-\n      Regularly check and update your social media settings due to frequent terms updates that may affect your privacy settings.\n\n  - point: Compartmentalize\n    priority: Advanced\n    details: >-\n      Keep different areas of digital activity separate to limit data exposure in case of a breach.\n\n  - point: WhoIs Privacy Guard\n    priority: Advanced\n    details: >-\n      Use WhoIs Privacy Guard for domain registrations to protect your personal information from public searches.\n\n  - point: Use a forwarding address\n    priority: Advanced\n    details: >-\n      Use a PO Box or forwarding address for mail to prevent companies from knowing your real address, adding a layer of privacy protection.\n\n  - point: Use anonymous payment methods\n    priority: Advanced\n    details: >-\n      Opt for anonymous payment methods like cryptocurrencies to avoid entering identifiable information online.\n\n  color: indigo\n\n- title: Physical Security\n  slug: physical-security\n  description: Taking measures to prevent IRL security incidents\n  icon: physical\n  intro: >-\n    Public records often include sensitive personal data (full name, date of birth,\n    phone number, email, address, ethnicity etc), and are gathered from a range of\n    sources (census records, birth/ death/ marriage certificates, voter registrants,\n    marketing information, customer databases, motor vehicle records, professional/\n    business licenses and all court files in full detail). This sensitive personal\n    information is\n    [easy and legal to access](https://www.consumerreports.org/consumerist/its-creepy-but-not-illegal-for-this-website-to-provide-all-your-public-info-to-anyone/),\n    which raises some [serious privacy concerns](https://privacyrights.org/resources/public-records-internet-privacy-dilemma)\n    (identity theft, personal safety risks/ stalkers, destruction of reputations, dossier society)\n\n\n    CCTV is one of the major ways that the corporations, individuals and the government\n    tracks your movements. In London, UK the average person is caught on camera about\n    500 times per day. This network is continuing to grow, and in many cities around\n    the world, facial recognition is being rolled out, meaning the state can know\n    the identity of residents on the footage in real-time.\n\n    Strong authentication, encrypted devices, patched software and anonymous web\n    browsing may be of little use if someone is able to physically compromise you,\n    your devices and your data. This section outlines some basic methods for physical security\n\n  checklist:\n  - point: Destroy Sensitive Documents\n    priority: Essential\n    details: |\n      Shred or redact sensitive documents before disposal to protect against\n      identity theft and maintain confidentiality.\n\n  - point: Opt-Out of Public Records\n    priority: Essential\n    details: |\n      Contact people search websites to opt-out from listings that show persona\n      information, using guides like Michael Bazzell's Personal Data Removal Workbook.\n\n  - point: Watermark Documents\n    priority: Essential\n    details: |\n      Add a watermark with the recipient's name and date to digital copies of\n      personal documents to trace the source of a breach.\n\n  - point: Don't Reveal Info on Inbound Calls\n    priority: Essential\n    details: |\n      Only share personal data on calls you initiate and verify the recipient's phone number.\n\n  - point: Stay Alert\n    priority: Essential\n    details: Be aware of your surroundings and assess potential risks in new environments.\n\n  - point: Secure Perimeter\n    priority: Essential\n    details: Ensure physical security of locations storing personal info devices, minimizing external access and using intrusion detection systems.\n\n  - point: Physically Secure Devices\n    priority: Essential\n    details: Use physical security measures like Kensington locks, webcam covers, and privacy screens for devices.\n\n  - point: Keep Devices Out of Direct Sight\n    priority: Essential\n    details: Prevent devices from being visible from outside to mitigate risks from lasers and theft.\n\n  - point: Protect your PIN\n    priority: Essential\n    details: Shield your PIN entry from onlookers and cameras, and clean touchscreens after use.\n\n  - point: Check for Skimmers\n    priority: Essential\n    details: Inspect ATMs and public devices for skimming devices and tampering signs before use.\n\n  - point: Protect your Home Address\n    priority: Optional\n    details: Use alternative locations, forwarding addresses, and anonymous payment methods to protect your home address.\n\n  - point: Use a PIN, Not Biometrics\n    priority: Advanced\n    details: Prefer PINs over biometrics for device security in situations where legal coercion to unlock devices may occur.\n\n  - point: Reduce exposure to CCTV\n    priority: Advanced\n    details: Wear disguises and choose routes with fewer cameras to avoid surveillance.\n\n  - point: Anti-Facial Recognition Clothing\n    priority: Advanced\n    details: Wear clothing with patterns that trick facial-recognition technology.\n\n  - point: Reduce Night Vision Exposure\n    priority: Advanced\n    details: Use IR light sources or reflective glasses to obstruct night vision cameras.\n\n  - point: Protect your DNA\n    priority: Advanced\n    details: Avoid sharing DNA with heritage websites and be cautious about leaving DNA traces.\n\n  color: lime\n"
        },
        {
          "name": "web",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}