{
  "metadata": {
    "timestamp": 1736608951340,
    "page": 155,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE2MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "charles2gan/GDA-android-reversing-Tool",
      "stars": 4278,
      "defaultBranch": "master",
      "files": [
        {
          "name": "GDA Color theme",
          "type": "tree",
          "content": null
        },
        {
          "name": "GDA taint anlysis",
          "type": "tree",
          "content": null
        },
        {
          "name": "GDA_PIC",
          "type": "tree",
          "content": null
        },
        {
          "name": "GDA_Python_Pic",
          "type": "tree",
          "content": null
        },
        {
          "name": "JavaPlugin.zip",
          "type": "blob",
          "size": 1086.9560546875,
          "content": null
        },
        {
          "name": "JavaPlugin",
          "type": "tree",
          "content": null
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.091796875,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [2019] [charles2gan/gjden/GANJIE]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "NOTICE",
          "type": "blob",
          "size": 2.0498046875,
          "content": "The majority of GDA is written and copyrighted by charles2gan(gjden/GAN JIE)\nand released under the Apache 2.0 license (see LICENSE file for full license text):\n\n*******************************************************************************\nCopyright 2019, charles2gan(gjden/GAN JIE)\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n   http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n*******************************************************************************\n\n\nThe software including adb binary files are taken from\nthe Android sdk, and dex librarys are taken from the Android Open Source Project, \nand they are used in accordance with the following license:\n*******************************************************************************\n\nCopyright (C) 2007 The Android Open Source Project\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n     http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n*******************************************************************************\n\nopenssl lib are taken from openssl :\nused in accordance with the following license:\n - Openssl - licensed under the Apache License 2.0 \nIcons copied from several places:\n - Eclipse Project (JDT UI) - licensed under EPL v1.0 (http://www.eclipse.org/legal/epl-v10.html)\n \n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.4912109375,
          "content": "\n[![image](https://img.shields.io/badge/website-GDA-brightgreen?logo=groupon)](http://www.gda.wiki:9090/?language=en)\n[![image](https://img.shields.io/badge/Guide-Brief-brightgreen?logo=Talend&logoColor=red)](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki)\n[![image](https://img.shields.io/badge/Guide-PathSolver-brightgreen?logo=Talend&logoColor=red)](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Path-Solver)\n[![image](https://img.shields.io/badge/Guide-VulScanner-brightgreen?logo=Talend&logoColor=red)](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Vulnerability-Scanner)\n[![image](https://img.shields.io/badge/Guide-Script-brightgreen?logo=Talend&logoColor=red)](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Python-scripts)\n[![image](https://img.shields.io/badge/Guide-Taint%20Analysis-brightgreen?logo=Talend&logoColor=red)](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Static-Taint-analysis)\n[![image](https://img.shields.io/badge/Update-History-brightgreen?logo=Apache-Cassandra&logoColor=red)](http://www.gda.wiki:9090/update_list.php?language=en)\n[![image](https://img.shields.io/badge/Chat-Zhihu-brightgreen?logo=Zhihu)](https://www.zhihu.com/people/gjden)\n[![image](https://img.shields.io/badge/Chat-Twitter-brightgreen?logo=Twitter)](https://twitter.com/charles_gan1)\n\n![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA_PIC/mainpage.png)\n\n\n# ˇ GDA(GJoy Dex Analyzer)\n\nGDA, an powerful Dalvik bytecode decompiler implemented in C++, which has the advantages of fast analysis and low memory&disk consumption and an stronger ability to decompiling the apk, dex, odex, oat, jar, class, aar files.\n\nGDA is completely native software and works without any Setup and Java VM, it works well in any new windows system and virtual machine system without additional configuration. GDA Decompiler project started in 2013 and its first version 1.0 released in 2015 at **[GDA website](http://www.gda.wiki:9090/index.php?language=en)**.\n\nGDA is also a powerful and fast reverse analysis platform. Which does not only supports the basic decompiling operation, but also many excellent features like **Malicious behavior detection, Privacy leaking detection, Vulnerability detection, Path solving, Packer identification, Variable tracking analysis, Deobfuscation, Python& Java scripts, Device memory extraction, Data decryption and encryption** etc. \n\nAll the features as follows:\n\n\n\n```python\n𝕬 Interactive Operation:\n    1. Cross-references for strings, classes, methods and fields;\n    2. Searching for strings, classes methods and fields;\n    3. Comments for java code;\n    4. Rename methods,fields and classes;\n    5. Save the analysis results in gda db file.\n    ...\n  \n𝕭 Utilities for Assisted Analysis:\n    1. Extracting DEX from ODEX;\n    2. Extracting DEX from OAT;\n    3. XML Decoder (Component filter);\n    4. Algorithm tool(Support rolling encryption and almost all popular encryption algorithms);\n    5. Device memory dump(Dump so, odex, dex, oat file);\n    6. Path solving;\n    7. Static vulnerability scanner;\n    ...\n    \n𝕮 Good Features:\n    1. Brand new dalvik decompiler in c++ with friendly GUI.\n    2. Packers Recognition.\n    3. Multi-DEX supporting.\n    4. De-obfuscate.\n    5. Malicious Behavior Scanning by API chains.\n    6. Static vulnerability scanner based on stack state machine and dynamic rule interpreter.\n    7. Taint analysis to preview the behavior of variables.\n    8. Taint analysis to source the variables.\n    9. APIs view with x-reference\n    10. Deep URL extraction.\n    11. Association of permissions with modules.\n    12. Apk Forensics Analysis.\n    13. Dual decompiler mode.\n    14. Smart Rename.\n    15. Device memory data dump, DEX file dump by memory searching.\n    16. Support Frida to hook and call the selected method or class.\n    17. Privacy leaking scanning.\n    18. Sensitive Infomation extraction.\n    19. Multi-DEX Merge.\n    20. Path solving based on low-level intermediate representation(LIR).\n    21. Junk instruction clearing.\n    22. Support call-graph view.\n    23. Smali instruction patch, apk repack and install.\n    24. Support subclass and parentclass view.\n    25. Support translation of the strings.\n    ...\n```  \n\n\n`𝕲𝕯𝕬 shortcut key`\n\n|shortcut    |description|\n|:-|:-|\n|F5   |Switch java to smali, pressing it again for back to java|\n|F    |Trace the args and return-value by dataflow analysis|\n|X    |Cross-referencing, locating callers (of strings, classes, methods, field)|\n|Esc/◄/Backspace    |Back to the last visit|\n|►    |Forward to the next visit|\n|G    |Jump to somewhere by you inputting offset |\n|N    |Rename the variable/method/class name|\n|S    |Search for all the elements by the given string|\n|C    |Comments. Only supports the Java code|\n|DoubleClick    |The cursor's placed at the method/str/field/class, and double-click to access objects|\n|M    |The cursor's placed at the Smali line and pressing the key 'M' to edit the instruction|\n|▲ UP   |Press 'up' key to access the up-method in the tree control|\n|▼ Down  |Press 'down' key to access the down-method in the tree control|\n|D    |Dump the binary data of methods, only supports the Smali window|\n|Enter     |The modification of edit boxes take effect|\n|H    |Show data in Hex|\n|Ctr+H    |Pop searching history window|\n|Ctr+A    |Select all|\n|Ctr+C    |Copy|\n|Ctr+V    |Paste, only for editable boxes|\n|Ctr+X    |Cut|\n|Ctr+F    |Find out the string of the code area|\n|Ctr+S    |Save the modifications into the GDA database file|\n\n\n# ˇ Installing\n\n  No installation required, just double-click the bin and you can enjoy it. \n  NOTE：\n  This is not an open source project，at least，in the short term. You can use the free tools and some open source scripts published here. \n  \n# ˇ False positive report\n  \n  For copyright protection, GDA is protected by an authorized [VMP](http://vmpsoft.com/), which may lead to false positives of some anti-virus software. Please ignore or add GDA to the white list. GDA does not have any malicious behavior.\n  \n  GDA is embedded with ADB and gdump (used to dump device memory data), as well as vul rules, source-taint rules, api fingerprint etc. so, you will see some file in directory %APPDATA%/GDA. this behavior releasing the other executable files also be identified as a virus by some AVs.\n\n# ˇ Supported platforms\n\n  Only for windows\n\n# ˇ Usage:\n\n  Just drag a file into GDA, that's done. \n  \n  If your files are `.jar/.class/.aar` files, you need the java support the dx tool. Please make sure that the java works properly.\n  \n  When the analyzed jar file size is too big, it maybe takes a long time to analysize, please be patient.\n  \n \n  ***[FAQ Summary](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Decompiler-FAQ-Summary)***\n  \n  ***[Brief Guide](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki)***\n\n  ***[How to search what you need](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/How-to-search-what-you-need%3F)***\n  \n  ***[Support For Frida](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-support-for-the-frida)***\n  \n  ***[Python Script](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Python-scripts)***\n  \n  ***[GDA Privacy Leak](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Privacy-Leak-Detection)***\n  \n  ***[GDA Path Solver](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Path-Solver)***\n  \n  ***[GDA APK Forensic](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-APK-Forensic)***\n  \n  ***[GDA Static Taint Analysis](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Static-Taint-analysis)***\n  \n  ***[Batch Decryption Of APP Strings](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/Batch-decryption-of-APP-strings)***\n  \n  ***[GDA Vulnerability Scanner](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA-Vulnerability-Scanner)***\n  \n  ***[GDA: Capture the Flag in CTF](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA:-%22Unpacking-Decompiling-Decrypting%22-to-Capture-the-Flag-in-CTF-Game)***\n\n  ***[GDA: DEX Static Patch Technology Based on Smali Just-in-time Compilation](https://github.com/charles2gan/GDA-android-reversing-Tool/wiki/GDA:-DEX-Static-Patch-Technology-Based-on-Smali-Just%E2%80%90in%E2%80%90time-Compilation)***\n\n\n  \n# ˇ Color theme:\n\nOnly support GDA3.75+, Other version do not use this theme file. Usage:click on menu`File`->`Import Color Config`,choosing a theme file and reboot GDA.\n\n***[Download Here](https://github.com/charles2gan/GDA-android-reversing-Tool/tree/master/GDA%20Color%20theme)***\n\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/white_black.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/white_black1.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/white_red.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/black_black.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/black_black_smali.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/black_black_smali1.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/black_blue.png)\n  ![](https://github.com/charles2gan/GDA-android-reversing-Tool/blob/master/GDA%20Color%20theme/black_green.png)\n  \n"
        },
        {
          "name": "dx_tool",
          "type": "tree",
          "content": null
        },
        {
          "name": "guild-pic",
          "type": "tree",
          "content": null
        },
        {
          "name": "python sample",
          "type": "tree",
          "content": null
        },
        {
          "name": "script_decrypt_pic",
          "type": "tree",
          "content": null
        },
        {
          "name": "update_history",
          "type": "blob",
          "size": 9.8525390625,
          "content": "更新版本：1.41\n\n1.修正点击类时出现的类方法解析崩溃问题\n2.修正了壳加载时存在的不兼容性问题。\n3.添加了文件拖拽功能。\n4.修正了连续打开同一个文件产生崩溃的问题。\n5.修复了dump进行脱壳中，部分系统中的路径处理问题\n6.修复了进程内存模块中，不能完全显示dex模块和odex模块的问题\n7.添加了内存dump的过滤功能，目前支持dex,odex,so,jar,apk等内存模块的过滤\n\n版本更新：1.50。目前较忙，针对于方法的实时反编译成JAVA的功能决定在下一个版本更新，1.50只做了几个小功能添加已及几处bug修复。\n1.添加字符串编辑功能；\n2.添加十六进制显示功能。\n3.重写了搜索窗口，提供了更为方便的分类搜索\n4.修正了搜索窗口多次搜索累积显示的bug。\n\n\n版本更新：1.60\n1.修复win8,win10下不能运行的问题。\n2.修正了字符串显示，转换了回车换行符\n3.添加了APP应用有效字符串显示功能(排除了包，类，方法，域等字符串的干扰)\n4.添加了所有字符串显示功能（显示所有字符串，包含DEX文件中的所有）\n5.添加了当前访问函数的调用者查询(通过交叉引用来实现X)\n6.添加左边树形控件右键菜单功能，实现根据包或者子包中所有类所使用的字符串和方法，方便选择自己感兴趣的包进行分析。\n7.针对方法添加了F5功能，实现了直接将字节码转换为伪java代码，按一次F5显示java伪代码，再按一次F5显示smali。\n8.修复长时间运行，有时会出现崩溃的问题（感谢天天向上提供dump文件）\n\n版本更新：2.0\n1.纠正了F5反编译出现的错误，优化了反编译效果，添加了this指针的识别，对代码进行了着色。\n2.增强了伪代码功能，给伪代码添加了双击操作和交叉引用操作，将光标放在函数调用处，双击可进入函数，X可进行交叉引用；将光标放在字符串中，X可执行字符串交叉引用，右键可以编辑字符串。\n3.添加import，简化了函数调用中所夹带的包名称。\n4.添加可以查看APK所使用的API功能，并且可以根据包名进行过滤。\n5.专门为病毒分析师定制的可疑行为扫描功能，采用了api行为链的方式进行恶意行为扫描，可以扫描文件释放、删除和遍历，短信发送，短信窃取，通讯录窃取，电话监听，加密算法，数据库操作，手机号码窃取，邮箱登录，http网络操作等行为识别，并且显示行为操作函数，双击可进入产生行为所在代码。\n\n\n新版本需解决问题：\n1.快捷键n修改变量出错问题\n2.this指针识别问题\n3.提供类和方法名称修改\n\n新版本更新2.4：\n1.修复了优化选项选中出现另行打开文件失效的bug。\n2.修复反编译java伪代码部分特殊字节码识别出错的问题，解决了某些混淆了无效代码的方法解析崩溃问题。\n3.采用多线程实现解析，结果和渲染的分离，解决了解析大方法时出现的卡死问题。\n4.添加了伪代码上的类名，方法名，域名的修改。\n5.添加了行注释功能，你可以在伪代码上做注释。\n6.设计了GDA文件格式，用于保存分析结果数据（包含修改的类，方法，域，注释等等），类似于IDA idb文件，下次分析时可以直接打开分析文件，无需源文件存在。\n7.添加了伪代码缩进效果。\n8.添加了OAT解析和以及从OAT提取所有Dex文件的功能，默认只打开第一个DEX进行分析。\n\n2.5更新\n1.工具栏添加\n2.增加了查壳功能。\n3.增加了缓存清理功能。\n4.修改默认显示页，添加了DEX头部彩色图，鼠标移倒头部相应的颜色区域，会显示区域的DEX头子项。\n5.打开设备方面，加快了打开设备的速度，默认情况下用本机配置的adb.exe操作，如果没有配置android-sdk环境变量，采用GDA自带的adb.添加了apk安装功能。\n6.重新设计了java伪代码中的函数定位机制，很好的解决了伪代码中函数定位不准确的问题（主要是双击进入，交叉引用操作）\n7.添加了加密解密功能，实现了如下算法：\n\thash:md2 md4 md5 sha sha1 sha224 sha256 sha384 sha512\n\t对称加密：des idea rc2 rc4 rc4-40 rc2-40 rc2-64 bf cast5 aes(128 192 256)及其相应的模式如ecb cbc ofb cfb，其他模式如（cfb1 cfb8）\n8.添加了apk签名信息的提取。\n\n\n2.6更新\n1.加强并优化了可疑行为扫描算法和特征\n2.修复加密解密工具的一些bug\n3.修复了fill-array-data指令中data解析错误的问题\n4.修复了指令中64位长整型常数的错误解析的问题\n5.内存dump处做进一步优化，并且修复几处bug\n6.完善了下头部的查看。\n\n3.0更新\n1.对恶意行为扫描引擎，极大的提高了恶意行为扫描速度，比以前扫描速度提升了2倍以上。\n2.增加全局导入API扫描功能，可查看该APK所使用的所有有效API功能(其中包含所使用的native函数)\n3.优化了点击字符自动背景作色算法，大大改善了作色的速度，尤其是在大函数中，体验会比较明显。\n4.完全重写了反编译引擎，本次花费了大量精力深入研究反编译理论技术并且实现了Android字节码的反编译，反编译效果已经非常接近JEB。\n5.修复S/s快捷键搜索类时，双击类无法显示类的bug.\n6.对GDA文件做了文件关联（需要开启注册表HKEY_CLASSES_ROOT的读写权限）\n\n3.31更新\n1.重新设计了界面，对代码着色做了些调整。\n2.树形框与编辑框大小可拖拽移动。\n3.纠正了部分情况下代码着色时的拖延问题。\n4.对反编译引擎做了进一步的优化和排错。\n5.变量类型分析做了变化，如果存在调试信息，使用调试信息中的变量类型。\n6.添加了本地变量优化算法，防止分支结构中出现重复声明问题。\n7.添加try-catch结构优化算法，对相同handler的异常做了融合。try{}体代码更加精确。\n8.添加十六进制编辑功能，可实现任意偏移的Dex文件编辑。\n9.做了其他优化和排错。\n\nGDA3.4更新：更快、更强、更便捷\nbug修复:\n1.修复算法工具bug\n2.修复n操作重命名操作大小写不敏感的问题。\n3.修改了类和字符串点击阴影作色的策略\n4.修复了编译器引擎的几处Bug\n5.修复了高版本DEX文件无法打开的问题\n6.修正了反编译超大函数时出现畸形代码问题。\n7.修正了对称加密算法加解密时出错的问题。\n8.修正方法参数类型为根类时，无法显示参数类型问题。\n9.修正了在进行两个相同文件名的APK文件分析时出现当前文件未分析到的问题。\n\n功能更新\n1.对优化后DEX的反编译做了兼容，使其能够正确反编译(之前会出现崩溃)\n2.添加了交叉引用的method与string在调用者方法中的定位着色功能。\n3.进一步优化了扫描引擎，大大提升了扫描的速度。\n4.修改了类的显示方式，之前的类显示过于简单。\n5.增加了申请访问权限与模块（method）的关联功能。\n6.区分了类(对象)和方法的重命名操作，当光标在点号之前时，按n可以对对象变量进行从命名，点号之后为method重命名。\n7.增加了java伪代码中的双击类变量(对象)/域时跳转到类的功能，类的交叉引用。\n8.增加了java伪代码中field和类(对象)的识别，其中field支持双击后在类中查看，交叉引用，重命名。类/对象双击可查看类，以及类的交叉引用。\n9.增加了父类的查看定位功能\n10.增加了子类的查看定位功能\n11.增加了树形框下类的实时搜索功能,鼠标移动到树形框，搜索框会自动显示并获得焦点。\n12.增加近期文件的打开历史记录，点击文件可以直接加载分析。\n13.增加了历史分析文件的搜索记录，CTR+H可以调出搜索历史，双击搜索历史项可以弹出搜索内容，双击右边的搜索项，可以自动弹出搜索结果。\n14.最大化时取消了任务栏覆盖功能\n15.增加了java伪代码的显示模式的选择，可以选择try-catch模式与非try-catch模式，默认设置为了不显示try-catch。\n16.增加了对屏幕的适配，防止小分辨率下窗口无法显示完全。\n\nGDA3.43 更新记录\n\n\nGDA3.51 更新记录\n1.支持MultiDex,并且实现多个Dex之间的自动跳转、交叉引用。本人采用的方法有别于其他任何分析工具，主流的如Jeb、apktool通过将多个Dex组合成为单个Dex之后再进行分析，失败概率很大，而GDA采用了Dex分组解析以及跨Dex关联技术，可完美解析。\n2.修复了3.45版本的多处二笔Bug，并做了相关优化。\n3.对已分析的方法进行作色标记。\n4.对每个方法添加了package标注和返回方法查看。\n5.修正了class、field被混淆成为特殊字符后无法进行交叉引用、修改等问题。\n6.增强了OAT转dex功能，提高了稳定性和兼容性。\n7.为了兼容MultiDex,修改了头部的显示。\n\nGDA3.53 更新\n1.修复了一些Bug\n2.添加了显示色彩的配置，可导入导出颜色方案文件\n3.界面做了些微调。\n\nGDA3.54 更新\n1.添加了数字类型的转化功能，点击数字右键可以实现十进制、八进制、16进制以及字符之间相互转化。\n2.对于存在操作历史的文件时，默认显示操作历史窗口\n3.优化AllString操作，原来分析速度较慢，容易出现界面假死，目前速度得到较大提升。\n4.微调了配色窗口\n5.对反编译器做进一步优化和bug修复，如修复了条件反转问题。\n6.修复对.gda文件加载后无法显示权限的问题\n7.修复了跨Dex进行部分method访问时，无法发现method的问题。\n8.对每个方法添加了package标注和返回方法查看。\n9.增加了对查找记录管理，可右键进行删除和清理操作。\n10.对MultiDex增加了字符串、方法、APIS、可疑行为扫描等功能，点击DexClass{2,3，...}右键可用\n"
        }
      ]
    }
  ]
}