{
  "metadata": {
    "timestamp": 1736609063552,
    "page": 316,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjMyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "huburt-Hu/NewbieGuide",
      "stars": 3582,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.083984375,
          "content": "*.iml\n.gradle\n/local.properties\n/.idea\n.DS_Store\n/build\n/captures\n.externalNativeBuild"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 15.978515625,
          "content": "[![](https://jitpack.io/v/huburt-Hu/NewbieGuide.svg)](https://jitpack.io/#huburt-Hu/NewbieGuide)\n\n\n# NewbieGuide\nAndroid 快速实现新手引导层的库\n\n这是一款可以通过简洁链式调用，一行代码实现引导层的显示，自动判断首次显示，当然也可以通过参数配置来满足不同的显示逻辑和需求。\n通过自定义layout.xml实现文本及image的添加，非常方便位置的调整，避免代码调整各种不好控制的情况：实验5，6次才最终确定文字等的位置。\n\n## 更新日志\n\n[更新日志](https://github.com/huburt-Hu/NewbieGuide/wiki)\n\n\n## 效果\n\n改变高亮view的尺寸，并不用调整显示引导层的代码\n\n![sample](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/device-2017-08-09-161703.png)  \n![sample](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/change_size.png)\n\n引导层的xml可以完全自定义，像怎样显示就怎样显示\n\n![sample](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/shape_dialog.png)\n\n\n## 此库依赖\n\n\n`\ncompileOnly 'com.android.support:appcompat-v7:25.3.1'\n`\n\n## 导入\n\n项目的build.gradle添加\n\n```\nallprojects {\n\t\trepositories {\n\t\t\t...\n\t\t\tmaven { url 'https://jitpack.io' }\n\t\t}\n\t}\n```\n\nmodule的build.gradle添加\n\n```\n dependencies {\n\t  compile 'com.github.huburt-Hu:NewbieGuide:v2.4.0'\n\t}\n```\n\n**确保你的项目中已经依赖了appcompat-v7**\n\n\n## 使用\n\n### 简单使用\n\n```\nNewbieGuide.with(activity)\n        .setLabel(\"guide1\")\n        .addGuidePage(GuidePage.newInstance()\n            .addHighLight(btnSimple)\n            .setLayoutRes(R.layout.view_guide_simple))\n        .show();\n```\n\n通过链式调用，一行代码即可实现引导层的显示，来看下效果：\n\n![simple use](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/simple_use.png)\n\n其中：\n\n+ `with`方法可以传入Activity或者Fragment，获取引导页的依附者。Fragment中使用建议传入fragment，内部会添加监听，当依附的Fragment销毁时，引导层自动消失。\n+ `setLabel`方法用于设置引导页的标签，区别不同的引导页，该方法**必须**调用设置，否则会抛出异常。内部使用该label控制引导页的显示次数。\n+ `addGuidePage`方法添加一页引导页，这里的引导层可以有多个引导页，但至少需要一页。\n+ `GuidePage`即为引导页对象，表示一页引导页，可以通过`.newInstance()`创建对象。并通过`addHighLight`添加一个或多个需要高亮的view，该方法有多个重载，可以设置高亮的形状，以及padding等（默认是矩形）。`setLayoutRes`方法用于引导页说明布局，就是上图的说明文字的布局。\n+ `show`方法直接显示引导层，如果不想马上显示可以使用`build`方法返回一个Controller对象，完成构建。需要显示得时候再次调用Controller对象的show方法进行显示。\n\n### 添加高亮\n\n#### 高亮view\n\naddHighLight方法有多个重写，完整参数如下：\n\n```\n    /**\n     * 添加需要高亮的view\n     *\n     * @param view          需要高亮的view\n     * @param shape         高亮形状{@link com.app.hubert.guide.model.HighLight.Shape}\n     * @param round         圆角尺寸，单位dp，仅{@link com.app.hubert.guide.model.HighLight.Shape#ROUND_RECTANGLE}有效\n     * @param padding       高亮相对view的padding,单位px\n     * @param relativeGuide 相对于高亮的引导布局\n     */\n    public GuidePage addHighLight(View view, HighLight.Shape shape, int round, int padding, @Nullable RelativeGuide relativeGuide)\n\n```\n#### 高亮区域（v2.3.0新增）\n\n有些情况可能不太容易获得高亮view的引用，那么此时可以用添加高亮区域的方式来代替，\n计算出需要高亮的view在anchor中位置，将获得的rectF传入addHighLight方法\n\n```\n    /**\n     * 添加高亮区域\n     *\n     * @param rectF         高亮区域，相对于anchor view（默认是android.R.id.content）\n     * @param shape         高亮形状{@link com.app.hubert.guide.model.HighLight.Shape}\n     * @param round         圆角尺寸，单位dp，仅{@link com.app.hubert.guide.model.HighLight.Shape#ROUND_RECTANGLE}有效\n     * @param relativeGuide 相对于高亮的引导布局\n     */\n    public GuidePage addHighLight(RectF rectF, HighLight.Shape shape, int round, @Nullable RelativeGuide relativeGuide)\n```\n\n### 高亮区域点击事件（v2.4.0新增）\n\n之前也是issues中提到需要这个功能，希望能够开放此api，因此在2.4版本中增加了。\n由于目前高亮view的相关参数过多，因此将一些新增的配置都放入了HighlightOptions中，HighlightOptions可以通过内部Builder对象构建：\n\n```\nHighlightOptions options = new HighlightOptions.Builder()\n         .setOnClickListener(new View.OnClickListener() {\n                @Override\n                public void onClick(View v) {\n                       Toast.makeText(FirstActivity.this, \"highlight click\", Toast.LENGTH_SHORT).show();\n                }\n         })\n         .build();\nGuidePage page = GuidePage.newInstance().addHighLightWithOptions(btnRelative, options);\nNewbieGuide.with(FirstActivity.this)\n         .setLabel(\"relative\")\n         .alwaysShow(true)//总是显示，调试时可以打开\n         .addGuidePage(page)\n         .show();\n```\n\n### 自定义高亮区域绘制内容（v2.4.0新增）\n\n该功能主要是为了满足[issue51](https://github.com/huburt-Hu/NewbieGuide/issues/51)提出的需求。\n\n首先构建一个HighlightOptions，并设置OnHighlightDrewListener：\n\n```\nHighlightOptions options = new HighlightOptions.Builder()\n        .setOnHighlightDrewListener(new OnHighlightDrewListener() {\n            @Override\n            public void onHighlightDrew(Canvas canvas, RectF rectF) {\n                Paint paint = new Paint();\n                paint.setColor(Color.WHITE);\n                paint.setStyle(Paint.Style.STROKE);\n                paint.setStrokeWidth(10);\n                paint.setPathEffect(new DashPathEffect(new float[]{20, 20}, 0));\n                canvas.drawCircle(rectF.centerX(), rectF.centerY(), rectF.width() / 2 + 10, paint);\n            }\n        })\n        .build();\n```\n\nonHighlightDrew方法会在引导层绘制高亮之后马上回调，可通过canvas，以及给定的高亮区域rectF，绘制想要任何视图，例如上述示例中完成的issue提出的虚线。\n\n然后与高亮区域点击事件类似，传入highlight以及option到addHighLightWithOptions方法中：\n\n```\nGuidePage page = GuidePage.newInstance().addHighLightWithOptions(btnRelative, options);\n```\n\n\n### 显示次数控制\n\n通常情况下引导页只在用户首次打开app的时候显示，第二次进入时不显示，因此默认只显示一次。当然你也可以通过`.setShowCounts(3)`自定义显示的次数，调试的时候可以使用`.alwaysShow(true)`设置每次都显示。\n\n```\nNewbieGuide.with(activity)\n        .setLabel(\"guide1\")\n        //.setShowCounts(3)//控制次数\n        .alwaysShow(true)//总是显示，调试时可以打开\n        .addGuidePage(GuidePage.newInstance()\n            .addHighLight(btnSimple)\n            .setLayoutRes(R.layout.view_guide_simple))\n        .show();\n```\n\n就算设置了`.alwaysShow(true)`，内部还是会记录显示得次数，之后改会`setShowCounts(3)`可能实际记录的次数早已超过限制，因此不会再次显示。使用Controller对象的`resetLabel`方法重置次数。（或者清除应用缓存也能重置次数）\n\n\n### 引导布局\n\n着重说明一下setLayoutRes方法，通常其他的类似的库都是通过代码参数来控制说明内容展示在高亮view相对的位置，如下方。经常需要多次运行才能找到满意的位置的参数。大多说明内容只能出现在高亮的上下左右，需要库的支持，自定义的程度不是很高。\n\n我所采用的方式是将说明内容通过xml的方式，自定义摆放位置。使得说明内容高度自定义，不管你是简单的图片，还是对话框类型的都可以。\n\n![like dialog](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/shape_dialog.png)\n\n```\nGuidePage.newInstance()\n    .addHighLight(btnDialog)\n    .setEverywhereCancelable(false)//是否点击任意位置消失引导页，默认true\n    .setLayoutRes(R.layout.view_guide_dialog, R.id.btn_ok)\n    .setOnLayoutInflatedListener(new OnLayoutInflatedListener() {\n        @Override\n        public void onLayoutInflated(View view, Controller controller) {\n            TextView tv = view.findViewById(R.id.tv_text);\n        }\n    })\n```\n\n该方法还有一个可变参数`setLayoutRes(@LayoutRes int resId, int... id)`，传入id数组表示在布局中点击让引导页消失或者进入下一页的View（例如，Button ok的id）。\n`setOnLayoutInflatedListener`设置布局填充完成的监听，当传入的xml(`R.layout.view_guide_dialog`)填充完成时会回答调用该监听，用于初始化自定布局的元素。\n\n#### 相对高亮位置的引导布局（v2.3.0新增）\n\n鉴于好多人提出上面的方法对于箭头指向的引导控制起来比较麻烦，在不用的手机屏幕尺寸上会有位置差异。\n因此v2.3版本新增在高亮相对位置添加引导布局的方法。扩展addHighLight方法的重载，新增参数RelativeGuide：\n```\n.addGuidePage(\n        GuidePage.newInstance()\n                .addHighLight(btnRelative, new RelativeGuide(R.layout.view_relative_guide,\n                        Gravity.RIGHT, 100))\n)\n```\n\nRelativeGuide构造需要2个必传参数：\n+ 布局layout的res id；\n+ gravity 目前仅支持 Gravity.LEFT Gravity.TOP Gravity.RIGHT Gravity.BOTTOM\n\n还有一个可选参数padding，表示与高亮view的padding\n\n引导层本质是一个FrameLayout，RelativeGuide与setLayoutRes都会成为FrameLayout的子view，两者可以共存，\nsetLayoutRes在下层，多个RelativeGuide按照添加顺序依次添加。\n\n各个方向的对齐方式如下图所示：\n\n![sample](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/relative_default_gravity.png)\n\n如Gravity.LEFT 的top与高亮view的top对齐，如果想改变，可以通过在传入布局的根布局添加marginTop。\n或者还可以继承RelativeGuide并复写offsetMargin方法修改位置，具体细节可查看RelativeGuide类。\n\n### 引导页控制（v2.2.1版本新增）\n\nv2.2.1版本Controller新增两个方法用于控制引导页的回退，可以在OnLayoutInflatedListener接口的回调方法中获取到controller对象，执行相应的操作。\n\n```\n.setOnLayoutInflatedListener(new OnLayoutInflatedListener() {\n             @Override\n             public void onLayoutInflated(View view, final Controller controller) {\n                        view.findViewById(R.id.btn_ok).setOnClickListener(new View.OnClickListener() {\n                              @Override\n                              public void onClick(View v) {\n                                  controller.showPage(0);\n                              }\n                        });\n             }\n})\n```\n\n### 背景色\n\n引导页的背景色不要在xml中设置，通过`GuidePage.setBackgroundColor()`设置引导页的背景色，不同引导页可以有不同背景色，默认是0xb2000000，建议设置有透明度的背景色。\n\n### anchor\n\n默认的话引导层是添加在DecorView中的，我借鉴了[Highlight](https://github.com/hongyangAndroid/Highlight)的anchor概念，可以改变引导层添加到的view，实现局部引导层的显示。通过调用`.anchor(view)`传入anchorView，即为引导层的根布局。\n```\nfinal View anchorView = findViewById(R.id.ll_anchor);\n\nNewbieGuide.with(FirstActivity.this)\n        .setLabel(\"anchor\")                        .anchor(anchorView)\n        .alwaysShow(true)//总是显示，调试时可以打开\n        .addGuidePage(GuidePage.newInstance()                                .addHighLight(btnAnchor, HighLight.Shape.CIRCLE, 5)\n                .setLayoutRes(R.layout.view_guide_anchor))\n        .show();\n```\n这里实现了具体显示引导层。\n\n![anchor](https://github.com/huburt-Hu/NewbieGuide/raw/master/screenshoot/anchor.png)\n\n引导层其实是一个FrameLayout，设置anchor之后，引导层的大小就与anchor所占的位置相同。默认是android.R.id.content。setLayoutRes方法设置的说明布局则会添加到引导层的FrameLayout中。\n\n### 引导层显示隐藏监听\n\nsetOnGuideChangedListener添加引导层的显示隐藏监听，一个label表示一个引导层，一个引导层可以有多个引导页，引导页切换不会触发该监听。\n\n```\nNewbieGuide.with(FirstActivity.this)\n    .setLabel(\"listener\")\n    .alwaysShow(true)//总是显示，调试时可以打开\n    .setOnGuideChangedListener(new OnGuideChangedListener() {\n        @Override\n        public void onShowed(Controller controller) {\n            Toast.makeText(FirstActivity.this, \"引导层显示\", Toast.LENGTH_SHORT).show();\n        }\n\n        @Override\n        public void onRemoved(Controller controller) {\n            Toast.makeText(FirstActivity.this, \"引导层消失\", Toast.LENGTH_SHORT).show();\n        }\n    })\n    .addGuidePage(GuidePage.newInstance().addHighLight(btnListener))\n    .show();\n```\n\n### 多页引导页与监听\n\n```\n.setOnPageChangedListener(new OnPageChangedListener() {\n    @Override\n    public void onPageChanged(int page) {\n         //引导页切换，page为当前页位置，从0开始\n        Toast.makeText(MainActivity.this, \"引导页切换：\" + page, Toast.LENGTH_SHORT).show();\n    }\n})\n.addGuidePage(//添加一页引导页\n    GuidePage.newInstance()//创建一个实例\n       .addHighLight(button)//添加高亮的view\n        .addHighLight(tvBottom, HighLight.Shape.RECTANGLE)\n        .setLayoutRes(R.layout.view_guide)//设置引导页布局\n        .setOnLayoutInflatedListener(new OnLayoutInflatedListener() {\n            @Override\n            public void onLayoutInflated(View view, Controller controller) {\n                //引导页布局填充后回调，用于初始化\n                TextView tv = view.findViewById(R.id.textView2);\n                tv.setText(\"我是动态设置的文本\");\n            }\n        })\n    .setEnterAnimation(enterAnimation)//进入动画\n    .setExitAnimation(exitAnimation)//退出动画\n                )\n.addGuidePage(\n      GuidePage.newInstance()\n        .addHighLight(tvBottom, HighLight.Shape.RECTANGLE, 20)\n        .setLayoutRes(R.layout.view_guide_custom, R.id.iv)//引导页布局，点击跳转下一页或者消失引导层的控件id\n       .setEverywhereCancelable(false)//是否点击任意地方跳转下一页或者消失引导层，默认true\n        .setBackgroundColor(getResources().getColor(R.color.testColor))//设置背景色，建议使用有透明度的颜色\n        .setEnterAnimation(enterAnimation)//进入动画\n        .setExitAnimation(exitAnimation)//退出动画\n    )\n```\n\n### 引导页切换动画\n\n如上面的例子所示，还可以添加引导页的切换动画\n\n```\nAnimation enterAnimation = new AlphaAnimation(0f, 1f);\nenterAnimation.setDuration(600);\nenterAnimation.setFillAfter(true);\n\nAnimation exitAnimation = new AlphaAnimation(1f, 0f);\nexitAnimation.setDuration(600);\nexitAnimation.setFillAfter(true);\n\nGuidePage.setEnterAnimation(enterAnimation)//进入动画\nGuidePage.setExitAnimation(exitAnimation)//退出动画\n```\n\n\n\n\n\n## [Q&A](https://github.com/huburt-Hu/NewbieGuide/wiki/Q&A)\n\n遇到问题可以看查看Q&A\n\n## 关于我\n\nGithub：https://github.com/huburt-Hu\n\nCSDN：http://blog.csdn.net/Hubert_bing\n\n简书：https://www.jianshu.com/u/002f99a0df6b\n\n掘金：https://juejin.im/user/57bb1fdcc4c971006152d7b0/posts\n\n\n\n## License\n\n\n```\n Copyright 2017 huburt-Hu\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n```\n\n"
        },
        {
          "name": "app",
          "type": "tree",
          "content": null
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 0.7353515625,
          "content": "// Top-level build file where you can add configuration options common to all sub-projects/modules.\n\nbuildscript {\n    repositories {\n        jcenter()\n        google()\n    }\n    dependencies {\n        classpath 'com.android.tools.build:gradle:3.1.2'\n\n        // NOTE: Do not place your application dependencies here; they belong\n        // in the individual module build.gradle files\n\n        classpath 'com.github.dcendents:android-maven-gradle-plugin:2.0'\n    }\n}\n\nallprojects {\n    repositories {\n        jcenter()\n        maven { url \"https://jitpack.io\" }\n        google()\n    }\n}\n\ntask clean(type: Delete) {\n    delete rootProject.buildDir\n}\n\next{\n    supportLibraryVersion = \"27.0.0\"\n    compileSdkVersion = 26\n    buildToolsVersion = '27.0.3'\n}"
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 0.712890625,
          "content": "# Project-wide Gradle settings.\n\n# IDE (e.g. Android Studio) users:\n# Gradle settings configured through the IDE *will override*\n# any settings specified in this file.\n\n# For more details on how to configure your build environment visit\n# http://www.gradle.org/docs/current/userguide/build_environment.html\n\n# Specifies the JVM arguments used for the daemon process.\n# The setting is particularly useful for tweaking memory settings.\norg.gradle.jvmargs=-Xmx1536m\n\n# When configured, Gradle will run in incubating parallel mode.\n# This option should only be used with decoupled projects. More details, visit\n# http://www.gradle.org/docs/current/userguide/multi_project_builds.html#sec:decoupled_projects\n# org.gradle.parallel=true\n"
        },
        {
          "name": "gradle",
          "type": "tree",
          "content": null
        },
        {
          "name": "gradlew",
          "type": "blob",
          "size": 4.85546875,
          "content": "#!/usr/bin/env bash\n\n##############################################################################\n##\n##  Gradle start up script for UN*X\n##\n##############################################################################\n\n# Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nDEFAULT_JVM_OPTS=\"\"\n\nAPP_NAME=\"Gradle\"\nAPP_BASE_NAME=`basename \"$0\"`\n\n# Use the maximum available, or set MAX_FD != -1 to use that value.\nMAX_FD=\"maximum\"\n\nwarn ( ) {\n    echo \"$*\"\n}\n\ndie ( ) {\n    echo\n    echo \"$*\"\n    echo\n    exit 1\n}\n\n# OS specific support (must be 'true' or 'false').\ncygwin=false\nmsys=false\ndarwin=false\ncase \"`uname`\" in\n  CYGWIN* )\n    cygwin=true\n    ;;\n  Darwin* )\n    darwin=true\n    ;;\n  MINGW* )\n    msys=true\n    ;;\nesac\n\n# Attempt to set APP_HOME\n# Resolve links: $0 may be a link\nPRG=\"$0\"\n# Need this for relative symlinks.\nwhile [ -h \"$PRG\" ] ; do\n    ls=`ls -ld \"$PRG\"`\n    link=`expr \"$ls\" : '.*-> \\(.*\\)$'`\n    if expr \"$link\" : '/.*' > /dev/null; then\n        PRG=\"$link\"\n    else\n        PRG=`dirname \"$PRG\"`\"/$link\"\n    fi\ndone\nSAVED=\"`pwd`\"\ncd \"`dirname \\\"$PRG\\\"`/\" >/dev/null\nAPP_HOME=\"`pwd -P`\"\ncd \"$SAVED\" >/dev/null\n\nCLASSPATH=$APP_HOME/gradle/wrapper/gradle-wrapper.jar\n\n# Determine the Java command to use to start the JVM.\nif [ -n \"$JAVA_HOME\" ] ; then\n    if [ -x \"$JAVA_HOME/jre/sh/java\" ] ; then\n        # IBM's JDK on AIX uses strange locations for the executables\n        JAVACMD=\"$JAVA_HOME/jre/sh/java\"\n    else\n        JAVACMD=\"$JAVA_HOME/bin/java\"\n    fi\n    if [ ! -x \"$JAVACMD\" ] ; then\n        die \"ERROR: JAVA_HOME is set to an invalid directory: $JAVA_HOME\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\n    fi\nelse\n    JAVACMD=\"java\"\n    which java >/dev/null 2>&1 || die \"ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\n\nPlease set the JAVA_HOME variable in your environment to match the\nlocation of your Java installation.\"\nfi\n\n# Increase the maximum file descriptors if we can.\nif [ \"$cygwin\" = \"false\" -a \"$darwin\" = \"false\" ] ; then\n    MAX_FD_LIMIT=`ulimit -H -n`\n    if [ $? -eq 0 ] ; then\n        if [ \"$MAX_FD\" = \"maximum\" -o \"$MAX_FD\" = \"max\" ] ; then\n            MAX_FD=\"$MAX_FD_LIMIT\"\n        fi\n        ulimit -n $MAX_FD\n        if [ $? -ne 0 ] ; then\n            warn \"Could not set maximum file descriptor limit: $MAX_FD\"\n        fi\n    else\n        warn \"Could not query maximum file descriptor limit: $MAX_FD_LIMIT\"\n    fi\nfi\n\n# For Darwin, add options to specify how the application appears in the dock\nif $darwin; then\n    GRADLE_OPTS=\"$GRADLE_OPTS \\\"-Xdock:name=$APP_NAME\\\" \\\"-Xdock:icon=$APP_HOME/media/gradle.icns\\\"\"\nfi\n\n# For Cygwin, switch paths to Windows format before running java\nif $cygwin ; then\n    APP_HOME=`cygpath --path --mixed \"$APP_HOME\"`\n    CLASSPATH=`cygpath --path --mixed \"$CLASSPATH\"`\n    JAVACMD=`cygpath --unix \"$JAVACMD\"`\n\n    # We build the pattern for arguments to be converted via cygpath\n    ROOTDIRSRAW=`find -L / -maxdepth 1 -mindepth 1 -shape d 2>/dev/null`\n    SEP=\"\"\n    for dir in $ROOTDIRSRAW ; do\n        ROOTDIRS=\"$ROOTDIRS$SEP$dir\"\n        SEP=\"|\"\n    done\n    OURCYGPATTERN=\"(^($ROOTDIRS))\"\n    # Add a user-defined pattern to the cygpath arguments\n    if [ \"$GRADLE_CYGPATTERN\" != \"\" ] ; then\n        OURCYGPATTERN=\"$OURCYGPATTERN|($GRADLE_CYGPATTERN)\"\n    fi\n    # Now convert the arguments - kludge to limit ourselves to /bin/sh\n    i=0\n    for arg in \"$@\" ; do\n        CHECK=`echo \"$arg\"|egrep -c \"$OURCYGPATTERN\" -`\n        CHECK2=`echo \"$arg\"|egrep -c \"^-\"`                                 ### Determine if an option\n\n        if [ $CHECK -ne 0 ] && [ $CHECK2 -eq 0 ] ; then                    ### Added a condition\n            eval `echo args$i`=`cygpath --path --ignore --mixed \"$arg\"`\n        else\n            eval `echo args$i`=\"\\\"$arg\\\"\"\n        fi\n        i=$((i+1))\n    done\n    case $i in\n        (0) set -- ;;\n        (1) set -- \"$args0\" ;;\n        (2) set -- \"$args0\" \"$args1\" ;;\n        (3) set -- \"$args0\" \"$args1\" \"$args2\" ;;\n        (4) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" ;;\n        (5) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" ;;\n        (6) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" ;;\n        (7) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" ;;\n        (8) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" ;;\n        (9) set -- \"$args0\" \"$args1\" \"$args2\" \"$args3\" \"$args4\" \"$args5\" \"$args6\" \"$args7\" \"$args8\" ;;\n    esac\nfi\n\n# Split up the JVM_OPTS And GRADLE_OPTS values into an array, following the shell quoting and substitution rules\nfunction splitJvmOpts() {\n    JVM_OPTS=(\"$@\")\n}\neval splitJvmOpts $DEFAULT_JVM_OPTS $JAVA_OPTS $GRADLE_OPTS\nJVM_OPTS[${#JVM_OPTS[*]}]=\"-Dorg.gradle.appname=$APP_BASE_NAME\"\n\nexec \"$JAVACMD\" \"${JVM_OPTS[@]}\" -classpath \"$CLASSPATH\" org.gradle.wrapper.GradleWrapperMain \"$@\"\n"
        },
        {
          "name": "gradlew.bat",
          "type": "blob",
          "size": 2.259765625,
          "content": "@if \"%DEBUG%\" == \"\" @echo off\n@rem ##########################################################################\n@rem\n@rem  Gradle startup script for Windows\n@rem\n@rem ##########################################################################\n\n@rem Set local scope for the variables with windows NT shell\nif \"%OS%\"==\"Windows_NT\" setlocal\n\n@rem Add default JVM options here. You can also use JAVA_OPTS and GRADLE_OPTS to pass JVM options to this script.\nset DEFAULT_JVM_OPTS=\n\nset DIRNAME=%~dp0\nif \"%DIRNAME%\" == \"\" set DIRNAME=.\nset APP_BASE_NAME=%~n0\nset APP_HOME=%DIRNAME%\n\n@rem Find java.exe\nif defined JAVA_HOME goto findJavaFromJavaHome\n\nset JAVA_EXE=java.exe\n%JAVA_EXE% -version >NUL 2>&1\nif \"%ERRORLEVEL%\" == \"0\" goto init\n\necho.\necho ERROR: JAVA_HOME is not set and no 'java' command could be found in your PATH.\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:findJavaFromJavaHome\nset JAVA_HOME=%JAVA_HOME:\"=%\nset JAVA_EXE=%JAVA_HOME%/bin/java.exe\n\nif exist \"%JAVA_EXE%\" goto init\n\necho.\necho ERROR: JAVA_HOME is set to an invalid directory: %JAVA_HOME%\necho.\necho Please set the JAVA_HOME variable in your environment to match the\necho location of your Java installation.\n\ngoto fail\n\n:init\n@rem Get command-line arguments, handling Windowz variants\n\nif not \"%OS%\" == \"Windows_NT\" goto win9xME_args\nif \"%@eval[2+2]\" == \"4\" goto 4NT_args\n\n:win9xME_args\n@rem Slurp the command line arguments.\nset CMD_LINE_ARGS=\nset _SKIP=2\n\n:win9xME_args_slurp\nif \"x%~1\" == \"x\" goto execute\n\nset CMD_LINE_ARGS=%*\ngoto execute\n\n:4NT_args\n@rem Get arguments from the 4NT Shell from JP Software\nset CMD_LINE_ARGS=%$\n\n:execute\n@rem Setup the command line\n\nset CLASSPATH=%APP_HOME%\\gradle\\wrapper\\gradle-wrapper.jar\n\n@rem Execute Gradle\n\"%JAVA_EXE%\" %DEFAULT_JVM_OPTS% %JAVA_OPTS% %GRADLE_OPTS% \"-Dorg.gradle.appname=%APP_BASE_NAME%\" -classpath \"%CLASSPATH%\" org.gradle.wrapper.GradleWrapperMain %CMD_LINE_ARGS%\n\n:end\n@rem End local scope for the variables with windows NT shell\nif \"%ERRORLEVEL%\"==\"0\" goto mainEnd\n\n:fail\nrem Set variable GRADLE_EXIT_CONSOLE if you need the _script_ return code instead of\nrem the _cmd.exe /c_ return code!\nif  not \"\" == \"%GRADLE_EXIT_CONSOLE%\" exit 1\nexit /b 1\n\n:mainEnd\nif \"%OS%\"==\"Windows_NT\" endlocal\n\n:omega\n"
        },
        {
          "name": "guide",
          "type": "tree",
          "content": null
        },
        {
          "name": "screenshoot",
          "type": "tree",
          "content": null
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 0.0244140625,
          "content": "include ':app', ':guide'\n"
        }
      ]
    }
  ]
}