{
  "metadata": {
    "timestamp": 1736609120062,
    "page": 397,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjQwMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "eclipse-openj9/openj9",
      "stars": 3340,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 1.3115234375,
          "content": "# Copyright IBM Corp. and others 2000\n#\n# This program and the accompanying materials are made available under\n# the terms of the Eclipse Public License 2.0 which accompanies this\n# distribution and is available at https://www.eclipse.org/legal/epl-2.0/\n# or the Apache License, Version 2.0 which accompanies this distribution and\n# is available at https://www.apache.org/licenses/LICENSE-2.0.\n#\n# This Source Code may also be made available under the following\n# Secondary Licenses when the conditions for such availability set\n# forth in the Eclipse Public License, v. 2.0 are satisfied: GNU\n# General Public License, version 2 with the GNU Classpath\n# Exception [1] and GNU General Public License, version 2 with the\n# OpenJDK Assembly Exception [2].\n#\n# [1] https://www.gnu.org/software/classpath/license.html\n# [2] https://openjdk.org/legal/assembly-exception.html\n#\n# SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n\n# Binary files\n*.blob binary\n*.gif binary\n*.jar binary\n*.jpg binary\n*.png binary\n*.zip binary\ntest/functional/cmdLineTests/jvmtitests/jars/test.fil binary\ntest/functional/cmdLineTests/URLClassLoaderTests/SignedSealed/benKeyStore binary\ntest/functional/cmdLineTests/URLClassLoaderTests/SignedSealed/benKeyStore.forMVS binary\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 1.5166015625,
          "content": "# Copyright IBM Corp. and others 2000\n#\n# This program and the accompanying materials are made available under\n# the terms of the Eclipse Public License 2.0 which accompanies this\n# distribution and is available at https://www.eclipse.org/legal/epl-2.0/\n# or the Apache License, Version 2.0 which accompanies this distribution and\n# is available at https://www.apache.org/licenses/LICENSE-2.0.\n#\n# This Source Code may also be made available under the following\n# Secondary Licenses when the conditions for such availability set\n# forth in the Eclipse Public License, v. 2.0 are satisfied: GNU\n# General Public License, version 2 with the GNU Classpath\n# Exception [1] and GNU General Public License, version 2 with the\n# OpenJDK Assembly Exception [2].\n#\n# [1] https://www.gnu.org/software/classpath/license.html\n# [2] https://openjdk.org/legal/assembly-exception.html\n#\n# SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n\n*.jar\n*.zip\n*.dll\n*.class\nomr\n\n# 8096* and com.ibm.jvmti.tests are currently in different repos and copied into the build $workspace\ncom.ibm.jvmti.tests\n8096_Base\n8096_Bootstrap\n8096_Utils\n\n# Root level .project should be ignored as Eclipse automatically creates this file when new repositories are added as Projects for C/C++ indexing\n/.cproject\n/.project\n/.settings/\n\n# Visual Studio\n/.vs\n/.vscode/\n\n# IntelliJ CLion\n.idea\n\n# Default test directory (BUILD_ROOT)\n/jvmtest/\n/build/\n.DS_Store\ndoc/.DS_Store\ndoc/release-notes/.DS_Store\n"
        },
        {
          "name": "CMakeLists.txt",
          "type": "blob",
          "size": 1.9189453125,
          "content": "################################################################################\n# Copyright IBM Corp. and others 2018\n#\n# This program and the accompanying materials are made available under\n# the terms of the Eclipse Public License 2.0 which accompanies this\n# distribution and is available at https://www.eclipse.org/legal/epl-2.0/\n# or the Apache License, Version 2.0 which accompanies this distribution and\n# is available at https://www.apache.org/licenses/LICENSE-2.0.\n#\n# This Source Code may also be made available under the following\n# Secondary Licenses when the conditions for such availability set\n# forth in the Eclipse Public License, v. 2.0 are satisfied: GNU\n# General Public License, version 2 with the GNU Classpath\n# Exception [1] and GNU General Public License, version 2 with the\n# OpenJDK Assembly Exception [2].\n#\n# [1] https://www.gnu.org/software/classpath/license.html\n# [2] https://openjdk.org/legal/assembly-exception.html\n#\n# SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n################################################################################\n\ncmake_minimum_required(VERSION 3.4 FATAL_ERROR)\n\nproject(openj9)\n\nif(\"${BOOT_JDK}\" STREQUAL \"\")\n\tmessage(FATAL_ERROR \"BOOT_JDK must be defined\")\nendif()\n\nmessage(STATUS \"Using BOOT_JDK: '${BOOT_JDK}'\")\n\n# These variables are used by \"Java\" language support.\nfind_program(CMAKE_Java_COMPILER NAMES javac PATHS ${BOOT_JDK}/bin NO_DEFAULT_PATH)\nfind_program(CMAKE_Java_RUNTIME  NAMES java  PATHS ${BOOT_JDK}/bin NO_DEFAULT_PATH)\nfind_program(CMAKE_Java_AR       NAMES jar   PATHS ${BOOT_JDK}/bin NO_DEFAULT_PATH)\n\n# Variables used by the \"UseJava\" module (predates \"Java\" language support)\nset(Java_JAVA_EXECUTABLE ${CMAKE_Java_RUNTIME})\nset(Java_JAVAC_EXECUTABLE ${CMAKE_Java_COMPILER})\nset(Java_JAR_EXECUTABLE ${CMAKE_Java_AR})\n\nadd_subdirectory(sourcetools)\nadd_subdirectory(runtime)\n"
        },
        {
          "name": "CODEOWNERS",
          "type": "blob",
          "size": 1.3017578125,
          "content": "###############################################################################\n# Copyright IBM Corp. and others 2023\n#\n# This program and the accompanying materials are made available under\n# the terms of the Eclipse Public License 2.0 which accompanies this\n# distribution and is available at https://www.eclipse.org/legal/epl-2.0/\n# or the Apache License, Version 2.0 which accompanies this distribution and\n# is available at https://www.apache.org/licenses/LICENSE-2.0.\n#\n# This Source Code may also be made available under the following\n# Secondary Licenses when the conditions for such availability set\n# forth in the Eclipse Public License, v. 2.0 are satisfied: GNU\n# General Public License, version 2 with the GNU Classpath\n# Exception [1] and GNU General Public License, version 2 with the\n# OpenJDK Assembly Exception [2].\n#\n# [1] https://www.gnu.org/software/classpath/license.html\n# [2] https://openjdk.org/legal/assembly-exception.html\n#\n# SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n###############################################################################\n\n# Compiler\n/runtime/compiler/control/ @dsouzai\n/runtime/compiler/env/ @dsouzai\n/runtime/compiler/exceptions/ @dsouzai\n/runtime/compiler/runtime/ @dsouzai\n"
        },
        {
          "name": "CODE_OF_CONDUCT.md",
          "type": "blob",
          "size": 9.5732421875,
          "content": "# Community Code of Conduct\n\n**Version 2.0\nJanuary 1, 2023**\n\n## Our Pledge\n\nIn the interest of fostering an open and welcoming environment, we as community members, contributors, Committers[^1], and Project Leads (collectively \"Contributors\") pledge to make participation in our projects and our community a harassment-free and inclusive experience for everyone.\n\nThis Community Code of Conduct (\"Code\") outlines our behavior expectations as members of our community in all Eclipse Foundation activities, both offline and online. It is not intended to govern scenarios or behaviors outside of the scope of Eclipse Foundation activities. Nor is it intended to replace or supersede the protections offered to all our community members under the law. Please follow both the spirit and letter of this Code and encourage other Contributors to follow these principles into our work. Failure to read or acknowledge this Code does not excuse a Contributor from compliance with the Code.\n\n## Our Standards\n\nExamples of behavior that contribute to creating a positive and professional environment include:\n\n- Using welcoming and inclusive language;\n- Actively encouraging all voices;\n- Helping others bring their perspectives and listening actively. If you find yourself dominating a discussion, it is especially important to encourage other voices to join in;\n- Being respectful of differing viewpoints and experiences;\n- Gracefully accepting constructive criticism;\n- Focusing on what is best for the community;\n- Showing empathy towards other community members;\n- Being direct but professional; and\n- Leading by example by holding yourself and others accountable\n\nExamples of unacceptable behavior by Contributors include:\n\n- The use of sexualized language or imagery;\n- Unwelcome sexual attention or advances;\n- Trolling, insulting/derogatory comments, and personal or political attacks;\n- Public or private harassment, repeated harassment;\n- Publishing others' private information, such as a physical or electronic address, without explicit permission;\n- Violent threats or language directed against another person;\n- Sexist, racist, or otherwise discriminatory jokes and language;\n- Posting sexually explicit or violent material;\n- Sharing private content, such as emails sent privately or non-publicly, or unlogged forums such as IRC channel history;\n- Personal insults, especially those using racist or sexist terms;\n- Excessive or unnecessary profanity;\n- Advocating for, or encouraging, any of the above behavior; and\n- Other conduct which could reasonably be considered inappropriate in a professional setting\n\n## Our Responsibilities\n\nWith the support of the Eclipse Foundation employees, consultants, officers, and directors (collectively, the \"Staff\"), Committers, and Project Leads, the Eclipse Foundation Conduct Committee (the \"Conduct Committee\") is responsible for clarifying the standards of acceptable behavior. The Conduct Committee takes appropriate and fair corrective action in response to any instances of unacceptable behavior.\n\n## Scope\n\nThis Code applies within all Project, Working Group, and Interest Group spaces and communication channels of the Eclipse Foundation (collectively, \"Eclipse spaces\"), within any Eclipse-organized event or meeting, and in public spaces when an individual is representing an Eclipse Foundation Project, Working Group, Interest Group, or their communities. Examples of representing a Project or community include posting via an official social media account, personal accounts, or acting as an appointed representative at an online or offline event. Representation of Projects, Working Groups, and Interest Groups may be further defined and clarified by Committers, Project Leads, or the Staff.\n\n## Enforcement\n\nInstances of abusive, harassing, or otherwise unacceptable behavior may be reported by contacting the Conduct Committee via conduct@eclipse-foundation.org. All complaints will be reviewed and investigated and will result in a response that is deemed necessary and appropriate to the circumstances. Without the explicit consent of the reporter, the Conduct Committee is obligated to maintain confidentiality with regard to the reporter of an incident. The Conduct Committee is further obligated to ensure that the respondent is provided with sufficient information about the complaint to reply. If such details cannot be provided while maintaining confidentiality, the Conduct Committee will take the respondent‘s inability to provide a defense into account in its deliberations and decisions. Further details of enforcement guidelines may be posted separately.\n\nStaff, Committers and Project Leads have the right to report, remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code, or to block temporarily or permanently any Contributor for other behaviors that they deem inappropriate, threatening, offensive, or harmful. Any such actions will be reported to the Conduct Committee for transparency and record keeping.\n\nAny Staff (including officers and directors of the Eclipse Foundation), Committers, Project Leads, or Conduct Committee members who are the subject of a complaint to the Conduct Committee will be recused from the process of resolving any such complaint.\n\n## Responsibility\n\nThe responsibility for administering this Code rests with the Conduct Committee, with oversight by the Executive Director and the Board of Directors. For additional information on the Conduct Committee and its process, please write to <conduct@eclipse-foundation.org>.\n\n## Investigation of Potential Code Violations\n\nAll conflict is not bad as a healthy debate may sometimes be necessary to push us to do our best. It is, however, unacceptable to be disrespectful or offensive, or violate this Code. If you see someone engaging in objectionable behavior violating this Code, we encourage you to address the behavior directly with those involved. If for some reason, you are unable to resolve the matter or feel uncomfortable doing so, or if the behavior is threatening or harassing, please report it following the procedure laid out below.\n\nReports should be directed to <conduct@eclipse-foundation.org>. It is the Conduct Committee’s role to receive and address reported violations of this Code and to ensure a fair and speedy resolution.\n\nThe Eclipse Foundation takes all reports of potential Code violations seriously and is committed to confidentiality and a full investigation of all allegations. The identity of the reporter will be omitted from the details of the report supplied to the accused. Contributors who are being investigated for a potential Code violation will have an opportunity to be heard prior to any final determination. Those found to have violated the Code can seek reconsideration of the violation and disciplinary action decisions. Every effort will be made to have all matters disposed of within 60 days of the receipt of the complaint.\n\n## Actions\nContributors who do not follow this Code in good faith may face temporary or permanent repercussions as determined by the Conduct Committee.\n\nThis Code does not address all conduct. It works in conjunction with our [Communication Channel Guidelines](https://www.eclipse.org/org/documents/communication-channel-guidelines/), [Social Media Guidelines](https://www.eclipse.org/org/documents/social_media_guidelines.php), [Bylaws](https://www.eclipse.org/org/documents/eclipse-foundation-be-bylaws-en.pdf), and [Internal Rules](https://www.eclipse.org/org/documents/ef-be-internal-rules.pdf) which set out additional protections for, and obligations of, all contributors. The Foundation has additional policies that provide further guidance on other matters.\n\nIt’s impossible to spell out every possible scenario that might be deemed a violation of this Code. Instead, we rely on one another’s good judgment to uphold a high standard of integrity within all Eclipse Spaces. Sometimes, identifying the right thing to do isn’t an easy call. In such a scenario, raise the issue as early as possible.\n\n## No Retaliation\n\nThe Eclipse community relies upon and values the help of Contributors who identify potential problems that may need to be addressed within an Eclipse Space. Any retaliation against a Contributor who raises an issue honestly is a violation of this Code. That a Contributor has raised a concern honestly or participated in an investigation, cannot be the basis for any adverse action, including threats, harassment, or discrimination. If you work with someone who has raised a concern or provided information in an investigation, you should continue to treat the person with courtesy and respect. If you believe someone has retaliated against you, report the matter as described by this Code. Honest reporting does not mean that you have to be right when you raise a concern; you just have to believe that the information you are providing is accurate.\n\nFalse reporting, especially when intended to retaliate or exclude, is itself a violation of this Code and will not be accepted or tolerated.\n\nEveryone is encouraged to ask questions about this Code. Your feedback is welcome, and you will get a response within three business days. Write to <conduct@eclipse-foundation.org>.\n\n## Amendments\n\nThe Eclipse Foundation Board of Directors may amend this Code from time to time and may vary the procedures it sets out where appropriate in a particular case.\n\n### Attribution\n\nThis Code was inspired by the [Contributor Covenant](https://www.contributor-covenant.org/), version 1.4, available [here](https://www.contributor-covenant.org/version/1/4/code-of-conduct/).\n\n[^1]: Capitalized terms used herein without definition shall have the meanings assigned to them in the Bylaws.\n"
        },
        {
          "name": "CONTRIBUTING.md",
          "type": "blob",
          "size": 16.744140625,
          "content": "<!--\nCopyright IBM Corp. and others 2017\n\nThis program and the accompanying materials are made available under\nthe terms of the Eclipse Public License 2.0 which accompanies this\ndistribution and is available at https://www.eclipse.org/legal/epl-2.0/\nor the Apache License, Version 2.0 which accompanies this distribution and\nis available at https://www.apache.org/licenses/LICENSE-2.0.\n\nThis Source Code may also be made available under the following\nSecondary Licenses when the conditions for such availability set\nforth in the Eclipse Public License, v. 2.0 are satisfied: GNU\nGeneral Public License, version 2 with the GNU Classpath\nException [1] and GNU General Public License, version 2 with the\nOpenJDK Assembly Exception [2].\n\n[1] https://www.gnu.org/software/classpath/license.html\n[2] https://openjdk.org/legal/assembly-exception.html\n\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n-->\n\n# Contributing to Eclipse OpenJ9\n\nThank you for your interest in Eclipse OpenJ9!\n\nWe welcome and encourage all kinds of contributions to the project, not only\ncode. This includes bug reports, user experience feedback, assistance in\nreproducing issues and more. Contributions to the website\n(https://github.com/eclipse-openj9/openj9-website), to the user documentation\n(https://github.com/eclipse-openj9/openj9-docs), to the system verification tests\n(https://github.com/eclipse-openj9/openj9-systemtest), or to Eclipse OMR\n(https://github.com/eclipse-omr/omr), which is an integral part of OpenJ9 are all\nalso welcome.\n\n\n## Submitting a contribution to OpenJ9\n\nYou can propose contributions by sending pull requests (PRs) through GitHub.\nFollowing these guidelines will help us merge your pull requests smoothly:\n\n1. Your pull request is an opportunity to explain both what changes you'd like\n   pulled in, but also _why_ you'd like them added. Providing clarity on why\n   you want changes makes it easier to accept, and provides valuable context to\n   review.\n\n2. Follow the commit guidelines found below.\n\n3. We encourage you to open a pull request early, and mark it as \"Work In\n   Progress\", by prefixing the PR title with \"WIP\". This allows feedback to\n   start early, and helps create a better end product. Committers will wait\n   until after you've removed the WIP prefix to merge your changes.\n\n4. If your contribution introduces an external change that requires an update\n   to the [user documentation](https://www.eclipse.org/openj9/docs/), add the\n   label `doc:externals` to the OpenJ9 issue, or request a committer to do it,\n   and open an [issue](https://github.com/eclipse-openj9/openj9-docs/issues/new?template=new-documentation-change.md)\n   at the user documentation repository. The OpenJ9 pull request should be labeled with `depends:doc` as well. Committers\n   should not merge the OpenJ9 pull request until at least a doc issue is created, and ideally not until the doc pull\n   request is ready for merge. Rather than doing it separately, the pull request should add or update the\n   [release notes](https://github.com/eclipse-openj9/openj9/tree/master/doc/release-notes) for the next release with a\n   short summary of the change. Examples of an external change include\n   a new command line option, a change in behavior, or a restriction.\n\n   A [pull request](https://github.com/eclipse-openj9/openj9-docs/pulls) to update the documentation is required. Do your best\n   to make appropriate updates, and the reviewers will help guide the necessary doc changes.\n\n5. Contributions from generative artificial intelligence (GenAI) coding assistants\n   are permitted subject to the\n   [GenAI Usage Guidelines](#Generative-Artificial-Intelligence-Usage-Guidelines)\n   described below.\n\n6. Please carefully read and adhere to the legal considerations and\n   copyright/license requirements outlined below.\n\n7. Ensure your changes are compatible with the checks that will be applied to your pull request.\n   - Text files should use the proper line-endings and there should be no unwanted whitespace. You can enable the sample `pre-commit` hook created by `git init` to ensure you adhere to expectations.\n\n## Building and testing\n\nIn order to build OpenJ9, see the [build instructions](https://github.com/eclipse-openj9/openj9/tree/master/doc/build-instructions).\nOnce the build system is prepared, building consists of a few simple steps. If\nbuilding the original source fails, check the [level of the compiler](https://eclipse-openj9.github.io/openj9-docs/openj9_support/)\nbeing used.\n\n\nThere are a large number of test cases that are run automatically as part of\nthe Eclipse OpenJ9 build and test pipeline. The tests can be triggered by\ncommitters from pull requests. You can see the latest results on the\n[Eclipse OpenJ9 Jenkins instance](https://openj9-jenkins.osuosl.org/).\n\nThe tests can also be run manually on your own machine, refer to the\n[OpenJ9 test quick start guide](https://github.com/eclipse-openj9/openj9/blob/master/test/README.md).\n\n\n## Commit Guidelines\n\nThe first line describes the change made. It is written in the imperative mood,\nand should say what happens when the patch is applied. Keep it short and\nsimple. The first line should be less than 70 characters, where reasonable,\nand should be written in sentence case (capitalize the first letter) preferably not ending in a period.\nLeave a blank line between the first line and the message body.\n\nThe body should be wrapped at 72 characters, where reasonable.\n\nInclude as much information in your commit as possible. You may want to include\ndesigns and rationale, examples and code, or issues and next steps. Prefer\ncopying resources into the body of the commit over providing external links.\nStructure large commit messages with headers, references etc. Remember, however,\nthat the commit message is always going to be rendered in plain text.\n\nPlease add `[skip ci]` to the commit message when the change doesn't require a\ncompilation, such as documentation only changes, to avoid unnecessarily wasting\nthe project's build resources.\n\nWhen a commit has related issues or commits, explain the relation in the message\nbody. When appropriate, use the keywords described in the following help article\nto automatically close issues.\nhttps://help.github.com/articles/closing-issues-using-keywords/\nFor example:\n\n```\nCorrect race in frobnicator\n\nThis patch eliminates the race condition in issue #1234.\n\nFixes: #1234\n```\n\nSign off on your commit in the footer. By doing this, you assert original\nauthorship of the commit and that you are permitted to contribute it. This can\nbe automatically added to your commit by passing `-s` to `git commit`, or by\nmanually adding the following line to the footer of the commit.\n\n```\nSigned-off-by: Full Name <email>\n```\n\nRemember, if a blank line is found anywhere after the `Signed-off-by` line, the\n`Signed-off-by:` will be considered outside of the footer, and will fail the\nautomated Signed-off-by validation. The email used to sign off the commit must\nbe the same, including case-sensitivity, as the one used to sign the Eclipse ECA,\nor your commit will fail IP validation.\n\nIt is important that you read and understand the legal considerations found\nbelow when signing off or contributing any commit.\n\n### Example commits\n\nHere is an example of a *good* commit:\n\n```\nUpdate and expand the commit guidelines\n\nElaborate on the style guidelines for commit messages. These new\nstyle guidelines reflect the conversation found in #124.\n\nThe guidelines are changed to:\n- Provide guidance on how to write a good first line.\n- Elaborate on formatting requirements.\n- Relax the advice on using issues for nontrivial commits.\n- Move issue references from the first line to the message footer.\n- Encourage contributors to put more information into the commit\n  message.\n\nCloses: #124\nSigned-off-by: Robert Young <rwy0717@gmail.com>\n```\n\nThe first line is meaningful and imperative. The body contains enough\ninformation that the reader understands the why and how of the commit, and its\nrelation to any issues. The issue is properly tagged and the commit is signed\noff.\n\nThe following is a *bad* commit:\n\n```\nFIX #124: Changing a couple random things in CONTRIBUTING.md.\nAlso, there are some bug fixes in the thread library.\n```\n\nThe commit rolls unrelated changes together in a very bad way. There is not\nenough information for the commit message to be useful. The first line is not\nmeaningful or imperative. The message is not formatted correctly, the issue is\nimproperly referenced, and the commit is not signed off by the author.\n\n### Other resources for writing good commits\n\n- https://cbea.ms/git-commit/\n\n## Generative Artificial Intelligence Usage Guidelines\n\nThe Eclipse OpenJ9 project acknowledges that some contributions may be authored in\nwhole or in part from generative artificial intelligence coding\nassistants. Such contributions are permitted per the\n[Eclipse Foundation Generative AI Usage Guidelines](https://www.eclipse.org/projects/guidelines/genai/)\nwhich describes contributor and committer responsibilities, copyright and\nlicensing considerations, and attribution requirements for GenAI assisted\ncontributions.\n\nAll contributors are encouraged to read and understand the advice and\nguidelines therein before submitting a contribution to Eclipse OpenJ9 even\npartially generated by an AI coding assistant.\n\nThe Eclipse OpenJ9 project is subject to those policies and provides additional\nguidelines described below for contributors and committers governing\nGenAI-assisted contributions.\n\n### Attribution\n\nContributions that include GenAI-assisted content must disclose that authorship\nin each file where GenAI content is present. Contributors must include a\nstatement like the following just below the copyright header at the beginning\nof the file that acknowledges their AI assistant (assuming such a statement\ndoes not already exist).\n\n```\n// Some sections generated by <YOUR AI ASSISTANT>\n```\n\nIn addition, individual commits that include GenAI authored content must\nattribute that at the end of the commit message (before any human authorship\nsignatures).\n\n```\nCo-authored by <YOUR AI ASSISTANT>\n```\n\n### Tagging\n\nSome contributors' employers may require their AI-generated code and\ndocumentation contributions to be annotated with inline tags providing\nadditional metadata about the generated content for legal and license\nattribution reasons. Eclipse OpenJ9 will accept contributions that include such\nmetadata with some guidance below for contributors and committers.\n\n#### Tag Usage\n\nInline tagging of code or documentation generated by coding assistants is not\nmandatory.\n\nIf tags are used, they must clearly demarcate the boundaries of GenAI-assisted\ncontent (e.g., via paired \"begin\" and \"end\" code comments). These boundaries\nmay span consecutive lines, functions, paragraphs, or entire files. The term\n\"assisted\" is an important qualifier to describe the enclosed content because\nit may contain a blend of AI-generated content and human contributions. The\n\"assisted\" distinction is necessary because it may not be possible to clearly\nidentify just the AI-generated content in the contribution, and it allows for\nhuman changes to the demarcated contribution over time while preserving the\nmeaning of the tags.\n\n#### Tag Format\n\nAt this time, Eclipse OpenJ9 does not specify the format of the tags, except that\nthey must not contain any corporate-specific information or other identifiers\nthat have no meaning beyond the original contributor (e.g., internal issue\nnumbers or URLs). Information about the model used to generate the code or\ndocumentation is permitted, however.\n\nTags must be concise and as minimally-invasive as possible. Tags that are\nexcessively verbose or impact the readability of the code or documentation may\nbe rejected by committers at their discretion.\n\nFor consistency, tags produced for the same coding assistant must use the same\nformat regardless of the contributor or pull request.\n\n#### Tag Maintenance\n\nIf the contents of a tagged region are modified by a human then any enclosing\ntags should remain in place.\n\nIf code or documentation within a tagged region is copied in whole or in part\nelsewhere in the project, the original surrounding tags should accompany the\ncopy to its destination. If such code or documentation is copied to a file\nthat does not already have the Eclipse Foundation GenAI attribution after the\ncopyright header, such attribution must be added.\n\nEclipse OpenJ9 implements a good-faith policy for contributors and committers to\nmaintain GenAI tags in the code and documentation for as long as possible.\nExisting tags and their boundaries will be maintained on a best-effort basis,\nand they should not be removed simply for the sake of removing them.\n\nHowever, there are legitimate situations where GenAI tagging may be considered\nfor removal, including if the tags:\n\n* interfere with the readability or understandability of the code or\n  documentation,\n* become difficult or unwieldy to maintain (e.g., through code refactoring or\n  code sharing),\n* become obsolete (e.g., information within a tagged section is removed\n  entirely),\n* become redundant (e.g., an inner set of tags is completely consumed by an\n  outer set)\n\nThis list is not exhaustive, and the disposition of GenAI tags in a pull\nrequest will ultimately be at the discretion of Eclipse OpenJ9 committers who will\nbalance the spirit of these tagging guidelines with the best interests of the\nEclipse OpenJ9 project.\n\n## Legal considerations\n\nPlease read the [Eclipse Foundation policy on accepting contributions via Git](https://wiki.eclipse.org/Development_Resources/Contributing_via_Git).\n\nYour contribution cannot be accepted unless you have a signed [ECA - Eclipse Foundation Contributor Agreement](https://www.eclipse.org/legal/ECA.php) in place. If you have an active signed Eclipse CLA\n([the CLA was updated by the Eclipse Foundation to become the ECA in August 2016](https://mmilinkov.wordpress.com/2016/08/15/contributor-agreement-update/)),\nthen that signed CLA is sufficient. You will have to sign the ECA once your CLA expires.\n\nHere is the checklist for contributions to be _acceptable_:\n\n1. [Create an account at Eclipse](https://dev.eclipse.org/site_login/createaccount.php).\n2. Add your GitHub user name in your account settings.\n3. [Log into the project's portal](https://projects.eclipse.org/) and sign the [\"Eclipse ECA\"](https://projects.eclipse.org/user/sign/cla).\n4. Ensure that you [_sign-off_](https://wiki.eclipse.org/Development_Resources/Contributing_via_Git#Signing_off_on_a_commit) your Git commits.\n5. Ensure that you use the _same_ email address as your Eclipse account in commits.\n6. Include the appropriate copyright notice and license at the top of each file.\n\nYour signing of the ECA will be verified by a webservice called 'ip-validation'\nthat checks the email address that signed-off on your commits has signed the\nECA. **Note**: This service is case-sensitive, so ensure the email that signed\nthe ECA and that signed-off on your commits is the same, down to the case.\n\n### Copyright Notice and Licensing Requirements\n\n**It is the responsibility of each contributor to obtain legal advice, and\nto ensure that their contributions fulfill the legal requirements of their\norganization. This document is not legal advice.**\n\nEclipse OpenJ9 is dual-licensed under the Eclipse Public License v2.0 and the\nApache License v2.0. Any previously unlicensed contribution should be released\nunder the same license.\n\n* If you wish to contribute code under a different license, you must consult\n  with a project lead before contributing.\n* For any scenario not covered by this document, please discuss the copyright\n  notice and licensing requirements with a project before contributing.\n\nThe template for the copyright notice and dual-license is as follows:\n```\n/*******************************************************************************\n * Copyright IBM Corp. and others %s\n *\n * This program and the accompanying materials are made available under\n * the terms of the Eclipse Public License 2.0 which accompanies this\n * distribution and is available at https://www.eclipse.org/legal/epl-2.0/\n * or the Apache License, Version 2.0 which accompanies this distribution and\n * is available at https://www.apache.org/licenses/LICENSE-2.0.\n *\n * This Source Code may also be made available under the following\n * Secondary Licenses when the conditions for such availability set\n * forth in the Eclipse Public License, v. 2.0 are satisfied: GNU\n * General Public License, version 2 with the GNU Classpath\n * Exception [1] and GNU General Public License, version 2 with the\n * OpenJDK Assembly Exception [2].\n *\n * [1] https://www.gnu.org/software/classpath/license.html\n * [2] https://openjdk.org/legal/assembly-exception.html\n *\n * SPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n *******************************************************************************/\n```\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 32.03125,
          "content": "Product: OpenJ9\n\nCopyright IBM Corp. and others 1991\n\nThis program and the accompanying materials are made available under the terms of the Eclipse Public License 2 which accompanies this distribution and is available at https://www.eclipse.org/legal/epl-2.0/ or the Apache License, Version 2.0 which accompanies this distribution and is available at https://www.apache.org/licenses/LICENSE-2.0.\n\nThis Source Code may also be made available under the following Secondary Licenses when the conditions for such availability set forth in the Eclipse Public License, v. 2.0 are satisfied: GNU General Public License, version 2 with the GNU Classpath Exception [1] and GNU General Public License, version 2 with the OpenJDK Assembly Exception [2].\n\n[1] https://www.gnu.org/software/classpath/license.html\n[2] https://openjdk.org/legal/assembly-exception.html\n\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n\nSubject to the following notices:\n\n1.      Eclipse OMR is provided under the Eclipse Public License 2 and secondary GPLv2 license (section A) or the Apache version 2 license (section B).\n2.      Unicode 6.0 & Unicode 8.0 are provided under the Unicode licence below (section C).\n3.      MurmurHash3 is provided under the MurmurHash3 license below (section D).\n4.      libffi is provided under the libffi license below (section E).\n5.      zlib is provided under the zlib license below (section F).\n6.      CuTest is provided under the CuTest license below (section G).\n\nYou may distribute this program and materials under either the\nEclipse Public License 2 or the Apache V2.0 License as long as you pass through\nthe exceptions noted above.\n\nA.\tEclipse Public License v2\nhttps://www.eclipse.org/org/documents/epl-2.0/\n\nEclipse Public License - v 2.0\n\n    THE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE\n    PUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION\n    OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\n  a) in the case of the initial Contributor, the initial content\n     Distributed under this Agreement, and\n\n  b) in the case of each subsequent Contributor:\n     i) changes to the Program, and\n     ii) additions to the Program;\n  where such changes and/or additions to the Program originate from\n  and are Distributed by that particular Contributor. A Contribution\n  \"originates\" from a Contributor if it was added to the Program by\n  such Contributor itself or anyone acting on such Contributor's behalf.\n  Contributions do not include changes or additions to the Program that\n  are not Modified Works.\n\n\"Contributor\" means any person or entity that Distributes the Program.\n\n\"Licensed Patents\" mean patent claims licensable by a Contributor which\nare necessarily infringed by the use or sale of its Contribution alone\nor when combined with the Program.\n\n\"Program\" means the Contributions Distributed in accordance with this\nAgreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement\nor any Secondary License (as applicable), including Contributors.\n\n\"Derivative Works\" shall mean any work, whether in Source Code or other\nform, that is based on (or derived from) the Program and for which the\neditorial revisions, annotations, elaborations, or other modifications\nrepresent, as a whole, an original work of authorship.\n\n\"Modified Works\" shall mean any work in Source Code or other form that\nresults from an addition to, deletion from, or modification of the\ncontents of the Program, including, for purposes of clarity any new file\nin Source Code form that contains any contents of the Program. Modified\nWorks shall not include works that contain only declarations,\ninterfaces, types, classes, structures, or files of the Program solely\nin each case in order to link to, bind by name, or subclass the Program\nor Modified Works thereof.\n\n\"Distribute\" means the acts of a) distributing or b) making available\nin any manner that enables the transfer of a copy.\n\n\"Source Code\" means the form of a Program preferred for making\nmodifications, including but not limited to software source code,\ndocumentation source, and configuration files.\n\n\"Secondary License\" means either the GNU General Public License,\nVersion 2.0, or any later versions of that license, including any\nexceptions or additional permissions as identified by the initial\nContributor.\n\n2. GRANT OF RIGHTS\n\n  a) Subject to the terms of this Agreement, each Contributor hereby\n  grants Recipient a non-exclusive, worldwide, royalty-free copyright\n  license to reproduce, prepare Derivative Works of, publicly display,\n  publicly perform, Distribute and sublicense the Contribution of such\n  Contributor, if any, and such Derivative Works.\n\n  b) Subject to the terms of this Agreement, each Contributor hereby\n  grants Recipient a non-exclusive, worldwide, royalty-free patent\n  license under Licensed Patents to make, use, sell, offer to sell,\n  import and otherwise transfer the Contribution of such Contributor,\n  if any, in Source Code or other form. This patent license shall\n  apply to the combination of the Contribution and the Program if, at\n  the time the Contribution is added by the Contributor, such addition\n  of the Contribution causes such combination to be covered by the\n  Licensed Patents. The patent license shall not apply to any other\n  combinations which include the Contribution. No hardware per se is\n  licensed hereunder.\n\n  c) Recipient understands that although each Contributor grants the\n  licenses to its Contributions set forth herein, no assurances are\n  provided by any Contributor that the Program does not infringe the\n  patent or other intellectual property rights of any other entity.\n  Each Contributor disclaims any liability to Recipient for claims\n  brought by any other entity based on infringement of intellectual\n  property rights or otherwise. As a condition to exercising the\n  rights and licenses granted hereunder, each Recipient hereby\n  assumes sole responsibility to secure any other intellectual\n  property rights needed, if any. For example, if a third party\n  patent license is required to allow Recipient to Distribute the\n  Program, it is Recipient's responsibility to acquire that license\n  before distributing the Program.\n\n  d) Each Contributor represents that to its knowledge it has\n  sufficient copyright rights in its Contribution, if any, to grant\n  the copyright license set forth in this Agreement.\n\n  e) Notwithstanding the terms of any Secondary License, no\n  Contributor makes additional grants to any Recipient (other than\n  those set forth in this Agreement) as a result of such Recipient's\n  receipt of the Program under the terms of a Secondary License\n  (if permitted under the terms of Section 3).\n\n3. REQUIREMENTS\n\n3.1 If a Contributor Distributes the Program in any form, then:\n\n  a) the Program must also be made available as Source Code, in\n  accordance with section 3.2, and the Contributor must accompany\n  the Program with a statement that the Source Code for the Program\n  is available under this Agreement, and informs Recipients how to\n  obtain it in a reasonable manner on or through a medium customarily\n  used for software exchange; and\n\n  b) the Contributor may Distribute the Program under a license\n  different than this Agreement, provided that such license:\n     i) effectively disclaims on behalf of all other Contributors all\n     warranties and conditions, express and implied, including\n     warranties or conditions of title and non-infringement, and\n     implied warranties or conditions of merchantability and fitness\n     for a particular purpose;\n\n     ii) effectively excludes on behalf of all other Contributors all\n     liability for damages, including direct, indirect, special,\n     incidental and consequential damages, such as lost profits;\n\n     iii) does not attempt to limit or alter the recipients' rights\n     in the Source Code under section 3.2; and\n\n     iv) requires any subsequent distribution of the Program by any\n     party to be under a license that satisfies the requirements\n     of this section 3.\n\n3.2 When the Program is Distributed as Source Code:\n\n  a) it must be made available under this Agreement, or if the\n  Program (i) is combined with other material in a separate file or\n  files made available under a Secondary License, and (ii) the initial\n  Contributor attached to the Source Code the notice described in\n  Exhibit A of this Agreement, then the Program may be made available\n  under the terms of such Secondary Licenses, and\n\n  b) a copy of this Agreement must be included with each copy of\n  the Program.\n\n3.3 Contributors may not remove or alter any copyright, patent,\ntrademark, attribution notices, disclaimers of warranty, or limitations\nof liability (\"notices\") contained within the Program from any copy of\nthe Program which they Distribute, provided that Contributors may add\ntheir own appropriate notices.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities\nwith respect to end users, business partners and the like. While this\nlicense is intended to facilitate the commercial use of the Program,\nthe Contributor who includes the Program in a commercial product\noffering should do so in a manner which does not create potential\nliability for other Contributors. Therefore, if a Contributor includes\nthe Program in a commercial product offering, such Contributor\n(\"Commercial Contributor\") hereby agrees to defend and indemnify every\nother Contributor (\"Indemnified Contributor\") against any losses,\ndamages and costs (collectively \"Losses\") arising from claims, lawsuits\nand other legal actions brought by a third party against the Indemnified\nContributor to the extent caused by the acts or omissions of such\nCommercial Contributor in connection with its distribution of the Program\nin a commercial product offering. The obligations in this section do not\napply to any claims or Losses relating to any actual or alleged\nintellectual property infringement. In order to qualify, an Indemnified\nContributor must: a) promptly notify the Commercial Contributor in\nwriting of such claim, and b) allow the Commercial Contributor to control,\nand cooperate with the Commercial Contributor in, the defense and any\nrelated settlement negotiations. The Indemnified Contributor may\nparticipate in any such claim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial\nproduct offering, Product X. That Contributor is then a Commercial\nContributor. If that Commercial Contributor then makes performance\nclaims, or offers warranties related to Product X, those performance\nclaims and warranties are such Commercial Contributor's responsibility\nalone. Under this section, the Commercial Contributor would have to\ndefend claims against the other Contributors related to those performance\nclaims and warranties, and if a court requires any other Contributor to\npay any damages as a result, the Commercial Contributor must pay\nthose damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, AND TO THE EXTENT\nPERMITTED BY APPLICABLE LAW, THE PROGRAM IS PROVIDED ON AN \"AS IS\"\nBASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR\nIMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF\nTITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR\nPURPOSE. Each Recipient is solely responsible for determining the\nappropriateness of using and distributing the Program and assumes all\nrisks associated with its exercise of rights under this Agreement,\nincluding but not limited to the risks and costs of program errors,\ncompliance with applicable laws, damage to or loss of data, programs\nor equipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, AND TO THE EXTENT\nPERMITTED BY APPLICABLE LAW, NEITHER RECIPIENT NOR ANY CONTRIBUTORS\nSHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST\nPROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE\nEXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under\napplicable law, it shall not affect the validity or enforceability of\nthe remainder of the terms of this Agreement, and without further\naction by the parties hereto, such provision shall be reformed to the\nminimum extent necessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity\n(including a cross-claim or counterclaim in a lawsuit) alleging that the\nProgram itself (excluding combinations of the Program with other software\nor hardware) infringes such Recipient's patent(s), then such Recipient's\nrights granted under Section 2(b) shall terminate as of the date such\nlitigation is filed.\n\nAll Recipient's rights under this Agreement shall terminate if it\nfails to comply with any of the material terms or conditions of this\nAgreement and does not cure such failure in a reasonable period of\ntime after becoming aware of such noncompliance. If all Recipient's\nrights under this Agreement terminate, Recipient agrees to cease use\nand distribution of the Program as soon as reasonably practicable.\nHowever, Recipient's obligations under this Agreement and any licenses\ngranted by Recipient relating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement,\nbut in order to avoid inconsistency the Agreement is copyrighted and\nmay only be modified in the following manner. The Agreement Steward\nreserves the right to publish new versions (including revisions) of\nthis Agreement from time to time. No one other than the Agreement\nSteward has the right to modify this Agreement. The Eclipse Foundation\nis the initial Agreement Steward. The Eclipse Foundation may assign the\nresponsibility to serve as the Agreement Steward to a suitable separate\nentity. Each new version of the Agreement will be given a distinguishing\nversion number. The Program (including Contributions) may always be\nDistributed subject to the version of the Agreement under which it was\nreceived. In addition, after a new version of the Agreement is published,\nContributor may elect to Distribute the Program (including its\nContributions) under the new version.\n\nExcept as expressly stated in Sections 2(a) and 2(b) above, Recipient\nreceives no rights or licenses to the intellectual property of any\nContributor under this Agreement, whether expressly, by implication,\nestoppel or otherwise. All rights in the Program not expressly granted\nunder this Agreement are reserved. Nothing in this Agreement is intended\nto be enforceable by any entity that is not a Contributor or Recipient.\nNo third-party beneficiary rights are created under this Agreement.\n\nExhibit A - Form of Secondary Licenses Notice\n\n\"This Source Code may also be made available under the following\nSecondary Licenses when the conditions for such availability set forth\nin the Eclipse Public License, v. 2.0 are satisfied: {name license(s),\nversion(s), and exceptions or additional permissions here}.\"\n\n  Simply including a copy of this Agreement, including this Exhibit A\n  is not sufficient to license the Source Code under Secondary Licenses.\n\n  If it is not possible or desirable to put the notice in a particular\n  file, then You may include the notice in a location (such as a LICENSE\n  file in a relevant directory) where a recipient would be likely to\n  look for such a notice.\n\n  You may add additional accurate notices of copyright ownership.\n\nB.\tApache License, Version 2.0\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\nC.\tUnicode 6.0, Unicode 8.0\nUNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\nUnicode Data Files include all data files under the directories http://www.unicode.org/Public/, http://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/. Unicode Data Files do not include PDF online code charts under the directory http://www.unicode.org/Public/.  Software includes any source code published in the Unicode Standard or under the directories http://www.unicode.org/Public/, http://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/.\n\nNOTICE TO USER: Carefully read the following legal agreement. BY DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES (\"DATA FILES\"), AND/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n\nCOPYRIGHT AND PERMISSION NOTICE\n\nCopyright (c) 1991-2011 Unicode, Inc. All rights reserved. Distributed under the Terms of Use in http://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Unicode data files and any associated documentation (the \"Data Files\") or Unicode software and any associated documentation (the \"Software\") to deal in the Data Files or Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, and/or sell copies of the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that (a) the above copyright notice(s) and this permission notice appear with all copies of the Data Files or Software, (b) both the above copyright notice(s) and this permission notice appear in associated documentation, and (c) there is clear notice in each modified Data File or in the Software as well as in the documentation associated with the Data File(s) or Software that the data or software has been modified.\n\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not be used in advertising or otherwise to promote the sale, use or other dealings in these Data Files or Software without prior written authorization of the copyright holder.\n\nUnicode and the Unicode logo are trademarks of Unicode, Inc. in the United States and other countries. All third party trademarks referenced herein are the property of their respective owners.\n\nD.\tMurmurHash3\nMurmurHash3 was written by Austin Appleby, and is placed in the public domain. The author hereby disclaims copyright to this source code.\n\nNote - The x86 and x64 versions do _not_ produce the same results, as the algorithms are optimized for their respective platforms. You can still compile and run any of them on any platform, but your performance with the non-native version will be less than optimal\n\nE.      libffi\nlibffi - Copyright (c) 1996-2022  Anthony Green, Red Hat, Inc and others.\nSee source files for details.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n``Software''), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED ``AS IS'', WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nF.      zlib\n  (C) 1995-2024 Jean-loup Gailly and Mark Adler\n\n  This software is provided 'as-is', without any express or implied\n  warranty.  In no event will the authors be held liable for any damages\n  arising from the use of this software.\n\n  Permission is granted to anyone to use this software for any purpose,\n  including commercial applications, and to alter it and redistribute it\n  freely, subject to the following restrictions:\n\n  1. The origin of this software must not be misrepresented; you must not\n     claim that you wrote the original software. If you use this software\n     in a product, an acknowledgment in the product documentation would be\n     appreciated but is not required.\n  2. Altered source versions must be plainly marked as such, and must not be\n     misrepresented as being the original software.\n  3. This notice may not be removed or altered from any source distribution.\n\n  Jean-loup Gailly        Mark Adler\n  jloup@gzip.org          madler@alumni.caltech.edu\n\nG.      CuTest\nCopyright (c) 2003 Asim Jalis\n\nThis software is provided 'as-is', without any express or implied\nwarranty. In no event will the authors be held liable for any damages\narising from the use of this software.\n\nPermission is granted to anyone to use this software for any purpose,\nincluding commercial applications, and to alter it and redistribute it\nfreely, subject to the following restrictions:\n\n1. The origin of this software must not be misrepresented; you must not\nclaim that you wrote the original software. If you use this software in\na product, an acknowledgment in the product documentation would be\nappreciated but is not required.\n\n2. Altered source versions must be plainly marked as such, and must not\nbe misrepresented as being the original software.\n\n3. This notice may not be removed or altered from any source\ndistribution.\n\n\nEND OF TERMS AND CONDITIONS\n"
        },
        {
          "name": "NOTICES.md",
          "type": "blob",
          "size": 10.046875,
          "content": "# Notices for Eclipse OpenJ9\n\n* Project home: https://github.com/eclipse-openj9/openj9\n\n\n## Trademarks\n\nJava and all Java-based trademarks are trademarks of Oracle Corporation in the United States, other countries, or both.\n\n\n## Eclipse Foundation Software User Agreement\nAugust 31, 2017\n\n\n### Usage Of Content\n\nTHE ECLIPSE FOUNDATION MAKES AVAILABLE SOFTWARE, DOCUMENTATION, INFORMATION AND/OR OTHER MATERIALS FOR OPEN SOURCE PROJECTS\n(COLLECTIVELY \"CONTENT\").  USE OF THE CONTENT IS GOVERNED BY THE TERMS AND CONDITIONS OF THIS AGREEMENT AND/OR THE TERMS AND\nCONDITIONS OF LICENSE AGREEMENTS OR NOTICES INDICATED OR REFERENCED BELOW.  BY USING THE CONTENT, YOU AGREE THAT YOUR USE\nOF THE CONTENT IS GOVERNED BY THIS AGREEMENT AND/OR THE TERMS AND CONDITIONS OF ANY APPLICABLE LICENSE AGREEMENTS OR\nNOTICES INDICATED OR REFERENCED BELOW.  IF YOU DO NOT AGREE TO THE TERMS AND CONDITIONS OF THIS AGREEMENT AND THE TERMS AND\nCONDITIONS OF ANY APPLICABLE LICENSE AGREEMENTS OR NOTICES INDICATED OR REFERENCED BELOW, THEN YOU MAY NOT USE THE CONTENT.\n\n\n### Applicable Licenses\n\nUnless otherwise indicated, all Content made available by the Eclipse Foundation is provided to you under the terms and conditions of the Eclipse Public License Version 2.0\n(\"EPL\").  A copy of the EPL is provided with this Content and is also available at [https://www.eclipse.org/legal/epl-2.0](https://www.eclipse.org/legal/epl-2.0).\nFor purposes of the EPL, \"Program\" will mean the Content.\n\nContent includes, but is not limited to, source code, object code, documentation and other files maintained in the Eclipse Foundation source code\nrepository (\"Repository\") in software modules (\"Modules\") and made available as downloadable archives (\"Downloads\").\n\n* Content may be structured and packaged into modules to facilitate delivering, extending, and upgrading the Content.  Typical modules may include plug-ins (\"Plug-ins\"), plug-in fragments (\"Fragments\"), and features (\"Features\").\n* Each Plug-in or Fragment may be packaged as a sub-directory or JAR (Java&trade; ARchive) in a directory named \"plugins\".\n* A Feature is a bundle of one or more Plug-ins and/or Fragments and associated material.  Each Feature may be packaged as a sub-directory in a directory named \"features\".  Within a Feature, files named \"feature.xml\" may contain a list of the names and version numbers of the Plug-ins\n      and/or Fragments associated with that Feature.\n* Features may also include other Features (\"Included Features\"). Within a Feature, files named \"feature.xml\" may contain a list of the names and version numbers of Included Features.\n\nThe terms and conditions governing Plug-ins and Fragments should be contained in files named \"about.html\" (\"Abouts\"). The terms and conditions governing Features and\nIncluded Features should be contained in files named \"license.html\" (\"Feature Licenses\").  Abouts and Feature Licenses may be located in any directory of a Download or Module\nincluding, but not limited to the following locations:\n\n* The top-level (root) directory\n* Plug-in and Fragment directories\n* Inside Plug-ins and Fragments packaged as JARs\n* Sub-directories of the directory named \"src\" of certain Plug-ins\n* Feature directories\n\nNote: if a Feature made available by the Eclipse Foundation is installed using the Provisioning Technology (as defined below), you must agree to a license (\"Feature Update License\") during the\ninstallation process.  If the Feature contains Included Features, the Feature Update License should either provide you with the terms and conditions governing the Included Features or\ninform you where you can locate them.  Feature Update Licenses may be found in the \"license\" property of files named \"feature.properties\" found within a Feature.\nSuch Abouts, Feature Licenses, and Feature Update Licenses contain the terms and conditions (or references to such terms and conditions) that govern your use of the associated Content in\nthat directory.\n\nTHE ABOUTS, FEATURE LICENSES, AND FEATURE UPDATE LICENSES MAY REFER TO THE EPL OR OTHER LICENSE AGREEMENTS, NOTICES OR TERMS AND CONDITIONS.  SOME OF THESE\nOTHER LICENSE AGREEMENTS MAY INCLUDE (BUT ARE NOT LIMITED TO):\n\n* Eclipse Distribution License Version 1.0 (available at [https://www.eclipse.org/licenses/edl-v1.0.html](https://www.eclipse.org/licenses/edl-v10.html))\n* Eclipse Distribution License Version 2.0 (available at [https://www.eclipse.org/legal/epl-2.0](https://www.eclipse.org/legal/epl-2.0))\n* Common Public License Version 1.0 (available at [https://www.eclipse.org/legal/cpl-v10.html](https://www.eclipse.org/legal/cpl-v10.html))\n* Apache Software License 1.1 (available at [https://www.apache.org/licenses/LICENSE](https://www.apache.org/licenses/LICENSE))\n* Apache Software License 2.0 (available at [https://www.apache.org/licenses/LICENSE-2.0](https://www.apache.org/licenses/LICENSE-2.0))\n* Mozilla Public License Version 1.1 (available at [https://www.mozilla.org/MPL/MPL-1.1.html](https://www.mozilla.org/MPL/MPL-1.1.html))\n\nIT IS YOUR OBLIGATION TO READ AND ACCEPT ALL SUCH TERMS AND CONDITIONS PRIOR TO USE OF THE CONTENT.  If no About, Feature License, or Feature Update License is provided, please\ncontact the Eclipse Foundation to determine what terms and conditions govern that particular Content.\n\n\n### Use of Provisioning Technology\n\nThe Eclipse Foundation makes available provisioning software, examples of which include, but are not limited to, p2 and the Eclipse\nUpdate Manager (\"Provisioning Technology\") for the purpose of allowing users to install software, documentation, information and/or\nother materials (collectively \"Installable Software\"). This capability is provided with the intent of allowing such users to\ninstall, extend and update Eclipse-based products. Information about packaging Installable Software is available at\n[https://www.eclipse.org/equinox/p2/repository_packaging.html](https://www.eclipse.org/equinox/p2/repository_packaging.html)\n(\"Specification\").\n\nYou may use Provisioning Technology to allow other parties to install Installable Software. You shall be responsible for enabling the\napplicable license agreements relating to the Installable Software to be presented to, and accepted by, the users of the Provisioning Technology\nin accordance with the Specification. By using Provisioning Technology in such a manner and making it available in accordance with the\nSpecification, you further acknowledge your agreement to, and the acquisition of all necessary rights to permit the following:\n\n1. A series of actions may occur (\"Provisioning Process\") in which a user may execute the Provisioning Technology\non a machine (\"Target Machine\") with the intent of installing, extending or updating the functionality of an Eclipse-based\nproduct.\n2. During the Provisioning Process, the Provisioning Technology may cause third party Installable Software or a portion thereof to be\naccessed and copied to the Target Machine.\n3. Pursuant to the Specification, you will provide to the user the terms and conditions that govern the use of the Installable\nSoftware (\"Installable Software Agreement\") and such Installable Software Agreement shall be accessed from the Target\nMachine in accordance with the Specification. Such Installable Software Agreement must inform the user of the terms and conditions that govern\nthe Installable Software and must solicit acceptance by the end user in the manner prescribed in such Installable Software Agreement. Upon such\nindication of agreement by the user, the provisioning Technology will complete installation of the Installable Software.\n\n\n### Cryptography\n\nContent may contain encryption software. The country in which you are currently may have restrictions on the import, possession, and use, and/or re-export to\nanother country, of encryption software. BEFORE using any encryption software, please check the country's laws, regulations and policies concerning the import,\npossession, or use, and re-export of encryption software, to see if this is permitted.\n\n\n## Third-party Content\n\nThis project may leverage the following third party content when building and at runtime.\n\nCheckpoint/Restore In Userspace (CRIU) (3.18)\n\n* License: GPL v2, LGPL v2.1 [https://github.com/checkpoint-restore/criu/blob/criu-dev/COPYING](https://github.com/checkpoint-restore/criu/blob/criu-dev/COPYING)\n* Project: https://criu.org/Main_Page\n* Source: https://github.com/ibmruntimes/criu\n\nOpenSSL (1.1.1)\n\n* License: https://github.com/openssl/openssl/blob/OpenSSL_1_1_1-stable/LICENSE\n* Project: https://www.openssl.org/\n* Source: https://github.com/openssl/openssl or https://github.com/ibmruntimes/openssl\n\nOpenSSL (3.x)\n\n* License: https://www.openssl.org/source/apache-license-2.0.txt\n* Project: https://www.openssl.org/\n* Source: https://github.com/openssl/openssl or https://github.com/ibmruntimes/openssl\n\nprotobuf-c (prereq of CRIU)\n\n* License: BSD-3-Clause\n* Project: https://developers.google.com/protocol-buffers/\n* Source: https://github.com/google/protobuf\n\nThis project leverages the following third party content for testing.\n\nApache Ant\n\n* License: Apache-2.0, W3C License, Public Domain\n\nApache Commons Exec (1.1)\n\n* License: Apache-2.0\n\nApache commons-cli (1.2)\n\n* License: Apache-2.0\n\nApache Log4J (2.16)\n\n* License: Apache-2.0\n\napache-ant-contrib (1.0)\n\n* License: Apache-1.1 AND Apache-2.0\n* Project: http://ant-contrib.sourceforge.net/\n\nASM (9.0)\n\n* License: New BSD License\n\nasmtools (7.0)\n\n* License: GPL-2.0-only WITH Classpath-exception-2.0\n* Project: https://openjdk.org/projects/code-tools/\n* Source: https://github.com/openjdk/asmtools/\n\njava assist (3.20)\n\n* License: MPL-1.1 OR LGPL-2.1+\n* Project: https://github.com/jboss-javassist/javassist/\n* Source: https://github.com/jboss-javassist/javassist/archive/rel_3_12_1_ga.zip\n\nJava Hamcrest\n\n* License: BSD-3-Clause\n* Project: https://hamcrest.org/JavaHamcrest/\n* Source: https://github.com/hamcrest/JavaHamcrest\n\nJAXB API (2.3)\n\n* License: CDDL-1.1\n\njcommander (1.48)\n\n* License: Apache-2.0\n\njunit (4.10)\n\n* License: Common Public License 1.0\n\nJSON.simple (1.1.1)\n\n* License: Apache-2.0\n\nJython (2.7.2)\n\n* License: CNRI-Jython\n\nMauve\n\n* Project: https://www.sourceware.org/mauve/\n\nOSGi (3.16.100)\n\n* License: EPL-1.0\n\ntestng (6.14)\n\n* License: Apache-2.0 AND MIT\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 9.173828125,
          "content": "<!--\nCopyright IBM Corp. and others 2017\n\nThis program and the accompanying materials are made available under\nthe terms of the Eclipse Public License 2.0 which accompanies this\ndistribution and is available at https://www.eclipse.org/legal/epl-2.0/\nor the Apache License, Version 2.0 which accompanies this distribution and\nis available at https://www.apache.org/licenses/LICENSE-2.0.\n\nThis Source Code may also be made available under the following\nSecondary Licenses when the conditions for such availability set\nforth in the Eclipse Public License, v. 2.0 are satisfied: GNU\nGeneral Public License, version 2 with the GNU Classpath\nException [1] and GNU General Public License, version 2 with the\nOpenJDK Assembly Exception [2].\n\n[1] https://www.gnu.org/software/classpath/license.html\n[2] https://openjdk.org/legal/assembly-exception.html\n\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n-->\n\n<p align=\"center\">\n<img src=\"https://github.com/eclipse-openj9/openj9/blob/master/artwork/OpenJ9.svg\" alt=\"OpenJ9 logo\" align=\"middle\" width=\"50%\" height=\"50%\" />\n<p>\n\nWelcome to the Eclipse OpenJ9 repository\n========================================\n[![License](https://img.shields.io/badge/License-EPL%202.0-green.svg)](https://opensource.org/licenses/EPL-2.0)\n[![License](https://img.shields.io/badge/License-APL%202.0-green.svg)](https://opensource.org/licenses/Apache-2.0)\n\n\nWe're not sure which route you might have taken on your way here, but we're really pleased to see you! If you came directly from our website, you've probably already learned a lot about Eclipse OpenJ9 and how it fits in to the OpenJDK ecosystem. If you came via some other route, here are a few key links to get you started:\n\n- [Eclipse OpenJ9 website](https://www.eclipse.org/openj9) - Learn about this high performance, enterprise-grade Java Virtual Machine (JVM) and why we think you want to get involved in its development.\n- Build instructions for [JDK8](https://github.com/eclipse-openj9/openj9/blob/master/doc/build-instructions/Build_Instructions_V8.md), [JDK11](https://github.com/eclipse-openj9/openj9/blob/master/doc/build-instructions/Build_Instructions_V11.md), and [More](https://github.com/eclipse-openj9/openj9/blob/master/doc/build-instructions) - Here's how you can build an OpenJDK with OpenJ9 yourself.\n\nIf you're looking for ways to help out at the project (thanks!), we have:\n- [Beginner issues](https://github.com/eclipse-openj9/openj9/issues?q=is%3Aopen+is%3Aissue+label%3A%22good+first+issue%22)\n- [Help Wanted issues](https://github.com/eclipse-openj9/openj9/issues?utf8=%E2%9C%93&q=is%3Aopen+is%3Aissue+label%3A%22help+wanted%22)\n\nIf you're here to learn more about the project, read on ...\n\nWhat is Eclipse OpenJ9?\n=======================\n\nEclipse OpenJ9 is an independent implementation of a Java Virtual Machine. \"Independent implementation\"\nmeans it was built using the Java Virtual Machine specification without using any code from any other Java\nVirtual Machine.\n\nThe OpenJ9 JVM combines with the Java Class libraries from OpenJDK to create a complete JDK tuned for\nfootprint, performance, and reliability that is well suited for cloud deployments.\n\nThe original source contribution to OpenJ9 came from the IBM \"J9\" JVM which has been used in production\nby thousands of Java applications for the last two decades.  In September 2017, IBM completed open sourcing\nthe J9 JVM as \"Eclipse OpenJ9\" at the Eclipse Foundation. Significant parts of J9 are also open source\nat the [Eclipse OMR project](https://github.com/eclipse-omr/omr). OpenJ9 has a permissive license (Apache\nLicense 2.0 or Eclipse Public License 2.0 with a secondary compatibility license for the OpenJDK project's\nGPLv2 license) that is designed to allow OpenJDK to be built with the OpenJ9 JVM.  Please see our\n[LICENSE file](https://github.com/eclipse-openj9/openj9/blob/master/LICENSE) for more details.\n\nEclipse OpenJ9 is a source code project that can be built alongside Java class libraries. See the\n[build instructions](https://github.com/eclipse-openj9/openj9/blob/master/doc/build-instructions). Eclipse\nFoundation projects are not permitted to distribute, market or promote JDK binaries unless they have\npassed a Java SE Technology Compatibility Kit licensed from Oracle, to which the OpenJ9 project does\nnot currently have access. See the [Eclipse Adoptium Project Charter](https://projects.eclipse.org/projects/adoptium/charter).\n\nWhat is the goal of the project?\n================================\n\nThe long term goal of the Eclipse OpenJ9 project is to foster an open ecosystem of JVM developers that can collaborate and innovate with designers and developers of hardware platforms, operating systems, tools, and frameworks.\n\nThe project welcomes collaboration, embraces fresh innovation, and extends an opportunity to influence the development of OpenJ9 for the next generation of Java applications.\n\nThe Java community has benefited over its history from having multiple implementations of the JVM specification competing to provide the best runtime for your application.  Whether adding compressed references, new Cloud features, AOT (ahead of time compilation), or straight up faster performance and lower memory use, the ecosystem has improved through that competition.  Eclipse OpenJ9 aims to continue to spur innovation in the runtimes space.\n\nHow do I contribute?\n====================\n\nSince we are an Eclipse Foundation project, each contributor needs to sign an Eclipse Contributor Agreement. The Eclipse Foundation operates under the [Eclipse Code of Conduct][coc]\nto promote fairness, openness, and inclusion.\n\nTo get started, read our [Contribution Guide](CONTRIBUTING.md).\n\n[coc]: https://eclipse.org/org/documents/Community_Code_of_Conduct.php\n\nIf you think you want to contribute but you're not ready to sign the Eclipse Contributor Agreement, why not join our weekly updates in the #planning channel? We also have calls after a new release where you can learn more about how we work. We talk about new ideas, answer any questions that get raised, and discuss project plans and status. We also do lightning talks on features and functions of the VM. Visit the *#planning* channel in our [Slack workspace](https://openj9.slack.com/) for information about upcoming community calls and minutes from previous meetings (Join [here](https://join.slack.com/t/openj9/shared_invite/enQtNDU4MDI4Mjk0MTk2LWVhNTMzMGY1N2JkODQ1OWE0NTNmZjM4ZDcxOTBiMjk3NGFjM2U0ZDNhMmY0MDZlNzU0ZjAyNzQ1ODlmYjg3MjA)).\n\nWhat repos are part of the project?\n===================================\n- https://github.com/eclipse-openj9/openj9 : OpenJ9 main code base\n- https://github.com/eclipse-openj9/openj9-omr : Eclipse OMR clone to stage temporary OMR changes.  (None so far!)\n- https://github.com/eclipse-openj9/openj9-systemtest : OpenJ9-specific system tests\n- https://github.com/eclipse-openj9/openj9-website : OpenJ9 website repo\n- https://github.com/eclipse-openj9/openj9-docs : OpenJ9 documentation repo\n- https://github.com/eclipse-openj9/build-openj9 : OpenJ9 GitHub actions repo\n- https://github.com/eclipse-openj9/openj9-utils : OpenJ9 utility programs / tools repo, a place to develop community around the tools\n\n\nWhere can I learn more?\n=======================\n\n- [Moving to OpenJ9](https://blog.openj9.org/2019/02/26/moving-to-openjdk-with-eclipse-openj9/)\n- [User documentation](https://www.eclipse.org/openj9/docs/)\n- Many more resources are available on the [OpenJ9 blog](https://blog.openj9.org/)\n\nVideos and Presentations\n------------------------\n\n- [JavaOne 2017: John Duimovich and Mike Milinkovich having fun chatting about Eclipse OpenJ9 (and EE4J)](https://www.youtube.com/watch?v=4g9SdVCPlnk)\n- [JavaOne 2017: Holly Cummins interviewing Dan Heidinga and Mark Stoodley on Eclipse OpenJ9 and OMR](https://www.youtube.com/watch?v=c1LVXqD3cII)\n- [JavaOne 2017: Open sourcing the IBM J9 Java Virtual Machine](https://www.slideshare.net/MarkStoodley/javaone-2017-mark-stoodley-open-sourcing-ibm-j9-jvm)\n- [JavaOne 2017: Eclipse OpenJ9 Under the hood of the next open source JVM](https://www.slideshare.net/DanHeidinga/javaone-2017-eclipse-openj9-under-the-hood-of-the-jvm)\n- [JavaOne 2017: Ask the OpenJ9 Architects](https://www.youtube.com/watch?v=qb5ennM_pgc)\n- [Eclipse OpenJ9 verbose JIT logs](https://mstoodle.github.io/EclipseOpenJ9JitVerboseLogs/)\n- [JavaOne 2017: How to build a debuggable runtime](https://www.slideshare.net/TobiAjila1/how-to-build-a-debuggle-runtime)\n- [Reducing Garbage Collection pause times with Concurrent Scavenge and the Guarded Storage Facility](https://developer.ibm.com/javasdk/2017/09/18/reducing-garbage-collection-pause-times-concurrent-scavenge-guarded-storage-facility/)\n- [How Concurrent Scavenge using the Guarded Storage Facility Works](https://developer.ibm.com/javasdk/2017/09/25/concurrent-scavenge-using-guarded-storage-facility-works/)\n- [Are you still paying for unused memory when your Java app is idle?](https://developer.ibm.com/javasdk/2017/09/25/still-paying-unused-memory-java-app-idle/)\n- [Under the hood of the Testarossa JIT Compiler](https://www.slideshare.net/MarkStoodley/under-the-hood-of-the-testarossa-jit-compiler)\n- [Class sharing In Eclipse OpenJ9](https://developer.ibm.com/tutorials/j-class-sharing-openj9/)\n\nCopyright IBM Corp. and others 2017\n"
        },
        {
          "name": "SECURITY.md",
          "type": "blob",
          "size": 1.3173828125,
          "content": "# Security Policy\n\nEclipse OpenJ9 follows the [Eclipse Vulnerability Reporting Policy](https://www.eclipse.org/security/policy.php). Vulnerabilities are tracked by the Eclipse OpenJ9 project leads, or by the Eclipse security team in cooperation with the OpenJ9 project leads. Fixing vulnerabilities is taken care of by the OpenJ9 project committers.\n\n## Supported Versions\n\nEclipse OpenJ9 supports security updates only in upcoming OpenJ9 releases.\n\nSince OpenJ9 currently uses a single stream to support the Long Term Support (LTS) releases of Java (8, 11 and 17) as well as the feature releases, fixes to the single OpenJ9 stream will be available in each of the next Java releases.\n\n## Reporting a Vulnerability\n\nIn case of suspected vulnerabilities, we recommend that you do not use the OpenJ9 public issue tracker, but instead contact an Eclipse OpenJ9 project lead via the [OpenJ9 Slack](https://openj9.slack.com/) (join [here](https://join.slack.com/t/openj9/shared_invite/enQtNDU4MDI4Mjk0MTk2LWVhNTMzMGY1N2JkODQ1OWE0NTNmZjM4ZDcxOTBiMjk3NGFjM2U0ZDNhMmY0MDZlNzU0ZjAyNzQ1ODlmYjg3MjA)) and a private channel will be created for the discussion. Or contact the Eclipse Security Team via security@eclipse.org.\n\nThe project leads will ensure that a private bugzilla issue is created for any confirmed vulnerability to track the fixing of said issue."
        },
        {
          "name": "about.html",
          "type": "blob",
          "size": 2.1484375,
          "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\">\n<html xmlns=\"http://www.w3.org/1999/xhtml\"><head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=ISO-8859-1\">\n<title>About</title>\n</head>\n<body lang=\"EN-US\">\n<h2>About This Content</h2>\n \n<p><em>September 8, 2017</em></p>\n<h3>License</h3>\n\n<p>This program and the accompanying materials are made available under the terms of the\nEclipse Public License 2 which accompanies this distribution and is available at\n<a href=\"https://eclipse.org/legal/epl-2.0\">https://eclipse.org/legal/epl-2.0</a> or the\nApache License, Version 2.0 which accompanies this distribution and is available at\n<a href=\"https://www.apache.org/licenses/LICENSE-2.0\">https://www.apache.org/licenses/LICENSE-2.0</a>.</p>\n\n<p>This Source Code may also be made available under the following Secondary Licenses when\nthe conditions for such availability set forth in the Eclipse Public License, v. 2.0 are\nsatisfied: GNU General Public License, version 2 with the GNU Classpath Exception [1] and\nGNU General Public License, version 2 with the OpenJDK Assembly Exception [2].</p>\n\n<p>\n[1] <a href=\"https://www.gnu.org/software/classpath/license.html\">https://www.gnu.org/software/classpath/license.html</a><br>\n[2] <a href=\"https://openjdk.org/legal/assembly-exception.html\">https://openjdk.org/legal/assembly-exception.html</a><br><br>\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n</p>\n\n<p>If you did not receive this Content directly from the Eclipse Foundation, the Content is being redistributed by\nanother party (\"Redistributor\") and different terms and conditions may apply to your use of any object code in\nthe Content. Check the Redistributor's license that was provided with the Content. If no such license exists,\ncontact the Redistributor. Unless otherwise indicated below, the terms and conditions of the EPL and Apache\nLicense 2.0 still apply to any source code in the Content and such source code may be obtained at\n<a href=\"https://www.eclipse.org/\">https://www.eclipse.org</a>.</p>\n</body></html>\n"
        },
        {
          "name": "artwork",
          "type": "tree",
          "content": null
        },
        {
          "name": "asl-v20.text",
          "type": "blob",
          "size": 11.0908203125,
          "content": "                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n"
        },
        {
          "name": "buildenv",
          "type": "tree",
          "content": null
        },
        {
          "name": "buildspecs",
          "type": "tree",
          "content": null
        },
        {
          "name": "cdsadapter",
          "type": "tree",
          "content": null
        },
        {
          "name": "debugtools",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "epl-2.0.html",
          "type": "blob",
          "size": 16.89453125,
          "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\">\n<html xmlns=\"http://www.w3.org/1999/xhtml\" xml:lang=\"en\" lang=\"en\">\n  <head>\n    <meta http-equiv=\"Content-Type\" content=\"text/html; charset=utf-8\" />\n    <title>Eclipse Public License - Version 2.0</title>\n    <style type=\"text/css\">\n      body {\n        margin: 1.5em 3em;\n      }\n      h1{\n        font-size:1.5em;\n      }\n      h2{\n        font-size:1em;\n        margin-bottom:0.5em;\n        margin-top:1em;\n      }\n      p {\n        margin-top:  0.5em;\n        margin-bottom: 0.5em;\n      }\n      ul, ol{\n        list-style-type:none;\n      }\n    </style>\n  </head>\n  <body>\n    <h1>Eclipse Public License - v 2.0</h1>\n    <p>THE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE\n      PUBLIC LICENSE (&ldquo;AGREEMENT&rdquo;). ANY USE, REPRODUCTION OR DISTRIBUTION\n      OF THE PROGRAM CONSTITUTES RECIPIENT&#039;S ACCEPTANCE OF THIS AGREEMENT.\n    </p>\n    <h2 id=\"definitions\">1. DEFINITIONS</h2>\n    <p>&ldquo;Contribution&rdquo; means:</p>\n    <ul>\n      <li>a) in the case of the initial Contributor, the initial content\n        Distributed under this Agreement, and\n      </li>\n      <li>\n        b) in the case of each subsequent Contributor:\n        <ul>\n          <li>i) changes to the Program, and</li>\n          <li>ii) additions to the Program;</li>\n        </ul>\n        where such changes and/or additions to the Program originate from\n        and are Distributed by that particular Contributor. A Contribution\n        &ldquo;originates&rdquo; from a Contributor if it was added to the Program by such\n        Contributor itself or anyone acting on such Contributor&#039;s behalf.\n        Contributions do not include changes or additions to the Program that\n        are not Modified Works.\n      </li>\n    </ul>\n    <p>&ldquo;Contributor&rdquo; means any person or entity that Distributes the Program.</p>\n    <p>&ldquo;Licensed Patents&rdquo; mean patent claims licensable by a Contributor which\n      are necessarily infringed by the use or sale of its Contribution alone\n      or when combined with the Program.\n    </p>\n    <p>&ldquo;Program&rdquo; means the Contributions Distributed in accordance with this\n      Agreement.\n    </p>\n    <p>&ldquo;Recipient&rdquo; means anyone who receives the Program under this Agreement\n      or any Secondary License (as applicable), including Contributors.\n    </p>\n    <p>&ldquo;Derivative Works&rdquo; shall mean any work, whether in Source Code or other\n      form, that is based on (or derived from) the Program and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship.\n    </p>\n    <p>&ldquo;Modified Works&rdquo; shall mean any work in Source Code or other form that\n      results from an addition to, deletion from, or modification of the\n      contents of the Program, including, for purposes of clarity any new file\n      in Source Code form that contains any contents of the Program. Modified\n      Works shall not include works that contain only declarations, interfaces,\n      types, classes, structures, or files of the Program solely in each case\n      in order to link to, bind by name, or subclass the Program or Modified\n      Works thereof.\n    </p>\n    <p>&ldquo;Distribute&rdquo; means the acts of a) distributing or b) making available\n      in any manner that enables the transfer of a copy.\n    </p>\n    <p>&ldquo;Source Code&rdquo; means the form of a Program preferred for making\n      modifications, including but not limited to software source code,\n      documentation source, and configuration files.\n    </p>\n    <p>&ldquo;Secondary License&rdquo; means either the GNU General Public License,\n      Version 2.0, or any later versions of that license, including any\n      exceptions or additional permissions as identified by the initial\n      Contributor.\n    </p>\n    <h2 id=\"grant-of-rights\">2. GRANT OF RIGHTS</h2>\n    <ul>\n      <li>a) Subject to the terms of this Agreement, each Contributor hereby\n        grants Recipient a non-exclusive, worldwide, royalty-free copyright\n        license to reproduce, prepare Derivative Works of, publicly display,\n        publicly perform, Distribute and sublicense the Contribution of such\n        Contributor, if any, and such Derivative Works.\n      </li>\n      <li>b) Subject to the terms of this Agreement, each Contributor hereby\n        grants Recipient a non-exclusive, worldwide, royalty-free patent\n        license under Licensed Patents to make, use, sell, offer to sell,\n        import and otherwise transfer the Contribution of such Contributor,\n        if any, in Source Code or other form. This patent license shall\n        apply to the combination of the Contribution and the Program if,\n        at the time the Contribution is added by the Contributor, such\n        addition of the Contribution causes such combination to be covered\n        by the Licensed Patents. The patent license shall not apply to any\n        other combinations which include the Contribution. No hardware per\n        se is licensed hereunder.\n      </li>\n      <li>c) Recipient understands that although each Contributor grants the\n        licenses to its Contributions set forth herein, no assurances are\n        provided by any Contributor that the Program does not infringe the\n        patent or other intellectual property rights of any other entity.\n        Each Contributor disclaims any liability to Recipient for claims\n        brought by any other entity based on infringement of intellectual\n        property rights or otherwise. As a condition to exercising the rights\n        and licenses granted hereunder, each Recipient hereby assumes sole\n        responsibility to secure any other intellectual property rights needed,\n        if any. For example, if a third party patent license is required to\n        allow Recipient to Distribute the Program, it is Recipient&#039;s\n        responsibility to acquire that license before distributing the Program.\n      </li>\n      <li>d) Each Contributor represents that to its knowledge it has sufficient\n        copyright rights in its Contribution, if any, to grant the copyright\n        license set forth in this Agreement.\n      </li>\n      <li>e) Notwithstanding the terms of any Secondary License, no Contributor\n        makes additional grants to any Recipient (other than those set forth\n        in this Agreement) as a result of such Recipient&#039;s receipt of the\n        Program under the terms of a Secondary License (if permitted under\n        the terms of Section 3).\n      </li>\n    </ul>\n    <h2 id=\"requirements\">3. REQUIREMENTS</h2>\n    <p>3.1 If a Contributor Distributes the Program in any form, then:</p>\n    <ul>\n      <li>a) the Program must also be made available as Source Code, in\n        accordance with section 3.2, and the Contributor must accompany\n        the Program with a statement that the Source Code for the Program\n        is available under this Agreement, and informs Recipients how to\n        obtain it in a reasonable manner on or through a medium customarily\n        used for software exchange; and\n      </li>\n      <li>\n        b) the Contributor may Distribute the Program under a license\n        different than this Agreement, provided that such license:\n        <ul>\n          <li>i) effectively disclaims on behalf of all other Contributors all\n            warranties and conditions, express and implied, including warranties\n            or conditions of title and non-infringement, and implied warranties\n            or conditions of merchantability and fitness for a particular purpose;\n          </li>\n          <li>ii) effectively excludes on behalf of all other Contributors all\n            liability for damages, including direct, indirect, special, incidental\n            and consequential damages, such as lost profits;\n          </li>\n          <li>iii) does not attempt to limit or alter the recipients&#039; rights in the\n            Source Code under section 3.2; and\n          </li>\n          <li>iv) requires any subsequent distribution of the Program by any party\n            to be under a license that satisfies the requirements of this section 3.\n          </li>\n        </ul>\n      </li>\n    </ul>\n    <p>3.2 When the Program is Distributed as Source Code:</p>\n    <ul>\n      <li>a) it must be made available under this Agreement, or if the Program (i)\n        is combined with other material in a separate file or files made available\n        under a Secondary License, and (ii) the initial Contributor attached to\n        the Source Code the notice described in Exhibit A of this Agreement,\n        then the Program may be made available under the terms of such\n        Secondary Licenses, and\n      </li>\n      <li>b) a copy of this Agreement must be included with each copy of the Program.</li>\n    </ul>\n    <p>3.3 Contributors may not remove or alter any copyright, patent, trademark,\n      attribution notices, disclaimers of warranty, or limitations of liability\n      (&lsquo;notices&rsquo;) contained within the Program from any copy of the Program which\n      they Distribute, provided that Contributors may add their own appropriate\n      notices.\n    </p>\n    <h2 id=\"commercial-distribution\">4. COMMERCIAL DISTRIBUTION</h2>\n    <p>Commercial distributors of software may accept certain responsibilities\n      with respect to end users, business partners and the like. While this\n      license is intended to facilitate the commercial use of the Program, the\n      Contributor who includes the Program in a commercial product offering should\n      do so in a manner which does not create potential liability for other\n      Contributors. Therefore, if a Contributor includes the Program in a\n      commercial product offering, such Contributor (&ldquo;Commercial Contributor&rdquo;)\n      hereby agrees to defend and indemnify every other Contributor\n      (&ldquo;Indemnified Contributor&rdquo;) against any losses, damages and costs\n      (collectively &ldquo;Losses&rdquo;) arising from claims, lawsuits and other legal actions\n      brought by a third party against the Indemnified Contributor to the extent\n      caused by the acts or omissions of such Commercial Contributor in connection\n      with its distribution of the Program in a commercial product offering.\n      The obligations in this section do not apply to any claims or Losses relating\n      to any actual or alleged intellectual property infringement. In order to\n      qualify, an Indemnified Contributor must: a) promptly notify the\n      Commercial Contributor in writing of such claim, and b) allow the Commercial\n      Contributor to control, and cooperate with the Commercial Contributor in,\n      the defense and any related settlement negotiations. The Indemnified\n      Contributor may participate in any such claim at its own expense.\n    </p>\n    <p>For example, a Contributor might include the Program\n      in a commercial product offering, Product X. That Contributor is then a\n      Commercial Contributor. If that Commercial Contributor then makes performance\n      claims, or offers warranties related to Product X, those performance claims\n      and warranties are such Commercial Contributor&#039;s responsibility alone.\n      Under this section, the Commercial Contributor would have to defend claims\n      against the other Contributors related to those performance claims and\n      warranties, and if a court requires any other Contributor to pay any damages\n      as a result, the Commercial Contributor must pay those damages.\n    </p>\n    <h2 id=\"warranty\">5. NO WARRANTY</h2>\n    <p>EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, AND TO THE EXTENT PERMITTED\n      BY APPLICABLE LAW, THE PROGRAM IS PROVIDED ON AN &ldquo;AS IS&rdquo; BASIS, WITHOUT\n      WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING,\n      WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT,\n      MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is\n      solely responsible for determining the appropriateness of using and\n      distributing the Program and assumes all risks associated with its\n      exercise of rights under this Agreement, including but not limited to the\n      risks and costs of program errors, compliance with applicable laws, damage\n      to or loss of data, programs or equipment, and unavailability or\n      interruption of operations.\n    </p>\n    <h2 id=\"disclaimer\">6. DISCLAIMER OF LIABILITY</h2>\n    <p>EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, AND TO THE EXTENT PERMITTED\n      BY APPLICABLE LAW, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL HAVE ANY\n      LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,\n      OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS),\n      HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n      LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n      OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS\n      GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n    </p>\n    <h2 id=\"general\">7. GENERAL</h2>\n    <p>If any provision of this Agreement is invalid or unenforceable under\n      applicable law, it shall not affect the validity or enforceability of the\n      remainder of the terms of this Agreement, and without further action by the\n      parties hereto, such provision shall be reformed to the minimum extent\n      necessary to make such provision valid and enforceable.\n    </p>\n    <p>If Recipient institutes patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Program itself\n      (excluding combinations of the Program with other software or hardware)\n      infringes such Recipient&#039;s patent(s), then such Recipient&#039;s rights granted\n      under Section 2(b) shall terminate as of the date such litigation is filed.\n    </p>\n    <p>All Recipient&#039;s rights under this Agreement shall terminate if it fails to\n      comply with any of the material terms or conditions of this Agreement and\n      does not cure such failure in a reasonable period of time after becoming\n      aware of such noncompliance. If all Recipient&#039;s rights under this Agreement\n      terminate, Recipient agrees to cease use and distribution of the Program\n      as soon as reasonably practicable. However, Recipient&#039;s obligations under\n      this Agreement and any licenses granted by Recipient relating to the\n      Program shall continue and survive.\n    </p>\n    <p>Everyone is permitted to copy and distribute copies of this Agreement,\n      but in order to avoid inconsistency the Agreement is copyrighted and may\n      only be modified in the following manner. The Agreement Steward reserves\n      the right to publish new versions (including revisions) of this Agreement\n      from time to time. No one other than the Agreement Steward has the right\n      to modify this Agreement. The Eclipse Foundation is the initial Agreement\n      Steward. The Eclipse Foundation may assign the responsibility to serve as\n      the Agreement Steward to a suitable separate entity. Each new version of\n      the Agreement will be given a distinguishing version number. The Program\n      (including Contributions) may always be Distributed subject to the version\n      of the Agreement under which it was received. In addition, after a new\n      version of the Agreement is published, Contributor may elect to Distribute\n      the Program (including its Contributions) under the new version.\n    </p>\n    <p>Except as expressly stated in Sections 2(a) and 2(b) above, Recipient\n      receives no rights or licenses to the intellectual property of any\n      Contributor under this Agreement, whether expressly, by implication,\n      estoppel or otherwise. All rights in the Program not expressly granted\n      under this Agreement are reserved. Nothing in this Agreement is intended\n      to be enforceable by any entity that is not a Contributor or Recipient.\n      No third-party beneficiary rights are created under this Agreement.\n    </p>\n    <h2 id=\"exhibit-a\">Exhibit A &ndash; Form of Secondary Licenses Notice</h2>\n    <p>&ldquo;This Source Code may also be made available under the following \n    \tSecondary Licenses when the conditions for such availability set forth \n    \tin the Eclipse Public License, v. 2.0 are satisfied: {name license(s),\n    \tversion(s), and exceptions or additional permissions here}.&rdquo;\n    </p>\n    <blockquote>\n      <p>Simply including a copy of this Agreement, including this Exhibit A\n        is not sufficient to license the Source Code under Secondary Licenses.\n      </p>\n      <p>If it is not possible or desirable to put the notice in a particular file,\n        then You may include the notice in a location (such as a LICENSE file in a\n        relevant directory) where a recipient would be likely to look for\n        such a notice.\n      </p>\n      <p>You may add additional accurate notices of copyright ownership.</p>\n    </blockquote>\n  </body>\n</html>"
        },
        {
          "name": "jcl",
          "type": "tree",
          "content": null
        },
        {
          "name": "longabout.html",
          "type": "blob",
          "size": 14.6796875,
          "content": "<!DOCTYPE html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\"\n    \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\">\n<html xmlns=\"http://www.w3.org/1999/xhtml\">\n<head>\n<meta http-equiv=\"Content-Type\" content=\"text/html; charset=ISO-8859-1\"/>\n<title>About</title>\n</head>\n<body lang=\"EN-US\">\n<h2>About This Content</h2>\n\n<p><em>January 18, 2023</em></p>\n<h3>License</h3>\n\nThis program and the accompanying materials are made available under the terms of the Eclipse Public License 2 which accompanies this distribution and is available at https://www.eclipse.org/legal/epl-2.0/ or the Apache License, Version 2.0 which accompanies this distribution and is available at https://www.apache.org/licenses/LICENSE-2.0.\n<p>\nThis Source Code may also be made available under the following Secondary Licenses when the conditions for such availability set forth in the Eclipse Public License, v. 2.0 are satisfied: GNU General Public License, version 2 with the GNU Classpath Exception [1] and GNU General Public License, version 2 with the OpenJDK Assembly Exception [2].\n<p>\n[1] https://www.gnu.org/software/classpath/license.html\n<BR>\n[2] https://openjdk.org/legal/assembly-exception.html\n<BR>\n<BR>\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n\n<p>If you did not receive this Content directly from the Eclipse Foundation, the Content is\nbeing redistributed by another party (&quot;Redistributor&quot;) and different terms and conditions may\napply to your use of any object code in the Content.  Check the Redistributor's license that was\nprovided with the Content.  If no such license exists, contact the Redistributor.  Unless otherwise\nindicated below, the terms and conditions of the EPL still apply to any source code in the Content\nand such source code may be obtained at <a href=\"https://www.eclipse.org/\">https://www.eclipse.org</a>.</p>\n\n<h3>Third Party Content</h3>\n<p>The Content includes items that have been sourced from third parties as set out below. If you\ndid not receive this Content directly from the Eclipse Foundation, the following is provided\nfor informational purposes only, and you should look to the Redistributor's license for\nterms and conditions of use.</p>\n\n<h4>Eclipse OMR</h4>\n<p>Copyright IBM Corp. and others 1991</p>\n<p>\nThis program and the accompanying materials are made available under the terms of the Eclipse Public License 2 which accompanies this distribution and is available at https://www.eclipse.org/legal/epl-2.0/ or the Apache License, Version 2.0 which accompanies this distribution and is available at https://www.apache.org/licenses/LICENSE-2.0.\n<p>\nThis Source Code may also be made available under the following Secondary Licenses when the conditions for such availability set forth in the Eclipse Public License, v. 2.0 are satisfied: GNU General Public License, version 2 with the GNU Classpath Exception [1] and GNU General Public License, version 2 with the OpenJDK Assembly Exception [2].\n<p>\n[1] https://www.gnu.org/software/classpath/license.html\n<BR>\n[2] https://openjdk.org/legal/assembly-exception.html\n<BR>\n<BR>\nSPDX-License-Identifier: EPL-2.0 OR Apache-2.0 OR GPL-2.0-only WITH Classpath-exception-2.0 OR GPL-2.0-only WITH OpenJDK-assembly-exception-1.0\n<p>\nSubject to the following notices:<br />\n    1.\tGoogle Test is provided under the Google Test license below.<br />\n    2.\tPugixml is provided under the pugixml license below.<br />\n    3.\tconfig.sub and config.guess are provided under the GPL v3.0 with the Autoconf exception (see below).<br />\n<p>\nYou may distribute this program and materials under either the\nEclipse Public License 2 or the Apache V2.0 License as long as you pass through\nthe exceptions noted above.\n<p>\n\n<h5>Google C++ Testing Framework 1.7.0</h5>\n<p>Copyright 2008, Google Inc. <br>All rights reserved.</p>\n<p>\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n<p class=\"list\">* Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.</p>\n<p class=\"list\">* Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.</p>\n<p class=\"list\">* Neither the name of Google Inc. nor the names of its\ncontributors may be used to endorse or promote products derived from\nthis software without specific prior written permission.</p>\n<p>\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n</p>\nThe source is available at <a href=\"https://github.com/google/googletest\">https://github.com/google/googletest</a>.\n</p>\n\n<h5>pugixml 1.5</h5>\n<p>Copyright (c) 2006-2015 Arseny Kapoulkine</p>\n<p>\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the \"Software\"),\nto deal in the Software without restriction, including without limitation\nthe rights to use, copy, modify, merge, publish, distribute, sublicense,\nand/or sell copies of the Software, and to permit persons to whom the\nSoftware is furnished to do so, subject to the following conditions:</p>\n<p class=\"list\">\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.</p>\n<p>\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\nTHE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n</p>\n<p>\nThe source is available at <a href=\"http://pugixml.org/2014/11/27/pugixml-1.5-release.html\">http://pugixml.org/2014/11/27/pugixml-1.5-release.html</a>.\n</p>\n\n<h5>config.sub and config.guess</h5>\n<p>\nThis file is free software; you can redistribute it and/or modify it\nunder the terms of the GNU General Public License as published by\nthe Free Software Foundation; either version 3 of the License, or\n(at your option) any later version.</p>\n<p>\nThis program is distributed in the hope that it will be useful, but\nWITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\nGeneral Public License for more details.</p>\n<p>\nYou should have received a copy of the GNU General Public License\nalong with this program; if not, see <a href=\"http://www.gnu.org/licenses/\">http://www.gnu.org/licenses/</a></p>\n<p>\nAs a special exception to the GNU General Public License, if you\ndistribute this file as part of a program that contains a\nconfiguration script generated by Autoconf, you may include it under\nthe same distribution terms that you use for the rest of that\nprogram.  This Exception is an additional permission under section 7\nof the GNU General Public License, version 3 (\"GPLv3\").</p>\n<p>\nThe source for config.guess is available at <a href=\"http://git.savannah.gnu.org/gitweb/?p=config.git;a=blob_plain;f=config.guess;hb=HEAD\">http://git.savannah.gnu.org/gitweb/?p=config.git;a=blob_plain;f=config.guess;hb=HEAD</a>.\n<br>\nThe source for config.guess is available at <a href=\"http://git.savannah.gnu.org/gitweb/?p=config.git;a=blob_plain;f=config.sub;hb=HEAD\">http://git.savannah.gnu.org/gitweb/?p=config.git;a=blob_plain;f=config.sub;hb=HEAD</a>.\n</p>\n\n<h4>Unicode 6.0, Unicode 8.0</h4>\nUNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n<p>\nUnicode Data Files include all data files under the directories http://www.unicode.org/Public/, http://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/. Unicode Data Files do not include PDF online code charts under the directory http://www.unicode.org/Public/.  Software includes any source code published in the Unicode Standard or under the directories http://www.unicode.org/Public/, http://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/.\n<p>\nNOTICE TO USER: Carefully read the following legal agreement. BY DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES (\"DATA FILES\"), AND/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n<p>\nCOPYRIGHT AND PERMISSION NOTICE\n<p>\nCopyright &copy; 1991-2011 Unicode, Inc. All rights reserved. Distributed under the Terms of Use in http://www.unicode.org/copyright.html.\n<p>\nPermission is hereby granted, free of charge, to any person obtaining a copy of the Unicode data files and any associated documentation (the \"Data Files\") or Unicode software and any associated documentation (the \"Software\") to deal in the Data Files or Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, and/or sell copies of the Data Files or Software, and to permit persons to whom the Data Files or Software are furnished to do so, provided that (a) the above copyright notice(s) and this permission notice appear with all copies of the Data Files or Software, (b) both the above copyright notice(s) and this permission notice appear in associated documentation, and (c) there is clear notice in each modified Data File or in the Software as well as in the documentation associated with the Data File(s) or Software that the data or software has been modified.\n<p>\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n<p>\nExcept as contained in this notice, the name of a copyright holder shall not be used in advertising or otherwise to promote the sale, use or other dealings in these Data Files or Software without prior written authorization of the copyright holder.\n<p>\nUnicode and the Unicode logo are trademarks of Unicode, Inc. in the United States and other countries. All third party trademarks referenced herein are the property of their respective owners.\n<p>\n<h4>MurmurHash3</h4>\nMurmurHash3 was written by Austin Appleby, and is placed in the public domain. The author hereby disclaims copyright to this source code.\n<p>\nNote - The x86 and x64 versions do _not_ produce the same results, as the algorithms are optimized for their respective platforms. You can still compile and run any of them on any platform, but your performance with the non-native version will be less than optimal\n<p>\n<h4>libFFI pre 3.5</h4>\nlibffi - Copyright (c) 1996-2023  Anthony Green, Red Hat, Inc and others.\nSee source files for details.\n<p>\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n``Software''), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n<p>\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n<p>\nTHE SOFTWARE IS PROVIDED ``AS IS'', WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n<p>\n<h4>zlib 1.3.1</h4>\n  (C) 1995-2024 Jean-loup Gailly and Mark Adler\n<p>\n  This software is provided 'as-is', without any express or implied\n  warranty.  In no event will the authors be held liable for any damages\n  arising from the use of this software.\n<p>\n  Permission is granted to anyone to use this software for any purpose,\n  including commercial applications, and to alter it and redistribute it\n  freely, subject to the following restrictions:\n<BR>\n  1. The origin of this software must not be misrepresented; you must not\n     claim that you wrote the original software. If you use this software\n     in a product, an acknowledgment in the product documentation would be\n     appreciated but is not required.\n<BR>\n  2. Altered source versions must be plainly marked as such, and must not be\n     misrepresented as being the original software.\n<BR>\n  3. This notice may not be removed or altered from any source distribution.\n<p>\n  Jean-loup Gailly        Mark Adler\n  jloup@gzip.org          madler@alumni.caltech.edu\n<p>\n<h4>CuTest</h4>\nCopyright (c) 2003 Asim Jalis\n<p>\nThis software is provided 'as-is', without any express or implied\nwarranty. In no event will the authors be held liable for any damages\narising from the use of this software.\n<p>\nPermission is granted to anyone to use this software for any purpose,\nincluding commercial applications, and to alter it and redistribute it\nfreely, subject to the following restrictions:\n<p>\n1. The origin of this software must not be misrepresented; you must not\nclaim that you wrote the original software. If you use this software in\na product, an acknowledgment in the product documentation would be\nappreciated but is not required.\n<p>\n2. Altered source versions must be plainly marked as such, and must not\nbe misrepresented as being the original software.\n<p>\n3. This notice may not be removed or altered from any source\ndistribution.\n</body>\n</html>\n"
        },
        {
          "name": "runtime",
          "type": "tree",
          "content": null
        },
        {
          "name": "sourcetools",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        }
      ]
    }
  ]
}