{
  "metadata": {
    "timestamp": 1736708599951,
    "page": 906,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjkyMA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "grishka/Houseclub",
      "stars": 2353,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.244140625,
          "content": "*.iml\n.gradle\n/local.properties\n/.idea/caches\n/.idea/libraries\n/.idea/modules.xml\n/.idea/workspace.xml\n/.idea/navEditor.xml\n/.idea/assetWizardSettings.xml\n.DS_Store\n/build\n/captures\n.externalNativeBuild\n.cxx\n/Houseclub/release\n/Houseclub/build\n*.jks\n"
        },
        {
          "name": ".idea",
          "type": "tree",
          "content": null
        },
        {
          "name": "Houseclub",
          "type": "tree",
          "content": null
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 2.4296875,
          "content": "Unofficial Clubhouse app for Android. Inspired by [this](https://github.com/stypr/clubhouse-py).\n\nNot to be taken seriously.\n\n**This app is NOT available in Google Play. The only right place to download it is here in the releases section.**\n\n**Any issues about audio quality will be closed immediately, so please don't bother posting those.**\n\n# FAQ\n### What works?\n* Login\n* Registration *should* work, but I suggest that you better use an iOS device to register\n* Seeing the list of rooms however the server recommends them\n* Joining rooms from said list and by direct links\n* Listening and speaking\n* Raising hand (asking to speak)\n* Accepting when a moderator allows you to speak\n* Real-time updates in to the participant list\n* Profiles\n* Following and unfollowing people\n* Followers/following lists\n* Updating your \"bio\"\n* Uploading a profile picture\n* Changing your name (but the official app says you can only do this once — not sure if there's a limitation on the server side)\n* Notifications\n\nThe rest isn't implemented. In particular you can't create and moderate rooms. There's probably a hundred bugs in the existing functionality too.\n\n### Java? In %year%?! Why not Kotlin? Why are there no jetpack libraries? System fragments?!?! Are you out of your mind?\nMaybe I am. I use tools I'm most familiar with, not ones that are trendy at the particular day I'm starting the project.\n\n### The design...\n...sucks. Yes it does. See, this isn't meant to be a real product. I hastily put this together in 1.5 days. Alsmost like on a hackathon. This is more of a proof of concept, a stopgap measure before Clubhouse releases their official Android app that I'm sure they're making right now. It doesn't make sense to spend all this effort on something that's going to be obsolete in less than a year.\n\nIf you want to see a project where I do take UI/UX seriously and am obsessed over every little detail, go check out [Smithereen](https://github.com/grishka/Smithereen), the decentralized social media server.\n\n### Will this get my Clubhouse account banned?\nThe probability of that happening is not zero.\n\n### Why did you make this?\nI saw that project with the Clubhouse API reverse engineersed and thought to myself *why not*. The only thing I had to reverse engineer myself was the PubNub part, but a pirated copy of Charles made a quick job of that.\n\n### How do I build this?\nImport into Android Studio and click \"run\". Or, there's an apk you can install in the releases section.\n"
        },
        {
          "name": "UNLICENSE",
          "type": "blob",
          "size": 1.181640625,
          "content": "This is free and unencumbered software released into the public domain.\n\nAnyone is free to copy, modify, publish, use, compile, sell, or\ndistribute this software, either in source code form or as a compiled\nbinary, for any purpose, commercial or non-commercial, and by any\nmeans.\n\nIn jurisdictions that recognize copyright laws, the author or authors\nof this software dedicate any and all copyright interest in the\nsoftware to the public domain. We make this dedication for the benefit\nof the public at large and to the detriment of our heirs and\nsuccessors. We intend this dedication to be an overt act of\nrelinquishment in perpetuity of all present and future rights to this\nsoftware under copyright law.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS BE LIABLE FOR ANY CLAIM, DAMAGES OR\nOTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\nOTHER DEALINGS IN THE SOFTWARE.\n\nFor more information, please refer to <http://unlicense.org/>"
        },
        {
          "name": "build.gradle",
          "type": "blob",
          "size": 0.4990234375,
          "content": "// Top-level build file where you can add configuration options common to all sub-projects/modules.\n\nbuildscript {\n\trepositories {\n\t\tgoogle()\n\t\tjcenter()\n\t\t\n\t}\n\tdependencies {\n\t\tclasspath 'com.android.tools.build:gradle:3.4.2'\n\t\t\n\t\t// NOTE: Do not place your application dependencies here; they belong\n\t\t// in the individual module build.gradle files\n\t}\n}\n\nallprojects {\n\trepositories {\n\t\tgoogle()\n\t\tjcenter()\n\t\tmaven { url \"https://jitpack.io\" }\n\t}\n}\n\ntask clean(type: Delete) {\n\tdelete rootProject.buildDir\n}\n"
        },
        {
          "name": "gradle.properties",
          "type": "blob",
          "size": 1.046875,
          "content": "# Project-wide Gradle settings.\n# IDE (e.g. Android Studio) users:\n# Gradle settings configured through the IDE *will override*\n# any settings specified in this file.\n# For more details on how to configure your build environment visit\n# http://www.gradle.org/docs/current/userguide/build_environment.html\n# Specifies the JVM arguments used for the daemon process.\n# The setting is particularly useful for tweaking memory settings.\norg.gradle.jvmargs=-Xmx1536m\n# When configured, Gradle will run in incubating parallel mode.\n# This option should only be used with decoupled projects. More details, visit\n# http://www.gradle.org/docs/current/userguide/multi_project_builds.html#sec:decoupled_projects\n# org.gradle.parallel=true\n# AndroidX package structure to make it clearer which packages are bundled with the\n# Android operating system, and which are packaged with your app's APK\n# https://developer.android.com/topic/libraries/support-library/androidx-rn\nandroid.useAndroidX=true\n# Automatically convert third-party libraries to use AndroidX\nandroid.enableJetifier=true\n"
        },
        {
          "name": "settings.gradle",
          "type": "blob",
          "size": 0.048828125,
          "content": "include ':Houseclub'\nrootProject.name='Houseclub'\n"
        }
      ]
    }
  ]
}