{
  "metadata": {
    "timestamp": 1736608959840,
    "page": 167,
    "hasNextPage": true,
    "endCursor": "Y3Vyc29yOjE3MA==",
    "completionStatus": "IN_PROGRESS"
  },
  "repositories": [
    {
      "nameWithOwner": "dragonwell-project/dragonwell8",
      "stars": 4224,
      "defaultBranch": "master",
      "files": [
        {
          "name": ".gitattributes",
          "type": "blob",
          "size": 0.0078125,
          "content": "*\t-text\n"
        },
        {
          "name": ".github",
          "type": "tree",
          "content": null
        },
        {
          "name": ".gitignore",
          "type": "blob",
          "size": 0.19140625,
          "content": "/build/\n/dist/\n/.idea/\nnbproject/private/\n/webrev\n/.src-rev\n/.jib/\n.DS_Store\n.metadata/\n.recommenders/\ntest/nashorn/script/external\ntest/nashorn/lib\nNashornProfile.txt\n**/JTreport/**\n**/JTwork/**\n"
        },
        {
          "name": ".jcheck",
          "type": "tree",
          "content": null
        },
        {
          "name": "ASSEMBLY_EXCEPTION",
          "type": "blob",
          "size": 1.486328125,
          "content": "\nOPENJDK ASSEMBLY EXCEPTION\n\nThe OpenJDK source code made available by Oracle America, Inc. (Oracle) at\nopenjdk.java.net (\"OpenJDK Code\") is distributed under the terms of the GNU\nGeneral Public License <http://www.gnu.org/copyleft/gpl.html> version 2\nonly (\"GPL2\"), with the following clarification and special exception.\n\n    Linking this OpenJDK Code statically or dynamically with other code\n    is making a combined work based on this library.  Thus, the terms\n    and conditions of GPL2 cover the whole combination.\n\n    As a special exception, Oracle gives you permission to link this\n    OpenJDK Code with certain code licensed by Oracle as indicated at\n    http://openjdk.java.net/legal/exception-modules-2007-05-08.html\n    (\"Designated Exception Modules\") to produce an executable,\n    regardless of the license terms of the Designated Exception Modules,\n    and to copy and distribute the resulting executable under GPL2,\n    provided that the Designated Exception Modules continue to be\n    governed by the licenses under which they were offered by Oracle.\n\nAs such, it allows licensees and sublicensees of Oracle's GPL2 OpenJDK Code\nto build an executable that includes those portions of necessary code that\nOracle could not provide under GPL2 (or that Oracle has provided under GPL2\nwith the Classpath exception).  If you modify or add to the OpenJDK code,\nthat new GPL2 code may still be combined with Designated Exception Modules\nif the new code is made subject to this exception by its copyright holder.\n"
        },
        {
          "name": "LICENSE",
          "type": "blob",
          "size": 18.822265625,
          "content": "The GNU General Public License (GPL)\n\nVersion 2, June 1991\n\nCopyright (C) 1989, 1991 Free Software Foundation, Inc.\n51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n\nEveryone is permitted to copy and distribute verbatim copies of this license\ndocument, but changing it is not allowed.\n\nPreamble\n\nThe licenses for most software are designed to take away your freedom to share\nand change it.  By contrast, the GNU General Public License is intended to\nguarantee your freedom to share and change free software--to make sure the\nsoftware is free for all its users.  This General Public License applies to\nmost of the Free Software Foundation's software and to any other program whose\nauthors commit to using it.  (Some other Free Software Foundation software is\ncovered by the GNU Library General Public License instead.) You can apply it to\nyour programs, too.\n\nWhen we speak of free software, we are referring to freedom, not price.  Our\nGeneral Public Licenses are designed to make sure that you have the freedom to\ndistribute copies of free software (and charge for this service if you wish),\nthat you receive source code or can get it if you want it, that you can change\nthe software or use pieces of it in new free programs; and that you know you\ncan do these things.\n\nTo protect your rights, we need to make restrictions that forbid anyone to deny\nyou these rights or to ask you to surrender the rights.  These restrictions\ntranslate to certain responsibilities for you if you distribute copies of the\nsoftware, or if you modify it.\n\nFor example, if you distribute copies of such a program, whether gratis or for\na fee, you must give the recipients all the rights that you have.  You must\nmake sure that they, too, receive or can get the source code.  And you must\nshow them these terms so they know their rights.\n\nWe protect your rights with two steps: (1) copyright the software, and (2)\noffer you this license which gives you legal permission to copy, distribute\nand/or modify the software.\n\nAlso, for each author's protection and ours, we want to make certain that\neveryone understands that there is no warranty for this free software.  If the\nsoftware is modified by someone else and passed on, we want its recipients to\nknow that what they have is not the original, so that any problems introduced\nby others will not reflect on the original authors' reputations.\n\nFinally, any free program is threatened constantly by software patents.  We\nwish to avoid the danger that redistributors of a free program will\nindividually obtain patent licenses, in effect making the program proprietary.\nTo prevent this, we have made it clear that any patent must be licensed for\neveryone's free use or not licensed at all.\n\nThe precise terms and conditions for copying, distribution and modification\nfollow.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n0. This License applies to any program or other work which contains a notice\nplaced by the copyright holder saying it may be distributed under the terms of\nthis General Public License.  The \"Program\", below, refers to any such program\nor work, and a \"work based on the Program\" means either the Program or any\nderivative work under copyright law: that is to say, a work containing the\nProgram or a portion of it, either verbatim or with modifications and/or\ntranslated into another language.  (Hereinafter, translation is included\nwithout limitation in the term \"modification\".) Each licensee is addressed as\n\"you\".\n\nActivities other than copying, distribution and modification are not covered by\nthis License; they are outside its scope.  The act of running the Program is\nnot restricted, and the output from the Program is covered only if its contents\nconstitute a work based on the Program (independent of having been made by\nrunning the Program).  Whether that is true depends on what the Program does.\n\n1. You may copy and distribute verbatim copies of the Program's source code as\nyou receive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice and\ndisclaimer of warranty; keep intact all the notices that refer to this License\nand to the absence of any warranty; and give any other recipients of the\nProgram a copy of this License along with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and you may\nat your option offer warranty protection in exchange for a fee.\n\n2. You may modify your copy or copies of the Program or any portion of it, thus\nforming a work based on the Program, and copy and distribute such modifications\nor work under the terms of Section 1 above, provided that you also meet all of\nthese conditions:\n\n    a) You must cause the modified files to carry prominent notices stating\n    that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in whole or\n    in part contains or is derived from the Program or any part thereof, to be\n    licensed as a whole at no charge to all third parties under the terms of\n    this License.\n\n    c) If the modified program normally reads commands interactively when run,\n    you must cause it, when started running for such interactive use in the\n    most ordinary way, to print or display an announcement including an\n    appropriate copyright notice and a notice that there is no warranty (or\n    else, saying that you provide a warranty) and that users may redistribute\n    the program under these conditions, and telling the user how to view a copy\n    of this License.  (Exception: if the Program itself is interactive but does\n    not normally print such an announcement, your work based on the Program is\n    not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If identifiable\nsections of that work are not derived from the Program, and can be reasonably\nconsidered independent and separate works in themselves, then this License, and\nits terms, do not apply to those sections when you distribute them as separate\nworks.  But when you distribute the same sections as part of a whole which is a\nwork based on the Program, the distribution of the whole must be on the terms\nof this License, whose permissions for other licensees extend to the entire\nwhole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest your\nrights to work written entirely by you; rather, the intent is to exercise the\nright to control the distribution of derivative or collective works based on\nthe Program.\n\nIn addition, mere aggregation of another work not based on the Program with the\nProgram (or with a work based on the Program) on a volume of a storage or\ndistribution medium does not bring the other work under the scope of this\nLicense.\n\n3. You may copy and distribute the Program (or a work based on it, under\nSection 2) in object code or executable form under the terms of Sections 1 and\n2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable source\n    code, which must be distributed under the terms of Sections 1 and 2 above\n    on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three years, to\n    give any third party, for a charge no more than your cost of physically\n    performing source distribution, a complete machine-readable copy of the\n    corresponding source code, to be distributed under the terms of Sections 1\n    and 2 above on a medium customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer to\n    distribute corresponding source code.  (This alternative is allowed only\n    for noncommercial distribution and only if you received the program in\n    object code or executable form with such an offer, in accord with\n    Subsection b above.)\n\nThe source code for a work means the preferred form of the work for making\nmodifications to it.  For an executable work, complete source code means all\nthe source code for all modules it contains, plus any associated interface\ndefinition files, plus the scripts used to control compilation and installation\nof the executable.  However, as a special exception, the source code\ndistributed need not include anything that is normally distributed (in either\nsource or binary form) with the major components (compiler, kernel, and so on)\nof the operating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering access to copy\nfrom a designated place, then offering equivalent access to copy the source\ncode from the same place counts as distribution of the source code, even though\nthird parties are not compelled to copy the source along with the object code.\n\n4. You may not copy, modify, sublicense, or distribute the Program except as\nexpressly provided under this License.  Any attempt otherwise to copy, modify,\nsublicense or distribute the Program is void, and will automatically terminate\nyour rights under this License.  However, parties who have received copies, or\nrights, from you under this License will not have their licenses terminated so\nlong as such parties remain in full compliance.\n\n5. You are not required to accept this License, since you have not signed it.\nHowever, nothing else grants you permission to modify or distribute the Program\nor its derivative works.  These actions are prohibited by law if you do not\naccept this License.  Therefore, by modifying or distributing the Program (or\nany work based on the Program), you indicate your acceptance of this License to\ndo so, and all its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n6. Each time you redistribute the Program (or any work based on the Program),\nthe recipient automatically receives a license from the original licensor to\ncopy, distribute or modify the Program subject to these terms and conditions.\nYou may not impose any further restrictions on the recipients' exercise of the\nrights granted herein.  You are not responsible for enforcing compliance by\nthird parties to this License.\n\n7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues), conditions\nare imposed on you (whether by court order, agreement or otherwise) that\ncontradict the conditions of this License, they do not excuse you from the\nconditions of this License.  If you cannot distribute so as to satisfy\nsimultaneously your obligations under this License and any other pertinent\nobligations, then as a consequence you may not distribute the Program at all.\nFor example, if a patent license would not permit royalty-free redistribution\nof the Program by all those who receive copies directly or indirectly through\nyou, then the only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply and\nthe section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any patents or\nother property right claims or to contest validity of any such claims; this\nsection has the sole purpose of protecting the integrity of the free software\ndistribution system, which is implemented by public license practices.  Many\npeople have made generous contributions to the wide range of software\ndistributed through that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing to\ndistribute software through any other system and a licensee cannot impose that\nchoice.\n\nThis section is intended to make thoroughly clear what is believed to be a\nconsequence of the rest of this License.\n\n8. If the distribution and/or use of the Program is restricted in certain\ncountries either by patents or by copyrighted interfaces, the original\ncopyright holder who places the Program under this License may add an explicit\ngeographical distribution limitation excluding those countries, so that\ndistribution is permitted only in or among countries not thus excluded.  In\nsuch case, this License incorporates the limitation as if written in the body\nof this License.\n\n9. The Free Software Foundation may publish revised and/or new versions of the\nGeneral Public License from time to time.  Such new versions will be similar in\nspirit to the present version, but may differ in detail to address new problems\nor concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any later\nversion\", you have the option of following the terms and conditions either of\nthat version or of any later version published by the Free Software Foundation.\nIf the Program does not specify a version number of this License, you may\nchoose any version ever published by the Free Software Foundation.\n\n10. If you wish to incorporate parts of the Program into other free programs\nwhose distribution conditions are different, write to the author to ask for\npermission.  For software which is copyrighted by the Free Software Foundation,\nwrite to the Free Software Foundation; we sometimes make exceptions for this.\nOur decision will be guided by the two goals of preserving the free status of\nall derivatives of our free software and of promoting the sharing and reuse of\nsoftware generally.\n\nNO WARRANTY\n\n11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR\nTHE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN OTHERWISE\nSTATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE\nPROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE,\nYOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL\nANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE\nPROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY\nGENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR\nINABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA\nBEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER\nOR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest possible\nuse to the public, the best way to achieve this is to make it free software\nwhich everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program.  It is safest to attach\nthem to the start of each source file to most effectively convey the exclusion\nof warranty; and each file should have at least the \"copyright\" line and a\npointer to where the full notice is found.\n\n    One line to give the program's name and a brief idea of what it does.\n\n    Copyright (C) <year> <name of author>\n\n    This program is free software; you can redistribute it and/or modify it\n    under the terms of the GNU General Public License as published by the Free\n    Software Foundation; either version 2 of the License, or (at your option)\n    any later version.\n\n    This program is distributed in the hope that it will be useful, but WITHOUT\n    ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n    FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for\n    more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this when it\nstarts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author Gnomovision comes\n    with ABSOLUTELY NO WARRANTY; for details type 'show w'.  This is free\n    software, and you are welcome to redistribute it under certain conditions;\n    type 'show c' for details.\n\nThe hypothetical commands 'show w' and 'show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may be\ncalled something other than 'show w' and 'show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your school,\nif any, to sign a \"copyright disclaimer\" for the program, if necessary.  Here\nis a sample; alter the names:\n\n    Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n    'Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n    signature of Ty Coon, 1 April 1989\n\n    Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Library General Public\nLicense instead of this License.\n\n\n\"CLASSPATH\" EXCEPTION TO THE GPL\n\nCertain source files distributed by Oracle America and/or its affiliates are\nsubject to the following clarification and special exception to the GPL, but\nonly where Oracle has expressly included in the particular source file's header\nthe words \"Oracle designates this particular file as subject to the \"Classpath\"\nexception as provided by Oracle in the LICENSE file that accompanied this code.\"\n\n    Linking this library statically or dynamically with other modules is making\n    a combined work based on this library.  Thus, the terms and conditions of\n    the GNU General Public License cover the whole combination.\n\n    As a special exception, the copyright holders of this library give you\n    permission to link this library with independent modules to produce an\n    executable, regardless of the license terms of these independent modules,\n    and to copy and distribute the resulting executable under terms of your\n    choice, provided that you also meet, for each linked independent module,\n    the terms and conditions of the license of that module.  An independent\n    module is a module which is not derived from or based on this library.  If\n    you modify this library, you may extend this exception to your version of\n    the library, but you are not obligated to do so.  If you do not wish to do\n    so, delete this exception statement from your version.\n"
        },
        {
          "name": "Makefile",
          "type": "blob",
          "size": 6.2001953125,
          "content": "#\n# Copyright (c) 2012, 2013, Oracle and/or its affiliates. All rights reserved.\n# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n#\n# This code is free software; you can redistribute it and/or modify it\n# under the terms of the GNU General Public License version 2 only, as\n# published by the Free Software Foundation.  Oracle designates this\n# particular file as subject to the \"Classpath\" exception as provided\n# by Oracle in the LICENSE file that accompanied this code.\n#\n# This code is distributed in the hope that it will be useful, but WITHOUT\n# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n# version 2 for more details (a copy is included in the LICENSE file that\n# accompanied this code).\n#\n# You should have received a copy of the GNU General Public License version\n# 2 along with this work; if not, write to the Free Software Foundation,\n# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n#\n# Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n# or visit www.oracle.com if you need additional information or have any\n# questions.\n#\n\n# This must be the first rule\ndefault:\n\n# Inclusion of this pseudo-target will cause make to execute this file\n# serially, regardless of -j. Recursively called makefiles will not be\n# affected, however. This is required for correct dependency management.\n.NOTPARALLEL:\n\n# The shell code below will be executed on /usr/ccs/bin/make on Solaris, but not in GNU make.\n# /usr/ccs/bin/make lacks basically every other flow control mechanism.\nTEST_FOR_NON_GNUMAKE:sh=echo You are not using GNU make/gmake, this is a requirement. Check your path. 1>&2 && exit 1\n\n# Assume we have GNU make, but check version.\nifeq ($(strip $(foreach v, 3.81% 3.82% 4.%, $(filter $v, $(MAKE_VERSION)))), )\n  $(error This version of GNU Make is too low ($(MAKE_VERSION)). Check your path, or upgrade to 3.81 or newer.)\nendif\n\n# Locate this Makefile\nifeq ($(filter /%,$(lastword $(MAKEFILE_LIST))),)\n  makefile_path:=$(CURDIR)/$(lastword $(MAKEFILE_LIST))\nelse\n  makefile_path:=$(lastword $(MAKEFILE_LIST))\nendif\nroot_dir:=$(dir $(makefile_path))\n\n# ... and then we can include our helper functions\ninclude $(root_dir)/make/MakeHelpers.gmk\n\n$(eval $(call ParseLogLevel))\n$(eval $(call ParseConfAndSpec))\n\n# Now determine if we have zero, one or several configurations to build.\nifeq ($(SPEC),)\n  # Since we got past ParseConfAndSpec, we must be building a global target. Do nothing.\nelse\n  ifeq ($(words $(SPEC)),1)\n    # We are building a single configuration. This is the normal case. Execute the Main.gmk file.\n    include $(root_dir)/make/Main.gmk\n  else\n    # We are building multiple configurations.\n    # First, find out the valid targets\n    # Run the makefile with an arbitrary SPEC using -p -q (quiet dry-run and dump rules) to find\n    # available PHONY targets. Use this list as valid targets to pass on to the repeated calls.\n    all_phony_targets=$(filter-out $(global_targets), $(strip $(shell \\\n        cd $(root_dir) && $(MAKE) -p -q FRC SPEC=$(firstword $(SPEC)) | \\\n        grep ^.PHONY: | head -n 1 | cut -d \" \" -f 2-)))\n\n    $(all_phony_targets):\n\t@$(foreach spec,$(SPEC),(cd $(root_dir) && $(MAKE) SPEC=$(spec) \\\n\t    $(VERBOSE) VERBOSE=$(VERBOSE) LOG_LEVEL=$(LOG_LEVEL) $@) &&) true\n\n    .PHONY: $(all_phony_targets)\n\n  endif\nendif\n\n# Here are \"global\" targets, i.e. targets that can be executed without specifying a single configuration.\n# If you addd more global targets, please update the variable global_targets in MakeHelpers.\n\nhelp:\n\t$(info )\n\t$(info OpenJDK Makefile help)\n\t$(info =====================)\n\t$(info )\n\t$(info Common make targets)\n\t$(info .  make [default]         # Compile all product in langtools, hotspot, jaxp, jaxws,)\n\t$(info .                         # corba and jdk)\n\t$(info .  make all               # Compile everything, all repos and images)\n\t$(info .  make images            # Create complete j2sdk and j2re images)\n\t$(info .  make docs              # Create javadocs)\n\t$(info .  make overlay-images    # Create limited images for sparc 64 bit platforms)\n\t$(info .  make profiles          # Create complete j2re compact profile images)\n\t$(info .  make bootcycle-images  # Build images twice, second time with newly build JDK)\n\t$(info .  make install           # Install the generated images locally)\n\t$(info .  make clean             # Remove all files generated by make, but not those)\n\t$(info .                         # generated by configure)\n\t$(info .  make dist-clean        # Remove all files, including configuration)\n\t$(info .  make help              # Give some help on using make)\n\t$(info .  make test              # Run tests, default is \"jdk_core langtools_jtreg\" (see TEST below))\n\t$(info )\n\t$(info Targets for specific components)\n\t$(info (Component is any of langtools, corba, jaxp, jaxws, hotspot, jdk, nashorn, images, overlay-images, docs or test))\n\t$(info .  make <component>       # Build <component> and everything it depends on. )\n\t$(info .  make <component>-only  # Build <component> only, without dependencies. This)\n\t$(info .                         # is faster but can result in incorrect build results!)\n\t$(info .  make clean-<component> # Remove files generated by make for <component>)\n\t$(info )\n\t$(info Useful make variables)\n\t$(info .  make CONF=             # Build all configurations (note, assignment is empty))\n\t$(info .  make CONF=<substring>  # Build the configuration(s) with a name matching)\n\t$(info .                         # <substring>)\n\t$(info )\n\t$(info .  make LOG=<loglevel>    # Change the log level from warn to <loglevel>)\n\t$(info .                         # Available log levels are:)\n\t$(info .                         # 'warn' (default), 'info', 'debug' and 'trace')\n\t$(info .                         # To see executed command lines, use LOG=debug)\n\t$(info )\n\t$(info .  make JOBS=<n>          # Run <n> parallel make jobs)\n\t$(info .                         # Note that -jN does not work as expected!)\n\t$(info )\n\t$(info .  make test TEST=<test>  # Only run the given test or tests, e.g.)\n\t$(info .                         # make test TEST=\"jdk_lang jdk_net\")\n\t$(info .                         # or)\n\t$(info .                         # make test TEST=\"tier1\")\n\t$(info )\n\n.PHONY: help\n"
        },
        {
          "name": "README.md",
          "type": "blob",
          "size": 3.9521484375,
          "content": "![Dragonwell Logo](https://raw.githubusercontent.com/wiki/dragonwell-project/dragonwell8/images/dragonwell_std_txt_horiz.png)\n\n[Alibaba Dragonwell8 User Guide](https://github.com/dragonwell-project/dragonwell8/wiki/Alibaba-Dragonwell8-User-Guide)\n\n[Alibaba Dragonwell8 Extended Edition Release Notes](https://github.com/dragonwell-project/dragonwell8/wiki/Alibaba-Dragonwell8-Extended-Edition-Release-Notes)\n\n[Alibaba Dragonwell8 Standard Edition Release Notes](https://github.com/dragonwell-project/dragonwell8/wiki/Alibaba-Dragonwell8-Standard-Edition-Release-Notes)\n\n# Introduction\n\nOver the years, Java has proliferated in Alibaba. Many applications are written in Java and many our Java developers have written more than one billion lines of Java code.\n\nAlibaba Dragonwell, as a downstream version of OpenJDK, is the in-house OpenJDK implementation at Alibaba optimized for online e-commerce, financial, logistics applications running on 100,000+ servers. Alibaba Dragonwell is the engine that runs these distributed Java applications in extreme scaling.\n\nThe current release supports Linux/x86_64 platform only.\n\nAlibaba Dragonwell is clearly a \"friendly fork\" under the same licensing terms as the upstream OpenJDK project. Alibaba is committed to collaborate closely with OpenJDK community and intends to bring as many customized features as possible from Alibaba Dragonwell to the upstream.\n\n# Using Alibaba Dragonwell\n\nAlibaba Dragonwell JDK currently supports Linux/x86_64 platform only.\n\n### Installation\n\n##### Option 1, Download and install pre-built Alibaba Dragonwell\n\n* You may download a pre-built Alibaba Dragonwell JDK from its GitHub page:\nhttps://github.com/dragonwell-project/dragonwell8/releases.\n* Uncompress the package to the installation directory.\n\n##### Option 2, Install via YUM\n\nAlibaba Dragonwell is officially supported and maintained in Alibaba Cloud Linux 2 (Aliyun Linux 2) YUM repository, and this repo should be also compatible with Aliyun Linux 17.1, Red Hat Enterprise Linux 7 and CentOS 7.\n\n* For users running Alibaba Cloud Linux 2 OS, you should be able to install Alibaba Dragonwell by simply running: `sudo yum install -y java-1.8.0-alibaba-dragonwell`;\n* For users running with aforementioned compatible distros, place a new repository file under `/etc/yum.repos.d` (e.g.: `/etc/repos.d/alinux-plus.repo`) with contents as follows, then you should be able to install Alibaba Dragonwell by executing: `sudo yum install -y java-1.8.0-alibaba-dragonwell`:\n```\n# plus packages provided by Aliyun Linux dev team\n[plus]\nname=AliYun-2.1903 - Plus - mirrors.aliyun.com\nbaseurl=http://mirrors.aliyun.com/alinux/2.1903/plus/$basearch/\ngpgcheck=1\ngpgkey=http://mirrors.aliyun.com/alinux/RPM-GPG-KEY-ALIYUN\n```\n\n### Enable Alibaba Dragonwell for Java applications\n\nTo enable Alibaba Dragonwell JDK for your application, simply set `JAVA_HOME` to point to the installation directory of Alibaba Dragonwell. If you installed Dragonwell JDK via YUM, follow the instructions prompted from post-install outputs, e.g.:\n\n```\n=======================================================================\nAlibaba Dragonwell is installed to:\n    /opt/alibaba/java-1.8.0-alibaba-dragonwell-8.0.0.212.b04-1.al7\nYou can set Alibaba Dragonwell as default JDK by exporting the\nfollowing ENV VARs:\n$ export JAVA_HOME=/opt/alibaba/java-1.8.0-alibaba-dragonwell-8.0.0.212.b04-1.al7\n$ export PATH=${JAVA_HOME}/bin:$PATH\n=======================================================================\n```\n\n# Acknowledgement\n\nSpecial thanks to those who have made contributions to Alibaba's internal JDK builds.\n\n# Publications\n\nTechnologies included in Alibaba Dragonwell have been published in following papers\n\n* ICSE'19：https://2019.icse-conferences.org/event/icse-2019-technical-papers-safecheck-safety-enhancement-of-java-unsafe-api\n\n* ICPE'18: https://dl.acm.org/citation.cfm?id=3186295\n\n* ICSE'18 SEIP  https://www.icse2018.org/event/icse-2018-software-engineering-in-practice-java-performance-troubleshooting-and-optimization-at-alibaba\n"
        },
        {
          "name": "THIRD_PARTY_README",
          "type": "blob",
          "size": 154.5390625,
          "content": "DO NOT TRANSLATE OR LOCALIZE.\n-----------------------------\n\n%% This notice is provided with respect to ASM Bytecode Manipulation \nFramework v5.0.3, which may be included with JRE 8, and JDK 8, and \nOpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) 2000-2011 France T??l??com\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n\n3. Neither the name of the copyright holders nor the names of its\n   contributors may be used to endorse or promote products derived from\n   this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF\nTHE POSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n--------------------------------------------------------------------------------\n\n%% This notice is provided with respect to BSDiff v4.3, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright 2003-2005 Colin Percival\nAll rights reserved\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted providing that the following conditions\nare met:\n1. Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\nOR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\nHOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\nSTRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to CodeViewer 1.0, which may be\nincluded with JDK 8.\n\n--- begin of LICENSE ---\n\nCopyright 1999 by CoolServlets.com.\n\nAny errors or suggested improvements to this class can be reported as\ninstructed on CoolServlets.com. We hope you enjoy this program... your\ncomments will encourage further development!  This software is distributed\nunder the terms of the BSD License.  Redistribution and use in source and\nbinary forms, with or without modification, are permitted provided that the\nfollowing conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\nNeither name of CoolServlets.com nor the names of its contributors may be\nused to endorse or promote products derived from this software without\nspecific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY COOLSERVLETS.COM AND CONTRIBUTORS ``AS IS'' AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\"\n\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Cryptix AES 3.2.0, which may be\nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCryptix General License\n\nCopyright (c) 1995-2005 The Cryptix Foundation Limited.\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n  1. Redistributions of source code must retain the copyright notice,\n     this list of conditions and the following disclaimer.\n\n  2. Redistributions in binary form must reproduce the above copyright\n     notice, this list of conditions and the following disclaimer in\n     the documentation and/or other materials provided with the\n     distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE CRYPTIX FOUNDATION LIMITED AND\nCONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\nIN NO EVENT SHALL THE CRYPTIX FOUNDATION LIMITED OR CONTRIBUTORS BE\nLIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\nOR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\nIF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to CUP Parser Generator for\nJava 0.11b, which may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright 1996-2015 by Scott Hudson, Frank Flannery, C. Scott Ananian, Michael Petter\n\nPermission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose and without fee is hereby granted, provided\nthat the above copyright notice appear in all copies and that both the\ncopyright notice and this permission notice and warranty disclaimer appear in\nsupporting documentation, and that the names of the authors or their\nemployers not be used in advertising or publicity pertaining to distribution of\nthe software without specific, written prior permission.\n\nThe authors and their employers disclaim all warranties with regard to\nthis software, including all implied warranties of merchantability and fitness.\nIn no event shall the authors or their employers be liable for any special,\nindirect or consequential damages or any damages whatsoever resulting from\nloss of use, data or profits, whether in an action of contract, negligence or\nother tortious action, arising out of or in connection with the use or\nperformance of this software.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to DejaVu fonts v2.34, which may be\nincluded with JRE 8, and JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nFonts are (c) Bitstream (see below). DejaVu changes are in public domain.\nGlyphs imported from Arev fonts are (c) Tavmjong Bah (see below)\n\n\nBitstream Vera Fonts Copyright\n------------------------------\n\nCopyright (c) 2003 by Bitstream, Inc. All Rights Reserved. Bitstream Vera is\na trademark of Bitstream, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof the fonts accompanying this license (\"Fonts\") and associated\ndocumentation files (the \"Font Software\"), to reproduce and distribute the\nFont Software, including without limitation the rights to use, copy, merge,\npublish, distribute, and/or sell copies of the Font Software, and to permit\npersons to whom the Font Software is furnished to do so, subject to the\nfollowing conditions:\n\nThe above copyright and trademark notices and this permission notice shall\nbe included in all copies of one or more of the Font Software typefaces.\n\nThe Font Software may be modified, altered, or added to, and in particular\nthe designs of glyphs or characters in the Fonts may be modified and\nadditional glyphs or characters may be added to the Fonts, only if the fonts\nare renamed to names not containing either the words \"Bitstream\" or the word\n\"Vera\".\n\nThis License becomes null and void to the extent applicable to Fonts or Font\nSoftware that has been modified and is distributed under the \"Bitstream\nVera\" names.\n\nThe Font Software may be sold as part of a larger software package but no\ncopy of one or more of the Font Software typefaces may be sold by itself.\n\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF COPYRIGHT, PATENT,\nTRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL BITSTREAM OR THE GNOME\nFOUNDATION BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING\nANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES,\nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF\nTHE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM OTHER DEALINGS IN THE\nFONT SOFTWARE.\n\nExcept as contained in this notice, the names of Gnome, the Gnome\nFoundation, and Bitstream Inc., shall not be used in advertising or\notherwise to promote the sale, use or other dealings in this Font Software\nwithout prior written authorization from the Gnome Foundation or Bitstream\nInc., respectively. For further information, contact: fonts at gnome dot\norg.\n\nArev Fonts Copyright\n------------------------------\n\nCopyright (c) 2006 by Tavmjong Bah. All Rights Reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of the fonts accompanying this license (\"Fonts\") and\nassociated documentation files (the \"Font Software\"), to reproduce\nand distribute the modifications to the Bitstream Vera Font Software,\nincluding without limitation the rights to use, copy, merge, publish,\ndistribute, and/or sell copies of the Font Software, and to permit\npersons to whom the Font Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright and trademark notices and this permission notice\nshall be included in all copies of one or more of the Font Software\ntypefaces.\n\nThe Font Software may be modified, altered, or added to, and in\nparticular the designs of glyphs or characters in the Fonts may be\nmodified and additional glyphs or characters may be added to the\nFonts, only if the fonts are renamed to names not containing either\nthe words \"Tavmjong Bah\" or the word \"Arev\".\n\nThis License becomes null and void to the extent applicable to Fonts\nor Font Software that has been modified and is distributed under the\n\"Tavmjong Bah Arev\" names.\n\nThe Font Software may be sold as part of a larger software package but\nno copy of one or more of the Font Software typefaces may be sold by\nitself.\n\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL\nTAVMJONG BAH BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\nINCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL\nDAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM\nOTHER DEALINGS IN THE FONT SOFTWARE.\n\nExcept as contained in this notice, the name of Tavmjong Bah shall not\nbe used in advertising or otherwise to promote the sale, use or other\ndealings in this Font Software without prior written authorization\nfrom Tavmjong Bah. For further information, contact: tavmjong @ free\n. fr.\n\nTeX Gyre DJV Math\n-----------------\nFonts are (c) Bitstream (see below). DejaVu changes are in public domain.\n\nMath extensions done by B. Jackowski, P. Strzelczyk and P. Pianowski\n(on behalf of TeX users groups) are in public domain.\n\nLetters imported from Euler Fraktur from AMSfonts are (c) American\nMathematical Society (see below).\nBitstream Vera Fonts Copyright\nCopyright (c) 2003 by Bitstream, Inc. All Rights Reserved. Bitstream Vera\nis a trademark of Bitstream, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof the fonts accompanying this license (\"Fonts\") and associated documentation\nfiles (the \"Font Software\"), to reproduce and distribute the Font Software,\nincluding without limitation the rights to use, copy, merge, publish,\ndistribute, and/or sell copies of the Font Software, and to permit persons\nto whom the Font Software is furnished to do so, subject to the following\nconditions:\n\nThe above copyright and trademark notices and this permission notice\nshall be included in all copies of one or more of the Font Software typefaces.\n\nThe Font Software may be modified, altered, or added to, and in particular\nthe designs of glyphs or characters in the Fonts may be modified and\nadditional glyphs or characters may be added to the Fonts, only if the\nfonts are renamed to names not containing either the words \"Bitstream\"\nor the word \"Vera\".\n\nThis License becomes null and void to the extent applicable to Fonts or\nFont Software that has been modified and is distributed under the\n\"Bitstream Vera\" names.\n\nThe Font Software may be sold as part of a larger software package but\nno copy of one or more of the Font Software typefaces may be sold by itself.\n\nTHE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF COPYRIGHT, PATENT,\nTRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL BITSTREAM OR THE GNOME\nFOUNDATION BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING\nANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR CONSEQUENTIAL DAMAGES,\nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT\nOF THE USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM OTHER DEALINGS IN\nTHE FONT SOFTWARE.\nExcept as contained in this notice, the names of GNOME, the GNOME\nFoundation, and Bitstream Inc., shall not be used in advertising or \notherwise to promote the sale, use or other dealings in this Font Software\nwithout prior written authorization from the GNOME Foundation or \nBitstream Inc., respectively.\nFor further information, contact: fonts at gnome dot org.\n\nAMSFonts (v. 2.2) copyright\n\nThe PostScript Type 1 implementation of the AMSFonts produced by and\npreviously distributed by Blue Sky Research and Y&Y, Inc. are now freely\navailable for general use. This has been accomplished through the\ncooperation\nof a consortium of scientific publishers with Blue Sky Research and Y&Y.\nMembers of this consortium include:\n\nElsevier Science IBM Corporation Society for Industrial and Applied\nMathematics (SIAM) Springer-Verlag American Mathematical Society (AMS)\n\nIn order to assure the authenticity of these fonts, copyright will be\nheld by the American Mathematical Society. This is not meant to restrict\nin any way the legitimate use of the fonts, such as (but not limited to)\nelectronic distribution of documents containing these fonts, inclusion of\nthese fonts into other public domain or commercial font collections or computer\napplications, use of the outline data to create derivative fonts and/or\nfaces, etc. However, the AMS does require that the AMS copyright notice be\nremoved from any derivative versions of the fonts which have been altered in\nany way. In addition, to ensure the fidelity of TeX documents using Computer\nModern fonts, Professor Donald Knuth, creator of the Computer Modern faces,\nhas requested that any alterations which yield different font metrics be\ngiven a different name.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Document Object Model (DOM) Level 2\n& 3, which may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nW3C SOFTWARE NOTICE AND LICENSE\n\nhttp://www.w3.org/Consortium/Legal/2002/copyright-software-20021231\n\nThis work (and included software, documentation such as READMEs, or other\nrelated items) is being provided by the copyright holders under the following\nlicense. By obtaining, using and/or copying this work, you (the licensee)\nagree that you have read, understood, and will comply with the following terms\nand conditions.\n\nPermission to copy, modify, and distribute this software and its\ndocumentation, with or without modification, for any purpose and without fee\nor royalty is hereby granted, provided that you include the following on ALL\ncopies of the software and documentation or portions thereof, including\nmodifications:\n\n   1.The full text of this NOTICE in a location viewable to users of the\n   redistributed or derivative work.\n\n   2.Any pre-existing intellectual property disclaimers, notices, or terms and\n   conditions. If none exist, the W3C Software Short Notice should be included\n   (hypertext is preferred, text is permitted) within the body of any\n   redistributed or derivative code.\n\n   3.Notice of any changes or modifications to the files, including the date\n   changes were made. (We recommend you provide URIs to the location from\n   which the code is derived.)\n\nTHIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS\nMAKE NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT\nLIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR\nPURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENTATION WILL NOT INFRINGE ANY\nTHIRD PARTY PATENTS,COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n\nCOPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL\nOR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE SOFTWARE OR\nDOCUMENTATION.  The name and trademarks of copyright holders may NOT be used\nin advertising or publicity pertaining to the software without specific,\nwritten prior permission. Title to copyright in this software and any\nassociated documentation will at all times remain with copyright holders.\n\n____________________________________\n\nThis formulation of W3C's notice and license became active on December 31\n2002. This version removes the copyright ownership notice such that this\nlicense can be used with materials other than those owned by the W3C, reflects\nthat ERCIM is now a host of the W3C, includes references to this specific\ndated version of the license, and removes the ambiguous grant of \"use\".\nOtherwise, this version is the same as the previous version and is written so\nas to preserve the Free Software Foundation's assessment of GPL compatibility\nand OSI's certification under the Open Source Definition. Please see our\nCopyright FAQ for common questions about using materials from our site,\nincluding specific terms and conditions for packages like libwww, Amaya, and\nJigsaw. Other questions about this notice can be directed to\nsite-policy@w3.org.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Dynalink v0.5, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) 2009-2013, Attila Szegedi\n\nAll rights reserved.Redistribution and use in source and binary forms, with or\nwithout modification, are permitted provided that the following conditions are\nmet:* Redistributions of source code must retain the above copyright notice,\nthis list of conditions and the following disclaimer.  * Redistributions in\nbinary form must reproduce the above copyright notice,   this list of\nconditions and the following disclaimer in the documentation  and/or other\nmaterials provided with the distribution.  * Neither the name of Attila\nSzegedi nor the names of its contributors may be used to endorse or promote\nproducts derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THEPOSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Elliptic Curve Cryptography, which \nmay be included with JRE 8, JDK 8, and OpenJDK 8.\n\nYou are receiving a copy of the Elliptic Curve Cryptography library in source\nform with the JDK 8 and OpenJDK 8 source distributions, and as object code in\nthe JRE 8 & JDK 8 runtimes.\n\nIn the case of the JRE & JDK runtimes, the terms of the Oracle license do\nNOT apply to the Elliptic Curve Cryptography library; it is licensed under the\nfollowing license, separately from Oracle's JDK & JRE.  If you do not wish to\ninstall the Elliptic Curve Cryptography library, you may delete the\nElliptic Curve Cryptography library:\n   - On Solaris and Linux systems: delete $(JAVA_HOME)/lib/libsunec.so\n   - On Windows systems: delete $(JAVA_HOME)\\bin\\sunec.dll\n   - On Mac systems, delete:\n      for JRE: /Library/Internet\\ Plug-Ins/JavaAppletPlugin.plugin/Contents/Home/lib/libsunec.dylib\n      for JDK: $(JAVA_HOME)/jre/lib/libsunec.dylib\n\nWritten Offer for ECC Source Code\n  For third party technology that you receive from Oracle in binary form \n  which is licensed under an open source license that gives you the right\n  to receive the source code for that binary, you can obtain a copy of \n  the applicable source code from this page:\n     http://hg.openjdk.java.net/jdk8u/jdk8u/jdk/file/tip/src/share/native/sun/security/ec/impl\n\n  If the source code for the technology was not provided to you with the \n  binary, you can also receive a copy of the source code on physical \n  media by submitting a written request to:\n\n     Oracle America, Inc.\n     Attn: Associate General Counsel,\n     Development and Engineering Legal\n     500 Oracle Parkway, 10th Floor\n     Redwood Shores, CA 94065\n\n  Or, you may send an email to Oracle using the form at:\n     http://www.oracle.com/goto/opensourcecode/request\n\n  Your request should include:\n    - The name of the component or binary file(s) for which you are requesting \n      the source code\n    - The name and version number of the Oracle product containing the binary\n    - The date you received the Oracle product\n    - Your name\n    - Your company name (if applicable)\n    - Your return mailing address and email and\n    - A telephone number in the event we need to reach you.\n\n  We may charge you a fee to cover the cost of physical media and processing. \n  Your request must be sent (i) within three (3) years of the date you \n  received the Oracle product that included the component or binary \n  file(s) that are the subject of your request, or (ii) in the case of \n  code licensed under the GPL v3, for as long as Oracle offers spare \n  parts or customer support for that product model.\n\n--- begin of LICENSE ---\n\n                  GNU LESSER GENERAL PUBLIC LICENSE\n                       Version 2.1, February 1999\n\n Copyright (C) 1991, 1999 Free Software Foundation, Inc.\n 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n[This is the first released version of the Lesser GPL.  It also counts\n as the successor of the GNU Library Public License, version 2, hence\n the version number 2.1.]\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicenses are intended to guarantee your freedom to share and change\nfree software--to make sure the software is free for all its users.\n\n  This license, the Lesser General Public License, applies to some\nspecially designated software packages--typically libraries--of the\nFree Software Foundation and other authors who decide to use it.  You\ncan use it too, but we suggest you first think carefully about whether\nthis license or the ordinary General Public License is the better\nstrategy to use in any particular case, based on the explanations below.\n\n  When we speak of free software, we are referring to freedom of use,\nnot price.  Our General Public Licenses are designed to make sure that\nyou have the freedom to distribute copies of free software (and charge\nfor this service if you wish); that you receive source code or can get\nit if you want it; that you can change the software and use pieces of\nit in new free programs; and that you are informed that you can do\nthese things.\n\n  To protect your rights, we need to make restrictions that forbid\ndistributors to deny you these rights or to ask you to surrender these\nrights.  These restrictions translate to certain responsibilities for\nyou if you distribute copies of the library or if you modify it.\n\n  For example, if you distribute copies of the library, whether gratis\nor for a fee, you must give the recipients all the rights that we gave\nyou.  You must make sure that they, too, receive or can get the source\ncode.  If you link other code with the library, you must provide\ncomplete object files to the recipients, so that they can relink them\nwith the library after making changes to the library and recompiling\nit.  And you must show them these terms so they know their rights.\n\n  We protect your rights with a two-step method: (1) we copyright the\nlibrary, and (2) we offer you this license, which gives you legal\npermission to copy, distribute and/or modify the library.\n\n  To protect each distributor, we want to make it very clear that\nthere is no warranty for the free library.  Also, if the library is\nmodified by someone else and passed on, the recipients should know\nthat what they have is not the original version, so that the original\nauthor's reputation will not be affected by problems that might be\nintroduced by others.\n\f\n  Finally, software patents pose a constant threat to the existence of\nany free program.  We wish to make sure that a company cannot\neffectively restrict the users of a free program by obtaining a\nrestrictive license from a patent holder.  Therefore, we insist that\nany patent license obtained for a version of the library must be\nconsistent with the full freedom of use specified in this license.\n\n  Most GNU software, including some libraries, is covered by the\nordinary GNU General Public License.  This license, the GNU Lesser\nGeneral Public License, applies to certain designated libraries, and\nis quite different from the ordinary General Public License.  We use\nthis license for certain libraries in order to permit linking those\nlibraries into non-free programs.\n\n  When a program is linked with a library, whether statically or using\na shared library, the combination of the two is legally speaking a\ncombined work, a derivative of the original library.  The ordinary\nGeneral Public License therefore permits such linking only if the\nentire combination fits its criteria of freedom.  The Lesser General\nPublic License permits more lax criteria for linking other code with\nthe library.\n\n  We call this license the \"Lesser\" General Public License because it\ndoes Less to protect the user's freedom than the ordinary General\nPublic License.  It also provides other free software developers Less\nof an advantage over competing non-free programs.  These disadvantages\nare the reason we use the ordinary General Public License for many\nlibraries.  However, the Lesser license provides advantages in certain\nspecial circumstances.\n\n  For example, on rare occasions, there may be a special need to\nencourage the widest possible use of a certain library, so that it becomes\na de-facto standard.  To achieve this, non-free programs must be\nallowed to use the library.  A more frequent case is that a free\nlibrary does the same job as widely used non-free libraries.  In this\ncase, there is little to gain by limiting the free library to free\nsoftware only, so we use the Lesser General Public License.\n\n  In other cases, permission to use a particular library in non-free\nprograms enables a greater number of people to use a large body of\nfree software.  For example, permission to use the GNU C Library in\nnon-free programs enables many more people to use the whole GNU\noperating system, as well as its variant, the GNU/Linux operating\nsystem.\n\n  Although the Lesser General Public License is Less protective of the\nusers' freedom, it does ensure that the user of a program that is\nlinked with the Library has the freedom and the wherewithal to run\nthat program using a modified version of the Library.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.  Pay close attention to the difference between a\n\"work based on the library\" and a \"work that uses the library\".  The\nformer contains code derived from the library, whereas the latter must\nbe combined with the library in order to run.\n\f\n                  GNU LESSER GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License Agreement applies to any software library or other\nprogram which contains a notice placed by the copyright holder or\nother authorized party saying it may be distributed under the terms of\nthis Lesser General Public License (also called \"this License\").\nEach licensee is addressed as \"you\".\n\n  A \"library\" means a collection of software functions and/or data\nprepared so as to be conveniently linked with application programs\n(which use some of those functions and data) to form executables.\n\n  The \"Library\", below, refers to any such software library or work\nwhich has been distributed under these terms.  A \"work based on the\nLibrary\" means either the Library or any derivative work under\ncopyright law: that is to say, a work containing the Library or a\nportion of it, either verbatim or with modifications and/or translated\nstraightforwardly into another language.  (Hereinafter, translation is\nincluded without limitation in the term \"modification\".)\n\n  \"Source code\" for a work means the preferred form of the work for\nmaking modifications to it.  For a library, complete source code means\nall the source code for all modules it contains, plus any associated\ninterface definition files, plus the scripts used to control compilation\nand installation of the library.\n\n  Activities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning a program using the Library is not restricted, and output from\nsuch a program is covered only if its contents constitute a work based\non the Library (independent of the use of the Library in a tool for\nwriting it).  Whether that is true depends on what the Library does\nand what the program that uses the Library does.\n\n  1. You may copy and distribute verbatim copies of the Library's\ncomplete source code as you receive it, in any medium, provided that\nyou conspicuously and appropriately publish on each copy an\nappropriate copyright notice and disclaimer of warranty; keep intact\nall the notices that refer to this License and to the absence of any\nwarranty; and distribute a copy of this License along with the\nLibrary.\n\n  You may charge a fee for the physical act of transferring a copy,\nand you may at your option offer warranty protection in exchange for a\nfee.\n\f\n  2. You may modify your copy or copies of the Library or any portion\nof it, thus forming a work based on the Library, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) The modified work must itself be a software library.\n\n    b) You must cause the files modified to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    c) You must cause the whole of the work to be licensed at no\n    charge to all third parties under the terms of this License.\n\n    d) If a facility in the modified Library refers to a function or a\n    table of data to be supplied by an application program that uses\n    the facility, other than as an argument passed when the facility\n    is invoked, then you must make a good faith effort to ensure that,\n    in the event an application does not supply such function or\n    table, the facility still operates, and performs whatever part of\n    its purpose remains meaningful.\n\n    (For example, a function in a library to compute square roots has\n    a purpose that is entirely well-defined independent of the\n    application.  Therefore, Subsection 2d requires that any\n    application-supplied function or table used by this function must\n    be optional: if the application does not supply it, the square\n    root function must still compute square roots.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Library,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Library, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote\nit.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Library.\n\nIn addition, mere aggregation of another work not based on the Library\nwith the Library (or with a work based on the Library) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may opt to apply the terms of the ordinary GNU General Public\nLicense instead of this License to a given copy of the Library.  To do\nthis, you must alter all the notices that refer to this License, so\nthat they refer to the ordinary GNU General Public License, version 2,\ninstead of to this License.  (If a newer version than version 2 of the\nordinary GNU General Public License has appeared, then you can specify\nthat version instead if you wish.)  Do not make any other change in\nthese notices.\n\f\n  Once this change is made in a given copy, it is irreversible for\nthat copy, so the ordinary GNU General Public License applies to all\nsubsequent copies and derivative works made from that copy.\n\n  This option is useful when you wish to copy part of the code of\nthe Library into a program that is not a library.\n\n  4. You may copy and distribute the Library (or a portion or\nderivative of it, under Section 2) in object code or executable form\nunder the terms of Sections 1 and 2 above provided that you accompany\nit with the complete corresponding machine-readable source code, which\nmust be distributed under the terms of Sections 1 and 2 above on a\nmedium customarily used for software interchange.\n\n  If distribution of object code is made by offering access to copy\nfrom a designated place, then offering equivalent access to copy the\nsource code from the same place satisfies the requirement to\ndistribute the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  5. A program that contains no derivative of any portion of the\nLibrary, but is designed to work with the Library by being compiled or\nlinked with it, is called a \"work that uses the Library\".  Such a\nwork, in isolation, is not a derivative work of the Library, and\ntherefore falls outside the scope of this License.\n\n  However, linking a \"work that uses the Library\" with the Library\ncreates an executable that is a derivative of the Library (because it\ncontains portions of the Library), rather than a \"work that uses the\nlibrary\".  The executable is therefore covered by this License.\nSection 6 states terms for distribution of such executables.\n\n  When a \"work that uses the Library\" uses material from a header file\nthat is part of the Library, the object code for the work may be a\nderivative work of the Library even though the source code is not.\nWhether this is true is especially significant if the work can be\nlinked without the Library, or if the work is itself a library.  The\nthreshold for this to be true is not precisely defined by law.\n\n  If such an object file uses only numerical parameters, data\nstructure layouts and accessors, and small macros and small inline\nfunctions (ten lines or less in length), then the use of the object\nfile is unrestricted, regardless of whether it is legally a derivative\nwork.  (Executables containing this object code plus portions of the\nLibrary will still fall under Section 6.)\n\n  Otherwise, if the work is a derivative of the Library, you may\ndistribute the object code for the work under the terms of Section 6.\nAny executables containing that work also fall under Section 6,\nwhether or not they are linked directly with the Library itself.\n\f\n  6. As an exception to the Sections above, you may also combine or\nlink a \"work that uses the Library\" with the Library to produce a\nwork containing portions of the Library, and distribute that work\nunder terms of your choice, provided that the terms permit\nmodification of the work for the customer's own use and reverse\nengineering for debugging such modifications.\n\n  You must give prominent notice with each copy of the work that the\nLibrary is used in it and that the Library and its use are covered by\nthis License.  You must supply a copy of this License.  If the work\nduring execution displays copyright notices, you must include the\ncopyright notice for the Library among them, as well as a reference\ndirecting the user to the copy of this License.  Also, you must do one\nof these things:\n\n    a) Accompany the work with the complete corresponding\n    machine-readable source code for the Library including whatever\n    changes were used in the work (which must be distributed under\n    Sections 1 and 2 above); and, if the work is an executable linked\n    with the Library, with the complete machine-readable \"work that\n    uses the Library\", as object code and/or source code, so that the\n    user can modify the Library and then relink to produce a modified\n    executable containing the modified Library.  (It is understood\n    that the user who changes the contents of definitions files in the\n    Library will not necessarily be able to recompile the application\n    to use the modified definitions.)\n\n    b) Use a suitable shared library mechanism for linking with the\n    Library.  A suitable mechanism is one that (1) uses at run time a\n    copy of the library already present on the user's computer system,\n    rather than copying library functions into the executable, and (2)\n    will operate properly with a modified version of the library, if\n    the user installs one, as long as the modified version is\n    interface-compatible with the version that the work was made with.\n\n    c) Accompany the work with a written offer, valid for at\n    least three years, to give the same user the materials\n    specified in Subsection 6a, above, for a charge no more\n    than the cost of performing this distribution.\n\n    d) If distribution of the work is made by offering access to copy\n    from a designated place, offer equivalent access to copy the above\n    specified materials from the same place.\n\n    e) Verify that the user has already received a copy of these\n    materials or that you have already sent this user a copy.\n\n  For an executable, the required form of the \"work that uses the\nLibrary\" must include any data and utility programs needed for\nreproducing the executable from it.  However, as a special exception,\nthe materials to be distributed need not include anything that is\nnormally distributed (in either source or binary form) with the major\ncomponents (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, unless that component itself accompanies\nthe executable.\n\n  It may happen that this requirement contradicts the license\nrestrictions of other proprietary libraries that do not normally\naccompany the operating system.  Such a contradiction means you cannot\nuse both them and the Library together in an executable that you\ndistribute.\n\f\n  7. You may place library facilities that are a work based on the\nLibrary side-by-side in a single library together with other library\nfacilities not covered by this License, and distribute such a combined\nlibrary, provided that the separate distribution of the work based on\nthe Library and of the other library facilities is otherwise\npermitted, and provided that you do these two things:\n\n    a) Accompany the combined library with a copy of the same work\n    based on the Library, uncombined with any other library\n    facilities.  This must be distributed under the terms of the\n    Sections above.\n\n    b) Give prominent notice with the combined library of the fact\n    that part of it is a work based on the Library, and explaining\n    where to find the accompanying uncombined form of the same work.\n\n  8. You may not copy, modify, sublicense, link with, or distribute\nthe Library except as expressly provided under this License.  Any\nattempt otherwise to copy, modify, sublicense, link with, or\ndistribute the Library is void, and will automatically terminate your\nrights under this License.  However, parties who have received copies,\nor rights, from you under this License will not have their licenses\nterminated so long as such parties remain in full compliance.\n\n  9. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Library or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Library (or any work based on the\nLibrary), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Library or works based on it.\n\n  10. Each time you redistribute the Library (or any work based on the\nLibrary), the recipient automatically receives a license from the\noriginal licensor to copy, distribute, link with or modify the Library\nsubject to these terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties with\nthis License.\n\f\n  11. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Library at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Library by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Library.\n\nIf any portion of this section is held invalid or unenforceable under any\nparticular circumstance, the balance of the section is intended to apply,\nand the section as a whole is intended to apply in other circumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  12. If the distribution and/or use of the Library is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Library under this License may add\nan explicit geographical distribution limitation excluding those countries,\nso that distribution is permitted only in or among countries not thus\nexcluded.  In such case, this License incorporates the limitation as if\nwritten in the body of this License.\n\n  13. The Free Software Foundation may publish revised and/or new\nversions of the Lesser General Public License from time to time.\nSuch new versions will be similar in spirit to the present version,\nbut may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Library\nspecifies a version number of this License which applies to it and\n\"any later version\", you have the option of following the terms and\nconditions either of that version or of any later version published by\nthe Free Software Foundation.  If the Library does not specify a\nlicense version number, you may choose any version ever published by\nthe Free Software Foundation.\n\f\n  14. If you wish to incorporate parts of the Library into other free\nprograms whose distribution conditions are incompatible with these,\nwrite to the author to ask for permission.  For software which is\ncopyrighted by the Free Software Foundation, write to the Free\nSoftware Foundation; we sometimes make exceptions for this.  Our\ndecision will be guided by the two goals of preserving the free status\nof all derivatives of our free software and of promoting the sharing\nand reuse of software generally.\n\n                            NO WARRANTY\n\n  15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO\nWARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW.\nEXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR\nOTHER PARTIES PROVIDE THE LIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nLIBRARY IS WITH YOU.  SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME\nTHE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n  16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN\nWRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY\nAND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU\nFOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE\nLIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\nRENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A\nFAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF\nSUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\f\n           How to Apply These Terms to Your New Libraries\n\n  If you develop a new library, and you want it to be of the greatest\npossible use to the public, we recommend making it free software that\neveryone can redistribute and change.  You can do so by permitting\nredistribution under these terms (or, alternatively, under the terms of the\nordinary General Public License).\n\n  To apply these terms, attach the following notices to the library.  It is\nsafest to attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least the\n\"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the library's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This library is free software; you can redistribute it and/or\n    modify it under the terms of the GNU Lesser General Public\n    License as published by the Free Software Foundation; either\n    version 2.1 of the License, or (at your option) any later version.\n\n    This library is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n    Lesser General Public License for more details.\n\n    You should have received a copy of the GNU Lesser General Public\n    License along with this library; if not, write to the Free Software\n    Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301  USA\n\nAlso add information on how to contact you by electronic and paper mail.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the library, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the\n  library `Frob' (a library for tweaking knobs) written by James Random Hacker.\n\n  <signature of Ty Coon>, 1 April 1990\n  Ty Coon, President of Vice\n\nThat's all there is to it!\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to  ECMAScript Language\nSpecification ECMA-262 Edition 5.1 which may be included with \nJRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright notice\nCopyright ?? 2011 Ecma International\nEcma International\nRue du Rhone 114\nCH-1204 Geneva\nTel: +41 22 849 6000\nFax: +41 22 849 6001\nWeb: http://www.ecma-international.org\n\nThis document and possible translations of it may be copied and furnished to\nothers, and derivative works that comment on or otherwise explain it or assist\nin its implementation may be prepared, copied, published, and distributed, in\nwhole or in part, without restriction of any kind, provided that the above\ncopyright notice and this section are included on all such copies and derivative\nworks. However, this document itself may not be modified in any way, including\nby removing the copyright notice or references to Ecma International, except as\nneeded for the purpose of developing any document or deliverable produced by\nEcma International (in which case the rules applied to copyrights must be\nfollowed) or as required to translate it into languages other than English. The\nlimited permissions granted above are perpetual and will not be revoked by Ecma\nInternational or its successors or assigns. This document and the information\ncontained herein is provided on an \"AS IS\" basis and ECMA INTERNATIONAL\nDISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY\nWARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY OWNERSHIP\nRIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR\nPURPOSE.\" Software License\n\nAll Software contained in this document (\"Software)\" is protected by copyright\nand is being made available under the \"BSD License\", included below. This\nSoftware may be subject to third party rights (rights from parties other than\nEcma International), including patent rights, and no licenses under such third\nparty rights are granted under this license even if the third party concerned is\na member of Ecma International. SEE THE ECMA CODE OF CONDUCT IN PATENT MATTERS\nAVAILABLE AT http://www.ecma-international.org/memento/codeofconduct.htm FOR\nINFORMATION REGARDING THE LICENSING OF PATENT CLAIMS THAT ARE REQUIRED TO\nIMPLEMENT ECMA INTERNATIONAL STANDARDS*. Redistribution and use in source and\nbinary forms, with or without modification, are permitted provided that the\nfollowing conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\nlist of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\nthis list of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\n3. Neither the name of the authors nor Ecma International may be used to endorse\nor promote products derived from this software without specific prior written\npermission.\n\nTHIS SOFTWARE IS PROVIDED BY THE ECMA INTERNATIONAL \"AS IS\" AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\nSHALL ECMA INTERNATIONAL BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\nBUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGE.\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to freebXML Registry 3.0 & 3.1,\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nfreebxml:  Copyright (c) 2001 freebxml.org.  All rights reserved.\n\nThe names \"The freebXML Registry Project\" and \"freebxml Software\nFoundation\" must not be used to endorse or promote products derived\nfrom this software or be used in a product name without prior\nwritten permission. For written permission, please contact\nebxmlrr-team@lists.sourceforge.net.\n\nThis software consists of voluntary contributions made by many individuals\non behalf of the the freebxml Software Foundation. For more information on\nthe freebxml Software Foundation, please see <http://www.freebxml.org/>.\n\nThis product includes software developed by the Apache Software Foundation\n(http://www.apache.org/).\n\nThe freebxml License, Version 1.1 5\nCopyright (c) 2001 freebxml.org. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n 1. Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n 2. Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in\n    the documentation and/or other materials provided with the\n    distribution.\n\n 3. The end-user documentation included with the redistribution, if\n    any, must include the following acknowlegement:\n       \"This product includes software developed by\n        freebxml.org (http://www.freebxml.org/).\"\n    Alternately, this acknowlegement may appear in the software itself,\n    if and wherever such third-party acknowlegements normally appear.\n\n 4. The names \"The freebXML Registry Project\", \"freebxml Software\n    Foundation\" must not be used to endorse or promote products derived\n    from this software without prior written permission. For written\n    permission, please contact ebxmlrr-team@lists.sourceforge.net.\n\n 5. Products derived from this software may not be called \"freebxml\",\n    \"freebXML Registry\" nor may freebxml\" appear in their names without\n    prior written permission of the freebxml Group.\n\nTHIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED.  IN NO EVENT SHALL THE freebxml SOFTWARE FOUNDATION OR\nITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF\nUSE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\nOF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to IAIK PKCS#11 Wrapper, \nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nIAIK PKCS#11 Wrapper License\n\nCopyright (c) 2002 Graz University of Technology. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\n3. The end-user documentation included with the redistribution, if any, must\n   include the following acknowledgment:\n\n   \"This product includes software developed by IAIK of Graz University of\n    Technology.\"\n\n   Alternately, this acknowledgment may appear in the software itself, if and\n   wherever such third-party acknowledgments normally appear.\n\n4. The names \"Graz University of Technology\" and \"IAIK of Graz University of\n   Technology\" must not be used to endorse or promote products derived from this\n   software without prior written permission.\n\n5. Products derived from this software may not be called \"IAIK PKCS Wrapper\",\n   nor may \"IAIK\" appear in their name, without prior written permission of\n   Graz University of Technology.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESSED OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\nLICENSOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,\nOR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\nSUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to ICU4C 4.0.1 and ICU4J 4.4, which \nmay be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) 1995-2010 International Business Machines Corporation and others \n\nAll rights reserved. \n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, and/or sell copies of the\nSoftware, and to permit persons to whom the Software is furnished to do so,\nprovided that the above copyright notice(s) and this permission notice appear\nin all copies of the Software and that both the above copyright notice(s) and\nthis permission notice appear in supporting documentation.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN\nNO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE BE\nLIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY\nDAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN\nCONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not\nbe used in advertising or otherwise to promote the sale, use or other dealings\nin this Software without prior written authorization of the copyright holder.\nAll trademarks and registered trademarks mentioned herein are the property of\ntheir respective owners.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to IJG JPEG 6b, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nThis software is copyright (C) 1991-1998, Thomas G. Lane.\nAll Rights Reserved except as specified below.\n\nPermission is hereby granted to use, copy, modify, and distribute this\nsoftware (or portions thereof) for any purpose, without fee, subject to these\nconditions:\n(1) If any part of the source code for this software is distributed, then this\nREADME file must be included, with this copyright and no-warranty notice\nunaltered; and any additions, deletions, or changes to the original files\nmust be clearly indicated in accompanying documentation.\n(2) If only executable code is distributed, then the accompanying\ndocumentation must state that \"this software is based in part on the work of\nthe Independent JPEG Group\".\n(3) Permission for use of this software is granted only if the user accepts\nfull responsibility for any undesirable consequences; the authors accept\nNO LIABILITY for damages of any kind.\n\nThese conditions apply to any software derived from or based on the IJG code,\nnot just to the unmodified library.  If you use our work, you ought to\nacknowledge us.\n\nPermission is NOT granted for the use of any IJG author's name or company name\nin advertising or publicity relating to this software or products derived from\nit.  This software may be referred to only as \"the Independent JPEG Group's\nsoftware\".\n\nWe specifically permit and encourage the use of this software as the basis of\ncommercial products, provided that all warranty or liability claims are\nassumed by the product vendor.\n\n--- end of LICENSE ---\n\n--------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Jing 20030619, which may \nbe included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE  ---\n\nCopyright (c) 2001-2003 Thai Open Source Software Center Ltd All\nrights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\nRedistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright\nnotice, this list of conditions and the following disclaimer in the\ndocumentation and/or other materials provided with the distribution.\n\nNeither the name of the Thai Open Source Software Center Ltd nor\nthe names of its contributors may be used to endorse or promote\nproducts derived from this software without specific prior written\npermission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\nFOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\nREGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF\nUSE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\nOF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\n\n--- end of LICENSE  ---\n\n--------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Joni v2.1.16, which may be\nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) 2017 JRuby Team\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to JOpt-Simple v3.0,  which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\n Copyright (c) 2004-2009 Paul R. Holser, Jr.\n\n Permission is hereby granted, free of charge, to any person obtaining\n a copy of this software and associated documentation files (the\n \"Software\"), to deal in the Software without restriction, including\n without limitation the rights to use, copy, modify, merge, publish,\n distribute, sublicense, and/or sell copies of the Software, and to\n permit persons to whom the Software is furnished to do so, subject to\n the following conditions:\n\n The above copyright notice and this permission notice shall be\n included in all copies or substantial portions of the Software.\n\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE\n LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION\n OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION\n WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n--- end of LICENSE ---\n\n--------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Kerberos functionality, which \nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\n (C) Copyright IBM Corp. 1999 All Rights Reserved.\n Copyright 1997 The Open Group Research Institute. All rights reserved.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Kerberos functionality from \nFundsXpress, INC., which may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\n Copyright (C) 1998 by the FundsXpress, INC.\n\n All rights reserved.\n\n Export of this software from the United States of America may require\n a specific license from the United States Government.  It is the\n responsibility of any person or organization contemplating export to\n obtain such a license before exporting.\n\n WITHIN THAT CONSTRAINT, permission to use, copy, modify, and\n distribute this software and its documentation for any purpose and\n without fee is hereby granted, provided that the above copyright\n notice appear in all copies and that both that copyright notice and\n this permission notice appear in supporting documentation, and that\n the name of FundsXpress. not be used in advertising or publicity pertaining\n to distribution of the software without specific, written prior\n permission.  FundsXpress makes no representations about the suitability of\n this software for any purpose.  It is provided \"as is\" without express\n or implied warranty.\n\n THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR\n IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\n WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Kronos OpenGL headers, which may be \nincluded with JDK 8 and OpenJDK 8 source distributions.\n\n--- begin of LICENSE ---\n\n Copyright (c) 2007 The Khronos Group Inc.\n\n Permission is hereby granted, free of charge, to any person obtaining a copy\n of this software and/or associated documentation files (the \"Materials\"), to\n deal in the Materials without restriction, including without limitation the\n rights to use, copy, modify, merge, publish, distribute, sublicense, and/or\n sell copies of the Materials, and to permit persons to whom the Materials are\n furnished to do so, subject to the following conditions:\n\n The above copyright notice and this permission notice shall be included in all\n copies or substantial portions of the Materials.\n\n THE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\n AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n OUT OF OR IN CONNECTION WITH THE MATERIALS OR THE USE OR OTHER DEALINGS IN THE\n MATERIALS.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% Portions Copyright Eastman Kodak Company 1991-2003\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to libpng 1.6.39, which may be\nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCOPYRIGHT NOTICE, DISCLAIMER, and LICENSE\n=========================================\n\nPNG Reference Library License version 2\n---------------------------------------\n\nCopyright (c) 1995-2022 The PNG Reference Library Authors.\nCopyright (c) 2018-2022 Cosmin Truta\nCopyright (c) 1998-2018 Glenn Randers-Pehrson\nCopyright (c) 1996-1997 Andreas Dilger\nCopyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.\n\nThe software is supplied \"as is\", without warranty of any kind,\nexpress or implied, including, without limitation, the warranties\nof merchantability, fitness for a particular purpose, title, and\nnon-infringement.  In no event shall the Copyright owners, or\nanyone distributing the software, be liable for any damages or\nother liability, whether in contract, tort or otherwise, arising\nfrom, out of, or in connection with the software, or the use or\nother dealings in the software, even if advised of the possibility\nof such damage.\n\nPermission is hereby granted to use, copy, modify, and distribute\nthis software, or portions hereof, for any purpose, without fee,\nsubject to the following restrictions:\n\n 1. The origin of this software must not be misrepresented; you\n    must not claim that you wrote the original software.  If you\n    use this software in a product, an acknowledgment in the product\n    documentation would be appreciated, but is not required.\n\n 2. Altered source versions must be plainly marked as such, and must\n    not be misrepresented as being the original software.\n\n 3. This Copyright notice may not be removed or altered from any\n    source or altered source distribution.\n\n\nPNG Reference Library License version 1 (for libpng 0.5 through 1.6.35)\n-----------------------------------------------------------------------\n\nlibpng versions 1.0.7, July 1, 2000, through 1.6.35, July 15, 2018 are\nCopyright (c) 2000-2002, 2004, 2006-2018 Glenn Randers-Pehrson, are\nderived from libpng-1.0.6, and are distributed according to the same\ndisclaimer and license as libpng-1.0.6 with the following individuals\nadded to the list of Contributing Authors:\n\n    Simon-Pierre Cadieux\n    Eric S. Raymond\n    Mans Rullgard\n    Cosmin Truta\n    Gilles Vollant\n    James Yu\n    Mandar Sahastrabuddhe\n    Google Inc.\n    Vadim Barkov\n\nand with the following additions to the disclaimer:\n\n    There is no warranty against interference with your enjoyment of\n    the library or against infringement.  There is no warranty that our\n    efforts or the library will fulfill any of your particular purposes\n    or needs.  This library is provided with all faults, and the entire\n    risk of satisfactory quality, performance, accuracy, and effort is\n    with the user.\n\nSome files in the \"contrib\" directory and some configure-generated\nfiles that are distributed with libpng have other copyright owners, and\nare released under other open source licenses.\n\nlibpng versions 0.97, January 1998, through 1.0.6, March 20, 2000, are\nCopyright (c) 1998-2000 Glenn Randers-Pehrson, are derived from\nlibpng-0.96, and are distributed according to the same disclaimer and\nlicense as libpng-0.96, with the following individuals added to the\nlist of Contributing Authors:\n\n    Tom Lane\n    Glenn Randers-Pehrson\n    Willem van Schaik\n\nlibpng versions 0.89, June 1996, through 0.96, May 1997, are\nCopyright (c) 1996-1997 Andreas Dilger, are derived from libpng-0.88,\nand are distributed according to the same disclaimer and license as\nlibpng-0.88, with the following individuals added to the list of\nContributing Authors:\n\n    John Bowler\n    Kevin Bracey\n    Sam Bushell\n    Magnus Holmgren\n    Greg Roelofs\n    Tom Tanner\n\nSome files in the \"scripts\" directory have other copyright owners,\nbut are released under this license.\n\nlibpng versions 0.5, May 1995, through 0.88, January 1996, are\nCopyright (c) 1995-1996 Guy Eric Schalnat, Group 42, Inc.\n\nFor the purposes of this copyright and license, \"Contributing Authors\"\nis defined as the following set of individuals:\n\n    Andreas Dilger\n    Dave Martindale\n    Guy Eric Schalnat\n    Paul Schmidt\n    Tim Wegner\n\nThe PNG Reference Library is supplied \"AS IS\".  The Contributing\nAuthors and Group 42, Inc. disclaim all warranties, expressed or\nimplied, including, without limitation, the warranties of\nmerchantability and of fitness for any purpose.  The Contributing\nAuthors and Group 42, Inc. assume no liability for direct, indirect,\nincidental, special, exemplary, or consequential damages, which may\nresult from the use of the PNG Reference Library, even if advised of\nthe possibility of such damage.\n\nPermission is hereby granted to use, copy, modify, and distribute this\nsource code, or portions hereof, for any purpose, without fee, subject\nto the following restrictions:\n\n 1. The origin of this source code must not be misrepresented.\n\n 2. Altered versions must be plainly marked as such and must not\n    be misrepresented as being the original source.\n\n 3. This Copyright notice may not be removed or altered from any\n    source or altered source distribution.\n\nThe Contributing Authors and Group 42, Inc. specifically permit,\nwithout fee, and encourage the use of this source code as a component\nto supporting the PNG file format in commercial products.  If you use\nthis source code in a product, acknowledgment is not required but would\nbe appreciated.\n\nTRADEMARK:\n\nThe name \"libpng\" has not been registered by the Copyright owners\nas a trademark in any jurisdiction.  However, because libpng has\nbeen distributed and maintained world-wide, continually since 1995,\nthe Copyright owners claim \"common-law trademark protection\" in any\njurisdiction where common-law trademark is recognized.\n\nOSI CERTIFICATION:\n\nLibpng is OSI Certified Open Source Software.  OSI Certified Open Source is\na certification mark of the Open Source Initiative. OSI has not addressed\nthe additional disclaimers inserted at version 1.0.7.\n\nEXPORT CONTROL:\n\nThe Copyright owner believes that the Export Control Classification\nNumber (ECCN) for libpng is EAR99, which means not subject to export\ncontrols or International Traffic in Arms Regulations (ITAR) because\nit is open source, publicly available software, that does not contain\nany encryption software.  See the EAR, paragraphs 734.3(b)(3) and\n734.7(b).\n\nGlenn Randers-Pehrson\nglennrp at users.sourceforge.net\nJuly 15, 2018\n\nAUTHORS File Information:\n\nPNG REFERENCE LIBRARY AUTHORS\n=============================\n\nThis is the list of PNG Reference Library (\"libpng\") Contributing\nAuthors, for copyright and licensing purposes.\n\n * Andreas Dilger\n * Cosmin Truta\n * Dave Martindale\n * Eric S. Raymond\n * Gilles Vollant\n * Glenn Randers-Pehrson\n * Greg Roelofs\n * Guy Eric Schalnat\n * James Yu\n * John Bowler\n * Kevin Bracey\n * Magnus Holmgren\n * Mandar Sahastrabuddhe\n * Mans Rullgard\n * Matt Sarett\n * Mike Klein\n * Pascal Massimino\n * Paul Schmidt\n * Qiang Zhou\n * Sam Bushell\n * Samuel Williams\n * Simon-Pierre Cadieux\n * Tim Wegner\n * Tom Lane\n * Tom Tanner\n * Vadim Barkov\n * Willem van Schaik\n * Zhijie Liang\n * Arm Holdings\n   - Richard Townsend\n * Google Inc.\n   - Dan Field\n   - Leon Scroggins III\n   - Matt Sarett\n   - Mike Klein\n   - Sami Boukortt\n\nThe build projects, the build scripts, the test scripts, and other\nfiles in the \"ci\", \"projects\", \"scripts\" and \"tests\" directories, have\nother copyright owners, but are released under the libpng license.\n\nSome files in the \"contrib\" directory, and some tools-generated files\nthat are distributed with libpng, have other copyright owners, and are\nreleased under other open source licenses.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to GIFLIB 5.2.1 & libungif 4.1.3, \nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nThe GIFLIB distribution is Copyright (c) 1997  Eric S. Raymond\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Little CMS 2.11, which may be\nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nLittle CMS\nCopyright (c) 1998-2020 Marti Maria Saguer\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% Lucida is a registered trademark or trademark of Bigelow & Holmes in the\nU.S. and other countries.\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Mesa 3D Graphics Library v4.1,\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8 source distributions.\n\n--- begin of LICENSE ---\n\n Mesa 3-D Graphics Library v19.2.1\n\n Copyright (C) 1999-2007  Brian Paul   All Rights Reserved.\n\n Permission is hereby granted, free of charge, to any person obtaining a\n copy of this software and associated documentation files (the \"Software\"),\n to deal in the Software without restriction, including without limitation\n the rights to use, copy, modify, merge, publish, distribute, sublicense,\n and/or sell copies of the Software, and to permit persons to whom the\n Software is furnished to do so, subject to the following conditions:\n\n The above copyright notice and this permission notice shall be included\n in all copies or substantial portions of the Software.\n\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n SOFTWARE.\n\nAttention, Contributors\n\nWhen contributing to the Mesa project you must agree to the licensing terms\nof the component to which you're contributing.\nThe following section lists the primary components of the Mesa distribution\nand their respective licenses.\nMesa Component Licenses\n\n\n\nComponent         Location               License\n------------------------------------------------------------------\nMain Mesa code    src/mesa/              MIT\nDevice drivers    src/mesa/drivers/*     MIT, generally\n\nGallium code      src/gallium/           MIT\n\nExt headers       GL/glext.h             Khronos\n                  GL/glxext.h            Khronos\n                  GL/wglext.h            Khronos\n                  KHR/khrplatform.h      Khronos\n\n*****************************************************************************\n\n----\ninclude/GL/gl.h :\n\n\n Mesa 3-D graphics library\n\n Copyright (C) 1999-2006  Brian Paul   All Rights Reserved.\n Copyright (C) 2009  VMware, Inc.  All Rights Reserved.\n\n Permission is hereby granted, free of charge, to any person obtaining a\n copy of this software and associated documentation files (the \"Software\"),\n to deal in the Software without restriction, including without limitation\n the rights to use, copy, modify, merge, publish, distribute, sublicense,\n and/or sell copies of the Software, and to permit persons to whom the\n Software is furnished to do so, subject to the following conditions:\n\n The above copyright notice and this permission notice shall be included\n in all copies or substantial portions of the Software.\n\n THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL\n THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR\n OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\n ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\n OTHER DEALINGS IN THE SOFTWARE.\n \n *****************************************************************************\n\n----\ninclude/GL/glext.h\ninclude/GL/glxext.h\ninclude/GL/wglxext.h :\n\n\n Copyright (c) 2013 - 2018 The Khronos Group Inc.\n\n Permission is hereby granted, free of charge, to any person obtaining a\n copy of this software and/or associated documentation files (the\n \"Materials\"), to deal in the Materials without restriction, including\n without limitation the rights to use, copy, modify, merge, publish,\n distribute, sublicense, and/or sell copies of the Materials, and to\n permit persons to whom the Materials are furnished to do so, subject to\n the following conditions:\n\n The above copyright notice and this permission notice shall be included\n in all copies or substantial portions of the Materials.\n\n THE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\n CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\n TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\n MATERIALS OR THE USE OR OTHER DEALINGS IN THE MATERIALS.\n\n *****************************************************************************\n\n----\ninclude/KHR/khrplatform.h :\n\n Copyright (c) 2008 - 2018 The Khronos Group Inc.\n\n Permission is hereby granted, free of charge, to any person obtaining a\n copy of this software and/or associated documentation files (the\n \"Materials\"), to deal in the Materials without restriction, including\n without limitation the rights to use, copy, modify, merge, publish,\n distribute, sublicense, and/or sell copies of the Materials, and to\n permit persons to whom the Materials are furnished to do so, subject to\n the following conditions:\n\n The above copyright notice and this permission notice shall be included\n in all copies or substantial portions of the Materials.\n\n THE MATERIALS ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\n IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\n CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\n TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\n MATERIALS OR THE USE OR OTHER DEALINGS IN THE MATERIALS.\n\n *****************************************************************************\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Mozilla Network Security\nServices (NSS), which is supplied with the JDK test suite in the OpenJDK\nsource code repository. It is licensed under Mozilla Public License (MPL),\nversion 2.0.\n\nThe NSS libraries are supplied in executable form, built from unmodified\nNSS source code labeled with the \"NSS_3_16_RTM\" HG tag.\n\nThe NSS source code is available in the OpenJDK source code repository at:\n    jdk/test/sun/security/pkcs11/nss/src\n\nThe NSS libraries are available in the OpenJDK source code repository at:\n    jdk/test/sun/security/pkcs11/nss/lib\n\n--- begin of LICENSE ---\n\nMozilla Public License Version 2.0\n==================================\n\n1. Definitions\n--------------\n\n1.1. \"Contributor\"\n    means each individual or legal entity that creates, contributes to\n    the creation of, or owns Covered Software.\n\n1.2. \"Contributor Version\"\n    means the combination of the Contributions of others (if any) used\n    by a Contributor and that particular Contributor's Contribution.\n\n1.3. \"Contribution\"\n    means Covered Software of a particular Contributor.\n\n1.4. \"Covered Software\"\n    means Source Code Form to which the initial Contributor has attached\n    the notice in Exhibit A, the Executable Form of such Source Code\n    Form, and Modifications of such Source Code Form, in each case\n    including portions thereof.\n\n1.5. \"Incompatible With Secondary Licenses\"\n    means\n\n    (a) that the initial Contributor has attached the notice described\n        in Exhibit B to the Covered Software; or\n\n    (b) that the Covered Software was made available under the terms of\n        version 1.1 or earlier of the License, but not also under the\n        terms of a Secondary License.\n\n1.6. \"Executable Form\"\n    means any form of the work other than Source Code Form.\n\n1.7. \"Larger Work\"\n    means a work that combines Covered Software with other material, in \n    a separate file or files, that is not Covered Software.\n\n1.8. \"License\"\n    means this document.\n\n1.9. \"Licensable\"\n    means having the right to grant, to the maximum extent possible,\n    whether at the time of the initial grant or subsequently, any and\n    all of the rights conveyed by this License.\n\n1.10. \"Modifications\"\n    means any of the following:\n\n    (a) any file in Source Code Form that results from an addition to,\n        deletion from, or modification of the contents of Covered\n        Software; or\n\n    (b) any new file in Source Code Form that contains any Covered\n        Software.\n\n1.11. \"Patent Claims\" of a Contributor\n    means any patent claim(s), including without limitation, method,\n    process, and apparatus claims, in any patent Licensable by such\n    Contributor that would be infringed, but for the grant of the\n    License, by the making, using, selling, offering for sale, having\n    made, import, or transfer of either its Contributions or its\n    Contributor Version.\n\n1.12. \"Secondary License\"\n    means either the GNU General Public License, Version 2.0, the GNU\n    Lesser General Public License, Version 2.1, the GNU Affero General\n    Public License, Version 3.0, or any later versions of those\n    licenses.\n\n1.13. \"Source Code Form\"\n    means the form of the work preferred for making modifications.\n\n1.14. \"You\" (or \"Your\")\n    means an individual or a legal entity exercising rights under this\n    License. For legal entities, \"You\" includes any entity that\n    controls, is controlled by, or is under common control with You. For\n    purposes of this definition, \"control\" means (a) the power, direct\n    or indirect, to cause the direction or management of such entity,\n    whether by contract or otherwise, or (b) ownership of more than\n    fifty percent (50%) of the outstanding shares or beneficial\n    ownership of such entity.\n\n2. License Grants and Conditions\n--------------------------------\n\n2.1. Grants\n\nEach Contributor hereby grants You a world-wide, royalty-free,\nnon-exclusive license:\n\n(a) under intellectual property rights (other than patent or trademark)\n    Licensable by such Contributor to use, reproduce, make available,\n    modify, display, perform, distribute, and otherwise exploit its\n    Contributions, either on an unmodified basis, with Modifications, or\n    as part of a Larger Work; and\n\n(b) under Patent Claims of such Contributor to make, use, sell, offer\n    for sale, have made, import, and otherwise transfer either its\n    Contributions or its Contributor Version.\n\n2.2. Effective Date\n\nThe licenses granted in Section 2.1 with respect to any Contribution\nbecome effective for each Contribution on the date the Contributor first\ndistributes such Contribution.\n\n2.3. Limitations on Grant Scope\n\nThe licenses granted in this Section 2 are the only rights granted under\nthis License. No additional rights or licenses will be implied from the\ndistribution or licensing of Covered Software under this License.\nNotwithstanding Section 2.1(b) above, no patent license is granted by a\nContributor:\n\n(a) for any code that a Contributor has removed from Covered Software;\n    or\n\n(b) for infringements caused by: (i) Your and any other third party's\n    modifications of Covered Software, or (ii) the combination of its\n    Contributions with other software (except as part of its Contributor\n    Version); or\n\n(c) under Patent Claims infringed by Covered Software in the absence of\n    its Contributions.\n\nThis License does not grant any rights in the trademarks, service marks,\nor logos of any Contributor (except as may be necessary to comply with\nthe notice requirements in Section 3.4).\n\n2.4. Subsequent Licenses\n\nNo Contributor makes additional grants as a result of Your choice to\ndistribute the Covered Software under a subsequent version of this\nLicense (see Section 10.2) or under the terms of a Secondary License (if\npermitted under the terms of Section 3.3).\n\n2.5. Representation\n\nEach Contributor represents that the Contributor believes its\nContributions are its original creation(s) or it has sufficient rights\nto grant the rights to its Contributions conveyed by this License.\n\n2.6. Fair Use\n\nThis License is not intended to limit any rights You have under\napplicable copyright doctrines of fair use, fair dealing, or other\nequivalents.\n\n2.7. Conditions\n\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted\nin Section 2.1.\n\n3. Responsibilities\n-------------------\n\n3.1. Distribution of Source Form\n\nAll distribution of Covered Software in Source Code Form, including any\nModifications that You create or to which You contribute, must be under\nthe terms of this License. You must inform recipients that the Source\nCode Form of the Covered Software is governed by the terms of this\nLicense, and how they can obtain a copy of this License. You may not\nattempt to alter or restrict the recipients' rights in the Source Code\nForm.\n\n3.2. Distribution of Executable Form\n\nIf You distribute Covered Software in Executable Form then:\n\n(a) such Covered Software must also be made available in Source Code\n    Form, as described in Section 3.1, and You must inform recipients of\n    the Executable Form how they can obtain a copy of such Source Code\n    Form by reasonable means in a timely manner, at a charge no more\n    than the cost of distribution to the recipient; and\n\n(b) You may distribute such Executable Form under the terms of this\n    License, or sublicense it under different terms, provided that the\n    license for the Executable Form does not attempt to limit or alter\n    the recipients' rights in the Source Code Form under this License.\n\n3.3. Distribution of a Larger Work\n\nYou may create and distribute a Larger Work under terms of Your choice,\nprovided that You also comply with the requirements of this License for\nthe Covered Software. If the Larger Work is a combination of Covered\nSoftware with a work governed by one or more Secondary Licenses, and the\nCovered Software is not Incompatible With Secondary Licenses, this\nLicense permits You to additionally distribute such Covered Software\nunder the terms of such Secondary License(s), so that the recipient of\nthe Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary\nLicense(s).\n\n3.4. Notices\n\nYou may not remove or alter the substance of any license notices\n(including copyright notices, patent notices, disclaimers of warranty,\nor limitations of liability) contained within the Source Code Form of\nthe Covered Software, except that You may alter any license notices to\nthe extent required to remedy known factual inaccuracies.\n\n3.5. Application of Additional Terms\n\nYou may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered\nSoftware. However, You may do so only on Your own behalf, and not on\nbehalf of any Contributor. You must make it absolutely clear that any\nsuch warranty, support, indemnity, or liability obligation is offered by\nYou alone, and You hereby agree to indemnify every Contributor for any\nliability incurred by such Contributor as a result of warranty, support,\nindemnity or liability terms You offer. You may include additional\ndisclaimers of warranty and limitations of liability specific to any\njurisdiction.\n\n4. Inability to Comply Due to Statute or Regulation\n---------------------------------------------------\n\nIf it is impossible for You to comply with any of the terms of this\nLicense with respect to some or all of the Covered Software due to\nstatute, judicial order, or regulation then You must: (a) comply with\nthe terms of this License to the maximum extent possible; and (b)\ndescribe the limitations and the code they affect. Such description must\nbe placed in a text file included with all distributions of the Covered\nSoftware under this License. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a\nrecipient of ordinary skill to be able to understand it.\n\n5. Termination\n--------------\n\n5.1. The rights granted under this License will terminate automatically\nif You fail to comply with any of its terms. However, if You become\ncompliant, then the rights granted under this License from a particular\nContributor are reinstated (a) provisionally, unless and until such\nContributor explicitly and finally terminates Your grants, and (b) on an\nongoing basis, if such Contributor fails to notify You of the\nnon-compliance by some reasonable means prior to 60 days after You have\ncome back into compliance. Moreover, Your grants from a particular\nContributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the\nfirst time You have received notice of non-compliance with this License\nfrom such Contributor, and You become compliant prior to 30 days after\nYour receipt of the notice.\n\n5.2. If You initiate litigation against any entity by asserting a patent\ninfringement claim (excluding declaratory judgment actions,\ncounter-claims, and cross-claims) alleging that a Contributor Version\ndirectly or indirectly infringes any patent, then the rights granted to\nYou by any and all Contributors for the Covered Software under Section\n2.1 of this License shall terminate.\n\n5.3. In the event of termination under Sections 5.1 or 5.2 above, all\nend user license agreements (excluding distributors and resellers) which\nhave been validly granted by You or Your distributors under this License\nprior to termination shall survive termination.\n\n************************************************************************\n*                                                                      *\n*  6. Disclaimer of Warranty                                           *\n*  -------------------------                                           *\n*                                                                      *\n*  Covered Software is provided under this License on an \"as is\"       *\n*  basis, without warranty of any kind, either expressed, implied, or  *\n*  statutory, including, without limitation, warranties that the       *\n*  Covered Software is free of defects, merchantable, fit for a        *\n*  particular purpose or non-infringing. The entire risk as to the     *\n*  quality and performance of the Covered Software is with You.        *\n*  Should any Covered Software prove defective in any respect, You     *\n*  (not any Contributor) assume the cost of any necessary servicing,   *\n*  repair, or correction. This disclaimer of warranty constitutes an   *\n*  essential part of this License. No use of any Covered Software is   *\n*  authorized under this License except under this disclaimer.         *\n*                                                                      *\n************************************************************************\n\n************************************************************************\n*                                                                      *\n*  7. Limitation of Liability                                          *\n*  --------------------------                                          *\n*                                                                      *\n*  Under no circumstances and under no legal theory, whether tort      *\n*  (including negligence), contract, or otherwise, shall any           *\n*  Contributor, or anyone who distributes Covered Software as          *\n*  permitted above, be liable to You for any direct, indirect,         *\n*  special, incidental, or consequential damages of any character      *\n*  including, without limitation, damages for lost profits, loss of    *\n*  goodwill, work stoppage, computer failure or malfunction, or any    *\n*  and all other commercial damages or losses, even if such party      *\n*  shall have been informed of the possibility of such damages. This   *\n*  limitation of liability shall not apply to liability for death or   *\n*  personal injury resulting from such party's negligence to the       *\n*  extent applicable law prohibits such limitation. Some               *\n*  jurisdictions do not allow the exclusion or limitation of           *\n*  incidental or consequential damages, so this exclusion and          *\n*  limitation may not apply to You.                                    *\n*                                                                      *\n************************************************************************\n\n8. Litigation\n-------------\n\nAny litigation relating to this License may be brought only in the\ncourts of a jurisdiction where the defendant maintains its principal\nplace of business and such litigation shall be governed by laws of that\njurisdiction, without reference to its conflict-of-law provisions.\nNothing in this Section shall prevent a party's ability to bring\ncross-claims or counter-claims.\n\n9. Miscellaneous\n----------------\n\nThis License represents the complete agreement concerning the subject\nmatter hereof. If any provision of this License is held to be\nunenforceable, such provision shall be reformed only to the extent\nnecessary to make it enforceable. Any law or regulation which provides\nthat the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n\n10. Versions of the License\n---------------------------\n\n10.1. New Versions\n\nMozilla Foundation is the license steward. Except as provided in Section\n10.3, no one other than the license steward has the right to modify or\npublish new versions of this License. Each version will be given a\ndistinguishing version number.\n\n10.2. Effect of New Versions\n\nYou may distribute the Covered Software under the terms of the version\nof the License under which You originally received the Covered Software,\nor under the terms of any subsequent version published by the license\nsteward.\n\n10.3. Modified Versions\n\nIf you create software not governed by this License, and you want to\ncreate a new license for such software, you may create and use a\nmodified version of this License if you rename the license and remove\nany references to the name of the license steward (except to note that\nsuch modified license differs from this License).\n\n10.4. Distributing Source Code Form that is Incompatible With Secondary\nLicenses\n\nIf You choose to distribute Source Code Form that is Incompatible With\nSecondary Licenses under the terms of this version of the License, the\nnotice described in Exhibit B of this License must be attached.\n\nExhibit A - Source Code Form License Notice\n-------------------------------------------\n\n  This Source Code Form is subject to the terms of the Mozilla Public\n  License, v. 2.0. If a copy of the MPL was not distributed with this\n  file, You can obtain one at http://mozilla.org/MPL/2.0/.\n\nIf it is not possible or desirable to put the notice in a particular\nfile, then You may include the notice in a location (such as a LICENSE\nfile in a relevant directory) where a recipient would be likely to look\nfor such a notice.\n\nYou may add additional accurate notices of copyright ownership.\n\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\n---------------------------------------------------------\n\n  This Source Code Form is \"Incompatible With Secondary Licenses\", as\n  defined by the Mozilla Public License, v. 2.0.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to PC/SC Lite v1.8.26,\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8 on Linux and Solaris.\n\n--- begin of LICENSE ---\n\nCopyright (c) 1999-2003 David Corcoran <corcoran@linuxnet.com>\nCopyright (c) 2001-2011 Ludovic Rousseau <ludovic.rousseau@free.fr>\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the distribution.\n3. The name of the author may not be used to endorse or promote products\n   derived from this software without specific prior written permission.\n\nChanges to this license can be made only by the copyright author with\nexplicit written consent.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nOF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\nIN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\nNOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to PorterStemmer v4, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nSee: http://tartarus.org/~martin/PorterStemmer\n\nThe software is completely free for any purpose, unless notes at the head of\nthe program text indicates otherwise (which is rare). In any case, the notes\nabout licensing are never more restrictive than the BSD License.\n\nIn every case where the software is not written by me (Martin Porter), this\nlicensing arrangement has been endorsed by the contributor, and it is\ntherefore unnecessary to ask the contributor again to confirm it.\n\nI have not asked any contributors (or their employers, if they have them) for\nproofs that they have the right to distribute their software in this way.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Relax NG Object/Parser v.20050510,\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) Kohsuke Kawaguchi\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions: The above copyright\nnotice and this permission notice shall be included in all copies or\nsubstantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to RelaxNGCC v1.12, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (c) 2000-2003 Daisuke Okajima and Kohsuke Kawaguchi.  \nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\n3. The end-user documentation included with the redistribution, if any, must\n   include the following acknowledgment:\n\n    \"This product includes software developed by Daisuke Okajima\n    and Kohsuke Kawaguchi (http://relaxngcc.sf.net/).\"\n\nAlternately, this acknowledgment may appear in the software itself, if and\nwherever such third-party acknowledgments normally appear.\n\n4. The names of the copyright holders must not be used to endorse or promote\n   products derived from this software without prior written permission. For\n   written permission, please contact the copyright holders.\n\n5. Products derived from this software may not be called \"RELAXNGCC\", nor may\n  \"RELAXNGCC\" appear in their name, without prior written permission of the\n  copyright holders.\n\nTHIS SOFTWARE IS PROVIDED \"AS IS\" AND ANY EXPRESSED OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.IN NO EVENT SHALL THE APACHE\nSOFTWARE FOUNDATION OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,\nEVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Relax NG Datatype 1.0, which \nmay be included with JRE 8, JDK 8, and OpenJDK 8.  \n\n--- begin of LICENSE  ---\n\nCopyright (c) 2005, 2010 Thai Open Source Software Center Ltd\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n    Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n    Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in\n    the documentation and/or other materials provided with the\n    distribution.\n\n    Neither the names of the copyright holders nor the names of its\n    contributors may be used to endorse or promote products derived\n    from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE REGENTS OR\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\nPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n--- end of LICENSE  ---\n\n--------------------------------------------------------------------------------\n\n%% This notice is provided with respect to SoftFloat version 2b, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8 on Linux/ARM.\n\n--- begin of LICENSE ---\n\nUse of any of this software is governed by the terms of the license below:\n\nSoftFloat was written by me, John R. Hauser. This work was made possible in \npart by the International Computer Science Institute, located at Suite 600, \n1947 Center Street, Berkeley, California 94704. Funding was partially \nprovided by the National Science Foundation under grant MIP-9311980. The \noriginal version of this code was written as part of a project to build \na fixed-point vector processor in collaboration with the University of \nCalifornia at Berkeley, overseen by Profs. Nelson Morgan and John Wawrzynek. \n\nTHIS SOFTWARE IS DISTRIBUTED AS IS, FOR FREE. Although reasonable effort \nhas been made to avoid it, THIS SOFTWARE MAY CONTAIN FAULTS THAT WILL AT \nTIMES RESULT IN INCORRECT BEHAVIOR. USE OF THIS SOFTWARE IS RESTRICTED TO \nPERSONS AND ORGANIZATIONS WHO CAN AND WILL TAKE FULL RESPONSIBILITY FOR ALL \nLOSSES, COSTS, OR OTHER PROBLEMS THEY INCUR DUE TO THE SOFTWARE, AND WHO \nFURTHERMORE EFFECTIVELY INDEMNIFY JOHN HAUSER AND THE INTERNATIONAL COMPUTER \nSCIENCE INSTITUTE (possibly via similar legal warning) AGAINST ALL LOSSES, \nCOSTS, OR OTHER PROBLEMS INCURRED BY THEIR CUSTOMERS AND CLIENTS DUE TO THE \nSOFTWARE. \n\nDerivative works are acceptable, even for commercial purposes, provided \nthat the minimal documentation requirements stated in the source code are \nsatisfied. \n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Sparkle 1.5,\nwhich may be included with JRE 8 on Mac OS X.\n\n--- begin of LICENSE ---\n\nCopyright (c) 2012 Sparkle.org and Andy Matuschak\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% Portions licensed from Taligent, Inc.\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Thai Dictionary, which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright (C) 1982 The Royal Institute, Thai Royal Government.\n\nCopyright (C) 1998 National Electronics and Computer Technology Center,\nNational Science and Technology Development Agency,\nMinistry of Science Technology and Environment,\nThai Royal Government.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Unicode 6.2.0 & CLDR 21.0.1\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nUnicode Terms of Use\n\nFor the general privacy policy governing access to this site, see the Unicode\nPrivacy Policy. For trademark usage, see the Unicode?? Consortium Name and\nTrademark Usage Policy.\n\nA. Unicode Copyright.\n   1. Copyright ?? 1991-2013 Unicode, Inc. All rights reserved.\n\n   2. Certain documents and files on this website contain a legend indicating\n      that \"Modification is permitted.\" Any person is hereby authorized,\n      without fee, to modify such documents and files to create derivative\n      works conforming to the Unicode?? Standard, subject to Terms and\n      Conditions herein.\n\n    3. Any person is hereby authorized, without fee, to view, use, reproduce,\n       and distribute all documents and files solely for informational\n       purposes in the creation of products supporting the Unicode Standard,\n       subject to the Terms and Conditions herein.\n\n    4. Further specifications of rights and restrictions pertaining to the use\n       of the particular set of data files known as the \"Unicode Character\n       Database\" can be found in Exhibit 1.\n\n    5. Each version of the Unicode Standard has further specifications of\n       rights and restrictions of use. For the book editions (Unicode 5.0 and\n       earlier), these are found on the back of the title page. The online\n       code charts carry specific restrictions. All other files, including\n       online documentation of the core specification for Unicode 6.0 and\n       later, are covered under these general Terms of Use.\n\n    6. No license is granted to \"mirror\" the Unicode website where a fee is\n       charged for access to the \"mirror\" site.\n\n    7. Modification is not permitted with respect to this document. All copies\n       of this document must be verbatim.\n\nB. Restricted Rights Legend. Any technical data or software which is licensed\n   to the United States of America, its agencies and/or instrumentalities\n   under this Agreement is commercial technical data or commercial computer\n   software developed exclusively at private expense as defined in FAR 2.101,\n   or DFARS 252.227-7014 (June 1995), as applicable. For technical data, use,\n   duplication, or disclosure by the Government is subject to restrictions as\n   set forth in DFARS 202.227-7015 Technical Data, Commercial and Items (Nov\n   1995) and this Agreement. For Software, in accordance with FAR 12-212 or\n   DFARS 227-7202, as applicable, use, duplication or disclosure by the\n   Government is subject to the restrictions set forth in this Agreement.\n\nC. Warranties and Disclaimers.\n   1. This publication and/or website may include technical or typographical\n      errors or other inaccuracies . Changes are periodically added to the\n      information herein; these changes will be incorporated in new editions\n      of the publication and/or website. Unicode may make improvements and/or\n      changes in the product(s) and/or program(s) described in this\n      publication and/or website at any time.\n\n    2. If this file has been purchased on magnetic or optical media from\n       Unicode, Inc. the sole and exclusive remedy for any claim will be\n       exchange of the defective media within ninety (90) days of original\n       purchase.\n\n    3. EXCEPT AS PROVIDED IN SECTION C.2, THIS PUBLICATION AND/OR SOFTWARE IS\n       PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND EITHER EXPRESS, IMPLIED,\n       OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF\n       MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.\n       UNICODE AND ITS LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR\n       OMISSIONS IN THIS PUBLICATION AND/OR SOFTWARE OR OTHER DOCUMENTS WHICH\n       ARE REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE UNICODE WEBSITE.\n\nD. Waiver of Damages. In no event shall Unicode or its licensors be liable for\n   any special, incidental, indirect or consequential damages of any kind, or\n   any damages whatsoever, whether or not Unicode was advised of the\n   possibility of the damage, including, without limitation, those resulting\n   from the following: loss of use, data or profits, in connection with the\n   use, modification or distribution of this information or its derivatives.\n\nE.Trademarks & Logos.\n   1. The Unicode Word Mark and the Unicode Logo are trademarks of Unicode,\n      Inc.  ???The Unicode Consortium??? and ???Unicode, Inc.??? are trade names of\n      Unicode, Inc.  Use of the information and materials found on this\n      website indicates your acknowledgement of Unicode, Inc.???s exclusive\n      worldwide rights in the Unicode Word Mark, the Unicode Logo, and the\n      Unicode trade names.\n\n   2. The Unicode Consortium Name and Trademark Usage Policy (???Trademark\n      Policy???) are incorporated herein by reference and you agree to abide by\n      the provisions of the Trademark Policy, which may be changed from time\n      to time in the sole discretion of Unicode, Inc.\n\n   3. All third party trademarks referenced herein are the property of their\n      respective owners.\n\nMiscellaneous.\n   1. Jurisdiction and Venue. This server is operated from a location in the\n      State of California, United States of America. Unicode makes no\n      representation that the materials are appropriate for use in other\n      locations. If you access this server from other locations, you are\n      responsible for compliance with local laws. This Agreement, all use of\n      this site and any claims and damages resulting from use of this site are\n      governed solely by the laws of the State of California without regard to\n      any principles which would apply the laws of a different jurisdiction.\n      The user agrees that any disputes regarding this site shall be resolved\n      solely in the courts located in Santa Clara County, California. The user\n      agrees said courts have personal jurisdiction and agree to waive any\n      right to transfer the dispute to any other forum.\n\n   2. Modification by Unicode.  Unicode shall have the right to modify this\n      Agreement at any time by posting it to this site. The user may not\n      assign any part of this Agreement without Unicode???s prior written\n      consent.\n\n   3. Taxes. The user agrees to pay any taxes arising from access to this\n      website or use of the information herein, except for those based on\n      Unicode???s net income.\n\n   4. Severability.  If any provision of this Agreement is declared invalid or\n      unenforceable, the remaining provisions of this Agreement shall remain\n      in effect.\n\n   5. Entire Agreement. This Agreement constitutes the entire agreement\n      between the parties.\n\nEXHIBIT 1\nUNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n\nUnicode Data Files include all data files under the directories\nhttp://www.unicode.org/Public/, http://www.unicode.org/reports/, and\nhttp://www.unicode.org/cldr/data/. Unicode Data Files do not include PDF\nonline code charts under the directory http://www.unicode.org/Public/.\nSoftware includes any source code published in the Unicode Standard or under\nthe directories http://www.unicode.org/Public/,\nhttp://www.unicode.org/reports/, and http://www.unicode.org/cldr/data/.\n\nNOTICE TO USER: Carefully read the following legal agreement. BY DOWNLOADING,\nINSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S DATA FILES (\"DATA\nFILES\"), AND/OR SOFTWARE (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO\nBE BOUND BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT\nAGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR\nSOFTWARE.\n\nCOPYRIGHT AND PERMISSION NOTICE\n\nCopyright ?? 1991-2012 Unicode, Inc. All rights reserved. Distributed under the\nTerms of Use in http://www.unicode.org/copyright.html.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof the Unicode data files and any associated documentation (the \"Data Files\")\nor Unicode software and any associated documentation (the \"Software\") to deal\nin the Data Files or Software without restriction, including without\nlimitation the rights to use, copy, modify, merge, publish, distribute, and/or\nsell copies of the Data Files or Software, and to permit persons to whom the\nData Files or Software are furnished to do so, provided that (a) the above\ncopyright notice(s) and this permission notice appear with all copies of the\nData Files or Software, (b) both the above copyright notice(s) and this\npermission notice appear in associated documentation, and (c) there is clear\nnotice in each modified Data File or in the Software as well as in the\ndocumentation associated with the Data File(s) or Software that the data or\nsoftware has been modified.\n\nTHE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\nKIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD\nPARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN\nTHIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\nDAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR\nPROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS\nACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE\nDATA FILES OR SOFTWARE.\n\nExcept as contained in this notice, the name of a copyright holder shall not\nbe used in advertising or otherwise to promote the sale, use or other dealings\nin these Data Files or Software without prior written authorization of the\ncopyright holder.\n\nUnicode and the Unicode logo are trademarks of Unicode, Inc. in the United\nStates and other countries. All third party trademarks referenced herein are\nthe property of their respective owners.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to UPX v3.01, which may be included \nwith JRE 8 on Windows.\n\n--- begin of LICENSE ---\n\nUse of any of this software is governed by the terms of the license below:\n\n\n                 ooooo     ooo ooooooooo.   ooooooo  ooooo\n                 `888'     `8' `888   `Y88.  `8888    d8'\n                  888       8   888   .d88'    Y888..8P\n                  888       8   888ooo88P'      `8888'\n                  888       8   888            .8PY888.\n                  `88.    .8'   888           d8'  `888b\n                    `YbodP'    o888o        o888o  o88888o\n\n\n                    The Ultimate Packer for eXecutables\n          Copyright (c) 1996-2000 Markus Oberhumer & Laszlo Molnar\n               http://wildsau.idv.uni-linz.ac.at/mfx/upx.html\n                          http://www.nexus.hu/upx\n                            http://upx.tsx.org\n\n\nPLEASE CAREFULLY READ THIS LICENSE AGREEMENT, ESPECIALLY IF YOU PLAN\nTO MODIFY THE UPX SOURCE CODE OR USE A MODIFIED UPX VERSION.\n\n\nABSTRACT\n========\n\n   UPX and UCL are copyrighted software distributed under the terms\n   of the GNU General Public License (hereinafter the \"GPL\").\n\n   The stub which is imbedded in each UPX compressed program is part\n   of UPX and UCL, and contains code that is under our copyright. The\n   terms of the GNU General Public License still apply as compressing\n   a program is a special form of linking with our stub.\n\n   As a special exception we grant the free usage of UPX for all\n   executables, including commercial programs.\n   See below for details and restrictions.\n\n\nCOPYRIGHT\n=========\n\n   UPX and UCL are copyrighted software. All rights remain with the authors.\n\n   UPX is Copyright (C) 1996-2000 Markus Franz Xaver Johannes Oberhumer\n   UPX is Copyright (C) 1996-2000 Laszlo Molnar\n\n   UCL is Copyright (C) 1996-2000 Markus Franz Xaver Johannes Oberhumer\n\n\nGNU GENERAL PUBLIC LICENSE\n==========================\n\n   UPX and the UCL library are free software; you can redistribute them\n   and/or modify them under the terms of the GNU General Public License as\n   published by the Free Software Foundation; either version 2 of\n   the License, or (at your option) any later version.\n\n   UPX and UCL are distributed in the hope that they will be useful,\n   but WITHOUT ANY WARRANTY; without even the implied warranty of\n   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n   GNU General Public License for more details.\n\n   You should have received a copy of the GNU General Public License\n   along with this program; see the file COPYING.\n\n\nSPECIAL EXCEPTION FOR COMPRESSED EXECUTABLES\n============================================\n\n   The stub which is imbedded in each UPX compressed program is part\n   of UPX and UCL, and contains code that is under our copyright. The\n   terms of the GNU General Public License still apply as compressing\n   a program is a special form of linking with our stub.\n\n   Hereby Markus F.X.J. Oberhumer and Laszlo Molnar grant you special\n   permission to freely use and distribute all UPX compressed programs\n   (including commercial ones), subject to the following restrictions:\n\n   1. You must compress your program with a completely unmodified UPX\n      version; either with our precompiled version, or (at your option)\n      with a self compiled version of the unmodified UPX sources as\n      distributed by us.\n   2. This also implies that the UPX stub must be completely unmodfied, i.e.\n      the stub imbedded in your compressed program must be byte-identical\n      to the stub that is produced by the official unmodified UPX version.\n   3. The decompressor and any other code from the stub must exclusively get\n      used by the unmodified UPX stub for decompressing your program at\n      program startup. No portion of the stub may get read, copied,\n      called or otherwise get used or accessed by your program.\n\n\nANNOTATIONS\n===========\n\n  - You can use a modified UPX version or modified UPX stub only for\n    programs that are compatible with the GNU General Public License.\n\n  - We grant you special permission to freely use and distribute all UPX\n    compressed programs. But any modification of the UPX stub (such as,\n    but not limited to, removing our copyright string or making your\n    program non-decompressible) will immediately revoke your right to\n    use and distribute a UPX compressed program.\n\n  - UPX is not a software protection tool; by requiring that you use\n    the unmodified UPX version for your proprietary programs we\n    make sure that any user can decompress your program. This protects\n    both you and your users as nobody can hide malicious code -\n    any program that cannot be decompressed is highly suspicious\n    by definition.\n\n  - You can integrate all or part of UPX and UCL into projects that\n    are compatible with the GNU GPL, but obviously you cannot grant\n    any special exceptions beyond the GPL for our code in your project.\n\n  - We want to actively support manufacturers of virus scanners and\n    similar security software. Please contact us if you would like to\n    incorporate parts of UPX or UCL into such a product.\n\n\n\nMarkus F.X.J. Oberhumer                   Laszlo Molnar\nmarkus.oberhumer@jk.uni-linz.ac.at        ml1050@cdata.tvnet.hu\n\nLinz, Austria, 25 Feb 2000\n\nAdditional License(s)\n\nThe UPX license file is at http://upx.sourceforge.net/upx-license.html.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to Xfree86-VidMode Extension 1.0,\nwhich may be included with JRE 8, JDK 8, and OpenJDK 8 on Linux and Solaris.\n\n--- begin of LICENSE ---\n\nVersion 1.1 of XFree86 ProjectLicence.\n\nCopyright (C) 1994-2004 The XFree86 Project, Inc.    All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of\nthis software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicence, and/or sell\ncopies of the Software, and to permit persons to whom the Software is furnished\nto do so,subject to the following conditions:\n\n   1. Redistributions of source code must retain the above copyright\n   notice,this list of conditions, and the following disclaimer.\n\n   2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution, and in the same place\n   and form as other copyright, license and disclaimer information.\n\n   3. The end-user documentation included with the redistribution, if any,must\n   include the following acknowledgment: \"This product includes\n   software developed by The XFree86 Project, Inc (http://www.xfree86.org/) and\n   its contributors\", in the same place and form as other third-party\n   acknowledgments. Alternately, this acknowledgment may appear in the software\n   itself, in the same form and location as other such third-party\n   acknowledgments.\n\n    4. Except as contained in this notice, the name of The XFree86 Project,Inc\n    shall not be used in advertising or otherwise to promote the sale, use\n    or other dealings in this Software without prior written authorization from\n    The XFree86 Project, Inc.\n\n    THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED\n    WARRANTIES,INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO\n    EVENT SHALL THE XFREE86 PROJECT, INC OR ITS CONTRIBUTORS BE LIABLE FOR ANY\n    DIRECT, INDIRECT, INCIDENTAL,SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n    (INCLUDING, BUT NOT LIMITED TO,PROCUREMENT OF SUBSTITUTE GOODS OR\n    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n    CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n    OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n    DAMAGE.  \n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to xwd v1.0.7, which may be\nincluded with JRE 8, JDK 8, and OpenJDK 8 on Linux and Solaris.\n\nxwd utility\n\n--- begin of LICENSE ---\n\nCopyright 1994 Hewlett-Packard Co.\nCopyright 1996, 1998  The Open Group\n\nPermission to use, copy, modify, distribute, and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that\nthe above copyright notice appear in all copies and that both that\ncopyright notice and this permission notice appear in supporting\ndocumentation.\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE OPEN GROUP BE LIABLE FOR ANY CLAIM, DAMAGES OR\nOTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\nOTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of The Open Group shall\nnot be used in advertising or otherwise to promote the sale, use or\nother dealings in this Software without prior written authorization\nfrom The Open Group.\n\n--- end of LICENSE ---\n_____________________________\nCopyright notice for HPkeysym.h:\n/*\n\nCopyright 1987, 1998 The Open Group\n\nAll Rights Reserved.\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE OPEN GROUP BE LIABLE FOR ANY CLAIM, DAMAGES OR\nOTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,\nARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR\nOTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of The Open Group shall\nnot be used in advertising or otherwise to promote the sale, use or\nother dealings in this Software without prior written authorization\nfrom The Open Group.\n\nCopyright 1987 by Digital Equipment Corporation, Maynard, Massachusetts,\n\nAll Rights Reserved\n\nPermission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose and without fee is hereby granted,\nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in\nsupporting documentation, and that the names of Hewlett Packard\nor Digital not be\nused in advertising or publicity pertaining to distribution of the\nsoftware without specific, written prior permission.\n\nDIGITAL DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING\nALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL\nDIGITAL BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR\nANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\nWHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\nARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS\nSOFTWARE.\n\nHEWLETT-PACKARD MAKES NO WARRANTY OF ANY KIND WITH REGARD\nTO THIS SOFWARE, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE. Hewlett-Packard shall not be liable for errors\ncontained herein or direct, indirect, special, incidental or\nconsequential damages in connection with the furnishing,\nperformance, or use of this material.\n\n*/\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to zlib v1.3.1, which may be included\nwith JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\n  version 1.3.1, January 22, 2024\n\n  Copyright (C) 1995-2024 Jean-loup Gailly and Mark Adler\n\n  This software is provided 'as-is', without any express or implied\n  warranty.  In no event will the authors be held liable for any damages\n  arising from the use of this software.\n\n  Permission is granted to anyone to use this software for any purpose,\n  including commercial applications, and to alter it and redistribute it\n  freely, subject to the following restrictions:\n\n  1. The origin of this software must not be misrepresented; you must not\n     claim that you wrote the original software. If you use this software\n     in a product, an acknowledgment in the product documentation would be\n     appreciated but is not required.\n  2. Altered source versions must be plainly marked as such, and must not be\n     misrepresented as being the original software.\n  3. This notice may not be removed or altered from any source distribution.\n\n  Jean-loup Gailly        Mark Adler\n  jloup@gzip.org          madler@alumni.caltech.edu\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to the following which may be \nincluded with JRE 8, JDK 8, and OpenJDK 8.\n\n  Apache Commons Math 3.2\n  Apache Derby 10.11.1.2\n  Apache Jakarta BCEL 5.1 \n  Apache Santuario XML Security for Java 2.1.3\n  Apache Xalan-Java 2.7.2\n  Apache Xerces Java 2.10.0 \n  Apache XML Resolver 1.1 \n\n\n--- begin of LICENSE ---\n\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n\n%% This notice is provided with respect to OASIS PKCS #11 Cryptographic Token\nInterface v3.0,  which may be included with JRE 8, JDK 8, and OpenJDK 8.\n\n--- begin of LICENSE ---\n\nCopyright © OASIS Open 2020. All Rights Reserved.\n\n    All capitalized terms in the following text have the meanings\nassigned to them in the OASIS Intellectual Property Rights Policy (the\n\"OASIS IPR Policy\"). The full Policy may be found at the OASIS website:\n[http://www.oasis-open.org/policies-guidelines/ipr]\n\n    This document and translations of it may be copied and furnished to\nothers, and derivative works that comment on or otherwise explain it or\nassist in its implementation may be prepared, copied, published, and\ndistributed, in whole or in part, without restriction of any kind,\nprovided that the above copyright notice and this section are included\non all such copies and derivative works. However, this document itself\nmay not be modified in any way, including by removing the copyright\nnotice or references to OASIS, except as needed for the purpose of\ndeveloping any document or deliverable produced by an OASIS Technical\nCommittee (in which case the rules applicable to copyrights, as set\nforth in the OASIS IPR Policy, must be followed) or as required to\ntranslate it into languages other than English.\n\n    The limited permissions granted above are perpetual and will not be\nrevoked by OASIS or its successors or assigns.\n\n    This document and the information contained herein is provided on an\n\"AS IS\" basis and OASIS DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED,\nINCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE\nINFORMATION HEREIN WILL NOT INFRINGE ANY OWNERSHIP RIGHTS OR ANY IMPLIED\nWARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. OASIS\nAND ITS MEMBERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THIS DOCUMENT OR ANY\nPART THEREOF.\n\n    [OASIS requests that any OASIS Party or any other party that\nbelieves it has patent claims that would necessarily be infringed by\nimplementations of this OASIS Standards Final Deliverable, to notify\nOASIS TC Administrator and provide an indication of its willingness to\ngrant patent licenses to such patent claims in a manner consistent with\nthe IPR Mode of the OASIS Technical Committee that produced this\ndeliverable.]\n\n    [OASIS invites any party to contact the OASIS TC Administrator if it\nis aware of a claim of ownership of any patent claims that would\nnecessarily be infringed by implementations of this OASIS Standards\nFinal Deliverable by a patent holder that is not willing to provide a\nlicense to such patent claims in a manner consistent with the IPR Mode\nof the OASIS Technical Committee that produced this OASIS Standards\nFinal Deliverable. OASIS may include such claims on its website, but\ndisclaims any obligation to do so.]\n\n    [OASIS takes no position regarding the validity or scope of any\nintellectual property or other rights that might be claimed to pertain\nto the implementation or use of the technology described in this OASIS\nStandards Final Deliverable or the extent to which any license under\nsuch rights might or might not be available; neither does it represent\nthat it has made any effort to identify any such rights. Information on\nOASIS' procedures with respect to rights in any document or deliverable\nproduced by an OASIS Technical Committee can be found on the OASIS\nwebsite. Copies of claims of rights made available for publication and\nany assurances of licenses to be made available, or the result of an\nattempt made to obtain a general license or permission for the use of\nsuch proprietary rights by implementers or users of this OASIS Standards\nFinal Deliverable, can be obtained from the OASIS TC Administrator.\nOASIS makes no representation that any information or list of\nintellectual property rights will at any time be complete, or that any\nclaims in such list are, in fact, Essential Claims.]\n\n--- end of LICENSE ---\n\n-------------------------------------------------------------------------------\n"
        },
        {
          "name": "common",
          "type": "tree",
          "content": null
        },
        {
          "name": "configure",
          "type": "blob",
          "size": 1.55078125,
          "content": "#!/bin/bash\n#\n# Copyright (c) 2012, 2014, Oracle and/or its affiliates. All rights reserved.\n# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n#\n# This code is free software; you can redistribute it and/or modify it\n# under the terms of the GNU General Public License version 2 only, as\n# published by the Free Software Foundation.\n#\n# This code is distributed in the hope that it will be useful, but WITHOUT\n# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n# FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n# version 2 for more details (a copy is included in the LICENSE file that\n# accompanied this code).\n#\n# You should have received a copy of the GNU General Public License version\n# 2 along with this work; if not, write to the Free Software Foundation,\n# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n#\n# Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n# or visit www.oracle.com if you need additional information or have any\n# questions.\n#\n\n# This is a thin wrapper which will call the real configure script, and\n# make sure that is called using bash.\n\n# Get an absolute path to this script, since that determines the top-level directory.\nthis_script_dir=`dirname $0`\nthis_script_dir=`cd $this_script_dir > /dev/null && pwd`\n\n# Delegate to wrapper, forcing wrapper to believe $0 is this script by using -c.\n# This trick is needed to get autoconf to co-operate properly.\nbash -c \". $this_script_dir/common/autoconf/configure\" $this_script_dir/configure CHECKME $this_script_dir \"$@\"\n"
        },
        {
          "name": "corba",
          "type": "tree",
          "content": null
        },
        {
          "name": "doc",
          "type": "tree",
          "content": null
        },
        {
          "name": "dragonwell_version",
          "type": "blob",
          "size": 1.0556640625,
          "content": "#\n# Copyright (c) 2020 Alibaba Group Holding Limited. All Rights Reserved.\n# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n#\n# This code is free software; you can redistribute it and/or modify it\n# under the terms of the GNU General Public License version 2 only, as\n# published by the Free Software Foundation. Alibaba designates this\n# particular file as subject to the \"Classpath\" exception as provided\n# by Oracle in the LICENSE file that accompanied this code.\n#\n# This code is distributed in the hope that it will be useful, but WITHOUT\n# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n# FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License\n# version 2 for more details (a copy is included in the LICENSE file that\n# accompanied this code).\n#\n# You should have received a copy of the GNU General Public License version\n# 2 along with this work; if not, write to the Free Software Foundation,\n# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n#\n\nDRAGONWELL_VERSION=8.20.21\nDRAGONWELL_JDK_UPDATE_VERSION=422\n"
        },
        {
          "name": "hotspot",
          "type": "tree",
          "content": null
        },
        {
          "name": "jaxp",
          "type": "tree",
          "content": null
        },
        {
          "name": "jaxws",
          "type": "tree",
          "content": null
        },
        {
          "name": "jdk",
          "type": "tree",
          "content": null
        },
        {
          "name": "langtools",
          "type": "tree",
          "content": null
        },
        {
          "name": "make.sh",
          "type": "blob",
          "size": 4.26171875,
          "content": "#!/bin/bash\n# build properties\n#\n# Copyright (c) 2019 Alibaba Group Holding Limited. All Rights Reserved.\n# DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n#\n# This code is free software; you can redistribute it and/or modify it\n# under the terms of the GNU General Public License version 2 only, as\n# published by the Free Software Foundation. Alibaba designates this\n# particular file as subject to the \"Classpath\" exception as provided\n# by Oracle in the LICENSE file that accompanied this code.\n#\n# This code is distributed in the hope that it will be useful, but WITHOUT\n# ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n# FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License\n# version 2 for more details (a copy is included in the LICENSE file that\n# accompanied this code).\n#\n# You should have received a copy of the GNU General Public License version\n# 2 along with this work; if not, write to the Free Software Foundation,\n# Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n#\n\nif [ ! -f \"dragonwell_version\" ]; then\n\techo \"File 'dragonwell_version' doesn't exist!\"\n\texit 1;\nfi\nsource ./dragonwell_version\n\n\nif [ $# -lt 1 ]; then\n  echo \"USAGE: $0 release/debug/fastdebug\"\nfi\n\nARCH=$(uname -m)\nif [ \"x\"$ARCH = 'xx86_64' ]; then\n  ARCH_DIR=\"amd64\"\nelif [ \"x\"$ARCH = 'xaarch64' ]; then\n  ARCH_DIR=\"aarch64\"\nelse\n  echo \"Unrecognized architecture: ${ARCH}\"\n  exit 1\nfi\n\n\nLC_ALL=C\nBUILD_MODE=$1\n\ncase \"$BUILD_MODE\" in\n    release)\n        DEBUG_LEVEL=\"release\"\n        JDK_IMAGES_DIR=$(pwd)/build/linux-${ARCH}-normal-server-release/images\n    ;;\n    debug)\n        DEBUG_LEVEL=\"slowdebug\"\n        JDK_IMAGES_DIR=$(pwd)/build/linux-${ARCH}-normal-server-slowdebug/images\n    ;;\n    fastdebug)\n\tDEBUG_LEVEL=\"fastdebug\"\n\tJDK_IMAGES_DIR=$(pwd)/build/linux-${ARCH}-normal-server-fastdebug/images\n    ;;\n    *)\n        echo \"Argument must be release or debug or fastdebug!\"\n        exit 1\n    ;;\nesac\n\nNEW_JAVA_HOME=$JDK_IMAGES_DIR/j2sdk-image\nNEW_JRE_HOME=$JDK_IMAGES_DIR/j2re-image\n\n\\rm -rf build\n\nif [ -z \"$BUILD_NUMBER\" ]; then\n  BUILD_INDEX=b00\nelse\n  BUILD_INDEX=b$BUILD_NUMBER\nfi\n\nDISTRO_VERSION=${DRAGONWELL_VERSION}\n\nshift\n\nbash ./configure --with-milestone=fcs \\\n                 --with-build-number=${BUILD_INDEX} \\\n                 --with-user-release-suffix=\"\" \\\n                 --enable-unlimited-crypto \\\n                 --with-cacerts-file=$(pwd)/common/security/cacerts \\\n                 --with-jvm-variants=server \\\n                 --with-debug-level=$DEBUG_LEVEL \\\n                 --with-zlib=system $*\nmake clean\n\n# The default DISTRO_VERSION in spec.gmk.in does not contain the customer defined build number.\n# Hack DISTRO_VERSION to introduce the number.\nmake LOG=debug DISTRO_VERSION=${DISTRO_VERSION} images\n\n# Sanity tests\nJAVA_EXES=(\"$NEW_JAVA_HOME/bin/java\" \"$NEW_JAVA_HOME/jre/bin/java\" \"$NEW_JRE_HOME/bin/java\")\nVERSION_OPTS=(\"-version\" \"-Xinternalversion\" \"-fullversion\")\nfor exe in \"${JAVA_EXES[@]}\"; do\n  for opt in \"${VERSION_OPTS[@]}\"; do\n    $exe $opt > /dev/null 2>&1\n    if [ 0 -ne $? ]; then\n      echo \"Failed: $exe $opt\"\n      exit 128\n    fi\n  done\ndone\n\n# Keep old output\n$NEW_JAVA_HOME/bin/java -version\n\ncat > /tmp/systemProperty.java << EOF\npublic class systemProperty {\n    public static void main(String[] args) {\n        System.getProperties().list(System.out);\n    }\n}\nEOF\n\n$NEW_JAVA_HOME/bin/javac /tmp/systemProperty.java\n$NEW_JAVA_HOME/bin/java -cp /tmp/ systemProperty > /tmp/systemProperty.out\n\nEXPECTED_PATTERN=('^java\\.vm\\.vendor\\=.*Alibaba.*$'\n                '^java\\.vendor\\.url\\=http\\:\\/\\/www\\.alibabagroup\\.com$'\n                '^java\\.vendor\\=Alibaba$'\n                '^java\\.vendor\\.url\\.bug\\=mailto\\:dragonwell_use@googlegroups\\.com$')\nRET=0\nfor p in ${EXPECTED_PATTERN[*]}\ndo\n    cat /tmp/systemProperty.out | grep \"$p\"\n    if [ 0 != $? ]; then RET=1; fi\ndone\n\n\\rm -f /tmp/systemProperty*\n\n# check version string\n$NEW_JAVA_HOME/bin/java -version > /tmp/version.out 2>&1\ngrep \"^OpenJDK Runtime\" /tmp/version.out | grep \"(Alibaba Dragonwell $DISTRO_VERSION)\"\nif [ 0 != $? ]; then RET=1; fi\ngrep \"^OpenJDK .*VM\" /tmp/version.out | grep \"(Alibaba Dragonwell $DISTRO_VERSION)\"\nif [ 0 != $? ]; then RET=1; fi\n\\rm -f /tmp/version.out\n\nldd $NEW_JAVA_HOME/jre/lib/${ARCH_DIR}/libzip.so|grep libz\nif [ 0 != $? ]; then RET=1; fi\n\nexit $RET\n"
        },
        {
          "name": "make",
          "type": "tree",
          "content": null
        },
        {
          "name": "nashorn",
          "type": "tree",
          "content": null
        },
        {
          "name": "test",
          "type": "tree",
          "content": null
        },
        {
          "name": "version.txt",
          "type": "blob",
          "size": 0.0185546875,
          "content": "8.422.8.20.21.01-GA"
        }
      ]
    }
  ]
}